{
  "bA6sFAZTIc5ddwpnB_WJUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gil S.", 
    "review_text": "This place is fun and inviting as a local, but if I were a sleepless business traveler prowling in a disreputable direction south of Union Square on a late weeknight this would be a godsend, what I was looking for to stay out of trouble. The pluses, which are minuses if you like everything nice and tidy, include:  * A large raised stage, amplification, bands wailing on trombones and trumpets straight into the face of the audience a few feet away * Not a whole lot of service, on slow nights you go to the bar and order * It's not fancy, but very dark, very red, and full of brick walls, paintings, atmosphere * Haphazard, sparse, random furniture... but this means you can show up with a group of ten and have a conversation between numbers * People applaud every song, the more the band wails the more they applaid  If you're used to East Coast jazz clubs, here is what San Francisco has in store for you:  * No cover, no pressure,  no drink minimum, no seating rules, no tip jar, just show up.  How do we do it?  We must be stoned, and we're not in it for the money. * A small but good selection of very good craft beers, real strong drinks, courteous bartenders who know what they're doing * Regular happy hour, and late night happy hour 12-2.  After 2 it's illegal, but it's 5 in New York so you can pretend.  A couple blocks away there are restaurants open until 4, this is the latest neighborhood in the city.", 
    "review_date": "2010-11-02"
  }, 
  "gyDHwy25TRvxCDyT_n-3lw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kimhouy T.", 
    "review_text": "This place is a block away from the Powell Street BART station, which is awesome... unless you missed the last train because you were so busy enjoying the late night happy hour (whoops!).   Great music- there was a folk/bluegrass/tango(?) trio the night I went. Although there was no cover, the band did pass around a tip jar, which was strange.   There was a pretty good beer and wine selection- some items were bargains ($5 for an Allagash? Hell yes!)  while other items were somewhat overpriced ($10 for a mediocre glass of wine? Hell no!). Have yet to try the food, but it looked pretty tasty.   Overall, it was a solid first visit and I would go back to check out the other musical acts. The bartender mentioned that there is sometimes improv as well, so I think management is still trying to get a feel for who their clientele is.", 
    "review_date": "2011-05-29"
  }, 
  "M4qUfMaErHUpTHp8Gr7aiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelesa S.", 
    "review_text": "I love this new little venue tucked between the Warfield and the Westfield center.  It has an amazing wine list, an eclectic beer selecton and, most importantly, a swank coziness befitting of a neighborhood artist hang out.  They have a Jazz Jam every Sunday that I would recommend to anyone who claims to be a fan of the genre...and their happy hour is MIDNIGHT to 2AM!  How can you beat that?!  This is hands down my new favorite destination for live music and fantastic vino.", 
    "review_date": "2011-01-18"
  }, 
  "06MYZKIGlq31AxgHQmSSAQ": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Juanito L.", 
    "review_text": "I speak perfect (native) English in a clear voice, and I recognize that the place is busy. I don't think it's unreasonable to approach a bartender and say \"Hey, I don't recognize the beers you have on tap. Do you have something like a Hefeweizen?\" Nor do I expect to be treated like a bitch for preferring cider to a Pilsner. Then, after serving me cider in a stein FULL OF ICE, you try to shame me for not tipping? No, no. No.", 
    "review_date": "2011-11-06"
  }, 
  "7kyy79uXeNO3tUDE3kg-8w": {
    "user_rating": 5.0, 
    "user_location": "Novato, CA", 
    "user_name": "Chino S.", 
    "review_text": "This is a great place to relax and lounge around with a good craft beer or glass of wine.    I went here after my cousin's wedding and it's just what we needed.  We partied pretty hard at the wedding and this was the perfect place to chill.    This place had live music, which was awesome.  They were first blasting reggae music, which was great, until their neighbors complained about the noise and they had to turn the volume down.  It was all good because a few of the members just started jamming and freestyling.    The songs were very entertaining and amusing.  One song was something like, \"when i think of you, I have to change the sheets the next morning.\"  It was awesome. haha.  They also have a great selection of craft beers.  I'm a big beer person and don't believe in fizzy yellow beer.  They had one of my favorite beers, Speakeasy's Payback Porter, very delicious.  They also had Goose Island, Moylans, and a few others.  They also serve wine, but that's not my drink of choice.  Prices were very reasonable and there's more than enough sitting and lounging space for you and all the homies.  Check the place out if you feel like going out, but not wilding out at a club.", 
    "review_date": "2011-02-15"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "When Mikkeller Bar is too crowded...this is your oasis (and even if it's not crowded. Just leave your bikes on the rack outside Mikkeller). Lots of dang good live music. Get the Widmer Brother's Upheaval IPA on tap. Chat with the nice bartender. Use the clean bathrooms. Enjoy it.", 
    "review_date": "2014-06-04"
  }, 
  "HugLiTQaLZNaheouKRGfZA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Celeste I.", 
    "review_text": "I played a show here on Wednesday, July 13th.   The bar, the atmosphere, the sound system, even the bathrooms - everything was top notch.    I kept telling my friends that weren't able to make it out that this place was low key but super chic - kind of like a fancy lounge interbred with the intimacy of your rich friend's open living room space full of chaise chairs, couches, and tables for two.    I can't rave enough.  I love this place, it's now my venue of choice as far as performing and a definite go to spot to hang out with friends for a drink after a hard day's work.", 
    "review_date": "2011-07-16"
  }, 
  "69Y8T1cZoaZJKSYL9DsGGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cass L.", 
    "review_text": "I was practically raised with the love for singing. My parents had karaoke machines in our homes from when I was but a wee one all the way 'til I mved away for college, but I hadn't really done any  serious singing for public consumption since the end of high school. I still loved to sing but the idea of singing in public had over time become more and more daunting. This changed when my friend invited me to karaoke night a couple of weeks ago.  To start, the KJ (that's karaoke jockey for the uninitiated) Dana was super friendly and fun. She was engaging, fun, friendly, and a pretty good singer in her own right. She kept the crowd engaged and excited throughout the night. The crowd was full of different sorts of folks. Some were really good singers. Intimidatingly so! Some were...really enthusiastic, and some used the stage  for differnt types of performance art (like the two guys who did \"Chop Suey\" last night. Only one of them sang the whole time. The other guuy just stood there until the last two mins when he broke into interpretive dance). Overall, the people who go seem really friendly and justt really out to have a fun night. Sometimes the idea of singing in public ccan be really nerve racking. Such a light-hearted atmosphere really helps llighten up the mood.  The staff there are really friendly too. Everyone from the bartenders to he bouncer are really cool, yet still courteous and professional. As someone who doesn't drink and who can often be a bit shy, bars can often be a difficult place for me to socialize and have fun but I was able to at this placee.  If you're looking for a fun, light-hearted, maybe a teeny bity gutsy way to spend a weekend evening, this place is worth checking out!", 
    "review_date": "2014-02-17"
  }, 
  "8DNiwBb0__aB3WehK4JYCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stefanie L.", 
    "review_text": "Okay, so this place is at the intersection of Hold Onto Your Purse and That Was Definitely A Homeless Guy Peeing but, you know what? This is San Francisco. You have to get used to stuff like that. Besides, the inside is basically the opposite of the outside.  50 Mason is one of those rare nice bars that serves nice drinks and appetizers without seeming all uppity and pretentious about it. The decorations are beautiful but not ornately elitist, the seating is varied (booth-style for groups, small tables for singles and couples, far from the stage, close to the stage, etc) and it's big enough that you can actually get up and walk to the bathroom without tripping over anyone. In fact, it's less bar and more lounge. There's also a stage for live performances, well-located at the back of the establishment but sort of awkwardly shaped. In any case: A nice little gem in the TL.", 
    "review_date": "2011-02-26"
  }, 
  "LAwptwS7nJwPkV5Niy9jkg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff H.", 
    "review_text": "stopped in for happy hour on a Wednesday night.  at 5:45 it was really quiet with only a few patrons but they still had a performer up on the stage - a young Bob Dylan / Paul Simon playing his guitar and singing.  The service was quite friendly, the happy hour prices quite reasonable.  Note - it is only beer and wine.  The \"cocktails\" are made with those, not spirits.  Very good selection of beer, ok selection of wine - but they were out of several when we were there and only had 2 reds in stock.  That needs to be fixed oif only a beer &amp; wine place.  Interesting section of art work on the walls that rotates every 2 months.  Most (but not all) are for sale if interested.  Seats at tables are very comfortable.  At there bar there are backless stools and a few tall chairs with metal backs (with camel cutouts in them).  While cool looking, they are very wobbly and clearly in need of repair.  I can see someone wobbling on one of them and falling over after a few beers.  The place had a musty, dusty, mildewy smell to it.  Once or twice during our short time there I actually had to cough from what felt like a mouthful of dust.  They need a couple heavy duty air cleaners in there.  The area is pretty sketchy - so don't plan on driving and parking near.  But in these days of Uber/Flywheel/etc. why drive anyway.  Also note that it is a bar - so 21 and older only.  I'd go back to hear a band in the evening.", 
    "review_date": "2014-07-17"
  }, 
  "OnFVuSyFNX_f0C606KXH7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy S.", 
    "review_text": "Saw a great band here on Friday, the staff was uber friendly and you can't beat the post midnight happy hour! I will definitely be back!", 
    "review_date": "2012-03-26"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 5.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "You can't miss out on the opportunity to see open mic Mondays. Fantastic up-and-coming solo artists, bands, and comedians. I had the pleasure of hanging out this Labor Day for the first time and had a fun-filled evening. Whether you're a musician trying to gain exposure or a patron in the mood for some wine and a free show, this is the place to be. I plan to be back soon.", 
    "review_date": "2011-09-07"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "50 Mason is inconveniently but excitingly located 4 blocks from my gym and ballet studio. Inconvenient because I can burn 600 calories and perfect my form before consuming 700 calories in wine and Trumer...Convenient because after a day full of a total of 5 hours of working out and dance classes, I REALLY need a drink or 3.   Avoid Open Mic nights (Mondays) at all costs. Really- these are not mentally sound people for the most part, with the exception of the one girl who had a really sweet voice but impeded conversation with my companions nonetheless...  I really like the bartender, I really like the scene, and I really like the overall vibe and what they've done with the place as well as the location. This is a joint I can walk into in my dance gear and workout gear just as comfortably as I can in a minidress and heels. I like that in a place.   My only qualms are that the wine is a bit steep and the fact that they have an open mic night, although it did seem to draw a bigger crowd than usual. The people working the bar, however, and the sweet as pie yet intimidating-enough-to-make-me-feel-safe door man are super cool, though, and make it well worth the visit. Beer's reasonably priced and it's a great space for a big group. These guys need more visitors, you really ought to give it a try.", 
    "review_date": "2011-01-11"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "I liked this place, comfy seating, dark lighting, small stage, sort of in an unlikely location. Saw my friend perform in Moonlighting. The one negative is we wanted the DJ to play 80's music - she said she didn't have any, and then played some. We ordered a hard drink - they said they were only serving beer and wine - we saw others with hard liquor, and then got some. So, other than the lies, this place ROCKS!", 
    "review_date": "2013-11-01"
  }, 
  "FwBn7dKEsJumq-zse7AQSA": {
    "user_rating": 4.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Rachel F.", 
    "review_text": "What a gem! Small, cozy, casual bar with live music. My friend and I found this place on yelp and were so pleasantly surprised. Good house wine and great music. Not stuffy or formal.", 
    "review_date": "2012-07-13"
  }, 
  "AO21iJAApF7mIfB6YetjOA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "eric i.", 
    "review_text": "Not a good place to play if you are a serious professional artist / musician.  Every time I've brought my band here loading in has a pain in the ass, because there is NOWHERE to put your equipment.  There is NO sound person, just the owner who is moody and difficult, and he will make no actual effort run the sound board.  Need your monitor turned up?  Too bad, he's already tuned out and sitting at his laptop in the back of the venue.  Oh, and don't expect to get paid.  This place is barely a step up from open mics, I don't know why I thought it would be different this last time...  You're worth more than getting comped two Kirin beer cans.  How this place continues to operate is beyond me...", 
    "review_date": "2014-10-03"
  }, 
  "g63z39swd7ViHYsQXrFqiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicholas P.", 
    "review_text": "My first visit to this club was last night, Eric McFadden and Ed Ivey played a great 2 sets. Definitely enjoyed the vibe, cold beer, and Live Music! I think it would be a great pre/post show destination for Warfield concert patrons.", 
    "review_date": "2011-01-18"
  }, 
  "HrVfgxaDGv6U9NfKSTsjFQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Lawrence C.", 
    "review_text": "Really awesome venue.  I came here one night to watch a performance put on by the Society.  50 Mason has an awesome intimate vibe for small performances.  There's a friendly neighborhood feel to the bar with great bartenders who are nothing but nice.  The furniture is cozy and comfortable and there's typically plenty of space to feel comfortable in.", 
    "review_date": "2011-01-09"
  }, 
  "5S0hrlXyoHLIWs0rcyMUfA": {
    "user_rating": 5.0, 
    "user_location": "Kirkland, WA", 
    "user_name": "Natarajan S.", 
    "review_text": "Live blues music on a tuesday night!!!! The place was not crowded at all and the people were nice and the drinks were well priced. It has become one of my fav SOMA bars for a weeknight.", 
    "review_date": "2014-05-29"
  }, 
  "DdjcS4uvWT4ec8o6XVexQQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Kenny C.", 
    "review_text": "Came here to watch George Lacson Project perform. Great place to chill and listen to some live music. Bouncer and workers were nice. Only wine and craft beers. Something different for me since im into hard alcohol. But really loved this one type of beer..strong and thick..  Resonable prices.", 
    "review_date": "2011-03-14"
  }, 
  "P9Y602xjKtSXwU72EwrMGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer R.", 
    "review_text": "I love the fact that they have some real exciting beers here, yes its only a Beer &amp; wine license they have I think, but at least they make up for it with one of the best beer selections that rivals many wine selections I have seen in this city. Added to that the nightly Live entertainment it certainly takes us out of the neighbor hood that we are unfortunately in, however places like this improve it greatly. Change is slow but you can see this hood in a year being the hood to go out in.", 
    "review_date": "2011-03-31"
  }, 
  "AQI75Bk_9FNK4A-uRRUXQw": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Victoria L.", 
    "review_text": "Location aside, not coming back. Terrible, rude service from the bartenders. Expensive drinks, had ran out of most beers, beer my friend paid 10 bucks for was flat. I'm giving them 2 stars because their wine is very, very good. Service is just bad.", 
    "review_date": "2013-08-06"
  }, 
  "8J5gkxtQPyZcG_JFzqgQUw": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Kelly G.", 
    "review_text": "This is a cool little place. I came here to watch my friend's band perform and I was really digging the vibe.  It's small and quaint, with random art and furniture. It was hard to listen to the music in there because it's such a small place and the music was so loud it was giving me a bit of a headache. But otherwise, it's a cool palce to check out! Full bar of course.", 
    "review_date": "2014-09-08"
  }, 
  "xT5e3qrj7K2s8H_qQxUyIg": {
    "user_rating": 5.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "Deborah Y.", 
    "review_text": "Great new venue supporting live music and comedy.  Check this place out - even on weeknights, it's a great place to go.  No cover !", 
    "review_date": "2011-09-15"
  }, 
  "zRU7MOe-x0bC9TNc6aQpGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott A.", 
    "review_text": "Great new venue for live music and relaxing.  It is more of a bar/lounge/music location.  Great staff, Ericka and Krista, and sound with tasteful decor.  It had the feel of a NYC lounge to me.  A huge upswing for this neighborhood and town.  So far I love it.  Nice selection of wines and beers only.  There will be live music here 7 days a week with no cover.  Great free music in a classy environment.  What more could one ask for?!! B-Side Karaoke hosted karaoke here a couple of times and the sound quality is great, as was the KJ.  Hope you can come some time in the future.", 
    "review_date": "2010-11-19"
  }, 
  "R8dJr3b2SdELGIKkrzwD4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liri R.", 
    "review_text": "This place is solid! The bartenders are really nice, the space is comfortable, you can get close on a couch and listen to live music, or watch the street show unfold out the window. Good vibe. Great beer.", 
    "review_date": "2011-07-18"
  }, 
  "quYzRj4JZ4OkybYyKNV3oQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashish C.", 
    "review_text": "Although the neighborhood is a little shady but the place is amazing with one of the best bands playing every night, A must go for Rock,Jazz and Blues Lovers. Staff is very welcoming and Beers are special. Ambiance is dark and soothing. Don't miss it and especially the hideout lovers !", 
    "review_date": "2011-06-06"
  }, 
  "_o8rK6C2VsTSVJASxtAABg": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Shari S.", 
    "review_text": "Really beautiful atmosphere. Bar meets lounge. Great management &amp; bartenders. This venue is perfect for a few friends grabbing drinks, a large group, or post-date drinks. If you visit this place you will not be dissappointed.  P.S. there is an indian buffet a few blocks up Mason that is open until 4am!!!", 
    "review_date": "2012-01-07"
  }, 
  "_uwuKDqYXnTM2qrpcs3P2w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sylvia K.", 
    "review_text": "This is a super cool venue to hear music! I've been here a couple of times to check out the local band that my friend plays for. Some of the acts I've seen in this intimate setting are amazingly talented. The decor/atmosphere of the area closest to the entrance has got a few tables and a couple of black leather couches with a rug and a faux fireplace, which makes me feel like I'm in someone's living room. There are a few more tables and leather chairs closer to the stage. They've got beer on tap and have $2 kirin and trumer in a can for happy hour, which I think is from 5-7. There's not much of a food menu. This venue is also in the tenderloin, at the edge of it, so there are a lot of homeless on the street (so be careful!). So outside it feels a little unsafe, but inside it's a totally different world full of hipsters listening to good music and drinking beer!", 
    "review_date": "2013-05-19"
  }, 
  "7_vWkFSeVR3M6HvV0XMg3w": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Audrey F.", 
    "review_text": "50 Mason is such a cool place to listen to music!   Great staff and cool vibe.   Easy parking across the street, too!    Went to see a band called \"BLIND VENETIANS\" last weekend.  They totally rocked!    They played two sets of endless great music, and had the crowd up dancing!   Great rapport with the audience, fantastic vocals and bass!  You will absolutely love them!  Hope they come back to 50 Mason very soon!", 
    "review_date": "2013-06-06"
  }, 
  "jOZheuOkUGKp4htT0xHIlA": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Erin S.", 
    "review_text": "The last time I visited this location there was an after hours club downstairs (maybe it's still there? I doubt it). It was kinda cool, kinda creepy with lots of beds &amp; couches &amp; people doing strange things in the bathrooms. Now, there's a cool hangout spot upstairs with live music. A big improvement!   The first reason to knock off a star was that they advertise that they open at 5 &amp; have happy hour. Well, we tried to go in at around 5:15 last Thursday night &amp; they weren't open. We just wanted to get a few drinks before an event at the Warfield &amp; this seemed like the perfect spot, plus I love checking out new HH spots. Oh well. We vowed to return later that night.   So whatever time it was after the event ended (I'd had a few by then), we came back. There was a band playing &amp; a few people were seated on couches enjoying the music. We weren't really there for the music, nothing against the band or anything but we just wanted a drink &amp; a spot to hang out before heading home for the night. We sat near the front, away from the band &amp; chatted while we had our drinks. Maybe we were too loud? I dunno (as I said, I'd had a few) but I think the band was annoyed by us. So we finished our drinks &amp; left.   I would definitely come back since this seems like a chill spot to lounge around &amp; have some drinks. It's a welcoming place on a stretch of street that is less than desirable.", 
    "review_date": "2010-12-09"
  }, 
  "fAE6EkeGE-pifzjqo0NyQg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles L.", 
    "review_text": "Stopped in here last night to see my friend's band play a gig. I remember being here with friends about two-or-so years ago, but that was under normal circumstances.  As a redesigned Tenderloin building, they have to work around the building's construction for their aesthetic. I bring this up because it's one of the many SF bar venues where you have to sit at the right angle, lest a pillar block your view of the stage.  The drinks, moderately-priced, are good. Everything comes in a glass specifically designed for it. I didn't have time to try the snacks this particular evening, but I enjoyed having my drinks in my incredibly comfortable seat. I'm not kidding - they spent good money on the cushioned seats and I could have sat in one of the leather ones forever. Hell, I thought of walking out of there with one. (Just kidding... they're too heavy for one person to move on his own).  Though you can only talk in raised voices most of the time (even when a band isn't playing), it's a relatively mellow place to stop in for a drink. They have a wide selection of international beers and wines; they welcome an eclectic roster of musicians; they cater to a diverse clientele. If you stop by, there's sure to be something there that you'll like.", 
    "review_date": "2014-03-05"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "Came for No Name Arts Collective and live music. Had a nice beer and checked out some of the art on the walls. Some of it was pretty good! Lots of seating as well as space to stand.   We didn't stay too long because it was pretty loud in the bar but the music we did hear was great--definitely some talented musicians come through here.  I'll definitely be back!", 
    "review_date": "2015-01-19"
  }, 
  "8tUCriAQf4l-QrOkQWacAw": {
    "user_rating": 5.0, 
    "user_location": "Manteca, CA", 
    "user_name": "Jaci G.", 
    "review_text": "My husband and I went to a comedy show here by Narcissists Anonymous (fantastic by the way, if you have a chance to see this crew - by all means do!)  Anyway, the club is a hidden gem - wine and beer only but what a selection!  They'll let you taste before you order.  Low key - cool vibe - cash only - but they have an atm in the club to ease the pain.  Will go back again.  Great place to have a conversation relax and chill.  50 Mason you are great!  A gem in the Tenderloin!", 
    "review_date": "2011-08-21"
  }, 
  "dYbIkLXPSXDpq8ZhKSmNeg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Stephen C.", 
    "review_text": "Great little venue for local, live music.  The setting is intimate, relaxed and the sound is well mixed.  Parking is kind of tough and it is in the Tenderloin so keep an eye out for undesirable characters skulking about.", 
    "review_date": "2012-07-29"
  }, 
  "eHNP_CtIPjp_pZeh6DtukA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josie C.", 
    "review_text": "This review is for the free comedy show with free pizza. Get there early for good seats and prepare for some laughter. It's a pretty cool space and hello it's free!", 
    "review_date": "2014-04-16"
  }, 
  "eVfnC_KZ-zTKv2Muh_N2fw": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Jacquelynne O.", 
    "review_text": "I just love this Tenderloin lounge. Its difficult to find a place downtown where a woman can go by herself for a nice, quiet glass of red wine after work. I found this gorgeous club bar while wandering the streets one evening, avoiding the shadiness and attempting to find somewhere I wouldn't get hassled by middle-aged men with nothing better to do.   I spotted the neon sign and the words happy hour written in glow marker from across the street and passed by to take a peak. Nice corner stage with live music that starts at 8pm, gorgeous leather lounge furniture and a huge bar to sit at. There were about 6 other young people, in couples or alone so I decided to go in. The cute bartender Jordan was super friendly right off the bat and announced I had two minutes to the end of happy hour so which would I like to drink? I chanced the Zin which was excellent for a house wine and had a wonderful conversation with him about living in the city. The other patrons where also very nice, everyone finally getting into conversation with eachother. I really recommend this place, and the prices are fair for being downtown. I wish them the best of luck! (the Tenderloin could really use some chicness once in a while to draw in young people) PS. Cash only but there's an ATM at the door", 
    "review_date": "2010-10-05"
  }, 
  "TlcOomCmGcPc6u-HzOq4dg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay M.", 
    "review_text": "We were coming back from Ahn Sushi and Soju around the corner (review here: <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F44lfz78&amp;s=e8c13f7b0e055656612ebcbdd23e34a34e9e68ee06638ab80415312b1b8bff91\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/44lfz78</a>) and heard some great live funk music coming from 50 Mason. No cover on a Friday, so we went to listen for a bit:  + excellent beer on tap, good but pricey wine list, snacks looked good... + great live music + super chill and welcoming - mixed, friendly, mellow crowd + fantastic lounge-y area with great lighting that equally well accommodates groups, intimate seating for couples, solo folks looking for a beer and some music.  I'm sure the crowd changes depending on who's on stage, but we felt super welcome, enjoyed the vibe and will be back!", 
    "review_date": "2011-08-11"
  }, 
  "D4JHDISAtHlnaHf4jtvj8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie L.", 
    "review_text": "I came here for a show on a Thursday night and it was a lot nicer of a place then I was expecting. The place was packed. The area is a bit sketch I'll be honest. It's practically the TL here. However, the place is pretty good. There's plenty of seating and happy hour. They didn't have my per usual beers I enjoy. For example, I ordered a Stella  because the first time I order a drink, they didn't carry it, but I was sure they would carry this because their glasses said Stella. I was wrong. Oh so wrong. They gave me a substitute... like I thought I couldn't go wrong. I like the decor in the place and service was alright.", 
    "review_date": "2014-02-24"
  }, 
  "Ihal3GD6lo3RtbysJ3sYvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob K.", 
    "review_text": "I was pleasantly surprised when I went in to check out this bar &amp; lounge. What initially caught my attention was the live acoustic music they had going on and the cozy vibe that came from the venue. My friend and I were just passing by on a night of bar hopping when we heard the music echoing out of this dimly lit social house and decided to check it out while we waited for the bus.  We ended up staying for multiple drinks and talked story with the workers and bar tenders who were all very friendly. The spot also has nightly happy hours and nightly live music which is a big plus when looking for places to hang out without breaking the bank. Overall 50 Mason offers a very pleasant experience for all kinds of people whether your looking for a place to cruise with a bunch friends or a quiet spot that you can go to relax after a long day.", 
    "review_date": "2010-10-07"
  }, 
  "erlgDI-kdW9LTJHVx13veQ": {
    "user_rating": 2.0, 
    "user_location": "South Berkeley, Berkeley, CA", 
    "user_name": "Allyson L.", 
    "review_text": "Mediocre bar. Terrible service. They use an iPad for all transactions causing for embarrassingly slow service. Not to mention a bartender working avoided me every time I went to order something. They don't carry liquor just wine and beer! Ordered an IPA on draft thinking it wouldn't cost more than a mixed drink (most are $5) and was charged $6! Stick to the canned beer for $3 (Kirin Ichiban) Friendly security/door guy though. Decent atmosphere.", 
    "review_date": "2012-12-23"
  }, 
  "bW2LMBS-D-qAgXfpeof3UQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina S.", 
    "review_text": "Cool place! But the area is sketchy!!  Once you're inside, you're ok.  I like it here because they support musicians and artists. On Mondays, they have open mic nights.  Musicians till 10pm and then stand up comedians. They only serve beer and wine, but they offer food!  They let you taste the different beers they have which is a lot of ones from all over the world and honestly, some I've never heard of.  But the bartender, Jordan, was super nice and I think made the bad comedians bearable.  We ordered the charcuterie and cheese plates.  The crostini they served was delicious! One of the best, in the city.  I think its slathered with lots of butter or oil, but so tasty.  I should've ordered some wine because it would go better with it, but it was still good!  If I am ever around the area again I would definitely go back here.  Hats off to Jordan!", 
    "review_date": "2011-12-15"
  }, 
  "oO6JdiPLnD1qWnmxb5CjhQ": {
    "user_rating": 4.0, 
    "user_location": "Palmdale, CA", 
    "user_name": "Sjw-rx W.", 
    "review_text": "Cozy and great! I absolutely loved this quaint spot. Great for local bands. The neighborhood and parking is why I give it 4/5 stars.", 
    "review_date": "2012-12-05"
  }, 
  "LdyVNZyPl6vR0THDPw5zIQ": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Lauren S.", 
    "review_text": "I like how this place has live music every night and it's got a great set up inside. I've gone through to this place for the late night happy hour from 12-2...and it's definitely nice when you're out in the area looking for a cheap draft. There are always plenty of places to sit and it's a good spot to bring big groups.", 
    "review_date": "2010-09-26"
  }, 
  "lyhFusBMpqNSiuflSGUg9A": {
    "user_rating": 2.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Zach H.", 
    "review_text": "Let me put it this way:  The music: great The overall feel of the place: great The bartenders: very friendly How long it took to get a drink in a not-very-crowded bar: 45 minutes!", 
    "review_date": "2013-08-31"
  }, 
  "FgGiQc9zpM_va5JZMvJtMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea B.", 
    "review_text": "They play the Jimmy Hendrix loudly, they turn the lights down until long legged, skinny jeans wearing bearded men back up into your table and knock over your beer, they have live music/comedy from upcoming artists, and they hang the visual artwork of local San Francisco artists. I know he knocked over my beer, but he bought me a new one and ran away like he should have, so this entire combination works for me.   Despite the fact that it's on an unpredictable seed-pit/unhinged catwalk of a block, the atmosphere inside is great. Enjoy your beer or wine in an open space with plenty of seating, and listen to great local artists jam out on a small stage. It has a lovely intimacy, so go with a group of 2-5 friends and you'll have a great time. They recently started having art shows alongside live music, so what more could you want?", 
    "review_date": "2014-03-11"
  }, 
  "vKLG_FjnH27dMtClfmk9Ug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa Y.", 
    "review_text": "It's hard to justify spending time at mediocre bars given the wide selection you have in a city like SF.   Went once for HH w/ a friend....I think once was enough.", 
    "review_date": "2012-12-24"
  }, 
  "CXt0IXOVeyraG8zIRL3Gkg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Charity W.", 
    "review_text": "I walked past this place on Sunday when they were having a karaoke night and there were a TON of people there. The drinks were okay, good beer and wine, and a few traditional hard alcohol drinks (moscow mule, margarita). they have AWESOME bathrooms that are clean and have good graffiti. i say you just come in, pregame with a few good drinks, sing a song, and enjoy.", 
    "review_date": "2013-12-08"
  }, 
  "9cL6rBaZPGM--EieoUvIQg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curt Y.", 
    "review_text": "I was invited to play a happy hour there last night and I have to say, from a musician's point of view, I loved it.  The sound was excellent and my band had a good time.  They did a great job with the atmosphere and everyone there seemed to be having a good time.  You can't beat the $2 happy hour Trumer special!", 
    "review_date": "2010-10-09"
  }, 
  "qbsz_UN9B9ACkTftJrH0Tg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek S.", 
    "review_text": "Very poor experience.  Food was bad and the service was worse.", 
    "review_date": "2013-06-18"
  }, 
  "pGY1kEj0Vw1X_4BDFJkIpQ": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Tony H.", 
    "review_text": "Caught my friend's band playing here while on vacation in SF.  Definitely not in the best part of town, but the inside is nice if a bit vacant feeling.  And they could do a much better job ensuring random homeless people don't just wander in.  Not that I'm trying to discriminate, but everytime someone snuck in they were disruptive to the bands and harrassed the patrons.  But my main issue with this place is their drink selection.  I'm not a beer drinker and sipping wine while watching bands play just doesn't feel right, so I decided to stick with their cocktails since they were only $5 apiece.  Mistake.  Everytime I ordered a round, watching these guys make the cocktails was like pulling teeth - it'd take them 5 minutes just to make 3 drinks, which were totally weak to boot.  They need to hire some proper bartenders (and stock a proper bar) or stick exclusively to wine/beer.", 
    "review_date": "2013-05-29"
  }, 
  "a3prHYECsHFpLTHqHI1WSQ": {
    "user_rating": 1.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Eyez V.", 
    "review_text": "i was to hold an event here on august 5th 2012. i scheduled the event practically 4 months ahead of time with an option for September if the show went well. the august 5th show was to celebrate my birthday with live performances from local acts including guest appearances from sponsors. but they didnt care about that no... they didnt care that i spent 600 dollars putting the show together they didnt care about the blood sweat and tears i put into it. i think they have a problem with people who aren't white regardless of what color they are. i spent money on graphics printing flayers and posters. online promoting commercials and other various sources. it was beyond a waste of time working with them. i mean they canceled my event bc  of some other promoter who did a show there that i had nothing to do with. why would you take all your harm out on me? screw them they will get whats coming to them. and check this out. they still havent talked to me face to face about it they chose to go behind my back. and here i am siting with 3 thousand flyers for a show thats not going to hppen dont celebrate your birthday here or promote a show here sthey will cancle and pull the rug from under your feet", 
    "review_date": "2012-08-04"
  }, 
  "olEYaQziRperfA9b5HhOuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hillary S.", 
    "review_text": "Decided to take a star off my review because they don't have an events calendar.  I miss a lot of what goes on there because I just don't know about it.    A calendar on the webpage would be great, even better organization of information on facebook would be sufficient though.", 
    "review_date": "2012-01-25"
  }, 
  "ZGYNF-otqm5DJvu5_sNPhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy R.", 
    "review_text": "Whoa, where did this place come from?  50 Mason Social House is one of those places you won't notice unless you're looking ... most likely becuase you're bustling to get the hell out of the TL...  at least I am.  But hey, step into this place if you see it, it's pretty cool.  Aesthetically, it kind of reminded me of an upscale Vegas lounge.  But unlike Vegas, it's laid back and completely unpretentious.  I'd describe the crowd as Mission-esque, at least on the night I went.  It's an awesome venue for bands &amp; apparently there's an open mic/amateur comedy night on certain days.  There are very comfortable chairs and chaise lounges, with a small fireplace!  The bathrooms, I'm pleased to report, are clean.     Great beer selection (mostly domestics) for $5.  Their happy hour is between 12AM-2AM -  $2 beer and $4 wines!  They also serve snack food which I wasn't able to sample.  And how's this for awesome:  their menus come with a little flashlight.  First time I've seen that and I was very impressed.  CASH ONLY, but there's an ATM inside.  My favorite part was how open &amp; airy it all was.  Nice big windows make for good people (crackhead) watching.  It's nice to be able to enjoy a beer and observe the craziness of the Tenderloin from behind a pane of glass.  The spit won't hit you from there...", 
    "review_date": "2011-06-26"
  }, 
  "umte1cjoM-Bnh2gOR3GQCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlyn G.", 
    "review_text": "I've been to 50 mason on a few occasions to see friends play, and its definitely a cool spot where I've never been charged a cover. The decor inside is great, dark with red walls and assorted furniture that feels very hipster chic. My main complaint with this place is the drink prices; no less than $9 for a glass of wine, and $10+ for mixed, which i suppose fits the decor but not the type of music and crowd. They do have a decently good beer selection with about 10 mostly local taps.", 
    "review_date": "2012-11-04"
  }, 
  "MpMQPuvABOgtZI-sE6ch2g": {
    "user_rating": 3.0, 
    "user_location": "Denver, CO", 
    "user_name": "john W.", 
    "review_text": "got a chance to stop in and see a small group play and it was great. The space is small enough to be comfy but not so small you're packed like sardines.  Next time I'm in town will have to stop in for a drink!", 
    "review_date": "2013-07-01"
  }, 
  "nOAHRNSa1tS5rejZ4tjdyQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jesse H.", 
    "review_text": "Great space for any size group. There is no other place in the city with live music, ridiculously good drink specials and classy but laid back atmosphere. It's also on everyone's way home from work (1/2 block from BART). I'm hesitant to leave a review because I'd like to keep 50 mason a secret.", 
    "review_date": "2014-09-03"
  }, 
  "NEOSYsubf7SVeVm8RytxYA": {
    "user_rating": 4.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Michelle T.", 
    "review_text": "Came here for live music!  Pretty awesome venue!  It is near the tenderloin so that's a little sketch, but other than that great place to gather up a group of friends and have a ball of a time.", 
    "review_date": "2013-01-16"
  }, 
  "6ZpfGwq-raI2CmM69_aqng": {
    "user_rating": 3.0, 
    "user_location": "Burlington, VT", 
    "user_name": "Caitlin H.", 
    "review_text": "In sum this place is great, but stay away from the windows.  I came in here on a Saturday night after a friend and I attempted to venture further into the TL, but had to turn back because it was sketchier than we bargained for. We found this place right on the TL border, and it looked pretty classy with a live jazz band. We went in and were excited to find a table available by the window. We snatched it up and we had been sitting there a good 2.5 seconds before a homeless man approached from the other side of the glass and started touching himself. He knocked on the window and tried to get our attention. No wonder the table by the window was available. Every single homeless person who passed tried to get our attention.  Aside from the interesting view out the window, the ambiance INSIDE this place is awesome!! It is a pretty cool location that just serves wine and beer. The strange thing about this is that there are no sizes listed on the beer menu. Each one has a serving size, but you don't know until you get it and think \"omg 8oz of beer, what a rip off\" or \"omg 1 gallon of beer, how the hell am I going to finish that!\" I just think they should list the size.  I would recommended checking this place out though, it is pretty chill. they have happy hour 12am-2am if you are interested in being in the TL at that time.", 
    "review_date": "2011-04-18"
  }, 
  "ysT0x17ogmctifGeyqodVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "char s.", 
    "review_text": "The folks at 50 Mason Social House are terrific.  My band plays there regularly, and it's an intimate, comfortable place for our friends to come and hear live music.  Unlike a lot of music venues, there are lots of places to sit and hang out. I just had a huge birthday party there, and it was a blast.  The staff, from the doorman to the bartenders, to the sound engineer, to the manager, were all incredibly friendly, helpful and of good cheer.  They really helped to make my party. Thank you 50 Mason Social House!", 
    "review_date": "2014-05-06"
  }, 
  "6rW5OiTjq6EyiJDjWbgmvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica C.", 
    "review_text": "I went here for Live music last Wednesday and was greeted with big smiles, a great bartender and a chill lounge atmosphere.  I loved the music and will definitely be going back here for some night that I want to some delicious unique drinks, tasty beer on tap and a low key but great vibe!! They are always bringing in new talent, old talent and just right out amazing talent without breaking the bank!", 
    "review_date": "2011-10-12"
  }, 
  "JwQ8oI5iXKaqfBgZSpm19Q": {
    "user_rating": 2.0, 
    "user_location": "Newark, CA", 
    "user_name": "Amy C.", 
    "review_text": "Located in the tenderloin area, so be careful!  Luckily, I found parking right outside of this place whenever I saw a car leaving so nabbed that spot, but I did circle around &amp; around the area several times before getting lucky. I heard about a free comedy show thru FunCheapSF for this place and since I was going to be in the city anyways for an event; I decided to meet up with a friend to check out this free comedy show. The comedians were okay. The place is really small and they have a good selections of alcoholic drinks. Midway during the show, a lunatic came in and made a scene- which was pretty frightening. Then whenever we were leaving the place, outside was another crazy dude dancing around with his butt showing since his pants were lowered to under his buttcheeks. So yeah, just be careful in this area.", 
    "review_date": "2013-04-17"
  }, 
  "w_H_yUaaktshMpp9C_5OdA": {
    "user_rating": 1.0, 
    "user_location": "Tacoma, WA", 
    "user_name": "Aaron C.", 
    "review_text": "Went there for a DJ. The DJ was great but it's not my scene. I myself prefer a good old dive bar with a pool table. Not the young professionals of Frisco who travel into the Tender Loin", 
    "review_date": "2011-07-26"
  }, 
  "jgQvNjX1kRSERgyjDodHlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicholas L.", 
    "review_text": "Love the decor. People that draw in are interesting. Bartender was very nice and attentive. New bar! New place! Tell a friend! Its a place to go when your tired of the same old place. Plus they have live music. Yummy.", 
    "review_date": "2010-10-22"
  }, 
  "scIyLRiFryYbzCcJG5l1Fg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J. S.", 
    "review_text": "Alright so I love the decor and openness of the place. Totally awesome! - 5 stars. Very comfy furniture, cool stage setup, and has great flow.  They had a band their last night and we stayed for a couple of songs and they were pretty good, some outfit from Denver.  I know it's located in Union Square/Tenderloin area so I understand high prices, but two drafts $13 is a lot. I know they have higher end beers on tap but that did seem a bit excessive.  Also, their happy hour is from 12am - 2am, great if you are a night owl and like the TL that late, but not so good if it's after work or early evening. If you change that (ownership, are you listening?) I'll probably come in around the 6pm time and enjoy the place more often.  Sum up - cool place, a bit expensive, and beer/wine/soju only which is fine with me.", 
    "review_date": "2011-10-13"
  }, 
  "yB4E71S4On0ArNGmxH9_Sw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah P.", 
    "review_text": "Nice wine list, great service with Jordan (and Erica), homey yet elegant decor (nice wine bar feel), and fun music (changes every night)...what more could you ask for? Seriously, a nice find for the downtown area.", 
    "review_date": "2010-10-20"
  }, 
  "pO5LT1lvk_P0pGgmRlJCaQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jon S.", 
    "review_text": "50 Mason Social House is truly an amazing place. They havn't been around that long but I've already seen a couple really great shows here.  The ambience is really cool, hip, yet warm and inviting. Great selection of beer on tap &amp; wine.  I don't know if they plan to get a full liquor license or to start serving some food in the long run.   The acoustics in the room are really nice too very warm &amp; somewhat bright. The stage is size is excellent for a 3 piece band with a small kit although I've also seen some larger bands play there &amp; they just spill out onto the floor in front of the stage.   While it is true, they aren't in the best neighborhood in town the experience  of hanging around the area is on par with being by the Great American Music Hall or Slims.  Plus your a hundred feet from the Powel Bart station and all the muni lines. Despite what another reviewer mentioned I found the guys working the door did a really great job of keeping the crackheads from loitering around in front. While we were smoking out side one or two of em came out to ask for some spare change and before I could even respond the door man whisked them away.    Especially for a brand new business it's incredible how many things this club does perfectly. I'd imagine that in the comming years this place could very well become one the City's go to spots for nightlife!!", 
    "review_date": "2011-05-17"
  }
}