{
  "hPCMsao_S3NU_ss53PTkgQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloé M.", 
    "review_text": "Wandered in here while looking for drinks with a friend in North Beach. It was less less loud/crowded/crazy than the place next door.   All most all of the patrons were old white dudes...but that might be explained by the bartender with her tits out for days.  They have a $15 card minimum, which on principal, is enough to never make me go back.   Their only redeeming factor is in-house infused vodkas. On the day I stopped in it was pineapple...freshly infused pineapple vodka. I had it with soda water, $7.  Overall, not a bar I would visit very often except to check out their newest vodka.", 
    "review_date": "2013-03-13"
  }, 
  "-Qf4ffBkhYailgZ57ZenOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carly W.", 
    "review_text": "I am still fairly new to the city and was invited here by some friends. I hadn't made it out to this part of town yet, but now I would definitely come back. Amante was a fun little spot. It was pretty busy when I got there, but luckily my friends had snagged a table.   There are quite a few tables along the wall and then some seating at the bar. They play a good selection of music, but they play the music really loud. I had quite a few moments where I was trying to talk loud enough that my friends could hear me and the music would stop and I would still be yelling haha. This is not necessarily a place to go chat with friends, but definitely a relaxed place to go chill. I would think that with the music they were playing that people might be dancing, but no one was dancing either.   As for the drinks, I had beer, so I can't comment on the mixed drinks. The beer was reasonably priced and even at the busy moments in the night, the bartenders were fast! This place was good at keeping the drinks coming. Also, if you are sitting at a table they have wait staff that will take your drink orders. Although at the busy times in the night it was faster to go get a drink from the bar.", 
    "review_date": "2009-02-05"
  }, 
  "dUjWYjb8F-bWeKsS_lMfBg": {
    "user_rating": 3.0, 
    "user_location": "Cathedral City, CA", 
    "user_name": "Amy R.", 
    "review_text": "I got to see some dude get heaved bodily from the front door for lighting up a joint inside the bar...which was pretty damned funny.  It was worth going just for that.  But...since the purpose of going to a bar is to drink and I had one crappy drink and one mediocre drink...I can't see giving it more than 3 stars.  It's a cute enough place and the people working there were nice...my drinks just didn't remotely approach stellar.  Though, I was informed by a reputable source that I just barely missed the good bartender.", 
    "review_date": "2008-05-24"
  }, 
  "qUg4PXAT42bxV48CqPaUwQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnny C.", 
    "review_text": "Any respectable bar has to have character and that Amante does in spades. Like most places with unique character, a patron has to know the time they prefer to hit said bar and naturally that depends on what yer interest is. If you're looking for a mellow atmosphere to be able to have convo with your cocktail, then it's best to get in on the early eve' side of things. Otherwise be prepared to run into droves of those looking to \"get their North Beach on.\" If you're not comfortable in a bar unless you're \"pre-soaked,\" and requiring the requisite population of \"man-tastic\" and \"shorty cakes\" well then Amante may not be yer thing.  Went in before a dinner rezy for a quick cocktail. We were at first skeptical, thinking that we'd either stepped into a private Italian bar or J-Lo's boudoir. It's like a mini-Vegas, Ratpack-era bar, with mirrors, a stage and blue-walled interior setting the tone straight away. Huge \"A\" for -what else- Amante.  The place was seemingly dead. If you mistake Amante for Sleepy Hollow, you're making a big mistake; the place can get crowded in a flash when there's a band or with night owl revelers. Bartenders don't mess around when mixing drinks, preferring to offer a healthy dose rather than watering down like most places. Wiz is one of the best bartenders in the city and -to boot- has a great Ipod mix \"soundtracking\" the background for you. Clientle range from old school, eye-patch wearing fifty-somethings, to neighborhood fidi's looking for an option after Tosca or before they move on to do more serious damage. Don't be surprised if you see someone bringing their under-the-arm ankle biter in; most anything is tolerated as long as one behaves. Or, misbehave without getting up in anyones grill...especially Wiz's.", 
    "review_date": "2008-03-10"
  }, 
  "BOM_r6HaJnpMwXw82XbVAw": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Amber R.", 
    "review_text": "I am stingy with my 5 stars and since I didn't eat the food, I can't 5 star.... but... all 4 stars are for the bartender.  I am a new scotch drinker, which I communicated to the bartender and he suggested a new scotch I hadn't tried and loved it.  My friend wanted to try a new tequila and after just a couple questions, suggested a tequila that she really liked.    Long story short, bartender was certainly knowledgeable about multiple alcohols.", 
    "review_date": "2014-08-30"
  }, 
  "fM8egpsSDw4m13IAufkNcA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan D.", 
    "review_text": "Great decor and good drinks...A definite place to stop in for a drink while in north beach.   Also an even better place to stop for a drink before the night ends...it has Golden Boy right up the street.", 
    "review_date": "2005-03-31"
  }, 
  "Mvsd7TvTeiCXnDOOHVHaEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carl M.", 
    "review_text": "Fun place, very comfortable lots of seating (at least at 9pm) with a fun ambiance.  Major downside, only one bathroom and music was way to loud.  Drinks were good, but I had a hard time carrying a conversation with someone who was sitting right across the table from me, but that's to be expected.  Got pretty crowded around 11.45p, which was my queue to leave.  My recommendation:  make this the first stop of the night and move on when it starts to fill up.", 
    "review_date": "2010-03-01"
  }, 
  "99pcEZNPzjnrx4dnmT6WAA": {
    "user_rating": 5.0, 
    "user_location": "Reno, NV", 
    "user_name": "Megg M.", 
    "review_text": "Ruby Red Cosmos, best bartender in the city Eric... we will be back!", 
    "review_date": "2011-03-05"
  }, 
  "4IjzfbO7XKFNWWVufHNhww": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalie N.", 
    "review_text": "Excellent service, comfortable booths (some fit more than 4 people which is nice) and quick service at the tables and the bar.   Now thats the North Beach I know and love.", 
    "review_date": "2009-12-17"
  }, 
  "tfg1Nhwx94Y4GdQHLVawbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed L.", 
    "review_text": "Stopped by here after the Union St. Festival to chill out. Everyone else came for the afterparty. Love the people that come here. All of them are super fun, outgoing, and definitely buzzing from the festivities.   There are tons of bars around that seem like they have been around for decades. This place has definitely been one of those staple spots for people to get wasted in the middle of the day with its cheap drinks and lively atmosphere.", 
    "review_date": "2009-08-12"
  }, 
  "P2fXcmsU_vrs4zB2IfsHnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel P.", 
    "review_text": "Cool little place with nice decor.  Came here to celebrate my friend's bday and we ended up in a little corner next to the window. Pretty cool but beware the corner where we are with the window...it has pillows and is nice and cushion-y--makes you want to fall asleep.  Interesting music and people inhabit this place...so join the party! Score some free drinks from \"interesting\" people!", 
    "review_date": "2007-11-12"
  }, 
  "WI9UJah3bVB258wzEIh34A": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kate K.", 
    "review_text": "A bad week can only be made worse by rampant alchohol consumption... Despite this truism, I have to say that I had quite the fine time (mostly) at Amante...  Really, the only reason I went to DYL was to see Christopher S. &amp; to return Adrienne's green lighter - which had adopted me as it's surrogate smoker parent &amp; had been living in my purse for some weeks.  After AG &amp; GL (that's green lighter, people) were reunited you'd think I'd have had sense enough to return to the Mish from whence I came...  Oh, noes - I didn'...  Instead I stayed until at least 11:30pm at this fine establishment, imbibing alchohol, questioning people's identity &amp; generally behaving like the drunk ass I am until such a time as my dear friend Chris S. poured me into a cab &amp; said to the driver \"Home, Jeeves.\"  Thank god someone has some sense around here!  Amante is a classy bar, perhaps too classy for someone who puts the \"ass\" in that word such as I do.", 
    "review_date": "2008-05-24"
  }, 
  "aJEZeCZEbT26XWjMWMJx1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pamela D.", 
    "review_text": "I never thought I'd like Amante.  It just looks like your usual stupid \"upscale lounge\" bar with ridiculous puffy throw pillows on the window ledges and silly sleek modern decore.  And yet, I have had a bunch of really enjoyable drunk nights there.  The bartender with the long, curly ponytail (is he still there?  I haven't seen him in a while) is so nice and pours strong drinks.", 
    "review_date": "2005-06-10"
  }, 
  "bF4BjnRuQdlL0MVYrSMLIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jigi s.", 
    "review_text": "good stiff drinks...from outside - looking in- looks like it could be a upti-tighty place but its not..u could be as comfortable in a suit or in flip flops in here and u would still get served the same 'ol stiff drink. plus they have some specials running wednesday thru friday on something....", 
    "review_date": "2005-11-18"
  }, 
  "PhAt76Bw5kVdEFfozawNtQ": {
    "user_rating": 4.0, 
    "user_location": "Half Moon Bay, CA", 
    "user_name": "Laura K.", 
    "review_text": "i like the atmosphere in this place....it was perfect for a chill night and the bartender hooked us up with endless refills of blue dolphins (clutch!) the downside: some of the patrons don't know when to take their game elsewhere   line of the night: \"i have a girlfriend anyway. and she's a nine. you guys are like, sixes\"", 
    "review_date": "2006-05-30"
  }, 
  "mZ--Z5GELqrn9E6-KWLhTA": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Michael B.", 
    "review_text": "Finding the rest of your group when you're drunk is really hard. All stars go to the vaulted mirrors to help you locate them!", 
    "review_date": "2009-04-21"
  }, 
  "7qOYwZ_KrKdWcMAwD-hIdQ": {
    "user_rating": 3.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Jess R.", 
    "review_text": "i was visiting family and friends in SF and my nightlife choices were guided by friends of friends of friends. after a failed night of catching up with a college buddy due to the loud shitshow at circa, we decided to attempt normal conversation at amante. cute little bar with a friendly bartender. but um...what's with all the signs that say \"please don't stand on the couches\" ?? have so many people stood on the couches that they need to have signs?", 
    "review_date": "2009-06-30"
  }, 
  "_TBi1YmtfeLjJuG2EV26jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin M.", 
    "review_text": "Great bar in the heart of north beach. The crowd is a bit nicer than some of the surrounding bars (I'm looking at you Maggie's), but in a good way. A bit more relaxed, chatting, fewer fights, more room to move around.  Prices are on par for the area, bartenders are all friendly and quick. Nothing to not like about Amante.", 
    "review_date": "2010-10-04"
  }, 
  "8d6Mdzh_GWk9gZTqrsGJrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "Great decor! Our waitress was sweet and personable and kept the drinks coming! She even brought our hammered b-day friend water because he was done for the night. Booths are comfy and they play fun music!   I am totally going to come back here!", 
    "review_date": "2007-05-08"
  }, 
  "UsHxO3TTNJf8ijn9FvDRCw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark M.", 
    "review_text": "Stopped in here to watch a Bowl game the other night and quickly realized this is not a great place to watch a game.  Only a handful of TV's and the layout is not conducive to groups trying to watch said games.  The wait staff was OK and the Asian influenced menu had a few good items but I was not impressed with the beer menu or the lack of non-spicy food items.", 
    "review_date": "2014-01-01"
  }, 
  "68IUpVhBJELMJIX8uMrw2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan C.", 
    "review_text": "I just have bad Karma in North Beach and every single time I have ever been to Amantes, I've ended the night by tossing my cookies.  They don't carry Hangar which is an issue for me because 1.) I'm not that big of drinker and don't substitute very happily, 2.) being as I don't drink very much, one drink is my limit (per 1.5 hours, oh this has been a difficult year of learning limits) or else I'm the embarassing drunk - so if I'm going to drink anything, it better be the stuff I like, damnit.", 
    "review_date": "2007-09-14"
  }, 
  "z3EvP4icWYeIR3xPXNkymQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Judy C.", 
    "review_text": "I stopped by for the first time last Wednesday night and saw Valeriana Quevedo and her group, sing up a storm. Nice room, good food, and the bar prices were not that bad. Val sings there every 1st Wednesday of the month (no cover) and is great, alot of musicians and singers came in to jam and the place was jumping. Definately will go back.", 
    "review_date": "2009-06-09"
  }, 
  "bq3Xewi5Uk9Md1KX83UQHA": {
    "user_rating": 3.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Lane K.", 
    "review_text": "Good small plates and pizzas.  The guy behind the bar with curly hair is named Wizz.  Ask him how he designed the copper bar, great story.", 
    "review_date": "2006-09-29"
  }, 
  "HvUXiTSN-Y8raG1pqQubtQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anya B.", 
    "review_text": "Was here for a few minutes early in the Friday evening. A bar off Columbus. Nothing spectacular or inviting. The crowd consisted of young college boys, a bachelorette party, and a few groups of well-groomed girls.", 
    "review_date": "2006-09-16"
  }, 
  "lZ5PiW7FnK1IHC9_APvhYA": {
    "user_rating": 4.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Zack K.", 
    "review_text": "This was the spot I chose to have my post-job interview drink. The bar is awesome. I had this super cool older bartender who was absolutely great to talk to. You get quite a local vibe too, which is quite nice. Go for the Big Daddy IPA if you're looking for something new and a little hoppy.  The only reason this place didn't get 5 stars, is because the bar is separated from the dining room, despite the fact that both are in the same building. For example, if you're sitting at the bar, you cannot order food through the bartender. You have to pay at the food window. Making this worse, the food area is cash only. Strange.... But the food was BOMB DOT COM. I bought the chicken wings and the chicken, I'm pretty sure, had a party in my mouth. MMMM MM Good. It was real nice, real good, yummy in my tummy.", 
    "review_date": "2013-07-21"
  }, 
  "j4C14J6wq0lXSKYrBLrHFA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin D.", 
    "review_text": "I'm glad my friends and I decided to come here this past Saturday.  The awful human being behind the bar was a good reminder that there are a lot of jerks out there, and one should be wary of pretentious grouchy bartenders. We got to the bar kind of late for a friends birthday.  My friend ordered our drinks- 2 cocktails and 2 beers and we all stood around chatting and waiting for them.  He gave my friend the total when the 2 beers were on the counter and ran the credit card, and when my friend asked about the two cocktails the bartender said he'd made them and put them on the bar, and we must have taken them.  Since we were all still standing right there waiting for our drinks we explained that this wasn't possible, and he then escalated the situation and accused us of stealing them to get free drinks. My friend calmly explained that no, he was standing right there, and we didn't grab the drinks, but the bartender continued getting more and more worked up and yelling at us.  He ended up pouring out the two beers we'd purchased in a dramatic fashion, and refunding my friends card, only after loudly making a scene and being rude to us.  If it were up to me we would have left, but since we were there for a birthday we had to stay.  So I, standing right next to my friend he was just rude to, proceeded to order the exact same drinks/ pay for them/ give them to my friends. Now I must add that this was a very crowded bar. We were not paying close attention after we ordered drinks.. just standing around and chatting as friends will do in bars.  So maybe someone grabbed them from the bar, or maybe he forgot to pour them, but the bottom line is that type of treatment was uncalled for and tacky.  I would have expected better from a cool bar like this. We could  have afforded many many drinks from that place, and are not in the habit of stealing drinks when going out with friends.  Chances are we would have gotten drunk and bought way too many drinks from here had the rude fellow behind the bar not killed everyone's buzz. Needless to say we will never be going back here.", 
    "review_date": "2013-04-29"
  }, 
  "sbVdImPlVRuf3-byN1F16A": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Nicole A.", 
    "review_text": "After eating, my friend and I walked in here specifically for the house pineapple infused vodka. Absolutely fabulous! The vodka was so smooth, it had the texture of water and it tasted delicious. This vodka is dangerous as you could drink a whole pitcher of it on a hot day, only to realize 20 minutes later you are plastered. This did not happen to me, but it would have if I had kept drinking. Strangely, the alcohol didn't affect me that much.   The interior of the place is dark woods, dark lighting (so everyone looks better) and there's a huge jar behind the bar filled with vodka and a gigantic pineapple. I barely noticed anything else really. The atmosphere seems very chill for a bar. They also serve food from next door at the Chubby Noodle... the menu looked good but I wasn't there to eat. Next time!", 
    "review_date": "2014-05-07"
  }, 
  "b0p3fOxJcZjB3iTl7zoqTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rego S.", 
    "review_text": "Don't be fooled by the big cheesy sign out front, it's actually a decent spot.  Plus, it wasn't too crowded on a Friday night.", 
    "review_date": "2006-01-09"
  }, 
  "vLfRgjVHw4zSiKOmM7XvqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marjorie B.", 
    "review_text": "I've been here when it was packed wall to wall with yuppies swarming the bar the guys with their shiny pitstained shirts and the girls in their halters tight jeans and stilettos.  I've also been here when it was so empty you could hear a pin drop. on a marshmallow.  and the pin was rubber.  The difference of a Thursday and a Friday, I guess.  Even when it was busy and I couldn't get a second round in until half an hour later, the bartender still had great memory retention.  And hey free matchboxes!", 
    "review_date": "2006-06-22"
  }, 
  "3fhIgNqd1jq_4sTWwA79Xg": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "robert m.", 
    "review_text": "Wizz is awesome.. The pineapple mango infused Vodka on the rox... Thanks for the tip Gary!", 
    "review_date": "2011-05-09"
  }, 
  "a8wKua129w25q4wtP26p2g": {
    "user_rating": 1.0, 
    "user_location": "Covina, CA", 
    "user_name": "Vanessa F.", 
    "review_text": "We first went for a friend's birthday in September. It was okay. The drinks weren't great, nor were they a decent price. It was pretty crowded. Minus for the single restrooms where the toilet is covered by a curtain. Anyway, our experience there wasn't so terrible that we'd never consider going back...  ... and we did go back, on Halloween...  The place was packed, which was expected. We ordered two drinks, but were given three (and yes were charged for three). But that's ok. Our night got better! Not only did it NOT rain on our halloween, but the couple sitting next to us was having sex... on the couch.  It was a truly hysterical moment when the two guys dressed as the ambiguously gay duo gyrated their crotches in the couple's faces... not realizing that they were having sex.  The waitress even came up and took their orders!  So yeah, it ended up being an awkward yet very entertaining time. But IF I go back, I will not be sitting on those couches.", 
    "review_date": "2008-11-11"
  }, 
  "OwACDpsXnfHRw7ce3xh2RQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriela W.", 
    "review_text": "You know, I almost never like to post a bad review because I work on the restaurant industry and I know how much these things can hurt a business. But what happened the other night at Amante was so bad that I just had to say something. My friend and I like to have an occasional cigarette while we drink our wine. So we decided to go to Amante and sit outside. I specifically remember telling the bartender that we will be going outside so we can smoke. No sooner than we had lit our cigarettes, the same bartender came out and started pulling in all the chairs. When we asked why he said that it was because he wanted to go home early. He was rude and unapologetic, so we asked for the manager. Then he said that he was the manager and rushed us to chug our drinks. I later found out that that was a lie, because he is just a bartender. So caution people DO NOT, go to Amante when Fredo is working unless you want a lot attitude.  That being said, I'm a local North Beach resident and have had a lot of fun at Amante  because the other bartenders are really great", 
    "review_date": "2013-11-16"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 3.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "Amante's is always a solid spot for a night out in North Beach.  The crowd is usually ample and diverse, drinks are strong and reasonable and the space is open and comfortable. The most memorable part of my last visit:  homemade pineapple infused vodka...delicious but dangerous as all hell. I'm not sure if they infuse with other fruits through out the year but either way, it's worth trying for a special treat.", 
    "review_date": "2009-05-28"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "One of the better bars in the area. Owned by a bunch of bartenders, they know how to make a drink right. Any tough cocktails you've always liked but are often afraid to order for fear the bar will blow it? Get 'em here. Crazy crowded on weekends.", 
    "review_date": "2005-11-30"
  }, 
  "vLGnbOg0sHg4d6-JhorF2A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily T.", 
    "review_text": "Me and my friends stopped by for a drink.. it is pretty small. they were having live band performance.. it is for older people.. the drinks were good, I ordered pineapple with voka.... it is a very chill atmosphere to hang out and get drunk with a few friends...", 
    "review_date": "2008-04-23"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "There are (surprisingly) lots of hot guys here. Since it's North Beach, they probably all turn into drunk, chauvinistic barfighting frat boys after 10 p.m. but I was fortunate to get here earlier than that. The bouncer was extremely friendly to me while maintaining a decent intimidation factor with other, less soft and cuddly individuals.   As for the cocktails, I drank a lot of somebody else's delicious mai tai (yum!) and I had a couple of decent, strong vodka sodas purchased for me while waiting for Boy to finish parking. Speaking of parking- you'd have to be stoned out of your mind to think you'll ever find parking in North Beach. Anytime. But especially on a Friday night. There is apparently a parking garage nearby, next to the police station. That would have been USEFUL and COOL to know beforehand.   Amante is extremely large and has plenty of comfy, cushy seating. It was the perfect place for our Friday night happy hour. The only complaint I heard (aside from the complaints about our noisy friends) was that drinks were hard to come by and not that great. I'd come back and I'll most definitely use Amante for large groups in the future.  One more USEFUL tip: when a striped shirt with highlights is walking down the street in North Beach with his equally striped shirted, highlighted mantourage, it's best not to yell, \"pop your collar, Motherf*cker\". Just take my word on that. (Hi, Amanda!).", 
    "review_date": "2008-05-28"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "I really can't find any faults in this bar at all. The interior is very cool and loungey. The lighting is perfect. The seating is varied, and well cushioned. The music seemed to be all of my favorites from the 90s. The infused vodka was tasty, although I did wonder if there was any alcohol present, as it tasted like juice. The last piece to the puzzle is the food, which I have yet to try...", 
    "review_date": "2006-04-25"
  }, 
  "8pjrrLQwGw0wlp_k9E0vwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Black D.", 
    "review_text": "First of all I love this place. I feel like family when I come here. The owners Wiz and Mike are fucking fabulous. Eric and Alfredo are amazing to chat with and make great drinks.   Lastly a personal shout out to my favorite Sarah. Great personality, drinks and looks. She has the complete hospitality package.   Been a regular here for about 6yrs. Always consistent.", 
    "review_date": "2014-09-26"
  }, 
  "ybzQMBPwxVNGmTQO_5fHNg": {
    "user_rating": 1.0, 
    "user_location": "Boynton Beach, FL", 
    "user_name": "Karin M.", 
    "review_text": "Bartender was a dickhead!! I was sick and brought in water from a nearby place. He gave me an attitude and said they don't allow other drinks from other places  I didn't know it would be an issue and so I asked him if he could spill the water out so I could return the glass to them. He did and the handed the glass back with an attitude he asked for IDs from me and my boyfriend even though I asked for water. He then gave an attitude again so I asked him \"why the attitude?\" He apparently misheard me and said he was a Mexican. He thought I said \"why the accent? \" after the clarification he said that he's not the one with an attitude. I did not gve him an attitude- not even when asking about his own attitude. I asked for the manager in which he magically became the manager. He then refused to serve us and kicked us out. I would never recommend anyone going here for the horrid service.", 
    "review_date": "2014-05-24"
  }, 
  "RBZ_kMjowV0t6_nv2UKaDQ": {
    "user_rating": 4.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Lindsey D.", 
    "review_text": "This is a perfect divey bar to visit, especially on a rainy day! The bar is cozy and casual which is the perfect combination. The drinks are stiff but reasonably priced, the staff is friendly and the patrons are anything but stuffy. I especially enjoyed their very random menu of food options. They serve items like fried chicken and then Asian noodles. Like I said, it's random but it seems to work! Amante is spacious for San Francisco standards so it's a good place to visit with friends. That's about all I can say about Amante, except that it's worth a visit right meow!", 
    "review_date": "2012-12-28"
  }, 
  "kXSEepDXV-DwiA_6BFzE9g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan H.", 
    "review_text": "Bartender was unfriendly after we went inside to see whether or not the 5 of us sitting outside would ever be served (after sitting here for 10+ minutes and watching the tables around us get served).   And I know what you're thinking, but I was with my girlfriend and 70+ year-old parents, so we were not obnoxious/aggro/etc.   They just don't care about your business so take it somewhere else.", 
    "review_date": "2014-12-26"
  }, 
  "qQa9J0fXA6E-3JSFNsF7TA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "O'Shea J.", 
    "review_text": "This is why I don't do North Beach. It's not like I didn't know what to expect but I came because a couple of my friends were DJ'ing. There is no dedicated DJ area/booth so my buddies had to nestle in a little corner with their turntables sitting at one end of the bar. Adding insult to injury, their sound system was horrible with nasty distortion on the high end like the tweeter was blown or something. To compensate, they had to turn down the overall volume way low.   The crowd is typical North Beach. There was no reaction when the classic club banger \"Can't Stop, Won't Stop\" by the Young Gunz was played, yet they went stone crazy like it was 1987 when Van Halen's \"Jump\" came on. Wow, just wow.  In their defense, the female portion of the crowd was quite attractive. There was an exotic looking dime in a white dress who kept making eye contact but left before I could make my move. If you are reading this, I'm the dude who was w/ the DJs. Holla.", 
    "review_date": "2008-09-30"
  }, 
  "Xei4NJ0N_SkdQ42xxrk67Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steffi L.", 
    "review_text": "Came here on a Saturday night with a couple friends and it was pretty empty. However, the pineapple martini is pretty darn amazing. Foamy, refreshing and very pineapple-y. Get it.", 
    "review_date": "2012-07-23"
  }, 
  "Uw2JnDNO7iti_qvTm4MlRw": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Ben W.", 
    "review_text": "I've always associated the neon streets of North Beach with tourists, because that's how I feel when I'm walking down the street there, as they bump into me in the cold night wearing shorts with sandals, and the various door-people at the strip clubs attempt to tenderly coax me inside their doors. I hurry past the nonsense to meet my friends at Amante.  It's so damn close to all the lights that Amante isn't really a true escape. The huge televisions dominate most surfaces and I doubt there is a truly regular crowd. Is it a sports bar, or is it supposed to be cool? The staff was beyond nice for a busy bar, the drinks stiff and the atmosphere generic. A big little bar with almost no personality except for being in North Beach.  Met some questionable folks and had some great conversations, and as those closest to me began to call it a night, I was faced with the choice of continuing my adventure with new people or heading home. Before you know it I'm in a cab with a new friend heading towards Polk Street.", 
    "review_date": "2008-08-14"
  }, 
  "0ewvp9BUbNq1lqdWeTnLHw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathy T.", 
    "review_text": "Brought my three girlfriends from LA. They gave Amante a thumbs up. We came there on a Saturday night during fleet week. It was very crowded but we were able to squeeze ourselves to get to the bar. Got served right away and the drinks were strong and delicious, just how we like our men.   Even though there were many girls giving us the mad dog looks, we didn't care because we were having fun and enjoying ourselves.  Ladies, who were giving us the mad dog looks, don't hate us because we're nicer, if you would only take those sour looks off your faces you too could have men coming up to you!   Amante's receives 4 stars. Thanks for the great time!", 
    "review_date": "2010-10-11"
  }, 
  "Q2RsDOhzsCBI-F1oOPe6Lg": {
    "user_rating": 5.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Chanelle N.", 
    "review_text": "So chic and upscale. Loving this bar! It seems more of a lounge than a bar which is why it's 5 stars. I haven't tried the food so 5 stars only for the bar.  Been here once and sat at the bar. The bar tenders were fantastic!! We chitchatted about various alcohols and the infused pineapple vodka. I was convinced to try it. Wow, it was marvelous!!!   Many of the patrons were coming in and out for a quick drink and they were out. They all seemed to know the bartenders too. I figured they must be regulars. I mean why wouldn't you be a regular if you lived close by. It's off the hook here!!", 
    "review_date": "2012-03-29"
  }, 
  "ZHKTYA-ZNVLwH5wTFBCiYQ": {
    "user_rating": 5.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Jason M.", 
    "review_text": "This place is great. We reached out to them ahead of time because we were having a bar crawl and let them know we were coming, They gave us special deals and made sure they had the staff on hand to work with us. I am sure glad they did because it turned out to be the best experience we had on the entire bar gold pub crawl. I will be back! Make sure this is number 1 on your list!", 
    "review_date": "2013-03-23"
  }, 
  "v3ial-ln4kh1RgM7BQxXoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew N.", 
    "review_text": "b e s t    f i s h    t a c o s!!", 
    "review_date": "2007-09-23"
  }, 
  "_don8EWxNsvRdjDJqWbw0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine E.", 
    "review_text": "This place was nice! Sandwiched inbetween Italian restaurants, its hard to know what to expect.  The bartender served up some really nice drinks which were pretty cheap for the city, nice ambiance, good crowd and my friends really enjoyed the food from chubby noodle.", 
    "review_date": "2012-11-30"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "Such an awesome bar. The bartender and I had the worst case of hiccups and she had some weird remedy. Unfortunately and fortunately, the cure worked 50% of the time, everytime. Thank goodness! The place is a pretty cool hangout spot to watch your favorite sports game. The service is great and the drinks pretty good. If you use a card, there's a $15 minimun, so be prepared for that. There's also a kitchen AKA Chubby Noodle that has great service, make sure you try the korean tacos (amazing!). Takes cash only. It was a wednesday afternoon so it wasnt busy at all. I can see myself here on a Friday/Saturday night", 
    "review_date": "2013-05-30"
  }, 
  "JNyLyXn-unUhJmiGJnI6tQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah J.", 
    "review_text": "Amante is a little too multiple personality for my taste.  Is it a bar?  A club (that it Biggie I hear, no?)?  A restaurant?    Confused, I order yet another vodka soda (it's strong, so that's good), down it, and then head back to the bathroom.  The bathroom with a curtain instead of a stall door.  I know it has been said before, by others, and now by me, but the bathroom has a curtain instead of a stall door.  Did they invest too much in their 100\" TV to be able to afford a real door?  And get this: According to Amante's Web site, they've got a consulting service.  I quote, \"Are you interested in opening up your own bar or restaurant? Let us help you reach that goal with our combined knowledge of 55 years in the restaurant industry.\"  So with the help of Amante's owners, you too can open a bar-club-restaurant that doesn't waste resources on such frivolities as bathroom doors!", 
    "review_date": "2007-01-30"
  }, 
  "ghRwENzjazf5b94m5ga5NQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth G.", 
    "review_text": "Super chill atmosphere during the week.  Friendly bartender that explained the process used when making the unique bar.  I recall saying shortly after arriving that \"This is my new favorite place.\"  I was in a really good mood so that may be stretching it...but Amante's helped that good feeling right along.  I look forward to visiting again on a night when they have live music.  It may even get a fifth star from me when I have spent more than two-pints-worth of time here. Cheers!", 
    "review_date": "2006-11-09"
  }, 
  "91YfQoC9Np0Dj6UaSpX2Rw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gaurav A.", 
    "review_text": "Great ambience in a centrally located spot in North Beach. Tap beers are $5, which is almost the same as some other divey places I have been to. And this place is in no way a dive bar. The bartending was great as well.  Didn't try the food, but the connected Chubby Noodle does give some options if hunger strikes. The menu looked fairly limited, but interesting, though.", 
    "review_date": "2014-01-21"
  }, 
  "-hNWeSQlZlEQe1MdCQdspA": {
    "user_rating": 5.0, 
    "user_location": "Paris, France", 
    "user_name": "Philippe B.", 
    "review_text": "Real, genuine, fun. If tired with the superficial-trendy-hype atmosphere of these insipidious-beautiful-people places, where people \"pretend\" to have fun, rush to Amante. Experience may vary (avoid rush hours, the later the better).  By the way, could the hype-mayor of this city do a little lobbying to make party hours acceptable in SF? Closing at 2 AM when people *start* to have fun is a real crime. San Francisco deserves a special status to save its nightlife (fed up of ending at the End Up)", 
    "review_date": "2005-09-29"
  }, 
  "5YpLep4KSQL65Vq1uljzyw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sfc j.", 
    "review_text": "Great Bar!!!  These are real bartenders.  They pour a real drink, you don't have to sell some blood to pay for it, and their are always some pretty ladies there.", 
    "review_date": "2008-02-27"
  }, 
  "BwTPj8XS_iqdSTLPBVMs1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie Anne N.", 
    "review_text": "4 words Pineapple infused vodka martinis. Large open space. Crowd can be hit or miss. A lot of randoms and stumblers. Music is random and off the wall which was awesome. From rap to 80's. A great place to meet friends and just relax with a cocktail in hand.", 
    "review_date": "2009-07-26"
  }, 
  "kkAFJLviQ_dp1nChCvi3-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ricquel N.", 
    "review_text": "cool. comfy. cozy.", 
    "review_date": "2007-10-08"
  }, 
  "XiVlH054UZ3A964ZIrBkPg": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Devon S.", 
    "review_text": "Less than awesome is being approached in a bar by a dude, having him quote lines from your yelp reviews, and then him telling you you're an arrogant and conceited bitch. It's called being facetious, asshole.   More than awesome is heading out to a rad birthday party (woo Anna!) and having a great time. I had some too-drunk issues earlier in the evening, and I appreciate the speed with which I was delivered my water and how nice and accommodating the bouncer was. Instead of telling me to stay outside, he cracked jokes about how I was looking less green with each lap around the block and that it was perfectly fine for me to keep coming in and out for fresh air.   I've been to Amante a ton of times, and it's the kind of high-ceiling, couch-filled bar that is perfect for both big groups and cozy dates. There's enough room to roam the floor, and while I would have liked the bathroom stall to have a door rather than a curtain, it was nice never having to wait in line.   I do regret leaving the fun and very chill Amante for the other bar where said jerk decided to be Captain Bringdown, but you know what? It's not arrogance if it's true, and I'm awesome, if only because I associate with people that are both sweethearts and fun as all get out.", 
    "review_date": "2009-03-23"
  }, 
  "F7SgSRGCnNDiPz9EBaicgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniella M.", 
    "review_text": "Came in on a Saturday night with 19 of my closest friends (Drunken trolley ride stop). Definitely a chill vibe, not quite a party destination. Nice decor &amp; lighting situation. It felt very mature &amp; grown up.. def not a dirty dive. My bartender lady was very nice &amp; didn't take 100 yrs to get me drinks &amp; door guy outside seemed like he'd be angry but was actually super cool to socialize with on our smoke breaks.. Plus he told me he liked my cowboy boots.. that's 5 stars in my book!", 
    "review_date": "2008-03-29"
  }, 
  "CMNeas2Y8ai4ImpPwgwAew": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Jennifer L.", 
    "review_text": "Fun bar! I hadn't been in years, since I now live in NYC, but I dropped in with a rather large group of people for some cocktails and it was a good time. They have infused vodkas and lots of seating, so it was a good place for us to hang out and catch up with old friends or chat up new ones. Made me miss my days of old in North Beach...", 
    "review_date": "2009-02-03"
  }, 
  "Xorep_PXj9XQH3UVquaZAA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather L.", 
    "review_text": "I have been coming here since it opened a few years back and it's still a great place to go for drinks. The bartenders are wonderful, especially Eric and Alfredo. Very sweet guys. They are the type to cut you off when you have been drinking way too much but in the nicest way. LOL. No, Corey it wasn't me they cut off. Spacious place but can get really packed. If you want a seat definitely arrive early. They can make accomodations for large and private parties. The drinks are delish!", 
    "review_date": "2007-07-02"
  }, 
  "ZBLZIOrO3DZJzDFlFO-bJw": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Carlos A.", 
    "review_text": "I'm not a huge fan of north beach. It reminds me too much of a frat party or it is where the east bay and packs of aggro guys come to party on the weekend. Amante is different though. It has dancing and unlike a lot of places in north beach is pretty big. I was impressed that they played a little salsa music the other night. I'd definitely go back. I do wish it had a larger spot to dance but I appreciate music + drinks.", 
    "review_date": "2010-02-03"
  }, 
  "suuIf6JWTZFjSu55k7zTBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cathy K.", 
    "review_text": "Amante is one of those hybrid establishments that attempts to please a wide range of clientele.    There are big screens for sports enthusiasts, a long curvy booth for recliners, a long hammered copper bar for pizazz seekers...they also have high ceilings and a comfy-cozy middle area for some breathing space.  The staff are attentive and friendly.  They even have Blue Moon brew on tap - a bonus for White Belgium ale lovers.  On the back bar, there's a tempting looking concoction of mango &amp; pineapple infused alcohol.  I hear it's a delicious but 'dangerous' drink since it's sooo easy to drink.  A must try for next time.", 
    "review_date": "2008-11-01"
  }, 
  "vWpe19iYR30nE8JvBtjwKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yelper A.", 
    "review_text": "I think the first night I went to this place they played the drum roll and this beautiful lady stood at the end of the bar and flashed the whole crowd....I think the bartender's egged her on though...they are THAT kind!\n  So of course, for the next 6 weeks I was on a North Beach kick because I thought every bar in North Beach was just that much fun.  Not true of course, but man!  That was a great 6 weeks!", 
    "review_date": "2006-03-01"
  }, 
  "RwTGtXFLaInMygIbtViSyA": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Jojo S.", 
    "review_text": "This place is awesome! Clean, nice, great music on, great food, unbelievable staff. Every time I go into this place, they always have done something a little extra. And on the big nights...wow! I've had a couple of New Years Eve parties there I won't ever forget. They just go the extra mile to make sure you have a fantastic time.", 
    "review_date": "2012-01-16"
  }, 
  "06xIElWq6CAvmtk1xHJWNA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Andrew W.", 
    "review_text": "Free olives, good drinks, and great pomme frites. I love nice pomme frites in butcher paper, I'm such a sucker for that... Minus a star for smelling like puke on this particular day... yeah, I know its a bar, I figure it doesn't ALWAYS smell like this... but normally I wouldn't even give a rating higher than 2 stars for just that... BUT *Free olives... o, and maraschino cherries, too!*", 
    "review_date": "2006-02-07"
  }, 
  "cgDZVtYICeiK5t1rkesamg": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Hazel C.", 
    "review_text": "Fun place to have a drink with a big group of friends!  After dinner at Don Pisto's, our group moseyed on to Amante for some more drinks and continue our chatfest.  When we walked in there, all the tables were pretty much taken.  As we were deciding what to do, the manager came up to us and asked how many was in our party. We told him and he told us that they can set up a table for us outside under the heatlamps. Great! That solved our problem!   We were seated a few minutes later outside which tuned out to be perfect. It was a little noisy inside with the music blaring.  Outside, we were able to talk without yelling and losing our voice.    My first drink was a Kentucky Mule which was nice, not too stiff, but not watered down either.  I ordered a Cosmo later on and that was good too. Beer, Campari and soda, and Moscow Mules were the other drinks people ordered. One friend ordered food from Chubby Noodle and he said it was good.   We were there for about three hours.  We were a big group, so I made it easier for our group of 10 and the server by giving her my credit card for our tab. I just had everyone one pay me back at the end of the night.  At around 11:30 pm, after paying our bill, we walked a few feet and stood in line at Golden Boy Pizza for a snack. I like that you can buy food from Chubby Noodle (cash only) while having a drink here or get pizza later a few doors down. And when we needed a taxi fast, we were able to get one right away! Will definitely be back here!", 
    "review_date": "2014-11-15"
  }, 
  "MJ6I2dX9-QZMw5bL-9inTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela T.", 
    "review_text": "A group of us went to Amante to celebrate a birthday and we had a blast. It was the first time for all of us, but we were totally welcomed by the bartenders and waitress. The ambiance is really great and the place had a really nice crowd going. Not overly packed where sweaty drunk boys are rubbing elbows with you, but a good size.  We'll definitely be back for more!", 
    "review_date": "2008-09-05"
  }, 
  "5keAoLzGQ2D06Zm_VbOwSA": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "Bouncer is a jerk and unprofessional. Go here all the time, typically the workers are nice. Get there prior to a Giants game and there are a few tables open outside. We take the only table left that you can watch the game from, it seats 4 people. Bouncer asks us to move unless we have more people coming. I ask if it is first come first serve, he states that it is but he would like us to move. I again say we do not want to because you cannot see the game from the other open tables. When we refuse his request for the third time he tells us to leave... Loved this place I have been going here for two years almost every week. I will never go again! We were polite the entire time, I was completely shocked by his treatment.", 
    "review_date": "2014-10-21"
  }, 
  "yVXR8ghRqFppf7UAQPegRA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Squid V.", 
    "review_text": "Tell Wizz and Mike that they are GENIUSES!!!  This bar is a bright, shiny, sparkly treasure done up in copper and jewel-tones nestled in the historic and eccentric neighborhood of North Beach.  I lived in North Beach for over 7 years, and no place made me feel more like a princess than the entire cast of characters at Amante.  Thank you all, and I'll be seeing you!", 
    "review_date": "2008-05-14"
  }, 
  "EuuyiAuEa_s3VSS9i8okmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah F.", 
    "review_text": "Oohhh!  I like this place!  It's very cozy and dark inside.  They  make a really good martini and bloody mary.  The bartenders are really efficient and nice.  I've been here on a weekday night, and it was super mellow.  Fun to just chat with a friend at the bar.  I've also been here on a Saturday night, and had so much fun people-watching.  Let's just say that there was a dance contest going on (informal of course), and one of the contestants de-pantsed himself.  It was hilarious.  One of those, \"Is this for real, or did I drink too much vodka?\" moments.  This bar is a no-attitude place, and very fun.", 
    "review_date": "2008-01-25"
  }, 
  "l7V5w_vf9xv74As3abZukA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John Eric S.", 
    "review_text": "Great wide selection of draft beers combined with nice classy decor.  You would not expect it if you were just walking down the street comparing it to the other bars up &amp; down Green &amp; Grant.   I like that the clientele is usually a little older &amp; more mature. But it's been a long time since I've been &amp; it was on a non-weekend night.", 
    "review_date": "2008-05-22"
  }, 
  "8DqQqPnWLMllH2Dd0bETtQ": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Chris T.", 
    "review_text": "Hole #1 For my friends birthday night.  <a href=\"http://www.yelp.com/list/lillians-birthday-crawl-san-francisco\">yelp.com/list/lillians-b…</a>  Had a beer and some cocktail that featured their pineapple infused vodka, the birthday girl ordered it, gotta make the b-day girl happy... Pretty chill crowd when we got here, (it was relatively early) the staff here was pretty nice, drinks came quickly and pretty reasonably priced.  Definitely be worth a stop next time im in the area.", 
    "review_date": "2009-08-15"
  }, 
  "2cQjPQaeYym48WhqUgoy7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chef S.", 
    "review_text": "Went here after my dinner at Masa's for a few cocktails.  The group of people were a bit younger than me but they were nice and polite.  Not the normal loud and drunk little Italy group that hang out here in htis part of town.  We sat outside and watched the people going by what fun.  I hope we were not as drunk as some.  The service was good and Mike the owner was very fast, made a great drink and was not too bad on the eyes either.  Will make this one of my new stops in the Broadway loop. Check them out .", 
    "review_date": "2011-10-16"
  }, 
  "JADdo9NEeO5Az9aOYbyvZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Manda Bear B.", 
    "review_text": "Gotta luv this bar, fun crowd, different theme each week, but 1 freaking toilet? What's up with that?  It's definitely a good place to kick it!", 
    "review_date": "2008-12-02"
  }, 
  "kNOa1uYcba620JzlAELPig": {
    "user_rating": 2.0, 
    "user_location": "Union City, CA", 
    "user_name": "Janice F.", 
    "review_text": "Well, it's walking distance from a bunch of different bars. Drinks are alright. The place does have a very cute bathroom. That's all I got.", 
    "review_date": "2010-06-14"
  }, 
  "UgOhVGUOMfCPFt7AF5MWog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsey G.", 
    "review_text": "Golden oldies playing overhead, pineapple infused vodka, sake flights (score!), chubby noodle in the kitchen with the most amazing chicken tenders on the planet - what's not to love!?  Amante is perfection.  No frills, ample drink choices, and some of the best food in North Beach if you're not feeling Italian. Pretty sure they have Wifi too since I saw some fantasy drafts take place there last night.  Really diverse crowd if you're into people watching (it's SF so you better be), and the staff is super friendly.  If I lived in NB this would definitely be my go-to spot, but I'll settle for whenever I'm in the hood.", 
    "review_date": "2014-09-04"
  }, 
  "W6fuQ6QitzS9AIKBqLHkEQ": {
    "user_rating": 4.0, 
    "user_location": "Napa, CA", 
    "user_name": "Jolene B.", 
    "review_text": "Had a great time with a group of friends at Amante! The door man was wonderful, accommodating our luggage until we were ready to leave. He also dealt with some unruly drama fiends in a professional way. All I know is someone threw a plastic cup in my direction during an argument and the argument didn't last long with the doorman intervening. My friends and I ordered a couple bottles of Chardonnay and tapas. The food was delicious- we had the pepper prawns and the pork shoyu ramen bowl; I especially thought the roasted corn in the soup was a nice touch. Our bar tender was very attentive and our food came out quickly after we ordered. He also kept the water coming which was extremely appreciated.  The place was pretty packed, so we started out at the bar but we were able to move to a table once our other companions arrived. Very fun place. I should add that the women's restroom only has a curtain around the stall, but you can easily lock the main door if this is an issue.", 
    "review_date": "2014-01-21"
  }, 
  "r-8eQ28RhnQPJdZXHcTXrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika C.", 
    "review_text": "Chill bar.  Looks very old school outside but it has casual contemporary booth seats on the inside.  They blast radio hits from the last five years or so and have the TVs tuned to baseball or basketball games.  They also house Chubby Noodle.", 
    "review_date": "2012-07-08"
  }, 
  "y2XPvYkAIZWxyknRQYM_EA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "NaNa M.", 
    "review_text": "This place reminds me exactly why I have avoided North Beach nightlife since I've been living in SF- it has perhaps some of the highest douche proportions I failed to remember. Why oh why was I convinced to come out here?? The bartenders were nice, and the drinks were decent, but the crowd was a big deterrent. I think there was some \"cowboy\" party that infiltrated and one of them proceeded to shove his ass in my face. When my friend asked him nicely to scoot over, he literally got in her face and told her to \"chill out\"...really? Next we were almost molested by a miserably drunk guy who was practically spitting all over us.  I remember this place as being a lot nicer...it just seems grittier. I also recall that there was a cocktail server who used to take orders, and somehow this was distinctly missing. The whole experience just reminds me why I need to NOT come to North Beach for the nightlife any time soon again....strip clubs, drunken fights- ahhh the nostalgia", 
    "review_date": "2009-02-22"
  }, 
  "LpVJ7DQ0K7qqIqDw_jMdTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natan O.", 
    "review_text": "I like this place.  The fact that I saw my favorite band play an acoustic set here makes me like it even more.  Located in the middle of North Beach, this cozy lounge/bar has a right amount of class and dive all at the same time.  My only complaint is that their beer tap selection could be a little bit expansive.  I'll definitely be heading out again to Amante (given I'm in the North Beach area)  Recommended", 
    "review_date": "2010-12-31"
  }, 
  "wJwLP9O7go2dxVhUpQ0jCA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kevin S.", 
    "review_text": "went here a few times, and every time it was a good experience.  I remember first encountering this place in the afternoon on a weekday.  Of course it was quiet and slow, but the bartender was nice.  He even introduced us to a good wheat beer.  So my friends and I celebrated in finding a cool new bar with some shots!  (FYI stick to one drink....Patron and Jameson do not mix.)    Another weekday, quite a few of us went and we were basically the whole crowd.  But we still managed to be lively.  Double Shots chased down with beer will definitely do the trick.  The bartender that day was real cool too and very sociable.  Last time i went there, it was with the usual gang but the first time being there on a weekend.  Totally different atmosphere.  I wasn't used to seeing a lot of people there.  The crowd was cool, the bartenders were friendly as usual, and the drinks were great!!!", 
    "review_date": "2008-06-17"
  }, 
  "puS8HuNdeXhhl5F4bb0EEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam S.", 
    "review_text": "This is a winner!  I like the decor, very classy.  The music's not loud,  you can actually have a conversation.  And the margarita was awesome.  They played my song \"Happy Together\" by the Beatles...so this is definitely a keeper :)", 
    "review_date": "2010-08-06"
  }, 
  "Uqg8zgMw-JYJNpjVtFXqng": {
    "user_rating": 2.0, 
    "user_location": "CA, CA", 
    "user_name": "Nicole R.", 
    "review_text": "Amante's is very nice inside, I will give it that.   But other than the cool decor and prime location (I live very close) I don't think this place is worth going to. North Beach has some great bars for after-work relaxing, to meet and mingle or to get trashed with your friends. Amante isn't one of them.  I don't know, this place is just boring. I'm all for a chill bar, but this one may be too chill in comparison to other choices.", 
    "review_date": "2007-01-14"
  }, 
  "ThpoaPHDW5fNj_fYvNsiaQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea F.", 
    "review_text": "First off, I would like to say that this is the FIRST review I have ever written. I signed up for Yelp just to write this.   This was by far the worst customer service experience I have ever had. When paying for the tab we asked our server if he would split the tab up 8 ways on different cards. He agreed that that was fine. He came back a few minutes later to retrieve our money and my friend that hands him the cards says we have $40 cash and 7 cards and he was like no, no I just want to run the cards and not take the cash. So then my friend was like ok well there are only 7 cards instead of the 8. Well, our server still divided our bill up 8 ways on the 7 cards. So when he came back to retrieve our signed receipts, kept asking where the last receipt was. He started getting all perplexed and was like no there were 8 slips. My friend, re-explained what she had already told him about there only being 7. He then proceeds to tell us that we were a bunch of drunk girls and didnt know what he was talking about (it was 830pm on a saturday and we had each only had 1-2 drinks as well as dinner the 2 hours we were there) and that it wasn't his fault. He started getting a horrible attitude with us and yelling at us. We were NOT trying to screw him by any means and wanted to make it right but he would not listen to what we were saying. THEN, to make matters WORSE, the OWNER, yes OWNER comes over and yells at us saying that this issue was taking away from the other customers and that we needed to get this issue resolved. Ok, I am sorry but please do NOT yell at US for your server making a math error!! So, instead of leaving we were STILL trying to make things right, so we head over (just my friend and I who have BOTH been in the service industry) to where the owner and our server were to try to resolve it. We asked him what was the difference owed. Our server then tells us that he would like us to \"get the hell out of there and out of his face.\" Seriously?!?! 8 girls that ALL live in North Beach, that come in there quite often are now NEVER going back there. That was the rudest I have EVER been treated at a restaurant in my life. We will never be going back there and I am definitely going to make it a point to tell everyone else I know not to ever go back there as well.", 
    "review_date": "2011-03-25"
  }, 
  "FasNCo26SxBqncV3nX2-mQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "Anna K. had her birthday party here last night.  Luckily, this bar is pretty big because she's pretty popular.  hehe  They have big tables that would be perfect for playing cards if you had some.  We didn't.  But it was a good (albeit brief) thought.  I was so impressed by the bartenders.  I never had to wait long for my irish car bombs ...and it was packed!  Happy Birthday, Anna!", 
    "review_date": "2009-03-22"
  }, 
  "o-t-i7nbT5N_cmkCXs5oDQ": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "David S.", 
    "review_text": "I was on the verge of wastedness when I ended up at Amante after watching the 4th of July fireworks. Not my kind of place... but I did end up having a pretty good time nonetheless. My friends and I had a few booths reserved, and I most definitely would have passed out on one of the couches if it hadn't been for the endless reruns of the day's hotdog eating contest on the giant TV screens, and more specifically of Kobayashi barfing in his hands... delightful!   Then, as can be expected at this kind of place, I got hit on by a girl. Big time.   Straight Girl: Heeheehee, can I sit next to you? Heeheehee.... David: Huh... yeah... (I tend to freeze when straight girls hit on me) SG: Are you having fun? Heeheehee.... David: Hmmm yeah, I'm here with my friends for a wedding celebration... SG: Oh that's nice, but I hope you're not the one getting married... heeheehee... David: No, not me, my friend Jeremy over there.... SG: To the girl with the blonde hair? David: Well, not that one, another girl with blonde hair. SG: Oh heeheehee... oh my.... You're wearing a ring, are you married? David: No, I'm not married...  (to myself: hellooooo... look at me... do I look straight?... and I'm sitting next to my bf with my hand on his leg... which planet do you come from?...) SG: Oh good... I wouldn't want to be hitting on you with your wife here... heeheehee... David (vomits in his mouth): Heeheehee... SG's brother (to SG, in her ear, but loud enough for me to hear): Sis, that dude is GAY! SG (to me): Heeheehee... my brother says you look really nice... Heeheehee...  God, I almost felt straight when I walked out of there.", 
    "review_date": "2007-07-05"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "I'm slightly ashamed to admit that I went to Amante for the first time last night even though I've lived nearby for two years... for whatever reason though, Columbus Cafe would always seem to lure us in...  We were at Amante briefly last night to meet up with friends. The ambiance was really pleasant and my Captain Morgan's with pineapple juice was the best I have ever had!  Do they have a happy hour to compete with Columbus Cafe's awesome token-y happy hour?!", 
    "review_date": "2009-02-01"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "i'm never in this part of NB, was was here for the NB faire.  kool litte place for NB with friendly staff, but if you want a stronger drink or heavy handed shot...order from the owner.", 
    "review_date": "2007-07-08"
  }, 
  "R4DVayqiW63jHle7AG_NXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha M.", 
    "review_text": "This place is super nice. Love their live music on wednesdays, the crowd, and the vibe. Drinks are served with a smile, and it's quite a spacious, nice establishhment. Will go back on a weekend with some friends and update the review accordingly.", 
    "review_date": "2010-02-10"
  }, 
  "NO6YrLQ4xUJ4_dJRD2f4ww": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle D.", 
    "review_text": "I like the bar well enough. Chubby Noodle is an excellent addition, though the two ticket system can be a pain at times. What I don't like is coming to watch the Giants and being asked to leave. Two of us got there in time to get one of the 4 tops outside to watch the game, we were asked to move to the seat directly below the TV. You can't watch the game from there, so we said no. The bouncer stood over us for a little bit and then asked us to leave. Amante is a decent bar as long as you aren't going during any games. Either way, I won't be back.", 
    "review_date": "2014-10-22"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "Great setting and in the heart of north beach without the pretentiousness that other places provide.  If you just want a drink and enjoy friend's company...this is the place for you.  Also fun for dancing later in the evening and who can beat the fact that they are on the same block as a lobster shack and a pizza place?  Too good to be true at closing time!", 
    "review_date": "2007-09-13"
  }, 
  "Pp72B99pJ5a1WlvbAoat-g": {
    "user_rating": 3.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Blake O.", 
    "review_text": "I went here with my girlfriend after dinner last weekend after reading some reviews.  Amante is located on a good strip of bars and restaurants in North Beach away from the hustle and bustle (putting it nicely) of Broadway.  For midnight on a Saturday, it had the perfect-sized crowd (enough people that you don't feel like you're missing out on something somewhere else, not so busy that you cannot get to the bar).  The decor and lighting were nice, I dig the mirrors behind the bar.  The music was standard fare hip hop and the like.  It was loud enough to notice but not so loud that you couldn't carry on a conversation.  The drinks were a little weak, but they were fairly inexpensive so I didn't feel cheated.  In all it's a good place to wander into or to start a night but I wouldn't call it a destination spot.", 
    "review_date": "2007-04-16"
  }, 
  "IxKVvGmFIEz77YYL-5_YxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N S.", 
    "review_text": "Get here a little bit earlier than the typical bar scene and this place is really mellow. Get here a little late and you might meet a girl who says \"hello\" by throwing up on your shoes (true story). Anyway, during the week, the comfy couches, Amante allows you to unwind for a really happy hour. And surprisingly, they have the best fried calamari we've tried in the city so far - really light, crispy batter without the grease.", 
    "review_date": "2011-03-08"
  }, 
  "hkOiI-ctPYFuurzJZF6H9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anjali K.", 
    "review_text": "I left the city to go live in the jungle for 6 months and Amante was the last bar I went to.  Amante to me is what's great about bars in San Francisco - the girls in big shoes and black pants feel just as comfortable as the boys in flip flops, shorts and sleeveless parkas with long-sleeved rugby shirts... The drinks are super strong so everyone is rather friendly... The music can bump everything from Madonna to Groove Armada to some crazy under ground stuff I didn't even know... The bartenders are friendly... and it's dangerously close to Golden Boy... that spell fun!", 
    "review_date": "2005-07-16"
  }, 
  "WDleS2FNQZnbQ7koiO-xuw": {
    "user_rating": 2.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Jeannette G.", 
    "review_text": "Whatever. Friday and the place was empty compared to all those around. Vague explanation as to what food they had. No happy hour things advertised. Don't make me ask what you have and how much it is. Went elsewhere down the street.", 
    "review_date": "2011-10-30"
  }, 
  "zpWizDgUk4-rQJXdjiBY1w": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Christina L.", 
    "review_text": "This place was cute, but a little empty.  I went with a group of 10 people. This was our first stop, we sat around the table and each ordered drinks. Their drink menu is pretty decent, $7 drinks, not too shabby!! I forgot what I got that night, but it did have malibu rum in it, which makes it a delicious drink. I think it was a tropical storm, who knows.   This is where the bar hopping started and kind of ended... maybe it was the mood or the sitting down part. Who knows. I would come back for the drinks, but would want to make sure that we don't sit down at one of their tables. I think this would have been a good place to end the night, but not start it.", 
    "review_date": "2011-06-08"
  }, 
  "98Ivr1U5d-Ohyq9DrT4ncg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Minks M.", 
    "review_text": "This place is fantastic. 4 stars only because the bartender was a douchebag once but apart from that I have had a wonderful experience everytime I have been here. The good thing is that you can get food from here since it also has chubby noodles restaurant. You may come here from Don Pistos, another very good establishment in north beach since the restaurant and the kitchen in Amante is owned by the same individual.  Enjoy the atmosphere here, people are nice and trying to have a good time. Most of it is a younger crowd but you'll always run into a few oldies.", 
    "review_date": "2013-03-17"
  }, 
  "YFNAYiWUDuNqv57VS5tXPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T S.", 
    "review_text": "Chubby Noodles was delicious. The drink were well made but nothing to write home about. I ate the Pork Braised Ramen (enough to share) and Kung Fu Chicken.", 
    "review_date": "2014-07-16"
  }, 
  "QDuONv3yYUSF-2oyTgR67A": {
    "user_rating": 5.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Tami G.", 
    "review_text": "Chicken strips. They are out of this world!! for about $10, you get a small bucket that has 5 strips.  It is more than enough food for one meal.  the special sauce is also amazing!  Give it a shot, it wont disappoint.", 
    "review_date": "2012-07-29"
  }, 
  "tpSWa88HEv2OgD3RZuGNqg": {
    "user_rating": 5.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "A H.", 
    "review_text": "Great bunch of people running this place. If you're in the NB and looking for a place to get lit, you cannot do wrong at the big A.  And get some food while you're at it.  Try the chicken skewers with a double bourbon chaser--my favorite.", 
    "review_date": "2007-08-09"
  }, 
  "220NBEU9WyTrI077MPPlJg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carolyn K.", 
    "review_text": "No cover! Horray!  On a drunken Saturday night, the weekend before St. Patrick's Day, we skipped out of King of Thai Noodle bar through the crowded sidewalks of North Beach and found ourselves inside Amante.  Large place, with a large bar (makes getting a drink much more pleasant), and seating! Classier than I was expecting (from North Beach, and in general), with ambient lighting and boppin' music. Seating definitely upped the place a couple stars for me. After a 2-hour trek through Lands End and Golden Gate Park earlier that day, the last thing I wanted to do was stay on my feet the whole night.   Went up to the bar and asked for \"vodka with pieces of fruit in it\" because that's what was recommended on Foursquare. The bartender probably thought I was a little mentally challenged, but if he was, totally hid it well and said, \"Well, we have pineapple infused vodka, you want to try that?\" It turns out that that was exactly what I wanted to try!   Ordered it on the rocks (will try martini next time) and took some sips. It went down really smoothly and was definitely pineapple-ly. I decided to make it even more delicious by asking for a glass of Sprite (for free, yay!) and mixing it in. It was very yummy.   Drinks not too expensive (beer was only $5!) and we chatted over the loud music. Really awesome place to chill with a big group if you're in North Beach for non-strip club reasons.   Only gripe: the bathroom only had 1 stall. I don't think it really bothered my friend, though. She took a look at the line and decided the men's bathroom would be just fine for her. The guy who arrived shortly after she went in was pretty surprised/confused when she came out!", 
    "review_date": "2011-03-15"
  }, 
  "_7fk4-KdfN2CwsqDushe7g": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Marie M.", 
    "review_text": "Let's face it...a step up from other local North-beach eats &amp; drinks. Nice place to stop in and meet with friends. Great to see Bobby Mccambridge during the day and the Owners giving it a club feel when the sun goes down. In my opinion they have hit the mark when it comes to a nice place where everybody knows your name....neighborhood bar. GOOD JOB! Definitely gonna go again!", 
    "review_date": "2014-06-19"
  }, 
  "Q-kBgH-JZSLKqkdzUG9YQA": {
    "user_rating": 4.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Romeo And Lola K.", 
    "review_text": "This is a great place for FISH TACOS! We've eaten here several times and always order fish tacos; they are great. Not what you would expect to find at a bar. To clarify, these tacos are delicious even prior to several Captain &amp; Cokes or Ketel Sodas with a squeeze of lime. I typically order the fries which come with a side of ranch dressing and ketchup. Some of the best fries I've ever eaten. I think they drizzle crack on them to make so addicting. The come in a cone shaped holder-thingy and I usually try to squeeze my hand into the skinniest part on the bottom to get the last of the fries at the bottom. Recently tried a pizza and was not disappointed. The ribs were edible but I would not order them again.", 
    "review_date": "2007-10-23"
  }, 
  "OZmtokMDUkol8x19D0sxwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tommy W.", 
    "review_text": "Great upscale bar without the upscale attitude. The staff dominates  the beautiful copper bar and the fish tacos are out of this world.", 
    "review_date": "2007-07-25"
  }, 
  "jkr3YVCEoRNKkxinUZpW6A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanne G.", 
    "review_text": "Yes to Chubby Noodle, but no to the cheesy music and bad drinks at Amante.  They served up possibly the worst whiskey sour I've had-- something was completely off with their lemon juice.    But for Chubby Noodle and their peppered duck noodles?  Totally worth a visit.", 
    "review_date": "2012-09-15"
  }, 
  "7rjAgnw-DsHThvzf6TDBLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ross G.", 
    "review_text": "Went here for a DYL event (my first!) recently and really enjoyed this place. It is a high quality drinking establishment, with its ample standing space, plenty of seating at the long bar and cushioned seating as well (couches and such).  The only issues that I ran into was flagging down the bartenders, which I put down not to their ability but the fact that it was a long bar and lots of people waiting on drinks.  Once I did however I had a drunken conversation with one bartender who had just come off duty; another bartender came by and jumped in. Together they gave me an awesome list of bars/restaurants that aren't tourist traps in my neighborhood: North Beach (they do exist!).   Beers were reasonably priced (5 bucks a Guinness), and the only hard liquor I had was a pineapple/mango vodka infusion (chilled) was tasty, but I can't really vouch for their drinks otherwise.  Also, they're close to Golden Boy Pizza, if you get hungry.", 
    "review_date": "2008-05-29"
  }, 
  "yeUX_IIw2ysegz2k5Tjwww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay C.", 
    "review_text": "I love this bar for an after-work drink on the weekdays. Even though it looks like trash on the outside, it has a very classy and aesthetic feel on the inside. Although I prefer this bar when it is a little slower, weekend nights aren't so bad either (if you can tolerate the couples making out on the couches)!   Anyways - it's definitely recommended. AND, I am super excited to go try these ribs that Vanessa is talking about! Details to come...", 
    "review_date": "2006-12-15"
  }, 
  "6ybp1lO5UkyqDHWL0bEOJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francis M.", 
    "review_text": "There last night for a networking mixer.  Good to see this place is still going strong.  The food isn't bad either (for a bar that's a compliment).", 
    "review_date": "2010-03-04"
  }, 
  "1y5jl7wdDoJ3RacNAcZreA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don C.", 
    "review_text": "i'll be back for sure. i mean, considering its north beach, this place has a nice dark lounge-y bar atmosphere with a up-beat crowd. i met tons of cool people that were out to have fun. Not to mention, the staff is A++. Bartenders are cool with no big egos/attitudes and if you happen to get so drunk there (say from drinking all day at pier 23 on a sunny labor day) that you forget your credit card. well, they'll keep your card in a safe place until ya regain your sobriety. thanks guys, you rock!", 
    "review_date": "2008-09-09"
  }, 
  "lDl5JBIxIZZWahib8zCIBg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geordie E.", 
    "review_text": "Amante means lover in Espaol. Nice crowd. Stiff drinks. Friendly &amp; efficient staff. Nice huge screens when things get boring...they won't.", 
    "review_date": "2008-06-21"
  }, 
  "dim5Svrt-B1jvvQsOIX22A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Z.", 
    "review_text": "Wow, as everyone says, this is a really chill bar.  Great variety of drinks, prompt service from the bar, and a really COOL sign outside.  And the sign is what drew me in there in the first place.  North Beach bars tend to be hit or miss on the weekends, but Amante had a very nice crowd...except for the jacka$$ that thought there was a wet t-shirt contest going on.  I don't know why else he would have spit a mouthful of water all over the front of my shirt.  I brought it to the cute bartender's attention, and they promptly threw the drunk jackass out of there!", 
    "review_date": "2006-11-12"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Loud bar. Lots of rude people hovering over our table. Definitely a lot of drinking happening here.", 
    "review_date": "2012-09-08"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "guinness $five, but $four bud light?...regular pricing steep for domestic brew...a drink and chubby noodle meal...mellow night for food and brew...tables plenty during regular pricing hours...drink orders at the table...by friendly server...northbeach gauntlet...amante....wooden aged pub along many of many saloons....one irish car bomb...3/4 pint guinness, 1/2 shot bailey and 1/2 shot jameson.....on to the next!.....or home.....", 
    "review_date": "2008-11-13"
  }, 
  "v4C8VqqXhwvP0KuhWkCL6Q": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Gabby A.", 
    "review_text": "Walking around North Beach, my group and I decided to check out different places. This was one we picked because it didn't look super crowded like the place next door. The Amante is pretty spacious and had lots of available sitting for the entire group I was with. The drinks were decently priced and it was not extremely loud. Didn't have the food and looking at the pictures on Yelp made me wish we had! :(", 
    "review_date": "2013-04-13"
  }, 
  "m-2lsMLw6H140wVhGCa-Tw": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mike C.", 
    "review_text": "Good drinks. Never been there late night, always there as a pre-going out warmup.", 
    "review_date": "2006-11-10"
  }, 
  "5iCzdzUFqbwwjgYkfr2nhA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Mark L.", 
    "review_text": "This place is ok.  I like the ambience it has in its decor...the first thing I thought about when I came in here was holy shit! that is a big fuckin mirror over the bar.  The second thing was that if an earthquake had occured that shit would fall and hurt someone, most likely the bartenders.  This place is ok, I would like to check it out during a live performance to see how that is.  However, this trip we were working off a weird mix of music--I think someone was working off an iPod on shuffle--so the mixes were random at best.  Crowd here seems really friendly with a diverse group folks especially by age.  Bathroom is decent for a bar.  Bartenders and wait staff was nice too.  One dope plus for my visit here was that an old clown lady showed up and was making balloons for people in the room, which definitely added to the fun.  The staff at Amante should have her come more often since she livens up the place while people wait for their drinks.  Because of the weird clown lady who reminded us of the short lady from Poltergeist, I added my third star.  Pretty down to check this place out again.", 
    "review_date": "2009-11-24"
  }, 
  "oERMSLAzHBccAxuK-04ceQ": {
    "user_rating": 4.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "Mia A.", 
    "review_text": "I have been raised in the eastbay however North beach is like home to to me.I know the church, I know the restaurants etc.Alot has changed from when I was young and used to hang out here.There are bars in this area that i would not step into because the people that own them are so slimy, , that I would not trust using my credit card! The owners of this bar are great  and they make a mean infused pineapple/mango vodka to die for.Try the Baja style tacos, YUM! If you want to shoot some pool go to Gino and Carlos.Check my other reviews for North Beach.I will only  tell you the ones I like because I don't want to sleep with the fishes!", 
    "review_date": "2011-10-21"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "This is a great bar, not directly on Columbus as to avoid attracting too many tourists, and very classy, in my opinion.  The thing is, it feels upscale (with all the velvet banquettes and bar stools and the gigantic mirror and high ceilings)...but it's very laid back - you don't have to dress up to come here.    The drinks are decent and I always have a good time here!", 
    "review_date": "2006-05-03"
  }, 
  "Da_ZO8lKwIacljqKUJbAlw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jill k.", 
    "review_text": "especially cozy after a few hours in soma.  i liked the couches and the kitchen (yay for pomme frites!)  slightly classy, but not overly so.  too bad parking in north beach sucks...", 
    "review_date": "2006-02-23"
  }, 
  "15znE0NM6nDU2oR-i5RXVA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Lisa K.", 
    "review_text": "One time I got to watch the wizard of Oz, drink cocktails, and dance with cute boys... all at one bar! It was like I had clicked my heels and come home...", 
    "review_date": "2006-11-10"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Cool bar playing top 40 hits.  The bar and chubby noodle are separate businesses.", 
    "review_date": "2012-04-09"
  }, 
  "yfG8hiLv0mA0ltTNXERuYQ": {
    "user_rating": 4.0, 
    "user_location": "McKinleyville, CA", 
    "user_name": "Roxanne S.", 
    "review_text": "Stopped in here for a drink before they started serving food, and had a great time! The drink was good, the bar was beautiful, definitely be back to try the food!", 
    "review_date": "2013-04-14"
  }, 
  "2l9kaRFEX2w9MBL_lGzC5A": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Tricia D.", 
    "review_text": "Best bar in North Beach...love the staff and the food is excellent..Try their fries. I had to ding them a point b/c they stopped showing Sex and the City on Sunday afternoons.", 
    "review_date": "2007-07-17"
  }, 
  "2l0O1EI1m0yWjFo2zSt71w": {
    "user_rating": 4.0, 
    "user_location": "Carmel by the Sea, CA", 
    "user_name": "Shiho F.", 
    "review_text": "Um came here the a month ago with some old friends... after a Giants game... we had so much fun tailgating and eating suasage that we missed the frewakin' game... Hit up Amante's after and stayed there the rest of the night until it was time to go to bed... You know you had a good time in the city when you can stay at one bar and wake up in Berekley with your best girl friend from high school (c/o '98) in nothing but a shirt...", 
    "review_date": "2009-08-09"
  }, 
  "bADntnjBXIPHzFBo0RlRGA": {
    "user_rating": 4.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "Barry O.", 
    "review_text": "Decent bar for a few drinks with a small group. Quick service, good atmosphere", 
    "review_date": "2014-03-13"
  }, 
  "VBteERaoP6gXcX2O0xn9SA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Paul M.", 
    "review_text": "This is an epic bar. The service is amazing. Food is available Tuesday thru Saturday. The drinks are incredible. The bar tending is old school and friendly.   I love this place and will make it a regular hangout.", 
    "review_date": "2012-02-21"
  }, 
  "op_PKWquyGZyYQkGv9V20w": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Me H.", 
    "review_text": "What I remember from my SF DYL at Amantes: Friendly yelpers who had no issues with fat chicks at happy hour Scrumptious pineapple infused vodka Great skinny bitches The ladies room; very Prince like Nice candle holders that look good on my desk And last but not least I learned \"He who does not drink stays sober\" so I drank. Good times were had for sure!", 
    "review_date": "2008-06-09"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Came here when there was a Michigan State game.  I conveniently wore green, so I didn't stand out.  Loved the energy, but it was way too crowded!  Felt like college again.  Despite the crowd however, service was SUPER FAST.  Since it was like 4 pm on a Saturday, drinks were super cheap as well.  Even the shooters were $3 a piece :)   I was only there for 10 minutes because I couldn't handle the crowd.  It must be nice to understand football, but I don't know the rules or anything like that.    From the outside, it looked like a cafe because there were a couple tables outside where people were just eating.  It's deceiving!  Inside, the decor is actually quite nice compared to what it looks like on the outside, too.", 
    "review_date": "2012-09-19"
  }, 
  "3XChzdVSI4aoXjr8YTx_KA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jamie C.", 
    "review_text": "You know those movies, where someone stands at a piano singing, then another person gets up and sings, and some people are dancing, and you think \"wow, wouldn't it be cool if life was really like that?\" Because I don't know about you, but when I go to parties, no one is standing around a piano singing.  This bar is the equivalent of that movie, and it's great.    Went here last Sunday to see Carol Doda perform.  What a great show. She sang, then another guy who reminds me of a sexier Martin Landau sang, then a woman from the audience sang (although really, no white lady can pull off Birth of the Blues, I'm sorry.  Her voice was beautiful, but that is just not a song for anyone but Sammy).  Then a couple got up and danced.  Then the guy from that couple sang O Sole Mio.  What a great, and wildly entertaining night.  It's nice to find a bar that's not overrun with mannerless frat boys in flip flops and their equally ill-dressed sorority friends.  This is a place for grownups.  Grownups who want great drinks and great entertainment in a really cool, old-school atmosphere.  Oh, and Willie Brown had a book signing here one evening.  I think that really says it all.", 
    "review_date": "2008-04-30"
  }, 
  "IDVX4Is4CanREchBmpFXoA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jim L.", 
    "review_text": "A classy and spacious North Beach joint, I really like the setting of this place, with its enormous mirrors strategically placed around the room for maximum bizzel-scoping, and the amber-backlit liquor bottles set on the perch behind the bar.  The only thing I didn't really appreciate was the enormous pink and purple neon sign glaring out from the corner exclaiming \"Hungry? Our kitchen is open!\"", 
    "review_date": "2005-12-01"
  }, 
  "wb2I6PxYjRStE7OGLL4S7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "Me: \"I need a drink...it's been a loooong freakin' month\" Mike G.: \"It's a Wednesday night, you have problems\" Me: \"I don't care if I have to go sit at a bar by myself, I'm getting wasted tonight\"  Mike G.: \"Alright, I'll go out for one, but that's it\" ........... 3 hours later....  Mike G.: \"This place is AWESOME...I'M SO GLAD WE CAME HERE!!\"  That's right folks, Amante changes lives. Well at least it spruces up an otherwise dull Wednesday night. The live band that plays every Wednesday was actually pretty good and the lead singer had me up off my ass and shakin' it on the dance floor. The place was otherwise pretty dead with just a few other random locals, which is to be expected I suppose on a Wed. night. Either way....Amante was just what I needed to boost my spirits!  Amante is a nice alternative to the other dive bars (not that there's anything wrong with said dive bars) in the area with their plush couches, deliscious cocktails and sexed up bar scene.", 
    "review_date": "2009-10-01"
  }, 
  "G63Z9erAE8uVnh4pnG7Yyg": {
    "user_rating": 5.0, 
    "user_location": "Mountain Home, AR", 
    "user_name": "Cindy P.", 
    "review_text": "This is a wonderful actually to me was a neighborhood bar when I lived there. The bartenders always remember you. Even after being away for almost a year they all remembered me, when I dropped in to visit. Great crew, and they will take care of all your needs. A night out gets no better then Amante.", 
    "review_date": "2012-03-14"
  }, 
  "hSD2Lu8Z_62klnMDND5sSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "Amante:  Means lover in espanol.  I love this place. I haven't been in so long and I just revisited it not too long ago. Unfortunately it doesn't pack them in like it used to when i first move here, but decor is so cute, and dim, and the bartenders are SO nice and attentive (you are get great service). Boy do they know how to make a drink, and the pineapple infused vodka -- wow -- two of my favorite things TOGETHER!  They also serve food, and from what I have had it was pretty tasty. Check it out.  P.S.  Try to get the window seat and the front and draw the curtains closed - if you can!", 
    "review_date": "2007-06-25"
  }, 
  "vYbkZwjGS2DJySnPZM_C1A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C B.", 
    "review_text": "Ok place. Is fun on a busy weekend night, but definitely gets a bit crowded. best part is that they are close to golden boys", 
    "review_date": "2010-03-28"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "This bar is fun. Never douchey, great mix of people, cheap drinks, tvs so you can watch the game(s)  ... I spent NYE here and there was even a balloon and confetti drop! I totally didn't expect it...  Just get better bathrooms PLEASE. There is only ONE TOILET with a weird velour curtain. I don't want to even think about what type of germs are incubating on that thing because it probably hasn't been washed in ages.  This is the worst thing about this place. The line starts looking like the line for Ike's sandwiches. Ladies, why the hell do you take so long!? Drop your panties, do your biz, wipe the taco, pull your pants up, flush, wash hands YOU LOOK CUTE YOU DON'T NEED TO REDO YOUR MAKEUP gtfo!.   Otherwise, I dig this spot.", 
    "review_date": "2013-01-09"
  }, 
  "M_SxfmZjepJYxE_vNbWK4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deanna T.", 
    "review_text": "Whenever my friends and I go out without a plan or a particular place in mind, Amante is where we'll gravitate towards. Amante has been the start and an end to many memorable nights. Alfredo and Wiz are super cool people that always take care of us while tending to the rest of the bar, so you never have to wait long for a drink! And when it's slow, they let me make my own =) When the kitchen's open, be sure to try the fish tacos and fries, it'll compliment any drink you're having.   The crowd ranges from older locals to the limited but present bridge and tunneler's to the stripe shirts who've lost their way to the Marina. And then there's us.", 
    "review_date": "2008-01-27"
  }, 
  "lCmvpQfFpdxhbWVM59eUCg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn L.", 
    "review_text": "\"Decent bar and decent bar food- pizza and fries are actually quite good. Kinda dirty though. But central location\"", 
    "review_date": "2009-02-08"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "The waitress doesn't know how to prioritize with accompanying groups when they want to be seated while there are 2 reserved tables put on hold and we were eyeing those 2 spots for a good 20 minutes.  It's common sense to just get us seated and forfeit at least 1 of the reserved tables.  It was after 8pm on a Wednesday and surely almost everyone has had their group dinner by that time.  Her excuse was that those 2 tables are reserved for big parties.  We asked if the parties called in for reservations and she said no.  What the heck!  So it is unclaimed while we were waiting and hungry.    The only reason why I brought my girls to this place on a hump day is their combination of a bar scene with Chubby Noodle as their food vendor.  Other than that, we could have grabbed our drinks somewhere else.   Amante's Pink Drink, Margarita and Sidecar were all cocktail drinks that were decently priced.  Still not great to outweigh the service.", 
    "review_date": "2013-05-28"
  }, 
  "r0E3thgIfJm6S_jaUznL5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shelley S.", 
    "review_text": "This place is nice. I can actualy hear what people are saying to me. It's more of a chill night life. Everyone is always friendly.  I like to start off drinking here. A great place to meet up at too.", 
    "review_date": "2006-06-21"
  }, 
  "zyNGr5Tlg1rK1frevXCx2g": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "melissa g.", 
    "review_text": "I love Amante, but I'm biased since I absolutely love Wizz (Mike too).    Amante has been one of my 'go-to' spots for a few years now. It's a great intimate space. Some nights it's packed, others it's nice and mellow the way a lounge should be. The drinks are always solid and I can never get enough of the pineapple infused vodka on the rocks. The drinks are poured heavy and are cheap compared to other bars in the city.   Last night I threw a party here for the first time and had an incredible time. It's a great venue for small parties if you want a lot of room to move around or larger parties (100+) if you want to keep things comfy and cozy .   The best thing on the food menu are the fish tacos...  Thanks Wizz!!  1-800-COLLECT", 
    "review_date": "2006-12-10"
  }, 
  "tV7_Prku_wwOnjSz-8-4tw": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Victoria M.", 
    "review_text": "We stopped in for a drink and some appetizers before a show.  Not too many people around at first but it started filling up with groups of people coming in all at once.  They have lots of group tables/areas.    Upscale modern decor, ala dark wood and stained glass.  It's nice, makes it definitely not a dive bar.  Great wine list, and great appetizers.  The spicy/sweet shrimp was awesome, and I usually don't like shrimp, or spicy for that matter. But I would defiantly get that dish again.  The chicken skewers were big hunks of well marinated, tender chicken.  And the fish tacos were equally as delish as the other two dishes.  I seem to be on a role lately of meeting bar/restaurant owners!  This owner served us our drinks.  Very nice, down to earth guy who knows his business inside and out.  It's no wonder the place is a success when you meet him.", 
    "review_date": "2008-04-14"
  }, 
  "b-1dsipvOL7X79xmUaz9QQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jsphn T.", 
    "review_text": "Wizzy, Michael &amp; Alfredo? BEST! BEST! BEST! i love the hamburger ;).", 
    "review_date": "2011-04-25"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "Came here with the Sottomare crowd and the bartender and doorman were funny and nice.  Not sure on the cocktails since I had shots but the music was good.  Danced a little salsa and it was fun.  Some people were just sitting and catching up.  We were probably one of the most obnoxious ones there...", 
    "review_date": "2013-04-29"
  }, 
  "9j3EILvGpHgoOy70rIP4XA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Christine P.", 
    "review_text": "There are many times that I wish I was better with names, and this visit to Amante was one of them.  I came here for pre-dinner drinks on my birthday, so the place was fairly empty.  I love the interior!    But even better was the service I received - our bartender (I unfortunately don't remember his name, or maybe I even forgot to ask) was great!  My boyfriend asked for a particular cocktail, but since the bar didn't have one of the key ingredients, Mr. Bartender whipped up an even yummier drink.  As I sipped my gin and tonic, I even contemplated asking for the same drink my boyfriend got, but I had already given him enough crap about ordering fruity drinks.  =)", 
    "review_date": "2007-08-23"
  }, 
  "In-jPXAVKHLbR_7pjESGPA": {
    "user_rating": 4.0, 
    "user_location": "Gilroy, CA", 
    "user_name": "Mark C.", 
    "review_text": "Friendly accommodating and warm with great background music.Nice nite cap spot in North beach..plus Eric (bartender) laughed at my jokes", 
    "review_date": "2012-05-31"
  }, 
  "woW3EEoyj5M42Z7yXLhNLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna K.", 
    "review_text": "Any place that puts up with my high-maintenance ass deserves 5 stars, but I'd give more to Amante if I could. I hosted my 25th birthday party here on Saturday, and at the risk of sounding like an over-excited frat boy (Hi Keith Charles!) it was EPIC. I knew I'd found my venue after corresponding with Amante's events guy, the aptly named Wizz, when he promised he'd personally see to it that the playlist excluded Journey and Def Leppard (there's a reason I didn't choose a Marina bar, after all). The rest of the staff was equally accommodating and attentive- huge props to our cocktail waitress Emilie and all the bartenders for making sure all my guests were (over)served. Thanks so much for coming out friends, it was truly a night to remember... in pictures anyway.", 
    "review_date": "2009-03-23"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "Stopped in here again.. It was NYD, and the nearby bars we usually go to while waiting for seats at Tony's, were all closed.  The place was busy, but we easily got seats away from most of the TV's and sports fans.  Our friends hadn't been here before, and I think they had a good time as well.  The owner did decide to close early, but not before making us all another drink and chatting a bit.  Lots of eating, nice bar area, well made drinks and reasonably priced.  Definitely adding it to the rotation when we're nearby.", 
    "review_date": "2015-01-08"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "May 11, 2007 @ 7:30pm: Kicked off the birthday pub crawl with a shot of fernet!  As the rest of the party chilled at Golden Boy with pizza and the Warriors game, Jenny and I sneaked out for a bit to get fernets at Amante.   Nice open space, clean, good crowd and nice bar stools and booths!   One of the bartender was not very nice, but maybe that's because one of my co-worker was using her megaphone inside the bar.  The bartender was slightly annoyed.  Oh well, he didn't get a tip.    Would probably go here again to chill with a big group of friends because I've never really seen it very crowded.  Plus, they have food -- gotta try the food here sometime soon :-)!  Fernet count at Amante: 3 = 3 initials on the my right arm to keep track of how many I drink.   1 from Jenny @ 7:30p 1 from Linda/Ronnie @ 7:55p 1 from Kitty/Keiko @ 8:10p", 
    "review_date": "2007-05-12"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Alright, I'm going to let you in on this...Amante's Happy Hour!  I missed it but hubby gave his thumbs up.    When:  Monday to Friday Time:   4-8pm (yes, you can make it without rushing from work) What:   $3 draft and well drinks AND $2 special apps Apps:   $2 gives you a choice of pulled pork taco, lamb slider or chicken skewer  What does this mean - 2 drinks and 2 apps  for $10, feeling good and tummy is full.    See you there!", 
    "review_date": "2010-08-27"
  }, 
  "KIUeZpqA5DpQZIhcBwQVvQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seema M.", 
    "review_text": "Always a fun night out at Amante.. we usually stop in for a couple of drinks and end of staying until closing. The crowd is cool and the drinks are strong (what more could you want!)  Not too big of a fan of the live band that was playing there a couple of months ago when we went, but there is normally pretty decent music playing.  My only concern is the washroom- in the women's restroom there is a curtain instead of a stall door and you are constantly worried that someone is going to barge in while you are in there!", 
    "review_date": "2009-08-06"
  }, 
  "GHZdMggvuYk1fsVWcyy0JQ": {
    "user_rating": 4.0, 
    "user_location": "Funchal, Portugal", 
    "user_name": "Dani D.", 
    "review_text": "I like this place. The bartenders are friendly even when they're busy and their drinks are pretty stiff. The crowd is pretty chill and there's a minimum of the drunken shenanigans that are found frequently at other North Beach bars.", 
    "review_date": "2011-01-02"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "i spent one of my birthdays here partying with all my friends. we actually scored the long velvety couch towards the back even though it was a packed mad-house that night. we celebrated drinking champagne till the wee hours and then happily staggered home. i actually prefer this bar when its quiet (mid-week and off hours) because its just one of those bars where you don't notice how pretty it is till its empty.", 
    "review_date": "2005-05-16"
  }, 
  "w5x0EU9mkxJt4_1kGZhe4g": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Vernon M.", 
    "review_text": "We stopped in here for a before dinner drink, and liked it so much that we stopped back again for an after-dinner one as well.  The place has a really good atmosphere -both cozy and fun.  Besides the bar  seating, there are comfortable booths.  We also discovered a new beer.  Haywire wheat - on draft.  Kind of like Blue Moon, but better.  We didn't try the food, but really liked the place.  Private parking lot across the street - 20 bucks - but better than driving around for an hour looking for a place.", 
    "review_date": "2010-01-25"
  }, 
  "OtTWaoUGz-kT0kPGV5MP8g": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Rachel C.", 
    "review_text": "I love coming to Amante when I want a more refined experience in my hood. I love the band that comes in every third Sunday and with the new outside tables for people watching and smoking, adds more reason why I love coming over. The infused martinis were great too.  The people are great, you get to dancing with strangers and see some sights with some of the locals getting away from the frat scene. The bartenders are great, they seem the old school type that actually talk and listen to you while giving you stiff drinks...that's character man!  The last time I was there, there was an older gentleman that can not only put away alcohol but dance, and I mean the bodybending, hipbreaking variety of Latin dancing. I was scared for him but coming here is always a random experience when he also came back in with a cockatoo! Like after some dancing to summon the damn bird, he goes out to do his birdcall only to have it perch on his arm and brings it back into the bar to meet the whole gang. WTH?!  Yeah, that's Amante for you.  The burgers are pretty good too, have yet to venture through the menu.", 
    "review_date": "2010-05-20"
  }, 
  "qKgy1I7PcGTh9hd5ujhPNg": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Carmen H.", 
    "review_text": "I came to Amante, mainly to see Shota Osabe, a friend who plays the best jazz piano around.  Through him, I've come to know some fabulous singers and the night I went to Amante, he was part of the band performing for hot, sexy Latin singer and dancer, Valeriana Quevedo.  That, in itself, was worth the drive from Daly City and the interminable search for a parking place in North Beach!  Luckily, I found handicapped parking just around the corner from Amante and, after offering thanksgiving to the gods, had one of the best evenings of my life!  The music was hot, the joint was jumping and I had some of the best fish tacos ( reasonably priced ) I'd ever eaten.  The menu had a good selection of items, none of them outrageous in price, and there was an interesting assortment of cocktails ( I had some sort of lychee martini which I enjoyed immensely ).  People danced and Valeriana had as much fun as the customers.  For a minute, I thought she was going to salsa out the door and off into the wilds of North Beach.  Certainly, Amante's is not your stuck up ritzy joint but I found it a fun spot to spend an evening....if just the darn parking were easier!", 
    "review_date": "2009-10-19"
  }, 
  "gqZvcNfUYWFsZNiZXfS4fA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "sarah i.", 
    "review_text": "yeah, a little bridge and tunnel-esque...but i always somehow end up having a hilariously delightful time at amante. there are just some characters all up in this place. and people who can't dance, but dont care.", 
    "review_date": "2007-12-21"
  }, 
  "tfO4ZEAnFdry8cOC-ZoHMg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allie O.", 
    "review_text": "I've been to Amante many times and have always like the bar and music. Wizz, the owner, was extremely helpful in reserving a section for my husband's 30th birthday - free of charge! He was super helpful in making sure we had everything that we needed and couldn't have been nicer. I would definitely recommend having an event here and look forward to going back soon.", 
    "review_date": "2011-06-08"
  }, 
  "-AsU15jw64vw1o5gCievpQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Whitney H.", 
    "review_text": "Fabulous spot with decently priced drinks and a great ambiance. Plenty of seating, great tunes, fabulous drinks.  It draws a local crowd which I appreciate, as many North Beach bars can get a bit too touristy for my taste.  I simply adore Amante..... and frequently pop in for a taste of their scrumptious homemade pineapple infused vodka, and a visit with my favorite local bartender, Eric.  Love him. Now... if they could only add a second bathroom stall.................", 
    "review_date": "2009-01-03"
  }, 
  "zwLq4aVDSH7HyMbVjKfkRg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "David N.", 
    "review_text": "Wiz and Michael have made Amante a \"landmark\" in North Beach.  Beside the cocktails, the bar food challenges many restaurants in the area. Wings, fish tacos, and pizza (from the wood oven) are perfect! And the french fries are the best!", 
    "review_date": "2010-03-10"
  }, 
  "1f33vJNISFbw0GaMYpEncw": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Amy D.", 
    "review_text": "After 5 drinks, I offered the pony-tailed bartender some of my leftover tortellini from Mona Lisa while he was pouring drinks. When we were getting ready to leave, he came up to me at the table where my friends and I were sitting and apologized he couldn't eat any! HAHAHAHA! \n  The martinis are bigger here than O'Reilly's and probably only $1-2 more. Dave says that you're supposed to sip martinis, but I like to take a mouthful in and swallow a little at a time.\n  The ladies room has 1 toilet and a curtain instead of a door, so be mindful if it's drawn shut. In my drunken stupor, I dragged it open and saw a girl sitting on the pot. Oops.", 
    "review_date": "2006-06-19"
  }, 
  "jX52sZoojxyYV2viWNyO7A": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "David O.", 
    "review_text": "Amante is a smallish but cool bar.  They have a huge amazing mirror behind the bar that seriously adds a lot of visual depth to the place.   The drinks are decent.  I'm just not too keen on the vibe.  The women here are just looking for some rich sugar daddies and the men are slimey.  They take a number to pick up on the few chicks stupid enough to walk into this bar.  It's like watching scavengers feed on carrion.  Entertaining, but really fucking tragic..  Come here on a slow weekday night though (say Tuesday) and this place is yours... On those days, Amante gets the 4 stars.", 
    "review_date": "2006-12-01"
  }, 
  "82dCHyU-ANOgdhxUgZsUeg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marlon T.", 
    "review_text": "When this place is not crazy busy, it's basically a nice place to grab a drink and have a conversation. The drinks are decently priced and it's located next to a bunch of other notable places like Sotto Mare or Golden Boy Pizza. I highly recommend this joint for anyone's bar hopping list.  Grab a bite from Chubby Noodle inside this joint for some pricey \"modernized\" food.", 
    "review_date": "2013-07-23"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "It's alright...I've never been here on a normal night.  It's either one of two things...  Empty: *cricket* *cricket*  or  Packed: Guys \"accidentally\" grabbing my ass.  The drinks are okay, the place is nice, the people are not so nifty most of the time...But it all gets better when you're trashed, but so do most places.  Eh...*shrugs shoulders*", 
    "review_date": "2006-03-28"
  }, 
  "s16-BUo-orUsELvMu5ocKg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Josephine L.", 
    "review_text": "If you can snag a table on the front, hunker down under the generous heat lamps and enjoy people-watching. My friend and I stopped here for a drink and really enjoyed the chill atmosphere. Service was pretty slow at first but got better after we placed our orders. I got the Infused Martini and she got the North Beach Iced Tea. Both were pretty good but I liked my martini better.   You will definitely see characters if you stay here long enough. I think my favorite was the guy dressed like a pimp for no apparent reason.", 
    "review_date": "2011-11-16"
  }, 
  "QssxvL783zOoKPrrkusiog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thel D.", 
    "review_text": "Amante is one of those places that you can walk into anytime of day and tie one on... It's got a great old school local crowd during the day and a cool new school local crowd in the evenings. The food is nothing to rave about but it's not bad either. They always have the games on, they have live bands every now and then and the bartenders are always welcoming and friendly.", 
    "review_date": "2008-07-25"
  }, 
  "XE8Jc_84wybVBP8k1HcmPA": {
    "user_rating": 3.0, 
    "user_location": "Paris, France", 
    "user_name": "Laura D.", 
    "review_text": "I like this place, but that might have been purely because I saw a bunch of people I hadn't seen in the last 8 months and I have missed them so much and the entire night was so wonderful. I must say that the drinks were quite weak, but I don't think they were highly priced. I did have one ridiculously strong gin and tonic that Gabriel bought for me, so it was free and strong and made up for the rest.", 
    "review_date": "2008-05-30"
  }, 
  "MU_bppwgP03jfpTo6vtZ5w": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lisa H.", 
    "review_text": "I woulda given this place 5 stars my first 5 visits.. But that last time... Well gee.. When its the owner who ruins it for you.. Ouch..  I was a server bartender for years.. I only VERY recently became a corporate hotshot..   I was in, again, with the crowd getting off work from group of employees from a nearby restaurant. Although this time i arrived with a friend not the gang ad we had bar seats..  I hadvalways been welcome to bring my ten pound dog previously. Typically she stays in the bag i bring her in dozing.   We must if spent $150 &amp; tipped almost $100- bartenders do that.- plus the  discounts were alright. But we knew it was the owner so we were cool.  Suddenly someone notices Madison who will always look like a puppy, and for @5 min she was passed about the bar..  Apparently someone complained. Cuz we were thrown out by the owner we had just spent a bunch $$$$ on. No explanation. Just bye now you with the dog.  Jerk.", 
    "review_date": "2013-02-09"
  }, 
  "QOMoA_G5PBrUA_WXu1ZdIg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Debbie C.", 
    "review_text": "Nice and cozy bar - great service. Needs some refreshment though, feels little funky to be inside. But its common for most old bars I guess, they never do renovations unless the ownership change.", 
    "review_date": "2014-01-07"
  }, 
  "-1Grce7VmCft_uq79JX9Ow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal I.", 
    "review_text": "Decent place. First time trying a kimchee hot dog, it was delicious ! Chill music but hate looking for parking in this area.", 
    "review_date": "2012-02-02"
  }, 
  "s6xZpSHNteqqsLzuC3Jd8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suany W.", 
    "review_text": "Don't come here just for Chubby Noodle (even though it's hella good), but make sure to drink up at the bar as well. Our bartender was fast, friendly and most importantly, attentive. This is so much more than just a convenient place to wait for a table to open up at Sotto Mare. Plus, the music is phenomenal. Snooooooop (Lion?)!", 
    "review_date": "2014-11-22"
  }, 
  "hFvLaKDNHMxHze13Hd-FZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misha F.", 
    "review_text": "Do you LOVE watching cougars attack their prey? How about pineapple infused vodka (yes, it's sooooooooo trendy)? Or what about LIVE music on a Wednesday evening? If so, then Amante is the place for you.  Came here on the eve of New Year's eve with a group of college friends. It was surprisingly bumping, the drinks were tasty and reasonably priced, and the young and old were tearing up the dance floor.   The *older* lady in the red dress with the dynamo bod was like a car accident--I couldn't stop staring. Whoa mama. Literally.", 
    "review_date": "2010-01-08"
  }, 
  "5RCcFwMRghhw1wMhnZY5RA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hillary H.", 
    "review_text": "Love. This. Place!  The staff are very friendly, and courteous. I recommend this place to anyone who loves having a good time. Drinks are Delish as well!  Two Thumbs Up!", 
    "review_date": "2011-01-02"
  }, 
  "3zETQEZrHiJNE38RFT8eNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave K.", 
    "review_text": "Nice place. Judging by the sort-of-retro sign outside, I almost was expecting flappers and velvet couches. I got my couches, plus a huge TV screen. The pony-tailed bartender handled my friend's special requests without any hassle. He was cool. What's with the music, though? I'm not sure we're far enough in the 2000s to be playing some of the \"classics\" of the mid-90s as the Thursday night soundtrack.", 
    "review_date": "2006-06-17"
  }, 
  "bMb2_rO8hMJbJAFne7ulMA": {
    "user_rating": 3.0, 
    "user_location": "Bellevue, WA", 
    "user_name": "Carrie A.", 
    "review_text": "We went mid week, and it was very laidback and relaxed.  The barstaff kept checking to see how we were doing, which I liked. Music was a little depressing though.", 
    "review_date": "2005-10-17"
  }, 
  "AJmUkS2J_HVr-HTUoFTxrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaena G.", 
    "review_text": "I just met one of the owners of Amante and he is the cat's meow...!  The thing about bars in SF is they are trying to out-do one another with music, decor, \"signature\" cocktails, back-flippin' bartenders...oh, sorry that was a movie...Amante is NOT trying to be anything, but what it is:  a great place to hang out and take shots of tequila, or Fernet, whatever.    Don't look for ambient Buddha Bar, or Om lounge music to set the pace--what you'll get is rock -n-roll, Guns and Roses, or Prince if you're nice to Wiz, the charming owner with all-american-boy good looks...Good eats, stiff drinks, and even a little dancing.  It's a perfect place to get a taste of good ole North Beach hospitality.", 
    "review_date": "2005-05-14"
  }, 
  "mO5VWLI4iVf5o7ghJqGtUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "janet j.", 
    "review_text": "I've always had fun here whether it was a monday or a saturday. Just a great place to relax with friends and drinks. Their restroom is pretty cool with the swinging purple curtain door. I wonder if the men's restroom is just as cool...", 
    "review_date": "2005-06-23"
  }, 
  "riKNIk-BcVqX7oDFq_B3Fw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Melinda L.", 
    "review_text": "LOVED the atmosphere. Its a dark bar thats lively enough to not make you feel like a lone alcoholic sitting at the bar but chill enough where you're not in constant fear of rowdy 20-somethings busting out body shots next to you (an experience I'll have to share another time). The bartenders pour with a strong hand and the drinks come out delicious. The waitresses are a little on the pushy side, as our table was checked on 4 times after we had said we were done and just winding down before hitting the road, which gave us the impression that we were being pushed out. But nonetheless, the place is fun and the drinks are great.", 
    "review_date": "2012-09-16"
  }, 
  "ii6JkzDO5eWHxNA1SeTuJQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dennis A.", 
    "review_text": "The bartenders pour a mighty good drink and are very friendly.  Its a very chill atmosphere and they now have a pop-a-shop noodle/fried chicken offerings.  I've been going here for years and would recommend.", 
    "review_date": "2012-02-22"
  }, 
  "_S5tB9stFX3YKLBPVoEjqA": {
    "user_rating": 4.0, 
    "user_location": "Rome, Italy", 
    "user_name": "Andrew T.", 
    "review_text": "came here for anna's birthday. i love the north beach area, and definitely enjoyed my first time at this bar. it's pretty dark in there. even when they \"turned on the lights\" at last call, it was still dark. but i love bars like that. there's a lot of seating at the bar, a few tables, and a few couches. we had most of the couches for our gigantic group. there is also plenty of standing room to mingle or wander around.  the drinks were pretty cheap. $4 for a beer, $5.50 for well drinks. not bad on a saturday night in north beach. the bartenders were cool and it was never hard to get a drink. the cocktail waitress was sweet, came around often, and always asked if we were doing ok. the bouncer was also cool, even lighting our cigs everytime we went out for a smoke. they also serve food here, although i didn't eat. but the menu looked solid and the food some people were eating smelled good.   there were plenty of plasma's and a projector screen, showing the WBC and sportscenter. cant complain with that.. the bathroom situation was the opposite of most places. the girls never had a line the whole night, while the guys line was constantly 4 or 5 deep. this is because there was only 1 stall for the men. but most men, like myself, are in and out within 45 seconds. so it was all good...  great bar, great area, great crowd. we were even treated to a near sex-show involving the sparkely-dress girl. i will definitely be back. hopefully next time, i am not at a 10(on the drunk scale), so i can actually be coherent...", 
    "review_date": "2009-03-22"
  }, 
  "nlOxarS20luHkAloH5YyzA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Vanessa G.", 
    "review_text": "OH MY GOD...their baby back ribs are AMAZING!  I don't know what kind of BBQ sauce they use, but it is so, so, so good.  It's spicy and thick and tangy and bold.  The meat just falls off the bone and melts in your mouth.  I'm salivating.  I want more.  One plate is not enough.    This is a fun bar.  They have bands play like Petty Theft (An amazing Tom Petty cover band), they have Jager girls, they have fruit infused vodka!    Minus one star for a weird bathroom.  They have a curtain, not a door.  Plus one star for there being a line for the men's and not for the women's.    Minus a star for, no offense, it being a lot of foreigners.  North Beach is a tourist trap where men from England, Australia, and Ireland come to hang out.  I can't go to a bar in North Beach without everyone I meet being on holiday.", 
    "review_date": "2006-12-15"
  }, 
  "FjNgN6Dk9fh4NatwthoFgA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joy C.", 
    "review_text": "I went to this bar with a bunch of law students on a weeknight... really great decor and ambiance, and good drinks. I didn't get to taste the food, but their fries looked yummy.", 
    "review_date": "2007-04-05"
  }, 
  "NPRyDEG1D2taLdbdXhrNlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chocoolate I.", 
    "review_text": "We were looking for a place where we could sit at the bar and have a drink with a cool bartender and people. We found it. This is a really cool bar that is very long. Nothing fancy, just nice regulars, a television at both ends and any drink you could want. Just a nice place to spend an hour or so.", 
    "review_date": "2011-11-11"
  }, 
  "VMakUjCziVNgLdsmoTj9-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly J.", 
    "review_text": "The perfect place to start when you're going out in North Beach. Have a few pineapple-infused vodkas and you will be good to go for the night. So amazing.", 
    "review_date": "2009-12-18"
  }, 
  "0mmu5ME29Y8vLr9wyEvTKQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey V.", 
    "review_text": "One of my favorite little northbeach spots. It has a slightly more upscale feel than the other north beach options so you don't feel silly stopping in all decked out if you're on your way to dinner or somewhere more dressy as you may in a lot of the bars around since they're all really casual. They usually play pretty fun music. I love the big mirror and beautiful A behind the bar. There's not really a dance floor at all, but there's often times when everyone's just dancing whereever their standing.  I threw a surprise party for my husband here a few years ago and they did a great job of getting us the plates and cake supplies on the spur of the moment when we showed up with just a cake not thinking about the other details like forks, plates napkins etc. The place always has people in it but it's never jam packed so you can always find somewhere to sit which is nice.", 
    "review_date": "2009-08-09"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "Can't say I'm a huge fan, but: they have Mirror Pond on tap, and Chubby Noodle is here.", 
    "review_date": "2012-08-05"
  }, 
  "GMiMXVIv9y5gpF95WCBZEQ": {
    "user_rating": 4.0, 
    "user_location": "Piedmont, CA", 
    "user_name": "Douggers M.", 
    "review_text": "My girlfriends and I used to frenquent Amante very often.  Back when they had Sex and the City nights on Sunday with $4 cosmos. Before Scott quit to open his bar ACES. We used to have brunch at Delucchi bloody mary's at O'Rielly's and the stagger to Amante. We would hang out with Scott and Eric from 4 in the afternoon untill we dropped.  Many fond memories of Vodka Pineapple martini's yummy salty fries and eating all their garnishes. Mid evening it wasn't odd to find one of us passed out in the window cubby area or behinde the bar. An evening of debuachery ending with only a $40 bar tab? Hum, it's a wonder they didn't go out of business.    I've been a couple times recently, it's just so crowded and very meatmarketish. But, Eric makes a mean Level dirty martini, served witha side of a olives of course!", 
    "review_date": "2007-01-19"
  }, 
  "oUK6Xs5dPPnP4whFeZExGg": {
    "user_rating": 4.0, 
    "user_location": "Calgary, Canada", 
    "user_name": "Wendy P.", 
    "review_text": "I'll have a cocktail with a side of cocktail please.  San Francisco bars, I feel like if any of them were to make a crappy cocktail, they wouldn't last longer than a fly on honey. I don't think that will be Amante. At least not from my Old Fashioned and my Vieux Carré.  I enjoyed the vibe here. Buzzing but not crowded. Upbeat but not overwhelming. The right amount of noise level but I could still hear my Friday eve shenaniganners from across the table.  We only stayed for the two drinks. There were other sights to be seen. But one drink ordered from the bar, one from our server at the table, both an experience that wouldn't say no to venturing back for.", 
    "review_date": "2013-03-07"
  }, 
  "OnagJ2dnPjfRRT4a_CgKCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi T.", 
    "review_text": "I stopped in to meet a friend for a pre-dinner drink. The place was pretty empty. The bartender was really cool..knows when to be attentive and when to leave you alone.  It was nice to go somewhere in North Beach not filled with tourists.", 
    "review_date": "2007-06-26"
  }, 
  "SIcy7NV7ZSUCrM3i9l3jLg": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Carmen M.", 
    "review_text": "The pineapple-infused martini was kind of amazing. The bachelorette party next to us did not significantly detract from my enjoyment of the evening. I will probably be back.", 
    "review_date": "2010-05-24"
  }, 
  "t5AFrfee1pFSgVQ8Bb05Ug": {
    "user_rating": 3.0, 
    "user_location": "Newark, NJ", 
    "user_name": "Diane S.", 
    "review_text": "This place is really close to my apt but I'd never been there because one of my staple going out buddies doesn't really like it. I thought it was fine...we only had 1 drink here but the music seemed fun- which can make or break a place for me. I will have to check it out again when I am not already tired-- and when it has more of a crowd too to give it a more well-rounded review.", 
    "review_date": "2006-11-25"
  }, 
  "re6fN6eb3NTL7hKK-5CYUQ": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Shirleyanne A.", 
    "review_text": "This is my favorite bar in North Beach.  I am addicted to their Pineappletini and I think it's great that they have Chubby Noodle for some savory treats (you can't go wrong with their fried chicken!). The cocktail servers bring your drinks very fast and the bartenders are down to earth and friendly. The front door bouncers are pretty nice as well.  The clientele are just normal people (thankfully we don't get too many douchebags here--if you like them, go to The Marina district). The music selection is pretty good. The bathrooms are clean (well, at least whenever I go it's always been clean) and the booths are pretty comfy. I appreciate the fact that the staff keeps the bar clean.  I say this because I noticed that the tables are never sticky.  I will definitely consume at least 100 more Amante Pineappletinis by the end of this year!", 
    "review_date": "2012-07-16"
  }, 
  "NSCy54eWehBJyZdG2iE84w": {
    "user_rating": 4.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Karlee D.", 
    "review_text": "I go to Amante every Thursday before work (I bartend @ Columbus Cafe) Just for the Fish Tacos. They are the closest I can find to the ones A San Felipe grill in stockton.  The fish is perfect, with a white sauce (sour cream, mayo, lime maybe?) pico de gallo, shredded cabbage, lime. Off the hook.   I hear the ribs are great too.", 
    "review_date": "2005-12-01"
  }, 
  "3ZAt86qNiV4oWK9jkClFFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea S.", 
    "review_text": "Whiz and the other bartenders are fabulous!  Their kitchen serves some hot and consistently good bar food.  Try the wings!!! Yum! The guys serve up great drinks of a substantial size.  It's a friendly neighborhood bar with a bit of an up-scale-y feel.", 
    "review_date": "2005-10-13"
  }, 
  "WJDPbSUSiSohQ6R6Ku4wFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin S.", 
    "review_text": "I stumbled in here by accident when I was waiting for Magnet to open and was really impressed. It was pretty quiet at 7pm on a Saturday which is fine by me. Plenty of comfy couchy areas to sit - huge cielings give an airy feel. I was craving fries so I ordered at the bar along with a coke which I quickly changed to a jack &amp; coke cuz it seemed like the right thing to do. The order of fries was mega huge in a spiralling wrought iron conical container. I'll definitely come back with a larger group.", 
    "review_date": "2006-04-27"
  }, 
  "LPkh_eURB6fOA1w7GSf1qA": {
    "user_rating": 3.0, 
    "user_location": "Paso Robles, CA", 
    "user_name": "Tess S.", 
    "review_text": "We walked in here on accident. I was looking for Columbus Cafe, but I saw this place had the ball game on and two open seats at the bar, so I beelined it. My poor husband caught up to me and whispered in my ear that it was the wrong place. Hey, they had frenet too, so all wasn't lost. I also tried the pineapple martini. The first one was okay, but for the second one, I asked him to put a shot of pineapple juice in with it, and that was BOMB. It's pretty loud with mediocre music and the average age goes up as the night wears on. When we first walked in, there were a bunch of twenty-somethings dressed in 80's garb. As it got later, the 40 and 50- year olds came out to play. Fun stop and if you don't like it, you can always go next door.", 
    "review_date": "2013-10-15"
  }, 
  "arY2V-MtKksRAoqd-dVYOQ": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Yosie G.", 
    "review_text": "Average bar to me. Bartenders were nice, and of course asked us if we needed more drinks when our glasses looked empty. Crowd seemed to be the mid-late twenties and up. Some interesting folks here and there, but to be honest have no idea what some other yelpers mean with the B&amp;T crowd-guess I haven't been here long enough. The music included Madonna (90s version), Naughty by Nature's OPP (yeah you know me) and some other 90s stuff. Then all of a sudden, the music switched to Missy Elliot, Outkast, Ja Rule, etc. Decor is interesting, you have ESPN and Golf TV playing, some large Skyy and Ketel One bottles displayed above your head, along with some musical gear above the doorway. It's pretty dark inside, save for the lights emanating from the televions. Not a big place where it's required to dress up but you could if you really wanted to.", 
    "review_date": "2008-01-28"
  }, 
  "wMEw-gWMgKvrSa0KgysZGQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark R.", 
    "review_text": "I agree with the people who labeled this an average bar.  Probably a 3 1/2 stars rather then a three.  It wasn't anything really special.  A few good things that i liked about this bar was the relaxed atmosphere, chill bartenders, and the big tv's showing sports (when we were there).    The drinks aren't anything unique or different and if you ask me...are about average price of any other bar that you find in North Beach.    One thing i found surprising about this place was the clean bathroom lol.  It doesn't happen often in a bar, but this time that we went the bathroom was clean and well stocked.    The real reason to come here is if your looking for a place to drink with comfy couches to kick back on.  Like i said before, the prices are pretty average, not to say they are more or less then other bars, but really just run of the mill, middle road prices.    Average Bar that has a nice atmosphere.  Worth a visit when u wanna just have a few drinks and kick back", 
    "review_date": "2008-02-13"
  }, 
  "aei-4QBYVdUAcQOyu9jSGQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chuck C.", 
    "review_text": "What a gross establishment.  None of us had ever been here before, and we'll never go back.  I'm not ageist, but 50+ year old men should not be groping 20-something females as soon as they walk through the door.  \"There must be a beauty factory outside,\" as an unsolicited hand snakes around my friend's waist.  Disgusting.  We left and took 8 steps next door to the Columbus Cafe and had a great time.", 
    "review_date": "2008-09-29"
  }, 
  "uS5n9LYDAChLdsFQO5HUmA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Staci J.", 
    "review_text": "If I could take a bath in their pineapple martini I would. OMG - so good. This place has a great vibe, super comfy booths that are situated higher up so you can see all the action and everyone who works here is a total sweetheart. Love that you don't have to go anywhere except across the bar to the Chubby Noodle window for high quality (Mary's organic chicken!) snack to go with your drink. I'm a fan!", 
    "review_date": "2013-08-07"
  }, 
  "LRJgblf3U3v1MwhR7GrnfA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Julia W.", 
    "review_text": "Have been going to this bar off and on over the last several years, consistently a nice crowd in here, bartenders' r great, fun place to hang.  A place to relax and have a good time, no pressure, no scene...", 
    "review_date": "2006-01-09"
  }, 
  "rDTr5r0xEMpQpkPphe66KQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick A.", 
    "review_text": "Take off your glasses, you are indoors.", 
    "review_date": "2007-05-23"
  }, 
  "kORGcgi0Iw2RG8gJl84MVA": {
    "user_rating": 5.0, 
    "user_location": "Barcelona, Spain", 
    "user_name": "Caroline C.", 
    "review_text": "I had a great night here. The staff, as far as I can tell, is almost entirely well-worn 40 something men who are sort of harley davidson but with a bit of class and sugar. The bartenders are fantastic and the bouncer is funny and friendly. Pat, the bartender with the long ponytail, is very nice and makes awesome cocktails.   It was easy to push in and get a seat, even though the bar was hopping and pretty busy. I really liked the crowd that this place brought--serious, not too trendy, but fun-loving, save for a few frat boy types that somehow ended up here and tried to tell me that because I asked for a cigarette for my friend (since I don't smoke and she is shy) that I would have to do some sort of sexual favor (\"do all of us\"), which one of them first said would have to be done to his friend who gave me the cigarette, and then he changed his mind and said \"all of us,\" circling his hand around to about five men around him, all of whom were much more attractive than him, and who were not seconding his suggestion. I sort of told him to screw off and he did. Misogynistic asshole.   Overall then people are interesting and nice, though, but a few too many foreigners here for a regular sort of spot. It's a once in a while place. The bar itself was scattered with cute Australian men the night I was there, save for the eldest of them who was a bit creepy and invited me to have a seat. Luckily I already had one elsewhere and was passing by.  Drink prices were good, too. $6 for a sidecar served up tasty like a sweet tart with a sugared martini rim.", 
    "review_date": "2006-01-07"
  }, 
  "a_6G0FFvG2dzQTGULfYOzQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "this is NOT a dive bar.  in case you were wondering.", 
    "review_date": "2006-08-03"
  }, 
  "_lbgVbWTvxV9VTVWU0YnwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noneya B.", 
    "review_text": "It's a pretty nice lil spot.  Not to crazy busy... not exactly dead and boring.  I go there often enough.  It's a nice bar with some decent apps.  Try out the Calamari.  Yum.", 
    "review_date": "2007-10-08"
  }, 
  "oavPd3eVwL0N8Y4t3WvrBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D S.", 
    "review_text": "I love the live music here on Sundays....and the calamari....and the ribs....and the el gato negro cabernet sauvignon....and the matchbooks.....and throwing aforementioned matchbooks at obnoxious-looking-people....and denying throwing matchbooks at obnovious-looking-people...", 
    "review_date": "2006-09-12"
  }, 
  "1wI3WRmx5IMOmxVx8k1Wrg": {
    "user_rating": 5.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Sam W.", 
    "review_text": "I recently came across this place when meeting a buddy for a drink. It's located in North Beach on Green street by Golden Boy pizza. We actually came here for the noodles  at Chubby Noodle, which is located inside the bar. I've walked by this place a million times and it never occurred to me that there's small restaurant within the bar. We came for the noodles but stayed for the drinks once we realized what a cool bar this is.  For starters, the staff is very very friendly. I met who I assume is the owner when we sat down. I'll review the noodles another time as this bar definetely deserves some attention.  The coolest thing about this place is that they infuse their own vodka. The time I was here it was pineapple infused and it was absolutely delicious. I'm a huge vodka fan and usually drink it straight or martini style so I was really pleasantly surprised. I've had flavored and home infused vodka before. I was just kind in shock that a local dive type bar would go through the trouble of doing this. It's not a complicated process at all, but It's cool that a business chooses to distinguish themselves from the herd.  We were there for a couple of hours and I will definitely  go back. The bartender was really nice and the mix of people that trickled in as the night progressed was pretty cool. Not too many douchebags and a nice mix of good looking women. All in all we had a great time and I was actually surprised by the atmosphere considering the touristy location. The fact that we could also snack on some pretty awesome noodles and other good fare didn't hurt.", 
    "review_date": "2014-07-31"
  }, 
  "k6zYbMle3LI9jhMuY4Tc4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison Z.", 
    "review_text": "Not fancy, not a dive bar. Best part of this bar is the Chubby Noodle food (separate review). But they also have very good prices for drinks, especially for this neighborhood. The house made pineapple infused vodka is tasty and something different from the usual, though that's really the only thing on the drink menu that was unique. They also have some good seating options: high tables with views of TVs (good for game watching), a comfy booth/table with curtains near the door (though not good if you're tired--I fell asleep there once), and outdoor tables that make for great people watching on this section of Green.", 
    "review_date": "2014-06-06"
  }, 
  "ZnoRV0CJYbKqHlWWm_6MIA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine O.", 
    "review_text": "Being right down the street from home, this bar serves as a good happy hour spot. A mellow Friday evening with some lovely Yelp buddies, I enjoyed the early evening crowd.   At 6pm there was plenty of comfy seating, no loud music to shout over, and several big screen tvs to view the baseball game. I had no problem ordering my drink, which a rum &amp; diet coke ran me roughly $6. Not too bad, and the bartender was quick to serve me. If you want some snacks to go with your munchies, they have appetizer dishes as well.   The crowd was a mix, and I actually enjoyed the fact that I could have a decent conversation with friends, unlike the usual loud bar shouting scene. No thrilling stories attached this review, but just the pure facts of Amante :)", 
    "review_date": "2008-10-13"
  }, 
  "U7HvQlvV8b_-VjuqkJ4WqA": {
    "user_rating": 5.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Juana S.", 
    "review_text": "Amante is the greatest!   I was here on a Sunday late afternoon. I already had lunch but my eyes were drawn to some woman at the bar plate looked yummy, wait smelled yummy; I did not have as a clear imagine as I wanted too since I was sitting at the window, but ease dropping on the food conversation and sounded like they LOVED IT!   The bartender there went out of his way to bring me some more water at the window! What The! SWEET! It was rather slow later afternoon nonetheless I have never experienced that kind of service from any bartender! 5 stars for that.", 
    "review_date": "2011-05-19"
  }
}