{
  "ZJiMZvt_-6a5q20WtYn2Pg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt V.", 
    "review_text": "There are no great places to grab great wine sans meal in North Beach.  Believe me I have tried, and tried, and tried again.  This place finally fills the void.  (Dell'uva seriously try harder)  Good service, good vino, some tasty snacks, and the ability to get a spot for your friends on a Friday, Saturday.  Perfecto!", 
    "review_date": "2012-08-11"
  }, 
  "camcqftbmLc1CMRt3kR2iw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rami R.", 
    "review_text": "My new favorite spot in SF (has only been open about 3 weeks). I have been here three times already as I love the place and it is close to my house. The sangria is amazing and is served in a cool personal oak barrel if you order the 750ml section. They have a great wine selection from Spain, Chile, and Argentina and the flatbreads are great (I recommend the one with feta cheese and honey). The ambiance is pretty cool (very Latin American) with Latin music in the background. The owners, Ramsey and Carlos, are always there and will treat you well. I will definitely be here on a weekly basis.", 
    "review_date": "2012-08-04"
  }, 
  "WSgC6r45RKenNswvh6Mmcw": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Da Chubby R.", 
    "review_text": "If you're looking for a nice, clean and classy place to hang out off Broadway, Antologica Vinoteca is the ideal venue. A bar that specializes in Latin American wine that also serves tapas with a fresh flair for Latin American fusion, it's definitely a departure from a litter of dive bars and strip joints.   We came with a big group on a Friday night and enjoyed some sangria, Malbec, a variety of the empanadas, pastelito de carne, canoas de sancho, palta reyna and even left room for dessert, platanos creme brûlée. The menu is fairly priced, food is delicious with good portions and customer service is excellent. Even with a small band playing Latin live music, it wasn't too loud to hold a decent conversation among each other. A true hidden gem off Broadway, Antologica Vinoteca is a must for those who prefer an elegant and quiet night in the city.", 
    "review_date": "2014-09-06"
  }, 
  "M271Ac7UKVaQ9U5AOvc_9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicky L.", 
    "review_text": "My new favorite watering hole!  Culinary bestie Sara P. and I finally had the chance to head over Friday after work before dinner in North Beach.  I arrived first around 5:30, and we were the only ones there for a bit.  Everyone who worked there was super nice, and when they didn't have the white sangria ready yet, they brought me a sampling of the red sangria, which I happily accepted (um, hello, who turns down sangria in general?!).  It was suuuper yummy and fruity, and even though I'm normally not a fan of red wine, I loved it and could probably have an IV of this every day (especially during work.. ahem).  For a quick snack, we ordered the Mixto platter, and we let them pick the three meats and three cheeses for our board.  We ended up with a manchego, blue and smokey gouda, and for the meats we had salami, coppa, and a truffle pate.  They came with sliced and toasted baguette, apples, and honey and mustard.  SUPER yum.  I'd totally order this again.. all by myself.  If we hadn't been having pizza for dinner later we would've ordered their flatbreads.  But oh well, this totally just gave us a reason to go back again.  You don't have to twist my arm for that!", 
    "review_date": "2013-05-13"
  }, 
  "UIMAOhUuLSRre8--lL2_zA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Rishi N.", 
    "review_text": "I visited Antologia for the first time a few weeks ago and it quickly has become one of my favorite wine bars in SF.  Antologia features Latin American wines (from South America, Spain, as well as California) along with sangria, beer, and small dishes.    I experienced perhaps the best treatment from a proprietor that I've ever had when I visited Antologia (we interacted was Carlos, a co-owner of Antologia).  A good friend (visiting from China) and I dropped by on a Sunday night and Antologia looked to be closing up due to slow business (entirely reasonable given the day/time), but when we dropped by Carlos decided to reopen the bar for us.  My friend and I enjoyed a couple flights of wine apiece (um, in retrospect it was perhaps a bit much, but the wine was delicious!) catching up on life over several hours (again, after Carlos had reversed his decision to close up early-ish for the night).  Throughout this time, Carlos was an extremely good host - attentive and helpful (clearly driven by genuine friendliness and a desire to serve customers) - even as we kept him there late into the night.  He eventually joined us and we ended up spending a couple of more hours hanging out well into the morning.  I realize that this is a Yelp review and I should accordingly spend more time writing about the quality of the wine (I enjoyed everything I had), but I think what makes Antologia stand out is the exceptional service, attentiveness of the staff, and the genuine passion that the founders have about making Antologia a successful establishment in North Beach.  The location is great (a short walk from a number of restaurants in North Beach) and the ambiance is very comfortable.   Ultimately, this is the type of place that is hard not to support / root for, and I will definitely be back.  I highly recommend it to anyone looking for a good wine bar in SF.", 
    "review_date": "2012-10-16"
  }, 
  "0vwc4p3wwBenwlsMGoxGjg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carlos M.", 
    "review_text": "I love the atmosphere, the music, and the people here. Great place to get a Latin American drink. Good wine selection.", 
    "review_date": "2013-11-29"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Flying.  Plan was a glass of wine.  Then we discovered the $12 wine flights inspired by Chile and Argentina.  We had traveled there together. You bet we were now drinking together.  Generous pours made it seem like more than three tastes. Would not have been surprised if the extremely welcoming and friendly server kept on pouring.  Only thing that rivaled the wine was the food. Margherita flatbread with homemade tomato sauce and Gorgonzola bruschetta with homemade hummus were equally incredible.  Space was dimly lit and subtle. Atmosphere relaxed. There is sangria sitting in little barrels. There will be a next time.  First class all the way.", 
    "review_date": "2013-04-16"
  }, 
  "I7TQJq7cn8TmQgoDZNS4Ug": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Peggy S.", 
    "review_text": "Dimmed lights, sweet wine, three handsome guys.  I would probably never set foot into this little gem if it wasn't for an organized event, but I am so glad that I have and I would return again and again if I were in the neighborhood, with or without the three handsome guys (but it would be much more preferable if they were in the picture).   We came here around 8 p.m. on a Thursday night, when we first entered, the bar seemed empty, but around 9 p.m. things quickly picked up and the place was buzzing with energy.    The wine selection they have is very reasonably priced, am I really in San Francisco?  Because seriously, we paid more for parking than the price of the wine.  The bartender was very friendly and the service was very quick.  For the first round I ordered a chardonnay.  Though chardonnay isn't usually my top choice, but I figured, since we were at a new place, meeting new people, why not try it out?    And I was pleasantly surprised, that even though it's a dry wine, it went down quite smoothly.  I also tried my friend's sangria and it was absolutely delicious!  The wine taste is barely, just barely there, it was like drinking a glass of grape juice with fruits, which was right up her alley!  The bar appears to have a reverse happy hour, because about an hour in, the bartender came by to let us know all the great deals they have.  I believe they have a few selections for $5 wine and beer, $5 sangria and mimosa, and their flat bread was also $5.  Though we didn't get to try it out next time, I am determined to taste their food as well when I return!  For the second round, I ordered a mimosa... You can pretty much have mimosa at any hour of the day... because who wouldn't want brunch for breakfast, lunch, dinner, and midnight snack?  The mimosa was good (because how hard is it to make mimosa?), but nothing special.  The bar definitely caters to a younger crowd based on the music they play on a Thursday night.  I cannot wait to see how things are here on weekends!  Plus, they have sangria by the mini-barrels, must put that on my list for next time as well!", 
    "review_date": "2012-09-14"
  }, 
  "Y6YiC2R26d0FH5UGdwzOrg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lindsay k.", 
    "review_text": "Ate here for the first time last week and just had to write a review for it!  - 5+ stars for the two HH flatbreads we had at dinner, \"the bottom two\" recommended by the owner. BOMB. - 5 stars for the $5 HH wines and menu/prices in general.  - 5 stars for service, frequently refilled waters, free bar nuts (+ seconds?!).  - 5 stars for location.   This place will and should grow fast, I hope the quality and value stays with it!! I will be back.", 
    "review_date": "2013-09-09"
  }, 
  "wHvO5kK43yjqkcQ4HdtNAQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Stacey L.", 
    "review_text": "Tethering between a 3 and 4 star and decided to bump it up because of the great service and adorable mini barrel wine display along the bar (which is actually filled with water). Their flights of wine are typical prices, generous pours, and the bartenders are nice about tastings. I opted for the red sangria because I had heard so many great things about it. However, I was greatly disappointed by it, as it was really sweet and watered down.  In lieu of the fact that it is a newly opened establishment, I probably will give it another shot and also try additional flights of wine.", 
    "review_date": "2013-04-11"
  }, 
  "mgDkHHERq6jDI9kdvQ0blw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jigna P.", 
    "review_text": "I learned about Antologia through a Black Board Eats offer for 30% off with a minimum order of 1 drink per person. When I first arrived around 6:30pm on a Wednesday evening, the place was ghost town and I was skeptical. However, the 2 gentlemen inside kindly allowed me to use the restroom without any obvious intent that I would be dining there. My husband showed up about 15 minutes later and we decided to give the place a try.  The wine selection was just phenomenal and it was tough making a decision but the server was very helpful as he tried to understand our preferences. My husband ordered the Argentinian flight and I ordered the Spanish flight and we shared the Bruschetta platter. OMG!! Possibly the BEST bruschetta we've ever had! Overall, it was a great experience and I would highly recommend Antologia to all wine lovers. I would like to go back and try another flight and possibly a flatbread, only if I can keep myself from ordering the bruschetta again. Definitely worth checking out!", 
    "review_date": "2013-03-14"
  }, 
  "AFMCz8n65JMWQUClaYAMsA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian H.", 
    "review_text": "Awesome service and wine list. Our waiter was really friendly and knowledgeable. The 6 country wine flight is such a good deal!  Can't wait to come back and try the food too.", 
    "review_date": "2013-08-28"
  }, 
  "DW3UC61lk9VbdrphmfamsQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B J.", 
    "review_text": "I stopped in to try the sangria last Friday. I don't know much about wine but i know a little about sangria. The sangria was wonderful and the presentation was lovely. They serve the sangria in small barrels at the table! Also, we ordered some of the flat breads and the shrimp ceviche. The food is truly complementary to the wine.  The new owners have improved the place tremendously.  Also, the staff and owners are friendly and accommodating.  The vibe is relaxing.  I will definitely be going back.", 
    "review_date": "2012-07-23"
  }, 
  "hMMFO23k4Ngp2H-8sWr7ng": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "sher a.", 
    "review_text": "Nice owners, nice staff. Loved the ambiance here", 
    "review_date": "2012-08-27"
  }, 
  "U-plBHDqCBCGDJKFukCvNg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Eclectic E.", 
    "review_text": "Fun that they have three different flights of Latin wines. Nice atmosphere and reasonable prices. Perfecto!", 
    "review_date": "2013-04-28"
  }, 
  "VsgknCPc4ReaMXD3LX-S8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E B.", 
    "review_text": "Definitely a hidden gem on Broadway, considering most broadway joints are divey and dirty. Clean and spacious inside, ambience is nice, service is friendly.  Food was yummy, wine selection is focused on latin america.", 
    "review_date": "2014-05-30"
  }, 
  "hxo5--VketoAHchr0GOK8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea S.", 
    "review_text": "I came here with some friends on a Friday night. The wine selection was excellent as was the price point. It's always great to find a delicious glass of wine under $10. We also ordered the margarita and manchego/fig/arugula pizzas and a salad. The crust was light, making it a perfect snack to complement the wine. Highly recommend the tempranillo and manchego/fig pizza!   Great spot to get a glass of Spanish wine and munch on small plates. I'll definitely be back to make my way down their wine list.", 
    "review_date": "2012-07-09"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Antologia is a cute unassuming Spanish wine bar, located unexpectedly on Broadway next to the clubs and \"clubs.\" I love Spanish wines, but the menu included food, light bites, and a variety of wines not limited to Spain.   Being the wine snob I am, I was not particularly impressed by any of the wines I tasted. However, I would most definitely return for the atmosphere and overall value. Tastings were cheap and pours were hefty - something you don't come across very often in the area.  Great spot for hanging out with friends and sipping on some wine. Can't wait to return!", 
    "review_date": "2013-09-11"
  }, 
  "PPgyaeI9Y52VErV5uHTDYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clarice C.", 
    "review_text": "So glad I found this hidden gem on Broadway! Food, drinks, and service are all 5 stars! Came here on a Friday night and it was not busy at all (sadly). The chicken goat cheese flatbread was very very good. Not enough to be a meal, but it makes a great snack. The mexican bread pudding was also very tasty.  I would definitely come back if I was looking for a snack and quick drink. It's a unique atmosphere. Kind of a blend between latin american tapas and a wine bar.", 
    "review_date": "2013-12-23"
  }, 
  "J8Efw_X9PSNxyC9jdTUvtQ": {
    "user_rating": 4.0, 
    "user_location": "Delray Beach, FL", 
    "user_name": "Nick S.", 
    "review_text": "Shared two bottles of red.  Great wines, relaxing atmosphere.  Will try again the next time I am in SF.", 
    "review_date": "2013-01-27"
  }, 
  "IbAFaLEobY3ZTMegQBCSHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly S.", 
    "review_text": "Great ambience and very helpful with wine selection!", 
    "review_date": "2014-05-25"
  }, 
  "D4RgCQNfn8M5lSYx8YWOSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen A.", 
    "review_text": "Love the service there, the owner Carlos Alejo is very friendly and so are the rest of his crew members that work there. I was pleased with all the good tasty tapas and wines. They also have very delicious red sangria, and white sangria\" my favorite\". If you are looking for a good place to have Latin American wine this is a good place Enjoy your time there!!", 
    "review_date": "2013-07-16"
  }, 
  "nOATMDOSe1Z5-afJC0Jpyg": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Jon P.", 
    "review_text": "Great little wine bar. Good selection of wines &amp; the sangria is excellent. If you find yourself a little hungry after a couple of glasses, try the flat bread pizzas. Carlos was a wonderful host.", 
    "review_date": "2013-09-21"
  }, 
  "J2W5pb0_300Gmy-W7gZz6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitzi A.", 
    "review_text": "Want a mini mental European vacation?  Go to Antologia Vinoteca...and take a vino trip to Spain!  Great sangria, charcuterie and Latin wines.  For an ultimate trip, customize your trip by a \"Customize Fight\" of any 3 wines by the glass (including the \"reserva\" wines &amp; bubbles!).  Been here 2 days in a row!  Definitely come for Happy Hour ($5 Sangrias) and try the Pickle mi Torta sandwich!!!", 
    "review_date": "2014-01-16"
  }, 
  "QzdcIGrFDSzIgCiPKLPvMg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ROB L.", 
    "review_text": "Antologia Vinoteca is an awesome find in North Beach!  Hidden along the Broadway strip, it's easy to miss.  Friendly people, good spirits, and light snacks.  It's actually a great place to sit and grab an appetizer as you wait for a table for dinner somewhere else in North Beach!", 
    "review_date": "2013-03-04"
  }, 
  "IAxrqUQFeGzlDHQeMFktQg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalia H.", 
    "review_text": "I have such a great time EVERY time I am at Antologia! Their events are packed and fun, on non-event nights they are perfect for a date, small group of friends, or just an awesome glass of Latino Vino! Definitely taking my wine snob Italian dad here before dinner this week. Will update with his opinion!", 
    "review_date": "2012-10-29"
  }, 
  "JwQ8oI5iXKaqfBgZSpm19Q": {
    "user_rating": 3.0, 
    "user_location": "Newark, CA", 
    "user_name": "Amy C.", 
    "review_text": "I'll always remember this place where I tried ceviche for the first time...  I was at Antologia Vinoteca for a Simmr event a couple wks ago. The event was a ceviche-making along with wine-tasting.   I've always heard of ceviche but never tried it before so I was pretty excited about this. The staff there were friendly &amp; pretty attentive.   This place offers some wine that's from Chile &amp; other Latin American countries that can't be found in your regular grocery stores. It was interesting to try the wines &amp; tasting the distinct flavors from the different countries.  The ceviche was pretty delish. I can't wait to make ceviche again whenever I'm at home. The sangria there were pretty good. My only gripe about the place/event was when the staff asked for the guests' drink orders when we were all get situated with the ceviche making. Some of us thought that the drinks was included in the price that we paid for the event, but it wasn't. Wish they have clarified that.. It was kinda embarrassing having them kinda chase us down as we were already out of the place. -_-", 
    "review_date": "2013-11-27"
  }, 
  "S9W_35xHVki8NDYfxVR-gw": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Mike V.", 
    "review_text": "Being someone who enjoys a glass of wine but doesn't necessarily know the difference between regions, flavored and color I appreciate Antologia's friendly staff and their recommendations on wine and food. Over the course of the last hour I've been taken on a tour of the beautiful, delicious grapes from Spain and Latin America. I highly recommend this place whether it be a quite Sunday afternoon or a busy Friday night. You won't forget this place and well, I doubt the staff will either. Thanks for the good time Antologia!", 
    "review_date": "2012-07-15"
  }, 
  "YAG90mceVFQLdvl4wndvQg": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Margaret R.", 
    "review_text": "The owners of this wine bar are very nice. The bf and I really enjoyed the wine here, which are all from South America. I can't wait till they add desserts to their menu (e.g. churros with ice cream!)", 
    "review_date": "2012-09-10"
  }, 
  "O8wt_rD3g3zOMLgvThVK-w": {
    "user_rating": 2.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Alicia K.", 
    "review_text": "I feel somewhat terrible being the first person to write a sub-3 star review on this place, but there were just so many issues with this meal that I cannot in good conscience award it more than 2 stars.  Nothing was *bad* per say, but I was super disappointed in just about everything.  1. Ambiance -- call me crazy, but a place in this area that is otherwise completely empty except for my party of 3 on a Thursday night is kind of weird.  And as a Latin wine bar, why are they playing a Turn of the Millennium Top 40 Female playlist??? Mariah Carey? Kelly Clarkson? Spice Girls? I mean don't get me wrong, I enjoy rocking out to \"Wannabe\" and \"Spice Up Your Life\" in my car as much as the next person, but it was super out of place and kind of awkward here.  2. Wine -- subpar to say the least, and in glasses that are difficult to swirl and limit your ability to actually appreciated the \"nose\" and flavor of the wine. I am nothing near a wine snob, but honestly wish I would have brought my own $7.99 winner from Trader Joe's rather than be disappointed by all 6 wines in the Old World and New World flights.  This place is a wine bar for goodness sake!  At least have glasses that give the vino a chance! Oh, and that doesn't generally suck.  3. Food -- the Chorizo Fondue and plate of meats and cheeses were both good, but the empanadas were bland, greasy, and kind of soggy -- for sure one of the biggest letdowns for me at this place. I LOVE, LOVE, LOOOOOVE empanadas!  And these were a total bummer.  Dare I say I make better ones at home??? Oops!  I dared. I said it. And it's true.  4. Service -- remember how I told you we were the ONLY people in the place? Well apparently that made us unimportant and gave the two guys working there permission to blow us off and play on their phones the whole time.  Icing on the cake.  Over it.  Maybe today was just an outlier in their performance, but with so many other awesome options in the area, we certainly won't be back.", 
    "review_date": "2014-10-23"
  }, 
  "1ohwh7VwQC92-oQkk3ZaeA": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Emily N.", 
    "review_text": "Was here just last week for the first time and loved it. The menu had a perfect amount of selections and the mushroom risotto was great- the apps were fantastic though, definitely will go back!", 
    "review_date": "2014-12-29"
  }, 
  "Eoqb8KgTApix_C_h0VOfNg": {
    "user_rating": 5.0, 
    "user_location": "Jamaica Plain, MA", 
    "user_name": "Janine A.", 
    "review_text": "The sangria is amazing and the service is great.The wine selection is tops. However, I don't expect this little gem to last. The pitbull and  beyonce club music playing attracts young kids drinking sangria and running in for bathroom. My partner and I were the only ones actually ordering wine. The clientel is more likely pbr and boones drinking.", 
    "review_date": "2012-10-10"
  }, 
  "vH4ac_IkrPtVyBP-i0GTBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "melita s.", 
    "review_text": "I revisited Antologia Vinoteca and sampled several items from their new menu - plantain chips with a delicious spicy sauce, three types of empanadas, a shrimp ceviche dish and a chocolate desert, each paired with a carefully-selected Latin American wine. My friend and I really enjoyed our dining experience, which was enhanced by Carlos' excellent service. This was a huge improvement over my last visit and I look forward to returning and trying more items from the new menu.", 
    "review_date": "2014-04-11"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Broadway street is known to become all flashy when night arrives, so this was an unexpected hole-in-the-wall, low key wine venue to encounter upon!  Their focus was on Latin American wine, which ranged on places, from Spain, Argentina, Portugal, Uruguay and to Chile.   We did a flight tasting and the most distinct one that I tried and disliked because of the strong black peppery, clove taste to the red wine, was Portugal Proeza, 2009.  I can't really say that I was a fan entirely for all the wines I tried from the flight, unfortunately.  However, now I know that Latin American wines are very earthly, full of spices and flavorful in terms of taste.  They offer side food to compliment or balance the wines.  They have sangrias!  Quite a refreshment if you are passing by during the daytime!  Service was attentive and our server let us take our time.  The decor of this cozy place is dimly lit and with about four to five seating tables as well as a wine bar seating area upfront.", 
    "review_date": "2013-10-17"
  }, 
  "y0xXppH7fNWm9q61blucbQ": {
    "user_rating": 4.0, 
    "user_location": "Greenwich, CT", 
    "user_name": "Ted P.", 
    "review_text": "Wine list arranged by county, which I like. Could use some more descriptions of the offerings right on the wine menu, but I'm glad I asked for help, which came ably!", 
    "review_date": "2013-03-21"
  }, 
  "gAWtc-VZtHfayk3v5yJryg": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Sergio R.", 
    "review_text": "Great place to grab a glass of Latin American wine. They also have a decent selection of Latin American beer. If you're into sangria, it's a must try here as well. The staff is always friendly and very knowledgable about what they serve.   Next time you are in, try: Xingu Black Beer from Brazil.   Cheers!", 
    "review_date": "2013-06-15"
  }, 
  "7Hc7aiXOeuUfUCDN-z8Y1Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tiffany P.", 
    "review_text": "Great Malbec and awesome bruschetta. Great service at the bar and cute spot but not much atmosphere if you're looking for a full on dinner. Great stopover before dinner...", 
    "review_date": "2013-11-27"
  }, 
  "p9YkB67XM7jIm6vJD1Wifw": {
    "user_rating": 5.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Kate L.", 
    "review_text": "Amazing, great place!!!!", 
    "review_date": "2013-07-13"
  }, 
  "8qpFUPR1wd3uz8N1QaWj_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Al L.", 
    "review_text": "Heard about this Latin American wine bar on Broadway in North Beach so we decided to check it out.  It is nicely decorated and you can sit at the bar in the front or in one of the dozen tables in the back.  Nice place to chill and catch up with a friend or friends.   We ordered a Jamon Serrano Bruschetta (<a href=\"http://www.yelp.com/biz_photos/antologia-vinoteca-san-francisco-2?select=hZ3xl-QlIShtDF3Z9FNA2g#9DZ1kVu1D_yBXPiBZJTtwQ\">yelp.com/biz_photos/anto…</a>) and a Figs a la Xerez flatbread (<a href=\"http://www.yelp.com/biz_photos/antologia-vinoteca-san-francisco-2?select=hZ3xl-QlIShtDF3Z9FNA2g#pqbMzVjEMFwexU_OYDtPcQ\">yelp.com/biz_photos/anto…</a>).  Wanting a wine flight, we asked the server the wines that would go well with our food.  He suggested that a Spanish and Argentine wine flight for us. (<a href=\"http://www.yelp.com/biz_photos/antologia-vinoteca-san-francisco-2?select=hZ3xl-QlIShtDF3Z9FNA2g#DkDP1Khty3lYLj1lS8j6aA\">yelp.com/biz_photos/anto…</a>)  The bruschetta and flatbread were delicious with a great combination of ingredients and went very well with our wine.    Overall, a nice wine bar to hang out with some great wines and food with friendly service.", 
    "review_date": "2013-03-31"
  }, 
  "xUsF4fBSs1heRXVabPZTLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Feast S.", 
    "review_text": "A great place to party and have fun, the people are friendly and have some of the best Sangria in SF.. ... the wine collection is unique and the owners have great knowledge about wine...Definately a place worth visiting !!!!", 
    "review_date": "2013-11-30"
  }, 
  "eZNhFI6m07dvu1zfLfJc-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy N.", 
    "review_text": "Great new spot that just opened up this year. Atmosphere is relaxing with some Italian touch to it. They serve a selective wine list from different countries. There is also beer selections by the bottle too.  Friendly and attentive staff.", 
    "review_date": "2012-09-25"
  }, 
  "VwLnrSQ9IpyjZ3jpk4cUCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D Z.", 
    "review_text": "Being in the industry &amp; very familiar with North Beach I can honestly say that this is a place that was desperately needed. The previous ownership The Vin Club took the first step to reignite some culture on the Broadway Corridor. Now they have passed the baton and what has come about is certainly a move in the right direction. The new owners' enthusiasm exudes as they speak about how their vision for Antologia came about. The Latin wine selections are exquisite &amp; the food a perfect accompaniment for the diverse list of beverages. The size of the venue, decor &amp; bartop made w/ reclaimed wine crates give the space an element of coziness &amp; charm.  \"Unacceptable\" that the place is small a previous yelper writes? How much room do you need to sip some vino? And wine bars are not a new phenomenon in SF \"wine connoisseur\". If you don't remember the London Wine Bar or talked juice with Chuck of The Jug Shop then you don't know the history of the wine scene in SF.  These guys are new to the game and it will take some time to work out the kinks, as all new businesses in this industry do. Passion has become a scarce element in new business ventures in this City. It is refreshing to walk into a small business and see the ownership operating the entity with such love &amp; care. I appreciate &amp; commend your efforts, I wish you all the success. I will visit often.", 
    "review_date": "2012-07-23"
  }, 
  "qChPwxmepg_XQpOn-iTWMg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MartyMar G.", 
    "review_text": "I don't stop by often enough, so feel guilty.  But this is such a reliable stop for good tasting South American wines. Flights are great, sangrias are delicious if you're more in a sweet tooth / cocktail mood.  The bar is situated in the strangest spot between the dance clubs, strip clubs, and little Italy night life.  But once you walk in, you feel immediately at ease. Plus the bartender, JC, is super / normal / chill / easy to talk to / no airs about him / no sense of hipster got-to-be-cool stuff here.", 
    "review_date": "2014-02-11"
  }, 
  "snaLHt2OSb5I3n9Yu9zcDQ": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Elizabeth W.", 
    "review_text": "Had the red and white sangria which were both delicious. Also the Quixote which was a bubbly lemony agave wine. If you want a bite to eat, I highly recommend the Rumbo Norte flatbread.  The ambiance and everything about this place is awesome. I see why it deserves 5 stars. :)", 
    "review_date": "2013-08-16"
  }, 
  "y9NVWCtL1KClLWiokqaJaA": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Christina M.", 
    "review_text": "A group of 5 of us went here for lunch.  What a darling place!  We all loved our lunches.  We had the pollo loco (chicken sandwhich), the pickle mi torta (prosciutto, cheese, home made pickles), the salad with mushroom confit and poached egg.  The ingredients were super high quality and delicious.  The bread for the sandwiches (which so many businesses can't do right) had great crust, yet was soft on the inside.  The chipotle aioli and the garlic aioli would make an old shoe taste fabulous.  They also have a great selection of wines.  Do yourself a favor and don't miss this place!", 
    "review_date": "2013-10-30"
  }, 
  "8tuJTcoOAanM18sEr_lzIA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Pierre P.", 
    "review_text": "Antologia was open for about a week the first time that I visited. It made a great first impression.  What really stands out in this business is the service. Everyone is very friendly and attentive. They honestly care that you are having the best possible experience from start to finish. Their knowledge of wines is ample, yet there are no elitist attitudes to be found anywhere. Striking up a casual conversation with the bartender is effortless.   Antologia is a wine bar that serves small munchies to mix with the beverages. It is not really a tapas bar and it doesn't try to be one. Their wine list features selections primarily from Spain, South America, and California. They also serve a sangría that is great considering that the business has a wine-and-beer-only license.   The location is good: close to everything in North Beach and located very close to the intersection of Columbus and Broadway. As word spreads about this vinoteca, it likely will get much busier.  It's a great place to become a regular!", 
    "review_date": "2012-10-15"
  }, 
  "IpQWOoxEIBJDQ_pX7SFxLg": {
    "user_rating": 5.0, 
    "user_location": "Golden, CO", 
    "user_name": "Jeff H.", 
    "review_text": "Happy hour a real bargain.  Had 3 wines, all very good.  Appetizers complement the wine well.  Not crowded like wine bars in the downtown area.  Will return here when in town again.", 
    "review_date": "2013-04-11"
  }, 
  "3SAAn35I_-kj6a7nqqBAmw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura f.", 
    "review_text": "My husband and I stopped in here on valentines day before going next door to eat dinner. The two guys behind the bar were just fantastic - they treated us like royalty and we sat at the bar until we were ready for dinner. They also let us take our glasses and wine over to the Indian restaurant to finish there. I'd love to come back for more wine and hopefully a cheese plate this time :)", 
    "review_date": "2013-02-21"
  }
}