{
  "oMjMxpYR12LEXYu5m_rqmg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jeziell B.", 
    "review_text": "Went here for my girl's grad celebration. Of course finding parking sucks around 10pm on a Saturday night in the city, especially with all the restaurants and clubs in this area. Took us about 30 minutes of driving just to find parking a couple blocks away (just a warning so you can give yourself enough time). Seems like a spot for party bus peeps too, when we went, a group about 30 people got into line from a party bus. If you're on the guest list, I'd try to get there early, like 10-10:30 to give yourself enough time to get in without having to pay the $20 cover (guest list closes at 11pm)  Once inside, music wasn't too shabby. I had a great time. Seemed like the music in the front room was a little better (more old school) than the back room, but of course the back room has so much more space. Never felt like I didn't have enough space to dance, which is good because the last thing I need is some girl's sweaty back rubbing against my arm. Drinks are typically priced, bout $10 for a Goose and Cran. Asked for a double shot of Henn for my girl and it was $14, but it was literally like half a cup of Henn. lol. Bartender in the front was attentive and worked fast.  Not bad at all. Would come back.", 
    "review_date": "2012-06-08"
  }, 
  "R9TIWPBlMuzzWgYXZBnAlg": {
    "user_rating": 3.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "S B.", 
    "review_text": "nice crowd ... doorman let me slide in on relaxed dress code ... d.j was banging out hits &amp; bartender was n the mix like a blender ... i enjoyed my time and would go again", 
    "review_date": "2013-03-08"
  }, 
  "ydNRRZrATh99osddko5Bog": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "gEe C.", 
    "review_text": "From what I can remember. . .  Because trust me, it really wasn't a lot, since I was drunker than drunk, it was pretty cool.  I came here for a private event and it was a sizable place.  I can't really review much on the downstairs, but the upstairs was pretty tight.  I think they got two stages, no?  Or maybe, just one. And it was really dark.  But then again, that was probably me on the verge of passing out.    Hmmmmm. . .  Gotta give props to those bartenders  if your dranks got me to that level.  HEEY!!", 
    "review_date": "2009-10-16"
  }, 
  "yhzb5adgzluN8O12rl6d8Q": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Jane P.", 
    "review_text": "I went here with Christine B. (see her review below).  I will give it 4 stars because here in New York I am deprived of...space.  I liked the venue, but let me start from the beginning.    We got there decently early (before 10:30) to get in for \"free\" before 11.  Of course the line didn't budge.   Our friend did get on the guest list, but we as his appendages only got a discount (decent though).    We walk in and the first floor has a bar, a lounge area, and is rather cramped.  I thought this was the whole of the club (hahaha I am telling you I am just expecting of cramped spaces bc of NYC).  Anyways, we make our way to the 2nd floor and the dance floor is (to me) incredibly spacious.  I was sort of appalled.  And it's air-conditioned.  And you don't have to shove your way through people.  So awesome.    The DJ looked like he was 50 though....and he played some horrible music in the beg.  The first floor had greaat music.  But throughout the night we just kept going back and forth, and eventually the music on the 2nd floor got better (as in more top 40 ish).    The crowd is....alright.  But all you need is good friends and good music and this place has potential.", 
    "review_date": "2011-09-07"
  }, 
  "Z88rSP-Kn1aK7MwRYir1og": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christi S.", 
    "review_text": "Stopped by for a quick visit.  This used to be the old Zebra lounge.  Everything still looks the same.  No real changes from previous club name. The back room still has plenty of room. HUGE!  DJ had some house/trance music in the back room and there were a lot of Euro guys bouncing around.  The front room, a bit smaller I believe they had hip hop/r&amp;b/pop.", 
    "review_date": "2008-10-19"
  }, 
  "VCoBNwAUSvo0Sz2ORszOOw": {
    "user_rating": 2.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Mariel F.", 
    "review_text": "I come here only for their Fashion Events and Musical Guests (Jeremih, Jay Sean, etc).  There are just better clubs out there.", 
    "review_date": "2011-04-21"
  }, 
  "-072yGcrQlizY7urNgquSg": {
    "user_rating": 3.0, 
    "user_location": "Chula Vista, CA", 
    "user_name": "Keem J.", 
    "review_text": "I was looking at a bunch of the yelp reviews before I rolled here this past Saturday night and most of them were from the early part of Winter, so I wasn't quite sure what to expect.  First, parking on Broadway was terrible. We weren't down to park and pay because we'd much rather use that money for drinks at the bar, and spent nearly 25 minutes looking for a spot. If you've ever been to the City, you know there's a buttload of one way streets, so this definitely took away from party time. There were a bunch of po (aka police) out, and hella meters on Broadway were blocked off. When we finally found parking it was nearly 4 blocks away. Now, I'm always down for a walk but -- ladies can back me up -- it is VERY difficult to walk up a hill IN HEELS and look cute...especially when you need to pee and you're not drunk enough to do it in public.  Guest list ends at 11 and since parking took a lot longer than expected (yeah, we were super annoyed with that situation), we didn't make it. On the plus side, there was no line by the time we conquered that hill. Cover was pretty expensive ($20) but we managed to mouth piece the girl and she let us in for $15. At the same time, though, the girl might've been a beezy because the bouncer, who was really nice, told us there wasn't cover since it was so late. I guess we'll never know...  I don't think there's a dress code. If there is, it's not strict. I saw some fool wearing a North Face jacket zipped up to his chin.  All the past reviews said the bathrooms were clean, and those were lies! The ladies room was a mess...hella mystery liquids on the floor, paper towels everywhere, and 1 of the faucets (out of 2) was broken. There's are some cushes for tushes though, so you can holla at that if your booty is tired of backing it up.  The DJ was alright. His mixing was horrible, the flow was awkward. He played artist blocks quite a few times (I remember 3 MJ songs in a row. RIP, homie). The dance floor is gigantic and the DJ does his best to keep it moving. The ambiance is similar to the club in Knocked Up, so if you're inner sexy Katherine Heigl or geeky Seth Rogen wants to come out, embrace it. There was a good mix of people and the vibe (other than one creepy drunk fool) was cool. Having gone with low expectations, it turned out to be a really good night. I don't think it's really worth the $20 cover so try and get in via guestlist. The fun factor would increase if you roll deep with your folks.  Last thing, their AMFs get the job done and they don't even taste bad!", 
    "review_date": "2009-07-13"
  }, 
  "Nq1OAJRt3p7xZv0CNEzKXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steph D.", 
    "review_text": "I've been in play mode!  Making the most of my winter break, and my waistline is paying for it -_-  Christmas day, yes I went out Christmas day, just to show some support to my Synergy folks.  I wasn't in the Christmas spirit this year, not at all.  I felt like the grinch..so what better way than to get f'd up and forget about everything?  I spent XMas eve with the fam..don't get me wrong.    Atmosphere wasn't that packed, but that was expected...we knew that all the people out would be the ones that don't really celebrate Christmas, aka fobs (HAHA no offense to anyone..I don't mean this in a goo wok jai sense either..).  We did bottle service that night - oj &amp; cranberry juices were watered down..but damn we sure did drink a lot that night.  VIP lounges are nice and comfy, a lot more open than Boss but not as many booths or whatever.  From what I can remember, music was good, bathrooms were clean..and most people there were my friends so no creeper issues.    Go back?  Yes.  Grey Goose ALL night?  No.", 
    "review_date": "2008-12-30"
  }, 
  "QCW7PMwU8JAaKKC02FN4mQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew M.", 
    "review_text": "When I was in elementary school I watched a movie about cattle stockyards. You know, those places where they house and horde to-be-eaten cows into a mass before shuttling them off to be butchered and devoured?   As I milled into Atmosphere I definitely felt like one of the cows being pushed into an assembly line. Sealed on lock step, being pushed by a gruff and relatively unfriendly bouncer, I expected to be led into a slaughterhouse or an interrogation chamber where I would be repeatedly asked for my papers or the location of the rebel base.  Okay, that's a bit much. But seriously, Atmosphere is a horribly packed venue. Dancing when only the downstairs is open is remarkably impossible. The practice of doing anything other than stepping left, right, and just wedging yourself against six other people is literally like an interview question I got at Google once. And much like the Google question I got, it's really hard to come out on top. NP-Hard in fact.  The back bottle service room is better and bottles at Atmosphere are comparatively cheap. But the \"ambiance\" is a little lacking, given that the last time I was there the guy at the table next to me just started wretching with the full desperation of someone who called poison control after they swallowed something like weaponized ebola. What's worse is that homie was exploring the contents of his stomach for nearly twenty minutes until the waitresses and the bouncers decided to escort him outside. It was kind of like watching a race car crash on Nascar.  Look, I'm sure Atmosphere isn't a bad place per se. I'm sure if you're blacked out drunk you might have a lot more fun getting hot and moving 3ft/hr on the dance floor. But I don't like rolling to places where I have to kill a can of pre-ban FourLoko before I'm something similar to enjoying myself.", 
    "review_date": "2012-06-28"
  }, 
  "pua1YEWvJcUu8WkR-O_Vbg": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Devyn G.", 
    "review_text": "This place is absolutely horrible... I paid to get bottle service and when I arrived the club was completely DEAD. Karen the \"events specialist\" was totally unprofessional and regret ever dealing with her. There were literally about 5 people in the club and they did nothing to try to accommodate us. I am disappointed and I would NOT recommend this place to anyone. Completely ruined my birthday.", 
    "review_date": "2013-08-10"
  }, 
  "w501uxxLr-q5FGNpMI1Zsg": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Christine B.", 
    "review_text": "I came here for a Kollaboration event so it was pretty much 85% asians - not sure if that's representative of a typical night though.  Bouncer: decently nice  Music: the bottom area had hip hop which I appreciated.  The other room has more pop-y music so if that's your thing. then. good for you.  Drinks: not sure how much it is... I didn't pay  The Wait: get in line around 10:20.  Even though it took us past 11 to get in (by a few minutes), they let us in for free on the guestlist.  Overall it was just okay.  I wasn't feeling the crowd - probably wouldn't come back again.", 
    "review_date": "2011-09-07"
  }, 
  "LPkXc94_xyRN09d8sXSR7Q": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Christine B.", 
    "review_text": "When the line gets long here, you end up waiting in an alley that smells quite nasty... I suggest you get here earlier at like 10 to avoid being in the stinky alley. The club left me with really bad first impressions from the way it looked on the outside - super grungy like you were going into some sort of dungeon.   Upon entering - Atmosphere is a pretty big club with multiple dance floors playing various types of music in each room. They have multiple bars and the drinks are standard. The crowd can vary from casual to dress to impress - once the bouncers start letting people in they pretty much let anyone in and the crowd can get really sketchy. I don't know, but this has been the ultimate creeper experience in SF that i've had. Too many eager beaver guys coming out of nowhere!", 
    "review_date": "2012-08-14"
  }, 
  "tfg1Nhwx94Y4GdQHLVawbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed L.", 
    "review_text": "Great job with the remodeling job. I went from a warehouse to a nicer warehouse. But seriously its way better in terms of looks and feel but North Beach is just a trashy area.", 
    "review_date": "2008-11-03"
  }, 
  "4an_jbW1wyOt3GC4gk6GaQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Nancy L.", 
    "review_text": "A big-@$$ \"THANK YOU\" to Atmosphere (especially Bennett!) for helping to make my \"--th\" birthday the BEST one yet!!!  If any of y'all need a nice and relatively new venue in SF to throw yourself a kick-@$$ birthday party, I'd definitely recommend Atmosphere.    After my last review, Bennett (co-owner) contacted me to get some feedback on the venue, the music, etc.  Coincidentally, I was conducting my annual \"Where in the heck should I throw my birthday party?!\" research so, I paid another visit to Atmosphere.  Bennett is SO sweet and SO accommodating.  He showed me various sections of the club which would be ideal for a 50+ person birthday party.  I chose the roped-off VIP area behind the DJ on the main dance floor.  It's large enough to accommodate at least 50-75 guests, and it's surrounded by couches - a perfect lounge-y area right next to the dance floor.  Instead of charging me an arm, a leg and my firstborn just to use the space, he provided several options for renting it out.  Since my friends and I are not fans of bottle service, Bennett proposed a flat fee, no need for bottle service (compared to other venues, the flat fee was relatively inexpensive - and I'm sure I could have negotiated it down if I hadn't been lazy about it).  All my guests received free admission/no cover, and there was even a dedicated bouncer for the section which had been roped-off for my birthday!  [Note: The bouncer did his job a little too well - some of my friends weren't able to get past him without special wristbands!!]    Bennett even provided tables for the cakes my friends brought, and I think he even provided utensils.  No charge for any of the special set-up.  The only reason I am not giving Atmosphere five stars is because, well, the music was still not quite right.  The DJ was really sweet and friendly, though!  But he played a lot of remixed stuff and techno which was sort of Pop/Top40 but not quite; and he barely played hip-hop.  Fortunately, most of my friends were too drunk to care.  The DJ was also missing a mic so, no birthday shout-out for me. :(    Other than that, no complaints.  Thanks again, Bennett and Atmosphere, for making this birthday the best one yet!!", 
    "review_date": "2009-01-22"
  }, 
  "IgSg9e9D_NLsqTI_bRlu4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gladys D.", 
    "review_text": "This North Beach spot gets four stars for hosing the \"Ripple\" benefit last Friday.  I was a little apprehensive because it is the ex-Zebra Lounge, a place that i went to four years ago!...and i swore i would never set foot in a north beach club again...but for charity, why not?  By doing this benefit...Atmosphere really gave me a look at the potential of the space...it took out the \"typical\" north beach crowd...filled it with clean good looking young professions...and POOF! a great looking space emerged!   the upstairs room was perfect for the huge crowd that was in attendance...the new side room on the first level was a great addition!  Decor, Lights, Bars were great.  Would i come again? yes, if they pulled a young professional crowd again..Big Ups for hosting a benefit here!", 
    "review_date": "2009-02-09"
  }, 
  "_q_MC7ebjDOCpX5Ec7TXEQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lulu C.", 
    "review_text": "What's the difference between Atmosphere and Zebra Lounge? Ohhh..that's right. just the name. it's exactly the same as it was before.  I went here recently for \"The Spa\" promises of makeovers and free massages...when i got there, i felt like i was at an office party..everybody was stacked in little cliques and groups, just chatting with their champagne. Nobody was dancing, nobody was mingling...  I went over to find the \"spa\" area, and what i found was 1 chair massage, and 2 girls working out of a portable makeup case giving makeovers under 1 flourescent light!! are you kidding me?!  Flourescent light?! that's the best you can do? and guess where they chose to put the \"spa\" area? right outside the bathrooms. Wonderful.   The claim of having a soothing beautiful reef tank was an absolute joke. there were 3 fishes. count them. 1, 2, 3. and a few seaweed looking plants.  Yea, my goldfish tank has more personality..if i had a goldfish tank...  i think this club needs A LOT of work before it can pick up and get on solid ground.  The security was solid, but kind of off putting that they need to swipe your ID and take your picture before they let you in?? Doesn't really give me peace of mind..Would i go back? Not anytime soon..ask me in another 6 months..if they are still around.", 
    "review_date": "2008-11-13"
  }, 
  "w-US6FCjLJvqTiRsnQz89w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josie W.", 
    "review_text": "Definitely depends on who throws the event and who is the DJ. Do your research.  The couple times I went, it was packed because I knew who the event coordinators were and the place is spacious. The theme itself of having 3 different types of \"atmospheres\", hence the name, is a little lame. But I did have fun every single time I went! I loved the biggest dance floor room the best.    The decor never really changes, but the crowd and the music does. I did happen to go there on a slow night, where they only kept the front parts opened. It was a little awkward, but the DJ (DJ Romeo) kept the music playing and I had fun dancing.  The service is always nice, except those stuffy bouncers, but the rest of the people were friendly and smiley.", 
    "review_date": "2010-01-03"
  }, 
  "V-MvohG15HHEJAvljBqc7A": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Harry F.", 
    "review_text": "Pretty cool place, you can tell that they put a lot of money into the remodel.  I went on a night where my friends were hosting the party and they had an open bar to promote a new vodka called Devotion.  So I decided to drop in and see what was good.  I thought that since they had open bar I would have to fight my way to get a drink, but the bartender was hella koo, it was just him behind the bar the whole time and he got everyone what they wanted.  I left early and my friend told me when I did, all the hot girls started rolling in...story of my life.", 
    "review_date": "2010-02-26"
  }, 
  "Nj_9hGPd6BdimYQdx3Pyjg": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "selina g.", 
    "review_text": "went here friday for sisters 21st second floor closed good music small crowd bouncers kicked us out after 40 minutes this place was not crackin  the only good thing was the music was sick", 
    "review_date": "2012-02-26"
  }, 
  "Xq2MDSoxP8TUL1gRZF58Rw": {
    "user_rating": 1.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Lacey S.", 
    "review_text": "This has to be the worst club I have ever been to. I have been to a lot of shitty clubs and bars but this one takes the cake. Before arrival we were promised fast and free entry and when we did arrive not only did we have to wait in line for 30 mins we were told we were no longer allowed to enter the club at all. After watching hoards of ghetto people rush there way in we finally decided to speak to the manager to see why we had to wait in the \"VIP\" line when everyone else was getting in. The security guards were power tripping and just yelled stupid meat head shit to us.  There are so many other clubs to go to in the city please don't waste your time here.", 
    "review_date": "2011-02-27"
  }, 
  "v8wXnLb4164G6xErO4s3ZQ": {
    "user_rating": 1.0, 
    "user_location": "Antioch, CA", 
    "user_name": "J L.", 
    "review_text": "So I was also dragged to this club on the same day the Hult b-school folks decided to turn up there. I was not apart of their cohort, because we actually had VIP and i didn't see that any of them did (they wore their pink badge ropes the entire night). However, I will say what yelp reviewer \"Jennifer C\" is too polite to say lol!  Those \"aggressive, ghetto gropy\" guys she complains of were all black dudes. Of course no one would have been complaining had they both looked like and had the bankroll of, say, Kobe Bryant or someone like that. And neither would I. The fact is, I like black men because I'm not self hater, but maybe the combination of the incredibly profane and sexual music and the way the club is ran by management brought out the worst in everyone's behavior. The club knows exactly what it is doing. The idea I got was that the horny guys who come from all the titty bars are welcome here to close by the end of the night. There is really no other reason to totally ignore their \"cocktail attire\" strictly enforced on their website by letting poorly dressed folks come in, black and white; and have the DJ repeat songs that reiterate \"f**king and sucking\" all night long. There were some nice songs that played in between the ratch but it just seemed out of place at that point. Honestly, the vibe of the guys there was definitely too aggressive. Funny thing is, no one really groped me or harassed me because I look like a huge \"B\", which works for me sometimes. I love to dance and felt I couldn't get room to effing breathe let alone dance. If you're gangster and not easily shook then come here and get ratch because that's exactly what youre gonna get lol. If you're afraid and easily intimidated by 'urban' men lol, go somewhere else where you'll feel better and more secure.   One silver lining was this gorgeous Asian man employee (security?) with long dreads. He was very patient, forgiving and professional. Bless you Sir", 
    "review_date": "2014-11-02"
  }, 
  "bLLpAJ5ia_Bq170E0jZdOQ": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Black K.", 
    "review_text": "If this place was located anywhere else but North Beach, then it would  be a must-stop for anyone wanting to dance the night away or just lounge. With three rooms and one large dance hall, Atmosphere is a very pleasant location on your eyes. Your wallet and eardrums will be a different story.   The crowd on the night we went was diverse, but its easy to see how the infamous Contra Costa Valley Girl/Dude Guy crowd can inflitrate the place.   I'll be honest, the house DJ sucked! The majority of DJs understand the concept of maintaining a constant dance beat to keep the crowd moving...    One of the downsides of this place is that it has to abide by the city sancation NORTH BEACH LAST CALL meaning the party ends at 2am. No questions asked. Booooo....", 
    "review_date": "2009-07-11"
  }, 
  "aUNghAOA2JL7HOnbh-GD4Q": {
    "user_rating": 5.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Olga K.", 
    "review_text": "I like this place. I usually come here for Russian parties. The DJ's are cool, the bartenders are fat enough, there's a place to sit - which is very important))  To those, who couldn't find the restroom on the second floor, go straight ahead and it's on your left ^_^", 
    "review_date": "2008-12-03"
  }, 
  "NpU44ANnUUNQWY4U0eUGvA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "claudia y.", 
    "review_text": "i used to come here back in the day when it was called zebra.  then it was called lattitude.  now atmosphere.  a3 or whatever.    the side room can get insanely hot if there are a lot of people in there.  it is not well ventilated at all.  the main room is a giant square.  for those who wear stilettos beware, there is a grate right in front.  so if you think you are hot enough to bypass the line and show off your boobies to the bouncer/promoter be careful not to get your heel stuck in the grate. or just wait in line in that alley like a normal person", 
    "review_date": "2009-08-18"
  }, 
  "WJBj7fmt_MJER6HY5IZx2A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sylvia N.", 
    "review_text": "My birthday was a few Fridays ago and I wanted to make sure that my friends and I had a great time in SF, so I did my research.  I had a party of 20+ with me and wanted to find a club big enough and friendly enough to accommodate all of us.  I emailed around to various North Beach and SOMA clubs, and Karen, the manager from Atmosphere in North Beach, got back to me first with rates about table service, guest list info, etc.  Karen was very friendly through email and we had several exchanges.  She even knocked down the price for a $250 bottle of Belvedere to $150.  I decided that this was a steal so 12 from my group signed up for the VIP table service and threw in another bottle of Patron (at regular price).  She also let me know that the rest of my group (the other 10 people) would be \"taken care of\" and sure enough we were all on the guest list, all got in for free, and were all given wristbands for the VIP tables.  Talk about great service!    We were given the best booths in the house for all 22 of us! (Only 12 did the actual drinking from the bottles though).  And just our luck that night they had a special of $5 Belvedere cocktails from 10-11pm, so my non-table service friends were able to enjoy themselves just fine! The DJ was great that night.  They had a special video DJ event going on where they projected music videos onto all the club walls, which created an awesome atmosphere (no pun intended).  The DJ played a great mix of old school hip hop and current top 40 hits.  It was awesome! I think the best part was that it wasn't overcrowded and you could actually move through the dance floor and have enough room to truly break it down!! And, oh did I get down... ;)  All my friends were raving about the club the next day.  I've been to my share of clubs around North Beach and few have service as good as Atmosphere's.  The music, the club staff, the drinks were all great and my group left very, very satisfied.  We didn't have to deal with douchey bouncers nor were we packed into the club like sardines.  So contrary to all the 2 star reviews you see below I give Atmosphere a stellar rating.  I highly recommend coming to Atmosphere with a large group and getting in contact with Karen King the next time you go clubbing and want VIP service.  It definitely made for a memorable birthday, that's for sure....Cheers!", 
    "review_date": "2009-08-11"
  }, 
  "pnfVIB7UhvCQ7X2K0Q2XIw": {
    "user_rating": 2.0, 
    "user_location": "North Pole, AK", 
    "user_name": "Retired B.", 
    "review_text": "Yes, crowd in the back is pretty ghetto. (I think that's the hip hop room). Luckily there are two front rooms. One with trance that no one dances to, and another room to the side to lounge around in. The bathrooms are way too small though for that capacity.", 
    "review_date": "2009-07-30"
  }, 
  "_yntN5c3jV9gBWUfAhOp0g": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jackee K.", 
    "review_text": "I've been here twice.  Both times have been ridiculous.  Both times there was a large line out front, both times it moved quickly.  Both times, I've had A LOT of fun.  Both times, I have had drinks spilled on me.  Both times, I have enjoyed the music. Okay, enough of that.  Overall, a fun club for a Saturday night.  Good music, fast bartenders, fun crowd!  Bathroom's kinda sketch, though.", 
    "review_date": "2011-02-22"
  }, 
  "d-JOIH4H8NfEh-cFRe81gw": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "John N.", 
    "review_text": "Went there on the first Sat of the month.  First time at this place so decide to arrive before Happy Hour (selective drinks only) ended 11pm.  A friend knew the promoter which got us in quickly so thats a plus.  Saved me $20.    Pros:  Upstairs dance floor is one of the bigger ones in the city.  Great vibe with the whole club dancing.    Cons:  Location Location Location, parking can be a pain.  Younger crowd and don't expect it to be diverse. Majority asian.  Music was So-So upstairs, expected more hip hop instead of mixing the songs short.    Would go again for the big dance floor but wouldn't be my first choice.", 
    "review_date": "2010-08-30"
  }, 
  "xc6SGcbtsv0WiTMytmL6Vg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "JC N.", 
    "review_text": "Friday night isn't all that great but Saturday night is better. they open up the top floor and more people to meet. drinks ok. beer is $6 and mix drinks are $12 shot not sure. then crowd are mostly Mexican and A-American with some what Asian.  the line is long sometime depends.   parking is bad like any other club spots unless you want to pay $20 parking across the street or down the block.  there are always police outside waiting for you if you are too drunk. i really mean tons of police. if you are to drunk, they will arrest you even if you are with your friends and they are taking care of you.   over all its ok", 
    "review_date": "2013-03-17"
  }, 
  "bgesHJxTeDFertyFrLmvaQ": {
    "user_rating": 1.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Christoph F.", 
    "review_text": "I was lead here under false pretenses that there was Free entry to Beer Pong Olympics. After waiting outside in the rain for 15 minutes we get to the front of the line. The bouncer tells us it costs $5 to get in and gave us 5 beer vouchers and some Team number. We took the \"beer vouchers\" up to the bar where they told us we could get $1 PBRs for the Beer Pong Olympics- What a ripoff. So, $10 later I was playing beerpong with a bunch of random dudes from the hostel across the street against more dudes from the same hostel.   Only go here if you like being lied to, enjoy drinking PBR, listen to bad music, and hate women.   0 stars. I will never go here again.", 
    "review_date": "2014-01-09"
  }, 
  "Wh2Y4k8MPPvBAGoRu4WCNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connie Y.", 
    "review_text": "I usually rate bars/clubs based on how much fun I had and I must say we had a great time here! We came for my friend's 25th birthday and Mase was performing that night.   We came early to avoid paying cover. It was free with guestlist before 10:30pm. At 9:45-10:00ish, there was no line so we got in easily. As it got later, the club got more packed and the line got longer. Some of my friends had to pay $25 cover because they arrived a little after 10:30pm but they said the line was moving.   This place has two bars, one when you first walk in and the other one is upstairs. There's also a small room on the right for bottle service tables. So there are 3 separate areas for you to hang out at. It's not a huge place but it's decent-sized.   The bartenders were also nice. One of them charged us an extra $3 by accident and we honestly didn't even realize but he owned up to it on his own. He even offered to give us 2 more shots of what we had ordered to make up for it. That was not what I expected but I am definitely grateful for that!  It was a fun night at Atmosphere and we loved dancing the night away to the hip hop!", 
    "review_date": "2014-11-17"
  }, 
  "8Az6AHVoOaF9dBH6HzD5gg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Yesterday night our group of 4 were planning on going to Monroe next door, but lots of attitude from the doormen got us walking down the street and I'm glad we did! From the awesomely chill Benny out front to Cesar in the back, the staff made it known they wanted us to have a good time.   When going to a club all I really care about is the music and the crowd: crowd was friendly and diverse, and the music was good and there was a lot of dancing for everyone. You don't go to North Beach anticipating lots of parking and squeaky clean establishments (it's the freaking red light district!), you go for straight up partying. Guys should prepare to pay cover if not on guestlist (was $10 last night). There was no line at 10:30pm on a Friday night, and plenty of room to move around. No fights or ghetto feel and hopefully it stays that way for our future nights out here!", 
    "review_date": "2012-01-07"
  }, 
  "9wg-OPI3dYkMR_tOC26yCQ": {
    "user_rating": 2.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Mark P.", 
    "review_text": "Jeez, I really can't catch a break with the venues on Broadway. This place is the old Zebra Lounge resurrected with trashier crowd.   From a decor standpoint, I have to give the new owners credit for upgrading the place. The venue is pretty large to host corporate events, but unfortunately, the crowd that attends this club is reminiscent of Sutra next door.   Sure, I've been here on more than 4 occasions, but that was only because I've had bottle service discounts from my cousin who knows the owners.  The drinks are reasonably priced, but you have to ask yourself if you're willing to spend less on drinks for a ghetto crowd.  As for bartenders, look for Brenda...she's my homegirl who's not only hot, but makes it a point to get you tipsy.", 
    "review_date": "2010-12-21"
  }, 
  "kgH3K0hWgE41cjUtO9wMQQ": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Tracy C.", 
    "review_text": "Hella creepers, the bouncers are unfriendly and rude...and not cute to redeem themselves.  The bartenders are OK, the drinks were strong, but the atmosphere at Atmosphere left something to be desired.  I'm sure there should have been more than just the one crowded area for dancing, that was roughly the size of my living room. After watching several strings of men hitting on, and trying to dance with many girls, it just got tiring.   If being molested by creepers is up your alley, then perhaps you should come here. Though, the club pretty much clears out around 1:15, closing around 2. Probably a good idea, considering all the other clubs around the area, cater to those of the male population who believe violence is the answer (that means they all went outside to fight about whatever they were angry about, probably someone made a snide comment about their haircuts, or stepped on their shoes, y'know important stuff)  The staff (bouncers and coat check) are rude, they yell about almost everything, \"Don't lean on that post, even though it's holding our building up\" \"Don't put your drink on the one table we have in the dancing area, because someone might use it to smash someone on the head\", etc.  Apparently this is where sloppy drunks come to fling their alcoholic beverages, because I got about three drinks spilled on me. This makes sense considering it's the party bus's go-to venue, and drunk people cannot hold their liquor (that's funny, ahahaha punny)", 
    "review_date": "2012-05-26"
  }, 
  "TH_RbQROSJyT-OccDOINWw": {
    "user_rating": 3.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Sarah G.", 
    "review_text": "Atmosphere is one of my normal \"to-go\" places when we can't think of anywhere else to go.  It gets 3 stars (probably 3 1/2).  Depending on who is promoting and who is DJ'ing - the night can vary from a 2 star place to a 4 star place.  One thing to mention is that there is not much ventilation in this place.  Recently I noticed they started putting fans up by the bar to get the circulation going.    There is a dance area right when you walk in the door and then also a larger dance floor and bar in the back.  My opinion only, but the music is usually better in the front section and gives you a little more room to dance.    One reason I continue to come back is my favorite bartender in SF!  JAMES!!! Awesome bartender, great personality, treats us to some flair and tricks every once and a while, even got him to take a shot with me on my bday!!! =)  Definitely a reason I keep coming back!", 
    "review_date": "2010-10-11"
  }, 
  "7esPoDyIOt5PxJdoi2Ek2Q": {
    "user_rating": 1.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Elizabeth B.", 
    "review_text": "I went there on NYE and it was TERRRIBLE. It was mad expensive when you bought tickets near the end. Almost $100. yet for some reason there was still a huge line out the door that wrapped around into the alley.   The COAT CHECK was full! And this was especially terrible because I came there with a bag of what I needed in order to sleep over at a friend's place on the night of NYE. I don't understand how you can have the nerve to sell so many tickets that your own freaking coat check becomes full. Clearly a sign of them overselling to the point of not caring about each person's individual experience.  Lastly, the music stunk. They were playing really old music that wasn't even from 2010 and \"DJ Tina\" didn't seem to do any unique mixing or mashing. Just seemed like a random assortment of top 40 from the past decade or so.", 
    "review_date": "2011-01-01"
  }, 
  "ivG4VgMLNGf_wF1CIA1-Ww": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Spanky M.", 
    "review_text": "So the bartenders are quick, but thats probably because the place was empty untill a bus load of people showed up.   1 star for the bartender , 1 star for the venue design but minus 3 stars for the shit crowd and for being n Broadway.", 
    "review_date": "2009-09-19"
  }, 
  "NF7_K38Hc6G4R3hvEhT0dw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dave N.", 
    "review_text": "There's basically 2 rooms - the dance floor and the lounging area which consists of only 3 long chairs.  The DJ sucked yet the bartenders were good.  The only thing I could rave about is the chill crowd.", 
    "review_date": "2010-07-12"
  }, 
  "mdCAsnSP3uCH2859UYW66A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "linda L.", 
    "review_text": "I appreciate management reaching out, however, what's done is already done and we'll move forward from here.", 
    "review_date": "2010-04-28"
  }, 
  "j4zFnMgGLCSmz2yJZTIt0Q": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Winny O.", 
    "review_text": "I've been here a couple times with my friends and have always had a great time! The staff was always accommodating especially with bottle service, which I must say is very affordable compared to some other places in SF. I also came here once for a friends private wedding reception, there was a henna person and a caricaturist! Great place for a night out on the town or if you need a space to rent for something private.", 
    "review_date": "2013-01-05"
  }, 
  "4pzr6KuS85859EICMI7MDw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea P.", 
    "review_text": "I don't know what the neighborhood club standard is in North Beach, but I'd rather sip on a $6 Corona elsewhere. It's like the bartender sighed every time he rung us up for a drink, as if he was embarrassed. Very overpriced. At least Ruby Skye can get away with charging this much.  They don't have Heineken -- only Stella, Anchor Steam and Corona. They don't have Belvedere -- only three kinds of Grey Goose.  The space is nice, kind of concrete and modern looking with intense disco lights in the main room in the back. I was a little confused why there were four motorcycles in the entry way in the first room (which was entirely dead). Also, this is the first and only club I've had to have a digital picture taken of me and have my ID scanned at the door. Yes, I am of age!  I actually enjoyed the music in the back room for the Russian party I went to here since it was more house and breaks oriented with some trance thrown in here and there, probably only for the Russian crowd. My alter ego of the night was Olga and my companion was Gorbachev.  Not bad. Just not great.", 
    "review_date": "2009-01-31"
  }, 
  "xbeC5Uir71wzdNad64PSDQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carol C.", 
    "review_text": "Ok, so everyone knows that club bouncers and security guards are ridiculously rude and mean by nature, but this guy from Atmosphere tops the list! I think he's Hispanic but i'm not exactly sure, anyways, he totally ruined my night! He was rude, mean, nasty, ugly, and all of the above! He was yelling at my friends and I like we killed his mother. The reason why he was yelling was because of where we were standing, but it was the other security guard who was standing next to him that told us to stand there in the first place. I don't know if he was deaf or just looking to take his anger out on somebody! The GM happens to step out and we did not hesitate to speak our mind. He said that dude was covering for one of his regular security guard's shift last minute. Yes, the GM apologized and I appreciated it, but sorry, it did not help our dissatisfaction at all.   This is an example of how one little mishap can ruin an entire organization's reputation.  Description of the A-hole: tall, big, Hispanic looking guy, with a greased pony tail", 
    "review_date": "2010-05-25"
  }, 
  "e4c5ah4-mL6EtV-yKxVtpw": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Veronica A.", 
    "review_text": "Never coming back here again. I only came here for bottle service for my birthday and I heard my friends were also going here. I reserved one bottle of Jameson and got a table on the main room. Beware because it is located on Broadway, parking is a bitch! Come way early for parking. Anyways, I've never been here before and when I got the email from the lady stating strict on dress code, I expected it wouldn't be too ghetto. When I got there it was ghetto as fuck! As if there wasn't any dress code.   PROS -bottle service area requires wristbands with the group and is a ropes off area, which was nice as the rest of the club was crowded and grimey!  CONS -The line for bottle service is just as long as the guest list line! -they say there is a strict dress code but don't even follow it -the bouncers are extra douschy and rude here -the waiter for the bottle service table sucked. She just brought over my bottle with some sparklers and dipped. Never came back to pour drinks or check on us. I had to look and ask for her hella times! She was also hella rude.  -I asked for my card and ID back hella times prior to drinking in the beginning and she said, \"Already?\" And I said yes! I hev had bottle service before and they usually give the check ASAP, especially since you're drinking, duh! I ain't stupid. It wasn't until the middle-end of the night til I got my cards back. -bottle of Jameson total was $270ish and it was a regular bottle, not the extra big one from Costco, smh. You can go to Parlor for the exact price for the Costco size Jameson -__- -creepers galore!", 
    "review_date": "2014-04-01"
  }, 
  "HgRHN0jVVsTwuhqqtnQGsQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela Y.", 
    "review_text": "Came here last Saturday with a group of friends. We got bottle service (only after which the bouncers were nice to us when they knew).  There's the big dance floor room and then there's a room where most people can lounge at their tables. Both rooms blast music and I preferred the music closer to the entrance (but that isn't the dance floor...) I wasn't impressed with the music but it may have been the DJ that night. There's a mixed crowd, mostly on the younger side.  Parking is awful. My friend, who frequents Atmosphere more than I do, suggested we park at least 2 blocks away. Yes, it's cold and far, but you're unlikely to find parking close to the club.  Cover is usually 20 dollars. Guest list free before 11 PM. I suggest you get there EARLY if you don't want to pay cover. Bouncers will hold the line so people cannot get in before 11 and you'll have to pay the 20 anyways.   Overall, I wasn't impressed. Music meh. Drinks meh. People meh.", 
    "review_date": "2011-08-15"
  }, 
  "eHD5APzlAuRTUKkJaXNxEQ": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Essa A.", 
    "review_text": "I LOVE THIS PLACE...   The staff is so attentive! We had reserved the VIP section of the cub for my 30th birthday. Needless to say we had bottle service, with about 6 bottles of Remy and 1 bottle of Southern Comfort, their host Karen was unbelievably responsive and super attentive. There wasn't one person there that wasn't having a good time. This is definitely my favorite spot in the city.", 
    "review_date": "2009-05-14"
  }, 
  "l0lmpWZzTP2zy5_eI6ZFMw": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Karla M.", 
    "review_text": "This is a cool club to party, dance and chill with friends over the weekend. But what's even cooler about this venue is the fact that they have a good line up of artist performing on specific nights. For instance, I was here for their Halloween House of Horror party and the highlight of the night was when Pharcyde performed live on the stage! It was great to see them since I used to listen to this Oldschool  hip hop group in the early 90's!  Other than the ambience, decor, floor space, the crowd is friendly and so are the bartenders. Plus the bottle service staff is awesome!  They always accommodate me or my friends for bottle service table if we ask for one!", 
    "review_date": "2012-11-04"
  }, 
  "SZL3ufRBEqHXHTB9of2JIw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Brian W.", 
    "review_text": "Atmosphere was one of the more memorable stops on a recent impromptu Friday party-until-you-can't-pronounce-your-own-name night in SF.  In a 9  1/2 hour span I found myself at Grand Café, Press Club, Palio's, Giordano Bros, Rosewood, Atmosphere, and Sip.  At 2am I was on my knees in the bathroom at my friend's brand new Embarcadero bachelor pad claiming the \"first ever to barf\" prize.  And at 9am he woke to find a shopping cart in his living room and couldn't remember how it got there.  The long line outside Atmosphere is not a lie, it's equally as crowded inside.  The upscale feel is instantly lost or inadvertently ignored as your eyes are first drawn to the raised platforms with the dancing girls, and then to the mass of writhing bodies on the main dance floor.  Looking for the single 20s and 30s crowd?  This is your spot.  There are many pockets of seemingly single ladies here.  My friend quickly picked out an attractive girl in a group of three and started talking to her.  Shortly he came back to report that \"her breath stank\".  lol.  Lesson here is, always pack gum when you go drinking.  The bar is crowded but the bartenders are efficient, you'll get your turn to order within 5 minutes.  The alcohol was flowing as we took turns buying each other rounds of gin &amp; tonic, raging bulls, and Grey Goose shots.  At some point the bartender, while pouring an order of Grey Goose shots for another group, slid me a shot glass and pours me a freebie.  I realized how messed up I was when I looked down at the clear liquid swirling in the shot glass and felt both happy and sad at the same time.  It was like Sweet Free Shot! ...but Ugh...I'm staring down the barrel of drink 12, or was it 13, or 14?  Nevertheless, to show my appreciation I downed it like a champ and melted back into the crowd.  Great vibe, great club, great times.", 
    "review_date": "2009-12-22"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 2.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "Went here with my friends on 10-31-09 on a guest list (since it's halloween, paid $10 to get in).  There are two dance floors(upstairs music was rap, downstairs music is popular, rock,etc).  I thought it was alright for what it is, obviously many entered with costumes.", 
    "review_date": "2009-11-01"
  }, 
  "jXEo83-Cm6SlgiCgFbF7KQ": {
    "user_rating": 2.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Carolyn N.", 
    "review_text": "Okay, this was a 2-3 star experience.  The venue itself has really sweet decor, it has a classy feel to it.  But that vibe didn't match the music, which on the Friday I went was 90s rap!   I happen to LOVE 90s rap so I was feelin myself but I can see that not really being everyone's scene.  It was easy to get drinks, the place never got too crowded, and of course it had good vibes.  Not my favorite club, but it's near this other wild place Sutra that was SUPERcrowded but also legit.    I'd say it's worth checking this place out but I might not count on it to be the destination for a whole night.", 
    "review_date": "2009-10-19"
  }, 
  "09oUMSRuD4nuwwgSO8YKJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle F.", 
    "review_text": "I've been to Atmosphere before, but this time around I reserved a VIP table for my cousin's bachelorette party. I have to give a shout out to KAREN, who runs the place. Thanks for helping us with our reservation &amp; for taking good care of us.  The music was on point, the drinks were good &amp; all the ladies had fun. The only downfall was that there was another VIP booth next to us full of guys (it was a bachelor party) &amp; they kept bugging all of our ladies. Karen &amp; her staff were kind enough to check in with us &amp; to keep the crazy boys away.   We will be back!! Thanks again Karen!", 
    "review_date": "2010-08-29"
  }, 
  "l4P9wTSplP0WyJZvRh21xA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Karen K.", 
    "review_text": "I haven't been to Atmosphere for a while but I used to go there all the time. From the sound of these other reviews, it's gone down hill.   I always had a great time at Atmosphere and never had any problems getting in. I guess it helps to know someone but even when he wasn't around, I could usually slide right in and not be harrassed by the bouncers or ticket girls. IT ALWAYS MAKES SENSE TO CHECK AHEAD FOR GUEST LISTS. Just a rule of thumb people, if you bitch about the cover or that it's too long a line, then you didn't do your homework!   I went to Atmosphere from the very opening, so I've seen them throw a good party but yes, from time to time the crowd will still be lame. Here's a tip: The later you go, the more crowded it will be but also the better the party vibe.   The front of the club is for lounging and for more low key chillin, thus the bartenders are also more low key. The back of the house is where the party's at. The bar is plenty big and they have plenty of bartenders so just keep it together or else pay for bottle service and shut up.   The DJs are mostly your run of the mill Top 40 guys/girls but there's plenty of room to dance and people watch. For some reason, this place attracts a lot of skeezy guys so, girls, watch your backs.   The bathrooms are nice and big and BONUS - they have a bathroom attendant. Don't forget to tip the attendant, they have to smell your shit all night!   Occasionally, there will be a big name roll thru for a short concert/appearance. So it's worth checking out the events.   Overall, I have never had a bad experience here, but maybe I'm blessed... Check it out, I'll be back soon!", 
    "review_date": "2010-08-06"
  }, 
  "bKmLqpm3ukBfOzETXpNSYA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BizzyLizzy K.", 
    "review_text": "It serves its purpose.  I come here to get ratchet.  That is all.", 
    "review_date": "2013-11-10"
  }, 
  "exgDi_lZjekOOtM1ZYedgA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Mark F.", 
    "review_text": "had fun. got drunk. threw up in my friends car. major hangover the next day. missed a wedding. friends posted pictures of me kissing an ulgy girl on facebook. I was the butt of every joke all week. now im ready to go start over again.", 
    "review_date": "2008-12-04"
  }, 
  "RU8gjQ7i2OcGzKCN8hbeLA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Guillaume R.", 
    "review_text": "Average DJ, leaving the booth quite often. Nobody was dancing before midnight. 2 different guestlists, 15 bucks after the so-called rebate. Next time I'll go to the Ruby Skye instead for the same price...", 
    "review_date": "2008-11-16"
  }, 
  "HYT8ETq0IoY4z_7OdgJ8Yg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Krystle J.", 
    "review_text": "Customer service is better then what it used to be when this place was called velvet lounge and 447. I don't go out as often as I used to but I came here last year in November and in April for bachelorette parties. Both times I had a blast. The bouncers weren't rude, the bartendar's were friendly and had a heavy hand with the drinks, which is always a plus and the rest of the staff there was just great. The music wasn't always the best during some parts of the night, but it's better then other places i've been to. Also the crowd wasn't rowdy like other clubs so I can't really complain about Atmosphere.  I'm glad I didn't experience the bad service that other people have mentioned here.  I guess it may just be a hit or miss for some folks. I'll be coming back to this place unless I experience what other patrons have gone through with the staff.", 
    "review_date": "2010-07-12"
  }, 
  "f1-Ds0X2Gb-acICN_oXVgw": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Dennis S.", 
    "review_text": "Good venue to see Warren G on Halloween weekend. Other than a fight everything went smoothly. I bought tickets for the Halloween event online and had to wait almost an hour to get in, when doors had already been open over an hour. The place was pretty empty once we got in. I would come back on a regular night to update the stars.", 
    "review_date": "2011-11-30"
  }, 
  "kSXGl3NkPpc_SAk6yCOJIA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E L.", 
    "review_text": "The first room is so tiny! and since it was a Friday they didn't have the loungey area open. The bigger dance floor opened later in the night which was nice. Funniest part is when all the hoochies get up on that little \"stage\" right where you enter the big dance area and try to show off all their dance moves when really it's not that great. At the same time it was just gross to see haha. Good music except for the DJ in the big room who replayed a song twice within 15 minutes. Come on mannnn spice it up!  -1 the crowd was okay. especially -1 for those guys who followed us the whole night. no thanks  -1 for the squishy first room where the bartenders aren't looking too thrilled to be there", 
    "review_date": "2010-07-22"
  }, 
  "2xL3EEiDZAyn2idSdqzGSA": {
    "user_rating": 4.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "marques b.", 
    "review_text": "cool place", 
    "review_date": "2014-03-20"
  }, 
  "ou_nE1efTxY0LoVW0Au-yQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deanna T.", 
    "review_text": "0 STARS PLEASE!!!   Was having a WONDERFUL Saturday night with all me besties in stow! UNTIL I REACHED THIS ATROCIOUS CLUB CALLED ATMOSPHERE!  Most unprofessional, and rude staff/security I have ever crossed! And trust me I have been around the block when it comes to nightlife venues.  Its a bit of a long story, but pretty much we were being attacked verbally with profanity by the staff/security.  Why? Because we were standing in the cashier box for a mere 1 minute, and that was enough to set them OFF!  Please note:  - We were perfectly sober and was TRYING to get drunk inside - We were the most polite girls you would probably find - My friend was inside who had a table who bought 5+ bottles  I don't feel there was a need to ever CUSS at your patrons, without a good cause.  And even when the GM was notified of this, did nothing, and said they had a reason.  WTF?!? WHY would I wanna spend ANY of my hard earned money on an establishment who treats their paying customers like SHIT!?", 
    "review_date": "2010-04-19"
  }, 
  "AY2bfS9v9dNsHxist6eRbg": {
    "user_rating": 2.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "bella h.", 
    "review_text": "Please i beg you \" turn on your air condition\" because it smells like a boy's locker room in here. I can not you hear me HANDLE IT.", 
    "review_date": "2010-09-20"
  }, 
  "eeO2tkfEtIrRVmD4TnVpFw": {
    "user_rating": 1.0, 
    "user_location": "Monterey Park, CA", 
    "user_name": "Misty F.", 
    "review_text": "What atmosphere?!  Reasons why this place is not worth your time:  1. Horrible parking. 2. $20 cover. 3. Dance floor is covered in spilled drinks. 4. Bathrooms are filthy. 5. Creepers.", 
    "review_date": "2011-08-27"
  }, 
  "LlDS1Mdu-4pEyQTvBIgJyg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kelley N.", 
    "review_text": "Specific gueslist girl - rude to my friends when their names weren't on her list. It's cool if your job is to only let people in who are on the list but don't be rude abt it, especially when there's no line outside! Guys @ door not nice either. Really? If I worked in the nightlife industry I would follow the general concept that MORE LOVE = MORE $$..guess we'll have to agree to disagree. 1 extra star club decor...", 
    "review_date": "2009-02-06"
  }, 
  "Elr7_s3ySqU3hfJCsY705w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candy C.", 
    "review_text": "Definitely one of the nicer venues in San Francisco - and in the Top 2 of the list down Broadway. We had gone in on a Thursday to check it out - dead. But it gave us a good chance to see the place for what it was. Great sound system upstairs that isn't overbearing with another spin table downstairs. One of the owners was nice to come chat with us on the slow night and offered us VIP passes to come back on a busier night. We took him up on the offer, and it was busier, but still slow. Great music though. Great bar and stage upstairs and a roomy dance floor. Nice mixed crowd. Has a lot of great potential. No website up yet so its pretty hard to get on a guestlist. Part of the drawback is probably cover. Will come check it out again in a couple of months once they're a little more established.", 
    "review_date": "2008-10-26"
  }, 
  "5re8RQ-2-Mkz7LC4ftYfHw": {
    "user_rating": 1.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Vivian H.", 
    "review_text": "omfg never coming here again unless its a super super close friend's bday and they were NOT going to change their mind to go anywhere else.   When we found the place, i thought it looked pretty cool. There was a black velvet curtain shielding the actual club from the outside and where to pay cover so i had nO IDEA what was in store. the four of us came late so after we got our IDs checked, we walked up to the lady who was at the window to check VIP/cover. She was SO FUCKING RUDE.. She said cover for ladies is $10 and $20 for guys. Then my friend said POLITELY, \"oh we're on VIP guestlist.\" Then she then looked at us up/down, scoffed and said, \"Uh. You' guys are not on VIP,\" in a super fucking high maintenance bitch ass voice pretending she was princess of the fucking booth looking down at her peasants or some shit. Then my friend said to look up his coworkers name on the bottle service list. Then she talked on her walkie talkie shit and then yeah GUESS WHAT? NO COVER. the look on her face when she had to stamp  our wrists was TOO GOOD.  anyways, i flicked open the curtains. ..... OMG THANK GOD WE DIDNT PAY COVER. i would have been so mad if i had to. There was probably no more than 25 people in this entire club and thats me being generous. THe bottle service section that was roped off had three tables and SOOO TINY! oh my goodness. My friends coworker had 2 champagne bottles and unnamed tequila in a bottle that looked like a bigger version of the Martinellis apple juice. The people that were there were ookay,,, some nice people watching actually LOL. the crowd is mostly white and black. mmm not that many cute guys?  Dance floor was pretty small, there is an upstairs/2nd floor that they set up but they didnt even open up. Bathroom stalls broken but there is a nice lady that gives you paper towels when youre done washing  your hands. She even helped out this one girl who was having trouble washing her soapy hands.  I feel like such a hater of this place right now looooool. parking sucked. AND MY FRIEND GOT HER LEATHER JACKET sTOLEN. but on the bright side...  ......wait there is no bright side.", 
    "review_date": "2014-06-01"
  }, 
  "t5n5XdIHU5zaPu6VKmD4Sg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney H.", 
    "review_text": "Attempted this club last night. Not my typical scene anymore but I wanted to check out the venue and the promos said they would be playing top 40 and hip hop, so I thought it might be cool. Located in north beach right by all the strip clubs so unfortunately while waiting in line you run into all the rift raft. Tons of cops in the area so for the females it does make you feel fairly safe. While waiting in line I did appreciate the employees checking in line for anyone on the guest list. We got stamped and didn't have to worry about running late. Downside of the line, it was cut into 3 different lines. Which could have been ran better. All lines were ran by 5 giant bouncers who decided to serve the line with the girls wearing the least amount of clothes. After waiting patiently we get searched and we go in. The place is packed, non danceable :( its a large venue and decorated elegantly. We make our way to the busy bar up stairs and attempt to order a drink but had no success. 4 bartenders, 3 all trying to figure out the register and 1 trying to serve. After getting skipped over one to many times we decide to head out. The music in this room was top 40 ten years ago so we thought there might be hip hop in the other room, I suppose Erykah Badu is hip hop enough for that crowd. Disappointed we all headed to a bar.", 
    "review_date": "2012-02-26"
  }, 
  "dWe_c1dQFmgyFjejMe7RDw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wilson L.", 
    "review_text": "Used to be called Latitude, music wasnt that good, club was nice they remodeled it but nothing to spectacular..... They had a large room in the back that was nice and a small room in the front which was useless since the bar and entrance destroy the room's mood..... you cant really dance and smaller room next door is more like a lounge.... Other then the big room, cool crowd it was worth the $10 admission!", 
    "review_date": "2009-05-19"
  }, 
  "WeK_cyQULgbOPJtavcgtPw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Shelly U.", 
    "review_text": "We went here for a friend's birthday and got bottle service since they were having a special. Ironically, horrible atmosphere. It was a total taco fest...which is usually not a problem, but 75% of the girls were wearing jeans. Given, it was the weekend Jay-Z and Justin Timberlake were in town, but the place was EMPTY. Our party of 15 was probably half the club. The area for bottle service was in a corner and kinda ghetto. The hostess was super nice but it didn't overlook the fact that the club was NOT hoppin. DJ sucked and everyone had to be SUPER drunk to be dancing...  Some redeeming factors:  The staff was super helpful and weren't jerks when the birthday girl barfed. Bartenders were attentive and not discriminating like at Infusion. You get a free drink if you check-in on Yelp", 
    "review_date": "2013-07-30"
  }, 
  "8I9dnPQWpS8Y1srWJ4uMfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca S.", 
    "review_text": "Not sure why only two stars, ended up here on a Friday night, I was totally under dressed. Next time I will pop on my spanx and spandex gurl!  100% Gutta", 
    "review_date": "2014-12-03"
  }, 
  "Me2oay0zfZ1gyrrWXDn2-A": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Sissy T.", 
    "review_text": "Saturday night a few girlfriends and I went to Atmosphere.  We walked past two strip-clubs and a few other night clubs that all had a line and were amazed that we were able to walk right into Atmosphere.  Hum, not a good sign. But, figured we would give it a shot considering we got into the club for free. Right after we walked into the club, there was no-body there!  There were a few girls around the bar for a bachelorette party and a few horny guys that were on the prow-ell after leaving the strip clubs trying to get lucky! We stayed until almost midnight - way too long!  We were tired of staying around so we decided to leave so we could dance..  place was a bust..", 
    "review_date": "2010-08-02"
  }, 
  "3Qo52gcZo8_G7qx91BdV_w": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Chingy K.", 
    "review_text": "Spacious--a lot of place for roaming around and dancing too Nice Staff- staff/crew/bartenders are very nice and helpful Price- affordable not pricey at all  -- they have 2 dance floors wd 2 differnt music which is so cool.. u can choose wc music u like better.  -- need to pay 20 to get in,,i dint have cash wd me BUT GOOD TNG they hay ATM insde d club so u dnt have to go anywer else --a lot of chairs to sit at. if ur tired dancing thhey hav big sofas for u to rest on --ambience is good, Cool dANCE FLoor and design modern looking, simply but classy --crowd is ok too =) -- there was a close pay parking in the bar, u just pay 10 for it. Sounds good rather than walking so far.", 
    "review_date": "2009-11-24"
  }, 
  "D-anvESbGXSH60T4AalPEg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystie M.", 
    "review_text": "This club was not as poppin as I expected. I went on a Friday night and expected it to be really fun, but it was extremely empty and the crowd was a little old/strange.  The bathrooms were really far from the entrance and right next to an empty dance floor. The design of the club is really strange in that it's awkwardly shaped. The DJs play at weird stations in the club. The music was whatever and we tried to request songs but the DJ ignored our requests. Rude.  Also, the drinks were mediocre and not strong. The only bright side was that the bartenders were speedy, but that could've been because it was such an empty night.  After having better experiences at other clubs in SF, Atmosphere ranks on the bottom of my list.", 
    "review_date": "2011-03-03"
  }, 
  "9yPITTB_nUpXkau8IqfPqQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raquel T.", 
    "review_text": "The venue itself is big enough for me to dance and has two rooms. I've only been here once and didn't like it at all probably because it was asian night by visionshock. I might give it another shot if there wasn't an event by asian promoters because I like diversity whenever I go to clubs.", 
    "review_date": "2009-11-20"
  }, 
  "eoVTW6VyUQ68Wq2EF4j2-A": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Geneve V.", 
    "review_text": "Very fun place to go to around Broadway, which is right near Apartment 24, Sutra, Horizen etc.  What I like about this place is that there is parking around the corner that charge a flat rate of 20 bucks.  The night we went our friends and I did bottle service. We arrived around 10ish and the place was EMPTY! Seriously the first ones there! After meeting with the hosts they informed us the upstairs wasnt open yet to guest only VIP AND that the BOTTLES wouldnt be ready till after 11!!!! They encourged us to buy the drink special for that night.   Downstairs is nice. Open, nothing to fancy. I didnt get to check the other room which had a pool table. Upstairs was the place to be. Dj played top hits etc. The VIP area was nice and BIG!! 3 plush couches tons of chasers and a HOT hostess! A bad/good thing about the VIP area was you can only enter in with a wristband. The bouncer who was in charge of it didnt really care who came in or out!  Overall place is nice. Open dance area, great bartenders who worked fast.  If you plan on doing bottle service arrive after 11!!! Save you the hassle on waiting :)", 
    "review_date": "2010-01-20"
  }, 
  "_pIG1_s6Bzymn1zeyLjBHQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace K.", 
    "review_text": "We have a monthly \"Drinks for a Cause\" event at different venues throughout San Francisco.  A couple months ago, the venue was Atmosphere, a place I had never visited.  Being located in North Beach, I knew I'd have parking problems, but for a whopping $25, I was able to park across the street in the lot.  (If you saw my heels that night, you'd see how spending $25 was a simple decision.)  Hundreds of my friends were present on this night, which automatically makes for a fun evening.  Factor in an early evening from hell, I came ready to drink.  Well, the great music, the stiff drinks, the cool venue, and great friends made for an awesome night.  Bartenders were friendly, and the wait was never that long, even with a packed house.  The bouncers were friendly, and even the rain didn't dampen our spirits.  While I have not been here on a regular weekend evening and don't know what the normal clientele would be - I can only say that one this evening, Atmosphere was the ideal location for this event.  Did I have fun? You bet.  Can I recall how much fun? Not really....but I'm pretty sure it was a lot of fun.  Let's just put it this way. It was one of those rare nights where even I agreed - yep, I should be driven home, thereby being the recipient of a \"drive Grace home\" caravan.  Good times!", 
    "review_date": "2010-03-04"
  }, 
  "3f0Nk5y6C5f5_7VlsBjxdA": {
    "user_rating": 2.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Norm G.", 
    "review_text": "Not my first time here but the first time under the new name Atmosphere   Visited here a couple years back when it was velvet lounge and club 447. I visited Atmosphere on 07/04/10 for the fourth of July  and it was a nice size crowd for a Sunday night. First off It seem like there was no dress code but a dress code that called for baggy jeans, tennis shoes and fitted new era's. The club has two levels the lower section consist of a bar and  a pool table. The upper level consist of the dance floor which really wasn't spacious and cramped a nice size bar and like on V.I.P section. I love hip hop but It was whatever was played on KMEL ......  and didn't really change up from bay rap to a little of whats popular or older  songs from various artist.    So alright club but no dress code, cramped dance floor and crowd left something to be desired.", 
    "review_date": "2010-07-05"
  }, 
  "OAJoabfTubJL_11ho5TQeQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy B.", 
    "review_text": "So I've only been here a couple times, and it's only ever been just OK for me. I've never paid to get in, which is a big plus, and never waited in line really either. You can add yourself to the guest list online, and avoid all the BS.   The drinks are standard, not TOO strong, not weak. Average pricing for a club, which is steep already, in my opinion. The music is decent. The crowd is ehhhh. I've heard it's better on Saturday than Friday every time I've went (which always happens to be a Friday) and I've never actually stayed longer than an hour and a half or so.   It's a good place to be if you have a pretty big group because there is plenty of space. At least on Fridays.", 
    "review_date": "2011-06-15"
  }, 
  "9IcqLijhyYfYxhkFCpBykg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jenny A.", 
    "review_text": "We came here with about 25 people on a Saturday night. We didn't have to worry about parking because we took a party bus here from San Jose. So granted, we all had a great time because we didn't have to worry about driving home.  There is a lot of space here, which is good. It gets super hot but the upper level definitely has more ventilation and space. I loved standing under the AC and dancing because it was so powerful and cooling.   $26 for 2 vodka tonics and an AMF. AMFs were small and not very good. The music was okay. A lot of R&amp;B if you are into that music. I wish they played a little of top 40/house.   The crowd was primarily hispanics. I wouldn't say it was completely ghetto, but it kinda was lol. It was also fleet week and there were marines/sailors in uniform all over the place on Broadway - that was a pretty fun experience to see them all over the place.   I would come back here, but I wouldn't wait in the long line for it. The party bus allowed us to not wait in line and not have to pay for cover so that made up for everything.", 
    "review_date": "2011-10-09"
  }, 
  "5U7TL7snFYmyHuO59OYEpw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam W.", 
    "review_text": "Our night at Atmosphere started with scoring free tickets for entry.  Things from there pretty much kept along this winning streak the entire night.  Drinks are within the usual SF club price ranges (~$8 average), but on the awesomely stiff side.  Patrons are your usual 20 to young-30's crowd, leaning towards Asian and Hispanic, with a sprinkling of everything else.  It can feel like a high school dance at times, with groups each doing their respective interpretive dance of circle jerking.  On the plus side, if you're pressed for entertainment, watch for drunk chicks spontaneously deciding to get up on the tiny \"stage\" and do whatever it takes to get some attention.  I'm wondering how Atmosphere has yet to bear witness to a big-boned attention whore snapping a heel and careening off stage onto some unfortunate SOB.  (Oh well, at least the victim's end would be relatively quick.)  The club venue itself pretty much opens up with a smaller dance floor and bar to the right, leading to a short flight of stairs to a larger dance floor.  The smaller dance floor gets really crowded, and the bar doesn't help; because there's no designated dance area, drunk dancers are prone to bumping into you and spilling drinks over everyone and their mother.    The larger dance floor has a bar to right, and restrooms in the back.  Honestly, Atmosphere could do without the restroom attendant...I feel weird that patrons are tipping a guy to stand there all night and suffer through the continuous sights, smells, and sounds of piss, vomit, and shit.", 
    "review_date": "2011-04-03"
  }, 
  "4eR6hYFJcBHoAqhuOS07ww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana Y.", 
    "review_text": "This place gets 4 stars for their HUGE dance floor. Easily, the biggest dance floor I've seen out of all the SF clubs I've gone to.   Venue itself is nice and sectioned off. The mirror is great; especially when you watch people run into them (just like multiple reviews said).   Music is great, the crowd was better looking than I realized. Maybe it was just the group I went with or the promotion company did a good job but this place is nice.  The only downside is how ridiculously HOT and STUFFY this place is. Had it not been for the huge dance floor, this easily would have gone down to a 3 just because it's got the worst ventilation system out of all the clubs I've gone to.   Other than that, good job Atomosphere.", 
    "review_date": "2009-12-08"
  }, 
  "JO9CPEwBjV3UJuIOgs8Zzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia K.", 
    "review_text": "My friends and I were lucky to find this place. We were originally gonna party it up at Bubble Lounge, but since it was a Thursday night, the crowd was old, like they just go off work, and the dance floor downstairs in the cave was closed so we left right away. One of my friends suggested we try Dragon Bar on Broadway, so we walked over just to find that it was closed! However, there was a line out the door for this place called Atmosphere that was right next door. We looked at it, contemplating whether or not to go, when these two asian promoters came up to us asking if we wanted in. We asked for the cover price and it was $20! EFF THAT. I used some smooth talking with promoter, saying we had nine girls, of course you can let us in for free and give our guys a break since we had so many girls. He offered us girls free admission and guys $10 each. Not too bad since we also got to skip the ridiculous line.  When we got inside, they just opened up the second floor dance floor and the music was poppin'!  Too bad I don't remember much of the night.....just more a reason to come back again to check it out :)  Final comments: Large dance floor with a great crowd and great music. Just try to get on the guestlist beforehand to hopefully escape the cover or go with a lot of girls.", 
    "review_date": "2010-12-31"
  }, 
  "RlquHGZ0v1uL2mqsD_vhVw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Erik O.", 
    "review_text": "I went here this past Sat and had a blast. It was empty when we first arrived but it filled up quickly.   Parking: All bad. You can park in a lot for $20  Line: Getting in was easy. No line at 10:30  Dress code: Club attire. Most ladies had on the freak em dress with the heels, on the other hand I saw guys with tennis shoes on.  Cover: Get on the gl and arrive before 11:00  Bar: Great Service  Music: The music was good. Top 40/Hip hop  Crowd. Young and diverse  If your looking for a place to go out and have a good time, I would say Atmosphere is the place.", 
    "review_date": "2011-05-26"
  }, 
  "v10dHdqf42tUkxbYVnFW6w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris T.", 
    "review_text": "This place is alright.  They played alright music when we went on a Tuesday night.  Alcohol seemed a little pricey for a Tuesday night at a bar, but then again they still had a DJ spinning and was in Broadway of SF, for $6 beers, $8-$10 shots, and $8-$10 mixed drinks is standard.  But I can imagine this place being highly overpacked and getting really hot, stuffy, and sweaty on Friday and Saturday nights since it's pretty small.  Had no more than 10 people on the dance floor when we were here.  No real dress code since they let us wear hats, shorts, sneakers, jerseys, etc. when we came in.", 
    "review_date": "2009-04-22"
  }, 
  "bH0ec25L7Yaladd2JyLRwg": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Missie R.", 
    "review_text": "I laughed watching how many people walked into the wall sized mirror on the first floor. Haha. The bathroom door is weird, kinda see through. Really wasn't feeling that as I pissed. People may not be able to see the color of my panties exactly, but they sure could see my body outline of my taking off my pants. Pervs!!   The down stairs is kinda cool, kinda weird. It's got a pool table, but I don't really know if people used it. And the DJ down here sucked. About an hour later they opened the upstairs, which was much better. The DJ spun well, and we were able to sit behind him. It was funny to see him kick people off the stage for dancing too hard or annoying him. I'm thankful he let us sit there though, I was suffering from a hangover from the night before so I wasn't drinking (I was the designated driver) and didn't feel like dancing much. Thanks DJ!! Oh plus, his GF was up there and she was really sweet talking to us. ;D", 
    "review_date": "2009-08-29"
  }, 
  "whMe0A03TtCq-ChP1XR1hQ": {
    "user_rating": 1.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "alex a.", 
    "review_text": "Can I choose NO stars? Guess not... I have to choose atleast one...BOOOO! Wow this place is the most ghetto club EVER! Just about 3-4 fights thats night, Looks like a empty warehouse, still had to wait in line when we came on a party bus, dudes with sunglasses on even though it is super dark, trashy girls, and guys that think they can just touch you as they walk by, not my scene that's all Ive got to say!", 
    "review_date": "2011-02-27"
  }, 
  "MxnNT3MSGco7hQN6-pCNow": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Anya R.", 
    "review_text": "I thought this club was pretty legit.  Broadway has so many places to choose from and to me they range from corny to hood.  Atmosphere happened to lean towards hood.   The music was great- there are two floor with different good music.  Saw tons of skanks shaking their behinds on guys like they were getting paid.  Hopefully those guys got lucky or else they'd be getting major major blue.... Huge second floor and plenty of space to dance- practically breakdance if you wanted to.  Ha.   Virtually no wait at the bar.  Only place to park around here are the lots for 20 bucks.   We showed up at the club close to 11pm and the line just went by- none of that holding you out in the dang cold when the club is actually empty.  Of course it was a dub to get in though- nothing out of the ordinary.   I know you can't smoke indoors Cali yet I smelled like smoke after? Interesting.   I'm down to come back here fo sho.  Its definitely way better than Sutra which is nice door. Ugh. Thinking about that place makes me want to throw up.", 
    "review_date": "2011-01-09"
  }, 
  "XxDPzTC-w1UucRUSoxW-bg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "April D.", 
    "review_text": "I like this club. Although I went on a slower night, which happened to be a Saturday, I was really feeling the music on both floors. The first floor started out as techno/house music and for a portion of the night turned into reggae. Sounds strange, but they made it work. The second floor was hiphop mainstream and some oldschool 90s R&amp;B! I felt like it was all me. My friend wasn't feeling it tho, because our musical tastes are different. But whatever, I loved the music! I also really liked the decor. And in a way, it was good that the night was not so busy, because at least me and my friend were able to sit down in the lounge areas, which I assume are usually reserved for VIP. I think the drinks are a good price, not too expensive. One of the bartenders was cool, or should I say semi-bartender, because I did not really see him serve drinks, but more clear drinks off the table. He would start dancing on the dance floor, which is great, because I think bartenders or semi-bartenders should be able to mingle with the crowds on the dance floors for at least a lil bit. And hats off to Linda who was working in the girl's bathroom, because she is super sweet. I hope to come here again on a busier night to see what's up, because I really like this place.", 
    "review_date": "2008-10-26"
  }, 
  "dlqYxvxdAkJTqLqiMjb4Ug": {
    "user_rating": 3.0, 
    "user_location": "Culver City, CA", 
    "user_name": "Di L.", 
    "review_text": "So a group of us went here this past weekend for a celebration.  I'm not too familiar with the SF night scene since I was just visiting from SoCal, so I didnt really know what to expect from Atmosphere.  So here's the scoop.  Place is a relatively decent size.  We had a private table which is basically just a room off to the side with three spearte booths for each party.  There's a bar at the center right when you walk in and in the back is another bar with a pretty big dance floor.  Standing outside at first, I thought the place was pretty ghetto but I was with my group of friends so I guess that didnt really matter.  You get out what you make of it so.  Dance floor was pretty cool, they had good hip hop music.  Drinks, we table service so didnt really drink anything except Belvedere and OJ.  Our hostess wasnt all that great though.  All in all, it was ok.", 
    "review_date": "2012-04-03"
  }, 
  "k_6JJl12UTicAEt6Ji8yTw": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "Rhea F.", 
    "review_text": "the space is nice.. the smoking area sucks it is right next to a parking spot which is also nice but costly. i guess it really depends on the night you go...", 
    "review_date": "2009-03-23"
  }, 
  "jPhjJnQ2_3_-tu__KTQZlA": {
    "user_rating": 2.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "Kimberly B.", 
    "review_text": "Bottle service was cheap!!!   We arrived at 11:30.  Half of our group had already came and got bottle service : two goose and two cognac for $ 750.00.  We finished that in no time!!   We walked around and scope out the second dance floor.  It's quite big.    Truthfully, I hated the place.  Its ghetto un-faboulous!!!  You're walking on spilled liquors everywhere.  Not my seen!!  I tried to drink but I was scared to get drunk there.  I didn't enjoy the music..    Lights on, Lets get out of here SafeLY!!", 
    "review_date": "2012-10-06"
  }, 
  "YAG90mceVFQLdvl4wndvQg": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Margaret R.", 
    "review_text": "I came here for the NYE event. It was alright. The place wasn't too crowded so it was pretty easy to get to the open bar.   The crowd was diverse.   The music was okay. The first floor had late 90s music, while the second floor play music that was popular last year. I didn't hear to much of the top 40s on the radio now.  The theme was creation, but the decorations sucked and were serously lacking. They had two people dressed up as Adam and Eve, but they looked bored as hell. I don't even know why they bothered dancing on the stage. Also, they barely had any balloons to drop for the countdown.  The bathroom is too small. I had to wait more than 15 minutes to get a stall, which is always a mood kill.", 
    "review_date": "2011-01-02"
  }, 
  "0Cvgx6MKrSOTUxGoUpdaTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison T.", 
    "review_text": "A nice addition to Broadway.  I had a great time here last night for the soft opening.  This place had a nice feel to it...mabe cuz its still new. And they had the best staff ever....everyone was so nice.   2 bars and 3 rooms...one of them even had a fish tank in there....how often do you get that.  There was also a pool table inside.  There was a room that was very loungy.  I stayed upstairs the whole time....large dance area.  What I did love the most was the bar with the best bartenders ever.  Go there and check it out yourself...you'll know what I mean.  I'll be back for the grandopening.", 
    "review_date": "2008-09-28"
  }, 
  "xb_2s7A1QdV5-Gp4iK8lIA": {
    "user_rating": 1.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "April G.", 
    "review_text": "OH MY WORD... probably the worst club ive ever gone to. I dont know if it was the night or whatever.. but the DJ was awful, the club was so dirty and it was so GHETTO!!!. I will NEVER ever go to this place or recommend this place to anyone. I am so disappointed..the only reason I went in the first place is because my friend went 2 years ago and said it was poppin... apparently a lot has changed since then. LOL AVOID this place.", 
    "review_date": "2012-12-09"
  }, 
  "Hsi6oUKSG7H2xi47x0IHbA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JessePanda C.", 
    "review_text": "Zebra Lounge... Club Latitude... and now... Atmosphere.... everything inside is still the same for the past 5 years i been promoting and coming here... they move thing around and change some of the interior but that was it... finally open that small little room on the other side, wow... always the same mixed crowd cause its broadway... ill come here if i have to, but if not forget it...", 
    "review_date": "2010-02-10"
  }, 
  "Mu_QSYuK4z0CbGuidWa_rA": {
    "user_rating": 4.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Lizzie T.", 
    "review_text": "I came here on a Sunday night because it was my friend's birthday and she got bottle service. I know, on a Sunday. But it was cool. The dj was playing oldie' and the venue was really nice.   The star ratings are mainly for the awesome security at this place. Some loser thought he'd be cute and dance up on me, pushing me into my friend at the process, so I shoved him away. A few minutes later, the same boor came up to get some more. When I turned back around to put him in check, a security guy asked me \"you know him???\" I shook my head and they escorted him out! Loved it. I'm so glad they were on it at this place. Props.", 
    "review_date": "2011-09-15"
  }, 
  "wsIh1q5zS7g-FIh8KuMDCg": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Chris C.", 
    "review_text": "I went here as part of a Party Bus that I arranged for my fiancee and my friends on 3/21/09.  The layout was nice with the the first level more of a lounge with a smaller dance floor and the second floor with a larger dance floor, vip areas and its own bar. I honestly don't remember exploring the first floor at all because I was really faded.  My group made our way upstairs (this was around 10pm when we got in) to hit up the bar that wasn't being used. The security dude kicked us out saying that the upstairs would be open in 10 minutes. Minus half a star since we were buying drinks, but I guess I could understand that they want the first floor to fill up.  I was already faded by the time I got in so I didn't need a drink anways, so I can't rate them on their drinks. What I could say is that the crowd was good, pretty chill, my friends were dancing with random girls, I think I was dancing with a random girl while waiting around the bar, and everyone was dressed decently.  None of the people in my group got kicked out, so that's a plus and I didn't feel like a sardine, big plus! I wouldn't mind going back again.", 
    "review_date": "2009-03-24"
  }, 
  "ROOSX6Gsi9t5pUAbfZtGTg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T M.", 
    "review_text": "Rachett. Showed up here with 1 hour left only to see a fight happening. there was a singing Jerimiah event july 20, 2013. they need new securities. they did nothing but push the people fighting towards the crowd and not towards the exit. Securities were short and seemed like they couldn't control a damn person that was fighting. took like 20 minutes. Jerimiah kept singing and the music kept going. I'd expect at least for the lights to come on or the music to stop when the fighting was going on. so unprofessional and dangerous. Rachett.", 
    "review_date": "2013-07-21"
  }, 
  "u9zqrRSnf6BByCIQ0MIyiA": {
    "user_rating": 3.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Jorgess M.", 
    "review_text": "First time going out in S.F. and ended up here for a friend's birthday. It looked cool at first, you know waiting in line and it looks like there's a whole lot of people because it was near 11 (we were on guest list). As we went inside though, hella empty! We assumed it was still early but the place was still pretty empty for the remainder of the night.   It was a nice place -- two stories, hella spacious and drinks weren't too bad. The bummer is that it would have been better if the whole place was filled up with people. The whole bottom floor was empty besides when people wanted to order drinks, because the bar's located on the first floor.   I guess the place to be was upstairs because by the end of the night it seemed pretty packed. So much ghetto-ness (not that it's a bad thing) going on on the dance floor though. Then there were gogo dancers and when they were done, random girls started dancing up there. As for music, there were a handful of songs that you just couldn't dance too, like rock music for example, so that was lame.   FYI: Hella creepers!! They are on the prowl! Once your man or friend, or partner leaves you alone for a second, they are right next to you like glue SO BEWARE!", 
    "review_date": "2012-04-13"
  }, 
  "r-8eQ28RhnQPJdZXHcTXrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika C.", 
    "review_text": "I've been here since it was Zebra Lounge.  It's one of the better spots in North Beach; you get a good amount of dance floor space, music was top 40, and crowd was fun.  I would never think of throwing my birthday here (nor my friends, I'd imagine) but I wouldn't mind coming here.", 
    "review_date": "2011-09-27"
  }, 
  "j9kOPJMoQsrHoYuQvD2ydA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "May C.", 
    "review_text": "It was Thursday. I overslept, and missed the cutoff for the guestlist (11pm). Already didn't want to go to begin with, definitely don't want to go now ($20 cover). I get in the shower to wake up, but was merely watering my sack of flesh of a body. Still feel like crap. Eff it I'm not going. \"Where are you!?!?\" \"in the shower.\" \"Whaaat?\" But my friends are persuasive people...2 separate offers to pay my cover and buy me a drink, wait for me and share a taxi...the only thing that could've beat that offer is if they just came over and finished bathing and dressing me too. Fine ok, cold shower it is.  We roll up, hop out of the cab and into the line of 10 people. The harbinger of the night was lying in a puddle of his own puke in the alley. His buddy next to him on the phone doing a bad job of babysitting. We get in, it looks like what I remember, dark. It wasn't too crowded but decent. I go find the rest of my friends and they all have that glazed twinkle in their eye and start oversmiling and slurring at me. Apparently not only did we miss the free cover, but an open bar too. Say whaat? It probably was a good thing because from what I hear it was a barf fest about an hour later outside: one of said friends got kicked out and started puking on the sidewalk. Then soon after, a group of girls joined him and started puking together in unison. Think: Bellagio fountains.  As I hit the dance floor, I get shoved and spill some of my drink because the security guards are all rushing somewhere. I run toward the action and see some girls getting escorted out. Apparently a fight in the bathroom. Eh, back to dancing. Talking to my friend, and some drunk-ass knocks my jack &amp; coke so that it splashes all over my friend's white shirt. Oh my god, it's not my fault!! It's cool, he's too drunk to be angry. Alcoholism isn't always bad.  I had a surprisingly good time. I know it was a fluke because of the open bar but I like when crazy ish happens. Shit-faced people make me laugh. There were also a lot of bored-looking Hasians in really short skirts dancing with each other but constantly looking around the room for the guy with the most expensive rice rocket to approach. And also a lot of dudes standing on the sidelines not dancing and  creepily watching the wannabe strippers that are dancing on that mini-stage near the wall. There were a handful of wrist grabbers who can't take a hint, and the obligatory group of amateur breakdancers who never dance with chicks. My favorite is watching the mounters attach themselves to my unsuspecting girlfriends and watch them get bucked off. Poor guys. Also, I am often victim to the ghost dancer who apparently had been dancing with me for the past 10 minutes but I had no idea because he managed to dance right up on me without ever touching me. So basically this place is a typical club but thank you for the open bar and good time.   P.S. Don't be a cheap-ass just because it's an open bar. Tip well. The bartender told my friends that they were the only people who treated him well so he hooked them up.", 
    "review_date": "2010-12-28"
  }, 
  "RKBS7RXOy_qUOfaqpfaJgQ": {
    "user_rating": 2.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Sohil N.", 
    "review_text": "I went to this place for New Years Eve and my bad experience with this club started right off the bat. I was part of a large party that had a 20 person bottle service table for the evening. My experience in line was pretty terrible as the bouncers were extremely rude. One of my friends was not part of our table, but bought a normal open bar ticket. I explained to one of the bouncers at the front the situation and asked if she could come in with us and skip the line because she was with us. We were told to go to another person to get her wristband and then come to the front. While doing this, another bouncer came over to me and yelled at me to get in line or get lost and threatened to take my wristband away if he saw me again. This was completely uncalled for, especially since I was doing exactly what I was told by another bouncer.  Now if your party spends A LOT of money to get a bottle service table, you would expect to be able to use your table for normal table things at a nightclub. This club would not let anyone else to our table that was not part of our party. So if you met someone else at the club and wanted to invite them back to your table for a drink, you couldn't. That is absolutely absurd.  Also, the floor around our table was SO slippery that 3 people slipped and fell really badly.  The only reason I give this place 2 stars is because the waitresses for our table were extremely nice and friendly. They took great care of us and I just wish the rest of their staff showed us the same hospitality.  Overall, I would not recommend anyone getting bottle service at this club let alone pay a pricy cover to get in here. There are much better clubs in the area than this.", 
    "review_date": "2013-01-06"
  }, 
  "KmqivnDXe3mVjBtp9ZxkOQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley H.", 
    "review_text": "i forgot what it used to be called....but what ever it is now...its just not the same. I am not sure what was going on but i really disliked the fact that all the dumb hoes in the vip area thought they had to run into you every chance they got!!! i mean really come on im standing right here!!! walk around or let me know your comming by. dont just push me out the way. after the 5th chick i was ready to throw bows at the next person to walk into me. well it gets better...i wasnt feeling so good to begin with so i sat down by the stage. these two chicks kept getting closer and closer until they were standing over me... well at that point i had to say something...but the night gets better..... some random ass dude rubbed my head!!!!! wtf!!!!! i really dont want to go back there again... i probly wont unless i have to.", 
    "review_date": "2009-02-22"
  }, 
  "GYpdQjS_DjTk3Bj3GIr5JQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S B.", 
    "review_text": "Let's see here.. Long lines that lead to an empty inside. Trash people all around while you're in line. Lots of water and no fish in the tank.. Good times indeed, but not next time for me. Thank you very much.", 
    "review_date": "2008-12-02"
  }, 
  "tCLb9_FTe-shF8ZcNmbZxg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua H.", 
    "review_text": "IT'S A TRAP!!  Do you like being hoodwinked into opening up your wallet and then made to feel like a dumb tourist afterwards?  THEN THIS IS THE PLACE.  I went here with the intention of just meeting some friends, however we all ended up being drafted into playing their stupid Beer Pong Olympics against Australians from the hostel across the street.  OK. Fine. I'll play along. No big deal, they said it would cost only $5 to enter.  Plus, I like Australians.  Kangaroos are cool as F#CK.  Great.  Wait...what? I also have to spend another $10 on PBR, MANDATORY?   Wait, $10 on PBR gets you through just half the game....SO actually $20 on PBR?  What if I don't want PBR?   No other choice.  Great.   Hold on...that isn't what you said......Oh ok, you are going to take a bunch of embarrassing pictures of this and put them online, without my permission? Never mind, I apologize, by all means, what was I thinking? This sounds like a BLAST!  O.o  F#C% YOU ATMOSPHERE.", 
    "review_date": "2014-01-11"
  }, 
  "RR-hNSxTUs4CSkGQZLEWyw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jamie L.", 
    "review_text": "Again another place I haven't been to in over five years. I remember coming here back 2005/2006 with my bf and friends. The music here is the normal Top 40 and the drinks are pricey but fill the alcohol meter for people who want to get \"crunk\". However, when I walked in with just me and my friend, I was immediately annoyed. Okay, okay - that is what happens when I haven't gone out \"clubbing\". But this place is where all the boys come, a complete sausage fest. Seriously, walked up to the upstairs room and it was scene of a middle school dance, all the boys lined up to the wall. Oh the good ole days of boys, yes BOYS, coming up to you and grinding your booty like they got a claim. Um, yeah I wasn't even skanky enough for that action and it still happened. It was okay for me, but what was I to expect? I just wanted a place where I could dance.", 
    "review_date": "2012-10-29"
  }, 
  "vpYqTimouShq3Un90DUsIQ": {
    "user_rating": 1.0, 
    "user_location": "Woodland Hills, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "I was in town for a case competition with other master's and PhD students, and Atmosphere was somehow chosen as he location for the afterparty. The place itself is nice, good location, but the people were SO TRASHY AND GHETTO!!!! After they opened it up to the public at midnight or so at LEAST six people from our event (myself included) had their phones stolen. And these are just the ones I have heard of. DO NOT GO HERE you will get robbed of your phone, money, credit card or something. They obviously have a problem with thieves praying on people who are just trying to have a good time and they are not addressing it. I tried to call multiple times and never got a person on the line and never got a call back from my messages. I've filed a police report naming the venue as well. It's embarrassing for a club in San Francisco, I expected better and I am from LA. This is all aside from the way-too-aggressive ghetto guys groping me the entire time, it was disgusting, I needed to shower afterward. I had to drink just to feel semi-comfortable, and I never felt safe, for good reason obviously. They need to raise their standards for who they let in or they're going to be relegated to entertaining cultural garbage and not attract normal people. You're better off going anywhere else, there are plenty of nice options in SF,", 
    "review_date": "2014-03-10"
  }, 
  "aw973Pm1nrTbRjP4zY9B9g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenny L.", 
    "review_text": "ATMOS ... first time here and you didnt seem to disappoint... for long!   The service was awesome. Coming through on a party bus with the wrist bands on with a group of 20+, the bouncers sure know how to accommodate us in the line.  It was about 10:30 and got it with an ease with those wristbands. Of course no cover charge so that was a plus! Well, got in and it was so empty in there they were just holding the line plus it was still early i suppose. The bar was small downstairs and the upstairs dance floor was huge but they closed it off because it was \"early\" so only the bathrooms had access there.   Drinks are decently priced with a $10 min credit card charge, so not bad at all.   After around 11:15 the crowd started forming and they finally opened up the place and people migrated. The DJ was pretty good spinning top 40 and a few other slappers, but the crowd was just alright.   Towards the end of the night tho, damn it got GHETTO up in there. all this dudes tryin' to \"function\" and broads whippin their hair all over the place tho. NOT crackin. You can get hyphy and everything but whippin your hair is just gonna start a fight  Last but not least, thank you to the nice asian dude in the bathroom that served the dudes, much appreciated!", 
    "review_date": "2012-03-23"
  }, 
  "EOx4c3O1XeGEFVO0i1a2lQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "James B.", 
    "review_text": "The place is surprisingly larger than it seems.  Very much on par with the rest of the clubs on Broadway.  The reason for my 4 stars is the service.  A friend in my group left her jacket there.  I called a day later and someone actually picked up and was nice enough to get the description and my number to call me back.  That's better than the \"f*ck off\" message I would expect from other places.", 
    "review_date": "2009-04-07"
  }, 
  "dMO2zgJFUT9oVbzR8nsr_A": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Sophie B.", 
    "review_text": "This is a nice club. There's plenty of room but the restroom is like a mile away in the back of the club...lol. Music is good, the place is actually pretty nice. I think their VIP table area need to be bigger. It's a great place to hang out and chill at but the dance floor is also great. I actually really liked this place except for the bartender. They seem annoyed. If it wasn't for them, I'd give this place a 5 star.", 
    "review_date": "2012-12-20"
  }, 
  "CyBqMzCB42fVNynBKmZ7dg": {
    "user_rating": 1.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Carrie S.", 
    "review_text": "This place is garbage the service is horrible they charged $125.00 for ultimate vodka so they said .......? but then actually charged my brothers card $185.00 not one time did the girl come to check on the VIP service or to refill our mixers the floors were soaked nobody there to clean up spills overall worst service ever and my sister in laws clutch purse was stolen !!!!! I would never recommend this club for VIP or anything ever they should burn it down !!!!!!!!!!!", 
    "review_date": "2013-04-02"
  }, 
  "_UXWlGpGI8QeDUZMyjP3jw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany C.", 
    "review_text": "Don't let the pictures fool you. It nothing like it. Came here the past Friday night on a party bus. I expected this place to be popping when I got there because of they made us wait in line. To my disappointment, the club was pretty empty when we got in. =[  Slowly more and more people showed up. They had large mirrors and pillars inside and even in the dark it looked dirty. The mirrors had finger prints all over it and  the pillars had gum on it. Pretty disgusting.   FYI: the hallway to the restroom had used paper towel that no one bothered to pick up which gave made the place look even more dirty and gave it a cheap feel. The restroom looked like one of those dark scary public restrooms. Low light, metal heavy doors, dark painted walls.... feel like a scary story itself...  Don't think I'm ever going to come back here.", 
    "review_date": "2011-02-28"
  }, 
  "49iE9pwwkIBgQQHJsgDKiA": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lyn Y.", 
    "review_text": "On a Saturday night at 10:45, they held a line outside while the place was relatively empty inside, also they charged $20 cover - way overpriced for the \"atmosphere\" inside.  The drinks were on the strong side, which was fine - by 11:30, we'd moved on to a different club.", 
    "review_date": "2009-10-04"
  }, 
  "QbNsDgq4vNBTbAUpJj7-Tw": {
    "user_rating": 3.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Bernard x.", 
    "review_text": "This place didn't seem as bad to me as mentioned by the reviewers below, however it has been over a year since going to this club. From my experience, it has been pretty chill.   I've had photography gigs for the promoter around this time last year; for the most part, it was a cool environment i.e. people, music, setting. I remember losing my flash diffuser for my camera, and coming back to ask one of the bouncers, and he had recovered it, stored it, and gave it back to me, which I thought was rather nice. Inside, there is a huge fish tank which featured the elegant fish from Deuce Bigalow: Male Gigolo. I've only experienced the bottom floor subdivided into two areas. There's a pool table. Smell? All I smell is Atmosphere.   DJ plays Vintage Hip Hop &amp; R&amp;B, Rock, Electro with club anthem mashups &amp; remixes.  I've met the regular DJ's, bartenders, security and I believe one of the owners- they were all cool.   I would though like to make it clear that I primarily came to the venue for the Tuesday - no cover promotion. Only a couple times I went on Fri/Sat and this place would get jammed-packed. I don't recall any negative experience other than jammed-packed.", 
    "review_date": "2010-05-14"
  }, 
  "TSdV_lsddT4F3TJvmdmXag": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie K.", 
    "review_text": "No, wannabe pickup artist, you cannot have the flower in my hair, and you are not cuter than me.  Even if you were - which I'm willing to concede if it's true - I am rather attached to my accessories, and no amount of harrassment around the dance floor is going to charm or annoy me into giving it up.  Pun fully intended.  So that's the crowd.  Proceed at your own risk.  Or maybe you like that sort of thing.  Not that there's anything wrong with that.  I came here last night for the Barrister's Ball - aka Law School Prom - despite reservations about North Beach in general.  (Go for the food, run like hell when the popped collars come out.)    Outside: you walk past a lot of skeevy strip joints.    Inside: the space is really pretty.  Very modern brick-and-metal decor.  Two levels and three main rooms.  Coat check.  There's only one bathroom on the first floor, which was closed for most of the night.  Upstairs, there's a bigger bathroom, with a bathroom attendant...and the general consensus was that bathroom attendants are: a) unnecessary b) uncomfortable c) did I mention unnecessary?  I'm a modern girl, I can dispense my own soap, find my own empty stall, and pick up my own towel.    Bar itself: Any bar without beer on tap is an automatic meh.  And wine is $8.  Ouch.  Music: standard 80's/pop/hip hop mix.  It was a great venue for barrister's ball, but once they started opening up the club to the general public, it became the guido-populated dance club of my nightmares.  If you're anything like me, go for private events only.  It was a fun night, but I was perfectly happy to leave after 11, and I don't think I'll go back.  Just not my scene...", 
    "review_date": "2009-04-05"
  }, 
  "nx10o8SCYiTn8KWhmM6l-w": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Minh V.", 
    "review_text": "Went here for one of those \"Drink for a Cause\" benefits... The music was pretty loud, so when I ordered my drink, the bartender messed it up completely. How do you get a vodka redbull from an order of vodka soda... uh... I didn't even bother to correct him for fear of getting a worse drink. Although the drinks were stiff, it was hard to chat w/ people due to how loud the music was. Oh well... At least it was for a good cause... Next Cause please...", 
    "review_date": "2011-02-09"
  }, 
  "TS1743yx60gkKZKumGgCsg": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Kei H.", 
    "review_text": "Didn't like the atmosphere much at Atmosphere.   There are 2 dance floors (actually \"dance\" floors). The first one isn't really a dance floor...it's more like a small open area where people cluster and groups of random drunk people dance. The second one IS actually a dance floor and it's a lot bigger. It got really hot, literally. The music was top 40, which was cool.  Super ghetto crowd with lots of creepy people. Yug.   The drinks were OK and the bartenders were OK. I found the bouncers to be kind of mean and the coat check lady wasn't very helpful either. Maybe it was just a bad night...I don't know.  The bathroom had some lady inside who was supposed to hand out towels (I guess?!), but she wasn't doing crap. She basically just stood there while other girls would cut in line or push their way into the stalls to throw up. She actually scolded me for standing too long at the sink to wash my hands and check my make-up :P  cover is $20 if you're not on the guest list. I would NEVER pay $20 to come here.", 
    "review_date": "2011-08-17"
  }, 
  "3qSYU0qVt8eym2FVb4Iagg": {
    "user_rating": 3.0, 
    "user_location": "Richmond, CA", 
    "user_name": "emiko r.", 
    "review_text": "Ok so this is a tough one for me. I have been here a few times. I always have fun. Once was for Drakes afterparty,  Once was to see Lloyd (the R&amp;B singer preform). and once for a friends bday. well........One time I went i was livid because the flippin lady bartender on the first floor jipped me out of my change. I gave her a 10 she never came back. i beleive I got a beer which was 6 dollars. NO heffer I was NOT leaving you a 4 dollar tip for your horrible service. I tried to argue calmly with her but she shrugged her shoulders and walked off. Anyways, THEN at the Lloyd party, I got attacked by a photographer who was hitting girls hands and shoving them out of the way to get a good shot. When the security came I tried to explain (once AGAIN calmly) why everyone was mad at him and he told me to shut the fuck up. hmmmmmmmm. THEN this HUGE avatar woman wanted to FIGHT me because i wouldnt, COULDNT move out of the way for her. it was chaos that night. the crowd was gutter trash that night.  But I will admit that one time ive been the crowd was pleasantly mixed. anyways it all goes back to it all depends on whos promoting.......i suppose.  I always end up going back there. its not bad ALL the time ;)", 
    "review_date": "2010-09-02"
  }, 
  "tIRh_AmxJhUgzoHUBMPnlA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jubi l.", 
    "review_text": "I must admit when I rcvd an invitation to check out a new club I was pretty excited. Then get to find out it was my old hang out place, 5 years ago. The now \"Atmophere\" aka Zebra Lounge.  It was pretty much the same except when you walked inside, on your right there's a tiny room. Brings back old memories both good and bad. It's bit puzzling when bartenders (downstairs vs upstairs) charges differently for the same order (chilled grey goose &amp; pineapple back)...hhmmm  Before I forget, Atmosphere have the cutest bartender. He's tall, know's how to make drinks just right, he might be half caucasian/half white. Didn't get a chance to get his name coz we headed to another club. Maybe next time...*wink*", 
    "review_date": "2009-01-12"
  }, 
  "6GnaCPahDqFOfiw1dtW9Xg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Aaron G.", 
    "review_text": "Love this place. Always have a great time when I go up! Have had some cool performers too!", 
    "review_date": "2014-08-22"
  }, 
  "011145MPIsSoYleZh6z0ug": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Yoon R.", 
    "review_text": "DEAD AS SHIT. What the fk happened?!?!? this place used to be really fun but LITERALLY there was only my group of 8 people and some random old creepers at the downstairs bar tonight (FRIDAY fking NIGHT!!!!)   The dance floor that used to be popping was 100% EMPTY. Atmosphere is def not the ratchet fun it used to be.   R I P THEY JUST KILLED THE CLUB .", 
    "review_date": "2014-02-15"
  }, 
  "PSJ9LP_U3jF5K9avjvPPRw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rob L.", 
    "review_text": "This is the former Chinese video game arcade plus pool hall spot during the 80's and 90's. The club has its ups and downs, where there's nothing that stands out yet nothing that's completely terrible neither.   The layout is nice, as there's 2 levels of entertainment, plus we had a private party, so we were roped off from the general crowd, thus no need to battle with others for drinks or dance floor space.  Overall, I don't mind this place, yet I can understand other reviewers issues of space, relations with the staff, or other concerns. If my friends would like to return here, I wouldn't mind.", 
    "review_date": "2010-07-03"
  }, 
  "qD7BCSxI74WxmLmEHnwNPw": {
    "user_rating": 1.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "chefboyardee b.", 
    "review_text": "Had a similarly unpleasant experience as Quinn S.  We were on the guest list and were told the same thing: free Patron and free entry before 11.  We were made to wait in line outside for *one hour* despite getting there early.   Half an hour into it, a staff member wearing orange made the announcement to the line that they had now decided to start charging $10 for admission.  Some people left on principle, understandably miffed at being lied to, and others stayed... we decided to stay.  After an hour, we were finally allowed in, only to discover that we were waiting this whole time for a mostly empty venue (unsurprisingly  -- we'd all been to places like this before).  The bouncer ushered us toward the cash taker: \"that'll be $15\".  Confused, we explained that a guy outside in an orange shirt said the revised cover would be $10, not $15.  We were told smugly by the bouncer that \"there is no guy in orange\".  Eventually the staff conceded that he exists, but he was \"misinformed\".  The $15 fee stood, however.  I gave the cash taker a $20-bill... no change.  So I asked for my change, and after she made some suspect eye-contact with the bouncer, she reluctantly gave me the $5 she owed me.  To summarize, free cover and free Patron turned into $10 cover with no free Patron, which turned into $15, which nearly became $20... an hour later.  Each step of the way we were a little more invested, so it wasn't worth it for us to turn away, which is why we stayed.  A primitive strategy that can make you a lot of money for an event, but ultimately a bad idea if you're at all interested in return business, good reviews, or have any ethics whatsoever.  Without getting into specifics (I don't want to be a dick), the dancers on the second floor leave *a lot* to be desired.  I was a bit embarrassed for them.  The upside: drinks were decently strong, and service at the bar was pretty quick (the latter of which you can chalk up to an empty venue).  Overall I strongly recommend against Atmosphere.", 
    "review_date": "2008-10-20"
  }, 
  "FpOste6Fh4ppO7jol-JlQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacqueline G.", 
    "review_text": "Parking in North Beach is a BITCH so my friend and I missed the guestlist :( Cover was freaking $25! I was pretty pissed so I went to go drown my sorrows at the bar with a $10 shot of patron (which was actually really bigger than an average shot). It must have been 11:20pm or something and the dance floor was DEAD! Weird, but the people we met up with seem to get the party started. Oh and so random! It became a concert with some rappers? and throwing out free t-shirts that were 5 sizes too big? I did like the top 40 music, though the mixing wasn't perfect.", 
    "review_date": "2010-10-16"
  }, 
  "WU63-7JLQgpR8y4OeQnYRA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Winnie B.", 
    "review_text": "We just sorta wandered in off the streets after dinner one Friday night.  All the big guys with clipboards and ear pieces at the front door were super friendly, smiling and trying to get us to come in.  So we moseyed on over the the line, and a few minutes later, someone asked us which guest list we were on.  I look at him like \"What guest list?\"  So he goes off and comes back with a manager, who proceeds to give the girls stamps to get in for free, and drink tickets for champagne.  Awesome!  He, like everyone else we encountered, was also incredibly friendly, chatting everyone up as he went.  And we didn't even have to be a skanky girl-only group in order to get such special treatment.  I'd go back just for the smiles.", 
    "review_date": "2008-12-16"
  }, 
  "G5msygFjJeciNrQEu1wjsg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mahary K.", 
    "review_text": "I usually don't write reviews and I am not sure if it is fair to write this review. But I have to. We were put on a guest list and we got there at least half an hour before. We waited on a line that hardly moved and after the clock hit 11, guess what, the line started to move and the guest list was invalid and they asked us to pay if we want to get in. Who do they think we are, stupid?  I would have gladly paid the required amount if I was told that the guest list was not accepted that night. To me it is about principle and I will never go to that place again.  I am not sure if it is the owner's fault or the stupid promoter or manager. If it is the owner's policy, I think it is a bad policy and I think that is not the way one runs a business. If it is a promoter or a manager fault, the owner should take action to fix the problem.  Just my humble opinion after waiting in the cold for half an hour.", 
    "review_date": "2009-08-18"
  }, 
  "E9TBe7OJ4LYQnwAh4PhJIg": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "GT R.", 
    "review_text": "We received bottle service last Saturday for my friends bachelor party. Karen did a great job setting everything up and informed all the proper people if our plans. Our hostess was great and went out of her way to make sure we were all comfortable and and that we all had a great time. I would highly recommend them for bottle service and their great deals with great service.", 
    "review_date": "2014-09-15"
  }, 
  "evnyfXDWW39FI3NUYU1fFQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jenny C.", 
    "review_text": "Now this is what I call a club! Of the clubs ive been to in the bay, this prolly comes the closest to what im used to when i went clubbing back in the days.   Came here on a sat night with the roomies. Good, comparably diverse crowd, good music, drinks aren't too expensive, huge dance floor upstairs and it was packed! I also enjoyed watching ppl dance on the \"stage\". Reminds me of my old clubbing days...ahhh  Def on my list of clubs to go when you are looking for a good night!", 
    "review_date": "2010-12-12"
  }, 
  "DEa615IKMclHk5UbsUK3tQ": {
    "user_rating": 2.0, 
    "user_location": "Daly City, CA", 
    "user_name": "MJ C.", 
    "review_text": "This place is ratchet to the max!!! I don't go out clubbing much anymore but I used to frequent this place back when I was in my early 20s! Thank goodness my friend's friend had a bottle service table!!! I stayed there! Away from all the ratchetness! I'm glad I didn't drown in the sea of boys scouting vulnerable girls, girls wearing \"long t-shirts\" that are too small for them, and sloppy dancing.  No classiness at all! But I will give Atmosphere 2 stars for making the place pretty with lights and fancy chandeliers!   Yelp also had a check-in offer of a Sailor Jerry Cocktail! It's nothing special! It's just Rum&amp;Coke!", 
    "review_date": "2013-05-31"
  }, 
  "nnImk681KaRqUVHlSfZjGQ": {
    "user_rating": 4.0, 
    "user_location": "Tampa, FL", 
    "user_name": "Carlos H.", 
    "review_text": "Came here during Spring Break. A really good experience. Didn't have to deal with the line or a high cover thanks to the guestlist. The club is spacious, the dim lighting in the first room makes it very chill, a cool place to relax with your friends and have a good time. The bar on the first room also is not as packed and service was quick and drinks were good. The second room has the huge dance floor with music videos playing and it was probably one of the nicer clubs I have been to during my stay in California and clubbing in general. The crowd with mixed with many different groups of people, which was nice to see. The DJs were pretty good, playing some music I could dance to though a few songs were obscure to me being an out-of-towner.   A really fun and chill and upscale place to go with your friends for a fun night in the city.", 
    "review_date": "2010-03-15"
  }, 
  "220NBEU9WyTrI077MPPlJg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carolyn K.", 
    "review_text": "Damn, Atmosphere. Your name is so very misleading. Atmosphere/A3 conjures up scenes of a club on the top floor of a tall building. The club walls consist mainly of windows, giving party-ers an amazing view of the city lit up in the night. Instead you are just a (slightly) 2-story club in the middle of North Beach with one window on the 2nd floor. It failed to give me an atmospheric feeling.  Got in, headed straight to the bar on the second floor, got drinks (they were pretty darn strong), walked to the dance floor, decided I needed more drinks, walked back to the dance floor, and boogied.   Yay for spacious dance floors, a chill first level floor with seating (for girls in painful heels to rest), a large bar, and decent music. Boo for stopping the music and kicking everyone out at 1:30am. Brings back (lame) memories of clubbing in Downtown SD during the college years. Also, I would not pay $20 for this place. It's nice, but not $20 nice.   I'm so ready for Vegas!", 
    "review_date": "2011-05-16"
  }, 
  "FkYsJ8HFaGY7w1mMb1TZQA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Des P.", 
    "review_text": "Very nicely renovated lounge/club which a diverse selection of music for every crowd!  Owners and bar staff are very helpful and accommodating.  Had bottle service and there is always one attendant to make sure you are getting everything you need and having fun! Parking sucks but thats broadway for ya.", 
    "review_date": "2012-08-05"
  }, 
  "kie7nzDJYisVYHGWBS373Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alfred Y.", 
    "review_text": "If you're a San Franciscan, then you've probably been to a good number of clubs; and the venue at Atmosphere has probably been part of your journeys at some part of your clubbing career.  I like the layout with some of the tables. It's akin to being just far enough from the crowd, instead of being blasted by flying drinks.   Though, with any club here: you can't dance when there isn't enough room to avoid touching someone's butt, and wading through the crowd to find a spot is futile. Even though the dance floor is pretty big, you're not likely to avoid a drink down your back.  I've never had a stellar experience here, but I've never had a bad one either.", 
    "review_date": "2010-05-22"
  }, 
  "ZMBIjbnvatw6Z6JNPlS99Q": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Eugi H.", 
    "review_text": "Not a bad club for something outside of Vegas. I would say that it is better than some of the ones I've been to in LA even. Except the men are a little more well behaved here. Which is a good thing!  The wait was a a bit annoying, but not too much so. Drinks were ok, not very strong though. The music was decent. The loungy section was pretty cool. Overall not bad for a SF club. My best experience in norcal as of yet.", 
    "review_date": "2010-10-27"
  }, 
  "aVXjYtQbRiHBgffcoHtyOw": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Marcie T.", 
    "review_text": "If I could I would give this place ZERO stars. I read reviews about the staff/security being absolute garbage and boy are they right. Honestly, who the hell would hire the staff there..or better yet how the hell can those people have jobs? I wouldn't even hire them if they would work for free!   Long story short...last stop on the party bus was Atmosphere (worst idea ever)....got there and they wouldn't let us in unless we bought a bottle...we agreed to purchase one even though we didn't have to because we came from the party bus...dumb bitch at the door switched it up and said oh actually you have to buy two bottles if you all wanna get in...While we were dealing with that dumb ass broad the bouncers were sitting  talking shit to my whole party.... So we told her and all the staff to f*** off...walked across the street to Horizon and spent over a grand there....YOUR LOSS ATMOSPHERE! (heard there was barely five ppl in there last night anyways!)  I will never ever in my life step foot in your shitty club with even shittier STAFF!", 
    "review_date": "2010-05-09"
  }, 
  "4RWjr6-QXA9Z-7gRMXMDhQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "vishal k.", 
    "review_text": "Drinks are nothing special. I liked that the place was large...if i remember correctly, they had 2 rooms and bars downstairs and a large dance floor and bar upstairs. Drinks were not too hard to get. But over all nothing special. Prolly wouldn't come back. The girls dancing on the mini stage upstairs was nice tho.", 
    "review_date": "2010-05-05"
  }, 
  "KxRf-umHzdz5noKH5Cg6Mg": {
    "user_rating": 3.0, 
    "user_location": "Bay Area", 
    "user_name": "Carnita M.", 
    "review_text": "We were on the guestlist and got here before 10:30 and the line barely moved, but we made it in right before 11:00 so we only had to pay $10.  Would have been nicer to have gotten in for free, though!    Upstairs in the main room they played hip hop.  Some slow beats at times, but good songs nonetheless.  I wouldn't say it was overly crowded in there.  However, having people constantly walk by no matter where you were on the dance floor was seriously annoying!  Maybe it had to do with the layout of the place, but still, not fun getting bumped into constantly.  And there were hands all over as people walked by.  Did you really need to walk on by?  Or was that just an excuse to cop a feel here and there?!  And not just the guys but the girls!  I even had a girl get all touchy-feely!    I preferred the downstairs room where they were playing a mix of hip hop, R&amp;B, and top 40.  Not as many people dancing in there but plenty of space for me to get my groove on, and that's all I need!  I didn't go into the room with the fish tank but watch out people, the entrance to the room is over to your left.  A few more feet to the right and you'll walk into a mirror!    A couple stars knocked off for the crowdedness and all the \"walking not dancing\" people in the main room upstairs, so 3 stars for the good music and my own personal dancefloor in the downstairs room!", 
    "review_date": "2010-04-01"
  }, 
  "eNX6YE8lw8rVczBOFU6P6Q": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Aaron B.", 
    "review_text": "Best nights are when someone is performing, be sure to get here early to avoid the line. The owners are very nice and helpful, bottle service is fast and nicely done. The renovation has definitely \"one-up\" the place, especially in comparison to its surrounding competition. Security is strict but on-point. Last my not least, they serve Coconut Ciroc here!!!!", 
    "review_date": "2011-10-05"
  }, 
  "Ta4UF_SopGtDWE4mg9E2_g": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "A W.", 
    "review_text": "From out of town.  I've only been to a few SF clubs.  One of em being the one next door, Sutra.  We went on Friday night.  Sutra let us in for free at 10:45pm.  There were probably 15 people max in there.  No re-entry.  We left at 11pm to find a 20 ppl line next door at Atmosphere.  We waited.   Atmosphere charged me 20$ to get in and my girlfriend 10$.  Outrageous.  But whatever, we're on vacation.   There's 2 sections.  The front section that you first run into was fairly bare by that time, 11:30 ish.  The back was pretty full.    The club was pretty fun.  Pretty good blend of people and we ended up having a good time.    This isn't an 'Asian Invasion' club like Sutra was.  At least this night wasn't.  The music was decent, no real complaints.   I'd probably come here again, but I'd try my best to get on that damn list.  30$ for 2 people was ridiculous...", 
    "review_date": "2010-06-11"
  }, 
  "0c1KQRT-lyWEyHumLwuQHQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Leilani R.", 
    "review_text": "On Saturday Nov/8/2014 I booked a bottle service for a party of 18 to celebrate my 30th birthday.  We arrived in a party bus and Karen the lady who took care of my reservations said we would be ok and we wouldn't have to stand in the long line. When we arrived the security at Atmosphere said we couldn't be dropped off there even though I told him we had bottle reservations.  Karen the lady who handled my reservation wasn't even there, I had to wait for another hostess to come out and we still had to stand in the long line outside the club. Finally when we were escorted in, the hostess had to ask a group that was already seated in our booth to leave. There was only 16 of us but I paid for 18 people instead. We had to wait 10mins for our bottles, and I ordered the Champagne and Belvedere special but she didn't bring out the champagne. We also ordered beers and she never brought them. She just brought our 2 bottles and mixers and never returned with my order of 3 buckets of beer or the champagne. I had to go to the bar to go get the beers. The whole night she never came back to check on us to ask if we wanted anything else or a refill on the mixers. I contacted Karen the lady that handled my reservation and she never responded. It's ridiculous that I over paid them and I never received any VIP service at all. We left the club and there was still drinks at our table. My friends and I were hoping to have a good time especially since they had Mase at the club that night performing. It was ridiculously pathetic!! I spent over $700 for bottle service and it wasn't worth it at all. What a total rip off!!  Since they knew the club was going to be crowded they should have been prepared for the crowd and be sure that the vip area received the service they paid for. I chose Atmosphere because the last time I went there with friends they were very good, but after last Saturday I am going to tell my other friends about how pathetic their service was. Karen could at least reply to my message or give me some kind of credit. I haven't heard from her or anyone else at Atmosphere.", 
    "review_date": "2014-11-10"
  }, 
  "gVEye2LuFCLxxFRc41jIKA": {
    "user_rating": 3.0, 
    "user_location": "Kentfield, CA", 
    "user_name": "Tran N.", 
    "review_text": "I came here with a party bus on a saturday night, we were given wrist bands, but there was some confusion and the bouncer made us line up outside for 10-15 minutes. Finally someone told the promoter that we were from the party bus and we were let in. Doh. We had bottle service and the waitresses were really fast with refilling juice and getting us more cups. Our group had over 25 people and we went through a lot of the stuff but the waitresses kept up. The bathroom was sufficient, relatively clean and the wait was acceptable.", 
    "review_date": "2011-06-05"
  }, 
  "9eRr2tVQ84F4B3IiYzgIxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz H.", 
    "review_text": "It's was super fun I had a blast thank yu so much Karen for making my boyfriends birthday fun thank u", 
    "review_date": "2014-02-17"
  }, 
  "V4yqq3Lu7_ONT0XnPXiJ3Q": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Kurosh H.", 
    "review_text": "Grand Opening 10/17/08.  From what I hear, its going to be cool.", 
    "review_date": "2008-10-15"
  }, 
  "OPoUR6nKMow0Wk23emHPew": {
    "user_rating": 1.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Hanna K.", 
    "review_text": "I went here this weekend with a couple of my friends and there were things i liked/disliked about this place.   likes- 1) different music on the 1st and 2nd floor; there was hip hop/r&amp;b on the second floor and at times-- some house music on the first.  2) the bartender hooked it up with some loaded patron shots :):)   dislikes- 1) this was a SUPER asian crowd and its soooo stuffy. literally, no air circulation on the second floor. 2) kindof reminds me of a 18+club b/c of the \"atmosphere\".. haha ;)   But overall, I like to go pick and choose my places for 'hangout' and this place wasn't as good as thought it would be..", 
    "review_date": "2010-12-06"
  }, 
  "qK5GQYyckJx_5tyqDtqrXw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Glenn L.", 
    "review_text": "We went here on a Saturday night for my friend's birthday celebration! They have a guestlist, and it's free before 11:00PM! Can't complain about that.   I probably wouldn't pay to get into this club though. My first time in Atmosphere and it's also probably my last UNLESS I HAVE to go for another friend's birthday.  We got there around 10:30 and the line moved fast, unlike some clubs in SF that holds the line. It was still pretty empty around that time. The place is huge inside. the bar downstairs started to get packed around 11! They also have another room with tables where the smoking area is. The second floor didn't open till 11:30! I didn't realize how big that dance floor was till it opened!   Music was good downstairs AND upstairs! The bars were pretty big and the bartenders make the drinks really strong! Had an AMF from the bar downstairs and had another one upstairs. Tasted different, but both were strong!  Crowd's OKAY, it's free so it attracts all different types of people.... I agree with most of the reviews on here that this place is straight up ghetto! There were atleast three fights that night! Bouncers and security would push their way through and shove anybody to stop a fight! You can imagine how hard it would be to enjoy the good music playing when you gotta move out of the way for the bouncers or move away from a fight five feet away from you.  With that said, my friends and I enjoyed the club's music. I can't say the same for the club's \"ATMOSPHERE\", crowd, and the ghetto-ness! So one star for GOOD MUSIC and another for STRONG DRINKS! It definitely helps to be with good company and to sip on a strong drink to enjoy a place like this!", 
    "review_date": "2011-10-24"
  }, 
  "NdX6UacaCOqqxfllgsxS0g": {
    "user_rating": 1.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Michael C.", 
    "review_text": "Last night, I went to Atmosphere with 8 friends.  Actually, I brought them all there based on my recommendation as I'd been to the venue several times, even before it was renamed Atmosphere.  After checking on the nightly events on Atmosphere's website, I saw that they had something special going on for Sat with an open bar between 9:30-10:30pm and no cover until 11pm.  That's pretty much enough justification to get everybody to swing by and put up with the stiff parking fees.  When we arrived at 9:30pm, the door was locked with no indication that anything was going on.  Really annoyed, as I had 8 guests standing around, I tried calling to find out what's going on.  Nobody answered the phones.  All my calls went to voicemail.  This totally sucked.    Then, as if by a miracle, somebody unchained the locks and put out the vile velvet ropes that would pointlessly torture their eager patrons for hours to come.  I asked about the situation and the door man merely indicated to form a line at the ropes while he shuffled across the street to stuff his gullet with a greasy slice of pizza.  Finally, 9:45pm swung around and the hosts finally get their act together and start checking IDs.  I indicated that I had put myself on the guest list and brought along 8 friends to help pad Atmosphere's wallets.  Ridiculously, the hostess tells me that not only were my friends not on the guest list, they would have to pay the bloody $20 cover even though it was before 11pm.  But, she said that we would still get our shot at the open bar, which she said would be extended to 10:45pm to make up for the full hour.  So, cold and clinging to optimism, we caved and paid up.  When we sidled up to the bar, we were informed by the hip bartender that only well drinks were available.  Errrr, we grunted and ordered up whatever simple shots of vodka, rum, and tequila we could think up.  In about 30 minutes, we had put down 3-4 rounds and was getting used to the overly loud music that nobody was dancing to.  Then again, with all the aspiring Lane Bryant customers filling up the joint, I could see no point in trying.  Sensing that I was obviously not drunk enough, I returned for another round and was told by the same hip bartender that the open bar was closed by 10:30pm, so lame.    By 11pm, we could see that the scene wasn't improving and decided to cut bait on our cover charge.  I only hoped that I was sufficiently glazed over by alcohol to not betray my merciful gaze of pity on the shivering ladies still vying to get the night started.", 
    "review_date": "2010-03-21"
  }, 
  "CZ1bprnm0HseWZFY5KV2oA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chris C.", 
    "review_text": "This place will always have a special place in my heart, real talk.  First off, I'm not a fan of spots where I have to wear my \"wedding shoes\". So +1 for Atmosphere. Don't get me wrong. I love suiting up and getting all GQ and what have you. I love stepping my white collar game up. But at a lounge/club, I'm just trying to \"dance with my girls\" LOL (fellas don't you love that line?) and I want to be rocking the most comfy shoes ever. But I digress.  Second off, I hate places that hold the line, but that's just par for the course. I hate when fellow Yelpers give lounges/clubs bad reviews based on things that cannot be controlled. Of course lines will be held, c'mon now.  Third off, once we finally got in (yeah we had to wait, but remember, par for the course) the music was way on point. Any time I walk in and \"When The Last Time\" by the Clipse is playing, you know it's going to be a good night. Smaller bar section downstairs, and a much larger dancefloor with a much larger bar upstairs.  Fourth off? You know you're at a \"club\" not bar when you got bathroom attendants at the joint. I was disappointed with dude's gum selection, to be quite honest with you. But he was Quickdraw McGraw with the paper towels as soon as I was done washing my hands, MY GAWD. Good shit man.  Fifth off, drinks are reasonably priced (for The City). Girls are way friendlier up here. And less snobby too. ATTN fellas: just don't get all grabby and pushy with the ladies, and you'll have a fun night, I promise you.  Overall, it's your basic club spot without all the bourgeois fanfare (everyone's entitled to their own opinion of course). The vibe was real cool. Good music, good peoples, good times.  Most likely I'll be back, but I wouldn't want to ruin the mystique of my first night at this spot. It's kind of like the Seinfeld theory. You got to go out while you're on top. And if I had a pretty amazing time here my first time here, why should I come back if that night can't be topped?  Or can it?  *DUN DUN DUN*", 
    "review_date": "2010-09-12"
  }, 
  "DAIF6BwUEBCPqPvhNby9IQ": {
    "user_rating": 3.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Dorothy N.", 
    "review_text": "I stumbled. I slipped. I fell. I told an employee to fuck himself and gave him the finger. I stumbled some more. I slipped a few more times. I even fell over again and again.    Sure, they made numerous threats and put me in several \"time outs\" (I don't remember shit; my friends told me). Yet they still let me stay.  And, the DJ played \"ain't no fun.\"   Thanks Atmosphere!", 
    "review_date": "2010-10-01"
  }, 
  "lk8dCBbF-CNfWTtGW2RW1Q": {
    "user_rating": 1.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Martin V.", 
    "review_text": "Worst experience ever! I can't even believe I have to give them a star. Everyone here is new on the job and had no sense of self worth. Please go anywhere else but here and save yourself the headache.", 
    "review_date": "2014-03-11"
  }, 
  "RFTVBFlgM0cqvl1daywfjQ": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Danielle B.", 
    "review_text": "Thank God we were on a guest's list otherwise I would have been hella bitter about paying to get in. I just didn't have as much fun here as described by some of you. The music was good at first in the front room, but then slowly got worse as the night went on, especially in the main room. There wasn't a ton of people there that night, and it was mostly a sausage fest with the exception of a group of hoodrat drunk beezies trying to grind on the \"stage\". I'm pretty sure at least one of them got date-raped that night, but no matter. We amused ourselves with a group of fun dudes that were recently transplanted from the Philippines and ready to bust a move, so it wasn't a complete waste of going out. As for service, the bartenders downstairs were more open than the ones upstairs, who seemed cold to me. And parking as usual for the area was garage only, but there is one like 2 doors down so it was pretty convenient for those of you not cabbing. I probably wouldn't go back.", 
    "review_date": "2010-07-21"
  }, 
  "khzZyHKzS5fLxfUi1Cu9iw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Ellen T.", 
    "review_text": "so really this place sucked when i went on saturday night with my sister and friends.  it was not busy at all when we got there at midnight and the music was booboo.  we should have saw the sign when about 15 girls left the place on our way in. i liked this place better when it was the zebra lounge.", 
    "review_date": "2009-02-02"
  }, 
  "coEX0WGa92jJZ0Wgn1WRMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ninja H.", 
    "review_text": "My SJ friends spin here sometimes so I came out one night to support, but unfortunately missed their set =(  Well, the positive thing about that is that now we can all drink and dance!! =)  Drinks were okay...two bars (one downstairs and one upstairs). Love that both of them are strategically located so that no one waiting at the bar ends up blocking the dance floors.    The dance floor downstairs is kinda tiny but the one upstairs is pretty spacious. Love that it wasn't a packed sardine can.  I like being on the dance floor when I don't have to continuously say excuse me or sorry to the person dancing next to me because I keep bumping into them, but also like when others are close enough so that I can still feel their vibin groove.  Be careful of those stairs now!!...it was amusing watching many stumbling down or missing a few steps AHAHAHA", 
    "review_date": "2010-09-20"
  }, 
  "D9mgcl6MFE3vRKTVadFFdQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Britney C.", 
    "review_text": "This place used to be called Latitude. Now it's called Atmosphere. WTF is up with all the scientific, geological names?!?! <a href=\"http://www.yelp.com/biz/club-latitude-san-francisco#hrid:gi010WVJkjAKj3sf2EPBtA\">yelp.com/biz/club-latitu…</a>", 
    "review_date": "2008-11-15"
  }, 
  "rZ9Ckrw8wwNDWrx_tzZT8A": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "Thomas M.", 
    "review_text": "This place is decent.  I ended up at Atmosphere, simply because the party bus I was on brought me here. This was my first time at this club. The bus got to Atmosphere just before 11:00. Since we were on a bus, my group and I put into VIP line. Getting into the club was quite fast. I believe our party got into the club quickly because our party was mostly females. At the door we did the normal ID and pat down. During my pat down, the security advised to keep my pants up. WEIRD THING though, the bouncer pulled up my pants for me. The bouncer advised the guy before me the same, but he didn't ill up his pants. Just saying kind of weird.  When we got inside, the club was just filling up. The club is two stories. The first floor is mainly one bar and a bunch or vip tables. The second floor consists of a long bar, a few vip tables to side the bar and a stage. The bathrooms are located in the back of the second story.When I hit up the bar, and got normal shot and beer. Of course, I tipped well, which makes a big difference. For the rest of the night the female bartender was very attentive to tending to my service. Even when I was behind some people.  The dance floor gets pretty crowded. There is a good blend of people. The bouncers were being cool that night. My group had good time, so I can't complain about anything. I just wasn't impressed much, though.", 
    "review_date": "2012-04-19"
  }, 
  "MO-RUw75OAhIc4Uzml348w": {
    "user_rating": 1.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Christine G.", 
    "review_text": "Minus 4 stars for: -Sticky bottle service booth seats.  -Bottle service girl was rude, non-attentive, and not pleasant at all. -Horrible ventilation. -Dude next to us was basically passed out in his own vomit and securrity did nothing!  -Unnecessary strict dress code. Too many questionable gold chains and boxer shorts in one club if you ask me.  One star because bottle service is blocked off to prevent unknowns from invading and the bathroom lady is really polite.", 
    "review_date": "2014-07-29"
  }, 
  "xMKpXNaicvI-BgSA69yp9A": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Ali C.", 
    "review_text": "I came here with a group of about 20 people on a PARTY BUS!!!  We were all pretty toasted when we got here but I swear, people wanted to be us.. We hella brought the party!!    There are no in and outs.  I repeat, there are no in and outs.  You have to know this because there are 2 pizza places across the street that were tempting all of us but they wouldn't let us go get any.. Lame but we went after they closed so HA!    The first level of this club is hip hop music with a fully stocked bar.  Upstairs is house music with another fully stocked bar and big dance floor.  This was my favorite room.  There is also a lounge/VIP/chill area with couches, tables and an aquarium and outside of that is the smoking area.  The bathroom attendant was nice and I felt bad I didn't have any cash for her..   Atmosphere is a fun club in North Beach with a good mix of people.  I wish they had in and outs though which is the only thing I was annoyed about.  I liked the upstairs room better and there never seemed to be a line for the bar!  Good times at Atmosphere!", 
    "review_date": "2009-03-25"
  }, 
  "3qX8ok7ZmPbig-t6KR5pRQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Khai T.", 
    "review_text": "Drove up here for my friend's Bday. Came after 11 so I had to pay a $20 cover. You walk straight up to the door, and it says strict dress code policy. I get told by a worker that my clothes may not work. I was wearing jeans, t-shirt, vest, and jacket. I was like ill button up my vest and it'll be cool. Later on in the night I see a tall white guy dressed like Napoleon Dynamite on the dance floor. *Shrugs*.The club was poppin' nonetheless.. The women that night were either really beautiful or as my friend puts it \"Shamu.\" The club has two floors with different music on each floor. I thought this was cool, because it gives you options if you aren't feeling the music. The bartenders are really cool, and beautiful I might add. Overall, my experience of the place is positive, and would come back on special occasions.", 
    "review_date": "2010-12-05"
  }, 
  "aKll5eCfS95ko13OqhJAbA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keith D.", 
    "review_text": "Huge dance floor, okay crowd.  Not that full though for the line outside.  Overall average club.  They let my gf and I in for half price though which was nice.", 
    "review_date": "2009-12-15"
  }, 
  "3j8FDsMePNYwD-1faD1jjQ": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Marc Y.", 
    "review_text": "So here's a breakdown of why i gave this club 4 stars:  1 star for location = in the middle of broadway street, with other bars and clubs, places to eat late at night and tons of people wandering around. party on the streets!  1 star for music/setting = the most popular hip hop, pop and dance tracks. you know what you're getting. tons of dance space, although it gets packed around midnight. dark, dirty and fun as hell. AND there's a lounge area where you can just chill and sit.   1 star for people = there are tons of asians at this club. i'm asian so it was all good. besides that, it's a fun crowd.  1 star for fun factor = i've been here twice. once to try it out and another time for a VIP party. both times have been awesome. the place gets popin' around midnight.   -1 star because of location. it's in the heart of broadway. parking and traffic on a friday/saturday night is a nightmare. get here early or expect to pay more for parking than for cover.", 
    "review_date": "2010-07-16"
  }, 
  "dzbtggAUQ-i3-so3g1pDmw": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Denise W.", 
    "review_text": "Been here a grand total of.......... 2 times. haha.   We stopped here on our partybus on Halloween and last Saturday when some friends of friends threw a huge bday bash. I had a great time both times. the decor isnt as grand as the picture shows.. but its got a dancefloor &amp; a bar. what more do you need??  -So i Love, love, LOVE  the roomy dance floors. Not roomy as in empty, but roomy as in.. i could move &amp; flee from creepers if necessary.  &amp; watch out for crazy beezys that like to swing their legs back when they dance [wtf], almost got stabbed in the leg. o_O   -VIP/ bottle service area in the back was a lil crowded though, but there was a shitload of people.   -My only complaint is that the bartenders a taddd on the slow side [upstairs at least]  -also my kamikaze didnt have enough alkie so i stuck to patron after that.  -the bar downstairs def. had quicker service &amp; bigger shots.   &amp; in the bottle service line.. i encountered one of the NICEST staffs everrr at a club. like whOa. not the usual douchebag. maybe he was a manager.  2 of our friends were not on the bottle service list &amp; the guestlist line wrapped around the building, so he was nice enough to let them in with us, only payin the cover, which was fine by us.   the venue itself is very chill, i would def. return.", 
    "review_date": "2010-03-02"
  }, 
  "bBRPy8zUvNc0NGbGmkjrZg": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jan P.", 
    "review_text": "Atmosphere is a small club, with a capacity of just 200. The space inside is very roughly divided into three spaces: a dance floor in the dark next to the DJ, a space next to the bar with a few seats to aid chilling out, and a space by the stairs where the toilets and a second dance floor which seems dead. My friends and I had to queue for 10 minutes to get in and each paid a $15 entry fee, but it was totally worth it. Even at full capacity, there's space to chill out and take a breather, something that PP deserve a lot of credit for ensuring, rather than attempt to squeeze every last possible punter in.  One of the best aspects of the experience though was the crowd and the general atmosphere there: people were simply there to enjoy and bop to the music in a completely uninhibited yet space-respecting fashion. This desire was underlined by the very few camera flashes throughout the night - people were there to have fun, not to show the Facebook world just how hip they were.   The bar was pretty reasonable too, with a good range of spirits, beer, cocktails and even some wine at decent prices: bottled beer was $5  and $10 for AMFs. Service was friendly and very quick.  And the music? Simply superb, with DJ serving up an expertly crafted mix of acid jazz, electro, hip hop, reggae and a range of other genres too, all through the club's incredible sound system.   I recommend this place if you do not like to be on the crowdy side and to be with your friends.", 
    "review_date": "2012-04-17"
  }, 
  "_64q3QQbUg4BknYri7fCPA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "c e.", 
    "review_text": "this place is the hottttt shittttt  great ATMOSPHERE (literally) Fast &amp; friendly bartenders with heavy hands...  Definately will be back!", 
    "review_date": "2008-10-20"
  }, 
  "2aUyAi0HLA8g2XVSuOZ5-A": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "Kimberly H.", 
    "review_text": "Uuuuugh.  Went here for Halloween. The crowd somehow achieved being (mostly) overweight, slutty, and grumpy.  There was none of that tipsy camaraderie that you usually get in a night out dancing/drinking.  The bartenders were sloppy-drunk. The DJ was also sloppy--whenever he changed songs he would mix in the second song, everyone would get excited and start boppin to the new beat, and then he would either slow waaaaaaaay down or pause, leaving the dance floor hanging for a good 20 seconds, kind of wanting to dance but not really being able to groove to the weird mash-up.  And he did that EVERY SINGLE TIME. And for all this I paid $15! Wtf! The one plus was that they had a lot of seating....which they closed off at 1 a.m., just when everyone's feet started to give out from the Halloween heels.    Full disclosure: I was pretty sober for this whole experience.  But I don't think that any amount of drunkenness could have made Atmosphere a place that I would go back to.", 
    "review_date": "2009-11-02"
  }, 
  "pJ1SKD4XZr-6p9FnG8yZ2w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Thao N.", 
    "review_text": "Nothing is better than some good convincing.   My friends who share the same birthday as me convinced me to celebrate our birthday in SF this year. I was super hesitant, but they somehow managed to get me to go. I'm glad that I went because it was a different experience.  As I entered Atmosphere, I noticed the mirror that people mentioned in previous reviews. It was fun to watch some people walking towards the mirror thinking it was another room. I wonder if they put that there on purpose?   Atmosphere is spacious and there are two bars. I noticed that the bar upstairs poured their shots into plastic cups versus the bar downstairs pouring their shots into regular shot glasses. Not sure which one people prefer, but I just wanted to give you all a heads up.  The music was pretty good that particular night  that I went and I liked how the DJ didn't play songs over and over.  I would definitely recommend this place to others. It's just kind of odd where this place is located. Haha.", 
    "review_date": "2009-11-16"
  }, 
  "GQwiY_PvTUtdtnt8cCjmfQ": {
    "user_rating": 3.0, 
    "user_location": "Orange County, CA", 
    "user_name": "K D.", 
    "review_text": "I've come to a realization that maybe 4 or 5 venues in SF are real clubs. The rest are just makeshift restaurant/bars.  I've been to Atmopshere before when it was Latitudes but man things haven't changed at all.  It's still hot as hell.  Bottle service is pretty much serve yourself and the hold up of the line was even worse than most clubs in Hollywood.  Instead of having AC.. they put those square fans you buy at Walmart and propped them at the top of the ceiling. Yes, very classy.    They have a large rectangular platform propped against the back of the wall where drunk ass hoodrats can get up there and shake their ass.  That platform didn't look sturdy at all.. all taped up with electrical tape... it was an accident waiting to happen.  Promoters were Asian but it was pretty mixed actually.   Black, Latino, White, Asian, you got everyone.    They barricade a small section of the front of the club for a \"smoking patio.\"  They need to make that shit bigger.  Parking is atrocious as others have said, so get there early.", 
    "review_date": "2010-10-19"
  }, 
  "W46UkrAvPokkWfXno1cD6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsey E.", 
    "review_text": "This was one of my best first experiences with a club/lounge in SF. After you get past the fact that it's surrounded by strip clubs and other rather trashy hangouts, and past the homeland security-like check at the front door, this place is fantastic!  I love the space - like a loft in the meatpacking district of NYC. There was always a spot for my friend and I to sit (so necessary when you're wearing 4 inch heels!), and plenty of room for us to get our groove on. The dance floor is huge! I didn't have to step on anyone's feet to get them off of my back. Not everyone looked like a model, but overall the people there tried to look good and avoided the kinds 6 inch platform heels and spandex.   The night we were there (last saturday), they had free lotus vodka until 11pm. And somehow, after arriving at 10:52, we managed to fit in 2 vodka crans. Classy, I know. The bartender, Nicole, was incredibly nice, attentive, fast, and had us take a free shot with her! She was so much fun that we didn't want to leave the bar. But we eventually did. Why you ask? THE FISH TANK. Nothing says baller more than a purple-blue fish tank. I think every club needs to make it a staple decoration.   Finally, at the end of the night we were waiting outside for our friend (Arnaud, the DJ of the night), and they ushered us back inside to let us wait in the warmth even though they were closed. It gave me a chance to chat with Greg, the bouner, who was surprisingly nice and fun!  Overall, I can't wait to go back, and I wish I had enough friends to rent the place out for a killer party. Hmmmm, maybe for a future Yelp event?", 
    "review_date": "2009-02-09"
  }, 
  "6IgNz1Nl49tou_KzXKnf4Q": {
    "user_rating": 1.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Arjan P.", 
    "review_text": "The worst place ever....the floors are  bad and the customer service very poor! i was there for my birthday bash...and not the bash i expected....had gone with the limo service....we had paid everything in advance so everyone could go in free....but they made us wait in the line and pay for the whole damn thing .....music was shitty....drinks very expensive....the only nice thing abt this place.....umm i cant give it less than 1 star..dont go here ppl....they will charge u for everytime u step out of the club,,....honestly...stay away..there are much better clubs than this one.....", 
    "review_date": "2011-03-07"
  }, 
  "176KIDWfALoQRtRlKEJBFA": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "Jennifer V.", 
    "review_text": "My rating is SOLELY based on my experience with them for their New Year's Eve 2011 bash. I'd never been to Atmosphere before that, and I haven't been since. So, yenno, keep that in mind, and whatnot.  My friends and I decided to finally get off our lazy adult asses and do something for NYE because I was finally going to be in California (instead of crappy Michigan) and we wanted to enjoy ourselves. We didn't want to do a stuffy hotel party, we didn't wanna deal with a house party, so we decided to go to a club. Atmosphere seemed to be a good balance, because it was near a few restaurants we were considering for dinner that night. Also, we bought our tickets in mid-November, so they were $56/ea for open bar. Yeah. That was pretty awesome.  The bouncers were nice guys and were quick at getting folks in, and the bartenders seemed pretty good. The DJs played a good mix of music downstairs. Upstairs, though, the music was INFINITELY better. And I'm not just saying that cuz one of our good friends from high school, DJ William Wes (<a href=\"/redir?url=http%3A%2F%2FdjWilliamWes.blogspot.com%2F&amp;s=1eed3616c732db2a662bb81beee5ae3867ee2cbd6fd1163981eed8cab7f5181f\" rel=\"nofollow\" target=\"_blank\">djWilliamWes.blogspot.com</a>), was DJ'ing upstairs. We had a lot of fun dancing and drinking and overall having a good time. They also had a smoking area outside which served a friend of mine rather well; it was also nice because the smoking area was attached to a small room with chairs that got a very, very nice breeze, which provided a nice cool break from the hotness of the club.  I can see where the \"ghetto\" bit might come into play though.... I think there was less of that on NYE though because most people who spend the money to come out on NYE aren't gonna be the same types of folks who cause a ton of shit at a nightclub on a regular basis. We did, however, get to watch some dude get taken out by a bouncer, whilst in a chokehold. Did I mention the bouncer was like, 6 inches shorter than the dude he was dragging out? It was AMAZING. Haha!!  We didn't stay too late past midnight because my old lady ass was exhausted. We still had a lot of fun, though.", 
    "review_date": "2012-01-14"
  }, 
  "H18PDEJ_YcD5e86bwj01Hg": {
    "user_rating": 2.0, 
    "user_location": "Marina, CA", 
    "user_name": "Sherise O.", 
    "review_text": "Atmosphere was the designated spot for a joint birthday extravaganza.  Perhaps the party bus ride from San Jose was a fun party in itself, but I was not impressed with Atmosphere!  Maybe it's a hit-or-miss kinda place.  The bar LOOKS crowded but the bartenders are efficient which brings the wait time down, sweet.  The place, although decently sized was cut in half as they kept the back bar closed and tried to pack the front of the house.  This is a great marketing scheme but detracts from the place's potential.  The restroom is at the back of the club and everyone was up front so walking past an empty, quiet back room was strange.  Having an entirely empty back room made the place look weak.  Therefore I don't need to return.  And for smokers, you're allowed a narrow, regulated area where hanging out is not permitted. At all.  Once you finish your cig that's it, back in you go.", 
    "review_date": "2011-06-26"
  }, 
  "SXfvHWScLghzoTSBqb_e6w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Angela L.", 
    "review_text": "i gotta admit, i was pleasantly surprised by this place. i'm not much of a club person at all but i had a great time here!   my friend had her birthday celebration here and had a VIP section reserved and our names on the guestlist. we left early to  make sure we could find parking and have time to wait in line, and got there a little after 10. we were waiting in line when the bouncer came over and told our party and everyone waiting behind us to form another line, which ensured speedy entrance. that's probably one of the shortest waits i've ever had to get into a club. i don't know why people were complaining about the ID scan and quick photo, because it literally takes 3 seconds. it's also reassuring that there won't be underage boppers or shady felons inside.   the inside is huge and ventilated. two bars, equipped with speedy bartenders that still made a damned good [and STRONG] drink. the lower level was more mellow, loungy music, whereas the upstairs had more uptempo songs, as well as an additional CLEAN restroom. they even had a lady in there hand you paper towels when you finished washing your hands.   and the DJ was awesome. didn't play the same generic shit i hear on the radio everyday, lots of old school jams. he even played \"you\" by lucy pearl which got my drunk ass all OVER that dance floor, seriously.   sidenote, my boyfriend and i were in the little area where you can smoke outside and he was incapable of standing up straight, almost knocking over the barrier. the bouncer was actually pretty nice about it and didn't kick him out which is odd. come to think of it, all the bouncers and security i came across were pretty nice.  so yes, i'd hella come back.", 
    "review_date": "2008-11-30"
  }, 
  "6e0khvHCOJU1YTCx8gDfSw": {
    "user_rating": 3.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "kelli d.", 
    "review_text": "I went here this past weekend for a friend celebrating his birthday. We got a late start heading up to the city and it took us awhile to find parking. There is $10 valet type garage a few blocks away (closer to waterfront), much easier to park here then trying to get into the section right next to Atmosphere.   The line was insane and barely moving and definitely no way to make it in by 11 on the guest list. There was a group ahead of us that started out with 7 people and turned into 40 something. The line barley moved for over 45 minutes since this group became insanely large. Luckily a very friendly bouncer approached me and my friends and showed us to the front of line, very much appreciated! This saved us from our misery.  We immediately went upstairs to the second dance floor and to the bar. The bartender chick was inconsiderate. Several guys approached the bar after me was able to get drinks faster than I. I asked my boyfriend to stand at the bar next to me to get her attention and it must have worked. The bartender asked what drinks he wanted just as I was complaining to friends that the bartender is only serving guys. She must have heard since she told the boyfriend he would get my drinks first, then his.  This is one crazy crowded place. I saw a girl passed out on the floor in the stall and chicks dancing on a platform fighting. Overall the music was good and we had a fun time.. Thanks again to the bouncer who made this a higher rating.", 
    "review_date": "2011-03-02"
  }, 
  "FbZIdrA-kLXO68t-goovnw": {
    "user_rating": 1.0, 
    "user_location": "Union City, CA", 
    "user_name": "Huong P.", 
    "review_text": "If I could rate this place with 0 stars I would. The atmosphere at this venue is straight up bad news. I could smell it from a mile away. Two words: dirty and ghetto.   The whole entire 45 min that I was there, 3 fights went down.  1st fight: a cholo trying to fight this poor girl because he thought she touched him... Umm HELLOO its the freakin club. If you dont want to be touch sit ur ass at home! Ahh  2nd fight: whole bunch of who knows what...animals?! Jumping one guy on the dance floor. Foreal?!   3rd fight: I dont know what the fuck happened. But my friends were involved. All I know is that I got punched in the head by some creature and my friend got drinks poured on her. Ughhhh  Would i return? Probably not Would i recommend this place to anyone? Probably not Suck it atmosphere!", 
    "review_date": "2011-11-04"
  }, 
  "bkMtv1i0m3wYTnWjezNDIA": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Carlos G.", 
    "review_text": "Bar far the worst so called club I've been to. Full with tourist that don't know  the city. Complete sweat box. Filled people documenting the event with cameras. Last thing I want when I'm drunk is a shining light in my face. They also had a flyer that said before 11 get in cheaper but the person collecting cover charge didn't stay true to the flyer. They play POP music, I wanna hear some slaps when I go to the club. The only thing they got going for them is the fish tanks in the walls.", 
    "review_date": "2011-03-03"
  }, 
  "pWKwDWJV60tbgAnxlLGr9A": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "D S.", 
    "review_text": "The club is divided into three parts: one dance floor by the bar area right by the entrance, a lounge area behind the bar, and a larger dance floor as you make your way in further into the club by the bathrooms.   I came here for a friend's 22nd and the only areas they had open were the smaller dance floor by the entrance and the lounge area. For a Friday night, there weren't that many people. The drinks weren't that strong and the music was mediocre. Maybe I came at a bad night? The interior of the club would definitely be more of a lounge than a party-rar-rar dance club. The lights were really dim and it gave off a jazz-bar vibe. The walls looked like they were wooden. The one good thing about it was that there was no cover for us that day because a guy in our group knew someone who worked there. It's not somewhere I'd be coming back again.", 
    "review_date": "2011-02-19"
  }, 
  "lsafra7Gn8thEJij8BaxGg": {
    "user_rating": 1.0, 
    "user_location": "Union City, CA", 
    "user_name": "Heidi C.", 
    "review_text": "How the hell does this place get 3.5 stars???  I went here for a friend's birthday. It was OH-SO LAME.  DJ sucked so hard.  The first bartender (some asian dude), made a HORRIBLE long island for me. I saw him add WATER to my drink. And yes, I'm 100% sure it was WATER &amp; ICE. Thing was $11 or $12 for a small cup of Long Island. RIDICULOUS.  5 men tried to get my best friend's attention by trying to get a hold of her hand/arm. GROSS. Whatever happened to just going up to a girl and asking her to dance. Don't touch us. We don't know where your hands have been.  This place made a very bad first impression. I hated it there. The music did NOT flow together at ALL. Not even once.  The people there gave off a weird vibe.  Never going back here again. EVER. I don't care who's bday it is. I absolutely REFUSE to go here again.", 
    "review_date": "2009-04-12"
  }, 
  "1Mb_leDMNQBZ6NXEJ_vB8Q": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Annah L.", 
    "review_text": "It already seemed like a bad idea when we realized that this club didn't have a line at all and the club next door had a line all the way down Broadway.   Pros: 1. The AC is on full blast 2. They have bathroom attendants whose sole purpose is to hand you paper towels and offer you assorted mints.  Cons: 1. Floors are sticky from people who were already drunk by 11 PM 2. ONLY played Top 40 all night. WHY?!??! 3. Yeah, I'll say it: GHETTO 4. Drink sizes are small  Overall, I can't say this night is reflective of all their nights since my roommate has been here last year and she's loved it then. However, they can definitely improve the music and tacky atmosphere.", 
    "review_date": "2012-02-05"
  }, 
  "1lh8p7T6j6GRJiQ00CzXEA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Viennelyn C.", 
    "review_text": "Eh...Not my choice of venue for a night out in San Francisco. Although Atmosphere is one of the better nightclubs on the Broadway strip, it still falls short of a decent SF nightclub.   I've been to Atmosphere about a total of two times. Each time was for a friend's birthday. The good thing about this place is that there is tons of space. If you're looking to host a big event such as a birthday...then this place would be an option for you to consider.  Other than that, nothing really special. Drinks were pretty expensive, $28 for a total of three drinks. Bathroom was dirty, music was okay, super crowded and the crowd was ghetto. I don't know what it is about Broadway that attracts ghetto people.  Every nightclub and block on that street seems to be full of them.  Oh, and good luck with parking. There is a parking lot right next to Atmosphere. Convenient for your feet but not your wallet. $20 to park for a couple of hours. Not really worth it if you ask me....", 
    "review_date": "2010-11-07"
  }, 
  "8526ZJhSR9CEX-vfjSFD-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie C.", 
    "review_text": "i dont remember much. but what i do remember from the night...  wasnt happening. a little too empty for my liking. nothing special about the place that would make me want to go back.  i definitely remember the cute bartender. he even bought us a round. that's something worth remembering. haha", 
    "review_date": "2009-05-28"
  }, 
  "rqquMUC5p9HmYq9rXXQS2Q": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Maritza B.", 
    "review_text": "I gave 2 stars because I love the music they play here. The DJ plays the best hip hop &amp; top 40 hits out of any club in the city.... But other than that everything else about this club sucks. I've been here three times. Once for my friends birthday and once for my birthday. 2 of the three times i went there I slipped and fell on my face because of the wet floor that they don't clean! Not because I was too drunk. I never have fallen at a club or bar other than here. This last time I went, was for the free artist show and I went to go see one of the artist. He promoted the event and got a bunch of people to come and watch him perform. Probably 20 people came just to see him. They promised him a 20 minute set and we were waiting all night just to see him perform. Came down to 1am and they ended up saying they couldn't have him perform because the club didn't want to give that much time to a new artist that no one knows... Which made no sense because we brought most of the people there and when we found out half the club left- After i spent $40 on shitty drinks. Basically their shady business. Don't mess with ICU Networking ENT. They don't keep their word and their totally sketchy. Never going to that club again.", 
    "review_date": "2013-02-22"
  }, 
  "nJ4OL4_yR4o3wzJcmBiXog": {
    "user_rating": 1.0, 
    "user_location": "Santa Fe Springs, CA", 
    "user_name": "Rema G.", 
    "review_text": "Dirty bathrooms Sticky floors We bought a bottle of belvedere, but we believe it was mixed with water or something else. We could barely taste the flavor of the vodka, even with an 80% mix.  Rude bouncers The name does not live up to itself Ghetto  Never again!", 
    "review_date": "2012-06-03"
  }, 
  "_KDforIDsQS6bIaJi0_V0g": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Elysse P.", 
    "review_text": "GHETTO.  And that's all there is to say about that.", 
    "review_date": "2011-06-14"
  }, 
  "3cnIyELXdZa9C9nFH5NXtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veasna H.", 
    "review_text": "Rating night clubs in SF is always a difficult thing to do because there is this expectation that in a big city you want these big Vegas style clubs, but that's really not what SF is about.  There is a land crunch in SF, so almost any nook of space could be turned into a bar/lounge/night club.  What really matters to people out here are music and crowd.  With that being said, people's tastes change all the time...  If you are in a hip hop/top 40 mood and just want to dance, Atmosphere is a great spot for that.  It's a natural layout for a dance floor and offer plenty of space.  The music was also on point.  Not too much of that EDM stuff that you can't really dance too.    Bartenders and staff were friendly and are pretty fast, considering the amount of people at the bar.  Crowd was okay, a good mix of people.   So if you are looking for that type of club that plays current hip hop and top 40 and just want to drink and dance and have a good time, Atmosphere is not a bad choice.", 
    "review_date": "2014-12-08"
  }, 
  "RKUWxfF2kIMuvDREbCHWBA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Karah S.", 
    "review_text": "had a great time here! the staff was super friendly and the music was on point. bottle service was amazing and very affordable! highly recommend!", 
    "review_date": "2013-06-27"
  }, 
  "_gn_iXnslPT6rEG49908tA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jodi J.", 
    "review_text": "Was referred to this club by another bar. Went in and was asked for a 15 dollar cover for 2. We started walking away and the owner got us in free. It was slightly dead when we arrived at 10:45 but was super crowded by 11. Huge place, but only on Saturday are all the floors open. Bar service was fast and they had a drink special. Music was good. Top 40 mixed with some old school jams. Dj was hot and looked like he was enjoying himself. Crowd was a mix, mostly tourists. All of the women were dressed in tiny dresses and everyone was dancing. I think this is a great place if you go with a group and just want to dance and have a good time.", 
    "review_date": "2012-04-14"
  }, 
  "y8jGUyVXaTgOPZujogCvDw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Runa T.", 
    "review_text": "I was here for a birthday a few weeks back. In the 3 hours that I was there, I saw 2 fights.. During the first one, I was shoved and almost fell. Smh. Also, many of the girls here just mug all day! What gives! What are you here for!?!? Just to judge all the other females? Jeez. Get a life. Go dance! Go do something other than try to cause a fight or make people uncomfortable! Ugh. Never coming back here.", 
    "review_date": "2014-04-09"
  }, 
  "59QzQ3-dmOD1USV2hQpwkw": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "Leo K.", 
    "review_text": "The time I went to see Nas in North Beach on Sunday at Atmosphere was great...except for the fact that it was Sunday, I was in North Beach, and Nas never showed up.", 
    "review_date": "2011-04-14"
  }, 
  "YfwBiRftj-mMTW5XZBNFmw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Karen L.", 
    "review_text": "I'm not picky about my clubs--as long as they are spacious, have acceptable decor, have a good area to take a breather, and serve liquor, I am happy. I actually really like this club. Perhaps if I didn't have a good experience, I'd rate this place lower, but I had a great experience, so that certainly helps. It was apparently ladies' night when we came here (and it certainly was a ladies night for us this particular night!) so the ladies got free champagne. The champagne wasn't bad, either, though my fellow lady friends didn't like it and gave theirs to me (more for me!)--I reckon they are the vodka and Patron types. I like that there is a lounge area, and then a large dance floor area, which you enter by going up some stairs (a bit difficult in stilettos... and maybe with a drink or two in your system).  The dance floor area is super spacious, and that is a definite plus in my book. The music was, of course, of your typical top 40s hits, so it was alright. The bar experience was also good--we didn't have to wait too long to get the bartender's attention. However, because we were a group of girls, guys kept trying to get in on the action! That was slightly annoying, because I hate creepers, but we simply just danced away, and we still had a great night!", 
    "review_date": "2010-11-10"
  }, 
  "2KcDZEeBiBi7XcfSPZLWDw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam P.", 
    "review_text": "It's the old Zebra Lounge, nothing really has changed inside except the name!  Went here this past Saturday with 10 of my girlfriends.  Getting in was easy (of course with 10 girls).  Rooms are set up great. Small room/bar in the front room, with a side VIP lounge and then upstairs a much larger room, with more VIP tables. Bartenders were cute and poured generously only peculiar problem that we found out was the bartenders charge differently from upstairs and the downstairs bars. Weird, considering it was the same exact drink (I noticed another Yelp reviewer noticed that too).  Get your act together guys on your bar pricing!  I mostly go to clubs with the main purpose of getting low and really dancing, the dee jays were pretty bad.  Both rooms kept switching from more fun popular hip hop, to old school slower hip hop and then threw in house music.  It just didn't quite flow together to keep you moving.  Got great drinks and then moved on to another club that night.  I'd probably go back to check it out again in a few more months, perhaps after the dee jay figures it all out.  Oh...for all the ladies out there, the bathrooms were SUPER clean.", 
    "review_date": "2009-02-01"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Get DRUNK, I mean \"Drink\" for a Cause? I'm so there...  Let me preface by saying that I do NOT like partying on Broadway; too many Po-Po's, the crowd tends to be rowdy and ghetto and parking SUCKS.   I've come to Atmosphere/A3 about 5 times for clubbing events but last Friday was the very first time I actually had fun at A3 BEFORE the club even opened!  On February 4th, my friends and I came for a \"Drink for a Cause\" Happy Hour Event hosted my mPowering from 6 PM-10 PM. Since this was a charitable event, the crowd were Young Professionals in their late 20's to mid 30's, mainly Asian. This is of course is not representative of the typical club night there which was very refreshing.   There was a DJ spinning Top 40s, Hip-Hop and Mashups. Not sure if it was the alkie, but my friend and I couldn't help but comment about how good the music was. Needless to say, after 1...2...3...4 drinks/shots later, one friend ended up on the stage, one doing \"The Sprinkler\" and the other doing \"The Lawnmower\". As for me, well let's just say, I was ready to throw my own Trampoline Party until my inner voice of reason told me this is a \"charity\" event and NOT your typical Saturday night of debauchery. :T  Again this \"Drink for a Cause\" HH Event is not representative of the typical club night at A3, so here's the nitty gritty. First and foremost, the crowd and music varies depending on who's promoting, so make sure to check the calendar on A3's website.   C O V E R:  FREE before 11 PM if you're on the Promoter's GL, otherwise it's $20 at the door.  L I N E: Dependent on the Promoters and how large of a crowd they can draw in, but I've never had to wait in line more than 10 minutes.  D R E S S  C O D E: Club attire; no sports wear.  C R O W D: Varies; but I've only come to A3 for Asian hosted parties which currently occurs the 1st Saturday of every month. I haven't been to one of the Asian parties here in over 8 months, but the crowd tends to be the same for this promotion company; early 20s to mid 20s and on the fobby side.   M U S I C: During the Asian hosted parties, they only play Top 40s, Hip Hop, and Mashups.  B A R S: There's 2 bars; one in the front room and one in the main back room with 3-4 (non-friendly) bartenders working at each bar.   D R I N K S: $9 for top shelf cocktail and shots. No CC minimum.  Drinks are inconsistent. On Friday, I had 4 Goose Club Sodas and 2 of them tasted like plain Club Sodas.  T A B L E  S E R V I C E: *Bottles start at $150 and need to be book in advanced through the Promoter or the the club *Front Room - There are about 4 tables for bottle service which is in a more semi-private room *Back Main Room - There's 3 booths for bottle service that overlooks the dancefloor  A M B I A N C E / D É C O R: Modern industrial warehouse...  The semi-private front room has exposed red brick walls and a beautiful illuminated fish tank. The front bar area has a pool table and a small dancing area.   The main backroom is more like a big open warehouse space so you can mingle and dance. There's also a stage in the backroom where you're free to dance on BUT just be careful going up/down the stairs. The ventilation is very poor in the back room when it's crowded.   WARNING: The floors are very slippery when wet so ladies be careful when you're strutting around in your 5 inch stilettos.   R E S T R O O M S: The front room has one stall for men and one stall for women. The back room has 5-6 stalls for women. There's normally a bathroom attendant so the bathrooms are normally well-kept except sometimes they're out of toilet seat covers.   P A R K I N G: HORRENDOUS! The nearest lot is 2-3 buildings away near Sutra. Weekdays is $15 and Weekends is $20. The lot normally fills up by 10:30-10:45 PM, so try to get there early.   If it weren't for the fact that my friends and I had a blast during HH, A3 would be getting 2 stars. Apparently, we had so much fun that we met several people at Bubble Lounge later that night that said, \"Hey, I saw you guys at A3 for that HH...\" while we had NO recollection. Yes, welcome to our HHs!", 
    "review_date": "2011-02-08"
  }, 
  "cowU-HmtSkvUuu89poykBQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Leilani N.", 
    "review_text": "This place reminds me of Facebook or MySpace when you see someone's picture and they got you thinking \"Damnnnnnn.\" Then you see them in person, and you're like \"wtf?\"  Atmosphere is a lot dingier than presented online, and it really sucks when they don't open their second dance floor because the first one is cramped. This isn't a good thing considering the booty hounds here. I know, I know...You're thinking \"But there are booty hounds at every club!\" While I don't doubt that, I must say the persistence, aggression, and sheer perverseness of their faces definitely set them apart here.   There was little to no wait at the bar and the bartenders were nice and friendly. Their music was okay (the usual popular radio stuff). But this just doesn't cut it. I would feel utterly ripped off if I paid to get in this club. And I'd feel betrayed if I drove all the way to sf just to go here.   Maybe it's better on special event nights? Who knows.", 
    "review_date": "2011-01-15"
  }, 
  "6EEahE0XQlsSL7ADPaaGWw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ekaterina Z.", 
    "review_text": "I went to Atmosphere for salsa dancing on Sunday nights. Last time when I came therewith my friends, we had fun and when the club was about to close at 1.30 am secutiry guards asked us to leave. I asked them to wait 2 min since I was putting my shoes on. Instead in very rude manner a security guard lifted me up with his hands and throwed me outside to the street! Then they throwed my stuff (purse and clothes after me). they have taken my money (cash) from the purse. I have not found my cash there after they throwed the purse after me.  I was in shock! nobody in my life has ever treated me this way! I was staying outside for next half an hour requesting to talk to general manager. they told me I had to leave. I called the club several times trying to talk to the manager, but without any success. I left voice mails many times. nobody has ever called me back. I came to the club many times trying to talk to the manager but she is never there! And security guards dont let me in any more! I wanted to talk to the manager and explain what happened.she has to change her security guards. those rude people should not work there!  but seems like she does not care. I dont reccomend anybody to go to this place!", 
    "review_date": "2014-08-14"
  }, 
  "cAAx3OBuZQ5Gw4etW3CPfg": {
    "user_rating": 4.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Mary S.", 
    "review_text": "Always playing good music. First floor is pretty small and most people are wall flowers. Second floor is awesome! They have a stage so I usually go up there with my friends to dance and get away from the pervs.", 
    "review_date": "2012-03-28"
  }, 
  "W-k23QYJjbWmieyH6sWAMw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deanna G.", 
    "review_text": "I wish I could've enjoyed you more! A friend got bottle, so we were in the second floor in the back.. with the red rope service! We really thought it was great til it hit 1130 pm and the security guard began letting any slutty topped girl through the ropes and the VIP area was packed. The hell! What happened to the wrist bands buddy? You get an extra star for the huge dance floor. You are too whack though for no in and out accessibility. You have everyone and their momma jammed packed in the smoking area pushing over the railings like a hippo in a ballerina tutu.", 
    "review_date": "2010-03-06"
  }, 
  "lXKjU1d7uy4aG0c5dNTATw": {
    "user_rating": 3.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Mika D.", 
    "review_text": "Went here on a Saturday night for drinks and to meet with friends. Typically, not a place I'd go as a club/venue choice. The open space was nicely used as their tables/bottle service is privately tucked in another room, away from the dance floor which I liked. The music was okay and the crowd is mostly Asian considering it's right in between Chinatown and North Beach.   They do have coat check, a large bar and a larger dancehall in the back where the restrooms are.   Not sure if I'd come back here again, it was cool to experience the North Beach club scene for a change.", 
    "review_date": "2010-02-09"
  }, 
  "AIPP8x9W-4-szE87dHwvkA": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Triston W.", 
    "review_text": "I am ridiculously late in writing this...as my group and I went back when Common was in the building and performed for a little bit...    We had a great time!! The bottle service was on point, and the overall accomodations provided by the staff were well worth coming back.  Music was good, drinks were cool too.  We'll definitely be back...", 
    "review_date": "2011-10-20"
  }, 
  "2HjKeEJPFK4fqTkaIq5VOA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica H.", 
    "review_text": "Ghetto, ronchy dancing crowd. Are we at east Compton's high school dance? I guess it's what to expect on Broadway. As for the venue, the set-up's alright, the bartenders don't look like they care to be there, and the DJs again played music that I would hear at a high school dance. The well cocktails are some of the worst I've ever had. I guess you can't ask for much at $6 a pop. Probably won't be coming back.", 
    "review_date": "2013-05-12"
  }, 
  "ZXlBdMllPMEUr0C14vH3ZQ": {
    "user_rating": 3.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Isabella O.", 
    "review_text": "My first time at \"da club\" in San Francisco... I'm more of a gritty bar person, but I thought I'd have to check one out eventually.  I took a star off because their \"guest list\"  thing wasn't working on the website, I'm not trying to pay $15 to get in.  I even emailed them and got no such response, so I had to cough up the money upon entry ANYWAY.  Lame.  The music is the typical club music, the guys are the typical creepsters (although they were SUPER short the night I went... I'm 5'6\" and was wearing 4\" heels, towering over those slick haired boyzz). Also, there's this HUGE mirror on the 1st floor... got really dirty when those H-Rats were grinding up on it, hilarious.  Overall: The drinks weren't too expensive, quite strong actually.  The neighborhood ain't all that... Not sure if I'd come again, maybe for another birthday or special occasion.", 
    "review_date": "2010-12-26"
  }, 
  "jkiinjUy8RUZKzW5gBpXNg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Quinn S.", 
    "review_text": "Atmosphere is a joke, and if you fall for it, shame on you.    We were on the guest list and were told free entry and free Patron before 11, so we headed over a little after ten.  Great gimmick, since they clearly weren't letting anyone in until 11.    The line, which wrapped around the building, never moved in the 15 minutes we waited before giving up, except when other people gave up and left.    With pathetic, deceptive business practices like this, I really hope this place fails miserably.", 
    "review_date": "2008-10-20"
  }, 
  "Wtyshwguv-DEyWq7kTCy_g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mai L.", 
    "review_text": "I went here for a friend's birthday last weekend. I was a bit irritated about waiting 30-40 minutes in line to get in and about the 20 dollar cover. But wooow was it worth it!  As soon as I got in, there was a coat check. I went straight to the downstairs bar, no line, and got the drinks I needed to have a good night. The club was spacious. They had the downstairs level which was more chill and then the upstairs level had the hip hop floor. It was packed, but good packed. Plenty of room to dance, and it was definitely poppin! I loved the mixes the dj was spinning as well. The wait was not long to get drinks upstairs either. The bathroom wait wasn't bad either. My friends and I had a blast. Definitely hit this club up if you are in North Beach!", 
    "review_date": "2010-03-11"
  }, 
  "u_H9oU4wuXLXzuXOz4XkQw": {
    "user_rating": 4.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Iesha S.", 
    "review_text": "The good: So went here for my birthday and decided to get bottle service, let me just say bottle service everywhere is over rated however the women who is in charge with booking the service is incredible and will work with your budget! Plus they have THE cheapest bottle service prices in SF. The bathrooms are very clean and have a restroom attendant which makes things a bit awkward but they are extreamly helpful. The music was great! They play exactly what they have posted on their website events. Outdoor parking garage near by $15 bucks from 10pm-2am. Plus two pizza parlors directly next-door ; )   The bad: Club is rather small. There is a larger open area upstairs however, downstairs is very crowded.", 
    "review_date": "2013-04-14"
  }, 
  "TMr5z8JDuGPc0I-5WfpBMQ": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Liz W.", 
    "review_text": "I loved this place...why does it have such a low rating?  I've been here twice now, and both times I've had a blast.  The drinks we had were great, and the bartender was really nice and friendly... the dancefloor upstairs is always such a blast!  Love the little stage-ish platform area they have where girls can get up there and dance.  although some girls should not be allowed up there.... better than nothing!", 
    "review_date": "2011-05-29"
  }, 
  "ltb_FEBEf2-PuPqQQ4aSHg": {
    "user_rating": 4.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Tina T.", 
    "review_text": "Did I go to the right club? Or am I just really not picky?  I came for Ma$e last night and had a really good time. No one got bottle service except a couple groups so the other tables were open to sit around on and rest our feet. Music was really good (hip hop thank god. None of that EDM crap) and the dance floor was pretty big (and packed).  Only few down sides though were that drinks were slow and spensive and seriously what is UP with some of the females here? Catching HELLA attitude for no reason. Lighten up people. Life is not that serious!  Oh and PS, I was sober and still enjoyed myself so I feel even more odd writing a four star review amongst these 1 stars.", 
    "review_date": "2014-11-09"
  }, 
  "x1paA3aUHJTurbtFkBSOGg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiff C.", 
    "review_text": "Weird layout... I can't knock the spot based on the promoting group the night I went there so.... I'll try to play fair.  The place is okay, there are two bars, one in the front when you first walk in and then one in the back where the dance floor is and I'm guessing the main room of the venue.  There is staff in the bathroom which I didn't expect at a venue like this one..  Drinks were decently priced and not too skimpy like other places on Broadway.", 
    "review_date": "2013-02-20"
  }, 
  "Fv_u3q-SF-FKcbUXTyc6xQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Krystyl B.", 
    "review_text": "OMG! Is all I can say.  Jannos, Bennett and Karen = rockstars!  Super sweet, helpful and everything I could hope for.  Recently held a charity event that was held globally in over 250 cities.  Although our event was small this year, they helped us with everything from sound, to event staffing and more.   They have a great space, and amazing owners.  You can't go wrong when looking for a venue for your event.    Love these guys!", 
    "review_date": "2011-03-30"
  }, 
  "K5qQ09PsbW2Pscaf1fkmfA": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Scott B.", 
    "review_text": "This is one of the most ghetto clubs in the Bay Area. If the 30 cops waiting on standby out front (and all up and down Broadway) don't give it away, the crowd definitely will.   What's worse is, I showed up tonight trying to meet some friends, and the pre-door guy told me I couldn't come in with the shoes I was wearing. Online it says club attire- no sportswear. I was wearing $300 Diesel boots. I'll admit, I was wearing them out (pant bottoms inside the boots), but I promptly pulled my pants over the boot tops making them look like leather dress nice shoes, and the guy still said \"NOPE\". Like... you can't fool me with those nice shoes- I KNOW you're wearing boots under those pants.  I also had previously asked the actual door guy if they were passable to get in and he said \"yes, they're fine\".  After visiting another bar and coming back to get my friends, 2 fights broke out and people were taken away in handcuffs.  I suggest avoiding this place at all costs, if not for the club itself, but for the people that go there. You might swiftly be dragged into their world.", 
    "review_date": "2014-03-23"
  }, 
  "m9xPOrdllT14YsZIgr-LHA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yi Z.", 
    "review_text": "An upgrade from the old spot for Sunday Bachata night.  For sure more space and more modern looking, oh and the restroom is cleaner and more spacious as well, at least for the lady's room.  Not sure about the drinks and such since I do not drink.", 
    "review_date": "2012-11-10"
  }, 
  "KTs38V5KZE7HLoSaq1vrKw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chia C.", 
    "review_text": "I had a good time at Atmosphere. My BF is not into North Beach, or prissy bars and clubs and even he had a good time. The DJ is hilarious, if you're looking for a good laugh (ever seen a DJ leave the booth to hit the dance floor because he is feeling his own set THAT much? This DJ did it every other song - it was hysterical.) The bartenders are great - especially Jay. He pours a great drink. He makes a Jay Special for the ladies, and different one for the guys. Both are great - pink and fruity for the girls, coke based and strong for the dudes. Ask for a Jay Special, just make sure to TIP HIM WELL! He rocks! I read a few people had trouble getting in for various reasons - I got to the club at 11ish, and had no problem with our party of 2 chicks and 2 guys - no cover, hardly a wait (maybe 10 mins). I would definetly go back to Atmosphere - I'd never pay more than $10 for any club, even Atmosphere - I honestly don't feel there's a reason to, especially with so many options in a big city like S.F.", 
    "review_date": "2008-11-04"
  }, 
  "VSRtEK_c84oJygZ0OX0Oqg": {
    "user_rating": 2.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Steve C.", 
    "review_text": "This place is kinda scary. Cover's not worth it. Last time I was there there were some local rappers that were performing for a while. I don't think any of the guys had a future as the next lil wayne. It was a saturday night, and the place was empty. The front room is nice though. Spacious.", 
    "review_date": "2011-03-07"
  }, 
  "S2fMpooI1l3HvSCDI94j7w": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Zito R.", 
    "review_text": "situated at the heart of strip club alley. when you get inside, the place has 2 levels the back is for the VIP and the dance floor. the front is more for a bar type feeling. the music kinda started slow. the music downstairs was better than the upstairs. the floor looked old the bathroom looked old. it's time for them to remodel. mind that we were on bottle service. the VIP was probably the only nice spot that it had. nice comfy couches but with the looks of the place i won't trust it either. i probably give it a second shot  oh there was tons of dudes that night and my home girl almost got kidnapped. if i didn't happen to find her. outside is not much different. there was fights left and right. do not stay in this area for longer than 30 mins. you're asking for trouble", 
    "review_date": "2010-08-18"
  }, 
  "RoA9mDVDKEwsdNrH4MH3IA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Naka A.", 
    "review_text": "Right across from Apartment 24, Atmosphere is a nice lounge (not big) to just kick back with friends, but I wouldn't go there to dance, hence the 3 stars. The music on the first floor is better, or maybe because I prefer trance over rap. As for the cover charge, I don't know how much the cover charge is or how that works, we were on the guest list for an event.", 
    "review_date": "2008-12-21"
  }, 
  "F08gr8rwyB0J4FfnQG0zqQ": {
    "user_rating": 1.0, 
    "user_location": "Washington, DC", 
    "user_name": "Jennifer S.", 
    "review_text": "A few days before the event, I was having a discussion with a friend  about why she hates going to clubs in North Beach and much prefers the laid back bars of the Mission. I was open to fun anywhere though. Certainly, I've had a good time at Dragon Bar before.   But, damn, Atmosphere does not know how to keep a supportive clientele. Went to their \"Grand Opening Party\" on Saturday 10.18  - same night and same sad story as Quinn &amp; Chefboyardee. I was really looking forward to checking out the new place from the 3 reviews I read here before going and knowing a bunch of my friends were also going to be there and the supposed free Patron!   Waiting in the cold for an hour (my mistake but that was because friends  were inside - apparently decided to skip the long guest list line and just pay the $20 cover) for a club so empty it couldn't warm me up was not how I had envisioned my fun night out. Mostly, what aggravates me was the lying and/or total lack of communication about why they were taking so long (apparently it takes more than 10 min to check for a person's name on the guest list) and what their cover charge was going to be (free - $10 - $15 - $20- your first born). I was also creeped out by the swiping of my driver's licence and taking of my picture before being allowed in - rather big brothery...  Could've been the mood all this put me in before getting in there but me (who normally likes dancing anywhere to whatever music - even Target to the embarassment of some companions) couldn't feel enough in me to do more than bob my head and pity the poorly-outfitted gogo dancers. I hate to be a negative nelly so, at least the drinks were well-poured and there was actually no line for the women's room!  After the debacle of Atmosphere, I have joined in my friend's distaste for North Beach's stripe shirted-hair gel-wish they were smart enough to be frat boys and the panty-showcasing hemlines (I kept wanting to ask if these girls knew their underwear was showing and to help them pull down the dresses). I may give North Beach another shot some day (when I miss seeing the Sheriff's bus battling it out with the party buses) but I can't go back to Atmosphere. Hope you have a better experience if you try it!", 
    "review_date": "2008-10-21"
  }, 
  "cFBkW7o2GnXtS1vpfWtK_w": {
    "user_rating": 3.0, 
    "user_location": "Richmond, CA", 
    "user_name": "John A.", 
    "review_text": "I recently went here to check it out. It was OK during the time I went there. I went on a normal night they had some stuck up girls there just trying to dance I got used to hearing No that night lol.This place is big but the time I went they only had the 1st dance floor open. So my friends and I said Next Club! lol lets just hope my next experience is a better one. until next time I guess.", 
    "review_date": "2009-03-08"
  }, 
  "T1onvez6kj1aKChjFQCTOQ": {
    "user_rating": 2.0, 
    "user_location": "Tracy, CA", 
    "user_name": "Robert R.", 
    "review_text": "Scenario: Barrister's Ball (aka Law Prom) and we're all dolled up.  Product: Drink prices were okay, as in not quite to $10.  The place was very swank with a dance floor upstairs and down.  Unfortunately, the upstairs wasn't open right away so it got pretty crowded early on.  Service:  No beer on tap.  Really?!?  The 'tenders did seem to hustle pretty well.  Atmosphere: The private part of the ball was nice.  Once opened to the public the collars started popping.  The neighborhood is Broadway, or is it broad way, as in a bunch of drunk broads, smoking, wearing baby doll dresses standing in your way in the middle of the street as you try to fend off the strip joint reverse-bouncers.  Uniquity: Moral of the story, wherever Barrister's Ball is, it's fun.  If you like fancy clubs check this out, but if you like plain old cheap beer dives like I do then there are plenty of better places just a couple blocks away.", 
    "review_date": "2009-04-05"
  }, 
  "iIQx9XCpNZHqPvhL4Cp1rA": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Goldie L.", 
    "review_text": "I came to thisplace at 11:03 pm and guestlist closed at 11:00. While other clubs would charged the full cover (usually 20 dollars), this place kindly let us in for free.  That alone earns them 2 stars! I am a fan of hip hop, which was the type of music that was playing at that time (Friday night). Plus another star! Atmosphere had the friendliest bartender and bouncer I've ever met. One more star for that! Total of 4 stars.  They had a pool table but it was covered up the whole night. I'm not going to take away any stars because the table served as a good place to put down my drink while I was dancing the night away...", 
    "review_date": "2010-03-26"
  }, 
  "XzuGe_Q2b955aZQRHpSjRQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Pauline L.", 
    "review_text": "Good lounge and space for a low-key party, though not necessarily for a crazy night out.  If you want wild, hit up one of many strip clubs next door along this street.  Either way, I give props to a venue that will host and support a non-profit organization event.  I came here last Friday for an SF Philanthro Productions event called \"Ripple\" <a href=\"/redir?url=http%3A%2F%2Fsanfrancisco.philanthroproductions.org%2F&amp;s=b389a69fdc4cec982549fd049e03d3c63f9282e7236c0a8a78a5d2b461653151\" rel=\"nofollow\" target=\"_blank\">sanfrancisco.philanthrop…</a>.  The space was set up with a huge Philanthro backdrop near the entrance and large LCD projectors in two rooms highlighting slide shows for the evening's cause (Kiva).  Pretty accommodating for a club.    Two bars and three rooms - 2 dance areas and 1 lounge.  The venue is minimalistic with some abstract art decor on the walls and in the bathroom stalls.  Music bumped a variety of hip-hop and early 90s - as in old school Madonna and Michael J.  I'm not sure if the DJs were from Philanthro or Atmosphere, but they rocked the house.  A sore note of the evening - one of the bartenders was pretty rude and ignored me for a good 15 minutes, which is a factor in the average rating.    Parking in the North Beach area, especially in the street, is a pain.  I save myself the agony and always head straight for the Parking Garage on Vallejo.", 
    "review_date": "2009-02-08"
  }, 
  "gjQ00L18PvAV450ZOfqYng": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Braden K.", 
    "review_text": "i don't like giving less than 4-star reviews.  like any other spot in SF, cover was 20 after 11 because we missed guestlist. parking was a pain in the ass because its on broadway st.  got inside and there were females galore.. then after about 45 mins the place was packed with fellas? smh. anyways, the drinks were strong enough and relatively cheap for a spot in SF on broadway... sutra closed down, I hope they don't take advantage of it and mark-up prices.  the honeys were bangin, everyone we came with was getting their sweeerve on, but i don't remember anything special about the DJ spinning that night. for $20 cover, you can take your crew over and see some showgirls' skin if you know what i mean.", 
    "review_date": "2010-09-05"
  }, 
  "Ve6Yq7F9Chf8N0JuJ7cQ2g": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jocelyn C.", 
    "review_text": "So, I've been here before when it was Zebra Lounge. Now that its Atmosphere, its way better.  They have a big dance floor upstairs with a stage. They also have different music playing as down stairs.I like the color combinations of purple, blue &amp; pink lighting. Downstairs, they have several seating areas for bottle service. I can't say how much the drinks &amp; how well they made it cause my friend was doing bottle service but I can say It was my first time at Atmosphere &amp; bottle service SUCKED! Make sure your server is doing his/her job if you decide to do bottle service.", 
    "review_date": "2012-07-28"
  }, 
  "jlafaE37kwj1jVAkJ6emtg": {
    "user_rating": 1.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Candy T.", 
    "review_text": "-don't like any clubs on this street -only been there once and once is enough -was a slow night and the crowd was ghetto and the whole place seemed dirty", 
    "review_date": "2010-01-05"
  }, 
  "zpjCezhFtGI0vXEfI4Ni2g": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Monique F.", 
    "review_text": "If I could give this place less than 1 star I would. Here's why..  Was on the guest list, still had to pay $15.  Ordered a drink, was told it was $8, gave the bartender a $20, only to receive $7 back. Then was totally ignored by the bartender when I wanted to get my other $5 back.  Music was... ehh... I know being retro is cool right now, but all of the songs being played were ones you'd hear at any of my high school dances...  Overall I don't think I'd go back. I'd rather spend that $28 elsewhere...", 
    "review_date": "2009-02-27"
  }, 
  "q29DsL5xmpdV42bJ6XLkBg": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "joanne d.", 
    "review_text": "K first of all DON'T love Broadway, because non SF locals come here thinking its Hollywood. BTW, it's NOT!!   K the first time I came here. I did NOT love it! The second time was even worst! (Although both times I came I didn't have to wait inline and just walked in) But the bouncer the second time I came here, was trying to be hardcore by ignoring me because I made a funny comment. Come on take a joke and smile, cause your job isn't really that serious! Were you that picked on in HS?? LOL Then the music was horrible. Sorry, I'm not a Dance or \"Fist Pumper\" kind of girl. Then the wanna-be Hiphop room was just a big hallway where people are constantly shoving and passing through to get to the Dance room. And they weren't even playing hiphop the whole time. Also NO ONE says excuse me or sorry here. (Douche Bags and Douche Baguettes)   The best part of the night though was this HUGE framed mirror where people kept thinking it was an opening to get to the other side of the room. I swear I cried from laughing, cause people REALLY thought, even though they were face to face with themselves, trying to shove me away to get through, thinking it was a opening. That was the best part of that night. That's for the 1 star!!", 
    "review_date": "2009-07-29"
  }, 
  "emJtL3gEv5xceUSVVK76Zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John N.", 
    "review_text": "Went on a Saturday, was on g-list, made it in fine, had a good time, music was just so-so.", 
    "review_date": "2010-03-13"
  }, 
  "hLGJeXpZI8S-rCMIa2_M2w": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Marie D.", 
    "review_text": "I did my research ahead of time by checking out the reviews.  Well turns out I ignored all of the bad ones and went to the club anyway because Chrisette Michele was \"performing\" there and I thought \"this can't be THAT bad.\" WELL IT WAS. This place is a full out CON.   Here's why it SUCKS ass:  1. I received an email from the club saying that on Thursday May 7th there was going to be a \"Very special performance by Grammy Award winner Chrisette Michell, also appearing Jamie Foxx and Day 26 (Making the Band).\"  CON - I called ahead, I emailed, just to make sure... They confirmed Chrisette Michell was performing. Did she perform? NOPE! It wasn't till about 12:30 AM that she got on stage after the announcer said \"here's what we've all been waiting for!\" and she said\"thanks for supporting me and my album\" and said a couple other words for about a minute and that was ALL. She got off the stage and a bunch of local rappers got up and started goofing off.  No Jamie Foxx - total lie to get people to come.  No Day 26 but who cares about them! haha  2. \"Free guest list before 11 pm\"  CON - We were on the guest list and got stamped outside as being confirmed. At about 10:30 we got in the FIRST set of doors.  Then as we were about to go inside, a new lady said \"What's your name? Oh you're not on the guest list\" and I said \"Well how did I get this stamp on my wrist then? I saw my name on the list\" and she goes \"Ok, well you're not on the list. 10 dollars each.\"  So apparently they decide who they wanna charge and how many \"different\" lists they're going to have.  What's the point of getting on the list if they are going to screw you over?  3. The pictures on the website portraying a new, cool club, with nice lighting and sexy \"atmosphere.\"  LIE! - This place is SUPER lame inside. There are two levels and the first level is not impressive at all.  Their fish tank was about the only thing I liked. There's paint chipping. The floors dirty. The lighting sucks - WAY TOO BRIGHT and awkward. And above the fish tank they just put some weird slab of wood to make it blend in with the wall. SUPER tacky!  Upstairs was a larger room for dancing... It was OK. Bathrooms had attendants in them trying to help you dry your hands which is unnecessary cause the place isn't even nice.   4. The drinks were OK.  They were pricey. My boyrfriend liked his rum and coke.  But my drink was WEAK.  5. The people there were all too trashed to realize how stupid this place really is.  6. Creepy old guys standing off to the side eye-f*cking girls...   7. Had maybe 2 or 3 good songs that played between two hours  8. Place was never PACKED and when we left at 12:45 AM and there was still a HUGE line to get in.   9. Bad location.  Trashy area.  Not at all in the cool parts of North Beach.  10. They treat their club like we're in Hollywood.  Frisking people.  Taking EVERYONES photo as you get your ID scanned.  5 or more bouncers with ear pieces. Come on. It's not that serious.  So overall, they have a big ol scam going on here.  They're making major moola off drunk people's stupidity to come here. And unfortunately non-drunk folks who bought into the few \"good reviews\" and the pictures - that'd be me! ARRRRRRG!    Save yourself the money, time and annoyance - GO SOMEWHERE ELSE.", 
    "review_date": "2009-05-08"
  }, 
  "2sVdJp360sdA7rPBEgnPqw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Brian T.", 
    "review_text": "My tweet to DJ Tina T during NYE while at Atmosphere:  @djtinat why is some fat asian guy dj'ing at Atmosphere and not you?!?!  Her reply to me at the end of the night:  @briant***** hahahaha! Happy New Year :) Hope we met at some point tonight.  1) She didn't answer my question. I still to this day don't understand why a fat asian guy was DJ'ing on the second floor while I saw DJ Tina T just standing there in the back. I really wanted to see her do her thing while I was still sober and coherent. I didn't pay for bottle service to see some unknown dude push play on his iTunes playlist!  and 2) I really wish I did meet her that night because she is damn cute!  My NYE night here was full of questions just like the one I posed to DJ Tina T...  \"Why is the line for the people who purchased bottle service moving slower than the super long general admission line?\"  \"How come there's a couple dressed up like Adam &amp; Eve just standing there and not doing anything?\"  \"Why are the balloons for the balloon drop only situated on the far end of the room?\"  \"Why is the venue so small?\"  \"How come there's no House music being played?!?!\"  Fortunately though, even with all the negativity floating around in my head, I had a phenomenal time! Karen and Marissa were excellent hostesses. They were prompt with all of our requests and were extremely nice and accommodating. The crowd was very diverse, which is a huge plus in my book. The people I met were really friendly and I had no sightings of any douche-baggery being committed by anyone. My friends that I hung out with...what can I say...I wouldn't want to have spent NYE with any other group of friends! It was definitely a memorable night!  Now if we can take all the positive things and put them in a different venue and call that place Atmosphere as well, then we're onto something!", 
    "review_date": "2011-01-04"
  }, 
  "jW24T6R4_lSFUXQZEe2Jzg": {
    "user_rating": 2.0, 
    "user_location": "Russian Hill, San Francisco, CA", 
    "user_name": "Nick R.", 
    "review_text": "You ever meet someone who seems like they would be a great person from pictures but once you get to see who they are on the inside they are just worst person? That is how I felt about Atmosphere.   The legitimate conversation that happened before trying this place. I heard they get major hip hop performers to perform there and its actually hip hop in SF!  Is it worth dealing with the people? Well its located near some other bars so maybe we could save the night! Is it worth dealing with the people there? Well we are already walking there so its too late now.  Still is it worth dealing the people there? It wasn't.   The crowd at Atmosphere just kind of makes you feel uncomfortable. For the setup that they have at the club it really should be much better. The harsh reality and the truth of why most clubs don't play exclusively hip hop is because they don't want the crowd that comes to that place. It can be diverse and some really enjoy hip hop but it attracts so many people who either want to start shit or steal things that it is not worth wading your way through that mess. And this is not a race thing. The sketchy people were of all colors and sizes.   As many said below the staff feels like they are a big deal for what they are trying to do. I appreciate the dress code etc in any place but the way they toss people out of line and inspect you it makes you even more upset when you realize the club is nothing worth getting into. I can put up with this crap to get into the Grand because at least i know there is an experience inside. Here its like getting felt up to get to a delayed flight at the airport. You just don't get why they were so rough and you feel sad because you had to go through it for nothing.   Once inside the ticket lady immediately tries to take you money and she can't even believe people found out about the guest list let alone use it and is very reluctant to let you in for free. We came on a performance night which increased the number of people but it was still disappointingly few people. There is no way this place fills up on a  Friday or Saturday on it own which is another reason not to risk your night unless you are going to the many nearby strip clubs which I imagine many are.   There are some photo areas near the entrance and the bar is small but good enough to serve the small crowd. No issues with this area. I gave the place two stars because I appreciate any place that actually has room to dance. Their back room is actually really nice and has a large dance floor. The problem is there is no one there you will want to dance with or feel safe dancing with without a safe word.. Seriously ladies if you go here you will get outright grabbed and scoped for hours. It was unnerving to watch the gays swoop in here.   The performance was cool as hell though and you are right up close to the performer with the stage built into the back of the dance floor. The DJ was also amazing. Some of the best hip hop set list i have heard in the city.   But it was not worth everything happening around you. It all felt like it was an attempt at a party that never really started. If you are into hip hop and don't care about how bad the crowd is around you then you can take the dive and go for this place but no matter the positives it is not worth feeling like you could have had a better time anywhere else in the city.", 
    "review_date": "2014-07-08"
  }, 
  "9P8-9EUP-aEnuisqUYt5jQ": {
    "user_rating": 3.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Kathy S.", 
    "review_text": "Warning** mixed drinks are hella expensive here. Just order a beer for $6.  Lots of cool wanna be dancers here. I had an overall good time. Maybe that's simply because by the time I got here I had a couple of drinks under my belt.  Pretty big dancefloor! The lights were basically on and there was no \"club lighting\" which would have been cool. The floor was kinda dirty too. I think they need to turn the lights down and add some lighting and it will feel more like a club here!  Ok.. it's the best club I've been to on Broadway yet.. but that doesn't say much for Broadway if you know what I mean.   Only come here if you're stuck on Broadway. By no means should you come here intentionally.", 
    "review_date": "2009-05-03"
  }, 
  "nEl2xgE6EBrIU9axpW_gmA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jerico P.", 
    "review_text": "parking still sucks but the place is looking better.  i had to park pretty much by COIT tower this time which is fine for me but for the folks who come to party in heels... smh... i feel for you. on another note do they teach you how to perpendicular park in SF? i know that i don't even require parallel parking anymore in the driving tests but seriously, perpendicular parking was KEY tonight.  parking aside - we got to club and were happily surprised. well i was anyways. they redid the front of the house. they got rid of the pool table. created more private seating. moved the dj booth and elevated it. now it looks like a real party in the front and then another party in the back! unlike mullets which only have a party in the back.  QUICK TIP: there is a spot on the dance floor that never gets hot! it's near the fan and in front of the air vent. if we are there on the same night i'll probably fight you for it, but i highly recommend it because you can stay cool as you dance the night away.  the drama however continues... but that won't stop me from coming back. it's part of the fun i suppose.   until next time,  cheers!", 
    "review_date": "2011-06-26"
  }, 
  "Si9pln8-mnfxD4T1By3SiQ": {
    "user_rating": 4.0, 
    "user_location": "Torrance, CA", 
    "user_name": "brent w.", 
    "review_text": "second spot we went to last night.  typical bar/lounge/club spot.  they played a variety of music from west coast gangsta rap to electro remixes and mashups.  very roomy place and the crowd was diverse.  the venue reminds me of busby's east in west LA.", 
    "review_date": "2009-02-01"
  }, 
  "Bzr2R1LZGdkpyHJWpS9ciQ": {
    "user_rating": 1.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Zoey B.", 
    "review_text": "Wack ass club!!!!!!! Dj is cool though place is wack and the place got shut down by the sf pd after searching the upstairs for like 2 hours. Paid 20 to get in and they didn't even give it back, mind you the upstairs was closed so we WERE STUCK DOWNSTAIRS CRAMPED AND STINKY!!!!! The place is wack!!!! Do not waste ur time or money", 
    "review_date": "2014-12-14"
  }, 
  "KpT04gs-GMsjG8lQVkWtaQ": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Brittany C.", 
    "review_text": "Got bottle service but they ran out of tables so they gave us the corner of the bar. Weird but it worked. The guys at the door were polite but only because my boyfriend knew them.  Super crowded. Bartenders were quick with serving drinks. Bathroom lady is super nice! Plays good hip hop but I always hate the crowd. Almost every time I come there is always a fight at the end of the night. This time I saw some girls get dragged down some steps.", 
    "review_date": "2014-11-30"
  }, 
  "o-NPgmrcihUoE0afXAmoPg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "Fun! I was a little apprehensive at first because it's in North Beach which really isn't my scene. I was pleasantly surprised! It looks very small when you first walk in, but there is a separate dance floor that is pretty big (for SF). When we first arrived, there was open bar which was pretty awesome (we scored 2 drinks before it ended). I guess if you go in with low expectations, you'll probably have a good time. My only suggestion is to go early so you avoid paying cover. They move the line slowly, so get there by 10:15pm. Good times!", 
    "review_date": "2010-11-14"
  }, 
  "iv-U8zzyNb8Fh0RXQEfhhg": {
    "user_rating": 3.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Ben A.", 
    "review_text": "Crazy RATCHET up in there last night! No lie, some girl's weave was foreal getting tossed around the dance floor. Cool place though.", 
    "review_date": "2014-01-12"
  }, 
  "Uban-MJKpA8DVMfdpf-KCg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jasmine S.", 
    "review_text": "Went to Atmosphere for the 1st time last nite (06/19/10). After hearing mixed reviews of the place, I decided to have a fun nite out with the girls.  Got there before 11pm to get in free on the guestlist.  The people at the door were friendly. The first room was a chill spot with a smaller bar.  Free champagne and cupcakes!  There were only 2 bartenders working at the time and it got a little bit of a wait.  Disappointed that they were limited on what they had and couldn't make me a mojito. Boo! My sister's Tokyo Ice Tea tasted like sewer water! Im not exaggerating.  The bar counters smelled like old wet rags.    Finally they opened up the bigger dance room at around 12pm. It was a nice big area to dance and their dj booth and bar was beautiful! The music wasn't much to my liking at first, but then it picked up and they played more hip hop r&amp;b mash ups.  The crowd was decent.  Seemed like its a spot for big groups to meet up and have a fun time. So if you're looking to have a fun event with 15+ of your best homies, this is a good spot for that.   Crowd that nite was a mix of asians filipinos latins  Overall, I probably wouldn't go to this club again.  I had to drink more than I planned just to enjoy my time.  I'm sure people have a great time at this place but it just wasn't to my liking. To each his own!", 
    "review_date": "2010-06-20"
  }, 
  "TFpNMh-yRcPiWcFMuIY2bg": {
    "user_rating": 3.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Christina D.", 
    "review_text": "Came here for a friends birthday and it was a pretty fun place.  It was empty when we first arrived but filled up rather quickly.  I liked that they had a sale on Belvedere ($5 for a shot or drink) til 11, I would have been in love if it was Grey Goose! Watch out for that tricky mirror by the pool table, I watched 2 girls almost walk into it thinking that it was a doorway into another room. :)", 
    "review_date": "2009-11-06"
  }, 
  "qkelo15wZAzyC_lPB5ODkQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kristina N.", 
    "review_text": "I've been to Atmosphere 4 times, mainly for birthdays. I think this club is a popular choice for many because it is spacious and the music is top 40 hip-hop.  People say this club is ghetto, yes, but I've had good times here!  There are 2 floors. The first floor is chill, due to the smaller dancing area and dim lighting. The second floor is the main floor. The dance floor is pretty big. There's a stage where girls can slut it out. There are two VIP sections upstairs, one next to the stage and one in the back near the bathrooms. If you are getting VIP, I'd recommend requesting the one next to the dance stage so that it's closer to the dance floor and you can see more action. My friend got a table near the bathrooms, and it's pretty far from the dance floor. I felt disconnected from the fun and our group. Also, I believe VIP gets only 5 wristbands per table, so if you are trying to sneak the rest of your group to the table, you should share wristbands because they are strict with entrance.  I came here 3 times with my name on guestlist. Once, I waited in line around 10:20, thinking I would get in before 11 for free. Wrong!! They held up the line to after 11, and I had to pay $20.  Disappointing!  Another time, I came here with a partybus at 11:30 and it was empty. The busy-ness varies and I'd say it is busier on Sat nights than Fri nights. Also, they occasionally have open bar 10-11, but you have to sign up for those.  The crowd here is pretty ghetto! But that doesn't mean you won't have fun! One time, a rap group called Tha Outfit performed on stage and made it rain $1 bills!! I got caught $9 from that night!!!  Oh, and a black guy asked my friend to be in his porn production. Told ya, it's ghettto!!!  One last thing: I contacted them to request free entrance for our partybus to be extended from 11 to 11:30. I didn't expect a response, but the guy emailed me back the same day and accommodated my request. I liked that they actually communicate back, unlike anywhere else....  I would only come here if it's free!", 
    "review_date": "2011-04-18"
  }, 
  "BzjscnV_Qg2qqri91lwZUg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "El T.", 
    "review_text": "This is regarding Saturday night April 17 2010:  If i had a choice to give a big fat zero star, ATMOSPHERE WOULD BE IT!  RUDE RUDE RUDE bouncers!  These bouncers were HOSTILE and major a55 h0les!!  Go somewhere else!  This club is BY FAR the dirtttiest club on the Broadway strip.  And that's saying a lot since there are a few strip clubs on Broadway.  Venue being dirty is one thing... but to deal with the mean bouncers/security brought this club to a whole new level of disgust and unprofessionalism.  I'm so disgusted by the bouncers attitude!! Big over sized Samoians' who were power tripping and being extremely rude for no apparent reason!  They started to cuss at us, I have never felt so attacked.  We did nothing wrong!  We were 10 polite, tiny petite Asian ladies who were dressed to impressed, ready to get in and say Happy BIrthday to a friend who bought bottle service.  MInd you, we were 10 SOBER girls who were ready to spend the money on drinks!  The bouncers were so difficult to deal with!  I gave up and walked down to Sutra, where the bouncers let me in without any troubles!  Atmosphere gets two dumbs down for me.    If you are looking for a good time, go somewhere else!!!  You will regret wasting your money and time for a venue who doesn't give a sh1t about your patronage.  Atmosphere will not appreciate your money nor your attendance!", 
    "review_date": "2010-04-19"
  }, 
  "yqZBhTWtVjEwvdlcIdfxxA": {
    "user_rating": 1.0, 
    "user_location": "Concord, CA", 
    "user_name": "Melissa M.", 
    "review_text": "Terrible.   The only reason I came here was to watch my homie perform. He asked me to come see him &amp; his group perform, put me on the guestlist, and invited me into VIP with them...  The BOUNCER put hands on me and threw me across the floor instead of politely asking me to not be in the VIP area without a wristband.  She started chest bumping me when I told her \"don't put your hands on me\" and she said multiple times \"what are you gonna do about it??\" \"What are you gonna do about it??\" well that resulted in a drink in her face, me on the floor, and some punches thrown, and then I got thrown out of the club.  BESIDES that Bullshit from a 40 year old woman on a power trip in the club.... the place is small as fuck and was very empty for a Saturday Night.  Never coming here again.", 
    "review_date": "2013-10-13"
  }, 
  "tGxhVMTDSdG1n5oJH0k0Ug": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Kelly S.", 
    "review_text": "It was a refreshing way to get away from Downtown SJ with the gang. I don't have a paramount story to tell you about Atmosphere, so I'm just going to lay it out flat.   The pro's of this place are apparent as seen in other reviews , the dance floor is spacious and the bartenders  friggin' rock my socks! The crowd welll.....since it was a Hybrid 10 year anniversary party it was inevitably an Asian invasion. Very nice decor inside and Jeri Lee was go-go dancing! They also have a Coat-check for 2-3 dollars, so don't hoochify yourself as soon as your step out of the car, wait till you get inside because as we all know the city is chill-ay.  Con's- line took 216541654 years to get into. My goodness, i had to stand near the wall of smokers blowing their cancerous fumes into my face for far too long and to have to pay 20 dollars! Then,  finally after getting into the club at 11:45 and getting a few drinks and our \"freak on\", the lights abruptly flashed on at 1:30 exactly. Wait..I'm in the City aren't i? Oh well, luckily the place is surrounded by lardaceous places, taqueria's and greasy pizza joints, that allow you to enjoy yourself for a extra hour or so. Make sure you bring cash! the ATM fee's charge you up the wazoo!", 
    "review_date": "2009-03-13"
  }, 
  "4r-8Ty-TB-NOX5huxXY_hQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bennet A.", 
    "review_text": "i've had better. the crowd was mediocre at best. drinks and djs were aweful.   i'll pass this place next time around.", 
    "review_date": "2009-01-26"
  }, 
  "VvSxtZITEAopE1nRUGqfNg": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "siddhartha s.", 
    "review_text": "Giving this place a one star because I have to. I went in there with a group of 16 people with a limo company. To get in we had to waste a good 20 minutes because they wanted to talk to the owner/driver personally before we got in the club. They handed out tickets to 15 people and we were missing one ticket. They argued that we had to pay 20 for the admission although we had wristbands and stamps from the limo.  These guys just want to make money period. They try every hook and crook. After spending about $500 in the bar we decided for a smoke about 14 of us went out as advised by one of the bouncers and when we tried reentering they wanted us to pay $20 a head again. I was like this is not happening. After speaking to 6 bouncers I spoke to this very arrogant manager/supervisor claiming we all have coats inside and we are not leaving without them. After spending a few minutes waiting for his response we talked to the cops that were outside, told them what the situation was they forced them to accept us back in the club again. This place has a stage where apparently they only allow  ladies wearing close to nothing on it. After being pulled up by 3 girls a friend of mine was thrown off stage by bouncers. We told them if they do not allow guys on stage they should post a note. We also said if there were any injuries coming from that push, we would file charges.  There are a lot of clubs in this district I would not recommend this piece of shit place to anyone because of their overpriced drinks, a full line up of staff that works in every way possible to get in your wallet. The people that come in here are great and friendly for the most part. Their restrooms are in the corner and you have bouncers right outside trying to throw people off the club for apparently being a little drunk but if you walk with the bouncer to the bar and order drinks you are good to stay. They close at 1:45 A.M. and have a lineup of rude staff up your butt to get you out. One of my friends accidentally left a coat there at the check-in and we called the club after we got out and back home only to hear that the coat was not there. How do you give out somebody's belongings when we still have the check-in stub.  I would rather not go out partying then go to this place ever again.", 
    "review_date": "2011-03-07"
  }, 
  "l7tsWZEIc8b2WXPYX2xS9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janelle B.", 
    "review_text": "it's decent...  the line wasn't long at all around 10:30 and even though my friend wasn't on the list, we swore up and down that she was and they let her in for free which was nice.   don't order a greyhound though because they don't have grapefruit juice. don't order a harvey wallbanger either because they don't have galliano. don't order a hennessy sidecar either cuz that shit will FUCK YOU UP. the drinks are strong and considering it's in North Beach, I'd say they're reasonably priced.   the crowd consisted mostly of people from my high school (and I'm 25!) so if I had to use one word to sum up the crowd, I'd say Asian (I went to Lowell =P). the room with reserved tables played electronic/techno music and the other one played hip hop/top 40. there's also another room in the back but it was closed off. looked nice though!", 
    "review_date": "2010-03-24"
  }, 
  "jGepPl5jibnjaG0GztTPfw": {
    "user_rating": 1.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Chris F.", 
    "review_text": "The place bites, Rude management that did not give me the time of day or respond to my complaints. I would never send anyone to visit the club Atmosphere.", 
    "review_date": "2009-11-22"
  }, 
  "zZha2AcC31exjvxun055PA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley C.", 
    "review_text": "Went here on a friday night for a couple friends' birthdays.  When we arrived it was chaos outside -- people standing everywhere and a line wrapping around the building. Seemed like it was 'cracken' inside since there were so many people outside. We were able to get in via bottle service, but if it weren't for that I don't think i'd stand in that ridiculous line to get in here.  It's a two level place and the upstairs is the main dance floor. Bottle service has two areas, one down stairs and one upstairs.  The one down stairs was dark and....dark.  The upstairs bottle service area was much larger, but required you to show your wrist band before entering....It also smelled like hard boiled eggs in that area.   **TIP: get the shots upstairs -- the ones down stairs were skimpy.   When we first got in, there werent a lot of people there (mind you this was around 11pm) ... i understand they have to mediate how many people come in at a time, but it seemed like more yelling went on outside versus getting people in.   Smoking section was small so we had to wait a while to get out there.  Overall, it was cool -- your average club. Top 40s music. Not so cool when you're just sandwiched in between other sweaty drunk people -- it got pretty packed. The venue was nothing spectacular or memorable, but it was decent.   **TIP: finding a cab after the club here is ridonkulous!!! It took us nearly an hour to find a cab so take a walk and grab some food...", 
    "review_date": "2010-09-26"
  }, 
  "RtHD1eQpqMJPSD21PfY9lw": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Dirty M.", 
    "review_text": "Hate to say it but I don't know how else to describe this club but ghetto.  I went last Friday for a friends birthday and was VERY disappointed.  For the way it was advertised, you would think it was a really nice and classy club...wrong.  The venue is definitely beautiful so I expected much more of an 'atmosphere', however, when we pulled up I already knew what it was going to be.  To start, they really need to establish some kind of a dress code; the flyer gave the impression that it was an all white party and said to dress nicely, so I came dressed nicely but before I even walked up to the club I saw girls in jeans and guys in hoodies- wtf?  That is not club attire.  Once inside, there was a $20 charge because Los Raca's was performing (I didn't get to find out if they did or not) which was fine but for $20 I don't expect people to be dressed like they're going to a kickback, it just throws off the whole vibe!  While in there my friend and I met 2 really cool young lawyers (dressed for a nice club, of course) who were also shocked by the feel of the club and so was everyone I was with!    On top of that, my drink was so strong it tasted like a straight glass of vodka, I had to tell them to add some spritzer in it!  Luckily I was already a little tipsy so I just gave it to a friend.    Everyone keeps talking about the dance floors but I only got to see one of them which I assume was the main room which was ALL hip hop but not even cool hip hop, like, old school hip hop.  No Tyga, no Wiz, no Drake, no recent TOP 40's except for \"Slow Down\" and some other hyphy shit which is cool but, not every damn song!  I asked the DJ to play some Rihanna so me and my friends could actually party which he kindly did...while dancing my iPhone 4s and a little $$ fell out of my pocket, which I didn't realize until the end of the song.  Looked down, it was gone.  Called it, it was shut off and I haven't seen it since.  After that, I had had enough and went home.  So less than an hour after arriving I was out 60 bucks, a cell phone, and a Friday night - talk about a bad night.", 
    "review_date": "2012-06-14"
  }, 
  "0QeJC2inz6P-OVzROU_LNw": {
    "user_rating": 1.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Tram N.", 
    "review_text": "We had wristbands but it appears that the club had no idea what to do. What ended up happening? They made us form a line next to the line of people already waiting to get in. The security guy checked our ID's and had us continue on. Upon entering this joint, there's this smoky and dark setting that just hits you, creepers standing on the sidelines observing who is going in. There is a bar w/in a few feet from the entrance so it was definitely a challenge to walk through and get to the stairs. Yes, this place has 2 stories, each playing different beats. The bathrooms are located upstairs as well and it appears that the door is to be remained open while a quiet and old Asian woman cleans up after each use of the sink and hand delivers you a paper towel... there is a tip jar for her \"services\" and I find that quite odd.   The music upstairs was horrible. The music downstairs were dance-able and they were playing some hit 90's- 112! I don't know what it is but I did not get a good groove on when upstairs but that's where my group was to be posted. We were among the firsts to dance, my group. Then it started to get crowded, very crowded. The spillage of drinks written in some of the reviews were no joke- some dumbass girl spilled some of her drink on me and some douche spilled his drink over me because he tried to get me to dance all up on him- I don't think so, aashole. This is a club and I came to dance, if I wanted to get frisky, I would have opted for actual sex. Seriously- nobody genuinely dances anymore? Is it grinding and humping part of it now? Does it make one feel or look cool doing it? Because I did not have 1 decent dance the whole entire night. Was it the crowd at this particular club? Not sure but it scarred me from going dancing unless I am w/ my significant other.   There is a platform/stage area on the second floor and I guess one needs to wear extremely short ass skirts or dresses or shorts to be up there.. apparently no style of dancing is ok too.. as long as you show skin, it's all that matters. The VIP area was blocked off w/ a thing and there is a security lady that checks you in so that was a good thing.   The bar area can get crowded but I actually stood there, wishing my night was over w/ already. At least the bartender was nice. I wanted water, I thought I was going to get charged for a bottled water but no, I was given a glass of ice water w/ a straw, no charge!   There is a seating area on the first floor and I spent the last 40 minutes rereading my texts and resting my poor feet that has been on 3in. heels the entire night. There is a covered pool table right in the area too and some used that as a dancing dirty platform.   No ins and outs here. I wanted to leave the club to get something to eat and come back but apparently I couldn't do that. I had to endure 2hrs and some minutes here.   My God. Never. Again. Never.", 
    "review_date": "2011-03-14"
  }, 
  "awqtQmC1QoUxOdmdQoeirQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Leily P.", 
    "review_text": "I find it a little creepy when there's that one old white dude sitting alone at the bar oggling girls. And this is the type of place where you'd find guys like that.   Last time I came here for Halloween it was packed (expected). Then I came here again on a rainy Friday and it was completely empty. Except for the creepy white guy at the bar.   Overall since it's so large compared to other places in NB, I guess you can't really go wrong as long as you know what to expect in terms of the crowds. But then again because it is so large - it takes a while to fill up, which means you probably shouldn't come here anytime before midnight.", 
    "review_date": "2009-12-15"
  }, 
  "AEN3VLT7Lh0UTJUch3JiqQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie J.", 
    "review_text": "Eh... Better places to go.  You think if you rent out the floor of a club you would get decent service. Not here. Do not rent out Atmosphere for a private event, you will be disappointed.  Music was a little dated and the DJ, at a private event, was not responsive to requests despite several people making the same request.  I asked the bartender for a martini, it was mixed with no vermouth and in a plastic cup...  I asked the bartender for a cucumber martini... I was informed they don't serve cucumber martinis. The bar was NO frills.  I asked the bartender for a lemon drop, the first attempt was served in a plastic cup that was warm and tasted like sanitizer (because they pulled it out of their dishwasher mid-cycle, that is normally a health code violation and the taste of sanitizer is not a good thing). After informing the bartender I got major attitude, she remixed the drink and put salt on the rim instead of sugar!  Finally, people were at the private event that were not on the list. If I wanted a random guy to proceed to hump me without an invitation and then follow me around, not taking the hint, I would not have gone to a private party where there was supposed to be door control.   I repeat, do not rent out Atmosphere for an event. Hopefully our party got their C game staff and they have a better staff for their \"real patrons\" because that was clearly their attitude about our private event.", 
    "review_date": "2010-10-24"
  }, 
  "EUAtnptDql_tMRsETuELkg": {
    "user_rating": 4.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "alex v.", 
    "review_text": "Came here May 27th. Im from San Diego County so Im used to different style clubs. This one isnt bad, it was just plain. Weird type of plain. It wasnt fancy but it wasnt ghetto. It wasnt packed but it was sure not empty either. Tough to explain, maybe because i was already buzzin, as usual. I would recommend it. 20 dollar price tag is a bit steep but im sure you will have fun. didnt see any fights that night. This place, obviously, does not compare or come close to Vegas. If you visit San Fran, check it out, youll have a good, weird fun time.", 
    "review_date": "2011-06-03"
  }, 
  "uKkNmBfkMjFQKKpDSe4vLw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ellis L.", 
    "review_text": "I came here for a friend's bday last Saturday. Luckily we were on a guest list so no crazy waiting in the line that turns into the alleyway next to the building. I saw this man rummaging  through the trash bin like 30 feet away from us...creeeeeeeepy. Or maybe he was just taking out the trash.   There were three \"areas\" to the club. One techno/trance-ish room with a fish tank (my favorite part of the room but they need more fish. However all the beats and pounding vibrations might stress them out).  The two other areas were a mix of R&amp;B and hip hop. The floors were hella slippery though, it hard to get your groove on if you had even babyheels on. The music was alright, I was fascinated by this muppets music video they had projected onto the walls. It was so cute.   Pros: - strong drinks - fun music - $3 coat check - friendly crowd  Cons: - slippery floor - small bathrooms (3 stalls max I think) - small-ish venue (it was comparable to a club in HK) - slight concern for animal cruelty to the fish  I loved my ladies' night though. Everyone else got messed up quick. There are convenience stores located CONVENIENTLY nearby for a water or something to sober drunk pals up :) Lots of cops around though. Behave or be careful!", 
    "review_date": "2010-03-22"
  }, 
  "bm2DqfP4P454FjEtCbZdkQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lien T.", 
    "review_text": "I came here for a friend's birthday celebration and I actually had a really good time. I want to warn you though, our party reserved a table for bottle service, so my review may be slightly bias due to the special treatment that we got.  Anyhow...my first impression upon stepping into the club, was that it was really small. I did not realize that there was a second floor, until our waitress escorted us to a closed off section upstairs. What I really liked was the size of our booth. Usually clubs have tiny booths that can only fit like five people. Our booth at Atmosphere fit about twice the number of people comfortably. We were right next to the go-go dancers too, so we had a good view.   The dance floor was really spacious and I was able to dance without bumping into anyone. The restroom was closely located and there were enough stalls to prevent long lines. Overall, the club was pretty clean and nicely decorated. I wouldn't mind partying here again.", 
    "review_date": "2011-09-30"
  }, 
  "cXoKpS2xgsAuZlmR__Dm-g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shafaq C.", 
    "review_text": "I hit atmosphere after a night of club/lounge hopping with some friends.  We spent most of the night at Apt.24 across the street, then hopped to Sutra for just a few mins, then walked into Atmosphere.  It was later in the night so by then all clubs should be bumpin, but it was sort of... empty.  The crowd was kind of...sketch as well, probably because they had enough alcohol in them by then.  We tried to dance for a bit and have some fun but we pretty much called it a night soon after.... Not sure if its any better earlier in the night?", 
    "review_date": "2009-07-28"
  }, 
  "yz0T3HS6ikX11F5o6T6SWA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Timothy H.", 
    "review_text": "I've been to almost EVERY club in SF...so I have an idea of what to expect and what to look out for once I go to a new venue.  (1) Line: It was a 1000+ invite private party which I was invited to, I was definitely skeptical about getting in. Luckily, the bday boy was able to pull people as he felt appropriate and the general line moved rather quickly. Was out of the cold in 5 minutes. Doormen were very courteous.   (2) Bar: Great service, super speedy. What do you expect when you go to a party with tons of people, instant drinks? People were nice about shifting positions and once I got to the bar...I was able to order 10 drinks without hesitation.   (3) Music: The best I've heard in a long time. Usually when you go to clubs and they advertise hip-hop/top-40...some awkward mix of random rock/trance funks up the mood. There were distinct, separate moments for mash-ups and awesome r &amp; b throwbacks, keeping the crowd happy overall.   (4) VIP support: If you get a table, you're treated like a king. No wait, instant service, hassle-free pricing. A+  (5) Crowd: Depends on the promoter. Again, I went on a night of a private party so it was entirely up to the bday boy to supply the list.   Overall, this is one of the cleanest, classiest North Beach lounges so far. It definitely surpassed the old Zebra and Infinity lounge setup and I can imagine myself visiting again without hesitation. Consider it the SF club experience without the rude attitude.", 
    "review_date": "2008-11-30"
  }, 
  "9XqGrgCmZ-EfNFhz1xU5BQ": {
    "user_rating": 1.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "M D.", 
    "review_text": "Absolutely horrible. Went for a birthday and will never go back. Crap DJs who start to play a good set and then just when everyone was getting into it, play a crap song. Should have known better since its tucked between strip clubs so it was basically full of the type of people who frequent strip clubs. Dont let the photos lie to you! Unless you like to get touched by random men grabbing your arm as you walk by...  I dont recommend it.", 
    "review_date": "2009-04-20"
  }, 
  "rLrpUn3XucGA9LBktJWQqQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Le D.", 
    "review_text": "THIS IS NOT WORTH BOTTLE SERVICE. We came there last night with a group of 15 people and ordered a few bottles. They actually HELD the bottle service line outside. As we waiting impatiently to get in I see all these people (must be \"friends\" of the owner but shouldn't they worry more about the people dropping the most MONEY?) get in with no wait and no line. I asked the bouncer what was the hold up a few times and he acted as if the VIP tables were so busy, but when we finally got in we were only one of the TWO tables occupied.   The bathroom was more disgusting than a regular club restroom, but the crowd was decent. However,  I would have been happier if I celebrated my grad night at a place that actually appreciates money from table service.", 
    "review_date": "2010-05-23"
  }, 
  "EiwxlbR8fb68lMgEXhcWKA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lorrie M.", 
    "review_text": "Perhaps this is unheard of, but for once I am about to rate a club 4 stars and we're not even in Vegas.  I had plenty of doubts about this place since I've never heard of it and it's got average reviews. My friend claimed they were having a hosted bar and put us all on the guest list.  We actually arrived at the club early (oh my) and I was, quite literally, the first person in line. The ID and guestlist checking began, but for some reason the first three people in our party were not on the list although the rest were. However, the bouncer was nice and let us in anyway. Once inside, they had catered food! Yes we are talking shrimp cocktails, sliders, cupcakes, munchies, calamari, bruschetta, the works!  I personally have not seen this at a club before, so I skidaddled over for some cupcakes and beef skewers and took off to the bar. Gin, rum and vodka (and mixed drinks with those) were free between 10-11 so we got our drinks on. Some people a little more so than others ...  The downstairs area had a nice lounge section with a fish tank (and probably some highly stressed out fish ...) Upstairs dance floor wasn't bad either. Go go dancers and good music. Pretty good!", 
    "review_date": "2010-10-11"
  }, 
  "Xmo_NEfUp5YFzGJmwN11jQ": {
    "user_rating": 1.0, 
    "user_location": "Tracy, CA", 
    "user_name": "Adrianna A.", 
    "review_text": "Probably the worst club I have ever been to in the city.  The place is ugly and it attracts the ghetto of the bay area.  Multiple fights in one night and I'm assuming this is a regular problem cuz there are a million and one cops outside of this club.    So many nicer places to go for a fun night out in the city...", 
    "review_date": "2011-02-27"
  }, 
  "wgrQxY37BGWxGCLr3wG7Gw": {
    "user_rating": 2.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Courtney C.", 
    "review_text": "The music was not the bomb, and the service was mediocre.  The bouncer was too cool for school (at least, HE thot he was), and basically set the tone for the pretentiousness inside.  The best part of the evening was watching folks practically run into the garage door-sized mirror by the pool table thinking it was a doorway to the room behind it.  If you decide to come to Atmosphere, the spot to be is 3 ft from this mirror.  Any view will do =P", 
    "review_date": "2009-07-27"
  }
}