{
  "zZhBiivvN4Iq-hyzS9XvMQ": {
    "user_rating": 3.0, 
    "user_location": "Bozeman, MT", 
    "user_name": "Emma K.", 
    "review_text": "You gotta be in the right mood for this place, but when you are, you can expect a ridiculously good time.  My friends and I love the cheesy atmosphere and always go here when we want guaranteed fun on a girls' night out.  I like the unpretentious, un-scene-y nature, and the fact that they play the feel good hits you like to dance to (hel-LO \"Safety Dance!!\" --- at least that's what I want to dance to!) without being totally annoying.  I was disappointed on a recent Saturday night, however, when they were charging a $5 cover and the place was so damned crowded that we gave up after trying to order a drink for 15 minutes.  Luckily the guy at the door was very chill and gave us our money back.", 
    "review_date": "2006-02-27"
  }, 
  "w8w6jHFQI_GDRa4SJOSn2g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "francisco M.", 
    "review_text": "Best bar to watch newbie alkies try to compete on the weekend. The bartenders and regulars make the scene.... And watch out for those volcanoes, I have seen many eruptions because of those things..... Peace", 
    "review_date": "2009-05-28"
  }, 
  "RAXEQvLnNCaDnBOs7X911A": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Kara S.", 
    "review_text": "When I walked into this establishment Guns n Roses Welcome to the Jungle was blaring throughout the straw covered walls. If that's not the song to start your Friday night out right then I don't know what is.  In a drunken flurry I saw flaming bowls of alcohol. Watching the bartender make this amazing concoction, he stuck his finger in the blazing pot of 151 and flipped off my friend for the perfect photo-op.  The funky jams kept playing all night long, and the dancing ensued. All the of the staff were super fun, from the DJ to the doormen. The lady bartender was amazing, supply me and my friend with shots all night!   Very cool place tucked away in the hot mess of Broadway.", 
    "review_date": "2008-06-24"
  }, 
  "x2OVEAf6DKnuh3MAPzdmoQ": {
    "user_rating": 3.0, 
    "user_location": "Miami, FL", 
    "user_name": "Beccie F.", 
    "review_text": "-the decor is very cheesy tiki style.  i like this. -the bartenders are not dicks.  i like this. -that huge drink in all the pictures is tasty.  you get drunk slowly and barely realize it.  i like this. -they have cheap buckets of beer in the bottle.  i like this. -the alcohol isn't super watered down.  i like this. -they have booths to sit in (but you have to get there a bit earlier in the night).  i like this.  -the people who seem to frequent this place are a bunch of douchey frat/sorority types.  i don't like this. -they had the same half hour mix playlist (with NOTHING GOOD on it -top 40 autotune BS) repeating over and over the entire time we were there.  i don't like this. -the aforementioned playlist was playing at like 20,000 decibels.  i don't like this.  my friend is in town for a semester and my boyfriend and i went with her to mingle with some of her schoolmates.  given the situation and the people we were there to hang out with, it was a good time.  however, would i return to hang out?  nah.  i'll walk 'round the block to Specs for some cheaper booze, battleship, and gouda cheese on saltines.  personally, that's much more my speed.  all in all, the place is cute and would be TOTALLY awesome if all the lame-os in SF didn't crowd it.", 
    "review_date": "2009-07-18"
  }, 
  "ZJMrk2BwAkN0Dtc73qtN8g": {
    "user_rating": 1.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Christian W.", 
    "review_text": "This place does not do it for me.  If you like dive's but your friends insist on being on Broadway, then this is the place since Crow Bar closed.  The Tiki theme does not work,  the beat up decor and nasty floor just seem like bums hang out there.", 
    "review_date": "2008-06-19"
  }, 
  "2KmVI2N9J6jYZtww018Ptw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Eric M.", 
    "review_text": "This place is awesome - affordable drinks, great vibe (you get the \"dive bar\" feeling without the ghetto elements), and the bartenders are freakin' hilarious and personable. We don't get up to the city much from San Jose, but when we do go back up this is definitely where we're going for every night-capper.", 
    "review_date": "2010-03-14"
  }, 
  "0JqoPfshKED2q9y5L4BcrA": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Jada M.", 
    "review_text": "Love, love, love this dive bar. Not only do they have a plethora of yummy umbrella type drinks, but the music be pumpin'. I've been there when bachlorette parties roll through with their caca-maney dares. SF scavenger hunts and of course the ugly tiki vintage shirt weareres can't fit anywhere better than The Bamboo Hut.  Good times, an amazing variety of people, andgenerous servings of spirits. When you roll through give a nod to Mario the bartender he'll take care of you!", 
    "review_date": "2012-02-08"
  }, 
  "mnPxnubI04bNQPg1NUrRBA": {
    "user_rating": 2.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Liana L.", 
    "review_text": "My friends and I decided to overlook the bad reviews of this bar in favor for their Volcano Bowl during Yelp Drinks Week 2012. It was kinda dead when we walked in but every table and bar space was still taken up. The bartenders were really cool and laid-back.   The volcano bowl was just one big slushy with a hint of rum and 151. Interesting to look at, and not bad for $10 (normally $20) to share between 4 people but too weak of a drink to get my Friday night started off. Be careful of brain freeze!  I preferred their Bamboo Breeze more for the minty, mojito taste. The alcohol was stronger in this one.  Someone was setting up some band equipment... perhaps for a live performance later on? But we up and left after we finished our drinks, and just in time too as a group of already-drunk and annoying Asian girls walked through the door screeching, \"OMG, look at this place!\" What was there to look at? Dark, dingy Tiki wanna-be on Broadway. Good for a stop on your bar crawl, but not the way to end your night with!", 
    "review_date": "2012-03-04"
  }, 
  "V0Kg9fkgfoCNvYpNJcv0Ng": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Randy T.", 
    "review_text": "Bamboo Hut, now THAT'S the liveliness I'm lookin' for on a Saturday night. Too bad you are such a small place. It was definitely the feeling of \"sardines stacked in a tin can\". It was hard to move around if you could at all and bumping into someone was the requirement of the night if you wanted to go from the front of the place to the back and so forth. And at the midnight hour expect it to be standing room only.  Drinks were great and my shot of Grey Goose at $9 wasn't that hefty of a price. Once in a while you can get some bumpin' jams on the stereo and if you clear out a square foot of space to yourself manage to get groovin'. Not a bad place to meet people as well as long as you can wiggle and negotiate your way through the masses.", 
    "review_date": "2010-03-31"
  }, 
  "c--TE-tUiQomDvHKyGHFTQ": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "One Black Mans POV.. ..", 
    "review_text": "Small spot, not much goin on inside.  However it is, a getaway from the corny people outside on broadway.", 
    "review_date": "2008-06-28"
  }, 
  "rflHpMMcM-hAGRktiPpfWw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Allison K.", 
    "review_text": "I hate to write this place off, but I just didn't think it was worth the trip from the Richmond to North Beach (taking two buses mind you). Maybe it's just because I went at 9:30 in the pouring rain, but I wasn't that impressed.  The decor is nice though (I especially like the HUGE glowing tiki mask on the wall).  Maybe I'll give this place another try.", 
    "review_date": "2008-02-01"
  }, 
  "wpI3AQvA5kxp-moP46m8NA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda P.", 
    "review_text": "Birthday party at Tiki Bar? Sure why not.  Cool part of it was that general public was not allowed in before 10...so we got to have the place to ourselves for sometime.  I enjoyed a couple of the \"Voodoo juices\", my only complaint about them was that they were a little weak.  Or maybe I'm just drinking too much....no they were a little weak with the booze.  Anyway, bartenders were extremely nice and gave great service.  Now for the crowd, well it appeared to be very bridge and tunnel once the bar opened up at 10.  Which is OK sometimes, but didn't exactly make me go \"Wow I want to go back to this bar!\".  I probably will, but it's not super high on the list.  Fun concept.", 
    "review_date": "2008-04-14"
  }, 
  "kyAo52QbL24HKgapfw1T_w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess W.", 
    "review_text": "It must have been a bad night but I swear there were 10 people in here at 12 am on a Saturday...WTF? Walked in, walked out...lost $5 on the cover :-(", 
    "review_date": "2007-04-12"
  }, 
  "6RJBeJlbDGrZO91Qc2NG9A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A W.", 
    "review_text": "The only thing \"working\" the night I was there was me!  The place had great jams, some hot sweaty horny nerds and well, ME!  Until I got there, the party hadn't started.    The faux, crappy lava stuff is broken.  The waterfall was empty and therefore, not flowing.  The drinks had no alcohol, the guys no game.  The bartenders were , eh, the tunes okay.  The bouncers were LAME and the only reason I'd go back was that there were plenty of fun drunk arse guys to dance with and that's it.  Ms. Ali", 
    "review_date": "2007-06-29"
  }, 
  "SeqrEs-RJ18dunkcE8nw6w": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Lisa L.", 
    "review_text": "I came here with a group of 8 people on a random Sunday night. It wasn't too packed; we were able to get seating without a problem. We ordered two flaming volcanoes between our group, and it was definitely enough. However, there was some inconsistency between the two volcanoes; one was much stronger than the other. The drink did taste good though, and I thought it was strong enough, even though it's kind of a fruity drink. It is pretty much a dish with a margarita style drink and in the middle compartment is a shot of 151, which they light on fire, hence the \"flaming\" aspect.   I would bring my friends here again, especially because it's such a unique thing. The bar environment is very chill, more like a dive bar experience. It's not the cleanest place, but it's good if you're bar hopping.", 
    "review_date": "2013-03-03"
  }, 
  "4FcfCT4WFGdNI_E09htphQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana B.", 
    "review_text": "I've only been here twice and found this dive bar hit or miss. First time was for happy hour on a Friday, and I enjoyed my pina colada. I liked it enough that I came back last night after film night at Washington Square Park. They charged a $5 cover, but the bouncer was nice enough to let us in for free. The bartender last night blended us horrible drinks - tasted like ice without alchohol or fruit. I'd stick to Trad'r Sam in Richmond for blended tiki drinks from now on. 2-3 stars.", 
    "review_date": "2008-09-07"
  }, 
  "yMmWN4BNNCKPvOi7PMKHvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Denise S.", 
    "review_text": "I really really really like the Bamboo Hut and it is one of my favorite places in the city. I always have a really great time, sometimes weird, but always fun.  Every time I'm in North Beach I somehow convince the people I'm with to grab some drinks here. I mean, you can't go wrong with sweet, juicy, tropical drinks in a bar decked out in tiki decor. It is very small but I've never had issues with that or with it being crowded. Oh, and the bartenders are cute, nice and quick!   The Bamboo Hut also has great drink specials for cocktails and beer. If you are looking for a great deal and a great drink go for the VOLCANO BOWL. Oh my goodness, for twelve dollars you get a volcano bowl filled with  booze and topped off with fire, plastic monkeys, seahorses and cherries. So much fun, especially for a group (or just two!).", 
    "review_date": "2010-06-24"
  }, 
  "Xq2MDSoxP8TUL1gRZF58Rw": {
    "user_rating": 5.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Lacey S.", 
    "review_text": "The Bamboo Hut is as good as it gets for little hole in the wall bars. The bartenders were awesome and fast. The DJ was good and was willing to play requests and they have these to die for drinks called Volcanos that come in huge bowls that they light on fire. Best night I have had in the city in a while!  Def go to place if you are on Broadway!", 
    "review_date": "2011-02-28"
  }, 
  "kOn2L4zlv9KqxLUxtPBveQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geri K.", 
    "review_text": "Warning: Bartenders scammed us here once and tried another time, but I was wise to their game. They insist you never paid for a round and try to collect twice. Repeat, this happened to my friends and I TWICE.  The first time, I paid for a volcano bowl and then the bartender asked my friend for payment later when I went to the bathroom. She was confused and insisted I'd already paid, but he was persistent, so she complied. Later, she asked me if I'd paid, and we realized we'd been double-dipped.  The next time, I paid for a round at the bar, and a different bartender came over a bit later and asked for payment for the same round. I told him I'd already paid, and he said, \"You didn't pay ME.\" I said, no, of course not, I paid the other bartender. He said, \"Which one?\" The other bartender conveniently had ducked out of sight. I know he thought I was too drunk to argue and would be confused, but he was wrong. I finally caught sight of Bartender no. 1 and made him come over and verify I'd paid for the round. Bartender no. 2 frowned, shrugged and slunk away as if to say, \"Oh well, worth a try.\" No apology; nothing.  Also that same night, someone stole my friend's cell phone out of her pocket as we were sitting at the bar. Bamboo Hut? More like Bamboozle Hut.", 
    "review_date": "2013-01-03"
  }, 
  "whfjd0gIdtPXLTZKmNYqZQ": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Stellah D.", 
    "review_text": "ok. so it doesn't rain in here, and the natives are often suspiciously blond, but after a couple of the bootleg rum Mai Tai's you won't care.", 
    "review_date": "2005-03-21"
  }, 
  "EuQx1J00HaxZj8sbBibdCQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe R.", 
    "review_text": "good drinks. GREAT DJ. does anyone know who the DJ is that does the mashups? He was there the Saturday I was there.", 
    "review_date": "2008-12-03"
  }, 
  "4CA-qAu_Pbyn84JcNZnN-g": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Samantha G.", 
    "review_text": "Came here on a Wednesday night and it was pretty dead inside.  I personally like the divey-ness of the bar and enjoyed the music that was playing from an ipod (90's R&amp;B, hip hop).  It totally reminded me of two hangout spots I like to kick it at back in Seattle (Ohana's and The Baltic Room).  I tried their Mimi hella lemonade, which had pineapple rum, lemonade and 151.  The drink tasted fine but it sure crept up on me later in the night.  If I did live here, I can see myself hanging out at Bamboo Hut.", 
    "review_date": "2012-02-23"
  }, 
  "WoDSAQPRN7BmHVea5YAO5A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MaryKate M.", 
    "review_text": "This place is sort of hilarious. It was pretty empty when we came by around 8:30pm on a Wednesday. Small bar with some booths a small back room. Pretty dark with island decorations.   They had a happy hour special of $8 off their volcano drinks (big mixed drink - either pineapple or strawberry flavored - that's lit in the middle), which are only $20, so $12 for giant drink to share. We were a big group, so got three of them! They were pretty strong but tasted alright.   I wouldn't rush back here, but wouldn't hate it if I had to come again.", 
    "review_date": "2014-04-22"
  }, 
  "De4sg9ppvk93ZHR9XqOB4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim S.", 
    "review_text": "Best bar on Broadway and best bar-staff, too! They don't tolerate dumbasses, which is a nice change of pace in North Beach. Be sure to check out some of their kickass vintage music nights --Rockin'!", 
    "review_date": "2008-04-22"
  }, 
  "vRziAXWI72nOFWNml4ldMA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hyung L.", 
    "review_text": "I give it 4 stars only cuz we had a ton of fun there probably because of my crazy coworkers and the drunkards we met there. lol Anyways this is probably the most useless review I've ever written.", 
    "review_date": "2008-02-07"
  }, 
  "Z88rSP-Kn1aK7MwRYir1og": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christi S.", 
    "review_text": "I've been here once, and already love it.  It's a change from the typical bar.  It's themed, the drinks are at a great price, and the music played that night was mostly 80's n 90's, rock.  Great place to just chill, relax, or even dance just a little.  Located in an area of lots of strip clubs, you never would have thought to find this place.", 
    "review_date": "2006-02-12"
  }, 
  "5v6juPIOisfmogp7QSso-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "$2 pbr! That goes a long way. Otherwise, the usual overpriced fiery tiki cocktails.", 
    "review_date": "2015-01-24"
  }, 
  "nzNLfODt91taiKNy4Er3-Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John B.", 
    "review_text": "This is your Average place, but hey its a dive bar.  I'd suggest something a little grander, more elegant if you're interested in this Hawaiian Motif.", 
    "review_date": "2009-04-27"
  }, 
  "nbfyMmgqnxXIp7EDqTmkqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kajal G.", 
    "review_text": "Really tasty drinks. Volcano Bowl comes in Banana, Strawberry, Coconut, or some mixture of those three. $20 and VERY boozy. Decorations were kitschy, super nice bartender. Clientele was... interesting...", 
    "review_date": "2014-08-17"
  }, 
  "517V_Oil94nFgZjsCgiA7Q": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Crystal V.", 
    "review_text": "I came here on a Tuesday night  at the recommendation of a friend I was meeting. I have to say when I heard it was on Broadway I was thinking great hooker town but this place oddly ,makes you forget about the girls without souls dancing naked 100 yards away. The bartender who is Not Asian, defiantly don't call him Chinese was freakin hysterical. He was like a improv performer, I'd go back again just to talk about inappropriate things with him again. Didn't try any of the tiki drinks but will have one of those volcano bowls to myself next time. Also the music I went was like the 2001/2002 soundtrack to my life, brought back fond memories. So pretty much this is not a upscale lounge but a pretty chill fun bar to have a good laugh.", 
    "review_date": "2012-08-19"
  }, 
  "DQj7DnJiDV9TAxS0ott-3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon N.", 
    "review_text": "really enjoyed the place - a fun atmosphere, and definitely one of the better designed tiki bars out there. the cover is definitely reasonable, and the staff is super friendly (the bartenders always say 'thank you'!) a nice change of pace from the other north beach bars out there. nice selection of music also, although i must say the dj is sometimes not without flaws.", 
    "review_date": "2005-06-12"
  }, 
  "ayiikLMADfb_i4HPv7dPIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E. G.", 
    "review_text": "As of today, Bamboo Hut has installed facial-recognition cameras from an app developer called Scenetap.  The cameras scan and determine the gender of people in the bar, then report the statistics online: <a href=\"/redir?url=http%3A%2F%2Fscenetap.com%2Fsan-francisco%2Fvenues&amp;s=271d996240898ef2adeabaea94a5a3479018df442780786cc6fbc0445df1da0f\" rel=\"nofollow\" target=\"_blank\">scenetap.com/san-francis…</a>  Unless Bamboo Hut has started handing out release forms at the door, I don't think I'll be going back.  EDIT: See comment below from Bamboo Hut.  They have decided to cancel the Scenetap system.  Thanks, Bamboo Hut!", 
    "review_date": "2012-05-18"
  }, 
  "DHT-Z-JF5V6_U0HSWErrXQ": {
    "user_rating": 2.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Laura S.", 
    "review_text": "Came here during a bachelorette party bar hop. First of all, Tiki stuff annoys me. I hate when people take beautiful indigenous art and use it for their own undereducated amusement. This is a great place to come if you like to get hit on by sleazy guys on the lookout for the drunkest chick to hit on.", 
    "review_date": "2007-08-05"
  }, 
  "HPhgvrUlHVmOEuOIGLEZvg": {
    "user_rating": 5.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Melodee E.", 
    "review_text": "This little treasure was the perfect way to end my extended layover in San Francisco.   The Situation:  My connecting flight is cancelled heading east and I'm in SF for an extra 40 hours. It's a Tuesday so most people I know here can't meet up or hang out. After one friend does, but needs to jet early, he has Über cab drop me in North Beach for one last hurrah before I head back to my hotel. North Beach turns out to be full of strip clubs - I'm uninterested in that type of night - but a nearby dancer on the street is very helpful and sends me to Bamboo Hut.   The Beginning:  I walk in and it's basically dead. However there is a super friendly, cool and chill bartender working. I sit down and I'm promptly served a potent cocktail and he easily engages in great conversation. He also so kindly allows me to charge my dying phone while I'm there. I had my hula hoop with me since I hooped in different areas all over SF during the day. Slowly people walk in and inquire about the pretty plastic circle I have with me.   As the night goes on, various dancers from the nearby slew of strip clubs come in and out either hunting for business or with their clients for the night to party. Everyone is very sweet...and plenty of drinks are served, all very potent...and now....  The Party:  Basically, everyone is feeling it, in a good way. Stripper, client, guys night out, business men, then me...the only non dancer girl. We are dancing, singing, hula hooping (yes it ended up being the center of attention...show stealer...hmmmph) laughing, vibing, and just having a GREAT time. A fiery volcano is purchased for me, and while I couldn't finish most of it, it was quite the treat and like the other cocktails before it, potent!   I partied like a brain damaged test monkey right up until close. Then the bartender and a local DJ ensured I was safe getting back to my hotel in Millbrae.   Bamboo Hut: It's cheap, it's dark, it's friendly, it's fun and the drinks are strong. Puuuurfect.   Now if only they could have cured my hangover on my flight the next day. Ugh...", 
    "review_date": "2014-01-13"
  }, 
  "9cDUn6mdkddC4Vudj7j9Ag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brady T.", 
    "review_text": "I suppose it's about time I chimed in on this place as I have been there just about every week since it opened 9 some years ago. The hut has a long sordid history and I have seen most of it. Hell, I have been some of it!  First off, this place is fun. It's super cheesy so if you don't have a sense of humor go somewhere else. This place is made for cutting loose, having fun and letting go. Recently under new management by Nick (who kicks ass) and now Marshal (who also kicks ass), the place is undergoing another paradigm shift with new theme nights and a fresh attitude toward making it the place to be on Broadway. Frankly the rest of the once jumping street has basically gone to hell in a hand basket.   There's a new rocking happy hour, new drinks, always new people and generally a great time to be had. It's a get what you give kind of place so if you are an asshole expect to be treated accordingly (which I think should be true everywhere) but if you are there because you are looking to have fun then fun you will have.  And if you are a first timer, get the Volcano Bowl. Come on, just do it, you know you like to see drinks on fire!", 
    "review_date": "2007-07-01"
  }, 
  "aZr3QOxWEGTdy0RLXYAwVQ": {
    "user_rating": 4.0, 
    "user_location": "Danville, CA", 
    "user_name": "Nicolle M.", 
    "review_text": "Flaming volcano bowls filled with deliciousness. Look at the pics.   A modern day \"jukebox\" in which you can request backstreet boys among many other of my teen favs! Drunkenly singing to BSB, Nsync, Britney. Amazing.   \"Characters\" walking the streets in North Beach to judge on your drunken walk/taxi cab ride home.   Yes, yes, yes! All in a good night out!", 
    "review_date": "2009-11-17"
  }, 
  "3qMnJT5k3sSA565d7N4r6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz H.", 
    "review_text": "Oh Bamboo Hut, how I love you!  You look so sketchy on the outside but are so tiki-licious and inviting on the inside!  If you come here, you MUST have a volcano bowl.  Fire + liquor smoothie + sharing with friends = good times!  Plus, if you are lucky, you might run into MCLOVIN! (Yes, this happened. Yes, he was mackin' on a girl WAY to hot for him :P)", 
    "review_date": "2012-03-06"
  }, 
  "pRBzWnFzaCEtqhYyJ2ZTDQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "ya know i had never been to this place before new years, but i must say the place is pretty chill. it's on the small side for sure - but the scorpion bowls are pretty unbelievable. as is the giant face which reminds me of \"old mac\" from legends of the hidden temple (don't lie, you remember that show).  I'd go back for sure. Excellent New Years setup as well.", 
    "review_date": "2009-01-02"
  }, 
  "hSJg4Sv6gO9SJdwqBE8thg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bonita C.", 
    "review_text": "I freakin' love this place! I can't believe I've only been here once...!  I planned my bfffffff's 21st bday here and it was successful and spectacular! She was pleasantly surprised + happy about the place. I must mention that the outside of the place doesn't quite do the inside justice. From the outside, it can be easily missed, and it doesn't look quite attractive. Inside, it's very well illuminated with miscellaneous island-themed decorations. I likey.  We ordered so many drinks that it's pretty hard to review them. I'd stick with the volcano bowls because the regular drinks didn't seem very strong. The volcano bowls will fuck you up ;)", 
    "review_date": "2011-02-08"
  }, 
  "dIRw8OJokLuZpoSW1sM7Xw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeska D.", 
    "review_text": "Best happy hour in the city, as long as you don't mind girly drinks.   Between the Pina Coladas (served in plastic coconuts of course) and the $12 Volcano Bowls (served flaming) you might not make it out of here alive. One of the best tiki themed dive bars around.", 
    "review_date": "2011-01-05"
  }, 
  "gwFNSUingZSyKolJb4Q9Kw": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Nishka B.", 
    "review_text": "When we first stepped into this place, I thought it was big.. until I realized that was the mirror!  It is a tiny place, cutely decorated and decent for a bar.  However, we didn't see too many people dancing so we left!  The music wasn't so great to me, but of course YMMV.  Unfortunately, the tiny (and I mean tiny) dance area is right under the huge speakers so it was absolutely deafening!  Alas, the earplugs didn't work out.  The staff was friendly and the crowd seemed decent, but just not my cup of tea.  On the way home we asked our cab driver for a recommendation.  Trying to be cool, he suggested the strip club down the street.  UM, no thanks!  Be warned.  This is in a mini red light district!", 
    "review_date": "2008-05-10"
  }, 
  "uPrKowwOimHLn8fvchJ_8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimmy C.", 
    "review_text": "Only a few bars will get me out of my neighborhood and this is one of them.  NOT the typical Marina/Northbeach scene, despite it's location on Broadway.  It feels a lot more \"real\" San Francisco, possibly because I've know both of the doormen since I was about four.    The drinks standard price for that 'hood.  I love some Tiki action and the music always rocks.  The line can be long but lucky me, I know the nice man at the front.  It also gets elbow-to-elbow crowded.  Stil, this is the kind of place we like to go for a couple of rounds and some dancing, then hop on the subway and get somewhere cheaper and closer to home for last-call.  It's kinda like a bigger, louder, dirtier, more expensive Trad'r Sam's.  But I still love it.", 
    "review_date": "2007-01-09"
  }, 
  "PmrFSehNLWAn8pMWtB53Lg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suzanne B.", 
    "review_text": "Why the hell do I always get in trouble at the Hut?  And who the f**k let someone in with a digital camera last time?  Fun, unpretentious most of the time and with some of the politest bartenders on the whole Broadway strip - the Bamboo Hut is great for silly good times.  Not a trolling bar and not really a dance club.  But fun!  Warning - you must be able to stand large doses of 80's/metal/early 90's music.  If you cannot, go to another club as this one will merely frustrate you.", 
    "review_date": "2006-05-03"
  }, 
  "cMLEz_Nan0MuyvVpRGwRDw": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Angela H.", 
    "review_text": "Tiki Bar? I'm in! Tiki Dive Bar? Let me think about it... okay. So if you bring your own group, it can be a fun place, but it's not the type of place I'd go by my lonesome or just with a girl-friend. The happy hour is til 8 and kind of amazing, though. Sure it's low-key, but fruity drinks for $4 and $3 red stripes?! complete with coconut cups and umbrellas. Mai Tai is good. Have had the thing set on fire in a group - fun. It's cute, but yes, still a dive bar.", 
    "review_date": "2009-05-16"
  }, 
  "uPZ9VreCtXWsol-j61-WJQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vale O.", 
    "review_text": "the bar was alright....  we passed by here on friday before going to Horizon (that's across the street) to check this place out...well it wasn't full and the \"Volcano Bowl\" was alright, i was expecting it to feel some alcohol in it but i didn't, maybe it was just me haha..  -they had sand all over the floor, that was cool never seen that before..and well i dont know maybe another day i'll give this place another chance to see if its really that good...", 
    "review_date": "2010-10-05"
  }, 
  "uPqIt_HOnS1itDBt7VolVw": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Mellie P.", 
    "review_text": "The bartenders here are awesome! Get to know Lauren - she'll take care of you! She caters to your taste and always whips something up she senses you'll like.  Make sure to get there after 10:30pm or else you'll find you and your friends are the only ones there.", 
    "review_date": "2008-08-03"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "My friend and I went here on 5-31-14 8:00pm'sh for a birthday party.  I ordered two hara cane $8, this was surprisingly good and bartender is cool, also had the langunitas and anchor $5 (the beer could be slightly cooler).  The dj was playing both old and new school music. I recognized a few individuals who attended this bar.", 
    "review_date": "2014-06-01"
  }, 
  "UeoZDZpRsE_QJqRcuTuGlQ": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Joshua F.", 
    "review_text": "Very nice dark laid back place to hang out. There is a friendly crowd there when I went, which was a saturday night. The one thing you have to try is the large tiki bowls. I think its a volcano bowl. Good liqure in there. btw, blow out the flame before all the 151 disappears!", 
    "review_date": "2012-01-17"
  }, 
  "l_v1Mx8vTJtvh4qn0EtpFA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Alfredo N.", 
    "review_text": "Been here a few times.. Love the decor. Bartenders make good drinks.. This is a place you can go to anytime of the week.. And yes i have been there on week nights.", 
    "review_date": "2006-12-28"
  }, 
  "RD_LFsuNqBD6WTnGhQ0wAQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim L.", 
    "review_text": "Overrated. fun with friends but it's hella small so make sure you can breathe. Try the volcano, its worth trying once. I guess if you like bars this is more like that since the drinks are good. Bonus: its on broadway Caution: volcano is on fire", 
    "review_date": "2008-12-11"
  }, 
  "Etv0WOrv1Vu1hg1v5Ta_Dw": {
    "user_rating": 3.0, 
    "user_location": "Bakersfield, CA", 
    "user_name": "Jaide K.", 
    "review_text": "Stumbled in to this place with some friends recently after a trip at Centerfold. A little tiki bar that breaks up the monotony of strip clubs and porn shops on the SF Broadway strip. The decor is funny and the vibe is fun, next time I'll be sure to try their signature Volcano Bowl.", 
    "review_date": "2011-09-07"
  }, 
  "h1EEmDWDHpy9aRUKeMC8OQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex S.", 
    "review_text": "Freakin Radical! I have been coming to the Hut for several years now. Buuttt im finding myself staggering in here more frequently now. I enjoyed this place before with my ex gf and the old bartenders. now the allure is greater with Mario, Nate, and Chris's hospitality behind the bar. The bucket o' Beer is a safe bet but parties always endulge in the Volcano bowls. The Navy Grog floored me. Its a nice change of pace from the neighboring ghetto clubs and douche bags. One star off cause I dont enjoy the dominant hip hop ipod music. Book your next party here!", 
    "review_date": "2010-06-06"
  }, 
  "oYC3R6LxQltCQK9-SLcKwA": {
    "user_rating": 3.0, 
    "user_location": "San Gabriel, CA", 
    "user_name": "Maggie L.", 
    "review_text": "Not sure if the bartender was new or was just really bad at opening and man-ing the fort at an early hour, but service was pretty bad.  On a brighter note, this place is ideal if you want to get smashed. 151 in fruity blended concoctions? Only $20 for a flaming bowl of drunk? SIGN ME UP.", 
    "review_date": "2013-08-28"
  }, 
  "LBoRkOP7V2OsDp8EVwCvcQ": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Steven K.", 
    "review_text": "if you're looking for a place that makes you feel like you're on an episode of 'lost', the 'bamboo hut' is your stop!", 
    "review_date": "2008-01-22"
  }, 
  "m5cBT7OYfn0HM0d-RCsdZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miika M.", 
    "review_text": "Fun place to hang out with a group of rowdy friends and to catch up on loud idle chatter while wiping pieces of palm fronds off your black attire.  Reminds me of the other joint on Geary, Trader Sam's, whose clientele was a bit questionable, but I love the ease and anonymity of hiding behind students and biker people.......  Large drinks, good for females to get tipsy on, since I consumed a vat of strange pinkish concoction, then promptly got sick on the ride back to the Red Room.    Great bartenders though, they remembered my friend's order and gave me free ginger ale to lighten up the evening.", 
    "review_date": "2006-09-07"
  }, 
  "uJqx8ZYk4hI_XkVDqB7BoQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly B.", 
    "review_text": "This place is great for their happy hour. It lasts from opening till 9 and they have great deals, including $12 volcano bowls (normally $20, which is still cheap)! Go here for great deals on good drinks!", 
    "review_date": "2014-07-23"
  }, 
  "Y7ZzGTlA_KOQ2PFHIX0ABw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rachel M.", 
    "review_text": "Douche-y-est crowd I've ever seen in a SF bar.   I ended up here Saturday around midnight and it truly reminded me why I never go out on amateur night.  But maybe it's just me...as I was about to leave a group of three guys were like \"hey...where are you going? you look really out of place...in a GOOD way.\" lol", 
    "review_date": "2012-01-24"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "i can't believe lauren shilled her own bar!?!  kool bar, kool door guys, kool bartenders, kool 80's retro dj's, &amp; kool foo foo drinks...well not really but that's not my cup of tea.", 
    "review_date": "2007-07-08"
  }, 
  "q29DsL5xmpdV42bJ6XLkBg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "joanne d.", 
    "review_text": "I've gone here like 2-3 times. It's a nice chill place to get ready for the other clubs on this street. I haven't gone here in a while. Definitely will make a stop when I'm around.", 
    "review_date": "2008-07-15"
  }, 
  "2pdQeER_Z1R-1db2b6WGEg": {
    "user_rating": 5.0, 
    "user_location": "Alamo, CA", 
    "user_name": "Steve L.", 
    "review_text": "Best punch bowl drink on broadway. Pineapple strawberry mix is great, I would suggest that if you have 2 or 3 people. Full size bar, which fits 15 people add several booths and a ton of tiki stuff and you have a sweet bar. The bartenders favor girls (what tender doesn't). Prices aren't bad either.", 
    "review_date": "2014-08-20"
  }, 
  "XP32BMm5JmcogLMTf-JUGg": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Helen V.", 
    "review_text": "OMG....VOlcano bowl..can we say hangover? I think I drank about a quarter of it... Let's just say that I had a headache all night and slept horribly because of it. But it is super yummy! The 151 is definitely masked  by the ultra sweetness!   The bartender was awesome! Will be back again!", 
    "review_date": "2010-11-16"
  }, 
  "sJVw7h-robahs686ajAgxg": {
    "user_rating": 2.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Briggard K.", 
    "review_text": "I feel kinda bad giving this place two stars but It has to be done, I may try it  again one day just to grab  a beer but the tiki drinks...I'll pass.  Making Tiki drinks is not just for any old bar to attempt.  The mixture has to be right, and when your volcano bowl tastes a little like burning plastic and it feels like it was made with cheap syrups  and slush ice, then it's gonna get two stars. Sorry but too many other Tiki Bars use fresh ingredients, the best rums, and recipes that have been perfected over the years.   The bar itself is cool, and deserves a visit on this side of town as a good pre-game spot if you want to get a cheap buzz off of the volcano bowls.", 
    "review_date": "2011-09-24"
  }, 
  "xGdDW6Q-CRZb4JIxY78tAw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Charise B.", 
    "review_text": "This place is a slice of heaven. Great bartenders, kitchy atmosphere, and well made drinks. Some of the drinks are loaded up with tropical frou-frou decorations and the music played there is unlike anything you will find on broadway. The bamboo hut is my favorite bar in north beach.", 
    "review_date": "2007-06-22"
  }, 
  "4arlBZEnIKR5H8xlYcL6AQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David R.", 
    "review_text": "NEW and IMPROVED drink menu! I highly suggest giving this place a second look if you have not been for a while!  A refreshing escape from the otherwise ghetto-tastic Broadway street. Chris and Nate will take care of you trust me !    get the zombie!", 
    "review_date": "2010-05-29"
  }, 
  "GCjQSRIr4o41N88xxQabtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelisimo G.", 
    "review_text": "After reading some good reviews I wanted a Volcanoe, I went 2 Da Hut right after work around 6 it was pretty much dead whiich was kinda weird cuz it was a Friday... Oh well more Volcanoes for me and the bartender (I forget her name) was real sweet. Happy Hour they got $12 Volcanoes $4 Tropical Mix drinks and $2 beers. Overall it was great place to go, but next time I'll come a bit later cuz those Volcanoes ain't nothing 2 play with.", 
    "review_date": "2008-04-03"
  }, 
  "lDl5JBIxIZZWahib8zCIBg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geordie E.", 
    "review_text": "Horrible sound system. Drink names like Bali Bomb should have clued us in the calbre of this place. We lasted 10 minutes.", 
    "review_date": "2008-06-21"
  }, 
  "nqb5kKa4nHQtVq6zQZtnxg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Charm N.", 
    "review_text": "Good music and cheap drinks made pretty ok. The DJ needs a tune-up though and a lesson in mixing.", 
    "review_date": "2005-06-14"
  }, 
  "3HHLpfU7q4HoREEOXtt7pw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "One of the stops on St. Patrick's Day...I know, I know...why Bamboo Hut you ask? Because the bartenders are amazing and because of how much fun I had on St. Patty's Day, I'm going to go ahead and say that this has become one of my favorite bars. Plus how can you go wrong with a bag-pipe player in a tiki bar whilst sipping on voodoo juice? You simply can't :)", 
    "review_date": "2010-03-22"
  }, 
  "TAZ2UvEzXXbieQMCWn8qhw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Luke S.", 
    "review_text": "Great place to chill.    The bathroom is a bit of a problem.          THe door is busted so it doesn't lock and the door is kinda far from the toilet so its hard to keep the door shut and take one at the same time.  I am sure alot of people probably had moments where they had to sit on the toilet . Idk how they do it, everyone probably has a different procedure. I just usually jump real quick on it and hope by the time I am done no one comes in. I've been lucky every time, whew oh well except once I think but I think I was pulling my pants up when the guy came up so he came just in time. I don't think people really wanna see someone taking a dump anyway.  The area is nice and the decor is lovely.   They have a cool happy hour which I like . Its pretty close to my favorite spots and its very dog friendly.   I love the lighting .    I am a big fan of there bowls.  Y'know me I'd rather drink a bowl them smoke one. The volcano and pina colada are hella good   The brain freeze is perfect, goes great with the buzz you get.  When all the other happy hours in the area are over this is my go to place .  I also love how sometimes the tiki God looks like he's gonna vomit.", 
    "review_date": "2014-10-15"
  }, 
  "5qmJvPcqYJs3sg7cwl0mLA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Cynthia M.", 
    "review_text": "The Bamboo Hut has a fantastic and cheap Happy Hour! The drinks have plenty of alcohol, but the way they mix them, they still taste great! Additionally, you can order gigantic mixed drinks like at the Tonga Room.... only at dive bar prices minus the cheesy band and minus geriatric dancers taking up the dance floor.    There's nothing more awesome than getting drunk in a bar with a tiki theme. It only gets better when you leave the tiki bar behind to stumble out onto the street and find you are in the middle of more strip clubs than you know what to do with. In short, the bamboo hut is an oasis in which the bartenders are friendly and do a good job of making sure everyone gets a drink.", 
    "review_date": "2010-01-16"
  }, 
  "j-wjUN4NTR8j51yMDa8Byg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca H.", 
    "review_text": "So much better than I was expecting.  Not being a fan of bars with: a) a cover charge or b) people dressed like they are going to an exclusive club, I did not have positive expectations for this bar. But, the drinks were good and not that expensive, the DJ was spinning some great 80s and 90s tunes, and the crowd was much less obnoxious than I expected.  The drinks were a little on the weak side and the cover charge policy does not seem to apply across the board (I didn't have to pay, but someone else in our group did).  All in all, if I'm in North Beach drinking I would probably go here, but wouldn't make a special trip.", 
    "review_date": "2008-10-09"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "something wild and crazy about this casual little tiki bar. good tunes usually playing, good drink specials and a low-key crowd. i've had some very fun times at this place. its a very nice break from all the \"i'm trying to be so cool and trendy\" lounges on broadway.", 
    "review_date": "2005-04-25"
  }, 
  "5jLkKtE4HPlrbjw-0w9lvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon T.", 
    "review_text": "It may not be the most authentic of Tiki bars, but it's a nice place to hang out at on a weekday. Cheap drinks and cool neighborhood bartenders.", 
    "review_date": "2013-10-03"
  }, 
  "F73Hfe1ofAE1f1dRoPGREw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mondo B.", 
    "review_text": "THE BAMBOO HUT ROCKS.  End of story.  I've been coming to this bar since I turned 21... I'll be 29 soon.  I've always had a blast here... between the bartenders (who I've become friends with over the years), the awesome tiki decor, the cool DJs, and the fun music, you can't go wrong.  I've taken a BUNCH of different friends to the Hut over the years, and everyone's had a fun time.  My favorite night to go is Friday... LOVE going with some friends, talking to the bartenders, picking up women, dancing my ass off, and just having an overall BLAST.  Thursday nights are awesome too, with the rockin' sounds and rockabilly they play .  I love this bar, and have been to it more than any other bar I've ever been to.", 
    "review_date": "2007-10-25"
  }, 
  "oPW-LM0pXja0lDwZybXd9g": {
    "user_rating": 4.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Dmytro A.", 
    "review_text": "I consider this a SF secret because it took me so long to discover.  Since learning of this joint, I bring all my European guests to Bamboo Hut to give them a taste of what they thought California would be like (\"W-w-why-y-yyyy is it so c-c-c-c-olllllld in SF? W-w-wherrrre is the s-s-s-sssun?!\")  Best Parts:  +  Volcano Bowl.  Always a crowd pleaser.  Share up to 5, or limit to three to get a buzz.  +  Guy serving the drinks.  He's funny, has great taste in music (all the music you hear comes from his iPod), and goes out of his way to make out-of-towners fall in love with San Francisco, starting with his bar.  Make friends with him and maybe you'll even get to close the place down.  +  Gettin' lei'd.  That's right, the super friendly barman will lei you if you're fun enough or ask nicely.  +  Girls who drink something with an umbrella in it are looking for something.  Gentlemen, this is a great place to meet such girls so that you can give it to them.  Drawback:  + I don't understand why they keep the door to this place WIDE open.  It's chilly at night, man!  At least put some beads or a grass skirt over the door, or something!", 
    "review_date": "2010-10-19"
  }, 
  "FABFyv4yMCxVDbpzjG3jxg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geary Z.", 
    "review_text": "Wow, my first tiki tiki bar experience and it was awful. I had fun thanks to super fun friends and a fun drink...it was for a friend's birthday.  Location: Not my favorite location in San Francisco, the North Beach area. Don't drive here, you wont find parking. Straight people here are scary, scary, scary. Thank gawd there were lesbians and black people on the street to make me feel safer. There were also like 20 police on that block...weird, weird place. I felt like I was in a different world on that block.   Space: The place gives the illusion of being big due to the mirror walls, but it's tiny tiny tiny. The decor scares me, it's like polynesian, meets tolteca, meets pacific islander mix, with angolan finnishes haha.   Ambiance: The people were ugly, poorly dressed and couldn't dance for the life of them. My friends and I were awesome, though.  Service: Jesus, I asked for a dirty martini and she said, \"What's that?\" and then for a cosmopolitan and she said, \"I don't know how to make that.\" 'Nuff said. She was nice though.  Food/Drink: I couldn't have my dirty martini...but we all shared this super fun volcano drink. It was pretty yummy and had fire on it.  Overall: This is usually the kind of place I stay away from but my sister wanted to go here for her birthday. Hopefully this will be the only time I am forced here...I am traumatized.", 
    "review_date": "2009-07-21"
  }, 
  "P769aE9q4wTY0PQI31thYA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Ryan B.", 
    "review_text": "A little \"G-Rated\" watering hole in the midst of San Francisco's Strip District on Broadway in North Beach.", 
    "review_date": "2012-08-29"
  }, 
  "RBF1HlGboORCTchIXVYRBg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ulysses B.", 
    "review_text": "this place is cool...went there on a weeknight and the dj was playing good hip hop...the crowd was laid back and the bartenders were cool. cant beat the $3 pbr's.", 
    "review_date": "2011-01-20"
  }, 
  "7egWE1QHw3Fx8IigeItxtA": {
    "user_rating": 1.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Darrel D.", 
    "review_text": "Tonight I met up with a few folks at this place. I am definately not impressed. Although the bartender is great (she does an excellent job) and the music is great, this place is just too dirty for my taste:  - Bar stools are loose, some need to be replaced  - The padding on the barstools are stained with God only knows what  - The seating area around the table needs to be re apholstered  - Smell of sulfur wafting into the establishment from the near by         manhole cover totally ruines the atmosphere - Pictures posted on yelp of this place look alot better than the actual    place.  I saw a few people ordering food, personally, I cannot eat in a place that is dingy. As it turns out, the night I was here, they only had one menu for all it's guests, so...if you attend...be prepared to glance at the menu before the staff passes it onto another patron.   Good Points: - They have a cool blow fish lamp hanging up - Great bartender - Good music", 
    "review_date": "2009-06-06"
  }, 
  "M-qEXJ_By2W6GBNCsMOPpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jena d.", 
    "review_text": "Tiki room bliss!   All I have is good things to say about this place...it's like walking into a tropical tiki paradise. Sure you can find a floating wedding singer band at the Tonga Room, but Bamboo Hut RULES!!! The ambiance is warm and inviting, totally themed, and cozy, intimate yet not cramped,. There's even a special private room in the back for big private parties if you wanna get wild with your scorpian bowl drinks set afire!  I loooove the weekend bartender Lauren- sweet as pie, and willing to make and serve you your poison of choice- always smiling! I highly recommend their specialty tropical cocktails.   I go on Thursdays for the \"Night of the savage sounds\", where they have resident and featured DJ's spinning old school rock and roll, swing, surf, and blues. It's definitely one of the most comfortable no drama bars in North Beach, and is starting to become one of my favorite bars in the city - well especially on Thursdays!   It's hard to find a chill bar with a friendly atmosphere these days...Bamboo has all these things, and a uniqueness no other place has, from the staff, to the decor(where else are ya gonna see blowfish hanging from the ceiling and a 12 foot tiki??!), yummy fruity drinks, and awesome people that frequent the joint!", 
    "review_date": "2007-10-25"
  }, 
  "IgMo_FL5lHiuuBR6qtoxzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam W.", 
    "review_text": "It had been a while since I had visited the Bamboo Hut. We showed up to the ast night, not realizing that it was a Beach Party Weekend, so the entire bar was covered with sand! How fun!   We were handed flip-flops and proceeded to the bar, where the female bartender was great!  We had a group of 10+ people and took over the nook in the back, which was perfect!  The music was great and the crowd was cool! Drinks are strong - try their flaming volcano bowl.", 
    "review_date": "2008-08-16"
  }, 
  "UbZQPC9Z7iOWaRNJ3eNdow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charlie B.", 
    "review_text": "I love this place. I love this place...Ill say it again I love this place.   Okay Pina Colodas are hard to find in this city. Noone wants to dig out the blender and try and find all the garneshes. I need a paper umbrella in my Pina to call it a colada.   Anyway...this place not only makes me feel like Im in the jungle in a third world country but also has the best Pina Colada Ive had in San Francisco. They let you play your own music (if you happen to have your Ipod with you) when theres no Dj.  Serve tropical drinks, and sing alone to \"The Promise\" by When in rome with you after your smashed.   The street traffic is ridiculous so theres never a shortage of strange travelers or locals coming in to spice it up. Its totally the kind of place you could swing from the rafters and dance on the bar after one to many and they would more than likely kick you out and then hug you when you came back the next day.  I like that in a bar....I really do.  Luv ya...keep sending the Pina Coladas to the wasted girl on the end of the bar.  Thanks", 
    "review_date": "2008-07-30"
  }, 
  "AT6NwNkLKxgW2fsQGNs-gA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregor G.", 
    "review_text": "The only thing missing from this place is Lovey and Thurston Howell, III, relaxing @ the tiki bar whilst sipping cocktails. It's kitschy, inexpensive (for happy hour, at least), and an excellent place to bring or meet up with a group of friends. And with all of the tropical drinkie options, you can catch a buzz AND stave off the scurvy and rickets at the same time!", 
    "review_date": "2007-06-14"
  }, 
  "_MNenPUmUIfHoonEH06J-w": {
    "user_rating": 5.0, 
    "user_location": "Arcata, CA", 
    "user_name": "Meg H.", 
    "review_text": "this is a FUN place to get wasted!!  the first time i went, my girlfriend and i split a \"volcano bowl\" which was a HUGE bowl of frozen yumminess with a flame in the middle!!  it was enough to get 4 people smashed...and it was only $16!!  the bartender is super friendly and the music (which was 70's, 80's, and 90's music) kept getting better and better as the night went on!  the second time at bamboo hut was in the middle of the week and they had some lame 50's music crap playing, but i still had a good time.  it's a cute place that's cozy and fun, and for some reason at the end of the night, my tab is always a lot LESS than i thought it would be!  if you go to bamboo hut, get a volcano bowl and (if you can handle any more alcohol) a bali shot!  mmmmmm!!", 
    "review_date": "2007-06-14"
  }, 
  "IcdxwCBX6rNHwlcFJEVVtQ": {
    "user_rating": 3.0, 
    "user_location": "Providence, RI", 
    "user_name": "Hilary H.", 
    "review_text": "Cheap drinks, good music, big booths, one helluva stanky bathroom and my friend Peter D in a sweet, sweet kimono. These are the things I remember about Bamboo Hut... And most of them are with fondness.   We came here in a big group and were able to take over two booths and two Scorpion Bowls for $30 or less. Half of us tried to light our fingers on fire with the flaming 151 in the center and the other half watched in complete astonishment. If you're into tropical drinks and '90s gangsta rap, you'll be in heaven - seriously.   For extra s's &amp; g's, don't forget the kimono. It brings things to a whole other level, I promise.", 
    "review_date": "2013-06-06"
  }, 
  "1g6aR1yCdgKgHLvB0oWl-g": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Jacelyn M.", 
    "review_text": "Lovin this bar!  If your confused or scared of the entrance don't be shy.  Its really happy inside.  NO COVER!!!!!!!!!!!!! :) ((i always buy hella drinks no need to cover charge me!))  The bars tacky tiki decor is awesome  The strong drinks on the menu are strong and sooo tasty so if your in the mood....  Pretty nice looking bartenders.  Its busy but they will chat it up with you.  There was some dooshy people in the bar, but thats not the bars fault.  Its loud enough in there to tone them out and focus on you and your friends.  Thinking of having my party here.", 
    "review_date": "2010-09-24"
  }, 
  "YjlqR0Yzvm5bgmJ5XftXuQ": {
    "user_rating": 3.0, 
    "user_location": "Cerritos, CA", 
    "user_name": "Victor C.", 
    "review_text": "Pretty raucous crowd having a good time. But was rather small with ok service. You definitely want to go with friends that are loud and want to get drunk.", 
    "review_date": "2011-02-25"
  }, 
  "uqTVZBYO1m6QlyET5oHyhg": {
    "user_rating": 3.0, 
    "user_location": "Oak Park, IL", 
    "user_name": "Nessie V.", 
    "review_text": "Just what you'd expect from a Tiki dive bar.  Pretty low-key on a Thursday.  Probably the best bar I've been to in this neighborhood tho.", 
    "review_date": "2009-11-11"
  }, 
  "5ZXT4BQB-C1XjUpKmh7kaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne Marie B.", 
    "review_text": "If you're looking for a tiki bar or a place that will serve all the fruity tropical drinks you desire, look no further.    In my experience, it seems that the options in the city for the tiki bar atmosphere fall to Bamboo Hut, the Tonga Room, and Smuggler's Cove.  The Tonga Room is definitely suffering from price inflation, so reserve this place for rare occasions when you want the full experience of this slice of SF history.  I also struggle with categorizing Smuggler's Cove as a tiki bar, because I think of it more as a bar that specializes in rum-based cocktails (my favorites) and happens to have some decor resembling the tropics.  So in my mind, Bamboo Hut is the best bona fide tiki bar in the city.  But just because it won the title by process of elimination doesn't mean you're settling.    There are a few booths, a semi-private room with bench seats and a long table (think coffee table rather than dining table), then of course the bar and standing room.  Apparently you can/should reserve the \"private\" area if you plan on bringing a large group during peak hours.  (I say \"private\" because there is no door closing it off from the rest of the bar, but you do have walls on 3 or the 4 sides so it is a little more isolated).  While they can make you whatever tropical drink (blended or not) that your heart desires, you obviously cannot come here without opting for the volcano bowl.  Blended deliciousness (think daquiri meets pina colada) in a large specifically crafted ceramic bowl with room for lighter fluid (aka a very flammable liquor?) in the center to complete the full volcanic experience comes with many a long straw because you're going to want to share this bad boy.    There's a \"Jukebox\" you can pay to play the song of your choice which works much better on a afternoon before the bar-hopping crowds arrive.", 
    "review_date": "2013-09-09"
  }, 
  "ROpZTzNuhcsQngRhbioGGA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William S.", 
    "review_text": "This place is pretty lively on a week night. Now having said that, they had plenty of awesome decor. Wifey and I ordered the pina colada and the volcano drink. Pretty cool how they can make something like a margarita come to life. Wasn't too impressed with the wait time but the music was cool. Wifey will probably force me to come back next time. -_-", 
    "review_date": "2014-12-18"
  }, 
  "N4_TkjvXk7N-XPdVqttCFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa A.", 
    "review_text": "How can you not like the Bamboo Hut? I have many good memories, mini vacation nights, birthdays, bachelorette parties, at the Bamboo Hut. You can't help but feel like you're away on an island. The drinks are fun! We had a few chi chis, which are made with vodka (I can't drink rum).  As usual, there were your run of the mills db's, but isn't that better than mission hipsters?   The beer selection is limited; I recommend going for a fun tropical drink!", 
    "review_date": "2008-04-20"
  }, 
  "Nza9TrumxVALFOc3zpPxDg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany U.", 
    "review_text": "Attended a private party here last Friday and absolutely loved it. I'm a big fan of tiki bars and Bamboo Hut is exactly the reason why! I loved the tropical themed drinks, decor and ambiance.  After two island inspired volcano bowls, I was good for the night. Loved the mermaids and monkeys that came with the bowl! Mind your manners and don't sip too fast or you might end up with a brain freeze!  The only down side is finding parking in the neighborhood. Beware of parking on Broadway and make sure you read the tow-away hours clearly or you may end up in a mess!", 
    "review_date": "2011-08-09"
  }, 
  "Z7wYV7NVNAH_B0eE35d2wg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy H.", 
    "review_text": "Tiki Bar in SF...never thought it was possible.  But can you turn away from a rockin' thur night w/ a HOT harley literally inside the bar?  Good times baby, good times!", 
    "review_date": "2006-05-24"
  }, 
  "k_6JJl12UTicAEt6Ji8yTw": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "Rhea F.", 
    "review_text": "i was so drunk when i got here but i remember having a rad time... the music was cool...", 
    "review_date": "2008-09-15"
  }, 
  "hP8by2q4mgfQEvvhfChcbQ": {
    "user_rating": 2.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Alicia J.", 
    "review_text": "I get the tropical theme. I get the tropical drinks. I just can't stop the feeling where I have been warped back to high school spring break in Cancun. I can't quite put my finger on why I get this feeling, but I may never be back to figure it out.", 
    "review_date": "2008-01-02"
  }, 
  "DWbcEKJDBR6vPaNxb00sgw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Srinivas R.", 
    "review_text": "Rockin like dokken on the third thursday of every month. With classics like Def Lepard, Guns N Roses, AC/DC, Whitesnake, how can you possibly go wrong. Add to that the ultimate party girl who can drink anybody under the table, and take years off your life in a matter of hours, and you have my thursday evenings at the Bamboo Hut. We should make this a regular event for Yelpers.  Max, you da man.", 
    "review_date": "2006-05-19"
  }, 
  "0Cvgx6MKrSOTUxGoUpdaTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison T.", 
    "review_text": "He made me the pretty drink here last night.  I had a cherry, seahorse and an umbrella in it.  What was I drinking do not ask as I do not know.  I just asked for a fruity drink....my stomach was kinda queasy after 2 patrons at another bar.  A shot of Jameson here cured my queasiness but I really wasn't in the mood for another one.  So the drink did me just right.  My gf order a lava flow.....mmm delicious it was.  Tasted very much like a creamsicle...at least to me that was.  A very nice place to hang out at when you can just sit there and hang out with the awesome bartender....I am definitely going to come back again for drinks.", 
    "review_date": "2008-11-27"
  }, 
  "fKN1WhWWuqlIKPL2NjAJ0A": {
    "user_rating": 1.0, 
    "user_location": "Fussa, Japan", 
    "user_name": "John H.", 
    "review_text": "This place was PACKED. I would have liked to try their Volcano Bowl, or whatever the hell they call it, but just getting to the bar for a beer was a chore. Not sure if it's always this packed, but if it is I'm avoiding it. Oh, AND I had to pay a cover charge. LAME.", 
    "review_date": "2013-02-15"
  }, 
  "r3WjlMnxCMQXGoOBEb1NDg": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Betty N.", 
    "review_text": "Cool place to hang out. Bar tenders are friendly and has a fun atmosphere. Drink prices are a little high though and the bathrooms smell incredibly bad.  But when we have a night out in SF we'll drop by again.", 
    "review_date": "2011-07-10"
  }, 
  "CM1SVXJ1kiH5uztj_Vg7XA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bianca U.", 
    "review_text": "Three stars only because the bartender, Jamie, was SUPER NICE. Friendly, fast service, fun guy to have serving you drinks.  Otherwise, this place is a dive. It looks like a party store threw up discount tiki masks. Been to a few great tiki bars, this just can't compare--if you are a die hard tiki enthusiast, might wanna go here on a night you don't want to impress your friends.   Not very clean, the bathroom was gross.   LOTS of hipsters and groups of tourists from Europe. Funky part of town, stone's throw from a bunch of strip clubs on either side. Right next door to a porn shop and what  is now a defunct brothel. Sketchy parking lots if you want to pay to park, street parking is limited and awful on the weekends.   Music was good on the slow night I went, but it was a weird mish-mash of 80's and early 90's music--definitely not what I expected at a tiki bar.   Fun but tacky.", 
    "review_date": "2012-02-02"
  }, 
  "H_tTGo0pWOAFvK8Hl60Y5Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ausewaldoe J.", 
    "review_text": "i never been to hawaii but the decor kinda makes me imagine what it's like in some hotel bar in hawaii. anyways all sorts of tropical drinks if your into that sort of thing. the weekends area little to much for me. i been known to make an appearance early in the week(mon/tue) not to much going on. no dj just a ipod and a stereo system. the staff is great so tip well and ask if you can put your ipod in the mix.", 
    "review_date": "2006-11-25"
  }, 
  "36MiqVe8V1zsp_FmqhCEBw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sean L.", 
    "review_text": "bamboo hut was quite the focal point of our unofficial \"hooray for alcoholism\" pub crawl.  we stopped here for a quick shot, and after a few more bars decided this was where we'd spend the rest of our night.  from that point on it was crown royal bombs all night (which were surprisingly good).  fun tiki theme, good musaks, and the bartender was willing to put up with shit from a crew full of boozers (being us).  thank you mystery bartender... it saddens me to not know your name.", 
    "review_date": "2009-01-29"
  }, 
  "n_-wbei9Xz2D3jNJyzxkAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathon C.", 
    "review_text": "Scorpion bowls are sooooo FUN! Have you ever thought about where to go before hitting the club so you will have a REALLY good time. Well this is the place to go before hitting any of the clubs along the red light district. The scorpion bowls are great for groups and will really get you going. The place isn't big but its good enough for small groups. The people here are very lively and have such a good time. They end up dancing and doing weird things since they don't realize how strong these drinks can be. Just a note don't try drinking a whole scorpion bowl by yourself. You'll wake up the next day asking yourself \"WHAT HAPPENED LAST NIGHT?!?!\". I'm just saying.... but ultimately its your choice. Don't come back and tell me like I didn't warn you!", 
    "review_date": "2009-03-21"
  }, 
  "KFaUuuvfw-6rAbTzuYwU0g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert Y.", 
    "review_text": "There signature bowl drink called the volcano bowl has an open flame in the middle of a decently tasting and decent EtOH strength fruity tasting slushy that includes 151 proof vodka. Today there was a $5 cover charge for the guys since there was a live country band playing. The seating area was ok as there were several circular cubicals that could probably fit 4-5 people. The bathrooms are kinda dirty and the guys bathroom doesnt lock so deucing is not recommended.", 
    "review_date": "2011-04-02"
  }, 
  "f0jOh2Sz1J71bEqwgF-S7A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne B.", 
    "review_text": "Throwback music is right.  But no Don Ho; boo.  The Bamboo Hut makes an okay pina colada, but the flaming volcano bowl is better than the average Deadly Tiki-Bar Bowl.  It's big, it comes in your standard opaque thing, but it's ON FIRE, and it reliably gets the pathetic drinker-victims completely trashed.    I go here at most three times a year.  All three are pub crawls.  One involves Santa hats, one bunny ears, and the third either a golf getup or a grass skirt (usually).  We go, take the place over for about 90 minutes, do a few group photos and then leave.  in the meantime there's dice and video games.  It's like someone's parents' rec room after they've been gone for two weeks.    If you're going to show up here on a Friday night, do yourself a favor and call first.  \"Is a giant herd of bunnies hopping through there tonight?\" would be a good question to ask.", 
    "review_date": "2009-05-26"
  }, 
  "lkyKJY0UWh88GoCnZ2EnOg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dojo t.", 
    "review_text": "this place is like a racist journey through an 8th grade toga-themed prom party hosted by joe piscopo.  which is to say, terrible.  the attempted jungle decor is rendered moot by the early 1920's film ennui lighting, which makes everything but the bartender's ugly mug difficult to see.  the bartender i had was a racist version of greg louganis, except a bit more smug.  pretty arrogant for a 34 year old sucker hoping for a screen test with that 70's show.  sorry bro, wilmer valderamma got your job.  also, the drinks taste like urine except are a bit more expensive.  so, if you want to completely waste your time and money, and have little to no taste, plus are racist to boot, go here.", 
    "review_date": "2007-02-05"
  }, 
  "CNhhP_OSJp_-OhZerMWYlg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Marc E.", 
    "review_text": "Cool place with tropical drinks. The bartender was really friendly. Real chill vibe.", 
    "review_date": "2014-11-15"
  }, 
  "RR-hNSxTUs4CSkGQZLEWyw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jamie L.", 
    "review_text": "Came here for NYE celebration. A friend of a friend rented out the place and of course opened up the list for the maximum guest of 100. Although me and my friends had to walk to the bar from the Montgomery BART station, it was nice to not be in a overcrowded bar for NYE.   The drinks were good and the service is awesome. There was one bartender who totally took care of our group. Definitely a great NYE place to party. Especially when me and my friend did the Pee-Wee Herman 'Tequila' dance on the bar. Although there is not a lot of sitting space, I still like the vibe of this place.", 
    "review_date": "2010-01-01"
  }, 
  "G2PlwBajzyIYAr9JfAFfeg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne-Marie H.", 
    "review_text": "The staff is really friendly and you can always see some regular faces in there. Good music, good drinks, and good people make this my 'old faithful' place to go on the weekends.", 
    "review_date": "2006-06-19"
  }, 
  "8GrQL_uBaCzNCYtOeZ--MA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jazzelyn F.", 
    "review_text": "I'm not really into North Beach. Mostly, because of the crowds and teenage punks who look at me like they are going to stab me and take my purse. But my BFF's brother Sam occasionally spins at Bamboo Hut and a crew of about 20 usually end up kicking it at the hut. We were there this past Saturday and had a great time. Drinks are so strong and about a dollar and yes after a handful of what ever your poison is definitely order a volcano. The simple fact that something is on fire is just enough reason for me to want to order one. Additionally, it's one of those places were there are no dress codes, attitudes and not a whole bunch of rules. Oh, and did I mention that you can sit for free? Not bad now that we live in the world of bottle service.  Great place to hang out with friends and have a chill night.", 
    "review_date": "2008-01-03"
  }, 
  "fhGrJv6kJOakL7BaiRteUA": {
    "user_rating": 1.0, 
    "user_location": "Queens, NY", 
    "user_name": "Tiffany L.", 
    "review_text": "Um, no.   The volcano bowl was so watered down. But I had to drink most of it cause I didn't want to waste it.   The fire thingy in the middle is cool and all...but no thank you.   And the bartender was boring as fuck. No wonder this place was dead.", 
    "review_date": "2014-10-10"
  }, 
  "_MlZ82Es6q-wImiuNvA4YA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Medwin M.", 
    "review_text": "It's always ok in here.  I like to come here before hitting the busier bars on Broadway to chill and talk a bit while getting warmed up with cheaper drinks here then at most other broadway spots.", 
    "review_date": "2006-02-23"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "I love the $4 happy hour with amazing tropical drinks. My office used to be right up the street from Bamboo Hut before I changed jobs so it was often a go-to happy hour spot. The decor is nice too though I feel bad for the real puffer fish that were used to make the tropical fish lights! Poor guys! I've gone a bit later at night too and it's always fun to share the big volcano bowl with a group. Reminds me of the scorpian bowls from college.... the music is typically alright at night but the crowd is super random and I think they sometimes try to charge a cover charge which seems a bit ridiculous to me for what is mostly a dive bar...", 
    "review_date": "2008-08-29"
  }, 
  "cct3lPII-Zdxfmdpmg_eHA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deanna W.", 
    "review_text": "The bamboo hut is awesome! It's comfortable, and friendly, and a real gem tucked away amongst the smut on Broadway.  It  is a lot nicer and cleaner there than the rest of Broadway, but depending on the night you still might get a little spice.  My coworkers and I regularly go see Mimi... she is always a pleasure, and can make a mean drink... after such great service we've ended up going on multiple nights, and it turns out all the bartenders there are great.  Certainly one of my favorite places, pretty relaxed on the weekdays, and a party on the weekends.", 
    "review_date": "2011-01-16"
  }, 
  "TFQwspVkZr1WfSvOD5x0mQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Craig S.", 
    "review_text": "Off the Grid, small island themed bar in the madness of the B&amp;T North Beach Clubs that dominate Broadway. Drinks are strong and cheap, bartenders are always friendly and the crowd is eclectic.Good for day drinking, solo-drinking or if you are actually trying to get into a North Beach Club and can't get in", 
    "review_date": "2012-07-07"
  }, 
  "dpHAnSjaG7bXDk4Wbyg97w": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Anthony R.", 
    "review_text": "Every time I go into this place I have a blast.  The joint is small and the music is hit-or-miss, but...\n  We randomly rolled in here one summer night and fell into a pimps and hoes (sp?) birthday party.  The ladies were looking scandalous and the men were dressed in their pimped-out finery.  We get in there at around 10pm and everyone is nicely drunk.  We need to catch up... and catch up FAST!  A couple of Jager Bombs will take care of that.\n  Strolling to the back, I see the most beautiful - and least dressed - girl in the bar.  I was barely drunk, so I'm convinced she was actually a goddess and wold look great if she was fully covered.  I need an in...\n  \"What's with the costumes?  Is there a private party going on tonight?\"\n (Note:  NEVER say this to a stranger unless you are already sure they are in costume.)\n \"It's a birthday party... why are you not dressed as a pimp?\"\n \"I'm under cover.  Besides, pimpin is in the heart, not the clothes.\"\n \"Hahaha!  Do you guys know the birthday boy?\"\n \"No, where is...\"\n \"HEY!\" A shout from the back of the room.  Apparently, the goddess' boyfriend was unhappy with her talking with us.  She goes back there, and is scolded and sits down, completely dejected, next to this punk (who was, I suspect, invited, but failed to put his pimp gear on).\n  I continue to chill, looking back at her every little while, knowing he was watching me watching her.  Finally, the fool goes to the restroom.  As soon as he rounds the corner, she jumps up and re-joins her friends.  Finally, though discreet trespass and almost imperceptible shifts in position, I find myself standing beside her once more.\n  \"Jees.  Can you get rid of this guy (nodding towards the restroom)?  He's bringing me down.\"\n \"Sure.  Does he need cab fare.\"  In my mind I'm doing the calculation... Walnut Creek is far enough... about $100 away.  She laughs and is about to respond, but he returns from the restroom (you KNOW a guy like that doesn't wash his hands) so they again retire to the back of the room.\n  \"Dude\" I say to my friend, \"we need to take that guy out.\"\n \"I'm with you, but he's pretty big.\"\n \"No problem, I'll just hit him with this beer bottle.\"\n He looks closely at our soon-to-be victim...\n \"He's got a varsity wrestling jacket on... it might take two.\"\n \"How about this fire extinguisher?\"\n As I'm looking at the locking mechanism, trying to discover how to get it off the wall, they leave.  Ah well, it would have been pretty messy in here.  Kinda like fighting King Kong:  Hit him with the extinguisher, grab his girl and run like hell.\n  Once they left, I was able to see that a really great party was talking place all around me.  The perfect 10 was gone, but a room full of 9s ain't bad.\n My buddy latches onto a fine girl in a nano-mini.  They start getting close and I see her whisper into his ear.  He says something back and she gets even closer.  Nice work, my man!  Later, he comes by and tells me about the conversation:\n \"I have something to tell you, but I don't know how\"\n \"It's cool, just go ahead an say it\"\n \"Well, it's just that I'm... I mean I like.... I'm a lesbian.\"\n \"Hmmm.  That's cool.\"\n  The fact that this knowledge did not slow him down for a minute turned her on even more.  Every time I looked over, his hands were places polite society will not let me mention in this post.\n  Oh yeah... this is supposed to be a review of the bar.  Good service, friendly staff.  Bouncers are not pricks when it's time to clear the place at the end of the night.  I'll be back.", 
    "review_date": "2006-10-09"
  }, 
  "t5ucFPyvl69c4sV2lgGl5Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dinner Dog X.", 
    "review_text": "My friend said she had, \"the worst time\" here but I don't remember much about it after thinking, \"$5 pina colada is straight booze.\"", 
    "review_date": "2010-05-16"
  }, 
  "20RreM5Um2LaMZT-dYAiDA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy C.", 
    "review_text": "I love the atmosphere, the bar style, the drinks, and of course the bartenders and the DJs and Bouncers.  They are all great people.   Give the bouncers hugs and they will warm up quick!    My favorite bartender is Lauren!!!!!!!!!!!!!!!!!!!!!!  I love you Lauren.", 
    "review_date": "2007-10-26"
  }, 
  "i6TGYF0mi-FePzzS7cnqBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassy R.", 
    "review_text": "All I'm going to say is ummmm, tasty drinks...get the giant one to share!", 
    "review_date": "2007-02-20"
  }, 
  "hYWwocw-J4KdyGLrUlOYXA": {
    "user_rating": 3.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Felicia L.", 
    "review_text": "After dinner, my boyfriend and I wanted to get a quick drink for our last night in SF. That quick drink happened to be a large fish bowl at Bamboo hut, and a few more drinks lol. They had a drink called Bye Felicia, which I think was named after me. Haha jk, I know... Friday. Bye Felicia. Anyways, drinks were good, and reasonably priced.   The theme here is tiki bar themed, obviously. This bar seems to hosts a bunch of locals, where everyone seemed to know each other. The bartenders were pretty chill and cool to talk to. They also were playing a variety of cool songs... for example they were playing the Zapp and Roger album. I thought that was nice, then they played 90's gangsta rap right after, then some indie rock music.", 
    "review_date": "2014-07-05"
  }, 
  "eBnToKDLoXxQvpwY6s5UdQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joy Y.", 
    "review_text": "One of the best happy hours in North beach, Love the blended  strong fruity drinks in fake coconuts.... downside being that it's only available Thursdays and Fridays....", 
    "review_date": "2006-07-12"
  }, 
  "xi94GOYwC9SXlxy3G1ZoZg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina B.", 
    "review_text": "LOL this place is good digs. Interesting crowd, amazing dj, strong drinks, and tispy bartenders. What can go wrong? I dont like sweet drinks at all, but the bartender recommened the pineapple volcano bowl and it was tasty!  Definetly not a place for everyone, but I'm quite alright with that!", 
    "review_date": "2013-04-01"
  }, 
  "UcqMlxgOOPqE_eMrE7zEOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty W.", 
    "review_text": "A random ass Tiki dive bar in the midst of a strip of Broadway clubs and strip clubs.  We wandered in here to get some cheap fuel and get hammered quick before we hit the clubs on Broadway.  The bartenders are really fun and kickback....same with the drinks.  You know those themed parties you go to, and it really feels like you're in a different city/country/era?  Nahhh, this is nothing like that.  The atmosphere of the bar has a cheeesy feel to it, and it definitely does not feel like you're on some tropical island.  ....But considering we go there to get hammered quick off of girly drinks on a Saturday night in the midst of titty bars.........whaddaya expect?  I like.", 
    "review_date": "2010-02-11"
  }, 
  "GxPDJujwVOzraJe_TJ_QHw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alex R.", 
    "review_text": "Went here on a Saturday night.  It transformed from dead to packed in about 15 minutes.  Great DJ with lots of fun dance music although there wasn't really anywhere to dance since it was so small and crowded.  Had to try the Volcano since it's what they're known for.  The flaming 151 was a nice touch.  However, once you take a sip everything seems a little less appealing.  the drink is very sweet, and you can barely taste any alcohol.  And once the ice melts it tastes like cough syrup.  Maybe it's because we tried the Strawberry Volcano, but it's way too sweet for my taste.  Also, one of the bathrooms was out of order which only left one for both men and women.  Long lines for a bathroom are a big no no for me.  Not cool when you need to tinkle.", 
    "review_date": "2012-03-25"
  }, 
  "Ha4mOL_9JtmYgn7NvrAu6A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis B.", 
    "review_text": "Not good or bad.  Kinda divey but I remember having a good ass time here the first time I came.  Second time not as much.  Maybe it was the crowd I was with.  The music is my style - aka anything you would ever here on 99.7 Movin'.  The clientele leaves something to be desired.  Most of the guys there looked like they wanted to latch on to your ass and dry hump you but couldn't quite make it to that level of audacity.  However just staring doesn't make it that much better.", 
    "review_date": "2007-10-08"
  }, 
  "1QzXWTu7PPtCYza4cYNTig": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer G.", 
    "review_text": "lo-rent version of trader vics/tonga room.  great if you like dive bars (i do), but i have two not so great memories of this place...  i stumbled into this place late one night with friends after trying out a few other places along broadway.  the very friendly doorman waved me and my friends in without the cover charge (seriously, a cover charge for this dump???).  thank god, cuz i had to pee...not just a little tinkle, i needed to pee like a racehorse.  you may be wondering why i feel compelled to share this with you - here's why: because the best thing about this place was that i headed straight to the bathroom and it was empty!  i mean, how often does that happen?  crowded bar on a friday night, you gotta pee something fierce and there's no line?  so i rush in, close the door and gingerly do my precarious squat balancing act on 4 inch stilletos, ass delicately positioned over the bowl and just as i'm doing my business, some guy opens the door!  not such a big deal, but he just stands there and watches me.  althought i am normally a very modest person, i don't bat an eyelash - i mean, i'm mid-stream of a drunk pee (which goes on forever) so i just i hold my precarious position, stare him straight in the eye and say \"if you keep standing there, you're gonna need to buy me a drink\".  he laughs, closes the door and i finish up. of course he's parked himself right outside...so i collect on my drink.  as ugly guy is ordering  i look around and realize the place is vaguely familiar...i think i've been here before.  he turns around and proffers the drink i realize where i am.  this is the the stinky coconut place!  i'd been there a few months before to meet friends for drinks.  as i sipped on my tropical concotion served in the requisite coconut cup,  an offensive odor hits me...i continue to sip and wonder who stepped in shit.  ugh, the funk hangs in the air, i can't figure out where it's coming from.  as i slurp up the last of my toxic drink i realize where the stink is coming from...the bottom of the coconut cup.  it smells like ass.  i'm sure it's got some crazy mold thing growing in it, but of course it's too dark to see. i complain to the bartender, but they don't seem too interested, at which point i start walking around and  asking other people if i can sniff their coconut cup.  this of course doesn't make the bartender happy - but it did finally get me my free drink - in a REAL glass.    so - 4 stars to bamboo hut for being a dive, but minus one for doors that don't close properly and for stinky coconuts.", 
    "review_date": "2007-01-27"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "I do applaud the Bamboo Hut's $3 Pabst -- which for being in the middle of North Beach, I was overall pretty happy with.  Maybe during the week this could be a chill spot but during the weekends, could take it or leave it.", 
    "review_date": "2011-04-03"
  }, 
  "ccspJ6HqYBsnh75_3aMtGA": {
    "user_rating": 4.0, 
    "user_location": "Oakley, CA", 
    "user_name": "kati m.", 
    "review_text": "Stopped in here while on a random drive to SF. Small, fun place with yummy $5 shots. Good music.", 
    "review_date": "2009-07-22"
  }, 
  "kdTZVCVq0zb5mhiFiT4Bjg": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "James M.", 
    "review_text": "What an amazing bar. When I first walked in, I was speechless.  The tiki decor was done right, which I can't say for most tiki bars I've been to. The staff was great, not to forget about the stiff drinks that was served to me. If I didn't live 400 miles away, I would be there weekly. So please come and support the Bamboo Hut, theres not many places like this anymore.  Say hello to the beautiful Lauren working the bar. I miss you guys! Hope to see ya soon.", 
    "review_date": "2007-10-31"
  }, 
  "2obAyPuH-G3Dn3EUdQnQlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dean E.", 
    "review_text": "third thursday of the month: rockin' like dokken. done.", 
    "review_date": "2005-02-23"
  }, 
  "XKEJg-JQQJ-LrEojdIU8aw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "M N.", 
    "review_text": "This review is all about the people at the Bamboo Hut. They were, in a word, fantastic. Some guy walked off with my backpack at the bar, which had my brand new laptop in it. I walked out and asked the bouncer if he had noticed anyone walk off with it, wholly expecting a nope, already cursing myself for letting it out of sight... and the guy says yeah, I did. Not just that, he knew the guy. He went in to the bartender and they dug up his number (apparently he was a regular). Couldn't get a hold of him, so they gave me the manager's card. The manager Mario followed up, called me the next day, said he had called the guy too, and he was going to text me when he had my backpack back. And he did. I came by and collected it the next day. And Mario apologized for any inconvenience to me! This was on a Friday night. This place was hopping, busy, lots of drinks flowing. The bouncer, bartender, manager didn't have to help out... but they did. They went out of their way to help me, and I was a first-time customer there. I'm definitely going back - if only to patronize a place that cares!!!", 
    "review_date": "2013-11-26"
  }, 
  "Tez6K6uBfQ8g2d5mIllyUQ": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Chris W.", 
    "review_text": "Fantastic! So much better than all the other lame bars in North Beach. Bartenders are awesome! No line on a Saturday night!", 
    "review_date": "2010-06-14"
  }, 
  "6KpxOoUnQyYGTd3Fuwk_lA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paige W.", 
    "review_text": "Definitely got the Volcano Bowl with a few others and also took advantage of the PBR and fernet deal [like $7 for a can and a shot].  The bartender was sooo nice and I just love the feel of the place.  We definitely left inhebriated   lol.  I want to go back and try the Zombie!", 
    "review_date": "2011-02-12"
  }, 
  "yl5SyOP_m2_2Zv9qE3s2aw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "emma g.", 
    "review_text": "Dear Bamboo Hut,  OH how I adore thee simple wonderful-ness that is you. You are a safe haven of Tiki proportions. You made me feel like a Hula Gurl on my birthday, and for that I will be eternally thankful.    You presented, as a birthday token, Ariel the DJ, who by all accounts and means wasn't even an embryo when she busted out with the BEST set that ONLY a true Soul Sister would understand. The party didn't stop there, we did the Limbo and practiced the Mashed Potato...we also 'dropped it like it was hot' even though some of us couldn't get back up again.  Mixologist Mustachio was like the cool parent. Keeping us respectfully imbibed with refreshing island beverages that almost made me forget I was still in my Hood and not in Maui.   All in all this is a fantastic spot, that puts out. I TOTALLY got lei'd, and what more could a Hula Gurl want on her birthday.?!", 
    "review_date": "2011-10-21"
  }, 
  "xV0zwASagIV-5wqMZZF_XQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth D.", 
    "review_text": "I love this bar. I checked it out for the first time on a Wednesday evening during happy hour. There was hardly anyone inside. I was expecting a dumpy dive, but this is actually a nice bar with clean bathrooms! There is a lot of seating, and comfy booths. The bartender was very friendly and my 3 friends and I got a good buzz going from 2 of the $12 happy hour volcano bowls. I should note, I once went to the Tonga room and was disappointed to find this supposed \"institution\" had NOT ONE flaming drink, the hallmark of a good tiki bar. So, Bamboo Hut delivers! To the people griping about the crowd, what do you expect in North Beach? Go on a weeknight after work and it won't resemble Jersey Shore.", 
    "review_date": "2011-02-28"
  }, 
  "5s-nynaYg4SUFiB0FS3bsw": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Eli B.", 
    "review_text": "I love this place.   Well mostly. I like the decorations, the bartenders, the music, the drinks, but however they sadly seem to get a large number of douche bags. Honestly though, the main reason I come here at all is for a drink called the CHI-CHI.  It is served in a glass coconut and has a sprinkle of heaven in it. Other then that I have no idea what it is and I look gay drinking it but the taste is worth it.  Try it is up there with the best drinks ever.", 
    "review_date": "2009-08-24"
  }, 
  "78gZJ9Wy-kxpvXoQBHL87w": {
    "user_rating": 5.0, 
    "user_location": "West Oakland, Oakland, CA", 
    "user_name": "Ivania V.", 
    "review_text": "Best Bar in town, fun vibe, great music, and drinks.. Plus the bartenders are awesome.. They know their drinks and make the experience fun.. If you don't know now you know. #fuckyocouch", 
    "review_date": "2014-10-05"
  }, 
  "XJhmTEAJuYRgIP4b9wMcTw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mason G.", 
    "review_text": "Definitely not my favorite place in the world.  If it were on Polk street,it would fit, but here in North Beach it feels too dressed down and out of place.  Also they can't mix a drink to save their lives.  Unless by mixing I mean, \"pour in a pint of vodka, add a splash of colored water.\"  'Cause they do that rather well.", 
    "review_date": "2009-06-08"
  }, 
  "u8N1v4Wm-8LhIw7xXr6qbg": {
    "user_rating": 1.0, 
    "user_location": "Fairfax, VA", 
    "user_name": "Layla L.", 
    "review_text": "I'm embarrassed to even admit that i've been here. It was only for 5 minutes I swear! But ya know... it fits right in with the rest of those clubs on the same block...  In one word: disgusting.  ok, i have a few more words..: smelly, small, dirty and filled with a buncha drunk people because the only way you could tolerate this place is if you were completely plastered", 
    "review_date": "2009-03-07"
  }, 
  "u6ms8jCUMd3qhlB6hufV-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly C.", 
    "review_text": "Who knew that there was a poor man's Tonga Room nestled between North Beach strip clubs?    We found this alcoholic tribute to all things Hawaiian kitsch to be a fun change up. I went straight for a MaiTai, which was delicious and ridiculous with a paper umbrella, however the flaming volcano bowl looks fantastic if you've got that kind of night in mind. The DJ, who holds court from a mini tiki booth played fantastic tunes on Saturday. Next time I need a tropical vacation STAT, I'll head right over to Bamboo Hut!", 
    "review_date": "2009-02-01"
  }, 
  "kaeyrXuyGa_K9w-TzjBgSQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kent T.", 
    "review_text": "Volcano bowl. That's all we got. Pretty ok since it was happy hour and split between 4 people.   Cocktail ice shake in bowl with flaming rum in the middle.  I tried to suck up the flaming rum up by a straw - don;t try it", 
    "review_date": "2012-01-26"
  }, 
  "dI1hgcobzzS_e2qQDABJzA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aron L.", 
    "review_text": "OK.  So it's faux beach party night at the Bamboo Hut and there's sand inside a bar in North Beach.  Sure.  I'm game.  Got some sand in my shoes.  That's OK.  Always glad to see some different new ideas to liven up the nightlife.  They have infamous Volcano Bowls, that are known in other places as Scorpion Bowls or some other tropical sounding thingamabob Bowl.  (i.e. Tons of hard alcohol is poured into a large bowl that is set on fire and many people drink together.)  I imagine it's some kind of group bonding alcohol abuse thing.  That's cool.  I'm open minded.  Anyways, I came, I saw, I limboed.  (And hurt my back.  Darn this aging process).  Anywhere that serves Tropical Tons of Alcohol Bowls gets at least three stars.  The fact that they'd do something kinda silly-fun like have a faux beach party gets them to four.", 
    "review_date": "2008-08-28"
  }, 
  "0m29JLi3LUtZ2e1Fp_nPvA": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Sharon M.", 
    "review_text": "It's the best Tiki bar in the city. I have been going to this bar since I was 21.  Wednesdays are my favorite nights because the place is a pretty much dead. It's perfects for a week night date, as long as you don't have to get up early the next day. They must put something in the rum because you can't ever have just one drink.  Saturdays are a  lot of fun too but nothing like a week night. It can get pretty crazy here on the weekends, I would go with the group. The only thing i don't like about this place is sometimes there can be some pretty creepy guys hanging around. I don't like the boys you the sideways baseball caps staring a my rack when in ordering a drink. Icky poo.  Update: Apparently if you are seen having to wait too long for you drink it just might be free! Also kudos on the photobooth!", 
    "review_date": "2008-02-26"
  }, 
  "K8nkgNBRnx7G7Umt-zmP9g": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "crystal e.", 
    "review_text": "Came here one late night to meet up some friend from State. Clean venue and friendly bartenders. The flaming volcano bowl is a must try.", 
    "review_date": "2009-06-06"
  }, 
  "SzQ9F-PN_KXKzh_7_bZNgg": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "nick w.", 
    "review_text": "i came here on 2 separate saturday nights. the first time it was slow and almost no one else in there. the second time it was insanely packed. tucked away in its own little world between the titty bars was this refreshing dive. got the volcano bowls. awesome deal. on the slow night it was decorated with plastic monkey and umbrellas. on the busy night it was just the drink and the flaming 151. worth checking out if youre in the area", 
    "review_date": "2010-07-06"
  }, 
  "IOlRGkqgyTMpQqbp7f2M8g": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "May Y.", 
    "review_text": "VOLCANO BOWL!!!!  VOLCANO BOWL!!  VOLCANO BOWL.  Need I say more?  Well, I'll add a little more so that it'll meet my Yelping standards (which are not very high).  You leave the bustling streets outside and end up in a tiki hut!    A creeper with long hair follows you and your friends around for a while.  \"You guys are hot\", he says drunkenly.  Well, he's totally harmless - after all, you're at Bamboo Hut to HAVE FUN and accordingly GET EFF'D UP!    You know what that means, right?  VOLCANO BOWL!!!  VOLCANO BOWLL!  VOLCANO BOWL!  Well the thing you do to GET EFF'D UP is get a couple of these with your friends in addition to your shots and WIDE RANGE of mixed drinks with quaint names that Bamboo Hut has to offer.  Then you get up and dance yo' ass off to their interesting music selection that consists of 90's hip hop and 90's rock (at least on the night that I was there).  The song transitions will be awkward, but for whatever reason it adds to the atmosphere.  Every song change is an explosion of awesomeness and anticipation, because you never know what freakishly random song will be played next.  The crowd is fun and friendly, particularly on nights when the SF Giants win the NLCS ;).  I know they are friendly because my friends were crowded together in Bamboo Hut, merely EXISTING, when a nice girl walks over to us and says, \"You guys rule!\" with her thumbs-up.  She also later asked to take pictures with us.  This place is just pure fun.  A great crowd and everyone is there to chillax or get really drunk or meet nice people and possibly take someone home, but I'll mentally leave that one out for now.  The bathroom could use some work.  Just FYI, this is the type of place where a lot of throwup gets cleaned every night...lol.    You know what they say, right?  PARTY AIN'T CRACKIN' TILL SOMEBODY YACKIN'!!!  And just for good measure:  VOLCANO BOWL!!!!!!  VOLCANO BOWL!!  Volcano bowl.", 
    "review_date": "2010-11-12"
  }, 
  "T6SuLkeGko0shJacHYWq6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate V.", 
    "review_text": "I had a lot of fun here last night with some friends.  We were just going to make it another quick stop, but it ended up being the stop.  The music was really fun and the bartenders were great (perhaps because my friends got them shots on my tab...ah crap).  There were a lot of fun and attractive people there and the drinks weren't too expensive (although a little strong, but I can't complain about that now can I...?).  Tip:  Don't let your friends and the bartender decide that your card will be everyone's tab for the night just because you're new...Really fun place, but I think the bartender screwed us with our tabs in the end.", 
    "review_date": "2007-06-17"
  }, 
  "bs0Nt1SUQSRjLm6j3N3CNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen L.", 
    "review_text": "I come here for awesome Mai Tais served by a bartender that looks like Taylor Lautner. You may find this bartender on a Friday night. Another night, I came here on their annual party where they covered the whole bar with sand. That night, I felt like I was back in the islands.", 
    "review_date": "2010-08-16"
  }, 
  "34EiW1yJn_7V9DkxZImydQ": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Melissa G.", 
    "review_text": "The place is small, and there's a cover charge for going in Saturday nights ($5), so why would anyone want to come here? Because of their Flaming Volcano Bowl! It is $16 and in the middle it's a shot of Bacardi 151.  I do not know exactly but I know it's really good, big enough to share with 3, maybe 4 ppl, and if u do split it between 3 or 4 ppl it's pretty cheap. The bartender kept on lighting up the bacardi with his fingers, which i thought was pretty cool.  CONS: -cover charge, i know it's $5 and that's not much but it's basically a dive bar -it's a dive bar -it's small  PROS: -the drinks are good and relatively cheap -the music is good -there is a tiny small (if u can even call that) dance floor", 
    "review_date": "2008-06-22"
  }, 
  "lVyUWqK2ghPzChhT_YsUBw": {
    "user_rating": 4.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Ms. M. M.", 
    "review_text": "I used to LOOOOVE going to the Bamboo Hut in my younger days: fruity beverages at reasonable prices, good location, fun atmosphere (albeit a bit on the small side), usually good tunes spinning, draws a fun crowd, awesome bartenders... all the good ingredients for a great bar.  Many memories have been made here, like the time I kissed a sailor... hum, make that two sailors, during fleet week.  Then there was the British boy I met there.  Oh, and too many birthday celebrations to count (no, they weren't all mine).    I hadn't been in years and decided to hit \"The Hut\" up for Friday Happy Hour.  I walked in with two girlfriends who I totally built this place up to... and the joint was completely empty!  What happened to the crowd that I remembered the Hut attracting for happy hour?!?  It was a fun experience none the less... our fabulous (and cute!) bartender, Tim (I think that was his name, the drink clouded my memory), mixed us up one of their deadly volcano bowls which helped us get the night going in style.  He would even come over and re-light the 151 floater when the flames extinguished... now that's service!  Conclusion: The Hut doesn't seem to be quite the place I remember it as... but like an old friend, I will not give up on it and promise my loyalty for all the good times it has given me in the past.", 
    "review_date": "2007-08-15"
  }, 
  "FAeIsKkBeXvpQpj6Zc29iQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "spiff e.", 
    "review_text": "bamboo hut is bumpin'. came here recently to check out a local band on a wednesday night. it was very chill, which is very much my speed. quite enjoyable with nice friendly bar staff and a good fun crowd. at least on that weeknight.  other nights are a different story, but still bumpin'. as in watch out for the people bumpin' into you. this is the story of one fun night turned sour (and chunky).  a fairly large group of us headed over to bamboo hut after work a while back. and i was chatting up some folks, having a jolly good time, until some big middle-aged oaf stumbled drunkenly right beside me and splashed his drink on my shoulder. rude!! so i turned around to see who it was and why everyone had cleared the floor around me. (stop reading now if you're eating. i'm serious.) it wasn't his drink that he splashed on me. instead, he yakked all over my shoulder and my arm and my back and my leg. yum, indeed. i stood in my spot for at least five seconds, shocked and disgusted and dumbfounded as to whether to punch the oaf in the face or hose myself off. luckily, one of my friends whisked me to the restroom in the back and helped clean off as much as possible.  and by the time we were done cleaning, all our friends had headed over to another nearby bar. and by then, the oaf was stumbling over himself on the sidewalk, so good thing bamboo hut didn't let him stay inside.  i tried to be a trooper, but it just didn't work. nobody wanted to dance with the girl who smelled like vomit. so it was time to call it a night. fun!", 
    "review_date": "2007-07-16"
  }, 
  "R5i-8R4vBov0wfNBGg2MwA": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Arlene M.", 
    "review_text": "Stopped by here for a drink since the wine bar we wanted to go to was too crowded.  The decor was pretty cheesy but at least it was pretty chill...we were able to get seats at the bar pretty easily, and they had fight club playing on one of their TVs.  The drinks were pretty decent...my first drink was some sweet berry-like thing, but I enjoyed my second drink more, it kind of tasted like a pina colada and was served in a fake coconut..  Not sure if I'll ever be back, but we had a nice chill time and there are worse choices in North Beach", 
    "review_date": "2010-06-27"
  }, 
  "xeCxtVNP0wU63xxdQ3DKvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer K.", 
    "review_text": "The best place on broadway to have some goodtimes. I think the weekends here are great fun, good people, quick/funny/good looking bartenders.  The cover is ONLY $5(weekends only), and it's well worth it. Especially, if you're going out to have a couple drinks and dance to the DJs. It definately rocks.  I've been here on the weekdays, it's a chill place to hang out.  It's definately the time to bring a group of friends down and chat, time to chat with the bartenders and regulars.  The music is a little different then weekends.  There is more indie/punk/upcoming bands played.. which I love to listen too.  I went down a couple times last week.  And on Wednesday, they had a band playing and Mondays are 'drunken fiesta' with nachos and beer specials. fantastic for getting through the work week.  Alright, and that's about all I've got to say about this bar.  It's a great change of pace, good fun, good looking people, low cover charge, tasty drinks, and the broadway brown... for all you whiskey drinkers =)  You should all try it out. It's good to have small neighborhood bar during the weekdays and fun party on the weekend. Of course, you can always make it a party on the weekdays.", 
    "review_date": "2007-10-17"
  }, 
  "qD51vvp5Zf5DgPEGy7yfDQ": {
    "user_rating": 4.0, 
    "user_location": "Ocala, FL", 
    "user_name": "Marsha Z.", 
    "review_text": "Cool place, drinks, and bartenders.  The sand and the leis were a delight for their themed beach party.  I enjoyed the atmosphere, including the bumpin' music from the 80s &amp; 90s.  Their flaming tiki volcano drink seemed a lil weak, despite sharing what was supposed to be a four person drink with only one other person (and then some, when we indulged with a few anonymous drinkers who had let us take a drink from their own volcano).  But a few more drinks solved that problem, my soberness, waning.  The patrons there were a complete trip.  It sure beat staying home on a Friday night.  I'll be back soon enough.", 
    "review_date": "2006-06-24"
  }, 
  "hwrVLbbudKQhQCPODQDxjQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Tricia R.", 
    "review_text": "we aren't from the SF area and having just arrived the day before, we stopped in on a recent monday night at about 10pm on the recommendation of our hotel concierge.  first thing i noticed?  pretty crowded for a monday, especially compared to other bars.  second thing i noticed?  about 5-6 skateboards stacked by the door.  apparently this is a preferred mode of transport in this city.  the crowd seemed quite mixed; there were people who looked like they were there after work while others looked a lot less casual.  however, since i'm not from SF, maybe the work dress code is more lax than NYC's!  we grabbed two of the few empty seats at the bar and jamie the bartender was awesome - very friendly and fun to talk to.  he also made a great drink recommendation, although i was pretty buzzed by that point and don't remember the name - sorry!  i had 2 or 3 of them, and they were quite labor intensive!    i wondered how the 2 restrooms met the building code requirement if that place was filled to capacity!  but on this night, there were no lines and the ladies' room was pretty clean.  the highlight of the night?  being the only met fan in the bar watching them beat the giants at home in extra innings!    if i head back to SF, i'd make it a point to stop in here again.", 
    "review_date": "2012-08-02"
  }, 
  "oiGLaV9a-kML76BtXc5t2w": {
    "user_rating": 5.0, 
    "user_location": "Manhasset, NY", 
    "user_name": "Marie-Line V.", 
    "review_text": "Great bar, good music and some space to dance, cool people hanging out.... They have a great happy hourdeal and the flaming vulcano drink is fun and original. Loved this place!", 
    "review_date": "2007-11-10"
  }, 
  "kLh6DJKLi9c46NqIokmPaA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Erin M.", 
    "review_text": "Yup, 5 stars to a tiki dive bar directly adjacent to a strip club. My mama would be so proud.   But really, when you want a tropical beverage, this is your place. Drinks are cheap and ridiculous. The four of us started off our day by splitting a Scorpion bowl: 151-infused rum slushy punch. By far, the most potent $12 I've ever taken part of (non-happy hour price, $16). The bartender was laid back and friendly; and for some reason, all four patrons at the bar cheered when we peeked in the door and welcomed us in.   Completely random, and completely wonderful.", 
    "review_date": "2008-07-01"
  }, 
  "rcU7ysY41qGppbw4pQgjqg": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Damien S.", 
    "review_text": "'Twas at the Bamboo Hut where I became a funkle. And I set my hand on fire.  To belabor you with details as to how I deserve the familial designation with an Atomic Dog twist, or why high proof alcohol, curiosity and an open flame do not a dull moment make, would not do the night justice.  This Tiki tavern, like all Tiki taverns, are made for groups. Loners posted up at the bar better be (A) hitting on the congenial 'tenders, or (B) coating their castaway sunburns with aloe while lamenting the loss of Wilson. Wilson! WILSON!  The Volcano Bowl marries a wash of rums with two scoops of frozen sugar and a ball of fire. Drink one or sacrifice a virgin to appease its gods - either way, it'll run you $12 during happy hour.  A \"ride slow\" nod for thumping LL and old skool Outkast in lieu of the expected Dick Dale or Gilligan's Island theme on repeat. Just goes to show: you can't judge a juke by its cover.", 
    "review_date": "2013-03-08"
  }, 
  "GWoMLIxwGUJMCfKUAXq5Rw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Genevieve S.", 
    "review_text": "This place is AWESOME!  For what it is, I think it's doing it right.  Came here on a Friday night for the first stop on our holiday pub crawl.  We were able to get a good spot for our group of 12, which was nice and happy hour was going until 9!  The Volcano drinks are tasty and reasonably priced!  And, of course, they are super fun!  The decor is fitting and they have some fun signs.  The DJs were AWESOME!! We went to a few other places looking for a fun dance party and ended up coming back here for the great jams.  It's a small place but it wasn't crazy crowded and everyone was great.  I will definitely be back!!  Also, NO COVER!", 
    "review_date": "2013-12-08"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "Friday Night = Thumbs Down  I'd rather be beat with a bamboo stick than be here. Nobody was there &amp; we paid a cover too.  Enough said.  Off to Dragon Bar.  Maybe another night won't be so Hutorrible.", 
    "review_date": "2008-02-11"
  }, 
  "LoLysvZP0o0hm-gk9qQONg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Captain J.", 
    "review_text": "Always delighted to head to the Bamboo Hut whenever I'm in North Beach.  It's certainly a unique bar with the fun tikki layout, the crowd is a good mix and the bartenders are a lot of fun.  The DJ pumps up the crowd and it's an awesome place, especially when people start dancing.  By far my favorite bar in North Beach.", 
    "review_date": "2011-09-18"
  }, 
  "ORJtryDngcfXQcLPY_Dv-A": {
    "user_rating": 5.0, 
    "user_location": "Alpharetta, GA", 
    "user_name": "Allyson R.", 
    "review_text": "This bar is the best!  I LOVE the Bamboo hut!  The flaming volcano bowl is the best mixed drink I have ever had.  I have been here on a few occasions and split this bowl with one other person.  Big trouble.  It is enough to split between 4 people.  I have left this place plastered and ended up on the streets of San Francisco not knowing where I am.  It is totally worth it though!  Nick, the bartender even taught me how to fire-blow and light my finger on fire safely!  I love this bar!", 
    "review_date": "2007-11-06"
  }, 
  "rDORGCGHV984OBXwqu2FYQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "belinda n.", 
    "review_text": "really gross like bacardi, pineapple juice, grenadine, &amp; a cherry &amp; theres your \"tiki drink\" the jukebox was the most tolerable part (punk rock) we took  a 4  min bus ride from chinatown (some of the streets are a little steep going northbound) the menu boasts of \"tiki drinks\" but like i already mentioned, they all either have bacardi, 151 or some other soul-less un-inspiring rum. yeah, the decor's tiki related &amp; not bad , city lights bookstore is around the corner, but skip this :(", 
    "review_date": "2014-01-01"
  }, 
  "gosNE62t1GQnbdITjC2bBg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie S.", 
    "review_text": "I invited a grip of friends to the Bamboo Hut on a Saturday night to take advantage of their yelp drink specials.  I mean, how could I say no to a $10 Volcano Bowl??  Tiki bars are my favorite, but they do tend to burn through your wallet rather quickly.  So my friends and I stayed for an hour or so enjoying volcano bowls. They offer pineapple and strawberry, with the latter being my preference.  All was going well initially. We got there at 7 (even though their door says 8?), and there was seating everywhere. There was about 10 of us, so we grabbed the bench seating in the back.  Loved the bowls, but I did not love the Bamboo Breeze cocktail. It was not at all what I expected. I'm not even sure if I got what was intended. I thought it would be blended, but it was essentially tequila on the rocks. No bueno.   What would have been a 4 star experience became a 2 star experience when the bartender (who we had been generously tipping since the bowls were so cheap) came over after only a little over an hour to tell us a group called in and reserved the table we were sitting at, and that we had to move when they got there.  WTF? The whole reason I had my group of friends get there at 7 was to guarantee we'd have a great spot for an evening of Tiki drinks. Why didn't he at least give us a heads when we sat down? Seems completely bogus to me.  I have never heard of a bar doing this before, and I was and still am very skeptical. Maybe if their website had a speck of information on it, I could find out if he wasn't full of it.   So 9:40 hit, and some random dude came over cleaning up all of our glasses making it very obvious we couldn't sit there anymore. Rude.  The crowd also became very thuggish and douchey after 9:00 (yes, even for North Beach). Every one of my friends (and myself included) who used the restroom at one point were hassled in some way, either face-to-face or by people randomly banging on the bathroom door. Perhaps they needed to lay off the booger sugar. One-toilet bathrooms weren't designed for group activities!  Due to this, I will not be returning to Bamboo Hut. It was all fine and dandy with the yelp prices and the early crowd, but after 9pm it was witching hour and the bar had completely changed its tune. No thanks.  Should I even mention how juvenile the music was? I'm talking middle school dance.  Terrible.  I'll be sticking to Smuggler's Cove, Tonga Room, and Trader Sam's. Some common respect is worth the extra cash.", 
    "review_date": "2012-03-06"
  }, 
  "AofPsNNuIwruTVNmrToKbQ": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Trevor F.", 
    "review_text": "I look at the cocktail menu...\n  \"Could be pink... could be pink... probably pink... definitely pink.  Hmm, tropical margarita.\"\n  Doesn't say what's in it, so I just cross my fingers and order it, along with drinks for the gf and a friend.  So, the bartender goes to work mixing up the cabana coolers and bamboo busters, or whatever they ordered.  I look back and she's pouring the first drink: PINK... son of a bitch.  I continue you my conversation and when I look back the second drink is being poured INTO A COCONUT... oh great, that's much better.  Now I watch intently as she makes the third, willing her with mind as she grabbed bottle after bottle.  \n  \"Not the grenadine!  Stay away from that cranberry juice!\"\n  In the end it ended up a nice pale green, and after reassurance that is was in fact mine, i gladly passed the pinko and the coconut to my compadres.", 
    "review_date": "2006-08-28"
  }, 
  "0RwIQ8MU-VEsYmZpT_v1VQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel V.", 
    "review_text": "This a is a cool (deceivingly small...thanks to all the mirrors) place in the North Beach area. They make pretty good drinks...one I saw looked like a Scorpion Bowl except that this time, they fired up the center of the bowl which is pretty frikkin awesome...especially if you are already intoxicated; something about that neon blue flame color attracts your eyes like a moth to a flame. The decor is what you would find at other tiki bars. Overall, a great place to hang out and chill with some friends", 
    "review_date": "2009-03-01"
  }, 
  "jon4_G7Ygk9l5ojeaGvRvg": {
    "user_rating": 5.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Andrea O.", 
    "review_text": "I came here last night with my girls for my birthday and I loved it. The atmosphere and music give out great vibes and don't even get me started on my drinks. I love Mario the bartender! I've never had such a great bartender like him. He takes great pride in his craft and I enjoyed seeing him create special drinks for me. I didn't try any drinks from the other bartenders but he had he sold completely.", 
    "review_date": "2014-09-21"
  }, 
  "OUd5cEYA6MXwBb8aNTEvMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katy L.", 
    "review_text": "This place has some great elements - group seatings, secluded lounge area, decent music, fun volcano bowl.   Add it up and you have a pit stop for otherwise mundane bar hopping in lower North Beach area.", 
    "review_date": "2012-09-01"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "Okay, so let me make sure I have this right.   In the Bay Area we have the Tonga Room, Trader Sams, Trader Vics, Trader Vics again, Trader Vics yet again, Hawaii West, Forbidden Island, Kona Club, Conga Lounge, the patio at Club Mallard, Temple Tiki Bar and Restaurant, Martini Monkey, Smoke Tiki Lounge and last but not least Bamboo Hut.  All decent bars if you like the tiki thing. All serve sweet drinks with umbrellas. Some have bad music, some have good music, some I just cant seem to remember the music.   This particular tiki bar is small and a bit divey. It is more Hanalei than Honolulu. It neither falls into the bad nor good music category because it varies depending on the night. It definitely falls into the hangover category. The drinks here are just as likely to make you puke as all of the other tiki places that serve you what essentially amounts to alcoholic kool aid.   It's sort of amazing, all of these drinking establishments with a tiki theme. Maybe I am not actually in NorCal. Maybe I have had one too many Hurricanes or Scorpion Bowls in my time and actually stumbled all the way to the Islands.   I do seem to recall that the Bamboo Hut IS the temperature and humidity of the tropics when its crowded, which it is on the weekends, typical North Beach style (the reason for the lower rating). So, remember to wear a coconut bra (or, of you are a guy, coconut bro) and a grass skirt.", 
    "review_date": "2007-07-24"
  }, 
  "hSD2Lu8Z_62klnMDND5sSg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "The place is small, dim and it can get crowded and there is definitely limited seating, but all in all this place is still a good time. They play some pretty good tunes too (I think there are different themes on depending on the day of the week). Drinks are pretty good, and prices are pretty decent as well.", 
    "review_date": "2007-07-06"
  }, 
  "_owMBYfzT9dO7FXGXXzXqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz T.", 
    "review_text": "My friends and I randomly wandered into Bamboo Hut, and it was one of the best unplanned nights ever. There were $4 tropical cocktails, two tons of sand on the floor (!!!), and guys buying us drinks without expecting us to talk to them whatsoever. (I officially dig native San Franciscans and Texans). Can a girl ask for more?   Of course! We got lei'd multiple times and free flip-flops, a tank top, and a glow stick. I felt like I was back in Hawaii with the tiki atmosphere and sand between my toes. Man, I really miss home now. Looks like it may be time for another trip to Bamboo Hut!", 
    "review_date": "2009-10-19"
  }, 
  "M0mONsg1ZJIKA30ad1qE1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina A.", 
    "review_text": "Come to have a good time with a group friends  Volcano Bowl: - yummy and strong, and yes, it does have a flame in the middle - would highly recommend  Entertainment: - live music that night [cover is $5 for guys] - get up and dance! - nights without live music charge no cover  Atmosphere: - decor was like a legit tiki house - dirty videos playing on the screen (uh oh! but hey, this is the red light district)   - tables are always slightly sticky, sometimes the seats are too...  Bathroom: - large and sometimes not stocked with toilet seat covers  Service: - friendly and fast  Overall: 4.5 stars for a good time with good service and drinks, minus 0.5 stars for cleanliness", 
    "review_date": "2011-06-13"
  }, 
  "LDxGB8GDYZ71AY1qHQt_Rg": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Joanne H.", 
    "review_text": "it's so crowded but i LOVE the music here. diverse crowd and great range of music", 
    "review_date": "2008-01-01"
  }, 
  "LJVqYAAkezBZFSdcicv0pg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madhu P.", 
    "review_text": "This is not an everyday type of bar, but if you're in the mood to rage a bit and are north of Market it's not a bad place to end up. The bartenders here are super friendly and there's usually a DJ or band keeping things lively. Skip the beers and cocktails and dive straight into a Scorpion Bowl for $20 to share with three of your best friends. Tonga Room seems to be getting all the love these days, but this is the real deal Tiki Bar in SF.", 
    "review_date": "2012-02-07"
  }, 
  "4aSerSuK8o9dNJqF359iEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David W.", 
    "review_text": "Great drinks! Good times!  Bamboo Hut is a great place to chill or to simply get your drink on. This place makes you feel like you are drinking on an island pub. I've heard that this place is filled with sand sometimes but when I went for my first time I was sadly disappointed to find that there was no sand.  The bartenders are great. They make delicious and strong drinks. Highly recommend the specials which include the volcano bowl (meant to be shared by at least 4 people) or the witch doctor.  Warning. The place is quite small. Almost a hole in the wall. Get there early to score a booth or you will be standing up all night.", 
    "review_date": "2008-11-17"
  }, 
  "74BW7lSDzZnJlNYkrQUC-g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Maya M.", 
    "review_text": "This is the BESTEST place for SF Bay Area locals to come hang out with friends and meet new ones!  Every Thursday the Bamboo Hut features 50s rock n roll, RnB, surf, exoctica and other Savage Sounds with resident DJs Miss Cherry Bomb and Dr. Scott.  Lovely Lauren pours your favorite spirits behind the bar and Nick welcomes you at the door!  Come celebrate your birthday, bacchelorette or bachelor party with us!", 
    "review_date": "2007-07-02"
  }, 
  "3lWC0riFiQmnchl1BYZYKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott G.", 
    "review_text": "I came in here during a friday happy hour with my friend and the place was pretty empty for the time of day/week.  My friend and I split a Volcano Bowl and I must say...Wow!  For $12 you get a massive bowl of rum and fruit set on fire (the bartender came very close to letting the lit rum spill onto the bat, which he said actually has happened on occasion.  It is definitely a place worth checking out with a few friends and splitting a Volcano.   From reading reviews on Yelp, I thought the Happy Hour special was $4 drinks so I decided to go nuts and get a zombie.  I was a little shocked to hear the $10 price tag.  I then learned that the happy hour is $2 off drinks, and Zombies are normally $12, fair enough, now I know better.  For the extra $2 I am sticking with Volcanoes from now on.  I am from Alameda so I have been spoiled by the deliciously well crafted tropical drinks they make at Forbidden Island so I was a little dissapointed in the Zombie that I had.  It was strong as hell, but not what I was expecting, basically a tropical Long Island Iced Tea (Big Island Iced Tea?) I will have to check out Smuggler's Cove to determine where my new Tiki bar in the city is going to be, but Bamboo Hut definitely serves its purpose.", 
    "review_date": "2011-10-18"
  }, 
  "Qk_UtOU0DGxslGbWz5RHhw": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "caroline k.", 
    "review_text": "I went to this Bar after our Christmas Party in the City. All of us were dressed up pretty nice and we wanted a pretty cool place to chill. After reading the reviews here on yelp, a co worker and I thought that this place would be seriously amazing! All of the reviews said that they had the time of our lives. Well let me be honest-when you see the picture of this place it looks so much bigger than it really is. There are two booths in the whole place and a lot of standing room. The DJ is right on the floor in a little cubby hole playing music out of speakers that you stand right next to. You also have to pay a five dollar cover charge...I didnt really like the place. The only good thing about Bamboo Hut is that the drinks were strong and we got one for free. Other than that, I will not go back there. It is also in the middle of the strip clubs and not that nice. Dont go there unless you are dressed down, wanting to stand around...and willing to pay a cover charge.", 
    "review_date": "2008-03-19"
  }, 
  "sVa3XiJaLgmIbLqLZ8Djag": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M D.", 
    "review_text": "kind of reminds me of the sigma chi cowabunga party from my college days.  bamboo everywhere!  the dj was fun and the bartenders were cool.  a good warm up for the dragon bar.", 
    "review_date": "2005-07-10"
  }, 
  "sYQxPB8JzrdFAbgP3y_Rlg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Sivan B.", 
    "review_text": "My current favorite bar in San Francisco.  All the bartenders are super nice, friendly, and hot.  Filled with friendly people and a \"come hang with the locals\" atmosphere. And when Steve the bartender is in charge of the music selection it is AMAZING.  You'll find me and plenty of my cute girlfriends at this bar on a weekly basis. Take a photo in the photo booth and send it to the Bamboo Hut's myspace page at <a href=\"/redir?url=http%3A%2F%2Fwww.myspace.com%2Fsfbamboohut&amp;s=b23ad0bf8c49941d87178da57d266dc1e015d09fb61f09eeb0aaafbf521747ec\" rel=\"nofollow\" target=\"_blank\">myspace.com/sfbamboohut</a> and you will be immortalized in their hall of fame. Oh, and sometimes they fill the floor of the bar with sand and have an indoor beach party. Seriously. WAY too much fun.", 
    "review_date": "2007-10-25"
  }, 
  "xLldDRZe1DCTY-05-OIauA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ladi Da A.", 
    "review_text": "Cool/Fun!  However, that could be because I was with my BIS study group...really cool/fun people!  LoL", 
    "review_date": "2007-03-31"
  }, 
  "qUg4PXAT42bxV48CqPaUwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnny C.", 
    "review_text": "You walk in on what appears to be the set of LOST. It's Tiki Central there, complete with the tropical drinks, \"wid a widdow umbwewa.\"  If you rely on the theme to pop you out of where you are (North Beach) instead of looking for faux tropical escapism, you won't be disappointed. The crowds can vary as well. You either get the weekend invasion crowd just looking to do some SERIOUS damage to the interior of their Noggins, Leaving Las Vegas style, \"I think I'll name my first born after Superman's dad;\" or you get the worker bees that wanna bust lose on a bad weekday night. I walked in on a quarterly trivia night fund raiser that's held by Community Educational Services and the China Town Beacon Center. Hella Fun...and it's for kids (awwww!) But seriously, I hope they hold trivia night there quarterly. Created a fun, lively atmosphere complete with fun bartender that knew the names of the original Charlie's Angels (CHA! Jill, Sabrina &amp; Kelly..BU-YA!).... So the Bamboo Hut's the place if you're in the mood for lighthearted fun and strong, strong ..um ... beverages.", 
    "review_date": "2006-03-02"
  }, 
  "FgGiQc9zpM_va5JZMvJtMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea B.", 
    "review_text": "A tropical-themed dive bar with sugary drinks that go straight to your brain! It has its purposes. I can still feel that lemony drink that tasted a bit like lysol, probably could have done without that one. The volcano bowl was visually impressive and was a fun drink to share, but if you're expecting any other taste beyond starburst soaked in vodka then look elsewhere. I did enjoy my mai tai, and the bartenders were friendly. I also appreciate the DJ situation.   All in all, a decent place for the right night. Proceed with caution and hydrate.", 
    "review_date": "2013-07-19"
  }, 
  "qCA4T_fLCnwLhLHWvPUYYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "I always knew my first legal drink would be something fruity and on fire.  Yeah, I came here on my 21st with a couple of my friends.We shared a flaming volcano bowl, (which I know has been talked about to death on here, but how can you resist one in a place like this?) and it was fucking delicious. If you're into the whole fruity drink thing, you'll probably like it too. If not, you can just pound down some shots, or have a beer, neither of which are horribly expensive.  This place has a friendly, laid - back vibe to it. It's not intensely decorated, but you can definitely tell it's a tiki bar. The music didn't exactly match the vibe, mostly pop/hip hop stuff, because I think on slow nights, it's just the bartender fucking around with his laptop. The service is very good during slow hours and on weekdays, and although it looks like it can get crowded on the weekends, it's still worth going.", 
    "review_date": "2011-08-25"
  }, 
  "fsgQfAchMk5XuPx4_GcwDg": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Jillian J.", 
    "review_text": "Right after I moved back to SF after living in the LA area for almost four years, this is where my friends took me.  It was a small place and we got there a bit early so we took over the back section that was kind of like a private booth.  Perfect since there were about 10+ of us there. As the night went on, the place got more and more crowded.  It was an eclectic mix of older and younger folks.  The music was alright.  The drinks were good.  I remember that the bartender said we used up all their glasses.  That was funny.  All in all, I had a good time.  There wasn't much dancing but I enjoyed just hanging out there with friends.", 
    "review_date": "2008-10-16"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "We stopped in here for a drink after having dinner nearby. It was pouring outside, and this was a nice little oasis from it.  The bartender was really cool. Chatty without being overbearing, and he made awesome drinks.  My go-to is always a dirty martini, but I figured as long as we were here, I'd go with a fun, fruity drink.  I almost always find these kind of drinks too sweet, and too light on the alcohol, not the case here! My husband and i had different drinks, and we both loved them.  We got lucky the night we were here, and found parking right outside.Although,i think on other nights it would be a lot harder to find a spot.  If i was nearby, i would definitely stop in here again!", 
    "review_date": "2012-04-16"
  }, 
  "_pIG1_s6Bzymn1zeyLjBHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace K.", 
    "review_text": "How shall I word this??  Three friends and I entered this rather divey bar as our last stop for the evening, after a full night of drinking around North Beach. I asked the bartender what she is good at making, and she said, \"Anything tropical!\"  That automatically brings Pina Coladas to my mind, so I picked that, and then so did everyone else.  Three minutes later, we had four Pina Coladas before us, delicious as promised, in large, fake coconut jugs. We all hollered, \"ONE SHOT\" and downed them all and gave ourselves severe brain and lung freeze instantly.  For kicks.  Ouch.  And then we did one more round of ONE SHOT PINA COLADAS, declared it a night, and went home.  Good times!", 
    "review_date": "2008-05-17"
  }, 
  "TcvCaYSlc94Ury0DK2R3WQ": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Troy M.", 
    "review_text": "To do it right: $15  The awesomeness of this place cannot properly be put into text, but I'll try to highlight: 1. It's close to House of Nanking. 2. It's on the \"colorful\" border of North Beach. 3. Giant flaming bowls of delicious booze.  At Bamboo Hut, your order can literally be: One blended drink in that bowl, on fire, and delicious.  It is so, so great.  Also, inside tip, string 3 straws together so that you don't have to lean in to drink  The downside: not much of an ambiance.  However, the locale is ideal for pre- or post-partying.  Summary: Giant, flaming bowls of delicious boozeness that are great for sharing.  Pray to the tiki god.", 
    "review_date": "2009-10-02"
  }, 
  "4tJndq_LK-kfYaxLNYfEKg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tobias H.", 
    "review_text": "The Bamboo Hut is a tiki bar located on Broadway at Kearny. One would not assume that a tropical oasis awaits behind it's nondescript entrance. The Bamboo Hut is a place that I would hang out at even if I did not work there.  What makes the Hut so special are those casts of characters we call regulars. We have had a lot of fun whooping it up at the Hut. Every weekend our DJ's will get you to dance and sing along to the hits of the 80's and 90's. Every third Thursday is Rockin Like Dokken a night devoted to 80's rock and metal. There is also a ridiculously great happy hour every Thursday and Friday (5pm-8pm) with half priced Tiki Drinks and $3.00 Red Stripes.  Make sure to have your next party at the Bamboo Hut. We specialize in private parties as well as accommodating large groups.  Next time you find yourself in Northbeach make sure to drop by the Hut! Ma halo!", 
    "review_date": "2006-06-19"
  }, 
  "6wMrH46ZTu_YLWJHrUDLsQ": {
    "user_rating": 4.0, 
    "user_location": "Folsom, CA", 
    "user_name": "Mandy E.", 
    "review_text": "It's definitely a little taste of island-y-ness in the city. I stopped in and grabbed some drinks and enjoyed the low-key atmosphere in a booth. Good place to meet up and enjoy the music and drink some brews.", 
    "review_date": "2013-04-06"
  }, 
  "X64PtriEMr58QSSxIX5AVg": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Toni A.", 
    "review_text": "I was at the Bamboo Hut in 2011 with some friends on a random Wednesday. We ordered Mai Tais that were quite good and didn't make me sick. (Tiki bar drinks have notoriously been cruel to me!) The drinks came fairly quick, so I opened a tab.    The music sucked and the place is stinky but I can see past that; just because I don't like the tunes they doesn't mean the place sucks. What they lost me with was the drunk bartender, not tipsy, obnoxiously DRUNK! this wouldn't be such a bad thing if they hadn't charged my credit card *twice* after I had paid my tab in cash. I have no way of knowing if they were just drunk and stupid, or were actually trying to pull something. I got the money back from the bank but still, what a pain in the ass.   In short, I will not be back.", 
    "review_date": "2013-04-22"
  }, 
  "qrWBXu3vcvodzJMHAXexdQ": {
    "user_rating": 5.0, 
    "user_location": "Danville, CA", 
    "user_name": "Vaness I.", 
    "review_text": "YAY! It seems I love \"huts.\" They attract me.  High fives for all their bar tenders, esp Lauren, since that's pretty much who we come to see. The place can get packed, gets a little cozy, but fun and 100% bar experience. Great DJ's &amp; music. If you're looking for a pub or a club, this isn't your place, since it's a TIKI BAR. Some of the sour reviews below amaze me.  Yes, I have: *blacked out from a night of fun here *puked from a night of fun here *suffered my first really painful hangover after a night of fun here *witnessed great pukes &amp; black outs from a night of fun here &amp; *started collecting awesome personal stories thanks to Bamboo Hut.  If you know how to have a good time, you'll have a blast here!", 
    "review_date": "2008-03-06"
  }, 
  "8Ewy0oAOXN7rwOinjxYEOA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela H.", 
    "review_text": "So we went here for my early birthday/graduation/going-away party a few weeks ago, and yeah, I had fun.  The music was absolutely ridiculous in that awful-amazing kind of way, and really, you can't go wrong when drinks are served in plastic coconut husks, right?  The bouncers were perfectly sleazy, winking at me and letting me know that i owed them, later of course.  I really just love that it's tacky inside.  It  hurts my eyes.  That's a good thing.  The crowd was kind of eh.  Random, and just eh.  And I really hated when the bachelorette  girl came in.  I was like \"HAY I AM THE CENTER OF ATTENTION TONIGHT, NOT YOU!\"  Then I ruined my brand new phone.  OOPSIE.", 
    "review_date": "2009-02-21"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "$12 volcano bowls during happy hour with sea horse and monkeys adorning the drink? Sign me up! I couldn't ask for a better way to spend an evening.  Bamboo Hut started off what ended up being a very eventful Friday night. Just a small group of us left the office with the intention of doing a low key Chinatown/North Beach Bar Crawl - and if that's what your plan is, probably shouldn't start of the night with rum drinks. Lesson learned there, folks!   But I digress. We walked into to Bamboo Hut around 6 pm and it was relatively empty. Which I found surprising since the drinks here during happy hour are so cheap. Three of us split the giant volcano bowl and another two split the pina colada. Both were generous with the booze, yet didn't taste like rubbing alcohol. Maybe this is more of a late night spot? Regardless, we had a blast. Love a good Tiki bar and this bar is no exception. Can't wait to go back with friends and share in some more drinking delights!", 
    "review_date": "2011-07-13"
  }, 
  "MeHmu-e3f5f4SmHmQ6U1MA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "John C.", 
    "review_text": "sand on the floor and tiki.  went on a friend's recommendation and this place did not disappoint.  fun, cool, laid back people.  great bartenders.  it's a dive bar with sand!", 
    "review_date": "2010-10-02"
  }, 
  "92jIgThUgeuPYigOGwvKIg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "K P.", 
    "review_text": "I haven't been to the Hut in a while..... I always remember having a great time!!! I recommend the Volcano drink if you're out with a group, it's awesome and HUGE!!!! I believe they light it on fire too!!!!  Good times!  Now that I know they have made some improvements, I will have to go check it out again soon!", 
    "review_date": "2010-06-15"
  }, 
  "-TrZfd9aC4k_7A2i0icMVg": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Maria M.", 
    "review_text": "My drink of choice...a dirty martini. But this doesn't mean I'm one to pass up a good \"girly\" drink. When in a tiki bar do as the natives do and go with fruity.   I have not tried a bowl here. But I have had the Lava Flow consisting of light rum, strawberry puree, pineapple, and coconut mix. So delicious and fruity.  The service here was friendly and while sitting at the bar I saw that they have a number of regulars they know by first name. While that may never be me...I live on the other side of town, I will definitely stop in here again with more people and try one of those magical bowls.", 
    "review_date": "2012-01-12"
  }, 
  "Rqg9Rf5ybblqBZ0p5iPn7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cathy Y.", 
    "review_text": "Volcano bowl(s) = giant bowl filled with fruity drink plus FIRE + little plastic mermaids in the drinks (and somehow in my purse the next morning whaat?) +  8 friends cramming into a little booth + musical favorites including the Footloose song + sighting of MCLOVIN aka christopher mintz plasse - sighting of MCLOVIN because he was too busy mackin' on some girl to turn around when I tapped him on the shoulder to say hi. --------------------------------------------------­--- = a great night", 
    "review_date": "2010-10-20"
  }, 
  "Dz8DrAyYNU-5IzRi1qV1Og": {
    "user_rating": 3.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Young Q.", 
    "review_text": "I have to say, for a small dive bar, this place is full of surprises.  Can you imagine a Hawaiian themed bar blasting Eminem music. It was quite funny and amusing to me.  They have some pretty cool island themed drinks and the bartender there seemed quite accomodating as I have witnessed some folks bringing in their own alcohol and requesting the bartender making drinks with that.  Pretty awesome.  We tried the \"tipsy turtle\", which to me felt like a more lethal version of long Island.  Honestly thought it  tasted like crap to me, but dont worry, I was sober, so to \"normal party folks\" this should be just right.  The drink was definitely given a generous amount of alcohol and you get to take home a plastic monkey as a souvenior.", 
    "review_date": "2009-04-20"
  }, 
  "F4qvQtMnlxyoafeBTUDUDA": {
    "user_rating": 4.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "owen l.", 
    "review_text": "Great bar. Great music. Bartenders are funny and nice. $5 cover for men . Ladies are free. LOts of drink specials. DONT LET THE FIRE FOOL YOU. The bowl volcano drinks are terrible.", 
    "review_date": "2014-03-23"
  }, 
  "3SAAn35I_-kj6a7nqqBAmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura f.", 
    "review_text": "all i can say - volcano bowls. where else can you get a huge flaming drink and share with your friends?  i also am a huge fan of when they truck in the sand during the summer. if only the weather was hotter it would be like hawaii..", 
    "review_date": "2011-05-25"
  }, 
  "t_CfV21zTPkTSFV90NewCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay N.", 
    "review_text": "While the 5$ is a drag, I have to give this place 4 stars because I had such a fucking great time here on my birthday. First thing to understand about the Bamboo Hut - Go in a GROUP! The kitsch interior will be better, the booze will be better, the music won't be as bad, etc., etc. Also, the nice folks at the bar waived the cover for everyone in my party. That's probably because I'm so charming, but I would guess at least some of you are also.  Seriously though, as a jumping off point for a group friends hitting the town hard, flaming booze in the back room is hard to beat. Among a group of cynical bon vivants, everyone managed to have a good time. The only real problem is when I stood up on the bench with a volcano bowl in each hand in order to summon the TIKI GODS of FIRE!! I'm almost fell and spilled flaming booze on 20 of my best friends. Thanks to my ninja-like reflexes, they were spared that fate.", 
    "review_date": "2007-05-22"
  }, 
  "0gGcIkHOTDMl_6p5RGnuFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan L.", 
    "review_text": "Stopped in on a Saturday Night for a drink. Bar tender was super sweet and did a solid job at making my drink when I ordered something \"Strong and Sweet\".   The vibe at this place is great and the Live DJ rocks. If you get in earlier enough they have nice booths and tables. Tiny little place for dancing, but the music is just so good you can't help it.   Bathroom is pretty clean, the velvet curtain as a door in the ladies room reminds me of a weird porn or strip club.   I can't wait to head back here for another night out.", 
    "review_date": "2012-12-29"
  }, 
  "qRBTAUOEWrBY9N1JszH1ow": {
    "user_rating": 5.0, 
    "user_location": "Duluth, GA", 
    "user_name": "Swetha G.", 
    "review_text": "Fun, fun, fun!  This place oozes with wicked drinks, fab music and uber cool funky people who know how to get down and dance.  Every time I enter this bar I have so much fun I leave feeling giddy and like I've shed ten years.  The drinks are pretty to look at and are very tasty.  The people are ridiculous and know how to shake their butts whether it's to Madonna or Snoop.  The space is a bit tight but the tikki vibe will make you feel like you're vacationing and you might not mind it as much.  Oh and don't miss out on the big \"bowl drink\" with the fire in the middle.  It's jumbo size and served w/about six straws, totally delicious and worth every penny.", 
    "review_date": "2008-06-16"
  }, 
  "Rp8hHh-2U8Nh-7FhhspVxQ": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Joy A.", 
    "review_text": "Not the cleanest place in the neighborhood I must admit, but...  Wowza.   Where in the world can u get 5 shots of vodka for $18? Dare I say impressive...or is that just something dangerous waiting to happen?   $3 shots perplex me.   The mixed drink specials are a pretty sweet deal, too, and I mean that literally. With names such as Mimi's Lemonade ($8) and Mango Madness ($8) you can only expect a different mix of sugary delights. Both cocktails were delicious, but were creepers waiting to hit.  Not as impressive, however, was their cleanliness. Although there was ample table space to choose from, and even an open private area in the back that could easily fit 10 people, the moment I sat I felt something sticky on my derriere. Apparently their bench wasn't clean. It left a slimy, sticky film on my jeans. I walked into the bathroom to clean myself off a bit, only to find the sink falling apart.  Cleanliness aside, the bartender was very friendly. Drinks were served pretty fast and kind words and jokes were shared.  Bottom Line: Would I come back? Sure. For a quick $3 shot, no problem. I'll be sure to check my surroundings before I sit down though.", 
    "review_date": "2012-01-08"
  }, 
  "2ysxAEmaUmTBMKHud3aSFQ": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Tatyana D.", 
    "review_text": "Went here last night after getting some pizza in North Beach. I hadn't expected much from a place that looked so freakishly Hawaiian trendy but actually ended up loving it and will undoubtedly return.   First, we were there at happy hour, which meant that our 5 mix drinks and 2 shooters came out to $27. That's pretty damn sweet.   Mix drinks: I had the cabana cooler, my friend had the tipsy turtle. Both delicious and deceptively tasty but quite strong.  Shooters: I had something with razzberry rum, OJ, and cranberry, and he had the shark attack. Shooters is a very innocent word for what were essentially scotch glasses filled with shooter drinks. Gigantic and tasty! The place itself was not too crowded and lively, it was early in the evening still.   My only issue was with the fact that the bartender partook in one helluva fucked up conversation with the girls next to us that made me really wanna spit in his face and call him a fuckass, but since he nice to us and probably didn't realize that he came off as an antisemitic douchebag I just hated him on the inside instead. But since this is an issue of personal stupidity and not related to the bar it's not really gonna bring it down. Let's just say that the bartender with the mohawk is an ass.", 
    "review_date": "2009-11-08"
  }, 
  "qD1G80F6gqCdazvf38AkmQ": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nikhil V.", 
    "review_text": "Strange bar that makes little effort to differentiate itself from its neighbors on Broadway. The drinks were watered down, the lights were turned up bright, and the floor was a sticky mess. All this quite early in the night. Not recommended!", 
    "review_date": "2015-01-26"
  }, 
  "zJQMUOa6uJrEqBou1UN3gw": {
    "user_rating": 5.0, 
    "user_location": "Burbank, CA", 
    "user_name": "Rohana L.", 
    "review_text": "One of my favorite bars in sf! I seriously want to try all their drinks! Each drink has its own unique name and flavor. I've only been here twice and the first time I got a volcano bowl that me and a couple of my friends shared and the second time I went I got the Bye Felicia. I loved both drinks and they were really cheap too! Can't wait to go back!", 
    "review_date": "2014-03-24"
  }, 
  "txvgzVJIv7kyHNnyZWUFDA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cristofer P.", 
    "review_text": "Dating Tip No. 523. A booth in a busy bar should either be for entourages, or if it's just a guy and a girl, for making out. There's nothing that screams awkward more loudly than two people trying to hold a conversation in a loud crowded bar by taking up an entire booth to themselves.  Somehow filling the great chasm between dive bar and tiki lounge is the Bamboo Hut. It doesn't manage to quite achieve either of those things, but finds some redemption in its creative drinks (some were a bit too creative). The eclectic selection of music played way too loudly makes conversation here impossible, and the random oldies ballads inserted at inopportune intervals discourage any dancing from taking place. Combined with tv screens playing Dumb &amp; Dumber and you've got a bar full of people staring off into space, focused on anything but each other. If this is being social, next time I'll stay home.", 
    "review_date": "2011-01-16"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "Bamboo Hut has two magical items which make it stand out from the majority of San Francisco bars.  1.) Pina Colada 2.) Volcano Bowl  Sip on a cold refreshing Pina Colada from a coconut bowl, while jamming to MoTown hits -  till you get brain freeze (apparently the best way to remedy said brain freeze is to jam your tongue up sharply into the roof of your mouth)  A seriously What's Up way to bring in the weekend.  Trust.", 
    "review_date": "2011-07-10"
  }, 
  "5rK8eYZHUvugbVoAjvUX0g": {
    "user_rating": 4.0, 
    "user_location": "Point Richmond, CA", 
    "user_name": "Barbara C.", 
    "review_text": "i love coming here!! if it isn't packed with the odd crowd that is sometimes found here and we get a table its a great time! we share the flaming volcano bowl and enjoy the decor (over the top tiki theme) which sometimes can just be what you need to start a fun night! The negatives are that the bathrooms have been disgusting more then once and sometimes the crowd can be a little annoying.. just get there early enough for a table and you will be fine ;) the bar tenders are always super nice to which helps!", 
    "review_date": "2009-06-26"
  }, 
  "Uqg8zgMw-JYJNpjVtFXqng": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": "Nicole R.", 
    "review_text": "I've had some good itmes here. It's a super fun place--come on, it's tiki themed.  The bartenders are awesome. The music is good. The crowd is mostly chill and totally unpretentious.  It kind of reminds me of the Tonga Room, but way smaller, less touristy and less expensive.", 
    "review_date": "2007-01-28"
  }, 
  "t3Vb_q7xdDWDqab_NFOZpg": {
    "user_rating": 1.0, 
    "user_location": "Schenectady, NY", 
    "user_name": "Anonymous V.", 
    "review_text": "This place is full of Red Sox douchefans.", 
    "review_date": "2010-12-25"
  }, 
  "ayHlDMDiPWgoyBifSBD2Ew": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Alannah T.", 
    "review_text": "I think I'm a REPUBLICAN.  I was previously under the impression that I was NOT a Republican, but a recent visit to the Bamboo Hut made me question my political identity.  Oh, this is not because I've suddenly seen the logic in abstinence based sex education or am now considering joining the NRA (both of which reasonably COULD happen after a Saturday night in North Beach).  No, I'm questioning my political identity because I felt pretty comfortable in the Bamboo Hut even though it was populated by what appeared to be members of the Republican caucus.  The men's uniform: Striped shirts!  Khaki pants!    The women's uniform: Ann Taylor! (or maybe J Crew?)  The music: the play list from my jr. high and high school dances. (I vaguely recall dancing to Guns n Roses?).  Ok, no Funky Cold Medina, but we got there late, so it COULD have been played earlier.  The signature drink:  The FLAMING VOLCANO which does involve actual fire and is basically a LOT of alcohol mixed in a BLENDER!  The tiny dance floor: BLAZING whiteness in both appearance and technique!  Woooo-Hoooo!  The bartender: Apparently, not a believer in a welfare state as there were NO FREE DRINKS.  However, Mr. Bartender was also the nicest, most pleasant bartender in recent experience --- think Mr. Rogers the bartender.  Like I said, I felt pretty comfortable here.  I'm voting four stars.", 
    "review_date": "2007-02-25"
  }, 
  "VejWo995n1bIAZdIXNo6qA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Jeffery S.", 
    "review_text": "You will have fun at The Hut, a.k.a The Banana Hammock.  Marshall and if you're extra lucky, Steve or Nick White will make sure of that.", 
    "review_date": "2007-06-06"
  }, 
  "d_PpLupyQVODoHe3ErhKvA": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Michelle W.", 
    "review_text": "My sister's fiance made the mistake of having his bachelor party at a club which charged $550 for two VIP tables, and the service was horrible. My husband took the opportunity to introduce them to Bamboo Hut.  All of the guys agreed that the Bamboo Hut was the bar where they had the best time.  The bartenders and staff are very friendly.  The drinks are great and you never have to wait around to get another.  Oh and did I mention the price?  Compared to the quality and size of the drinks you feel like you are getting a great deal.  It's a great bar for a girls, guys or couples night out.", 
    "review_date": "2008-06-04"
  }, 
  "v5xfQidWLPrRx87tx0dDDg": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Daneca V.", 
    "review_text": "Tiki bar ooh tiki bar, how I love thee. I am a total slut for divey, kitschy tiki bars and Bamboo Hut gives me a major woody every single time. They used to have a board of specialty shots for $5 (which I haven't seen in a while) but my personal favorite was the Pearl Necklace ;-).  Come during happy hour, their already reasonable prices get quite reasonable! $12 for that massive volanco bowl? Hells yes!  They do get incredibly packed on weekends, and whenever they have a live band there is a cover charge, $10 I believe.", 
    "review_date": "2012-01-12"
  }, 
  "LTI86BSXBclY6UsZXqKYXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen C.", 
    "review_text": "Bring your island outfits!  This is a tiki themed bar located on Broadway near the night clubs and strip clubs. I'd recommend this place for a pre drink before starting your night. The place is quite small and has a couple tvs to watch sports.  The drinks are average and nothing special. They do have a couple cool bowls to share with a large group that light on fire such as the volcano bowl. The place also has some drink specials that are not too bad for the price. The portions are generous too.  I think I'll come by next time I'm in the area to get a quick buzz going!", 
    "review_date": "2014-12-14"
  }, 
  "K_fpgwjKa63vwSg3Xt0PMA": {
    "user_rating": 1.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Jack R.", 
    "review_text": "I went to this bar after a long walk craving a cold beer. What I received was a room temperature beer. The bartender made no attempt to rectify the situation; we left, leaving no tip.  You can imagine how surprised I was when I checked my bank records and discovered that the bartender had decided to give himself a $10 tip, on a $14 bill. That bartender better pray he never runs into me again, just as I pray I'll never run into Bamboo Hut again.", 
    "review_date": "2008-09-10"
  }, 
  "9kvzAuCNFpuu-Smx2Uf4FQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Monique M.", 
    "review_text": "Went to SF a few weeks back for a friends Birthday party. We ended up here. Such a fun night!! The \"lemonade\" drink was super strong at a decent price. Very good flavor. Actually spoke to the bartender who invented this masterpiece. Very friendly staff. Also split the volcano bowl with 3 other girlfriends &amp; it was very tastey. Played good music &amp; was very low key. Loved it. Had a blast &amp; def will go back next time I'm back in SF.", 
    "review_date": "2012-05-28"
  }, 
  "Dtw-QjGqOcrbw0Rdm967JA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nigel E. S.", 
    "review_text": "Bamboo Hut is the perfect place to drink beers on the cheap while waiting for your table at Tomasso's around the corner. Honestly it is exactly what you need in a recession.    For those who knock it because your $300 jeans don't stand out here...  you are at the wrong place! Buy a bucket of Dos XXs for $20 and you'll think of yourself as the world's most interesting man.", 
    "review_date": "2009-08-31"
  }, 
  "xLgipMEceGu1iKT5As9iZg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelley A.", 
    "review_text": "Lets put it this way.... I had my 25th birthday party here! I frickin LOOOOVE this bar! Nick, Marshall and Lauren are amazing! they know what they are doing and they know how to show you a good time! If the bar is dead or alive, you always have a great time here! Highly recommended! Great atmosphere and cute setting! all in all the bartenders make this bar!", 
    "review_date": "2007-11-13"
  }, 
  "lXrppQJaU8B8p-oSXyVQNw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "douglas b.", 
    "review_text": "cost 5 bucks to get in.    which was not bad but the crowd was mostly dudes when i got in there.  The girl i was with was like only 1 of 10 girls out maybe 30 guys.    drinks were good but i may pass next time.  unless i need a drink with 151 lit in the middle of it.", 
    "review_date": "2007-08-24"
  }, 
  "OvteZk2gWKfIRAryq7T9KQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda B.", 
    "review_text": "Stop by for st patty weekends had rounds w/ the best bartender ever!", 
    "review_date": "2013-03-17"
  }, 
  "A0eHQVVG22mKUtONxO5VuQ": {
    "user_rating": 4.0, 
    "user_location": "Isleton, CA", 
    "user_name": "Joy K.", 
    "review_text": "i was too chicken to try the volcano bowl (it's ginormous!)  but i tried the lava flow, which is also a drink special. The lava flow wasn't bad...very pineappley, not very boozey though.  the bartenders are friendly and very tolerant of drunk, crazy, dancing weirdos like the group I came with.  I have been here before and i had a good time then, too.  The place is pretty small, but the drinks have decent prices so it's a good little stop during a night out.  Also, I apologize to the girl whose sunglasses I pocketed.  I was sloshed.", 
    "review_date": "2012-07-31"
  }, 
  "kl7CHQHUY_DrZnoLz-H2sw": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Val B.", 
    "review_text": "Nice location. Inexpensive bottle service. I really didn't need it. Music was okay.", 
    "review_date": "2010-05-17"
  }, 
  "TK-VvdTvO617DnQ7ilAxQg": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Its a S.", 
    "review_text": "I love this bar! The crowd is kinda random but it is decorated so cute! Ive been here twice and will definitely come back. The bar tenders are great and the bouncers are really cool people. Saturday night's music was perfect for me. There was a lack of people when I was here due to the holiday weekend but the staff made it worth coming back to :) I like this place better than any other place in north beach.", 
    "review_date": "2006-11-26"
  }, 
  "oTpmi6DjCotg0htLaETemg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Harold C.", 
    "review_text": "Basically, we almost set the bar on fire (doing Statue of Liberty shots), and the bartender exclaimed, \"You weren't the first, you probably won't be the last!\"  I'd give them a -1 for a dirty bathroom, but I've seen worse. At least the men's room has a working door lock.", 
    "review_date": "2012-03-03"
  }, 
  "tNoqVTP-oWqHKl9zKNzBJw": {
    "user_rating": 1.0, 
    "user_location": "Uptown, Dallas, TX", 
    "user_name": "Jo W.", 
    "review_text": "WORST SERVICE EVER!!! One bartender decided to go smoke a cigarette leaving this tattooed idiot in charge. Brilliant idea! He spent more time dancing and pouring shots for himself than making drinks for patrons. Finally gave up and went to other guy when he got back. $30 and 20 minutes later I finally got a drink... Too bad it was terrible. The only thing this place has going for it is good music. Save your money and go elsewhere!", 
    "review_date": "2013-11-15"
  }, 
  "Er0hnraJKQ8qpWOHg_iYVA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Todd E.", 
    "review_text": "So all you want to do is quickly forget that you went to Dragon Bar - and I mean QUICKLY...In point of fact, you want to forget the trip to Dragon bar ever happened because you are feeling physically violated - erasing it from your permanent record is probably closer to the true desire...Now if you're following the story you know our hero feels violated, not because he had to pay an obscene cover to get into Dragon Bar and not because he had to wait in a huge line but violated because some not so attractive B&amp;T chick with the grip of steel gave said author a package check that probably bruised the twins (See Dragon Bar review for all of this to make sense or just roll with it) and induced a stomach ache the second he hit the door...this of course, threw off your evening like only a package check from an unattractive girl with man hands can...  Thankfully, me being the lush that I am and knowing my bars like I do, I had to look no further than right next door for help - Bamboo Hut (otherwise know as 'The Hut') is the place to make all those bad memories a little bit, or a lot, fuzzier (NOTE: If you are an experienced drink or an amateur with a death wish you can do this very quickly by applying a Flaming Volcano Bowl or two to the liver - WARNING this is not a smart thing to do but be sure your friends get pictures afterward as you will not remember any of the truly humorous things that you will do or exactly who or what you did them to or with)...there is nothing like a Tiki Bar to take the edge off...Bamboo Hut feels like a throw back to the days of Blue Hawaii...The throwback music coupled with a great bar staff make this a great place to go and throw back a few Mai Tai's...  Yes, it does get packed and yes, sometimes crowd is a bit of an annoyance but it's always a good solid place to go and get your drunk on if you're on Broadway and you don't want to deal with the typical pretentious BS at the typical over-hyped places...", 
    "review_date": "2006-09-04"
  }, 
  "goi_9DHGsS9gAE_2nFda9g": {
    "user_rating": 3.0, 
    "user_location": "Antwerp, Belgium", 
    "user_name": "Megan M.", 
    "review_text": "Super fun place to go! I heart the Flaming Bowl of Liquid! Rundown tiki bar that has a lot to offer. Great music, fun bartender and huge bottles of Red Stripe. Fun place mix up the night life!", 
    "review_date": "2009-03-04"
  }, 
  "DCnqvmdvbu04hTAv7DX-Mw": {
    "user_rating": 4.0, 
    "user_location": "Newark, CA", 
    "user_name": "Alice T.", 
    "review_text": "Nice place to get a drink, with a nice hut looking atmosphere.  Not too crowded when it is early.  when I was there it wasn't too busy.  I like the staff there, they are nice.  There is also a DJ there as well.  I would say that the only bad thing around the broadway area is parking.  Get there early so you can find street parking otherwise it is hard to find as the night goes.  If you pay at the lot it is $15 dollars and they only take cash.  They have good tropical drinks at this location.", 
    "review_date": "2008-07-21"
  }, 
  "ITa3vh5ERI90G_WP4SmGUQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Peter D.", 
    "review_text": "The Good.  -$12 bowls of pineappley drunkenness with flaming 151 in the center. -Lighting our fingers on fire = hours of entertainment. -Tribe. 'Pac. The Pharcyde. Dre. All sorts of 'Kast. A mix of music I haven't heard since I stopped throwing basement parties.   The Bad.   -\"Fire is hot!\" Surprise. -The bathroom stinks, and I mean STINKS of piss. Almost as bad as the streets of San Francisco.  The Ugly.  -Me. In a kimono.", 
    "review_date": "2013-03-19"
  }, 
  "99NcsApGTVHpDClWSW8_iQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny T.", 
    "review_text": "In an attempt to outdo myself for my last theme picked bar, butter, I selected Bamboo Hut this Friday night. I don't think I outdid myself, but the flaming volcano did some of us in.  Having frequented Trader Sam's, who serves their scorpion in a restaurant supply store plastic bowl. Think Sizzler jello salad bowl, circa 1989. I appreciated the festive volcano bowl the uber sized flamer was served in. $19, price tag, liquor included.  I admit it, I contemplated attempting to get out the door with it. After all I've more that completed my pint glass collection, pretty much finished off my branded jelly jar drink glass souvenir line. I need another useless drink glass collection starter hobby. Opting to respect the integrity of my Coach handbag that night I satisfied myself with the bartenders number, another collection, and headed off to my local IR bar.", 
    "review_date": "2009-03-01"
  }, 
  "_0U8eYu96-wwI4uR26aj_g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew B.", 
    "review_text": "Ummm... consider this a very biased review... But then, I wouldn't be a very good Yelper if I weren't judgmental, now would I?  So this is where all the trash in SF hangs out?  Got charged $22 for two shots (valued at $7 a piece) and the bartender was so stupid he didn't know how to refund the difference, so he offered free drinks (which I wasn't feeling at the time) instead. Then he takes off with said shots (still full, by the way) thinking we were done. Another five minutes go by before the shots are returned and we finally get our \"free\" drinks.  Awful experience, awful service. We will not be returning...", 
    "review_date": "2011-11-20"
  }, 
  "UupJxJKOXP-B_EkJsIK4Iw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy G.", 
    "review_text": "The drinks are on fire (literally), the music is awesomely bad, and the bartenders rock!   At least this is what I can remember--too many flaming volcano bowls!  Can't wait to go back!", 
    "review_date": "2007-02-20"
  }, 
  "jOZheuOkUGKp4htT0xHIlA": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Erin S.", 
    "review_text": "A tiki bar between titty bars? Why not?   Broadway is not the street I would expect to see a tropical-themed bar. In fact we almost walked right past it. Not much to see on the outside, but a great tiki bar beach scene going on inside, complete with palm fronds, surfboards, &amp; hanging puffer fish.   We came specifically for the mai tais but one look at the huge ceramic bowl that holds the Volcano &amp; we couldn't resist. Crushed pineapple &amp; rum lit on fire? I'll take it! Plus it was $12 as opposed to the usual $20 since it was happy hour. They must have a long HH cuz we rolled in there after 8:00 &amp; it was still going on. The Volcano Bowl is definitely enough for 3 but 2 could probably finish it off no problem.   Before I knew it, our Volcano Bowl was empty and another one was quickly brought in as a replacement. I never did end up getting my own mai tai, but I think drinking the majority of 2 Volcano Bowls was enough for me.", 
    "review_date": "2011-09-30"
  }, 
  "SGy6GdzJZo27Ugh3ZZhMaw": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": "Joyhan S.", 
    "review_text": "Did i go on an off nite?  The place was just kinda empty than what I remember it to ever be. Hmm....Maybe.  But it was awesome to watch the older Asian lady with the hot-ass bod prance around with various men.  You could tell she was at the gym earlier that day thinkin:\"You know?  I think I just wanna dance tonite!  I'm gonna wear my teeny weeny black dress tonite and just dance!\"  Tenders were cool. People were ghetto. Music was pretty good, especially when the dj rocked a Journey mashup.  Cause...I'M JUST A SMALL TOWN GIRL, LIVIN IN A LONELY WORLD y'all. Fuckin rocked! Go there for a surreally cheezi experience.", 
    "review_date": "2006-11-27"
  }, 
  "uDd5FrtM1ImwtUo_3z49PQ": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "evan h.", 
    "review_text": "BBE.  Best Bar Ever!", 
    "review_date": "2007-10-25"
  }, 
  "QTLL0xbcy7AyLUPJogk5kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Britney K.", 
    "review_text": "This place is so cool, why so little stars!?  Its not perfect, but I feel like that miiiiight be location based.  I came in with a group of 4 on a saturday night around 8pm. Snagged a booth and a volcano bowl and thoroughlly enjoyed ourselves until about 11pm when party buses started showing up (laaame).  The bartender was awesome, made us 2 delicious volcano bowls (with a ton of little plastic mermaids. thanks!!!) annnnd put on Jackass 2 for the bars viewing pleasure.   I cant wait to go back!", 
    "review_date": "2010-10-20"
  }, 
  "ooNGqUMtocqCpGOQCJod9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "hunter w.", 
    "review_text": "I can be manly and still like umbrellas in my drinks, right? What about plastic monkeys and seahorses? Citrus fruit slice or a cherry is pushing it though right?  A bunch of WhaleRiders and you'll stop laboring over those judgmental questions.", 
    "review_date": "2008-12-13"
  }, 
  "xolsJ-e3WVlcE3ay_vOosw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "AngelaS F.", 
    "review_text": "If you aren't:  A. Right out of college B. With a bachelorette party  You're going to hate it!     I still can't decide which is cheesier (or dirtier for that matter) the clientele or the decor.  Oh I almost forgot to mention - my friend got her purse stolen there (I'll admit it was naive for her to put her purse down with her coat but still.)", 
    "review_date": "2007-01-09"
  }, 
  "WqFO9ApUbeThw5jpTfNfPg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Josiah B.", 
    "review_text": "Rock and Roll, Jameson, and cold beer, oh yeah sexy bartenders too.", 
    "review_date": "2006-12-29"
  }, 
  "6Dk2bOwUQBz3aNcEOM1p_g": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Tanya L.", 
    "review_text": "get the bowl! the bartender was very cool and they have good specials. typical dive bar, its very silly in there but the drinks and people are fun", 
    "review_date": "2013-02-21"
  }, 
  "nUms0RzJFJsqlR_VkjrSuw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kevin W.", 
    "review_text": "The Volcano Bowl lacked the explosion of 151 that I was expecting, but for $10 (half off Yelp Drinks!), it'll have to do for a very light buzz.  Too bad the only thing explosive was the drunk girl's boobs popping out of her top at this dive bar.  No wait, is that really a good or bad thing?", 
    "review_date": "2012-03-22"
  }, 
  "pF7uEfsYCT_7AIKqBel2Xg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Eric M.", 
    "review_text": "Maybe it is my interest in the culture and style of the 1940s and 1950s, maybe it is my desire to be on the beach, or maybe it is my fascination with Pacific Island culture, but there is something wonderful about Tiki bars. A good Tiki bar is a thing of beauty, somewhere that takes you away from where you are and brings you to the beach in Hawaii.  Bamboo Hut does just that in wonderful, divey fashion.  Coming on the recommendation of the bartender, Thunder, at Mr. Smiths in SOMA, we were told to deliver a note to the Hut's bartender, Marshall.  When we arrived, we greeted ourselves and passed on the note, which certainly added a bit of levity to the evening.    A fairly somber Wednesday night was made much better with the great atmosphere, the fantastic DJ (his mash-ups were top notch) and an interesting group of patrons).  Definitely a great bar that I am looking forward to returning to.", 
    "review_date": "2008-08-31"
  }, 
  "TIZQuJV8_8NUiiBI6YAMQw": {
    "user_rating": 3.0, 
    "user_location": "Puget Sound, WA", 
    "user_name": "dj z.", 
    "review_text": "The venue itself is nice, but no proper stage for live performers. :( I attended a small live performance of jazz there, and I could tell that the music could easily get very loud.  The drinks were pretty good, Stephanie and Marshall were sweethearts.   Three stars only because if it wasn't for the live performance, I'm not sure I would've known about the place.", 
    "review_date": "2008-09-19"
  }, 
  "st3jHFby9fyMoHRCWBLqKg": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Carrie P.", 
    "review_text": "I have had the pleasure of working with Max and his amazing staff on several occaisions and finally had the opportunity to enjoy their hospitality from the other side!  I celebrated my birthday here last week and could not have been happier with the special attention, the great atmosphere and the friendliness all around.  The DJ, Kirk, was fabulous with requests, many happy birthday wishes and loads of 80's(I grew up on it so have to love it)...not sure if it was the music or the volcano bowls, but he had our whole crew dancing:)   A special thanks to Tobias for pulling it all together and allowing me be a stress free birthday girl!  Can't wait for another opportunity to throw a  party here:)", 
    "review_date": "2006-06-13"
  }, 
  "LDtVHTiJEja1oxxgdC1VZw": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Layla M.", 
    "review_text": "Pretty cool place on North Beach located around the bar/strip club scene in The city. Went in for a few drinks with my friends from Uni because it had a cool theme and we had a pretty good time. The bar is a super Dive bar, pretty small &amp; covered in tiki decorations. They serve signature fruity island theme drinks such as daiquiris, piña coladas, and mai tais. I decided to get the drink they are famous for, their Volcano Bowl a fantastic mix of liquors with cherries, plastic monkeys &amp; seahorses in a huge bowl with a tiny bowl in the middle filled with alcohol that's on FIRE! Yes, literally ON FIRE! As a pyro I get so much with this drink for only $12 (you can share this or be a greedy boozer and have it by yourself!) cool place for pre drinks or on a pub crawl, but not somewhere you'd stay at all night.", 
    "review_date": "2014-04-25"
  }, 
  "7_SjX_GOcRROCh80KfycSw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Niki M.", 
    "review_text": "For being on broadway this place is pretty crackin. Loved the hurricane I had (this was way back). Went on a Friday in the middle of the summer, better for the happy hours and off days of the week, but still, a great find in the city.", 
    "review_date": "2006-06-15"
  }, 
  "BBwqj15pm04Hhm9b3R57bA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mez L.", 
    "review_text": "This place is like the \"Cheers\" of North Beach. It's hardly ever so loud that you can't strike up conversations with the regulars, and it's easy to become one of those regulars yourself. Being a fancy beer gal, I never thought I'd have so many Pina Coladas in my life, but Mimi knows how to make them right, and I apparently know how to drink them. It's the kind of place that feels like a good secret, being tucked away in the midst of a thousand strip clubs, I never would have gone in if I weren't invited. Now I find myself there at least once a week, and if I didn't live so far, I'm sure it would be far more  than that.  It's a four star dive bar, but the atmosphere and the bartenders make it a solid five!!!", 
    "review_date": "2010-12-15"
  }, 
  "D6ErcUnFALnCQN4b1W_TlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "Pretty chill pad daddy-o. Stopped in here on my way to the opening of Monroe's and have to say I was pretty impressed with my Tiki themed cocktail the Zombie.  The staff is super chill and together we fight crime. And by fight crime I mean we where looking at some a-holes trying to break into cars and when I saw a cop driving up I pointed in their general direction to which the cops busted their punk asses! The one dude tried to run after they had the cuffs on and fell right on his face. We all laughed good that day.  I'm taking one star off though because the Giants lost the first game while I was there.  So maybe don't go during Giants games.", 
    "review_date": "2011-04-01"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "A North Beach dive that is dimly lit with a Tiki room ambiance. It possesses a unique charm in and of itself.   The charm stems from the staff and of course the presence of Mr. Smith (Max) himself one rum tasting evening.  Albeit the hole-in-the wall theme, the service rendered was superb.  A nice four-star dive-stop prior to or after hitting North Beach nite spots.  Reminds me of a classic Tiki room dive in the outer Richmond, Trader Sam, where I have spent many a college nights indulging in lethal drinks then leaving me with hazy, vague and surreal memories the morning after; whereupon lucidity resurfaces, you stare at yourself with disgust at the mirror and say, \"you did What?... ewwww!\"  Though rum and lethal cocktail concoctions are not for me (should stick to the ever dependable bottles of red), Bamboo Hut is a cozy and homey dive destination for those in need of a major alcoholic fix.", 
    "review_date": "2007-03-13"
  }, 
  "nabN6zi4WdtXPWQPZBvKfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MJ T.", 
    "review_text": "Two words:  SCORPION    BOWL  3 more words:         F.   U.c.      k. e.d       m.E               U.           P.  Why do your scorpion bowls taste like sweet sweet lollipops? Why is there only ONE ladies bathroom? Why was someone doing lines of coke off the toilet seat? Why didn't she lock the god damn door? Why is there no coat hooks underneath the bar?  Bamboo Hut got me drunk from 0 to 60 in about 30 seconds flat. I.          h.[e]a[r]t[e].         y.  o.            u.  p.s. Why is Bamboo Hut located under the category: Day Spa?          There was no fucking day spa to be found at this location.          Only scorpion bowls and seedy chode-bags.", 
    "review_date": "2007-12-17"
  }, 
  "kso4kcbgVTGRJDEwZkMjzg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liane V.", 
    "review_text": "Cool decor, AWESOME bartenders! Especially the ones who helped me recover my iPhone! God! Thought that thing had bit the bust for the final time. Been here a couple times, since I used to work across the street, and even a couple times after. The first time was to see Thee Swank Bastards, and I think the second and third times it was to see them as well. The last time I went, or rather, the time right before the last time, I was hammered beyond a reasonable doubt, hustling some poor fellow for whiskey shots. Somewhere in the midst of the night I misplaced my phone, and called them the next morning (after I cried my eyes out and threw a temper tantrum upon realization) and left a message, hoping some kind soul MIGHT have turned it in... but it's reality, right? I wasn't expecting SHIT. That shit was GONE. I was already about to roll my pennies and call AT&amp;T about a new one. Well I called, left a message, and they called me back... Chris it was, I believe. I go in and recover it... a cute punk-ISH looking chick named Mimi was working behind the bar and she gave me back my phone and I decided to stay and have a couple vodka sodas and relinquish the night. We shoot the shit, smoke cigs and sample delicious mixed shots that tasted like fruit rollups. Very comfortable, easy going place with seemingly easy going people. 4 stars because it is out in North Beach which is going to limit my going there to 0-2x  a month, probably. Haha.", 
    "review_date": "2011-04-05"
  }, 
  "QjL0DFnhBptRXpZ6NG89qA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe B.", 
    "review_text": "Clearly you need to get the volcano bowl, icy/rummy/flaming ridiculousness guaranteed to have you on the sandy floor.  How to attain one, however, was my challenge of the evening.  Not having breasts to flaunt or the burly or jock persona necessary to buddy it up with our bartender in testosterone backed camaraderie, this skinny fag had to enlist the attention grabbing tatas of one of his hags to lure our bartender over to fan the flames of my faggotry with none other than a flaming booze volcano.  Once we had drink in hand, the night was pretty good.  Our DJ of the night, aside from ignoring requests, played fairly decent music.  The floor was like a giant sand box and they gave us free flip-flops, which made for some interesting times.  A few volcano bowls later we danced across the sand and made our grand exit.  It all worked out in the end: recalling the carnal look of the bartender as he objectified my friend was just what I needed to enduce the at home vomiting spree that saved me from what could have been a hangover most murderous!  Next time though, I think I'll stick to Trader Sams for my tiki bar bowl of ice blended booze needs.", 
    "review_date": "2008-08-17"
  }, 
  "2t_dWhdm_ZDiseqtfv-p0w": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Joco F.", 
    "review_text": "There are some tiki bars you go for the ambiance such as the Tonga Room.  Some you go to for the sheer perfection of their cocktail making like Smuggler's Cove ( I know it's more pirate ship but tiki bar but the drinks are the key ) Some however fall in a whole other category I'd like to call people watching.  At no other tiki bar in the bay area this is king more than at the Bamboo Hut.  First off the place doesn't have much to the design.  There's some of the typical kitschy tiki bar stuff but nothing to write home about.  The drinks are tasty and strong and probably the best value of the ones I've been to. The staff is friendly and quick. The patrons however...  It's a crap shoot every night.  It's that people watching game of craps that keeps me coming back for more.  I love the location in the heart of Broadway in North Beach.  It's always been a sanctuary for me when I duck and dodge all the people attempting to lure me into their strip joints as I walk down the main drag.  This sanctuary has always been the best value entertainment on Broadway as it is get this.... free entrance.  The bevy of personalities that have the potential of walking in is astounding. From short people with canes dressed in Smooth Criminal outfits to Russian Gangsters chatting with Peruvian surfers is just the tip of the iceberg when trying to describe who you might end up chatting with.  In many cases if you were to run into any of these people in the street you might find yourself trying to avoid them but at Bamboo Hut you are forced through the powers of alcohol and close proximation to each other to commiserate.  For some magical reason all the fears people have of stereotypes disappear when walking through the doors of the Bamboo Hut.  So my personal review is I love Bamboo Hut but it certainly isn't for everyone because it has such a unique feel to most other tiki bars.  Imagine if Mr. Bings and Kona Club had a baby the Bamboo hut would be it's love child.", 
    "review_date": "2013-08-07"
  }, 
  "QHIOjlUcFlb_n26s_UGFnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen A.", 
    "review_text": "Awesome drinks. Good throwback music. This is a good place to go with a group of Hawaii-obsessed friends who always make me feel weird because I didn't arrive wearing a Hawaiian shirt. The crowd is fairly cool. But I caution you to take it easy with the drinks, they are sneakily strong.", 
    "review_date": "2009-04-29"
  }, 
  "IsjBpBEFMqA390hUkibH9g": {
    "user_rating": 4.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "linda p.", 
    "review_text": "Was out for a girls night and was bar hopping in north beach. Granted this was our fifth bar of the night, but it was a great one to end with. We went during the niners playoff game so every bar was packed with niners fan cheering on kapernick, while the three of us were drinking till no tomorrow (unfortunately tomorrow came and it wasn't so pretty) but we had a blast regardless. :) Has an awesome mai-tai like drink with barcadi 151 flamining in the middle. We shared that and well, the rest of the night was just ridiculousness. Thanks to the staff for putting up with our craziness and insanity. I know drunk people can be a handful and too much sometimes. x)", 
    "review_date": "2013-07-06"
  }, 
  "1dhMYD2pJ19vPvADcpJe7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raj K.", 
    "review_text": "Very cool place to grab a  few drinks in a nice setting. The bartenders are friendly and definitely great mixologists. Yes, this place does have quite a bit of tourists but then again isn't that what sf is all about.  A great way to either start or finish your weekend, will try and visit  this place again the next time i am in the area.", 
    "review_date": "2009-04-20"
  }, 
  "pho72eTUPELEPEesOlK7Fw": {
    "user_rating": 4.0, 
    "user_location": "Newark, CA", 
    "user_name": "Kirsten M.", 
    "review_text": "This place was fun, from what I remember, since we were drunk when we got there.  However I don't ever remember being groped that much in a bar!  I don't know what they serve in those giant flaming bowls but it sure is tasty!", 
    "review_date": "2006-04-14"
  }, 
  "xsMd6OnEJ6_Np6Es0uxOIg": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "Gerard Y.", 
    "review_text": "$5 cover. First thing as I walk in is a girl on all fours on the dance floor (to a Bloodhound Gang song). It's too damn crowded and the bathroom reeks of old, stale urine. Only saving grace is that the drinks are mixed ok. Also to their credit they play a variety of decent music. Okay. I went to the bar with Marsha Z. and she was right... Drinks were served pretty quickly unlike other bars that take a million years before you can get their attention even if you stare at them.", 
    "review_date": "2007-05-20"
  }, 
  "qm-47Wz6EBIuXdZCqsLDdg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mrs. P.", 
    "review_text": "popped in here for a few minutes to grab a drink while we waited for Horizon across the street to open. relaxed atmosphere and GOOD old school 90's music- they got me at the music.", 
    "review_date": "2010-06-24"
  }, 
  "7gHsAiToJ78SCcwUUM1qmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen D.", 
    "review_text": "I had my birthday party there this past weekend and it was fantastic. I went Jersey Shore themed, and the GM was more than happy to help me theme the bar after the JS--we developed a themed drink menu, there were cast photos on the bar...it was great. The only requirement was that we meet a $600 bar tab for renting the entire place from 7-10 on a Saturday night (which we did, ahem, handily)--I couldn't have asked for a better venue!   I have to deduct one star for the fact that the bouncer started letting streams of people in at 9:30, when I had reserved the place until 10. Pretty annoying, but the rest of the night was so great, I'll let it slide.", 
    "review_date": "2010-05-03"
  }, 
  "awqtQmC1QoUxOdmdQoeirQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Leily P.", 
    "review_text": "This place was okay. I noticed that Yelp reviewers really love their dive bars. I don't think it deserves 4 stars, and definitely not 5. It was just okay.   Fairly diverse crowd. No cover is a plus. Old school hip hop earlier in the night, random \"classic rock\" towards the end. Bouncers were nice, but then again I have boobs so they usually are. Outside looks kinda sketch, but who knew that inside wouldn't be so terrible.   It's funny that with all the mirrors, the place does a really good job of pretending to be wayy bigger than it is...", 
    "review_date": "2008-05-17"
  }, 
  "8KGUaI8fYvD4p6mCzxLirA": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Sarah M.", 
    "review_text": "The Bamboo Hut is an amazing place to go. It has a fun and unique tiki atmosphere that draws an awesome crowd. The Hut has marvelous drinks, diverse music, tons of fun events, and most of all, incredible bartenders! I am just sad that it is so far away from me :o(", 
    "review_date": "2007-10-25"
  }, 
  "8oKF-_kcN1sQxKUnYSDkGA": {
    "user_rating": 4.0, 
    "user_location": "Reno, NV", 
    "user_name": "Kristen S.", 
    "review_text": "really cool divey place. you can still go ahead and dance though, if you feel the need.", 
    "review_date": "2010-09-14"
  }, 
  "f2kprM12LzRr9KcP_X-87Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex B.", 
    "review_text": "From the stories of folks my parent's age, there used to be a lot more tiki bars in the city. As this place is one of the last few of a dying breed, I feel as though there is much they can do to pump up the old tiki attitude - you know, torches, glass top bar, sand, cheesy don ho / blue hawaii slide guitar music, that whole bit! I mean come on, it's not like there's a whole lot of space to fill...  The drinks were alright though. Can't complain about the wide variety of creative concoctions on their specialty menu.", 
    "review_date": "2009-05-24"
  }, 
  "nwhBcly3mJKHUPMrg0rttw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Donna Y.", 
    "review_text": "We stumble across this bar. First thing I notice was sand on the floor. It felt I was in a sandbox which was cool. The drinks were not bad. It does bring back the feeling of the islands. The music was good and I think a good place to go if you want to hang out or just get some sand in your shoes.", 
    "review_date": "2009-10-06"
  }, 
  "Elr7_s3ySqU3hfJCsY705w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candy C.", 
    "review_text": "Tiki lounges generally have pretty easy going staff but this one tops my list as the friendliest establishment (in any category) in my entire drinking adulthood. Albeit my drinking adulthood has been short, because just like any good kid I waited until I was 21, I did go to college in a college town - that should count for something right?  Good people, good times  :)", 
    "review_date": "2009-04-06"
  }, 
  "KA0Qo8CmJ5MaUU-RQgMqtQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "santiago g.", 
    "review_text": "This place is a Tiki Nightmare. The sound system sucks and so does the Dj. It looks like no one here has heard of a swifter and the \"usuals\" are very \"UNUSUAL\". Why do I rate this place so highly after such a horrible description you might ask? Simply cuz the manager Marshal is the F@CKIN SHEEAT!!!!!!! After leaving the den of iniquities known as Impala we stumbled in here and had the best muthaF'n time listening to bad white man jams with equally bad mixing. The great treatment from the staff wiped all that sh!t away and the drinks were stiff like my weenie after two hours of dry humping my 7th grade girlfriend. NICE. Now if they would only dust the place once in a while I wouldn't need to take a claritin the next time I go.", 
    "review_date": "2008-08-29"
  }, 
  "Mk0rlJjiX1NJyvZ4z1Vycw": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Mary B.", 
    "review_text": "Great place to hang out with friends. My girls and I made the entrence way a dance floor. Awesome music, good drinks, friendly staff. Cheap cover (5 bucks) Dance floor should be bigger though...", 
    "review_date": "2005-06-05"
  }, 
  "yPmlM7fxm6H4u3kFdvdHbw": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kate M.", 
    "review_text": "The volcano drinks were cool; the one-staller women's bathroom wasn't.  And I agree with Audrey K. about the DJ... pick a genre/time period and be confident in it!  Prince's \"Rasberry Beret\" is an awesome song (which I love) but it ruins my groove to be dancing to that and then some crappy techno song I'd never heard of next.    A for effort with the interesting bar theme but otherwise not worth the $10 cab fare.", 
    "review_date": "2006-04-10"
  }
}