{
  "ct3JOaqXfq1zSPajMBxpuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cyrelle D.", 
    "review_text": "Bar 821 is a great place to hang out with your friends if you are looking for a mellow evening. Awesome champagne cocktails (I had the ginger one, which was yummy) and a good selection of beers and wines. I asked the bartender, who is very nice as Starla D. has already mentioned, for a beer recommendation based on beers I already like. He recommended the Hoegarten Vanilla which was right up my alley and had a subtle hint of vanilla.  The atmosphere is great with comfy seating, pleasant lighting, and funky music videos playing in the corner.", 
    "review_date": "2008-01-08"
  }, 
  "ZjXXJvnnn91dW0RSGR4_rg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Al B.", 
    "review_text": "I love this little NoPa gem...  Bar 821 is a cozy and friendly bar in the North of the Panhandle neighborhood. While I can't get my Vodka &amp; Tonic here, they do have a nice selection of beer, wine, champagne cocktails (very yummy) and sake drinks.  This is a great neighborhood bar where you can come in, be greeted by super friendly bartenders (Juan and Oba rock) and nice folk from the neighborhood.", 
    "review_date": "2009-09-06"
  }, 
  "_8RdsTenycwauWFXIxpEaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica B.", 
    "review_text": "This is a great neighborhood bar with super cheap happy hour specials and a really friendly bartender.  I only wish I lived closer!", 
    "review_date": "2009-03-13"
  }, 
  "8b9GJsvhIfbyLRyFTbIUqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Fancy drinks for $7.    There is nothing else you need to know.", 
    "review_date": "2013-04-15"
  }, 
  "8Q0xnxT-KrvCl2pQF1qsFQ": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "omar b.", 
    "review_text": "people, place and product.  fives all around my friend.  821 has become one of my new fav happy hour spots courtesy of joey and james laid-back and entertaining tendering.  mostly a hoodie spot- thanks for the intel AKA G!    hunttterrrrexxxxx!  we thug hhwwatt!!  <a href=\"http://static.px.yelp.com/photo/8hrcHKRSwcFHXZ_JF3lvKw/l\">static.px.yelp.com/photo…</a>  i have enjoyed classics on their flatscreen like transformers and thrashin along with a good ole butt-whippin' of the warriors ;-)  little star is right across the street and its all good to bring em over...just be courteous and ask first.  3bucks will get you whatevas from 5-7...and yes i am talking about more than drinks..quick and dirty- hey can't hate on being efficient. i usually rock a guinness or hoegarrden &amp; on occasion that ginger soju/champagne...order a diamond and risk getting jumped.  for real street cred just keep slurpin up the ABC!", 
    "review_date": "2007-11-08"
  }, 
  "FRSoGLPQI16pus03avyaSA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gill C.", 
    "review_text": "Have I mentioned how much I love my neighborHOod? Bar 821 is one of the *gillian* reasons why I do...Apologies, my yelpies for not reviewing this gem sooner.   Quaint, dark, and comfortable is the best way to describe Bar 821. Great diverse crowd of HOod and non-HOod dwellers. Love the vibe and ambiance, and be sure to check out the interesting flicks on their flat screen. I've been here on numerous occasions (meeting Popchip angel and Tsaritsa for the first time, pre-post dining with L, D, or M, and even a few dates, etc.,).  Best place to sit are the tables by the window. Take heed, as it can get really noisy if super crowded (typically Friday &amp; Saturday nights).   Great selection of wines, champagne cocktails, and a few beers on tap.  My fav specialty drinks are the are the Lychee and Pomegranate champagne cocktails. My most fav aspect of this bar is.... wait for it....tada.... The HO is on tap here. Oh Mylanta! My beloved HOegaarden is in my HOod bar! Gotta love it!   Bartenders are always nice, and usually just one tending. So if it's crowded, you might be waiting a bit for your bevy. Recommend going for Happy Hour during the week, and be sure to check out their daily specials and the signage by the front door. FYI, they close earlier than most bars, and closed on certain days.   Cheers and see you at Happy HOur!", 
    "review_date": "2011-02-09"
  }, 
  "RAXEQvLnNCaDnBOs7X911A": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Kara S.", 
    "review_text": "This is our go-to neighborhood bar. Happy hour is where it's at, massive pints of Anchor Steam for $3...can't go wrong with that. They have some interesting champagne cocktails too.  Sexy atmosphere, attractive patrons, a sprinkling of hipsters, and good times all around.", 
    "review_date": "2008-10-08"
  }, 
  "ptLIFLUPwg3MYt-J62s3iA": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "V B.", 
    "review_text": "I seriously need to get a tattoo. If I had one, I too could hang out with the cool kids at places like Bar 821.   Walking in with my Banana Republic self here on a weeknight I am reminded just how uncool I really am. The crowd here is definitely hipster and am willing to bet that everyone (but me) had at least two tattoos.   The bar offerings are good, however the wine by the glass list can probably use some work. I was impressed that they had Duval Belgian beer by the bottle. You rarely see it and I took full advantage and ordered one or two or maybe three.  My friends were all about the strawberry mojitos and some weird champagne drink that included some strange fruit thing that resembled an aliens head. Yes, I know what an aliens head looks like.  The music was eclectic and heard everything from Blink 182 to Echo and the Bunnyman and a twangy country tune that I actually liked. It may have been a little on the loud side and it made it difficult to have a converrsation, but we were there to drink so it was all good.  The tables are a bit cramped and had to keep shifting my legs around  so I wouldn't trip anyone.", 
    "review_date": "2009-11-24"
  }, 
  "EVuX64eCN9jr684c547gTw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "paul k.", 
    "review_text": "A couple shelves on a wall  ain't a bar, folks.  A bar needs an  edifice of some sorts, especially one that touts itself as a neighborhood bar. No, this place speaks of knowing it will be trendy for it's fifteen minutes and why put money buiding out the place when it's going to be gone in thirty.\n It's a square room that serves alcohol.\n Low ceilings of metal, concrete floors and speakers that sound like they came out of a 65 Chevy create a Faux Energy,  a loudness that makes it impossible to conversate without screaming.  It's designed like this, to create a sound hysteria, because that's all this place has.  Noise.\n Like my father would say \"So, what's the attraction here?\"\n \"Dad, I can't see one.  Let's go somewhere else.\"", 
    "review_date": "2006-04-22"
  }, 
  "0azsHEPpsGYfIXh9dlugHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "teriaki b.", 
    "review_text": "Shhh, it's supposed to be a secret! Granted, it still pretty much IS a secret- generally populated by neighbors (myself included) - a solid wine list, a decent beer selection, and some seriously slinky comfy seats to get cozy in while listening to Joey or James' awesome tunes.", 
    "review_date": "2007-04-20"
  }, 
  "EotplZNWwGdSGFDZf8fvSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily L.", 
    "review_text": "While sometimes it's too crowded in here to get a seat with friends, I do like the fact that it's just a simple local bar. I may miss my whiskey, but Joey knows what's up and always makes sure to take care of me. Yeah, it sucks that it closes at 11, but there's 3 other bars within walking distance that will be open for your drinking pleasure. Hit up 821 first for a bit of relaxin' and then go get your party on.", 
    "review_date": "2006-06-28"
  }, 
  "K60S2q_v_LyMXtwz6xmt3Q": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mariel C.", 
    "review_text": "Love it! If I had the resources to open and operate my own neighborhood bar here in SF, this is the place that I'd want! The space is not too small and not too  big; quoting Goldie Locks \"it's just right\"  Creative cocktail menu, wine &amp; beer...", 
    "review_date": "2007-08-29"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "I'm a fan of this bar, hey it's in my neighborhood, but I have to say I'm sad they do not serve hard liquor and also have some odd opening/closing hours.   That said, the space is cozy and intimate, and you definitely feel like you're in a local - yet hip - establishment.", 
    "review_date": "2006-02-10"
  }, 
  "tfg1Nhwx94Y4GdQHLVawbw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed L.", 
    "review_text": "Cool happy hour spot out on Divisadero that most people probably don't know about. I love the dark, candle lit ambiance and small setting. Very friendly bartender who takes care of guests like the neighborhood bartender. Happy hour specials are well-priced with a great selection of beer. Solid place to start the night.", 
    "review_date": "2010-08-08"
  }, 
  "ygh1FAM5zmfWFeKsV6wJRg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alice C.", 
    "review_text": "$5 cocktails?  Don't mind if I do!    I tried a drink that was raspberry syrup and hibiscus with champagne, and it was delicious--dangerously so, in a \"Wow, this doesn't taste alcoholic at all!\" kinda way.  The drink menu is really expansive with a lot of specialty cocktails between $5-6, which is reasonable, I'd say.    Bartenders are nice, and they let you bring food into the bar, as long as you pack out what you pack in...kinda like back country camping.  More on this shortly, but this bar gets some stars for friendly service.  I liked the atmosphere here, and one of the first things I noticed was how clean it is.  Not even \"bar clean\"...straight up clean.  There are some tables, so the 3 of us actually brought in our pizza from Little Star across the street and devoured it right then and there.    This is where the cleanliness factor becomes even more important than normal.  Don't get me wrong--I love my dive bars.  However, when you're trying to eat, it's nice to have a clean surface and not feel bad picking up the piece of sausage you dropped on the table and then eating aforementioned table sausage because you're such a fat kid.  **Heads up - cash only!  (They do have an ATM inside, and there's a Wells Fargo ATM on Oak right off Divis.)", 
    "review_date": "2010-03-05"
  }, 
  "d9-gK7AZJSh-G1wVa9WOwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindi N.", 
    "review_text": "nice 1st impression...........chill, dim, hip, cozy, intimate, loungey bar, i especially like the comfy long bench/couch seating slightly reclined meant to really lounge against the walls.........      though its not my scene, it was pretty damn chill -- people were mellow, laid back,  into their own conversations, wasn't crowded that night so didn't have to yell in conversation.   great to have wine, but that night i had a $5 lychee soju cocktail that actually gave me a nice buzz.", 
    "review_date": "2007-03-25"
  }, 
  "8cU-EmiRkTIjpiLu-kOLAg": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Billy L.", 
    "review_text": "This was the first bar I ever went to in San Francisco (Feb 2005) and I've been coming back ever since. It's right around the corner/across the street from Tsunami/Little Star which is nice when you're waiting for your table to become available. But the real draw is the champagne cocktails, my fave being the sparkling ginger. For $5 ($3 if you get there before 7), you get a tasty, bubbly gingery concoction. And once you've had a few too many of those, you have the option to switch to a nice pint or a glass of wine. The ambiance is totally chill- candlelit with some comfy benches (although the accompanying chairs totally blow- good excuse to sit next to your honey for better hand-on-thigh action). In addition, there's always a classic cult movie playing on the TV (muted) with the bartender's ipod at work (he plays good stuff). The bar closes early, so get there early, get down to business and be in bed by 11:30 with a good buzz on.", 
    "review_date": "2007-10-28"
  }, 
  "NN5jldDW0Puf8E3ZZjKqsg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "megan w.", 
    "review_text": "This place reminds me of the bathroom at the Mint.  But it's in the neighborhood and the happy hour is a deal and half: $3 mocktails and beer. Can't be too picky, I guess.", 
    "review_date": "2006-05-10"
  }, 
  "uLAI8VXckqASFxZA0kglfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather L.", 
    "review_text": "Posting rules on your window is just begging for people like me to break them, so I'm sharing the secret that's already well-known -- 821. Seriously, when I saw that on the window as I walked in, I was like, \"And, you just earned yourself a Yelp review.\"\n  821 has a really good selection of beer and wine, but no hard alcy. I was there on a Wednesday night and it was pretty crowded and loud... but a good scene overall. My one annoyance with this place is that it's cash-only. If I can't open a tab, I'm over it.", 
    "review_date": "2006-08-31"
  }, 
  "OxDmQ3RJWQSV9AnJd0MqAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter S.", 
    "review_text": "This place would be a five star establishment if it weren't for their intolerable sound system.  What happened to the bass, or even mid range for that matter? All I hear is screeching highs being blasted through this Play-Skool My-First-Radio.  I've been here twice, the bartender is always cool and the wine delicious.  The seating is modern and comfortable. Please invest in some new speakers!", 
    "review_date": "2007-08-19"
  }, 
  "8hvXl0oJmU61l17LG9aDag": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Euge L.", 
    "review_text": "whats up with those fucking chairs yo? if you lean the wrong way a bit too much, they will tilt over. i wasnt even drunk and i almost fell over. jesus osha fuck me dangerous.   ok, i was kinda buzzed.  ok, fine i had no shirt on, was butt drunk and i fell out the fucking chair.   so fucking sue me.   cool, cheap happy hour joint. good drinks. cant complain.   except those fucking chairs!!!", 
    "review_date": "2007-11-06"
  }, 
  "0bQIbFSdy0Rcdj5-Le4C9Q": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jay Z.", 
    "review_text": "Seriously sexy little dark (but not TOO dark) intimate bar in NOPA with a great wine selection and a friendly appealing SF diverse crowd.  Filled with mission hipsters, hot tatted mission chicks, hot non-tatted marina chicks, fixie bike boys, first date couples, 20th date couples, fresh-faced college kids and middle-aged corporate tools (me).  Everyone fit in nicely and no one seemed out of place.  And, the bartender is an incredibly friendly welcoming guy.   I love this bar.", 
    "review_date": "2008-02-09"
  }, 
  "OBAoKw2-WoJnhIa-dlC8ow": {
    "user_rating": 5.0, 
    "user_location": "Peoria, IL", 
    "user_name": "Jin T.", 
    "review_text": "I love that this bar is in my neighborhood and I can get a pretty well- crafted cocktail for $7... Can't really beat that for value! Five stars because a nice bartender gave me a free cava before closing. That love is real man", 
    "review_date": "2013-11-26"
  }, 
  "3zyBvSsgLEWYsPpnFIxV2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniella B.", 
    "review_text": "shhhhhhhhhhhhhh..it's a secret.", 
    "review_date": "2008-11-24"
  }, 
  "asx4juE5TEE-kJLz55kDUA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shannon t.", 
    "review_text": "We used to call this the \"secret bar\" b/c we could never figure out what the name. Great wine list. Dark, small. Alll the things that I like. Yet... there is something that gets me. I think it is the clientel. Sometimes, I go in - people are cool, calm, having little conversation. Good Vibe. But then I go in-it's like hipster invasion. And I'm going, \" aww crap.. all these people are going to talk really loudly about obscure bands, and cultural shite I have no need to overhear- but it makes them feel smart  and cultured. I feel edgy around this vibe- like high school lunch room all over. Okay so maybe the bar has no problem . Maybe it's me... Maybe I am usuing Yelp as a way to deal with my psychological problems. Then again-- maybe the bar has a sometimes Douchey crowd.", 
    "review_date": "2007-06-27"
  }, 
  "AlWFJgPVptPynau60S9D2Q": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Tom C.", 
    "review_text": "The last thing I expect anyone to tell me when I walk into a bar is 'You're too young to be here.' Now granted, two years ago, this would have been a legitimate complaint because I would have been 20 and thus technically too young to be at bars. Thankfully, when I was 20, I was at UVA. And when you're 20 and at bars at UVA, you're more akin to a senior citizen than a fresh fish.   However, apparently being 22 and at Bar 821 on a Wednesday night, I'm too young. The time that elapsed between me walking in the door and the bartender's unprovoked issuing of this statement was roughly 26.5 seconds. He then proceeded, completely unwarranted I might mind you, to assault my 22 year old friend with the belligerent denunciation that his taste in women was limited to drunk, blonde sorority girls. This may or may not be true.   Now, I really, really wanted to like this bar. Prior to my 26th second in this bar, I quickly fell in love with the low slung leather lounging couches studded with low rising circular tables, the easily manageable (un)crowd, the relaxing lighting and the $3.50 Coronas. But it's difficult to love a bar when the snarky bartender picks out your lil-bit buzzed and slow-on-the-draw friend as a target in his lame attempt to impress girls with his supposedly witty repartee. I wholly understand he was trying to impress the girls to our right. But c'mon, you're the bartender, if you're so desperate to impress them, give them a damn shot.", 
    "review_date": "2006-11-18"
  }, 
  "lucIbk6WeQ6Nq0Zr5jrSBA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ann N.", 
    "review_text": "Small, nice neighborhood bar (it says so on the window next to the door before you enter).   --DRINK-- I had the Lychee Champagne Cocktail. It's a mix of champagne and lychee juice/syrup and topped with one lychee. The flavor was okay. TAO restaurant in Vegas makes a killer Lychee martini with bits of lychee.   --OVERALL-- If you don't like hipster, Hollywood type place, this is the place for you. It's unfussy and down to earth.", 
    "review_date": "2009-01-23"
  }, 
  "fdWFv9wLWrlTQdAySsBLXQ": {
    "user_rating": 3.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Aulani I.", 
    "review_text": "I?m a little torn with this place. It?s definitely beautiful and has great views, but I felt like the crowd was a little pretentious. The staff was nice enough and my drinks were delicious, though a little pricey! Pros: Good Drinks, So Pretty .", 
    "review_date": "2014-04-01"
  }, 
  "YbF0VmXJqaqLAMBHZQslGA": {
    "user_rating": 4.0, 
    "user_location": "Woodside, CA", 
    "user_name": "Darren M.", 
    "review_text": "I recently read a great article about happy hour pub crawling through Divisadero, so on a recent trip through the city, a friend and I decided to hit a few and 821 was one of them.  Bar 821 is a small, dark, but chill bar. GREAT happy hour beers on tap and friendly staff. Did I mention they have Chimay on tap!?! That's good enough for 3 stars right there! They also have Sangria and Sake, but that seems to be par for the course in NOPA these days.  There was a very interesting mix of hipster regulars, 40 somethings, and a few \"just got off work and need a drink\" 30 somethings. Music wasn't too loud and they were running old Popeye episodes on the tele.  Overall a good experience and would definitely hit it up for happy hour again. Depending on your scene, I imagine it gets pretty crowded as the night progresses. We were in around 6:00pm and it wasn't very crowded at all.", 
    "review_date": "2010-03-02"
  }, 
  "JseBksW8DVL596kJ18GGpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gretchen T.", 
    "review_text": "5 stars based on only one visit, mostly because I am so damn grateful to have found this sweet space in my otherwise quiet neighborhood. The space, lighting, wine selection, Guiness, patrons, bartender--all great. I can't wait to roll on down there again soon. (And I happened to notice that Everlast tattoo, right next door to 821, was open last night, so maybe next time you see me at a Yelp event I'll have Bar 821 tattooed on my forehead!)", 
    "review_date": "2006-03-03"
  }, 
  "RmkeL1Zn0b2rsDPyN7ByNw": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "noah s.", 
    "review_text": "we really, really wanted to like this bar as the bouncer was cool and they were showing \"Airplane!\"  whats not to love?  apparently the staff's bedtime is 11 PM.  The prices are awesome and they had tiger beer but the bartender acted legitimately pissed off that we had showed up and were (very politely) going to order a couple beers.   sorry we had the audacity to order DRINKS in your BAR, bitch.  they acted as though the concept that someone would show up at ten thirty on a saturday night was completely out of line.  does anyone else understand how this is a successful business model for a bar?  neither do we.  so after killing our three dollar anchor steams  - granted, they do have great prices - we headed off to our favorite neighborhood lower haight bars that stay open til 2 like normal drinking establishments, where the bartenders are at least nonplussed by your ordering a beer as opposed to downright irritated that you would presume to do so.  prices are great, but have a good buzz going or be a sociopath in preparation for awkwardness.", 
    "review_date": "2010-06-20"
  }, 
  "5v6juPIOisfmogp7QSso-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "Pretty cool little bar. I like the whiskey/beer happy hour combo.", 
    "review_date": "2012-12-01"
  }, 
  "GpZpKakwykH-Gsw-1LpLHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan B.", 
    "review_text": "One of the most laid back bars in the city, I love coming to Bar 821 when I'm in the NOPA area. It is right across the street from Little Star Pizza so it's a great place to come when waiting for a table at Little Star. There are many reasons to love this place:   * Chimay on tap (and a good selection of other premium beers)  * Sangria  * Very chill atmosphere  * Friendly staff  Last time I was here the bar tender asked us to choose the music we wanted to here, which was a nice touch.  The only bad thing about this place is that it's cash only. While they have an ATM there it does get annoying to constantly be pulling out your wallet when you know you're going to be there for a few drinks. I'd prefer to just open a tab and pay at the end.", 
    "review_date": "2010-01-14"
  }, 
  "8_Rmle_9QMlgV_9Euy-raw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris W J.", 
    "review_text": "The drinks are frikin good.  I loved the pink panther and the Lychee champange cocktails.  The happy hour has to be the best deal in town", 
    "review_date": "2007-06-26"
  }, 
  "W5cwxNwGiZJd393PCDQEvA": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "George A.", 
    "review_text": "I live a few blocks from this place, but hadn't been there in quite awhile. I stopped in last night (seriously, it's probably been well over a year since I've stepped foot in the place) and REALLY liked some of the tweaks they've made! The big change being they now serve liquor, and have a pretty extensive drink menu (written on a cool chalkboard) with tons of signature drinks.   I don't know if the chalkboard &amp; light-up liquor display are the only changes they've made, but honestly, those couple tweaks just gave this place a whole new vibe I really like.   The only reason I'm not bumping to 5 stars is because I was here early on a Wednesday night for a drink with some friends. I'd like to see what it's like on a busy Fri/Sat night to get the full effect.", 
    "review_date": "2013-02-28"
  }, 
  "PECXedG2F9cOUN_9Otru6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nelson W.", 
    "review_text": "Nice place to hang out with a friend or a small group.  They don't serve hard alcohol, but the sake and soju drinks are tasty.  Personally, my preferences lean toward the beer on tap. People watching is pretty great here.  The crowd in general is young and good looking.      This place has one of my favorite bar bathrooms of all time.  Roomy, clean, has good posters on the walls.    The only drawback here is that the place closes early.  Maybe 11:30.", 
    "review_date": "2007-05-05"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "circlin' the western addition...as if trainin' for the nascar oval track...circlin', circlin', circlin' and circlin'...lap 4....pit stop...\"drats~!..a driveway~!\"...circlin'...lap 5....openning~!....u-turn...blinker....takes the checkered flag....parking~!  bar 821...small quaint lounge style bar...eclectic..tricky to put a finger on a clear vibe...odd combo crowd.....odd combo drink offerings...beer...wine...and soju.....(only holding beer and wine license..likely..).....servin' up 22 oz. \"man beer\" for $5 (best bang for the buck).....bottled beer for $4......soju shots for $3.....in the other extreme....servin' up \"fem drinks\" like the bubblin' lychee mermaid...and various soju cocktails....", 
    "review_date": "2007-04-14"
  }, 
  "J7fmfD8q5v64eAmHE4dI6w": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Angie C.", 
    "review_text": "I've been thinking about how many stars to give this place since last night after my latest visit to Bar 821.  Finally I settled on 3 stars, but I have fluxuated between wanting to give them 2, all the way up to 4 stars.    For some reason, this is a place I end up going on Sundays.  The bartender who works Sundays is great.  very nice and friendly.    The bar is right across from Little Star Pizza on Divis, and it's not uncommon for patrons to order from little star and bring it over to eat, since Bar 821 doesn't serve food.    I like the decor and it's not crowded. You can actually have a drink and a conversation.    I have a couple disappointments with this place:  1) they don't serve hard liquor, and 2) both times I've ordered wine here the wine tasted awful.  I recovered from this nicely with a replacement, though.", 
    "review_date": "2007-02-12"
  }, 
  "ePB3pBx7eE6ozJ3QHRTxtw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza P.", 
    "review_text": "Not a bad place per se, but I had a very disappointing experience here.  I came in with my boyfriend for a decompressing drink. We ordered two glasses of prosecco... and then, maybe 30 seconds later, asked for the whole bottle instead! We were sitting at the bar, RIGHT IN FRONT of the bartender, so there was NO DELAY of communication here.   Well, the bartender had poured us the rest of an open bottle (maybe 1.5 glasses) and then opened a whole bottle that we ordered.... Great, right? Well, she made us pay for the TWO glasses that she poured. WHAT??!!! It's prosecco, it's CHEAP! Why do this?! It was WHOLLY UNPLEASANT on principle.   I am NOT coming back. I'm going to Mini Bar, where the drinks are tasty and bartenders are AWESOME!", 
    "review_date": "2012-03-11"
  }, 
  "cDCIRivM9fq07BrvZjdJWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aichi L.", 
    "review_text": "A pretty cool place, i like their light beer --- gold garden?( i am not sure the name). The space is small and comfortable. It's good for relax. I love it.", 
    "review_date": "2012-12-22"
  }, 
  "WMQIpmdJ1moJ4AvrDhq1lg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rerun w.", 
    "review_text": "the peeps who own tsunami and cafe abir own this place. and like the others, it's too kool for skool and really nuthin' special.", 
    "review_date": "2008-12-01"
  }, 
  "58dvonndIVTMue5jJdJPFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christian N.", 
    "review_text": "By far my favorite bar on Divisadero.  Joey the bartender is awesome, happy hour is from 5-7 pm and drinks are $3!  $3!  No liquor though.  There is a TV to catch up on Sports, go Suns!  The ambiance is loungy and on some nights, there are some cute girls.", 
    "review_date": "2008-04-30"
  }, 
  "9_dHJM9z0Pn_4W8v6u4fSg": {
    "user_rating": 4.0, 
    "user_location": "Rodeo, CA", 
    "user_name": "Meena N.", 
    "review_text": "It's no lie that this place has got to be one of the most chill bars I have ever went to.  Their Happy Hour is indeed, a HAPPY hour ($3.00 cocktails..and not JUST beer or ONLY certain cocktails.. MOST cocktails).  The actual place isn't too big, so it's quite cozy, the lighting is good and their tables and chairs are low and comfy for the most part.    What I must say is that their drinks are delicious.  I like the fact that they incorporated soju as a key liquor as it has a naturally sweet and mild taste by itself (to me anyway ;] ) and they have a plethora of different champagne cocktails as well.   I had three Lychee Mermaids (they were THAT good) and it all ended up being 9 bucks not including tip.  The Korean Special was quite delicious as well.  The only thing that I have a problem with the fact that they only take cash and you can't keep a tab.  That's pretty annoying and although I understand this during a busy time, we were the only ones in that bar that day.    Other than that, it's quite a delightful place!", 
    "review_date": "2009-04-28"
  }, 
  "9fg9i7ke1NAGhf8W3e97VA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth m.", 
    "review_text": "I'm holding off on that last star until they turn the music down just a little. It gets so noisey you have to shout (as does the rest of the bar) and it makes for a lot of competing noise in a small spot....a hot spot, but small", 
    "review_date": "2009-03-10"
  }, 
  "YjfgvFbbFcRiB4KdwXSLdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SFMom O.", 
    "review_text": "Small, hip, cozy, intimate.  Super-nice bartender with a subtle Manchester accent.   Great place for small groups. Can see how it might get WAY crowded at happy hour. Rough 'hood with NO parking, but if you can hoof it over here, it's worth the effort.", 
    "review_date": "2008-04-01"
  }, 
  "dW4eLZQgZPXf981MQPFLVA": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "H. H.", 
    "review_text": "I'll give the place props for keeping it simple.  Small drink selection but excellent quality and price.  The Lychee Mermaid was as good as everyone says, however...the lychee at the bottom sort of made me want to vom.  I ate it because it was taking up space where more booze should have been. So, it got what it deserved.  The sake based drinks are pretty delish and the atmosphere felt intimate and familiar.  Being from out of town, I did feel like I was crashing a private party, but the service was so friendly and nice that it made up for feeling a little out of place.", 
    "review_date": "2007-04-13"
  }, 
  "60iCXLkb9xqhe5cvEun0kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher K.", 
    "review_text": "What a lovely little neighborhood bar!  If your friends are a bunch of outrageous party people who regularly get banned from establishments during massive saturday night blow out parties, I recommend this bar on a weeknight.  This place bans people.", 
    "review_date": "2008-04-07"
  }, 
  "iZpUe9cfZX4p_JpKK60psQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Naomi C.", 
    "review_text": "Joe the croatian is the bartender?  wait, what??  but I AM the \"Korean Special\", why am I on the cocktails menu?   good times... good times...  another one of those dark and halfway sleek skinny bars, but a pretty decent one for the neighborhood.  Not sure if they're trying to be ironic or just cheap but the cash only thing when they're trying to be a wine bar too is really really annoying.", 
    "review_date": "2009-04-12"
  }, 
  "j4FECd4INVCEMoGaxdADkg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valerie N.", 
    "review_text": "It's in an awesome location, and the champagne concoctions are fun, but that's about it. I went on a Tuesday night and they kicked us out before 10:00! Wtf? What kind of bar closes that early? Also, no liquor license = no booze. Walk the extra block and hit up Fly Bar or Madrone.", 
    "review_date": "2007-06-14"
  }, 
  "tC3XW1wbZVYBtkXxwx0ebA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Jason S.", 
    "review_text": "Try the Lychee Mermaid! It's surprisingly fun and delicious.", 
    "review_date": "2006-04-25"
  }, 
  "qCrAu3LAbj4zkDYVST2efQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine B.", 
    "review_text": "So chill here and excellent drinks.   They also have sangria! Yay!  The ambiance is cozy and modern with very friendly bartenders. I always find a seat here (never crowded when I go whether Wednesday or Saturday).   This is one of my favorite neighborhood bars.", 
    "review_date": "2010-01-10"
  }, 
  "64o6vJrByaGTStMvvU45JQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan M.", 
    "review_text": "A friendly bar with some nice champagne cocktails. They don't appear to have a full liquor license, so the hardest thing they have is shoju, but they make good use of it.  They are owned by the same group that owns Tsunami and Nihon Whiskey Lounge, but they have really weird hours. When I was there the hey closed at 11. Maybe it is to push you to Tsunami around the corner. :)", 
    "review_date": "2008-04-11"
  }, 
  "irHIgobtct_cuG7LGZcaKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay P.", 
    "review_text": "I finally found a bar in SF that is perfect.  No I don't miss the hard liquor, no I don't care it closes at 11PM.  Hard liquor gives me a hangover and most nights I would just rather go to bed by midnight.  But this place is perfection.  The lighting is dim, the furniture is comfortable, its not super crowded but the crowd is cool, the bartender was nice, and the drinks are my cup of tea.  I love the Champagne drinks for $5!  My favorite so far is the one with cranberry and triple sec.  For some reason it tastes like Zima which I have to say I was the queen of drinking in high school and brings back great memories.", 
    "review_date": "2006-04-17"
  }, 
  "B7ecAeAIrXg7sgmabS38pg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephy S.", 
    "review_text": "I just discovered the coolest little hole in the wall bar last week and sure, 221 of you fools scooped me, but I don't care, this place is rad and it can use another review!  I was having drinks with my friend who rarely leaves the 4 block radius of his house, and since I am only drinking vino these days, he suggested this place. As I walked up the block, I was looking for some place called 821 and of course, it's the address. I don't know what it is about bars that take that direction, but they always seem to be pretty cool. Take 83 Proof for example. Maybe too many bars are over thinking fancy titles, when your addy is a good route to go. Just sayin...  Anyhoo, when I walked in, I instantly loved the fact that it was nice and dark. It wasn't dark and divey like I generally tend to gravitate towards, but instead it was dark, modern and very cool and still approachable and comfy. Definitely not an easy decor cocktail to mix.  The bartender (Joey) working that night instantly made me feel at home and definitely scores my coveted 5 stars for blasting Richard Ashcroft for the entire time I was there. He must be psychic since RA is one of my all-time faves!!   I will definitely be returning! The wine was deelightful and reasonably priced, the crowd was very neighborhoodie (not the sweatshirt line) and all in all, it was a damn fine time :)  Yay, 821. Simplicity at its finest :)", 
    "review_date": "2008-06-30"
  }, 
  "DcmI6NlZykgvvZ4SkYoTdA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruchita P.", 
    "review_text": "This place is the epitomy of a local neighborhood-bar. The clientele are low-key, the location is superb, and best of all the selection of on-tap beers!! Hoegaarden and Stella, my two favorite beers. This is definitely a place where I can rely on to be as warm and comforting as a bar should be. Great place for a first date, or just to hang out with the guys/girls. Great selection of cocktails and happy hour is great. I definitely suggest 821 if you are in the neigborhood. They don't serve hard liquor, so if that is your thing, go somewhere else. But who needs to get drunk every time they visit a bar? Especially one right around the corner? Just go there after work, or whatever you do during the day, and unwind with that special one, or whomever. This place won't let you down.", 
    "review_date": "2008-01-26"
  }, 
  "jyHW1rFxcoJ8gYBmcyk-FA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie P.", 
    "review_text": "Even though they don't serve hard liquor - the prices on their wines, beers and sake drinks are really good.  $5 for a champagne cocktail, I will drink to that any day of the week (literally)!", 
    "review_date": "2006-05-27"
  }, 
  "5BwoU-TKNfI4XUNk7TVHFQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex R.", 
    "review_text": "Most akward feeling ever here at this bar and might even say the bartender, door man, and even the Caucasians sitting next to me were pretty racist acting. I am Latino and have grown up in this neighborhood and its pretty sad to see these \"transplants\" come to the area i grew up in and treat me and my friends like were unwanted.  First of all the bartender lady didnt aknowledge the fact that we were standing infront of her for a Good ten Minutes while she was making some drink.  There was no one else waiting to order then this white guy comes in she looks at him says hey what would u like? My gf looks at me and says did she just ignore us for the past now 15 Minutes? My gf had to lean over the bar to ask her what we wanted and just says ok. It gets worst. We go to sit down and next to me this white lady has all her friends purses about 8 inches to my right she looks at me and slowly starts pulling all her purses away from me like i was going to steal her ugly ass crap and then moves even further away from me.  To our left there is a window and.the.door man just keeps constantly looking at us three like were about to rob something...wtf is wrong with these people? Might as well put a sign up no colored people allowed...thats how obious it felt.. Bar 821 u SUCK....and next time im bringing a group of Latinos here just to see if i was just being paranoid...dumb asses ;)", 
    "review_date": "2013-01-11"
  }, 
  "5c8J3QvBWg3VIoQ6Be5o-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenneth J.", 
    "review_text": "Number 16 of my top 100 goals-in-life is to double-fist some strong drink in some southeast asian dive bar.  But thanks to Bar 821's happy hour, I may consider checking this one off.  I mean, how can anyone complain about $3 drinks?   Thanks Bucky K!  07/25/07 Was back here to celebrate Bucky K's Birthday. Staff was awesome as usual.", 
    "review_date": "2007-06-14"
  }, 
  "JCXX0PsGak6HlF8w1P3uiw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lester W.", 
    "review_text": "Bar 821 is a small neighborhood bar that is good for small groups of maybe 4 to 6 people max. I don't believe that they have a full liquor license, so if you're coming here, you'll either be drinking wine, beer, sake, or soju.  Some of the mixed sake/soju drinks are actually quite good.  I wouldn't go out of my way to come back....but I would if I was in the neighborhood and probably only during happy hour. Happy hour is from 5 to 7 pm....all cocktails and all beers are $3.", 
    "review_date": "2009-01-03"
  }, 
  "TX9rMdLU0wlw4qF6s3l1YA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "o. c.", 
    "review_text": "there is something to be said about walking into your local bar and already having your drink on the counter before you even sit down...\n joey makes me a happy girl on any given night with his quips, don't give a damn attitude, and his delightful music selections. all in all happy to be home in 821, even if it \"was\" a secret", 
    "review_date": "2006-04-05"
  }, 
  "zpswu_OyqtF4ib1ydsCR3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy B.", 
    "review_text": "One drink two words.  Lychee Mermaid.  Sold and I'll take another for the road.", 
    "review_date": "2007-01-29"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "I've been called out on more than one occasion as to my gravitation towards good deals. This night was no exception. Upon entering the bar, i glanced at the taps and just ordered a Hoegarden. However, a few minutes later I took a look at the menu and noticed a few beers that were $1 cheaper and contained almost double the liquid. Thus, I ordered a 22 oz draft Anchor Steam and all was right in the world...", 
    "review_date": "2006-08-31"
  }, 
  "A7FNqfL30IjpcQ6fQffoOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bourbon Explorer R.", 
    "review_text": "Despite a lack of  hard alcohol, they still have stylish drinks that are likely to catch the cool set. I stuck to my microbrews as i usually do. Not too many of them here but they have enough to keep me interested. I love the stylish space which draws a mix of bike messengers and hipsters but maintains a chill vibe which is neither pretentious or too attention seeking.", 
    "review_date": "2011-05-08"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "Bar 821 has a lot to offer but are horribly understaffed on busy weekend nights. It's part of the Dajani Group, who also owns Nihon Whiskey Lounge on Folsom which is awesome.  Saturday night was the second time I've been out to Bar 821. As tradition goes, my friend sets off for San Diego mid June, so I try to squeeze every last hang time out of the month of May that I can. So we had a nice light dinner and wine at my place, then cabbed it over to NoPa for a change of scenery.   The place is very cute and upscaley feeling without upscaley prices. We both had specialty soju cocktails: she had the Lychee Mermaid and I had some kind of \"Gin\" Negroni. Her drink was sweet and subtle, mine tasted like earwax. Yes, I know what earwax tastes like, judge away. Surely it's difficult to mask soju in a gin flavor. And, real-talk, I didn't know it was soju until after I ordered.   Around $8 a cocktail and a very ncie ambiance, I can't complain too much. OR CAN I? One bartender for the whole place? Really? It's NoPa. A ton of people head this direction for a similar purpose as my friend and I. Also, just want to say, it's misleading when a bar back looms around behind the bartender and sips water.", 
    "review_date": "2014-05-19"
  }, 
  "pY2hKxkXzepgK7uUHSol_w": {
    "user_rating": 4.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Angie P.", 
    "review_text": "By the time I hit this bar, I had a couple beers and shots of whiskey in me to help fuel a small party. We got inside and there was no seating (it is a smallish bar, very long but no real width) so we stood behind the bar stools near the bar. We were able to get our drinks really quick and soon enough a couple seats opened at the bar.  We stayed for a few more drinks and overall we had a good time! I didn't mind standing at all. Everyone seemed to be coming and going anyways, so it wasn't long to get a seat.  I like the low lit atmosphere and the back lounge area. It is swanky and a bit sassy, but I felt right at home. There were people dressy and others who looked as if they got back from snowmobiling.  I like this bar.", 
    "review_date": "2010-12-31"
  }, 
  "cvkLinqobaKn4jAh-SHS6w": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Adam O.", 
    "review_text": "I never even knew this place existed.  I think I have walked by 100 times and never seen it, but I am glad my roommate decided to bring it up late Sunday evening.  So the drink I got came from Sarah S' suggestion, although it did make the bartender whiny because apparently it is hard to make (which is why you won't see it on the menu).  The drink was Guinness+Champagne.  Sounds dreadful on paper, but it was delicious.  In fact, I think it is my new favorite drink... Sorry Bar-man...  There were only 2 negatives.  The fact that the bartender told me he hated me when I asked him to make the Guinness+Champagne, and the fact that last call was at 10:30.  I really think this place would boom if they doubled the prices, dropped it straight in the heart of the Marina, played old kung fu movies on a projector at the back of the lounge, and played <a href=\"/redir?url=http%3A%2F%2Fwoxy.com&amp;s=7b81a4bf1adcf3aeb49449e19616955e1c355d6ae7500e41e5184044e1a6682a\" rel=\"nofollow\" target=\"_blank\">woxy.com</a> radio.  But I am happy to have them in my neck of the woods instead.", 
    "review_date": "2007-02-19"
  }, 
  "PjNd_KtXwyIHZUKPx84TwA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "H. A.", 
    "review_text": "I love this place! The drinks are great and unique. I had the Tropical Mist, has Sake mixed in, which was sooo tasty and a little bit of a creeper. Nice spot to lounge and wasn't too crowded for a Saturday night. I will be back. =)", 
    "review_date": "2009-05-03"
  }, 
  "oWDzbX3E9cb8bGdoeo0OPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "becca k.", 
    "review_text": "shhh. don't tell anyone about this place!  good wine/champagne/mixed drinks, not too overcrowded, and a friendly bar staff. some nibbles would enhance the experience and make me stay longer, but really, how many glasses of bubbly can one girl drink?", 
    "review_date": "2006-11-27"
  }, 
  "sj88HBD9awesKZ6NWi3O9g": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kirsten F.", 
    "review_text": "i read all of the other reviews of this place before trying it out, so i had heard about their strange attempt to be a \"neighborhood bar.\"  yes, there is a sign indicating something about seating privileges for \"locals\" and i guess the hours are... different, for an establishment slinging drinks.  i was a bit wary.    however, i ventured in last week and was pleasantly surprised.  it was a weeknight, so not crowded at all, and the ambiance was lovely.  dimly lit but not completely dark, and warm tones used in all of the decor.  The bartender was extremely nice, and the other patrons were of the low-key, non-scenester variety.  i loved it.    the wine list was small but definitely sufficient, and the MOCKtails were actually really nice, if a little froofroo for my taste.  i am extremely suspicious of soju concoctions, but i was impressed with the sour apple mojito.  it was too sweet for me to want more than a sip or two, but that isn't my style anyway, so i give it a thumbs up.    two really random observations: - there only seems to be one bathroom and the glass door is not completely opaque.  no one was waiting outside while i was using it, but i had to wonder if the user would be giving the line-waiters a shadow show on busier nights? - the cocktail tables are bolted to the floor.  i was appreciative, as it meant that i was unable to knock over our table or spill drinks with some excessive leg crossing.  however, if i had a larger group, it would have been a bit challenging to figure out how to sit at these tables and have a conversation together.  i recommend coming with a friend, on a date, or with just one or two other people.", 
    "review_date": "2006-07-19"
  }, 
  "B7A8EhUulVRTzr83dtvV7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris M.", 
    "review_text": "Quiet watering hole to chat with friends. It is a nice enough location without standing out as special.  No cards and a broken cash machine put a halt to the afternoon at 821  I would visit again if in the area but wouldn't go out of my way to return.", 
    "review_date": "2011-01-05"
  }, 
  "G8RpowvR9LodKj4_BCPMaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "Being a rivethead, I am automatically attracted towards anything with a number in the name: Front 242, the 400 Club, Richard 23, 16 Volt, etc. So Bar 821 should be a shoo-in, right?  Well, almost.  Frankly, I don't mind that they don't have a hard alcohol license. Their beer selection, albeit limited, makes up for it in quality. But I did feel underdressed there-- fancy pants and pinstriped shirts looked to be the name of the game. I still got good service and no disrespect, but at a slightly upscale price tag. The smallish space and dimmish lighting makes for a intimatish experience, which is nice, but it's not the kind of place I'd return to by myself.  Maybe that's just the rivethead in me.", 
    "review_date": "2008-01-23"
  }, 
  "VDTDGDW1r0dSpauuZUhjOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly B.", 
    "review_text": "I'd give it 3.5 stars if I could.   Why 3.5?  1. only one Zinfandel on the wine list (not an issue for all) 2. really noisy, which made it difficult to carry on a conversation  But... it's close to my house, has a good happy hour and seemed pretty chill. I'll try it again to see if I just caught it on a really loud night (Wednesday).", 
    "review_date": "2008-01-31"
  }, 
  "xtZMctl7AQNspIL_SF3guA": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Chris B.", 
    "review_text": "Top 5 favorite bar in town. If the fact that my Pac Heights dwelling ass will recommend this place to any friend in need of a great date spot, then I guess the \"secret is out.\"  I personally could give care less if the neighborhood hipsters are offended by my presence. Between the yummy drinks, the dark &amp; sexy lighting, and the speakeasy vibe, this place is tops in my book. Probably doesn't hurt that I have a great memory from one specific evening spent here, but that's a different story.", 
    "review_date": "2006-02-16"
  }, 
  "BKxQJJAh_0Jtv4MqxbjkMA": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ian M.", 
    "review_text": "2 blocks from my house. 22 ounce beers. Steps from the 24.  I have found my new favorite bus stop.  I will be in here regularly waitin to catch the bus to the 'stro.  Its small, dark, comfortable, really comfortable and cheap.  I love it.", 
    "review_date": "2006-11-10"
  }, 
  "n-eYeIpSTiKhoDeubO1mmA": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Omid T.", 
    "review_text": "There's something a little off about a place that's showing sports on a giant plasma TV, all the while cranking Love &amp; Rockets' back catalog, and that's what I love about it.   Although the decor leans toward the glitzy, chic-Amsterdam-lounge concept, the prices and (lack of) attitude remind you that it's a good local, with plenty of regulars and a nice selection of affordable drinks.   Sure, it's not incognito anymore, but I still tell my friends to meet me at the secret bar. It's still got the cachet. Longer hours would be great, but then it'd lose the charm of a lock-in, as my London friends would call it. They loved it too, by the way.", 
    "review_date": "2008-06-05"
  }, 
  "6gGzrNOQUBurM8Jj9BV9mg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jackson D.", 
    "review_text": "Yaaaaa! Liquor liquor liquor....liquor liquor liquor! Mini bar has a competitor. Let's watch these two spirit enthusiasts duke it out for cocktail supremacy.  It's a little more comfortable to lounge there a little more room. Good drinks, that Fog City was my demise.", 
    "review_date": "2012-09-02"
  }, 
  "-VDExdXeCmzVbWi0zrb0dQ": {
    "user_rating": 3.0, 
    "user_location": "Upper Darby, PA", 
    "user_name": "Kenyatta D.", 
    "review_text": "Great local spot. Nothing fancy but if you are in the area and looking for a comfortable, not snobby place to grab a beer or even something fancier this is your place. They have a adequate liquor selection and had some interesting beers on tap.", 
    "review_date": "2013-01-01"
  }, 
  "D0ty0wxjQLhQR9GjhMSLXA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasmine B.", 
    "review_text": "So I have this thing where I seem to take my first dates here for many reasons.  1. It's close to home (that way if it was a shitty date, at least I got a few free drinks and I'm three blocks from home)  2. It's fairly quiet. It's nice to actually talk to the person that I'm with, as I prefer to not be drowned out by music.   3. Happy Hour - I usually only go here when it's happy, as the $3 pints and apple mojitos aim to please.", 
    "review_date": "2006-11-27"
  }, 
  "CIyICwrEeEVCuuBUmaSdOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "HY L.", 
    "review_text": "What a cool little neighborhood bar.  They have $3 Hoegaarden beer till 7pm.", 
    "review_date": "2010-06-07"
  }, 
  "PneFv0XPJjK7hOVcCpsWlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MissNance R.", 
    "review_text": "You know you're in trouble when your cat tells you to leave the house.   Our dialog went a little something like this:  Mr. Biscuits (the cat): \"Get off the couch mom, I'm sick of your moping. If I have to watch one more hour of \"Sex and the City,\" I'm gonna lose it.\"   Me: \"Okay Mr. Biscuits, but where should I go?\"  Mr. Biscuits: \"I'm just a cat, how the hell should I know?\"   Okay, Mr. Biscuits is OBVIOUSLY not a Yelper, so I call my girl. J-Len, I need to get out of the house, out of my sweats, and interface w/the real world. I'm looking for somewhere close, should I feel the need to run home, and with kind lighting. She says, meet me at Bar 821. It's only 4 blocks from your house, Ms Lazy Bones. And they have a limited bar menu, which should keep it nice and simple as not to confuse your addled little brain. It's been awhile.   Me: \"Mr. Biscuits, help me find an outfit to wear.\"   It's hard to tell from a cat's expression, but I chose black and white stripes, which he seems to only wear. (His wardrobe is rather limited.) Relieved to have the house and remote control to himself,  he blinks in my direction as I leave.   Mr. Biscuits: \"Pick me up some cheetos while you're out.\"  Rrright, I set off into the strange, yet exciting world. J-Len was right -- only 4 blocks away, and the lighting kind and cozy. It's a weeknight, so not too crowded, the tempo and atmosphere just right.  I had the cab, she the champagne.    A good night, definitely worth leaving the couch for. Thanks for the push, Mr. Biscuits!", 
    "review_date": "2007-04-19"
  }, 
  "tHgPhoPRaSyGV7GWfB2osA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe D.", 
    "review_text": "Yeah yeah, I know. Not exactly a *hidden* gem.  What can I say? Good drinks (but no liquor), cheap happy hour, nice vibe, and in my 'hood.", 
    "review_date": "2007-09-24"
  }, 
  "sW4MBQ1UGnbDlBSytBIxTA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bradd S.", 
    "review_text": "I'm not sure how I feel about Bar 821. It has some good things going for it: cozy, good bartender, decent selection of beers and wines. On the other hand, it's noisy and crowded even on weeknights, it closes early, and it lacks a hard liquor license. It's a nice enough place to stop in on your way to somewhere else, or if you're waiting for a table at Little Star Pizza across the street. And it's a cool enough spot if you live in NOPA or have a date there. However, I definitely wouldn't travel out of my way to get here.", 
    "review_date": "2008-02-16"
  }, 
  "S_GMOPwx_QzO6MQVh_UQWw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abigail R.", 
    "review_text": "I very much enjoy their champagne cocktails - particularly during their amazingly priced happy hour ($3!!). I don't know if this is simply my own misguided impression, but the atmosphere here always strikes me as perfect for intimate chatting and getting to know someone new.", 
    "review_date": "2009-03-15"
  }, 
  "PZvyqN7sgHI-o4f8z7O-ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew S.", 
    "review_text": "Let me start off by admitting that I'm biased towards Bar 821 because it's three blocks from my place. But that aside, this place is really chill for some tasty, cheap pints. Many a pint of Speakeasy has been downed by yours truly here, and the ambience inside lends itself to the laid-back, relaxing vibe. Only catch: the damn place closes at 11, but don't let that get you down, because Fly Bar is a cigarette drag away!", 
    "review_date": "2007-01-25"
  }, 
  "SSD26yoDiBSSITalN3In7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy K.", 
    "review_text": "Bar 821 is the decent spot to have cocktails in a low key, chill atmosphere with a friendly staff.  The place has a small bar, with a few tables an chairs and a bigger couch in the back.  Bar 821 does not have a full bar; they serve beer, wine, and creative champagne and sake drinks.  Although they have specialty drinks, I prefer the tall PBR cans.", 
    "review_date": "2010-06-24"
  }, 
  "Eypq5gLLjCapBVVnMw_MyA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Misha T.", 
    "review_text": "So their crazy cocktails tend to be too citrusey (citrus is good but so much you pucker is not) but really how often can you pay $5 for someone to work that hard on your drink. It's rare.  Stick with the champagne cocktails, they're a little ligther on the citrus", 
    "review_date": "2011-10-22"
  }, 
  "rhWaYitTCuh80PazQ9XaYg": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Elena M.", 
    "review_text": "i like this place. my friends and i were looking for a place to grab a drink while we waited for a table at little star. we walked around the neighborhood, walking in and out of a couple other bars. bar 821 was just what we were looking for. dark, intimate, ample seating. they don't serve hard liquor, so i ordered a sparkling ginger which turned out to be quite yummy. the bartender was friendly and the atmosphere was casual and unpretentious. this is the kind of bar i would go to more often if i lived in the area. it would be great for a group of friends or a date.", 
    "review_date": "2008-01-15"
  }, 
  "KnOu4IZEXcrnqCaTvxJWRw": {
    "user_rating": 5.0, 
    "user_location": "Thousand Oaks, CA", 
    "user_name": "Michelle K.", 
    "review_text": "I'm impressed by any place that manages to look like a club and act like a bar. Bar 821, is one of those rare spots in the city that doesn't treat their mixed drinks as means to make up their substantially expensive rent payment. Meaning, they make a mean drink for little, well not a lot. It has the SOMA atmosphere, without the crowd and attention to loud music. The place had a distinctive air of cool matched only by their mixologists. Keep an eye out for their specials, last time we went all champagne cocktails were only $6 for the whole night. You won't see veuve (this isn't SOMA), but do expect fresh squeezed juices splashed inside your bubbles.", 
    "review_date": "2009-04-19"
  }, 
  "y-OPLQtDHI6lGX5PdoMyBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Godot -.", 
    "review_text": "This place is the perfect neighborhood bar... a few of us went for happy hour and loved it.  Nice decor, cozy vibe, unpretentious... what's not to love?  The whole concept of nigori sake in a cocktail with mint is a bit vile, though.  I may stick with the champagne-only or soju-only cocktails, or the beers from now on.", 
    "review_date": "2007-01-04"
  }, 
  "q0HDybhT0V9dXrs63_WqWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa G.", 
    "review_text": "I didn't know 821 is associated with Corkage and Tsunami right around the corner. So, they specialize in sake, beer and specialty cocktails...no other liquors. For a Saturday night at 10pm, the bar was relatively empty, but a good crowd was starting to arrive. I thought it'd be more crowded than it ended up being, which is awesome. There was no problem finding a seat either at a table or at the bar. Music selection was great, and not too loud so I didn't have to yell for my friend to hear me...that's very important to me.  $5 for a beer, $4 sangria (which I was told isn't the greatest)", 
    "review_date": "2010-07-11"
  }, 
  "Qtvx4lcMkgzwOS15pfB3uw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie C.", 
    "review_text": "Update AGAIN! 1/28/08:  I have gone back to this bar a few times now and realized it is much more of a date one-on-one kind of place.  Their Happy Hour Rocks.  $3 for beer and specialty drinks is pretty great.  Nice atmosphere and a friendly bartender.  Earned yet another star!  UPDATE 6/16/07: Went here for a drink while my date and I waited for a table at Tsunami...the champagne drinks are yummy and the bartender was super cool so they earned an extra star.  Previous Review/Experience: A group of friends and I headed over here after lots of beer and pizza at Little Star...we had never been over there so we thought we would check it out.  It was tiny, dark and moody...kinda made me giggle to see the sign that said \"We only serve nice people.\"  We got all kinds of looks from the people in the bar.  This was NOT a place to go BS with your drunk buddies.  We decided to leave to go to the Page..  One of my friends drunkenly (yes that is a word) said \"Let's get out of this fuckin' hipster bar\" and a guy smoking outside said, \"Fuck you!  Go to the mission!\"  We laughed the whole way to The Page.", 
    "review_date": "2006-09-08"
  }, 
  "eCcjxh8zjAqn-kZVWZ_HJQ": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Katie S.", 
    "review_text": "After a previous failed attempt at getting a drink here (it was packed and there were about 6 of us), my boy and I went back last night.  Two champagne cocktails (me) and a Guinness (him) later, we were making out on their surprisingly comfortable bench seats.    Everyone else has already mentioned this, but the valentine and the lychee mermaid are fabulous.  We didn't drink any wine, but the wine list looked good with some very reasonably priced bottles.  I'll definitely be back.", 
    "review_date": "2006-04-02"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Raised voice.  Growing up Mom did it all the time. Apparently calling her out of class so she could pick up the latest version of Legend Of Zelda was not a good choice.  Here at 821 despite two very good cocktails for aa very good $17 can't give more than three stars. We pretty much had to yell while conversing over rather loud music.  Detracted from an otherwise relaxed and inviting vibe with a friendly bartender.  Tone is down and stars will be up.", 
    "review_date": "2014-11-15"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "I loved the 5-7 happy hour at this self-purported \"locals\" place -- though it is a far cry from Cheers. Great vibe, awesome fermented liquor martinis. Good music, diverse clientele, all at $3 a drink. Get sloppy drunk at 6 pm here!", 
    "review_date": "2006-05-15"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "You could think of reasons not to like Bar 821: It's small and dark, there's no hard alcohol, and the beers on tap (Hoegaarden, Leffe, etc.) are kind of pricey and there are no budget drinks available. They close early, and there are no pool tables or porn video games.  Think of the intent though; it's not a get smashed and jump on the couches place. It's a meet your neighbors for a drink place, and a get to know each other on a first date place and a relax after work place. You don't drive nails with screwdrivers.   If you're here for the right reasons you'll appreciate the slick dark decor and the friendly bartenders and the clean restrooms and the TV that's always playing stuff like Dune or Clash of the Titans, You'll sit with your friends or the girl or the guy that you finally asked out and relax the way you're supposed to.", 
    "review_date": "2007-03-05"
  }, 
  "7egWE1QHw3Fx8IigeItxtA": {
    "user_rating": 3.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Darrel D.", 
    "review_text": "I met a few people at this place in order to relax after work, and enjoy the inebriated happy hour goodness with good company.  Good Points about this place:  1) Happy Hour Deal (5pm to 7pm):      - Mojitos are $3      - IPA (22 oz) drinks are $3      - Champagne Cocktails are $3      - Bonus: they have Sake 2) Good music 3) Very clean 4) Nice atmosphere  Bad Points: 1) Parking sucks 2) Bartenders don't pay attention if you have the need for a refill 3) This place does not have food or hard liquor  Regardless of the above bad points, we had a good time. The IPA is the strongest I've had (ever), and the champagne cocktails are interesting.", 
    "review_date": "2009-11-13"
  }, 
  "G3gST4kgN-hlYsKeunrixA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole C.", 
    "review_text": "I love the bartenders.  The Mojitos knock me out every time. Its such a relief from the chaos of Fly Bar. Pretty relaxing and a great place to meet with some friends without having to shout.", 
    "review_date": "2006-11-07"
  }, 
  "VQ-RXIZCH-7eRG8jSMmr9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Judy L.", 
    "review_text": "i dream about the lychee mermaid - a champagne cocktail with a lychee. it's worth the trip.", 
    "review_date": "2005-05-14"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Small, dark and AWESOME!  It's the perfect neighborhood bar atmosphere.  They don't serve the hard stuff, but I still like it anyway.  The bartenders are really nice and the ambiance is great for a date.", 
    "review_date": "2007-12-27"
  }, 
  "FcobOiuZH6Isr8dBFordFA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "pam r.", 
    "review_text": "This place it took a while to even get serve the lady bartender was just talking with the regulars, When we finally got serve we found out they don't serve hard liquor. so we order a some wine and beer and the beer was warm and the wine was flat. That it we left...........", 
    "review_date": "2011-10-21"
  }, 
  "G9Vb6yQ047TC3O_-GG4WZA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Connie C.", 
    "review_text": "A cool little bar to be happy at between the hours of 5 and 7pm every day! $3 soju and sake mojitos, martini and champagne cocktails (the Lychee Mermaid is yummy!) and beers guarantee you will be happily buzzed before getting dinner at NOPA down the street.", 
    "review_date": "2007-09-25"
  }, 
  "yU0sTbaC8NZvJu4noyYiOw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikke G.", 
    "review_text": "A group of us checked this out for a pre-dinner cocktail on a Wed. night and it was crowded by 7pm. There are a lot of long tables so smaller parties will have to cozy up with their neighbors.   The $3 happy hour cannot be beat as concerns bubbly drinks and beer, but prices are quite reasonably anyway.  Lychee and Ginger Champagne drinks we're delish.  For cocktail drinkers, beware Soju only.   None of us tried the wine..but there looked to be a decent selection.  Low-key atmosphere, great for meeting friends for drinks when you actually want to talk to them instead of posing and people watching.", 
    "review_date": "2008-01-18"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "Sorry Nicole, we people who are \"so marina\" have descended upon your adorable Divisadero Row.  We just love the lounges.  Stylish, fun, good conversations, great bartenders, people who look good without trying....  This place should stay open later, like 4 am.  The bench-like seats along the wall are built just right for extra-curriculars, just like a good couch, soft as hell but not too slippery, nice and sturdy with plenty to hold onto for appropriate leverage...just kidding.....sort of.  This place is how you want your living room to feel.  Plus I've always wanted my own bartender.", 
    "review_date": "2005-09-28"
  }, 
  "cyJsilA4llNkwFYOCLSIzw": {
    "user_rating": 3.0, 
    "user_location": "Sherman Oaks, Los Angeles, CA", 
    "user_name": "Helen C.", 
    "review_text": "I don't get why people wet themselves for this bar.  It's okay enough and I could see why those in the neighborhod would really like it, but it's just one non-decorated room with corrogated metal walls and little else.  I'm not trying to crap all over 821's parade, but I just think this place is garnering too much hype for what it is.    Having said all those mean things, I will say that they do have good cocktails (I recall trying something delightful with ginger) and I've never had to stand or sit at the bar for lack of a table.", 
    "review_date": "2006-04-26"
  }, 
  "fzwx-6P-uGbowzFWycjPbw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay M.", 
    "review_text": "It's interesting what happens when a place doesn't have a hard alcohol license -- it makes them get creative with soju and sake and come up with things like soju mojitos and a drink I didn't get the name for, which was a shot of soju dropped into a half-pint of champagne.   The staff in general seem like they enjoy what they're doing, which always makes it a better experience overall.  I didn't venture into any of the funky soju cocktails, sake, or the wine list.  My attention was caught by the belgian white ales -- Leffe, Hoegaarden, and Chimay White.  The selection of beer isn't very wide beyond those Stella, and Big Daddy IPA, but there are plenty of other drink choices.  The space is kinda small for the Friday night crowd, so don't roll in with a big group and expect to sit down anytime soon, but the population is friendly.", 
    "review_date": "2007-07-14"
  }, 
  "2AOUvDvG7rvAX1hLI5QZKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kelly M.", 
    "review_text": "821 is the shit. locals. cool spot. good beers and wines. i heart the bartenders and they treat me like a neighborhood regualr even though i dont live here. unpretentious. fun. nice people. good stuff.", 
    "review_date": "2007-12-28"
  }, 
  "OhsTFtSTMEREcZJyq2FS8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa T.", 
    "review_text": "My little after work spot. Love the happy hour specials. The bartenders are cool and the place has an intimate quiet vibe which I like. I'm not trying to deal with crowds after work. And this is the perfect place.", 
    "review_date": "2013-12-16"
  }, 
  "ZqsPaSa6ks-T5R2H6dSPQA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Joseph D.", 
    "review_text": "Bar 821 has a good Monday night happy hour with half price bottles of wine (choice of one white and one red -- they come in ~$16/bottle). It's a comfy place to lounge and hang out with friends when you're looking for something low key. Definitely also a plus that they let you bring food in (and Little Star is across the street)!  Recommended.", 
    "review_date": "2013-01-23"
  }, 
  "_PkcqlEXrgeHeQ0z71lQLQ": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Nicolau W.", 
    "review_text": "This place is really awesome. The decoration, ambiance, music, the drinks. All was great. But it closes at 11pm.  I am not American, so I find all the restrictions really strange. Minimum age is 21 to drink... Well, I'm old already so whatever. But then the bar only serves wine, champagne sake and beers. Something about the license?... I guess some people might be put down by that, but for me it's not a problem too. I had two different champagne drinks, and I liked them a lot. And the tap Chimay was great. The beer selection looked great to me, and good prices too. I can't tell of any food, didn't try it. Bathroom was fine.  A game was on TV, but it didn't seem anyone was there to watch it. I saw _some_  people there, mostly friends and couples talking, it seems. Anyway, I was liking the place a lot. The music was really really good, lots of soul and funk... But then, they had to close at 11pm. That's just crazy. Is it something about the license too??  So everything about the place looks great. But it made me go home earlier, and I have to take a star for that. And it looked like it was much emptier than it could be _just_  because of that. So because this problem seems to be really hurting the place indeed, I must take a second star.  Best place to go if you want to have some good time on a place where it will be really easy to sit and to get your orders. And then come home early. If you want that real memorable \"fun times\" parties, and totally \"spend the night\" somewhere, look for another place.  Maybe it just pretends to be a good place to get the night started, whatever.", 
    "review_date": "2011-08-21"
  }, 
  "JxotojpExvYIaT4JZpH9pQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee I.", 
    "review_text": "Cute little place, excellent champagne cocktail list, awesome bartender.", 
    "review_date": "2008-05-20"
  }, 
  "2TFc0YAo1RbUqx0A7w3GTw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Dave S.", 
    "review_text": "Great suds and saki drinks at great prices.  Get the evening started here because the door closes at 10:00", 
    "review_date": "2004-10-12"
  }, 
  "-EQ1Emcof6LetySGmUJ2PA": {
    "user_rating": 3.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Alison N.", 
    "review_text": "Interesting little place.  I was meeting my date there and I arrived promptly at 6p, but no one else was there.  Including myself, my date, and the bartender, there were 5 people there at 6p.  Shortly thereafter, the rest of the crowd entered.  Then the lights went down to create a \"mood\".  I wasn't too fond of that (I guess I like to see the person sitting across from me.)  The wine selection is a touch sparse, but their beers are good.  They have a pretty lengthy soju cocktail menu, but I don't drink those.  I have a thing against mixing soju with anything.  Just drink it straight up.  Sadly, none of their wines are discounted for happy hour.    Anyhoo, the best date in a very long time began here and continued on to Nopa down the street.", 
    "review_date": "2008-02-20"
  }, 
  "XITHI2YDlRX3HyuXmn0pZw": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Brant O.", 
    "review_text": "Nice conversational, comfortable alternative to the wall-to-wall youngster scene that you're likely to find at other neighborhood haunts.  Killer happy hour features $3 Belgians.", 
    "review_date": "2006-09-17"
  }, 
  "hI3S1i8MN3wEMa4JsaX8jw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "butters m.", 
    "review_text": "I LOVE LYCHEE MERMAIDS!!!!!  I love 821. the bartenders are super friendly and it's only 1 block from my house, so i can happily stumble home!", 
    "review_date": "2007-02-10"
  }, 
  "57fuIDi-5V85MzFaet8Ytg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis G.", 
    "review_text": "I am hesitant to review this place, as I just don't want everyone to know about it. Bar 821 is just a great neighborhood bar. Its usually not too crowded and the bar tenders there always make a point of trying to help you find a seat, and work with the customers to make sure people are comfortable. Clearly this may not be the case every night but the dozen or so times I have been has resulted in a good time. Also the place closes at midnight so this helps keep the place from filling up too badly. They have chimay on tap and their cocktails from what I remember are tasty and well done.", 
    "review_date": "2009-02-06"
  }, 
  "Zcr90BeQ8QWV32XIqpH82A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake W.", 
    "review_text": "You know what, this is a great bar.  It's just a funky little place that pours some great beer and wine.  There is no booze.  Deal with it.  It closes early.  Deal with it.  It's a great place to just kick back with friends or get a pre-Little Star drink.  I wish I lived just a little closer.", 
    "review_date": "2007-04-02"
  }, 
  "qPGhjScyxtuHrWXN4A8VXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Loli L.", 
    "review_text": "A chill little spot to meet and catch up with pals. Dim, but not dark, and a sexy kind of relaxed. You know, like a subtle pair of dark jeans that make you look kinda hot in all the right places.   The ladies and I chilled in a corner, sipping on fizzy lady drinks and beer, while an A's game played in the corner. Good times.", 
    "review_date": "2013-08-12"
  }, 
  "et3ttmvP-HDIqfN-aSYPeA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D C.", 
    "review_text": "I DESPERATELY want to give you 5 stars, but the acoustics SUCK.  One would think after 3+ years and presumably scores of complaints, something simple (fabric on the ceiling, sound absorbing panels) could be done to address the noise. Aside from that, the decor rocks, the bartenders are all quite cool [except that Joey described me as a 40-something chick to a mutual friend when I was still only 39 :( ] and the Mojitos are my FAVORITE!! I'll keep going even though I'm obviously one of their *older* customers. ;)", 
    "review_date": "2008-10-24"
  }, 
  "RDwgEc8o15O2wqu-YQu29Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamal G.", 
    "review_text": "821 is still a neighborhood bar.  The best thing that could have happened was the removal of the rules.  If you see them taking it to the face, with eye balls and teeth, you probably witnessed your first ABC!  They close at 11pm, most days, which doesn't seem to be a problem with folks from the neighborhood.  I can see it being a problem with people looking for a place to chill till 2am on a Saturday.  If you still want to hangout after 11pm, head over to the FLY Bar!  Just as great.  Yet louder.", 
    "review_date": "2007-01-06"
  }, 
  "7A5lajj4qvHSDM97Kg-x4g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karsten P.", 
    "review_text": "Okay - nice vibe. Feels like a polished version of a type of bar you might find in New York, or, oddly, Puerto Rico. Drinks were good. The time I was there i also ordered a pretty tasty upscale Mac &amp; Cheese.", 
    "review_date": "2008-09-29"
  }, 
  "Xi9rQmCT871UpMvNRzAfuw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Babs P.", 
    "review_text": "This is my favorite bar in my 'hood. I've made ass here so many times and they still allow me back in. You gotta love joey. The only bad thing I can say about it is that they close too early. My favorite drink is the \"ginger\" ~ It's medicinal.", 
    "review_date": "2005-05-27"
  }, 
  "rK8kLDiaKoIexHy3JzcVCA": {
    "user_rating": 4.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Coco D.", 
    "review_text": "I want to be accepted by this bar.  This bar is like, a cool sweet cute guy, who is friendly enough to me, but I just really want him to think that I'm cool too.  So I put on a special outfit.  Not like, a sexy one, but a cute one that will let him know that I'm a neat girl.  And I try to play it majorly cool, not getting all wasted, but just chillin on my champagne cocktail.  And I don't wanna stay too long, lest I get sloppy, but I will just keep coming back til he recognizes me.  My heart will totally flutter.  And I will feel that I have accomplished something.  Can you tell that I recently turned into a fucking retarded 15 year old girl?  Christ.  Just go to the fucking bar already.  Unless you suck.  Then I will stab you.  Trust.  I just got a new knife.", 
    "review_date": "2007-09-27"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "The bar tender is so funny and nice, we had a cool duet singing to the music on the tv screen. The bench is so comfy the seats suck and hurt your back. Change the seats and it's ll good!", 
    "review_date": "2008-03-01"
  }, 
  "d_Bg88z72HQXt89MnSQ33g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan L.", 
    "review_text": "I am such a sucker for champagne cocktails.  The beers are tasty also and you can hang out here while waiting for your table at Tsunami.  My only gripe is that I drink a champagne cocktail in about 30 seconds which makes for a lot of trips up to the bar to spend yet another 5 bucks on yet another champagne cocktail while others are still drinking their giant $4 beers.  Get the lychee cocktail, you get the whole fruit in your champagne flute.  I love fruit in drinks.", 
    "review_date": "2006-10-14"
  }, 
  "tx407EtvKoXXEZqYQFQVJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff M.", 
    "review_text": "It ain't yer grandpappy's neighborhood bar, that's for sure, but this dive bar-a-holic actually likes it here quite a bit.  The house cocktails aren't really my thing but I've had a few and did enjoy them all.  When I'm done experimenting, I can go up and order what feels like a half gallon of Big Daddy for $4.50 (I think it's a 22oz \"pint\").  It's always cozy, and a great place to just hang out with a friend or two and just chill and talk.", 
    "review_date": "2006-07-12"
  }, 
  "Ovs-juHjGBvLaK7HTYU9ag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "reina t.", 
    "review_text": "When I walked into this bar, it was love at first sight. Zoolander was playing on the television and the musical selection for the evening was The Streets. Despite the fact that it was a Saturday night, it was not overcrowded and it was easy to get a drink. My drink cost a little more than I expected, but  it was also much larger than I expected. What a pleasant suprise. The ambiance was lovely, the seating was plentiful, and my date was audible. It was an evening well spent. The only downfall was that it closed early, but apparently people live upstairs so that makes sense.", 
    "review_date": "2008-06-23"
  }, 
  "aea3PTk1cMMV7UTh9HXINA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sammy S.", 
    "review_text": "If you like champagne and testicles, this is the place for you.  And by champagne, I mean champagne, and by testicles, I mean lychees.   I'm not a huge fan of lychees, or testicles for that matter, but the Stella here is free flowing and delicious...unlike the skunk-tasting brew I had at Casanova, that bush n' boob bar in the Mission.  Bar 821 is good people, and by good people, I mean people who juggle cocktails, buy copies of \"Anal Bandits\" from the liquor store down the street, and bring their giant dogs for me to maul.   The bartender talks real sexy-like, the seating is cushy, buttery and plentiful, and the space is chic and modern. My one gripe would have to be that the acoustics here sort of blow monkey balls. When you get a bunch of rowdy Internet dorks all riled up over a hooker in a tube top of sexy destruction it becomes a bit deafening in these tight quarters.  Also, big ups to any bar that allows you to bring in outside food. Thanks you beautiful babies for letting us eat pizza. And by us eating pizza, I mean me burning the crap out of my hand on Ed's fourth piece of meaty meatington surprise pizza.", 
    "review_date": "2007-06-28"
  }, 
  "ZXNwO2bY3QTYP0k_5bhG1A": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Dan B.", 
    "review_text": "A nice, small neighborhood bar with an impressive selection of liquors and cool atmosphere.  This was the first place that came up on the Yelp app when we realized we still had some time to kill before a show at the Independent.  The bartender was working hard yet still made eye contact with us as we sidled up, telling us it would be a moment. A professional at work.  Drinks were strong and tasty.  They made a mean Old-Fashioned for my friend P.  And my Bombay and tonic was perfect.  My only complaint was the place was packed at 9 pm on a Friday and space was quite limited. I made an attempt to hit the single, unisex bathroom, but the long line made me do an about-face and decide to look elsewhere. It was time to go to the show anyway, just a block away.", 
    "review_date": "2013-07-24"
  }, 
  "tGgTIueZy1JNTzQD9rkZLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "I am in love.  This bar is awesome.  We didn't have trouble securing the big table in the back.  The chairs are comfy.  We don't have to scream in each other's ears to have a pleasant conversation.  Mon-Fri, 5-7: $3 for champagne and specialty cocktails?  I'm sold. $3 draft beer.  Booyah.  All the other times the drinks are around $6, which still beats some SOMA happy hour deals.  :) all around.  Yes, the bar closes at 11 every day.  Yes, it's cash only, so come prepared (they have an ATM in the front).  Try the wannabe bloody mary cocktail.  It's effing delicious!", 
    "review_date": "2009-06-12"
  }, 
  "A7YvpaBWM2WlG0BiGh2eZw": {
    "user_rating": 3.0, 
    "user_location": "Weehawken, NJ", 
    "user_name": "Polina S.", 
    "review_text": "I  came here with a couple friends on a rainy Saturday night. It was far from crowded. Just a few people at the bar and the couches were completely empty. We ordered a pitcher of sangria and took a seat on the couches. It seemed like a typical evening until a middle aged Asian man sitting at the bar fell of his bar stool. He then stood up, attempted to sit on the chair again, and fell again, this time slamming his face into the bar. When he stood up his face was covered in blood. Shortly after the paramedics arrived. They attended to the man. In the mean time he tried to drink a candle. Finally the took him away on a stretcher in an ambulance. After that the place cleared out. We finished the pitcher of sangria and were on our way. Interesting experience. Oh the sangria was tasty, but not very strong and there was no fruit floating around.", 
    "review_date": "2010-11-21"
  }, 
  "Cph7U9lIT23uCV85K-nyZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Esme W.", 
    "review_text": "This tiny little bar is around the corner from its sister restaurant, Tsunami. We wandered in while waiting for our table to open, per the recommendation of Tsunami's hostess (and after walking in and immediately out of Fly because it smelled like barf...YUCK).   We got scolded like schoolkids for playing with the candles on the tables. We like hot wax...what can we say?!! SORREE! But other than that, this place is alright. 812 is quaint -dimly lit (uh, candles...that we couldn't touch), cozy seating, yummy Soju cocktails, and right around the corner from kick-ass sushi.", 
    "review_date": "2007-02-22"
  }, 
  "hKozw4Wo1DAXtBomsqRCxQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tatjana G.", 
    "review_text": "Being stuck between two neighborhoods can sometimes be confusing and difficult.  But now I can either roll four blocks down the hill to be hipster-slumming at Place Pigalle or crawl four blocks up the hill to be hipster-hobnobbing at Bar 821.   And in both cases I won't have to worry about making too much of a fool of myself, cause neither serve liquor.  Life is good.", 
    "review_date": "2008-07-02"
  }, 
  "2nn7CyYHUPbK-Op8bO3iDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shweta V.", 
    "review_text": "Great happy hour spot. Relaxed ambiance, easy access to good restaurants. Seems to be a hang-out for neighborhood locals.", 
    "review_date": "2010-05-16"
  }, 
  "JtBB1yM9Rcs8S-BBOjAoWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert L.", 
    "review_text": "I came for $3 happy hour.  Then I came back.  Guinness is $3 on tap? Awesome.  Anyone want to go to happy hour?", 
    "review_date": "2007-09-14"
  }, 
  "n9j40NJNoehiV4DRN-z2QA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Whit P.", 
    "review_text": "HELLO happy hour! Seven days a week and awesome music and a fun bartender with just enough attitude to keep it interesting. They also don't care if you cruise in with a Little Star Pizza and pig out with your champagne cocktails. I am quite happy it's close by my house.", 
    "review_date": "2006-07-23"
  }, 
  "5Tc0YXgYDvTTlps0e8xTNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jill D.", 
    "review_text": "Love this place and their champagne cocktails.  Was even cooler when only the locals knew about it, but if you eat at Tsunami you know about Bar 821.  They have cool happy hour specials and an overall cool vibe but I wish they stayed open later.", 
    "review_date": "2005-08-19"
  }, 
  "9BgXTZ2xz1fwa7LbXYZobQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny S.", 
    "review_text": "I'm not much of a fan.    I like that they are very neighborly, that happy hour drinks are super cheap, and that they have a great selection of wine and beer.  But let's face it, the lack of hard liquor is a huge blow to any bar.  And frankly, I really wasn't feeling the decor, it felt pretty run down in there.  But the real deal breaker for me was the noise level - couldn't really have a conversation with my peoples, which is why I was there in the first place.  Parking also *sucks* in this part of town...", 
    "review_date": "2007-10-01"
  }, 
  "hpYmAHWl2aWZRoNkUsUmhA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stumbalina b.", 
    "review_text": "I was really really wanting (needing!) a whiskey. All they had was beer and sake. Normally I love beer, but I had way too much beer that week. The sangria just didn't do it for me. The jalapeno sake was very interesting, but when a girl needs a stiffy, a girl needs a stiffy. I was dissatisfied. But the place is cute as hell, the music was cool, and it was pretty much empty on a Tuesday night, so I'm keeping this place in pocket for a local joint to have a non-whiskey drink on a weeknight.", 
    "review_date": "2009-10-22"
  }, 
  "VN_SQycB5BcaEwlWK1ofhA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "julia p.", 
    "review_text": "just the right size, just the right atmosphere and they have creative bubbly, for the love.  bar 821 has hit the spot every time.", 
    "review_date": "2006-10-15"
  }, 
  "irkLTpGy-NJjJDgkqZXC4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anelya S.", 
    "review_text": "$3 champagne and sake special coctails from 5 till 7 pm! I loved the bubbles and black currant drink. Small but flavorful and unique. Try it you will like it!  But try it during happy hour :)", 
    "review_date": "2009-06-15"
  }, 
  "b7s_gfkMlQ5d31UyQnHSEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "Tiny, very dark, limited drink menu, charming, intimate, friendly bartenders, 1st-23rd date location-able, cool crowd, cozy, lazy review writer", 
    "review_date": "2008-02-28"
  }, 
  "QOlY5FYliVVvkgqgtjdP_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim G.", 
    "review_text": "waiting for a table at tsunami or at little star?  head over to bar 821.  you won't be disappointed by their champagne drinks.", 
    "review_date": "2006-03-07"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "been here for the grand opening night, haven't been back since.  one star better than the fly bar.", 
    "review_date": "2007-07-12"
  }, 
  "L9mNqHKpuj1qMSJ2DxNiUA": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Tanya N.", 
    "review_text": "On the plus side, $3 champagne cocktail happy hour (including a lychee variety, always a positive).  On the minus side, I saw major hipster crack hanging out of skinny jeans at the bar.  I like the small and intimate setting, but the few scattered people there were a bit random, and I don't know that it gave off the whole \"where everybody knows your name.\"  Oh, and the bartender kind of gave one in our party shit for double-fisting during happy hour, but really, what difference does it make if she chugs one separately after another or sips two slowly at our table?  For now this is more of a three star place for me, but $3 champagne cocktails and fear of the wrath of Mimi bump it up to 4.", 
    "review_date": "2007-10-30"
  }, 
  "VBl7vAesh4K_YtB6je8I7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kris E.", 
    "review_text": "Great, small neighborhood bar.  And even though I'm not a regular, each time I've been in there, everyone was very friendly which is rare at some of these places.  Over sized drafts that get even cheaper at happy hour, plus a great wine selection.  Music played by the bartenders is always fantastic as well, which is a nice surprise.", 
    "review_date": "2008-04-24"
  }, 
  "bkZ4NzsWMZtmEQVGjZn48g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed B.", 
    "review_text": "Bar 821 covets itself as a neighborhood bar, but they keep the place lit so darkly that if you head in during happy hour it feels like a cave.  If however, you'd like to get out of the sun for a few hours or love $3 beers/saktails than this is an ideal place.  Franz Kaner on tap and other Belgian treats fits with the nice selection of beer.  The biggest downfall, aside from being so damn dark is that like some bars on Divisadero they don't have a full liquor license, so while it may say cocktails on the sign outside those are made with soju or sake.  All in all, this place has a great decor and a great happy hour, so if you're in the area and your thirsty before the clock strikes 7 its worth dropping in.", 
    "review_date": "2008-02-12"
  }, 
  "nd1Z0OCN5H6BaEr77HMLuA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "vlad k.", 
    "review_text": "I read a bunch of reviews about Bar 821 on yelp, and one of the things that i thought was really weird about it was their door policy. they dont let anyone in after 11pm. hmmm, sounds like kind of an interesting gimmick to stop letting people in after a certain point and have a private party inside for the rest of the night. sure, a bit odd, but i thought it could be interesting. we headed down there and showed up at the place at 10:45pm. as we walked through the door, the bartender glanced up and shook his head at us. nope, we wouldnt be getting any drinks tonight.  it turns out that we misunderstood... they dont just stop letting peole in after 11... they shut the bar down. so, it's only 11pm and we're outta luck with no other new bars anywhere near by. what kind of bar shuts down at 11?? is it past people's bedtimes or something? also, it's lame enough that they close at 11, but why not at least serve drinks right up until closing?? the reason bars usually stop serving early is because they dont want to break the law and have people still drinking at 2am... but if your bar closes at 11pm, there's no legal reason to have a\"last call\". also, they have a rule where they give \"locals\" preference. what does that really mean? do they check your address on your drivers license and then make non-locals give up their seats?? basically, i think these guys just wanted to have something quirky and interesting about their bar, but instead their rules are just kind of lame.  (my resolution this year is to visit 50 new bars in SF.  read about it at: <a href=\"/redir?url=http%3A%2F%2Ffiftybars.thisisvlad.com&amp;s=90470ef2a294ec5a8b83db337f40edb798ccaa93834eb5d3cc4e655df9ffd07a\" rel=\"nofollow\" target=\"_blank\">fiftybars.thisisvlad.com</a> )", 
    "review_date": "2006-06-21"
  }, 
  "HyFW6k7AQWIGgrWlzqM_dg": {
    "user_rating": 3.0, 
    "user_location": "Albuquerque, NM", 
    "user_name": "Rachel N.", 
    "review_text": "I liked it better when it was a secret.  Every time I try to go now it's way too crowded.  I gotta figure out how to get out of work earlier to take advantage of the happy hour Mojitos.  Last time I did this I ran into a friend from back home (WISCONSIN!) and got fairly soused without spending hardly any money.", 
    "review_date": "2007-01-03"
  }, 
  "FSyDuThc76rNcwBzcKq7cQ": {
    "user_rating": 4.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Amanda H.", 
    "review_text": "Always love anywhere that serves Leffe in the true Leffe glass. Tried the apple mojito, not much alcohol but tasty. Good dark atmosphere and tunes.", 
    "review_date": "2007-07-18"
  }, 
  "SwjJhjrxqhqk3yyjXQPJ7Q": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Julie H.", 
    "review_text": "I'm Korean and let me tell you, I know a thing or two (or three) about soju.  The soju-tini's here are good enuff to get me out of my kimchi squat and into the bar yelling, \"jom duh joo say yo!\"", 
    "review_date": "2005-10-13"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "This is very much a door on the side walk that you \"happen\" to find.  It's dark, warm, cozy and the bar is sake, wine, beer and other non-hard alchohol booze.  A great bar to relax and unwind with a pint or a glass of wine.   It does close early sometimes so it's definitely a \"starter\" location.  I used to come in here when I lived a few blocks away....  I miss it....*tear*", 
    "review_date": "2005-11-09"
  }, 
  "okheuL-I4sywPZS936vJ1A": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Joanna R.", 
    "review_text": "So, to tell the truth, this bar isn't the sort of bar i would normally go to. I was told to meet some girlfriends there before heading over to waziema on a weekday night for happy hour. i knew nothing about it. at first i thought it was going to be an absolute nightmare. what is a non-beer drinker supposed to order at a bar that really only serves beer?? it wasn't until my friend introduced me to a champagne/Guinness specialty drink. and it was...delicious!!!! it was the most amazing combo i have ever experienced. i also had a sip of a friend's drink...another combo--delicious as well.  I now love this bar.", 
    "review_date": "2007-02-13"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "Op! My review of this place disappeared, I know I was one of the firsts because I lived across the street when 821 debuted. Nice little neighborhood bar that just happens to be adjoined to Tsunami and the kind folks that run that joint. The bartenders have always been fun, easy on the eyes and generous, which is all I can ask for when I'm hanging out being a wino. I'm not much of a fru fru cocktail drinker unless it's something with a real kick, so I've only tried the soju stuff a few times. It's ok though, you can hold onto your tough guy demeanor and kick it with a brew just as easily as you can lounge around with a 'pinky out' cocktail. Go ahead, give it a go!", 
    "review_date": "2007-06-26"
  }, 
  "xyNdK7m0i1Y4pb4gJicA6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clar L.", 
    "review_text": "Suede/velvet seating, low lighting and cozy space make this champagne bar a refined yet relaxed hangout for neighbors and those in the know. It's intimate and well serviced, two qualities the establishment preserves by under-advertising itself. Some of their house rules include \"If you have found the place, don't tell anyone\" and \"Doors close to [further] visitors after 11pm\" as well as \"We only serve nice people\".  Indeed, they only serve nice people. Everyone there was smiling and polite. None of that meat market mentality here. Also, there was an oasis of sexy accents there that night - British, particularly. Rowr. The bartender from Manchester is a sweetheart and will offer suggestions for adventurous tastes. Ask him about the ABC, which was created there, courtesy of said bartender and fellow Yelper/local Gabriel T.: <a href=\"http://www.yelp.com/user_details?userid=RDwgEc8o15O2wqu-YQu29Q\">yelp.com/user_details?us…</a>  Tap is a selection of European beers. Cocktails are $4, Champagne cocktails $5, and they have a nice one-page list of wines as well. It's all there in the handy laminated menus they leave out on the tables. Don't worry, it's actually legible in the candlelight.  I'd love to see a collaboration with their sister restaurant Tsunami, or Cafe Abir, to bring snacks/food pairings to their wines, champagnes and beers.  Eat before or after to absorb the alcohol by going across the street for good pizza - Star Pizza and Stella Doro. And no need to drive, when the 24 Muni stops just at the next corner down.", 
    "review_date": "2007-03-13"
  }, 
  "VKHzPLata1ygaWuPKwLdAA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek Alistair J.", 
    "review_text": "you treated me okay. I will admit, it wasn't so much fun being sneered at by the bartender who under his breathe said 'f***** hipsters' when we approached the bar.  maybe he was a Republican? maybe he didn't like minorities? I dunno. but its a cheap drink and a cheap thrill at this place but next time but they don't have hard liquer which is a bit of a bummer. so it wasn't quite easy for my date to get me drunk and I know she wanted to take advantage of me but you cut her off from letting her buy me another drink. shame on you. I missed out on sex.", 
    "review_date": "2008-10-10"
  }, 
  "WxkLoIU42jZ96_U-WQyZnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amelia S.", 
    "review_text": "Small and quaint place for a mellow night out w/ friends.  This place is not crowded at all and seats are easy to get.  Had great time here conversing w/ friends on a friday night. Although they only offer beers and champange, its still for a good price of $5!!.  Great champange drinks combo too! Try their lychee martini.  Some drawback? the place closes at midnight, which can be a drag if you want to extend your night and its cash only.", 
    "review_date": "2007-04-18"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Cozy neighborhood bar with incredible cocktails! You want a negroni? an Old fashioned? Or how about champagne cocktails?  All cocktails are $7. Cash only.   Go.", 
    "review_date": "2013-10-01"
  }, 
  "qYoqDt1X8x3g6O828-NSwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lee P.", 
    "review_text": "This place had no sign when I moved to the neighborhood seven years ago.  A secret little hole in the wall pub that closed up, neighborhood peeps only, at 11pm.  I liked that, kind of makes you feel cool and special.    It does get really loud in there when it fills up, and there's a big ass TV right behind the bar, glaring you in the face, but the bartenders have always been personable, and know how to pour a Guinness.  Why the hell am I reviewing this place?  It's supposed to discreet.", 
    "review_date": "2007-12-05"
  }, 
  "Zqu-tMR9CHjA44sU7I5bXA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Viv C.", 
    "review_text": "If it wasn't for the mediocre crowd, the impossible to find street parking, and the fact that this place closes at 12 midnight, I'd hang out here more often. (Because the tasty champagne-themed cocktails are damn cheap--$5!! Just make sure to pay in cash because they don't accept plastic.)  Eh, Nopa, you can have your neighborhood bar, this Lower Haighter's not going back.", 
    "review_date": "2007-02-09"
  }, 
  "sufkjANL62wXkSDH8gO0og": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin H.", 
    "review_text": "Bar 821 is a great little neighborhood place--I haven't been in awhile b/c my friend who lived in NOPA moved and so now this cool area is no longer my second 'hood.  But when I was hanging out there all the time 821 was a great place to go for a casual drink, either after or before dinner.  Everyone is very friendly and the atmosphere is stylish yet relaxed and unpretentious.  Yes, they close at 11, but somehow that makes the place seem even cooler...", 
    "review_date": "2008-06-17"
  }, 
  "g4GOmL5pVrGLXSf98HaqOw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Jen O.", 
    "review_text": "Did you know that if you put a raisin into a glass of champagne, it will continually float to the top then sink to the bottom?  You have my permission to impress your friends with that useless fact as you sip champagne at Bar 821.   I went there for the first time last night, opting for the Silk In Pink (bubbly, cranberry juice and Triple Sec), but enviously eyed the Lychee Mermaid my friend had ordered (the bartender plops a nice lil lychee fruit into your glass! ...from a can. but thoughtful all the same)  These champagne drinks are only 3 bucks if you hit this spot at Happy Hour!", 
    "review_date": "2007-06-09"
  }, 
  "G0jy3hldFyLBbxtMoF4PkA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan V.", 
    "review_text": "I love coming here. I moved to the area JUST so this could be my local bar.. OK not true, but it's definitely my favorite.  If you're looking for something that's slightly more subdued and a place where you can hang out and bullshit with some friends, this is it. They don't play the music too loud, the drinks are great and seating is always reasonable. Great place.", 
    "review_date": "2008-07-07"
  }, 
  "a7HMfHXKNpf3ss14gEBKZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brad b.", 
    "review_text": "This is me and my girlfriends favorite sunday spot. No hard alcohol but the bartender \"James\" always takes great care of us. Keep the champagne cocktails coming.", 
    "review_date": "2008-11-11"
  }, 
  "l4OBmQR8mw2ioskl50_3Hw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "San F.", 
    "review_text": "Happy hour is from 5 - 7pm. $3 Hoegaarden, Lefe, Guiness, Stellas. Anyone who's anybody wears FTC or Huf gear here. If Parkey Posey were alive, this is where she would be reading a magazine while waiting for her Little Star Pizza to get delivered. Sometimes they have \"The Wiz\" playing on the widescreen perfectly positioned to pay the bills of your chiropractor for the next five years.   It's quaint. It's quiet. It's intimate. If you plan on goosing, take her here. You won't even need any rohypnol. Use some nice coversation and LISTEN. Don't just talk the whole time. LISTEN.   It's small and the seating is very low, so don't plan on bringing Chewbacca.", 
    "review_date": "2007-12-19"
  }, 
  "G1DM_OyYFb32QylgvQGrGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "regina k.", 
    "review_text": "The bartender (Tonya, I think) was so sweet, it was as if I were an actual paying customer.  What makes this place great is that you would never know it's there until you have been there.  It's in a great location right at Fulton and Divis, and yet it sits behind a non-obtrusive door.  It's clean, low key and has a \"locals only\" feel.", 
    "review_date": "2009-12-23"
  }, 
  "94b0y-FFFIF8hy3SJgXd-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nicole c.", 
    "review_text": "Note: neighborhood secret bar is no longer a secret. get over it. i'm over it.  just like I'm over thinking that madrone could be my own private drawing/eye-candy/antique sofa lounge, or that Popeye's may one day get kicked out of the hood. \n Anyway, what surprised my friends and me during our recent visit, were the champagne drinks! I've been to 821 dozens of times, but never ventured beyond wine or beer. I'm not a huge lychee fan, but i found myself with a tall slender bubbly glass including a lychee at the bottom! Another darling champagne drink, called \"Valentine\"  included a strawberry &amp; a chocolate chunk at the bottom...for roughly $4...I just about fell in love...\n Bar 821: smooch.", 
    "review_date": "2005-08-01"
  }, 
  "glRZ8EwDrhPm36s0nmLOng": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Meagan C.", 
    "review_text": "This place is amazing.  Happy hour rules and it's 7 days a week.  Bartenders are really awesome.  Try the Luxury Mojito (a soju-sake cocktail); it's delicious, and during happy hour it's just $3!", 
    "review_date": "2009-09-17"
  }, 
  "7rjAgnw-DsHThvzf6TDBLQ": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Ross G.", 
    "review_text": "Aight listen: Strike 1: No hard liquor Strike 2: Cash Only Strike 3: Close at 11 (WTH?!?)  It was cute and trendy, I'll give it that. But fundamentally there are some things that make or break a bar; regardless of whether it's a bar inside of a nightclub, inside a Marriott off of 101, a dive bar, a lounge, anything. There are certain mandatory qualities to get me to frequent a bar (or at least want to come there more than once). Closing late is good, but letting my pay for my gin and tonic with plastic is also important.", 
    "review_date": "2008-05-29"
  }, 
  "sRVGewx--HgwwlKwAfCO9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz S.", 
    "review_text": "If Bar 821 were a drink, it would be the Black Velvet.  The pairing of Guinness with Champagne is the perfect contrast between the everyday and the extraordinary that makes this place so unique.  It's one part lounge, one part neighborhood watering hole, one part hipster dive.  And it works together beautifully.  I've been here twice now and both times I have felt so relaxed and at home.  The noise level never gets too high, and people are respectful of each other.  The crowd is mixed, from people waiting to eat at Tsunami to the guys from Everlasting Tattoo a few doors down to the regulars.  The first time I was there, I watched a really cool skateboard video and just hung out while I sipped my Black Velvet and waited for my Little Star Pizza to be ready.  The next time, I brought my friend Michael and we had a grand time shooting the shit and enjoying the $3 Happy Hour cocktails.  That's right, 5-7pm Happy Hour = $3 for everything.  You be hard-pressed to find a better deal than that.    I prefer the Champagne cocktails to the soju drinks, although my friend liked the Apple Mojito a lot.  For the champagne cocktails, I would recommend the Ginger one or the Lychee.  There is also a Chocolate/strawberry one that I would love to try when strawberries are in season.  As for my beloved Black Velvet, it will have to remain but a memory, as this lovely concoction is now off of the menu.   Lighting is low (good for dates) and seating is relatively comfy  (bench seats and padded chairs, or bar stools) - and the bathroom has these amazing walls that you just have to see for yourself.   It's a simple bar with a good atmosphere and very friendly service - a place where you can relax with friends in a chill neighborhood environment.  Note:  Cash only.  (At Happy Hour, you can get 6 drinks for $18! Yeah!)", 
    "review_date": "2006-12-28"
  }, 
  "_E3yaczgef7enusOIf7Jug": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne L.", 
    "review_text": "NAY: - The sangria wasn't that great.  It had an overpowering cinnamon taste and smell.   - The bathroom was gross and there is only one (unisex).  10pm on a Friday night and the floor was all wet already.  YAY: - Lychee champagne cocktails", 
    "review_date": "2011-07-11"
  }, 
  "FBqXYyMBNFDJZxvRgaIf1g": {
    "user_rating": 2.0, 
    "user_location": "Austin, TX", 
    "user_name": "Jackie A.", 
    "review_text": "I would like this place if I didn't get a 15 minute lecture from the bartender on how it is rude to try and buy another happy hour drink before you completely finish the one you are drinking.  Especially since that's less time than it takes for him to actually make your drink.  Not because he's particularly slow at making drinks...more like he just wants you to know that he's got much better things to do while he's bartending.   Otherwise, the drinks are good and the atmosphere is pretty nice.", 
    "review_date": "2007-08-24"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Always a good spot for a drink or two.  Grab a seat and enjoy a few cocktails.", 
    "review_date": "2013-07-14"
  }, 
  "W43j7wvFHZ1k40kf5fBgMw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "LeSLiE W.", 
    "review_text": "One star for the cool bar.  One star for the cool table set up and general ambiance.  One star for the decent music.  One star for the various fancy champagne concoctions.  Minus on star for the serious lack of vodka.  Or any other REAL alcohol.  There's only so much champage a girl can drink and beer is absolutely out of the question.", 
    "review_date": "2007-10-13"
  }, 
  "Udet0hipXVPsiqV_f9QfdQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Meredith M.", 
    "review_text": "I love this bar.  It's a block and a half from my house, which makes it super convenient, but really it would be fabulous even if it weren't so close.  The atmosphere is great.  Not too \"cool\" (i feel comfortable no matter how I'm dressed - grubby and dressy alike), but it's got great lighting and decor.  I'm not afraid I'll stick to anything when I sit down like a lot of locals.  The music, while I've noticed it loop more than once, is a great mix of old and new, all of it fun.  The customers are there to have fun and relax.  I've only ever been served by one bartender.  He seems to be a really chill guy who keeps up with any pace.  I feel good leaving him a good tip.  I never drink the sake drinks, but their beer and wine selection is good.    Perfect for a small group or a date.", 
    "review_date": "2006-11-08"
  }, 
  "TMLVzNYs-zwwREudyvI08A": {
    "user_rating": 4.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Matthew R.", 
    "review_text": "This place is really small, but nice. I think it's a great place to start off a night. Plus it's near my 'hood, so bonus points for that.\n  Drinks are really cheap.  Staff was great.\n  I would easily recommend this place to friends.", 
    "review_date": "2006-05-01"
  }, 
  "yaiUTIHJne1jU6D7t_9MDw": {
    "user_rating": 4.0, 
    "user_location": "Riverside, CA", 
    "user_name": "Daniel R.", 
    "review_text": "First off, the place was awesome and there was really only one reason why I gave them 4 stars. The only reason being that they do not accept credit/debit cards. While I don't mind having cash to pay for drinks, I do mind having to pay after each individual drink. I wasn't able to open up a tab ,which would make things a whole lot easier (especially if you're with a group of friends).   That was my only complaint. The atmosphere was perfect, not too dark and not too bright. Music complimented the place and was not overwhelming. The drink selection was on point and Happy Hour prices are hard to beat. Great place to get away from the large crowds in downtown and easy to get to.", 
    "review_date": "2009-04-16"
  }, 
  "rgLKap9rij7gyTDmJC-4zA": {
    "user_rating": 1.0, 
    "user_location": "Washington, DC", 
    "user_name": "brooke S.", 
    "review_text": "sorry to be a total B but this bar does not need to exist.  the bartender was EXTREMELY rude and standoffish....and he was wearing shorts.  bartenders, or servers of any kind, SHOULD NOT WEAR SHORTS.  oh yea - this monstrosity of a bar charges 10$ for SHOJU cocktails.  shoju.  yea.", 
    "review_date": "2009-03-30"
  }, 
  "xxm2VHIJZVO3U55rVmGLWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica W.", 
    "review_text": "i'd give it 5 stars if i was ever able to snag a seat while there.\n  otherwise, the champagne cocktails are fab and the bartenders are always uber-pleasant.", 
    "review_date": "2006-11-08"
  }, 
  "Vgh-CjwAl4tFleP39OdzaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "linda t.", 
    "review_text": "LOVE the champagne drinks :) tasty and not too expensive. Great layout, decent location, and good crowd. Perfect for groups of people - especially for a night out w/ the girls :)", 
    "review_date": "2009-06-23"
  }, 
  "cJhX2s50PLFvy3xx0Hpw3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice N.", 
    "review_text": "Something wonderful happened to me this weekend.  ...The bar was dimly lit, champagne drinks were very tasty and not cloyingly sweet, drunk dude with butt-crack peeking out was thankfully not hairy, the crowd was very friendly.  All in all, a very nice, laid-back atmosphere to catch up with friends and drink the workweek away. Sitting at this intimately-lit bar, talking animatedly about my chaotic week of deciphering financial data at work, my girlfriends were intently listening when I suddenly started to cough.  Out of nowhere, a glass of water magically appears at my elbow.  But alas, it wasn't magic!  It was the bartender, thoughtfully placing the cough-saving glass of water by my side without me asking for it!  Without my girlfriends asking for it!  Without me gasping for air, sliding off the bar stool, hysterically pointing at my red face with the international sign of \"Help me, I'm choking\" kind.   He gave me the glass of water simply because he cared.  What a concept! In my years of happy hour'ing and my years of coughing, I have never once encountered a bartender who gives a glass of water out of the goodness of his heart.  In fact when I ask for a glass of water, I've encountered exasperated bartenders, rolling eyes bartenders, dude I'm busy bartenders, but never once a thoughtful water-giver.   Thanks Joey.  You've given this lady renewed hope.  Thoughtfulness is still alive and kicking.", 
    "review_date": "2007-09-10"
  }, 
  "xOE8QLo0lXFHNaO6DGPKNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K H.", 
    "review_text": "i love this bar.  however, we just threw a private event there and unless your friends are alcoholics, there is no way to meet the minimum they require--because they only serve beer and wine.  it was a great space for our party, but we ended up fronting $500, which sucked.  we had close to 100 people there, and we were still that far from the minimum.  just something to consider if you rent the space out for a private event.  other than that, i love 821.  it's the perfect blend of wine bar and dive.", 
    "review_date": "2011-12-21"
  }, 
  "iwINZwygog3Oaib3uXnJbQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott W.", 
    "review_text": "A nice, small bar and it's usually quiet enough to hear the people you're with.  The staff is great too.  They do have a minimum bar selection.  The sound system sucks though!   My friends and I noticed how terrible it was and the next time I went up to order a drink I intentionally looked around to see what they were using.   Are those overpriced and underperforming Bose speakers I see hanging in the ceiling?   Please get rid of those things and get something decent.   (if you're thinking, \"but I thought Bose was really good\", then you're mistaken)    Those little square things were definitely not designed for a bar.  The sound is super tinny and it sounds like an amplified transistor radio.", 
    "review_date": "2011-06-02"
  }, 
  "WcKhdyAJd3YIRemYr6pAFA": {
    "user_rating": 5.0, 
    "user_location": "Louisville, KY", 
    "user_name": "Bucky K.", 
    "review_text": "Last Friday a friend of ours convinced us to swing by Bar 821 for Happy Hour. The night before we had drank and ate and spent too much, therefore we had promised ourselves a nice quiet Friday night. We arrived at 5:15 and ended up stumbling home at 2:30 in the morning... Our ship crashed upon the rocky shores of intoxication after hearing the Syren song of good cheap drinks. Happy Hour is that good here. Technically it lasts two hours, but during those two hours everything is three dollars. Granted they don't have a full bar but they do have great beers, wine, champagne and soju cocktails.   We drink our way through happy hour and then went  around the corner for some sushi. We eat and drink our way through dinner and evidently we lost track of time because the waitress asked if we would like to finish our bottle of sake at Bar 821. Bar 821 is owned by the same people that own Nihon and Tsunami, where we were eating at the time. For the inconvenience they gave us each a free drink at the bar. Just when I thought I was out, they pulled me back in...  We walked back in to a much more crowded bar, but they had put us at a reserved table with our drinks waiting on us. The sun had dropped during dinner and the bar wasn't near as bright and looked much better. Do you know of any bar that looks better during the day? That's not to say the bar isn't pretty because it is. It is very tastefully decorated. Throughout out the night service was top notch and I am sure we will be coming back in the near future. Hopefully, next time my internal fortitude will be a bit stronger and I will be able to call it a day after Happy Hour ends...", 
    "review_date": "2007-04-23"
  }, 
  "YmTS2FFbScIKrGNywXgkag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Today Y.", 
    "review_text": "Nice small mellow bar, with comfy seats and kinda like a mix between a divey bar made over to a loungey dark cavey den.  I don't think i'd have much reason to go back, unless I was eating at Tsunami again (since they are two almost-next-door siblings of a semi-big family i guess), but it was comfy and the drinks were good and not too pricey.  Hard to choose between 3 or 4 stars.  Parking in the area sucks.", 
    "review_date": "2007-03-25"
  }, 
  "-iixrxnYfVtdFLBL0YMN6w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "D e v a n.", 
    "review_text": "I love champagne cocktails! They make me feel like a classy hooker. If only for a moment. Sigh.", 
    "review_date": "2006-10-21"
  }, 
  "QLqJew7PdZx-tQfF4atGNg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Colleen K.", 
    "review_text": "A big group of us wandered in just after they opened, and we got a warm welcome even though the bartender was still getting everything prepared.   Their cocktails are pretty inexpensive for the city ($8) and delicious. Comfy booths, a larger-than-expected wine list, and just being a fun place to hang out - these round out the list of reasons I'll be back.   That, and it's fun to judge your friends when they order the happy hour special: $5 for a shot of Irish whiskey and a PBR.   Keep in mind, it is cash only. There's an ATM there, and a few up and down the street.", 
    "review_date": "2014-07-19"
  }, 
  "uph2mQG4TnSicYIISZx3Nw": {
    "user_rating": 4.0, 
    "user_location": "Montreal, Canada", 
    "user_name": "Neil G.", 
    "review_text": "A great place for a quiet chat.  Closes early.  Really nice bartenders.  Good sangria if  you're into sangria (I usually don't order sangria at bars because it tends to be terrible-- old wine with some fruit thrown in to mask the vinegar taste, or even if it's made fresh, it's left exposed to air.)  This bar tends to be mostly locals since it's kind of hidden.", 
    "review_date": "2009-12-11"
  }, 
  "3hIvHzTY44pebSHsova_ZQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "L V.", 
    "review_text": "I love their Luxury Mojitos.  A nice place to have drinks with friends and you can talk without having to compete with the sound of loud music.  We will be back....very soon!", 
    "review_date": "2010-04-28"
  }, 
  "W07X0JSIdgwZKex2q1P9QA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Molly R.", 
    "review_text": "I really like this bar, particularly since it's in my boyfriend's neighborhood and almost always has a seat for us or us and our friends.  I am not a hard alcohol gal, so the wine/beer/sake menu is fine for me.  The bartenders are usually friendly and low-key.", 
    "review_date": "2007-09-24"
  }, 
  "shfhrdFn8aGgFP8dyXNyxg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eater S.", 
    "review_text": "WTF? 4 stars? Bullshit. This place sucks. Where to start? Since it's a bar, maybe I'll start at the drinks. Drink options totally suck. Beer or wine. That's about it. Very limited, and all the choices suck. I got a pathetic beer that was so bad I could not even finish it. The server was a total bitch. Completely cold and careless and hostile and rude. Ignored me for a long time then rudely took my order and threw the beer on the bar. The foam went over the top for a while, leaving me with a sticky filthy glass covered with beer in a puddle of beer. Very nice. Music sucked and was way too loud. Stupid flat screen TV on the wall. Why the fuck would someone want to go to a bar to watch a screen that they can't hear? It's stupid. Get rid of it. There's enough bloody TV all over the place these days. And, on a freezing cold pre-winter night, they left the front and back doors open, so one had to totally freeze and could not try to enjoy being there. Incredibly loud. Could not hear my companion and she could not hear me. Oh, I could go on. But you get the idea. Went over to \"mini bar\" afterwards and what a relief it was to be there after this hell hole.", 
    "review_date": "2009-11-08"
  }, 
  "JzmJ6U20uJ9pZonwKGvMuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua W.", 
    "review_text": "Stopped by here for a nightcap after dinner at Nopa tonight and this place is WAY better than it once was.  The new bartender, Juan, is really friendly and on top of his game when it comes to pouring drinks.  On top if this, his music selection was WAY better than the typical whiny indie crap that I remember playing here.  It wasn't crowded at all, and if this place wasn't required to close at 11 I'd probably give them 5 stars.  MUCH needed improvement here.", 
    "review_date": "2009-01-04"
  }, 
  "D8JswSWcY-fznIm05Y3WZA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marlon R.", 
    "review_text": "Happy Hour ends at 6pm. :( It starts at 4pm but peeps are just making it back from work by 530ish. It was empty and probably for that reason.", 
    "review_date": "2012-08-02"
  }, 
  "uqOizjedeV43lEiwJa5RNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah G.", 
    "review_text": "How I feel about 821....  - I'm new to the hood and Bar 821 has quickly become our go-to for an unpretentious drink.  - I feel like I could show up in a hoodie or a dress and fit right in.  - They only have beer and Soju, but the upside to that is that the prices are very affordable and they put effort into crafting some cool cocktails.  - They have a killer $3 happy hour from 3 - 6 (every day I think).  -  friendly bartenders - cool modern but casual decor -  I've heard you can bring in take out (Little Start is down the street)  Try the \"signature spicy\" cocktail that's no longer on the menu. It's made with infused Habanero Soju.", 
    "review_date": "2009-08-24"
  }, 
  "YlJNqoHqIssCHP25h2sUFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie N.", 
    "review_text": "I'm slightly ashamed to admit that last night was my first night in Bar 821...the closest bar to my flat, and I'd not been there until last night.  Shameful.  But, I did finally go and really enjoyed it!  Granted, it was for a neighborhood networking event, so hard to get a pulse on what the crowd would be like, but it's cool and they make some interesting drinks!  What I like most about this place is that it seems unpretentious....and not overly hipster like some other bars in the hood.  Just a local neighborhood bar with a cozy atmosphere and friendly people.  If I were a regular drinker, I'd definitely want this to be my 'local'.  Since I'm not, I probably wont come here on a regular basis, but will definitely be back!   Awesome happy hour specials ($3 drinks until 7pm!)", 
    "review_date": "2008-02-13"
  }, 
  "HRDpNT45XvG5rEAwI3Jnhg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Perry S.", 
    "review_text": "This is a very cute and cozy bar. I could see myself as a regular patron. Well, what bar that I can't see myself as a regular patron anyway? The only disappointment I have, this bar reminds me of my friend's 60 year old grandpa that needs to get tucked in bed by 11pm. Such a clit tease. I meant, the bar.   Anyway, I came so close to last call, I only ended up getting a beer. Next time, I will arrange my time better and be one of those early birds. I would totally look like an alcoholic. Wait, oh nevermind.", 
    "review_date": "2008-02-14"
  }, 
  "X68ZVYForqAFTfe5H3d-tw": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Robin B.", 
    "review_text": "Nice place, cool booth seats, dark but clean, good music, sports on the TV, my all-around favorite neighborhood bar! Actually it's nearly the only bar I even go to in this god-forsaken city anymore. They have a bunch of foo-foo girly champagne drinks and a wide selection of beers for the guy. Great Mojitos, and soju drinks. My favorite is the Valentine, champagne with a stawbery and chocolate piece. The chocolate and strawberry add a delicious touchto the flavor of the pagne. A fun place to relax after work, start out a night on the town, or even just come for some quiet evening romantic conversation. No one here gets rowdy (prolly cause it's beer and wine only), nobody is rude, no one is flagrantly doing coke in the restroom, the bartenders are nice, the people are cool, and it's got the greatest happy hour menu ever. What is there not to like about this place? NOTHING. It's f!@#ing perfect. Thanks guys!", 
    "review_date": "2006-09-21"
  }, 
  "7mzACXQ5F4EduE9jF_tI-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hailey P.", 
    "review_text": "Such a Fan!  I chose Bar 821 for my Birthday Party this year. I contacted the staff ahead of time to reserve tables and they were so nice. We arrived early and didn't even need to have the tables reserved because the bar was fairly empty.   The bartender (I am sad to admit I forget his name) was incredible. He mixed some amazing champagne cocktails... YES.. this was my favorite part. The Champagne cocktails.. and wonderful bottles of wine.. all moderately priced.  The seating is great, I had about 20 friends and we dominated the place, it was so much fun. Everyone else there seemed to enjoy our energy and we felt welcome. I am so incredibly happy I chose Bar 821 for my birthday location, it was a great celebration!  It is a wonderful location, great neighborhood bar, I hope all the wonderful reviews do not cause it to lose its luster! SHINE ON", 
    "review_date": "2009-03-03"
  }, 
  "RI3E4gJyPzeYZOu6MOj0HA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacob and Brianne H.", 
    "review_text": "For someone like me who finds joy in comparing beer fluid ounces per dollar spent, this is a great find with a good atmosphere.  They have a 5-7pm happy hour every day with a selection of 20 oz. beers (not like the average bar which gives you a \"pint\" of 12 oz.) and mixed soju drinks for only $3! And the selection ranges beyond normal imports and domestics. The atmosphere was lounge-y and a great place to go on Sunday because it was not crowded, but still vibrant. Overall, had a fun and relaxing experience.   Next time: will try a weeknight happy hour and the luxury mojito.", 
    "review_date": "2008-11-05"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "Yummy cocktails, Yummy bartender and regulars, and Yummy Yelpers??? Get out the crayons and color me Tickled Pink!  Those soju bombs were out of this world and somehow matt r and I didn't find ourselves roaming the streets of SF at 5 a.m. after this soju experience!  Nice job, Bar 821!  Call me Bubbles, I LOVE sparkling wine! The champagne cocktails at Bar 821 can't be beat and they're cheap cheap cheap too! The Ginger Sparkler is now my very favorite champagne cocktail ever. With so much AWESOME going on within these walls, you can bet I'll be showing my face around these here parts a hell of a lot more often now. JAMES (Thanks, G!)  the bartender is adorable and super friendly and like I said, there are some pretty hot hotty regulars, too.   Little Star is right across the street and I hear they'll let you bring in food from outside so you can get your drink AND your eat on. The inside is cute and neighborhood-bar-ish. Nice bathroom with cool mirrors. If you live in the neighborhood, I highly recommend!", 
    "review_date": "2007-06-26"
  }, 
  "6S-WD1XBht_HBSL5_eSR_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tak H.", 
    "review_text": "After looking for a happy hour bar around work and seeing rave reviews for Bar 821, I had it on my radar for sometime.   I made plans to meet up with a mate to see a show at the Independent at 9pm. I had separate dinner plans so I arrived at 9:10 a little tipsy after copious amounts of sake at Warakabune only to find out my lazy ass mate is still at home waiting on his harem of mingers to gather and feed him grapes.   So I wait. and wait..... 45 mins go by and the novelty of the $5 Polaroid dude wears off and no other eccentrics are around to keep me occupied. So I decide on a course of action: drinks.  So the choices at hand were Madrone, Fly bar, coffeeshop, or Bar821. And i chose wisely. The little dark chic wine bar with only a fledgling little skimp of a sign to signify its existence was A find.   The staff there were the friendliest in the city. None of that grunting that bar staff all round the city seem to communicate with but sincere, friendly service.  Going to a bar alone can be intimidating however, Bar 821 was very accommodating and made the experience very amicable.  I sipped my cab and left  to meet up with my friend. Upon leaving the bar I realized that I wasn't pissed at my friend for being an hour late but i was glad that a bar could still be cool and sexy and not fore sake the very virtue that keeps people coming back, a space to socialize without judgment.  Kudos to you, Bar 821 for keeping it real and....for having a tattoo parlor right  next door. hm  I'll leave you with Blink 182, Bar 821.  All the, small things  True care, truth brings  I'll take, one lift  Your ride, best trip  Cheers", 
    "review_date": "2007-04-15"
  }, 
  "_N7Ndn29bpll_961oPeEfw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew D.", 
    "review_text": "A small, well decorated bar with lots of seating and moderately priced drinks ($7/cocktail). I liked the vibe. It's a cool place, no doubt.  But on a Thursday night, there was only one bartender and it must have been over 10 minutes before we got our drinks. I ordered two drinks and she said it'd be a minute. 10+ minutes later and comes back to me and looks to me as if I haven't ordered before. I said I already ordered and she continues to give me a blank stare, kind of like a \"what do you want\" look. I repeated myself and she finally made it.  She seemed to consistently take in at least a few orders at a time before she fulfilled them, which is probably why she forgot. I saw others wait a long time, too.   There really needs to be another bartender.", 
    "review_date": "2013-08-16"
  }, 
  "rhKNBCQcN9K1tyb3GJ38IA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Honest T.", 
    "review_text": "This bar makes me sad. It had such a wonderful past life that it's hard to see it neglected the way it has been. I am not saying it needs to be revamped with \"reclaimed\" wood or whatever current design cue is in, but it needs owners that actually give a shit. It could be such a cozy, warm, neighborhood bar if the right people were involved. Oh, wait once upon a time it was ;) The only thing standing in it's way (much like Wazima) is the owners. Sell the place and move on to another Whiskey/cigar bar, fellas! There are those of us who still love this place.", 
    "review_date": "2012-02-15"
  }, 
  "iuksdLDzaWBbFLf0acnR4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trisha W.", 
    "review_text": "Bar 821 walks the delicate line between bar you could take a date to and bar you could send your snowboarding buddies to -- the former will like the candlelight and the old black and white movies on the flatscreen TV, the latter will like the Avalanches on the ipod stereo, the 22 oz of Anchor Beer, and the lack of pretension despite its attractive decor. Or switch that around, depending on who you bed/board with.  The bartenders are friendly, funny, and ultimately solid; the beers are well-picked; the crowd is a nice mix of locals and folks going to shows at the Independent. If I could change just one thing it would be their doors-at-11 policy, but on nights when I'm not leaving a show down the street, I'm glad to be in the bar and not get the post-concert rush.", 
    "review_date": "2006-12-07"
  }, 
  "oA4ompknoW6XrONKYXQ_jQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel G.", 
    "review_text": "You know you're someone when members of the Yelp Illuminati like Peter Mmmmm., JT F., Heidi A., Bucky K., Darin I., Lauren S., Mick F., Jenniflynn R., Quinn S., and even the much mourned and beloved Chewie G. show up to your birthday party.  So Sassy S. you should feel like you've made it.  You're somebody.  Me, well, I'm nobody.  Since it was your birthday party, and not my birthday party, and no one showed up to my birthday party, and I sat alone in a corner with a party hat on and a sash that said \"Birthday Girl\" and ate 3/4's of a German Chocolate Cake with my hands.  But that's a whole other review.  Of cake.  5 stars.  Bar 821 is small and dark and loud.  They let you bring in your own pizza and porn (Sounds like a typical Friday night for you, huh?  Stay classy.), which anyway you spin it sounds like one hell of a party.  Happy Hour until 7 gets the birthday girl drunk enough to start telling people what they are doing wrong in their life and talking about how she is a prude, and at the same time lets Rachel G. not feel TOO bad about sending her home with JT and Peter and a bag of porn and chocolate.  I haven't heard from her yet.    Should I be concerned?", 
    "review_date": "2007-11-15"
  }, 
  "VbE1LgUcOPxkeWZ8eS6OVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terese T.", 
    "review_text": "What a cute place!  My man and I went on a Friday night at around 9:30, there was a good handful of people but it was not overly crowded, it was perfect. The drink menu was good, I think it could be better they also have a nice wine list that I hope to check out next time.  A nice place to check out!", 
    "review_date": "2010-09-14"
  }, 
  "gtOvKs1uu45JovYulLXpDA": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mordicai C.", 
    "review_text": "Nice decor, fun sort of pricey mixed drinks, but probably too popular for its own good; lots of crowds &amp; that means waiting, noise &amp; jostling elbows to get by.", 
    "review_date": "2013-09-07"
  }, 
  "pE357a90Xg73S0rjE6qiIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danny D.", 
    "review_text": "Bar 821 is very simple. Beer and Wine, nuff said. 821 is very dim which sets the mood. I gave this place only 4 stars because they close so damn early. Fucking ELEVEN! Overall, it is a great place to hang out and talk nonsense with your buddies. See you there!", 
    "review_date": "2008-02-14"
  }, 
  "nq6t85S6Obxbbe2syWPRgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mac M.", 
    "review_text": "Fuckin L-O-V-E this place. So cool, so smooth, so seductive...just like the drinks they make. Yep, the secret is out all of you \"Nopa\" residents, so get used to seeing some (gasp!) Marina folks like me. Don't worry...we only bite when you ask.", 
    "review_date": "2006-10-20"
  }, 
  "qUg4PXAT42bxV48CqPaUwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnny C.", 
    "review_text": "3 words: Chimay on tap. Yeah it's not a bar bar; it's not a hotel bar; it's not a pick-up bar; not a \"every kind of beer imaginable\" bar; not a faux punker (funker) bar; not an Oxygen bar; not a lounge bar; not the American Bar Association. It's a little, dank, neighborhood bar that's forced to close at 11pm. Good place to meet a friend. They can't screw up the address..that's for sure. Be warned, you might need to bring your xray vision or a flashlight, I couldn't see squat in this bat cave.\n  3 duckets for being a neighborhood bar, 1 ducket for \"Mr. Manchester\" who tends to the clientele with chipper spirits and salutations.  \"Cheers Mate!\"", 
    "review_date": "2006-05-03"
  }, 
  "2--3--v8yHU3a3FljCcBRg": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "William S.", 
    "review_text": "Came here last week and to my dismay i found out they no longer have the 22 oz huge beers at happy hour but rather a lowly pint.. I still love this bar though and they have the chillest bartenders in the city i'm sure of it...  A part of me died that day though.", 
    "review_date": "2009-10-27"
  }, 
  "kJgvtgPwhH-JDs0IAoGhyw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kailyn G.", 
    "review_text": "Came for drinks on a Saturday night. Be aware they don't serve hard liquor and the beer list is not extensive.  Started with a ginger soju drink (disappointingly not gingery enough). Tried their lychee champagne drink (delicious). And beer-wise they have some belgians which I like. Ended up getting a pitcher of sangria (really good, very strong cinnamon). Perfect to split between 2-3 people. All drinks were around $6-8.  My biggest complaint is that they had last call way early (like 11:30pm on a Saturday). And they cleared the alcohol off our table just after midnight (some sort of rule). This was very disappointing.  Environment: Small, dark, not terribly inviting. Seating at the bar or small tables with chairs and a booth bench. Service: Order at the bar, sit anywhere. I think there was only one girl working when we went.", 
    "review_date": "2011-07-31"
  }, 
  "Wacbg2qzNVtEaU7XXFasWg": {
    "user_rating": 5.0, 
    "user_location": "Garden Valley, CA", 
    "user_name": "Daniel G.", 
    "review_text": "Awesome local neighborhood type bar, hot bartendress.  Cash only though, so leave the credit card at home...make sure you tip well!", 
    "review_date": "2010-12-31"
  }, 
  "ZUuLUY5YpAVWFMXObuxndA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B.dot P.", 
    "review_text": "Super dark &amp; romantic. Specialized glassware &amp; the appropriate beers. Champagne cocktails! It's like a secret spot for smooching a sweety! (I can't stop alliterating today).  I like drinking", 
    "review_date": "2006-11-01"
  }, 
  "VDYSOtauXSk9pt2AgnEKCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "A nice little hidden oasis of cheap happy hour drinks.  It's only open till 11, but for some reason this fact seems only to enhance the integrity of this alamo square bar.  The sign says to keep it a secret, but I think the secret's out.  By the way, the Guiness Bubbly is pretty good.", 
    "review_date": "2005-08-11"
  }, 
  "9GCCoFw_UHiAHjZ4kygHgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren V.", 
    "review_text": "I used to live in this neighborhood and never made it in here.Fast forward a few years later a friend and I hit it up after our dinner at NOPA.   Funny story if you refer to my Hobsons CHoice review,I mention a hot bartender I hope doesn't die when I blow up Hobsons Choice .WELL luckily he won't because now he works at Bar 821! Hi Hot Bartender(joey?).  Enough internet flirting.This place is cool.Its dark and candlelit and nice to sit and talk at. I'd give it five stars if it wasn't just wine and beer and sake because none of those things are really my main jam.BOO", 
    "review_date": "2008-06-05"
  }, 
  "hpe_1n2b6qYXO8sM8ywKNg": {
    "user_rating": 5.0, 
    "user_location": "Durham, NC", 
    "user_name": "Cameo E.", 
    "review_text": "perfect little loungey place. we need more like it in SF. and the lack of liquor keeps the crazies from coming out. wine, sake, beer and champagne. good enough for me.", 
    "review_date": "2006-01-18"
  }, 
  "ZZJ-NpEeAw-01OLF_WCfWg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lee M.", 
    "review_text": "Rudest bartenders on Divis.", 
    "review_date": "2007-10-24"
  }, 
  "bG6DkJKwhKMMQ0Z3GSOpmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete J.", 
    "review_text": "It's amazing to me how this place maintains an air of modesty about it, considering that my assumptions run wild every time I walk past &amp; see a bunch of drunk folks in well-planned &amp; expensive-looking outfits standing around outside having a smoke (inevitably one of the guys will have a tattoo sleeve &amp; look like a pro-skater out burning his paycheck).   But when you walk in, it feels like you opened the closet underneath the stairs of your parents house as a kid &amp; discovered there was an honest-to-God cocktail party in there. The bartenders are fast &amp; very friendly, the space is cozy but not cramped, &amp; the dark lighting lets you feel like conversational intimacy is a reasonable concept.  A perfect place to stop in after a nice meal at NOPA or Little Star. And despite my occasional commentary on said two establishments' efforts to fancypants-up the neighborhood (I've got mixed feelings about it), that isn't any kind of statement against Bar 821.", 
    "review_date": "2007-05-01"
  }, 
  "utxSsaqcs3hjTJwk5jZ0vQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica M.", 
    "review_text": "freakin awesome!  the bartender, grateful that i stayed even though i had to use the ATM, gave me a free hot sake with ginger. delicious. i liked the ambiance, dark and romantic. the music was pleasant too: mellow but with lots of variety, not too noisy or intrusive. i am going to find excuses keep taking my friends to this place. also great happy hour: $3 drafts", 
    "review_date": "2009-04-03"
  }, 
  "sVu7dQ_isyUr1toSBBrBFg": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Leigh M.", 
    "review_text": "Great date place! Inexpensive and delicious champagne cocktails! (My favorite is the Lychee Mermaid; and if you want a manly champagne cocktail, there's always the one with Guinness in it.) Very sleek and cozy (although the flat screen TV is an odd touch). It can feel pretty couplely sometimes, and it's definitely not the place to go if you're looking to pick someone up. But that's part of the charm.", 
    "review_date": "2006-07-08"
  }, 
  "daEKn0SlW3j3-8zAXx3xBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer s.", 
    "review_text": "I have been stopping by here for happy hour for awhile. Since I have so many friends in alamo square, this is generally where we meet. Soju cockails are delicious and they have Guiness. However, not excited about their wine list but hey I am just a wine snob.", 
    "review_date": "2007-04-18"
  }, 
  "Q8TGsARjdIfWsnXqgQYHhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "Another Cash-Only bar, 821 I would rate just a tad above Madrone because it's MORE chill when it's not busy.  Drinks are good and cheap and they bring dog-friendly to a new level by stocking Milk Bones for your companion.    Bartenders are extremely friendly and even offered free drinks in trade for our group's dog which says a lot about the atmosphere.  I definitely recommend 821 and hell it's pretty close to a lot of good eats.  Again though, CASH ONLY so bring your greenbacks.", 
    "review_date": "2014-10-11"
  }, 
  "q4yMVuGp1JZW1n2eSleEvw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi P.", 
    "review_text": "Not a lot there, but it's mostly good.  The happy hour deal is great, they mostly have belgian beers, but only like 8 beers total.  They have a lot of champagne.  It's one of the happy hour specials. Some of their cocktails are good but some are absolutely foul.  Dark and quiet,  so it could be a good alternative if you're not in the mood for the energy of Fly, across the street.  Right by Little Star Pizza which, I know from experience, can be a good combination.", 
    "review_date": "2006-09-29"
  }, 
  "_TTGlEA0SxD_f-t8LHCn1w": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Neil S.", 
    "review_text": "I love this bar. We'll come all the way from Bernal Heights just for a couple of drinks here, because it's relaxed, easy to find somewhere to sit, serves BIG beers and shows Spinal Tap on the flat-screen. The fact they close early seems to deter a lot of hipsters and yuppies which makes it all the more appealing. If I want to drink after 821 closes there are plenty of other options. Up until they close however, I'm staying right there.", 
    "review_date": "2007-12-08"
  }, 
  "OUDaJuPhq5dHi6XRPAGTCg": {
    "user_rating": 3.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Johnny H.", 
    "review_text": "I don't really \"get\" this place.  Nice atmosphere, friendly bartenders, but what's up with shutting down at 11:30 on a Friday night?  And what's up with leaving the door propped open so it's freezing inside?  And what's up with all the hipsters who look like they just invaded from The Mission.  And why limited to beer, wine, and champagne?  I gotta crawl over people at Minibar for a J&amp;C?  Yes, Bar 821 leaves me with some questions I may never discover the answer to - perhaps I'll check it out more than twice and discover the answers, all in good time.", 
    "review_date": "2011-01-05"
  }, 
  "xZEjb4tMaUYDgdDWv9BpHA": {
    "user_rating": 1.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Hammed K.", 
    "review_text": "BEWARE!  As a visit time visitor and neighbor in the area I always wanted to try this bar. Unfortunately I had to pay a few extra dollars for drinks because of the bartenders greed. I didn't notice when ordering but I was charged $3 dollars more a drink then what was posted on there menu.  If you need to make rent this month you should of asked. I have a bad taste in my mouth and will never return to this bar.   Your drinks sucked too.", 
    "review_date": "2013-09-28"
  }, 
  "m3f1x02-81PfN-3LnIzOlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yuchi C.", 
    "review_text": "Really nice atmosphere. Came here early Friday night, not crowded at all, so it's chill and comfortable.", 
    "review_date": "2008-11-28"
  }, 
  "sDgHchArSE4xSqzdw4qk7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mayuma S.", 
    "review_text": "i love this small cozy bar. good price for nice drinks and you can bring your food (but mention it to bartnder ) and your dog :) all kind of people feel comfortable hanging out here-i see hip star, nerds, true neigbors, dogs, youngs and bringing your grand parents. All have a good time. weekend might be little dirfferent but weekdays and sunday is very chill.", 
    "review_date": "2014-01-11"
  }, 
  "U2fLiI5giMdiUy07yXLSCQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dar D.", 
    "review_text": "I was a little resistant to this place at first. Maybe it's because they don't have hard liquor. Maybe it's because I find the early closing time inconvenient on occasion. Maybe it's because my roommates like to tell a story about how one of the bartenders was a total d-bag to them (at this point I only partially believe this story because both of the bartenders are incredibly friendly/think my roommates might have deserved their tongue-lashing).   As a place to grab a quick drink in the evening,  Bar 821 cannot be beat. If you make it for happy hour, the prices are amazing. If I were a total alcoholic, I would absolutely make a point of getting back to the neighborhood at 5:00, parking myself on a stool at 821 and taking full advantage of the $3 drinks.  I've never seen Bar 821 crowded, making it an absolutely perfect place to unwind and chat with a couple friends at the end of the day. Definitely not a place for a wild night out.  P.S. Luxury mojito (I was skeptical, but it is quite tasty)", 
    "review_date": "2007-02-12"
  }, 
  "GSprTV5_6wQL-efARSotfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CC L.", 
    "review_text": "I love this place because (1) it's totally chill, and (2) I like their champagne cocktails.  It's a great place to hang out and catch up with friends.  It may be crowded, but it never gets too crazy.  One big exception:  Art Walk.  (Should be re-named ArtDrunk, but that's another review waiting to happen...)  One thing I'm not keen on is that you can't run a tab.  Oh well.  I'll deal.", 
    "review_date": "2010-06-29"
  }, 
  "o5o1erYXglEJNYm19WYWpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C'est La V.", 
    "review_text": "F the naysayers. This place is what it is... a great place to meet a friend and grab a $3 sake-jito before grabbing dinner around the neighborhood. It's a place where you can talk (and hear each other), where the bartender is friendly, where the lights are dim and where people who don't like it -- shouldn't go.", 
    "review_date": "2006-10-10"
  }, 
  "718BqSoKm6D2qUY1D96_3A": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "D'arcy N.", 
    "review_text": "I suddenly realized that I was stuck on 821 because of its (old) bartenders. And, admittedly, the fact that it's close to home.  It's all different now. I've lost my love for it. Where are all my good bartenders? Where is the good neighborhood service? What happened to Joey?", 
    "review_date": "2010-01-17"
  }, 
  "jTsq-BEiE6KDL72aW0s-Dw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J J.", 
    "review_text": "Just the spot after work.  Closes at 11 on weekdays so expect to move on.  Service is great, just wait your turn.  For anyone who says that they are \"neighbors\" but don't recognize anyone, I just want to ask you where you hang out.  This place is like my living room, and I can see many of my neighbors whenever I go in.  Sometimes a bit too loud, but it is a bar.  Also, for those who complain about the hours, remember that it is a residential area, and the roof of 821 is the floor of an apartment. Respect given to the business owners for recognizing this and respecting the tenants by having shorter hours.", 
    "review_date": "2008-06-13"
  }, 
  "OmvCi63S4nNq-glUfoaUpw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy F.", 
    "review_text": "Summary:  A fancy local hang-out  Drink:  Very tasty Bartender:  Friendly with an accent Clientele:  Locals with a smattering of couples on dates Music:  Old-school hip-hip...nice Decor:  Couldn't say, place was very poorly lit", 
    "review_date": "2007-05-08"
  }, 
  "q5WfXHXIyYs8HdGGJzzPGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "bree s.", 
    "review_text": "This is a great place to sit and have casual drinks and catch up with friends.  The bartender is so friendly, he truly is what makes this place!  I would definitely go back!", 
    "review_date": "2009-01-23"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "The drinkers of Divisadero and Lower Haight need to get together and protest or something. I mean, this city has protests about everything every other week. We don't like cars so we fuck up the last Friday of the month for every single person who works downtown and just wants to go home and clean up and go out with their friends by not allowing them to get home, even when they are taking public transportation. We don't like plastic bags so we have now outlawed those. We don't like the war and at least once a week we make that known with some protest. That is cool, I am all for getting out on a Friday at 10pm, carrying my 40 in a brown paper bag (as it should be) and lets face it, a war would really put a damper on my Friday plans. So, if we can take the time to speak up about these things why cant we let the people of these neighborhoods know that we want a few more bars that serve hard alcohol!! I mean, I am unsure that serving beer and wine is going to save us from anyone who wants to be drunk and unruly. Newsflash, they can still get drunk and unruly on beer, I swear, and if the liquor store on the corner carries Jack you are not keeping it from them prohibition style or anything. You can serve alcohol in a lower proof form in a bar, out of anything you want, to people on bikes who hate war, but if they drink and want to get drunk they will!!! Can we please have some bars that afford us the luxury of doing this on our own terms!!??  Bar 821, its not your fault. You work with that permit well. You have a good selection of wines by the glass and bottle, and tasty beers and sparkly and soju all at very fair prices for a wine bar. You do your best to provide a nice selection of alcohol \"lite\" in a dark, loungy, inviting way, but damnit, sometimes I just want a sapphire and tonic. However, when I do have a hankering for some wine while in your neck of the woods you are my first choice.  Anyone up for a protest, or at least a glass of wine?", 
    "review_date": "2007-06-26"
  }, 
  "FAR9oqtwSXIGuBkBGjE00A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lillian P.", 
    "review_text": "yea. im drunk. and its because of this place. but you know what? im not mad. this place is great. they got me real drunk for real cheap and its not even 9 yet. yea you should go here. and i dont know what else to say, but i'll write more when im sober. omg i walked so much. ok im drunk im going to sleep.  ok im editing. because i'm still drunk. and its not 9 and i'm not asleep. i walked into this place and thought pshhhhhh soju!? i'm korean biyatch. i can drink that shit. but i should have listened to the bartender. he was right. there is no such thing as JUST a mojito. omg i'm totally going to delete this in the morning.   :: edit ::  ok so it's 3:37 am and i swear i'm sober now. reading what i wrote before makes me think i'm not that bad of a drunk, but then i realized why am i writing a review drunk before i pass out at 9pm?   anyways, so their happy hour rocks. but those drinks are sneaky. you think that they're \"weak sauce\" bc theres no hard liquor except soju but they mix them so well that you unknowingly inhale the drink. I think things started going downhill for me when i ordered the \"Valentine\" simply because I wanted chocolate and it has a piece of chocolate in it. so there i was trying to get the piece of chocolate that was going UP AND DOWN AND UP AND DOWN AND UP AND DOWN in the champagne. I finally got it but that was after chugging the champagne and swallowing the raspberry whole. but the moral of the story is, i got the chocolate.  i dont know what to say about the clientele, i was too wrapped up in my best friends who were visiting, but they were all friendly. i think.  the place is very clean and nice and the bathroom is fine as well. i remember wishing htey had more than just one unisex bathroom though.  so it's 7 o'clock and i realize that i'm drunk and that i can only maintain my facade of tipsiness for so long before I start acting a fool so i whisper to my friend \"jo, i need to get out of here i think everyone is noticing the little drunk asian girl in the corner\" and she laughs at me and orders another drink. and i said cool. so finally we decide to leave and as we stumble outside we are blinded by the sunlight and all the way home we just kept wondering how we got so drunk so early and I was about to explain to them the process by which alcohol enters our digestive system and then to the blood stream and in the process reveal the cure for cancer, but i thought that it'd be better to just suggest gettin a burrito on the way.    all in all we had an awesome time, nextime maybe i will pace myself better so i can make it past happy hour.", 
    "review_date": "2007-05-16"
  }, 
  "fsF9MQEyFZJmNY6EEwvJDg": {
    "user_rating": 4.0, 
    "user_location": "Louisville, KY", 
    "user_name": "A K.", 
    "review_text": "Tried their Sangria: a heaven.   It was pretty busy Friday night, but the awesome bartender was running the bar all by herself so effortlessly.  Reminded me of my life as a barista where I used to run the entire coffee shop all by myself.  It was dark days : /  So kudos to the bartender.   They have mojitos made with Soju! This Korean MUST go back and try it!   Dark and loud enough to do &amp; speak raunchy stuff ;-)", 
    "review_date": "2009-11-29"
  }, 
  "jkiinjUy8RUZKzW5gBpXNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Quinn S.", 
    "review_text": "Five stars for decor, atmosphere, service and patrons.    Tragically, no bar can earn five stars without hard alcohol.", 
    "review_date": "2008-07-29"
  }, 
  "QcPN-Dee_dU2IWno-f2oYA": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Lindsay T.", 
    "review_text": "As far as wine bars go, its just okay.  not worth coming to the neighborhood just for this place.", 
    "review_date": "2008-05-21"
  }, 
  "KNxH292MIR201pFpxO3KJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brye L.", 
    "review_text": "I had never heard about this place until this evening.  It's down the street from a friends house.  I loved this little space....comfy benches and tasty champagne cocktails.  I even felt comfortable here after my girlfriend was so kind as to tell me that I looked like a mountain girl...oh no.....time to spend more than 5 minutes to dress comfy before leaving the house.", 
    "review_date": "2007-12-21"
  }, 
  "hFvLaKDNHMxHze13Hd-FZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misha F.", 
    "review_text": "I really don't know what to say about this place.  Usually, I am sitting there--with a friend, date, family, etc--quietly forming my yelp review in my mind, thinking of the good, the bad, the ugly...but, I just don't know what to say....  Basically, there is nothing that super stuck out to me about this place...kinda un-memorable. The main thing that I did remember: THE BLARING/OVERLY LOUD REGGAE MUSIC.  Other than that...I liked that that bartender (who wore awesome jeans) came out from behind the bar to take our order at the table, the sangria was quite inexpensive ($4), and the bathroom was modern. There were two tvs going...one with the football game, and one with some black and white movie. Not the best lighting if you are one a first date with some dude from the Internet, because it's hard to see. But it's not intimate and quiet enough for a romantical date either.", 
    "review_date": "2010-01-08"
  }, 
  "W35eV_BkLI4qC0mmwJ6QWw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Stephen D.", 
    "review_text": "I guess I didn't pay enough attention when reading the reviews here - Bar 821 doesn't do spirits.  When people say \"cocktails\" they mean sake, shochu, and champagne.  They make some pretty tasty things with them (the Soy Lovely, e.g.), but it just isn't the same.  Also, the sangria was disappointingly bland.  It was crazy packed and noisy as hell last night, but we later realized that was because of Art Walk and so maybe isn't the normal scene.  Oh, and despite being totally packed, they closed up and kicked everyone out at 11pm.  :-/", 
    "review_date": "2010-06-04"
  }, 
  "TgWzmmndaT3Py9FQOmwEHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimmy L.", 
    "review_text": "It's around the corner from home, it has good mellow early evening drinking atmosphere, it has a great happy hour, always interesting flicks on the big screen, Joey will play \"Goodbye Horses\" by Q Lazarus at any time and its a really friendly neighborhoody vibe.   If you get hungry, order Little Star to go and bring over to eat.  Or if you get drunk enough, get a tattoo next door.", 
    "review_date": "2007-08-02"
  }, 
  "LgkVZYL8DQyJsvR8Kz1PlA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Chanti B.", 
    "review_text": "I love drinking, but I hate hard alcohol. Yes, yes, I graduated from UCSB, so this was a big problem for most of my hard party nights, but I still managed to out-beer most of my peers. Heh. What I'm trying to say is that I love wine and beer bars. In fact, if prohibition struck twice, but they only outlawed vodka and it's brethren, I'd be fine with it.   Now that we've gotten that out of they way, and only one person is left reading my review (Hi Mom!), we can get into the greatness that is Bar 821.   I went to Bar 821 on my birthday before a concert at The Independent. I had been craving a good pitcher of sangria, and what do ya know? I found one here. The sangria was awesome, it had a hint of what could only be described as \"christmas spirit\" (cinnamon), and was the perfect color. Sangria should not look like hot cheetos, guys.   Sufficiently buzzed, I continued to order off Bar 821's awesomely afforable menu ($3.50 -$7.00). Champagne cocktails are my new best friend. Try them all, but definitely try the one with fresh lemon juice (the name escapes me, but I got her number).   Here's what I do: -Sangria -Champagne cocktails -It's my birthday, I can have one more.", 
    "review_date": "2010-10-16"
  }, 
  "4k9-LoufKfGflVzQfmkrdw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevieve M.", 
    "review_text": "Maybe there's a legitimate reason for this, but last night the bartender at 821 was completely rude- telling me and the two males I was with as soon as we walked in the door at 10:30pm that \"they were done\", and that we \"had to leave\", when there were at least 15 other people inside the joint sitting at the bar and at tables with full drinks. Everyone turned and gave us prejudging death stares.  He could have been polite about it.  If he had been nice and explained to us why, I wouldn't be so bitter.  It was the way he talked down to us that left a bad taste in my mouth.  I felt like he judged us when we walked in, deemed us to be not hipster enough and told us to leave without giving us any sort of reason.  Although they probably assumed we weren't locals, I live four blocks away (in SF since day one), and I'll never be back.  First and last time.", 
    "review_date": "2008-08-04"
  }, 
  "cQmsm7a65uGPCfm1Jdc3lQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth H.", 
    "review_text": "You know those complicated drinks that involve dropping shots of whatever into half filled pints of beer? Well I could SWEAR that the bartender was making these complicated drinks with half filled pints of champagne. The fact that the tattoo guy from the tattoo place next door was the one drinking them just added to the ambience because seriously...any place where badasses shoot champagne is MY KIND OF PLACE. Badasses shooting champagne for only $3 is just icing on the cake.", 
    "review_date": "2007-03-03"
  }, 
  "eBnToKDLoXxQvpwY6s5UdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joy Y.", 
    "review_text": "champagne..the key to any girls heart...or rather this girl's heart....automatic 4 stars...  their ginger champagne cocktail and the valentine (?) were excellent...", 
    "review_date": "2006-07-20"
  }, 
  "zGOXKICJ-X6tcoIHaGaITg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kia B.", 
    "review_text": "OOh, I like this place. I like the cozy, laid back seating. I like the layout of the bar. I like the inventive champagne cocktails and wine selection. This is a great date spot.  You can converse without yelling at  each other and flirt shamelessly over candlelight. We wandered in here on Valentines Day, taking an evening stroll after a wonderful dinner. Of course I ordered the Valentine cocktail: champagne, blueberries, chocolate in the bottom of the flute,  garnished with a strawberry. The bar also offers a great happy hour  with $3 cocktails and Belgium beers from 5-7. . .", 
    "review_date": "2009-02-23"
  }, 
  "9jZAXnAaulEC40wtEZK6Fw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stanley K.", 
    "review_text": "It's a love / hate relationship.  You love it b/c they serve boozes, just wish they could get the hard liquor license, I would definitely come again. Hoogarden and Chimay on TAP!   Did you hear me or do you need hearing aids?!!!!  You hate it when it closes early. WHY?!  this is my sad face : (", 
    "review_date": "2007-06-26"
  }, 
  "IJABCqLsGgT8DxqujUQmiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarcastic T.", 
    "review_text": "Why did it take me 2.5 years to finally mosey into Bar 821? Always on the list of \"oh, we need to drop in there this weekend\" but never happened. Finally on a Friday night  we dropped in and had a great time! Our bartender was super-fun and quite the character (even though that comment about Alan Parsons Project made me feel OLD I won't hold it against him). If I could give bonus stars for atmosphere I would. The drinks were yummy and the prices were average for the city. Oddly enough, despite the modern decor, Bar 821 had the feel of a true Irish pub. Good drinks, food brought in from elsewhere, fun bartender, small neighborhood feel and the obligatory TV showing a sports game.  Love it!", 
    "review_date": "2008-02-10"
  }, 
  "_CCMfcZQiFAlYDpktNOJmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carrie R.", 
    "review_text": "I don't know how this bar can have so many reviews and still retain that easy \"neighborhood\" feel. Used to be a good, unknown first-date bar: laid-back, dark, anonymous...well, no longer. Last night there was a table or two occupied by non-NOPAians, but generally you'll run into your friends and neighbors here.   The drinks are DIRT cheap. $5 for all Soju and Champagne drinks. Yup, $5. I had the champagne ginger thing....$5. The soju-lychee thing....$5. Another $5 and my ass is sliding off the chair....all in good humor, of course.  Happy hour is $3. Ok, that's enough reason for anyone to come.", 
    "review_date": "2006-11-25"
  }, 
  "6oVYHx_5DDHxtOAYjpR69A": {
    "user_rating": 5.0, 
    "user_location": "Nashville, TN", 
    "user_name": "Kate R.", 
    "review_text": "love this place for happy hour 5-7 pm daily, $3 champagne cocktails, including a lecee one, soju drinks and beer  tv..music was a pleasant talking volume....good window space and cute tables all around!  don't go in at the end of the happy hour...it does not make the bartender very happy", 
    "review_date": "2008-03-04"
  }, 
  "l2pLgH6mY1Fa9rbDhGzFlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin H.", 
    "review_text": "It's got a european feel with all the candles/low seating in there, which makes for a nice spot to sit, talk and chill. Joey's got the whole bar to himself in there, and he runs the place real well. They've got all kindsa tasty drinks in there, not to mention Hoegaarden on tap which is niiiiiiiice.", 
    "review_date": "2005-06-15"
  }, 
  "_jXd74oZFTB4V-p2mdiKdw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dana L.", 
    "review_text": "Neat, chill bar. Nice place to go with a few friends - but not too many (it's really small). They have pretty good drink specials on Fridays.", 
    "review_date": "2005-10-09"
  }, 
  "sZUC9GbwvDHWrHl0D_d2dA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen K.", 
    "review_text": "Three words: cheap lychee mermaids  Ok, one more: Yum!", 
    "review_date": "2006-04-11"
  }, 
  "x2OVEAf6DKnuh3MAPzdmoQ": {
    "user_rating": 5.0, 
    "user_location": "Miami, FL", 
    "user_name": "Beccie F.", 
    "review_text": "i had a gathering here for my birthday and had an amazing time.  the bartender, juan manuel, was really nice and attentive and i ended up having a party of about 15 people, give or take, at the bar throughout the night.  it's not a really huge place either.  he was really great to accommodate us the way he did -- he brought us fresh wine glasses when new guests arrived and he was very cordial with everyone.  his service was excellent and he even gave us some free passes to a place up the street as we prepared to relocate (after most of the night, really... merely for change of scenery and so my boyfriend and i could save a little money - we bought quite a few bottles).  it was a great night overall, and this place made the perfect setting.", 
    "review_date": "2009-08-07"
  }, 
  "A2mx9xsHoIDNnd81_lxiFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Javi V.", 
    "review_text": "Nice place to hang out. I would say that works for a group of friends of both genders, or a date. Not to go with your buddies. For that you don't need the nice atmosphere of Bar 821 !", 
    "review_date": "2009-01-17"
  }, 
  "URHf5mueYVR0vGuVPr1oUQ": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Sarah M.", 
    "review_text": "Happy hour-$3 for all of their drinks except the ones marked by an asterisk.  I got the mojito (made with soju, not rum) normally $8 for $3.  Honestly that's about all it was worth.  It wasn't very good, tasted nothing like a mojito, but it was strong.  I tried another drink that was much better, something with grapefruit juice.  Really liked the atmosphere and mix of people.  Perfect happy hour spot.", 
    "review_date": "2008-02-13"
  }, 
  "IQl5YtS4Jay7aimuMH3hNw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom S.", 
    "review_text": "I walked in with my GF (she lives around the corner) and they wouldn't serve us... It was confusing since they seemed to be in the business of selling drinks and ambiance, yet had none. I'm gonna try some other day when they're not busy ignoring customers.", 
    "review_date": "2008-05-29"
  }, 
  "nCYcZqc1S2q-8_NvL2Lrww": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle R.", 
    "review_text": "How is it I had not seen this spot before?  Strictly a beer and wine liquor license, they have some fun Champagne Cocktails and Sake cocktails which are fun and good, but won't always be a good substitute for a good old martini.  A decent selection of wines and beer. Cute spot; small, modern, cozy.   Service was not great. Friendly, but gave us used napkins, so that was not a great start.  (Don't get me wrong - I am all for sustainability and recycling, but if re-using other peoples napkins is the next step, I will happily follow the BYON (bring your own napkin) standard... just let folks know this is the way it's done...  I will be back - with my own napkin. We missed the happy hour specials, but they seem to be something not to miss.", 
    "review_date": "2009-08-23"
  }, 
  "0gEDwhSUIWIBz23MbLYMig": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Luis M.", 
    "review_text": "Things that make luis m forget that he can't order a jack n coke:  - $3 Guinness Draught - super cheesy, topping heavy pizza - Anal Bandits - ridiculously large nipples - Trojan Vibrating Rings  They might not be able to satisfy your craving for the hard hootch here but it's nonetheless a very cool spot to chill with a few people, have some drinks (beer, wine, champagne, sake...), and waste away an evening.  Very clean and stylish on the inside, plenty of seating space, and a great bartender all make this place very inviting.", 
    "review_date": "2007-06-26"
  }, 
  "CUjwFvpy5R2Hjgf02Nd_Bw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Ky W.", 
    "review_text": "I've only been here once but I've been hankering to go back ever since.   I too indulged in the Valentine that fateful night and it has become the cupcake darling of my alcoholic repertoire.", 
    "review_date": "2006-03-29"
  }, 
  "9aZJMOox-6E0W_pBnaVZlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alli J.", 
    "review_text": "$3 for happy hour cocktails is pretty awesome. Unfortunately, they don't have hard booze but then again, it's probably better for my own safety...  I really liked the champagne cocktail with ginger - it wasn't very sweet but had a tiny spicy bite at the end.   The bartender was super friendly - I was a big fan.   Good spot to meet some friends for a not-too-loud chat and some cocktails.", 
    "review_date": "2009-05-14"
  }, 
  "YGfWXlF23VVk5HLKfoKNtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jade L.", 
    "review_text": "This is one of the coziest bars that I've ever been to. It's small, but the ambiance is warm, inviting and really mellow. The bartenders are very friendly, lovely people. Usually very dark in here so I wouldn't suggest coming here to read or do work.   The crowd here is mixed, but usually you'll see kind of an arty crowd. Sometimes hipsters, mainly skateboarding graffiti artists.  A lot of couples come here too. They have a super sweet happy hour deal until 7 which is $3.00 champagne cocktails and beer. I personally love the sparkling ginger. The sad thing is, I order it so much that I don't even need to tell the bartender anymore. He basically just starts pouring it when I sit down. I hate that I'm so predictable.", 
    "review_date": "2007-10-25"
  }, 
  "9UpstujNF6_95u6vqUobwg": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Sterling M.", 
    "review_text": "I used to (unfairly) refer to 821 as \"the curfew bar\" thanks to its 11pm closing time.    I walk by the place every day on my way home from work, and have, from time to time, stopped in.  It's got a nice selection of brews and a reasonable happy hour.    Considering that my other local neighborhood bar is Fly, which attracts me like flies to vinegar, Bar 821 fills the bill when I want a beer in a setting more sociable than my couch.", 
    "review_date": "2008-01-21"
  }, 
  "ROIpr8z9XFpngIAG_k77hg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa J.", 
    "review_text": "when it comes to bars, i too tend to be overly critical. Maybe it's because i used to work in one.  This place felt right at home to me -- not too many posers or fakes. And just about the right amount of dirty boys in the joint (and me like dirty boys) to check it out once more.", 
    "review_date": "2008-08-23"
  }, 
  "9h1nRWISb6tdpzMwSDYMDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "d s.", 
    "review_text": "Heaven, to me, is a bar where I can booze it up with a large, luscious, and frothy Hoegaarden and not worry about whether I'm \"cool\" or \"attractive\" enough to be on the premises.  Seemingly plucked from the streets of Amsterdam, dropped on Divisadero, and populated with a smattering of neighborhood denizens, heterosexuals and the people who love them, Bar 821, my friends, IS that bar.  You'll find a great line-up of beers and bubbly champagne cocktails here.  There's also a chill, discreet, almost DL vibe, and if you know me, you KNOW I'm all about the DL thing.  Until, that is, I get a call from his wife accusing me of being an ankle-grabbing homewrecker because she hacked into his email and found all our sordid correspondence, thus forcing me to call him and say \"LOOK BITCH, you betta choose between wifey and your 2.5 kids or my exotically starved body,\" OF COURSE he chooses ME, all is wonderful for a few months until he asks me to undergo a sex change operation, so I use some ruse like \"Let's visit the Sears Tower in Chicago, sweetie\" in order to drag the motherfucker on Jerry Springer where I call him out and he throws chairs and punches Steve the security guard in the face and tells the audience \"Y'all don't know me, suck my *BLEEP!*\"  Something like that.  ANYWAYZZZZZZ, I had a wonderful time here celebrating the birthday of the sexy Sassy S.  The fabulous dotRachel was there of course, along with Quinn S, Jenniflynn, Bucky K, Lauren S, and AKA G.  I also invited myself to lesbian night at Mecca since I STAND STRONG with my Sisters in the never-ending struggle to do what we want with our VERY LARGE SEX ORGANS.  Unfortunately, I didn't stay long enough for cake or porn consumption, but I heard both activities were very filling.  But WHO IS THIS CHEWIE G people keep mentioning? Was he there? Do I know him? Most importantly, DOES HE HAVE A YELP PROFILE?!? 'Cause you bitches KNOW I don't associate with anyone who isn't on yelp -- fucking PLEBES!!!!  Okay, okay, I'm joking. Chewie is a really great guy: cool, sweet, and charming. He told me he used to have moobs, though now they're morphing into meaty, muscular pecs that I wanted to massage with Crisco.  Yeah, he's THAT sexy.  For a terrorist.", 
    "review_date": "2007-11-16"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "My girls..  said it all ...  Sorta divey, sort of loungey, wannabe hip .. but really a neighborhood bar or a transient joint for those out-of-hoodie waiting for a table at Tsunami.  Ambiance on a late Friday night was good.  Bartender service was average, while doorman and bouncer service, IMHO was quite obnoxious.  I personally have not been impressed by these NOPA triangle establishment, but that is just moi ...  Hence, a two star for my blahness experience.", 
    "review_date": "2007-03-25"
  }, 
  "RUAb4yMazoRbbCNAxlbsFQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Soo Jin K.", 
    "review_text": "I'll start by saying, I love the word, \"NOPA.\"  I don't know why, but I do.  The acronym doesn't make any sense, given that it represents North of Panhandle, but it's such a adorable yet charming word.  Like, \"do you like to get your hair pulled?\"  \"NOPA!  But an occasional tug doesn't hurt.\"  :)  Bar 821 is a dark venue.  Very minimal lighting...sorta sexy and mysterious.  Like a cloaked gentleman in the corner that you can barely make out his silhouette, but fantasize about what's underneath.     I don't remember if they served wine, but the beer was satisfying.  It's the perfect place to grab a drink and canoodle.  You might have to yell a bit since the noise level is pretty loud.    The best part:  I overheard a guy talking to his buddy about how he wanted to have a threesome but only if it were with two girls.  Oh really, you don't want to share your lady with a dude?  Get out!  Gotta love the adult drink convos that occur late at night.   Did you have fun?  YUPA!", 
    "review_date": "2011-05-23"
  }, 
  "Z2PISdtGHThSUUbFccGkrA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Scott G.", 
    "review_text": "I've been here a number of times during their amazing happy hour (5:30-7 every day!) where I can have myself a 20 oz. Big Daddy IPA for $3.  The bar is relatively calm and relaxing during happy hour and the bartender is nice.  I go to 821 for the atmosphere but would avoid going here during its night hours when drinks are expensive and inside is crowded.  What else can I sat? It's an Intimate, cozy little bar in location you can't beat.", 
    "review_date": "2008-04-04"
  }, 
  "-vss4j7XXTWUWyKV2gWlNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clark M.", 
    "review_text": "Fun, great bartender, but it's a bar with no real bells and whistles to accentuate a really genuine offering of drinks that were tasty", 
    "review_date": "2013-05-13"
  }, 
  "cUZOuWvDPa0EvpU-KJfWVg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen O.", 
    "review_text": "Of all the bars I've visited on Divis, this is my favorite.  Delicious, very reasonably priced drinks, cute seating area, great vibes.  The only reason this gets 4 stars instead of 5 is because of the extremely unfriendly bartende.  She took one look at me and said, \"I need to see some ID\" before even saying \"Hi\" or \"What can I get you?\"  It wasn't crowded, and yes, I get that you need to see my ID and I admit I look young even though I'm 24, but I'm a paying customer and would have appreciated being asked politely instead of in an accusatory, borderline hostile way.  Without that blip, this place would have been perfect!", 
    "review_date": "2013-04-25"
  }, 
  "RZUGrWB5EiNwaXHi6ZH7fw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Tony C.", 
    "review_text": "Yeah, yeah I really like this place!   Went there on a Friday around 6:30, not too crowded, assume I missed the happy hour rush that is very typical in the \"Vis\" (shhh that's what i call Divisadero)  Great decor on the walls, tattoo influenced, with a tattoo parlor next door. Coincidence? Great Happy Hour prices $3 for most beers and champagne cocktails! oooh la la. Donnie Brasco on the tube followed by The Darjeeling Limited! Oh, be still my heart.  Little snarky on the service but I'll chalk that up to a bad day maybe. Definitely will go back and spend more money there. Great for pre-show at the Independent down the street.", 
    "review_date": "2010-05-09"
  }, 
  "OnagJ2dnPjfRRT4a_CgKCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi T.", 
    "review_text": "I've found a great place to hold my AA meetings...alcoholic amigos gatherings..that is...  They have awesome happy hours--$3 cocktails and beers... I had a couple of bubbly and lychee drinks tonight..then some bubbly with ginger...the some bubbly with bitters...it went on and on..til I got really hungry and had to make a run for my tummy.  The bartender is super chill and cool..the crowd was a bit iffy...shady at best..but who cares when you are there with your amigos?! I can see this as a perfect place to tie a few on while you wait for your Little Star pizza...or hell..run over to Popeyes after you've had a few....", 
    "review_date": "2007-09-11"
  }, 
  "O4wQaUeLxZDbUCCCvZ-5Dw": {
    "user_rating": 5.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "Nik K.", 
    "review_text": "One of the best handmade cocktails I've had in SF (a whiskey sour.) The wait staff knows what they're doing with the drinks, and the crowd was lively without being a pain. I can't wait to go back. Cash only.", 
    "review_date": "2014-06-11"
  }, 
  "KeZmfAGKpXJhhEt6j8kZjw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barbs J.", 
    "review_text": "A really great little spot: Perfect for after work, before dinner or going out for the night. The champagne cocktails are great, and the prices for a bottle of wine are very good. I love this place for a girls' night out, but I think it'd also be a great spot for a drink with a date. The atmosphere is really nice, and the staff is very friendly too.", 
    "review_date": "2005-09-27"
  }, 
  "RJH8GC15N1De9kpOia77Kg": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "J P.", 
    "review_text": "I met a very cute and cool girl here the other night named Carrie/Keri/Cary.    In the meantime, I'll have another frosty Stella served in the appropriate glassware.", 
    "review_date": "2006-08-03"
  }, 
  "g-wssBxG2znpJVKZE2N-lA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Natalie M.", 
    "review_text": "The champagne cocktails alone could keep me locked in my seat for hours; there are several different options and all sound delicious. I tried at least four of them, and I'm still left with  some options to select from on next visit. Honestly,  the only drink I really remember was the lychee cocktail, which was great.  They have a nice selection of wine to choose from as well and on my first visit the bartender was helpful and friendly in helping my friends and I select a Cabernet. On my second visit, the one in which I tried the champagne cocktails, I wasn't crazy about the bartender. I'm going to cut him some slack though, since it was St. Patrick's Day and he was the only one behind the bar.  Overall, I enjoy this bar, and it's a place I will go again.  It should be noted, that this bar doesn't serve hard liquor, but the  selection of soju cocktails, wine, and champagne is enough to keep me content.", 
    "review_date": "2008-04-25"
  }, 
  "FrpGNHzaTza5r4Y74VbHxA": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Jen T.", 
    "review_text": "Ok, so now my new favorite place, even though I was only here for 30 minutes. Great neighborhoody bar -  no Bridge and Tunnelers, no rowdy drunks. It's a nice, mellow, dark lounge - great to kick back  with a glass of vino. I'll be back again and again and again.", 
    "review_date": "2007-01-29"
  }, 
  "M36eKrxmWHYJvzZs83aEVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lija H.", 
    "review_text": "Great neighborhood spot and yummy champagne cocktails. New favorite:  The Valentine:  champagne with a strawberry and a piece of dark chocolate.  Heaven.  \n Don't go with a big group -- best for 2-4 people.  You can order sushi from Tsunami and they'll bring it over which makes it great, but you might as well go early for a drink at 821 and then cruise over to Tsunami to eat.  Or reverse it, eat at Tsunami first and then finish the night at Bar 821.", 
    "review_date": "2005-04-13"
  }, 
  "YFG_qsnCwHTxgPAYYW-YQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shoba d.", 
    "review_text": "Very cool bar, and the perfect place to hang out while you wait for your table at Little Star to open up.", 
    "review_date": "2007-06-01"
  }, 
  "NSCy54eWehBJyZdG2iE84w": {
    "user_rating": 5.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Karlee D.", 
    "review_text": "Close to my apt,  Great happy hour prices, Entertaining bartender (joey), and they make a Litchee mermaid cocktail. Litchee and champagne. mmmhmmm.", 
    "review_date": "2005-11-30"
  }, 
  "CKEMXOFtRAkknBRc854u5w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Beni R.", 
    "review_text": "I've been here more than a few times now, it's a good small divvy bar with cheap booze and that intimate dive feeling about it.", 
    "review_date": "2014-12-15"
  }, 
  "_q_z9bIwYg2q0mSNbwxmGA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Timothy O.", 
    "review_text": "Everyone's now discovered Bar 821, a small bar/lounge that the locals love even though (or is it because?) (1) they don't serve hard alcohol - their cocktails are made with either champagne or soju, (2) they close early - 10:00 p.m. or 11:00 p.m., (3) it's perfect for starting a night out.  Others have remarked that their wine pricing encourages you to buy a bottle instead of a couple of glasses, and that fits in with their strengths - Bar 821 is a place where you split a bottle of wine (or two) with friends. It's almost half bar, half living room.", 
    "review_date": "2005-09-27"
  }, 
  "qknZt5qr21xGZqGVWqqdTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen C.", 
    "review_text": "Sunday night.  Bottle of Pinot Noir.  Thumper of \"Bambi\" fame on plasma.  Closing down at 11pm in order to get me home for a decent night's sleep before the work week begins (thank you).  Perfect way to end a weekend.\n  July 10 Update:  I asked the bartender why they closed at 11pm, and they said that it was out of courtesy of their neighbors.  He also mentioned that it gives him the chance to get out to the bars and get laid.", 
    "review_date": "2006-06-26"
  }, 
  "lBscNisM3cdiBYjDErkGdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon C.", 
    "review_text": "Also a favorite local hang out. Cozy, intimate bar with dim lighting...great ambiance. They only serve beer and wine which is perfect since I'm a self-proclaimed wineo. The selection, to be honest, isn't extensive, but it's pretty reasonably priced and if you can nab a table it's a great spot to chill and spend your evening.", 
    "review_date": "2008-03-19"
  }, 
  "leKtNh_i4YES5fIvOhtHoA": {
    "user_rating": 5.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Becca V.", 
    "review_text": "Great little spot to grab a couple of drinks, a cozy little corner table, and sit and talk for awhile.  The music selection is interesting, eclectic and unobtrusive.  Fun people-watching spot.  This is one of the few bars I have been to where you can have a conversation with the person sitting next to you and actually hear 100% of what's being said. Rare for a bar, and definitely lands this place on my short list of bars I would love to go back to.", 
    "review_date": "2008-07-07"
  }, 
  "K5OIx8kNtoE2CthmjGwKHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny T.", 
    "review_text": "Inevitably in any city, a person finds their regular place--  and I was going to 821 after work all the time.   The place is not fussy at all.  .", 
    "review_date": "2008-01-16"
  }, 
  "ENxjPutN8QnIY0CyvXJUFQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matt c.", 
    "review_text": "I don't come to this bar very often, but feel like it would be a great place for a first date.  They don't serve liquor, so you don't have to worry about your date polishing of a bottle of Jameson's and throwing up on your new shirt...  The lighting is dim, the chairs are comfy, and setting feels pretty intimate.    Decent selection of wine, beer, and champagne cocktails.    Because it closes at 11, you can invite said date over to your place for \"one last cocktail\" and it still be early enough for her not to say \"well, it's already kinda late....\"", 
    "review_date": "2008-01-20"
  }, 
  "HdW_VZSVFiZTt7VcGIu52w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "frisco j.", 
    "review_text": "821 tells its patrons not to tell anyone about them yet it advertises heavily on guardian. what's up with that? 821 is an excellent bar/lounge and certainly doesn't need such gimmickry. the place is laid out nicely to maximize its diminutive space. the crowd is attractive and mellow. the beer selection is outstanding with plenty of german and belgian beers. the friendly bartenders know what they're doing. more importantly, no attitude... 821 is at the cusp of 5 stars but deserves 4 stars due to its early closing hours (zoning issue). i guess that makes 821 a good neighbor even if it's by default. that's always a good thing.", 
    "review_date": "2006-03-01"
  }, 
  "LUvb_DQjc29ZWceTWp4MXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicholas B.", 
    "review_text": "I'm glad I live about six blocks away from this place because its slowly becoming my neighborhood watering hole. I really like the smallness of this place combined with the fact that the drinks are really reasonably priced. The bubbly cocktails are excellent (I really like the one with chocolate and a strawberry) and the beers run on the large size ($4 will get you a 22oz Anchor). The lighting and the space is really cool, its easy to forget that other people are here and focus on your conversation with the people around you; its that kind of place. Its true they close early but look on the bright side, it might help you drink less! Great little neighborhood place.  On another note, regarding the whole exclusivity of this place I think its something you just kind of have to laugh off at this point since they are so popular. For this reason, however, my friends and I all refer to this place as \"the fight club bar.\" First rule of 821, you do not talk about 821.  Minus one star because last call is at 11.30 since they close at 12.", 
    "review_date": "2007-02-09"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "I like the concept of this neighborhood spot but it just doesn't get pulled off very well.  The beers they offer are good but typical of any semi-hip beer/wine bar these days.  While the seating area is nice it just feels like it is trying too hard.  Also, the place in small... feels like you are intruding even if there are just a few people hanging out there.", 
    "review_date": "2006-07-31"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "This place is really small, and they close at midnight on Saturdays. Not really sure what's up with that seeing as how it's a bar. Their cocktails are pretty tasty, but the place is tiny, and it closes really early. There are other options in the area.", 
    "review_date": "2013-01-27"
  }, 
  "RyWKKwLzLSWi_8bZd1QWYQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh M.", 
    "review_text": "Ah, I wish this bar was better - This place is right by my house and so it would be a perfect place - only if it was OPEN PAST 11pm!!!!  Even if it does just close the doors...if it closes at midnight - this is still too early for a proper bar to close.   If it really wants to cater to me as a 'Local', it would cater to my desire to not get kicked out at midnight.    Owell, I guess I'll just walk down to many of the other great bars on Divis that are open late.", 
    "review_date": "2006-10-17"
  }, 
  "J9b9YUP1bWSkO3T7XS6uYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna S.", 
    "review_text": "They have a wonderful happy hour.  Go here for the champagne with strawberries and chocolate in each glass.", 
    "review_date": "2005-10-11"
  }, 
  "5MPm6QRELNWwxiF_4NgtTw": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Liz V.", 
    "review_text": "sojo &amp; champagne cocktails w/ lychee.  good decor, though not open late.", 
    "review_date": "2005-04-20"
  }, 
  "uYFz9ITmzqome2xfq-kkhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David K.", 
    "review_text": "Fun local bar in Nopa, great place to get the night started or just chill and have drinks with friends.  Friendly bartender and laid back atmosphere. I live down the street so its always a good spot to stop by for a drink.", 
    "review_date": "2012-03-25"
  }, 
  "cmZsjBEXce-L6arBcn0DMg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan P.", 
    "review_text": "Secret bar...that's what I call it.  Hardly noticeable on divis.  This is truly a great neighborhood bar and my favorite neighborhood bar.  Beer, wine, sake and soju only, but a great selection.  Joey, the bartender is super nice and friendly.  Who needs hard liqueur when I can barely stumble home from too much Chimay...", 
    "review_date": "2009-01-12"
  }, 
  "1dhMYD2pJ19vPvADcpJe7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raj K.", 
    "review_text": "Impulsive choice, was on my way to the bamboo hut, but curiosity always gets the better half of me. For once I was actually sober before I hit the bar, but that would all change in minutes to come. Definitely a very intimate kinda place but although small did not seem to get overly crowded. The bartenders had good suggestions and I was all for trying out new and exotic drinks. That said we tried everything from wine to shots to those fruit infused cocktails. The portions were small but very potent. Out of the numerous bars in san francisco this place is almost a hidden gem....that is until it was first reviewed on yelp.", 
    "review_date": "2007-09-14"
  }, 
  "A-q5Rz4z7k6Kafos0Vx96w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana R.", 
    "review_text": "Went to this bar for the first time with a friend for a birthday. She raved about the fact that it was a champagne cocktail place and I would love it. I have to agree with her.   The only reason I go there now is for the champagne cocktails, and that's it. I love the variety and the price. Their beer and wine selection is a bit lacking for me but again prices are reasonable. It doesn't stay open as late as other bars, so get there at a reasonable hour (It closes at 11). It is definitely more crowded on the weekends.   Overall it is a chill place where you can hang out, have a drink, and hear the person talking across from you.", 
    "review_date": "2008-12-15"
  }, 
  "Qt6t6i4RDbgXIOg6EXUbvQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Irene S.", 
    "review_text": "i went here one night and don't remember a thing.  photographs from the night reveal: one of my friends flashing lots of money. over and over. and over. and over. me posing with everyone, include people i am pretty sure don't even exist. lots of thumbs and blurs. mike unzipping his pants. five people fallen over on the sidewalk outside. me being one of them.  good lord.", 
    "review_date": "2008-04-15"
  }, 
  "eu19K9KfnvvubzWuv4l6Wg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lauren F.", 
    "review_text": "Making your way in the world today takes everything you've got. Taking a break from all your worries, sure would help a lot. Wouldn't you like to get away? Sometimes you want to go where everybody knows your name, And they're always glad you came.  You wanna be where you can see, our troubles are all the same. You wanna be where everybody knows your name.  You wanna go where people know, people are all the same, You wanna go where everybody knows your name.  OK....so maybe not my name.  Met up with a fellow yelper and they might have well been singing this song.  He knew everyone!   I don't know if the personalities in this bar would have been able to rock it out like Sam and Woody, but this place for sure has character, personality, comfort and a cool quality where you hope they eventually do learn your name. Great happy hour prices, and it closes at 11 on weeknights.  That's a great way to prevent the 2am evening when you have to wake up for work the following day.  Last call...10:50, perfect.   I don't see this being a weekend destination for me, Ill probably hang onto it for beer filled afternoons.  I have lived up the street from this bar for 2 years now, and stepped foot into it for the first time yesterday! I couldn't believe it!  They welcomed me and my pooch and i can see this definitely becoming a regular thing.  Take dog for walk.  Stop in bar with dog.  Have a few beers.  Make rest of walk that much more entertaining.  Thanks for being there 821!  Sorry I haven't gotten to know ya sooner!", 
    "review_date": "2007-04-13"
  }, 
  "zF5CAo4FaV1jAk412jCyrQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Karyn J.", 
    "review_text": "I love this place!  I've only come in here on weekdays, but I've always been able to get a comfy spot in the window seats.  The happy hour is awesome and I love their champagne drinks!  The sangria pitcher is larger than it seems &amp; oh-so-delicious.   I also have to give a big gold star for the Monday night bartender since he has a huge smile, plays what is clearly his favorite music, and is just a great guy to be around.", 
    "review_date": "2009-11-18"
  }, 
  "cCp4OlLeVq5ipae47oc7og": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Austin S.", 
    "review_text": "This is the place otherwise known as \"Birthday Bar.\"    My birthday is 8/21.  This is Bar 821.  What happens when a girl whose birthday is 8/21 goes to Bar 821 on 8/21???  LOTS OF FUN!!!  My last two 8/21 birthdays have included extended stops here and I love it!  I'm shameless in whipping out my ID to show the door guy as well as the bartenders (even though no one asks for it!).  I'm always treated extra-special since we share a common number!  Once the bar tender produced a piece of cake with a candle.  How great?!  I live three blocks away and come here regularly, not just because it's \"Birthday Bar.\"  The bartenders are always great and really friendly.  The vibe is laid back, especially if you're grabbing a post-work beer with friends.  I just love Bar 821 and all my friends wish they had a \"Birthday Bar!\"", 
    "review_date": "2011-02-16"
  }, 
  "VOp7cbe-7hbsm0kEISjsDQ": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Shawn S.", 
    "review_text": "821 is a chill spot in a chill neighborhood.  Definitely a locals spot, but don't let that scare you away, the locals are all welcoming and friendly.  I can pop in after work when flying solo and wind up chatting with someone.  Great happy hour deals (I don't think people really get that the $3 beer is 22oz, so it's like 2 $1.50 beers in one glass!)  Or Chimay, Stella, Guinness... or soju coctails.  Which are very well made (ginger and lychee just to mention some of the flavors... I mean, when't the last time you had a whole lychee fruit as a garnish?)  Dimly lit, and there is usually an obscure film playing with no sound so thet the bartender's iPod can add a soundtrack to your evening.  I've discovered both new music and new movies from hanging out there.  If you NEED hard booze, you won't find it here, but if soju, wine, bubbles or beer will suffice, and you'd like to meet your neighbors here in the Western Addition... pop on by.", 
    "review_date": "2008-01-25"
  }, 
  "Z5EoiNHWR1i6TjszVMsbXw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve H.", 
    "review_text": "I love this place. I live in the neighborhood and have been coming here since it was a \"secret bar\". Well it's no longer secret but it is still a great bar. All the bartenders are friendly, the sake/soju drinks are great, the wine selection decent and the beer selection is well chosen. It's also a great place for a date! Come here...you'll have a good time.", 
    "review_date": "2006-05-01"
  }, 
  "_4ZFOXm_AXh88ZT_8YbpmQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "darla s.", 
    "review_text": "Small, dimly lit, cheaper to get a bottle of wine than drink by the glass.  All good things.", 
    "review_date": "2005-08-27"
  }, 
  "BmDcQWI5C3IjY45C0e-Q8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deb B.", 
    "review_text": "Danielle serves up epic cocktails for only $7! Chill neighborhood spot, great drinks and excellent customer service. Danielle also rocks it with fantastic happy hour deals. No question: this is the best bar in the Western Addition!", 
    "review_date": "2014-05-17"
  }, 
  "mC-Nq-FfHJb-8OTWOh0pxw": {
    "user_rating": 2.0, 
    "user_location": "Westminster, CA", 
    "user_name": "Wendy H.", 
    "review_text": "It's a cute little bar with decent drinks, nice decors, and semi-friendly service but there was nothing too memorable about this place.", 
    "review_date": "2013-10-21"
  }, 
  "v-kh_W7iWpKOIux2Gx2q1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah T.", 
    "review_text": "This bar is owned by the same peeps who run Nihon Whiskey Lounge, so I had to try it. They don't serve hard liquor, but have a fun little happy hour for beer/wine and some yummy sake and champagne cocktails. They aren't quite as complex as those of Cantina (near union square), but they're good. Nearby, you'll find minibar (looks cute - want to try it) and Little Star (gotta love it). Not too shabby!", 
    "review_date": "2010-10-10"
  }, 
  "IDVX4Is4CanREchBmpFXoA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jim L.", 
    "review_text": "Sorry for contributing to your unwanted exposure to the internet masses, Bar 821, but I just *had* to Yelp about this place.  Once in a great while, I happen upon a night spot or restaurant that just hits me exactly the right way and this place is it.  Its small, humble, unobtrusive, populated by locals and has a very warm and intimate feel to it.  The bartender is the owner, and his menu is filled with awesome and inexpensive saki and soju drinks (beer and wine license only).  The little decor touches are great, including the colored tile crossbeams on the ceiling.  I think this might be my new neighborhood bar....", 
    "review_date": "2006-01-16"
  }, 
  "w7CvXX2dtmPCm67TRJw7kQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel F.", 
    "review_text": "I don't belong here. I don't fit in. I used to fit in here, but I don't anymore. When I come to Bar 821, I always bring my friend who lives in NOPA so that I can fit in. Yes, I'm surprised they still allow me in.  You see, I used to live in this neighborhood, but I've since moved southward. So, according to Bar 821's rules, I don't really belong here. Well, I do, it's just that I have to acquiesce if someone from the 'hood wants to come in and have a seat and my Potrero ass is stealing prime seating space. Or so the rules stated on the wall say.  But I feel so at home here! I love the lighting, the seating, the drinks, the service! Please let me keep coming back.  Joe's so nice and honest about the fact that some of the more expensive wines aren't exactly better than the cheapos. And his Manc accent is like smooth butter to my ears.  I consider myself an honorary Divisaderian just so I can keep coming back to this lovely little bar.", 
    "review_date": "2008-05-01"
  }, 
  "p5TRjvekkxtrh2p3eg9DFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Morgan H.", 
    "review_text": "Dark candle lit bar with some intimate seating that makes for a great happy hour spot with a few friends or taking that special someone.   The happy hour deals here are fantastic. Where else can you get a pint of Chimay for like 3 bucks? Crazy! All the belgian beers here are solid and you can't go wrong. Wine list is alright also and they have some Sake or Soju mixed cocktails as well. minus one star for no spirits - they don't have the license.   Big bonus though as they let me bring in two Little Star pizzas from across the street to feed my ravenous friends after a long happy hour.  They even gave me some paper plates they found in the back!   I'll definitely be back.", 
    "review_date": "2008-02-17"
  }, 
  "DH7ABAMHvl6IQfJ_yK7x5Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara G.", 
    "review_text": "Psst.....Very pleasant neighborhood bar on Divis.  The decor is dark yet warm with orange hues and fabulous artwork that complements the ambiance.  The simple bar offerings of beer, wine &amp; champagne made it easy for me to cozy up to my cute date and my generous pour of shiraz.  Great place for convos or cuddling in the candlelight.  The staff was attentive and helpful, but I do have to agree that the early weeknight closing time kinda sucks.  Just as I was getting comfy in my booth, which had a great view of bustling Divis and the pouring rain, the bartender came over to warn us it was last call at 10:30!  But it was way worth the trip and there are plenty of late-night alternatives nearby.  Bar 821 is a pleasurable little secret... but it didn't come from me : )", 
    "review_date": "2006-03-02"
  }, 
  "2bHSZhM0huV8LRh3YHaOSQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Charged with not being very prolific lately - I admit my guilt.  Realizing that I have never reviewed Bar 821, even though I love it so?  Surely that deserves a 20 year sentence.  Or maybe just a 20 drink sentence. Bar 821 started off as my go to spot to wait for my table at Tsunami to open up.  My first trip to both places was on a lovely date - he chose well, and while the dates fizzled shortly thereafter, my love affair with 821 was just beginning.  How can you not love that Tsunami will call you at Bar 821?  Or that you can ask the bartender to call Tsunami to see if your table is ready?  Either way, it works out great.  The champagne cocktails are yummy, the selection of beer is fab, the happy hour is wicked cool, it's small, I usually like the crowd, there are cute bear sized puppies roaming around, and the bartender has an English accent.  WHAT IS NOT TO LOVE?!  I just don't get a hankering for hard alcohol before I come here, and I'm beyond satisfied.  That 20 drink sentence is more a reward than anything else.  Minus a star for not being open at all hours and making me get off my comfy booth earlier than I'd like sometimes.", 
    "review_date": "2007-06-26"
  }, 
  "vsfG95vDU20d7upU1Zs6uA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi C.", 
    "review_text": "I forgot about my idea of having them make me a kier royale with lychee juice in it. OOPS but I did order another Lychee Champagne for $6. YUM. I like Bar 821, and you will too.  Btw, CASH ONLY.  And yes, there is an ATM inside.", 
    "review_date": "2009-04-09"
  }, 
  "Vb9dyGjQIdnuRKYDIO_AFA": {
    "user_rating": 4.0, 
    "user_location": "Western Addition/NOPA, San Francisco, CA", 
    "user_name": "Stefan A.", 
    "review_text": "Great little neighborhood spot with a unique feel.   - Quiet enough to talk without being a crypt.   - Hip enough to be fun without being self absorbed.   - But for the liquor...", 
    "review_date": "2008-08-20"
  }
}