{
  "0LQfRjCOIR-srINaU0soyg": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Ira B.", 
    "review_text": "I was looking for a place for to do a little beer tasting along the Embarcadero. A quick Yelp search and Beer 39 came up. It looked interesting. My mistake.  Three of us stopped in and decided to share two of their beer flights. At a little north of $10 the sampler of 4 beers was a little on the expensive side but not by too much.  To go along with our beer, we ordered some of their seasoned pretzels and garlic fries. The fries were hardly garlic and barely fried. It was a very small plate (about the number you get in a small order at McDonalds). They were clearly frozen fries that were way under cooked and dusted with a tiny bit of garlic.  They fries were bad enough but then the pretzels came. Imagine a 10oz tumbler filled with a handful of stick pretzels sprinkled with seasoned salt. A hand full of pretzels for $3.50. Total rip off.  The beer was good enough but the snacks wrecked our visit. I won't be back.", 
    "review_date": "2012-07-29"
  }, 
  "uDBnapEGywTQ0ovaCu7Orw": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Shaji K.", 
    "review_text": "Great location right by the mirror maze, to get a nice buzz before trying to figure your way around an endless tomb.  Prices are a tad high, but a good selection of beer and an excellent bartender that accommodated separate checks from the 7 of us.   Beer memorabilia in the store and a good open area, could use more seating at the bar though.", 
    "review_date": "2013-05-29"
  }, 
  "EomLBKvAMzN1g65ju1Nrxg": {
    "user_rating": 5.0, 
    "user_location": "Centennial, Las Vegas, NV", 
    "user_name": "Jacqueline C.", 
    "review_text": "Great service. The bartender was very friendly to us tourist. The beer was great. I loved that all the beers featured were from California. I tried the California summer flight. It was very refreshing. I would definitely recommend Beer 39 when visiting the tourist trap Pier 39.", 
    "review_date": "2014-03-18"
  }, 
  "3d6yGe8VKs7gt5b7hXw5xQ": {
    "user_rating": 5.0, 
    "user_location": "Vacaville, CA", 
    "user_name": "Amanda M.", 
    "review_text": "Hands down the best service I have gotten at a bar in a long time! I have been here a few times and I have never been disappointed! They have a good selection of beer but prices can be high which is normal for a place at Pier 39. Get a taster flight and you will not be disappointed! Its the best way to try different beers at the best price!", 
    "review_date": "2012-05-22"
  }, 
  "f1KOi_I2DKGasbhUrT5IfA": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Joe M.", 
    "review_text": "Pretty cool. Lots of local craft beer. Chill vibe.", 
    "review_date": "2013-04-27"
  }, 
  "qrT8IXzmle4htNioV2T3YA": {
    "user_rating": 4.0, 
    "user_location": "Corona, CA", 
    "user_name": "Ciara O.", 
    "review_text": "We came here after our Alcatraz tour it's hard to find but awesome place. Great server/bartender. Didn't catch his name but I know he was new. Just came here from Ireland. He was so friendly and nice. Easy to talk to. Definitely a great asset to that place!! Don't think they serve hard alcohol or mixed drinks. Great atmosphere.  Next time we are in town we will definitely go there!", 
    "review_date": "2014-06-19"
  }, 
  "iuRpRASIRqFaDd_B_IEDbQ": {
    "user_rating": 4.0, 
    "user_location": "Salt Lake City, UT", 
    "user_name": "Monica V.", 
    "review_text": "If you're feeling thirsty in the pier 39 area, what better place to visit than Beer 39 to get some booze? The boyfriend and I did a beer tasting and I really enjoyed my selection of IPA's. I discovered an awesome one by Lagunitas which is probably my new favorite of the moment. We also had some oysters that were a nice light snack. I just wish they came out with a couple more lemon wedges, but we made it work.", 
    "review_date": "2015-01-13"
  }, 
  "yfGQkx_9JlG5hlEtkUcMFw": {
    "user_rating": 3.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Mike Y.", 
    "review_text": "It's okay. The beer selection didn't really blow our socks off. Kitschy beer stuff on the walls... Kinda generic, like what you'd find at Spencer's in the mall.  It was hot and the beer was cold. Worked for us.", 
    "review_date": "2014-10-05"
  }, 
  "JUII2PkFmwNPEs0E_O1BFw": {
    "user_rating": 5.0, 
    "user_location": "Palm Desert, CA", 
    "user_name": "Lara D.", 
    "review_text": "GARLIC FRIES!!  I don't drink so I don't know anything about their beers, but the Garlic Fries were awesome!    Great tourist stop before saying hello  to the walrus :)", 
    "review_date": "2014-08-24"
  }, 
  "cyPobhMHDp_V1eWtYLTSWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy F.", 
    "review_text": "If you find yourself at Fishermans Wharf in San Francisco stop at Beer 39.  Paddy is the best bartender you'll find and the beer selection is great!!!", 
    "review_date": "2014-09-29"
  }, 
  "fafxzUMCa6shjwLcX2bLGQ": {
    "user_rating": 1.0, 
    "user_location": "Satellite Beach, FL", 
    "user_name": "Lauren C.", 
    "review_text": "I can't review the actual beer or food here, because we left before we had a chance to try anything. The manager/bartender was incredibly rude. I didn't stay nor would I ever come back/recommend. There's better places to drink in San Francisco where the staff is friendly to customers.", 
    "review_date": "2015-01-20"
  }, 
  "Sxq3tpkG-pnKnCRsdVJh0A": {
    "user_rating": 4.0, 
    "user_location": "Rancho Mirage, CA", 
    "user_name": "Charley B.", 
    "review_text": "After hitting the tourist trap of Pier 39, it was awesome there was a pub that had local brews on tap. The tasting boards were delicious. Take a walk onto \"The Dark Side\". Stouts and Ports, for the dark beer lover", 
    "review_date": "2015-01-03"
  }, 
  "AJxfFzUNH4mlP5duXi-ZCw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "John I.", 
    "review_text": "A fun stop if you're a beer lover and a definite necessity if the tourist traps are getting to you. They four different beer flights for about ten bucks and 16 oz brews from $6-7. They have about 12 beers served on tap and much  more by the bottle.   They also have a fun wine/beer influenced shop attached to browse. What stood out the most here however was how awesome the staff was: funny, social, and curteous. You could tell they loved their jobs and had a great time doing what they do.  Definitely will stop here everytime I come back to the pier for some liquid releif. Enjoy!", 
    "review_date": "2015-01-21"
  }, 
  "G42xhGptP7jIofchHUmWDQ": {
    "user_rating": 3.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Mike M.", 
    "review_text": "Came here while waiting for our table at Bubba Gump's on Saturday.  They had a decent amount of beers, but only 5 on tap.  The interesting thing is that the sushi place next to Bubba Gump's actually had more beer on tap than this place.  The beer wasn't to expensive here, it was $5-7.50 per bottle, but in hindsight, I wish we went to the sushi place for drinks, since they had a better selection!", 
    "review_date": "2014-09-08"
  }, 
  "ZLq1NwlXa7jjXwK0XHDhMw": {
    "user_rating": 4.0, 
    "user_location": "Lake Mary, FL", 
    "user_name": "Alex F.", 
    "review_text": "Good place to get a cold beer!", 
    "review_date": "2013-12-10"
  }, 
  "cNA34G9LotHWBrV1QcyjLw": {
    "user_rating": 5.0, 
    "user_location": "Chalfont, PA", 
    "user_name": "John B.", 
    "review_text": "Four of us stopped in for a drink and ended up doing beer tasting. Caitlyn knows her beers and was a lot of fun.  There once was a bar called beer 39, Where I received every beer directly on time, I drank my beer right out of a stein, It was made in china but I didn't mind, Caitlyn rocks, so I busted this rhyme!", 
    "review_date": "2011-12-01"
  }, 
  "alLsax2aJFT23V5E4SfW-w": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Nancy F.", 
    "review_text": "We stopped in here to try some of the very local beer.  Prices are high for a pint, around $7 or so.  But, you can do a sampler which is nice.  Kaitlyn was very nice.  It is upstairs on Pier 39 towards the end of the pier, so look for it.  They sell alot of nice beer stuff in there.  Fun place overall.", 
    "review_date": "2012-04-17"
  }, 
  "VGEDyQFYa4vlQjNruZa0Mw": {
    "user_rating": 5.0, 
    "user_location": "Watson, Canada", 
    "user_name": "C S.", 
    "review_text": "Stopped here a few times, great menu of beers, the service was always good and while we never ate here, the bar food looked pretty good. Great place to stop and get away from the crowds at the Pier.", 
    "review_date": "2012-08-15"
  }, 
  "nAswPQNWBZK11OEB1c6Vhg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Russell V.", 
    "review_text": "Beer tasting!!! What else do you need to do at Pier 39! Ask for Jason! Fun place!!", 
    "review_date": "2011-11-14"
  }, 
  "I0DpH1KzEW5rWQ_JTOD36Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bert E.", 
    "review_text": "'Had a GREAT time. Lots of beer choices and all of 'em tasty. (I'm saying that because  the others beer lovers there also looked like there enjoying their rounds.) The 4 that I tried were fun.  My favorite was \"Evil Twin\"... Plus the 3 others in the package!  The Waiters and Bar Keeps were wonderfully friendly and attentive. I have to get back there for more \"Evil Twin\" ... Enjoy", 
    "review_date": "2012-05-29"
  }, 
  "2_1FxCMLvK46Vt81VlIS7A": {
    "user_rating": 5.0, 
    "user_location": "Dayton, OH", 
    "user_name": "Joe P.", 
    "review_text": "Enjoyed the setting and selection of local beers. Nice break from the shopping on the Pier. I did an IPA trio sample which was very good.", 
    "review_date": "2012-01-27"
  }, 
  "vBxBasCBuA9uZfomh3fEYQ": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Lena C.", 
    "review_text": "Love their beer samplers! I wanna go back.", 
    "review_date": "2013-03-04"
  }, 
  "9XDFZlGs4-QwQx44YODnWQ": {
    "user_rating": 5.0, 
    "user_location": "Greenwood, IN", 
    "user_name": "Courtney T.", 
    "review_text": "Jason rocks! We went here twice during our visit to SF!", 
    "review_date": "2011-11-27"
  }, 
  "vC2one2A6TaM-gYE-G_tKQ": {
    "user_rating": 3.0, 
    "user_location": "Hillsborough, NJ", 
    "user_name": "Rick S.", 
    "review_text": "Make sure you get seated at Caitlyn's tables and not Nathaniel's.  (just kidding - lol) Enjoyed the beer, garlic fries and service.", 
    "review_date": "2012-07-07"
  }, 
  "aM3T4jeHY_fswn6xQ41rtw": {
    "user_rating": 2.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Nick D.", 
    "review_text": "Kind of a creepy, dirty little bar.   I didn't realize what a tourist trap this area was until I got there. Ran in here for a beer and was completely underwhelmed. The beer selection is descent, but it is on the pricey side and is such a dull, boring place that feels very dirty. The bartenders seemed very uninterested in being there as well.   I am surprised the reviews are so good. I really was not impressed and would not go back.", 
    "review_date": "2013-07-17"
  }, 
  "u-Ii6mpA0jmMGdYXuyjMvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe W.", 
    "review_text": "We ventured to Beer 39 after reading about it in the Northern California Craft Beer Guide.  As long-time residents of the City, we found it odd that we would be visiting the touristy area for quality beer.  So worth it.  Loved this little bar, tucked away in the far back of the shopping area of Pier 39.  The bartender was quite knowledgable about beer (he's a home brewer ... Always a good sign).  He knew the drafts and bottles, knew what to recommend and what to 'push' for tastings.  Although not often in this hood, we will go back ... And when friends are in town, we will definitely add this to the roster for Places To Go.", 
    "review_date": "2012-11-14"
  }, 
  "TmAd0zvOqTd7lRCclz_ouQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob R.", 
    "review_text": "Oddly well-lit bar on the pier. A bit pricey, but that's expected in such a touristy area. The inside looks kinda like a dive bar and a gift shop had an ugly love child. So, this place would rank 3 stars except for:  1) They had some interesting and unusual brews on tap  2) There are no TV screens. This is the only bar I've encountered in recent memory that does not have TV screens constantly on. There is a time and a place for TV screens, and that time/place is not everywhere/always. So, here's an alternative if you want a slightly quieter environment where you can focus on a conversation.", 
    "review_date": "2012-10-30"
  }, 
  "xi94GOYwC9SXlxy3G1ZoZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina B.", 
    "review_text": "This place is a really fun hideout along pier 39 to sit for a minute and grab a beer in between shopping. The staff is super friendly and will sit and chat when it's slow. Beer isn't tourist prices either so ill be back", 
    "review_date": "2013-05-29"
  }, 
  "Be9TizTz7rFrGasI639Ymw": {
    "user_rating": 3.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Loan D.", 
    "review_text": "I've been to Pier 39 a few times, but was never able to locate Beer 39.  It upstairs, so be sure to keep  your eyes open!  When we finally discovered it, it was pretty crowded.  It took awhile to get seated because there was only one worker, he was the host and the waiter all together!  He did apologize that he's the only one working and that it will probably take some time for our drinks to come out.  When we finally placed in order, he did mention that they were running low on cups, odd!  Because the bar pretty much cleared out.  The choice in the beer flights were great; got to try beers from local brewery and we were seating next to the window so people watching was fun.  One downfall is that they don't have a restroom; you'll need to walk about 30 feet to the public restaurant; strange ain't it?  But 'll definitely come back, just to try more beers!", 
    "review_date": "2013-04-05"
  }, 
  "ftmo_YP0bqKwvEeO6haSNQ": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Tina K.", 
    "review_text": "Popped in here with my sweetie after \"playing tourist\" on the Wharf  over the long Labor Day weekend before heading back to Seattle.   We weren't hungry at all as we had eaten less than an hour ago, but wandered in here with the hopes of doing a tasting of some beer from some local  Cali breweries.  So my review is all about the beer.   The setup of Beer39 is pretty cool, very open and pretty cool for people watching.   The interior is sleek and the bar is very comfortable.   And that seems to be about the best of what I experienced.   I was underwhelmed.   The beer selection wasn't that exciting at all and those tending to the bar weren't very helpful in guiding us to some of the most popular California beers on the menu. (I had mentioned we were from Seattle and were beer enthusiasts and were looking to try some great Cali beers.. and the bartender just kind of looked at me with a blank stare..)   I guess I shouldn't have had my hopes up for a bar that was in the midst of a tourist trap.   We selected our beers for our tasting (and a cider as the other choices were very boring).  The bartender slapped them down in front of us and went down the line telling us what they were. As soon as he was finished. I forgot.  And had to ask him again. (It drives me nuts when bars do tastings without some sort of coaster or something to place under the beer... heck even a post it note is fine.  I'm drinking alcohol here people... how in the heck am I supposed to remember what beer number one was by the time I get to beer number five???  Seriously!  Anywho...  We  finished our tastings and ordered a couple of pints (we dubbed it \"the third one we drank as of course neither of us could remember the name of it)  and then hit the road for the long drive back to Seattle.   I LOVE beer as does the other half.. but I was so underwhelmed by the place that I can't even remember the beers we ordered even after the bartender lifelessly told us what it was again.   Completely non memorable establishment that is more than likely only still chugging along due to the fact that it is in a tourist location. (Fishermans Wharf).", 
    "review_date": "2012-09-07"
  }, 
  "d08AdGoKfxcsgkzDou-wkg": {
    "user_rating": 1.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Melissa B.", 
    "review_text": "Franco is an idiot. He thinks he knows everything but he didn't come to our table unless we flagged him down. We like Chris though, he was helpful and informative about the beers and asked how we were doing even though he wasn't our server. Franco should be fired.", 
    "review_date": "2013-10-12"
  }, 
  "1COrnp000xLM8B2CkOFu6w": {
    "user_rating": 4.0, 
    "user_location": "Ormond Beach, FL", 
    "user_name": "Mike N.", 
    "review_text": "I had a wonderful time.  The beer selection was very good and I was able to order a couple flights of local (i.e. California) beers.  The flights consist of three, 5 ounce glasses.  My first was a flight of ales and the second was a flight of IPA's.  Both were very good.", 
    "review_date": "2014-06-01"
  }, 
  "FUoThQ-5fRxc4qO3HF-tYg": {
    "user_rating": 5.0, 
    "user_location": "Peoria, AZ", 
    "user_name": "Tim B.", 
    "review_text": "Stopped in here with my girlfriend and loved the place! Chris and Kevin were a blast and knew their beers. Thanks guys we will stop in here every time we come to the bay!", 
    "review_date": "2013-09-16"
  }, 
  "xmOc1uxehuuKtGj7-2KpJA": {
    "user_rating": 4.0, 
    "user_location": "Menifee, CA", 
    "user_name": "Richard C.", 
    "review_text": "Friendly staff, beer samplers are at a decent price, we drank enough to get us pretty buzzed up, and our bill wasn't ridiculous. Good selection of beers. Food wise, the bread bowl was good, the chicken strips were ok", 
    "review_date": "2012-08-05"
  }, 
  "UMC2dKiLVhfGSvHX8QQeOg": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Scott V.", 
    "review_text": "An oasis in the sea of tourist traps on the pier...Came for the beer tasting and ended up getting the hemp beer from a local california brewery. Down to earth feel with friendly staff.", 
    "review_date": "2012-01-11"
  }, 
  "2Cm8T8f9JOmd5wABelmHjA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Richard W.", 
    "review_text": "Stumbled in on accident. Stumbled out for different reasons.  Quite a gem. A little hidden because it's on the second floor of the pier.  The service I got was excellent. Fun servers left me with a smile.  That paired with a great beer and a great lady friend - it made for a great memory :]", 
    "review_date": "2013-08-27"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "Beer oasis at the wharf. While your family is meandering around the sock shop, dash up up here to the top floor.", 
    "review_date": "2012-08-07"
  }, 
  "8vmNrj-MS-pz37Ua_aqmkw": {
    "user_rating": 2.0, 
    "user_location": "North Kingstown, RI", 
    "user_name": "Jeff M.", 
    "review_text": "Keep walking. There's lots of great bars to be had in the city by the bay, this ain't one of them.", 
    "review_date": "2012-05-28"
  }, 
  "JOrDiXIgpb0sjtd7Cr3CdA": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Mandy H.", 
    "review_text": "Fun place in Fisherman's Wharf to try some beers. I did the white California (sp) tasting, which was very yummy and even included a cider. There wasn't one beer I didn't like. We didn't try any food, but I'm always down for a good beer sampling. Check it out!", 
    "review_date": "2012-07-20"
  }, 
  "SOWH0QqDNaK2Fgx4ycn1JQ": {
    "user_rating": 3.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Vincent V.", 
    "review_text": "Cool spot on Pier 39 to grab a local beer and some fun merchandise.", 
    "review_date": "2013-03-10"
  }, 
  "P3lgczevYp6gje4KfYH_nw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay, CA", 
    "user_name": "Jay P.", 
    "review_text": "So... You know when you've been walking around shopping and sight seeing and have that inkling for a beer? Well... I have a solution for that inkling. At least if you're near the Pier 39 area in San Francisco. My cuz, friend, and I just happened to be walking by this new place while we were looking for a restaurant to have a beer and some food. Right when you look into the doorway, you see a bar with about 12 beer taps. The draft selection was good and they have more in bottles. Besides the beer, they have beer related items like clothing and stuff for your own home bar. The place is so new (One week old) that they don't have a storefront sign or business cards with their business name. But hey, that'll be sorted out soon. I would have given this place 5 stars if they had more beers on draft but otherwise, it solved our thirst for a beer! I like the place. Check'em out!", 
    "review_date": "2011-10-04"
  }, 
  "aavE21Y0VpyFR6QQljtsCQ": {
    "user_rating": 5.0, 
    "user_location": "Sterling Heights, MI", 
    "user_name": "jennifer S.", 
    "review_text": "This place was a great find.  Open only 3 weeks. Great beer and Katelyn and Jason were a lot of fun to talk with.  If you want a little sumpin sumpin, check this place out!", 
    "review_date": "2011-10-27"
  }, 
  "W_ds8g8jSNf2DLHcCHexxA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anna V.", 
    "review_text": "WHAAAAAAAAAAAAT, a beer tasting joint inside Pier 39?!  Couple of friends and I couldn't decide which group to choose for the sampler tastings, so we just got all three flights of the beer tastings. Twelve 5-oz. tastings for $30-something. WE LOVE BEER SAMPLERS!!!  I also bought a couple of kick ass Stella reusable bags. They will now be my lunch bags for work.   This place also carries those kick ass looking steins with the fancy tops. They are relatively cheap but then you'll find that it's because they are not made in any of those cool European countries.", 
    "review_date": "2012-06-06"
  }, 
  "Z_mlealRdplmaBnICvSqRA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Maya C.", 
    "review_text": "This was a great little spot I stumbled into while waiting for a friend. Definitely my only choice outside of all the tourist traps at the pier.  They had a great selection of beers, knowledgable and friendly staff, clean bar, nicely decorated and affordable drinks.  The beers were also local which was great because I've never been to San Francisco and was really excited to try some local beers.   Kevin was definitely a great bartender and able to manage the multiple tables he had while being the only one working. Was impressed with this place :)", 
    "review_date": "2013-04-17"
  }, 
  "sfF-ZpkmafbjqNr3wqXfDg": {
    "user_rating": 4.0, 
    "user_location": "Tacoma, WA", 
    "user_name": "Whitney R.", 
    "review_text": "I went to Beer 39 on the 4th of July with my guy, it was not too busy yet so we were able to seat ourselves and get a table. A rather odd waitor came up and dropped off Drink and snack menus, then came back took our drink order in about 3 minutes so very quick service....at first.  The Beer here is very good as were the Garlic fries we ordered. 16oz Beer was 6.75 not bad and well worth it. Garlic fries were some of the best I have had and you get a huge pile for 5 bucks! The atmosphere is nice and they have lots of vintage beer signs and other odds and ends,   So here is the NEGATIVE... Our waitor was very short with us like he didn't care to be there, not polite. He at one point was falling asleep in the corner NOT OKAY! The other waitor there was however on top of things and running around trying to compensate for the lazyness of the other guy. It took 15 minutes after we asked for our check to get it then anoter 10 to bring it all back.  I would go there again for the beer and fries, just hope our next visit is better.", 
    "review_date": "2012-07-05"
  }, 
  "TKzReVuuPftpoSg0fvIfbw": {
    "user_rating": 1.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Branden V.", 
    "review_text": "My friend and I just wanted to grab a quick beer and maybe something little to eat. The food was a bit on the expensive side for what it was so we just ask to see if we could get some French fries to hold us over until dinner. The guy was nice and said sure we could get you some fries. So we get our two beers and took awhile waiting for the fries but that was fine. The fries came out and get its a small tiny amount of fries. They were typical frozen bag and I'm sure we got the bottom of the bag....you know the ones that are only like an inch long. So my friend ask for some ranch and they say they don't have any when clearly they have a whole salad section on the menu and the people before us had ranch on their salad. Anyways it is what it is but then the check comes and its $9 bucks for these fries. Crazy! I wouldn't tell anyone to go to this place and I will never be back.", 
    "review_date": "2013-09-22"
  }, 
  "gW3tX6YmxMrUHsyhkFqSmg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Robert l.", 
    "review_text": "A pleasant departure from the tourist trap of pier 39. I was overwhelmingly surprised by the welcoming bartender, Thomas, easy going atmosphere and fast pours. Come here to get away from the crowds while shopping. The bartender also mentioned the restaurant was delicious but we ordered garlic fries instead of going to dinner.", 
    "review_date": "2014-12-24"
  }, 
  "ZsUSGU1-L1ImomLZjXxxTg": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Kellee K.", 
    "review_text": "We stumbled on this place before dinner at Crabhouse 39. Great selection of local brews! We tried a few we hadn't seen elsewhere; I was a big fan of 'Back in Black', Firestone Pale and Hemp beer. Great service. I look forward to a return visit next trip.", 
    "review_date": "2012-02-10"
  }, 
  "c5rYl7RyMEZ6EgCfgrLVBQ": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Anthony C.", 
    "review_text": "Fun place for locals and tourists alike. Meet some really interesting people from all over  the world who enjoy good beers. Bar/wait staff are enjoyable company and enjoy getting to know their patrons no matter where they're from and what their story might be. Just a good hiedout in a very busy, tourist laden area.", 
    "review_date": "2014-04-13"
  }, 
  "exBaJu2r2mtiCJjbLBAhig": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Drew M.", 
    "review_text": "Although Pier 39 is quite the tourist trap, Beer 39 actually boasts a kitch set of novelty alcohol related gifts, as well as some quality craft beers!  We stopped here for a quick drink, and you can order tasting flights, as well as 22oz sizes of their beers!    This is located on the upper level near the back of Pier 39, and Is worth a stop!  Send your gift shoppers to browse, while you \"go to the bathroom.\"  It's a great respite from the hustle bustle of the area.", 
    "review_date": "2012-12-15"
  }, 
  "3zWYE-sXRgbT6pHzGo8LNw": {
    "user_rating": 4.0, 
    "user_location": "Stafford, VA", 
    "user_name": "Hammer Time H.", 
    "review_text": "good beer, weird staff, but it's beer...enough said", 
    "review_date": "2012-03-06"
  }, 
  "AGvwTHggMX79RxJkK5PKhg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Wynter D.", 
    "review_text": "This place is a life saver for Bay Area residents giving the grand tourist tour to friends or family.  God how  many times have I had to visit Pier 39 now? I cant even count, by the end of the day everyones always exhausted and Beer 39 comes to the rescue.  I was pleasantly surprise to find this place had opened, they have an Awesome tasting menu, that features mainly local California brewing companies. I even found my new favorite Beer alternative here: Ace Joker, you have to try it form their pristine taps.  Oh! And friendly staff that provide excellent small talk and is always happy to talk to you despite the hoards of annoying tourists they probably encounter.", 
    "review_date": "2012-10-03"
  }, 
  "CO8GchIkG62QJO_WCFgHhA": {
    "user_rating": 5.0, 
    "user_location": "Outer Richmond, San Francisco, CA", 
    "user_name": "Elena W.", 
    "review_text": "SERIOUSLY THE BEST SERVICE I'VE EVER HAD A AT BAR!!! the bartender was great! i wish i could've taken him with the rest of the night to help me pick out my drink choices.", 
    "review_date": "2011-12-04"
  }, 
  "FoBIr2-anCEyT9Ajp-oWtA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Anna N.", 
    "review_text": "We came here in order to redeem the beer tasting coupon from the coupon book.  Day drinking on vacation sounded nice considering it was a nice deal.  We were the first people there but people came to join in afterwards. The place was well decorated with stuff to stare at all over the walls.  Also it looked like a mini gift store.  They had a few different groups of beer tastings to choose from.  I really loved how they paired similar beers together and a good number of groups to choose from. We chose the dark side group which was the darkest we could find.  Overall, this was very fun and I'm very glad we tried this. Julian, our bartender, was very friendly and helpful in helping us find out what we should do next.    Note: I would have more details on the exact beers we tried and pictures of the place but this was lost with my phone off the mountain.", 
    "review_date": "2015-01-19"
  }, 
  "FlXBpK_YZxLo27jcMdII1w": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Mallory D.", 
    "review_text": "I liked Beer 39 because I thought it was a very interesting concept.  Beer stuff (ie glasses, tee shirts, beer pong table hats, ets) along with bar service.   The beer list is great, and the flights are a great value, although they were out of many of the beers on the list when I was there.  I was just not crazy about the service.  The people working here are beer snobs to the extreme.  I also didn't appreciate when they talked to each other within earshot of me, asking one another if they collected my money like I was a deadbeat!  Oh well.", 
    "review_date": "2012-09-13"
  }, 
  "Z9uf2uauERjF_QUkCzPwKA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa N.", 
    "review_text": "stopped in to find refuge at the bottom of a glass after walking for hours around pier 39/fisherman's wharf.  it's a small simple no frills bar that offers beer flights for a reasonable price considering you're in the fisherman's wharf/tourist spot where all prices are jacked up.    we got the California Summer flight which had blondes and pale ales. there were 5 small glasses for $10.95. there were 2 other flights, one with darker beers, for up to $14.   the service was prompt and nice enough, so if you need to escape the pier crowds or your nagging family, stop on it for some brewskis. they have a beer of the day for $5 a pint.", 
    "review_date": "2012-07-22"
  }, 
  "m6CDpHFf8kh7a0hpowpr0g": {
    "user_rating": 3.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Andre J.", 
    "review_text": "This is a good idea but just doesn't work for me. It is on pier 39 which makes the name pretty cool actually but it just was not put together right. First its pretty small and you can't really see the sign since it is on the 2nd floor. When I entered it had a lot of signs that u can purchase and beer equipment you may need for any bachelor pad. The beer selection was not as great as i was hoping. There was about 7 - 8 beers on tap and the rest bottles (which I could get at any liquor mart.) I went with the Bisson IPA because it was from a local brewery which was pretty good.", 
    "review_date": "2013-03-01"
  }, 
  "J9ZaXrllVa_HGX7ibRaAyA": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Justin C.", 
    "review_text": "Fun bartenders and great tasting flights. Good escape from the crowds downstairs on the pier.", 
    "review_date": "2013-01-19"
  }, 
  "QQu9Lo3on-X9BjZY2vBqCQ": {
    "user_rating": 5.0, 
    "user_location": "Walnut, CA", 
    "user_name": "Vanessa J.", 
    "review_text": "Fun, beer", 
    "review_date": "2013-02-20"
  }
}