{
  "0vdUr-T2Qgx5_98F8N1rEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Assaf B.", 
    "review_text": "After being in the original Munich Oktoberfest twice, I got to say I really appreciate a good beergarden.  Good beer (but not a big selection), some interesting German snacks and joint tables for the ambiance.  Only missing ingredient is some German music, but obviously a no-go cause it's outside.", 
    "review_date": "2012-04-29"
  }, 
  "yXtStKz2c9LVLPd1_LgjsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nho H.", 
    "review_text": "Like the concept of this place and wished there were more spots like this in the city.  I don't however like the long beer lines.   If you can beat the rush and are with a big group, this is a fun spot to chill on a sunny afternoon with some good bier.", 
    "review_date": "2012-02-22"
  }, 
  "PZsSSCa-XXZWBQhiPy8nPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Van L.", 
    "review_text": "If the weather's nice and you want to just chill with some friends, you should definitely come here! But make sure you come early, it gets packed QUICK. I like the beer selection and the mugs they're served in. Brass Monkey was particularly delicious - taste like straight up OJ but the buzz totally creeped up on me!  It's a little pricey ($8 for a small and $16 for a large) but the environment's chill and it's exactly what you need if you ever want to remind yourself that you're in San Francisco.   Stay away from the pretzels.", 
    "review_date": "2014-01-07"
  }, 
  "swqPgaC_wLtmVbCYxIpOqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lina L.", 
    "review_text": "Great place to chill with friends and grab a drink on a nice SF weekend afternoon. Good soft pretzels and decent selection of beers. A place like this has been much needed in Hayes Valley and it's finally here!", 
    "review_date": "2012-11-24"
  }, 
  "RCKdmKDZRd-RovZVtNSCLA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Garett T.", 
    "review_text": "Had to fend off reserving a whole table for a friend's birthday party from at least four different groups by myself while the others waited in the long line to get our drinks. Quite packed. At least we got liter size glasses to make up for it once they all arrived! Beer and cider were ehhh-okay, not worth my near-verbal sword fights for the table, though.", 
    "review_date": "2014-06-02"
  }, 
  "i9KBEfzbXMSg0rrCYNyVlQ": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Jiwon M.", 
    "review_text": "Okay beer but count me in on a sunny SF day!  I had huge expectations, Biergarten, because you're German.  Your Organic Wheat beer was a disappointment but I liked the easygoing environment.   Please surprise me with your dark beer next time! I'll be back!", 
    "review_date": "2014-08-17"
  }, 
  "DeNozkS0rQSRj6kSqf6XMQ": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Lawrence L.", 
    "review_text": "What a great spot for good German beer on tap and tasty pub food...  Went here on a cold foggy night and ordered up their dopplebock and hefeweizen along with pork belly sliders (small but delicious with tender pork belly and slaw), and bratwurst and curried potatoes.  They have blankets on every picnic table to warm up those cold bodies as well...  Fun casual atmosphere...  I can just imagine this place hopping in the day when the sun is actually shining.  Will be back (probably on a sunnier day).", 
    "review_date": "2013-07-22"
  }, 
  "Sfptoj3XVpb1ggNoT3kJmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Guillaume B.", 
    "review_text": "My favorite bar in sf. Great beer and sausage on a sunny afternoon. Now that's hard to beat!", 
    "review_date": "2013-12-16"
  }, 
  "7NAJgRTLbOknvc5RJ-5yRg": {
    "user_rating": 2.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Claire L.", 
    "review_text": "Let me just put it this way: no beer is worth an hour wait in line.  The food was good, but mostly heavy german style dishes with a lot of sausage and the like.  Sure the beer was good, but definitely not worth having to fight for a table, standing in line for literally an hour, and paying a premium for all of it to boot.  I won't be back.", 
    "review_date": "2013-09-09"
  }, 
  "qVKPE3u1AKFsAg40I9HXZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J C.", 
    "review_text": "Nice place to hang out and have a nice cold beer. However, there's always a line and can get very crowded. Also, you will get burnt since they don't have any shades or you will freeze because they don't have one of those oversized outside heater. Not very accommodating. Perhaps once you've had a glass or two, you won't really care anymore. One thing, I love their pretzels!", 
    "review_date": "2014-05-25"
  }, 
  "4Dp4k3MMcxg9rPtJ8iU9Ag": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ata N.", 
    "review_text": "Went there for lunch on a really nice warm day - it was awesome. Friendly attentive people, simple and quick food, good beer - what else do you need from a beergarden?  BTW their pretzels are to die for - make sure to order one (or two :)", 
    "review_date": "2012-02-08"
  }, 
  "0pb7fWD194iTqPMFAG5Oxg": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Paul C.", 
    "review_text": "Pretty impressed with Biergarten. The space is cool and reminds me of a slightly more antiseptic Zeitgeist. Their pretzels are very nice--warm and chewy but with a good taste. I'd imagine if I ate sausage they'd be pretty good too.  Taking credit cards is a big plus--though I wish they had a slightly larger selection of beers. There really don't have anything \"big\"--even the dark larger tastes more like a light ale than a porter.", 
    "review_date": "2011-12-19"
  }, 
  "Ci09Eo4ElA_NMDeMVzbJ8Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nate B.", 
    "review_text": "Beer + outside + pretzels = why havent you been yet?? If you're still hungry, stop by Suppernkuche up the street!", 
    "review_date": "2012-12-23"
  }, 
  "nd1Z0OCN5H6BaEr77HMLuA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "vlad k.", 
    "review_text": "this place was just ok.  was really excited to try it out, but i wasn't too impressed.  they didn't have too many beers to choose from.  why not just go to zeitgeist down the way?  also, we ordered this lemonade/beer concoction...  we thought it would be lemony... but really it ended up just tasting super sweet.  gross.  after just a couple sips we knew we didn't want any more and would be just trying to choke it down.  so, we took the beers back and asked for something else.  one of the people behind the counter looked appalled.. the other just looked extremely uncomfortable.  ummm, ok?  we just didn't like our drink, is that so weird?  because of the discomfort, while she was pouring our next beer, we said we could pay for the ones we didn't drink and we got a nervous laugh in response.  as we sat and drank our second beers, we wondered if we would actually be charged for the two beers we only took a sip of.  when we got our check, yup, we got charged for them.  seriously?  they couldn't just leave off the two *draft* beers we didn't drink?  most places, would just give you a  freebie.  i was pretty surprised.  i mean, they couldn't even have maybe left *one* of the beers off?!  in the end, we paid 30$ plus tip for just two beers.  honestly, if they had even say, given us 5$ off or *any* kind of gesture, i would have felt better.  but no.", 
    "review_date": "2011-12-29"
  }, 
  "ca3PcljTCw0DORwj5AKHaA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brent T.", 
    "review_text": "The concept is really cool and you really want to like it, but the line is ridiculous. We waited over an entire hour in line just to get beer. There are \"wait staff\" walking around but seems like they only deliver food and clean up, they do not deliver beer which is a huge miss for this location. If the wait staff were allowed to deliver beer people would be more inclined to hang around. It seems like over half the line got tired of waiting and just left (big loss of business for this location). The bar staff was extremely nice. We tried to host a birthday party here on a pretty weather day, but it was really hard to get people to stay because of the lines. We also tried to contact the management 3 times to this location and no one ever returned our calls (big disappointment) even if just to tell us they don't take reservations. As we live in the neighborhood, we really want this spot to be successful and think it should cater more to locals in the neighborhood. Good luck with this location as we're probably not coming back until the service and lines get better. We really want you to be successful in a way that it keeps us wanting to come back and bring other people into our super cool neighborhood.", 
    "review_date": "2012-05-13"
  }, 
  "tjScd5xMVw-t2-IbKLTDIA": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Dominic D.", 
    "review_text": "The food was tasty, the beer was good. The food took forever and *DISCLAIMER* there was no warning for how tiny the food is. I got a pretzel sandwich and my friend got a veggie burger... HA! What a joke. They looked like things that should be served at a tapas place... Not filling at all and despite its tastiness, not worth the money/the wait.", 
    "review_date": "2014-08-14"
  }, 
  "TBhOThtDs6uBIKvPJlSkJg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carolyn P.", 
    "review_text": "Beer was plentiful and the pretzels were awesome!  Only down side was a lack of wait staff and an abundance of bearded hipsters.  Cool out door spot in the city to go and chill with friends.", 
    "review_date": "2012-07-09"
  }, 
  "fHnAHkd0rNscAXlWpy7M9Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "One of my favorite bars in SF!  On a sunny day, this place can't be beat. It also reminds me of biergartens when I lived in Berlin. You order your food at the window and take it back to your communal picnic table. I always order litres or else I'd be made fun of. $16 for a litre of most beers and $8 for .5. They also bring in food from Suppenküche from down the street. That's a huge plus.  The only drawback is the huge line. Since the place opens at 3:00pm, the line usually wraps around the corner by 2:50pm. The longest part of getting your drink will be waiting in line. If you come closer to sunset (also when it's colder), you'll get your drinks faster. Good luck coming on a warm and sunny day ~ even though these are the best days to come.  Last but not least, the bathrooms are actually very nice for a bar. Surprising how they can repurpose old shipping containers to be so cool.", 
    "review_date": "2013-04-24"
  }, 
  "IcDn5f-a5mt7v3WnFBvOdg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Captain B.", 
    "review_text": "It's a shame that dogs are not allowed in an outdoor beer garden. Totally ridiculous.", 
    "review_date": "2012-07-22"
  }, 
  "4LKzJQi_PLchNXNrLbmxyw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aditya J.", 
    "review_text": "One of the few true outdoor places to drink in the city to enjoy some nice bavarian brews. For the most part its a pretty legit beer garden with great beer decent small bites and a nice place to hipster watch.   Their line system is of course, puts the TSA to shame. They really ought to fix that.", 
    "review_date": "2012-05-25"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "great place to spend a sunny day, but be prepared to wait in a long ass long for drinks!  they have radlers here and huge steins of beer, so it's pretty amazing.  if you go on a thurs night, off the grid is there too!", 
    "review_date": "2012-05-11"
  }, 
  "DYqrl-2nzFvE0KpdgmYyCg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K W.", 
    "review_text": "Really?? They serve beer in a parking lot void of any personality.  Your dog is not allowed on their outdoor parking lot and they recommend that you tie your dog up on the city sidewalk so you can see them through the chain link fence.  So lame.", 
    "review_date": "2012-02-11"
  }, 
  "5O3bu2s6T-bc84w6zIQT1Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A J.", 
    "review_text": "The pork belly sliders are the best I have eaten anywhere in the world.  The selection of wine and the rest of the food is meh....", 
    "review_date": "2012-07-30"
  }, 
  "fES_Ws1CDBUw7vcTJzr8CA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "I enjoyed my visit here yesterday for a very sunny Friday afternoon.  My friends and I weren't the only ones who finished their day early and decided to head here, however- seating was like a wrestling match and the line for beers is ridiculous, bordering on 30+ minutes.  Contrasted with absolutely NO line for their food, there is clearly an organizational/logistical/operational problem which this place needs to tackle in order to maximize their clearly popular concept.  The beer was great, the pretzels we chowed on were awesome- but the line and crowd will scare me off.  30 or more minutes in line for a $12 liter of beer? Sorry guys, fix this or I'll find somewhere else to blow my cash...", 
    "review_date": "2012-04-21"
  }, 
  "ucvTVzBMSGkLjzHqPdCM9A": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jonny A.", 
    "review_text": "Pickled deviled eggs.  I don't even like anything pickled or pickles but these were glorious. They had some kind of butter spread on top - pretty sure that's what made them as glorious as they were. Do not miss out on these.  Sidenote: first time ever having deviled eggs. I'm not ashamed to admit that, okay?!", 
    "review_date": "2012-12-10"
  }, 
  "3-Fdl-0rn3eE-ofvfoQqeA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joelle K.", 
    "review_text": "Went there with girlfriends. The beer was fine, the food was also fine but the ambience was not too enjoyable in the foggy chilly area like SF.", 
    "review_date": "2013-12-10"
  }, 
  "jiJzsDbf5vLRYiLU_5rLnQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas R.", 
    "review_text": "Great spot for an afternoon beer! Several good German selections on tap, some decent-looking food options (only had the pretzel, but there were other offerings), and a surprisingly nice ambiance for being made up of converted shipping containers and basic benches on asphalt. Friday crowd filled up pretty quickly after the 3pm opening, and the beer line never really got short- recommend an early arrival and ordering the 1L beers to minimize trips.  Hopefully other SF entrepreneurs will take note and create more spots like this- very convivial and fun.", 
    "review_date": "2011-10-21"
  }, 
  "rTKQb1xQwykzMzCdc973dQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason P.", 
    "review_text": "I like the conecpt of drinking outside (admirer of Zeitgeist).  They do sell half and full liter beers at reasonalbe prices.  It's still new so expect to wait on long lines but the turnover is pretty fast so by the time you get a beer/food, there will be a place to sit.  I must say, after ordering food with our beer, the cost skyrocketed.  The food is very expensive for what you get.  For the cost of aONE bratwurst and some sauerkraut, you can buy 2 packages of Aidelle's sausages (I'm just sayin').  Despite my 2 star rating, I will go back for the beer and ambience - but I will eat first.", 
    "review_date": "2011-11-02"
  }, 
  "UySLQuZU6SOuuMO4J74x7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven F.", 
    "review_text": "Outdoor drinking!  Gets very packed.  But it is a great social atmosphere with communal picnic bench seating.  Get:  The 1L Beer.  The line gets long and isn't that quick, so you want to minimize your visits.  Frankfurt Special - Skinny sausage on  a pretzel bun with a pile of sauerkraut, jalapeño slices, and mustard.", 
    "review_date": "2013-03-02"
  }, 
  "5O8fn99pTl2r72AfySA_9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsey K.", 
    "review_text": "This place is sooo fun! If you have not been yet, just go! It's literally a fenced in concrete area with a bunch of picnic tables and old shipping containers used as the vendor stands. Do not be alarmed, there may be a very long line to enter, but it moves a lot faster than you would expect. The beer is all so fresh and delectable. It is hard not to drink it so fast because it is so refreshing. There is a large assortment and varying sizes to choose from. I think my hubby chose liters. Aside from the beer, the pretzels are also delicious. Yum! I've heard the rest of the food is great as well. In addition to the eating and drinking, this is also the perfect spot to meet all sorts of people. Since long picnic tables are your only seating option, chances are you'll be sharing with strangers. We were there about five hours and it never got old.", 
    "review_date": "2014-06-23"
  }, 
  "WPBrjBbk76ZtZQ8QpG09cQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Henry L.", 
    "review_text": "Nice beergarden  This place seems to always have a long line, and for good reason--the vibe is really chill and the beer is good! Need you ask more?  Located literally in a park on the road, this place is hard to visit. The opening hours are very restrictive (2pm to 8pm for an alcohol place? that's crazy, like having a brunch place open at night!). We were there before the 2pm opening time and there was already a line waiting outside the gate. Wooot  Once the place opened, the inside was packed. All the benches were filled with people, and there was still a line outside. Even though there's a lot of folks in the house, the place is chill--folks everywhere are chatting, sipping beers, laughing, having a good time.  In terms of beer quality, the drinks are solid. You can get a large cup of 1L beer--nice. I got the brass monkey, which was a OJ mixed beer--pretty orangy :) Definitely recommend going for the 1L cup if you have a chance.  Will definitely visit again if I can somehow be there during opening hours!", 
    "review_date": "2015-01-18"
  }, 
  "jC5AmzkXDYxdxbosStlo7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie P.", 
    "review_text": "Awesome!!! Seriously felt like I was in Germany. I had the wheat beer and we shared some food: a regular pretzel, sunflower pretzel, and the pork belly sliders. All the food was yummy and they have specials every day too. Really diligent staff that was always walking around picking up empty glasses, food trays, and offering blankets. What a cool concept. This is a good place to take visitors.", 
    "review_date": "2012-08-24"
  }, 
  "FIDPP65G4FxtZfqt5HwWWg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine S.", 
    "review_text": "Big sister Suppenkuche serves traditional German food and a good selection of alcohol. Like older siblings, Suppenkuche has that confidence that no one tries to mess with. And it shows because there's always a line! (Minimum wait on a Saturday night is 1 hour.) They've perfected keeping people happy, and you can tell with the solid four star rating with 2,500 reviews!  Little sister Biergarten is a little similar, yet has its own flair. (Younger siblings were always a little more rebellious, right?) It's outdoors and fenced around. Pro-tip: you order the food and beer, and your friend grabs a table. When the weather is nice, you bet all the tables are taken!   - Beers come in half liters or liters. Go big or go home! - Food was good and reasonably priced. The pork belly sliders were yummy! - No \"real\" service - they bring out your food and clear the table. - There's a park right in front, and Smitten is just around the corner. - Wed-Sat 2-8pm. Sun 1-7pm.  This place is just like a little sister - carefree, easy going, and fun! Cheers!", 
    "review_date": "2015-01-14"
  }, 
  "9nHUuynPPe249rHJSPhv2A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serinda O.", 
    "review_text": "It's closed on Tuesdays, which is one of my days off, so it sucks that I can't come here on that day.   I've only had beer here, it's a place where we either stop by before or after dinner.   It's outside, right across from a play area so if you have kids, you can definitely dump them there and pop into Biergarten for a drink (I actually suggested this to a friend and he said it was a good idea, but he never did it.)  When it gets cold you can use one of the blankets that they offer but it's itchy and who knows who's been using it, so I really suggest you bring your own to use if you are anticipating the weather to be cold.", 
    "review_date": "2014-03-26"
  }, 
  "qmen9LSJNO5uuT72NV_tGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark R.", 
    "review_text": "1 liter Radler (shandy), huge bratwurst, kraut, mustard .. so awesome. There's not much protection from the heat or cold (it's SF the weather changes quickly) but this place is great. It's first come first serve, order at the counter and then sit at communal picnic tables. Be ready to wait it's usually pretty busy here and for good reason.", 
    "review_date": "2013-06-21"
  }, 
  "1rQMqmHC_YAzvtap-GfzUg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Donna J.", 
    "review_text": "Came on a Sunday afternoon, had no problem getting a table. We actually switched because the guys we were sharing the first one with were geeking out over some HTML writing and the \"hella\" was slowly driving me to implosion. We quickly found someplace else to sit and then shortly after that, the older woman working sat an obviously lost couple at the end of the table. I thought it was kinda cool that they help you sit if you're a shy newbie.  The beers are nothing to write home about. They don't have many... about 13-15 available, but I enjoyed my light beer, my husband enjoyed his dark beer and my friends chugged their gigantic ones. We're from LA, where people don't do communal, so it was nice just to sit and BE with other people--- I noticed a distinct diversity in ages, races, orientations, families, etc. Also, people actually spoke to each other... rather than getting lost in their cell phones. Wonderful to see.  Fun way to spend a couple of hours and great for those new to SF. If I lived here, I'd definitely come back and bring out-of-towners.", 
    "review_date": "2013-08-28"
  }, 
  "zGSnyzu6ntVm2h5yqiTOUw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "O-ver-ra-ted! *clap-clap-clapclapclap*  Biergarten does not suck.  But there are better restaurants and bars for ambience, beer selection/quality, and food quality that don't have the:   *long waits (plural: long wait to get in, long waits for beers/food)   *high prices that make Biergarten very avoidable.  Staff are cool, as were the most of the other patrons.", 
    "review_date": "2011-10-31"
  }, 
  "pwlWt2yHIoo0fv7LLoTw9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn L.", 
    "review_text": "Pros: delicious beer, good food, cool mugs, sun!, chill atmosphere. Cons: long line for food/beer and expensive  We went there on a Sunday afternoon. They open at 1:00 so we got there at 1:15 ish to get a picnic table. You definitely need to get there by 1:30 if you want a table. The line for beer/food at that time was about a 10 minute wait. There is only one line and one bar. The line later in the day got to be about 25 minutes. The first time we got small beers ($8) because we were afraid the big ones would get warm. Second time around we got the large beers ($16) and dealt with the warming of the beer under the lovely sun.  Will definitely we back on the next warm, sunny day.", 
    "review_date": "2014-02-17"
  }, 
  "sByGGOqRMHxxexwkzPCJcA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah Z.", 
    "review_text": "This place just opened so I'm cutting them some slack because:  1.) I love the concept and applaud them for getting this off  the ground  2.) I think they will work out the kinks  3.) I hope this will create opportunities for more restaurants/bars like this one  We arrived right at 3pm when the Biergarten opened and waited in line for about 30 minutes to get in, then waited another 20-30 minutes for a beer and a pretzel.  Kind of a long wait, but the place is new and I'm hoping they will work out a better way to handle the flow of people in/out/serving beers.  The staff was beyond friendly and a bit apologetic about getting things going with the new space.  Totally understandable.  The beers were big and delicious and the pretzels really hit the spot.  I did not have a sausage, but will definitely go back for one.    It's not uber cheap (two giant beers came to approx. $21) but I guess that's just what giant beers go for in Hayes Valley.    The atmosphere is still a little bleak - it's basically a chain link fence around a parking lot with picnic tables and a few trees for shade.  However, it looks like vines are being grown on the fence and the trees will fill out.  Lots of potential!", 
    "review_date": "2011-10-24"
  }, 
  "ibSIRYjrJG2oaLHDL2fhog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tysen C.", 
    "review_text": "Biergarten is super yummy! The beer is great and served in large quantities and the food is delicious.   I'm a huge fan of the meat and cheese pretzel knots. Oh and the bratwurst is so good --- the mustard and sauerkraut served with it is fantastic. Also, homemade pickles and pickled carrots and the horseradish...drooling just thinking about it.   Spend some time outside and enjoy what Beirgarten has to offer. I challenge you to not have a good time :P   Next stop is the sister restaurant Suppenküche.", 
    "review_date": "2012-12-22"
  }, 
  "SRz0Q-tsPd1SU8bvFi_ToA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darin E.", 
    "review_text": "Heaven on Earth.  btw- you want a \"whiniest bitches in SF list\"?  Read the reviews that give this place 1 star.  They all need to be checked.    Long lines....whhhhhaaaaah!   No dogs allowed........whhhhaaaaaah!    Too busy......whhhhhhhaaaah!    People in this city have no backbone.", 
    "review_date": "2012-09-07"
  }, 
  "xXOslATLpvnZXx03pQFovg": {
    "user_rating": 2.0, 
    "user_location": "Eastern Malibu, CA", 
    "user_name": "CJ J.", 
    "review_text": "One and done. The beer is too expensive, the waiters are not nice, and the kimchi hot dog was not very tasty. The only draw is the atmosphere, but it is still not enough to get me to come back. The beer was good, but I recommend the sangria at Fly.  P.s. They don't serve Keystone", 
    "review_date": "2014-12-06"
  }, 
  "YReDScLBqPQSStal5Pcs8g": {
    "user_rating": 4.0, 
    "user_location": "Saint Clair Shores, MI", 
    "user_name": "RJ S.", 
    "review_text": "What an excellent place! The bier is great! The food looked good (I'd had lunch before I found this place). I loved the vibe! The place was packed &amp; I could see why. Biergarten's are great for meeting other people due to the communal seating which is cool if you are a visitor. Clean &amp; neat &amp; a very friendly staff. Prost!", 
    "review_date": "2014-05-16"
  }, 
  "Ic6-gs1_FjrWGx6JIr95Mw": {
    "user_rating": 4.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Amanda J.", 
    "review_text": "Celebrating a sunny and warm day at the Biergarten would be a normal thing to do.  My only experience at the Biergarten was when it was chilly and an hour before closing on a week night.  However, I really loved it!  They were completely out of food, which is a huge pet peeve of mine when going out, but we had no problem getting beer.  You can choose between a liter and a half liter.  Plus, If you come at night, there is a much shorter line, and there are wool blankets to keep you warm.  The selection isn't massive, but what they are serving is delicious.  I had the Schneider Weisse, and it was my favorite beer ever.  It had hints of banana and some spices, and I would totally recommend it.  It's a darker color, but it does not taste like it at all.  I tried sips of two other things as well that were good, but I have no idea what they were.    What really warmed my heat over was that they have Almdudler.  I spent an entire summer in Austria and drank SO MUCH Almdudler.  While it's a bit more expensive than the home country, it was nice to see some non-alcoholic beverages with the German theme as well.", 
    "review_date": "2013-09-08"
  }, 
  "mD3YEkX-fjVX738o11O0kg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Talya C.", 
    "review_text": "Whether you're a local or just visiting SF, Biergarten is not to be missed! Ideal place for a \"sunday funday\" boozy lunch or just want feel like it's Octoberfest year round.  FOOD: Who doesn't love pretzels and beer?! If you are a weirdo who doesn't like beer, wine is also available for 6 bucks a cup (literally served in a cup). I recommend a liter of Munich Gold ($14) and a cheese knot (like a grilled cheese with shallots on an amazing fresh pretzel roll, $6) Lactose intolerant? Get the frankfurter on an equally amazing fresh pretzel bun with a sour kraut topper and spicy brown mustard-heaven! Anything you order will be delicious. Even if you are allergic to calories and order a kale salad-still awesome!!   SETTING: Outdoor wooden benches situated in what looks like a parking lot with a chain link fence around it. Everything is served out of grey boxy bungalows and gives it a very industrial vibe. When the sun goes down and the temp drops, they have blankets available for those unprepared for SF weather. So thoughtful!   TIPS: Bring money for the meter (they charge on Sundays now) and a deck of cards for fun drinking games if the conversation is lacking. Get there early! By 2pm, the line tends to extend past the gates and seating will be hard to come by as people like to camp out for the afternoon.", 
    "review_date": "2013-01-28"
  }, 
  "x2-TP8fd4G0OqkgDyKt3IA": {
    "user_rating": 4.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Elaine N.", 
    "review_text": "An outdoor biergarten is like something straight out of a movie. Legally drinking in the outdoors in the middle of the city is such a great idea!! Why couldn't I think of this...  Anyway, I've only been here twice, and both times were great. I've tried the Frankziskaner $6 and Weiheinstephaner $6. Pretty standard pricing. I've also tried a few dishes - Pickled plate - I had no idea ginger can be pickled, same with carrots, garlic, and a few other things. Frankfurter - yummy sausage served with sauerkraut and a house dijon mustard. Pork Risette dish - which is served on pieces of toast and topped with mustard seeds and chopped chives. Everything was delicious and great for an afternoon snack/early dinner.   If you ever have the chance to stop by Biergarten be sure to dressed in layers, the restaurant does have blankets out for the customers, but you never know with the bipolar SF weather. Cheers!", 
    "review_date": "2013-01-27"
  }, 
  "TLdtuZm6Ms0V22I6htXBaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K V.", 
    "review_text": "When SF weather is favorable, this is an awesome place to hang out with friends + beers. It's lively, clean, and open. They have a limited food menu, but everything we tried was surprisingly delicious-- especially the cheese knot, egg salad, and pork sliders.  It may seem crowded, but people are always coming and going so getting a table just requires a little patience. There are also very clean restrooms for use. Heat lamps would be nice because it gets cold so quickly.", 
    "review_date": "2012-07-21"
  }, 
  "n2-zPkdWd7Y_zwOjwkCtnQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine U.", 
    "review_text": "Good beers, good atmosphere, and great neighborhood to hangout.", 
    "review_date": "2015-01-21"
  }, 
  "IfanXVYDpduyvMEi7-A-bw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex H.", 
    "review_text": "Came here on a beautiful SF winter day.  Got a liter of beer with my bro (actual brother), and sat down next to some people.   Ordered a pretzel with horseradish and mustard.  Eating horse radish feels like an inverted punch to the nose, coming from inside your head, and it really hit me good.  I love horseradish, and the stuff here was like the Falcon punch (super smash bros reference) of horseradish.  The mustard has the kick of a horse too.  They have blankets here for the cold.  Don't fear the long line, it's actually a good thing.  After you finish your first liter, your party can get up, go get some more liters, and find a new crowd to sit around.  It means you get to meet more people and get some different views on the beer garden.  This place is all about socializing.  While we were there, a wedding party decided to roll in and take pictures.  I'm not sure why you'd want to take pictures on your wedding day surrounded by random drunk people, but maybe you're into that kind of thing.  Everyone was clapping for them, but I had no idea who they were.  For all we know it could have been an elaborate street performance.  All in all, Biergarten is a good time.  It supplies you with a rich crowd and a social environment, and big beer to get you nice and saucy (OR BLOATED, but that's just me, right?).", 
    "review_date": "2013-04-01"
  }, 
  "f64QFd02f_s9zhNMleePSQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jessica M.", 
    "review_text": "Love the Biergarten! Great Beer and snacks. I love coming here for a drink, such a cool atmosphere and the cargo bins just work!", 
    "review_date": "2013-12-08"
  }, 
  "VpRouMPIQfycx3bTnIbuaw": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Ray Z.", 
    "review_text": "Got there on a Saturday at 6:30 PM. The line to buy your drink was long. Took about 20-30 minutes. Good German beer at a decent price. I had friends there already so I didn't have to find a seat, but from what I noticed, it's not that hard to get a seat around the time that I went even though the line to buy beer took a while.  One thing though: it was hella cold! They give out some thick fleece/woolish blankets once the sun starts to set. However, they may feel kind of grimey as you do not know who else used the them and how often they were washed.  Some heat lamps would've definitely made the experience 1 star better", 
    "review_date": "2014-03-16"
  }, 
  "ma3r4D8KZ0Ksjpv-sU0QJw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie G.", 
    "review_text": "This beer garden is awesome! It's basically a bunch of wooden picnic tables right in the middle of Hayes Valley, enclosed by a fence, so you can people-watch, or people can watch you drink your ginormous 1L beers.   They have a great selection of German beers, and their pretzel (comes with mustard and horse radish) is so soft and delicious! This is a cool place to hang out with friends and grab a beer, or more like 3 (=1 liter). You could get less than 1 liter, but where's the fun in that? Smitten is also right next to this place so you can grab some ice cream after!   But GET HERE EARLY, like before-it-opens-early because I guarantee you will wait forever in line. We waited 30 minutes before it opened and there were people in front of us who took all the shaded benches already, which was the reason for my sunburn this weekend.", 
    "review_date": "2013-07-03"
  }, 
  "X4KWGuzlDtkE4tjKwXyszA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Sergey R.", 
    "review_text": "Just get your  stein of good beer and enjoy! Awesome place to have couple good beers with good friends. The place always looked packed - but somehow we always managed to find a spot for a group of 4-6 ppl. You will be sharing long tables, that's expected. All seating is outside - and they provide blankets if beer does not keep you warm enough.   One wish - expand collection of pilsners and get more food choices.", 
    "review_date": "2014-07-08"
  }, 
  "Bo1QKbB_zkvNhT_4ngsVyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam B.", 
    "review_text": "Hit the Biergarten yesterday after work around six.  No line to get in but the beer line was about five minutes.  The Swaztenbier was awesome in a great big stein and the brat was delicious.  You don't get a bun, but the hot horseradish and spicy mustard along with the sauerkraut make a meal.  The grey shipping container facilities gives the place an industrial \"Sprokets\" ambiance, but the bathrooms are roomy and clean.  Nice work!", 
    "review_date": "2011-10-27"
  }, 
  "jXEo83-Cm6SlgiCgFbF7KQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Carolyn N.", 
    "review_text": "Beer -- good but they ran out of one kind.  They only have 3 kinds!  Also, it was expensive.  The smaller size of beer (which is still plenty big) is $8.  The large size is $15.    I shared a large beer with my boyfriend and a brat basket, which is two bratwursts and one \"pretzel\" (pretty small if you ask me) for $18.  Two hotdogs and a ball of bread for nearly $20?  Luckily we weren't too hungry.  I wouldn't order this dish again.  The sauerkraut was good . . .   Best thing about this place is the outdoor tables.  It has cute white lights that brighten it up at night and give it a fun atmosphere.  It was pretty busy for a Wednesday when I went.  Crowd was late 20s.  I would go back here only for the beer, not for the food.  But it is a unique option when Suppenkuche is too busy to seat you.  And, they bring the food to the table (they give you a number when you order) which is a nice touch.", 
    "review_date": "2011-10-27"
  }, 
  "EhIolH5byA5_IO7VVZyAPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett B.", 
    "review_text": "Decent selection of beers and friendly staff to tell you about each. It can get really crowded, but is definitely worth waiting for on a sunny day.", 
    "review_date": "2013-03-23"
  }, 
  "2Qfa3o72sq04_MCUxy3Shg": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Emily D.", 
    "review_text": "Its awesome! But how could authentic German beer be bad, really? Ok, well, the one caveat-- there were babies here. Babies at a bar? Not the best idea.  BUT THEIR SAUSAGE! OMG. BEST BRATWURST I'VE HAD IN THE CITY! And I go for sausage quite a bit.   Fun fact- don't come here on a tuesday. Despite the fact Yelp says they're open, they aren't, and you and your roommate will be pissed you're standing around outside a chain link fence and dirt area sans beer. True story.", 
    "review_date": "2011-10-27"
  }, 
  "IhVTv8VJyCDPVyFvXEloKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi K.", 
    "review_text": "I've been there three times now and this place is HAPPENING!!!! I love the outdoor seating! You get a blankie too if it gets too cold and the long tables will help you make new friends easily.  Beer, beer, and more beer is all I can say! It's always crowded and lively! Such a fun spot to go to with a group of friends! It will def make you feel like you're in Germany!", 
    "review_date": "2012-03-01"
  }, 
  "eUveCtSdyOT4zbLIQZ_yIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jojo H.", 
    "review_text": "Day drinking outdoors? Christmas lights and blankets after dark? I'm down.   German bier on tap and friendly staff to explain every eccentricity and flavor profile. Bathrooms in an adjacent shipping container are always a plus.", 
    "review_date": "2013-07-24"
  }, 
  "WKPTh4UmEqXR8TRAp1g2CA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johanna S.", 
    "review_text": "Beer, brats and blankets to keep you warm. Great spot. Food was good and who doesn't like a liter of cola...I mean beer. Only minus- can't bring the dogs in.", 
    "review_date": "2011-12-12"
  }, 
  "d89lRBtRUBqJSCttUXvQTg": {
    "user_rating": 5.0, 
    "user_location": "Saint Paul, MN", 
    "user_name": "Adam W.", 
    "review_text": "I am in love with the fact that a place like this exists.  It was so nice to walk up, order a fresh cold German beer and hang out with like minded folks.  Staff are super-friendly as well.  Be warned: shade is a limited commodity here.", 
    "review_date": "2014-07-21"
  }, 
  "hvjhcPOG8zuqqLOohDKBmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becky Q.", 
    "review_text": "We were exploring Hayes Valley and stumbled onto this fenced off section known as the Biergarten. There were plenty of benches all in which many different parties were sharing. You place your order at a counter that is made out of a large storage shed. I thought that this gave the establishment a unique characteristic. The menu is listed alongside the shed with a list of at least 10 biers as well as small tapa dishes like pretzels, pickles, and sausages in a mini plastic basket.    They offer you number placards for your order and deliver food to your table. Its a gorgeous place to relax on a sunny day. Of course, when ever I can, I order the .5 Liter of Radler (lemon flavored beer).    The enclosed area is very neat and tidy. Definitely another neighborhood gem.", 
    "review_date": "2013-01-22"
  }, 
  "9DhCT_2yEpIqAHVBXcecOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather W.", 
    "review_text": "This is exactly what you hope for and expect at a limited hours outdoor beer-drinking venue. It's roots are clearly German, offering schnitzel and steins of German beers with soft pretzels and artisan mustard, however it's spirit is clearly influenced by the happy-go-lucky drinking mentality of San Francisco that just so happens to have the limited days and hours of whenever it feels like and early.  Great spot, wish it was more available to people in the industry or people who don't go to bed at 8pm.", 
    "review_date": "2012-12-12"
  }, 
  "sCiWf7Kai0t-x25CAz2DEQ": {
    "user_rating": 4.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Leslie P.", 
    "review_text": "Afternoon snack/meal brought the three of us here. We ordered the trio of salad, meat sandwich, beef tongue sliders, two pop and a beer.   The salad consisted of kraut, roasted beets, and potato salads. I'm usually not a fan of potato salad, but this one was delicious! The beet salad was awesome as well and you can't do wrong with kraut. The sandwich was salami and kraut in between a halved soft pretzel. This was great as well. The pretzel was amazingly soft. We wanted to order just a pretzel, but we were full. I didn't try the sliders, but I heard they were scrumptious too!  Overall a great outdoor eatery in Hayes Valley. I loved the environment and atmosphere", 
    "review_date": "2012-07-26"
  }, 
  "G8XOXaa0CRsMyv-n_zReUw": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Anthony C.", 
    "review_text": "Mmmm... Bier and pretzels! It doesn't get  any better than this! I had the fort point red which was on point! The gf got the organic Weiss which was extra good!!! This is a beautiful little spot, with lots of cool ppl to watch... Everyone is so up beat and happy! Feel like I'm in the pharell because I'm happy video!", 
    "review_date": "2014-07-12"
  }, 
  "RGMVCOdS4KwUGJVRHqNLXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob L.", 
    "review_text": "Can't go wrong here... Great beer of course. Just the right temperature. They have a liter of beer and it's humongous!  The outdoor patio is perfect to meet new people especially after a few beers. I've tried different variations of wurst and they're all delicious. Next time I'll be tried the sliders or the burger. Great place to hang out in Hayes especially in good Indian Summer days in SF!", 
    "review_date": "2014-10-04"
  }, 
  "PvX64Pdmx-9WFBSuWrRuxg": {
    "user_rating": 2.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Pat W.", 
    "review_text": "A blacktop surrounded by a chain-link fence? Is that your idea of a biergarten? Spend one day at a biergarten in Germany, and this place looks like a cheap attempt to attract a hipster crowd. But I wouldn't be writing this review if it weren't for the fact that you could not bring outside food in. You have two food trucks and some picnic tables, let a man eat his Ike's sandwich in peace!", 
    "review_date": "2014-10-19"
  }, 
  "xaSLaLcDdmnlSvLPI6-PNA": {
    "user_rating": 4.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "J S.", 
    "review_text": "A German beer garden is something of a novelty here in SF, which explains why it was so crowded on an overcast Saturday afternoon in March.   If you can get past the crowds and grab a table then this is a pretty cool place to drink the day away. The beer is good (and comes in steins) and everybody seemed good natured and relaxed. Apparently the food is really good too.", 
    "review_date": "2013-04-07"
  }, 
  "h0kDxnRpBXyJ1v17uSDnzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan C.", 
    "review_text": "Went to our neighborhood pop-up pub with some friends and all the children.  Waited in line for about 10 which was fine because the weather was gorgeous and it was fairly easy to find a table albeit shared with another couple but why not?  Always fun doing things communal.  My 7 month old, (yes, I brought the baby to a pub) was totally enjoying all the surrounding attention and the sound his wooden spoon made on the picnic table.   Had a dark ale and the Wednesday burger special (divine) while my hubbs had some sort of mushroom cheese bread and the beets.  Why are pickled things so tasty?  Our friends woofed down the pretzels and sausage and the kiddos had pork sliders. All in all, perfect early dinner place and easy going vibe.  This is another reason why I love living in Hayes.", 
    "review_date": "2013-07-25"
  }, 
  "t5ZwpcQNvFZC1TwTxjiNUQ": {
    "user_rating": 5.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Charlene P.", 
    "review_text": "This is such a great idea!  Outdoor socializing with beer and snacks.  On cold days/nights, they offer blankets to keep you nice and warm.  I've been here a couple times.  The first time I came here, they had a german band in costume which was pretty cool.  They offer a nice selection of beer on tap and some in bottle and a good selection of snacks.  You can choose either a 1/2 Liter or 1 Liter of beer.  As for snacks, I especially love the pretzel.  It's warm and soft and served with mustard.  Perfect combo with a nice glass of Schneider Weisse.  The second time I came here, the pretzel/bread maker happened to be on vacation so we were pretty bummed.  Hopefully the next time I visit, there will be pretzels with my beer!", 
    "review_date": "2013-03-25"
  }, 
  "b0lXNnfnZpKPv7xNwpG3Ig": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jen C.", 
    "review_text": "Cool Concept (5stars) + Long long long long line for beer and food (2stars) + Only 3 beer choices (3stars) + Girl dispensing beer didn't go a good job, half of stein was head (2stars) + Delicious Sauerkraut (5stars) + Pricey food (3stars) + hard to find coed Porta-potty (1star) = somehow this averages to 3 stars!  BTW, is anyone willing to go here on a rainy day???", 
    "review_date": "2011-11-01"
  }, 
  "PKPt-PE4BMQ0ZHuGnXulAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher L.", 
    "review_text": "Didn't know about this place till my friend told me about it..always passed it while getting off the freeway at Octavia.   It was a pretty nice day in San Francisco. Came to Biergarten right when it opened. There was a line already formed. One of the workers was checking ID's at the gate and giving everyone wristbands.  Ordered some beer I couldn't pronounce. 1 Liter for about $10. They had picnic tables all around. Pretty nice hangout spot to drink beer and chat", 
    "review_date": "2012-07-28"
  }, 
  "Eypq5gLLjCapBVVnMw_MyA": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Misha T.", 
    "review_text": "There is just something exceedingly nice about being able to drink outside. Especially when it's out of really enormous mugs ::steins!:: filled with delicious refreshing German beer. There are some pils, some weiss beers, and a dark one to get you going.   They also serve some food. We had the seeded pretzels which come studded with sunflower seeds with some mustard for dipping. The pretzels were tender and pretty great. We also had some brats with sauerkraut and I must say I was impressed by their quality. I've eaten a lot of brats in my day and these were pretty fantastic.  The line can be a pain but if you get there early it's not bad. Now go an enjoy the remaining days of SF indian summer we have.", 
    "review_date": "2011-10-22"
  }, 
  "zXynZ1Gvr9Bkqz5mJDaLEQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Kevin N.", 
    "review_text": "We walked by here on the way to Smitten's across the street and knew that we had to check this place out. It's an old parking lot decked out with shipping containers that have been converted into food/beverage stands.  I had the Hefeweizen. My friend ordered some deviled eggs, along with a small bottle of some novelty German drink called Underberg. I have to say that Underberg is probably one of the nastiest drinks I've ever tried, it tasted like an alcoholic version of some potent Chinese herbal medicine. The eggs were dyed a bright, artificial pink, not too sure what the point of this was aside from wow factor. They were darn tasty though. Beer was good as well.  It's always nice to be able to enjoy beer outside, although it was pretty chilly that day. We did notice that the employees were handing out blankets to whoever wanted to bundle up some more. Very thoughtful.", 
    "review_date": "2012-11-20"
  }, 
  "QeBWmKeUBzVd_2m6Zeq10w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carla G.", 
    "review_text": "What's good: drinking in the sunshine, pink deviled eggs, getting slightly buzzed and ordering in an obnoxoious fake German accent and annoying the shit out of the nice hipster wait staff. Hipster mustache bingo.   Why I won't go back soon:  45 minutes in line for a beer. Das ist nicht gil. Das ist shit man.", 
    "review_date": "2012-05-14"
  }, 
  "Kr9sA9gKISX5i8WN4_nXcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "George M.", 
    "review_text": "if the weather is nice, then this is a great place to come and hang out...the beer selection could grow, they only had 3 types of beers when we went, but they were pretty good. We had the tacos...which seem an odd choice for a beer garden, but they were actually delicious.  The place seems to always be crowded, so finding a seat may be a bit of a challenge sometimes, but definitely a place worth checking out.", 
    "review_date": "2013-12-13"
  }, 
  "WXVZtXqjgHtueNIBniwjqg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristen F.", 
    "review_text": "the staff here sucks. at least on the night i came with my cousin and the place was empty. (1/18 or 1/19)  i'm sure its a little more reasonable to be a bit short and snide when the place is packed and its super busy but on a quiet night, be nice!! the person pouring my beer was fine, but the ladies patrolling around the place like it was a catholic school playground was obnoxious. i was scared my hand was gonna get slapped with a ruler if i didn't drink my beer fast enough. it was 7:30 and I ordered a beer and pretzel, my 20 year old cousin had a non alcoholic lemonaid. i had no idea they closed at 8 pm, just arrived from nyc. maybe you should tell me as i order my beer, just so you know we are closing soon but please enjoy your beer. i pulled out a napkin and an extra one fell on the table. lady comes over and fixes the display. really? i am half way through my pretzel and lady comes by and the napkin stand with utensils is taken away. my pretzel is finished- which tastes excellent, but i am still eating those yummy seeds that fell off and she takes away my basket. don't touch my plate!! ugh!! i would come again if it was amazing sunny day and it was so crowded i wouldnt notice the attitude that exudes from the ladies on staff. lighten up and let people enjoy its a freakin beer garden!", 
    "review_date": "2012-02-04"
  }, 
  "le8Ez2XRHspLqxKAS59jeQ": {
    "user_rating": 2.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "William F.", 
    "review_text": "The place is basically five shipping containers and a fenced in lot.  The beer was good but VERY pricey.  The food was good but VERY pricey.  ALL seating is outside.  ALL picnic tables to be shared with whoever wants/needs a table.  No roofs over any tables.  Reminds me of the story of \"The Emperor Has No Clothes\".  If the food and drink was cheaper, I'd give them a better review.  I spent $70 on two 1 liter beers, one cider and one order of sausage and potatoes and tip.  To me, that's pricey.  The place looks and feels like a prison yard with the chain link fence.  Don't get caught up in the hype.  There are places that MUST be just as good with better ambiance, food and beer for cheaper.  Skip it!", 
    "review_date": "2013-10-19"
  }, 
  "qqKddLtLxbPnTf6c7yqS3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "around town e.", 
    "review_text": "New favorite place to go with friends on those rare sunny sf days.", 
    "review_date": "2012-06-02"
  }, 
  "MBQlD-rwvSb8Dtfw5I2_xA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin L.", 
    "review_text": "Spent a lot of time standing in line for a beer whilst discussing San Franciscans predilection for standing in lines. Some places in this fair city are worth the wait -- Tartine and Bi-Rite Creamery come to mind -- but Biergarten is not one of them. While those other establishments create a product that is simply superior to other offerings in the city, Biergarten serves a limited selection of mediocre beer (it is German, after all) and good (not great) food. Special shout out to the delightfully pickled deviled eggs, and the pretzels are legit, but it's tough to justify some of the prices for the other menu items.  I do really like the aesthetic of this place. Some people might get turned off because they feel like they're drinking beer in what amounts to a glorified parking lot, but I think it has an inviting, urban park charm. It benefits from a thoughtful, modern industrial architecture where the kitchen, bar, and bathrooms are all built in giant gray shipping containers (very cool), the tables are simple and sturdy, and the openness of the space affords ample people watching.   But man, that line! Would you go to a bar if I told you that you had to wait thirty minutes every time you wanted another beer? I doubt it. The food is better than the beers at this place, and the food line is generally short and easy to navigate, but you want your beer to keep flowing if you're settling in for an afternoon at a place like this, and it just doesn't. Some reviewers think it's a glaring operational problem, but I'm quite sure the management likes it the way it is. Why would they feel the need to change their service style if there is a never ending 30+ minute line full of patrons willing to wait it out? It undoubtedly creates turnover at the tables and helps to keep customers drunkenness levels in check.   I love outdoor day drinking as much as the next guy, and there is obviously serious demand at this place. I just think I'll take my talents to someplace like Zeitgest or Lucky 13 instead and head back to order my second (much tastier) beer from the bar as quickly as it would take you to get one less flavorful offering from Biergarten. That line is for suckers.", 
    "review_date": "2012-05-13"
  }, 
  "91YfQoC9Np0Dj6UaSpX2Rw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gaurav A.", 
    "review_text": "2 stars for the location and the fun casual ambiance.  For a beer garden, they only had 4-5 options on tap, which sucked. The snack options are limited but taste good, based on the couple of things we ordered.", 
    "review_date": "2014-06-26"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Tell me why.  One reason why Germany's Paul Van Dyk is awesome: <a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D2mCQEM3FugM&amp;s=d9d5723a6642001b7eaff58e60856dbdd78756c81ae52e98bf5859325af249e5\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=2mCQ…</a>  Few reasons why German Biergarten is awesome: Excellent homemade veggie sliders, delicious beet salad and a full of flavor (and sauerkraut) bratwurst on a pretzel roll.  Plus homemade pickles and a Weihenstephaner lager so light and easy to drink that there was a bit of regret on this warm(ish) July night for not getting the large size.  Much like a packed PVD show get ready to be close with your neighbors as seating is all at communal tables. Atmosphere is lively but not too loud.  At roughly $25 a person this will not be a cheap excursion. But like a really good DJ experience a really good dining experience shouldn't be either.  Enjoy finding your own reasons for giving four stars.", 
    "review_date": "2014-07-25"
  }, 
  "1J-CWvcyB8FDmyZ_GEmvpw": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Andrew C.", 
    "review_text": "We came on a Sunday afternoon at around 1pm when they opened. Soon after, all the tables filled up and the lineup for beer and food reached 45 minutes.   Food: curry wurst / bratwurst were delicious. Had the wheat beer too which was pretty good. Overall, pretty decent.   Setting: picnic bench-type seating with no overhead shading. Bring sunblock or cover up. Lots of us got burned.  There are two separate washrooms for men and women though I was told there's a urinal in the women's washroom.   Summary: prepare to wait. Bring sunblock. Go early for a table.", 
    "review_date": "2014-05-13"
  }, 
  "wXaAnWNnFDjx-jfHiSEEig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew W.", 
    "review_text": "Good, cold German beer, outdoors in the sunshine?  What could be better?  My only gripe - the lengthy wait to actually get a beer...45 minutes!  But at the end it was definitely worth it...just make sure you get enough to tide you over, unless you want to get back in line and wait to get the second round.", 
    "review_date": "2012-05-13"
  }, 
  "vF9C7jqC2uPkBfTiecUeuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kori M.", 
    "review_text": "Since this city seems to have a huge lack of restaurants/bars with nice outdoor patios, this place is a little gem in my opinion. With giant tables (that are to be shared with strangers and friends alike) overlooking the small park in Hayes Valley, the Biergarten makes a perfect destination for a sunny afternoon.  After dark, they turn on the hanging lights above. This would give the place a romantic atmosphere, if it weren't for people shouting \"chug, chug, chug!!!\" around you.   Yes, the line to the bar can get a little long, but use that time to make a new friends with some of the folks waiting there with you. Once you order, don't forget to grab a pretzel or bratwurst basket to go with your with a tasty beverage.", 
    "review_date": "2012-02-29"
  }, 
  "bMZYSJTOEB5zOknVA2btGA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah M.", 
    "review_text": "I wanted to like this place but in the end was disappointed. Over priced. Long lines. Hot beer. Hard to find a place to sit. Point blank - go somewhere else!", 
    "review_date": "2014-06-29"
  }, 
  "u5GdkFvaYXVLCpcPl3NIAg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cody c.", 
    "review_text": "The idea is great but execution is poor. The beer is the best part, quality beer and you can get a liter glass, great!  But with only 4 taps operated by 2 servers the line quickly gets crazy and makes a 35min wait for a beer.   They need to have 4 times the number of taps and servers.  While the beer line is long and snaking outside, the food line is non-existent. Then there is a poor decision that all food must be ordered from the bar (the big line). BUT somehow you can pay cash and get a pretzel. Huh?!?!  One should be able to order food from the food cart without having to do it through the bar. Thats just plain silly.  I want to like this place but management needs to get their act together cause otherwise its a poor experience.", 
    "review_date": "2012-01-08"
  }, 
  "97BHRNfBqubPqisKmj46Ww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clark G.", 
    "review_text": "fun time to eat/drink with old friends and make new ones  waited out the line til opening which seems to be the pattern, at least its not the hurry up to wait scene  was able to leverage other half of table to a group of 4 that was kind enough to let us add on to their beer order which is key as the line recycles for rd 2.  like a new D1 recruiting class they move on as a set of friendly ivy educated gals who work private equity sit down and laugh at our dumb jokes.  this city is diverse alright  the pretzel, sliders, pickled eggs and veggies were great.  both dames and dudes restrooms have urinals   people are friendly (staff / patrons) as its hard to be mean nor grumpy drinkin beer out of giant gustos while baskin in the sun  get your people together and head over", 
    "review_date": "2014-02-23"
  }, 
  "-Cfdld6UqO6rx72WNE9yvg": {
    "user_rating": 4.0, 
    "user_location": "Lincoln, CA", 
    "user_name": "Tri V.", 
    "review_text": "Get your dranken on! A nice day in Sacramento can turn a little chilly in SF. I was in the area and was looking for a place for lunch and a good buzz. Biergarten is mostly outdoors. I love how their facilities are shipping containers. A container for the kitchen, a container for the bathroom, one for the bar. The German themed establishment had beers I've never had or even heard of. I love beer, Biergarten has beer, I love Biergarten! I got my nephew an almdudler which was pretty good too. Tastes like lemon soda, but gooooood lemon soda. The sea dog was really good. A long weiner nestled between a soft warm hearty bun with bacon, masago, and some white stuff on top. The devilled eggs, curry potatoes, n pork belly sliders were forgettable. I wish they could lower their prices a little and figure out the parking situation better. Overall this place is GREAT!!", 
    "review_date": "2013-07-16"
  }, 
  "ZqsPaSa6ks-T5R2H6dSPQA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Joseph D.", 
    "review_text": "Fun outdoor beer garden with tasty beer and yummy sausages.  Even on a rainy, dreary day, expect this place to be filled to the brim and quite busy. The selection of beer is not extensive but enough to accommodate different palates. Our favorite was the currywurst which was a sausage with a delicious spicy tomato sauce, perfect in the cold.  Will definitely come here again, although it'd be nice if their beer was a little more reasonably priced.", 
    "review_date": "2012-04-08"
  }, 
  "qNrHLZPurBWJzeAMkFLvvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracy T.", 
    "review_text": "Biergarten is quite an amazing find. Whoever thought of this concept is pretty genius. Perfect on a sunny day and of course I went during the coldest/cloudiest/windiest days ever, but those 1L beers make up for anything short of having a good time.   Grab a bunch of buddies, get 1L beers, a big pretzel each, and drink your miseries away! Bathroom is pretty fancy porta-potty with a shared sink complete with mirror. Communal picnic benches that you can easily swoop by busting out your eagle eyes.   P.S. Bring a jacket. Biergarten, can you get some heat lamps up in there?!", 
    "review_date": "2012-05-03"
  }, 
  "LYnRWJtNtQ84g0r4lkD_Gg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan C.", 
    "review_text": "Came here sometime last fall with my friends who wanted to check it out.  The concept of the place is cool; they try to replicate the atmosphere of a German beer garden with authentic benches and mugs.  They even have blankets out; a good amenity to have given the chilly nights in San Francisco.  However, in terms of their food and drink, I have mixed feelings.  In all honesty, the food there is overpriced.  I ordered the bratwurst with sauerkraut; the food was really good, however they should at least give two brats instead of only one if they charge $9.  The sauerkraut was one of the best i've ever tried... not like your typical type found at ballparks.  My friend ordered the egg sandwich (costing $8) , and he was still hungry after finishing it. On the other hand, their beers are moderately priced. A 1/2 liter will cost you around $6-8, and they have a good selection of beers. I tried the Stiegl Pilsner and it was great!  All in all, this place is definitely worth trying at least once, just pick an evening/night that's not too cold.", 
    "review_date": "2012-04-15"
  }, 
  "WQ41N9RsEa8I1HVivYo3iQ": {
    "user_rating": 3.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "CatwomanRoar M.", 
    "review_text": "I like this place.  It's chill, fun &amp; reminds me of the biergartens in Germany.  *heart* *review on food &amp; service  Beer:  dunno....  didn't try any.  But the steins are stellar.    Food: Pretty tasty/fancy for a biergarten.  Was kinda hoping for schnitzel.  ; )   I got pulled pork sliders &amp; root salad.  All very tasty.  - B+  Atmosphere: Picnic tables in an enclosed area.  Good for small to medium sized groups.  We had 10?   Great place to hang out outside w/ friends, drink &amp; be merry.   Card games are fun!  Some Cards against humanity anyone??    Service: Slow.  Not sure why, but takes awhile for them to pour your beer... i.e. the lines moves very slowly.    Verdict: Great for a warm, sunny day.  Get there early b/c it fills up quickly!", 
    "review_date": "2013-04-19"
  }, 
  "4T2uVlRjkl0eogswfL2bTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie J.", 
    "review_text": "Love this place! The reason I only give 4 stars is due to the extremely long lines. Buy the biggest beer you can because you won't want to get back in line!   I recommend coming here on a nice day because everything is outside with little shade and no overhangs. They have a great German beer selection and a small menu with daily specials! I tried the Beet salad which was very tasty and generous size. I also tried the Pork belly sliders, amazing!   I came here with a group of friends, we all showed up a different times and had to stand in line for over a 1/2 hour. We never went back for seconds because the line never died down.   Overall, great weekend day drinking spot!", 
    "review_date": "2013-06-12"
  }, 
  "ZLQ1n8V73c0fthbQHsJhWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason P.", 
    "review_text": "this place really knows what's what. the focus is on quality beers, food, and service, and it really delivers. today we drank huge beers under umbrellas while the rain pounded Hayes, and it was a ridiculously fine experience. the staff even brought us freebie pretzel thingies for sticking it out! can't ask more from a Biergarten. don't need to lust after visiting Munchen any more.", 
    "review_date": "2012-12-22"
  }, 
  "jD1810QDa6evTCPylHqmVg": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "sean m.", 
    "review_text": "let me echo the thoughts of others: this place has great potential! beer is delicious, but pretzels do cost a bit too much ($4).  no reason also why the beer staffers could not add more people behind the bar to keep the line down.  other that that, though, really nice experience!  especially when it gets warmer, this place will be hot!", 
    "review_date": "2011-12-10"
  }, 
  "UhTzZNatDswuxf5BMNaiWw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "David L.", 
    "review_text": "My first review on Yelp. I found this place while going to Suppenkuche about a block away and I saw all the tables and people drinking those giant steins of beer and I was immediately intrigued. I just had to go there to see for myself. We stood in line for about 20 minutes because they were controlling the flow of people going into the area and making sure it wasn't getting crowded near the bar and food service stations. The wait was well worth it minus the fact that they were out of 3/6 beers they had available. Given it is the end of Oktoberfest, they should have been more prepared especially since it was only about 6pm and they opened at 3pm earlier that day. All that aside, I got myself a monster stein of Paulander Oktoberfest and I loved it. It's a pretty malty beer with slight hops, its an amber ale so expect it to be a little richer than a pilsner but less than a brown ale. Overall a great beer, although it's only in season during Oktoberfest. I'd definitely go here again because the ambiance and good vibes are worth it.", 
    "review_date": "2011-10-26"
  }, 
  "OFi92Xc2QyIr787GNKtgZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "If I wake up on the weekend &amp; notice the sky is sunny, one thought immediately races through my head. \"Today will be a GREAAAT DAY for BIERGARTEN!\"  Yes, it's literally a parking lot with some benches &amp; lights being hung overhead, with beer &amp; german food being served out of shipping containers, but it's so AWESOME.   On a sunny day in Hayes, it's hard to beat chilling and drinking beer with your friends and other locals in a communal outdoor setting. The one liter steins, brimming with beer certainly encourage feelings of joy as you bs the rest of your afternoon away with friends till your hungry. I mean sure, you can be productive with your day but why would you?  Meat knot? What's that? I don't care. It tastes good &amp; bring me another stein please.  If you can't get enough of Biergarten, you should check out their sister restaurant Suppenkuche which is also in the neighborhood. They have delicious food and DAS BOOT, two whole liters of beer ready to help you stay tipsy. Watch the movie \"Beerfest\" for inspiration.", 
    "review_date": "2014-02-04"
  }, 
  "bovY56Nmb3_aSFf0RJ0gfw": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Greg A.", 
    "review_text": "In another city this place would go out of business. The only reason they stay open is you can sit outside. But who in there right mind is going to wait in line for over 30 minutes for one beer. If you plan on going and having one beer and being surrounded by people just waiting to take your set come here. If you drink more then two beers in one sitting this place is not for you as you might as well just order your beer and then get in the back of the line and get ready to wait to order your second. Plus they jam you in like cattle and if you show up after it has been open then get ready to wait for 30 minutes for beer and if you have more then 4 people with you get ready to wait another 20 for a table so almost an hr to get a beer and sit down.", 
    "review_date": "2013-06-14"
  }, 
  "kZe2CUs-9OeIViFa6QC0wA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessie L.", 
    "review_text": "Really fun place to go for beers on a nice fall SF day. The food is surprisingly really good. I did not expect that at all given that it's located in a chained up parking lot and seems to be more of a place to go for drinking than eating, but I was wrong! The only issue I have is that it's such a popular spot, the beer line can be very long and it's frequently hard to find a seat!", 
    "review_date": "2014-05-08"
  }, 
  "FysDiqCS1fxxwC9PLHNqNg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victoria E.", 
    "review_text": "Authentic Bavarian food in Biergarten filled with French people tonight. Which is to say: Perfect for me!", 
    "review_date": "2014-08-15"
  }, 
  "AsGl4aoGFlizHTE-IPB5eQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Patrick K.", 
    "review_text": "This place has great beers on tap, and some decent food. The lines can be ridiculous, however. It is a great place to spend a warm Saturday afternoon!", 
    "review_date": "2012-02-26"
  }, 
  "1yRxNijLVY6IKFHZIo_ynQ": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Jenny C.", 
    "review_text": "You gotta ask yourself one question. \"Do I feel like getting wasted?\" Well do ya? Punks!   The biergarten is a great place for someone to get hammered. Just kidding. The line itself takes about 45 minutes so naturally the first question I asked myself was \"2 steins or 1.\" It's very important you see because 2 balances the very fine art of being happy and off your chair hammered and 1 is \"oh i am definitely going to be sober by the time i get my second one.\"  I opted for two steins. It was an absolutely wonderful decision and the sun was shining brighter than it had before I started drinking.   So point of the story. Don't be a wuss and double fist some steins. I promise it isn't lonely on the floor.   Five stars for atmosphere (cute as hell), beers, food, bathrooms (so cute). Minus one for the line that put me in that awful 2v1 predicament in the first place.", 
    "review_date": "2013-04-29"
  }, 
  "cPR7YT7uuxDSlhbh7zkS3A": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Rob C.", 
    "review_text": "Having just returned from a trip to Oktoberfest in München I am glad to find a place serving authentic flair with good beer.   The people are real, the beer is fresh and cold, and the neighborhood is friendly.   Since this is my first review I don't have much to compare to...but if you're looking for a place that's more about who you're with than where you're at (anywhere in the world). This is a great spot!", 
    "review_date": "2013-12-01"
  }, 
  "53PjYuZ4KJgiYNUnrG75hQ": {
    "user_rating": 4.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "John B.", 
    "review_text": "A bit pricey but it's a great place to kick it with a few good friends.   I wanted to hang out with a good friend of mine and celebrate the end of her exams. We wanted to go somewhere with alcohol. Somewhere in the city. She then stumbled upon an article on Thrillist that mentioned something about beer served by the liter...and that's how I found myself at Biergarten.   We thought we arrived early. To our surprise, there was already a pretty substantial line of hipsters and it was a bit of a wait to find a seat.   Admittedly, I'm not exactly a fan of most of the beers they serve here (more of a fan of American craft beers), but considering the venue, I wouldn't want to drink anything other than German beer. They do have a limited tap list. You can probably find something you'll like, though. As for me, I was really looking forward to drinking a dunkel (dark lager) since I haven't had a dunkel beer in a while, but they were out. Ended up with a liter of Schneider-Weisse ($16) which was okay. My friend and I also split the pork belly sliders ($9). The bread was fluffy, buttery, and nicely done. I really am a stickler when it comes to choosing the right bread for a sandwich and Biergarten did it right! The pork was tender and pretty flavorful. I liked that red cabbage slaw too. Overall, it was a great slider but not very filling for the price.   As for the seats, unless you are in a large group, you're probably going to be sharing one of those tables with a group of strangers.   Oh. And if you want another beer or more food, you'll have to fall back in line...which wouldn't be that big of a deal if the lines weren't so long.   Anyway, this place is pretty cool. I'll definitely come back for another liter and maybe one of those delicious looking prezels since the weather is nice right now.  If you're interested in getting some small german bites with large steins of german beer and  don't mind waiting in line or paying high prices, then I recommend that you stop by sometime!", 
    "review_date": "2014-06-05"
  }, 
  "5qgJTus1l35A6bqW2fFk0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raina D.", 
    "review_text": "Fun spot in the middle of Hayes Valley.  The beer (tried the Helles) was delicious and comes in sizes of 0.5 or 1 L depending on how big you want to go ;) The food menu is full of fun, creative bites.  The line to get beer does get pretty long when it's crowded (aka any semi-sunny afternoon), but the bartenders are all friendly and take the time to tell you about the beers and sample different types regardless.  Fun place for groups &amp; perfect to wander around Hayes before or after.", 
    "review_date": "2013-04-08"
  }, 
  "a7yb2m6qp9Te9TGu4B-Jxg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitch G.", 
    "review_text": "Don't go here unless you like to wait 45-60 min for your first and perhaps only beer. Poorly planned and executed. I waited over an hour (out of stubborn determination I guess) for one beer then would have had to wait another hour for a second round since they have no wait staff. I couldn't understand why it should take so long. Basically they have a monopoly on nice weather otherwise one would see it's just a parking lot selling $14 Stellas. Don't waste your time.", 
    "review_date": "2013-04-23"
  }, 
  "ra3OzaxpILytSjHRRKoT8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel B.", 
    "review_text": "At three p.m. on a Friday, the place was hopping.  The special frankfurter was amazing (with a special apple slaw).  Hefeweisen on tap, and all is right with the world.", 
    "review_date": "2012-10-12"
  }, 
  "s8nkbQAlrVPfg1u4anGKtw": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Kelly S.", 
    "review_text": "The hours here are the worst. That's the only drawback I've found -- except for the bizarre drunk idiots that accosted us several times. But I just kind of have that vibe I guess.  The beer was great, the pretzels with their home ground mustard and pickles were savory and different, the white wine was bearable. We sat out in the biergarten in the california sunshine *and then rain* and enjoyed a cold mug of beer and some super friendly service from the folks behind the bar. It's a bit on the pricey side -- but then isnt everything in CA?   If you're in the area, and the line isnt wrapped around the block, sit down, have a beer, look at the world passing you by.", 
    "review_date": "2014-04-11"
  }, 
  "KIUeZpqA5DpQZIhcBwQVvQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seema M.", 
    "review_text": "We came here yesterday (Thursday) for happy hour knowing that it had just opened last week and were expecting a crazy line. We strolled up around 6pm and there was no line to get in! Prime HH time and no line? :)  The line for beer was kinda long, but moved quickly. We ordered our steins of authentic hofbrau beer and found a picnic table for six. The crowd was really chill and respectful- no drunken, beer splashing younguns like I had expected.   Food wise, I only had a pretzel. Overpriced and skipable. I do want to try a bratwurst next time though.  The staff were awesome.. cheerful and always making sure to shoot you a smile if you walked by them.  My brit husband who lived in Germany for a year gives Biergarten his beer loving stamp of approval- that makes it 5 stars alone right there.", 
    "review_date": "2011-10-28"
  }, 
  "Szg--2wonu3BEdIav_vbCw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rohan D.", 
    "review_text": "A nice little place by the park in Hayes Valley.  So if you like the taste of beer, don't get the one with Lemon Soda (Radler I believe), I thought it might be interesting but it was just a very smooth blue moonish like bear, very weak and not a very strong flavor at all. The other beers are better. If you want to avoid the taste of beer, then the Radler is a nice compromise.  Also, cash only + the beer won't get you drunk. It's the weakest stuff I've ever had.  Otherwise the Bratwurst and Sauerkraut are damn good.   Try to grab some blankets.", 
    "review_date": "2012-02-12"
  }, 
  "_SfuntzDyr-DuEKe1pcY1w": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Ben S.", 
    "review_text": "This place is pretty rad! A little pop up beer garden in the middle of the neighborhood. I dig it! Long lines, but serving large steins of beer out of shipping containers is awesome in it's own right. Big tables, kids, dogs and lots of people. Will definitely be back!", 
    "review_date": "2012-09-03"
  }, 
  "VmlShd8k2tq7-O4TVx5R1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carol Y.", 
    "review_text": "Pretty good place to just hang out. Waiting in line is not so bad but lookig for a seat can be challenging especially when it's crowded  It's like winning a gold when you finally notice someone leaving and you quickly swoop on their seat! Whee!  Pilsner is pretty good. I only had the .5L and that was enough for me. My friend for the beef and cheese knot. Pretty good but didn't know it was going to be a sandwich. Lol.  Would come here again to hang out. Love being out in the city!", 
    "review_date": "2012-07-29"
  }, 
  "REWjbYaUkmGw04lNZraeQA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Austin W.", 
    "review_text": "My group of friends have been hyping up this place for a very long time and I finally had the chance to stop by this past Friday. In short, I was a bit underwhelmed by my experience at Biergarten. If you hate crowds as much as me, get ready to test your patience. I was lucky enough to secure a table for my group before the crowds started to form, but if you're not lucky, you're gonna be standing for your entire stay here. Beer here only comes in two sizes - half liters and liters, and the selection is quite poor. Food selection is also quite poor, but that wasn't a big deal to me since I normally just order beer and pretzels. My take on the pretzels? Subpar. You will find pretzels that are 10 times better than the ones here at Jamber. Random aside, but I do find it a bit comical that biergarten and smittens are right next to each other, as both places very much overhyped. What perfect neighbors! For happy hour, I would look elsewhere.", 
    "review_date": "2014-06-28"
  }, 
  "CctbRY_g64_UvKOc6jmBNQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jee H.", 
    "review_text": "I came here on a Friday afternoon/evening and apparently I lucked out that bit was somewhat chilly because my friend and I were actually able to get a seat. I've been told this place is usually packed.   I love the layout and vibe. It is very casual and relaxed. Get a beer, order some snacks, drink and catch up with friends. Gotta love the big steins.   My one knock is the line to order drinks. I'm a fan of orderly single queues, like chipotle. Here there were a couple of lines, a mesh of people to together and others just lolly gagging. Make one line and it is empirically proven to be faster and more efficient. This is a win win for both consumers and the business.", 
    "review_date": "2013-12-02"
  }, 
  "-Za2ZO9GMIT2kKj65G6n5Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul S.", 
    "review_text": "I was disappointed in this place; it was way overpriced ($5 for a PRETZEL?, $8 for a beer?), way overhyped (line to get in!), and food and drink that is much better done elsewhere.  Oh you just finished your beer at Biergarten and want another one?  Well, you gotta get up from your table, then stand in a long line for about 10-15 minutes just to buy your ass another beer.  There is an ARMY of staff waiting around to snatch your empty food baskets as SOON as you finish eating, but they apparently can't bring you a fresh beer (like they can in a REAL German biergarten).  Hey, let me finish the last bits of kraut before you yank that basket away, will ya?  They have a handful (3-4) of German beers on tap that you can get in massive-sized glasses if you want (bitte, $15!).  Toronado and Rosamunde Sausage Grill (the one on Mission) have the same or better selection of these types of German beers.  Even The Uptown on Capp St. usually has some nice Paulaners.  As for the food, the sausage was undercooked (still pink on the inside!) and didn't even come with a bun -- for $9!.  Rosamunde Sausage Grill's sausage is ten times better at 2/3 the price.  Heck, Rosamunde's BUN is by itself better than anything I had at Biergarten.  Aside from offering opportunity to drink outside like Zeitgeist, which frankly does everything much better (upscale people are just afraid of the bathrooms there), this place offers nothing.  This is just another overhyped pseudo foodie place in SF.    You can find me at Rosamunde when I want a German sausage and a German beer (yes, they often even have Kostrizter Schwartzbier).  It's better (the kraut is even better, nicely seasoned with juniper berries), cheaper, and less hassle, and no wait to get in, no ridiculous 15-20 minute line to buy another beer.   The Mission location even has outside seating.  Biergarten is proof that you can take mediocre food, a handful of common German beers that are available elsewhere, overprice it all by 50% and STILL have people lining up because you put the whole thing outside -- on a slab of parking lot asphalt surrounded by a chainlink fence.  \"Oh, we have a biergarten in SF... how Europeannnnnn!\"", 
    "review_date": "2011-10-28"
  }, 
  "LpVJ7DQ0K7qqIqDw_jMdTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natan O.", 
    "review_text": "I came to Biergarten for a quick bite but quickly made friends in the outdoor friendly atmosphere.  I ordered the bratwurst with a tangy sauerkraut and spicy brown mustard on pretzel bread.  When my sausage arrived it protruded out of both sides of the short pretzel bun, which kind of reminded me of the Scandinavian hot-dogs.  This allowed me to taste the meat, which was very tasty.  I was pleased to find the heaping amount of sauerkraut on top and paired with the mustard and freshly baked pretzel bun I was in heaven.    I'm sad to say I didn't stay long enough to grab a beer but the selection looked more than adequate and I'm sure would go very well with the food.  I'll be back to try something else and drink up for last time!", 
    "review_date": "2013-03-10"
  }, 
  "YR0CcWbSasHEVoXzjCTREQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan W.", 
    "review_text": "The Hayes Valley biergarten is a great place to spend a sunny day.  Get there early to beat the huge crowds, and pay attention to the somewhat odd hours they keep.  Afterwards, Hayes Valley is a pleasant neighborhood to walk around in.", 
    "review_date": "2013-04-29"
  }, 
  "zciwU82jK43PULjH6b_t2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex O.", 
    "review_text": "A very solid Beer Garden with very good beer.  Went here with a group of 10 friends to celebrate a birthday.  We got there after the rest of the group, so they already had a table and were pretty far up in line.  That being said, it is busy on a Saturday afternoon in the fall and the line moves very slowly.  Had we not taken turns waiting in line, the experience would have been a lot less enjoyable.  But it's a beer garden and we got exactly what we expected - overly large beers, German food, and nice outdoor seating.", 
    "review_date": "2013-11-25"
  }, 
  "l-zgWG-brcQ4iRev-pfrsg": {
    "user_rating": 3.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Peg S.", 
    "review_text": "Baby became cranky when they couldn't get into Suppenkuche.  So, they brought baby to the biergarten for brats and beer. Daddy chugged down a lager.  Mommy wolfed down the pretzel.  They shared a basket of sauerkraut, bratwurst, and yes, another pretzel.  Baby didn't get brats or beer, but fell asleep dreaming about them, so Mommy and Daddy were extra happy, too.", 
    "review_date": "2012-06-06"
  }, 
  "WJfNVm4mXXDt1Vakg13CpA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Jenny Z.", 
    "review_text": "First of all, I have to say the whole concept of a \"beer garden\" is freaking awesome! Biergarten is exactly what its name implies, which is essentially an casual, fun outdoors gastropub that serves up an eclectric menu of German favorites like Bratwurst with fresh pretzles, maple syrup bacon bread pudding and wide array of drinks. They are currently in the process of expanding the business so expect longer hours during the coming summer. My friend and I had very fortunately stumbled upon Biergarten on our way to Chantal Guillon for macaroons, while waiting to be seated for dinner. Both of us decided to return after our dinner reservation for late night (~7pm) spirits and snacks. Although they were bustling with people around dinner time, the crowd began to thin down when we got there...so there was no line and plenty of blankets, seating available. And now I can proudly say that we were very happy with this decision!  There were 2 draft beers, 2 wines offerings that evening with several snacks. We decided on a white dessert wine, Pilsner and maple syrup bacon bread pudding to share. Everything was delicious, although the bread pudding was a little burnt at the bottom. Our Pilsner was big enough to be shared between the two of us. The warmly lit ambiance and complimentary blankets offered a nice shelter against the chilly winter night, overall making the scenery extremely sweet and comfortable...to the extent in which I ended up taking a short nap amidst our talking, snacking and drinking. Overall, it was the icing on top of great evening. Even though I didn't eat here...judging by the hungry bites my fellow customers were taking, the menus would definitely be worth exploring! The portions of their entrees may not filling enough for dinner but would serve as generous snacks to pair with drinks. I would say that this is a great place to for a laid-back hangout with friends on a weekday night, after work, or weekend. Good choice! Will definitely be returning with more friends", 
    "review_date": "2012-03-04"
  }, 
  "OjTmPLbMUJGK8fybeK3DOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan T.", 
    "review_text": "Don't like hipsters? Don't go to the Biergarten. Instead, move to Stockton and stop complaining. If you're less concerned about the appearance of your servers and fellow customers, read on:  The food is great, albeit expensive. The bier is terrific (also expensive). Show up with eyes open about the cost, enjoy the company of your group instead of complaining about the line and you'll have a great time.", 
    "review_date": "2012-07-16"
  }, 
  "kaGiZgqbnA22BespaMFF3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "michaelangela v.", 
    "review_text": "4+. Good beer, good to awesome food (pink deviled eggs! and sunflower-seed pretzels with fresh horseradish, etc.) The salad basket is a real bargain.  Today they had a somewhat interesting ice-sculpture that everyone was instagraming. Hipster and self-aware? Hell yeah, and I don't care. I can ignore them as easily as I can ignore anyone else. They are somewhat quietly loathing themselves while I am quietly enjoying my food. It's a win-win in out parallel universes. An occasional neutrino upsets the balance.", 
    "review_date": "2012-07-30"
  }, 
  "gvQCzJO8LGIyLNnARr-IJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marcus C.", 
    "review_text": "With limited options for drinking beer outside in San Francisco, the Biergarten delivers and delights.  Tough to beat on a nice, sunny day.  The small menu of delicious food offerings makes it easy to waste a way an entire afternoon (and bank account - 1-liter beers run close to $20).   Don't expect to catch the game here - no TV of any sort. In my eyes, a fifth star comes when you don't have to choose between the game and the Biergarten.", 
    "review_date": "2014-10-15"
  }, 
  "Sw7leO4Xw-tvg4CiIISxCw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jena V.", 
    "review_text": "I enjoyed everything about this place. Sure the food and beer add up but you are outside in a decent neighborhood and if you have good friends around you the money doesn't matter. First off liter sized beers, OK! Amazing bratwurst and sauerkraut, GREAT! When it gets chilly the wool blankets come out, PERFECT! Overall yes the bill added up but the atmosphere and friends around with good beer and food to choose from this is a place that I will recommend to others.", 
    "review_date": "2012-11-19"
  }, 
  "eSU_HjKOA3Ppt8oS07oYkw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Eric J.", 
    "review_text": "A few friends and I came to Biergarten after Suppenküche was packed to the brim. We were still feelin' the German beers, and the weather was perfect outside, so we staked our claim on one of the picnic tables. We got there around 9pm and it wad still pretty crowded, but we managed to find a free table pretty easily.   The outdoor space is pretty cool, with a few shipping container type structures, serving beer and assorted German sausages, pretzels, and other bar food. We ordered our beers, and I ordered the pork belly sliders, which were delicious, including the red cabbage slaw it came with. I would recommend against getting the burger, because although it was delicious as well, it was about the size of one of my sliders and more expensive. The waitstaff is very friendly and they were very efficient with bringing out the food.  I love the raucous beer gardens where everyone is singing and having a good time, but after being a plane for 6 hours, I definitely appreciated how laid-back and chill Biergarten was. If you're looking for an Oktoberfest-type experience, Biergarten might not be the place you're looking for.  The only disappointing thing was how early it closes. 9pm seems a bit early, but I guess, as a sort of a pop-up beer garden, you have to be mindful of the surrounding neighborhood. Anyways, I'm a big fan, and I'll definitely be back for some good German fare and delicious beers.", 
    "review_date": "2014-10-23"
  }, 
  "kRuLPE8TTtWeB2shWQi69Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cassidy D.", 
    "review_text": "Really fun vibe! ! You really feel like you're at an outdoor pub in Germany. The food was fantastic. The sliders were literally the best sliders I've ever had. Pretzel was good, the horseradish was a nice compliment. Seating is limited and although the wait wasn't bad when we went at 5pm, the line was super long as I was leaving. Had the cider beer which was delish and heard no complaints about the others on tap as well. Definitely will be back.", 
    "review_date": "2014-08-16"
  }, 
  "SKQld0XdYNrGJU8DSlR3KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria C.", 
    "review_text": "My favorite bar in SF, specially on a nice sunny afternoon. There is usually a longgg line but trust me, its worth the wait. Their bites are delicious. A bit pricy for the size but  they are delicious.", 
    "review_date": "2014-05-27"
  }, 
  "UE-rXhA8njNnADFkDA3EuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Inigo M.", 
    "review_text": "Pricey small dishes (open-face egg sandwich, bratwurst). Good place to chill with beer and friends on a sunny day.", 
    "review_date": "2012-01-16"
  }, 
  "H3PFTHE-SL1gg2exnNy1jg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily S.", 
    "review_text": "A good time is always had at Beirgarten. The food is good, the beer is good, but the tables are always full on a good day and the line will be around the gate and out the door. I wish they could expand, but I understand that they are limited to their corner lot.  Despite the mass amount of people on a nice day/night, the beer is always good, always changing, and always worth the wait. Check it out!", 
    "review_date": "2014-03-09"
  }, 
  "5vXqog3DHrRXADKUg78B2w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna G.", 
    "review_text": "Pro tip: on a night when the Hayes Valley Off the Grid pod is set up just on the other side of the fence (<a href=\"/redir?url=http%3A%2F%2Foffthegridsf.com%2Fpods&amp;s=791c066272fb437343933e99c08a37bce35bff325cf247940800af65a2feebbe\" rel=\"nofollow\" target=\"_blank\">offthegridsf.com/pods</a>), the kind folks at Biergarten will allow you to enjoy your food truck grub on their turf as long as you purchase some beers.   And, quite frankly, why wouldn't you when presented with such an opportunity?  Long live Proxy SF! <a href=\"/redir?url=http%3A%2F%2Fproxysf.net%2F&amp;s=6a3cc10cc94db5f4d39acc876c6eb4c27afafa055f1be5edd2b74e98f3181ab7\" rel=\"nofollow\" target=\"_blank\">proxysf.net</a>", 
    "review_date": "2012-05-02"
  }, 
  "-Ryl_0mZE_71CMPIcbzZhg": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Derrek O.", 
    "review_text": "My favorite beer garden in the city.  On one of those rare sunny days we enjoy in the city, this is where you can find me. The main event is of course the bier, which you can get in either a half pint size or a 1 liter size (stein). There isn't a huge selection of beers, maybe 5 or 6, and I always get the wheat Schneider Edel-Weisse. There is also a few options when it comes to food fare. There are pickles, bratwursts, frankfurts, pretzels and pork belly sliders. The sliders are outrageously delicious, I highly suggest you order them.  The beer garden is set up with a bunch of cafeteria style lunch tables. It can be hard to find a spot to sit on a busy weekend. On colder days, they offer blankets for customers.", 
    "review_date": "2013-06-26"
  }, 
  "0cZaLvThOfuQa9spTMyv8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kaje Y.", 
    "review_text": "Biked here with a friend one day, and was ready for some food and drinks.   We got in line, which wasn't very long. Just enough time to decide on some food and drinks.   + They have one of my favourite beers on tap! Schineider Nelson Sauvin. It's an amazing beer with a nice floral-esque nose AND flavour to it. I ended up getting two of these. + The food was decent. Better than average, but not amazing. The prices were reasonable, not that expensive, and accurately reflected the value food.  ++ We got pork belly sliders, deviled eggs, and a pretzel. They were all fairly delicious. The deviled eggs are pink!  When we went up for round two of beers, the queue was fairly long and it was quite a wait. Seating is definitely hard. They have plenty of seats, but this place gets packed and popular!  I cannot comment on parking because I biked.  There is no real \"service\" happening here. You buy your beer and then you sit down. Food is brought to you, and your tables bused. Very little interaction, so we'll keep that neutral. It's actually better that way so you can quality time talking with friends without being interrupted.   Good beers, decent food, reasonable prices. Will return when they come back from vacation, and I recommend this place!", 
    "review_date": "2013-10-28"
  }, 
  "FSDj4JOrZxd5Z-ax15Klgg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Reyz A.", 
    "review_text": "Didn't know about this place till my friend invited me down. I always pass this place off of 101 on to Octavia. It's kind of like, Munich meets steel shipping container land. The bathrooms, the vending areas, shipping containers. Luckily the seating/picnic tables (which BTW, after 4pm is nonexistent) are not.  It was a pretty nice day in San Francisco, OK it was 56F. Line already formed by 4...it took about 15 minutes to get to the front of the queue. They were out of the Bratwurst, but we ordered pork sliders, beef tongue, Asahi (BTW, it was Japanese themed today...is this a Japan/Germany/Axis thing?) and Edelweiss. All for about $40bucks.  Lucky for us, I found some milk crates to fashion a makeshift table and seats. Ate our dinner, froze our butts and a couple left a table, and we jumped on it.  Overall a very nice experience to chat, eat and drink a brew or five.", 
    "review_date": "2012-09-15"
  }, 
  "gfjgoJ_ERWzp8JbmlYo_bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connor Skye R.", 
    "review_text": "So much love for this place. It's basically my backyard. The food is fantastic (I prefer the alarmingly pink deviled eggs, and the pretzel-wich with brie and picked shallots), the bathrooms are some of the cleanest I've *ever* seen (tip: they're marked as Mens and Womens in name only so no worries using the other gender's bathroom for efficiency's sake.) Oh yeah, and they have beer, too! Lots and lots of lovely delicious beer.  The only thing I could possibly ask for is more beer options. And earlier opening hours. And some chairs for lounging with a book. Just small things.", 
    "review_date": "2012-06-28"
  }, 
  "WNBLzzSRaAYT12YFfXjJ0Q": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Kristin D.", 
    "review_text": "Food was amazing, beer is cold and refreshing. Friendly and fast service. Great place to spend an afternoon with friends.  The cider is crisp and refreshing without being too sweet. The sausage platter is fantastic.  The pretzel is served with horseradish and mustard, and the pickles are fresh and crisp.", 
    "review_date": "2014-07-27"
  }, 
  "_mfVg2apfsD8BIpgCMoIig": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kristen R.", 
    "review_text": "Great place to go and enjoy the patio. Like everything in the city expect a line but, if you have cash you can grab a pretzel or a pickle while you wait. Prepare to sit with strangers and have a giant beer.   The food prices are reasonable and most everything was good. The knot was my fave but, the mustard was intense and dominated the taste of the braut and deviled eggs.  All and all worth the wait it takes.", 
    "review_date": "2014-04-13"
  }, 
  "hCLGgtfo4bCXOzGNuYHvdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea F.", 
    "review_text": "Super soft bloody beef, topped with some snappy rocket. Brioche buns are the way to my heart, but the thing that really did it for me: deep fried onions. Thank the Lord.  As far as Biergartens go, this place is totally unauthentic and the prices are bordering on the clinically insane. However, it is a great place to hang out and I would recommend it to anyone in the area.", 
    "review_date": "2015-01-28"
  }, 
  "IUXmQbiQSG97Aez2rOKmcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "An-Nhien L.", 
    "review_text": "This is touch because this is a pretty unique establishment and i dig the concept but the line is unreal sometimes! Good beer though and the $4 pretzel I tried was pretty good. Delicious when warm but it got so cold that my pretzel didn't take too long to get cold too :(  +1 for bringing out blankets to everyone when it got colder. That was nice :)  Unfortunately weather is a huge factor in how enjoyable this place will be for me...Unless you have an alcohol blanket on, which can be difficult with the long lines!", 
    "review_date": "2012-04-11"
  }, 
  "dl7TdXUL0aybDbSHuwOU0w": {
    "user_rating": 4.0, 
    "user_location": "Rancho Cucamonga, CA", 
    "user_name": "Noodle S.", 
    "review_text": "Recommended by friend while in SF.  Quality of food/bev (8/10). Relative value (9/10). They basically sell you a liter of beer for $12. How many beers in a liter? <a href=\"/redir?url=http%3A%2F%2Fwiki.answers.com%2FQ%2FHow_many_beers_in_a_liter&amp;s=33d41db251ddad71eeb9ab328486dc683f69663fe50bac535d405535d42e9796\" rel=\"nofollow\" target=\"_blank\">wiki.answers.com/Q/How_m…</a>  That comes out to about $4.00 per beer. That's a pretty good value. Plus it looks pretty cool hoisting those oversize beer steins.  Ambience: This place is basically an empty lot covered in black asphalt and park benches (rumored to have been flown in straight from Germany). The two buildings are basically converted storage containers. You sit where you can, and usually random people share tables. Me likey as fun social place.  They day we went there was also a band playing dressed in funny german outfits. I heard they volunteer and get paid in beer.   Only four beers on tap and very limited menu, but if you're going to be picky about those types of things, go to a sit down resturatant or the Yard House.  I'd probably give this 4.5 stars mainly for the value, and the social aspect of this place. Fun times.", 
    "review_date": "2012-07-06"
  }, 
  "vhCzEMJ-XDTuJflaYTHRzw": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Yen T.", 
    "review_text": "The space is great but the beers on tap are limited.  With only 3 beers to choose from, I was disappointed.  I love german beers and wanted to see a variety, so that gives this establishment only 3 stars.", 
    "review_date": "2012-09-27"
  }, 
  "vTn9a3bCNK8S6uxEq9ZaCw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave B.", 
    "review_text": "I love the idea and concept but massive lines and fighting for seating when it get packed is frustrating. It gets packed on every sunny day which is awesome for business and I get you can't really expand but waiting for 20/30 minutes for a 8-14 beer can convince people to move. Still enjoy stopping by every so often.", 
    "review_date": "2012-08-30"
  }, 
  "jZqwsvfNPM68IV8UO8RVpg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kathy L.", 
    "review_text": "Beer gardens are down right awesome. If I lived in SF, I'd come here every weekend with friends!  They had a good selection of beer and food. I wanted a light beer so I ordered the Radler (half Lager, half Lemon soda). I really enjoyed it and would get it again! My friend got the Schneider Weisse which was also good. In terms of food we got the Pork Belly Sliders and Meat Knot (pretzel and pastrami) which were both delicious!   Blankets are also provided for when it gets too chilly. How accommodating is that!", 
    "review_date": "2014-06-01"
  }, 
  "Cfdj06EDOKvaeLHkUfKv_A": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ashly d.", 
    "review_text": "Beers, check. Snacks, check. Fun atmosphere and blankets for the city's chilly days, check.", 
    "review_date": "2011-12-17"
  }, 
  "RR-hNSxTUs4CSkGQZLEWyw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jamie L.", 
    "review_text": "My boyfriend heard of Biergarten from his brother and confirmed it with one of the servers at Suppenküche. We came here the weekend of my birthday. Although there was quite a line, it wasn't too bad of a wait. The prices are still just as high here, even their bar food was a bit pricey. However, I enjoyed their beer and of course enjoyed my company, my PIC and drinking buddy. Cannot wait to bring my friends here!", 
    "review_date": "2012-06-27"
  }, 
  "mi8LdMhA5MS_9HK8U6C-2A": {
    "user_rating": 3.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Andrew I.", 
    "review_text": "Actual rating: 3.75 / 5 stars  This place is an awesome place to go to.... if you bring all your friends with you and drink lots of beer with lots of obnoxious people. Nice place, since it's closed off across a park with lot of good stores around.   Don't get me wrong, the beer is awesome. They don't have a huge selection of beer, but whatever they do have is very good. The food here is expensive for a \"food-truck\" type of food, so try to come here not on an empty stomach. You shouldn't drink with an empty stomach anyway. I had the 2 sausages combo with pretzel for $18. The 1L beer is about $10. Sausages was ok, pretzel was good. Beer was excellent.   So wear a jacket, layer, prepare to wait in line, bring lots of friend, come with good stories to tell and just be loud. Don't bring your date here. Unless it's a group thang and you like to talk to random groups of the same type of people.", 
    "review_date": "2012-08-19"
  }, 
  "wm7jnUwj5spDjFkX_JMnRA": {
    "user_rating": 5.0, 
    "user_location": "Berlin, Germany", 
    "user_name": "Lauren H.", 
    "review_text": "\"German beer in a glass stein on a sunny Saturday afternoon in San Francisco\" is an oddly specific answer to give when someone asks what my favorite color is.  Oddly specific, long-winded, and tedious, but honest.  Your first priority should not be getting a table, going to the bathroom, or waiting for friends - it should be getting in line for your beer. My friend and I made the novice mistake of commandeering seats and taking lavatory breaks and suffered the consequences: forty minutes in line waiting to order our drinks. The sun beat down on the back of my neck and ears, freckling my face in a very un-German way as I gazed enviously at the wise folks already sipping their authentic Bavarian brews from steins so full and so heavy they had to be lifted with two hands.  Despite the wait, this place is glorious. Beer (German-brewed tongue-twisters in name and in flavor) comes in liters or half-liters, both of which stay surprisingly, blissfully cold no matter how long it takes you to polish them off. Traditional German fare includes pretzels with horseradish and sharp mustard, sliders, and bright, pickled seasonal things (eggs, grapes, carrots, and cabbage are common menu tenants). You'll probably end up sharing a table community-style with some pretty chill people; you'll probably really wished you'd paid attention in high school German; you'll probably want to go back again next weekend.", 
    "review_date": "2013-08-07"
  }, 
  "7wUczg1-5F3JxkZoRxisqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily H.", 
    "review_text": "Loved it!  4-5 taps of German beer. A little pricey but oh-so-good. Bartenders were very nice. Great that they accept credit cards.   We managed to find a table pretty easily on a Friday afternoon (4th of July weekend). One of the girls in our group ordered the pretzel knot with cheese and it looked SO good. We were getting dinner at Suppenkuche later on that night or else I would've ordered some food. It all looked quite good.  Will come back again! It was so cold this time, but maybe next time I'll pay Smitten a visit too!", 
    "review_date": "2013-07-11"
  }, 
  "7ecvBHMwf8xoJPL2AA3MoA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah L.", 
    "review_text": "After circling the neighborhood for a good 30 mins to find parking, seeing the line to get the beer was ridiculous. But I'm glad to say it was worth the wait. I was very surprised to see the only 2 sizes the beers came in, .5L and 1L but they were well worth it for the price.  We tried the haufbrau, octoberfest, and one other one, grabbed a few pretzels and chatted the afternoon away with some new friends we made at one of the picnic tables. Really wanted to give the bratwurst a try because they smelled amazing but we had to save room for dinner. Overall, great atmosphere and a great place to hang out with friends and meet new ones.", 
    "review_date": "2012-05-12"
  }, 
  "9Obo2dAKY1wucMxlU2jUfw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Alyssa C.", 
    "review_text": "Despite the long wait to get your beer, the environment definitely makes up for it. The vibe is super chill and relaxing, mostly consisted of either people who've just got off work and people celebrating a rare sunny SF afternoon.    Came with 7 people on a Friday afternoon, the line was already forming outside to the sidewalk by 430PM. Waited about 20 minutes in line as the others grabbed a table. Getting the table and the actual beer was both instant, which was very nice. I have yet to try the food here, but from the things I was smelling, it's definitely worth a try.   The entire \"garden\" area was pretty packed the entire time, started getting pretty full by 7PM. The line for beer was against the gate, about a 35 minute wait (Don't know who would have the patience to wait that long for a beer...). The bathrooms were pretty clean (compared to your regular pub/bar around the city), ignore the men &amp; womens signs, there's a urinal in the womens.   The beer overall was rather tasty. I had two liters of Weihenstephaner (Keep in mind that I'm a 5'1 female, so you can imagine how much you would be able to consume!), lighter ale which totally hit the spot considering how extremely sunny it was! To me, it was worth the wait and the price.   Definitely coming back here again! :)", 
    "review_date": "2013-09-07"
  }, 
  "ebgL4kFL_Ayi6Mw52EE4NQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah W.", 
    "review_text": "I really like this place, although it's a little pricey.   I can forgive them for the beer because it's imported and it's delicious, but the food is pretty steep for what you get, even though everything I've tried here has been been delicious. It's fine if you're just trying to have some snacks with your beer, but don't try to eat here for dinner when you're hungry like I did. My boyfriend and I met up here for dinner, split two things, and had to have a second dinner a couple hours later. Maybe we should've had more beer. I can appreciate that they seem to change up their menu, one time they had delicious mushroom sliders and the last time I was here they had a variety of tacos.  The ambiance is great. I've only been at night but it seems like it'd be a great spot to hang out during the day.", 
    "review_date": "2013-12-05"
  }, 
  "Ia_8Ey61yqaettBfGPBo4A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua O.", 
    "review_text": "The prices, unfortunately, are entirely off the mark for my liking. For the price of a liter of beer, I'd rather go back to Germany and buy it there.  Also, I was very sad that the potato salad was mayo-based.", 
    "review_date": "2013-10-26"
  }, 
  "RQR-bncvVssevK_WIPWvCA": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Emily M.", 
    "review_text": "We visited Biergarten during quite cold weather, so we didn't have to wait in the legendary lines. The beer was awesome, as was all the food. Pretzels, mustard, pickles, sandwiches... yummmmm.  A fabulous time was had by all. Love that they provide blankets!!", 
    "review_date": "2013-03-11"
  }, 
  "k2vaxn4rBpUzJBJJQg51TA": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Patrick H.", 
    "review_text": "Go for the bier, stay for the outdoor drinking experience. But eat elsewhere.   Let me explain...  The beer choices are good and you can get them in 1/2 or 1 Litre sizes, but you'll have to wait in a long line before getting to quench your thirst. The people taking your order are friendly, answer your questions, and don't rush you despite the line that keeps growing behind you (it takes a while to pour a litre of beer!).  Once you have your beer in hand, find a picnic table, kick back, and get merry.  And if you happen to get hungry, I'd visit the food trucks parked around the corner before buying food here again. On to the hugely disappointing snacks: I was looking forward to having a nice, warm German pretzel. What I got in return for my $5 was a COLD seeded pretzel with dollops of mustard and nostril-searing horseradish. F that.  Still hungry, I ordered a brat &amp; sauerkraut for $9. Tasty, but no bun so it wasn't as filling as I was hoping. Hey, at least the brat was hot. Still, $9 for a brat is kinda crazy. Is there a ballgame going on here? They must be made from organic, virgin, nitrite-free, vegan-diet pork to justify it.  Given their overhead (or lack thereof), I'd expect lower prices across the board. But since the crowds keep on coming, I doubt they'll change anything.", 
    "review_date": "2011-12-06"
  }, 
  "SqSMWBHD2Lklf_8W5MftPA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pilan C.", 
    "review_text": "Have wanted to go to this place for awhile now, and finally went yesterday, when the weather was beautiful out.  Unfortunately, too many people had the same idea.  The place had a good vibe and good beer, but the line to get beer was very long -- it took more than half an hour to get to the front of the line -- and while we were in line, we found out that they were out of pretzels!  This was around 5:30, and they're only open from 2-8, so that was quite disappointing.  Because of the long line, we only got one round of beers, because we didn't want to wait again.  That's not really the feeling you want when you go out to grab some beers (plural).", 
    "review_date": "2012-01-29"
  }, 
  "_IpAWG7j7AztF6oY6YF3Iw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jack S.", 
    "review_text": "Newly found gem for me, whoever created and opened this place is a genius.    Pros:  Outside, simple, good german eats, good german beer  Cons:  Beer line can get very long and the beer selection is slim, unlike the full liter beers they serve!", 
    "review_date": "2012-04-20"
  }, 
  "AgJxCwwC90WwUOv7g3tiXQ": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Stephanie H.", 
    "review_text": "Be prepared to wait in a very long line ...   This place is amazing!  And outdoor beer garden is just an awesome place to hang out and drink and have a great time with friends.  We arrived around 3pm and realized that there was already a long line that had formed to get in.  Apparently, you have to go earlier than that to stand in line.   It took us about 45 minutes to one hour before we got to the front to order and sit down.  There are limited tables and the service can be a little slow.  Not sure why they don't have separate lines for drinks only and drinks/food.  I think that was what was slowing down the line.  Plus, once you get in it might be tough to find a table as most of the tables get filled up quickly.  You might have to squeeze with other people but it makes it more fun.   We ordered a cheese pretzel to try their handmade pretzels and it was delicious!  If I had room for more food, I would've ordered more just to try everything out.  You can order different sizes for the beer so don't be scared off by the large giant mugs everyone is carrying around.  Or you might be get really excited seeing them.    Either way this is a really nice place to just sit, enjoy your beer and chat the night away.", 
    "review_date": "2013-03-11"
  }, 
  "wrsG7r7_vMjkQZutp5L1Hw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "katrina w.", 
    "review_text": "Update:  Came back here, love the beer and bites, but the bouncer was a douche.   Is this place even open?? I made plans with some friends to have a night out at Biergarten, checked the website for their hours...but when I got there they were closed! and no it was not raining.", 
    "review_date": "2012-08-28"
  }, 
  "OHMSNlCCGCpY8Z-E_EuZBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard H.", 
    "review_text": "More of these fun outdoors drinking venues should exist in the city. They serve delicious German snacks, German beer in big steins, and it's outside next to a park and across from an ice cream shop and Ritual coffee. A great place to spend a sunny afternoon.  At the very least run there for a pretzel and a beer if the weather is nice and it's not out of your way. What more could you ask for in a day-drinking spot?", 
    "review_date": "2012-03-28"
  }, 
  "amz57NX_BDfMhrJnkQhTYw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany W.", 
    "review_text": "Long lines. Get a liter, you won't want to get back in line nor lose your seat (if you can grab one).    Could have a larger beer selection but I respect the German selection and the appropriate glassware.  High quality beer that won't get warm because you won't stop sipping.  Luckily I snagged a seat while my BF got the brews.  We arrived at 2:05, the place opened at 2:00 and already the entire garden was either packed or claimed for.  They need to have a no reserving seats rule, and a no sitting before you have beer rule and this might make the flow a little better.  I snagged the end of a table with a bit of begging and a bit of force, just after getting my beer, people were standing eyeing down seats.  Come early, bring friends, hold down a table and get a few liters.  Thank god the sun shines in SF in January.  Gotta love that.  **Did not try any food, review for beer and beer garden only**", 
    "review_date": "2012-01-17"
  }, 
  "f0LuZ1Nv1XtsHtPpGzaeAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin H.", 
    "review_text": "So busy but so good!!! Best beer and German bites! Mein Liblingsbiergarten!!!!!", 
    "review_date": "2014-01-03"
  }, 
  "QocP49nZ7Fo-4Rp_QxPuDQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura F.", 
    "review_text": "a German Biergarten is always a good thing! There are too many long lines to get in and order beer, but both go pretty fast. The very cool red beard bouncer either said \"go find the good looking people\" or \"you are good looking people\", either way, everyone in here looks pretty happy and good looking. The pretzels are great and the friend making group tables are a lot of fun. I was pretty cold though, maybe they are pre heat lamp operated?", 
    "review_date": "2011-11-05"
  }, 
  "6gfX-aJxO5tGjI2z4IeJOQ": {
    "user_rating": 4.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Keith A.", 
    "review_text": "First off, I wished I wasn't stuffed before I came here because the food looked and smelled awesome.  If you like your German Beers then this place will work for you. Biergarten is simply cool. The only downside is the general frigidness of S.F.   I'm only giving it four stars for the lack of space heaters. I only left because my face was frozen.", 
    "review_date": "2013-03-31"
  }, 
  "JlaG3-0Md1M63wafhNTIvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vaibhav S.", 
    "review_text": "Excellent beer, bratwurst , deviled eggs and pork belly sliders. Will try the other things on their menu soon!", 
    "review_date": "2014-11-15"
  }, 
  "D6dCpfSnSv2waqnCaGlv_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charlie L.", 
    "review_text": "The food comes in small portions and is a bit pricey but Biergarten keeps you coming back with great atmosphere, a live band, and fun crowd. Please skip the egg sandwich and duck fat. Order the Pork Belly Sandwich along with a side of potato salad.  A thick cut of pork belly fat grilled brown and crispy is served on a warm mini bun. I could eat 6 of these pork belly sandwiches but I guess you're suppose to get full from all the beer they have on hand. I'm not much of a beer drinker but I really loved the Lemon Soda mixed with Beer. It was sweet but still had that grainy beer taste. It was perfect for those rare sunny sf days. It gets really crowded here and seating can get a bit tight. Nothing is more disappointing than having your food and drink orders come with no place to sit at. More benches and heartier portions would really make this spot perfect.", 
    "review_date": "2012-08-13"
  }, 
  "xIblo0Z8d4Fy582f5LR4pw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Robert M H.", 
    "review_text": "Love love this place.", 
    "review_date": "2012-11-26"
  }, 
  "FQj_5wqxNhQpxzBhrrlrjg": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "E J.", 
    "review_text": "Three words.  Pork. Belly. Sliders!  I'm not a beer drinker, so this review is based on those sliders.  DE-LISH!  I'll admit they're smaller than I'm used to for sliders, and the price isn't well, let's just say I could probably buy an entree elsewhere for the price of the sliders.  BUT!  So worth trying them.  Hats off to the chef!", 
    "review_date": "2014-01-21"
  }, 
  "ubF5zarbyXJVMTOZrSUFyQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ling H.", 
    "review_text": "We were on our way to Smitten and stumbled across this little gem. Even though I had given up beer (well, newly given up as a month and a half ago) and a most of us didn't drink beer, I am SO glad we did anyways! It's such a cute idea and would be an awesome place to hang out and catch up with friends in the summer. It was still winter though and a little chilly at 4PM in the afternoon, but hey. When in SF.... do what San Franciscians do right?   We waiting probably a little over half an hour to make our way to the front. The girl pouring our beer was super nice and knowledgable and informed us of the different brews they had on draft. We even got to sample a few of them! I forgot which one we got, but it was tasty. Two size options: A liter or a half. With my newly found appreciation for clean eating and giving up beer, I opted for the half. Wise choice on my behalf. *Pats on back*  By the time we all got our beers and wine, a table opened up. Score! Then it got chilly the longer we stayed out there. Probably around 5PM. The nice lady that worked there asked us if we wanted blankets. YES! Double score!   Definitely an awesome place to check out!", 
    "review_date": "2013-02-25"
  }, 
  "yrymJBFi9XPfzC4R1J34sw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Courtney J.", 
    "review_text": "Great place for a drink and a bite to eat with friends.   After we ordered and sat down, I felt like I was back in Berlin.  I love this they have all German beers on tap available in 0.5L or 1L mugs.  And the pretzel was also yummy.", 
    "review_date": "2013-05-16"
  }, 
  "9H2hvHUmEbn8nkfbu82FzQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chester W.", 
    "review_text": "Not a huge selection of beer, but a great spot to hang out with friends. Its outdoors and can get chilly at times, but they provide blankets so its all good. Can get crowded so I would make sure you get there early or else you will stand around awkwardly waiting for a table. Food is good, but expensive for the portion size. Would be much better if they had some epic pretzels.", 
    "review_date": "2014-07-13"
  }, 
  "MbfrGVXuPU35K7lwZQEqVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eduardo R.", 
    "review_text": "You can probably find me here on any given Saturday afternoon. The bier is good. The atmosphere is cool. The prices are moderate.   Sadly I have yet to try the food. I always end up getting filled up on bier and decide to stumble across the street to Smitten for an ice cream dinner.", 
    "review_date": "2012-10-21"
  }, 
  "mW8fvDQ3JAtzeLjU--CjTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rowena L.", 
    "review_text": "Been here twice in the past two weeks. Solid beer and food options, though slightly expensive. The bratwurst was amazing!   There's nothing special about the place though, nothing that gives it any character, that's my main complaint. But overall it's a nice place to grab a beer outside on a nice day.", 
    "review_date": "2014-04-19"
  }, 
  "-89IDABrt2vnhvoCiUlVCw": {
    "user_rating": 5.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "T M.", 
    "review_text": "I stopped by for my regular radler and a knot, and discovered they have a cheese knot! It has caramelized onions as well, which really compliments the flavor of the cheese - it leaves it tasting very sweet (this coming from a person that hates onions.)", 
    "review_date": "2013-01-04"
  }, 
  "C6LaHeW6P1lbSwVZYkyhhg": {
    "user_rating": 5.0, 
    "user_location": "Salt Lake City, Salt Lake City, UT", 
    "user_name": "Alyse A.", 
    "review_text": "Whether you're a local, transplant, or just visiting. The Biergarten is A MUST! They have a great variety. Try the Brass Monkey, it's like a beer-mosa and so delish. If you order the mug be warned, drunkenness is sure to follow. ;) One tip though, don't plan on this being your lunch spot. We were pretty shocked when we order a burger and sandwich and ended up with tiny sliders. So get lunch beforehand.", 
    "review_date": "2014-04-13"
  }, 
  "KgDOK0iFpD2mQsKkpvrALg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris T.", 
    "review_text": "Fun!  ... with a few caveats.  First, get there within 45 minutes of it opening, which is at 2:00pm. After that time period, you're gonna be hovering over the tables like a hawk looking for a spot to rest your big ass steins. If you see a small bench spot, go ahead and ask to squeeze in. Most folks will be friendly enough to scooch a bit for you and your friends (hopefully it's just 1 or 2 only).   I'd definitely spring for an entire 1L stein.  You think you'd only be game for half a liter... but chances are you're gonna be having a fun time chatting with your friends and sitting al fresco on a warm afternoon... you'll want to stay longer and drink more.  And it sucks majorly to have to line up again... guarantee another 30 min wait.    Speaking of the wait... they need another person behind the taps! 2 cashiers can take the orders and 1 tap master can be dispensing the golden goodness.  This can hurry along the wait a lot faster.  But honestly, that'd probably fill this up really fast and there really isn't enough seats for such a big crowd.  As for the food... loved the bratwurst!  It comes with dijon mustard, horseradish that'll singe your nose hairs, and a giant heap of sauerkraut.  Though I was bit confused why it had sooo much liquid in the baskets it is served in.  That could be drained out a little better.  Brats are moist and flavorful.  The kraut was great!  I ate it like it was a side salad!  Deviled eggs were pickled in beet juice... gave it a unique sweet tang.  I added a goop of horseradish to balance it out.  Hoo wee!  Waitresses are really fast with serving the food and they're always coming around to pick up your empty dishes/glasses.  They either do that to replenish for the bar or they want to retrieve those back before it ends up in some TimBuk2 bag (yoink!).  Also, you will no doubt bust out your bad German accent during your stay here.  Auf Wiedersehen!", 
    "review_date": "2012-02-05"
  }, 
  "IfHo9BPvVpeuzY8lnJjN-A": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Emm C.", 
    "review_text": "this is one very unique place and i love how it feels on a sunny day.", 
    "review_date": "2014-03-18"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "A 1/2 litre of beer and a liced laced blanket.  What else can you ask for?", 
    "review_date": "2014-04-15"
  }, 
  "KW38OXpDlH3Xd1LutwjaQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rory H.", 
    "review_text": "Did you wake up this A.M. imagining yourself with some friends on a big picnic table hugging a liter krug (that's German for big ass 1 person pitcher) of a Suppenkuche beer?  Well this lil Beer Garden / Reclaimed Parking Lot complete with retrofitted industrial shipping containers is Das Shizzy! It's overflowing with all the reasons people love Suppenkuche without having to elbow wrestle yourself a beer.  Not only is it bad ass man sized beers, they got some dang good grub to boot! Like pretzels, brats, salads, and sliders! You see they've built one of the old shipping containers into a kitchen. Genius! Then they built onto it a little back patio with a fire grill. Brilliant!  Now throw in some sunny weather and you've got an afternoon of the Gods that is till one of the crazy locals decides to cozy up on your bench and kill your buzz but hey at least they're staying true to the German culture and leaving the choice of where to sit the toughest choice of all!", 
    "review_date": "2012-10-15"
  }, 
  "t9cze1D9Gb8d-spMoHHSSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay S.", 
    "review_text": "it's raining but who cares when you are at a fun beer garden right in the middle of Hayes valley. What a great idea. Outdoor seating with umbrellas on most tables and warm blankets just in case you need one. We ordered the bratwurst basket which includes 2 bratwurst, sauerkraut and a soft pretzel. Oh and yummy pork belly sandwiches (2 mini to an order)! Oh and of course a Black Logger! I feel like I'm in Germany! Extra plus, I love the friendly staff. Oh yes, they are so well equipped... outdoor kitchen and there are even very clean outdoor bathrooms (after all that beer!).", 
    "review_date": "2013-01-09"
  }, 
  "rE7YqX3KSEmJS_uf5l7S9Q": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brett L.", 
    "review_text": "It really pains me to give this rating, but my girlfriend and I both got sick after eating here. We had an order of pickles and a pretzel while waiting in line, and later the sausages and sauerkraut. I'm guessing it was the latter that did us in. This is such a shame, because the food was surprisingly good. Fortunately, it was not too bad, and neither of us missed work.  Had it not been for the incident with the food, I'd give this place 3.5 stars, maybe 4. The biggest problem is the lines. I don't mind waiting to get into the place (the guy at the door (the owner?) was really friendly and helpful), but you have to go back into that long line to order another beer, as there is no table service nor a separate line for customers already inside. I'd also deduct a 1/2 star for lack of variety. They had Schneider Weisse (yay!), but the other two beers were ok. The Radler is way too sweet for me, but that's a personal preference I suppose. Those were the only options the day we were there.  So my take on this place? If you don't mind the lines, this is a lovely place to spend a sunny afternoon. The communal outdoor benches are great. I'll personally avoid the food, but might be back for a beer. With Schmidt's and Walzwerk not far away, however, I might just go to one of those places to get a better selection of beer.", 
    "review_date": "2012-06-25"
  }, 
  "0mP76PwDxamNMpO1qnHuhg": {
    "user_rating": 4.0, 
    "user_location": "Folsom, CA", 
    "user_name": "David P.", 
    "review_text": "Beergarden...I mean, Biergarten has a great concept. Outdoor drinking, large mugs, and German eats.  It's a great way to spend a sunny afternoon in the city with some good company. The German beers come in this huge mug which is a cool idea. The beer was tasty, but if you like real beer I would recommend staying away from the beer mixed with the soda. By the halfway mark, the sweetness gets to you and it's harder to drink by the minute.   Beware that the line can get VERY long and unfortunately, it's the same line if you want another round. Ain't nobody got time for that! Maybe it's their way of crowd control so that there is not one group that stays forever unless they are really determined to wait in that line again. How do you not wait in line? Show up when Biergarten opens. There will be no line to wait in and a hopefully somewhat short one for seconds.  Unique beer, beautiful day, great company...good times.", 
    "review_date": "2013-03-06"
  }, 
  "8Tllfos1YxyhvoxiGR0CbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roland C.", 
    "review_text": "There is nothing to not love about Biergarten.  Well, ok.  There is one thing.  Two things, actually.  One:  They could use more taps, especially on days when the weather is great.  Two:  the fact that their lease will be up soon. That will be a sad day when Biergarten closes it's gates for goon.   Apart from that, Biergarten is perfect.  The beer is awesome and German, with a choice of sizes.  The snacks hit the spot, perfect drinking snacks like the pretzel, my favorite.  Let the Steigl flow forever, Biergarten.  I love this garden!", 
    "review_date": "2014-08-11"
  }, 
  "bNpy0uzbh7BT2Wnd5eReTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam L.", 
    "review_text": "What a GREAT place to chill, have a beer and soak in the rare SF sunshine! I've driven by here so many times and never realized that it was a biergarten because I think the conexes kinda threw me off for something more industrial or something. My friends and I parked our butts here right when they opened at 3pm on a Wednesday and we were enjoying our Spring Break from our intense nursing school program...so we had an excuse to drink in the middle of the day in the middle of the week. For the rest of the folks there, we just had to wonder what folks did for work who drank full liter steins of beer at 3pm.  Anyway, the beer is what you'd expect to find at any fine German establishment. They rotate beers by season and pour in 0.5 liter ($10) or 1.0 liter ($20) glasses/steins. It's too bad they don't sell beer by DAS BOOT! I guess those might break too easily... The only thing that could make this place even more awesome is if the women who work here wore those German biergarten uniforms. But I digress.   The food here looks amazing, but I opted to just go for the beer and pretzels and had bites of my friends' burgers...which was pretty darn good. Next time I'm definitely going to try the pork belly sliders.  Overall, if you've got a big group of folks and want to just chill and hang out during a warm SF afternoon/evening, then come on over to Hayes Valley and sit your butts down here and enjoy a fat brew!", 
    "review_date": "2014-03-20"
  }, 
  "4odC28scHx_y9URM0_1wyw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dizzy L.", 
    "review_text": "We went with a crew a few weeks ago.  It's good and I know it will probably get better.  So far the outdoor situation and tables are great and the location is a perfect idea.  Pretzels are yummy.  Kraut is tasty.  Food comes fast.  Mmmmmustard.  I like that they used container ship crates as their workspaces.  Park across the street for kids and kids are even allowed in!  And beer, who doesn't go to a biergarten and like that?!  Things that need tweeking are...  Waitressing - it needs to exist, so far it didn't  More glasses (or 2 dishwashers, haha) - they were hovering the tables for any glassware anyone would give up  The beer lineup was retarded!  Too too too long.  If oom pah pah places all over the world can supply beer to your table in several minutes then it must be able to happen here too.  My suspicion is that the human line acts as a free visual ad aid for Biergarten as the public goes by - like, \"ooh, what is that over there?? It must be popular... such a massive lineup!!  Let's go see!\"  Maybe they should think about installing more beer pull taps - there are only 4 and the person taking your money is also the person pouring your beer - just takes toooo long.  ID needs to be checked at the entrance rather than every single time you go through the beer lineup.  They can make high/low stamps or whatever other idea there might be but something better.  As of now we were sending one person up to get beers for all of us - so each time a person went up to buy beer that person had to bring an ID up for each beer that was purchased - awkward and long-handed.   I believe it can happen!  I have hope.", 
    "review_date": "2012-01-28"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "Finally been to the Biergarten - it's across the street from me but it took me 10 months to try it! Good thing for half days. And a testament to how popular it is!  Beer selection is okay -- you could always go to suppenkuche for beer without a wait. The real advantage is having a pretzel, a pickle, or a brat outside on long picnic tables with groups of up to ten to a table.  They carded a friend of ours who was over 40. He didn't have his ID because we were doing a company offsite before that required running. They didn't care. Color me ignorant, but that feels like some pretty unempowered employees IMHO. Are we in sf?  Die Bier garten habt real estate but that's it in my opinion. Outside drinking and food and ample space? Go to the falafel place.", 
    "review_date": "2014-04-11"
  }, 
  "570kiZ_3AyLYNKpihpA05A": {
    "user_rating": 4.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Amy C.", 
    "review_text": "Pro: Great beer. Beautiful, refreshing location even when its windy as fuck and you're freezing your buns off (they have blankets).   Con: Food is yum but TINY for what you pay...Expected for Hayes Valley so, in regards to location, sensible. Also, you kind of feel like you're in an episode of Portlandia. HIPSTER CENTRAL. Mustaches galore.   Synopsis: Go with a group of friends. The tables are huge and make sitting together, easy. Also, you order on your own so no awkward, \"should we split the bill\" convo.", 
    "review_date": "2014-07-23"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Why aren't there more places like this in SF?!  Finally checked Biergarten out yesterday because Suppenkuche had an hour and a half wait.  It was pretty freaking cold at Biergarten because it was 7 pm in November, but the staff was walking around handing thick blankets to everyone (: !!  Such a great place for day drinking or for celebrating a birthday with a large group.  Definitely coming back during the day.", 
    "review_date": "2013-11-24"
  }, 
  "zSmXDPctUMmii1ult-tXHg": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Ronan B.", 
    "review_text": "Atrocious service. It took 1 hour 15 standing in line to get a beer, so we each stocked up on 2 litres when we did get served. SF lacks nice places like this to sit outside in the sun and drink a beer, and they are taking advantage of this fact.   When I arrived at the bar they were out of 1L glasses, but more were coming from the dishwasher. The barman twiddled his thumbs for 3 minutes, waiting for the glasses, and not serving anyone else. It seems like they are doing their very best to be as slow as possible. And then they expect a tip!  I'm Irish, so I know effective bar service and the duty a barman has not to make people wait. Employing some general efficiency in your work is a good start. And processing more than one order at a time is effective too; does however require the brainpower to remember more than one drink order. These people show neither interest in happy customers, nor even in making more money quicker for the owners or tips for themselves. Disgraceful. I won't be back. It's run even worse than its sister restaurant Suppenküche.", 
    "review_date": "2013-07-18"
  }, 
  "J7A_ZVBZ6IMxM3BK9HciYA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Iulian V.", 
    "review_text": "Three star is for service because they not allowed you to bring outside food and you can not have to go beer and the stuff is not friendly  The beer they have is the best you can find around", 
    "review_date": "2015-01-11"
  }, 
  "OfnwNMQXhdjLSE8b1FViaA": {
    "user_rating": 4.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Susan F.", 
    "review_text": "Yummo!  Had a liter of Pils, the lardo on brown bread (sublime!), the charctuerie on a pretzel knot (perfectly salty) and a pretzel with mustard and horseradish (just the right chew) and a just-right pickle.  Sitting outside with great food and a lot of beer on a beautiful and sunny San Francisco day is about as good as it gets.  The wait was well worth it and the location perfect for people watching (most were actually watching us inside the fence....)", 
    "review_date": "2011-10-24"
  }, 
  "x9Jj7iepr2n59Rs2zCxnXg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leuwam T.", 
    "review_text": "Biergarten is a welcome outdoor space on those rare San Francisco sunny days. If you notice that the forecast is going to be nice over the weekend, plan to line up at Biergarten a bit before they are open so you can get a beer and a coveted spot at the communal tables while it is still warm.   They don't open until 3pm so you only have about 2 hours of warm sun to enjoy out there. Not sure why they can't open at noon so we can all make the most of the sun and some lunch at Biergarten.  Right now the beer and ID checking lines just combine in to one looong very slow line. Just order the largest beer you can  because after you wait in that huge line once you will not want to wait in it again just to get another beer.  I have also tried the  beautiful pink deviled eggs and the pretzels with mustard and horseradish. both are excellent beer snacks. At least they have an extra line so you can pick up snacks without getting in the beer line. They don't have very many beers on tap, maybe 3, but you are really there for the atmosphere. For those looking for a lighter drink try the Radler, a lemon + beer shandy.", 
    "review_date": "2012-09-28"
  }, 
  "kDk5Sun6adcCkcMdslBJIg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Christian D.", 
    "review_text": "Ive come here a few times and everytime has been great! i always run into cool people to chat with there! i love the pretzels, brats and beer! the atmmosphere is always fun, very casual and who doesnt like to drink beer outside on a beautiful day! this is the perfect place to go with friends when you are in Hayes Valley!", 
    "review_date": "2014-09-29"
  }, 
  "3hZQz7XPXmH2c47s7U7kPw": {
    "user_rating": 4.0, 
    "user_location": "Redmond, WA", 
    "user_name": "Antonio V.", 
    "review_text": "Had to wait in line for about 40 minutes but it was well worth it. The banana knot, pretzel with banana, hazelnut butter and honey was delicious. Very enjoyable with a larger group of people on a sunny day.", 
    "review_date": "2013-08-27"
  }, 
  "p6VpnzidZzpOPa03TrcK0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thankie S.", 
    "review_text": "The good ol' beer garden. A novelty in SF (or maybe I'm just living under a rock) but plenty in all of Europe. SHIET this was good.   Here you'll find some wonderful imported German beer offerings, from your nice and light hefeweizens to the dark lagers. Speak of the dark lagers, my all-time favorite go-t here o is the Köstrizer, a nice dark lager full of chocolate notes and a smooth finish. Think Guiness but more flavorful and not as heavy.   Yes, the half-liters and liters are pricey, but you're essentially paying for this nice outdoor bar environment. Their snack options, especially the German pretzel, are outstanding. Pricey, but oh so delicious with that special brown mustard they serve. Didn't get to try the pickled deviled eggs, but friends liked it.   Last, on a really cold San Francisco day (I mean really cold not the stupid usual 65 degrees), the Biergarten staff hand out blankets for all the patrons. Definitely makes you feel like a badass struggling through a Russian winter.", 
    "review_date": "2014-09-29"
  }, 
  "xRJyMR1_QPuZuUhUuVaooQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Marcin M.", 
    "review_text": "Great outdoor beer garden style place to drink delicious beers and eat delicious German food.  Picnic table style seating so chances are you'll be sharing a table with strangers given the limited seating.  The frankfurter on a pretzel roll was very tasty and my beer was excellent.  I felt like a warrior drinking from one of the liter steins.  The only downside, and it's a big one, is the wait time for a drink or a re-fill.  If you plan on having more than one drink, keep someone in line at all times because it took 30+ min to get our first drink and the line kept getting longer and longer.", 
    "review_date": "2014-05-08"
  }, 
  "YGTefRmhNo1ONyU3ZqVEnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evelyn N.", 
    "review_text": "This place is awesome.  San Francisco is waaaaaay short on patios, so if you want to enjoy a cold beer, some snacks and a whole lot of sunshine, this is the place to do it.  Be warned there are always lineups though.  It seems intimidating, but is totally worth it.  You'll wait like 15minutes in line, don't stress, enjoy the day.  The interesting thing about this place is that you have to line up every single time you want a beer, you can't order at the tables.  What this means is that there is a pretty consistent turnover of the tables, so once you've ordered your beer, you can usually always find a place to sit.    They are associated with Suppen Kuchen across the street, so you are guaranteed some quality in the snack foods they serve.  :)", 
    "review_date": "2013-06-05"
  }, 
  "04JttCeiTpGmy-7XJtn2Gw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin O.", 
    "review_text": "As a resident of Hayes Valley, the Biergarten is at the top of my \"Go To\" List. It is a perfect place to enjoy the afternoon sun with a cold beer and some great bar snacks, like the soft pretzel's, pickles and brats.  The staff is friendly and the location is centrally located right on Octavia in Hayes and is a few steps away form the shopping and other attractions in the area.  The Biergarten is a popular spot, so the line can get pretty long. My advice is order all your beers at once... and if you are contemplating a half v full pint, always go with the big boy. You will thank me when you don't have to get back out of your seat and wait 20 mins in line for a beer.  Overall, I like the experience and day drinking is a SF specialty, so this is a great spot to make it happen.", 
    "review_date": "2012-11-12"
  }, 
  "qUJmdUBUXEy7_73Ie_CWrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sydney L.", 
    "review_text": "Great place to grab a beer.", 
    "review_date": "2012-07-06"
  }, 
  "j6GK2SSR2g-B2peogcws_Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monkey Balls M.", 
    "review_text": "YO CHECK DIS OUT. Alright so we're walking by with a small shih-tzu in tow and we notice that a few people inside have their dogs with them. Like 3-4 dogs. One big dog, a couple small dogs. Sweet! We can take our dog in right? Nice sunny day, a few beers in the cool breeze.   STOP. Employee says \"no dice, you can't bring dogs in.\" I politely point out that there are 3-4 canines behind him inside. \"Sorry, those are service dogs.\" \"You mean like seeing eye dogs?\" \"Yep.\" \"So one of us stays outside with the dog while the rest of our large group sits down and has some beer. Meanwhile, another dog is carried in under the arms of an obviously non-disabled, non-bliind patron. She's not nixed by the very same employee who nixed us. In fact, they are carrying on laughing and having a long convo.  I go up to ask and I say, \"Sorry, lemme just confirm....dogs are not allowed unless they are service dogs.....so this little bundle of fun is a service dog of some sort?\" The lady giggles, in front of the employee, and says \"Eh, yeah. He helps me with my stress.\"  SO, if you have a dog and you want to bring him in.....my advice is to tell the obviously-not-giving-a-shit employees that your dog is a service dog and he helps you forget your war memories and shit. Your welcome.", 
    "review_date": "2014-03-19"
  }, 
  "Cv7ojfqfwDbLlrNJpfWxkg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elysia M.", 
    "review_text": "This place is so cool! I've always seen it and have wanted to stop in for a drink but now that I actually have, I will definitely be returning.   I went on a Thursday night with some co workers, not expecting to have too grand of a time. But it turned out to be so great! Just the atmosphere of things was awesome, everyone of the customers seemed like they were genuinely having a good time and would like to chat with you, kind of a Portland feel!  The venue itself was super cute with tables to share and sit with others and like at festivals. The lighting wasn't too dim at night with their string lights, was just perfect!  Although the beer selection isn't too large, it was really good! Tried multiple and they had a lot of good german beers, for a good price! The food was Great. Authentic and very tastey! Bratwurst was great!!  Now they don't get 4 stars because of two things, the employees weren't too kind, kind of grumps to be honest, and it got really cold! They should get heating lamps! But they did have blankets, which is nice... But what if the person before had lice?!   Either way, I'll definitely go back.", 
    "review_date": "2014-08-30"
  }, 
  "J3d-o-CSeERm_fBWtliXdw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kim H.", 
    "review_text": "For a perfect spring day &amp; summer night....love the outdoor feel and the monster drinks they have on hand. The waiting in line and hovering over the tables staring down peeps so you can sit is a bit disturbing but once you do find a table...sit there..enjoy your wealth of drinks and good eats!", 
    "review_date": "2015-01-08"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "I love the concept of ordering up a round of beer and enjoying it in an outdoor's patio environment on a sunny, cool day.  Dine over beer - it is simple and relaxing.  They have a variety of beer selections and there are many picnic tables to lounge at with a group or two.    They provide side snacks, such as pretzels and salads, if you feel like you need something to munch on with their well-flavored beer.  Otherwise, a liter of beer is all good by itself.  Biergarten is purely a delight for recreational and leisurely purposes!", 
    "review_date": "2013-11-05"
  }, 
  "OuJTbeuKUi5km7jAqHusrw": {
    "user_rating": 3.0, 
    "user_location": "Mission Hills, CA", 
    "user_name": "Roth S.", 
    "review_text": "Tip: 1L of some good german beer, hoppen hef is a good one.   This spot is really meant for a nice day. All outdoors with beers and food being served out of  old shipping containers. Nicely done.   Went there for a quick beer but the weather was not so cooperative and quite cold so felt a bit rushed to drink quickly and get out of there.   Didn't get a chance to try their food but perhaps next time.", 
    "review_date": "2012-06-07"
  }, 
  "eDjB7sq7L6i2W1l4BbN3RA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Justin R.", 
    "review_text": "I like the idea of ordering a large beer, some fried pickles, and sitting outside in the middle of the city for some excellent conversation and people watching.  Biergarten is the perfect place to drink quality beer in large amounts and not have to deal with the \"scene\" of most beer bars these days.  Check it out.", 
    "review_date": "2014-04-27"
  }, 
  "39qhGXAarAMzz7Uex4D5dg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian D.", 
    "review_text": "Greatest idea ever. San Francisco needed more outdoor drinking establishments.", 
    "review_date": "2012-09-09"
  }, 
  "FgGiQc9zpM_va5JZMvJtMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea B.", 
    "review_text": "This is an outdoor rectangle of happiness. It doesn't get better than being outside, sitting at a picnic table with buddies, enjoying excellent German beers in big vessels and exposing your taste buds to an epic savory snack voyage. While it can get crowded, there is no other comparable rectangle of joy in San Francisco, and that's not the only thing that makes the Biergarten uber special.   You really cannot go wrong with the food. As a sister to Suppenkuche, the Biergarten maintains the standard of shut the front door delectable flavor. Order literally anything, but I can speak for the bratbasket, pretzels, meat knot, potato salad, and the deviled eggs. Give your inner savoryphile something to rave about and order literally anything.   Suppenkuche rocks my restaurant world, and the Biergarten is just another way to enjoy it's most excellent fruits. Prost!", 
    "review_date": "2013-12-03"
  }, 
  "E1os0IkyDUO_W9SJBu-L8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "I LOVE this place! It has been my new after-work spot since I moved here. Great atmosphere, very friendly service and great food. I think the beers are great and they swap out new ones every few days. Honestly, who doesn't like a nice cold liter of beer on a Thursday after work?", 
    "review_date": "2013-09-01"
  }, 
  "3cnIyELXdZa9C9nFH5NXtg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veasna H.", 
    "review_text": "The idea is awesome.  Fence off an outdoor area and serve beer.  On a sunny day, it doesn't get any better than this if you you are just looking for something to pass the time by with some good friends.    The Beer:  The beer is good German imports.  It's not gonna blow your mind away or anything, but its good.  They usually have 2 or 3 on tap.  And you have two size options.  The liter or half.  $14/$7.    The Food: Didn't try, but the pretzels looked good.  The Setting: In the middle of Hayes Valley next to a park and some other food stands makes it a gem in the city.  There is plenty of sun when the sun is out and a lot of SF culture.  Not much to the fenced off area but the food bar, beer bar, and picnic tables to hang out at.  Simple.   What I don't like:  The lines.  I recommend getting a liter if you planning on hanging around for a bit.  As with most things in SF, lines here can get ridiculous.  Of course this also depends on how lucky you are.  Anything after lunch is insane on a sunny day.  It could take you almost half an hour to get a beer and seated.  And you'll have to get back in line if you want more beer!  Maybe an express line for those that already got beer and just want a refill? If that was the case I would have given this place 5 stars!!!", 
    "review_date": "2013-02-07"
  }, 
  "YKgrNyT29bfbMKMvQnhxVQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa L.", 
    "review_text": "Um, hello! I don't know why this place doesn't have a perfect score! It is awesome!  We rode our bikes down here and arriving at 5:30, were able to score an end of a table and some great beer!  Don't forget about the regular pretzel!  The spicy mustard with horseradish is to die for! I can't wait to go back!  The blankets make it!  SF can get cold in a blink of an eye but their blankets make everything alright!", 
    "review_date": "2012-06-08"
  }, 
  "NP-675YVy9URhNmdQdnWsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa K.", 
    "review_text": "We came on a Thursday night around 6, which turned out to be perfect. We managed to nab two picnic tables for our group and there were just enough people for it to feel cozy but not quite crowded. The line varied from about 5 to 10 deep for beer &amp; food, which was fine. So I'd recommend it for a  Thursday - I walked by on a nice Saturday afternoon and there looked to be about 10x as many people. Honestly, I wasn't wild about the beer - I guess I'm generally preferring ales to lagers now, but the food is pretty good. The brats were a bit too mild but the pretzels were great and the pickled &amp; deviled eggs were fun to try.", 
    "review_date": "2012-02-12"
  }, 
  "AG3qumWJW32yJtizz7-saQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nic S.", 
    "review_text": "Great place to grab a beer on a sunny day.  The line gets long for beer...like 20 minute wait long...and it is the only line you can purchase the beer from.  I suggest ordering the large beers!", 
    "review_date": "2014-01-28"
  }, 
  "BSad_A8gpQ0_D-wrabpMLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mee-stique K.", 
    "review_text": "For all you \"bier\" lovers out there...you must check it out...but it is soooo crowded you should try to get there earlier....it you get tired of waiting in line...tell the person in front you'll be right back and go over to get some ice cream from Smitten first....that will tie you up until the line moves....a great neighborhood for showing out of towners too...", 
    "review_date": "2012-06-13"
  }, 
  "aFO_yCma7PImpdPkA8ZC-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erich D.", 
    "review_text": "Like the name obviously suggests, Biergarten is a cool outdoor spot to drink some beers with friends.  Good German beer selection and they provide blankets for you if it's cold out which is obviously quite often in SF.  Some of the blankets, however, smell like a dive bar from all of the beer spilled on them, bringing a new meaning to the term \"beer blanket,\" but at least they provide them if you failed to bring a jacket.  The only thing that needs to be worked out here is expediting the brew service.  It's ridiculously slow.  Even if you arrive when it opens you can still expect to wait 20 to 30 minutes in line to get a beer.  Want another beer?  Get back in line.", 
    "review_date": "2013-09-23"
  }, 
  "OYN8JcC1WS9WgezpeQdZRQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophie C.", 
    "review_text": "On a spontaneous decision to check out Off the Grid-Proxy, we stumbled upon the gem Biergarten. After sampling the three beer selections, we chose our beers and sat down to share our tasty pork delights from Chairman Bao in addition to an order of bratwursts, sauerkraut and pretzel.   It was a chilly night and I was grateful there were blankets to keep us toasty. As I dipped the chewy pretzel into the spicy mustard, I reflected that this is an ideal date place. After all, it's a non-pretentious outdoor dining where you feast on beer, sauerkraut, and sausages. Afterwards, if you are in the mood for something sweet, Smitten Ice Cream is right across the street where you have to opportunity to see liquid nitrogen at work.", 
    "review_date": "2012-02-25"
  }, 
  "lK_32lYJ-p_fjc01G-DPLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eliza D.", 
    "review_text": "This is easily my favorite outdoor place to drink with friends. I came here with a group that started out as 3 and grew to be 8, taking over a whole table. Finding seating was far easier than I anticipated for a beautiful Wednesday night around 6pm. The beer line also went much quicker than you'd think for how long it was. Our group loved the red ale, the gnomeburgers and the various types of knots (I'd say the best was the guest knot). Can't go wrong with crispy prosciutto (two words that clearly belong together). I also love that they provide blankets for those who somehow forgot what the weather in SF is really like.   I'll be back soon!", 
    "review_date": "2014-08-18"
  }, 
  "v_FgbYX_Q7-KlbRcMH7wXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Artyom C.", 
    "review_text": "I'm torn about this place: I love it deeply and hate it even more so at the same time. I love it because it is one of the few places in SF where you can enjoy a beer outside, weather permitting. I hate it because it takes an hour standing in line to get said beer and, only if you're extremely lucky, get a seat on a bench. I will give it 4 stars for now because it really is a nice way to spend a day outside but that's not really their accomplishment; more so the accomplishment of moody SF weather and lack of other outside drinking places.", 
    "review_date": "2013-10-15"
  }, 
  "W4M-9hB5tHIx8gGAFeMJXA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke O.", 
    "review_text": "I actually really like this place, but the hassle of getting either beer or food makes it just okay.   Pros: - Great location - Outside atmosphere - Great beer &amp; Decent Food  Cons:  - Time spent standing in line - Time spent away from the rest of your party standing in line - Time spent with the rest of your party standing in line - No pets (but I don't hold this against them, every business gets to choose their preference)", 
    "review_date": "2013-07-29"
  }, 
  "9P6rlaZJgbmnl19SFQgwig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LeonAim H.", 
    "review_text": "Great place to drink with your friends on a sunny afternoon. Everyone's friendly, especially drunk on German beer! If it gets cold, large blankets are provided.  My friends and I have tried pints of different flavors of beer and they're all good. My wife's favorite is the pork belly sliders, even though the bratwurst is my favorite.  The lines can get extremely long on hotter days, but it's worth the wait if you have a friend or two to save some seats. We always try to make our way to Biergarten on warm weekends!  Plus: bathrooms on the back left!", 
    "review_date": "2014-03-15"
  }, 
  "9d9kgq7womnxi_NGKsJMEA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Frank J.", 
    "review_text": "Cool outdoor beer garden in a great location. There are not many options for outdoor drinking in the city so this is a great addition right in the heart of Hayes Valley.  There are three German beers on tap ranging from $6 to $9 for half liters and $12 to $18 for liters. There are plenty more bottles available if the beers on tap don't do it for you.  Although when they first opened they did not have many food options they seem to have added to the menu. They have lots of small foods (pretzels, deviled eggs, chive bread, etc) to keep the beer company in your stomach. German sausages are also available if you want something larger but I wouldn't recommend coming here if you are looking for a meal though.  The line consistently looks long but it goes by really fast (5-10 minutes) and you can hop in line before you finish your last beer so you never go thirsty. The major downside is that it is not a very large place and the seating is limited so it can be tough to find a place to sit on a nice day, especially if you are in a group.  Clean bathrooms, pretty cool staff, descent crowd the times I went. Also, they have blankets to give out to people when the weather gets colder.", 
    "review_date": "2012-03-13"
  }, 
  "_dKFcQEIOkJNzk74BPKBhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina M.", 
    "review_text": "Great atmosphere, great beers, great food and an awesome place to go on a warm day. Keep in mind that it opens at 3 pm and make sure to get there by about 2:45 if you want a table. The menu is pretty limited but everything we ordered was great... I loved the beet salad and the pretzel. Definitely will head back on a nice day!", 
    "review_date": "2012-04-30"
  }, 
  "g8OdCTL-_dTZCpWHanv3Yw": {
    "user_rating": 4.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Sara W.", 
    "review_text": "This place has GREAT potential, thus 4 stars... I know we went when it was their fourth day open so they've got some kinks to work out. RIDICULOUS lines for entry, beer, and food aside, my only real complaint?  THE BOUNCER...please enjoy my rant.  Saturday 10/22 in SF was absolutely gorgeous, it was in the 80's around 3:30pm when we got in line to get into the Biergarten.  The line wrapped around the block and took us 20-30min before we got to the front for entry.  When only one group was left in front of us, we noticed some random guy just walk up to the front of the line (came from the non-line side of the block,) and start searching his pockets for his wallet.  My bf notices this and actually calls this DB out, \"hey man, are you with someone or are you cutting the line??\" bewildered man's response, \"oh um, i have friends inside...\" disgruntled bf: \"dude i've got friends inside too and i still waited in this line to get in.\"  so the guy actually acknowledged this and went to the back of the line...score one.  so now we're at the front of the line, and it happens yet again...some b*tch just walks up and shows the bouncer her ID and the bf calls out this woman too... \"hey i just chewed some a**hole out for cutting in front of everyone...you need to wait in like the rest of us.\"  skank \"oh i have friends inside,\" \"WE ALL have friends inside dude!\" and the girl must've felt entitled and was like \"uh huh\" &amp; whipped her hair at this and proceeded inside.  At this point we turn to the bouncer and ask if he's gonna keep letting people in and his lame response was \"we just opened a few days ago, we're still figuring stuff out...\" really??  i wanted to make the funny/dramatic point that society will start falling apart at the seams if he can't obey the rules of a line.  i mean really dude, DO YOUR JOB.  you're gonna have riots (not really,) and disgruntled patrons...this isn't cool.  upon entry into the biergarten, we weren't 5ft in the door when it happened a third time and this time I was fired up and called them out...and yet again the response they felt justified cutting the line because \"we have friends inside.\" man i guess i should've just done that upon arriving too... i had friends inside too but i still waited! grrr...  ok enough ranting already... after all that hooplah, we still had a wonderful time.  beer line was awful so i can't wait for them to figure that one out.  i still would totally come back, i love the feel of this place.  yay beer n pretzels!  (oh and they said at some point they will be getting a pretzel warmer, yahoo!)  the pretzel came with mustard and horseradish which i'd never had but was TOTALLY delicious!!  and the bacon saurkraut?  FANTASTIC.   mmm.... go here, you won't be disappointed.", 
    "review_date": "2011-10-24"
  }, 
  "3URnnmUtONJczRyWjXmJ2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate C.", 
    "review_text": "I love the idea of this place- a casual outdoor bar where you can grab some drinks and small things to eat and just hang out- but it's always so insanely crowded! I'm always in the mood to go to Biergarten, but then I see the line wrapping around the gates and I end up ditching that plan and going somewhere else. If you do manage to secure a table at Biergarten- first of all, congratulations. That's amazing. Secondly- yes, the prices are a bit steeper than one what expect for an outdoor bar, but the beers are good, the service is quick, and the pork belly sliders are delicious! Also- don't even think of driving here because you'll have better odds of winning the lottery than you will finding a parking spot in Hayes Valley. I was torn between 3 and 4 stars, because the negative aspects of Biergarten (like the wait,crowds, lack of parking) are not really specific to the bar, but to the neighborhood itself. So count this as 3 1/2 stars.", 
    "review_date": "2014-06-23"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "A friend of mine tipped me off about Biergarten - it's not too far from his house in SF. As a good German girl, I had to see for myself if this was a good drinking spot or not.  The good: - Conveniently located right off the Freeway - even if you aren't a city dweller, you can find this spot pretty easy. Simply exit at Octavia from 101 and you'll see it pretty quickly. - Parking is easily accessible, even on the weekends. - It's always fun drinking beer out in the sunshine. - Very good beer selection. Not too many choices, but the ones they have on-tap are pretty good. - Fresh baked pretzels to go with your brew. Yummy!  The not-so-great: - As with many outdoor patios, Biergarten gets pretty crowded on a relatively warm, sunny day in San Francisco. You definitely need to be aggressive when it comes to finding a seat. - Their Radler was disappointing. Having spent 3 weeks in Germany as an exchange student, I'm quite familiar with different varieties of lemonade/beer combos. This one wasn't good - way too sweet. Stick to the other drinks on the menu. - Once the sun goes down, it gets pretty chilly this time of year. Bundle up and bring a blanket! You won't regret it.  Overall, a very decent drinking experience in the city. Come with a group of friends and plan on drinking some Litres. Very fun!", 
    "review_date": "2011-12-11"
  }, 
  "NthTgIpxBm6DS4N54H2h2A": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Lea D.", 
    "review_text": "Stopped here in May for a beer and a hot pretzel. Both were great. My main complaint was that they ran out of pretzels while we were there. It got quite chilly and a pretzel would have helped stave off the cold. They do have some heavy woolen blankets you can used to huddle up as it gets cold. Staff was friendly and helpful. I would give 4.5 stars if I could.", 
    "review_date": "2012-06-18"
  }, 
  "7bAnU8PIEmAV_tUeaIdCaw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ennie L.", 
    "review_text": "Great beer, great tapas on a sunny day. What else can you ask for? I suggest you wear warm clothes, it is San Francisco after all, some people bring blankets. This place can get pretty packed so be ready to stand and wait for tables to open up. But you can always eat ice cream or drink coffee next door.", 
    "review_date": "2014-06-22"
  }, 
  "hFCUoOVs1rA4FX9Vps9fsg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha L.", 
    "review_text": "Took friends visiting out of town to Biergarten for what i think is a very SF experience, arriving promptly at 3pm to find a line formed around the entire Biergarten's fence. Judging from the number of people and the side of the area i was afraid we weren't going to find a table. That worry quickly washed away when i realized we were actually standing in the food line and not purely an entry line. Once they open the doors anyone can walk right in and bypass the line to stake out a table! I highly suggesting splitting your party up - half find a table and half stay in line to order.  I truly believe i spend half my time waiting in lines in the city. Most of the time it's to eat at places like this biergarten where reservations aren't accepted. Almost 45 minutes later we finally place our order! Order all your drinks and food the first round because you will NOT want to get back in line.  The atmosphere is perfect for a laid back group who share a love of tasty beers and german food. It's trendy, in the middle of hayes valley, neighboring Smitten's ice cream and a Blue Bottle kiosk.The wind picks up like mad as the sun starts to dim. Drinking more beer doesn't always keep us warm enough! Luckily they know this at Biergarten and provide heavy duty blankets for us wimps in SF who can't handle a little cold.  Get the pickled deviled eggs, bratwurst with sauerkraut, and pretzels to go around. The horseradish only encouraged me to drink more beer!", 
    "review_date": "2013-04-27"
  }, 
  "zosAwt-mNQhcrLhYpOA1-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa G.", 
    "review_text": "There's not a lot I enjoy doing more on a lazy San Francisco afternoon than sitting back, enjoying the fresh air, and drinking. It didn't take a genius to decide that this kind of place might thrive in a place like Hayes Valley, but I applaud him nonetheless.   There's plenty of tables, they've got a great location and on a nice day, this place is pretty close to perfect. But the wait can be long (or really long) and even with a beer, can get pretty bone-chillingly cold. If you can will yourself to look past that, you're golden!", 
    "review_date": "2011-12-14"
  }, 
  "3bh9OmTJRLNtj-dqYauugA": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Yan L.", 
    "review_text": "The lines are quite long, and the prices for beer aren't great.  Overall though, its a nice change from your dark, loud bar, and a great way to spend a nice day with friends.  Gather up your favorite people and go enjoy some sunlight.  Yay vitamin D! And beer, Yay beer!", 
    "review_date": "2012-07-09"
  }, 
  "xRy7WI7s8wdhibk8VmWK6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul U.", 
    "review_text": "Biergarten is an awesome place to drink outside and relax with your friends. I want to give this place 5 stars but I had to take a star away because of the really long wait in line to order drinks. The line goes all the way outside of the area, so much that when we first got there, I thought it was a line to get in.   The beer is good. You can get one of the large beers for about $16. There's also a bunch of different food here you can eat after drinking. I suggest having one or two people waiting in line. Once that person is close to the front, everyone needs to give their ID's to that person and they would just order all the beers. When we brought the beer back, we didn't give the ID's back to people until they gave us money for their beer lol. It worked out in the end since most people had cash.   There's a bunch of seating but it's good to get here a little early to have someone save seats, it does fill up fast. But people are friendly and don't mind sharing the tables with other people. It was sunny when we came here but there was a slight wind, which made it great. My friend told me on really nice days, this place gets crazy packed. Later on in the early evening it started getting cloudy and chilly. But that's SF for you, so be prepared.   The bathrooms are in the back. The guys restroom is just one room and inside there's the toilet seat and the urinal. The faucet is back outside in middle between the men and women doors.   Overall, this is a great place to day drink, chill and enjoy the weather outside with friends. The wait to order beer/food is a bit long but not too bad if you wait with a friend.  Pros: -1L beers for $16 -Outdoor sitting -Great place to chill with friends  Cons: -Line to order beer/food can take awhile -No music", 
    "review_date": "2014-06-14"
  }, 
  "Vp6rrcLo9MrubLNAJ4rOPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "adrian b.", 
    "review_text": "I went on a Wednesday evening, and the line was not long at all. Had some good beer and German food. I can't complain. Also, the atmosphere and lighting are great as it gets dark out", 
    "review_date": "2013-08-18"
  }, 
  "xVMj0Y_ps5dxH8F7iGo_zg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tosh C.", 
    "review_text": "I like this place. The traditional beer garden tables are a nice touch and the beer is always fresh. The food is typical German beer garden faire.   Its a bit industrial feeling and I'm not super fond of the chain link fence around the beer garden but it's a minor visual annoyance at best. Still a good place to drink some good German beer and soak up some SF fog..  The biggest con for me Is that it's NOT family friendly. Real German beer gardens aren't bars, they're for the whole family to enjoy.", 
    "review_date": "2013-07-12"
  }, 
  "upRh352VwnipRRWsnJP8SA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlin F.", 
    "review_text": "Outside beer drinking? Yes please! it may cost you an extra dollar or two but their beers are excellent in my opinion, and it's right on a park. Love this spot, and the bread pudding w/side salad was delicious!!!!  check it out.", 
    "review_date": "2012-02-08"
  }, 
  "3Lo7HJNH4XRO5ICexadJew": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Chris H.", 
    "review_text": "Relaxing outdoor space in the middle of SF? Yep, it does exist. Walking by you might mistake it for an rundown park with its miscellaneous picnics tables scattered about, but work taking the detour in.   I visited on a Wednesday night when the burger special runs - a time I highly recommend. Less crowded than weekend afternoons and food is excellent. If it gets cold just ask for a blanket! They have plenty to share.", 
    "review_date": "2013-09-11"
  }, 
  "jJ_4oO6uK8gCGq6jKFJ3xA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Brian L.", 
    "review_text": "My cousin showed me the Yelp page for Biergarten and I tinged at the thought of going here. Hipsters. Cold SF weather. (insert something crummy about SF). Was I wrong!  When I got here with my cousin and her friend I was expecting the line to stretch out into the sidewalk but it didn't, so the wait time was very reasonable. Also keep an eye out for a space opening up so you can sit down with your glorious liter of beer. When I went to order, the person working the taps was very friendly and helped me choose a beer, even offering me if I wanted to try some to make sure I would like it.   We all got a liter of Edelweiss and that was enjoyable. As for the food (I'm not sure if it was because I was hungry or not) we ordered the bratwurst with sauerkraut and that was pretty delish. Later we asked the server as he was cleaning up our trays what he would recommend. He said that the sliders (cow tongue and pork belly) were good. I was thrown off when he said cow tongue but I just bit the bullet and ate it. It was pretty delicious on my part. Never know unless you try...  I also saw the reviews for Biergarten and saw some contradicting things. The one review saying they couldn't get a knife? There were knifes and forks a plenty! When we ran out of napkins we flagged down a server and he put in more napkins in the cup where it was organized with the forks and knives. And I'm not sick from the food...  Although it was my first time there, some pro-tips to follow by the next time I go: 1. Dress in layers (SF weather can get really cold and windy in an instant). 2. If you start getting cold, they lend out blankets, but get them before they lend them all out!  3. Just get the liter. Don't skimp out on yourself. 3. It'll probably be better to come on a \"off\" day, as in Wednesday or Thursday probably when they open up or later in the evening. I went on a Wednesday at around 6:30PM and it looked like it was dying out around 8PM ish. 4. GO WITH FRIENDS!!!", 
    "review_date": "2012-06-28"
  }, 
  "G_tm-a-dmje4Cou0v3Eohg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah K.", 
    "review_text": "I've only been here once but this place is pretty cool. It's set outdoors so there's plenty of space. There's a bunch of benches everywhere so there's plenty of seating for people as well. I got the big glass of beer and it was pretty good, unfortunately i have no idea what i ordered (haha noob -____-\"). I had to just ask the worker behind the counter to give me some recommendations and i pointed to it and said \"that one\". the workers were nice, no one bothers you, and the environment is really chill. it's just somewhere you can sit down, relax, talk and have a good time. I didn't order any food so i can't really comment, but i saw a lot of food orders being taken..maybe i'll try it next time heh~", 
    "review_date": "2012-01-03"
  }, 
  "tlY0QMQDyfjQAEwHnzvFnw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken G.", 
    "review_text": "I really liked this spot...it's perfect for Hayes Valley.  On a nice, sunny day, this is the perfect spot for enjoying beer, wine and a small selection of edibles outdoors.  The beer options are great and after sampling a few of them, I really enjoyed everything.  The food was very good too - I had a wurst with sauerkraut, both of which were fresh and fantastic.  The pretzel was fresh and perfect as well.  This place is extremely popular and people will be put off by the long line to get in.  Seating is limited so you just have to expect it.    The crowd is very cool and chic, but still laid back.    I can imagine it being an irritating place to be on a cold, overcast or windy day (most days during a summer in San Francisco?), so I'd suggest making sure the temperature is going to be sunny and perfect before going.", 
    "review_date": "2012-04-19"
  }, 
  "OLEkdkP8u2LZKBJCHFIOwQ": {
    "user_rating": 2.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Siddika P.", 
    "review_text": "This place was so trendy and I was actually expecting something better. You need to wait a long line to have beer. There are few pretzel like things to eat -- not great. Nice to sit and drink outdoors but there are lots of other places you can do that. There is not much special about this place.", 
    "review_date": "2013-06-17"
  }, 
  "yrWJ4YZWvFj_NDOvTRaAqA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jessie M.", 
    "review_text": "They need to expand. The wait is insane. Over an hour to get in and nowhere to sit, but was able to grab one of their blankets and sit on the ground with my friends. It's a great wonderful fabulous idea that should be all over the place. Every neighborhood in every major city should have this. But it should be at least twice as big. I promise everyone will be happier. Such a cool place.", 
    "review_date": "2012-05-15"
  }, 
  "NdNHNG8Kfk6Zapegb1WNYg": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Lauren S.", 
    "review_text": "Food was awesome, beer amazing, service awesome, friendly opened environment. I'll be back.", 
    "review_date": "2014-09-07"
  }, 
  "NZVlyDyTMAHfkNKaELddBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy C.", 
    "review_text": "I. Love. This. Place.   The first night I moved to San Francisco, my friends and I were exhausted from lugging furniture all day and decided to check out the neighborhood.  After a hearty meal at Patxi's, we stumbled upon the cute public space and were drawn to the twinkling lights above the Biergarten.  I've been back several times ever since.  I've tried a few of their beers (the selection isn't vast, so this isn't difficult), and my favorite is their Schneider Weisse.  I've taken every person that's visited me to this beer garden, shared seeded pretzels, pickles, and the occasional pretzel-wich, and had many great afternoons here.  It's a shame this place closes so early (especially on Sundays), but it's completely understandable based on the neighborhood and outdoor location.  Make sure to dress warmly, and keep an eye out for the friendly staff that come by with cozy blankets at night!", 
    "review_date": "2012-09-06"
  }, 
  "d8z9uG3SHTgkCNj5iVcG8w": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Laura B.", 
    "review_text": "Stopped here during a bachelorette bar crawl and have to say - way better than any smelly, stuffy bar you could otherwise go to. If you're trying to shirk the skeevy types, a well-lit picnic table ensures that only the most brazen will try to strike up a conversation - perfect for the jean-clad lady that just wants to have a goddamn beer in peace.   The beer is alright, heavy on the hoppy options if that's your scene. They serve food, which is a huge plus, and I prefer the environment considerably to Zeitgeist. If it gets chilly (or never gets not chilly, I should say) there are fleece blankets to wrap yourself in. Biergarten scored fairly low on the hipster-o-meter when we were there, but we may have just gotten lucky.   Bring cash, bring friends, and enjoy some outside beers. :-)", 
    "review_date": "2014-04-17"
  }, 
  "li85I9BtJme3KAmN02CzEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jai D.", 
    "review_text": "Dam fine place for afternoon buckets of hardy German beer and devilishly tasty snacks. Speaking of snacks, don't miss their blood devil eggs and most any dessert they have on the menu.  Best: location, beer garden, people watching, next to park and food Not so Best: parking, long line, no cocktails, need lots of sunscreen", 
    "review_date": "2014-07-12"
  }, 
  "rJtmzioJOpNCqV5mCMt34Q": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Annie N.", 
    "review_text": "BEER: 4.5 Not a large selection of beer, but definitely a great one! I probably had one of the best hefeweizens I've ever tasted in the US; it was the closest thing to the hefeweizens I tried in Munich. The red ale was also a solid choice.   FOOD: 3 Can't really say much, but I had their pretzels and pickles. Pretzels were okay, kind of dry. Homemade pickles were great.  ATMOSPHERE: 5 Outside, picnic style seating only. Laid-back. Cute. It reminded me of a backyard.", 
    "review_date": "2014-07-17"
  }, 
  "Rr64EomDocCXIzZOEO-TIg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Matt R.", 
    "review_text": "We were visiting San Francisco and it was a particularly nice Friday afternoon with plenty of sunshine so this place sounded perfect. Plenty of seating, lively crowd, great pretzels, and most importantly, very good beer. I wish there was a place like this in LA cuz this is where it's at.", 
    "review_date": "2014-06-14"
  }, 
  "8kgQupO4TS2bpCGSPhTTIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle L.", 
    "review_text": "Amazing find tucked away in Hayes Valley. A low key beer garden with good food, beers, and atmosphere for post work shenanigans.  Though this place was crowded on a Friday afternoon, I was able to squeeze myself at the end of one of their tables, liter beer in hand. (Not as exciting as the 2 liter boot I attacked at Leopold's, but definitely reminiscent of pint/liter night in college).   Their pork belly sliders were pretty memorable, though they are small. I really wanted a pretzel :( but unfortunately by the time I had reached the front of the line they were out. Next time!!", 
    "review_date": "2013-02-19"
  }, 
  "vI2Oc__Y4ehNoO0S_v1QOg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Magda G.", 
    "review_text": "Great beer place that provides blankets but the food prices are outrageous.", 
    "review_date": "2013-10-07"
  }, 
  "qTGlSrvoH8v84d0mSEwiQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JY L.", 
    "review_text": "love the atmosphere!!!! outdoor drinking with blankets and lights.    I can't pronounce or spell the beers we got but let's just say the place is a beer lover paradise. The food was pretty good too!!!   yes the pretzel is just as good as the other reviews say it is.  so must get something with their pretzel in it!!!!!", 
    "review_date": "2013-03-25"
  }, 
  "4XIjdvV3bz-e_NYzJRJLHg": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Leah B.", 
    "review_text": "Fun place to come for happy hour on a sunny day. There are long lines for food, drinks and the bathroom but its just because its busy....   Grab a stein and a picnic table and enjoy.", 
    "review_date": "2013-05-29"
  }, 
  "oHgFEYuxCs9KDmYZ55qHOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "F. P.", 
    "review_text": "Great spot to catch up with friends.  Chilly weather may thin the crowds slightly but the place was still packed around 7pm.  The half liter of Schneider Edel-Weisse hits the spot - very smooth and filling.   Haven't tried the food yet but will get there.", 
    "review_date": "2013-10-26"
  }, 
  "6hFSmCvWcf6puZB_8s4oUQ": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Andrew S.", 
    "review_text": "Great idea, and the beer is authentic..as is the food.   Issue is that there aren't enough points-of-sale...lines were RIDICULOUS  last night, to the point we ended up sharing our liters and heading elsewhere so we could actually buy drinks.    Definitely much better in the afternoon - after 7pm, I'd avoid unless they get more taps and registers.", 
    "review_date": "2011-10-22"
  }, 
  "opdbggrufvUGH8gP9wHL8w": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Brian S.", 
    "review_text": "Pros:  1) It's modeled after a traditional outdoor biergarten with communal tables, some shade, and a friendly vibe. 2) They have HUGE beers. 3) There are lots of traditional German snacks and entrees.  4) It's close to BART and Muni. 5) They have clean bathrooms.  Cons: 1) This place is expensive! A 1/2 litre will set you back $9, a full litre is almost double that! 2) There are no ciders on tap, only in bottles. 3) Parking is terrible if you are driving. 4) Lines can get long.  Overall, it's a good experience, but you are going to pay dearly for it, so if you are just looking for cheap beers, there are better options around.", 
    "review_date": "2014-10-19"
  }, 
  "fkawweeCwxO7cWq8EgEkFw": {
    "user_rating": 3.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Dan M.", 
    "review_text": "This place is legit.  It is what you would expect for great german beer and bratwurst.  They have the Hofbrau classic beer served in the HB german bubble glass steins (1/2 and full liters).  The only problem is that this place is always crowded, which is good for business, but hard to find a seat.  Good atmosphere, and a great place to stop for a beer if the lines are short, and there are several nice eateries in the local area if you aren't in the mood for a wiener.", 
    "review_date": "2013-03-15"
  }, 
  "fo3aQuxapB_QJ5lcCHOVIA": {
    "user_rating": 4.0, 
    "user_location": "Charlotte, NC", 
    "user_name": "Cynthia G.", 
    "review_text": "It was a cold day to be walking around in San Francisco.  This little spot on Octavia is actually housed in a shipping container -- how trendy, right?  But they provided me with a tasty pasture-raised pork bratwurst, kraut, and a hot cup of mulled wine, all of which made it tolerable to huddle at one of their outdoor tables for lunch.  The menu is small -- beer, sausages, a few things for the vegetarians.  Focus on one thing, do it well. I will definitely come back to see if it's still here the next time I'm in town.", 
    "review_date": "2013-01-26"
  }, 
  "LyrAjv8V6HWkceuTB4Xtkw": {
    "user_rating": 3.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Duke C.", 
    "review_text": "The idea of having a beer garden in the middle of a beautiful neighborhood is awesome, but there's just so much waiting!  At Biergarten, you order your beer first, then look for a seat at the communal picnic tables... that is, if you can find one by the time you get your beer.  The line to get the beer is long, especially on a beautiful Sunday when the sun's out for once.  I only waited for about 40 minutes (keyword: about).  My friends have waited for as long as an hour.  Sorta ridiculous to wait an hour just to get a beer to sit outside.    They provide blankets if it does get a little chilly!  But I do get why people's willing to wait.  Having a beer outdoors is just so much more enjoyable, especially if you can enjoy it from a legit litre glass.  Only German brews are carried here.  I do wish that they serve a bigger variety but I guess they are staying true!  You can get the smaller size, but just get the litre.  It's not worth it to go back in line just to get another and c'mon, you just look much cooler!  There was a polka band (I think) playing at the time.  Pretty cool!  In the end, cool spot, but the wait is too long for me, and I do wish there was more of a variety.", 
    "review_date": "2012-07-05"
  }, 
  "Eta74v62eS9-2UWfW3oBcQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle P.", 
    "review_text": "All I wanted was a knife, so I went to the KITCHEN.  You know, where you'd expect a knife to be.  The hipster working behind the counter gave me a blank stare when I told him that there were no more knives on our tables or at the ones around ours.  \"you mean there isn't a knife in the whole place?\"  Don't be snarky with me in my own city, hipster.  Just give me a fucking knife.  And then there was the pain of the next 3 days, the discomfort.  I think it was the sausage, because my boyfriend had it too (see his review somewhere below.)  Gross.  Please be cleaner.  I'll stick to Suppenkuche, Waltzwerk and/or Schmidt's.  Never gotten sick or snarked at in any of those establishments.", 
    "review_date": "2012-06-25"
  }, 
  "JUfeYfJ6XtZAWxCpC1Zw0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sally T.", 
    "review_text": "What an awesome place to spend a chill afternoon sipping on some beer, or for some full on day drinking!   This little outdoor beer garden is located in Hayes Valley, right next to a little park with a playground. Almost makes you feel like you're in a suburb, and not right in the middle of the city!  We came on a sunny Sunday afternoon a couple minutes after they opened. The line was relatively short and a couple tables were free. After we sat down though, the place started to fill up FAST! Before long, there were people standing around waiting for tables, and the line was out the entrance! I suggest trying to come as close to opening as possible, cause this place gets packed.  The beers they have are unique and tasty, and are fairly priced. They offer half and full liter glasses. I didn't get the chance to sample the food, the pretzels looked amazing! Maybe next time...", 
    "review_date": "2013-02-13"
  }, 
  "LIJyH-dZO7SERCOPjvRIGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anastasia N.", 
    "review_text": "When it's sunny in SF, I highly recommend checking this spot out! It has an ample amount of outdoor seating (picnic tables). It's a pretty social place, which makes it awkward for those weird SF techies (not me)! I recommend coming here with a group of friends but would not recommend coming here on a date.   Now... let's talk about the important stuff... the beer! I was impressed at the size of the beer that they serve. You can either get a very large beer in a glass or a HUGE glass. Honestly, unless you're chugging the huge glass, why would you get it? Beer is pretty nasty once it's warm, so go with the smaller glass, which is still very big!   This place is located in a great location. There's tons of parking, it's close to muni/bart/freeway and if it's sunny in SF, it'll be sunny here!   Service is ehh... whatever. You order up front and then you go sit down. The woman that was working there when I was here a couple of weekends ago wasn't friendly and didn't seem like she wanted to be there - maybe she was having a bad day?", 
    "review_date": "2014-08-07"
  }, 
  "vguybeVhVDGETEm68XzggQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kimya P.", 
    "review_text": "Depending on the type of beer you choose a 1/2 liter can be anywhere from $6-8.  Their beer selection is limited in comparison to Suppenkuche but the Schneider weisse hits the spot.   Bratwurst basket is perfect for two ($18): one sausage for each of you, a pretzel to share, and for dipping - horseradish (that WILL clear up your nose) and brown mustard. (<a href=\"http://www.yelp.com/biz_photos/GfeaoeKtZh-57SFWgjPqnw?select=eFrF65UAqKeei47XHGh8oA\">yelp.com/biz_photos/Gfea…</a>)  The place is crowded, but as long as you are willing to make friends and share tables, it's great fun especially on a sunny Saturday afternoon.", 
    "review_date": "2012-02-16"
  }, 
  "5htZmd5SUvcM7QrKp-ITIQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tina M.", 
    "review_text": "Beer garden? Where's the grass? I've been to England where beer gardens are common and this is not a beer garden. I know this is a German beer garden, but is this how German's do it?  The wait for beer is not worth it.   If you want a beer garden Park Chalet is the place. You can lounge on the grass!", 
    "review_date": "2014-01-09"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "It's a decent spot to hang out when the weather permits. When it doesn't and Karl is out in full force, they give out blankets. Although I wouldn't really want to use them because let's be real here, how often do they wash them?   Decently priced beers. Pretzel wasn't that great, but pickled devil eggs were amazing.   Sometimes there's a long arse line to get in. When that's the case it's not really worth waiting.   The crowd seems fairly mixed, although there's an occasional genius who will bring their toddler in with them and give me evil side eye just because I dropped an F bomb. Seriously, who the heck brings kids into bars? Stop doing that. Hayes Valley people, I swear.", 
    "review_date": "2014-11-26"
  }, 
  "-siweRJBohCIUFg0skChJQ": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Brent J.", 
    "review_text": "Pros: Great atmosphere  Amazing beer Superb staff   Cons: Quite pricey ($8sm/$16 lg) Closes at 9pm  Overall, this is a pretty cool spot. I would definitely recommend giving it a shot of you want some good beer in a unique, laid-back setting.", 
    "review_date": "2014-06-30"
  }, 
  "R7ALX4yl8Er_WJm_vyhzig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie A.", 
    "review_text": "Yes this is a very good place to have a few biers with your friends.  The bier selection is pretty good. They seem to change the bier selection from week to week.  They have a great Oktoberfest bier right now. Brats and pretzels are good as well.  OK my 2cents on this place.  They really have to figure a way to move the bier line faster.  When it is busy it can take upwards of 15 minutes to get a bier refill.  If you are like me, when my bier is empty I WANT another bier STAT!  It seemed like our group always had someone in line to get biers for us.  If they had a dedicated person just to pour biers I am sure that the line move faster, just like they do at street fairs.  Will I go back, ABSOLUTELY,  Matthew and his brother have a pretty good thing going on there.", 
    "review_date": "2011-11-10"
  }, 
  "4RlzFohEgBdFXUGoqvpZqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa N.", 
    "review_text": "We (my husband and I) came here a couple weeks ago on our quest to try 52 new places in 52 weeks.   Hayes Valley has been waiting for you Biergarten!  Came here after work on one of those \"70 degrees and sunny\" days in San Francisco. I should have been prepared for this since I've heard so many great things, but this place was PACKED. We waited on a very long line to get our beers, but luckily while waiting on line you are able to scout out possible seats. I luckily spied two open spots at a crowded table and we swooped in. The beers are your typical german beers, but something about having them outside, under market-lights,  with a hundred other people some how makes them tastier.   But beware! When the temperature drops this place gets chilllly. Which is why they have blankets. Which I am a BIG fan of.", 
    "review_date": "2012-03-12"
  }, 
  "ixYLMqLBLo4tfcuQ-ewk9g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karla R.", 
    "review_text": "Great place to hang out, but I wouldn't come here for either the beer or the food- both are just OK.", 
    "review_date": "2014-03-18"
  }, 
  "OaRk-RwFEzfOtc45ff0fGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "It may be hard to snag a place to sit at times, and the beer selection is somewhat limited (4-5 beers on tap), but when the weather and company are right, this place is the damn haps.  They even give out free cookies while you're waiting in line.", 
    "review_date": "2011-12-20"
  }, 
  "YsmpZbsJAWRT0jZOzhJeLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madeline S.", 
    "review_text": "I love this place! Chill outdoor seating, a few beers to choose from in a 1/2 or 1 liter, excellent saurkraut and sausages, and a perfect happy hour spot with friends. I only wish they had more seating as sometimes it can get so packed and you have no where to sit but on a sunny day in SF, this is perfect.", 
    "review_date": "2014-08-24"
  }, 
  "HAv257_IVJnQT0ZIL8Nn-Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg G.", 
    "review_text": "So I live a block away from this place and have had every opportunity to come here. I like the beer, the food and the people. However every time I come here I get the feeling that I would rather be indoors. Why? Because it's cold in this area. This beer garden is only open in the evenings during the week and it's placed at the bottom of the hill which practically becomes a wind tunnel. It can be absolutely miserable at times. Yes they hand out blankets, but how can you hold a stein, a bratwurst AND a little blanket and not begin to question ... why the hell am I sitting out here? I would rather just go to Suppenküche indoors where it is warm and the same super nice people are too. I know it's about being seen and people watch, but I don't need that. I can go to the park and grab a hot coffee if I want that. I usually only come for the novelty when showing friends around the neighborhood at this point. Even though it is not one of my regular spots in the neighborhood, it is at least worth a try.", 
    "review_date": "2013-01-01"
  }, 
  "ll7_ReyVWvpHHhpsettHHQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Veronica L.", 
    "review_text": "I really like this place! Is it weird that I'd like to have my wedding reception here? Love the layout--it's really, as everyone says, an old parking lot, and you order your beer/food in like a trailer. you have a wide selection of beers and some are in a 0.5 or 1 liter so come on an empty stomach. there's a decent selection of food--definitely try the pretzel, cheese knot, anything pretzel-related. this would be great on a warm sunny day, but i would alsoo like to come at night because they have super cute light bulbs hanging across.", 
    "review_date": "2013-03-16"
  }, 
  "59c9WVezfKKciJpWSGdlBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raymond H.", 
    "review_text": "Great beer selection, can get cold. Looking forward to trying their food.", 
    "review_date": "2012-12-16"
  }, 
  "b24YVfJROxU3FxiJKs2NKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yume S.", 
    "review_text": "Another one of my favorite places to drink in San Francisco.  Every single time, yes EVERY SINGLE TIME, I have a friend from out of town visiting, this is where I take them.  And they love it too.  First, it's a nice outdoor spot, when weather permits.  They have a good variety of beers and food.  I usually order a light lager and my boyfriend and I always order pretzels and the potato salad.  I know we have tried other things which are good too but we always order that.  It's a must have!  On the weekends there is usually a long line to order drinks and food, but there are always spots open at a table.  Only once I had to walk around like a hawk while my group was waiting in line.  It doesn't get too loud and rowdy so you can actually have a nice conversation without struggling to listen to each other and screaming over the noise.    The only down side is that it closes early but it's understandable, outdoor bar in a relatively quiet neighborhood.  But no problem, there are plenty of other places to venture off to when Biergarten closes!", 
    "review_date": "2014-12-02"
  }, 
  "p6qMidPaJ96LgB_9z7xZVw": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Anna W.", 
    "review_text": "On a beautiful Saturday afternoon after having spent all morning at the new Exploratorium acting like overgrown children, my group and I decided that we should reassert our adult-ness by grabbing liters of beer at the Biergarten. None of us had ever been, though we were all intrigued by the Yelp photos of mugs as big as our heads.  We got in line at about 2:45PM-2:50PM (right before they opened), and it had already just turned the corner on the block. They opened at 3PM on the dot, and people immediately either stampeded for the shady tables scattered through the courtyard or moved towards the beer line. By the time we got to the gate, most of the tables were already filled up, so we commandeered what looked like the only empty one left right by the gate itself.  Then, we waited for our beers. It took us about 30 minutes before we even got to order. Not that I ever really mind having to wait, but I should be waiting for beers that I can't find anywhere else. The beers that Biergarten had on tap were ones that you could find at most good, local liquor shops. But whatever, we were here to enjoy the Biergarten for what it was.  At $7-10 a half liter and twice that for a full liter, and with food ranging from another $4-16 (from the knots to the baskets), Boyfriend and I ran up a $42 tab for a liter and a half of beer, a frankfurter with sauerkraut and a bratwurst with curried potatoes. Everything was yummy, but not mouthwateringly rave-worthy.  Overall verdict: a very nice little spot with the potential to be very chill, but a little over-hyped. I would totally go back -- but at the prices they're charging and for what you get in return, I might just grab their beer only instead of snagging something to munch on, too.", 
    "review_date": "2013-09-10"
  }, 
  "VRmDogwQ_KG7brajIuoc4g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Neilu A.", 
    "review_text": "This place is pretty good if you are looking for a laid-back spot during the day. If you are trying to rage then I probably wouldn't recommend coming here. Biggest reason being that they only serve beer- meaning no hard alc. So if you are trying to get rowdy then I would probably recommend Tipsy Pig or Brickyard to fulfill those needs. Anyways, the line here gets pretty long so I think if you can get there before it opens and get in line then that would probably be your best bet. If you are with a group of friends and looking to sit somewhere outside then this is definitely a cool spot as long as it isn't too windy outside. Personally, I think the Marina is more my scene but if you want a more chill place then Biergarten might be your go to!", 
    "review_date": "2014-05-27"
  }, 
  "1yv6GXttiII_-od7HaUcfA": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Dmitriy S.", 
    "review_text": "In order to avoid the ridiculously overpriced SF Oktoberfest, my friends and I headed to Biergarten to celebrate the first day of the world's greatest drinking holiday. Lines were out the door (or rather fence), but that didn't stop us.  Biergarten is a very simple concept. You get your beer, sit down at a table with your buds, and simply enjoy the blissful world of Hayes Valley around you. Aside from lights and umbrellas, there's no decorations.   Beer selection is minimal, but high quality. For Oktoberfest, they had around 5 different beers, including the famous but mediocre Hofbräu Oktoberfestbier and the delightful Hacker-Pschorr Oktoberfest-Märzen. $7 for 1/2L and $14 for 1L. Pretty decent prices for high quality beer.   In addition to beer, you get your choice of typical German street foods. Bratwurst, pretzels, deviled eggs, etc. It doesn't even compare with what you'd find at a festival in Germany, but it's good enough to balance out your beer. I got a Frankfurter, which is served with mustard and sauerkraut. Although it was pretty tasty, it's not worth $8. Most of the food items are heavily overpriced, so I advise you eat before coming here.   The venue gets crowded very easily, especially on a weekend or such a big holiday, so scoping out seats is a must. They could easily put more tables in here. Also, since you're outside, be ready for the temperature changes.   Overall, a great place to enjoy one of Germany's most vital contributions to American society.", 
    "review_date": "2013-09-25"
  }, 
  "vTbQZNz8FH4jcrni7Vkl1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oleg H.", 
    "review_text": "Line's suck - but can be worth it.  While it can be a veritable clustetr$%&amp;(k on hot sunny weekend days, it is so for a reason. Beer is great, the food is better, the vibe is cool even when crowded - what else can one expect from the masterminds behind Suppenkuche?   Five stars - even WITH The insane lines.", 
    "review_date": "2013-07-25"
  }, 
  "rBFW_lVT3r400-Eg2yzVrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy F.", 
    "review_text": "In summary, there's really nothing better than being with friends under the perfect sunset after a long day of work enjoying an ice cold one and a pretzel.  Sorry, minus one star for not wanting to stand in the long line again for a refill on the beer.  Well, on to the next watering hole...", 
    "review_date": "2012-02-07"
  }, 
  "GnkhVQoyUgFtnpBE_gnk3g": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Alyssa Y.", 
    "review_text": "Classic SF (interpret this as you please).   Yes, the vibe's kinda hipster with the fences and bar-shack-thingy. But as a non-hipster, I do love the vibe here. A small but solid selection of German beers, and the food's pretty good too (avoid the pickle jar; I can't stand pickled eggs and strawberries...). Perfect for catching up with a group of friends, so long as it's not a peak time and you can find an open table.", 
    "review_date": "2014-10-21"
  }, 
  "ULK94n8lgBIG0_F1aIYhvQ": {
    "user_rating": 4.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Rob W.", 
    "review_text": "Can't beat the vibe when the weather is good, but you have to get hear early or the lines get long and the seats fill up.  Decent selection of brews that come in a giant masse.", 
    "review_date": "2014-03-19"
  }, 
  "rLEUWS_JJ7Gh6bV0uHfHkQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Sameer P.", 
    "review_text": "This place is awesome! It was so cold though. They should give people more blankets. Three cheers for the blankets.", 
    "review_date": "2012-03-13"
  }, 
  "GK3Uqy9eYHZgVw6_0ctmsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marina L.", 
    "review_text": "Biergarten has that classic outdoor patio vibe that's great for hanging out with your favorite homies over a few pints that makes you feel like a viking (the pints make my arms feel tiny and weak). As a derivative of Suppenkuche, it's an extension of the German joint in terms of space, only featuring a much more limited menu. With only a couple lagers to choose from and a small selection of bar snacks (think: pretzels, sausages, pickle jars), Biergarten serves you mostly for a cool outdoor atmosphere when you want to impress your friends from out of town who aren't ready for the grit and grime of a typical SF dive bar. If you want more to taste, I would suggest just going to Suppenkuche down the street instead for a full meal and a better selection of beers. If you're looking to just chill on a rare sunny SF day, this is the place.  Things to know: - On really nice weekends, get there when it opens (3pm) to snag a table before it gets too crowded - They don't have space-heaters, so get cozy with some blankets provided in the far corner - They have 2 stalls of clean restrooms, so drink to your heart's content!", 
    "review_date": "2014-09-07"
  }, 
  "kNIWlxpEekeDgGjLMBC9tg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nic E.", 
    "review_text": "Hier ist mein lieblings kneipe!  Ich habe das Bier und der Lebensmittel sehr gern. ;)  Haha Ok just kidding, I won't attempt a German review... Yes, this really is my favorite hangout after work because it's outside and the beer and food rocks!  The people that work here are super nice, the bathrooms are clean (plus it's a good idea to have storage containers for restrooms) and lastly, the atmosphere is great.  Everyone looks like they're having a great time and I love bringing people here.  Super 5 star bonus earner:  Even if it's cold outside, thank you for providing plenty of warm blankets!  Now that's taking care of your customers!", 
    "review_date": "2013-06-25"
  }, 
  "-bj4evSejxRDuvYnmcGNrg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Karen L.", 
    "review_text": "What a fun place, especially for an outdoorsy like me! Do anticipate a line on the weekend for this fun little shack. Once you get to the front the hostess will let you try a few of the brews on tap, hopefully you'll opt for the big stein like I did :) They also serve wine and lite bites, but given the title I think beer is the way to go. They'll have something for everyone's beer taste buds from dark to light. It's a little lot but man do they know how to utilize what little amount of space they have, it's San Francisco so go figure! There's a bunch of picnic tables for you to sit at with friends with lights that they have strung over head for when it gets darker, there's something about those lights that makes sitting out more magical. Even on a beautiful day like when we came, the staff still came around with blankets, how accommodating! I wish there were more places like these in San Jose!", 
    "review_date": "2013-02-28"
  }, 
  "Y-X11AD0MckRX4rSrAlUYQ": {
    "user_rating": 1.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Conor B.", 
    "review_text": "No beer is worth the wait this place has. Te slowest beer in San Francisco. Saturday is about a 2 hour wait for a beer.", 
    "review_date": "2013-10-05"
  }, 
  "JWrONUccWS-RexScWSPWxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark N.", 
    "review_text": "pretzels. brats. beer. Served in exactly the right environment for such. Happiness.", 
    "review_date": "2014-04-30"
  }, 
  "IC03xM7amXLcZF1QoTCGjQ": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Carson T.", 
    "review_text": "I came here with some friends on a late Saturday afternoon, and it was packed! Biergarten definitely feels like a German beer garden. All of the bartenders were very welcoming and nice, which was a delightful change from most of the bars I've been to. I ordered a Schneider Weisse, which came in an attractive, slender, and tall glass, and it tasted just right. The ambience was conducive to fun and relaxing drinking. My friends and I sat in the den behind the bartenders' counter, which had some dim lights, perfect for making you feel a bit tipsy even after one beer. I would definitely come back again with friends!", 
    "review_date": "2013-09-15"
  }, 
  "GrktSJ7Bv9t37gwDLIlAwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "It seems like we've been waiting a long time for this place. Too bad the opening of this place has been set back time and time again because it's no longer summer. Rainy season is upon us and they will be closed. I love Suppenkuche to begin with so I knew there was no way this couldn't be good.  There's a cash only line for pretzels and pickles. The larger line is for everything, including beer and sausages. Though this line can take a long time, it's not that bad if you get yourself a liter to last yourself a while until the next one. I often find myself going to the bar many times throughout the night at a bar, but here, I can settle down with a large liter stein. The pretzel was pretty good, but not the best German pretzel I've had. It was a thin style with mustard and horseradish, comes in seeded or non-seeded versions. The bratwurst with saurkraut was delicious of course, bursting with clear meaty juice.  There are two restrooms that are very clean and roomy. Sinks are smartly located outside. The drinking area is composed of thin picnic tables and thin benches positioned in a radial fashion around a tree. The tables are really close to each other, so you can literally be trapped in the center with the tree if you exit the wrong way. Otherwise, I love the coziness of good company and warm yellow lights on a nippy evening. This really, is a biergarten.  The huge, glaring drawback is that the line to get into the place at all gets long. I understand that this must be nice once you're inside to not have people crowding around you for seats. But still. It's a funny situation. I felt like I was waiting at the border to go to the promise land and that bouncer was US customs. Either that or it felt like prison, but where being in prison was a good thing. Several other people from the inside were at the chain link fence consoling their friends on the outside. I know how this feels because I was on the outside.", 
    "review_date": "2011-11-05"
  }, 
  "SjX_4tpusPeZd_5a7txkXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chanel L.", 
    "review_text": "Right next to Smittens,.. after your dessert friends get their share of ice cream,.. walk on over to the outdoor Biergarten.  They do not have a big selection of beer,. but what makes this place stand out is the outdoor wooden bench seating.  A place to hang out, have good conversations, relax and decide on what to do next for the day/night.", 
    "review_date": "2015-01-20"
  }, 
  "F9yf6eFZMyt0rPgjLFrHCw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Matt Y.", 
    "review_text": "Imagine a small, cozy parking lot filled with picnic tables and people who serve you beer and food from repurposed shipping containers, and you have Biergarten.  Simple, no fuss, no frills.  Beer is limited to a handful of selections, but all of them are good, so no problems there.  Food was very tasty -- good sausages, excellent salads.  The pretzels aren't worth all the ranting and raving, but they're still good.  This place gets really popular really quick, especially on a nice day, so get here early or be prepared to wait.  I got here 30 minutes after opening and had to wait another 30 just to get my food.  Friends who joined us later had to wait even longer.", 
    "review_date": "2012-04-11"
  }, 
  "Bwj4em3C42qDqOr5pz_-ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark P.", 
    "review_text": "A great interpretation of a real German biergarten. Good beer, tasty sausages and fixings.   Minus one star for the chain link fence. I know this part of Hayes Valley is temporary, but, really, that was the best you could do?", 
    "review_date": "2013-05-18"
  }, 
  "JC99U5y-KAchZIjBhf_DiQ": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Vanessa K.", 
    "review_text": "How is it possible that this place is packed, full, and the line for beer is almost around the corner at 3:30pm on a Sunday! Also considering they open at 3pm! Waited an hour for a beer, and it's not because the staff was moving slowly.  It appeared that people who were sitting down with their drinks, kept \"cutting\" and asking their friends who were waiting to get them more beers.  It feels like all the yuppies and hipster wannabe's trek it to hayes valley for the biergarten. Makes the place a little pretentious, and ignoring all of it, it's a great spot.  The beers are delicious and refreshing. Their bratwurst basket is amazing and out of this world. Sauerkraut was done perfectly. Love the pretzel, so soft and buttery.", 
    "review_date": "2012-04-09"
  }, 
  "9rdz74ub05wudQdtOPQjaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Xteethx B.", 
    "review_text": "Bratwurst dog was excellent. I had some shandy type of drink which was nice. Of course if you go on a sunny day, lines will be long and there isn't always a place to sit. Still the service is good.", 
    "review_date": "2013-11-16"
  }, 
  "lFdcgrMkHCmvTjMEw4CVDQ": {
    "user_rating": 4.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Joy A.", 
    "review_text": "I'd only come here on a Wednesday or Thursday...because every other day, you're bound to wait forever in line and share communal tables with douchey peeps.   The best food items: deviled eggs, pickled veggies, pork belly sliders and the burger. Pork belly sliders are what's up.", 
    "review_date": "2013-08-08"
  }, 
  "2AW-NegGX-SOjtk6UqVXjw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ryan M.", 
    "review_text": "Feels as if I am back in Munich at a bier garden. Great vibe and beer. We actually walked over here while waiting for our table Suppenküche. Will definitely be back soon to try some of the food, the pretzels were amazing.", 
    "review_date": "2013-09-23"
  }, 
  "ziHpifBFfjyJQOf4DvzsQw": {
    "user_rating": 4.0, 
    "user_location": "Saint Helena, CA", 
    "user_name": "William W.", 
    "review_text": "Stupidly busy on nice days and they need to figure out a more efficient beer delivery system.  That being said, great atmosphere, great beer and the beet salad is to die for.", 
    "review_date": "2012-04-23"
  }, 
  "uBQIboVaOfJ_BXn34_JKCA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Poochie M.", 
    "review_text": "I'm sorry but a real bier garten opens at 10 AM not 3 PM.  This just won't work with my schedule.", 
    "review_date": "2012-08-02"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "If you are lucky enough to get a seat and a beer without waiting for an hour in line, then this is a great place on a sunny day.  However if you show up and see a line, then it's a tough call since it can take a while to get through...but the beers are tasty and there are expanding the menu there.", 
    "review_date": "2012-11-26"
  }, 
  "jPG9VvKCfp4RAMuaRFD91Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thi N.", 
    "review_text": "A perfect place to spend the 5 sunny days we get per year in SF.  Unfortunately, when my friends and I came here in mid-July, it was overcast and cold.  The free blankets you can borrow definitely came in handy.  We arrived maybe half an hour after opening and it was already pretty crowded.  We did manage to snag seats.  As more and more people piled in, the beer line got a bit ridiculous such that a light-weight such as myself could sober up waiting to get to the front.  Okay, I exaggerate; the wait is just annoyingly long.  With the beer line that crazy, imagine the bathroom line!  Despite the wait and crowdedness, the beer is good and the food looked good.", 
    "review_date": "2013-10-12"
  }, 
  "lIEV2jrzUrzub7b5WF-daA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Olivier M.", 
    "review_text": "One of this special places you need to know in SF. The food is quite good also.", 
    "review_date": "2014-11-11"
  }, 
  "KCaOZUnCx25FJhFr_lKsEg": {
    "user_rating": 4.0, 
    "user_location": "Mill Creek, WA", 
    "user_name": "Heidi M.", 
    "review_text": "The beer selection is very limited, but the ones I tried were delicious.  The prices for a 1L serving are pretty spendy, though, so I suggest asking to taste first if you're not familiar with the beers to ensure you like what you're getting.  So far I've only tried a few things from the kitchen, but everything I've tried was really good.  The pickles and deviled eggs were great snacks (though I'm not really sure I'm feeling the bright pink dye (beets?) on the eggs).  Sausages were delicious too.   Service is quick though the lines are usually pretty long.  Other patrons have been really friendly about sharing the limited number of tables.  They have heavy blankets for colder days and nights. How cool is that?  My only complaints are that it does get VERY crowded.  You can end up waiting for 15+ minutes to get a drink, and even longer to snag a table.  I wish their opening hours weren't so limited, as it's tough to get a group together while they're open.  Finally, they don't allow smoking.  Not a big deal for me, as I don't smoke, but it's yet another reason I have trouble convincing friends to come here.  Sometimes we wonder why we didn't just go to Zeitgeist..", 
    "review_date": "2012-09-06"
  }, 
  "AsZ0TjeBnhHIVxhVBP3lsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "stefanie h.", 
    "review_text": "i think i'm obligated to give the biergarten at least 4 stars just because of it's sheer proximity to me (2 blocks away). come here with a friend or 5, grab a beer, grab a blanket, laugh at the guy in the pink polo shirt and neon green shades. or not. that's the beauty of it all--you're outside in the best city in the world having a beer with some friends, do whatever you want. what could be better?  this place just makes you feel a bit optimistic about everything, despite what some may view as setbacks:  - limited beer selection = who cares, there is still beer, and all of it is good! - it's cold outside = they have wool blankets! - the obnoxious hipsters/scenesters/____ group you don't identify with = come with your own friends and ignore them!  see, everything is great at the biergarten! (disclaimer: may take a beer or 2 to agree with all of the above).", 
    "review_date": "2012-09-24"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "If there were a dictionary entry for Biergarten, it might looks something like this:  bier-gar-den [beer-gahr-dn]   noun 1. a fertile and delightful spot or region ripe for consuming beer in the great outdoors on beautiful days in san francisco.  2. zeitgeist's older, more successful/affluent, less-tattooed, and better dressed sibling in hayes valley.  True story.  Unlike Zeitgeist, however... it'll take you at least 30 minutes of standing in a single-file line to get a beer on a nice day. Heed the advice of the folks pouring and order all (yes... even if you're planning on staying for multiple hours) of your beer at one time. Even if it gets a little warm, it's much better than standing at the back of the line once you reach the bottom of your glass. Trust Uncle Ruggeford on this one, kiddos.  For the non-beer drinkers, they have a house red and house white option as well. In vino veritas!", 
    "review_date": "2012-02-09"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "Once they work out all the kinks, Biergarten has a chance to be my favorite al fresco watering hole in the city.   Now about those kinks...sure, the place is brand new, has been all over Thrillist, Daily Candy, Eater SF, Urban Daddy, Tabblehopper, Yelp, etc. etc. And opening weekend happened to be one of the nicest days of the year. So we did the smart thing and hopped in line at 2:40. We were inside right at 3pm and had no problem grabbing a table, though by the time the dust settled the line to get beer was almost as long as the line to get in the door.  Couple suggestions - maybe have an auxiliary bar set up to sell bottles of beer for those that don't want to wait for the selections out of the taps. Also, it would be great to be able to order food without waiting in that same beer line...it's possible to order pretzels from the food pick up window, why not just order all food there?  That being said, we really loved the place. Tables are communal and encourage chatting with your neighbors. The pretzel I had was fantastic, love that it's served with both mustard and horseradish. And the beer? Pretty damn good.", 
    "review_date": "2011-10-26"
  }, 
  "ey6Q_D0IU0WnrK_akj68bw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn A.", 
    "review_text": "Ordered 4 beers, 2 were served very warm, nearly room temp.  LIne was too long to deal with complaining.  Food was decent and the only thing keeping this place as an option for me in the future.  I changed my review to 1 star because upon further investigation I figured out the problem here.  They store their beer in a metal container type thing that didn't appear to be refrigerated.  On a sunny day like the day I went, surely the temp inside this container has to be 80 degrees+.  If a keg needs to be swapped out during the day or just before opening, it would take hours for a warm keg to cool down in a serving fridge near the taps.  I'm sure I was just victim to a newish keg that had not had the chance to cool down.  How do other bars solve this issue?  They store kegs in fridges... for a place trying to be a legit beer destination, HUGE FAIL on their part.", 
    "review_date": "2014-07-24"
  }, 
  "dAYP0eKdYHgnGLQFF5iddw": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Andy W.", 
    "review_text": "The concept is perfect: an outdoor place to sit and drink beer.  The execution, however, needs work. We waited in line for 20 minutes and when we got to the front some guy just tried to cut in line. I was already hot on this unsual 80 degree day in SF so when someone tried to circumvent the natural order of the line, I was pissed. I called him out on his violation of common decency and he reluctantly went to the end of the line. My fellow patrons appreciated my assertiveness and we moved forward. However, NOT WITHOUT TWO MORE PEOPLE TRYING TO CUT IN LINE. AND THE GUY CHECKING ID's JUST LET THIS SHIT HAPPEN! When I hassled him about it he just said \"look man we just opened and still trying to figure things out.\" So apparently \"figuring things out\" means \"I'm going to pretend that the line is important until someone challenges the integrity of the line and then lie down.\"  I'm a reasonable guy so I can say with certainty that this place was pretty cool. The beer was your standard good german beer and the food was delicious. Like I said, the concept is perfect but the people can seriously ruin it. If the employees and patrons are douches, I won't want to go back. And when San Franciscans are stereotyped as being about equal rights and fairness, its pretty damned irritating to watch them step on other people to get to the front of a line for beers.", 
    "review_date": "2011-11-19"
  }, 
  "6_VkzelWeSHzjTVDlGl-Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "FOOD: I'm not totally into what is this... German food? Kinda immediately unhealthy &amp; unsatisfying munchings. I would only go here if I wanted an outdoor spot to drink beer at.  ATMOSHERE: Outdoor area, bunch of picnic tables to munch on stuff and drink BEER. Went to a Google event here, so even better bc the tab was taken care of. Yee. Middle of Hayes Valley so there still bunch of places around to go before or after or stroll around window shopping.   8.13", 
    "review_date": "2014-12-13"
  }, 
  "V5v4UBEURVvxKXbaatfjyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miri Kwon R.", 
    "review_text": "Great place to hang out on a sunny day/night in SF.   In terms of their food - pork sliders are my favorite - the pretzel is also good. the deviled egg was a bit too salty/sour. the line to order gets long - if you just want extra food, they have a separate line for limited food menus (cash only) - i usually go to the smitten ice cream after for desert :)", 
    "review_date": "2014-04-07"
  }, 
  "aKN3Fq2uaRJTwZRPlI5GcQ": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Alex S.", 
    "review_text": "Biergarten does what it says on the tin. It is a literal beer garden, outside filled with beer and picnic tables, the perfect spot to drink with friends when out in San Francisco.  Until it rains. This place is kind of terrible when it rains.  But it almost never rains in San Francisco.   Except yesterday, when it did.   Still, I would go back. The service is friendly. There's basically just a window for ordering beer and a little bit of food. The selection of beer and wine isn't enormous, they only had a few brands, but as long as you're not picky and looking for a certain style instead, they seemed to have it. The line moved fast and the beer poured faster. After that, tons of picnic tables or standing room for you to fill in and drink at.  And yes, when it rains, there's almost no shelter (a little bit of covered space but not enough for all) so then you're stuck trying to huddle under or drink your drink out in the cold and wet. Ah well.  I enjoyed this simple, fun little space. Just don't go when it's raining. Which it almost never does. Except yesterday.", 
    "review_date": "2014-03-02"
  }, 
  "WALNtcSZlONK4Yj-o3pzKA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan B.", 
    "review_text": "Oh. It has a name. I thought it was just some outdoor randomagical place where strangers cram in with each other onto picnic tables and drain crazy-sized glasses of beer amidst loudness.  We went on Halloween day, which upped the antics that much more. Plus, there was at least one birthday going on. My group had left while I stuck around to sing happy birthday over red velvet(?) cake. There was jack-o'-lantern carving too. But no one had candles, so I turned on the flashlight app on my phone and put it in their pumpkin.  People were super easygoing, including those waiting in the slow-moving bathroom line. Back at the tables, some dude was standing around in a tank top as chilly evening began to fall. I remember asking someone to lend the dude their cape-like thing, and it happened.  I think I got some random phone numbers and business cards too. Happy Halloween. Happy Birthday. Happy Biergarten.", 
    "review_date": "2012-03-22"
  }, 
  "KyZyu1kdc0dDpLUzECtwLw": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Daichi S.", 
    "review_text": "Beirgarten is located in a friendly neighborhood, the place is surrounded by a fence in outer space. There is no actual building, but I love the lively atmosphere.", 
    "review_date": "2013-01-20"
  }, 
  "1e_QfQxgeKTfegDfAfAGWg": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Anthony C.", 
    "review_text": "If you are going to charge $10 for a sausage and your overhead is a shipping container on a Hayes Valley lot, you could at least get some heat lamps for your customers. Guess all that $$$ is going to rent.", 
    "review_date": "2014-02-04"
  }, 
  "BzUgv3R694FZeT7IEo0hBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James M.", 
    "review_text": "Great open spot with large community tables to share a few (liters of) brews with your crew(s).  The line to purchase said brew can take a while, and it gets a bit chilly after the sun goes down, but y'all probably know that already.  Layer up and you'll be just fine.  It's great to have another outdoor beer garden (see biergarten) in the city.   Vielen dank!", 
    "review_date": "2011-10-20"
  }, 
  "yoT5mQ0EeB40AAMi4ZIyTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leanne S.", 
    "review_text": "Beer &amp; patio. What's not to love.  We didn't eat so I can't comment on the food. The beer however certainly delivered. :)", 
    "review_date": "2012-08-06"
  }, 
  "S_MYFfvGM9HpCp04AWs86Q": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Linna L.", 
    "review_text": "On warm, sunny days (the few that SF sees), you'll find Biergarten packed -- so packed that the line to get beer wraps around the block! But in the end, very few things bring as much joy as a liter of good beer with friends in the sunshine. In my book, all the beers are delightful. The razzler (a lemonade and beer mix) is a bit sweet and doesn't have enough alcohol content for me. Yes, this little girl CAN drink :)  Tip #1: If your doom is to wait in a line that wraps around the block (and I've been there before), make your time efficient by grabbing some snack foods from the snack stand (like a pretzel - they're pretty delicious) to make the wait go by faster. Also, waiting in line with friends is always a plus.  Tip #2: If you see that you have about a third of your liter beer left and you feel a tingling sensation in your bladder, be efficient with your time and drink the rest of your beer while you wait in line for the restroom. Sometimes the line for the restroom exceeds the line for beer!  Tip #3: SF weather is fickle. At 3:00, it may seem all sunshiny and warm, but when 5:30 rolls around, it'll be gray and cold, so be prepared and come with a jacket. If you forget and the beer isn't helping you keep warm, Biergarten staff goes around, handing out blankets! How awesome is that?!?!  Tip #4: Don't skimp on the beer. Order a liter (never the half) . . . you DID just probably wait 15-30 mins for it anyway. Make your suffering worth it.", 
    "review_date": "2012-05-28"
  }, 
  "xWqvvmg9Y5u9DZJUxQGFtA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Ada S.", 
    "review_text": "Was walking around the Hayes neighborhood and after eating at Smitten Ice Cream, stumbled upon the pre-grand opening of Biergarten. This location is more like a beer stand/food stand where there are tables you can sit out outside. They are suppose to open sometime next week. Also found out it's an extension of the beer place/restaurant, Suppenküche - so if you like that place, you'll def like this place. They had German beers on tap and bottle with different sizes. Didn't try any of the food, but it looked good. A lot of people were eating their pretzels. The outside setting was very nice. Nice place to drink beer and chill in an outside setting with friends. Will come again sometime soon.", 
    "review_date": "2011-10-15"
  }, 
  "z1hbJf-8G0VoG4LhQ63ckg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake N.", 
    "review_text": "Beer, burgers, &amp; sunshine. What more could you ask. Organic, well-crafted high quality food as well. Expect a line on sunny days though.", 
    "review_date": "2013-04-15"
  }, 
  "dSCCtCzmfDpm9B0eVhri3w": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Lena Y.", 
    "review_text": "Awesome place! No indoor sitting - just picnic tables and blankets (ask for them if it's cold and windy!!!) with an usually enormous line for the beer and food.   Usually when there's a long wait, it almost always deters me from liking a place as much. Something about Biergarten doesn't do that. Good large beers, good yummy snacks - try to take turns standing in lines, because there's no table service, so you have to go back into line everytime. A great place to just chill with some beers and some food and chill in the sunshine", 
    "review_date": "2013-06-08"
  }, 
  "OKBVh-PfmT_V1jwk9MgKoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Esso E.", 
    "review_text": "I wish this was open today.", 
    "review_date": "2011-03-31"
  }, 
  "yb2erMSDuAAl7-KRnPX_RA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth D.", 
    "review_text": "The sausage and curry potatoes are delicious! Beers are sort of expensive but I like that it is a patio and there is very cool people in this joint. When the weather is  nice it is a really cool spot to hang out and meet new people. I like the fact that they give you blankets at night if it gets cold.   Only tried one of the beers, looking forward to visit again and try a different one.", 
    "review_date": "2014-04-21"
  }, 
  "i3F3mF-nHBsovh8Soxds6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "Genius. Amazing. Love it.", 
    "review_date": "2012-06-08"
  }, 
  "AlpltTc9Y8k8A4x5239JUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy A.", 
    "review_text": "i love, love, love, love biergarten. it's everything i love - good beer, outdoor seating and german bar food. deviled eggs, sauerkraut, pretzels, sausages...everything you could ever want in an establishment, right?  i would come here so much more often if it wasn't as pricey as it is and if i didn't have to be so aggressive to just find a place to sit. that being said, i still love this place and even had a birthday here.", 
    "review_date": "2014-12-03"
  }, 
  "FjUUV0xYhPypRuELO_XNTg": {
    "user_rating": 4.0, 
    "user_location": "Chino Hills, CA", 
    "user_name": "Rachel G.", 
    "review_text": "Absolutely love this place! Its so random, but I guess that just makes it even better! The whole idea of sipping on huuuuuge beer mugs with your friends on picnic tables with cutesy lighting above is genius! Hahah it was freeeeezing the night we went but luckily they had blankets readily available to people for free! (: I didn't get to try much of the food but my friends said it was delicious! The beer was yummm as well! Perfect place to chill with some friends on a lazy afternoon!", 
    "review_date": "2013-08-02"
  }, 
  "MV4KKHEaCiDKiVY2xK6roA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony D.", 
    "review_text": "Is pimpin' easy? hell ya! This place is awesome. Where else can you enjoy a Liter of gold alcoholic goodness in the sun? Awesome location with very helpful staff members.   The food looks amazing, but I have yet to try the fair because I'm usually eating something else while waiting for this fine establishment to open. Almost clawing at the gate for them to open it.   Maybe the benches could be a little more strategically placed that way some people are not sitting back to back (literally).   oh and ps to the person who said they would rather go to Suppenkuche... they F'ing own biergarten.", 
    "review_date": "2012-06-26"
  }
}