{
  "Sg_BvnTHsbc1AABiJjaiPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian H.", 
    "review_text": "SMOKED JALAPENO MARGARITA ohhhhhhh soooo gooooooood.....  And I guess they have hella manly shit like whiskey and whatnot.  And they have bbq that I was too late to order FML.", 
    "review_date": "2013-07-09"
  }, 
  "6rv_oQbvD9HLvnIxlG2hIA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan E.", 
    "review_text": ":-/ really waiting 15 min for a drink when their 7 people at the bar = walk out. Off to Lush... This place does just enough to stay in business. It's perfect for #techoles who have no social skills outside their little box.", 
    "review_date": "2015-01-25"
  }, 
  "41dPJ8ez3CYeuPpPFGY3LQ": {
    "user_rating": 4.0, 
    "user_location": "Orinda, CA", 
    "user_name": "jennifer j.", 
    "review_text": "Great food, nice people.  Ambiance has a little room for improvement.  The bar looks really cool, but we sorta felt like we were at a buffet with super fast music and very,very cold temp.  We ate in about 4 minutes.  Back to food... the sandwiches, fries, fried pickles, cornbread, sweet potato side were all AWESOME.  The fried okra, mac n cheese, deviled eggs were good, not great.   The prices are incredible too.", 
    "review_date": "2013-04-15"
  }, 
  "pWwR84GPwlQmOA9LMdFbIw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Russ L.", 
    "review_text": "First, I should specify that my organization had our holiday party here recently and as a result I checked this place out numerous times. It's seriously awesome. Aside from just being rad people the bar itself rocks. The space is huge and there are three separate rooms. The whole of the inside has this dark wood sophistication thing going on. Also, many of the drinks also have a dark wood sophistication thing happening. The food was innovative and traditional at the same time. Make no mistake, this place is the real deal.   Highly recommend for an evening out and extra recommend as an event space. They were accommodating and make the whole process a snap. We couldn't have been happier.  I will definitely be returning here, especially during their happy hour.", 
    "review_date": "2013-12-09"
  }, 
  "sqhjCxT8hg8bQrTlYVct5Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "This place rocks.  I am from the South, and fancy myself a bit of a BBQ expert.  It is nearly impossible to find really good BBQ on the West Coast, but this place has the best pulled pork I've ever had on the West Coast.  Its also has a good atmosphere for hanging out and watching sports.   They have a bunch of TV's, and the bartenders are happy to change the channel to whichever game you want, so long as Michigan isn't on (its a Michigan fan bar during their football games)    They also have a great beer list, and are one of the only places in the Bay Area that I've seen that stocks both Lone Star and Abita beer.  They also have a super extensive whiskey/bourbon menu.  And they have a great happy hour, that lasts till 7pm, even on Saturday!  All in all, this place is great for food, drink and fun.    Go here.", 
    "review_date": "2014-11-17"
  }, 
  "A9hIzQRW8j7x03sUWdlthw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy M.", 
    "review_text": "Love this place and can't praise it enough!   Shannon is the best bartender ever (second only to the bar tenders next door at blur MAYBE!)   Mac and Cheese and Fried Pickles are to die for...yep...the only reason I don't eat here every day is because I don't want to die of a heart attack at any time soon.   The cocktails are all amazing but I do have to agree there is something about that jalapeno margarita that really gets me going!   And SO MUCH SPACE! Great for events and everything in between!", 
    "review_date": "2014-03-04"
  }, 
  "hUozEFPxVSMaBz4cbOU_Lg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin M.", 
    "review_text": "Very BITTER experience at Bitters, Bock and Rye in SF.  I give the lady bartender, Jules, the 1 star (she deserves 5 stars, but not her boss).  I am a professional in my late 40s, and my rawdy days are well behind me, so after meeting up with some friends, on the Thurs night before Holloween, spotted this seemingly pleasant place as I walked by.  It was quite nice at first, and I sat at the back bar on the Post St side for a nightcap.  As mentioned, Jules was the bartender, and she was very nice and very polite and very professional.  Everything that her boss is not, as it turned out. I had a lovely time chatting with Jules and some of the other patrons, so I ordered a late night snack and had a couple of drinks.  The menu is supposed to be \"Texas Bar B Q\", but having grown up in Texas, I can tell you it is very far off the mark.  I never tasted ribs in my life that were as bland as these. I did get good service from Jules, and when I asked them to make something not on the menu, but with ingredients on the menu, they did so.  So far so good.  Then at about 11pm. Jules told us she had to close the back bar, and asked if we would all move up to the front bar.  By then it was just myself and 1 other patron, and the others left.  I have a bad back from a car crash some time ago, and when I stood up I had painful back spasms.  I walked to the front bar, which was totally emply except for 1 bartender with a dark beard and 2 or 3 customers near the front door, all the way on the other side of a large room from where I was.  I tossed my jacket on an empty table and leaned against the bar for support, hoping the back spasms would go away.  Suddenly a loud mouthed psycho black bearded bartender started screaming at me like a petualtnt toddler throwing a fit.  He was at least 20 to 25 feet away on the other side of the room, and he was screaming at the top of his lungs.  I tried to explain the situaiton, but every time I tried to speak he interrupted me, and kept yelling at me, and accusing me of \"throwing things.\"  Not wishing to argue with a clearly deranged person, I just ignored him until he finally stopped screaming, and shut up.  I walked back towards the back bar where Jules was closing up, and asked her if she would tell the petulant bartender what I was drinking and ask him to stop yelling at me and not to treat me in that manner. She told me he was the MANAGER, and that all the staff was afraid of him. She went up to him and said something to him I did not hear.  Suddenly, the psycho started screaming at both myself and her.  I got my coat and started leaving, and he again started falsely accusing me of \"throwing things\", and when I said I simply tossed my jacket on an empty table and he \"went off\" for no reason, he yelled \"your outta here.\"  Well, duh, I had already put on my coat and was walking towards the door, but I guess it boosted his bitter little ego to make himself think he \"threw me out\" instead of lost a paying customer.  Jules, apologized to me as I was leaving, and she seemed mortified.  I walked out on Polk Street, and it was very crowded on the night before Holloween at about 11:30.  ALL the bars on Polk were crowded, except this one.  IF the owner wants to know why he is losing money on what should have been a busy night, he need only look to his psycho black bearded Manager.  PS, Jules was super nice, but the Manager was so psycho, it did not surprise me to see another reviewer state that one of the male employees at Bitters PUNCHED his friend in the face for no good reason.", 
    "review_date": "2014-11-02"
  }, 
  "vekrlvUJ-GcwTeV41ah_dw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teri S.", 
    "review_text": "I really wanted to like this place. The bartender who took my take-out order was fantastic. I told her my friend and I wouldn't be eating dinner until very late at night, so she told me they would package everything up separately for easy reheating. I got my food quickly and with no problems.  When I opened up the packages, I was freaked out. Each order of lean brisket was 3 slices, 1\" x 4\". Not nearly enough for two hungry people.   The order of corn bread, which was described to me as a, \"huge piece\", was 2\" square. Not even enough for ONE person, let alone two.   I knew in advance that the Collard Greens with Ham Hock weren't going to work for my friend, because he doesn't eat pork AT ALL, but the beans??? I couldn't use those because THEY had pork. Might have been nice to have that on the menu somewhere?  Okay, so I am making my own Corn Bread, and ran out into the dark night to find baked beans with no pork.  But, DUDE. I paid $60.00 for that food, now I am making half of my own dinner anyway.", 
    "review_date": "2014-12-04"
  }, 
  "8sOdHJzpmED6q7tgr5DVog": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "JDizzle O.", 
    "review_text": "Rediculously amazing Turducken for 100 people. (yes, that would be *turducken - for 100 people*)  It was perfection!! Delicious food. Delicious &amp; strong drinks. Amazing service.    Shannan went above and beyond for our holiday party.  I would recomend BB&amp;R to everyone.", 
    "review_date": "2013-12-09"
  }, 
  "n6fKhRDTJ4DmNHCD5A06TA": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Martin L.", 
    "review_text": "First time yesterday to try a dinner here.  5+ stars for the ribs - best ribs I have had in San Francisco - great Texas dry rub that forms a delicious crust.  The side BBQ sauce could be a little more hearty, but it is still very good.  5 stars for the service - nice people with good attitude who care about the customers.  5 stars for the drink menu and reasonable bourbon prices.  Not as wild about the sides, mac &amp; cheese was bland, a corn appetizer was OK but not special.  An absolute return for the ribs.", 
    "review_date": "2013-08-18"
  }, 
  "QRMnpw-44QHSdQgnGgSKeQ": {
    "user_rating": 5.0, 
    "user_location": "Woodside, CA", 
    "user_name": "Margaret S.", 
    "review_text": "My boyfriend and I came here for a drink and ended up staying for dinner. I'm so glad we did. I got the pork sandwich with French fries. I don't think I came up for air once. It was delicious. I have never been a fan of cole slaw, but theirs was on point. My bf got the Mac n cheese with collard greens and pulled pork. He said it was pretty tasty.  They also have a great beer on tap selection.  I would definitely recommend this place for dinner and drinks.", 
    "review_date": "2015-01-21"
  }, 
  "G0hjlE7itEm-d6OW97564w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle B.", 
    "review_text": "Too bad, I like this place a lot. Good cocktails, decent beer selection, a few TVs and a menu of pulled pork, beef brisket, po' boy, and other items you don't find many places in SF.  Problem was, on this Tuesday night, that they were out of several things on the menu and a couple beers on tap, which forced us to quickly find proxies on an already-limited menu.   The service was just ok which didn't help to redeem the menu availability shortcomings. Our server was a nice guy but not attentive enough... to the point that a couple times we needed to remind him of the round of beers that we had ordered 10-15 minutes ago.  Again, I like this place a lot and I think there's a lot of potential... and I hope tonight's experience was an anomaly to what others can expect.", 
    "review_date": "2013-12-18"
  }, 
  "fG0Es2MIaSjau6yzJVSO-A": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Tiffany G.", 
    "review_text": "If this is only the \"soft opening\" I am looking forward to whats to come.(Open Wed-Sat, 5pm till 2am) A fantastic visit: Happy hour starts at 5pm btw  Cocktails: Old Fashions w/ Bourbon - yum x3! Meal:  Jalapeno corn bread with some marmalade that was so good I wanted to slurp through a straw... Mac and Cheese unlike any I have ever had, and a good serving enough to take home. A po-boy with some fantastic fries(you know some bars have pretty gross fries) and hushpuppies with aioli sauce worthy of dipping those fries in too. Looking forward to my next visit, and congrats to the BBR Team- I'm looking forward to my next visit.  I almost forgot the MUSIC- not too loud and let's just say I added The Doobie Brothers to my Pandora playlist-who knew?", 
    "review_date": "2013-04-04"
  }, 
  "u-Ii6mpA0jmMGdYXuyjMvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe W.", 
    "review_text": "Love this place.  And ... I'm a bit trepidatious to put that on-line, given that the Polk is already over-run with skanks chasing the next trend.  I don't want this wonderful place to become a trend.  GREAT FOOD!  Being a Southerner, I was delighted to see authentic hush puppies on the menu.  Will be going back for these again and again and again.  We also had the BBQ chicken, which was stellar.    The beer roster is quite impressive.  What a treat to find Heretic's Shallow Grave on tap.  Can't wait to see and taste what the owners decide to brew on-site.  The place is still being constructed, so I'm holding off giving this a 5-star rating until I see the final product.  But, I tell ya, I can't wait to go back!  LOVED IT!!!!!!", 
    "review_date": "2013-09-28"
  }, 
  "9AxKJuoM0nSQsEm5ols4mQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel G.", 
    "review_text": "It's been rather quiet when I've been here which I like. There's a bar, but I've always come in to grab some food. It's a good place to grab a Shiner and eat some BBQ-y food.", 
    "review_date": "2014-03-01"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 3.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "Had dinner here with friends on a Saturday evening a few weeks ago.  The layout is cool, I liked the separate seating areas. We all liked that the dining area wasn't too loud to talk. I hate when we're out with friends, and we have to scream to have a conversation.  Everyone had different drinks, some were better than others. My friend loved the maple/bacon old fashioned, I tried it and was not a fan.  The smoked pork and brisket were both reasonably lean and not greasy, (which is my preference) but had very little flavor. The fries that came with it weren't crispy enough either.  The big winner was the hush puppies. Granted , i haven't had many hush puppies, but these were fantastic. I really wish the meats had been better, then I could have the hush puppies again. Hush puppies alone are not enough reason to return to a restaurant for me.  Unfortunately, this was a disappointing meal. Will not be back.", 
    "review_date": "2014-05-19"
  }, 
  "sg2p9ehgMdbZxegpcQhauw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D J.", 
    "review_text": "if it wasn't for the smoked jalapeño margarita I wouldn't be back. been here a few times. first couple times had drinks and tried the fried pickles and friend okra which were awesome! when I finally tried the food the brisket and pulled pork were so dry and the macaroni and cheese was completely inedible. 7 shells in a completely bland light yellow sauce. the servers were nice but unfortunately the food was just awful.", 
    "review_date": "2014-07-04"
  }, 
  "3IBoCe--upk24sxjM-xcxA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John R.", 
    "review_text": "To prepare for this Yelp review, I put on some oversized Dockers, glasses that did not belong to me, stole a cane from someone that needed it more than me and went outside to yell at traffic and kids for an hour.  So here goes:  What is going on with Bitters Bock &amp; Rye?!?!?!  First time I went in there, back in April, I had an amazing BBQ experience.  The ribs were fall off the bone, the sauces were great, the sides were delicious, the drinks were solid, etc.  Amazing first impression! And ever since then:  * Full rack of ribs, corn on the cob and a side started out at around $10. * Then full rack of ribs, etc. went up to $12.   * Then became a half rack of ribs, etc. for $14.   Now that's just cost wise.  Other things that have happened when I have been in there:  * Out of ribs. Twice.  On weekdays, early evening. * Incredibly overcooked pork sando. * Disastrously tough brisket sando. * Bad sides dishes, etc.  I have probably been in there a total of eight times now and there always seems to be something wrong.  But the latest event, last night, topped it off.  Went in around 8:30.  Wanted to grab a sandwich, check out the new front space addition that had opened, etc.    * Half rack of ribs + sides is now $19.75.  No thanks. * Opted for the sliced brisket.  Out of it. * Tried for chopped brisket.  Out of it.    At this point, I was pretty much done.  I asked who the manager was, the bartender wasn't too sure. So since that was going nowhere, just asked what was going on, and explained it's been months of bad impressions, after a great first one.  She said that couldn't have happened, since they had only been open for two months.  Soft opening was back in March from what I remember.  But ok, I guess I was imagining all of my visits in there the past few months.  Bottom line is that I want to like Bitters Bock &amp; Rye.  I'm from Texas, and so I LOVE BBQ!  But they really need to sort stuff out.  Because unless I have been having just the worst string of luck ever in there, it seems to be very poorly managed.  Lots of room for improvement.  And I truly hope it happens.  Unfortunately at this rate, they've lost me for now!  Ok, heading back out to yell at people for stepping on my lawn (I don't have a front lawn). Good talk!", 
    "review_date": "2013-10-24"
  }, 
  "ngK-87MPabZrV3whsjQsow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raquel A.", 
    "review_text": "I'd had my eye on this spot for a while since whiskey/bourbon bars are my weakness, but add bbq to the mix and HELLO!  On my first visit I had the ribs and baked beans - delicious! I'm usually a Bulleit on the rocks gal, but the bartender Jessica recommended the maple rye old fashioned.  It was flavorful without losing it's edge.  On my second visit I had the the lean brisket (girls gotta watch her figure!) with a side of mac n cheese.  Again this meal did not disappoint!  This place has definitely become one of my favorites spots on Polk!     BB&amp;R has a great happy hour which keeps me coming back weekly. . .my poor skinny jeans :( And the restaurant is huge, perfect for a large party or a private event.   My friends and I have had great service from all the staff but especially Jessica, she is attentive, charming and knows her way behind a bar!  plus my husband has a huge crush on her!", 
    "review_date": "2013-12-21"
  }, 
  "MmltA0DVXyvVQKFzoOXeFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer A.", 
    "review_text": "I thought I was there on its \"Grand Opening\" this past Saturday haha, that's what the bouncer said. Very cool, chill space. Good music, good sound. It's DARK in there, which worked.. black walls, dimly lit. Good amount of seating, and it looks like they're still working on it. Once they have an actual sign up, I'm sure this name will resound through the Polk area. Just a nice space :) Can't wait to see how this place evolves. Check it out for yourself!", 
    "review_date": "2013-03-23"
  }, 
  "0AZHFsD_dJrA6pgVX-HTyg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittini S.", 
    "review_text": "I ordered a large salad and it was honestly a side salad size. I was very disappointed because a large salad with chicken was about $15 and it was so small!  Although, I would say this place is cool and has lots of southern food. The drinks are creative. I ordered the Jalapeno Margarita and I thought it was average. Having had one before at a franchise restaurant. However I did think the Chili Powder Salt rim was a good twist to it.  Probably not a place I would frequent, but glad I tried it.", 
    "review_date": "2014-05-09"
  }, 
  "kEv2aGQGCpWCDrmWYopbag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse K.", 
    "review_text": "LEGIT!! Super gem of San Francisco!!  Went there with a buddy that was in town for the night.  Got the Brisket Sandwich that was quite honestly one of the best sandwiches I have ever had.  I would go back simply for that sandwich and the BBQ sauces that they have!!!    The drink selection was great!  All of the whiskey's I would look for, plus some good looking cocktails.    Darker cool ambiance.  Almost speak easy style, cool chill place.  Great music selection and some TV's for the games!!  I was there at 830 ish on a sat and it wasn't busy but was starting to get busier.  I HIGHLY recommend this spot, and I will definitely be back many times, as it has become one of my go-to places!!", 
    "review_date": "2013-07-15"
  }, 
  "u0yM0OUva3mFYomr9UZajg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay D.", 
    "review_text": "Just left (2pm on Saturday 3/1). My BF and I had planned on having a few drinks and lunch there. The bartender's (blonde woman) attitude completely changed our mind. She didn't greet us when we walked in and it took a long time for her to take our order....we sat there for about 5 minutes and there were only 5 people in the bar. Once she finally took our order..she started making the drinks and another couple asked for her advice on some whiskey and she replied with \"hold on I am making these drinks\" and the couple looked at each other in disbelief like she had been rude like that the whole time. They decided to leave the bar seats and sit at a table. She brought us our drinks and we decided to move to a table as well. Such a bummer because we wanted to try the food but we couldn't stand another minute of being there with her serving us. We took our business elsewhere.", 
    "review_date": "2014-03-01"
  }, 
  "BfH8MjT3YqK5AIRwDA9aaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Polly L.", 
    "review_text": "Crispin had a promotion here and if you get it, $6 for a glass and you get to keep the glass and a free Tshirt. Too bad they told us after we ordered :/   Fries were more like potato wedges but still really liked this place because it wasn't super crowded and had a great chat with the people I was with.", 
    "review_date": "2014-07-09"
  }, 
  "PBMRsq50km3y7bmox_GIlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monica L.", 
    "review_text": "What keeps you coming back: friendly bartenders, adorable neighborhood bar, classy vintage ambiance and good crowd.  Favorites: jalapeño margarita, frog legs, mac and cheese (added bacon), and ribs.  I haven't eaten here since their restaurant grand opening, waiting until things settle down as the busy opening week seems to have caught the staff/kitchen off guard. But I look forward to trying their full menu, shrimp and grits? Yum.", 
    "review_date": "2013-10-16"
  }, 
  "jChwEu0CoI54qyuVnmIxmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry S.", 
    "review_text": "Absolutely love this place great drinks. Great Bourbon &amp; Rye selections. And also the best BBQ in SF. Enough said.", 
    "review_date": "2013-10-15"
  }, 
  "IU-7eZMf_qc6T3ILdsylMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan M.", 
    "review_text": "It's rare that I have the opportunity to attend a soft opening and even rarer that I have a blast at it.  What I experienced last night at Bitters Bock and Rye was amazing.  The space is still evolving, and the only part that was open at the moment is the back room, which has it's entrance on Polk between Post and Sutter - just to the left of Blur. Inside the room has a classy upscale feel without pretension.  If you like the decor style of Rye or the Hi-Low Club, you'll love this place.  The TV's haven't been installed yet, but rumor has it there are gonna be 4 large flat screens in the near future.  The drinks - full bar (of course!) and lots of beer!  Sitting right behind the bar are two large brewing... things (carboys? fermented?).  I don't know what they're called, but it doesn't matter; they're for brewing beer.  Craft beer. Right in the bar.  Holy pope hat that's awesome.  Food - A full on kitchen.  Right now they're just serving sliders and mac &amp; cheese - but I believe the menu will slowly expand as they continue to build out the rest of the space.  I had 4 sliders, and they were deliciously against my diet.  It's still a work in progress, so if you cruise by over the next few weeks, judge it softly as they sand down the edges.  All I know is this: If the current room is an example of things to come - watch out lower Polk, there's a new game in town.", 
    "review_date": "2013-03-17"
  }, 
  "tbQGU-uXpZLUiZfgvxzf6g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacque K.", 
    "review_text": "Really wanted to like this place, but I guess you can't always get what you want.  Surprised my BBQ-loving husband to a lunch out here.  We live in the neighborhood and it's a definite change to the food landscape.  Unfortunately it sticks neighborhood rule of \"good products; lackluster execution\".    My first issue is the space.  I made a reservation on Opentable, so I expected to be seated in the restaurant.  There are two entrances, one on Polk which is the bar, one on Post which I assume is the restaurant.  As you enter the bar, there is a sign that says, \"Restaurant take the hallway to the left.\"  We get to the hallway in the back and there is huge chain blocking the restaurant.  I saw the door was open to Post so I thought we may have to walk though that way.  We get to the door on Post and it was locked.  The guy, who ended up being our server, was nice enough to explain the restaurant was closed but the bar is full menu.  We walked back to the bar and sat down at an uncomfortable high top table with stools, no backs.  There was loud country music and TVs.  When making a reservation on Opentable this is not the atmosphere that I expect.  But as far as bars go I've been in worse.  My second issue is the food.  It was just... disappointing.  To start, we ordered the Fried Pickles.  The pickle itself was wonderful quality and flavor was spot on.  The problem was the execution.  The pickle slices were about an inch and a half thick and the size just made them difficult to eat.  For an entree, I ordered the Catfish Po'boy, which came with fries.  The sandwich was ok.  Again the execution could have made it better/great.  It needed more sauce.  The fries were thick cut but were soggy and the seasoning was bland.  My husband ordered the Brisket plate and this is where it gets really bad.  The plate itself has a lot of food, big side of baked beans and collard greens/ham hocks, with four slices of brisket.  The first slice of brisket had some moisture and lots of fat.  The subsequent slices were dry with the final slice, hidden at the bottom of the plate, looking like beef jerky.  We suspect that the meat portions had been pre-cut and subsequently dried out.    I would like this place to really improve.  I do see your good side.  Service was good.  Nice bar selection.  Nice location, hip area with lots of opportunity to make an impact.  I would love to see you define your hours for bar vrs restaurant areas.  I would love for you to tweek the pickles and make them just a tad smaller.  I'm seeing a lot of reviews with \"dry brisket\", can you fix that?", 
    "review_date": "2014-05-27"
  }, 
  "8Hy9l6WQWaCdhWe5KYNgEQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg J.", 
    "review_text": "I really really wanted to like this place but it left me wanting more. Our server wasn't clear on the menu and was all over the place. The venue itself is a nice size and is ok. The food however is just plain ol' barfood. I went with a group of friends after watching a 9er game when everyone needed food. Everyone ordered various items including sandwiches, burgers and whatnot. They said it was ok. However, we all agreed that the mac n cheese needed work. The catfish I ordered was lackluster but, the greens were good. I won't be back for the food but maybe a drink.", 
    "review_date": "2014-01-20"
  }, 
  "2Ltq2VaWljyeZdYuYDdMVQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Emily R.", 
    "review_text": "This place is awesome! Came here on a Monday night with a friend for happy hour and ended up staying for several hours. The Guilty Fries (topped with pulled pork, bbq beans, and cheese) were out of this world. Our bartender Jeff was what made our night though- he was super friendly, played card games with us at the bar, and kept the drinks flowing! Will definitely be back.", 
    "review_date": "2014-12-30"
  }, 
  "qY1Bhl8q7-WuERDQWSKzTQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yadira A.", 
    "review_text": "I'm sorry to say this but...great service, great atmosphere, beautiful place...not so great food :( Soggy sweet potato fries, bland Mac n cheese...sad sausage..,sorry!!  :( Cabbage salad was really good!!", 
    "review_date": "2014-06-13"
  }, 
  "0V4Ra6jCmSAgFtCiORr4QA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Megan C.", 
    "review_text": "Baked Beans from Heaven! Rye to boot, Cozy on a Cold night  If you're in search of a quick bite and you're in the neighborhood this is a great spot to grab something hearty. Had some pulled pork sliders, fries well done, baked beans and a couple of drinks with a friend before a concert.   Solid experience, it was a bit too loud for me, but for the category of dining it was perfectly acceptable. The game was on, some of the fans were getting a little bit unruly -- but it's a dim bar with BBQ beer, and bourbon. No stars off for that! ;)   Everything here was great.  Would come again if I was craving BBQ.  The Scene: Clean, Dim, Noisy, Sports Bar Destination Rating: 7 Date Rating: 5 Hob Nob Potential: 3  Strong Suggestion: Not super vegetarian friendly ;)", 
    "review_date": "2014-11-17"
  }, 
  "Og7VqMPukNDd-rE5cvubpw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Don M.", 
    "review_text": "Had the pulled pork sandwich and their Mariko Bloody Mary which is their spicier version of a Bloody Mary with an Asian flair. The bartender who served me (I sat up at the bar) was very courteous and efficient.  It's a small lunch menu but it was delicious!", 
    "review_date": "2014-10-12"
  }, 
  "8ZCEzFlFb2DaTEp0wcOnqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Declan M.", 
    "review_text": "This bar is a welcome retreat from the Polk madness.  A nice wood motif, and friendly bartenders.  Cyna particularly is one of the coolest and most sociable bartenders I have ever met, keeping up with orders while still making fascinating small talk with the entire bar.  Definitely worth a drop by!", 
    "review_date": "2013-06-11"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kim N.", 
    "review_text": "Back in the day, the type of clientele this place draws would never have walked in here.  My friend has this great story of where a pimp helped him change a flat tire on the corner across the street. As they were changing the wheel, a woman comes up to them and says:  Woman: \"whatcha all doin'?\" Pimp: \"Can't you see im busy here woman? go make me some money!\"  He said he gave the guy $50 and was thinking: Do  I say \"Thank you Mr Pimp?\"  haahahaa  No there's nary a street walked to be found and you can walk into places like BB&amp;R to hear Glitch Hop, Eagles of Death Metal, Queens of the Stone Age and Black Keys on a Sunday night. You can eat the likes of brisket, chicken, shrimp po boys, hush puppies, collards, mac&amp;cheese, and deviled eggs while drinking maple bacon rye cocktails  My how times have changed.", 
    "review_date": "2013-11-11"
  }, 
  "4bp7w-4s3iF_e_h42DmA0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "Stopped in after singing my heart out at YamaSho just up half a block on Post Street Saturday night.  Big spot with great music and two friendly bartenders; one really sweet blonde gal and one dude (kinda' looked like Paul Rudd).  My drink came fast where they also warned me that the kitchen was getting near closing.  Clutch.  I got a lifesaving order of deviled eggs and French fries w a garlic aioli to dip on the side.  Drinks (who can have just one?) and the bites were damn good! I'll definitely be back.", 
    "review_date": "2014-03-03"
  }, 
  "Glgi85734iWjgiYc3GpC1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin B.", 
    "review_text": "Strolling into Bitters Bock and Rye one Friday afternoon, my friend and I sat up at the bar and got to chatting with Jason the bartender.  He was whipping drinks up for us left and right.  My favorite was an off menu drink, the smokey paloma.  Delicious!!  As for the food, being from the south, I have a deep appreciate for good bbq and fried things!  The fried okra rocks my world, and the Carolina pulled pork sandwich, while not a traditional Eastern style or Lexington style Carolina bbq, is a healthy interpretation.  They also make their own pickles!!", 
    "review_date": "2013-07-01"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Still bitter.  Menu has been revamped since the opening. No more homemade veggie burger from my first visit. Time for some proper BBQ.  Smoked half chicken might have contained a typo as it resembled a full bird. Comes with sweet potato fries and coleslaw. No problem swapping the latter for baked beans.  Plenty of succulent white meat made the four homemade BBQ sauces almost irrelevant. Which was a good thing considering they all had a kick. All for a reasonable $15.  Beet salad and collard greens rounded out the order. Enjoyed the complementary flavor of the former while the soggy texture of the latter wasn't really my thing.  Kretzer cocktail (ginger beer, bourbon and apple) was great and even better at a discounted $7 for happy hour.  Space is now fully built out and has multiple rooms and plenty of seating. Considering the quality of the food and drinks wouldn't be surprised to see it consistently full.  Bitter in the best way possible.", 
    "review_date": "2014-03-20"
  }, 
  "1zPTzKfyRaRrAHFSvfeWiQ": {
    "user_rating": 5.0, 
    "user_location": "Vienna, VA", 
    "user_name": "Stephan R.", 
    "review_text": "Even though I only attended the soft opening I'm putting a lot of stock in this spot. Mark my words - when this place is finished being built (within a month apparently) it's going to be one of the prime locations in the city.", 
    "review_date": "2013-03-21"
  }, 
  "0lAp8VoTQeK-EnpHsgOpKQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer F.", 
    "review_text": "The jalapeno margarita was small but had great flavor.  The bbq, though, is the kind of food that appeals to folks who've never had good bbq.  Yes, for a bar in the TL it's good but I wouldn't seek it out for a meal.  The service was good.  Points for effort but otherwise just another hipster bar (and it was cold inside!).", 
    "review_date": "2014-02-16"
  }, 
  "bPLaQAmXZMjq4aF_TMO89Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel E.", 
    "review_text": "Love this place!  Austin feel, great bbq, inexpensive, and chill.  Whisky and smoke jalapeno margarita.    Bartenders are pretty awesome.  The menu has changed since they've opened and I am very sad they no longer offer the Smokey Paloma drink, ice cream sandwich, or delicious double slider deal. I was hooked at 5 stars, and I am sad to see them off the menu.  I still like the ambiance and staff, as it is a chill place to meet up with friends.  The jalepano margarita is great, and the pork burger is delicious too.  Check out the BBQ sauces too.", 
    "review_date": "2013-07-22"
  }, 
  "FEuUKUx6OlbKJ0QYoXoloQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan M.", 
    "review_text": "yea bbq", 
    "review_date": "2014-07-22"
  }, 
  "3TJcP0stfxjWGsLuGQgQdg": {
    "user_rating": 1.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Diana W.", 
    "review_text": "So me and my boyfriend accidently came into here one late afternoon. We were actually trying to go to the bar next door since we had read good reviews about it, but somehow accidentally ended up in here. We realized it as we were leaving so that part kind of sucked. I got one drink a Pear Cider, it was nice that they had a gluten free option, but as far as mixed drinks go its all dark not sweet drinks. Now my boyfriend would typically love this, but even he wasn't a fan. He ordered two different mixed drinks and didn't care for either of them either. It was nice that we were there during happy hour so we got some discount. The vibe of the whole place is dive bar-ish so we will definitely not be back.", 
    "review_date": "2014-08-26"
  }, 
  "DRVLcDZzvmmAMjbYNMYzmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick A.", 
    "review_text": "Bitters Bock &amp; Rye... Bitters Bock &amp; Rye... Bitterskjdduhjnd... I can't do it. This is a hard place to pronounce.  Fortunately, this is not a hard place to like as soon as you step foot into its doors. What I like about this hybrid restaurant+pub is that it combines all the elements of a good night out: classy dining atmosphere that incorporates the New American rustic look, stiff drinks, friendly service and a popping crowd.  What really takes this place into a new level are the three compartments that it comprises: The Restaurant, The Tap Room, and The Lounge Room. It seems they bought three bars and linked them somehow, because you'll be surprised to find a pretty distinct space and personality in each room. It's like three bars out in one! Perfect for when you want to pull a \"hey dude, I've been to five bars tonight already...\" *bro sign*  I haven't tried their menu besides the finger food, which impressed our group: - Sweet potato fries: spiced perfectly - Sliders: really good but small portions for the $ - Fried pickles: not too sour and very crunchy  I'll definitely come here again and recommend it for a din+drink combo on Polk St.  ---  Distinguishing factor: Three bar spaces under one roof. I'm guessing that's why this place is called Bitters, Bock and Rye. I wonder which room is which...", 
    "review_date": "2014-04-19"
  }, 
  "y_3K7pFI0hqlsOA97DUcaA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sara m.", 
    "review_text": "Alright bitters bock and rye, if you are going to  call last call at 1am on a Saturday night and literally wait outside of  the bathroom stall I was using at 1:25 to escort me (the last patron in the establishment because everyone else including my friends had already been kicked out) out of the bar, think maybe  you can change the hours posted on yelp and the door? I thought bars, especially fairly new bars, want to keep business and sell as many drinks as they can? I guess I'm confused.   BUT. The bartender was nice and the fried pickles were delicious when they finally cooled down enough to eat! (True to their word, I was able to order these at 12:50 right before the kitchen closed at 1am)  I probably would have bought one more drink though if I hadn't been escorted out.", 
    "review_date": "2014-02-23"
  }, 
  "Ao7VQInnShJdKu51puiTlg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gwen R.", 
    "review_text": "Had my birthday party here and been there several time to watch the Eagles game. Great food and really awesome bartender!", 
    "review_date": "2014-10-24"
  }, 
  "XDQCUG6dB_NntrZNsn5Frw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Su K.", 
    "review_text": "GREAT DRINKS! Bacon rimmed cocktail? OMG, yes!   Cool, relaxed, divy but not too dingy atmosphere. As a bar, I'd give it 4 starts.   But, as a restaurant, I have to knock off a star. It's definitely a bit pricey for what it is. But, maybe it's just me whose husband is from the south and paying this kind of money for bbq or southern food just doesn't sit too well with me. Everything tasted fine, but nothing blew our socks off. It's a great place to hang out for fun drinks and decent bar grub. I'd come back again especially if we're having pre-show drinks before heading over to Regency.", 
    "review_date": "2014-07-28"
  }, 
  "kRhDpqTn11bTsv9B37rrVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Billy C.", 
    "review_text": "The bacon whiskey cocktail there is amazing. The brisket is delicious but a little dry for my taste. The ambiance is dark and obscure with three different large rooms with bars. I feel like I will become a regular here.", 
    "review_date": "2014-03-06"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "Been wanting to go here for a while and try that Burnt end baked sweet potato. BUT no longer on the menu (damn that new chef).  We sat in the bar and had a few apps (fried okra, fried pickled green beans, deviled eggs, and potato cakes) There is a happy hour - a few wines were $5 until 7pm.  We split the mac and cheese topped with pork and a bacon wrapped sausage, The sausage was stone cold in the middle and the mac and cheese was too mushy. (the apps were better than the entrees but super greasy - in a good way)   Really the star was our waiter Bryan, he was super attentive (water at all times, a wipe when someone spilled the water, making sure we got another happy hour round before it expired)  He was fantastic and that was worth a star on it's own.", 
    "review_date": "2014-11-08"
  }, 
  "Qr70snS5u7yeW4YIxASehA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kandi C.", 
    "review_text": "I really used to love this place, but I am finding the quality slide a little. The food wasn't as good as it used to be and the drinks were weak. I will continue to go to BBR unless they continue to keep getting worse.", 
    "review_date": "2014-11-12"
  }, 
  "dVixj0VryhlTOMNXctJmSQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dallas B.", 
    "review_text": "Nice, warm (sort of) early November Saturday afternoon. Sunny. Shorts. A couple of blessed rain clouds in the sky. The UH Cougars on the bar TV. It almost felt like Texas--which is what I wanted--a little BBQ--that stuff that's so elusive here in San Francisco.  The online talk seemed to say this place had us covered. They had ribs and brisket smoked to raves. They had an interesting-sounding signature cocktail in a glass rimmed in their house-smoked bacon. They had some sides that sounded indulgent. They had my attention.  The place is nice enough. I like the decor and the two bar areas--one is louder and more drinks-oriented, the other is more restaurant, yet still has a handy central bar. Neither had much of a crowd on a nice Saturday afternoon which, where I come from, is a sign of bad BBQ. So, in that respect, I suppose Bitters, Bock &amp; Rye is true to its nature.  The regular BBQ offerings were not really present on the Brunch menu (the first sign this was going to be a bust was a self-identifying BBQ joint with a Brunch menu). The only real nod was the brisket sandwich and a chicken one. The rest seemed to be relegated to the sides (which sounded excellent) and some Southern comfort food items that caught my attention. I was still confident at this point.  We ordered drinks. My companion got the jalapeno margarita. I got the Rye Maple Old Fashioned in the bacon-rimmed glass. Her drink was too spicy and undrinkable. It tasted like feet. Mine was good--I ordered a second one to confirm--I liked the bacon gimmick and the house-smoked stuff was a salty contrast to the maple syrup in my Rye. But, it was a small shot of hooch, really, with a long finish of pure syrup at the end. They somehow turned an Old Fashioned girlie. BTW- our server cheerfully exchanged my companion's weird margarita for a passable regular one.  Absent a ribs option, or BBQ other than a brisket sando, I (inspired by they syrup at the end of my drink) went for the Chicken &amp; Waffles, while my companion got the Chicken sandwich and a side of fried okra.  Her sando was dry and lifeless. Even that house-smoked bacon couldn't wake it up. She added some \"Texas BBQ\" sauce (it was labeled as such, but that was the only indication of \"Texas BBQ\") to it, to no avail. This chicken was way past roadkill in the dryness department. The side of okra with garlic aioli was good, though. It was long pieces of okra fried in a tempura-like batter--not Southern-style at all, so not what was expected--but pretty good. I liked it better than she did.  My C&amp;W was plain weird. It was okay, I suppose, in that it was clearly freshly-prepared, but not what I wanted. It was a huge, full, bone-on breast of chicken deep fried (over-done) in fairly lifeless breading that I assume is the \"Mother's\" recipe of their regular fried chicken. It is nothing special, and like I said, the sheer mass of this breast forced the over-frying of it to a dark-brown, flavorless, salty glob. It came with two thinner-than-Eggos waffles that were limp, lifeless, and FOLDED on the side, and a small dish of berry syrup that really didn't add anything.  Seriously, tackling Southern cooking like BBQ, Chicken &amp; Waffles, fried okra and such carries with it some kind of obligation to be true to the craft. It is often misinterpreted here in California as ham-handed, greasy, or overly simple. Or worse, as is the case at Bitters, Bock &amp; Rye, there is an ill-fated attempt to inject some interest into the genre with a twist. Nobody here does BBQ worth a damn (even though I didn't try BB&amp;R's I'm certain that they don't). Only a few get Southern-inspired dishes close to the mark. Why is that?  Whatever. Two stars for the nice waiter who didn't bat an eye at replacing the drink and served us efficiently and in a friendly manner.", 
    "review_date": "2014-11-01"
  }, 
  "WeMeSCsrYARAwaWdGk5ftw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob R.", 
    "review_text": "Great food, terrific ribs and new drink combos - try the Kretzer. I'll be going back a ton.", 
    "review_date": "2013-05-20"
  }, 
  "Ezdq1x87TVgG6Phj3-Mv_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "round deux: You Pick 2: sausage (very hot if you like that) and them ribs. them ribs were so good i was sucking on marrow. thank god for this place. doble mac and some damn good cole slaw. this is the kind of place where you take your time and enjoy every full flavor. werk.  Side Note: I've lived across the street for 3 years (literally, my window faces Polk.) I absolutely hate the business' on this block on the weekend because of the brifge and tunnel folk, but I had to get over that and admit that this place is one of the best in San Francisco (resident since 2002)", 
    "review_date": "2013-08-27"
  }, 
  "sEkO9fW5rb8E5MZ7OzFsEg": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Guinnevere C.", 
    "review_text": "Review for restaurant, not bar portion.   I'm sure that this place was once good. After all, all these reviews and photos tell and show great food. Well, maybe nine months ago that was true, but not anymore.   First, we were confused trying to find the place as there's no distinct signage. And, to be honest, it's not really a neighborhood I want to walk around looking lost in. Then, upon entering we're not really told where to sit for food or anything, so I assume it's bar service. Come to find out later there IS a dining room, it's just hidden.   Our waitress was very lackluster. She gave us less than a minute with menus and then tried to take our order. I told her we'd need a minute to peruse. She never took drink orders so I just told her when she came back much later. They were also out of the one thing I really wanted- greens. If you're gonna run out of greens, it'd be nice to have a substitute green vegetable around. Green beans with bacon is so easy to keep on hand!  The okra was EXTREMELY greasy. Obviously the oil is not kept at proper frying temperature anymore. I'm sad because the photos I saw looked dry and fresh with a perfect crisp exterior. Now, I'm not really faulting them for this, but the jalapeño aioli was not spicy at all, nor were the two house made hot sauces we were brought. I'm a spice girl, so that was kind of disappointing. Oh well, we've got mains to look forward to, right?  My lovely dining companion ordered the shrimp and grits. When it came out, I knew she was gonna hate it. It just LOOKED weird. We're from Texas, and we lived in Georgia, we've had our fair share of tasty shrimp and grits. I'm not sure what was going on there, but we each took one bite and pushed the plate away. Very strange sort of seafood beef gravy. And mushrooms!  On top of all that, it was barely lukewarm.   Well, maybe we could share my plate and salvage dinner! My pulled pork, mac and cheese, and hush puppies looked pretty sad, but I tried it anyway. The waitress recommended putting their house BBQ sauce on the mac, and that did liven up the bland, reheated dish slightly. I also tried adding more of that unspicy hot sauce, to no avail. The pork was quite obviously from a day or three prior. It was simultaneously greasy and dried out! Pulled pork butt is one of the easiest things in the world to make if you have a smoker. The hush puppies were edible, but came with a very unusual dipping sauce that tasted like oniony tartar sauce. My dishes were also lukewarm.   I was also a little appalled that they were trying to pass of a watery, thin sauce as \"Texas BBQ\" sauce. Texas sauce is thick and sweet, just like their BBR house sauce.   I will say, though, that the waitress definitely noticed we'd barely eaten, and although we did not ask, she comped a large portion of our bill. She received that portion back in the form of a tip.   I really hope this place gets its act together because it has amazing potential. I'd be happy to come on as a temporary consultant! I'd love to see it regain the vibrancy I see in the first photos and read in the first reviews. At least the Shiner was cold.", 
    "review_date": "2013-12-26"
  }, 
  "DwTHMR9qMXImmyK635GnOA": {
    "user_rating": 1.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Elise w.", 
    "review_text": "This review is for the food only, I didn't order any drinks.  Simply put, you can cook better food at home. Even if you \"can't cook\". If you can read and follow a recipe you've got this place beat.   Everything tasted like some frozen crap they've been reheating all day. Bland and tasteless was the best description I thought up while tasting it. My shrimp and grits tasted like garbage juice smells and didn't resemble any of the other shrimp and grits implementations I've ever had.  I didn't eat any more than I had to to taste it. And I was hungry.  Also the plates were dirty.", 
    "review_date": "2013-12-26"
  }, 
  "VrxGg0703EF7IDS1ZdkJVQ": {
    "user_rating": 1.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Troy P.", 
    "review_text": "Where to begin WORST Experience of the Year for restaurant/bar!!  And the Winner is Bitters Bock and Rye!! I guess its called Bitters cause you feel so Bitter when you leave.   First let me start with the good walked up and no line which on Polk street on a Saturday night is unheard of, maybe that was a bad sign.  Even the Guy selling bacon wrapped hot dogs had a line. The Doorman was cordial and greeted me, I asked if they were still serving food and he said yes and to enjoy my dinner. Experience started out well.   Wait for it wait for it the Downhill is coming. Walk into the bar (ouch) plenty of open seating about 4 different parties in the bar and 1 bartender. I take a seat in the middle of the bar right next to the cash register area and search for a menu which was over on the wall near the back of the bar. Ok cool I had seen the menu online and was very much interested in trying the food here because of the creative southern food.    Look over the menu for 3 or 4 minutes no greeting or acknowledgment by bartender who was at the end of the bar taking a food order from a group of 4, while looking  like they were wasting her time. Thought oh maybe they are just taking a long time ordering or something. About 5 mins go by she finishes that order walks by me still no hello or anything. Goes to other end of bar takes another order from a guy who came in before me bet he waited a while. Then another group of 3 people come in and stand near me, we wait there together for another 10 mins while she takes 2 orders of 2 drinks each. The people next to me are complaining the whole time about the wait and the bartender never acknowledged them.    Add to it the fact that the bartender looks like she must have had the worst day cause she never smiled once the entire time I was there. Maybe  the poor bartender ate some bad seafood cause she looked just between anger and just I don't care. Finally she comes over to where I am and the 3 other people and she immediately goes to the 3 people before me. Does not say anything to them or me but just stands there waiting for the order. One of the people start to order a drink at which time I say excuse me I was here 5 mins before them the bartender turns to me and says hold on a sec. First thing and last thing she said to me.  By this time it has been almost  20 mins of waiting around watching the bartender work at a snail's pace to fill orders so I get up and leave to which the bartender seemed relieved that she would not have to take another order. If the bartender had made an effort to help customers I probably would have stayed.    On the way out the Doorman said goodbye and to come back and see us again really, good customer service from him.  Over all I have to I cannot remember the last time I walked out of a restaurant / bar without getting food or a drink so this maybe a first for me.  I guess after reading other reviews that this seems to be something that happens here with customer service. At the least the bartender who can only fill one drink order at a time and has a big zero of personality was hired by a manager or an owner. Maybe she is the owner and just does not care at all. I don't know all I do know is that my snapshot of my time here sucked all around. Only highlight besides the Doorman who was nice was that I did not waste a cent of my money here instead I walked up the street to a slam pack Grubstake and was served almost immediately.   Management or Owner s need to hire more people or not. Maybe they make too much money to care about who comes in and what kind of experience they have.  This was not just my experience but the 3 people next to me had the same experience just did not leave maybe if they had waited just 5 mins more.", 
    "review_date": "2014-08-24"
  }, 
  "5zKoykKuP0wwRWi2akjKrg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamara Z.", 
    "review_text": "Couldn't find the place, but at least they were playing the Warriors game.  No one greeted us when we came to the door - in fact no one said a word to us for about 5-7 minutes.  Bacon Old Fashioned tasted like brown sugar around the rim...don't waste your money on it.  Some loud ass girl screaming in the bar didn't help.  Food came out colder than San Francisco on a normal day.  Waitress was a capital B - clearly she didn't have a good yoga workout sesh before she came into work today. THE ONLY SHINING LIGHT was the jalapeño pepper jelly and cornbread and the free Avion Tequila gift cards we got.  Other than that, I'd rather spend my money actually traveling to the South for the real kind of Southern food that I did not get a chance to try here.  The end.    PS This is my first Yelp review.  That's pathetic.", 
    "review_date": "2013-05-02"
  }, 
  "jipgimnSNp3qdK2dKUQvBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "They have a good Porter's chocolate stout and the bartender created me an orange drop after asking me a couple questions on what I like in a drink.  I also can't really drink dark liquor, but I had a sip of my bf's drink that was recommended by his friend that frequents the place..I believe it had bourbon in it, and it was well made &amp; tasty.    I didn't get any of the food but the bbq looked and smelled good as I saw it go around.  I was surprised to actually like the atmosphere of Bitters, Bock &amp; Rye.  It's not she she, but not a dive bar, no hipsters here either, I think it's perfect for everyone and different for the Polk Street stretch.", 
    "review_date": "2013-10-17"
  }, 
  "KmqivnDXe3mVjBtp9ZxkOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley H.", 
    "review_text": "San Francisco is super multi-cultural...but it does tend to overlook some cultures from time to time. This place helps to fill the void of good ole southern comfort. just a blocks away!  This place is super awesome. I had a lot of fun here. They have some really creative drinks and lots of specialty beers. The food menu was soo impressive. BBQ and fried catfish...you had me hello.   -1 i know they are new and they are only going to get better. their portions were a little small...the catfish wad decent, but not enough for me:( they did have this really great homemade hot sauce that was the beezkneez! i am looking forward to coming back and experiencing this little piece of southern hospitality on Polk.", 
    "review_date": "2013-09-25"
  }, 
  "ta8_XazzNA39Sd4-M89epw": {
    "user_rating": 1.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Becca R.", 
    "review_text": "Came here last Friday night, on the recommendation of a friend.  Got in around 8PM, and they didn't seem that busy.  We sat at a table, also intending to order food.  The waitress was prompt and took our food and drink order.  The first round came quickly, but the food ultimately took an hour and a half to come out.  After an hour of waiting, I went up to the waitress and just asked if we could get our order to go. She was very apologetic and said yes, but when I asked how long it would take to get it she said another 15 minutes!   It had already been an hour of waiting....in a mostly empty restaurant!  When she realized how long we had been waiting, she offered us an appetizer on the house.  Was very nice of her, but we did ultimately end up leaving with our whole meal in to-go boxes.  The food was decent, and it truly may have been better if we didn't have to wait until we got home to start eating it.  I don't know what is going on with their kitchen, or their order entry system, but DO NOT come here for anything other than drinks, unless you have a whole night to spend waiting around for food.", 
    "review_date": "2014-12-22"
  }, 
  "V3kb9duvevsDAx3WQdvk1g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Todd B.", 
    "review_text": "Very promising new place in lower Polk Gulch. Dark wood and  whiskey barrel tables make for an upscale dive-y vibe. Lots of friendly faces from the neighborhood, saw folks from Swan Oyster and Let it Bleed. Four flatscreens and staff decked out in Giants gear make it a great place to watch a game.  Behind the bar they've got all the kit for brewing their own beer, which they're not doing yet but I'm really looking forward to. In the meantime they've got a menu of signature cocktails and lots of good bottles to choose from, Racer 5, Deschutes, Blue Moon etc.  The bar menu of southern goodies is a work in progress. My friend's shrimp &amp; grits was a spicy hit, hush puppies served w/aoli too. Fries were probably ok but came out cold, as well as my buffalo frogs legs. I'm sure it'll all be ironed out by the proper opening All in all a welcome addition to the neighborhood.", 
    "review_date": "2013-04-18"
  }, 
  "1P-s1bQFmwVJYdyT4AsnFw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Robin M.", 
    "review_text": "the nicest staff, so warm and welcoming...and yummy fried chicken...it's a good thing", 
    "review_date": "2014-12-27"
  }, 
  "g5d9HCy8DL4H6U_48S5z1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul H.", 
    "review_text": "Best mac n cheese in the whole city. And their brisket is to die for. Seriously. I live in the neighborhood and it's the best new business on Polk Street.", 
    "review_date": "2014-08-04"
  }, 
  "OsUxhCIgxRxF5cu6Z4_dLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy R.", 
    "review_text": "I was absolutely shitfaced after a Giants day game when my pal and I stumbled upon BB&amp;R on our drunken walk home.  I can't remember much except that the octopus salad was utterly incredible.  We seem to recall really loving the place.  That is all.", 
    "review_date": "2014-06-22"
  }, 
  "MFZAJCjeogRcavL7pvU6yQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth W.", 
    "review_text": "Three things: Abita Purple Haze, southern-style BBQ and an amazing bartender.  Though I would have put the bartender first in that queue, I'm biased.   Checked out this place with my man-friends who left equally satisfied and with a promise to return again. The one thing that blew all of our minds was the sheer SIZE of this space. Beyond the front room is a maze of MORE ROOMS, a second bar, private seating, et al. Great space to host a private party.  My only critique is that the BBQ I ordered (a lean brisket/pulled pork plate) wasn't flavored/seasoned as \"deeply\" as I prefer. I use \"prefer\" because I probably just like dirty South BBQ and wanted to get messy. The smoke flavor was light and the accompanying sauces were fitting.   Hope this place takes off!!", 
    "review_date": "2013-11-21"
  }, 
  "Iy9WCB5lAYfjOmmkqOuN7Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Haley J.", 
    "review_text": "Strange crowd, but maybe I'm just not used to the Polk street vibe yet as a recent transplant from Brooklyn. We sat at the bar, as there was a party who had rented the room beside us.  The brisket sandwich was decent - but it's dry and sad compared to any of the real stuff out of Texas. So if you're looking for a decent bbq meal, this is a good option. Just don't be expecting true BBQ Brisket.  Had a beer, but I want to make the effort to come back to try their Maple whiskey drink, as it sounds similar to one of my favorite drinks at my old watering hole in BK. :)", 
    "review_date": "2014-03-05"
  }, 
  "rFrlriqynSpR0dHUeUOazw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Yasmine E.", 
    "review_text": "If you want to drink booze and then die of dehydration, come here. If you want messy AND slow service, come here. AND! If you want bitchy bartenders too, then this is the place for you! Come on Saturday night or any weekend for that matter for all your drinking splendor, just be SURE you NEVER ask for water. Yeah, just don't. You might as well go to the bathroom and swig on toilet water if you're really in need. Since apparently HERE, if you ring up an OVER $200 bar tab and you ask for a damn water, YOU WONT GET IT! Nope, instead you'll wait 10 MINUTES while the bartenders are taking other peoples full drink orders! And if you politely remind them that they forgot and that you'd still like one, they literally tell you to \"Fuck Off!\" And yes, I say \"they,\" because not one but TWO bartenders told myself AND my friend, who went down the bar to speak to the other bartender, to \"get it somewhere else,\" too after we had been waiting for over 10 minutes!!! &amp;Seriously, we all know weekends are stressful in this industry and we tried to be super kind, we really did. But when we are parched and really in need for real hydration and about to puke because you can't pour a decent alcoholic beverage worth shit, it should not be our fault and we shouldn't have to suffer because you don't know how to prioritize in the bar scene. But hey, thanks for pouring all them drinks, you must to proud of that fat ZERO for the tip! ;) So, yeah obviously my friends and myself will never be coming back here again but hey, I guess this is what I should expect when going out in the Tenderloin!", 
    "review_date": "2014-03-25"
  }, 
  "wEwyQez3CRPmuWJNMoaSYA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James T.", 
    "review_text": "So , first what is this term \"Sando\"'? From the Urban Dictionary definition I saw not something one wants to use for food, yet in reading reviews of this place saw it yet again...so BBR. Nice bar, good selection of things to drink, but foodwise... Well if you think of it as bar food then maybe, but don't think of it as a place to go to for barbeque, or decent southern style food. Have to admit, I have a bit of a snobbish attitude about Q, but this place was not hitting the mark.", 
    "review_date": "2013-12-09"
  }, 
  "p2beZQ8QbYOqBDlS7flryg": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Aaron B.", 
    "review_text": "Went here to watch a Michigan football game (go blue!) one Saturday afternoon because they are an \"unofficial\" Michigan alumni bar.  It was a cold day with no heating inside.  The bartender refused to allow us to shut the two wide open front doors.  Given that it's a rather small joint, we basically froze our asses off for 3 hours with those doors wide open.  The bartender was wearing a puffy coat and winter hat--must have been orders from the owner thinking that open doors would increase the chance of patrons stopping by (none did).  The bbq sucked--burnt and dry.  Sides were also terrible and bland.  Gets an extra star for having an all right beer list.", 
    "review_date": "2013-11-23"
  }, 
  "5pRC8if3FVP7j3AxRQrNjw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "B B.", 
    "review_text": "I reeeeeeeeeeeeally want to love this place. The drinks are solid and it's got a great vibe, but the food is pretty sloppy. The brisket is pretty much all pork fat, if you're into that.", 
    "review_date": "2014-04-16"
  }, 
  "4gi84bc9b3o5hkf_1WAO_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paisley S.", 
    "review_text": "I had an amazing, impromptu dinner here with about 5 friends. The space is incredible - each of the rooms has a very distinct personality and is comfortable for big groups or just a couple, but frankly, I would go to a cardboard box that served food this good. I've complained for ages at the lack of delicious bbq in SF. Well no more... The brisket is ridiculously good and there are a variety of sauces to spice it up - not that it needs anything. The sides, like mac and cheese and baked beans were perfect confections of salt and sweetness and the cocktails were amazing. Just go here. Like tonight.", 
    "review_date": "2013-12-31"
  }, 
  "HSZyANaM7KSyV7W_d1aoIg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don j. c.", 
    "review_text": "This is for restaurant only! The bar is cool. I went Wednesday night about 8pm. Not too crowded. Me and my gal both ordered the ribs with 2 sides. It was pretty bad. Ribs came out cold on one side overcooked dry and a little too burnt. The sides beans and collard greens nothing to write home about but edible. I just couldn't believe any chef/cook would send out a order like that. We sent the ribs back and exchanged them for sausage and a chicken. Again fine to eat, nothing special but not what we wanted . Not a single apology from waitress and other server (the cook?) not sure. He said here's your meat replacement. Not in a nice way. We both felt like we were in the wrong for sending them back. But we know our ribs..Oh well. Funny thing is we tried them when they first opened and everything was delicious guess they changed Chefs.", 
    "review_date": "2014-01-12"
  }, 
  "xERsANtTV5ZSiK5IjjukiA": {
    "user_rating": 2.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Marisa B.", 
    "review_text": "Recommended by a friend who frequents Blur (next door) and knows the owner etc...apparently one of the owners of Blur is one of the owners of this place.  Anyway, went to this place on a Friday night. Had the brisket sandwich ($11/12), it was good after putting a lot of BBQ sauce on it. I was still hungry so I split the Mac and cheese($6/7) with a friend...I could've made it at home from a box and it would've tasted way better and would've had more.  There was only one server serving everyone sitting down. Not a good idea, good luck getting a beer.   Don't sit by the door when it's cold and windy outside. We had to ask twice if they could close the door. They only closed one door. Not cool.  Overpriced food. Small portions. Terrible service.   P.S. Buy a heater!", 
    "review_date": "2013-07-30"
  }, 
  "QsMLT06-s4vltVIz8DgpMw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Andrew E.", 
    "review_text": "This review is for their bar and drinks, not their food.   A group of about 10 of us came out to Polk on a Saturday night and ended up here. I've been here once before, and each time the place was relatively empty for a Saturday night at around 11pm, which was surprising. This place definitely deserves more love.   Their drinks are pretty cheap, and their bartenders seem cool. They have a mule and whiskey samplers (American, Japanese, Scottish) which is just awesome; the mule could use a little more lime, but it was strong so I'm not going to complain. I really like the place, and will probably starting going their a lot more since I live in the city now. I definitely recommend the place if you're looking for a less hectic bar where you can maintain a normal conversation, and not have to scream at a person 2 feet away from you.   There's also several TVs to watch the game, and seems to be military friendly (flags for each military branch are attached to the ceiling).", 
    "review_date": "2015-01-18"
  }, 
  "N2wXMsSYYFkogsUe984dsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophia H.", 
    "review_text": "This place is a hidden gem. Maybe because its location is in the Tendernob or maybe it's because the door facing Polk is so hard to find! Either way, if you find yourself in here, you'll definitely enjoy the well crafted drinks and service.  I first stumbled upon this place when I was eating at a near by establishment (Lers Ros) and was trying to meet up with a group of friends for after dinner drinks one Friday evening. After finally finding the entrance, we stumbled upon two different bars, joined together by an empty lounge area. This place was a lot bigger than it looked from the outside, and unfortunately, a lot emptier. But my skepticism soon drifted away as I had a sip of my first cocktail.   I had a Kretzer. It was a ginger beer mixed with gin, apple juice and old fashion bitters.  The drink goes for $9 here, which for the time they put into making the cocktail, it's well worth it. This drink was a little more on the carbonated side for me, probably due to the ginger beer, but if you love ginger beer, go for it. They were also playing 90s hip hop music that night, which is one of my favorite types of music. So I was definitely feeling the place and my friends were raving about their whiskey drinks.    I had such a good first experience here that I decided to come back again for my birthday as I was planning to have a get together with a group of friends.  But we all know it's extremely hard to plan a dinner and drinks with a group of 15-20 people without dropping $$$ on the reservation and doing it way in advance. I talked to the bar and contacted them for their lounge area that seemed to stay empty all night. Since I was having my birthday bash on a Tuesday night (it's always a good time to drink right?), they offered the lounge area to me for free. Yes FREE! Typically free and SF don't go together, but again, maybe it's because business is not too great? In any case, I worked with Stephanie there who reserved the room for me from 6-11 PM, free of charge and made it a private event. In addition to that, we had control over the music and was provided an iPad to play music off of.  My choice for the night was the Hip Hop BBQ station on Pandora. This was a great idea and location since I wanted friends to be able to stop in for food or drinks at any point in the night and didn't want to make it such a formal affair.   For the food, I got the brisket plate. The meat was a little dry but the portions are large. I would recommend going here for the drinks and service. I'm not even a whiskey drinker by any means since whiskey is usually too strong for me, but I tried their Maple Rye Old Fashioned and it was amazing! Maple syrup with bacon on the rim? What's not to like. This is THE drink to try here. If my alcohol tolerance were higher, I would definitely go for seconds.  Im summary, okay food, amazing staff, amazing drinks (especially if you like whiskey).", 
    "review_date": "2014-07-22"
  }, 
  "iLwqUX9Z9TS5Cyqbd8xKtA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brendan G.", 
    "review_text": "Went for dinner at 8:30pm on a Friday night with a large group. I had heard great things about the BBQ, so I was excited to get some brisket! Unfortunately, the waiter let us know that they were out of brisket. Disappointing, but I could get over it. So, I decided to get some ribs. Nope out of that too.  At that point I was slightly upset but I didn't want it to ruin my evening. Fine, give me a chicken sandwich with a side of Mac n cheese. Nope, they don't have any bread left, so ALL sandwiches are out. They are also out of Mac n cheese. Seriously?! Over half the menu unavailable, on a Friday night in San Francisco?  Mix that with poor service and extremely inconsistent drinks (one drink would be super strong and the next one tasted like it was pure soda) and that was the last straw.   The manager gave us 10% off our bill, big deal. Maybe I would have given this place a second chance if we got 50% off but clearly they weren't in tune with our disappointment.   There are so many great restaurants in SF that are managed to perfection, so why waste your time going to one that will leave a bad taste in your mouth?  Hopefully they figure everything out, because it is a cool space and the food seems pretty good. They have a lot of work ahead of them though.", 
    "review_date": "2013-10-27"
  }, 
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "From what I remember...thanks to the killer bartender that kept the drinks flowing!  I raise my pimp cup...  if I had one!  I'll be back soon!", 
    "review_date": "2013-10-29"
  }, 
  "d0FSducIb1tp8exnSoj9vw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Shirley W.", 
    "review_text": "Some friends and I went here on a fairly busy night but sat in the back dining area so it was pretty chill. After ordering drinks (which you might have to get aggressive to do), the lounging experience was ideal. We even made a friend in the form of a tiny mouse/rat. I hope little Steven is okay.", 
    "review_date": "2014-09-30"
  }, 
  "W3R7POS83Wc0jkzUcJXijw": {
    "user_rating": 1.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kristen T.", 
    "review_text": "THE WORST MAC N CHEESE in the entire universe. I really enjoyed the fried okra and sweet baked potato, but my experience was made sad by the mac 'n cheese.", 
    "review_date": "2014-07-28"
  }, 
  "2ADa5jO9mBiGHdym_8xZmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lady T.", 
    "review_text": "Great Brisket Sandwich!!! I will give them 5 stars but they don't sell the full menu during Saturday and Sunday Day. Otherwise I love it.", 
    "review_date": "2014-06-26"
  }, 
  "0XQ0_FHLuDeWkUPjHwxrtw": {
    "user_rating": 5.0, 
    "user_location": "Temecula, CA", 
    "user_name": "Nicolette G.", 
    "review_text": "I'm new to the city and when Halloween came about, I decided to go on an adventure until an intriguing bar caught my eye. Walking down Polk with friends, Bitters caught my eye. Entering the bar, it being filled to capacity, I thought I would be waiting forever. I managed to squeeze my way through all of the customers and to my surprise, the second I approached the bar I was greeted by Heidi. She was extremely inviting, cheerful, and knowledgeable. After I explained my taste for whiskey, she suggested an amazing cocktail called an Old Fashion. It's my new favorite drink. I had like, 5. :D She was fast and efficient regardless of the sea of people within Bitters. I will definitely return because of this amazing bar tender.", 
    "review_date": "2014-11-06"
  }, 
  "YOk9xrhUg09WUo_AgFPrPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Briana M.", 
    "review_text": "I love this place!  I came in Friday night and it is packed!  Great music and great vibe.  The food and drinks are delicious!!!", 
    "review_date": "2013-11-22"
  }, 
  "ktNgKbWLe6FFPpPcT-nqRA": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Judie R.", 
    "review_text": "After walking by and it always seeming to be closed, my boyfriend and I decided to give it a try. I am from the south so finding great southern cooking is difficult for me. And this place let me down.  Other than the meats I had (pulled pork, ribs and chicken), all the rest of the food was bland and had no flavor. The collard greens were good....those had flavor. The Mac and cheese tasted like i was eating cardboard. The catfish my bf had didn't taste like anything. And the soda in my drink was completely flat.   All in all I was disappointed. I don't know if we will ever return. It's overpriced for the bland no flavor food you receive.", 
    "review_date": "2014-01-27"
  }, 
  "Sgx514czTm8QWQhY2xdSOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raymond A.", 
    "review_text": "Excellent!!!  Went here with a friend. both of us had the rack of ribs (1/2 rack) with full cob of corn and potato salad. My friend also order the mac and cheese and we shared an order of French fries. This food is the real deal folks. Ribs had a deep smoky flavor with a dry rub, fall off the bone good, I mean literally, the ribs were falling off the bone, so tender I don't even think you need teeth to eat them. The corn was cooked to perfection, and the potato salad was delicious (the best I have had in a restaurant). My friend devoured the mac and cheese which comes piping hot in a cast iron pan, and the fries were some of the best in the city. I will say that the bartender was also are server (with little help from one of the owners who was mostly hanging out with friends at the bar) and she was working super hard. I think while they go through a soft open, they will probably be alittle understaffed, but its a bar with great drinks, a good environment, so deal with it. Let the food make you happy.", 
    "review_date": "2013-06-15"
  }, 
  "isLDEI_G2szMGWaAEwkK8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas H.", 
    "review_text": "I am changing my rating to only be fair. The owner contacted me about this and has very kindly refunded the mistake. I am once again a fan and will be revisiting. thank you", 
    "review_date": "2014-06-03"
  }, 
  "bRPoHph1v8ppd5UpiXBLNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt S.", 
    "review_text": "If you are looking for something a little different, Bitters, Bock &amp; Rye serves up a solid menu of BBQ and southern dishes that will make your mouth water. What to Eat:  1. BRISKET While all of the BBQ options are delicious, the brisket is the one thing that you need to try. Try to arrive early if possible, because they do tend to sell out. The perfectly cooked meat goes perfectly with each of their handmade BBQ sauces (Mustard, Texas, BBR and Vinegar-Pepper)  2. BOILED PEANUTS There are probably other places in San Francisco that have boiled peanuts on their menu, however we haven't come across any. They are the perfect start to any meal...  3. DEVILED EGGS Bitters, Bock &amp; Rye has 3 deviled egg options, chow chow, bacon marmalade and smoky pimento cheese. Try them all...    EXTRA CREDIT: THEY BREW THEIR OWN BEER! TIP: START OUT YOUR MEAL WITH THE SMOKED JALAPENO MARGARITA", 
    "review_date": "2014-11-10"
  }, 
  "jGYocN0m8A4hE0h5L7P3Ew": {
    "user_rating": 1.0, 
    "user_location": "Moraga, CA", 
    "user_name": "Melissa B.", 
    "review_text": "Head elsewhere. Even if you're a Michigan fan, and it IS a Michigan bar.   Drinks were mediocre, though they seem to have a good list of beers, and a sizable selection of bourbons (with a name like that, safe to expect it).   The food, however - it's dreadful. They run out of things as others mention, brisket is dry, the pulled pork questionable and inconsistent (like they've kept it a few days), the sausage nothing to write home about. The beans and hushpuppies don't have much flavor or texture. The slaw isn't bad. But the real problem: all our food came out of the kitchen cold. How does that happen when there are only two tables of people ordering food at the time?   Service wasn't as great as other describe - not all that attentive. and avoid the maple rye drink with the bacon rim - it's neither interesting nor tasty.   Head elsewhere, even if you want a Michigan game on the TV.", 
    "review_date": "2014-02-03"
  }, 
  "vCJrbaL3XsGW8KTn_-uBCg": {
    "user_rating": 2.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Andrew L.", 
    "review_text": "It pains me that I have to give a measly 2 stars to this potential top hit concept. Who doesn't like a place that serves a decent selection of bottled and tap beers, a comprehensive list of bourbons &amp; whiskey with BBQ food?  Came here for a birthday party of 25 on Saturday very excited to enjoy the evening. Started off well enjoying a Rowan's Creek straight up which was delicious and they bar tender didn't let the bourbon mix too long with the ice. As I think about it, I should have suspected some pitfalls in this place when they incorrectly spelled Rowan's with Rowen's... anyhow...  For dinner, I went with the Bitters \"Your Way\" Texas-Style BBQ which allowed you to select up to three BBQ items and two sides. Sounds tasty eh? Well, it wasn't... we attempted to order the fatty brisket but they were out of it by 7:30PM (WTF, there was barely anyone in the dining area before we arrived) so our final selections were three ribs, sausage and pulled pork with coleslaw and onion rings ($22). I also order the mac n cheese along with their devils eggs done in three flavors... chow chow (a pickled cabbage), bacon marmalade and smoky pimento cheese)  First off, the mac n cheese is terrible... yes, I'm going to use the dreaded word. It was borderline horrendous and the only reason I'm not saying it was horrendous is that I was able to at least eat it. The elbow macaroni is overcooked, the cheese flavor is barely there. Our serving looked nothing like what another Yelper posted, theirs came in a small skillet, ours in a plain white bowl. I can probably hit up Safeway and buy some packaged mac that tastes better than Bitter's rendition. $5.25 down the toilet...  Next up, the devil eggs... it wasn't bad. Each flavor was discernible in taste (exactly as described) and wasn't overly loaded with mayo. 3 pieces for $5 and you get to pick your own.   Unfortunately the main course with the sides doesn't fare any better, if not worse. The ribs were dry and relatively bland, the sausage was OK with a mild taste and unprocessed meat texture while the pull pork was inconsistent and also lacking in flavor. Some pieces were tender while others seemed like it was left overs from two days ago. The fried onion rings were nothing to write home about when they were hot, but once they cool a little, you can taste the starch in the breading. Coleslaw was decent, like the deviled eggs, not heavily mixed with mayo.  A friend ordered the Shrimp and grits, and that was also super bland. I know grits typically doesn't have a lot of flavor, but when you can visibly see the sauce generously poured over the grits, one would expect more something that creates a sensation in your palate. Nada... the bite I had had lots of sauce and two pieces of chopped green onion and all I tasted was the green onion... sad. The shrimp was slightly overcooked and bland as well.  Okay, so the food is bad, how about the bar side? I had the Palm Belgium Amber on tap served in a Snifter beer glass which is appropriate. Followed up with their Maple Rye Old Fashioned with the cup having bacon along the rim ($10). Interesting concept of trying to get the salty savory flavor mixing with the drink. I think it's a great idea but the bartender put too much maple syrup in it making the entire drink overly sweet as if I were having maple syrup pancakes with bacon... not my thing when I'm at a bar. And lastly, ordered birthday boy their top shelf whiskey, Jameson 18. I know this is not the best whiskey you can buy, but when it's the most expensive drink on the menu at $16, why in the world are you putting it into a shot glass?!? Poor taste in my opinion not befitting of the establishment's name.  Also, oddly enough... how does a bar run out of regular Jameson?!? As for mixed drinks, our group ordered a variety and after tasting some, you will probably find better drinks at Redford. It varies, some are good while others are a complete miss.  In the end, the great choices in alcohol and decent service can't salvage what comes down to poor execution in so many crucial facets. I hope they can improve their concept and reel me back in for another go sometime in the future.", 
    "review_date": "2013-11-11"
  }, 
  "iBkzr4A_zMREjXNLBUJd0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc G.", 
    "review_text": "Great new place. BBQ was great,  beer list was great and the cocktails seem spot on. We we here on Halloween night, and it was fun watching all the people pile in from Polk street. The bar is pretty spacious and well designed, and I look forward to returning for more food and good times.", 
    "review_date": "2014-06-09"
  }, 
  "HaL8abuCyHbJ-WDP0omHjA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin R.", 
    "review_text": "This place is a really nice venue. We went for a midweek date night and quickly found it's much bigger than it looks from Polk street.   The place was pretty dead on a Tuesday night, but we're getting old and quite like that.  The food menu is interesting, this was the main draw for us. Everything was well cooked and came within a reasonable amount of time. The only issue is that, by having 4 barbecue sauces on the table, the chef seemed to have missed the point of barbecue food i.e. that the meat is infused with the flavor of the sauce through the cooking process. This was particularly noticeable with the ribs. A rethink of how the meat is cooked might have meant we weren't the only people dining there at 8:30pm on a Tuesday!   The music was good and the bar/waiting person was really nice (although this probably isn't too hard when you have one table to serve!).   There was also a good selection of beer, with the porter being particularly nice. It would be good if alcohol percentages could be added to the menu though as I think it may have been quite strong.", 
    "review_date": "2014-09-17"
  }, 
  "8_WK479fHyP7noqPixQlgQ": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "Dennis M.", 
    "review_text": "Good BBQ, creative drink menu, friendly staff, reasonable prices.. what more can you ask for?", 
    "review_date": "2013-10-27"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "The bar itself is pretty freaking cool. It's HUGE... you won't even know until you try to find the bathrooms and realize that you've been only hanging out in 1/3 of the bar. There are three main rooms and two bars to order from. It's a great place for big groups, and there's plenty of seating if you're into that.  The only downside about this place is the crowd. Like Haley J. said, I'm just not really into the Polk Street vibe. Having lived here for a couple years now, Polk just isn't my scene anymore.", 
    "review_date": "2014-03-07"
  }, 
  "FP6C8cb-9riK10ONRNARsg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Tom K.", 
    "review_text": "About to head over in a bit to get some great tasting BBQ and watch the NHL finals with good peeps.  This place has a great vibe and a very cool group of people running the show.  I really believe BBR is going to become known as an absolute go-to sports destination - especially when football season starts. They have a bunch of TVs, cold drinks and like I mentioned the BBQ is awesome.  Check it out!", 
    "review_date": "2013-06-24"
  }, 
  "bOzsdIkTveA6glHOOMPpkg": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Arthur Y.", 
    "review_text": "This place is pretty big inside, and their large wooden tables make me want to have a meeting of some sort inside.  Solid drinks and relaxed vibe.  Only really been there as a \"bar\", so there isn't much more to say.  Good local bar.", 
    "review_date": "2014-08-09"
  }, 
  "B_0Zikge4DS8utXnTiifQQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "danielle a.", 
    "review_text": "Picked up food to go :  Brisket plate: the meat was okay but too dry, it came w BBQ beans and Mac &amp; cheese. The BBQ beans were good, the Mac &amp; cheese was okay but pretty bland. They should add some hot sauce for a kick or BBQ sauce.  BBQ chicken plate: the chicken had good flavor, but was also dry. It came with coleslaw and fries. The fries were good and would have been better if we ate there, I didn't like the coleslaw at all... Too vinegary.   It came with 3 sauces and the thickest one was good, the sweet one was good, and the last one tasted like straight vinegar.   All in all, we won't be back.  The bartender who gave me my order was funny though! Maybe go just to have a drink from him.", 
    "review_date": "2014-05-26"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "The sweet potato is off the chain and the people working here continue to impress me with excellent customer service.", 
    "review_date": "2013-06-05"
  }, 
  "bPxC0DYh7Z7YnUMbQWBG3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather B.", 
    "review_text": "Enjoyed everything we had there!", 
    "review_date": "2013-10-08"
  }, 
  "ermgOO9meehk-dfG0Fsfhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "christopher h.", 
    "review_text": "Super cool new place, good music, liked the beef and fish sliders, I think when they open the back it's gonna be a super popular place.", 
    "review_date": "2013-07-12"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "The Smoked Jalapeño Margarita here may be in my top ten favorite concoctions to be found in SF.  Altós tequila infused with house-smoked jalapeños, agave syrup and fresh lime, with their powers combined they are deeeeelicious!  The Maple Rye Old Fashioned is also notable if you fancy a Bulleit Rye with a hint of maple syrup and black walnut bitters.  The drink is accented by a rim of house made bacon bits, none of that imitation junk here.  What makes a great bar even better?  Amazing food!  We began with the Blue Crab Puppies which came as a trio of medium sized, crab packed fritters.  Next time, I'm not sharing!  My entree was also on point, the Brisket Sandwich was tender, smokey awesomeness!  Even the fries were exceptional having a perfect crisp.    I'm looking forward to the many things to come for this establishment.  I'll be there when the dining room opens up and definitely once brunch starts rockin!", 
    "review_date": "2013-07-08"
  }, 
  "hoHyM4L-6lhG0wHWJqLc8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ann L.", 
    "review_text": "Not bad. Decent selection on drinks.  Their food seems promising.  would love to try if I was in the neighborhood.", 
    "review_date": "2014-11-05"
  }, 
  "GWwiM-qbmAEEPZmlxJRmKw": {
    "user_rating": 1.0, 
    "user_location": "Santa Clarita, CA", 
    "user_name": "Janelle B.", 
    "review_text": "I can easily say that this was the worst meal of my life. We walked in knowing that it was a bar, however when we opened the door and stepped in it looked more like a dungeon; dark and dismal. We were told by our hotel concierge, that this was the place to go for steak and barbecued ribs. They said it was like southern barbecue. So of course we decided to trust our concierge.  Big mistake!!!  The server was attentive at times, at others, she was doing homework on the bar and it was hard to get her attention. The drinks were weak and overpriced.  The food was horrible, starting with the deviled eggs that had a runny filling and tasted like pure mayonnaise. Then the barbecue sauce was like water and tasted horrible, all three different mixes that they dared to call southern. Southern my a@&amp;!!  Of course the menu didn't even have steak and the ribs ended up being smoked, which the waiter neglected to tell us. The ribs were overcooked and left an after taste from the horrible barbecue sauce. We took one look at the baked beans and said no way. The coleslaw was purple and also had way too much mayonnaise. The potato salad had so much mayonnaise it was uneatable. We ended up paying eighty dollars for one drink, a beer, one appetizer and two entrees. Paying that money for the worst meal of our lives was extremely painful. It was seven o'clock on a Monday night and they had one other patron at the bar. This place failed in so many ways.  I wrote this review so I save anybody from going into there to eat. Turn back, do not eat there!!!", 
    "review_date": "2015-01-04"
  }, 
  "NmIOrfB-C5DmMDefL9bx4w": {
    "user_rating": 2.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Courtney F.", 
    "review_text": "I went here when they weren't serving food, so just the bar was open. It was alright.", 
    "review_date": "2013-07-04"
  }, 
  "QVeKGhOxb0e77prfXoSglw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen H.", 
    "review_text": "Super noisy and ultra bad service. The hostess had to be hunted down and she waa dismissive, none of the tables has been served food and the bartender seemed to have aspergers. Avoid, they will be out of business and a hopefully better place will replace them.", 
    "review_date": "2014-12-04"
  }, 
  "obngExh1FThF6tzULWf3Sw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan R.", 
    "review_text": "First off, the space is really cool. Exposed brick, dark wood everywhere, metal accents, and huge mirrors give it a stunning yet rustic old school saloon vibe. It's huge, which is a plus in San Francisco where most bars hold 50 people tops in a long narrow space. I've been a number of times with big groups of friends and it accommodated us all perfectly.   Tip: Reserve the private lounge if you've got a party- you still have access to both the tap room bar and the main dining room bar, but you get your own space.  Sooo... the drinks are delicious, and as a whiskey drinker, I've been enjoying their crazy selection of ryes (uh huh, like their name). Their Maple Rye Old Fashion is a must try, as is the American Julep, or go classic Manhattan and you won't be disappointed either. I'm sure drinks without whiskey are good too... but I wouldn't be the one to ask about those.   As any good BBQ place does, they sell out of the ribs and brisket towards the end of the night so get there on the earlier side. This isn't one of those places that just reheats their meat and hides the dryness by slathering on more sauce, this is the real deal. Smoked in house. Add on the mac and cheese, fried pickles, and deviled eggs? Um yep. Do it. So good.   Overall: if you haven't checked it out since the grand opening, you should.", 
    "review_date": "2013-11-08"
  }, 
  "AV6n2IFxNHQ2lu7ZONOomw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark O.", 
    "review_text": "Always on the lookout for good BBQ spots in the city, Bitters Bock &amp; Rye was something we had been looking forward to trying, especially since we saw that they were open late. We made our way over to Nob Hill around 10pm and were seated immediately in the back room with the bar.   I expected great things from the bbq meats but they turned out to just be average. I have definitely had better from other local bbq spots. What I wasn't expecting was to have one of the best cocktails and the best cornbread around. The maple rye old fashioned with bacon was so good that I want to learn how to make it at home. The cornbread was also amazing with a great taste, a nice crust and just the right consistency.   Overall, I would come back here, but it would not be for the bbq. Try that drink because it is amazing. \"I'm a fan.\"", 
    "review_date": "2015-01-13"
  }, 
  "xdjhKDIy9AMCqxebBv69nw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Antoine V.", 
    "review_text": "They have WiFi and a baked sweet potato to die for plus the kitchen is open until 1am!!  And as if all that wasn't enough its on Polk and Post a half block from home!!  Winning!! BBQ and free WiFi until 1am", 
    "review_date": "2013-10-24"
  }, 
  "vfZFqMSgtlRIwg2ITGmn9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney Anne N.", 
    "review_text": "My friend and I were wandering around Polk St. a little buzzed up on a Sunday afternoon after watching some football and he decided we should pop in here to try the food. I live about 4 blocks away and didn't even know they had food! The interior is nice and the place seemed clean, and they had football on the TVs.   We were served promptly by a nice young girl, looked over the menu and everything sounded pretty good, especially for bar food! It was all comfort type food- greasy, fried, full of carbs and tasty sounding. We ended up with the fried pickles and the fries topped with pulled pork. I don't even like Pickles and I devoured them! They were seriously amazing. They were out of regular fries for the fry dish so we got sweet potato fries and I think that actually made them better! They also bring you an assortment of 4 different styles of bbq sauce. I'm big on bbq sauce so I was a happy camper, the mustard and midwest were my favorite! My friend got an Anchor Steam and I got an old fashioned- which had bacon on the rim. It wasn't bad, the bacon just threw me off a little, I guess I don't see the appeal there. But the drink was nice and strong the way I like it.  Altogether a pretty good experience, if you're in the area and want some tasty bar food I recommend it!", 
    "review_date": "2014-10-02"
  }, 
  "JSPE5bMOg6rAKvKVEdfIXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alita M.", 
    "review_text": "New BBQ in the Polk/Tendo was just what I needed! SF doesn't have enough BBQ places to start - the fact that is is essentially inside a bar makes it highly likely that I will be returning, often.  We stuck with the BBQ plates over the sandwiches. The chicken was fantastic, surprisingly tender and moist and good flavor. Ribs were not as tender, fall-off-the-bone as I would have liked, but still tasted wonderful. As for the brisket, good, but it got cold super fast and I think it took away from the flavor. Mac-n-cheese and onion fries were the best staples. Baked beans were not your usual baked beans - not super sweet, exactly how I like baked beans. Slaw was unique twist, not saying it's the best slaw out there.  Heads up to anyone trying this place for the first time...it's a bar, really. Not a restaurant. Service is going to be very informal and sometimes it will take awhile to get a drink refill, but the waiters are cool and at least will check on you.", 
    "review_date": "2013-10-23"
  }, 
  "yAShjBoCrqM1SYn8epuSJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arnaud B.", 
    "review_text": "Protip: the bar is very hard to spot. Despite the even number in its address (1122), the entrance is on Polk's west side (go figure!). On top of that there's currently no big \"Bitters, Bock and Rye\" sign to guide you.  I went there on a Saturday night for a friend's farewell party. I arrived around 9pm. Food was still being served. The ribs, pulled pork burgers or parmesan macaroni that I saw around made me regret my earlier dinner. I sure wish I had room for some of these.  Now to the drinks part. I tried: * the American Julep, a honey whiskey based cocktail. Delicious, with a touch of mint. 5 stars. $8 * the Ginger Strawberry lemonade, based on a strawberry Skyy vodka. Very refreshing, fruity. 5 stars. $9 * the Bitter Truth, full of Bourbon, rye and definitely more on the bitter side. Duh. Comes in a martini-style glass. 4 stars. $10 * a standard Gin Tonic. For $6, it was a strong-ass drink. Almost too much actually. 3 stars.  So overall the drinks are pretty solid. Order shots and you won't be disappointed either: they fill them to the very top. Waiters and barman were really cool. Bouncer wasn't (I went outside to take fresh air for a bit, and was forced to negotiate that he let me in to close my tap).  I really like the vibe of the place. Sorta dive bar with a classy touch. I'm into it! Definitely going to be back in the future, and looking forward to see how the place looks like once they're all done with decoration and final touches.", 
    "review_date": "2013-04-14"
  }, 
  "AsSn6xVwHLCRJcTKOLw5EA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Freckles H.", 
    "review_text": "I came with a large group for a birthday dinner on a Saturday night. We sat at a large wooded slab table, which was pretty cool. The vibe is casual and laid back. There are plenty of tables to sit and a large bar area as well. The whole restaurant is actually split into two, but connected by a short hallway. Service was pretty good, but with 15+ people ordering, it would've been nice if they knew who ordered what instead of showing up with the food and shouting it out.  I split the combo meal with my SIL (we didn't get full, was ok). We ordered:  Brisket (lean) - fatty was sold out. It was definitely lean... jerky like. The seasoning was good though. Smoked ribs - it had a nice char on it, but still dry. Again, I thought the taste was good, but it was too much work to get the meat off the bone. Pulled pork - not pulled at all. More like cubed chunks and not tender at all. Sweet potato fries - really good! They're baked with a sprinkle of salt. Simply and delicious! Mac n Cheese - mushy and wasn't too cheesy since I tried it lukewarm. Shrimp &amp; grits - I took a bite of the grits and it was bland and watery. BBR (?) BBQ Sauce - yummy!! Really liked this BBQ sauce. Better than the Texas BBQ one. Gretzer (?) cocktail - really good! I had two.  Overall, great place to grab drinks and the bonus is you can order off a full BBQ menu. I was able to order half a rack at 1a! However, I wished the texture of the BBQ was more to my liking. It seemed too tough, but the flavor is pretty good. Halfway there!!", 
    "review_date": "2013-11-13"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "Love this place! The bar area is more lively than the restaurant section on Fridays and weekends but it's nice to have the option of a quieter setting.  Must haves: fried okra, guilty fries, brisket, ribs  Service was lovely but the music was ridiculously loud for no reason (people weren't dancing) so I had to shout to have a conversation. Crowd wasn't very diverse but  that's more and more the case in SF these days.  If you love BBQ and want a nice place to get a drink or watch a game, this is the place to be.", 
    "review_date": "2014-10-04"
  }, 
  "BWcdAjh5bkLcdwOeQHR0PQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paige L.", 
    "review_text": "What an awesome spot! I planned a party for 30+ people and reserved the back restaurant with a huge wooden dining table. It was well-lit (not too dark), and the music was decent. We all had enough space for guests to sit/move around and mingle. The manager Shannon is so accommodating and the rest of the staff was really great as well. Lots of people ordered food and it was a very easy place to go to to catch up with friends over cocktails!", 
    "review_date": "2014-03-16"
  }, 
  "FiHXzEXrQpePOtgz_h71pA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather W.", 
    "review_text": "Honestly the best group of female bartenders in the city! These ladies are handelig the crazy Giants crowd with a smile and lots of energy. They put the girls at Momo's to shame! So glad they are in ny neighborhood. Ive been here several times and consitantly the service is great over and over. They love what they are doing and love the food and drinks they are serving. Thanks for making up for my recent bad  service around the city ladies!", 
    "review_date": "2014-10-25"
  }, 
  "dYgcrxIi38eJh53NddnFYQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Stephen R.", 
    "review_text": "There are several sections to hang out in Bitters, each with their own bar. I wandered around from room to room for a while looking for my group, awkwardly staring at people because I left my glasses in the car, and this place is dimly lit. lol.  There's TVs playing sports, but there is music playing over it. I don't know if Fridays are 90s nights, or if they just play old music all the time. Either way, it was a nice trip down memory lane.  I only had 1 drink while here, and I tried to get the most unique thing on the menu. Enter the Maple Rye Old Fashioned, whiskey with an orange twist, a hint of maple syrup, and BACON ON THE RIM. Yes, that's right, small bacon pieces on the rim. There are several sensations you get when smelling this because you get a little bit of bacon, a strong scent of whiskey, and also some kind of bitters or something that really threw me off. Overall the scent was pretty potent, and a little overwhelming, but not so much that I wouldn't drink it. I mean come on, I'm going to finish it. lol. Overall it wasn't a bad drink, and definitely something I'm glad I tried.  In addition to the 90s music, dim lighting, and bacon whiskey, there were waitresses here giving out shots and t-shirts. Thanks.   There is a $20-$25 minimum to use a credit card, but luckily the server let me use mine anyways when I hadn't spent enough. Thanks again!", 
    "review_date": "2014-04-23"
  }, 
  "mAA3D6Wgg_7-Gboo1ATCFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kerstin A.", 
    "review_text": "the BBQ is a bit inconsistent, we have been many times, and as advertised, they do sell out, but when the brisket and ribs are presented, they are worth the wait.  Do not hesitate when considering the beans; mmmm. Both bars are fun but the restaurant bar is very accessible and fun to view Giants games!!!", 
    "review_date": "2014-10-19"
  }, 
  "ECLO9ACvtykvxXOJsDV7iQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy F.", 
    "review_text": "Great food, great drinks! Fun place to go to meet up with friends", 
    "review_date": "2014-09-08"
  }, 
  "RPvdEqvcfL59SiFhqujdqw": {
    "user_rating": 5.0, 
    "user_location": "Richmond, VA", 
    "user_name": "Natalie P.", 
    "review_text": "I made a reservation for a large group here on a Friday night. We reserved the \"Viking table\" for 16 people, but ended up having a few more guests than expected. The staff at Bitters Bock &amp; Rye went above and beyond to accommodate us, bringing over extra tables and chairs to put on the end of our already outrageous table to make sure everyone could be seated together. The food arrived very quickly (much appreciated since some of us needed to head out early to catch a show) and everything was delicious.   I had the sliced brisket sandwich with fries, and though it was a little tough to eat as a sandwich, I enjoyed it simply as brisket with a roll on the side =) The fries were great as well, and I loved the house BBQ sauce.  Thanks again to BBR for being gracious hosts to our somewhat rowdy and unorganized group. We had a lovely time!", 
    "review_date": "2014-05-29"
  }, 
  "G3UN8JtgbvfXCHgfGU114w": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Rishi G.", 
    "review_text": "As a small-town Texan, it's hard to find BBQ in SF that makes the grade - but for ambiance, drinks, and the right mix of down-home and high-quality, Bitters is an excellent choice.  Wait staff is friendly and proud of the joint.  Definite recommendation.", 
    "review_date": "2013-10-02"
  }, 
  "xflDsk7xp1tBa3djOzTiqQ": {
    "user_rating": 1.0, 
    "user_location": "El Monte, CA", 
    "user_name": "Shanelle A.", 
    "review_text": "Came here one night and left right away. The bar was a bit busy, but we found an empty table to the side. It had only one chair, and the other was taken by these other people even though they weren't using it. We asked, but it turned out they were saving it. The waitress bypassed us twice, and didn't seem to care that our table only had one chair, yet we were a party of two. So, we just decided to leave.", 
    "review_date": "2014-12-21"
  }, 
  "AIjA_jJQyAhoxtYd335Ekg": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Jes G.", 
    "review_text": "Holy maze, Batman!  Was touring with some SantaCon peeps this past weekend, and stopped by here for a drink.  They had a home bar cocktail list, plenty on tap, and some food specials.  The bar seems initially small.  It was only after exchanging several texts with people we were trying to meet up with that we realized there are several (maybe only 2, maybe 15) bars here, and you can seemingly just walk through doorways and around corners to find another one.    It was small, hot, and crowded with Santas.  Drinks were pricey, food looked decent.  Staff saved the day.  A bunch of pros with great attitudes despite the crowds.  A good place.  Would love to go back when it's not so Santa-tastic to get a better feel for the place.  Bigger tables, good bar space.  Nice place to hang.", 
    "review_date": "2013-12-17"
  }, 
  "VjJ1kSBO79Go2rCFa32rAw": {
    "user_rating": 5.0, 
    "user_location": "Haleiwa, HI", 
    "user_name": "Jen H.", 
    "review_text": "Heidi is a great bartender! The fried pickled green beans are amazing and the happy hour is great - ask for the bartenders choice beer. Great atmosphere and friendly staff - you should come here for the great food, service, and staff!!!", 
    "review_date": "2014-11-05"
  }, 
  "n1BT4UjV0SMfMwCpkQwNLw": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Maggie V.", 
    "review_text": "Great ambiance but questionable bar tenders. I planned my Bfs birthday at bbr, during the process the staff was very helpful and willing to accommodate special requests. Unfortunately a couple of the bar tenders were a big unfriendly and reluctant to make me a mint julep because they had to many orders and preferred I ordered something more simple. This left a bit of a sour taste in my mouth but I can't deny the great service on the behalf of others.", 
    "review_date": "2014-04-13"
  }, 
  "xBcNPTcCigOS4We-4ZIHqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dexter H.", 
    "review_text": "Randomly ended up here with a friend one night and it was the best decision of the night. Inside is so charming, intimate, the service was friendly, fast and the bartender was very knowledgeable and helpful about the menu.   I'm always looking for bars that have awesome cocktails, especially if its whisky. This place has all kinds of cocktails, we tried four and they were all top notch. For me the best was the Maple Bacon Old Fashioned. Absolutely genius! It was a little jarring at first, but after I got over that, I detected all the layers of flavor. The saltiness of the bacon, the sweetness of the maple,  the punch of the whisky. I loved it! Bitters Bock and Rye will be my go to bar around Polk from now on and I highly reccomend it to anyone in the area.", 
    "review_date": "2014-03-28"
  }, 
  "4QplxPyj5jkPLCl2yLqyuQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack H.", 
    "review_text": "Come here if you like bourbon, bbq, and craft beers. As has been said before - the Brisket here is top notch, whether you get it in its entree or sandwich formats.  I'm also a fan of the fried okra appetizer (what is that dip?), and the Maple Rye Old Fashioned cocktail (mmm... bacon-rimmed).  Also come here if you like places that get a little bit rowdy for sports (college football, Giants, and 49ers in particular).", 
    "review_date": "2014-10-12"
  }, 
  "MCm2nJs2tO0Hy_h1enIAQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam O.", 
    "review_text": "Shannon's new digs! Friendliest staff, best cocktails on the menu as well as off, awesome southern food menu- as long as you're there before 11.", 
    "review_date": "2013-05-28"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "Had some Scottish ale and some nice fried pickles. Need to come back to try the other food!", 
    "review_date": "2014-08-17"
  }, 
  "MEK-ph4hs8mfDplglk_RcQ": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Angela t.", 
    "review_text": "Didn't know what to think when we stepped into this dark little bar, but went on the recommendation of the bartender at the Lush Lounge.  Wow.  The food was amazing. Fried okra was so good.  Ribs were smokey perfection - seriously some of the best ribs I've ever had.  Really good burger with great fries.  Drinks were all good from bourbon to tequila to vodka.  Bartender knew what he was doing.  I'd go back in a heartbeat.", 
    "review_date": "2013-08-11"
  }, 
  "O_0yNszoWjH3oZ0J5DZEXA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt F.", 
    "review_text": "On Halloween, the manager with a beard there randomly punched my friend, all because he didn't see him at the door and walked past him, and gave him a little lip when the manager aggressively grabbed him. The manager then dove into him to tackle him, while taking out this cute little girl, and she got really hurt. He then started punching my friend while ontop of him. This guy is a nutcase and will soon be charged with assault.  The food is terrible here too.", 
    "review_date": "2014-11-01"
  }, 
  "TknGTatZq_ABSuiNjuR0Gg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess K.", 
    "review_text": "The food here is pretty good, definitely be ready for a heavier meal (not the place to come looking for a salad or light bite). They almost always have reservations and are great for groups. They standardly have about 4 different BBQ sauces on the table (the BBR one is the best) they are all good and add to the meal. I would highly recommend the Devild Eggs (they seem to be popping up everywhere but are good here). The pulled pork sandwich was also good and worth a shot!   The best part of the meal... MAPLE BACON OLD FASHIONED! If you like whiskey and bacon, you need this drink... I will probably go back just for that on a regular basis, and maybe have some BBQ on the side.", 
    "review_date": "2015-01-27"
  }, 
  "v0ANF5-KxIWBtQQB0PfI4w": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Enrique C.", 
    "review_text": "I couldn't believe Noel M when she told me she found a bar that serves great drinks and BBQ.  Seriously, I thought she could only imagine such a place.  Then she proved it existed.  Favorites: the brisket sandwich, the blue crab hush puppies, the Cajun chips, the tender burger, their refreshing mint julep, and their strong old fashion (whiskey + bacon = yum).  The service has been friendly and the cocktails and food have yet to disappoint.   They are also working on providing Sunday Brunch which I am impatiently waiting for.  If their bar menu is this good I can't wait to try their Brunch.", 
    "review_date": "2013-08-10"
  }, 
  "rodcjjeFRhI0RLgWEFcMpQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sydnee B.", 
    "review_text": "This place was a flop. My boyfriend and I were having a nice night in the city and I wanted fried pickles so we decided to check it out. My boyfriend is a craft brewer and noticed the bar was carrying a beer his company had made that had been expired for three months. He ordered the most bland chicken sandwich I have ever tasted. I thought I was ordering sweet potato fries with tasty pork but I received an over baked sweet potato covered in fatty bacon bits and sour cream. It was not appetizing to say the least and the frickles were mediocre. The service was ok and the ambiance was cool but we will definitely never go back. In San Francisco, delicious and creative food is expected- Bottom Rock Rye just doesn't get it.", 
    "review_date": "2014-08-05"
  }, 
  "STHGUd9RwtYTE4M06IcLoA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katy Z.", 
    "review_text": "Sunday lunch at the bar....brisket sandwich chopped salad and tequila Delicious.....nice atmosphere An excellent find for the neighborhood  Nuff said", 
    "review_date": "2014-08-31"
  }, 
  "ZzbtEALaj_Goxx2uV0OMiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Reza F.", 
    "review_text": "A good business fills a need.. But a great business fuels a passion! And my passion for great food is always fueled whenever I visit this awesome place on Polk!  From the initial warm greet to the attention to detail for every drink pour (even the beers) to ultimately the exceptional BBQ pairing with the choice of house-made sauces, Bitters delivers the entire package to the avid food Connoisseur and the novice alike!   Every plate is great and the best part is that you know that love and care went into every menu selection as soon as the plate lands in front of you. You want bar food, go to Kennedy's. You want BBQ w a great drink to chase it down, you only go to Bitters!  My suggestion? Ask for burnt ends on the Mac n Cheese when you're craving that late night goodness...not only does it beat the questionable burrito around the corner in taste, quality and satisfaction by a long shot but it also gets you ready for an awesome night sleep!", 
    "review_date": "2013-11-21"
  }, 
  "XtGCmOQGr8nxkVCS5XMVFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vance W.", 
    "review_text": "Excellent! Good food, good prices. Haven't tried Boozy Bingo on Tuesday but it's probably great also.", 
    "review_date": "2013-07-29"
  }, 
  "4Xfeyf-yYN9MLx-jVW_5zg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert D.", 
    "review_text": "Let me start off by saying I usually come here for the drinks my favorite being the American Julep but tonight decided to order dinner.   Taco Tuesday I have to say not a Mexican restaurant but hey why not try it out, yes please and thank you. Tacos were amazing fried fish nicely done, chicken great flavor, and pork wow nice and smoky.   I am a Chef in San Francisco and would I recommend this place? Yes for the drinks an the food, not too mention the staff is pretty on point with what you want and friendly...", 
    "review_date": "2013-08-27"
  }, 
  "JIk9k25--epOwgbuC3DOxQ": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Don H.", 
    "review_text": "We had a bite and a drink on a fairly quiet Monday before a concert at the Regency.  Service was great.  The food was excellent: I had a fried chicken sandwich, my wife had po boy.  The drinks were also great.  I can see how it could get a bit noisy during games but it was very pleasant for our visit.", 
    "review_date": "2014-12-10"
  }, 
  "Nv8leU4KUK3of_nP8X4oRA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "Good food, good drinks, good value and great service.  We shared the brisket and sweet potato plate, collard greens, and baked beans.  All were flavorful and tasty. And it was enough food for two people to eat and walk away very full.   Decent beer selection and the Manhattan we ordered was not only well made but about 4 bucks cheaper than a lot of bars in San Francisco.  Our waitress, Tiffany was fantastic and the epitome of grace under fire, as the joint was filled to capacity.  One thing to note: BB&amp;R is an official \"Michigan\" bar where people (lots and lots of them) come to watch Michigan college teams on television.  Michigan is somewhere in the midwest and the evening we came to dine, it was packed with folks who seemed like they might be transplanted from there.  Judging from this crowd, Michigan alumni are largely people well out of college who wax nostalgically for their lost youth, drink as if they're pledging a frat, and have little spatial awareness.    Also, their sports teams may not be very good because, both games being televised the night we were there ended with Michigan teams being blown out.  In closing, we will DEFINITELY come back to BB&amp;R. Just not when Michigan is playing.", 
    "review_date": "2014-09-07"
  }, 
  "_I62JinFrlF_S0mMhOg6RA": {
    "user_rating": 4.0, 
    "user_location": "La Puente, CA", 
    "user_name": "Steven N.", 
    "review_text": "Southern, modern, comfort food.  It was pretty quiet for a Saturday night, so I was a little skeptical with the food. When you walk in, you're directly confronted by the bar (so innocent but all so tempting). Seating extends all the way to the back, and lighting is more on the dark side. Perhaps a good place to go on a date?  Anyway, the waiter recommended their infamous Maple Rye Old Fashioned. Bacon? Can't go wrong with bacon. Except the fact that my alcohol has bacon. I was not a fan, and forced myself to drink it while witholding my gag reflex. I personally do not recommend, but you gotta try everything once in life (especially if alcohol is involved).   But the food was good! 1. Fried okra First time I've had it. Dip it in their jalapeño aoli for extra calorie flavor. The okra wasn't mushy and slimy as expected in gumbo, so that was appetizing.  2. Grilled baby octopus. A little too fishy for my taste buds, but my friends liked it. Chopped squid with a pico de gallo salsa concoction. Get it if you want some seafood instead of anything fried or makes a moo, oink, or cluck sound.  3. BBQ chicken sandwich Nothing memorable. I believe it's fried chicken strips? I can't even remember. But you get to pick a side, and the BBQ beans are delicious. I'd eat that anytime.  4. Fried chicken Crisp, juicy, and moist. This dish takes a while to make but it's worth it. Big portion  They also have a variety of sauces for dipping. Major brownie points there. Service held up. Our waiter was nice and seemed like he actually cared about our visit.", 
    "review_date": "2014-11-16"
  }, 
  "e3HuKf_j-k9ar4b-t4CzAg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen V.", 
    "review_text": "So far we have been in three different times since they opened and every time they have been out of what I ordered for my main entree so I had to revert to a second or even third choice. Major bummer. Also, how does a Southern food place run out of Mac &amp; Cheese ? That seems like a No-No to me. All three of these visits did not take place at a strange time of day either. I can understand running out of something later in the night but at 4pm on a Sunday you kind of still need to have Mac &amp; Cheese available (amongst other basics!). Seems like the kitchen needs to plan the food ordering/delivery a little better so as to not constantly be out of food. Of the three meals I have eaten here, everything has been on the salty side. I had meat items on 2 of the 3 visits and the meat was on the dry side both times. Asked for sauce on the side at all 3 visits and all 3 times my food was drenched in sauce. Scant amount of coleslaw on the pulled pork sandwich. Portions in general are on the smaller side but that is not an issue to me.  All that being said, I really like the venue! It's really great to have somewhere on Polk Street that serves food late (until 1am). Atmosphere is nice and dark - just the way I like it. TVs available for sports fans. They will be opening up the other rooms eventually and it will be quite a large place. The beer selection is really nice and if they ever get their own brewing deal up and running that should be a fun bonus. Hopefully with some more feedback and attention they can tune up some of these issues as it is a great spot for the neighborhood and something different to eat on Polk. I hope they work out the kinks and up the quality of food (and the quantity! It's nice to order something and have it available!). Perhaps pay a little more attention to the customer when he or she is placing the order. Can't say I'll be going out of my way to go back for the food after 3 average experiences but I would go for drinks again for sure. And maybe some appetizers (if they haven't run out!).", 
    "review_date": "2013-10-07"
  }, 
  "6_VkzelWeSHzjTVDlGl-Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "DRINKS: Lotta beers  ATMOSPHERE: Pretty big and spacious for SF, lots of rooms, Not bad atmosphere. It's along Polk, so you can add that to your debauchery crawl up the street.   9.13.13", 
    "review_date": "2014-12-13"
  }, 
  "ZJlNrE2Z_i_-6IKeciRO7g": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Peter N.", 
    "review_text": "Not-quite-hipster bar at the end of the trendy section of Polk. It was quiet when we arrived, and the bartender put on a show mixing drinks, but it became very busy very rapidly.   Passable selection of beer, but nothing of note. They have food, but I didn't check for vegan offerings; looked like greasy bar food.   The 80s and 90s hip-hop was cool, but way too loud. Probably not a place I'd go again.", 
    "review_date": "2014-09-06"
  }, 
  "dE9YaRaUtkDm-xJrW3BSPg": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Shane R.", 
    "review_text": "not dingy, not overly cramped, not hipster, not in the mission.  so far so good.  reasonably priced creative drinks.  the one i tried was pretty good.  flat panel tvs for sports.  i like.", 
    "review_date": "2013-06-06"
  }, 
  "PgwqtZqWWqmoXnL2vzILYA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kassandra Z.", 
    "review_text": "Worst bar experience I've ever had in San Francisco.  The bartenders Saturday night were extremely rude. I tried to order 8 shots, 3 whiskey based and 3 vodka based but I asked the bartender to dilute them with lemon juice or something sour, not sweet. And he laughs and says, honey, it's too busy of a night for you to not know what you want, I need something more specific. So I said just add some lemon juice to the shots and he laughs again and says we're too busy for that.  I am at a bar, did I get something wrong?? You should take pride in the drinks you make! Later, my friend closed out her tab and the card was declined and she said, how weird and asked him to try again and he said,  sorry, you're just broke. So rude!!! I was appalled and made a comment to a stranger about the bartender and he also had a bad experience. When he tried to close out his tab the bartender said he was too busy to close out tabs and he had to wait. The worst part is it wasn't even that busy!! we tried to go to the female bartender but she was also very rude; asked my friend where she was from and then just insulted her response.  Weird place and neither of the bartenders were nice. They made us feel unwelcomed and bad about ourselves. Why work in service if you hate people. I would never go back. The only nice person was the doorman and I feel bad that he has to deal with such terrible co-workers.", 
    "review_date": "2014-09-07"
  }, 
  "qcO-F1m-WViloT0xhcqkkQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristen O.", 
    "review_text": "the smokey jalapeño margarita is TO DIE FOR.  i'm addicted and i don't even care!  the food is yummy, and the service is fast and friendly.  i love this place and am excited to watch it blossom and grow :)", 
    "review_date": "2013-08-02"
  }, 
  "ZN4jwp8KeMg2V6d7iMnWhw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah Y.", 
    "review_text": "Just tried this place for the first time tonight.  I am so excited this place is in my neighborhood! The vibe is great and really good for a romantic date night. The service was good and the prices were reasonable. The drinks were amazing! I had 2 rounds of the American Julep which I highly recommend. The other stand outs were the BBQ sausage, ribs, baked beans, and sweet potato fries. The bread pudding for desert was super tasty! Definitely going to come back", 
    "review_date": "2013-11-16"
  }, 
  "m84TDkgx0yr9Ckco6v6g1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle Z.", 
    "review_text": "The BEST fried chicken EVER!!!!!  Great spicy sauces and drinks too!  Love this place and the owners are awesome - especially Shannon - she rocks!  Tennessee is pretty cool too :).", 
    "review_date": "2014-09-17"
  }, 
  "qIDy9zJfCuqxy6A3exPe_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne C.", 
    "review_text": "Next time I am trying food.  Met up for drinks at HH. All cocktails were $2 off which is decent for city prices. The bartender was also very nice while I was waiting for my friend to show up.   Slowly, the dining area was filled with people grubbing, and the lingering smell of barbecue. Yum.  It's a very cute, intimate place. The bar area has two flat screen TVs and rustic furniture.  I love that this bar is very close to my house and a breath of fresh air to the usual dingy Polk Street bars. I'll be back!", 
    "review_date": "2013-08-30"
  }, 
  "BYuR5Elf7EaJ88AdzYi26w": {
    "user_rating": 4.0, 
    "user_location": "Hermosa Beach, CA", 
    "user_name": "Adam R.", 
    "review_text": "Sweet spot!! Definitely worth a visit, or a few.    Recs: Fried okra- douse their aioli with a little hot sauce I thought for jalapeño it was pretty tame, but the batter and okra were perfect Mac n cheese- really great!  I still have a place (i wont mention here) back home that is #1 for me on Mac, but this is really worth having a go at. Corn bread- if you like corn bread you wont be disappointed  Maple rye old fashion- nothing need be added  They are relatively new and still getting things going but are definitely on the right track.  I think their menu could use 1 or 2 more choices for entree but everything they do have sounded or looked good.", 
    "review_date": "2013-08-07"
  }
}