{
  "HoSqTRGu_DDKJ2XyHOhxbA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine H.", 
    "review_text": "It's probably closer to 3.5, but I think rounding up is giving yelp inflated reviews.   Anyway, the space is really cool and well done. Very hipster-y and pretty. We went in for a tasting (we had travelzoo too) and we got there a little late for our reservation, but they didn't seem to mind at all. I liked the Sauv blanc, but weren't super impressed by any of the other wines, the Mariah Pinot was decent. Maybe we've been going to too many wine tastings lately (we looooove SFWTC out on Taraval). And the charcuterie plate was nothing too special either, but was a nice addition to the tasting.  I don't know if we'll go back, maybe we'll try it out when they start pouring the next year's vintages. It would definitely be a cool place to take out-of-towners or for a girl's day. They were decorating for an event (with baby pink, ew) but the space looked like it would be really awesome for a party/event.", 
    "review_date": "2013-11-11"
  }, 
  "w-3MRR7QCQK1MEttbaN1xA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tatum T.", 
    "review_text": "Love this place and the wine. The pinot is my favorite. Can't wait to have an event here.", 
    "review_date": "2013-10-01"
  }, 
  "kaKEer3UR5utYZsgp2tgPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna S.", 
    "review_text": "saw a couple dogs here, which makes me like this place more that it's dog friendly. We had a flight of 5 wines and it was only $15. Not a wine connoisseur at all, but I didn't really taste anything I really liked. We had a wine day with Dogpatch Wine Works and here, and I would prefer the Wine Works place. It's cool here though, with seating and food. We just didn't get to try their food because there was a market going on inside and we had the food truck that was parked outside instead.   Overall, it's a chill spot for the weekend, to drink some wine and catch up with friends.", 
    "review_date": "2014-04-28"
  }, 
  "Lj7OA1NqFUl0CNlR4kV6RA": {
    "user_rating": 4.0, 
    "user_location": "Contra Costa County, CA", 
    "user_name": "Peter J.", 
    "review_text": "This is a great little spot to go!!!!  Our group was just there for a farmer's market. One gal had a glass of one, and many of us sampled the available foods to eat. This is a nice spot. One can also rent out the space, even though I don't drink alcohol, I wanted to go to this today, and I'm glad I did.", 
    "review_date": "2014-03-29"
  }, 
  "fX_cTUuMCI5gsHzDIIz8sw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "JJ E.", 
    "review_text": "This is exactly the kind of place you wish existed within walking distance of where you live so you could become a regular and enjoy the insane wine and fabulous atmosphere all the dang time. For those of you who live within spitting distance of 53 Bluxome Street, you better be hanging out there on a regular basis for those of us who don't get to.   5-star atmosphere. 5-star staff.  5+-star wine, especially the Sav Blanc.   I wish I were there right now.", 
    "review_date": "2011-09-22"
  }, 
  "TlcOomCmGcPc6u-HzOq4dg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay M.", 
    "review_text": "Great space, good wine, and we love the \"Meet Market\" with local artisan vendors (food and other) that takes place in the space on the last Saturday of every month. Skip the Ferry Building once a month and head here to wander around the market and peruse/sample tasty objects for purchase with a glass of wine in-hand.", 
    "review_date": "2012-07-30"
  }, 
  "jhFA1hcax_Mz9wV8_NJv8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob F.", 
    "review_text": "I really like all of their wines, especially the Chardonnay. I mostly drink Sauv Blanc. Their Chard is definitely not buttery or oakey. The atmosphere is great, cozy with a view of a the more industrial part of this working winery. I highly recommend a visit and I've been at least 6 times.", 
    "review_date": "2012-11-02"
  }, 
  "-U1mpvkaEpSTWMGWwognsg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer S.", 
    "review_text": "Can we just talk about the 4 things ... 1. The Pinot (s) ... Iove um, and delightfully made here in SF 2. The Char - I normally loath whites ... but this one got me, ... and a very convincing wine maker had me hooked. 3. The lights - just go and you'll know what I mean 4. The Space - classy BUT not stuffy or uptight like many places in SOMA.  Perfect for a happy hour, meet up, date or professional meeting.   See you there soon.", 
    "review_date": "2011-09-21"
  }, 
  "YYGZyYuGkAo5rLKinakdig": {
    "user_rating": 5.0, 
    "user_location": "Crystal Bay, NV", 
    "user_name": "Robert G.", 
    "review_text": "Was excited to have an urban winery in the hood, but also had somewhat low expectations about the wine.  Boy was I wrong!  Chris is making some of the more interesting wines I've had in awhile.  He is definitely one of the new young group of up and coming winemakers hitting the scene making  unique wines that highlight the best aspects of the fruit.  Love all the wines, Chardonnay is great not one of these over oaked ones that seem to be popular.  If you think you dont like gewurztraminer think again and try BSW's, will change your mind.  Pinots are outstanding too, sourced from several vineyards each with a different style so try them all.  Staff is super friendly and atmosphere is cool.   Wish they were open a little later, but a definite go to place in the hood.", 
    "review_date": "2011-12-12"
  }, 
  "YB9oFLaDAb3ZWyJ1h3Grwg": {
    "user_rating": 3.0, 
    "user_location": "Fort Worth, TX", 
    "user_name": "Renee L.", 
    "review_text": "What a cute little place in the middle of the city. I wasn't in love with the wines so that's the reason for 3 stars. Wish I lived in San Fran I would recommend this space for a great party!", 
    "review_date": "2012-12-02"
  }, 
  "cqf8dqO5_QUxjfo6WiM7yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adena B.", 
    "review_text": "Came by to scope-out the place for an upcoming event.  The staff is incredibly helpful and very friendly. And the spot: oy, it's gorgeous! Industrial, but warm and inviting. With gorgeous paneled walls and carbon filament bulbs (with hand-blown glass coverings), this is really a beautiful space.  As soon as you walk in, the bar area's this cozy spot, perfect for a first date: to enjoy a couple glasses of wine (if he's/she's cute), or several (if he's/she's not). I'm kidding.  OK, not really.", 
    "review_date": "2013-04-19"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Awesome tasting experience in San Francisco and a great space for a party. The wine flight poured by Cole (cool dude!) was excellent. I love the pinots and that they have food. And nobody would even know this places exists --- GO GO GO!", 
    "review_date": "2013-12-27"
  }, 
  "MtV_ehFusGwykpvlaKD-uQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meg G.", 
    "review_text": "We had our Holiday party there with food trucks and it was amazing, I highly recommend the space for any event.", 
    "review_date": "2012-12-04"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Went a few weeks back, great spot for a glass of wine. Sounds like they will also hold events there. Great wine and wonderful staff. Looking forward to visiting them again.  Sure is a lot closer then Napa!", 
    "review_date": "2011-10-12"
  }, 
  "4XIjdvV3bz-e_NYzJRJLHg": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Leah B.", 
    "review_text": "Cute urban winery. We went for a Wexlers food truck event, so it was very busy and hard to find seats. We ordered a bottle of the Savuigon Blanc which was quite tasting. I want to go back for a wine tasting to try more. They close pretty early ~7pm", 
    "review_date": "2013-05-21"
  }, 
  "jw3jE7IlEhsPHePdLMcTCg": {
    "user_rating": 5.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Brent T.", 
    "review_text": "I never knew there was such a cool winery so close to AT &amp; T Park.  My friends got married here and the venue was perfect and the wine was flowing.  I would love to come back again.", 
    "review_date": "2013-05-09"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "Go see Annie at the bar at Bluxome St Winery. This is such a great local hangout. We're members (I was sold from the first sip of chardonnay) and although pricey, the memberships are well worth it, as are the tastings. Glasses are reasonably priced, bordering on cheap if I recall correctly. They're turning out some majorly yummy wine right here in the heart of our hood...and Annie curates a \"Meet Market\" on the last Saturday of every month...a farmers' market of sorts. Check it out.   People apparently get married here, take tours here, hold events, and they're even willing to curate off-site wine tasting events. I love this place!", 
    "review_date": "2012-09-21"
  }, 
  "6x6Qp2_xOPFdnA4vhcefWQ": {
    "user_rating": 5.0, 
    "user_location": "Grass Valley, CA", 
    "user_name": "Rick K.", 
    "review_text": "We walked over after a Giants game to do a little wine tasting and were very happy that we did.  VERY friendly service and terrific wines.  Chards and Pinots are \"my thing\" and they did not disappoint.  Who knew that someone was making wine in The City.  Very cool.", 
    "review_date": "2014-07-14"
  }, 
  "irFk4niiXe5iR-C7mgjy_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tasha D.", 
    "review_text": "Lovely San Franciscan winery with a beautiful event space. Open most days from noon to seven; the last Saturday of each month they have a farmer's market at noon where you can sip wine and buy wholesome veggies -- none of this waking up early and drinking coffee crap ;)", 
    "review_date": "2013-02-21"
  }, 
  "L3IKXUNdc9viNG5gZ5jt5Q": {
    "user_rating": 4.0, 
    "user_location": "Portland, ME", 
    "user_name": "William T.", 
    "review_text": "Came here for an event.  What a nice space.  Very modern with interesting light fixtures, barrels from the wine making process and an attentive, friendly staff.  The wine was quite good and the vibe of the place is spot on.", 
    "review_date": "2013-11-18"
  }, 
  "OJPU-VZn7jFSMvsuKU0ypw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Juliet S.", 
    "review_text": "This place is awesome! There's a tasting room attached to a winery in the middle of SOMA?! Who knew. Literally...who knew and didn't tell me?? lol. This place is perfect.   I had a great time here. I think the tasting room has only been open for a month or so so everything is brand new and really nice. The tasting menu is short and sweet. I had the red wine flight which turned out to be three pretty nice pours of great wine. My first was actually the first one on the list...it was a pinot noir...but I can't remember the exact name. I plan on going back to get a bottle. My flight was only $10 too..what a steal!  This place is right in between where I work and live so I wish they had a wine club! I recommended this and they said they're working on it.  The staff are also as nice as can be. They take their time speaking with everyone and getting to know you. I have a feeling this place is going to get super popular. I wish I could keep it all to myself...but I can't miss a chance to write a review about a fabulous, relaxing, beautiful new hang out with great owners and employees.   The only minus is that they close at 7pm...which only gives a 9-5er a tiny window of time to squeeze in some wine goodness....oh well.", 
    "review_date": "2011-11-07"
  }, 
  "ccboyo-sSWqEZDVfBSY6nw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Very friendly place with lots of nice wines to sample.  53B specializes in pinot noirs and some whites (chard, viognier, sauv.blanc).  Their 2012 pinots show lots of potential especially if you don't want a \"fruit bomb\" in your glass.  The whole environment feels modern, urban, and urbane.  Samplings are in the $10~$15 range...but note they won't waive that fee if you only buy a single bottle (perhaps you might want to join their wine club).  They also have tables with nibblies to buy.  Overall, a nice viniculture oasis in SF.", 
    "review_date": "2014-09-25"
  }, 
  "u_WZavcZZXyBT4TOrzgwuA": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Tera K.", 
    "review_text": "my friend and i went on a travelzoo deal for wine flights + cheese plate. this place is right around the corner from my office and i can see a habit forming! although they were swamped with patrons on a Tuesday night, i never felt neglected and we had ample time to talk over and between pours. added bonus = the cheese + charcuterie plate was delicious!  i'd go back for the Mariah Pinot Noir and Syrah any time. big, bold, beautiful wines that were oh so tasty.   nice find. thanks travelzoo for introducing us!", 
    "review_date": "2013-11-05"
  }, 
  "mW8fvDQ3JAtzeLjU--CjTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rowena L.", 
    "review_text": "Our company had a happy hour here a while back. Cute little place with a lively atmosphere, and there was a pizza truck parked out front. I liked the place but really wished they had a little more space in the middle for some swing or salsa dancing.", 
    "review_date": "2014-02-02"
  }, 
  "uSN218eYQQbzRRmbkiUJHw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Davis F.", 
    "review_text": "Great atmosphere and great wine. A hidden gem. Hannah our server was awesome!", 
    "review_date": "2013-04-13"
  }, 
  "2qj4WaAULhSt7fld8mLMMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carson R.", 
    "review_text": "i was stoked to check-out Bluxome.  I am a wine enthusiast. Love tasting and exploring new spots. The tasting space was trendy - wood, metal, Edison lighting. It was nice to see the barrels on the other side.  It's a small space.  You can get a glass or do the tasting. We all went with the $15 tasting.  Decent pours - not a bad price.  Unfortunately, we didn't care for one of the wines. It's not that they were terrible, but none of them were memorable. The three of us suprisingly liked the whites the best. And we did feel a bit rushed - we sipped our tastes and the server came over a little too often to see if we were ready for the next pour albeit there was no one waiting.On the other hand, she was knowledgable and friendly.   It was a fine time - I just wanted to actually like the wines more. I hope more establishjment like this pop-up.", 
    "review_date": "2012-03-24"
  }, 
  "uDbHBDNr_78eIY7Mf2G_ww": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jenn M.", 
    "review_text": "This place is awesome.  First, it is a cool spot.  It is quasi industrial yet cozy.  Second, the wine flights are super cool.  As other have mentioned the Bluxome flight includes five great wines.  Finally, the sole staff member was excellent.  She handled a busy wine tasting day with ease and provided great descriptions of the wine.  FYI:  To find 53 Bluxome, look for the gray sign on the ground, in front of the building.  The semi obscure gray door right behind the sign, is your spot (there is also a painted gray 53 Bluxome above the door)!", 
    "review_date": "2012-03-25"
  }, 
  "bPxC0DYh7Z7YnUMbQWBG3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather B.", 
    "review_text": "Great place to grab some wine with friends. Their flights are very reasonable priced and I would come back again. Mostly Russian River wines (which I love) and a great space for events. We also got the cheese plate which wasn't much to write home about but would come back for the wine!", 
    "review_date": "2014-03-08"
  }, 
  "OR0z3Tn7LLuO0NkHSy-atQ": {
    "user_rating": 5.0, 
    "user_location": "Salt Lake City, UT", 
    "user_name": "Kyle K.", 
    "review_text": "Oh, San Francisco, thank you for putting a winery / tasting room / event venue just a couple blocks from AT&amp;T Park, so that, when we needed to burn an hour before a Giants game, we could stick our noses in some new wine and do our best \"Somm\" impersonations while wearing baseball caps and cargo shorts.  We tried a nice flight, of which nearly all the wines were very solid.  I don't think they were worth importing back home, but each one, to my mind a few months after the fact, were solid.  But the staff was very accommodating -- we strolled in just as they were setting up for two (!) private events, but somehow they kept checking in on us and making sure we didn't feel neglected.  Great experience.  Tasty wines.", 
    "review_date": "2014-10-16"
  }, 
  "D5Vk_W6mq1fSubh1i7eN2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "We have been here twice now and thoroughly enjoyed ourselves both times.  We originally went because of the convenience of doing wine tasting in the city versus having to drive a couple hours to wine country.  The tasting room is fantastic and has a great view of the barrel room.  There are five wines available for tasting: a sauvignon blanc, chardonnay, two pinot noirs, and a syrah.  While we originally went due to the convenience, the wines were great and the tasting staff was extremely friendly.  One nice thing about the tasting room is you can get full glasses of wine or whole bottles and drink them on the premises. Last night we had a pretty big group and ended up doing tastings then following that up with two bottles of wine and having a great time. I definitely recommend making a trip to the Bluxome Street Winery.", 
    "review_date": "2012-02-12"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Bluxome Street Winery is located in SOMA in a spacious, warehouse like place with several tables and bar seating. You can make reservations but I don't think it's necessary. The decor is modern-industrial, though they have several barrels perched inside.   The pours are pretty generous and the wines are lighter and tangier. I would highly recommend it to those with a taste for sweeter sauvignon blancs (a glass is only $6!) or pinot noir experts (most popular). They offer a few light bar bites, and some reasonably priced tastings (5 tastes for 15).  Great experience, super friendly sommeliers, fun wines you can't really get anywhere else. It's a bit out of the way but I would be back often if I lived in SOMA.   Pro-Tip: If you join their wine club you can come in anytime for free tastings and bring up to 3 other people. What a deal!!", 
    "review_date": "2013-09-27"
  }, 
  "Dw5k44c-nkOexdaqUtcWCA": {
    "user_rating": 3.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Janet S.", 
    "review_text": "Cool urban vibe at Bluxome Street Winery.  You have a choice of two different flights, so our party of four did two and two.  Liked their chardonnay, the reds were okay.  No one felt the need to buy a bottle.", 
    "review_date": "2014-08-03"
  }, 
  "sbgQVK0ObJtxJ5BZOceHfg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Priya G.", 
    "review_text": "This place is AMAZING! My two good friends just had their wedding celebration party here this past Saturday (about 150-200 people) and I couldn't say better things about this place. It's an event space that is very modern and chic and would be great for company parties, non-profit galas, etc. It is located near 5th and Townsend and is more of an event space than winery. One wall of it is all wine barrels, and the place has very high ceilings. It's very well-lit and you can decorate it from scratch yourself.  My friends got these amazing white couches and wooden tables everywhere so people could sit down along with high tables. They had food trucks outside the space for people to get dinner (creme brule cart and wood-fire oven pizza trucks). They had a bar inside the venue space and the bartenders were super nice and it was really easy to get drinks.  There was enough space to properly dance in the venue and speakers were good. Overall, this place was awesome and I highly recommend it to anyone who is thinking about renting it out! I think it will get booked up quickly in the next few months because it's that amazing!", 
    "review_date": "2013-06-27"
  }, 
  "t5u7TZyJu22dLY2fRacMJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ellen M.", 
    "review_text": "A hidden gem in SOMA. Everyone here is warm, professional, and serious about their wine.  We lucked out with the lovely Faith pouring for us - she was super sweet and very knowledgeable. The goods at the Saturday Meet Market are wonderful - particularly Ariel's crackers, Sumana's spreads &amp; Batter Bakery.  Loved it!!!", 
    "review_date": "2012-06-13"
  }, 
  "PeuUC7Fvk2H6r4AkefGcrg": {
    "user_rating": 4.0, 
    "user_location": "Ridgewood, NJ", 
    "user_name": "Denise S.", 
    "review_text": "Pop up club anyone?  Holiday Party 2013 at Bluxume Street Winery was warehouse chic.   The place is a great place for an event.  I was off the wagon that night (gasp!  I know. )  I didn't try any of the wine, but my cali-wine-snobby peeps said the wine was great, and I would trust this report.  Those people can be brutal on wine reviews.   The space is very large, it fit about 200 people from our company and it didn't feel cramped at all.   There was room for dancing too.  It's entertaining to see a bunch of drunk engineers dancing.  Food stations and passed appetizers, but its unclear if the food was catered so I'm not going to review it here.", 
    "review_date": "2013-01-14"
  }, 
  "vqyrv0N4z4NoWb3eiyqVmQ": {
    "user_rating": 5.0, 
    "user_location": "Larkspur, CA", 
    "user_name": "Nikki W.", 
    "review_text": "The Bluxome Street Winery hosted our Company's Holiday Party this year and it was one our best events ever!  We started in the tasting room with Bluxome's winemaker Chris Nelson, a super-friendly guy who looks a little like Jack Black.  The Sauvignon Blanc and Chardonnay were standouts for me but honestly all of the wines were very good. Later on we moved into the main winery for a sit down dinner. The room had several glowing amber lights set inside big glass wine containers (carboys?). The lights were all hung at different heights and with the wine barrels in the background, the room looked like something out of a Napa Lifestyle magazine -- Only we were in San Francisco.  Too cool!   If you are looking for a great new spot to throw a party, I highly recommend Bluxome Street Winery.  Terrific people, wonderful wines.", 
    "review_date": "2011-12-12"
  }, 
  "8_RAFPhjCh_A1WVDET6ebA": {
    "user_rating": 4.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "Came here for a company event and was impressed by the venue. It's beautiful! I was only able to try two of their varietals but I did enjoy both. I'll be back to do a tasting soon.", 
    "review_date": "2014-04-09"
  }, 
  "6JOD7pAVHb3oC7gYWuOLkA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany C.", 
    "review_text": "We live pretty much right next to BSW and have become regulars (and members). We love this place and will be going for a very long time.   Positives (+): (+) Great atmosphere (+) All the tasting room hosts are super friendly (+) Wines are good (although I can't wait for them to have more red varietals other than Pinot). Their Balinard Pinot, Sauv Blanc, Viogner and Chardonnays are all very good. Oh yes, and their Rose is good as well.  (+) Dog friendly!  (+) Great wine club membership perks and events!  Negatives (-): (-) Nothing! But I only wish they stayed open later.", 
    "review_date": "2014-08-16"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "My favorite scenes in films are the quiet, uplifting ones interjected into the crucible. They are the several minutes of romantic refuse in which you think all the trials before and after might not be so bad. They are the all-hope-ain't-lost nights in abandoned shacks when you know all the zombies are still out there, during which a moving yet mellow Tom Petty or Nick Cave song plays gently in the background.  Bluxome Street Winery reminds me of those scenes. Despite what you're going through in life, a trip to this giant wine pub with friends is the ideal respite. Its long wooden tables are designed for convening, and the large interior offers plenty of space for big groups. The wine is good and there is a live band, and that is all anyone really needs for a good time.  I will return once the zombies let down again.", 
    "review_date": "2013-08-27"
  }, 
  "8XwZggy8l9x8lm6mCZFwGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda R.", 
    "review_text": "Trying to think of an excuse to throw a party here! Can't wait to come back already.  You wouldn't think to find this tasting room and winery down Bluxome...it is unsuspecting but a total gem.   Highlights: Katie...our fabulous wine server. She knew a lot about the winery as well as the history of how the wine industry has evolved in the area. Pairing pieces of cheese with the Sirah was a great tip, so smooth!  Loved the lighting throughout the space. Katie explained how the lights are on a pulley system making it easy to set whatever mood you want. The lights are strung through large glass jars that were once used in wine-making.   Great spot for grabbing wine after work, throwing a company party, or getting all of your friends together. Remember that this place is not a wine bar, it is a tasting room, so it closes at 7:00 PM (get there early!).  Highly recommending Bluxome Street Winery to friends, family, and all of you Yelpers!", 
    "review_date": "2011-11-10"
  }, 
  "5SU5vf9RzzN4hk3jEASFgg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J R.", 
    "review_text": "Weir was great.  Superb ambiance. Cheese and salami platter was fine.  Great space for events too.", 
    "review_date": "2014-09-01"
  }, 
  "YhAevq4TEDqDOeYMHvdeyg": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Shannah S.", 
    "review_text": "Great little tasting room with plenty of metered parking outside.", 
    "review_date": "2014-05-27"
  }, 
  "hxIIar6pvd_OXk9U3wGaHA": {
    "user_rating": 5.0, 
    "user_location": "Malibu, CA", 
    "user_name": "Danielle D.", 
    "review_text": "What a beautiful, cool industrial setting. If you're looking for a place for a party or reception, this is it!   The Sauvignon Blanc is tasty and unique - highly recommended.", 
    "review_date": "2012-03-30"
  }, 
  "53glsY-cD-PrDdNmkJQSXA": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "Tom M.", 
    "review_text": "Great place for wine in the city.  Laid back atmosphere, wines are incredibly affordable and the staff is great.  Always events going on in the evening so check their facebook page and website to see what is happening.  The wine club is a great value for locals and you can stop in for a comp glass of wine from time to time (don't make it such a habit, you moochers!)  Seriously though, great spot.  The pinot's are really really good and the fact that there location is so awesome, there is no reason not to stop in, have a glass of wine or two, or three...and a charcuterie platter.", 
    "review_date": "2014-05-07"
  }, 
  "LUWclvPjE8I-IXXu6E5img": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly M.", 
    "review_text": "This is a new neighborhood gem  Loved the staff, love the wine. I'll be back.", 
    "review_date": "2011-10-14"
  }, 
  "98JRR6NSd_R8hWvZX8UvYw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren B.", 
    "review_text": "I'm cheating a bit on this review. I've never actually been inside this wine store. They like to close earlier than 7 pm on Saturdays. Like at 6:55. Unapologetically. Apparently they don't care about selling wine.", 
    "review_date": "2014-08-30"
  }, 
  "FPBfqPVePD4DGOC9BzUAeg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tala D.", 
    "review_text": "I came here recently with some friends and tried their wines. I love the concept of an urban winery and I hope the fad catches on.  The standouts were the Sauvignon Blanc &amp; the Syrah. They didn't have too many wines which would probably keep me from coming here on a regular basis but I would definitely bring a friend from out of town here.  The staff is super friendly and the space is gorgeous &amp; arty... great spot for an after-work date!  Recommended.", 
    "review_date": "2012-03-07"
  }, 
  "pYyu8ehqfAZyClHhK-UznA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne D.", 
    "review_text": "THE LOW DOWN Went here last Friday for their BEATS AND EATS - Summer Music and Food Truck series and had a great time! The winery hosts this every Friday throughout July and August. It's basically sampling wines in the $6-$12/glass range, eating yummy Mexican food from the truck stationed outside, and mixing, mingling, and making merriment to a live bluegrass band playing in the back of the space.  THE WINE Oh so tasty. I wasn't in the mood for sampling reds, so I can't speak to their merits (though I heard good things). The Gewurztraminer was sweet without being syrupy and would have been great perhaps after brunch or dessert. The Chardonnay was lovely with its apple and buttery lemon notes. But I finally stuck with the Sauvignon Blanc, which offered the crisp, fruity, light-bodied wine I was craving on that beautiful summer's eve.  THE FOOD The single food truck parked right at the entrance of the event space served soft tacos for $2, Quesadillas and Burritos for $7, and tortas (for $??... I guess the wine was taking effect by that point). The burrito was huge, but delicious. And the soft tacos were the perfect sized snack for someone staving off hunger before dinner. I didn't see anyone order the tortas or quesadillas.   THE SPACE The space is what you'd expect it to look like in SOMA: a gutted out warehouse transformed into a spacious and sleek venue perfect for hosting events. A section of the room was roped off for a private event, but the party was unobtrusive, so it really had no bearing on the rest of the event. The band was set up in the back - a good thing, given the sound was a touch too loud. (And I'm a fan of bluegrass! But I'm also a fan of speaking at a normal volume and hearing my companions when they speak.) There were wine barrels stationed around the room, with seating, so guests could set their glasses aside while they ate. And in the room off to the left across from the restrooms is a bar where a very friendly bartender served very healthy tastings. (Good man. Good man.)  THE CROWD The after-work SOMA crowd pretty much. Although there were a few people with children, the kids were well-behaved (if you can believe it!) and weren't disruptive at all.  THE BOTTOM LINE  Check it out some time. It's not the most original event you will ever go to, but it's definitely a safe bet when trying to satisfy varying entertainment tastes.", 
    "review_date": "2013-07-28"
  }, 
  "Q18GbtoFS8e9uXq6VB1Sww": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Georgie T.", 
    "review_text": "I was visiing SF from San Diego and stumbled upon this place.  Hannah was awesome, she knew everything about wine!! Cheers to Hannah!", 
    "review_date": "2013-07-31"
  }, 
  "ybtnnN5essbAE48TsjOhCg": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Jack D.", 
    "review_text": "Very inviting atmosphere, and a great space for parties and events. The winemaker, Chris, was very generous and happy to explain the process and stories that go into making the wine. I tried several of the white wines, and they were all delicious in their own way. I highly recommend visiting this SF gem.", 
    "review_date": "2011-12-12"
  }, 
  "uk62AztLbCPQ9cXtio9O_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raymond K.", 
    "review_text": "This is an awesome place to chill out without worrying about other patrons annoying you.  The wine is of course very good. Another great point is that they have live bands on Friday evenings and Farmer markets on Sunday mornings.   If you have the chance, you must go!", 
    "review_date": "2013-08-04"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "What a surprising and spacious wine venue that is located on the outskirts and in between industrial buildings in SoMa!  The space is great for holding private venues in SF - especially when the value of square feet is skyrocketing in the city.  Therefore, this Winery is surely a gem!  It was simply a pleasant time well spent here with a flight of wine from the whites and the reds!  I simply had a leisurely time here and I know you will too!", 
    "review_date": "2014-09-24"
  }, 
  "L-5s46Kr_APxLPNl0pUZcA": {
    "user_rating": 5.0, 
    "user_location": "LA JOLLA, CA", 
    "user_name": "Mio W.", 
    "review_text": "Wonderful winery! My boyfriend and I were just there via <a href=\"/redir?url=http%3A%2F%2Fabout.com&amp;s=d28b81d0e63b5508aa84dce58331e655191752e895d75aef716daf8aeab7762d\" rel=\"nofollow\" target=\"_blank\">about.com</a>, and we had a great time! The wine was delicious, and I was pleasantly surprised by how great the complimentary cheese, olives, crackers, and almonds were! The giant glass flask-looking lights were a unique touch to the big room that could easily be a place for a wedding reception or office party - very versatile. The speakers being wine barrels was awesome! So different. Great place (:", 
    "review_date": "2014-12-04"
  }, 
  "bt4pSBah2St9nWoBB-EOAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mercutio k.", 
    "review_text": "Tried the Bluxome flight ($15) which included:  1. Sauvignon Blanc ($22) 2. Chardonnay ($30) 3. Russian River Pinot ($28) 4. Sonoma Coast Pinot ($40) 5. Napa Cabernet ($55)  Faith, our awesome tasting staff member, gave generous pours and really gave descriptive wine notes without any filler or fluff. I enjoyed all the wines tasted.  Of the two whites: the Sauv Blanc was slightly sweet, crisp, and clean and the Chardonnay was not overly oaky with a drier finish.  I normally don't like whites but ended up getting the two bottles.  I'm also not much of a pinot drinker, but the two offered were a pleasant surprise. I enjoyed the Somona Coast Pinot more than the Russian River one, as it was more fruity and bolder tasting. I like my reds fuller bodied... which is why the absolute best wine tasted was the Napa Cab.  I just couldn't justify the $55 price tag, this time at least.  Bluxome Street Winery is a complete gem and totally recommended. I will definitely be back.", 
    "review_date": "2012-03-21"
  }, 
  "-SEae8GovWBlqbqydM8ZnQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "I wandered in here with a friend one night, after passing a nondescript sign the night before, perched on the corner of  5th and Bluxome. Needless to say, this little urban wine oasis is nothing short of fabulous. We tried both the red and white wines, which were equally delicious. We even had the pleasure of snacking on some cheese, which our fabulous and knowledgeable wine host, Katie, instructed us complemented the \"bright\" and flavorful Shiraz.  Beyond the bottle... this is an all together amazing space, which took aesthetics to a whole other level. Not only are berry soaked barrel innards used as wall decor in the main room, but the whole space has a warm glow that radiates from gorgeous European wine vessels (carboys) constructed into light fixtures... sure to make any wine/design lover swoon!  All in all, the perfect place to perch up to the tasting bar with a glass (or two) of wine, right here in the city!", 
    "review_date": "2011-11-14"
  }, 
  "pZAktka6VfcXmUf4lWlBJQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn G.", 
    "review_text": "I received a Thrillist email featuring Bluxome Street Winery a few weeks ago, and finally made it over for a tasting on Saturday. The story is that they are going back to the pre-1906 earthquake roots of winemaking in the city...back in the day when the grapes were grown outside the city and brought back in for production. Its a great concept that hasn't really been used since the fire (Prohibition really snarled the rebuilding of urban wineries). Anyways, I digress.   Pros: - Amazingly good wines and a range of varietals. My friend and I split a red and white flight. The red flight featured two pinot noirs and a delicious syrah. The whites included a sauvignon blanc, gewurztraminer and chardonnay.  - Fantastic space and atmosphere. Its definitely a warehouse/winery, so its a bit chilly. But the decor fits the space...big glass lights hanging from the ceiling, exposed beams, concrete and a projection of a pre-1906 earthquake video of SF. Would be great for private parties, events and weddings.  - Friendly staff. I'm a little biased on this, given that my friend works behind the tasting bar (unbeknown to me until we showed up on Saturday).  - Reasonably priced. While its certainly not an everyday drinking wine, most of the bottles were $28 (except for the single vineyard Pinot, which was $45) and the tasting flights were $10 for three wines. It would make a great gift. They also sold wines by the glass and cheese plates.  - While I took the bus, there were plenty of open parking spots on Bluxome Street. This will probably change when the Giants have a game, but otherwise it looked pretty easy.   Cons: - The location is kinda out there if you're not already in SOMA. The proximity to AT&amp;T park makes me think this place will be insanely busy during baseball season.   Overall A fun concept with solid wines--definitely worth a trek across town.", 
    "review_date": "2011-12-05"
  }, 
  "SFR2bCpp_3Xt-2gAk0A0bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rick L.", 
    "review_text": "We made an appointment to do a wine tasting at Bluxome Street Winery on  a Sunday afternoon. There was parking right out front, which is a very rare thing for SF. Did you know that this part of Bluxome Street used to be gravel? It looks so grown up now :)  Anyway, the tasting area smells wonderfully of oak wine barrels and there is great music playing in the background. Bonus points for playing the Pixies! The atmosphere is really nice.  We had a TravelZoo coupon so we each got a flight. The wines are very good and the pours generous. The wine server was informative and charming. We ended up buying a bottle of Pinot.  All in all a very nice experience.  We will be back!", 
    "review_date": "2013-11-03"
  }, 
  "VP23adXAIWNQrtPKWiyBBg": {
    "user_rating": 4.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Rosyan C.", 
    "review_text": "Had a great time, the wine is a must try. Friendly and helpful staff.", 
    "review_date": "2013-11-19"
  }, 
  "AV6n2IFxNHQ2lu7ZONOomw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark O.", 
    "review_text": "BSW is a great new winery halfway between 3rd and 4th on Bluxome street. This is conveniently located near the caltrain station and AT&amp;T park. It is our go to place to grab a glass of wine at the end of the day.   The interior is very cool with an entire wall made of glass showing barrels upon barrels of their various wines. The high ceilings and large floor area allow for all types of events to be held there, and it is possible to reserve the venue for private parties as well.   Every friday they have their own events along with a different food truck parked outside.  Having a membership gives you a shipment of bottles a few times a year and the privilege of coming in for a daily glass of wine. It is also dog friendly too, which is a huge plus.", 
    "review_date": "2014-08-21"
  }, 
  "j3Ha0Cvi5FftxbWUmHzkzg": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Carma G.", 
    "review_text": "Our company holiday party was held here last night and it went off without a hitch and amazed everyone there. At least 20 people came up to me at work today and commented on how beautiful the place was, how great the wine was, and how cool and classy the place was. No one was disappointed. It is a beautiful space. The wine is delicious - I particularly enjoyed the one lot Cab but the Russian River Pinot was a close runner up. The staff was knowledgable and explained the wines perfectly. Emily (who is the event coordinator) was a pleasure to work with and could be found on the floor helping to set up and make sure everything was running smoothly. I could not be happier with every detail of the venue, the wine, and the ambience the winery gave off. Warehouse chic with home in front of the fire warmth. I love this place!", 
    "review_date": "2012-12-14"
  }, 
  "b1Iu7lgKqMB6i-6-bXjmfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter S.", 
    "review_text": "Friendly staff, small/boutique atmosphere, nice wines", 
    "review_date": "2012-10-23"
  }, 
  "m7ulbgBB7Z-0STPpBMiOuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B. Y.", 
    "review_text": "Went to the soft opening for Bluxome Street Winery today and had 2 very nice glasses of Pinot in their new tasting room.  Great service.  Wonderful way to spend a Sunday afternoon.", 
    "review_date": "2011-09-04"
  }, 
  "FDt-3cBVFTGVJXcQdGU93g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jake D.", 
    "review_text": "Favorite spot in the 'hood. Great space, surprisingly good wines, and a decently priced wine club. Great alternative to the local sports bars.", 
    "review_date": "2014-09-18"
  }, 
  "t_L5W32yaD9pYRuRQkxT5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy C.", 
    "review_text": "Incredible space for events-industrial chic for sure, with great lighting throughout.  Staff is really friendly and helpful and the wines were pretty good. I love how it's a bit hidden.", 
    "review_date": "2013-06-22"
  }, 
  "Sp4Tqo9BiGD6QT-TCnQBJg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Karina P.", 
    "review_text": "This review is about 6 months late. I hosted my wedding reception there last July and it was amazing. Jennifer the Event Manager was very helpful. The staff was very nice and the space is beautiful. My guests all raved about the wine and the space. I would highly recommend it.", 
    "review_date": "2013-01-29"
  }, 
  "aVGSnXBXFuLXAihXZSf7DQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L v.", 
    "review_text": "I shocked at seeing all the high ratings here. The event I went to had the worst wine I've ever tasted. The pinot for $15 a glass was horrible. I couldn't drink it. I tried everything else on the flight of whites and longed for 2 buck chuck. The venue is very nice thought. Sorry...I wanted to like this place.", 
    "review_date": "2014-08-03"
  }, 
  "iQ3h131qjlj_dqnnURGdbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Perico P.", 
    "review_text": "We'd been meaning to come to this place for a few weeks months now since we started seeing their sign on 4th and Bluxome. This afternoon we passed by and peeked in to see a small tasting room, so we decided to come in later. Boy, was that a surprise. The tasting room is actually a tiny fraction of the area this place occupies, with great view of the barrel area. Our server explained that it's a full winery with 2 harvests so far (grapes from Sonoma coast and Russian River), and only 3 months since they opened. We had 3 flights and two single glasses, which were affordable and quite generous. Along that, we also ordered the charcuterie plate, with salami, cheese, cashews, pickles and dried apricots, all delicious and a good complement to our wines. Our server was friendly, knowledgeable and attentive while not hovering too much over our table.  We'll be back. A nice place to have some great local wine while chatting and munching. Almost like being at home in Spain!", 
    "review_date": "2011-12-18"
  }, 
  "dRFblt8xitfnwnPbEBo0Vw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shanna C.", 
    "review_text": "Great setup with a big open space that's perfect for hosting a private event. There's also a side room if you want to have something smaller. The night I went they had invited a food truck so they stayed open late and you could get wined and dined. The wine was solid, the pours hearty, and the servers knew what they were doing and suggested excellent companions to our food truck meals. Fast service, too!", 
    "review_date": "2014-01-12"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "After several visits to Bluxome, it's safe to say that this urban winery is 5-stars IMHO.  Not only do they churn out great vino, but they also host regular events, ranging from tech gatherings to holiday craft shows. The space itself can host approximately 75-100 comfortably?  Each time I go, I try a different Bluxome varietal. Chardonnay, Russian River Pinot, Rose - I like 'em all!  Really nice employees, always welcoming guests with a smile and offering a taste. Truly a SF gem.", 
    "review_date": "2014-12-15"
  }, 
  "4kkh2SKkT5EPz2QByPTrFw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bebe W.", 
    "review_text": "I have been accused of giving too many 5 star reviews lately but this one deserves it.  Bluxome Street winery is in a warehouse and looks very unassuming but quite nice inside.  Close to AT&amp;T park and caltrain as well.  We had a private event here yesterday and our guests really enjoyed the venue, wine and food (and of course the program).  Everyone seemed to enjoy the Russian River Pinot Noir and drank it like fish.  The space is open and airy  and can easily accomodate small and larger size groups.  The layout enables it to have great versatility and I can see folks using it for bridal showers/ weddings, birthday/anniversary parties, corporate functions, etc.  We had several guest speakers and a panel at our program and the space worked great for it, The roll down garage door was closed once the presentation began.    if you are hosting an event here on game day, i recommed providing valet parking for your guests.  The staff is very friendly and the space is great so planning events here should be a breeze  I also want to check out their meet market - it's the last Saturday of the month and features artisanal type food.", 
    "review_date": "2013-06-20"
  }, 
  "qIDy9zJfCuqxy6A3exPe_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne C.", 
    "review_text": "Winery in the city, say what? I would have never known about BSW if my friend hadn't found the voucher: 2 tastings (5 flights each) &amp; chartucerie plate for $20! Absolute freaking steal. What's even more crazy? The wine is actually good! Shocking. Sauvignon Blanc, Chardonnay, Pinot Noir, Syrah. I bought a bottle of Syrah.   Our pourer, the blonde gal, gave very generous pours. She was so sweet and knowledable about the wines and history of wineries in SF. My friend and I had a blast for 2.5 hours trying to finish all that wine.   The last tasting is at 7, so get there early. There's plenty of seating available. Food plate was great! Tastings are normally $15, but with all the wine you get... it is worth it!", 
    "review_date": "2013-08-30"
  }, 
  "wsUJ2O9wspG32NK8BR7VWg": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Nick V.", 
    "review_text": "What a cool ass place.  We just happened to stroll by yesterday afternoon and decided to go in for a taste.  Not only is the wine tasting delicious and affordable, the atmosphere is top notch.  Perfect idea for a group or guests from out-of-town.  If you don't want to make the track up to Napa/Sonoma, this is a great alternative.  We loved the Sauv Blanc and the tasty crackers that they served.", 
    "review_date": "2012-03-04"
  }, 
  "mF1riS0zgG3rxltPD8AVHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe Bob J.", 
    "review_text": "Great design and details.  RR Pinot was tasty.  Great Staff.  Smart winery &amp; event set up.  Drink on...", 
    "review_date": "2012-06-15"
  }
}