{
  "pEi67NwFElznHpB-m9CZXg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Astha S.", 
    "review_text": "Great live music, small dance floor nice bar. Been here many times I like how lively this place is...", 
    "review_date": "2013-08-22"
  }, 
  "tH8hrIshvkHH_ER68LD2gw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "h s.", 
    "review_text": "I recently was at Boom Boom room (only to meet a friend).  the experience was (if this were possible) less enjoyable than my previous time there.  Quality to cost ratio is not very good.  If you factor in inferior service, not recommended when you consider all the other options we have in SF.  Too Bad as when JLH was alive this place was \"benchmark\".", 
    "review_date": "2010-08-27"
  }, 
  "k9Eyxp8enSJU2l39bW9sjQ": {
    "user_rating": 3.0, 
    "user_location": "Helsinki, Finland", 
    "user_name": "Juhani P.", 
    "review_text": "Very typical S.F.  bar. The best part is the really cool bands playing there, it's a bit too dark and no mojitos!!", 
    "review_date": "2005-09-02"
  }, 
  "zk9T9e23B1mKvnnfyFi89Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin K.", 
    "review_text": "Without a doubt, this is one of the BEST places to see music in the city.  They have a steller record of bringing in great talent and if you've ever been to Jazzfest (or wanted to go) you can feel that same vibe at BBR.  I have been here for my birthday, for new years, i have hung with local friends, brought out of town guests and wandered in during the Fillmore Jazz Festival.  It always draws a crowd that loves music and its a lot of fun - everyone is cool, its easy to get a drink and the place is always a sure thing for a great time.", 
    "review_date": "2008-03-23"
  }, 
  "qIRbe4J-5OMkIA8V6rdC9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas T.", 
    "review_text": "One of the finest venues in SF.  These people know how to run a show and not just get you in with flashy ads and cheap drinks.  The sound system here is TOPS, unlike many, many places in SF these days.  I've loved every show I've seen here, from Richie Cunning to the Black Nature Band - the acoustics are quality and everything is crisp so you can actually hear the words, hah.  ROTC (Return of the Cypher) is dope as hell, I go to this whenever I can and love getting up on stage with positive, conscious hip hop.  The crowds are wonderfully diverse with attractive people that you want to get to know better.  Bartenders are always nice and chill and the put some great visuals on the walls with local art and stuff.  It just gives everything that solid local SF vibe.", 
    "review_date": "2014-10-14"
  }, 
  "YfNB5zzdyXclh8eHH_wCtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan G.", 
    "review_text": "This place is pure San Francisco...great music, eclectic crowd...and What is that smell in the air?  Was here last night. Awesome funky/jazz band made the dancing easy. Cheap strong drinks and they even have a cocktail waitress going around so you don't have to mozy up to the bar if you don't like.   You don't have to be fancy or classy to come in here, yet for some reason this place just seems to ooze cool. Red lights everywhere, leather, and a checkered floor decor.  Next time you are looking for a fun activity on a Friday or Sat night, mozy over the the boom boom room.", 
    "review_date": "2010-01-17"
  }, 
  "wvo6CDYUY6gD6q_iLjmAOQ": {
    "user_rating": 1.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Sandy B.", 
    "review_text": "This place smells like vomit. Walked in and ran out.", 
    "review_date": "2008-12-31"
  }, 
  "4Y81J2Tdq5XAnkeYmCZ2ow": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nique F.", 
    "review_text": "Sometimes my soul gets a little dull and needs a good schluffing. Some soul-polish, you could say. It turns out, the Boom Boom Room is an instant cure. Nothing like some deep bass and buoyant horns to bring me back to life.   My music-guru buddy recommended BBR for a Saturday night birthday escapade, and the Funk Revival Show was absolutely intoxicating. You know that feeling when you walk into a room and this rush of excitement washes over you? It happens at the Boom Boom Room. The place is electric and you can't help catching a few volts.   They've got some tables along one side, a bar along the other, and the rest is open for movin' and groovin', which is highly recommended considering how ridiculously funky the bands are. It gets packed, which is great on the dancefloor, not so great in the ladies restroom. But, all in all, totally doable.  $15 cover is pretty standard here, so plan to make a night of it and you'll surely get your money's worth. For a dreary, weary soul...revival is priceless.", 
    "review_date": "2011-10-14"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "A hot spot to listen to the Blues, right next to the Fillmore as well. The BBR has attracted true legends to play inside its intimate space. I had the privilege of seeing John Lee Hooker (the original owner!) play his last gig here a few years ago.  If you like blues or jazz, this is probably my favorite spot to see it all go down.", 
    "review_date": "2005-05-12"
  }, 
  "TRw1R_efLWgLz2URH-IIMQ": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Alan N.", 
    "review_text": "MUSIC: Live Jazz = Awesome chill music  ATMOSPHERE: Super laid back. The bartender was awesome! The place itself isn't the biggest, with tables near the back and the side as well as a stage and a pretty decent size dance floor. Overall, a very 70's feel in the space. Big plus for checkered-tile floors!!  CROWD: Not super crowded at all, then again, we did go on a random Tuesday. Lots of classy people there, with a few who had a drink too many. They were more of a side entertainment than a distraction (You go single dude dancing by himself).", 
    "review_date": "2010-01-20"
  }, 
  "RPD2MK_RJbCY_GFsLAZjig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teddy d.", 
    "review_text": "LOVE THAT BOOM BOOM...IN THE ROOM...  Always fun never a disappointment. I have been here many times always unplanned and sometimes after going to the kabuki theater. As always gets packed on the weekends...but I will take a crowd for a live band any day and what  would a venue with live music be with out the patrons packing the dance floor...", 
    "review_date": "2007-05-04"
  }, 
  "he8e3P8HFVaNe1OY3oMM_Q": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Brian M.", 
    "review_text": "Great club, but it does get very warm inside.  If they'd just leave the front door open I'd give them 5 starts.", 
    "review_date": "2005-11-20"
  }, 
  "9myAXqIdHyrIxX_ESbuD2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betsy F.", 
    "review_text": "a great little historic music spot with stiff drinks.", 
    "review_date": "2010-02-25"
  }, 
  "Bw39t2MOstV2VPcAOlYbjg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruth B.", 
    "review_text": "I was refused entrance because I had a small backpack.  I told them they could look in but they refused.  My husband had already entered and he would not let me in to tell him.   He told me to text him.   How rude.  I will not be back.", 
    "review_date": "2014-07-08"
  }, 
  "4ZRxv6Lga9bj7R6x9HSoJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex C.", 
    "review_text": "God I love this place. They manage to book so many funky combos and sweet bands and let the shows go nice and late. Bands will regularly finish up at other venues (Fillmore, Independent) and roll over here to sit in and finish out the night. Always a treat.  The Independent and Fillmore are great spots, but I think I'd have to say this is my favorite venue in SF.", 
    "review_date": "2009-10-11"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "Drinking, dancing, and bartenders who have got your back. While the Boom Boom Room probably won't be a regular watering hole of mine, an evening of drinks here might almost always guarantee a fun time.  We went to the Boom Boom Room following an event and were looking to continue a merry night of drinks and conversation. I think the night vaguely went like this:  \"Oh what's a Boom Boom Ale?\" Glurp, glurp, glurp.  Toast! Speech! Chatter, chatter, chatter.   \"Oh another Boom Boom ale?\" Glurp, glurp, chatter, chatter, glurp, glurp.  \"Who bought more Boom Boom ale?\" Glurp, glurp, chatter, chatter, glurp, glurp.   \"Oh I love this song!!!\" Dance for your life.   \"Oh I need to go. Let me settle up my tab.\"  Settle tab.  \"Oh I love this song!!!\" Dance for your life again.  \"Man I'm thirsty again\" Ordered another drink and paid with cash.  Drunkenly told bartender to keep the change.  Great bartender reminds me I gave him a twenty.  \"Thanks man. You're awesome!\"  I'm sure I will be back to the Boom Boom Room.", 
    "review_date": "2010-11-23"
  }, 
  "ZQu4Pw0NtxmQUdwT-DUJNQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Fal A.", 
    "review_text": "They have nice live music sometimes.", 
    "review_date": "2010-08-18"
  }, 
  "Myuxc-kYIiIVH43snmVwBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dominic H.", 
    "review_text": "The BBR is the best-sounding smaller room in the City. Come for the music, which these days is mainly 'Nawlins funk with a smattering of blues and soul, or just come for the vibe and the cool staff and crowd.   Dr. Lonnie Smith, Stanton Moore, Eric Lindell and others are known to play here, so keep an eye out - this is a great venue to see these guys.", 
    "review_date": "2010-08-03"
  }, 
  "7XvUlAuIRF9IhWAvlr5U7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rocco B.", 
    "review_text": "This is a great music venue.  Lots of open space, but it's relaxed and intimate enough that you can see a really good show.  I was recently visiting for \"That One Guy\", a one man band who plays this homemade electronic instrument that he calls \"the pipe\".  The fact that he does the whole thing alone was amazing in it's own right, but the music and songs were really rockin' too.  The bartenders were fast and attentive, but stick with beer.  Mixed drinks were mildly expensive and weak.  Another insider tip: steer clear of the Boom Boom Ale; it tasted like Bud.", 
    "review_date": "2007-09-25"
  }, 
  "K-NT_xHy7q779oSPLCyvNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Any place that can make me peel off a layer of clothing in front of five of my male coworkers and shake my groove thang has got sumthin' goin' on, I tell you what...  If you think $15 is a steep cover, go home. You're lame. You won't appreciate the acts they have in here, anyway. It's seriously good shit. This is the most comfortable I've felt musically in San Francisco. It ain't Detroit, but it's close.   Seriously soulful music emanates from the Boom Boom Room. Seriously.  Once you get through the door, the drinks are pretty reasonably priced: a nice surprise. Which leads to layers of clothes being peeled off and groove thangs shakin'...   I said LAYERS of clothes...", 
    "review_date": "2007-04-15"
  }, 
  "tIRh_AmxJhUgzoHUBMPnlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jubi l.", 
    "review_text": "Mr &amp; I decided to check out the Boom Boom Room.  Per fellow yelpers suggestion we were cash prepared! ^_^ We wanted to see Marva Wright from New Orleans. The show didn't start till past 10 PM. The japanese girl who played the organ was off the hook and Marva's voice was awesome. We even bought her CD.  Place wasn't that big but it was a good size. The staff at the Boom Boom Room were friendly and attentive.", 
    "review_date": "2007-07-02"
  }, 
  "56I-v3n1u94MysqbPmhyNA": {
    "user_rating": 4.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Ryan B.", 
    "review_text": "Loving me some Boom Boom! Went here for drinks before Snoop Dog at the Fillmore. Nice, sexy staff, reasonably price as well as strong drinks, live bands it looked like (setting up) and uber clean considering said location can be shakey at times. Super dive and that's what I like about it!", 
    "review_date": "2010-03-03"
  }, 
  "XnhDByXaRwgMVsAjmDRDZg": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Chris B.", 
    "review_text": "Generally, I like this place. However I went in on Friday night 9/19 to see Alphabet Soup and was pretty let down. The headliner didn't come on until 1:15am. My ticket said show starts at 9:30pm. I get it, the opening band may not start until closer to 10 or so, but they were on waaaaaay too long. They were so good I forgot the name of the band! Oh wait that's a lie, for the 2+ hours they played all their songs sounded like one looooong song. When I asked the sound guy at midnight when the headliner was supposed to be on, he said 5 minutes ago? No worries. I let that go, I wasn't here to see the opener, right? So they come off the stage around midnight. It takes them more than an hour to get Alphabet Soup on stage. At 1am, with no band playing, I finally asked the door guy for my money back and he explains that they advertised an opening band and it was out of his hands. OK, well so is this review, it's totally out of my hands! Alphabet soup sounded great for the 2 songs I was able to stay for. None the less was really let down by the lack of professionalism and customer service. I don't blame the door guy for the late band. Although with an unsatisfied customer I think you would do more to listen and hear that I wasn't happy. At least buy me a beer and shut me up until the band starts?  One more note, I wear earplugs to all shows and I can say that your sound guy needs to know when he's got the levels too high. This show was painfully loud and the place wasn't that busy so even with earplugs I was uncomfortable with the sound. I can say this must have been an off night for you guys as I've seen shows there with no issues which is why you got 2 stars. I would avoid a show there at this point due to the poor customer service I received.", 
    "review_date": "2014-09-22"
  }, 
  "ti4lRf8rv9KICw6msOJT0w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ameer N.", 
    "review_text": "the boom boom room didn't have that much room.  i stopped by here after the fillmore jazz festival for a few beers and some live music. the act playing was high energy and lots of fun.  the beers are served in plastic cups (i think) and go for a relatively reasonable price.  i think after 8pm or so they charged a $5.00 cover.", 
    "review_date": "2008-08-31"
  }, 
  "PNTbcuPX5V81XibwrNzskg": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Paula R.", 
    "review_text": "I have been here a few times lately, so far so good. We went here twice after another show and the band here was as good if not better than the shows we paid to see. Nice staff, this bar has a local feeling- like your at home, or a regular. Good times :)", 
    "review_date": "2011-05-28"
  }, 
  "Zx5Fd5AqWHLZAUosdjMfYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sf f.", 
    "review_text": "Four stars for the club, 1 star for the treatment at the door.  I liked the ambience and I really support having affordable live music venues in our city.  They tried to charge me the $10 cover at a time when free admission was advertised.  I am not taking off a star because eventually when I showed them the ad on their own website on my phone they gave in.  But the door staff was not friendly or apologetic about the mistake in the least.  Friendlier service would be appreciated.", 
    "review_date": "2014-02-11"
  }, 
  "iIn_sZxyyg5yv6jcAzcYFA": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "Ben G.", 
    "review_text": "GREAT GREAT GREAT small club.  Friendly bartenders and a great, easy-to-reach location.  Good sound (for a bar) and an easy-to-reach location.", 
    "review_date": "2008-08-22"
  }, 
  "M3uld0eXDNWOR7sYsmgK-A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "alexis b.", 
    "review_text": "Don't say I didn't warn you....This place is THE WORST (Disregard the 1 star it made me)!! Come here if: You want rude service You like weak drinks You hate your ears and want to subject them to the \"DJ\" You like throwing money out the window You enjoy the smell of vomit I live practically 2 blocks away and will NEVER be back.", 
    "review_date": "2009-11-06"
  }, 
  "hSou1Jz-x9_Vhx5y6Icj4g": {
    "user_rating": 1.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Michael G.", 
    "review_text": "If you're going to advertise that a band starts at 9.30 then try and ensure that is when they start or at least close to...we had to give up and leave when WB still hadn't come on stage by 11.00pm....Wankers", 
    "review_date": "2014-10-19"
  }, 
  "2LIX6kOFFExqPaHy2_kRNA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pax, Formerly Known As Rufus D.", 
    "review_text": "this place is all good.", 
    "review_date": "2010-07-04"
  }, 
  "m5cBT7OYfn0HM0d-RCsdZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miika M.", 
    "review_text": "Wow.  A good dive bar with an even better wide open space near the band stage  for easier listening.  My gin/tonic was watered down, although it could have been the fact that the Crown Royal from earlier was still coursing through my veins with a vengeance.  This place has too many nooks and crannies (replete with curtains and the obvious darkness) where a situation could be taken advantage of, but at least the bathrooms were clean.  Always a plus.  I love the bartender here.  She came right over without me having to flail anyone down.    A good blues band was playing last night and when in the right company, it all fuses together.   I'm remembering this place.....an experience :  my first date with W.  hehe", 
    "review_date": "2007-12-28"
  }, 
  "Zl1fJNTzNULZiqBRShxUYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John S.", 
    "review_text": "You gotta love this place.  I've been about three times.  I was never impressed by the musical acts, but the people-watching to be done, especially at the bar, was amazing.  I don't know whether she still works there four years later, but there used to be this bartender who looked all of fourteen.  Anyway, each time I went, she would be hit on by these really gross old geezers who seemed like regulars.  They were drunk, and she more than held her own.  I respected her, and I respect the place if it attracts bartenders like her.", 
    "review_date": "2008-03-02"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "A strangely curious club at the corner of Geary and Fillmore.  Its location is quite interesting.  The club is technically situated in Japan town, yet, the Boom Boom Room is somehow referred to as a live band club in \"The Fillmore\" (which seem to me as indicative of being situated in the Western Addition side of the Fillmore).  As you enter into the club, a couple of bouncers welcome you and stamp your wrist upon receiving the $15 cover charge for the evening.  (Amazingly, the bouncers are people-friendly, unlike the wanna-be cool and exclusive bouncers of Soma, NorthBeach and other wanna-be pretentious, but definitely not world-class cosmopolitan hoods.)  The place is dimly lit while the ambiance is definitely retro and quite intimate.  A predominant existence of the 70s lounge chair in faux leatherette finish surrounds the place, while the main door also appears with the same look and finish.  At the end of the lounge a small stage appears where musicians go wild in playing their tunes, serenading the intoxicated crowd who move in trance-like fashion to the beat of each note.  Last Friday night the NOLA-based band's rendition of various SKA tunes drove the elated crowd wild.  It was interesting for me to see how modern urbanites have turned into a robotic group of unconscious homo sapiens, as they swayed in hypnotic motion to the music.  That night, it struck me that rhythmic beat and music is such an integral part of human existence, almost as vital as the need to breathe, to eat, and to procreate.  I enjoyed the company, as I was surrounded by my beloved boxing chums.  Although, I was quite confused initially, as I expected a jazzy and blues type of venue.  The SKA with a metallic twist genre, was quite a surprise, but nevertheless, it was a well-spent evening with kindred friends.", 
    "review_date": "2007-04-11"
  }, 
  "KeckKVgYyq4739Wap3X_Sg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tre s.", 
    "review_text": "Stumbled into this place towards the end of the Jazz fest - it was hot and humid inside from all the dancing that was going on. The band rocked the place and at the end of the set... a red curtain descends from the ceiling so they can have some privacy as they pack up they instruments. I am easy to please - the dance floor and the red curtain sold me on this place.", 
    "review_date": "2008-07-07"
  }, 
  "5WlF0WZAnkDcys9zAcWWPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosavida C.", 
    "review_text": "The Old Fashioned wasn't bad, but it was definitely not good either. I liked the atmosphere and the bartenders were nice. Easy to find parking. What else... OH, they definitely need to work on air circulation. I'm glad they allowed ins &amp; outs, otherwise I would have suffocated to death on the humidity and recycled air.   If someone awesome was playing I'd definitely go again.", 
    "review_date": "2013-11-09"
  }, 
  "epGQfAOfJ7WzO-10Hg4Yng": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Jen A.", 
    "review_text": "I went here for the first time to see Troy Andrews and had the best time in a very long time.  The place was clean, lit well, friendly and pretty well priced.  It was pretty crowded that night but I still had space to dance which was key - and which I did very very hard.  Plenty of parking around the neighboring blocks, plenty of food around, don't forget they don't take cards!  Boom freaking boom!", 
    "review_date": "2007-08-31"
  }, 
  "oY0RIWGykQK38ZbyBvb44g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Heidi G.", 
    "review_text": "I think there is a lot of truth to what other people are saying about the Boom Boom Room - while I really, really like this venue, when I read what others had to say it reminded me of a few of the reasons why I don't go here often or have been dissatisfied in the past.  It definitely feels very historic, and though I've been here both at night and in the late afternoon, it's always kind of dark and divey and has the same vibe on the inside. The music is really authentic and I like the ambiance - nobody bugs you, the lighting is good and the bartenders and door people are cool. And even though it's a dive, I don't remember it having that bad \"cheesy\" smell on the inside that you sometimes find in other places.  BUT...the bathroom is absolutely disgusting. I went around 7PM one Sunday night before anyone was really there, and the entire bathroom reeked like stale vomit, even though it didn't look like many (any) people had been through there. I also felt like someone was going to come busting in on me the whole time, as I was hovering, holding my breath, and holding the door. Sucked, because you know what happens the more beer you drink. The more you have to visit the ladies' room! So I ended up only having one drink and leaving.   Thankfully, I hadn't had to pay the $15 cover because on the way in I'd told the door guy that I'd just be in and out, or I would've felt obliged to stay. I've also caught a few drinks here before going to shows at the Fillmore, and have always enjoyed myself. It's a nice way to start the evening, as long as you don't get stuck with the cover.  I'd like it if the bathrooms got revamped and would recommend checking beforehand to see what's going on at the Boom Boom Room before just dropping in, if it's in the evening. That seems like a hefty price to pay just to enter a club, unless you're planning on staying there for the evening.", 
    "review_date": "2008-08-11"
  }, 
  "R9F4ZM7cfN1CM00JkY08Ug": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "diana c.", 
    "review_text": "I am not one to post bad reviews unless I feel others should know .. and YOU SHOULD KNOW!. I don't know what you are doing at the BBR these days but if last night is an indication of who you allow to represent your business .. we will NOT be back. The two 'boys' 'young men' that work your door are rude, mean and racist. Yes, I said racist. My husband is a black man and your doormen would not allow him back in because they said 'your husband doesn't have a stamp'. It was clearly there and we had just come through that door less than an hour before .. they remembered us and stamping us. The 'bald' shorty rude person that wasn't at the door but showed up with his 'Napoleon' syndrome and grabbed my arm when I just said 'my husband' has a stamp .. saw it! So, he, rudely apologized for their racism but at the same time grabbed my arm with strength to tell me 'I said he's good'. I did not raise my voice at all. And I say, racism, because I watched them ALL night long let 'fake wanna be Tupac wearin' kids go in all night long without them checking their stamps at all. And some of them were much darker than my husband and you could see 'their' stamps?. I know you could care less if we come back cause we're just a couple of dollars to you. But if you do care about your reputation .. then you should know .. we won't be back and I promise to make sure none of my friends go there again. Jack's was a good neighborhood live music bar ..but you've now become trash and classless. I bet John Lee Hooker would not like what you've become. Good luck to you. Thankfully there are other live venue choices in our City .. we don't have to go back to yours. (Oh and the system made me give you at least 1 star..I would give you none)", 
    "review_date": "2014-09-07"
  }, 
  "79pQB9ZzROBHxMM0qJaq3g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samira S.", 
    "review_text": "Went there for New Year's Eve...it's a cool little spot with a very eclectic mix. Good for an average night out on the town. Bad for the little seating offered and minimal dance room. The bands are always great, though.", 
    "review_date": "2006-01-02"
  }, 
  "j0eBR4rcbtpylG6b47TD7Q": {
    "user_rating": 5.0, 
    "user_location": "Queens, NY", 
    "user_name": "Helen L.", 
    "review_text": "So what if the place is tiny? So what if the ceiling is low? So what if the acoustics aren't the best?  Let's talk about the FUN FACTOR!  Depending on the band, the number of instruments on stage, and the volume the performers decide to crank it to, some bands may sound better than others. Some bands may sound a bit muffled, but so what? Time after time, I would have a BLAST! The Boom Boom Room lives up to it's name! It's grimy, it can be a bit sleazy (and I mean that in a good way), and it's always cracking! Every time I've been there, it gets packed, but never uncomfortably packed. Plenty of room to dance! And isn't that the whole reason of going to the Boom Boom Room? To get your boom boom on?! LOL...always a good time. Period.", 
    "review_date": "2010-09-25"
  }, 
  "uRKRDIjWBBrMJyuhGC1VLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mag N.", 
    "review_text": "They get points for keeping the decor old school with pictures of the real deal players on the wall. They even have one of Country Pete McGill,who I have played with.Unfortunately,I've seen bad bands here-just collections of players. The stage is decent,much better than most places, with a curtain that moves up and down-this is an undeniable plus to the musicians as part of the entertainment aspect. The jukebox has the authentic blues stuff,no shakey fakey stuff. Beers are too expensive,even at Happy hour at $5. But you know the owner has to make ends meet and appeal to younger generations than Hooker's,et.al.,so....", 
    "review_date": "2009-05-30"
  }, 
  "IkoXyeNTHqpU24dHKmIcrw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kurt C.", 
    "review_text": "\"When the only sound in the empty street, Is the heavy tread of the heavy feet That belong to a lonesome cop I open shop. When the moon so long has been gazing down On the wayward ways of this wayward town. That her smile becomes a smirk, I go to work.\" - Billie Holiday, Love for Sale  I'm waiting to fall in love with a Jazz club in San Francisco.  Everyone always says Yoshi's is the place to go and while I've been there more than a few times, the kind of music I'm looking for isn't fairly represented at any of the jazz venues in the Bay Area.  Every city has a place where headliners frequent (IE - Yoshi's, Boom Boom Room, The Warfield, The Independent, etc)... but it's hard to find a place where the local talent can really shine through.  The Boom Boom Room has a lot of acclaim in San Francisco, and while the talent has always been mediocre, none of it has ever been amazing the multiple times I've been there.  I can review the rest of the bar, but honestly, the only thing that matters about a jazz club is the jazz.  And outside of the headliners, this place has mediocre talent.  Now, outside of it being a mediocre jazz club, the bar is good.  The bartenders are excellent, there's a lot of space to walk around in, and the clientele is friendly.  My suggestion, go with a group of friends.  While it's definitely easy to meet people there, I've always had a lot more fun when I've gone with a group of people I know.", 
    "review_date": "2008-12-29"
  }, 
  "58ZGUbmRpf8_lEHdE47upQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jessica R.", 
    "review_text": "I went this past Valentine's Day to see Eric McFadden rock out and can honestly tell you THIS is what San Fran is about for me.  A collection of different kinds of people-- the hipster, neo hippie, bohemian, grunge rocker,etc --more than likely all locals-- blues music, rock music, flowing moderately priced drinks, and the smell of sweetness in the air.  First time I was there and I didn't want to leave! I just hope I can have myself the same experience when I get to go again.  Go if you get the chance, or if you are looking for a fabulous hang out hole in the wall.", 
    "review_date": "2011-04-26"
  }, 
  "K9UCL5zroxiczuS4iZTSNw": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Audrey K.", 
    "review_text": "NVO, the best band in the history of my relationship with the boom boom room, is the reason this venue is so great. THey rock my socks off once a month.   Drinks are overpriced, but the space is great.", 
    "review_date": "2012-08-04"
  }, 
  "f2_ORdto2MUlxp6-LlmKgg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Trav M.", 
    "review_text": "Major props to The Boom Boom room for being a great host venue for tired Fillmore Jazz Festival partiers!  I visited this place for the first time last Saturday as we were traveling up and down Fillmore street for the jazz festival (which was so amazing this year!). We had been up and down the street a couple times already at this point and we were looking for a place to kinda rest while still soaking up some good music...that and I figured this would be a perfectly valid reason to visit the venue since I've always wanted to visit it.  Saturday, BBR was free and hosting a live band (forgot the name) and some great drink specials, to which the bouncer encouraged you to get them \"to-go\". I got into some $5 sangria and sweet tea vodka concoctions. Both drinks would have been great, had they not been watered down with club soda. Considering this was part of a pretty big event, I'm sure they were just taking precaution to not get everyone wasted, for that I respect them.  The venue has a very historic and iconic feel to it. It's very old-school, pretty spacious. The bar staff was kinda...off. They were either tired, stressed or a high mix of the two.  I'm definitely interested in checking out this place on a weekend night to see how a \"normal\" weekend looks here.", 
    "review_date": "2011-07-06"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "Great bands on all the good nights (and even relatively often on the off-nights), and nothing but live music all the time.  Sound system is usually too loud, but well balanced, unlike a lot of other venues where it's clear their sound guy has gone deaf. Beer is definately the best deal - the hard stuff is expensive and comes in small glasses.  They only take cash! Oh, and the shows almost always start an hour late.  Just FYI.", 
    "review_date": "2005-11-30"
  }, 
  "KyWWK9Rhb_2Lkq0BeBIE1A": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Abby W.", 
    "review_text": "I love dark, intimate bars with great live music, so naturally, I love The Boom Boom Room. Unfortunately, the older I get, the less tolerance I have for insanely crowded, hot places....I've become a bit of a claustrophobe.   Still, this place is an SF landmark that stands the test of time. I've had some great booty-shakin' nights there! Arrive early to get a table by the door. The fresh air will do you justice.", 
    "review_date": "2007-02-12"
  }, 
  "-zuV9Du1HFHaQ6GnVyGWsQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Katharine A.", 
    "review_text": "I am not sure why people are such fans of this place.  Yes, the place does serve up some good music, but the other flaws don't make up for it.   First, I hate cover charges.  The $15 cover charge for a no-name band late at night was not worth it.   The bar is a dive and although I love dives, I was not impressed with this one.  It feels dirty.  The bathrooms are shoved in the back with the cleaning supplies and one of the stalls did not have a lock.", 
    "review_date": "2008-08-04"
  }, 
  "9rV7510hkaNeQrkRMbFvTg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cristina C.", 
    "review_text": "I came here for the first time during the #JazZFestival. Incredible line-up, great crowd. Awesome party for someone who puts events together! Yup! Can't wait To go back again!!!", 
    "review_date": "2014-09-15"
  }, 
  "EBCx-v9I16v6fJnrQ_ze1Q": {
    "user_rating": 4.0, 
    "user_location": "Winnipeg, Canada", 
    "user_name": "dewey d.", 
    "review_text": "Saw Colossus last night (tuesday) and was my first time there.\n Sound was good but the mics sucked...couldnt hear a word.\n  Very nice place....nice lighting, good size, friendly bartenders, and most importantly, good music.  I will definately be back for more live acts!", 
    "review_date": "2005-10-12"
  }, 
  "7db6kIADaDWSnQ9lCNRitg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trevor D.", 
    "review_text": "If you can handle the cover ($10-$20) check this place out when \"Brown Baggin' It\" are performing. People here like to get down.", 
    "review_date": "2005-04-25"
  }, 
  "iHwqxEYgwk6G3aMwGsaQGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James B.", 
    "review_text": "Always wanted to go here and finally made it!  Went on a Sunday night and danced my face off. The place was pretty empty but the live blues music was fantastic and the drinks were strong. No cover! Great large old school place for seeing a show. I'll definitely be checking the schedule and going back soon!", 
    "review_date": "2012-01-23"
  }, 
  "3R9-ipOHa5Xm6Z8TrlWHRw": {
    "user_rating": 1.0, 
    "user_location": "Wheaton, IL", 
    "user_name": "Kevin K.", 
    "review_text": "Place is shady. After every act, the recollect a cover charge. Better not step outside for a phone call or cigarette because they'll recharge you even if you have a stamp. BEWARE!", 
    "review_date": "2013-11-05"
  }, 
  "dtpkN_WphCWeTThQYYraAQ": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Jon P.", 
    "review_text": "Don't be fooled by my roomate jason's previous posting, this place deserves 5 stars. Whether you're into a laid back jazz session or some good old funky norleans style tunes, you'll be happy here. They often don't charge cover on off nights even though you will still see some goods acts then. get there early if you want a seat, otherwise you'll be spending the night a dancin' yo feet.", 
    "review_date": "2008-02-05"
  }, 
  "UiX4CR188mjByb8GeI8jYQ": {
    "user_rating": 4.0, 
    "user_location": "Montara, CA", 
    "user_name": "Neil A.", 
    "review_text": "I'm not really big on the Jazz &amp; Blues but this is a cool little place in Japan town to grab a reasonably priced drink.  The crowd and bar staff here are pretty cool.   It's a bit on the dive bar side of things relative to other places nearby so if you're the uppity sort you shouldn't even consider this place.", 
    "review_date": "2011-08-25"
  }, 
  "wOg03_bLMKnDiWvPGeLovA": {
    "user_rating": 1.0, 
    "user_location": "Alamo Square, San Francisco, CA", 
    "user_name": "Daria L.", 
    "review_text": "I had the worst experience with the bouncer I have ever had.  I showed up at the end of the night and asked for a discount.  The bouncer said no(he was a blonde guy with stupid big glasses like a dumb hipster).  I smoked a cigarrete with friends and decided I would pay since all my friends were in there even thought the show was almost over.  When I approached him to pay, the bouncer proceeded to tell me that I was a horrible person and to \"fuck off\".  This is the worst experience I have ever had in San Francisco.  The other guys attending the door had no power and shrugged off his actions.  I'm curious if this was the owner or a tight friend of the owner and they just have no respect for people who frequent their venue.  For anyone looking for a fun time in San Francisco, beware of this horrible place.  They will make you feel terrible and ruin your night.", 
    "review_date": "2014-01-25"
  }, 
  "ACUVZ4SiN0gni7dzVDm9EQ": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Tiffany N.", 
    "review_text": "I used to always bemoan the at least $15 cover charge when walking by the Boom Boom Room. Until my mind was blown by the most epic accidental show I've seen. When a band you've never heard of takes the stage and the three members are wearing the following items you are in for a good night:  Lead singer - shirtless with a Robinhood-esque hat that had lightening blots shooting out of it. He played a cello that was strung like a guitar. Bassist - toga. That's all. Drummer - 80s rock attire, hair band style.  It was a rollicking good time.   Pair that with the sweet dim lights, decently priced cocktails, and ample room to sit at the bar or boogie on the floor and you can color me happy.", 
    "review_date": "2011-04-16"
  }, 
  "km2eR66jxH38sp3esKowGQ": {
    "user_rating": 5.0, 
    "user_location": "Ulm, Germany", 
    "user_name": "Felix S.", 
    "review_text": "We were there on a sunday evening after I had read about this place on the internet before. It was a great experience with a super atmosphere, great people and great music. This place is a small room with seating around the edge. At the beginning DJ Kevvy Kev played a smooth mix and then the Gemstone Band started a great performance including drums, guitar, bass and keys. Several MC's came on stage and most of them dropped amazing performances. The drinks were good and not expensive. After a short while, most people came in front of the stage following the live performances of the artists. I definitely want to come back to Boom Boom Room, when I will be in SF for the next time.", 
    "review_date": "2014-12-23"
  }, 
  "R-i4F_rOYAMipGlvlP7A-Q": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "Aivy C.", 
    "review_text": "I actually went here a couple of weeks ago to watch the Greasetraps play - it's a nice, intimate venue for live music, diverse crowd, and judging by how wildly a lot of people around me were dancing, I'm gonna guess the drinks were nice and strong that particular night, too ;)  I'd love to come here again post-baby and get tanked while doing really bad drunken dancing with the usual folks.", 
    "review_date": "2007-11-18"
  }, 
  "XP32BMm5JmcogLMTf-JUGg": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Helen V.", 
    "review_text": "Good music. Cover was $20 though so a bit pricey. I didn't pay for drink so I can't tell you if it was worth paying cover. The lighting is soo dim I started getting sleepy there. I need to go on a non-exhausting day.", 
    "review_date": "2010-03-02"
  }, 
  "UZ6YOaTiZ1lTZWKASIkVuA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michie L.", 
    "review_text": "This intimate club is just the place to bring your out of town guests for some great live music on a chilly and wet Sunday night. Here's why:  - Ambiance= dimly lit, cozy and a billowing red curtain onstage  - Pretension= totally lacking - Crowd= mixed and interesting - Staff= friendly and laid-back - Boom factor= awesome (especially if you're there for the Pimps of Joytime)  Plus you won't hear lyrics like \"I lick ya boom boom down\" or \"boom boom mami mami\" even if that's what you think of whenever you hear the name Boom Boom Room. Oh, is that just me?  Minus one star for not accepting credit cards.", 
    "review_date": "2006-12-12"
  }, 
  "SERp7ZPIpmSrs9F3foQuPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will M.", 
    "review_text": "Always great music and vibe. If you're into funk and soul music, this is your place. Great hang with awesome music bookings and affordable drinks.   Two suggestions:  1) keep track of your valuables (bit of crime in area- esp car break ins). 2) come for the music but stay for the people and scene -- I've made so many new friends there.", 
    "review_date": "2014-08-30"
  }, 
  "ml3vS1NZTMeXTuxamvAZgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M S.", 
    "review_text": "This is a solid joint.  They always have some interesting music acts coming through, so its just a matter of finding the group that hits your spot best.  The last time I was here a good buddy from Chi-town was in.  He and I used to frequent the Green Mill, which is every bit as legendary.  For Green Mill info see: <a href=\"http://www.yelp.com/biz/t3pYu8eidmb2ZmexHRHT_Q\">yelp.com/biz/t3pYu8eidmb…</a>  I find that the Boom Boom Room works best for me when I'm with people that can appreciate the sound or if I'm looking for a more intimate evening without all the loud chaos of a typical bar.  Boom Boom has a definite urban/swank city feel to it.  Its a small joint, but a quality option for the more sophisticated city aficionado.", 
    "review_date": "2007-03-13"
  }, 
  "C5Pf0I0YZEEw2cG8yTcH4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "amanda g.", 
    "review_text": "Great spot - great crowd - great line-up and the staff seem to manage getting your drink orders to you in record time despite the crush.", 
    "review_date": "2005-05-31"
  }, 
  "m4LS4mkSIX9LTaMPst4UBg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Christopher R.", 
    "review_text": "No, not the boom, boom, let's go back to my room kind of bar.  It is just one great small intimate bar with some great live music that you can dance to. And the price of the drinks are not that bad. Plus it is close to Japantown, so more likely this place is going to be one of those bars I would go back to. Parking can be a little tricky though since you have to park on the street, and as everyone knows parking in San Francisco is like finding a needle in the haystack or could cost you an arm and a leg, but if you are willing to be patient and wait for someone to leave their parking space (if ever, early on a weekend), then it is worth it.", 
    "review_date": "2011-03-15"
  }, 
  "JW6IZYE9_IswFT3booJA5A": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dena L.", 
    "review_text": "Great place for Jazz/Blues - 5th star is missing due to seating (or lack of).", 
    "review_date": "2009-02-08"
  }, 
  "io7NI06ByR7JthVlS29YPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes P.", 
    "review_text": "Why the Boom Boom room rocks.  First off i am forced to venture to many straight bars since i am the token gay in my circle of friends. Years of going to the marina and broadway have made me jaded toward the straght trendy club scene. So when we came here it was all good.  Its close to the filmore and a great place to put down some drinks before a live show. Its cheaper to drink here than at the filmore, which is only a block away. I've only been here twice. Each time I've stayed for a little under 2 hours and had a blast. The crowd seemed pretty laid back and not up tight. Another bonus is that one of my best friends lives about two blocks away.  This is a fun place to hang out with your friends and chat it up while listening to a variety of often live music.", 
    "review_date": "2009-01-21"
  }, 
  "WKu8N3wK9k1sRfXCA3SZ8Q": {
    "user_rating": 4.0, 
    "user_location": "Nice, France", 
    "user_name": "Stuart J.", 
    "review_text": "Great interior, nice staff, some fabulous funky bands, and a good sound system. The cover charge seems to have gone up recently, but still not bad value. One of the high spots of Fillmore St.", 
    "review_date": "2005-06-29"
  }, 
  "oCjsMCIGd2VJJk0BzgipCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimmy F.", 
    "review_text": "The music here is consistently good. I saw Kirk Joseph &amp; Backyard Groove last night. Rockin'.  I love me some sousaphone. The sousaphone was named for its inventor, John Philip Sousa, who adapted the helicon to project warm rich tones over the top of the band.  Kudos to JPS, as those warm rich tones did carry and forthwith imbued me with 'the funk'.  Here are some anagrams of 'sousaphone':  A no-use shop. Push a noose. Anuses pooh.", 
    "review_date": "2007-08-05"
  }, 
  "4v9NX1EzLUH7inkmgHwUxA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe S.", 
    "review_text": "Okay, so I was only here once and that one time only entailed 2 cans of PBR, a discussion comparing the set-up of the Lusty Lady to Foucault's theorization of the panopticon, and a healthy game of \"avoid the loser dudes trying to make eye contact\" with us. \"Us\" being Amanda and I and \"loser dudes\" being, well, every other fucking patron there. From reading the other yelp reviews of this place, I can see that it generally receives positive responses, so again, lemme reiterate that I was only here once and for maybe 30 minutes, tops. Why was I even at, um, the Boom Boom Room? Simply because Julie had our tickets for a show at the Fillmore and, in pure Julie-style, sent a last minute text asserting her 1/2 hour delay. Of course that night was, like, 40 degrees and windy as fuck, so Amanda and I were left with no other recourse besides spending some time in the Boom Boom Room. With that said, we brought some serious fortune with us and only caught the end of that evening's band's sound check, and holy christ, it appeared as though they all met at the cooler in the IT department of whatever horrible job y'all work and decided to form a really fresh jazz-rock band. Fronted by NERDS!!!!! Yeah, as though jazz-rock bands are fronted by anyone else. Anyway, said band also brought their fellow nerdy IT cohorts and a few chachbags to boot (no pun intended), so Amanda and I were definitely given numerous \"hook up\" opportunities.   However, the Boom Boom Room did manage to keep us warm and serve us cans of PBR.  Plus, when Enrico and Julie FINALLY showed up, Enrico bought us shots of Jameson, making the IT nerds begin to look pret-ty fetching.", 
    "review_date": "2006-10-03"
  }, 
  "i67PU7LKRSS7oZM4WQAmQg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vernon M.", 
    "review_text": "This is a small dive bar with good music, drinks, and a nice crowd of people.  With a good buzz you'd forget about how smail the place is.  I've been to the Boom Boom Room 3 times and I may have been lucky to see some very good live performers.  What I really like about the place is it brings in good people who love music and look to have a nice time.", 
    "review_date": "2008-09-28"
  }, 
  "rs9EzfqI_yWqULOlW7rZpg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Holly L.", 
    "review_text": "I love this bar and have been going sporadically since it opened. However my last experience there was ruined by the doormen who were completely unfriendly and came searching for me to charge me the $12 cover that began at 9 or so.  I'd already been there 2 hours spending money and not planning to leave anytime soon.  One guy barely let me in to retrieve my stuff and tell my friends.  I don't know about a place that charges after someone's already been there a while.  Most clubs have a free before a certain hour, no?  He was such an ass to me that I have little interest in returning, though I generally love the place and probably will.", 
    "review_date": "2009-01-03"
  }, 
  "ZbOK_2m4kifew3lzTep1yQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Jaime L.", 
    "review_text": "Despite the fact that its name implies you'd be getting some action, the only action I got here was the crazy ingestion of booze to withstand the beatings from the mosh pit at the Ministry concert.  It was relatively quiet here, nice way to start the evening--you grab a few beers, sit down and start talking. About ANYTHING. After a few bottles no one is really going to remember anyways, right?   The space was small, but had a hip feel to it. Definitely a space I could get my groupie on in if I was the type of person to put out...and if there was a band.  Do bands play here? Or am I out of my fucking mind??  Because I distinctly remember a band being here.  ...  /end review until I go back and prove it.  Oh yeah but the bathrooms were a little gnarley. How I remember THAT is beyond me.", 
    "review_date": "2008-05-21"
  }, 
  "I8M4bz0BLS97_UVcRjGNlQ": {
    "user_rating": 5.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Mehdi K.", 
    "review_text": "Visiting from Boston. Looked up live music and landed here, great bands and fantastic atmosphere. Good luck to the venue and talented artists that come through those doors! I will be back...", 
    "review_date": "2014-02-27"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kim N.", 
    "review_text": "For a long while I had no idea that John Lee Hooker lived not too far from me when he died. Little did know back then that he also owned the Boom Boom Room. Many years have passed and I've only gone recently. I've been watching a band called Vinyl out of Mill Valley that crank out out some awesome Funk/Latin/Reggae/Blues for a long while now. I knew they played here every once in a while and finally decided to take a stab at seeing them.   The place is way smaller than I imagined. It is essentially a bar that happens to have a stage at the end. The crowd is crazy weird. Marina types, Burning Man types, hipsters, preppies, and old folks. It's all over the map. When the band came on it was standing room only and it was getting to be a pain to actually try and see the band. Luckily one of the booths opened up and when we sat at the angle we did, we could kind of see them. They played well on till 2.45am and it was kind of cool to see them in such a small space. Just a bit claustro if you know what I mean. Anways, the staff seem to work hard and if you can get past the sardine like packed crazy crowd it's not a bad place to see a band. 3.5 stars.", 
    "review_date": "2010-11-09"
  }, 
  "m9vkagc4KEn5X47J9WGOBw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "mokirobinson m.", 
    "review_text": "So this place is mostly cool but not all-the-way live like it should be.  It is the \"meeting your friend of the opposite sex's good friend\" of music venues.  You're glad you met the good friend and yet you know you can never really make out with them.  I mean, you can (and, let's be real - you're gonna) but it will be an \"issue\" that no one will really talk about until, like, one night when you drunkenly step on OSF's foot and they yell, \"fucking whore\" at you.  Well, it's more the beginning of the story feeling (OSGF is great- just like OSF - only hot and potentially ravagable!) rather than the downhill \"effing w\" statement.  Is any of this resonating?  \n  To recap:\n Good venue sound-wise\n Pretty tight, professional-level bands\n Sometimes pretty dorky-in-the-unsexy-way clientele\n Steep cover\n Uncharmable door guys\n Stiff, reasonably priced drinks\n 90% humidity", 
    "review_date": "2006-02-28"
  }, 
  "D0y6NhDuSaOSZBLoEOJxag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophia C.", 
    "review_text": "Why did it take me all my life to finally come here? Such a cozy fun venue to listen to some amazing music. JNG on Sunday night rocked my boat , socks and whole lot of other body parts that I'll leave to your imagination. Surprisingly romantic place to cuddle up to your honey if you so pleased.", 
    "review_date": "2009-12-23"
  }, 
  "E-Sgmcl3VfDAVG-04e5ldw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Tameka H.", 
    "review_text": "Immediately the name makes you think of the movie LIFE with Martin Lawrence &amp; Eddie Murphy were Eddie talks about a club he wants to own in NY called Rays Boom Boom Room but I digress.  So came here this past Fri nite after catching Aisha Tyler at a comedy club. I'm from LA so I was trying to use the entire night to the fullest.   When I arrived it was only an hour left before the club closed (still charged $10). They were giving me shyt about my I.D. because I lost mine and I had that big azz 5x7 paper the dmv gives you till it arrives in the mail. They were acting like they were doing me a favor by letting me in. IT'S FROM THE DMV SMART DUMMIES!  So after the shenanigans once I got thru the door I felt like it was my welcome song to the Bay area because they had a DOPE azz band there named Los Hentes &amp; they were performing \"I got 5 on it\" . That band is SUPER talented they went from rap to reggae to latin music. So if this band is performing here... GO!", 
    "review_date": "2014-06-08"
  }, 
  "z8zzFMKCnavBY5_-_vzi9w": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Tom M.", 
    "review_text": "i'm gonna be short on this one b/c there really ain't a lot to say to back up my five.  Alex the owner and primary booker of music over the years is a wonderful guy and an asset to the community in music booking he has brought in New Orleans folks like Morning 40 Federation, Papa Grows Funk, first ever SF Porter Batiste Stoltz shows and on and on.  Super cool interior (wow I love the overhead lighting in this place, truly cool lounge lighting), reasonable drink prices, crowded at times (go hang in the far corner in front of the old John Lee Hooker round vip booth or over by the entrance to onstage near the Hammond, you can usually do better than in front of the stage) ...right across from The Fillmore so terrific for post or pre show hang.   Often has ability to stay open past 2 w/ no drinks so a cool joint for after 2 am getting yer groove on (and often special guests from that night's Fillmore groovedowns).   anyway, I guess that is it.   Alex, thanks for all of the good times over the last X number of years!  Servers bartenders and door folk are always very cool from my experience.", 
    "review_date": "2007-09-05"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "Many years ago, this used to be a dive called Jacks Bar. Then John Lee Hooker retired and bought it and turned it into his dream bar. JLH has since passed on, but walking into the boom boom room is sort of like stepping into his world.  Think red leather and vinyl, dark colored lights, antique fixtures. It's a good place to watch a band; intimate but still big enough for a decent sized crowd, and the bartenders are friendly (Hi Dana! Thanks for taking care of my sister on her big night!)  They have decent happy hours specials, and I was checking out the barstools and I think with some time and effort I could break one in enough that it would fit my ass perfectly and I could sit there every afternoon until I'm seventy and almost blind and wearing a suit and hat every day and telling wistful semi coherent stories about my youth to anyone who will listen. That's what God wants for me, I think.", 
    "review_date": "2007-12-01"
  }, 
  "QYUdOyXau5rfGFdyGF5f0g": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Qui K.", 
    "review_text": "yes!!!! a place that actually plays good local blues and jazz! the cover is always decent, the drinks are whatevs, but its all about the jams here. monophonics are the bombdizzle and just about any other band they put on their lineup. i couldn't dare step foot in those clubs with all that pop mess playing .....give me live music! this place got it goin' on! and what a location! there is a variety of restaurants to choose from to go before you catch a show and after. enjoy!", 
    "review_date": "2012-10-16"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "Very intimate venue for music.  The music was great the crowd was mixed for a Wednesday before Thanksgiving day.  The bouncers were nice, but one of the bartenders.. yeah not so much.  I order a drink and it didn't taste good and she made me buy another one resulting in 3 stars.  BAM!  I'd go again.  Japan town is right next door and worth a visit.", 
    "review_date": "2007-11-27"
  }, 
  "J7ka23aCUNK-v_yLB4AL1Q": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Justin C.", 
    "review_text": "Nothing beats grabbing some drinks at the Boom Boom Room before a show at the Fillmore. Dark, velvety, bass-y music, perfect. Get comfy and slam back a few cocktails while grooving to some good music. Cash only.", 
    "review_date": "2012-04-12"
  }, 
  "KKdBQXnUlVUZ0ZNTfMQoEA": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Tolga E.", 
    "review_text": "The Boom Boom Room is really chill place for cool cats...I think. I went here by myself on a Saturday night. yeehaw. So you can imagine, I was looking for a little inspiration out there in the \"I'm not in pac heights but I feel I am but  I'm in Japantown because I am\" part of San Francisco. The Boom Boom Room's stiff cover ($15) was not a good start.  But once inside, everything got a lot better. The music, both acts were some sort of latin-infused, semi-reggae, indie rock ensembles. One of the bands had an unbelievably cute girl playing saxophone. In any case, the bartenders smiled and didnt have the typical \"I'm way too stressed out for this job\" frown on their faces. The drinks were reasonably prices and they had a decent selection of solid beers. The people, though a bit older (something like 26-40 yrs old), were actually pretty awesome. It's hard to run across a place with such a high cover where the people are actually worth a crap and this seems (at first visit) to be on those places.  So, Boom Boom Room, I will be back. I like your vibe, your intimate settins, and your people. So drop the cover 5 bucks and continue being kinda awesome.", 
    "review_date": "2007-10-11"
  }, 
  "AT6NwNkLKxgW2fsQGNs-gA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregor G.", 
    "review_text": "Yeah, it's a narrow venue that can feel a bit claustrophobic, but that long-ass bar increases your chances to get some attention from one of the 'tenders. If you're discouraged by the steep cover or not into the group playing on a particular night, it's still a cool place to go for happy hour or early in the evening before you go elsewhere.", 
    "review_date": "2007-06-23"
  }, 
  "02RFzdPmsH2dnl7Gdo8aLg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alice C.", 
    "review_text": "You like funk? You like jazzy funk? You like live jazzy funk? You like good live jazzy funk? You like a dance floor for jazzy funk dancing? You like dim lights and jazzy funk? You like alcohol and jazzy funk?  What are you waiting for?   Go to the famous BOOM BOOM ROOM. Definitely a poppin' spot for the grown and sexy.  <a href=\"/redir?url=http%3A%2F%2Fwww.boomboomblues.com&amp;s=a0b7e2d002cbea8750bde56b95ad2dcc75d4e3d8db73cd869f7a81337d1d9ab7\" rel=\"nofollow\" target=\"_blank\">boomboomblues.com</a>", 
    "review_date": "2006-11-26"
  }, 
  "GaDcMPw8aH-pvsKfltH4pw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Aaron H.", 
    "review_text": "In my more than 20 years performing in some rank dive bars and hole in the wall joints where you're often worried that your car will be on fire when you finally pack up and leave, I'm happy to report that the Boom Boom Room is a great place to play. The sound system is good, complete with a Hammond and authentic Leslie speaker on stage! The engineer was super nice and responsive - the house sound was spot on!  As much fun as we had playing, the audience was having an even better time. A nice dance floor, quick bar staff, friendly door staff!   This is now my favorite place to see small live shows and I hope to play there again soon!  -Aaron of West Grand Blvd.", 
    "review_date": "2013-02-06"
  }, 
  "9NrrS89GYV4F1D8JnY_SDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete C.", 
    "review_text": "Cool little bar across the street from the fillmore. It's dark, it's smokey and the musical acts I've seen here have been, well, dark and smokey. A cool place to chill out with a nice and easy vibe. Funk, jazz, blues, hip hop.", 
    "review_date": "2006-06-30"
  }, 
  "pRDdcScJUj6lA60rFUH1VA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandre J.", 
    "review_text": "The mothership landed yesterday evening at the Boom Boom Room when Katdelic completely rocked the place and it was awesome.  The venue itself is intimate, not that expensive, the crowd chill and the bartenders super nice. A bit rough and divey on the edges but that's the way such a place should be. Suggestion for the owners: DO A FUNK JAM SESSION! I will definitely go there again very soon.", 
    "review_date": "2014-06-28"
  }, 
  "YII6qimAQ9RD_NByf80ZYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "Ah...I liked this place!  As a new comer to SF in search of free live music.  I ended up at the Boom Boom Room late in the evening last Thursday.  Low lights and candles in red holders flickered away on tables as we saw an excellent band, The George Lacson Project, for free.  I had never heard of them before that night, and they proved to be extremely entertaining...and they were getting ready to play another set when we left after midnight!  I love that other Yelp reviewers found their new favorite band at this place too!  A small but friendly crowd danced and mingled.  For more info about my experience at this place and about other free live music options, check out my article, \"Free (or super cheap) Live Music Every Night of the Week in San Francisco at <a href=\"/redir?url=http%3A%2F%2Fquestforzest.org%2Fwp%2Fzesty-blog%2F&amp;s=d82bbb8e612ffe028e334941fd5bef5a22248d16f4f478ed4a2f876b8214bcc7\" rel=\"nofollow\" target=\"_blank\">questforzest.org/wp/zest…</a>.  Happy live music hunting!", 
    "review_date": "2012-01-17"
  }, 
  "RZUGrWB5EiNwaXHi6ZH7fw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Tony C.", 
    "review_text": "Always been a fan of the boom boom room, always been a fan of saying boom boom! Lights are always low, good music is always playing even if it's just the jukebox going and it's the perfect place to end up after catching a show at the Fillmore.   Last night was kind of a bummer, there was supposed to be a live band but they didn't end up showing and there were a few weird guys looming inside and out that 9 times out of 10 would have been asked to leave. Especially the guy wearing a sweatshirt 18 sizes too big asking everyone what their name was, and I think he only had one drink?   Otherwise, it's a great bar in an otherwise barless few block location.", 
    "review_date": "2009-03-30"
  }, 
  "l-1g7hDc1bS1xjtyxY79hw": {
    "user_rating": 4.0, 
    "user_location": "Waltham, MA", 
    "user_name": "David S.", 
    "review_text": "I met a friend here fairly early in the night, in time for their awesome Happy Hour and before the cover vultures started to descend. The Happy Hour is fantastic... I think it goes for three hours, they charge the same low price for all their drafts (except the frat boy beer which is even cheaper), which includes two offerings from Rogue Ales, and a good selection of domestic micros and European imports across the board. The bartender was fun... she had a huge neon fro wig on, and was slinging drinks like a boss.  Definitely a good vibe in the place. The music is fresh... it's a 70's booty-shaking soulfest.  If you haven't heard James Brown since you came in, you're either still on your first beer or waiting for it.  They do live music later in the nights, but that comes with a cover.  The band we saw warming up was meh, but I declined the request to pay the cover and bounced before they got into full swing.  If I had planned to be there for the duration I'm sure I would have seen some folks hit the dance floor.  Funky fresh... thumbs up!", 
    "review_date": "2013-08-25"
  }, 
  "d1VXeXMq67_QgdvWY1tcKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark A.", 
    "review_text": "Some people prefer to thing of the boom boom room as a bar that has live music that charges expensive covers.  I prefer to think of it as an intimate music venue with a bar that has really cheap tickets for their shows.  They really have an uncanny way of almost always booking great talent, some local, some national, and quite often, the opening band is even better than the headliner.  There aren't many music clubs in the city where I'll just go drop money on some band I've never heard of and know that it will be money well-spent.  Sure, the shows always start late, but they go until 2 or 3 in the morning. Solid beer selection, too.  Also, being across the street from the Fillmore, you never know just who might drop by after playing a show at the Fillmore.   Not the greatest area to walk around, but I don't think that should have any effect on my review.  And don't go in the booth at the front of the stage.  update: everything in my previous review still stands, but wanted to point out that this might be the only regular afterhours live music place in SF. when most places shutdown at 2, there's still quite a lot of clubs you can go to (ruby skye, endup, 1015, mighty, public works, dna, etc.), but this is the only live music venue", 
    "review_date": "2009-02-03"
  }, 
  "79u3Z2ySFFWOBK0x3H348w": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Chris S.", 
    "review_text": "I've been here a few times. I don't even look to see whose playing there anymore, I just go--I've never been disappointed. Outstanding funk &amp; blues. Cover charge is worth every penny. Go later in the evening (~10:30pm) and go for the music. Not a good place to go to catch up with your out-of-town buddy over a few beers, go too early and the place is uncomfortably chill.", 
    "review_date": "2006-11-29"
  }, 
  "gA_WtyzkuZp55dDbQLg-Ww": {
    "user_rating": 1.0, 
    "user_location": "Encinitas, CA", 
    "user_name": "Allison C.", 
    "review_text": "oh yeah - and i forgot to mention that they got my bank information under the pretense that it was necessary to replace the money in my account (yes i know i'm a moron) and so i've had to cancel my card and get a new one.    i just really can't think of anything bad enough to say about these assholes.", 
    "review_date": "2010-04-21"
  }, 
  "1zMqzFE_X1Bf29Lp2RXF2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liv A.", 
    "review_text": "Why is it that MOST of the bad reviews for the Boom Boom Room are coming from young, college aged girls that haven't even experienced life yet. Stay home if you don't like the bathrooms. It's a club not the Ritz!", 
    "review_date": "2013-06-26"
  }, 
  "hFuYtKcJKVLXLURJLx6DoQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina A.", 
    "review_text": "Went to see the Trombone Shorties from New Orleans and they are so energitic and fun!!! I loved them not just because they are all of 21 years old and talented and cute.....but because they are real down to earth people and not pretencious rock stars.   We invited them to come over for Jambalaya and drinks and music and they announced to the entire crowd at the end of the 2nd set that the official after party was at 3014 Steiner (my friends apartment)!  WHAT!?!?!  Thats right !! Random people, boom boom door men etc.. all showed up and we had a blast with the Trombone Shorties, singing, drinking wine and singing...till the weee hours of the morning!   It was a surreal nite! Making friends with a band members that toured with Lenny Gravitz for two years.  Now, we have special invitations to Jazz Fest!   Boom Boom Room - made a BIG BANG in my musical heart!   You guys ROCK!", 
    "review_date": "2008-02-03"
  }, 
  "25X-uRdgoLe0K5ArrnNrhg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bai Z.", 
    "review_text": "BOOM BOOM BOOM is a pretty chill lounge with no cover, I went a few times during happy hours.  The place wasn't overly crowded when I went.  It is located conveniently off the corner of FIlmore/Geary.  The first time I went there I almost missed it because it doesn't really stand out when you first walk by it.", 
    "review_date": "2008-01-29"
  }, 
  "0aZBtOfadnwk146wcH-cmw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Monica P.", 
    "review_text": "all i could think about was Eddie Murphy in LIFE.  Opening up the Boom Boom Room and the waiters, and gambling, and live music.  There are no waiters no gambling but there is Plenty of awesome live music.   Most definitely a great place to listen to some good Funk/jazz!    Be sure to get your tickets in advace so you can waltz right in!", 
    "review_date": "2009-06-17"
  }, 
  "CPdkpOswYgtdxMPUbZ0T9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marco M.", 
    "review_text": "Only went for a random, mid-afternoon Happy Hour drink on this past Saturday, and wound up hunkered own there shooting the breeze with some patrons and my date, as well as the bartendress, Sasha. The drinks were strong and cheap, the vibe was...well...kinda dead, but at 3 or 4 on a Saturday, that's ok, and I kind of like my bars semi empty for ease of grabbing boozey bevvies anyway. I'd love to go back and hear some live music though just to see what the venue is like in that mode. If in the Fillmore/J-Town area on a weekend afternoon - I highly suggest checking it out. The happy hour was pretty long too if memory serves me correctly...", 
    "review_date": "2011-07-18"
  }, 
  "FbhKqAAHQBnl_pVKTVPuHA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ross H.", 
    "review_text": "I love going to shows at the Fillmore- so I end up coming here for post-fillmore to end the night.  It's usually a lot of fun, but its not that great of a venue. Ends up being really expensive to go there with the $15 cover charge that I pay every-single-time-i-go-there.  It's pretty nice inside and pleasant when there is a low-key show. The staff inside has always been pretty quick with the drinks and as friendly as you can be when it's slammed and everyone is wasted.  The guys at the door are dressed in suits, and the dozen or so times I've been here they've always been douche bags with a serious attitude. Since I don't want to get kicked out I haven't told them that yet.", 
    "review_date": "2010-10-16"
  }, 
  "tGgTIueZy1JNTzQD9rkZLQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "01.26.10  I'm torn.    I like the layout of the place.   I like live music. I don't like cover charges.  Especially on a Tuesday night. I don't like expensive beer.  I'm torn.", 
    "review_date": "2010-02-09"
  }, 
  "UDFCWnHOvkENxbKGlEsLyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie H.", 
    "review_text": "so i'm on crutches.  for a long time.  and it sucks.  if i had my way, i would sit at home all day and night and not go out.  but the old man wouldn't hear of it.  so we go out.  all the time.  and on crutches...it sucks.  we were planning to go see will bernard and friends and celebrate a homegirls birthday at the boom boom room.  i made the plan that if i couldn't get a seat, i would leave.  cause there is no way i can stand through a show, (especially at the boom boom room where they let them play all night) on crutches.  we got there early but all the seats were taken.  an employee came right up to me and said follow me and brought me to the reserved booth- reserved for john lee hooker (and alex- the owner).  after hanging for awhile, alex came over to see who i was and after hearing the medical sob story behind my crutches, let me sit with him and his friends.  he was awesome.  he made me feel so welcome and helped me forget about my woes for a night.    i have been to the boom boom room a few times now- always to see will bernard- and it has always been a great experience.  they don't have the cheapest or strongest drinks- but the bud light is cold and the bartenders are friendly.    i never met john lee hooker- but after a night of sitting in his seat i feel a close connection to him.  and to alex, the owner...my new friend!", 
    "review_date": "2010-07-16"
  }, 
  "RdtD_EaJolktp6qgHjx24g": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ronjini M.", 
    "review_text": "This place is cool, wasn't very happenin this Thursday night, but the music was good. We heard public property, which had quite a sublime vibe and since i'm from So. Cal I loved it.  Wasn't much of  a crowd though.  I was not drinking either, so I don't have any comments on the beverage menu....I'll try to be comprehensive next time, would definitely go back if I want to go back and have NOTHING else to do, laid back atmosphere.", 
    "review_date": "2008-03-07"
  }, 
  "uj3KfOQgFPHZM_C7vdgMNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diego S.", 
    "review_text": "This place always has jamming music and some ecletic  funk acts. Nice chicago-style blues club feel which is hard to find in the city. It's definitely a classic stop that is a must in this city. Another bonerific perk was the hot cocktail waitress with the piercings. I went back in December and can't really remember the show because I kept watching her handle the room with a sweet smile, even the gross skeezy older drunk dudes. I haven't seen her lately but she was totally smoking with her exotic appeal and funky fresh clothes, Rockin those Docs! No drink specials which was kinda disappointing, but I came from Alembic which has rockin bourbon drinks. But its a legendary spot that all John Lee Hooker fans shud see", 
    "review_date": "2008-03-19"
  }, 
  "rDTr5r0xEMpQpkPphe66KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick A.", 
    "review_text": "John Lee Hooker.  Boom Boom Boom Boom.  Mean licks.", 
    "review_date": "2006-09-04"
  }, 
  "Ct456aEICzDfn03MHZCzsw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miriam b.", 
    "review_text": "Miri D. got it pretty close. Some nights (Fri/Sat) filled with either too many penninsulan programming geeks thinkin this is the place to act pseudo cool and do a hook up, whilst one of their buddy stares at my breasts for 30 minutes straight. What a weird vibe. Some nights totally fun. Door nuts (or do they think they \"bounce\")  think they are serious with the pseudo zoot dragging coat hiding their beer belly and covering their comb over wid da Fedora----well maybe just balding pate.  Ohhhh what we put up with for good music....", 
    "review_date": "2006-04-05"
  }, 
  "SO7LPNjOUus6ML0AJCuVMA": {
    "user_rating": 2.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Ron B.", 
    "review_text": "You pay $8+ for a drink and it is watered down.  I have been there many time and each time it is the same.  It is on me to keep buying drinks I know are watered down and let this place keep ripping me off this way,  I should have stopped going there a long time ago or at least switched to beer which would foil their blatant practice.   I am no longer, at this time, into the narrow focus of bands they book so I no longer need to tolerate the indignity of buying bogus drinks.", 
    "review_date": "2010-10-16"
  }, 
  "gJNvlVyYNnyQW-941nu7sA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kathryn h.", 
    "review_text": "Bad vibes right from the door staff that greets you like you stole something. Got there for a show that was suppossed to start at 9:45 and didn't until after 1100. Watered done overpriced cocktails and a surly bartending staff that acted like they were doing you a big favor. Haven't been here in a couple of years, it sure isn't the same as when the \"ole' man\" was alive==bar stools all ripped up,chairs stacked up in one of the ladies (2) cubicles and filthy to boot. The Marina Brats who have invaded this once cool space may think they are hip to be slummin' but this place is just downright nasty now. The entertainment which never disappointed in the past sucked so bad I couldn't stay for the FIRST set--Victor Jones and Cuturevirsity are way past their expiration date", 
    "review_date": "2009-11-16"
  }, 
  "dim5Svrt-B1jvvQsOIX22A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Z.", 
    "review_text": "Another 5 star experience on Fillmore Street.    The people here will probably remember me as the crazy white girl who was running around asking everyone if they were going to the Willie Nelson concert.  The idiots at the Chronicle advertised that his first performance was April 12th, and I spent an hour taking shots here and running back  to the Fillmore entrance to see if a show was taking place.  Turns out the show didn't take place until the 16th.  However the server was very nice and patient with me.  Our concert gang came here after the Willie show, and they had a hot band playing with good energy.  Too bad I was here on a Sunday night as I already entered the Badlands of Bad Hangover and couldn't party as much as I wanted to.  And I like any room with a red padded door so I'll definitely be back.", 
    "review_date": "2007-04-16"
  }, 
  "c9YEPEZZ5r0g9PrQr17GBg": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "W W.", 
    "review_text": "Have been meaning to write a review since we were there a few months ago. What a great little place for music. Friendly and intimate. A nice dance floor. Good drink pricing (even on the weekend). We had a blast. Danced until they closed.   4 stars as it's a bit in need of some remodeling.   Parking not bad- street mostly. Neighborhood is a little sketchy at 2 AM but fine for city types.", 
    "review_date": "2011-01-15"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "Boom Boom Rooooom!!   Just saying Boom Boom Room makes me feel happy. It's a cool venue, small so you don't feel like you're lost among the crowd, but big enough that you don't have to stand with a group you're trying to avoid. Drinks are standard with standard prices, the bouncer and bartenders are nice.  I went a couple years back with a guy I was crushing on, and sadly made a fool of myself by making out on the dance floor. I mean, who cares, right? It's only now, seeing other youngsters do the same thing that makes me look back on those days and shake my head in disbelief that I could be so silly.   I went to a show for my friend's band Solwave on Thursday and it was super fun. Hibbity Dibbity also played and they were cool too. I accidentally left my debit card there and my friends told me to just forget about it, as I guess some places charge a fee when you leave your card (?? is that a thing?) but when I went to pick it up on Saturday the bartender was super nice and sifted through the mass amount of other forgotten cards, happily handed it to me, and informed it was closed out, with a wink and a smile.   I'm sure I'll be back soon, when there's a cool band playing, duh, and hopefully won't leave my card again.", 
    "review_date": "2014-09-02"
  }, 
  "c2TEIJAFBGrK9okSn2HXBQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kaufononga G.", 
    "review_text": "This place earns a 5 star! I went here on Tuesday night. No entry fee and I got to listen to a band called Modern day Moonshine! My new favorite band! Ambiance was not over the top and the ceiling had some interesting design.. Drinks, reasonable prices and stiff! My date had gin and tonic and I enjoyed a glass of wine. I am a big fan of fancy bathrooms, even though the bathroom was not too fancy, it was definitely worth the sexy bathroom shot! This place gets a 5 star for being inexpensive and having great live entertainment! Also, it was a mixed crowd, people of all ages. I would feel at home coming to this place with sweats or heals, never in combination! LOL Going back soon!", 
    "review_date": "2011-10-20"
  }, 
  "QOlY5FYliVVvkgqgtjdP_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim G.", 
    "review_text": "If you're looking for a place to chill around Japantown, you cannot do better than this bar.  Great vibe.  Great live music.  It's the real deal.", 
    "review_date": "2009-01-18"
  }, 
  "edmfYmN3FBuJjc7ERYYgTA": {
    "user_rating": 5.0, 
    "user_location": "Telluride, CO", 
    "user_name": "Jackie H.", 
    "review_text": "Greatest blues bar in the city, hands down. Go here.", 
    "review_date": "2012-07-02"
  }, 
  "7CJBasUIoN6Ioo99dl_kqA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cc c.", 
    "review_text": "$20 to get in to see no name band  I felt sick after 1 beer they must not clean the beer pipes small venue,people seem to push you when going to bathroom  even if you left a large gap,  the ale was pretty bitter and no flavor  when its free in I would go back and drink bottled beer", 
    "review_date": "2014-07-09"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "Well......  Horrible service. The bartender treated me like an idiot and rolled her eyes at me for ordering a Guinness. My bad! I'm SO sorry to waste your time lady.   Besides that the venue was pretty large. We arrived early for a happy hour cocktail and a band was just setting up. We couldn't hear each other if we tried, so my friend and I screamed at each other for about an hour then left. Good times.", 
    "review_date": "2009-01-24"
  }, 
  "nFW2ne4eYhh3PqUM7fxLOQ": {
    "user_rating": 4.0, 
    "user_location": "Northern, CA", 
    "user_name": "Dani D.", 
    "review_text": "Located btw Fillmore and Geary the Boom Boom Room has not disappointed me yet.  Live music Good drinks Decent crowd  All of these  3 things are good and make me happy when I come here.", 
    "review_date": "2007-08-05"
  }, 
  "isFwuvisyu1iCLm3J2wSpg": {
    "user_rating": 3.0, 
    "user_location": "CA, CA", 
    "user_name": "marin m.", 
    "review_text": "john lee hooker is dead ok!!!??!! he's never going to come sit at his fucking table so just take down the stupid sign, quit kicking me and my friends out and open up that beautiful throne of a booth for those of us who are alive to enjoy it. jeez.  i'm giving you three stars though cause this IS a great place to dance and you have poppy jasper on tap.", 
    "review_date": "2007-03-29"
  }, 
  "jN0HkuvDARUjq2Wy-4GR6Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Erika R.", 
    "review_text": "Love the Boom Boom Room. Great bands not a bad cover. Great to people watch. Only downer, owner raised drink prices. I have know times are hard but 20 bucks for two shots of tequilla seems a lot.", 
    "review_date": "2014-04-17"
  }, 
  "9qHmguqVx8OQzmYoz1Lg4Q": {
    "user_rating": 1.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Robyn S.", 
    "review_text": "I was there on Wednesday and the service sucked...I complained to the management but he was of no help...Dick!", 
    "review_date": "2011-05-22"
  }, 
  "euXjoscT73CKD3Ap0If05Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Juan P.", 
    "review_text": "This place is the SHIT.  sick live music and great mix of people..  hippies, clubbers, Fillmore date night crowd, a little bit of everything.  I'm here every chance I can get", 
    "review_date": "2011-07-12"
  }, 
  "zA1O6IIJdoc8QaDnn7oJIA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chris C.", 
    "review_text": "Went on a Saturday night with a great friend.  Opening band was hilarious and set a good mood.  Main act really jamming band but no lyrics just jamming felt like they could be more...  Negatives were the poser doormen and $20 cover -- I mean cmon what is that about? These are not exactly name brand acts and this is not exactly a concert hall -- rather it's some jam band in a stuffy hole-in-the wall bar.  Also the crowd was primarily middle aged men with more facial hair than deodorant and the only hot girl in the whole place was the bartender.  Had a pretty good time anyway mostly due to my company and not the bands or bar.", 
    "review_date": "2010-06-27"
  }, 
  "5mVsxXOzUUiWhdXf2TJtvw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Katherine F.", 
    "review_text": "First time here. Cool place, great history. It's a Wednesday night, so I am reviewing my Wednesday night experience. I wish I had drank before I came, or straight up brought my own booze. I have NEVER encountered such incompetent bar tenders. Sure, they aren't too hard on the eyes, but get a drink order right (maybe turn down the volume so you can hear straight) and charge your customers correctly. Beware of ordering anything with a red bull chaser because their lame excuse for over charging my friend, for the wrong drinks I might add, was they don't know how much red bull they use so they estimate and charge you based on the cans they thought they used.   I'll come back, maybe on a different night, and probably with drink in hand... Or in stomach.", 
    "review_date": "2013-05-21"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Great space for a fun night!  My friend from college was visiting from Austin and we meandered over to the boom boom room after drinks at Harry's Bar.  The $15 cover was EXPENSIVE, but Topaz and Mudphonic band that played here last night was awesome!  Funk/blues/jazz type groove.  My friend ended up buying their CD.   My cocktail wasn't super stiff but not watery either.     Minus one star for the guy who was wildly dancing right in front of the singer.  By \"WILD\", I mean, busting out a Richard Simmons aerobics move then switching to the electric slide, doing the wave and just plain having a seizure on the dance floor.  I was waiting for him to do the worm dance but didn't.  SO disappointed!", 
    "review_date": "2009-04-18"
  }, 
  "86vCCRFtHJ5LamNmnCpTGQ": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Kathleen P.", 
    "review_text": "I've been here a bunch of times, and have never been disappointed by the music. They just get the grooviest acts here. This is not a swanky cocktail lounge. This is a bar that showcases great musical acts and serves reasonably priced drinks. I always find it funny that so many people can actually make their way forward to the front of the dance floor. How do they do it? We had a great time dancing in the back!  Anyway, John Lee Hooker would be proud that this place is still rocking. If you like good music, and don't need to shmoozed all night in a private booth or whatever, then you should definitely check out this place.  - 1 star for the low number of bathrooms. I know this is a really small place, but I'm female. Two bathroom stalls aren't enough when the place is hopping!", 
    "review_date": "2008-02-17"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "Yes, I like the Boom Boom Room. My friends and I went on a Sunday night over Memorial Day weekend and was luckily not packed at all, a welcome surprise for a dance club. Lots of good jams. And good times.", 
    "review_date": "2013-05-27"
  }, 
  "14MgvhliOMEjg9Q1uydA6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gina h.", 
    "review_text": "This club is amazing and has some of the best live music in San Francisco.  My favorite band is KATDELIC, it's RonKat Spearman's band and he was the guitar player, vocalist for George Clinton's Parliament Funkadelic for quite some time.  He's HOT and his band plays at the boom boom room once a month.  go to this club and go see this band", 
    "review_date": "2013-05-24"
  }, 
  "TMWgq3KNRDaESXs8ZCrRtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "I really liked this place.  I can't believe I've been living in the city for so long and had never been.  I came here before my kickball game for Happy Hour.  Great deals.  $2 PBR and other beers.  There was a band playing that night and we were there while they were setting up.  Then they moved outside and started playing.  Pretty cool, never seen that before.  The bartender was really nice and accommodating.  I wanna come back when there's actually some jazz playing INSIDE :)", 
    "review_date": "2008-10-10"
  }, 
  "oW2bCSJ5bIHyRnoZvkHwDg": {
    "user_rating": 4.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "Uncle Fishbits Aeneas X.", 
    "review_text": "Members flagged my review, but Yelp elected to leave it alone.  I did not, and changed the disparaging remarks about the owner.  His actions speak for themselves sometimes... and other than that.. a fine, fine club.", 
    "review_date": "2008-09-24"
  }, 
  "7eo2hL7aKzJoLaWs8B2j_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica H.", 
    "review_text": "JUST DANCE!  That's all I gotta say - JUST DANCE!", 
    "review_date": "2011-03-02"
  }, 
  "CSeWID1TbPxeFwaLRATjfA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie B.", 
    "review_text": "Holy awesome!  Thank god a place like this exists.  It's like a little bit of New Orleans on the west coast!  I go to shows here a few times a month! All the great bands that come through play here and some have their after parties at boom boom and go until 3 am!  Most of the time they start on the late side but they will stay open after 2 (they will stop serving alcohol so get your buzz on early!).  Drinks are cheap, the crowd is great, and you're in for a great night if you come here!", 
    "review_date": "2012-03-12"
  }, 
  "e4Sek5hTjpe_eBeM9jXd6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher S.", 
    "review_text": "Sami, Laura &amp; I grabbed some drinks here before seeing a movie at the Sundance Kabuki.  Well...not seeing, actually.  We got too schnockered at the Boom Boom to see a semi-serious flick.  But, I digress.  Boom Boom was decent.  I didn't love the smell of the place...and the ambiance wasn't all that great.  But, the Happy Hour specials were cheap and decent.  I adored the female bartender.  She was super cute, and I thought she was sweet.  Laura &amp; Sami were not quite as charmed by her...I'm thinking it is a female thing.  Pretty girls do not like other pretty girls.  Kidding, ladies.  But anyway, a solid time was had by all.  I'd hit it again if I was in the area, but I prolly won't go out of my way.", 
    "review_date": "2009-03-19"
  }, 
  "zSVJRiet9pxTbYnETnJAVQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francesca T.", 
    "review_text": "I went to Boom Boom for Mardi Gras in the Fillmore talk about downright crappy.   As far as drinks, drinks were ok priced!  The doorman who checked our ID's was cool as we got in for free. We were inside pretty much a whole hour, but then all of a sudden me and my  friend went outside went to take a smoke break.   We noticed that the same doorman that let us in for free, was now charging people a $7 cover to go in.   Me and my friend didn't think anything of it as we figured we were gonna get back in because we were in the bar before.   NOPE totally wrong!   This \"fool\" was trying to charge us the $7 cover and we were like ummmmmm hello we were already inside. This guy was being a total douche (excuse my language). He said oh well anyone that's not coming in had to pay $7 and get a stamp! We were like DUDE WE WERE ALREADY IN there!   Homeboy never gave us any warning told us that there was event going on NOTHING!   We started to argue w/ him telling him that what he was doing was not right. He didn't care! He said your not getting in w/o paying $7. He was yelling at us too!!!   He said the $7 cover was for the band to get paid which we understood and maybe would've mentioned before or give us some sorta heads up that that would be fine! But nope!   Music and drinks are great, but the bouncers are d**ks!", 
    "review_date": "2011-07-14"
  }, 
  "GN4tSuRYSnOVA_VldNSTgQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben S.", 
    "review_text": "Eclectic live shows. Reliably unpredictable jams. Mild-mannered bartenders. Raucous and high energy crowd -- yet respectful, with a pinch of polite and even periodic couth. Ok, maybe not couth, but definitely rockin' and always always a good time.  \n  Good karma, great joint, old school. How  can you not love this place?", 
    "review_date": "2005-06-18"
  }, 
  "obzG4Rl--o2khekCBJ1R2w": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kelsey T.", 
    "review_text": "Door guys are awful. $15 cover and I was $1 short and they wouldn't let me to get more cash after waiting in line for 20 minutes. Told me to eff off and go to the ATM down the street. Not worth your $15 or your time. Head down the street to cooler and more laid back places with music that are just as good if not better.", 
    "review_date": "2013-11-16"
  }, 
  "-t9kX5Ao9CM5QrwGI9YodA": {
    "user_rating": 4.0, 
    "user_location": "Mid-Cambridge, MA", 
    "user_name": "Engelbert H.", 
    "review_text": "Great club!  Perfect size and feel for seeing live music in my opinion.  Nice stage (they have a rising curtain!), nice staff, and great booking.. can't go wrong!", 
    "review_date": "2009-07-23"
  }, 
  "2TFc0YAo1RbUqx0A7w3GTw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Dave S.", 
    "review_text": "Funk, Funk, Blues, Funk, and some NOLA Funk!!!", 
    "review_date": "2004-10-12"
  }, 
  "aCMV95HQs4NVsyIN0f_vlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eli R.", 
    "review_text": "I had a great time on Saturday. We saw Hands on Fire play their Jazzy tunes with a mix of drums and other instruments I can't say I know their name. The Boom Boom Room is great for a night out with friends.  The drinks are preatty good and the atmosphere is a coazy little hole in the wall. Be sure to get in early to get a cool table. You can also dance if there is enough space.  I would love to go back again and enjoy their live bands.", 
    "review_date": "2008-07-07"
  }, 
  "EhFNfLJKWh__8_3NKrENCw": {
    "user_rating": 1.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "barry s.", 
    "review_text": "Don't let what happened to us here happen to you.   Ten minutes after we bought drinks, bouncers began clearing the place. When we protested that no one told us that we wouldn't have enough time to finish our drinks, the bouncers said that we could stay if we each paid a $30 cover charge.   Adding insult to injury, the overweight brunette bartender claimed that she sold us our drinks 25 min. before. Then a man named Aaron came, wearing an overcoat that was two sizes too big (we get that you bought it on sale but you still need to have it altered) and a pair of hipster glasses that kept sliding down his nose. He was such a bozo and so rude, my friends wanted to get out as soon as possible.", 
    "review_date": "2013-02-24"
  }, 
  "ilU2YC2DbzoxMUNjEZSpMA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine F.", 
    "review_text": "I Love this place!! I recently moved to San Francisco. Leaving my girlfriends and favorite bars in LA.:) I found my new favorite place. If you like a good strong drink and Live Rock Music. This is one of the best local bars around. Tygre/ Bartender was this first Girl I met in the Citah! She is wonderful and pours a very NICE drink. The owner is awesome. I have met some really awesome people here. You should check it out!!!!! MUCH LOVE Boom Boom Room!!!!", 
    "review_date": "2008-09-19"
  }, 
  "HU3dY_PuMZF7x3H3_hhtig": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn V.", 
    "review_text": "Its a cool spot... Bouncers suck ass... Other than that.. Place was cool...", 
    "review_date": "2010-07-26"
  }, 
  "u9o9kk6zmd3cz-vaxCKwJg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "The guy working the door is a total jerk.  I will never come back to this place because of him.  We were there early having a drink before the shows were going on and left before the shows came on and this prick insisted that we pay $20 still.  Huh?  What?  $20 on top of the 5 drinks we bought inside with no entertainment?   This place robbed me!  Very un-San Franciscan!  I don't know who this door guy thinks he is but he's gonna learn real quick.   Anyway, I did give this place 1 star because Joe the bartender was a very good host.", 
    "review_date": "2010-01-18"
  }, 
  "46gdYGxNQOGL4E1UvLlamQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacey M.", 
    "review_text": "GREAT venue, GREAT music, the guys at the door are HUGE assholes", 
    "review_date": "2011-04-05"
  }, 
  "rS4OEY7fWDZG_JuJjR9HWg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle L.", 
    "review_text": "The quintessential dark cozy jazz lounge, I've enjoyed a good martini string at the small tables while enjoying a variety of music. It's a great little spot for after dinner in pacific heights", 
    "review_date": "2014-05-21"
  }, 
  "HR1wozuAE_3KAHFP1XvIjw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lorie N.", 
    "review_text": "I can't believe I've never been here until a few weeks ago.  Oh how I am missing out!  We came on a Sunday evening and saw a fantastic band that I don't recall the name of.  (Yah I know, shame on me.)  The great thing about this place is the intimate atmosphere between the band and the crowd.  While it was really busy, it wasn't hard to make our way to the front and dance with a huge fan blowing air in front of us. You know how you go to a club and it gets so hot and sweaty?  Well that never happened here because of the huge fan.  Big props to the management for having that for both the band and the crowd!    If you haven't been here, GO.  You won't be disappointed.  Great people, great music and be ready to dance the night away.", 
    "review_date": "2013-03-12"
  }, 
  "tvGZBOnzYoGughdXZ8l4Mw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BiNgLe D.", 
    "review_text": "Sugar bootie !! there was this killer superbooty pagent there last night . What an awesome time .. Hot dancer girls on the bar, pole dancers , chicks swinging fom the chandeliers . The bartenders were awesome , the cocktail waitress was super smoking .. Jello Biafra was there and the guys from Big head Todd and the monsters . !! I met the owner too and he was super cool !.  I stepped outside for a smoke and the door guys had me laughing my ass off .. this place its great , its small and friendly and has an awesome vibe . its worth whatever they wanna charge !!!", 
    "review_date": "2010-07-30"
  }, 
  "TBRs3c6YSvfSKX6zLg1MNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mother L.", 
    "review_text": "I loved the Boom Boom Room.  I went to listen to some sexy 60's soul the other night.  Bartenders were awesome and made sure I was doin alright throughout te night!  Clean ladies room with big mirrors and lights for those touch up we sometimes need after dancieng our tails off!   *becareful the cocktail waitress tried to over charge my friend twice for her drinks and another time she short changed me by $5.   But thats not gonna stop me from going to the Next In n Out!  I just gotta be on my toes!", 
    "review_date": "2009-09-08"
  }, 
  "-VepAtJE14U2E3Jl9wgsIg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah P.", 
    "review_text": "Nasty, nasty place run by nasty, nasty people. Remember when this was a soul joint called Jack's? Well the soul has gone. The soul has gone away. There are many other venues to choose from  in SF that respect patrons and musicians. Go ANYWHERE else.", 
    "review_date": "2013-03-17"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Interesting little bar on the corner of Geary &amp; Fillmore, smack dab in the center of the Fillmore Jazz district...crazy checkered floor, pretty decent drinks, and they have some cool bands that come through and play live shows (if there's a show, be prepared to pay a cover).  Best part is, if you're stumbling drunk when you leave, there is usually a plethora of taxicabs available to take you home.    Most memorable moment:  it was the first time a chick ever came up to me and said, \"You have really pretty lips.  Can I kiss you?\"   Yeaaahhhh.....no.  I don't think so, honey.  I'm never THAT drunk.", 
    "review_date": "2007-08-13"
  }, 
  "KzrfdtTlGYX3tGflJ0JRbg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Hira M.", 
    "review_text": "This bar is small, dark and cozy!! They have an ok selection of drinks. The prices are mediocre. The bartenders are doing an amazing job!  Would love to go there again!!", 
    "review_date": "2014-05-27"
  }, 
  "O82038wU3emRq0AXIUQs9A": {
    "user_rating": 1.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "G W.", 
    "review_text": "We went in here because the sign in the window said \"Happy Hour Everyday.\" After ordering drinks we were charged full price.  We asked about happy hour and the bartender said they didn't do happy hour on Mondays.  After leaving we rechecked the sign and it said nothing about happy hour not being on Mondays, it just said \"everyday.\"  I went inside to give the bartender a heads up and maybe he should change the sign or take it down.  He just acted like a dick and said \"it's only happy hour when i put my big folding sign out.\" Whatever won't go back.", 
    "review_date": "2014-08-04"
  }, 
  "mZokz37TaR5jFgMrx4WyFw": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mark D.", 
    "review_text": "Great venue with fantastic music.  Reminded me of a more vintage version of the Temple Bar in Santa Monica.", 
    "review_date": "2007-03-10"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Boom, boom, boom, I want you in my room... remember that song? Anyways...  I was only in this bar for about 45 minutes but think I can still review based on first impressions. I was psyched to see the \"happy hour until 7:30\" sign out front when I arrived. $2.50-$3 beers and $3.50 wells are great with me! However, when I ordered my cocktail at 7:20 pm, the waitress said she'd have to check if her cash register still thought it was happy hour (I guess its time often doesn't match the actual time...). Hum... luckily, the register agreed that I could have my vodka-cran for $3.50!   My kickball team met up here before our game and enjoyed the comfy-though-not-all-the-way-clean tables, bench seats, and chairs. A band was setting up which I would have liked to stay to hear but we had to play our game!  This seems like a super chill bar and would be a fun dive to come back to...", 
    "review_date": "2008-10-23"
  }, 
  "S2K0CKviY_F_2tdO9EfQxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie H.", 
    "review_text": "I went to The Boom Boom Room after a show at The Fillmore, that much I will admit.  I may or may not have spent time backstage after the show...  I may or may not have consumed a Jaeger Blaster upon my post- midnight arrival at TBBR...  I may or may not have danced to a live zydeco band...  I may or may not have witnessed a cute girl sensually playing the WASHBOARD and singing in the zydeco band...  I may or may not have swing danced to the music of the zydeco band with one of the members of The Fillmore show's opening act...  I may or may not have refused when another member of the opening act asked if he could kiss me...  I may or may not have seen the headliner from The Fillmore show at TBBR. He may or may not have been making out with a girl who was not my friend or me...  I may or may not ever return to The Boom Boom Room...", 
    "review_date": "2010-02-23"
  }, 
  "QtQrPd6YPJKNC7YG7G0LLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew R.", 
    "review_text": "Best Jazz/Blues venue in SF.   Johnny Lee Hooker may be dead, but the music isn't.  One negative is that the place gets VERY hot inside.", 
    "review_date": "2007-08-08"
  }, 
  "sMOJxOkgk9VhKuXCBooXHg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom M.", 
    "review_text": "Cool I guess. Lot's of history. Was looking forward to it. You know, you just have to have your expectations in place.  If you're looking for more than what it provides, you'll be disappointed. It's a cool place for what it is. And it gives lesser known musicians a place to strut their stuff.   I knew the band I was going to see so it was all good. But If I walked in off the street, probably not so much. Short story; go for the music and the venue itself will be fine. You may even be able to say you saw somebody there before they were famous. That's the kind of place it is. Fun.", 
    "review_date": "2013-06-23"
  }, 
  "a9RRUfSQ189nRvIEd6INWA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike R.", 
    "review_text": "We came here for my fiancé's birthday party around 9pm on a Saturday. I knew there was a $10 cover that night (from the website) and all 6 of us were prepared at the door. When it was our turn to pay and enter, the doorman (wearing nerd glasses) told me it was going to cost each person $15 to enter the empty establishment. At this point, I was not interested in changing plans for the night, so I asked the doorman if my fiancé could get in free for her birthday, since none of us knew about the up-charge. He blew cigarette smoke in my face, as he told me, \"well then someone should pay for her.\" I wanted so badly to verbally slam the doorman, but I didn't want to cause a scene, or organize everyone towards a new place (since we were there to see a funk orchestra and already had other friends inside). When it came time to pay, I handed the doorman $80 (for 6 people) and my buddy handed in a $10 to bring our total to the full amount. The doorman had a very hard time doing mental math, and got frustrated WITH US for paying together. He handed all the money back to me in frustration, and made each person pay him one at a time. What an idiot. I definitely won't be returning, due to the slow and inept service.  Overall, the only redeeming part of the night was the funk orchestra. Next time, I will see a show at any other venue in SF. There was nothing that really stands out about the boom boom room beyond what \"Neck of the Woods,\" \"Maggie McGarry's\" or any other bar with a stage already offers in SF.", 
    "review_date": "2014-03-30"
  }, 
  "Q7rUXBBM_u5i7ZEEMq1tDQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gibson V.", 
    "review_text": "The two bouncers in front are not twins, or brothers.  They just alike and wear the same kind of hat.    I sat next to someone who reminisced coming to the Boom Boom when it was called Jacks like 25 years ago.  The pictures on the wall of the likes of Muddy Waters looking down, discerningly and slightly skeptically, were taken in this little place, where you can expect to wait until just about 11 for the music to begin, and expect to stay until 2:15.  By the end of the night I'll look back up at Muddy's picture and maybe it's just me, but he seems a little less skeptical.  Maybe there's a glimmer in his eye.  They're still bringing it.  Park yourself at stage left behind the keyboard, order a beer from the lovely waitress, and feel that funk.", 
    "review_date": "2008-06-11"
  }, 
  "yzAU4FV4s-tP9vurFXzIgg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Supadj E.", 
    "review_text": "i went there to met up with some friends.after being there for a hour some band started to play and i had ordered drinks and went outdside to smoke.as i tried to come back in they said i need to pay 15 bucks to come in.i explained that all my stuff was in a booth and i had been there for a hour and just ordered drinks.they were totally rude to me and my girlfriend and would not let us back in.then the door man tried to push my girlfriend and i lost.needlees to say they gave my money back for the drinks.this place sucks and the staff sucks also.i will never return..if i could give them negative stars i would..it  should be called the rude rude room!!!", 
    "review_date": "2012-01-17"
  }, 
  "5Mk4gwVCh1lBJQThhF4erg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Emily C.", 
    "review_text": "This place reminds me of what \"Fangtasia\" from True Blood would be like.  Sets of original music played all night long. The band was great, wish I remembered the name.  The neighborhood did not look great - go with a group.", 
    "review_date": "2011-08-08"
  }, 
  "DlJ1EudYLOoqrjQA7tusjg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tara W.", 
    "review_text": "Great live show! The Funk Revival Orchestra performed when we went. The place is a trip into the past with a vintage 30's juke joint feel. We danced the night away...MUY CALIENTE!!", 
    "review_date": "2009-06-19"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "a sultry steamy place with good loud music and fun crowd. we scored that private table by the window near the front door and watched all the drunk people dance. great venue!", 
    "review_date": "2005-05-12"
  }, 
  "wb2I6PxYjRStE7OGLL4S7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "Being a huge fan of live music and dancing I've always loved the Boom Boom room, because they over deliver on both fronts.This is a super chill, non pretentious music venue where you can let loose and be yourself. While drinks aren't any cheaper than your standard bar you never have to push through the crowds or wait very long to order a drink at the bar.   I was reminded of how fond I am of the BBR over the weekend. The night started off pretty standard: Happy hour after work for about 2 hours, followed by dinner with the standard consumption of drink 2 Goose martini's. After that we headed to see 'The Watchmen' at the Kabuki Theater where I continued my drink fest with another delicious Grey Goose concoction (or two).........Jump to half way through the movie where I return from the bathroom and ask myself  \"What the hell movie am I watching?\" At which point I decide to leave since I realize I'm less than half way through this 3 hour bore fest. I meet my man who's also coming back from the bathroom and head outside where we're approached by a homeless man who tries to get $5 out of us for a place to stay for the night. We decide instead to invite this seemingly normal man to the BBR with us where we manage to get him pretty toasted on 2 beers. I'm pretty sure he had quite a memorable night as he couldn't seem to remember the last time he had actually let loose and danced with a smile on his face for an entire evening. Success!  It was $15/pp to get in which I think varies based on who's playing that night. I won't say this is any better or worse than the Elbo Room in The Mission...so it just depends on what neighborhood you're in or if you actually look up ahead of time who's playing and prefer a certain type of music.", 
    "review_date": "2009-03-16"
  }, 
  "pyVk_h1IXVxp0YrzlGSf1g": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dwayne B.", 
    "review_text": "One of the only ALWAYS reliable live music venues in SF.  You just cannot reliably hear music like this at many places in the U.S.  I'm talking 5-8 piece funk bands, with full brass players, and KILLIN' IT!!!    Some radio style funk like Bootsy Collins, Gap band, etc, but mostly high energy funk James Brown style with in your face horns, 70's type rare groove, as well as international flavored soul and similar flavors.  If you like B3 organ, this is only one of two places in the City that has a house B3 with Leslie speaker.    Started by blues legend John Lee Hooker and named after his most famous song ever.  This place oozes soul and to me epitomizes the best of live music that put San Francisco on the map world-wide many years ago and continues to hold up this reputation.  I hope this place keeps doin' its thing for decades to come.  I've got to have my Boom Boom fix at least every month or two.  If I didn't live all the way down in San Jose since I moved here 7 yrs ago it would be weekly.    I'm bay area born and raised and me and my buddy always get our live music fix here.  Been coming here every few months since 1998.  We were just there twice in the last 2 months and both times the music was great.  People in SF like live music and here at Boom Boom Room, people LOVE live music.  They really show their appreciation and respect for the world class musicians that hit that stage every week.    If you've never been here, do yourself a favor and get down there to see Will Blades or Oscar Meyer and Steppin', or just any friday or Saturday night will do, and prepare to be B.L.O.W.N.  A.W.A.Y.  Seating is limited along the left side of the long narrow room.  Get there by 9 or 9:30pm if you want a seat.  The music usually starts with an opener at 10pm and the headliner usually goes on around 11 or 11:30.  They often have shows where the music goes past 2am.  Most nights you'll feel like standing up and moving your body though if you have any soul at all in you.  To the left of the stage is a good spot to catch the action, right next to the rotating B3 leslie organ speaker!  Bartenders are cool, but it can get busy and it might take some time to get a drink at times.    Parking tip, park down Geary near the park a few blocks away.", 
    "review_date": "2012-10-05"
  }, 
  "_64q3QQbUg4BknYri7fCPA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "c e.", 
    "review_text": "boo. $15 cover on a friday night? really? thats how much covers are at BIG clubs... but okay...  then i went inside and ordered the usual jameson &amp; ginger... the ginger was out and when i told the bartender, she offered me another drink, but it seemed like too much work for her to change the gingerale for the tap booo... i resorted to vodka", 
    "review_date": "2008-10-11"
  }, 
  "dBz_y-VGLlEr4IRrZq-zYg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Grace V.", 
    "review_text": "One of my favorite stops on the way to The Fillmore. Make it an evening and drink your way to show. This place won't steer you wrong.", 
    "review_date": "2012-11-27"
  }, 
  "Uc2ZtQdTThtNSw_lNzfrpw": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "David M.", 
    "review_text": "All it takes to drag me out of the Mission for a show at the Fillmore is a pair of free British Rock tickets and drinks at the Boom Boom Room. Most nights I would be that excited to grab a drink, but given the Hurricane that was SF that night, a Gin &amp; Tonic sounded perfect.  Despite the more' being packed across the street, there was plenty of space to dance and move around. The bartenders weren't on their A-game that night as she didn't realize until I reminder her...40 minutes later, that she didn't charge me for my drink. That said, the drinks we're strong and got me into my dancing mood.   It was a great spot to get to know the new people in my crew that night and get ready for a night of jumping and headbanging.", 
    "review_date": "2012-04-15"
  }, 
  "xT15DPvgtyU799LLXpKzIQ": {
    "user_rating": 4.0, 
    "user_location": "Stuart, FL", 
    "user_name": "William R.", 
    "review_text": "I dig this place at happy hour, the crowd is fun, laid back, spread out and diverse. It's a great place to see a small show, although it's not really my music scene. Catch a couple drinks here wandering around the Fillmore or Japantown. Note: $20 minimum on Credit Cards, that buys a lot of PBRs if you take that as a challenge. Fun bar and a really nice staff.", 
    "review_date": "2009-07-15"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Yet another bar that I've been to many times over the years and only now remember to review.  Not that they need one from me, this place is an institution.  It's always clean and has been renovated yet retains the vibe that makes it a classic Filmore haunt.  The bartenders are always great, the drinks are cheap and if someone is on stage chances are they're good.", 
    "review_date": "2011-05-29"
  }, 
  "N9FST4pCuLOgUu9GMixZ7w": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ashley M.", 
    "review_text": "Ah, the Boom Boom boom boom I want you in my room Room.  It's in a part of the city that looks frighteningly similar to Walnut Creek. However, it is deliciously UNglamorous. And if you go in at 5pm on a Sunday, it's also pretty empty.  John Lee Hooker used to own it. That's cool in and of itself. And there are cheap drinks, friendly customers, and good (and NICE) bartenders.  If I ever decide to pay $13 to see a movie at the Sundance Kabuki again, I know where I'm going for drinking before/after.", 
    "review_date": "2009-03-01"
  }, 
  "jJlYRJXPdIolKbuqGiZ-CQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valarie A.", 
    "review_text": "This place is a staple for me to start the night out before heading to the Fillmore.  We've seen some great bands from New Orleans play and danced our asses off many of nights after leaving the Fillmore.  The drinks are all cash only and no tabs allowed, so step up to the bar and be ready to go!", 
    "review_date": "2007-06-27"
  }, 
  "Cjns2nKBDH1WdZPP1jjtzQ": {
    "user_rating": 5.0, 
    "user_location": "Tiburon, CA", 
    "user_name": "kathleen h.", 
    "review_text": "My friends and I stopped in there one night by accident and we loved it.  It is small and funky, but great atmosphere.  The band was incredible, Monophonics,  a funk soul band .  I later found out that they had won Bay Area Music Awards in their category for 2007.  WOW!  We will be back, but probably only when Monophonics are there.  What a night.", 
    "review_date": "2008-01-10"
  }, 
  "ZO0LU4unvbD7p32aTDQiIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LT B.", 
    "review_text": "I like the atmosphere and space.  It's a cool place to hang out especially before a late movie at the kabuki.", 
    "review_date": "2008-05-19"
  }, 
  "LvdC1y5QlN9Ll3G7IVDXLA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracy N.", 
    "review_text": "The music was great, perfect lightening, nice red all around, the whole atmosphere is going on!  They put you in the mood for an extra drink...isn't it what we all want from a bar?", 
    "review_date": "2007-10-28"
  }, 
  "OnNmQjyBUECOa-cqbI_kAA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Mary F.", 
    "review_text": "I never pass up an offer to be someone's backup date. Usually it means that they had tickets/reservations for something good, free night, and no undercurrent of sexual expectations (or else I would've been your 1st choice date)  After a night of watching Karen O gyrate and breathe heavily on stage at the nearby Fillmore, all I was in the mood for was some sweaty \"pull my pants off with your teeth, knocking boots\" or to wind down and fill myself with whiskey.   Circumstances had me choosing the later. The Boom Boom Room is a perfect spot for a pre/post Fillmore drink... or even a drink in general . I was looking forward to some Jazz but the night I went but it ended up being a Jazzy jam band. ALL bad. I was supposed to go there to chill out, but now I had ants in my pants and I wanted to dance, but the narrow space didn't allow for much of that.  Overall good place. Bouncers are a bit harsh but the bartenders pour generously.", 
    "review_date": "2007-08-22"
  }, 
  "tlsYH69VL0bEax4aM0uZ0Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelo P.", 
    "review_text": "I would have loved to enter but the security person refused me. I turned 21 last week amd apparently, he said my passport was fake and I look young. I was not in the mood to figt so I left for Ruby Skye which was accomodating. :)", 
    "review_date": "2014-09-15"
  }, 
  "pvi_baolWn7mrtcb9rWAEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joyce L.", 
    "review_text": "When I moved to SF three years ago, my first apartment was about 4 blocks away from BBR... and am embarrassed to admit I was oblivious to this place's existence.  Boom Boom Room is overshadowed somewhat by it's larger, more prominent neighbors (The Fillmore, Yoshi's, Sundance Kabuki), and the facade doesn't really do the BBR any justice. But once you enter, it's like a different world.  I especially like how intimate it is - the red tinged lighting, fast friendly bartenders, staging somewhere between home grown and professional... reminds me a lot of some of my favorite venues in New Orleans (Maple Leaf, One Eyed Jacks). In fact a lot of great NOLA artists - not hue names, but people who's on the circuit - plays at the BBR, which is a major reason why I go there  I, unfortunately, have never been there for happy hour. In fact I've never been there before 10pm. But maybe, one of these days...", 
    "review_date": "2010-07-24"
  }, 
  "5lvfVuWaJPHx93fDQj-teA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Adam O.", 
    "review_text": "The neon sign, the red pleather padded entry door, the deep red interior tell you its gonna be hot in here. The funk from Katdelic was even hotter. This place rocked. Small crowd just groovin. No tude. Just awesome awesomeness! Sound was great. Loud enough to envelope you but doesent make your ears bleed! Did I say I like this place?  Ok went to see FRO and Le Vice here on sat night. Awesome awesome awesome. Love this place!", 
    "review_date": "2011-07-30"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "Thanks for helping bring dub-step back to San Francisco.  My heart and soul really needed it last night.  With the slew of summer festivals popping up in the Oregon and Bay area - the once standard San Francisco dub-step parties - that would fill up my weekend and force me to make frantic Party Rat purchases at Great Stuff - have been on hiatus for awhile.Leaving my waistline aching for some good hip-roll music, and my spirit deflated - these past couple of weeks.  So when I heard that there was gonna be some dirty bass hitting beats at the Boom Boom room this Sunday - I decided to just go for it. I grabbed a late night cab over and had my five bucks ready.   The bouncers were chatty and ushered me right in. Into a familiar world of lovely smells, familiar faces, and oh so lovely deep sexy bass.  Moving in that dark - red-lit hazy room  - things just seemed brighter. Better.  The bartender - grabbed me a water right away and the quirky intimate-spaced Boom Boom - exploded with good music, as people pulled their hoodies tightly around themselves, pursed their lips and just got down.  No line for the bathroom, plenty of seating room, and best of all - plenty of room to dance. My worn boots - sliding around on the wooden floor.  I bolted early, but heading into the foggy chill of the now Monday morning - I didn't mind the wind hitting my flimsy t-shirt. It just felt good to dance again.  Trust.", 
    "review_date": "2010-07-26"
  }, 
  "_kSbuZlcen8sjeiVhKj4Fg": {
    "user_rating": 5.0, 
    "user_location": "Foster-Powell, Portland, OR", 
    "user_name": "Dana S.", 
    "review_text": "Good acoustics, good lighting, cozy red booths, and happy people.  All in all, a great venue.", 
    "review_date": "2009-01-09"
  }, 
  "RqUJo6tjD8m4JEuZ37VN5g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roshni R.", 
    "review_text": "great spot for music in a kind of shitty neighborhood.  i like the dark, mostly red interior, and the funny drink names (for just normal beers on tap), but really it's all about the music.  that and the cute english bartender who happened to ride the bus back home with me and my roommate and we managed to somehow not invite to our houseparty....  dear bartender, if you ever see this, we wrote you a missed connection apologizing for not inviting you and once again, sorry--but next time we have a house party, you should come!", 
    "review_date": "2006-10-25"
  }, 
  "c8qFkI_VusWo0xZvkjfBWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew w.", 
    "review_text": "I love this place.  I live right across the street and have been here more times than I can count.  Whenever you see a name in red on the marquee outside, make sure to see that band.  95% of the time I've never heard of them but they wind being incredible.    Funky Funky Funky.", 
    "review_date": "2005-05-14"
  }, 
  "9GCCoFw_UHiAHjZ4kygHgw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren V.", 
    "review_text": "if you want to play handsies under a table at a candlelit spot with top jazz and blues musicians going off...this is your place. John Lee Hooker opened this spot and it has tons of history. I have also smooched and had handsie type situations go down here. RAD", 
    "review_date": "2007-03-15"
  }, 
  "6_VkzelWeSHzjTVDlGl-Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "MUSIC: Live jazz! JNG was the guest that night. :) Good stuff.  ATMOSPHERE: Like a regular bar almost, but with a stage at the end. Kinda roomy for dancing. Overall I like the feel of it. It's kinda basic, but nice touches to it. Like the stage had red curtains that'll draw up old school way, they had spinning lights from the disco ball, they had candles on the table in a red candle cup so there's red glows around the room, and a classic checkered floor. :)  CROWD: We went on a random weekday, so not super crowded, but just enough. People came as mostly singles or pairs. This one couple danced the night away, in a most entertaining fashion. haha. Age group was mostly 30+ I want to say. But yeah overall kinda casual upscale feel. (As to say there weren't ghetto people there)", 
    "review_date": "2010-01-11"
  }, 
  "W9BWCeuTjQH0TbFeuPB7Ww": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "J L.", 
    "review_text": "Great place to see live music but please be aware that their dishwasher does not clean the glasses for sh*t and the place is SCOADY in daylight.  All I can say is stick to bottled beer at this place.  Period.  You might catch something other than a good show if you know what I mean.  I worked there briefly, trust me.", 
    "review_date": "2008-06-06"
  }, 
  "MjODtNdS1ZRskKS6CWbegQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michele G.", 
    "review_text": "This place is great to see live music, it's small and intimate.  Do watch your belongings, I was robbed inside the venue.  It's a fun place but it does cater to thieves. I'd be back to see more live music but I will have a lock and chain on my things.", 
    "review_date": "2011-02-02"
  }, 
  "0_GsXlLu-uaXV0iZG3bMyw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tak H.", 
    "review_text": "Just as a heads up, Alex here has decided to appeal to yelp be claiming I'm unruly and was in his booth with my date. Also, I'd like to call out this event happened nearly a year ago. Interesting you claim you never got my mails/calls..I have records I can share.   @Boom Boom room  You're very wrong sir. You have me confused with another patron you threatened to kick out because their date found their way into the bar owners hands (on in this case booth). I hope you realize how idiotic and incriminating you look by coming onto yelp and try and claim I was drunk and that I was in your booth. My advice to you sir is simply review the 3 emails I sent on 10/12/12 and 10/13/12, if you'd like I can post those on this review as well.   Otherwise, I'd highly suggest making this right by admitting you don't remember this, that something like this happens in bars. However, don't try and gain support on yelp because you want to pull the \"I'm an innocent bar owner\" routine.", 
    "review_date": "2013-07-11"
  }, 
  "Fz3y-d7Ru7wMRnPuwG-OLA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mick F.", 
    "review_text": "This is a pretty low key place when there isnt a show going on. Ive only been here before a show at the Fillmore, to get my buzz on. Its a little divey, with a handful of colorful regulars. The barkeep is a sweet girl who tossed me a free shot for me just being a handful of carmel. I could see this place rollin hard, but until then, it gets three.", 
    "review_date": "2005-06-14"
  }, 
  "19I4YAfuhNtGQIjd2HDo5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JT N.", 
    "review_text": "The Boom Boom Room is my go to spot for awesome live music.  Some of my favorite artists that play on a regular basis include Vinyl, Eric McFadden, and Robert Walter.   This place has a great atmosphere and the bartenders do an amazing job.  I highly recommend the Boom Boom Room!!  They go late night on weekends too so even if you role in after midnight you still will hear plenty of music:)", 
    "review_date": "2013-08-16"
  }, 
  "WjXzBDRVKMXs-PvFighu5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mattee M.", 
    "review_text": "I like to shake my booty here....yep!  I like to have drinks here....yep!  I like it freakin here..  So come here and find out what the hype is all about. It's fun.  Sincerely,  Staggering Drunk Fan", 
    "review_date": "2007-05-15"
  }, 
  "q4yMVuGp1JZW1n2eSleEvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi P.", 
    "review_text": "They had a great show on the night I went.  The venue was crowded, some girl in a tiny dress was dancing on the couch and people were laughing at her or ignoring her equally. The bouncers were hot &amp; yummy &amp; had just the right combination of style, speed, and flirtiness.  The drinks, well, I'm not really sure, I bought the tickets other people bought the drinks.  They have a great line-up quite often and I just need to ditch the early morning job so I can get out there more!   Seriously a great venue, the kind of place I want to go for music &amp; revelry.  Not  a bar with music, not a studio with seats, but a place where you should get into the music and :) yeah it was good.", 
    "review_date": "2006-12-05"
  }, 
  "P8GPcx0hjENt8QpjGZOBqg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alana P.", 
    "review_text": "I had to leave a show (that I bought a ticket for) because there was so much weed smoke it made me super nauseated. If you like that kind of dive, fine. I found the $15 ticket a bit out of line with that mentality, though.", 
    "review_date": "2013-06-10"
  }, 
  "EjVRsZhNyG7vkCxVci7xHQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theresa T.", 
    "review_text": "Don't hesitate to walk through the door to the Boom Boom Room. The checkered floor, red flare, and narrow-rectangular shape make this place like an old time-jazz-possible burlesque-ish feeling venue. BBRoom is small and has one bar adding to the many reasons I enjoyed it.  Did I mention this is \"the place\" to score ridiculously cheap good music? I bought tickets for a friend and myself on a Thursday night. The tickets were $8/ea and there was no cover at the door. You can stand and rock out, sit at the bar and nod your head, or scoop up a tiny table that really looks more like a stool.    Damon and the Heathens put on a great show. They described themselves as a punk-jazz band, but they sounded Ska to me (only a little better). For such a tiny area the music sounds great. Maybe the walls just know how cool the music and people are at BBRoom. Drinks were easy to get. There are servers for the tables otherwise you can just walk up to the bar (the servers charge a little more than the bar).   The placed filled up throughout the night. Great venue and check out the website for upcoming shows.", 
    "review_date": "2008-09-02"
  }, 
  "Uqg8zgMw-JYJNpjVtFXqng": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": "Nicole R.", 
    "review_text": "This is a fun venue. It's cozy and intimate.  The staff is friendly, the crowd is interesting, and the drinks are good! Plus, it's called the Boom Boom Room!", 
    "review_date": "2007-01-15"
  }, 
  "82dCHyU-ANOgdhxUgZsUeg": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marlon T.", 
    "review_text": "I stopped by here to grab a drink while waiting for a table at State Bird Provisions. It's a dimly lit spot with a stage which tells you there frequently is a band playing. If there's no band, the house speakers will probably be blaring out some music. There wasn't anyone playing Saturday early evening I was there. I guess that explains why there weren't that many patrons at that time which was good for my friend and I because we just wanted a drink to kill time and didn't have to deal with any waiting. Maybe I'll be back to watch some show but otherwise it serves as a cool bar. Prices were average.", 
    "review_date": "2013-11-25"
  }, 
  "yue6u7RgFayN9AkK4e3iMA": {
    "user_rating": 5.0, 
    "user_location": "Bismarck, ND", 
    "user_name": "Eric T.", 
    "review_text": "This place was amazing!! Caught a ghost was playing. Great staff and even better band. Had an amazing night!!!!", 
    "review_date": "2013-06-07"
  }, 
  "QHOlbQOLwri8pDHESDi_9A": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Shawn S.", 
    "review_text": "Awe ____! If your girl likes to dance, this is the place to hit. Never a dull place!!! Whiskey SHOTS and beers.. If you like blues stop watching the newszz! Get out and check the sceen out.. you'll be back!", 
    "review_date": "2011-10-16"
  }, 
  "RETXrAIZtD2ckUMARJitFw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete C.", 
    "review_text": "Was super excited to see the Brother's Grand play here and had rushed there straight from work. Was turned away because I had my work backpack, which there was nothing I could do about because I live a pretty decent distance away from the Boom Boom Room. Lame, screw this place.", 
    "review_date": "2014-06-26"
  }, 
  "oWJztclAau-xvN28lpXyIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ERICA E.", 
    "review_text": "After being here on two separate occasions in the last week, I can now put my twosees in. 1. I'm all for small intimate venues that attract talented musicians.  2.  I'm all for small intimate drinking holes. 3.  I'm all for good sized dance floors.  4.  I'm also all for an after party venue after the party-venue (the Fillmore). Yeah, the Boom Boom Room fits the above bill.  Decent space, decent bathroom, decent pours, decent cover charges (if applicable).  Great bands that are funky and fresh.", 
    "review_date": "2006-10-30"
  }, 
  "h7p_nX7wBoczxWi-weIszQ": {
    "user_rating": 4.0, 
    "user_location": "Golden, CO", 
    "user_name": "Aaron S.", 
    "review_text": "After living next to it for almost 2 years I finally decided to check out the Boom Boom Room. I wasn't thrilled with the band that was playing, but other then that it was a very good experience. Even though the place was pretty busy, we got our drinks within 2 minutes of entering the place, and even had a place to sit. I could have used some more booze and a little less soda, but regardless it was a good time. I wouldn't recommend it if you actually want to talk to whom ever you are with. If you are a fan of the hole in the wall music venue, than this is the place for you.", 
    "review_date": "2007-09-28"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "Sometimes I have make out sessions in a back booth, sometimes I revert back to high school and leave at intermission to swig baileys in the back of a friends car, sometimes I end up peddling the bands merchandise and sometimes I just dance to the great live music.   No matter how the evening unfolds I seem to always have a good time here.....and I seem to always see someone else who isn't having a good time. Lighten up people, put the fists down....we're all here to listen to some kickin music and get our groove on. It can't be that serious!", 
    "review_date": "2006-12-29"
  }, 
  "F4li3HnfS4gY5IeMSPkGcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John M.", 
    "review_text": "If you like live music and cheap drinks this is your spot.  While the jazz joints down the street offer better jazz options, the BBR is always fun.  Don't go here if you want to have a conversation though, because it's loud.  Do go if you want to get drunk, dance and meet some cool people.  I heard some reggae rocks guys place a few weeks ago and they turned me on to a new sound.  Who ever thought that Bob Marley songs could have sweet guitar solos and heavy drum work in them and still sound tight!  I'll be back at the BBR the next time I'm in the area.", 
    "review_date": "2009-04-15"
  }, 
  "zzr6MQqGgjkAEu6yTDK_TQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Sam B.", 
    "review_text": "Had a great time dancing to a cool band which consisted of a DJ and a drummer. Fun time good drinks. Will visit again", 
    "review_date": "2010-01-07"
  }, 
  "SZq4WeQXRFkU5JtesPjVkg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "Perfect vibe, good booze selection, and a good mix of bands I like hearing.", 
    "review_date": "2012-11-15"
  }, 
  "RDU27joptNn9rPx4DfGgUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayall S.", 
    "review_text": "Great intimate venue hosting some amazing acts.  Dive bar feel with nice interior.  Staff is friendly.  Finding a place to sit might be tricky.", 
    "review_date": "2012-06-30"
  }, 
  "J6gakGsk3-Q45Xj30DEIcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Black Nature B.", 
    "review_text": "This place is awesome!!!", 
    "review_date": "2012-08-15"
  }, 
  "a0AxvficFOemDMiaV2oYRg": {
    "user_rating": 4.0, 
    "user_location": "Rohnert Park, CA", 
    "user_name": "Tiffanie B.", 
    "review_text": "Good time and the music is great.", 
    "review_date": "2010-01-18"
  }, 
  "2zvUWE9erOVhGn8lLzdzuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael T.", 
    "review_text": "This is a damn fine venue, and there's very little I can think of about it to really critique.  The sound system is really good, it's got a fun, swanky look and is pretty comfortable, the staff in my experience are pretty cool...it's maybe a little on the long, narrow side and ends up being very packed up front sometimes, but otherwise I really can't complain about anything.  The funk/r&amp;b niche that they mine means that it's often not exactly my scene, but that's no reflection on the talent of the acts they book.  It's a cooking little joint and the grooves here are pretty much always smokin'.  It's at least a lot more lively and fun here than at Biscuits &amp; Blues, which is also good but suffers from a comparatively stiff, sterile ambience.  This is definitely a lively club and people come here to par-tay.  Shake that boo-tay, that is...", 
    "review_date": "2005-06-28"
  }, 
  "cImrKkWw8zGOWDQZ8nXKKA": {
    "user_rating": 1.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Yuliya K.", 
    "review_text": "The show was supposed to start at 9:15. We waited till 10:15 pm and were told it wouldn't start until 10:45 pm. I mean 40 minutes is fine, but 1.5 hours?! We just left.", 
    "review_date": "2014-09-26"
  }, 
  "1FRqbfhRZZWCQ9UZODlMjg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystle A.", 
    "review_text": "So I just got back from a fantastic night at the Boom Boom Room watching my favorite deep house band of all time Tortured Soul!!!!  Night was amazing when Tortured Soul finally hit the stage. The two douche bag guys before them were really lame and obnoxious. I couldn't wait for them to get off stage. I would of left and came back after their set, but I had good seats and didn't want to risk losing being so close in proximity to Tortured Soul.   The venue is a little small to be having a band with such a huge fan base. The bathroom is in the back and there's enough floor place for people to dance with their drinks. There is seating along the opposite side of the bar. Those seemed to get full pretty quick. There's a two stall bathroom for both men and women and a back door exit for when the place gets full.   There are ins and outs. At least tonight there was.   Despite the small venue and crowded scene, the staff here were amazing. The door man was so nice and the others were very attentive and on top of cleaning around the bar. So I'd be careful with leaving your drink around unattended.  The people that happened to come tonight were so great, friendly, and whatever is opposite of obnoxious. I had a really good time. At the same time we were all there for one purpose: Tortured Soul and you for to be a great loving, friendly person to listen to them.   Did I mention that Tortured Soul was playing?  The prices for the drinks were reasonable enough for my friends and I to go a couple rounds as well as buy the Tortured Soul some Tequila shots as well.  So my overall experience from tonight was 4 stars. One less for the small venue and the crappy duo DJ's who share one laptop. Oh goodness those guys were horrible. Actually if you see them, remember two young guys wearing sun glasses, walk right out. Trust me. Majority of my star rating is based on staff, Tortured Soul, and  the crowd that came tonight.", 
    "review_date": "2012-07-28"
  }, 
  "Vhm1eIhY6LMR7vwsgRyphQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin K.", 
    "review_text": "Boom Boom, thank god, is just a block away, so I can drink all I want and safely stumble home in an alcoholic coma. I did just that when I was lucky enough to catch Super Chikan at a recent show. It's not every day you see a geniune Mississippi-bred bluesman in town, and one who barks like a rooster and plays geetar with his teeth to boot. Anyway, every time I've gone, the bartenders actually seem to enjoy taking drink orders, so you're not left squished in between two barstools looking like a fool, waving bills at their backsides. A nice intimate club and I've always been able to get right up to the stage to see the action. Kind of like the laid-back atmosphere at Edinburgh Castle, but with the occasional transvestite in attendance. In any case, a far cry from the hipster clubs in the Mission and Tenderloin. Let's hope it stays that way.", 
    "review_date": "2006-08-22"
  }, 
  "Z7rKy3T5HETMznaZwk9zSQ": {
    "user_rating": 4.0, 
    "user_location": "Winter Park, CO", 
    "user_name": "Pablo E.", 
    "review_text": "great happy hour, especially before fillmore shows.  $3 sierra draft $2 pbr, and decent well pours.  the sound system was also very tight, especially for the sound checks we saw before the truckers show.  Door staff was friendly, and let me roll in for a quick one after the DBT show ended.    bathroom was gross.  is it asking much to have a decently clean pisser at 630pm.", 
    "review_date": "2010-05-10"
  }, 
  "Ou6eJFvev_6yCXVMEhg1cQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mei F.", 
    "review_text": "Awful security men at the door. This is the first time I've ever given any venue a ONE star! They hardly deserve a star at all..I will never go back, and I highly suggest going to every other place besides this one!", 
    "review_date": "2010-04-20"
  }, 
  "QjHj4rogqMBa8TXpDZ4Ctg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Skal Z.", 
    "review_text": "My favorite venue in the city, and I see a lot of live music.  Great, intimate room.  The sound is always incredible in there.  Seeing a good band is almost a sure thing on a Friday/Saturday night.  Drink prices are reasonable.    There aren't many annoying patrons, unlike other venues where you want to punch everyone in the room.", 
    "review_date": "2006-12-03"
  }, 
  "byUZpVzun-vVMMCFMXvdXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriel R.", 
    "review_text": "I would frequently pass this place to get to a friend's apt on Fillmore and always thought it looked a little rough and honestly, kinda ghetto from the outside. So, when I was told I WAS going out last night with a couple of friends, I was a little shocked that this was the place we ended up. I'm open to try anything once though and glad I decided to go for it. This is a little gem of a place and deserves a try if you're into live music, especially jazz and blues. The crowd was well mixed and I felt really relaxed here from the moment I went inside. No one judging you from head to toe, a really nice bartender (originally from New York), comfortable low lighting and a band that started to play about 10 minutes after we arrived. I had already been drinking and didn't try their drinks so I have no comment on the quality/strength of the drinks. I do have to say that I'm disappointed that they only take cash which, at the end of a night, can be a real drag if you're low on cash. Also, the band playing last night was not all that tight and at times I felt embarrassed for the lead guitar player. Being a musician myself and noticing the poor timing in their playing, I don't think I'd be into seeing this group again.  I look forward to coming here again and hearing some great music and most definitely getting my drink on! Cool spot!", 
    "review_date": "2007-03-26"
  }, 
  "FebHrRquAA6lQL_68-TriA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason R.", 
    "review_text": "Update: I upped my rank to 4 stars after going back to the Boom Boom Room last night for a friend's birthday.  The cover was kind of a lot ($15), but the live music was awesome, and the place was packed.  Slightly younger crowd than before, yet it was still unpretentious and fun.  I checked out the Boom Boom Room with one of my roommates last night.    There was no cover (sweet) and the band played laid-back Funk/Jazz.  It was pretty mellow, not really packed (although we left at 10:30) and we got a kick out of the guy thrusting his hips on the dance floor with said lady suitor.  Drinks were reasonable.  Not a bad place to check out, especially when there isn't a cover.  I was surprised to see a mix of people at this place, be it age, social background, big groups/more intimate.  It was a totally unpretentious place.  Low light there, so hopefully you are good looking in candlelight... if not, this is probably not the place for you.", 
    "review_date": "2008-01-14"
  }, 
  "lRX1uoOWRRH424yFVAsDpA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "J.G. A.", 
    "review_text": "Always a swinging good time! Every type of person from every walk of life, the BBR does not discriminate. Great vibe, the music is always loud, and the dancefloor is hopping! Memorable times here have included dancing with 10 different women, all in their 60s,  in a 3 minute span (what can I say, it was a great song!), watching new stars being born, and the day/night good ol' John Lee passed over. He is still watching over the Room and I know he likes it when you are nice to Phillip... you know, Phill-up The Tip Jar!", 
    "review_date": "2008-02-13"
  }, 
  "A2mx9xsHoIDNnd81_lxiFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Javi V.", 
    "review_text": "Great atmosphere for this cozy place! If all the bands are so good as the one I saw a few days ago, man, this is the deal! The only reason why I don't give it 5 starts is because the beers on draft are not that great.", 
    "review_date": "2009-04-07"
  }, 
  "VarPmrQsBeeLZ9suKpxYug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan C.", 
    "review_text": "The Boom Boom Room isn't that swank, plush, all white decor, $100 cover kind of place. It's a dive bar, a local staple of an establishment in the \"MO\". It's small, it's in the corner of a busy intersection, with very little to no parking. It's right in the middle of two neighborhoods that are exact polar opposites of each other. But it's been bringing the same kind of vibe for as long as I can remember and it just doesn't play out.   The live music variety here is as flavorful as the best three course meal you have ever had. It's such a mix of jazz type performers, to hip hop artists known and on the come up. They can host orchestra ensembles or just a lone saxophonist. That's just the kind of blend they bring. The drinks are what you would expect. They have a few on tap and make just about any cocktail you can think of. They are decent in value. In fact it's damn near a steal nowadays.   What I really like about this place is that everyone is welcome. They know no colors. It's kind of small. It can get grimy and of course body funk is body funk but that's what this is about. This is where you hang with your boys or girls or both and just chill.   This is where you bring that first date and let her know that sometimes this is all you want. That sometimes you want to be in an old school non-hipster/emo kind of place where people just come in jeans and a shirt and don't mind that 48 hour no shower stench. Where the drinks don't have to be $20 a shot and you can just be grimy with the rest. This is the place where you will run into your boys from way back but you may also see their mom or dad or that crazy uncle. Yeah, this is the place and if she is going to be with you she needs to know it. And you know what? If she is going to be a keeper she is going to love it. If she doesn't, tell her to kick rocks and catch her own lyft car!!!", 
    "review_date": "2015-01-03"
  }, 
  "oAz4s21FA2QjE0kCNIDxOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianne K.", 
    "review_text": "The Boom Boom Room is all that a blues club should be...dark, cloaked in red velvet, with free flowing booze. The live music is usually quite good, although the cover charge can be a little pricey. It's a great place to grab a drink before a show at The Fillmore...just show them your ticket, and they're waive the cover charge.", 
    "review_date": "2007-07-26"
  }, 
  "zT0PuDsIV-S7M-W_NaX9vw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "Good place for music.  Can be a little hot inside... just like the music :)", 
    "review_date": "2004-10-12"
  }, 
  "n9-TyBEe3wx7s5weR9vraw": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Marie S.", 
    "review_text": "Very San Francisco, need I say more?", 
    "review_date": "2012-04-23"
  }, 
  "yMygl5-DYugYcGbqitXw2w": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "David K.", 
    "review_text": "The Boom Boom Room is a rad music venue. It's in a fantastic location, just blocks from Japantown, The Fillmore, and Yoshis SF, and so easy to find, right on the corner of Geary and Fillmore. You can even walk directly into the Lower Haight if you don't mind a few hills and walking for 30-60 mins.  The bar has a very affordable daily happy hour with $3 draft beers and well drinks from 6-8pm. There is a strong selection of tasty beers on tap. There is no food served but there are delicious restaurants nearby in almost every direction and cuisine.  I must admit that I have only ever attended musical performances there if a friend's band has been playing. But after chatting with the bar manager, bartender and sound engineer, it is quiet clear that you will only ever hear skilled, talented and entertaining musicians at the Boom Boom Room. One band that I had the pleasure of listening to while there one Saturday night is RonKat Spearman's Katdelic. You have got to check them out.  I feel obliged to mention now my friend's band who you will likely see billed at Boom Boom in the future. Rubblebucket from Brooklyn, NY and The PiezoElectric Effect of Petaluma, CA.", 
    "review_date": "2011-01-09"
  }, 
  "g2oseja9mnTSA8Qq7GXqBg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Tim G.", 
    "review_text": "Cool little bar that gets GREAT acts.  Fairly easy to get a drink.  If it gets full it is a little hot but any minor faults like like the temperature are more than made up for by the smoking good bands.", 
    "review_date": "2005-07-10"
  }, 
  "0V4B8A4tNArJp8aqDYX4-Q": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Solomon S.", 
    "review_text": "Great little bar / music venue.  Good place to go before a show at the Fillmore.  You can get in for free if you have tickets to the Fillmore.", 
    "review_date": "2013-06-22"
  }, 
  "b8GIQtDZCEYIpSqNnaQqTQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ranjani S.", 
    "review_text": "Shady dive bar is okay.  Shady dive bar with a $15 cover charge is not.", 
    "review_date": "2012-02-26"
  }, 
  "QbTEh6bdSHIRmUKvAT2BYg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah B.", 
    "review_text": "This place would be totally awesome if it wasn't so expensive.  Cover of 5-20 bucks, 6 dollar beers, and a 20 dollar minimum for credit cards.  The music was great and it is a nice venue inside.... but it is pretty pricey.  There was one bartender working and the service was ok for me but every time my friends went up to get a drink she was busy chatting with people sitting at the bar.  I would love to support this place and I think it has a lot of potential.  It could be a great spot and would attract a lot more business if it didn't cost so much :(", 
    "review_date": "2009-11-11"
  }, 
  "CZ36wJqV-Xit758UaOr81A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Bruce C.", 
    "review_text": "Boom Boom Room is awesome. I'll make this short - GREAT live music, awesome crowd (mid 20s to early 30s), beautiful chicks who can really dance, decently priced drinks and the place is pretty big.   Only bummer is their $10 cover. Other than that, this place is totally my style. I love it. If you like to dance to a live band, you gotta check this place out. I've been several times and it's always been fun.", 
    "review_date": "2013-08-18"
  }, 
  "jW24T6R4_lSFUXQZEe2Jzg": {
    "user_rating": 4.0, 
    "user_location": "Russian Hill, San Francisco, CA", 
    "user_name": "Nick R.", 
    "review_text": "This place is a San Francisco staple especially in the Fillmore area. Boom Boom Room is a incredibly small spot but offers some of the most intimate performances you can imagine because of it. There is a constant and eclectic rotating list of live bands each weekend that range from rock to rap to edm to everything in between. You never know what you are going to get and you really have to be in the know to actually have heard of most of the people playing but that's a good thing.   What happens because of this is that you only get the diehard fans or people who actually appreciate the music and they are out to have a good time. A live performance can be made or unfortunately broken by the people around you and its hard to run into that here. The dark lighting and red lights bring you back to the dive bars from the 80's movies and sometimes the bouncers are in fedoras so even better.   The staff was really friendly when i was there, a lot of locals and BBR enthusiasts show up so it can feel like a family gathering at times. Had a drink on a random afternoon waiting for a friend and it was a pleasant experience and even the Friday and Saturday nights aren't too crazy.   A great alternative to the big names and headliners at the Fillmore down the street but not as mellow as the performances over at Yoshis. A great place to get up and get on your feet and put your arms around an odd SF local or two.", 
    "review_date": "2014-09-22"
  }, 
  "1xZflgh5eGuKGtg7PlhNRg": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Maureen O.", 
    "review_text": "FREE live music on Sunday nights?!?! And great music at that. No elevator tunes here folks. These musicians know how to rock 'n roll.   Happy Hour prices are unreal! I had three drinks and didn't break over $10. That's unheard of in many San Francisco bars.   Oh! And the bartenders are awesomely bad a$$.", 
    "review_date": "2009-11-18"
  }, 
  "5C9n2AJ-lft5eC1bTrl7Ig": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Tracy G.", 
    "review_text": "Great dive bar.  We were there for happy hour before our dinner reservations at State Bird Provisions.  The happy hour specials were cheap and though the beer selection on tap was modest there were some great beers.  Even when happy hour ended the beers were $6 for a pint which is pretty good. They were gearing up for live music which we unfortunately missed out on. After dinner we went to Bourbon and Branch and I wish we had come back to the Boom Boom Room instead.", 
    "review_date": "2014-06-20"
  }, 
  "1p4wP0QzgdWXWYnRSR7MBw": {
    "user_rating": 4.0, 
    "user_location": "Cagnes-sur-Mer, France", 
    "user_name": "Ed R.", 
    "review_text": "They always have great bands playing here from different parts of the country. Last time the Greasy Beats came all the way from Los Angeles, but the time before that was some hip hop group of people  from New York. The bar is long so you can just sit there and order one scotch, one bourbon, one beeeer.\n  The first time I came, I just couldn't find it, and popped into Maurice the hair dresser, who also had no idea where it was. But he did say, if you can't find no boom boom down there..her ha! So if you need some, see my main man Maurice, just up the street. Jeez, people are friendly in this town.", 
    "review_date": "2006-07-28"
  }, 
  "EMRSUY3hkSje0zUx5Z9Urg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Eileen H.", 
    "review_text": "Three stars only if you do not have to pay to get in when there are no bands playing. We presented our Fillmore tickets and they let us in free but were charging others. I think this only works prior to the start of the Filmore show.   The interior is really retro, really red, dimly lit and like a flashback of sorts with good music playing in the background.   The bartenders are fast and the drinks were fine.   Agree with all of the other comments about the guys at the door. Do they think they look and act cooler than me (hum the song in your head). Really.", 
    "review_date": "2010-11-09"
  }, 
  "XMvEGq01mJmrbDGl17EP9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arya S.", 
    "review_text": "Good drinks (sidecar) and great music ! Get dinner on Fillmore and walk over for a show ($15 cover)", 
    "review_date": "2014-05-30"
  }, 
  "WF1o6AyXm6-NovD5dFnMOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike K.", 
    "review_text": "The last game of the regular kickball season came to an end last night and the Mighty Yellow team made sure to take a well needed pit stop at the Boom Boom Room before the game.  Granted I was only here for a brief time, I enjoyed the vibe, the bartender was extremely friendly, and the place had nice seating for the time being. The happy hour deals are fantastic, and for that reason alone received an extra star to 4.  Plus, they go until 7:30, so stumble in late or early, and drop the change on the table.   You don't really want to spend that on laundry do you?", 
    "review_date": "2008-10-23"
  }, 
  "D4JHDISAtHlnaHf4jtvj8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie L.", 
    "review_text": "Came here for a show on a Thursday night and it was not a bad crowd. Not too packed, but definitely a good number of people. The cover was $10 cash. Plenty of restaurants to choose from in the area. The bathroom oddly gets really hazy from the stage sometimes. Kind of trippy. Credit card only for purchases of at least $20. Also, they do not allow backpacks. They also don't have anywhere to check it either. So be aware!", 
    "review_date": "2014-06-14"
  }, 
  "uMVyvdgxgGqWwx44QTEB-Q": {
    "user_rating": 4.0, 
    "user_location": "Turlock, CA", 
    "user_name": "Esmeralda G.", 
    "review_text": "It was a friendly and inviting atmosphere, came and watched a band with no name play great funk. Great experience, the only downfall is there flooring. They need better flooring... Aside from that, this place would have gotten five stars :)", 
    "review_date": "2014-06-16"
  }, 
  "1PLvmn-kHIkLeaUvIh6QXQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Edward Y.", 
    "review_text": "So I was in Japantown coming out of a Karaoke room because my roommate and his brother, both who are from out of town, were coming down to meet up with me on a Saturday night.   Me, being the native in San Francisco, had to play guide and think of a place to go.... typically, I would have just went back to the Karaoke room, but considering these are two white guys who are both over 6 feet tall -- I figured a tiny Karaoke room that was already packed with people wouldnt' have been the best idea. So I looked around and there was the Boom Boom Room and thought, why not...   And so, I walk over to the doorman, all pimped out with his zoot suit and brim hat, and find out that there's a $15 cover. I'm already kicking myself especially considering I have no idea what I am paying for. Okay, so I eat the cover and apologize to my guests, telling them I had no idea... Feeling guilty as hell, I buy a couple of rounds of drinks. Fortunately beers were cheap.   There was a jive band playing that night... they were actually very good. I appreciated the decor and dim ambiance. I also enjoyed that the people congregating by the stage weren't neccessarily dancing, but just rocking out to the music. It almost was like a small concert.   They also have candle lit tables with couches and chairs lined up on the side of the walls. Made me think this would make for a great place to take a date. On a side note, I also saw a guy rolling a blunt to the side on a table not having the least bit of concern, which illustrates the comfortable nature of the venue.   Overall, I'm grateful that I stumbled upon the Boom Boom Room... if any venue is representative of San Francisco, this is definately the place. Diverse crowds, great live music, a certain hipness but far from being pretentious, and of course, the smell of pot lingering in the air.", 
    "review_date": "2008-06-10"
  }, 
  "0tRJPLyfDJ-yUh1ZIJXH2w": {
    "user_rating": 1.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Edward A.", 
    "review_text": "If i could give zero stars i would. I DEFINITELY WILL NEVER RETURN NOR WILL I RECOMMEND THIS THIRSTY GREEDY ESTABLISHMENT TO ANYONE!  My girlfriend and I, along with my brother and cousin went to this place after outside lands this past weekend. It was saturday and they had a funk band playing seemed pretty cool. So we walk up to the front the bouncers who think theyre \"cool\" say $20. Fine $20 to hear live music sounds a bit high. Living in Los Angeles allows you to gauge nightlife vs other cities and this was no $20 worth show katdelic seriously, but fine, hey were on vacation. So we get in barely any people inside and its a small venue. The bar is basically at the entrance and though the entire bar has people along it no line was forming. Yet it took almost 30 min for my girlfriend to get acknowledged. Also overlooked for other people. When she finally got to ask the bar tender for a beer, boom boom room ale we heard we needed to drink, the bar tender said something that to me was desperate and thirsty and greedy. She said they were no longer selling beer. Only double shots of hard alcohol. What??? LMFAO!! Two people just before her walked away with beers. At this point we figured to let my cousin ask. Hes local he looks the part, nope! Same thing yet other people were getting beer. Now what idiot wants to drink double shots of anything and listen to funk? Just trying to enjoy some live music with a beer. One of two things could have happened here both with negative consequence to your business. First scenario. The bi**h bartender was being rude and did not like my girlfriend saw who we were with and told both her and my cousin double shots only. Two, they really were only serving double shots (far fetched because other people were purchasing beer). Either way we left. Directly after my cousin getting the same answer. The music was great but when a business acts thirsty and greedy its not really the establishment im trying to be in or associate myself with. I repeat If i could give zero stars i would. I DEFINITELY WILL NEVER RETURN NOR WILL I RECOMMEND THIS THIRSTY GREEDY ESTABLISHMENT TO ANYONE!   If only we could have ordered beers we probably would have ended up spending $100 each instead we end up spending $20 each at the door and going to another bar to spend more money, and realize how terrible an establishment it was. Sad!", 
    "review_date": "2014-08-13"
  }, 
  "BTzogObU2RFLCU56i8qdlQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura P.", 
    "review_text": "The boom boom room makes me happy.    Do you like live music? Do you like drinking? Do you like dancing?  Do you like staying out past two? Then the Boom Boom Room will make you happy too!!", 
    "review_date": "2011-09-02"
  }, 
  "NvgqhesWZQB23JPI5aedyA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack F.", 
    "review_text": "Worst Door Staff I have encountered at any club anywhere. I don't know anyone who hasn't had a negative experience with this crew. I recently came directly from work to catch a friends show. They wouldn't let me in with my messenger bag which contained my laptop. Don't even think about making this place your second destination unless you want to pay full price to catch an hour of music. It's a shame as I'm a huge John Lee Hooker fan and I love supporting Fillmore businesses. I won't be returning.", 
    "review_date": "2014-12-12"
  }, 
  "ighhuf3rAKgKI2E-o9WDXA": {
    "user_rating": 2.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Glenn H.", 
    "review_text": "WHAT??? I CAN'T _____ YOU! YOU ARE _____. COULD YOU TURN THE AMP DOWN??? I CAN'T TALK RIGHT NOW UNTIL the set (oh it's over).. OK now we can talk... Good, now _____ HOLY CRAP!!! NOW THEY ARE BLASTING A _____ CD DURING THE BREAK.   THAT'S IT ____ OUTTA HERE. BYE!!", 
    "review_date": "2011-08-07"
  }, 
  "hcKCRJ12EQwq3rQbhOprfA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jonny L.", 
    "review_text": "jazz and blues in a narrow red room.  billowing red velvet curtains drop down when the band is in intermission - david lynch would like", 
    "review_date": "2006-01-28"
  }, 
  "D6ErcUnFALnCQN4b1W_TlA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "If you like funk or funkiness or freakiness (music wise) or anything that sounds like that you'll really love this place.  I don't so I didn't.  But I gave it an extra star for the reasonably priced drinks, and extra star for the eclectic crowd, and an extra star for the contact high I got from the dude sitting next to us.", 
    "review_date": "2009-08-16"
  }, 
  "jnmczPEkhRsUFos_nBPjTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simone W.", 
    "review_text": "After a month waiting to be in the right mood to watch Black Swan, I finally went yesterday at the Kabuki. So glad I waited - the movie is REALLY intense! I left with that 'I need a drink' feeling, and my friend and I were heading to his place nearby when we walked by the Boom Boom Room and when we heard the music we were literally lured into the place!  It was 5 o'clock on a Sunday, which meant no cover and happy-hour drinks. A beer and a glass of Merlot for $7! Great live music! Plenty of seats and room to dance! Met Zander, the owner, who was very friendly and fun! Could not get better than that!  I'm now looking forward to exploring BBR on different days and check out different bands! Movie and live music - no better way to spend a rainy afternoon in SF! :-)", 
    "review_date": "2011-03-14"
  }, 
  "NQ0REATs1_MehrNtnCaV2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela B.", 
    "review_text": "Another cute, cozy little live music venue.  Inside it's built railroad-style, with booths along one wall, the bar along the other, and the stage at the far end.  I love the dim lighting (which adds to the vibe of cool funkiness), and the miniature dance floor in front of the stage is classic.  Apparently the booze selection used to be better, but it was still alright when I was there last weekend (both Guinness and Red Hook were available), and you could still get a $4 pint (as in a -real- pint, in a -real- pint glass.  'ja catch that, Bimbo's?????).  Also, the bartenders working that night were the kindest, friendliest, most helpful bartenders I think I've ever encountered.  One of them looked genuinely pained when he told me that they didn't have the beer I asked for.  Sound was fine; I don't remember it being particularly great or poor.  As an avid supporter of live music, I'd definitely go back for a band I was excited to see, but I do have to say that $20 seems a bit excessive for a place where the crowd probably doesn't break 100 people.  Other than that, a great time &amp; a great venue. :)", 
    "review_date": "2009-07-16"
  }, 
  "Mq8Su0PZC8D4EaJrLJOhYw": {
    "user_rating": 3.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Heather Z.", 
    "review_text": "Free live music on Sunday night was the draw - we love Jazz and the description of the music and the club sounded good.  It was a great joint, with red walls and comfortable seating - the bartender was delightful and really sweet. He made a great drink and I suspect the prices were fine...although I didn't pay - so I don't really know. The band was just ok.  I read up on the band (SNAKE PLISSKEN QUINTET) and it looked like they were going to be a lot of fun.  It turns out that they were just a Trio and had a guest singer...which was fine, but not what we were expecting. Overall, worth coming back...very neat space and fun crowd.", 
    "review_date": "2010-08-02"
  }, 
  "4qsVIa8wP0EDk86VogIs1Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn T.", 
    "review_text": "I used to love the place; great music, great scene...   In the past year or so, the bands that have been booked to play there are definitely sub-par and the drinks incredibly mediocre. I once had to return a martini THREE TIMES as they were putting in something sweet!", 
    "review_date": "2007-03-21"
  }, 
  "GKYUu0Qi6_Wnqv0CHAg0Cg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawna Q.", 
    "review_text": "Good venue if the band is worth it, but once you factor in the terrible a-hole doormen and the pricey drinks from mediocre bartenders it kind of destroys the good time. Might be back if a friends band plays again, but even then I'll have to think twice.", 
    "review_date": "2010-10-31"
  }, 
  "fvPmgRm0qBs8gJHceqCduA": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Jahan T.", 
    "review_text": "The place oozes with the smell of spilt beer and whiskey. I wish there was a cologne or deo like that because I would buy it (Essence de Boom Boom). The place itself is kind of a cinder block trailer with a bar on the right and a stage at the end. But it's really a magical trailer. No dancing bears or elephants in the band but sweet music coming off of that tiny stage. It's a throw back to an older Fillmore. Less pretension more passion and focus on music. It can get really hot and stuffy in there sometimes but you gotta 1. Suck it up and take in the music or 2. Take your frumpy, picky behind elsewhere. The drinks are rather cheap. Well, at least not close to the extortion prices encountered in other venues. When I was a kid the boom boom room referred to a very different kind of boom boom. They take care of the music boom boom here and leave the rest up to you.", 
    "review_date": "2014-08-23"
  }, 
  "olEYaQziRperfA9b5HhOuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hillary S.", 
    "review_text": "Great club, unfortunately, I have to remove stars because the bartenders are slow and condescending.  They apparently don't understand quick service with a smile gets them bigger tips.    It's a shame because other wise this place is worth a trip.", 
    "review_date": "2012-10-02"
  }, 
  "O_L3nw57ccPpovGlYFOKLw": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Art O.", 
    "review_text": "THIS PLACE IS AWFUL!!!!  THE ABSOLUTE WORST EXPERIENCE I'VE HAD AT ANY CLUB OR RESTAURANT IN SF.  It's a tiny, poorly ventilated, smelly hole in the wall with a sticky floor.    I went to the manager for help and he was not in the least bit interested in customer satisfaction.  A short, bald,condescending man wearing a 3-piece suit that I think made him feel important.  (If you're reading this, until you learn to tie a tie, it just makes you look like a fool.)  The management could not care less about their own customers.  You can do much better at any other club!!!  Or just staying home.", 
    "review_date": "2014-06-22"
  }, 
  "E-ws0CUwkAYlv5JEfRr9mA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay S.", 
    "review_text": "My life has changed since I started to hang out at The Boom Boom Room. It's one of my favorite places to have a pre or a post party. Meeting some friends for drinks this evening? Nothing better to start your evening with a chilled Boom Boom Ale. A fantastic old school jukebox will keep you eyes glued to the screen - but you may not be able to hear the tunes, coz it's got a mind of it's own. Usually the bands will start around 10PM and they have live music Tuesday thru Sunday. Sometimes a sea of people will just walk in from The Fillmore next door - whoa flash mob party! If you got the blues, come to the boom boom! And if your party ended early, like midnight, there is no better place to go grab a drink and get your groove on than the Boom Boom.  Very hip and young crowd - excellent place for live jazz, blues and funk. You will always see me there ;)", 
    "review_date": "2008-06-24"
  }, 
  "_c50WkYV9C2XieD8blXBUA": {
    "user_rating": 3.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Rebecca D.", 
    "review_text": "This place was pretty cool, live band, interesting people and reasonably priced drinks.  Though the music was not my type of music, I can appreciate the fact that the band was talented and well liked due to the crowd participation.  I definitely recommend this place to anyone who loves blues and funk!", 
    "review_date": "2009-08-17"
  }, 
  "jIyAOAsmNjGScVj-2bwUGg": {
    "user_rating": 4.0, 
    "user_location": "Westminster, CA", 
    "user_name": "Luisa S.", 
    "review_text": "Cool spot in SF. Great live music. Great vibe. Average selection of drinks. Will go back when in SF again.", 
    "review_date": "2014-05-24"
  }, 
  "eu19K9KfnvvubzWuv4l6Wg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lauren F.", 
    "review_text": "Booty-shakin', earth-quakin', heart-thumpin', bass-bumpin'......that's what goes on at the Boom Boom Room.   Thigh-rubbin', lip-smackin', drink-swiggin', pre-gamin'...that's what goes on at the Boom Boom Room.  So much good music, fun, feel good funky music in such a cozy venue.  Free before 10 with a ticket to the Fillmore, this is a great place to start your evening....and there is usually music late night, so you might as well end your evening there too.  Definitely a hidden treasure in a neighborhood with a bad reputation.", 
    "review_date": "2007-04-23"
  }, 
  "5Kdb0ciGON6EHNUeFmrjEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay A.", 
    "review_text": "i love the boom boom.  i used to live near it and would roll solo on a random weeknight and never be disappointed with the band (or the crowd or even the staff for that matter).  ok, i do have one complaint.  i still to this day have never been allowed the privilege of sitting in mr. hooker's perfectly situated round booth.  it looks oh so perfect for a party of 4 or so.  but then again i've never seen anyone else in it either...", 
    "review_date": "2005-05-19"
  }, 
  "XhCk6GU4Lf9xicTS9a4wVA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny S.", 
    "review_text": "On Saturday night I went to the Boom Boom Room to see Chum. I took a $20 cab there as I knew I'd be drinking. When I arrived, I was greeted by one of the largest egos I've ever encountered working the door. I was wearing a novelty yoda backpack and was advised there was a no backpack policy in a very rude manner as I was trying to pay the $15 cover. I explained it was my purse and I'd be happy to show him the 4 contents inside it as I had just paid $20 to get there and was meeting a group of friends out. He replied, \"no backpacks\". I understand the concept behind that rule, but my \"backpack\" was literally smaller than most  women's purses and I offered to check my bag, at which time I was advised, \"no backpacks\". Just then my 2 friends arrived, at which time the 3 of us left and went to another establishment and each spent the $100 we were going to spend elsewhere. This establishment used to be one of my favorite bars in the city! Until the boom boom room invests in a new doorman with less of an ego, my friends and I will be spending our money elsewhere.", 
    "review_date": "2014-08-26"
  }, 
  "1W86dgJ8g-CS1j9wMQ66HQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha I.", 
    "review_text": "This place is so effing amazing! Cant believe I havent posted a review yet. So they have live music which rocks and have a little dance floor to get your groove on. Gets super crowded as the night progresses, you get in for free before 9. If you like soulful music and jazz then go! This place is a rare gem and wont disappoint!", 
    "review_date": "2011-07-08"
  }, 
  "eNn5YANO-vSxSlVjs34Ivg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin Q.", 
    "review_text": "So, i'm picky w/ venues and this one squeaks by in my approval book.  Im not running to the doors, but don't get too amped to see my favorite acts there.  Sound is good enough, but no Independent.  Drinks are fair enough, w/ average bar service.  Covers can be a little high, but normally for a long ass show.  Sometimes a great place to hit up after a fun night at the Fillmore, as well.", 
    "review_date": "2007-01-05"
  }, 
  "Er0hnraJKQ8qpWOHg_iYVA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Todd E.", 
    "review_text": "Good place to see a show just DON'T bring any sort of bag unless you want a f@%king huge hassle when you get to the door. Oh and don't count on being able to use your CC either - cash is king at the BBR...", 
    "review_date": "2006-07-14"
  }, 
  "n04Uh_28nFGskcDHoeGUrQ": {
    "user_rating": 3.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Mari E.", 
    "review_text": "While I enjoyed the energy and music of the Boom Boom Room on New Year's Eve, I have a few bones to pick:  Although the venue's site said the cost was $40 in advance, once I connected online, I was charged $50. I called the Boom Boom Room the day before and spoke with the manager who said he would give me free drink coupons when I arrived. He refused to and pretended he did not remember the call. All and all, I am out an additional $20.  In addition, I did not see one exchange of money as the door, which led me to believe that many people did not have to pay depending upon what time they arrived.  The whole payment system does not sit well with me.", 
    "review_date": "2013-01-03"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "As much as I've always loved the Boom Boom room, I was disappointed that they showed their true colors at the Fillmore Jazz Festival this weekend.  At most a two-count on the drinks (I was a bartender for many years. When we asked them to re do it or top it off they said, it tastes like that because it is so big. kind of insulting).  That's like getting a $10 drink at Cat Club on a Thursday night before 10 PM.  just wrong.  To be fair, one bartender was nice enough to give my better half a top for both our drinks (but was immediately chastised by the other bartender).  Disappointing after the amount of money we've spend here over the years.  Not sure if I'll return after all these years.  we'll see.", 
    "review_date": "2012-07-09"
  }, 
  "aG4WUZzOX0oT31fw7HzwEg": {
    "user_rating": 5.0, 
    "user_location": "Boulder Creek, CA", 
    "user_name": "larry n.", 
    "review_text": "I love the Boom Boom! Alex -  the owner of the place,  is to be commended for bringing the REAL music from New Orleans to SF! Great acts bring the A game to this place, and some serious music fans come to groove and boogie hard. Musicians know that this gig is one where ya have to do it - and they usually do.  The staff there are always really nice to us when we're there.  It gets seriously hot on the dance floor - but that adds to the fun.  Its a great no-attitude place. Highly recommended", 
    "review_date": "2007-08-19"
  }, 
  "WtRwwfPkoqoJ5GlyUVoE_g": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Sharmaine I.", 
    "review_text": "My sister and I went there randomly one night and Ron Kat was playing. Enough said! He reminded me of Prince. Thank you Jesus!", 
    "review_date": "2008-08-23"
  }, 
  "r4IuUsNnZOeklVaph9SGvA": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Alison P.", 
    "review_text": "I'm ashamed that I've been living in SF for 6+ years now and I'd never stepped foot in the Boom Boom Room until last night.  I met up with a friend for a drink before heading over to see Mutemath at the Fillmore. And I'll be going back to spend an evening here!  The red vinyl, the swinging jazz, the stage and the dancefloor! I'm intrigued. And the drinks were cheap!", 
    "review_date": "2007-09-26"
  }, 
  "3c3w_jRC2PwrA2MmC7ChGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gopal R.", 
    "review_text": "I've never actually been here to see a show before, so I can't comment on the nightclub environment here.  Instead, I come here a couple of times a month during the happy hours to grab a few quick drinks and then be on my way.  It's kind of a hidden gem in that regard.    There's never more than a handful of people there, and the drinks are suitably cheap.  Although it seems like the jukebox is always on the fritz, the bartenders usually have good enough taste in music that one of their ipods plugged into the PA is an adequate substitute.    The atmosphere is very laid back and friendly, and it's easy to strike up a conversation with whomever is sitting next to you at the bar.  Since it seems to draw a musically-oriented crowd, music is a pretty good bet as a starter topic.  There are no tvs inside, so you can't watch the game or whatever, but that just puts the focus back on the people around you.    The Boom Boom Room is a brilliant, quiet alternative to the noisier, more polished \"watering hole\" establishments elsewhere in the neighborhood, especially during that crucial 5pm to 8pm window of opportunity.", 
    "review_date": "2011-06-16"
  }
}