{
  "ZSqnjq27leLjE4Pc456K8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ring Leader D.", 
    "review_text": "Arrive early for a seat in the window!  Especially now that the weather is lovely and the place has become popular.", 
    "review_date": "2014-03-11"
  }, 
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "It's hard to believe that quite some years ago, this area was kind of sketch.  Parking here might not have been recommended due to probable break ins or theft.  Fast forward to 2013 and now, Hayes Valley is a great place to go to enjoy the outdoor urban market on a warm day and the biergarten with friends on a chilly fall night.  Brass Tacks is what I feel fits the area currently.  There are friendly and informative bartenders, a list of cocktails with interesting names (The Spanish Prisoner, for instance) and a relatively lively crowd.  Signage is subtle on the exterior and interior, the decor is not elaborate.  Awesome place to stop for a drink, although, it can be relatively pricey.", 
    "review_date": "2013-11-10"
  }, 
  "SfXganVorr4cS-S0YHZNGQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe N.", 
    "review_text": "This place use to be a Gay bar; now it is full of breeders..ugh...", 
    "review_date": "2014-01-17"
  }, 
  "xBMIbeR67WMglP_W4WQPHA": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "James M.", 
    "review_text": "I frequented Brass Tacks in the late evenings for a few months earlier this year and loved it. Particularly their drink \"the Conversation\", a twist on an Old Fashioned.   Working on a project in Hayes the past month has brought be back to the area and I must say it's still my favorite bar in the neighborhood and I've tried them all lol. I went in recently for an early afternoon drink around 4pm and I loved the mellow vibe of the afternoon crowd.   The bottom line, the bartenders are unique and friendly, the drinks have character and the ambiance and decor are fun. The location is great, well it's in Hayes, so of course it is.   Just a tip, It can get a bit crowded on Friday and Saturday evenings and seating can be hard to come by.", 
    "review_date": "2014-09-26"
  }, 
  "PW3JaaJ7DK8gUk2J4WqHXw": {
    "user_rating": 5.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Lauren F.", 
    "review_text": "I loved the drinks! Everything was very reasonably priced. They allowed our dog Inside and they had treats for him! By far our favorite bar we went too. The bartenders were super sweet! Good place to watch the world cup. Loved the beetlejuice drink! If we ever visit San Francisco again. This would definitely be the place to go!", 
    "review_date": "2014-07-06"
  }, 
  "4Qq0NK-Ytp47_aOEdcTQCw": {
    "user_rating": 5.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Daniel R.", 
    "review_text": "Delicious finely crafted cocktails. Very friendly service in a great location. Small, charming bar.", 
    "review_date": "2014-05-13"
  }, 
  "wKCbOAoqei9IQYE44SDWbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tinkerbell e.", 
    "review_text": "love this place.  great drinks. i was little shy about the conversation cocktail because of the root beer syrup but it was perfectly balanced, just sweet enough. plus, metallica playing in the background.  i'm sold.", 
    "review_date": "2013-07-18"
  }, 
  "5jLkKtE4HPlrbjw-0w9lvg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon T.", 
    "review_text": "Good neighborhood bar with a pretty diverse selection of draft and bottled beer. I was pleasantly surprised to see Hitachino's White mixing company with Dogfish 90 minute IPA. Of course, these guys are on the pricy side but you can also get some Stone IPA for just $5.  Haven't been on a weekend, but it was a relaxed atmosphere on a weeknight. If you're looking for something low key, where you can nurse your beer for a while, check this place out.", 
    "review_date": "2014-06-24"
  }, 
  "j0huDycECykRSXpe2i_6_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Latte Queen W.", 
    "review_text": "Great ambience, fun crowd, not too loud, and I had an einstok beer for the first time - yummy.  Can't wait to go back!", 
    "review_date": "2014-04-15"
  }, 
  "ggq0Y8vjYhXtM1Y9--tBsQ": {
    "user_rating": 1.0, 
    "user_location": "Oslo, Norway", 
    "user_name": "Ann L.", 
    "review_text": "BEWARE - One of the bartenders wrote/self entered in a tip on my bill! I know for a fact because I was with a friend, who paid for the tip in cash, while I paid the bill with my card - $35. I usually write in the tip if I do... Anyway, my billing statement says they charged me $40. I tried to call, but there is no bar number, left a message on the website, and no response. Really loved this bar but they definitely will never see me there again!!", 
    "review_date": "2014-08-27"
  }, 
  "BdWtanx8M38CzsUOHVYiow": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Juan T. K.", 
    "review_text": "Great place to have a drink after work before hitting the road for dinner elsewhere in Hayes Valley. Amazing decor &amp; a very trendy crowd to enjoy a delicious cocktails and great beer (served in mason jars). I'll definitely be back!", 
    "review_date": "2014-11-07"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kim N.", 
    "review_text": "I came here for a business meeting. On a Sunday. On a holiday weekend. Weird right? This place was hopping at 4.30 in the afternoon. Everyone was crowded up at the bar area and clamoring for the sunlight that was coming through. So we moved to the back corner where there was lounge seating and plenty of space. As time moved on that got crowded too. Guess I BRING THE PARTAY. bit smaller than I expected as I like the larger space of Churchill that one of the other folks is key in a hear. Ill definitely have to come during a later night where Im not working and imbibe on the many cocktails.", 
    "review_date": "2013-09-03"
  }, 
  "YsmpZbsJAWRT0jZOzhJeLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madeline S.", 
    "review_text": "I got a summer ale here with a friend. I liked the atmosphere and the weather was a lovely 70 degrees and they had the big window at the front open, which created that kind of half inside, half outside feel. Lots of beers on tap and it looked like they were churning out some fancy cocktails.", 
    "review_date": "2014-07-23"
  }, 
  "fpYIJYF0nqOAYtuz5zZPfg": {
    "user_rating": 3.0, 
    "user_location": "Saint Louis, MO", 
    "user_name": "Karen D.", 
    "review_text": "Tried the Stray Dog, which was yummy. $20 minimum on cards. Bar was packed Saturday night, there was more room in the back. The couches in the back were comfty. Nice place to go and have bar conversations and good cocktails.", 
    "review_date": "2014-11-16"
  }, 
  "pNgf2LA8nWRb1r3BBvycfw": {
    "user_rating": 5.0, 
    "user_location": "Tujunga, CA", 
    "user_name": "Waldo A.", 
    "review_text": "Cool place, good music crowd is very diverse. Bartenders are on it!!! Their Moscow mule is really good. Cocktail list is top notch. Check it out I recommend it", 
    "review_date": "2014-08-23"
  }, 
  "VQg9XjClANxWlmipr2FKXQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel J.", 
    "review_text": "Nice remodel, good vibe. However, drinks were mediocre I thought... tried 3 different drinks, all a bit overkill. I'd come back here for location and the space, but will stick to beer.", 
    "review_date": "2013-07-22"
  }, 
  "iUWwwEbgdJqxu-QB64vZZw": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Kara B.", 
    "review_text": "Wow! What a great place with a very mingling ambiance. Perfect for the solo business traveler! I'm happy to have met the friendly bartender Kenny who made my night by offering excellent customer service. He always made sure my drink was full and most importantly, that I was happy! I will be back!", 
    "review_date": "2014-04-15"
  }, 
  "qszQgxRnzpSZ2JzrkwvyHQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chippy J.", 
    "review_text": "The worst service I have ever experienced in sf. Rude beyond belief . Sunday 12/29 ass holes. I am so angry that this bullshit bar is now in my neighborhood", 
    "review_date": "2013-12-29"
  }, 
  "SlOYouMBBqfbPFKBLEPYwQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex B.", 
    "review_text": "All was fine (good drinks - good service - good atmosphere) until one of the bartenders decided that the place was too crowded and took my seat away. Literally. She picked it up - declared the location a fire hazard - and walked off with it. We were five drinking adults (with four seats) in an overcrowded bar (see all other reviews - they all remind you that the place is crowded) with two credit cards at the bar. No apologies as I asked for it back - no effort to make it up to us. Just a cold hard stare as she walked away.... Last time I go back until/unless they track me down and apologize. I'll let you know.", 
    "review_date": "2015-01-18"
  }, 
  "wVv8-yw8wlzDyYJMDEXFVw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elise G.", 
    "review_text": "This was a nice, sunny bar in the heart of Hayes Valley.  They cocktails were balanced and didn't even taste like alcohol even though there was quite a bit of booze in them.  I really liked the Beetlejuice and the Corpse Reviver 2 w/ Elderflower instead of Lillette Blanc.    The bartender definitely made the experience.  When my boyfriend asked him what he recommended, he said \"Give me a spirit and a feeling.\" Meaning, name a type of alcohol and a feeling you want to have.  Then he whipped something up.  I thought that was a cool way of asking for inspiration.    There's no food served here, just nuts and soft pretzels, which I didn't try.", 
    "review_date": "2014-05-12"
  }, 
  "NV5w7OBb1rjkH5rz2QZiRw": {
    "user_rating": 3.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Tyler I.", 
    "review_text": "Does anyone know if this place has a phone number??", 
    "review_date": "2013-08-04"
  }, 
  "_5iERzFtGDzXOMIB2nHgzQ": {
    "user_rating": 5.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Danilo D.", 
    "review_text": "Great Cocktails ,   I had the Best time with my girl there ,  the bartenders now what they are doing , he made  me amazing drinks for me and my girl all night long , even some drinks that was not on the menu , the bar is super cool , amazing selection and  beautiful people ! i love the fact they have  a huge windown for the street ,  if you wamt have fun in Hayes Valley , that is the place to be.   THE DRINKS WAS AMAZING , FUCKING AMAZING !", 
    "review_date": "2013-07-15"
  }, 
  "mW8fvDQ3JAtzeLjU--CjTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rowena L.", 
    "review_text": "Stopped by here for drinks on a late Sunday afternoon. Chill place, well-mixed drinks, nice staff.", 
    "review_date": "2013-10-04"
  }, 
  "vgwlObHPmw6ahvdVg3UWDQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Omar M.", 
    "review_text": "I came to this bar for my 21st birthday before heading to a dance club. First off, the drinks I tried were exceptionally good! I had the Beetlejuice which I really really liked, I then went to the bar and asked the bartender some of the flavors I liked and he made me a perfect drink. I wasn't sure what was in it but it's been one of my favorite drinks I've ever had. The only reason I'm giving it 4 stars is because the vibe was a bit  quiet for me.", 
    "review_date": "2014-08-04"
  }, 
  "Hc1VOdWgLIZ4ZeK83iGM_Q": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Anna H.", 
    "review_text": "Made a pit stop here before heading over to Izakaya Rintaro in Mission.   Came here a little bit after Christmas time and the place was packed, like literally PACKED, with little Santas... EVERYWHERE. It was cool and creepy at the same time.  I personally didn't get a drink here at the time since drinking before getting food in my stomach seemed like a bad idea ( I had hot cheetos for lunch).   The place is cozy, dimly lit and had a super nice ambiance to it. I'd say it's a nice place to bring a date or even just hangout with a couple friends. The noise level is about moderate but don't expect to get rowdy here. Drink menu is no Yardhouse menu but it has a decent amount or craft beers and cocktails.   I will probably come back here when I want to grab a cocktail or two... and also when I have more than just hot cheetos in my stomach.", 
    "review_date": "2015-01-05"
  }, 
  "mrboqP-THCOu-EJn-1ugPA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tristan J.", 
    "review_text": "I live nearby and last time I was in here the owner/manager/whoever accused me of paying with a fake $50 bill on a previous visit.  Since I'm in the neighborhood, and very easy to recognize, I have no doubt they remembered who I was, but their story just didn't make sense.   I get my money out of ATMs, I never see a $50 bill, real or fake. He claimed 3 bartenders confirmed it was me who had paid with the fake bill.  This is highly suspect because: if they had noticed a fake, why wouldn't they have confronted me then?  It they hadn't noticed it, how would 3 people be able to confirm it was me?  As someone who goes out a lot, I'm at neighborhood bars all the time, it wouldn't really make sense for me to rip off a place that I frequent and that will surely recognize me.  And even if I did, there would be plenty of easier ways to do so: run up a huge tab and not pay, swipe unattended drinks, bring in a flask, etc.   After explaining all this, he still didn't believe me so I asked him what he wanted.  Did he want me to leave and never come back? No.  Did he want me to give him $50?  No.  So basically from what I can gather he just wanted to accuse me of robbing him, just to piss off a regular customer.  Great.  A+  Way to go.", 
    "review_date": "2014-05-16"
  }, 
  "xEcypZjKtPunciKULJeAFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nader F.", 
    "review_text": "All the cocktails are very delicious and the bartenders are extremely friendly.  I can't think of a better way to describe this, but the decor feels like a Justin Timberlake album cover.", 
    "review_date": "2013-07-22"
  }, 
  "HaBr4yTlzaX7Xn8BceHThQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michelle K.", 
    "review_text": "Good drinks, always packed. There is a $20 minimum on credit cards but I guess that is how most bars are these days.   This is a great place to grab a drink before going out to your destination or a good place to just drop in if you need a drink. Haven't ever spent more than an hour or so there. It can get a little claustrophobic.   Bartenders know how to make a drink that will please any palate so if you are having trouble deciding what to get, they can help you out. That being said, their menu always has great inventive cocktails made with unusual but tasty ingredients.", 
    "review_date": "2015-01-22"
  }, 
  "nJL027TRSHLfBHHLw024rA": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Desirae E.", 
    "review_text": "Nice bar. Great place to watch a game - they have 3 TVs. I came to watch the World Cup and they have lots of enthusiasm - even flags for all of the countries are hanging on the wall.   They also have the spiciest Bloody Mary I've ever had. There are definitely minced peppers in it.   I'll be coming back for sure!", 
    "review_date": "2014-06-28"
  }, 
  "97YdD8tkMkUSvGUw6_u4GQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca C.", 
    "review_text": "Cute spot, very central, friendly staff. A good mixed crowd all around. The prosecco was so so, but I had the old cuban here and it was solid.  The decor was very unusual, done with a sense of humor. Tens of small santas (with occasionally bigger ones standing ones) in different forms adorn various parts of the glass lineups, overwhelming one in terms form and number. This was during the holiday times. The owners here definitely has a unique sense of humor.", 
    "review_date": "2014-01-11"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "The \"basic facts\" are this: it's the party of Hayes. Window seats are best.", 
    "review_date": "2014-08-01"
  }, 
  "OFi92Xc2QyIr787GNKtgZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "While some people bemoan the loss of Marlena's, it's better to look forward and give the team behind Brass Tacks a big thumbs up in turning a less approachable bar in Hayes into a popular spot on any night. The bartenders are friendly, the owner is always around helping out or chilling, I think it's always a good time to catch a drink at Brass Tacks.   Drinks are priced right, thus placing Brass Tacks in the same competing neighborhood bar category as Place Pigalle down the block. Although Pigalle boasts a better craft beer selection, Brass Tacks has all the liquor options &amp; cocktail concoctions. But I'm all for having more libation options in Hayes, every bar has their purpose!  Get the window seats if you come by daytime, you get a direct view of Patricia's Green to people watch while the sun is shining in. You can plan your next move from here, whether to get some ice cream from Smitten, or perhaps a healthy juice from Juice Shop, or onwards to Biergarten for some more day drinking!  That glass chandelier centerpiece is pretty badass too.", 
    "review_date": "2014-02-04"
  }, 
  "hRAOd1EE5dhHOUMzhhAGYw": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Duke D.", 
    "review_text": "I came here for the first time last week and forgot to post about it but brass tacks is a great spot with tasty balanced cocktails and a good local bar feel, the bar staff was friendly and knows their stuff about all the spirits behind the bar(and there's a lot of them)     That's why I'm giving them 5 stars Knowledgeable   Friendly  Reasonably priced   This place has it all!", 
    "review_date": "2014-02-13"
  }, 
  "FysDiqCS1fxxwC9PLHNqNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victoria E.", 
    "review_text": "\"Beetlejuice, pre opened bar tab, good vibe, hipster crew, I maybe here for a while.\" I wrote it when I checked in on Yelp. I did. It was a nice bar. Really great for happy hour with the colleagues. We are a valley company with many people living in the city. It is a great company, mind you, but commute is a bit of a pain. That said, meeting colleagues after work in the Hayes was fun, in particular, this bar, was a great find. Drinks were good. Space was open. And staff was friendly. It's a bit of a young crowd, but I have no problem pretending that I was still in my 20s. While drinking a cocktail, my colleague, the engineer was showing me the new app his team was building. Then, my other colleague and I chatted about France. Two young marketing gals showed up for more drinks. Yep, it's a quintessential San Francisco tech heavy scene. We are in the middle of a gold rush. I remembered the last boom like it was yesterday. I told my colleagues \"Back in the day, I'd come here on dates, buy one of kind clothing, and feeling hip. Then we'd all hang out in North Beach for late night (drinking) activities and for the morning after, Bloody Mary served in any number of restaurants in the Marina. That, of course was before those areas went on to become full on touristy and stuffy.\" They looked at me like I was some eight-headed *ancient* creature. Hayes Valley was hip once, yes, like it was the Mission. Now Hayes Valley has become fully yuppified, overrun by French tourists.  Youth is the most valuable currency of all, and yet youth is wasted on the young. Perhaps if I hang out at this bar long enough, I'd come to appreciate what I have learned, and be thankful that I still look relatively youthful.", 
    "review_date": "2014-08-16"
  }, 
  "wCPkiI4PuHrv5dQif6gDvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ladybird G.", 
    "review_text": "Great chill bar in Hayes Valley...lots of good choices to choose from. The beer selection was a hit. Anywhere that has Stone IPA on tap is a bonus for me. The bartenders were super nice as well. All around this is a great spot to drop in for a drink!", 
    "review_date": "2013-12-30"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "A nice bar that doesn't take too long to get drinks even when it's crowded. The layout is like a hammer -- narrow through the handle with a couple tables in the back.  I recommend against coming here with more than a few of your people.  Edit: oh yeah they have a bunch of tasteful cocktails. Fun place to go with a date -- you can play the naming game.", 
    "review_date": "2014-04-01"
  }, 
  "GnkhVQoyUgFtnpBE_gnk3g": {
    "user_rating": 5.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Alyssa Y.", 
    "review_text": "The only place to go for a night out in Hayes Valley. Delicious cocktails (Pale Rider's my favorite), super friendly bartenders, good looking crowd. There's a reason it's always crowded, even on random weekday nights.  Don't come here if you're looking for a chill place to lounge around and have intimate conversations (that's what Place Pigalle's there for). Do come if you want a lively, drunken night with strong drinks.", 
    "review_date": "2015-01-23"
  }, 
  "gOEp68WaNgv1FqWT6TAXtg": {
    "user_rating": 5.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Jeremy G.", 
    "review_text": "It is well known in these parts that Brass Tacks is my headquarters. It has the distinct honor of being my favorite bar in San Francisco. Their dark &amp; stormy is an indispensable part of my Sunday. They stay open late. The people who drink here mingle and talk to each other. There's a pulse here unlike so many of the dull joints that Brass Tacks towers over.", 
    "review_date": "2014-10-12"
  }, 
  "8v9VXZ9bHUKJU_g_Jj3L1A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Great location, excellent and attentive bartenders, a bit on the pricer side for cocktails, but great selection nonetheless.   Why the low rating you ask? The 'bouncer' on the night of August 2, 2014. I walked into the bar while he was out on the curb puffing on his e-cigarette. Yells \"Hey KID\" and demands my ID. In shock I fumble with my wallet and accidentally drop it. Keep in mind I had no drinks at this point and had just come from smitten across the street and was in a pretty good mood. He then proceeds to tell me to take a big breath (in front of all of my friends) and completely humiliates me. Calling me kid, assuming I'm intoxicated, and generally just giving bad vibes.  Despite the location and selection, as long as this faux-hipster bearded vaping loser is bouncing here, I won't be back.   Note to management: don't hire douchebags as bouncers. Sorry not sorry.", 
    "review_date": "2014-08-03"
  }, 
  "C7Xn8onmuYmIIsTJUjA1lA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan V.", 
    "review_text": "Place is cool inside. Nowhere to really relax.  It's either standing room or tight bar stools.  Very small.   There's other places that offer better lounging environment  in Hayes valley.", 
    "review_date": "2014-12-08"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "Interesting cocktails and nice service, dark ambiance and decent prices. A good place to count on for drinks if you're in the area, but you probably won't find a place to sit.", 
    "review_date": "2014-01-02"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "You know what Brass Tacks does that I wish ALL bars did?  They print the APV next to each beer.  This is incredibly helpful in helping customers make smart decisions to avoid hangovers.  I mean, of course, other customers... this never happens to me.", 
    "review_date": "2014-03-03"
  }, 
  "O4wQaUeLxZDbUCCCvZ-5Dw": {
    "user_rating": 3.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "Nik K.", 
    "review_text": "I probably need to go back to try the cocktails, but there a decent selection of unique beers available here ranging from $3 standard beers to $10 beers that are a bit more interesting.", 
    "review_date": "2014-06-11"
  }, 
  "GrktSJ7Bv9t37gwDLIlAwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "I'm very happy about a new bar in Hayes Valley, owned by someone who is also responsible for Churchill. There's a lot of similarities between the two, starting with the hip/trendy/industrial/wood/metal/leather lounge look. You know, like the place where you'd go sporting a smart mustache and raw denim jeans that's cuffed. Another similarity are the serious cocktails. The drinks are pretty strong and dressed up with fancy ingredients. I found it to be a learning experience. I had Her Majesty's Secret Service, which was strong and woody. It was similar to an Old Fashioned, but with more to it. I also tried the To Wong Foo and also learned the reference. It was sweet and strong. Any drink with grapefruit flavor is good in my book. I tried the Valley Club with gin and it tasted summery and sweet as well. There was also something called Knife in the Water, which was no cocktail I've ever seen. I forget what was in it, probably an apertif, but it was served in a tiny stemmed glass and looked like a solid amethyst crystal. The Hella Berry Rum Punch was okay. It had a generous amount of berries in it, but it didn't seem all that well mixed. Some berries were added in the end for garnish rather than flavor. The beers on tap were nothing new to me, except the Bockor Cuvee des Jacobins Rouge. It was a Belgian sour beer served in a very small glass. It tasted like liquid dried cherries. The draft Racer 15 and canned Oskar Blues Pale Ale was a favorite among my group. Bartenders were nice and friendly, but also very serious about their craft. They can definitely use more people behind the bar though. This place gets crowded very fast because it's not that big. I liked that their background music is played with vinyl. There are 2 restrooms and a digital jukebox that is placed way too high :(  This place is also DOG-FRIENDLY!", 
    "review_date": "2013-08-17"
  }, 
  "6Rz0FpkDt0bfAKGr1FFLvA": {
    "user_rating": 5.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Kunal N.", 
    "review_text": "This place is what I would call a classy dive bar. It is definitely a divey place, but it features house cocktails, which I have tried, and they are delicious. What I think is really the seller for me and why I dub this place as \"classy\" is that their \"well\" liquor is actually decent. I know this fact because when we ordered tequila shots, the bartender picked up the tequila bottle from the well. I was about to stop him, but the bottle read \"100% blue agave\" and then when we had it, it was actually pretty smooth. In all likelihood, most people probably don't even care, but as a bartender, I am definitely sold on this aspect of this place. Personally, when my friends want to go to Biergarten, I would rather just go down the block and come here... but I am usually overruled :( . However, we always come by here afterwards :) . It's also a great place to hang out if you have just put your name down at Patxi's on the other side of the street and are expecting a 45 minute wait. However, even if you are just looking for a place to come and hang out with some friends, I would definitely recommend Brass Tacks. As I said in the beginning: a CLASSY dive bar.", 
    "review_date": "2014-06-25"
  }, 
  "jkr3YVCEoRNKkxinUZpW6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanne G.", 
    "review_text": "Even as a Marlena's loyalist, I recognize that Brass Tacks is a great bar with good quality cocktails and a nice addition to the neighborhood. But...last night I left my credit card behind the bar and after picking up my card today, I noticed that my bill had been closed out with an unauthorized 20% tip on five drinks.  What kind of policy is this?  A bit ridiculous, in my opinion.  Since there is no phone number listed on their yelp page, facebook page, or website, i'm left to air my annoyance on yelp.", 
    "review_date": "2014-11-23"
  }, 
  "04JttCeiTpGmy-7XJtn2Gw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin O.", 
    "review_text": "Another great addition to the stable of drink spots popping up in Hayes Valley. With a solid cocktail menu, well crafted beers on tap/bottle and bartenders that know mixology, Brass Tacks will be a regular drink spot for many.  The Conversation is twist on an Old Fashioned that won't disappoint. Also, check out the bourbon spiced nuts and the soft pretzel snacks - winning!", 
    "review_date": "2013-11-16"
  }, 
  "Mmh_W8V1NMiyEIwe3cku0g": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jerry N.", 
    "review_text": "One has to have a lot of style and personality to open a bar that can become a local favorite--Marlena had that. This place just seems like every other place that is opening up. Reclaimed wood; utilitarian, post-industrial stripped down; precisely measured shots in a lab glass (just give it a healthy pour!). The music was good, but incredibly loud, so after awhile we moved venues--it was just too piercing. You have to scream to hear each other. The crowd was very homogeneous, but no wonder given the ubiquity of the design. This place needs to find an identity and integrate itself into the community if I'm going to come back. There's no trace of Marlena or the old place anywhere, which is sad and disrespectful. San Francisco is painting over itself. The service was very good though and the drinks fairly priced.", 
    "review_date": "2013-07-20"
  }, 
  "k2c3Mh_xjBuxFDu_-j1r9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Craig L.", 
    "review_text": "Big window street side. Spartan set of quality alcohols behind the bar. Not your usual tap choices - selection includes Stillwater, a favorite brewery of mine. Nice beats. Hayes Valley keeps getting better.", 
    "review_date": "2013-07-07"
  }, 
  "dpmCKlTpQmt3mYBPmrt0ow": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Vivek s.", 
    "review_text": "The bar and drinks are great. Generally a good, friendly crowd keeps this place buzzing. Lots of good food options nearby, though they don't serve any bar snacks themselves.", 
    "review_date": "2014-02-25"
  }, 
  "hNRenDpOkeg3Qo6rOYWPjg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza B.", 
    "review_text": "Best bar in the area. Bartenders are easy on the eyes and super friendly, delicious, well crafted cocktails/wide range of liquor, unpretentious vibe.   They have tarragon grapefruit vodka based drink I believe. And me and my friend got pretty high on it... Not sure why but allegedly tarragon has calming and sedative properties if consumed in highly concentrated form- go figure. We don't smoke weed otherwise- thus very sensitive when it comes to anything like that.  It did not feel bad though. ^^  When we asked our bartender if anything like that ever happened to anyone he replied that once a girl was freaking out after she had... 7 of those.", 
    "review_date": "2014-10-15"
  }, 
  "fF2ySjtkHaCNztL-eu6GWg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "Great cocktails!  It gets very crowded here with a younger group.  I like this place a lot, the cocktails are awesome and they have good beer too.  I think you can bring food in because they don't offer any.", 
    "review_date": "2014-03-17"
  }, 
  "rQCkAEOa6krhBC2PJO7RDA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adina S.", 
    "review_text": "Our favorite go to bar in Hayes. Delicious drinks, good service, not too douchy of a crowd. And a plus, open window for great people watching...so if you are sitting there and see a couple stalking your spot it's probably us!", 
    "review_date": "2014-09-04"
  }, 
  "FvlwvSpzNI8Kpfkw30N4Kw": {
    "user_rating": 5.0, 
    "user_location": "French Quarter, New Orleans, LA", 
    "user_name": "Jesus B.", 
    "review_text": "This is a really cool bar. My girlfriend and I were walking by and decided to grab a afternoon drink while we shopped. And the beer selection is great. The bartender made my girlfriend a great drink. And the vibe was really cool, they played some good music. I think though we caught it at its quietist. So fellas if you need a drink while the gal is shopping stop here!", 
    "review_date": "2015-01-27"
  }, 
  "2MPTbMgbVCwUClgCKP75MA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josue V.", 
    "review_text": "Came here for some drinks on a Saturday night and had a great time. Not to big of a place and got busy pretty quickly once 11pm came around. The atmosphere was chill and relaxed which was nice. Unfortunately I did not get a chance to try out any of their signature cocktails which they are known for, I will definitely come back again to try some of them out, overheard many people raving about how good they were while I was there. Only thing that was strange were all the creepy dolls they had in the place, guess it added character?", 
    "review_date": "2014-12-21"
  }, 
  "ew4eihP7EKp4iYJ3JGJlUA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica F.", 
    "review_text": "Get the Beetlejuice.  I want to be drinking that at all times of the day no matter where I am.  It's delicious.  Other than that?  Great location in Hayes Valley.  I get a cool vibe from the people that come here.  No creepers or party girls or douche bags.  Only 4 stars though because my roommate asked a bartender for a napkin because he had spilled some beer on our table and he wanted to clean it up and she said no.", 
    "review_date": "2014-08-05"
  }, 
  "kJgvtgPwhH-JDs0IAoGhyw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kailyn G.", 
    "review_text": "Came to check out this bar with some friends. I'm happy to have another bar in Hayes Valley. I'll definitely be back.  DRINKS: I'd say so-so. I tried The Conversation and The Secret Service. My biggest problem was that I felt they were unbalance. The Conversation tasted like drinking only rye. The Secret Service was a bit more toned down and I really liked it. But all the rest of the drinks I tasted - overly sweet, or tangy or just something that would be hard after a couple sips.  ENVIRONEMNT: On a Saturday night, packed and loud. Shouting to be heard loud over the other patrons and music. There's some seating in the back. Overall decor-wise, it was pretty yuppie standard. Drinks get mixed in lab beakers (which I dislike as it gives a weird feeling of your bartenders not being able to measure correctly).  SERVICE: I'd say the bartenders seemed on top of their game. My friends did the ordering so I can't personally speak to it. But was told they were really friendly. We also had a second bartender ask if we'd been helped (yay for good service). Pretty good about getting empty glasses cleared from tables too.", 
    "review_date": "2013-07-30"
  }, 
  "KQZGTvbvdNZbe7vqyCc-KQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keren R.", 
    "review_text": "Not really good for a date as the acoustics are not good. However, the unique cocktails are worth it and can make a boring date more interesting.", 
    "review_date": "2013-07-12"
  }, 
  "iu17uWchImcBVFISMm9D5g": {
    "user_rating": 5.0, 
    "user_location": "Cincinnati, OH", 
    "user_name": "KC K.", 
    "review_text": "Great neighborhood bar with inventive drink list...a must if your in Hayes.  Bartenders were the friendliest we came across on our trip and the juke box is stellar...they even gave me a couple free credits (The Stooges, The Devil Makes Three and Cash).  Their take on an Old Fashioned is a pure intoxicating delight! The light fixture over the bar really sets the scene here.", 
    "review_date": "2014-06-11"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "Stopped in here with my guy and a friend before dinner nearby.  Bartender was friendly, even though he was slammed.  We al l had different drinks, some being better than others.  I appreciated the amount of seating and that thee bathrooms were relatively clean:)  If I were nearby, I'd stop in, but wouldn't go out of my way for. Boozing in this neighborhood is stiff competition!", 
    "review_date": "2014-09-04"
  }, 
  "OW0g1fBOejc4fY3ZPRZckQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amir H.", 
    "review_text": "I miss Marlena's but these guys have done an amazing job with the space: hardwood floor instead of the old carpet, a beautiful chandelier made of blown glass, a sexy new bar, a record player, and a jukebox. The service was great especially considering that it was their first Saturday night and the place was super crowded.  They have a full bar with at least 2 Islay scotches: Laphroaig and Lagavulin 16. That's mostly what I care about.  Notably missing elements from Marlena's: the stage, the pool table, and the smoking patio.", 
    "review_date": "2013-07-07"
  }, 
  "iKWmZiHAv_dJRocWAr4b6Q": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Steffen G.", 
    "review_text": "The drinks are tasty but only decently strong. I've had 7 drinks and I'm not slurring or stumbling. If you want a crafted, delicious cocktail, come here to have good conversation on a date. If you wanna get blasted have one drink here and move on.", 
    "review_date": "2014-01-06"
  }, 
  "IEA3F-h2gfMwygppp3GuYA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J M.", 
    "review_text": "The cocktails are great, no doubt. But, as with many \"premium\" cocktail joints across the City (see, e.g., Rickhouse, Bloodhound), the atmosphere sucks so hard that I'd almost pay money NOT to hang out here. Guys, the room is a long shoe-box with nothing on the walls to dampen the sound. Do you REALLY need the music to be that loud? Can't you see EVERYBODY in the place straining to hear one another?  I like cocktails. But I like talking to my friends even better. I live a block away from this place and pretty much never want to go back.", 
    "review_date": "2013-11-04"
  }, 
  "GBkSuO6Z9ccXol95Y1_2LQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zino M.", 
    "review_text": "Great neighborhood bar here in hayes valley. Since i live in the neighborhood its refreshing to have an awesome cocktail bar open up with bartenders who are super knowledgeable and know what they're talking about. Id give the place 5 stars but on weekends its such a mad house becomes so cramped inside that its just hard to enjoy yourself. I'd recommend coming in before 6 on weekends or if you can any time during the week.", 
    "review_date": "2014-01-31"
  }, 
  "NR6Y46Ni2JjQcj4vDbqKUA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane N.", 
    "review_text": "Heard about this place because one of my favorite bartenders works here!  Came by with a bunch of friends on a Thursday night and was surprised to find it packed (but not too packed).  Same owners as Bloodhound, it's a really cute place with a great ambiance.  All the bartenders seemed really nice too.  They would come up to US and ask if we'd been help yet, which usually never happens since bartenders like to be waved and shouted at in order to get their attention.  I've only sampled a few of their drinks and they were hit and miss.  The first two I had, I didn't like much.  The two after weren't too bad though.  I'll definitely come back to try their other things though and since it's such a nice, chill spot.", 
    "review_date": "2013-07-24"
  }, 
  "M7uIAO4mLtver4_Z4e7YGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alec N.", 
    "review_text": "This is my spot during the work week. Great selection of drinks, always good music and some of my favorite people in town behind the bar and at the door.", 
    "review_date": "2014-07-15"
  }, 
  "IoXg6z07ivR07XPFZ9vUWA": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Alexa S.", 
    "review_text": "On my last trip home to SF we moseyed over to Brass Tacks for afternoon drinks. Really fun atmosphere and good cocktails. The Rose we ordered was really good, not too sweet and came in a very convenient carafe size to share among us ladies.   While it's a small establishment, the wall counter worked perfectly for our party of five. Love the location and the fact that the bartenders are willing and able to concoct the perfect cocktail for your alcohol preference and mood. Recommend for day drinking and happy hour and looking forward to visiting again on my trip home.", 
    "review_date": "2014-05-13"
  }, 
  "gXZDZZPqVdd1wwC2Ach8Fg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz G.", 
    "review_text": "Brass Tacks, you get an A+ in my book!  We stopped by around 9pm on a weeknight and had an awesome time here. We joked with the bouncer who was checking our IDs and said something about my best friend and I having nice, warm scarves in the cold weather. We said that he should open up a scarf check to stay warm before letting people in ;) (hey, at least I thought it was funny after a couple drinks!)  The bartender was nice and attentive, no attitude at all. He made my gin gimlet (made w/ St. George Terroir) perfectly and asked me if I approved  - is it just me or does no one do this anymore? I appreciated it! My best friend enjoyed her whiskey cocktail and we had a great time ogling the collection of Santa's proudly on display for the holidays.   A fun place to meet up with friends with no pretension.", 
    "review_date": "2015-01-05"
  }, 
  "rUCAjW8bhyoFj-uwPQlfgA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casey H.", 
    "review_text": "I am astonished by the number of reviews here describing the barstaff as \"friendly\".  I have frequented Brass Tacks on numerous occasions because I think the decor is stylish, sleek and inviting, the cocktails are delicious and it's well placed in the neighborhood.    But every bartender I've encountered here has been the now typical Hayes Valley Trend in shops and bars:  the Rude-I'm too cool to smile, be friendly, warm, welcoming or even say 'Thank You' poser.  To be met with aggro when paying a premium for a cocktail is just not on.    I'll be only too glad when this current trend of hippishly mod snobbery grows out of itself and the neighborhood returns to a reflection of what real cool in the City actually is:  genuine, down to earth, authentic human beings who treat one another in a friendly, warm, kind manner.  Disappointed for the last time here.", 
    "review_date": "2014-02-06"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "Now serving hot buttered rum! The bartender happily announced this as I sat down for a beverage during happy hour.  Though I sincerely love hot buttered rum (make it at home A LOT), Monday night was actually pretty balmy, so I'll have to save that drink for another trip to Brass Tacks. Had a Stray Dog with tequila and anise. Festive but still craft cocktail boozy.  Look at all the Santas... they're so awesome and creepy! Note: this is only a holiday thing, no need to worry about a Christmas-themed bar. Though that would likely do well in a city like San Francisco.  Come see the decorations, have a drink, pet one of the many dogs inside (doesn't hurt to have a treat or two in your pocket) and enjoy an adult drink. Very cozy, indeed!", 
    "review_date": "2014-12-10"
  }, 
  "sEw5tRkz69-2ujwLrbkkvQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel B.", 
    "review_text": "really solid drinks and a great environment.", 
    "review_date": "2014-07-01"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "I was sad when I heard that Marlena's would be closing. The LGBT-friendly bar in Hayes Valley was a San Francisco institution. Back when I lived in the hood (before it became the posh Hayes Valley 2.0 that it is today), my girlfriend and I would grab a night-cap there and chat with all the regulars (everyone from hipsters to drag queens). Plus, they had a smoking section adjacent to the bar (this was back when I occasionally smoked). And, of course, Marlena's was famous for their over-the-top Christmas decor during the holiday season.  But alas, all good things must come to an end, and Marlena's was sold to new owners last year and transformed in to Brass Tacks. Needless to say, I was skeptical of the new tenants and their new cocktail lounge-y concept. Fortunately, I'm pleased to report that Brass Tacks is a wonderful addition to the neighborhood. The interior is a complete 180 from the old Marlena's. They have a shiny new bar; plenty of black leather couches; lots of modern light fixtures; and open window seating. The place is definitely a nice mix of sexy and comfortable.  Brass Tacks boasts a solid mixology program. All the featured cocktails incorporate a gourmet medley of spirits and flavors. I ordered the Salem's Lot (bourbon, punte e mes, lemon, apple spice). My friends ordered some sort of fancy rum cocktail.  Now I won't lie to ya - the drinks here aren't cheap ($10 a pop). And they each take 5 minutes to prepare. But if you don't mind the wait and the price, I think you'll be rewarded with a tasty beverage. Who ever created their cocktail program certainly knows what they're doing.  Although I miss Marlena's and its colorful characters, I think that Brass Tacks is going to do just fine in this neighborhood. And judging by all the young hipsters and yuppies who showed up for happy hour, I think this bar is off to a great start and can expect to be around for a long time to come.", 
    "review_date": "2014-01-22"
  }, 
  "G9J2uWRrPltfq2rHxSCC8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Milan T.", 
    "review_text": "Fun concept bar added recently to the neighborhood. Very good cocktail program and a strong selection of interesting liquor. Fun and lovely vibe.", 
    "review_date": "2014-07-27"
  }, 
  "3ojyn8jtyb9-aliDLecD6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deniz U.", 
    "review_text": "Some of the best cocktails I've had anywhere and the decor is gorgeous without ever feeling over the top. The bartenders are knowledgeable and fun and Matty even went so far as tracking down a hard to find gin at a store downtown so my wife and I could impress friends back in Germany.  Short of getting rid of the tv's I can't think of a single thing you'd want to change. As near to perfect you could get in the real world. Bravo Brass Tacks!", 
    "review_date": "2014-12-06"
  }, 
  "7_SjX_GOcRROCh80KfycSw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Niki M.", 
    "review_text": "Maybe I'm jaded... I haven't written a review in ages, and at the end of the day, my excitement about Brass Tacks, is based on the question \"Where can I get a drink after work, without a schtick?\"  Working near Hayes Valley there are plenty of places to get an afterwork but there's always a schtick.   Only beer or wine... Mostly food... Incredibly pricey... It's outdoors and too cold to hang out... Theme bar with only 20ish seats... Whatever the heck is going on at Sugar.   Remembering Brass Tacks had just opened after a new teammate completed their first full week on the job was incredibly helpful as we could certainly not all fit in the space left at a certain pirate bar was a huge win.   I know that a lot of reviews have remarked how underwhelming the decor is, but who cares when all you want after work is a stiff drink and somewhere to enjoy it?! Joking aside- inside the bar is certainly nice, and I have no complaints- then again that was not a concern on my first visit. Bartenders are incredibly nice and make sure everyone gets taken care of with stiff delicious libations. What more do you really need?  Excited to go back and try more of the specialty cocktails.", 
    "review_date": "2013-10-13"
  }, 
  "eIa4QJXp5ZNmuFORnuPvDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ziyan C.", 
    "review_text": "A group of us met up here on a Wednesday night at about 9pm. It was not too crowded (plenty of room for 6 of us to hang out at the bar), but still lively.  The bartender was really nice. They'd run out of their pretzel so he gave us a free jar of spiced almonds.  * Blood on the Sun ($10) - 4.5 stars Bright red/orange color, and delicious. A great mix of sweet and tart, well balanced.  * Salem's Lot ($10) - 3.5 stars A lot of well mixed flavors, but on the strong side for me.  Drinks menu: <a href=\"http://www.yelp.com/biz_photos/brass-tacks-san-francisco-2?select=qZQAPpRm5dGegVY-xL6O4w#qZQAPpRm5dGegVY-xL6O4w\">yelp.com/biz_photos/bras…</a>", 
    "review_date": "2014-05-08"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "If you are looking for a packed bar to stand around whilst you're sweating bullets, this is mayhaps the bar for you. You have to be in that particular type of mood, y'know?", 
    "review_date": "2013-11-24"
  }, 
  "_wgezevSyzQiLuvaNlKJqA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anjelika P.", 
    "review_text": "The bar menu is alright, the staff is nice an friendly.  The interior is very disappointing bc it has NO CHARACTER at all. Very generic and generally meh.  Yes Marlena's bathrooms were old but the place was fun. This place is clean and boring.", 
    "review_date": "2013-07-30"
  }, 
  "__4yhbGJIZjpplB3MRoMRw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael F.", 
    "review_text": "We love this place. Whether you're a neighbor, work in the industry, or are visiting from out of town, you'll find knowledgable and friendly bartenders to make it happen. Go!", 
    "review_date": "2014-08-29"
  }, 
  "zvZ4S6NZpEF6zLWrSGOy3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Judy L.", 
    "review_text": "Popped in here on a Saturday afternoon to check out the renovations to what used to be Marlena's. I gotta say I really like what they've done with the place. Hardwood floors and blown glass lighting give the place a more modern vibe. And they're still dog friendly. Pretty awesome. The bar tenders were nice enough to make us a couple of mimosas and chat while some old school hip hop played in the background. Can't wait to hang out here more.", 
    "review_date": "2013-07-07"
  }
}