{
  "-Qf4ffBkhYailgZ57ZenOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carly W.", 
    "review_text": "One word to describe Brunos Pizzeria: DELICIOUS!   I have been watching this place develop over the last couple of weeks and it recently opened. I went here for the first time this weekend and they had the most amazing pizza, or at least the one I tried was amazing. I was in a group of four people and we ordered an XL DC Mustang pizza. It was the perfect size for four people to leave satisfied. This was barbecued chicken pizza and usually I am not a fan of chicken on pizza, but I loved this one. They have found the perfect balance between sweet and spicy.   As for prices, I think that it is average, maybe even a little on the cheaper side. The owner, Bruno, is very friendly and is more than happy to answer questions or take care of any requests that you have. He is also open to suggestions. I really hope this place makes it because it really is darn good pizza. Definitely check this place out if you are in the mood for pizza, you won't be disappointed.", 
    "review_date": "2009-02-23"
  }, 
  "lClAon6sKRp1HcLhq1EFzA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg S.", 
    "review_text": "I'm not really sure what these people who say it's typical are talking about.  There is the typical italian menu, but there is also great original pizza's that are quite delicious Like the Fillmore or the DC Mustang. It's a very cozy atmosphere which is nice because it doesn't get too loud and they have a wide selection of wines.    Four people and only about 40 dollars for an extra large pizza and a bottle of Souvignon.  Pretty reasonable for SF.   Bruno was very friendly but almost too friendly, he should just let the waiters do their job but i guess since it is new he's probably worried it won't pick up, but I'll definitely be back.", 
    "review_date": "2009-02-28"
  }, 
  "dH5ZvZxvLLXGBsNkU_InKQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole H.", 
    "review_text": "I am writing this mid bite. Pasta was great for my first five bites (I was STARVING), now it it the exact opposite. Does anyone know any places that deliver italian that is halfway decent (and not like it's from the middle of america?)", 
    "review_date": "2010-11-29"
  }, 
  "U1R5x4SpCybNTkUGec5-AQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz Y.", 
    "review_text": "We had to flag one of the waiters down for menus 15 minutes after being seated. It was ALMOST comical how much they screwed up our order, first the wrong drinks, then the wrong pizza, then the wrong pizza again, then the garlic bread came out when we were almost finished,  The pizza had a puddle of grease on it so big it took eight napkins to soak up.  Sooo many things gone wrong, you would think they would comp a soda or the bread, but no.", 
    "review_date": "2010-01-31"
  }, 
  "jHKZ-q2MRHej1BwYemAGng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregory F.", 
    "review_text": "Oh man I tried them last night and it was nearly perfect. I had the Hawaii 5.0: pepperoni, red pepper, pineapple, jalapeno. FFS it was absolutely delicious and made with better ingredients than 80% of the pizza places in this city. The waitress was great, also. And they deliver.  Update: I found out something weird about Bruno's. When you order delivery it comes from a different restaurant-- Cybelle's, I think. I can't recommend delivery, therefore. But dine-in is nice.", 
    "review_date": "2010-03-09"
  }, 
  "TUVaya-VY5WmKHIsv0sx0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha S.", 
    "review_text": "I'm obsessed with their pizza right now. It's rare that I order cheese pizza and here that is all I usually order here because it is so tatesty. The cheese,, sauce and crust are so delicious and fresh, the doesn't need any toppings to make it stand out. I've had their sandwiches which have been good, but often inconsistent depending on the chief. The atmosphere is great, especially when its sunny and they open all the windows and offer patio seating. Great when addition to the area!", 
    "review_date": "2009-03-23"
  }, 
  "f1-Ds0X2Gb-acICN_oXVgw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Dennis S.", 
    "review_text": "If I come back here, it will be for be at happy hour, but I doubt I will be able to find a table. Our group had to wait awhile, so I wouldn't recommend coming here with more than four people. Bruno's is small and cozy with decent service. The pint prices are reasonable at $3.60 on the regular menu. I ordered the calamari to go with my beers. It was the first time I didn't finish this appetizer. Happy hour would be a better bet, since I paid $9.95 for a small (i mean small) basket of flavorless \"calamari.\" I was hoping for golden brown and delicious. I went here with a group because Fillmore Art Walk advertised Bruno's and a couple of other places had specials all night long. When we asked about the deal after we ordered, we were told the restaurant changed the prices the night before. Shady deal and overall disappointing experience here.", 
    "review_date": "2010-09-12"
  }, 
  "DjEoOS8Np_UG01I-1LDpKA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn T.", 
    "review_text": "To be honest, the food here can be quite good. The customer service, is, well...DO NOT ORDER DELIVERY FROM THEM!!!! Ever!!!  The owner decided to leave me a voicemail saying that they will no longer deliver to this address. When I pressed him for answers he said that he has had too many problems with our location. He cited reasons such as the location is too hard find, no one picks up their phone, etc. So...let's get the real story here.  When we order from Bruno's we tell them the exact building number. We also specifically mention that they need to ring the doorbell to be buzzed in. The owner said that is too complicated and hard to remember for his drivers. REALLY?? Go to a specific building and ring the doorbell? That's too complicated??? Wow, postal carriers should be given much more respect, perhaps they should even be in the running for a Nobel Peace Prize. They have to go to many addresses and also on occasion have to ring the doorbell. Remember, this is a very complicated thing to do. Way, way complicated. We are talking Postdoctoral material to understand how to find a building number and ring the doorbell.   Oh, wait, I can't be too snarky because he did mention that NO ONE even knows where are building is when the drivers ask. Hmm, well this hospital has only been around for 75 years so perhaps that is understandable. The majority of the employees average 15 years or more. Surely they could not have known about this secret building because you must have worked here for over 20 years to find our building. The large black numbers on the side of the building are a secret code that can only be deciphered by those who understand Arabic numerals.   In our \"conversation\" I also explained that in the past the driver never had a problem finding and delivering food. I was told that it was not always the same driver because he has 7 drivers. I made the suggestion that maybe the competent driver could explain to the other drivers how to find and deliver the food properly. The moment of silence indicated to me that the owner wasn't too keen on the idea. Perhaps only a single driver can be \"THE ONE\".   Before this order (which the owner just flat out canceled) the driver took over 2 HOURS and still did not deliver our food. And the driver did not even call. My understanding is that before you are accused of never answering your phone you have to be called first. Maybe I am just being old fashioned. I guess I should have checked my Facebook page or Twitter feed first to see if the driver was lost.  So, some helpful hints. Let's say you work in the Transamerica building. If you place an order at Bruno's you cannot just tell them the Transamerica building, the one that looks like a pyramid. Perhaps there are many unknown pyramid buildings in San Francisco. I suggest instead you create a short video with you walking around the Transamerica building and then upload it to Youtube. When you place the order, not only give them your name and number but reference the Youtube link as well.   Bruno's, get your #@$&amp;!! together. You have just lost the potential orders of an entire hospital. Way to go.", 
    "review_date": "2010-01-05"
  }, 
  "IXpspuR_OCbgyYV06lnMqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mollie M.", 
    "review_text": "Bruno's is awesome.  The pizza and pasta are fantastic (and reasonably priced) and I've had a good number of their salads which are stellar as well.  Every time I've eaten there Bruno himself has made his way over to our table to introduce himself, which is huge points in my book.  I live in the Fillmore Center and there's nothing that beats their \"room service\" free delivery.  The only reason I docked one star is because the service can occasionally be a little slow--most likely because they are so new.  But, on the other hand, not so slow as to be annoying.  Also, they have really cheap draft beer!", 
    "review_date": "2009-06-03"
  }, 
  "tfg1Nhwx94Y4GdQHLVawbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed L.", 
    "review_text": "Nice looking spot that has the looks and feel of a good bar and restaurant. They got the full bar, high table, and cushion booths with a couple TVs making it a good set-up for a game, a beer, and some wings. However, the food could could be a lot better. The menu is pretty simplistic and most of the food seemed processed (not homemade). I ordered a sampler platter and the celery that came with the wings we badly scarred. I was shocked they would serve that to start. Also got a pizza which was pretty good. Crust was nice and crisp and toppings were nicely balanced. Should go only for pizza.", 
    "review_date": "2013-02-11"
  }, 
  "H6NuZt8Lcm4n1bXkV-BNEg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vince H.", 
    "review_text": "Food is tasty, but the value doesn't seem all there.  I have been here roughly a dozen times due to the location. My number one problem is that I have had errors with my check every time I have dined in. They seem shocked and surprised every time you ask for one of the discounts ie Zipcar member or bring in coupons. They also recently increased the prices of the beers which is a bummer.", 
    "review_date": "2010-10-24"
  }, 
  "-OODneV01sxed0jBUv8XVg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy L.", 
    "review_text": "We originally attempted to got Yoshi's across the street, but there was a $5 cover. We just wanted one drink before we called it a night. We ended up walking over to Bruno's since it was across the street. I had a glass a wine. We just had dinner, so we didn't have their pizza. However the pizza's did look good. I defiantly want to go back to try it out.   We ended up being the last people there in the restaurant...the waitress was giving us hints to get the hell out. hahhaa   It's a cute lil place.", 
    "review_date": "2009-11-25"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "Bruno's is a great happy hour spot and it's not just because of the deals. It's the little details that make it a very likable place for beer and nibbles. *note this review has nothing to do with pizza.   But yes the HH deal is pretty sweet - Beers under $3 and half off apps. Pick from a fairly wide range of taps from Dogfish IPA to Pacifico to Guinness and more. What is most impressive for me is that Bruno's has pretty much the right glass for each beer on tap. Yes even Pacifico has a specific glass. That was news to me.   I had a couple of Dogfishes <a href=\"http://www.yelp.com/biz_photos/33Lat5fr1lNY8RqjLQU4LQ?select=_M0Qf0xM3amySJZHiWCD3w\">yelp.com/biz_photos/33La…</a> (in the proper glass of course) and an order of the fried calamari <a href=\"http://www.yelp.com/biz_photos/33Lat5fr1lNY8RqjLQU4LQ?select=QlLhqM6wuPjtwjaS_CH3Rg\">yelp.com/biz_photos/33La…</a>. The calamari was fresh, fried to a nice golden brown crisp, and not too oily which was nice. I really enjoyed finding bonus onion rings in the pile. At half off, it was a steal.   To top it off, service here is friendly and attentive. Special kudos to the bartender who was pregnant but still seamlessly on top of things. The little details added up and I certainly appreciated Bruno's for it.", 
    "review_date": "2011-05-12"
  }, 
  "c8ODvXT-8EugXo3NLJJyZA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle P.", 
    "review_text": "I wish this place was better. It has potential and its so so close to my apartment! Its a nice casual setting. Very clean. Some outdoor seating which is always a plus. Pretty good beer selection. The wine list is definitely lacking. The service is fast and friendly. But the pizza is awful. Seriously, awful. It tastes like it came straight out of the freezer. I've had some of their appetizers which aren't terrible but they definitely all taste like frozen food that it just dumped in the fryer for a few minutes. The calamari isn't the worst. Not the best either. The toasted ravioli is also alright (pretty much just a square mozzarella stick). I've never tried any of their dinners. If they step up their game on the food, this place could be great.", 
    "review_date": "2013-03-15"
  }, 
  "oKrct4Hc8hZNMYXecitLCw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "InfodivaMLIS B.", 
    "review_text": "This restaurant has a nice decor and large flat screen TV. The prices are rather expensive for a pizza pie. I had to eat something. It was edible. I prefer other places.   Given the location and proximity to Yoshi's, I did not have much of a choice for some chow. Parking is hell. I may go back for the $3.00 a pint happy hour.", 
    "review_date": "2009-07-22"
  }, 
  "5ug5aAQHQV5Oja5xSXKp4A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "johan b.", 
    "review_text": "The pizza (the most important thing) was great. I had a large Hawaiian, with chicken, mozzarella, pineapple and jalapeno. It was a very good combination with a liberal dose of garlic to enhance the flavor.   However, the salad I got was terrible. Wilted greens from a bag and unripened cherry tomatoes. The manager refunded it for me, which was nice.   There' s a $3 delivery fee, and I'd like to know how much of that goes to the driver. I hate to sound like a cheapskate but OK, the meal is $28 and then they add the $3. So then a good tip would be $6 but then suddenly you're talking about paying an extra $9 just for delivery.", 
    "review_date": "2013-07-26"
  }, 
  "dJtrZhOFp7TAF685qc8JjA": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Raquel R.", 
    "review_text": "Ordered a burger and calamari on delivery because I was having one of those nights. Burger was pretty good. Pretty basic. So was the calamari. But all in all it satisfied me.", 
    "review_date": "2012-02-01"
  }, 
  "zcGjmm1fRERP8mBxV6tAIg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina K.", 
    "review_text": "This pizza has gone to crap.  I'd rather eat wallpaper.  It's like the pizza has completely changed since the first time I tasted it when it was spicy and yummy.  Not a very friendly delivery person either despite my generous tip.  Oh and their web site kept giving me an error message when I hit \"enter\" so I ended up calling in our order.  And now there are four charges pending on my credit card.  Grrrr.  Have to deal with that now.  Pretty darn sure this will be my last order at Bruno's unless they resolve the credit card thing fast.", 
    "review_date": "2010-03-20"
  }, 
  "W5cwxNwGiZJd393PCDQEvA": {
    "user_rating": 3.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "George A.", 
    "review_text": "I think this place is probably a really good restaurant to dine in at with friends, pizza, and cheap beer. I didn't do that, which is probably why I thought Bruno's was just OK. I got takeout. I got an Italian sausage sandwich, which was decent, but nothing that rocked my socks off. The roll it came on was good, and there was a few sweet peppers as well as lots of gooey cheese. It also came which fries, which was nice and they were decent as well.   My order was ready promptly when I went to go pick it up and the couple employees who I dealt with seemed nice. The prices were reasonable and the restaurant itself seemed pretty nice. I don't think I'd get takeout from here again (maybe the pizza), but I'd like to come back and take advantage of some of the cheap beer specials.", 
    "review_date": "2010-08-08"
  }, 
  "9hzVZmhRMpqNtnsy_KjCDg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pat M.", 
    "review_text": "We were seated very quickly on a Friday evening and the staff was very cordial.  The cream of mushroom soup tasted \"canned\".  The sald was good but had too much blue cheese on the toasted bread.  The Margarita pizza arrived barely warm and we asked for it to be reheated.  The middle of the pizza was soggy.  Although the prices are reasonable, the pizza is more expensive than Delfina's and the quality does not compare.  I live in the neighborhood and hope that this restaurant improves!", 
    "review_date": "2009-02-16"
  }, 
  "W4SeAMf4Vb8vGoICvz8uEQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste L.", 
    "review_text": "Thought this place would be good for delivery to my office since they offered a great promotion for the first order.   Ordering was a pain, they didn't seem to understand their own dish names. I ordered a vegetarian dish, and made sure to also ask \"is it completely vegetarian?\" just in case. I received a quick \"yes!\".   The food arrives, bacon on everything. I call them back and complain, they tell me they're sending the dish again, it was a mistake. Another 30 minutes go by. The food arrives again. They now put little pieces of bacon in it. Guess they were trying to make it harder for me to pick it out this time.  Not ordering from here again.", 
    "review_date": "2009-03-02"
  }, 
  "_b79UDL1KHal-aBjtNdleg": {
    "user_rating": 4.0, 
    "user_location": "Downtown Brooklyn, NY", 
    "user_name": "Sheena D.", 
    "review_text": "Great last minute spot to watch the Game, bar and tables were full with a great atmosphere. Had the spicy wings and the ravioli. Both tasty and great price with friendly service", 
    "review_date": "2014-10-26"
  }, 
  "5fpCfqVq1Nm2YafJ3VHU8g": {
    "user_rating": 4.0, 
    "user_location": "West Palm Beach, FL", 
    "user_name": "Marc L.", 
    "review_text": "Cheap beer, nice atmosphere. I love grabbing a snakebite with my buddies after a long week. The food is pretty mediocre.", 
    "review_date": "2010-11-23"
  }, 
  "Qe2AcK8TZU1d_ZO1PdJYRQ": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Lisa Q.", 
    "review_text": "Good hh prices on beers. Terrible food.   The ingredients on their pizza were not fresh. I've had better frozen pizza than the one I had here.   I had a spicy chicken pizza here and the chicken tasted like the prepackaged chicken breast from the grocery store. Fake grill marks and all. The jalapeño on the pizza also tasted soggy, like straight from the can.   With so many great restaurants up Fillmore street, I would pass on this place.", 
    "review_date": "2014-05-14"
  }, 
  "60iCXLkb9xqhe5cvEun0kg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher K.", 
    "review_text": "If you grew up in a place like South Bend, Indiana, then Bruno's Pizzeria will be a familiar and welcoming place for you.    The standout qualities of our visit: the service... and the bathroom.  The charms of this place lie somewhere in the deep, rich color of the wood used to construct their bar and the pictures of jazz legends like Duke Ellington that pay homage to the neighborhood.  There is a dash of sophistication in the decoration that adds a thin cosmopolitian veneer over what otherwise reminds me of a million other pizza joints I ate in when I grew up in the midwest.  The food followed a similar trend.  We tried the spaghetti with meatballs (a staple of a good pizza joint) and the burger because they spiced it up with sautéed red peppers.  Everything was solid.  Both were well executed.  Both were missing a little something to set them apart from the memories I have from my youth.  Our waiter was fantastic.  He was attentive and genuinely interested in our dining experience.  He asked specific questions like if the burger was cooked to taste and he ran after us when I absent-mindedly left my sunglasses on the table.  Both little things that make a big difference.  It just felt like he cared.  The bathroom, as mentioned at the beginning, warrants a note thanks to the excellent decoration, spaciousness, and use of a water-saving dual flush toilet!  Thanks for being water conscious!  All in all, I cannot imagine you would have a bad experience coming here.  You'll get a solid Italian-American dining experience, spruced up for a world class city.  (What is a dual flush toilet?  Glad you asked - <a href=\"/redir?url=http%3A%2F%2Fhome.howstuffworks.com%2Fdual-flush-toilet.htm&amp;s=59c7bcd5193d2d0969c86191bc0f0b14f139ff978adc067161b5210dd1363621\" rel=\"nofollow\" target=\"_blank\">home.howstuffworks.com/d…</a>)", 
    "review_date": "2009-07-23"
  }, 
  "lYmPbq4gZm7O_a30R5hFPg": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kris G.", 
    "review_text": "it's kind of hard to not like a place that has $2.75 drafts. and we're not talking bud light, we're talking like stella and guinness. i had a widmer. but i can't say that i loved the food as much as i loved the beer. though it's not usually my restaurant MO, i'd stick with your \"typical bar food\" as opposed to the more adventurous choices. the bayou pizza tasted and smelled super fishy... and not in a good way. the dc mustang bbq pizza was better, but the best thing we ate by far was the fried mozzarella and zucchini.  the toasted ravioli looked really yummy too, and i'd suspect most of the other appetizers are safe choices. but i'll be frequenting more for the beer selection than anything else.", 
    "review_date": "2010-05-22"
  }, 
  "qBnofoKlHr3_N7h3xXhR6A": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Crazy Like A F.", 
    "review_text": "want to start out by saying our originial plans were to eat at Gussie's before Yoshi's show, but it was closed..so this was the only restaurant around.  Don't know how it got so many stars..this has to rate as one of the worst restaurants i have ever been to! I ordered the side order of meatballs and garlic bread, my friend, who had been there ordered a slice of pizza and salad. i asked the waitress were the meatballs homemade or frozen..she said the menu says homemade, i said no it didn't, it says side order of meatballs! she assured me they were homemade. when they came i could tell right away they came from frozen, they were the exact same size..i cut into them, they had an off greyish color to them, and had no taste whatsoever,  had to use parm. cheese, salt, pepper, cayenne flakes to try and make them edible..no luck..the garlic bread with cheese is the worst i have ever tasted..or i should say not tasted, again not much flavor at all..and the bread was why to dry and hard..my friend says her pizza was not good this night, although previously when she went it was good.  the only good thing was the salad..but it doesn't take much effort to open a bag of lettuce, put on croutons, cheese and open a bottle of dressing!! i would rather starve rather than go here again, sorry for the long rant.. but one more thing..a side order of meatballs if i remember right is $4.95 came with 5 meatballs...an order of spaghetti and meatballs is $9.95 and comes with 4??!?  WTF you mean the pasta you get  jacks the price up by $5??!  go figure!", 
    "review_date": "2014-09-23"
  }, 
  "PbmtoKdQ_Td9Ez_WwlEZig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam S.", 
    "review_text": "Being a huge fan of pizza and beer, I have to love this place.  I came here a while back.  It's a good combo-platter bar and restaurant.  They have a nice pizza-oven.  They have an awesome $3.75 Happy Hour Beer-List.  Be careful to look for the red stars on the list fro the deals that qualify.  But, look at the whole list, because there are some winners.  The menu is somewhat limited.  But, the pizza looks good.  I need to get a by-the-slice taste one of these nights.  Calzones and Cheesesteaks are also on the menu.", 
    "review_date": "2014-04-28"
  }, 
  "4etRSAyzSSrqRw6n9R239Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clutch R.", 
    "review_text": "This place might make a good bar, but I wouldn't recommend it as a dining destination.  Both pastas we tried were bland and nothing short of ordinary. The food was obviously not fresh. The wine was like a solid punch in the mouth - offensive and not entirely pleasant.", 
    "review_date": "2011-03-28"
  }, 
  "r7C1_zw8VYxLlJJ8zNrNOw": {
    "user_rating": 5.0, 
    "user_location": "Charlotte, NC", 
    "user_name": "Kathryn B.", 
    "review_text": "This place is great! My boyfriend and I have been waiting for it to open for months and it was well worth the wait!  The food is inexpensive and quick! I would recommend the Meatball sub and the Calzone. Amazing!  The wait staff is VERY FRIENDLY and you can tell Bruno loves what he does. He introduces himself to each table and makes sure you actually like what your eating.   It has a casual atmosphere and it very clean. We will definitely be back here again.", 
    "review_date": "2009-02-17"
  }, 
  "ghQZvTiGa5M6v_j2lrtFfQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Isaac C.", 
    "review_text": "Bruno's PIzzeria is a local watering hole that offers great happy hour deals along with some delicious pizzas.  Stopped by here before hitting the jazz lounge and it was a very pleasant experience.  Great service and top notch food quality.  Highly recommend trying one of their pizza~!    Food:  A Service: A Overall: A", 
    "review_date": "2011-07-29"
  }, 
  "jUmnspdMwA8d-8pMeacaMA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie P.", 
    "review_text": "I consulted my to-go menu and called in an order for a calzone; reasonably priced, I thought, at around $6. When I went to pick it up, however, I was charged $12 and change. I asked why the discrepancy and was told I had an old menu. For a place that's only been open around 6 months, doubling prices seems a little outrageous. I wouldn't mind paying 12 bucks for a great calzone, but this one was only ok and frankly, I don't like feeling tricked.   No thanks, Bruno's.", 
    "review_date": "2009-10-30"
  }, 
  "rFoKcDytlUEpE0VS_VUPoA": {
    "user_rating": 3.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Aimee H.", 
    "review_text": "the atmosphere was great. You walk in and the 1st thing You see us the beautiful bar and the open-style kitchen. They have $2.75 pints and $8.95 pitchers... can't beat that! We got the bruschetta for an appetizer and it was to die for. It had thick sliced bread that was buttery and crunchy topped with tomato slices, Basil, fresh mozzarella and a delicious balsamic vinegar. I got the rigatoni vegetarian and it came with a perfect pesto/balsamic vinegar blend sauce. Jason got the salmon Risotto. The salmon was perfectly seared and the Risotto was rich and creamy. We would definitely go back!", 
    "review_date": "2010-07-31"
  }, 
  "204pVFDT04PJyU8NgXhsQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John W.", 
    "review_text": "Place has a comfy atmosphere and a hip little location on Fillmore St.   Went in and were greeted at the door and seated at a spot of our choosing.    We had the calamari appetizer and the Bruno's Special Pizza with a slight alteration.  It's normally Pepperoni, salami, sausage, bell peppers, onions, mushrooms, but we substituted the bell peppers with Feta cheese.  We have a bit of a feta fetish these days.  Both were very good.  The calamari was crisp and not too rubbery in the inside.  We also commented the tartar sauce was good as well.   The pizza is an Italian thin crust but not so thin like some places where its like eating pizza toppings on a cracker.  We will be going back to be trying a something a little more adventurous then pizza next time.   Its also blocks from home and makes a nice after dinner walk.  I was impressed with the feel of the place and that is what pushed it into 4 stars.", 
    "review_date": "2012-02-14"
  }, 
  "kUs6ZOn1TuAxlJTzXqFVfQ": {
    "user_rating": 4.0, 
    "user_location": "Coos Bay, OR", 
    "user_name": "D T.", 
    "review_text": "Good pizza. Cheap beer. Nice selection.", 
    "review_date": "2014-05-11"
  }, 
  "8-JCm3604FQoLLiQgFVr_A": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Grace G.", 
    "review_text": "Nice, new neighborhood restaurant.  I think it's too pricey for the quantity.  We ordered a bbq chicken pizza and there were only about 5 small pieces of chicken.  Staff is friendly though.", 
    "review_date": "2009-04-23"
  }, 
  "dQlXGflh_wcETj92YdpvTw": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "J S.", 
    "review_text": "Not crowded, easy to get a table, which made us worry a bit that perhaps people knew something we didn't -- but no: Great pre-show burger and beer. Nice jazzy atmosphere.", 
    "review_date": "2012-03-25"
  }, 
  "nOn3u6JXeWcOnGgbv_YnYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pranjal M.", 
    "review_text": "Great great salads. My favorite pizza here is the bayou shrimp pizza. Arguably, it was the tastiest pizza I had in a long while. I have also eaten it without the shrimp by adding mushrooms and it still doesnt disappoint! The soups are good and the servers have always been nice. Can't complain,", 
    "review_date": "2009-09-16"
  }, 
  "Y9mS7bYTv41akphi8YumDg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Spencer P.", 
    "review_text": "\"eek! methinks not\" is right yelp! thanks for the help with that one. this place is awful. im gonna be harsh with this one. walk in. crowded. too crowded. no sense of comfort in this place. its a bar/restaurant but it feels more like a poor attempt at both. it feels like a mediocre bar was the first idea and then a cramped, poorly executed family portion was smashed into the mix. after getting through the crowd, you are led to a simple booth. almost IMMEDIATELY you are greeted by  Bruno, the owner, and THE MOST cliche Italian man ever its sickening. not trying to be mean here but oh my heavens like, just COOK ME GOOD FOOD. dont charm my 21 year old male self to hide the fact your food is lack luster at best. my family orders a starter of fried asparagus and mozzarella sticks. short story even shorter: all i could taste was the fried batter. really greasy. no flavor. and so filling? dont get them. please dont!!!! we ordered a steak pizza as a main course. and you know i swear there is a costco shopping center behind the shop cause the waiter MUST have gotten this pizza from the frozen food section. the sauce was uninspiring. the cheese was bland. the crust was simple and too \"doughey\" no crunch or real texture. the steak was the only tasty portion. but um i wanted a pizza. not a few strips of steak presented to me on a hot mess of italy. is that graphic? whatever. too pricey for me. the pizza was like...25 bucks for a medium or a large. and the sides just added more, obviously. i wish i could be more eloquent with this review but i was just so disappointed....sigh.....poor Bruno. keeping up that happy facade when deep down he knows his food is awful. oh yes. he knows. he HAS too. the drunken patrons fresh from Yoshis seemed to like the joint. but what drunken individual doesnt love crappy pizza and more alcohol with a basketball game on the tv? so. if you are drunk. by all mean. eat at brunos. if you are sober. i say buy some digiorno pizza.", 
    "review_date": "2009-04-14"
  }, 
  "eSeLeqHQlEuYFvh0hFUqsA": {
    "user_rating": 2.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Kristine Q.", 
    "review_text": "We ordered the Bayou Special, but minus the sausage.  The first few bites per slice were just ok...not much flavor, the sauce was pretty blah.  The only good thing was we had the $20 for only $10 Living Social deal.", 
    "review_date": "2011-03-26"
  }, 
  "pMWjEirtvBqxv2kVxFqN6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark K.", 
    "review_text": "The food is good.  Nothing great.  Just good american-italian food.   They also have a few american pub type dishes.  The service on the other hand needs improvement.  I have been there twice.  Each time, the service left something to be expected.  The first time, the bartender was just awful.  There is no other way to describe it, Just fricking awful.  I had to beg him to take my order.  He was either preoccupied with some big college examination at school the coming monday, or he just sucked.  I'll take the second explanation;  he sucked.  The second time I was there, the crappy bartender was not on duty but the service was still indescribibly crappy.  Food is not bad though.  Not an incredible east coast style pizza (sort of), but decent.  I have also had the spaghetti and meatballs there.  The meat balls are delicious but the pasta was cooked several degrees beyond al dente.  For better east coast style pizza try Escape from New York or Pizza My Heart out on the Peninsula", 
    "review_date": "2009-07-03"
  }, 
  "LRHs4D9teQatVJ4-m0djcg": {
    "user_rating": 3.0, 
    "user_location": "Danville, CA", 
    "user_name": "Jennifer A.", 
    "review_text": "Solid 3 stars .. For food ... Service and wine selection", 
    "review_date": "2012-03-25"
  }, 
  "WLRWL4WGhjK23lZWXKaTmw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Jay S.", 
    "review_text": "I first learned of Bruno's Pizza through LivingSocial. I wasn't sure if I should purchase the deal because there are just so many pizza places in San Francisco, but now I'm really glad I did!  The pizza was very good and very inexpensive. What impressed me most was the extensive selection of VERY high quality microbrewed beers on tap for extremely reasonable prices ($2.75). Even DogFish Head 90 Minute IPA, which runs $3 a bottle in liquor stores! The service was friendly and the atmosphere cool, unpretentious, and fun. The coffee afterwards was really great too. The entire meal was very economical, and would have only run $40 for 2 people who ordered a large pizza with many toppings, a starter salad, 4 beers, and 2 coffees. Where else can you find that value in SF?  I recommend Bruno's to anyone who likes pizza, pasta, or alcohol. Hopefully that's everyone. So what are you waiting for? Go to Bruno's!", 
    "review_date": "2010-05-21"
  }, 
  "-xT-klabhsCeIjrZogcEkA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D R.", 
    "review_text": "This place is awesome a group of us came in here right when they were closing and we were those customers that changed our order the bartender mike put up with us and made sure he got our order correct.  Food and service were great!!", 
    "review_date": "2013-11-06"
  }, 
  "Dn2UNEiY0_cOBjWVHm1wMA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tim p.", 
    "review_text": "This place is mediocre on a good day, disgusting on occasion, pretty typical for a fast and dirty pizza joint with Mexicans opening cans and defrosting chicken wings out back.  I would never have even thought of writing a review for this greasy spoon, except that they keep sending some poor Mexican kid to hang glossy  full-color flyers with coupons and promotions and who knows what else up and down my street-- Waller. Every other week the Mexican kid is trudging up and down decorating the street (and I assume blocks around) with flapping flyers, most of which end up on the ground.  So here's me repaying their littering and spamming: Bruno's Pizzeria Sucks!  I will never go there again and because of their flyers I will tell everyone I know not to go there.  Nice use of your advertising budget, idiots!", 
    "review_date": "2012-02-14"
  }, 
  "VO1o4olkSbbvhNaniQtUaQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brooke A.", 
    "review_text": "I went here with my groupon, which I was so excited about because I've wanted to go here for awhile. While the groupon was a great deal, the food was very mediocre. I had the pizza margherita and I have to agree with others on this one, it was nothing exciting. The tomatoes looked liked the ones that they put on a subway sandwich, pink not red and they were not roma tomatoes or something colorful and full of flavor like a vine ripened tomato. I make this pizza and I make it much better. Also got the mozzarella appetizer, again mediocre. Then the Caesar salad. It was alright, but looked like it came out of a Caesar salad mix you can buy at safeway. So bummed, I really wanted to like this place. There is great potential with the outdoor seating.", 
    "review_date": "2010-05-04"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Over the edge.  Lunch falling off the plate. Plate falling off the table.  Former is a very good thing. Latter not so much. Let's focus on the former.  Grilled chicken was almost big enough for two sandwiches. And so good it was eaten all at once.  Served with a generous side salad. This is where my attempts to read and use a fork almost made a mess. Almost. Caught it just in time.  Good thing. There was more to eat.  BBQ chicken pizza sounded amazing. Didn't want a whole pie so I customized a slice instead. Extra $0.50 an item proved to be a very reasonable way to create a chicken, onion and BBQ sauce slice. Not bad if I do say so myself. Not bad at all.  Incredible sandwich. Excellent pizza. Friendly service even if you almost drop things. Bruno's earns the full five.", 
    "review_date": "2012-05-02"
  }, 
  "CqAaTrIZYETFJnSiB9pqFQ": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Pam H.", 
    "review_text": "My husband and I stumbled upon this place.  We were going to a concert at the Fillmore and after finding parking just started walking around to see what we found.  We both really were in the mood for Italian and a local walking down the street had recommended Bruno's.  We were seated right away, had a nice comfortable booth.  The place is pretty small overall- I think I read that maximum occupancy is 48 people, they have a few booths and then some high tables and the bar area.  We ordered a pizza and bottle of wine.  They had a decent wine selection (nothing super fab, but all very formidable choices)- and not over priced like many restaurants do with bottles of wine!  Service was prompt and the pizza was excellent- the secret is always the sauce and if a pizza place has good sauce- then the pizza is usually pretty good- YES, the pizza was great!  We were too filled to try the desserts- but they did have several choices that were appealing including a home-made tiramisu.    Menu overall had pizza and various pasta dishes, some fish dishes, chicken and steak.  The owner circulates around and asks how you are, how is your meal, etc.  He has a very thick authentic Italian accent and appears he likes to flirt with the ladies..you know the Italian charm.  Overall, thought this place was great- only drawback and reason for 4 stars instead of 5, it did get a bit noisy in there for a small place.  But as for service and food- both get 5 star rating from us!  We now know in the future if we have another concert to attend at the Fillmore, we'll park at the Garage (Fillmore Center)- or something like that- but it's right next to this restaurant and we'll dine here again!", 
    "review_date": "2009-03-25"
  }, 
  "N-APXI9nb5hWy4ChxYhSOw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Nadia R.", 
    "review_text": "I think it's the best pizza I have tried in a long time, may be ever... We took couple pieces home and finished leftovers next day for lunch - tasted almost as great as last night.  Service is excellent and the ambiance overall is very relaxing, great jazz music and good interior design.  I think it's perfect for a date as well as just going with a friend for a glass of wine.", 
    "review_date": "2009-06-05"
  }, 
  "AAMlM0YNXW_RYIVV5xakWw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christie C.", 
    "review_text": "Food was pretty good and not too pricey.  Bright, clean, friendly place.  Mention you're going to a show at the Fillmore and get 10% off your bill :)", 
    "review_date": "2009-11-05"
  }, 
  "XUm4bJy5seRuG_OELvRGGQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher F.", 
    "review_text": "20 bucks for a pizza with worse crust then dominos!  Dominos would be gourmet compared to this place.  I had to drown the pizza in hot sauce just to get it down.  Why would you open a pizza place if you dislike pizza, cause after what this guy did to his crust he must hate his pizza and his customers.   Bartender was very nice.", 
    "review_date": "2011-03-09"
  }, 
  "qc7Eyfoc5810RfJPytG8-Q": {
    "user_rating": 3.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Midori S.", 
    "review_text": "Decent neighborhood place. Pizza is a bit bland but very all-American -- the kind you loved when you were a kid. Spaghetti is tasty but with more of a pomodoro sauce than the zesty marinara you expect with meatballs. Bottom line: Better than Pizza Inferno.", 
    "review_date": "2009-11-14"
  }, 
  "TlphV6gUvMJbC74pktHVFg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "G O.", 
    "review_text": "Just get the pizza here. I wanted this place to be really great because it's in my neighborhood, but just get the pizza. It's not the best pizza in town but it's pretty good - reminds me a bit of the suburban pizza of my youth: lots of cheese, a bit of puffy crust, but overall, tasty.   However, we went in a few weeks ago not feeling like pizza and ordered a pasta and eggplant parmesan. We ended having a chicken parmesan delivered to our table but it was so cheese covered that I didn't notice at first, and the two people I was sharing it with ate most of it before I realized it was NOT eggplant parmesan. Both dishes also tasted like the \"Eye-talian\" food of my youth - mushy, over sauced, over salted and bland. As Tony Soprano would have said, \"You know what I mean...May-o-nnaise.\" When I mentioned that we got the wrong dish the waitress finally came back and said she'd give us 10 percent off without me having to ask, so that was something. Overall though, she was a pretty lousy waitress.  So if you go, just get the pizza.", 
    "review_date": "2010-04-17"
  }, 
  "XQMaAvF3YUslCD-0tZY1xg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brian D.", 
    "review_text": "Stopped in on Saturday January 28th, 2012 around 7:00 PM and immediately found two seats at the bar with about 2 tables being taken as well.  After reviewing the menu - we decided to order a medium half Bruno's Special; half Margherita Pizza that the cute, taller, petite server / busser recommended. The pizza was tasty and flavorful - hit the spot. Pizza came with roughly 6 slices which were filling.Otherwise, we ordered a few other beers - they were roughly $4.50 each - which seemed like a good deal for the neighborhood. Overall bill for roughly 4 drinks and a pizza was about $45 which felt like a fair price.  My only complaint was that they had three employees working - one guy and two gals and they did not have defined roles leaving me waiting for someone to come over and take my order for a lengthy period of time when looking to order another drink.", 
    "review_date": "2012-01-30"
  }, 
  "51f-gzLdOCAeSNyhdXJX6Q": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Stephanie T.", 
    "review_text": "Stopped in here for happy hour recently with my roommate to catch the Giants game. When we arrived we asked about happy hour and we were told that all draft beers were 3 bucks and appetizers were half off. Pretty good deal!  We ordered some pints of dog fish head 90 minute IPA. For appetizers we ordered the deep fried ravioli and the Italian bruschetta.The deep fried ravioli were the better of the two appetizers. They were hot and crispy and served with a side of marinara for dipping.   The bruschetta was just kind of weird. It came out and looked more like a Caprese salad than bruschetta. I had to stack the mozzarella, tomato, and basil onto my bread myself. I would not order the bruschetta again.", 
    "review_date": "2011-09-06"
  }, 
  "SFBfsySKt-Rb5aBovef78w": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Jen S.", 
    "review_text": "Convenient spot to grab dinner before a show at Yoshi's.  Pizza was delicious especially for a thin crust pizza.  Chicken sandwich was on point.  It tasted a like a roasted red bell pepper mayo sauce and the chicken was tender and moist.  Our server was nice to bring us complimentary spicy carrot soup but minus the spicy.  It was still tasty, nevertheless.  I would recommend giving this place a go if you're in the area.", 
    "review_date": "2009-09-03"
  }, 
  "8NDP9NYFvnLHcHdu2qGe9A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice T.", 
    "review_text": "We placed an order for delivery with this place. We ordered our pizza and sides a few minutes after 9:00pm and were told it was going to be about 45 minutes. It took two hours for our food to arrive. When it did everything was cold and soggy, we spent $45 for this meal.   Apparently the driver was saying he tried calling us twice, but we had no missed calls on our phones and no one even tried the buzzer, we even went out front to smoke for 15 minutes. The man handling the phones was rude I guess (I didn't speak with him at that time), and tried blaming us.   Once our food arrived we had to reheat everything and it just wasn't very appetizing. I called back about 5 minutes after the drop off to get a discount which they were nice enough to take $10 off for us. Something was weird though, when I called he said that the driver had already made it back there from dropping off our pizzas.... and that he needed to talk to him so he put my on hold, haha it's weird because there's no way it takes 5 minutes to make it from our location to theirs, so I don't know what he was talking about. Haha, I think thats funny for some reason. But to sum things up, it's too expensive for their service and for the food quality.", 
    "review_date": "2014-03-04"
  }, 
  "tp_NeixfEav-so6yRBLIOw": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Sara N.", 
    "review_text": "We were in town for a night so as soon we saw their  street banner with happy hour we decided to try them out. We ordered chicken wings with some draft beers and the wings were okay, but after trying a couple of beers my boyfriend saw some nasty stuff that was in his beer, looked like small pieces of meat so we called the waitress and asked her about what it could be and all she could say was \"our cups are clean so it must be something from beer\" lol and my bf keep saying he never seen that in  beer before lol. She left and we see her talking  with her cook guy but never came back to our table with our answers since we already paid our bill.   Overall was average, but the way the server handled the beer situation was not right, thus the 2 stars.", 
    "review_date": "2015-01-22"
  }, 
  "zaBX3i2WgmixzgQBwA33GA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick C.", 
    "review_text": "Pretty chill place that offers a good selection of pizza, Italian dishes, and beer. Come here with some friends and kick it for a few hours.   Waitresses are friendly, cute, and attentive. Not a bad way to spend a night with friends.", 
    "review_date": "2010-12-04"
  }, 
  "KxrKVxdXGkfMJ9XwJZzoLQ": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Lisa H.", 
    "review_text": "We went here before a show, and we got seated quickly. I had high expectations because the place looks very inviting from the outside, and the inside was nice and dark, but the pizza was a big let down. We got the Hawaii 5.0 and the Chicken Pesto, but the pizza was not good. The crust was too chewy and overall a big let down. I had been craving pizza all week, so I was afraid I would over indulge, but since the pizza was so lack luster, I only had a piece of each.", 
    "review_date": "2012-01-30"
  }, 
  "iVMa2jbZ90fXO1BL4SbYwA": {
    "user_rating": 4.0, 
    "user_location": "Scotts Valley, CA", 
    "user_name": "Tammie W.", 
    "review_text": "Chill little place on Fillmore; its a nice place to drop in before a Fillmore show and they always have cool beer specials.  And who can argue with a place that has Dogfish IPA and Dead Guy on tap?  The staff is super friendly and attentive.  The appetizers and non-pizza dishes are good.  I had the eggplant parm last visit and it was rather tasty!  Decor is a bit more upscale than your usual pizza place and its a nice place to just chill and sit back and have a drink.", 
    "review_date": "2011-02-20"
  }, 
  "4lgJFMAwsvQGkHj3GkH2pA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mia L.", 
    "review_text": "Soggy pizza. Went at dinner time on a Sunday -- the restaurant was not busy and yet we got zero service: no utensils or napkins, no water refill, no concern that our food took 30 minutes to arrive (larger parties arriving after us had been served), and no checking up to see how the food was or whether we wanted a to-go box.   Lame.", 
    "review_date": "2014-03-16"
  }, 
  "ZQu4Pw0NtxmQUdwT-DUJNQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Fal A.", 
    "review_text": "Great prices on beer. This is a pre-drinking kind of bar, before you go out \"officially\", you should stop by here and have some Pizza and some guinness/stella artois , and you absolutely must try the fried calamari appetizers!! Its pretty boss.", 
    "review_date": "2010-08-04"
  }, 
  "52O5yB6JxzqxssUy7qEtrA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica S.", 
    "review_text": "Part of me wants to come back and see if this place can improve, and part of me already thinks that this is what the review would be if I came back again to try different things on the menu.   My friends actually chose this place to try out, as we all live about 2 blocks away. We were warmly greeted by 2 people, and they sat us quickly and gave us menus. I think that they are trying to be clever and reorient the menu to a landscape style, but it really takes up too much space at the small round tables that most of the restaurant is made up of.   The big gripe I have about this place is that it is WAY overstaffed. I don't know if Bruno (the alleged owner's name) is extremely optimistic, but I needed two hands to count the number of wait staff in the place, and there were only 3 tables with customers around. It makes for having 3 different people come over and check on you, which gets to feel like a mixture of both overwhelming and annoying. There were times when I felt like we spent more time telling them everything was OK rather than just consuming food or talking. The bread came out first, and parts of it were undercooked, and came away doughy. The eggplant soup was just OK. It seemed to want to be both creamy and healthy at the same time, and it just couldn't make up its mind which. I was grateful that it wasn't over salted though.  They are accommodating with their menu items, taking the peas out of my risotto (that's one star alone), and making the pizza my friends wanted without pesto, and with red sauce instead. That took a little bit more explaining, but we managed it all in the end.   The risotto, even pea free was meh. The rice wasn't cooked properly, and it got that gooeyness that comes with the lack of skill that it takes to make risotto. It's why I picked the dish actually - to see if they could actually make it properly. The grilled chicken in it offset the texture of it nicely, though the mushrooms didn't help the gooeyness.   One of my friends HATED the pizza, but I think that was because it felt too healthy to her. She likes Extreme Pizza down the block, which I think explains her terrible taste in pizza. Her wife liked it, and I agreed. It tasted very fresh, and there was a good crust : sauce :  toppings ratio going on. I would definitely consider making this place a pickup/takeout place for pizza, since it is so close to home.   We ditched dessert, mostly because all three of us were a little weirded out by the abundance of servers in the place. It made it feel crowded and empty at the same time. I don't know if I would want to come here again more because of that.   Place does have a bar, but I couldn't tell if it was a full one, or if they just served beer/wine. They do have a flat screen TV though, and an open kitchen. I hope this place can find its footing, and figure out exactly what it wants to be (and how many servers they want to have).   Best of luck, Bruno's. I hope you make it as a decent pizza place in my 'hood.", 
    "review_date": "2009-02-10"
  }, 
  "rvxxmHFLzY911MMubS45jQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy M.", 
    "review_text": "Well, I can't give this place less than 5 stars because I can't really think of anything I didn't like about Bruno's. They have pizza, pasta, salads, appetizers, beer and wine..... what more can you ask for? We had a greek salad (which I highly reccommend) and sun dried tomato pizza and it was very yummy. I like pizza that actually has sauce on it... not just a dab... this had sauce!!  It's a chill place to go have dinner some friends, or to go on a date with the other half. It's very nice inside and all the people who worked there seemed very friendly!!  Try it out..... prices are reasonable! We will definitely be going back.... a lot!", 
    "review_date": "2009-02-06"
  }, 
  "Mppd6g6at6sK1YFfBr6JGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "TeeBee K.", 
    "review_text": "This pizza lady comes to my door, in the Tenderloin when most people call from their car. Props girl, props.  Margherita pizza arrived hot, delicious and surprisingly non greasy, but missing the pepperoni both times I ordered.   The fried calamari was good and didn't have the consistency of gummy worms. It was mostly those spidery looking pieces tho- not that cool.", 
    "review_date": "2013-04-22"
  }, 
  "pXeGiGgexdzYoVz-uhObAw": {
    "user_rating": 2.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Kim S.", 
    "review_text": "Didn't go for happy hour &amp; based on the other reviews, probably should have.  Was hitting a late night show @ Yoshi's so ate @ Bruno's much later than 6p.  Got a medium (no sized small on the menu) pizza w/3 toppings for $18.  Well, it looked like a small pizza @ other joints.  Not enough sauce, lacked oomph...was there any garlic...underwhelmed.", 
    "review_date": "2011-06-25"
  }, 
  "p0ZVT8wjQdVJ0ao_KB-pLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve F.", 
    "review_text": "Tasty food, and a limited, but great, selection of beer and wine. They have Dogfish Head 90-minute IPA, Lagunitas IPA, Widmer hefe, Rogue Dead Guy, Guinness, seasonal Sam Adams, Stella, and more!!", 
    "review_date": "2013-04-13"
  }, 
  "Xbyf2Dj8B32eO4f2u8yOyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie F.", 
    "review_text": "Saturday. Rainy day. Slightly hungover and unmotivated day. Went for a run and all I want is a burger kinda day.  Bruno's is new to the hood, so I thought I would check it out to see, in an off chance, if the pizzeria had a hamburger. Indeed it does! And, even better, it allows for online ordering. This may sound lazy, but I feel like getting to order online:  1. Lowers my stress of having to deal with stupid telephone conversations where one person can't hear because the restuarant is too loud 2. Cuts down on the human error on the order-taker side. Mistakes will mainly be mine.  I order my burger, and run off to pick it up. Of course, it starts raining the moment I hit the streets, but oh well! I arrive to Bruno's with a few minutes to spare, and the folks there let me know several times that my burger would be right up. I must have looked in a hurry or something... I was perfectly content sitting someplace warm to watch the NCAA game on their big TV.  I know this is a pizza place, but the burger? Let's just say I will be going back again for this bad boy. Big, juicy, with some sort of spice in the meat (it has a chipotle sauce, but I think there is something in the meat, as well) that makes it a little different, and delicious tasting. The serving of fries was so ample I couldn't finish -- a first for me! All for under 10$.  The place was pretty empty -- but I hope to see it fill up soon. This area needs good, reasonably-priced food. And you get a discount as a Club One or ZipCar member. I'll definitely be back again soon!", 
    "review_date": "2009-03-23"
  }, 
  "MAo7Qi5tICL5spQbHi2J9Q": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Adam K.", 
    "review_text": "Saturday Night, February 23, 2013:  Me, my wife and my friends ate here before going to a concert at the Fillmore, around the corner.  Appetizers: Fresh Mozzarella &amp; Caesar Salad  Entrees: Grilled Chicken Sandwich W/ Bacon and Avocado, Margherita Pizza, Chicken Fettuccine, and Chicken Picatta  Overall - okay, not great, it was convenient, nice atmosphere, great service, but the food was mediocre. Nothing special.   We inquired about coffee after dinner and our very nice waitress warned us that they don't offer free refills so we went to the Starbucks down the street on our way to the concert.  I'd go here again, though, if I was looking for a place to eat near the Fillmore.", 
    "review_date": "2013-02-24"
  }, 
  "03MW060PYlmyj9k6bsfDhg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Juan O.", 
    "review_text": "Great food , pleasant staff and no waiting.  Great place to eat before a show at Yoshis Jazz club.  Highly recommend.", 
    "review_date": "2014-01-25"
  }, 
  "WXBUnuc-QixTKUGEO1qhcA": {
    "user_rating": 3.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Joni H.", 
    "review_text": "This place had great service and wonderful beer....but the entrees were very so-so.   We had a calzone and it was all dough.   There were very little fillings and it was so dispointing.   Our friends pizza was ok...but very little meat.   Overall a disapointment.", 
    "review_date": "2013-04-17"
  }, 
  "RFuMyqihKYlTKx8SNAjrVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamar D.", 
    "review_text": "I ordered super late night and had a great experience.  The pizza arrived within an hour, hot and with peppers and cheese.  Usually you have to ask for that.  Nice to automatically include.  The pizza itself was good.  The calamari order was a little light in amount but taste was decent.  The tartar sauce had way too much sugar for my taste, though.  Would totally recommend for late night delivery.  I will say that I thought it was expensive for a pizza place.", 
    "review_date": "2014-03-09"
  }, 
  "jFmb2Njk5R5ihp5aDIiaIQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priscilla G.", 
    "review_text": "We were looking for a good pizza place besides the typical Domino's or Pizza Hut. And since Bruno's is right underneath our apartment building, we decided to go there since a lot of our colleagues talk about it. We had the Hawaii 5-O XL pizza and some garlic bread with marinara sauce. It was pretty good! Size was good and taste was good. However, they took a very long time to approach us and take our order. We sat there and the waitress didn't come on over until about 20 mins of sitting there. Other than that, it's a nice chill place to enjoy some good pizza and a full bar!", 
    "review_date": "2011-09-14"
  }, 
  "qbJWyx6mGIF8ijC_Et0lhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kathi k.", 
    "review_text": "I have been anticipating the opening of Brunos for a long time! Living across the street from the restaurant I have been watching the progress of it's construction for the last six months from my bedroom window.    I was so excited to eat here on Sunday night. The staff was extremely courteous and attentive.  The Bruno's Special Pizza was delicious and washed down with White Ale on tap was exactly what I needed on this rainy night.  The tasty crust is thin on the bottom but full on the edge.  The tomato sauce is incredible and I love the cheese they use to top the pizza.  To me that's all you need for a successful pizza- good crust, tomato sauce and cheese. Bruno's has executed the three masterfully.  The spaghetti I tried was good not great.  I tasted a lot of lemon in the noodles- which is good but was just not anticipated.    They also delivered a tasting of an eggplant soup (on the house) which was a little bit on the dull side but, am sure, is very healthy.    Looking forward to trying Bruno's other pizzas and catching a basketball game at the establishment.", 
    "review_date": "2009-02-11"
  }, 
  "3yeBxgUCl6sXtn2GTX1UNw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dennis L.", 
    "review_text": "Came in on a Wednesday night and were directed to any seating of our choice. The place wasn't entirely empty and based on the Yelp reviews, I had decent hopes. I can see how it would be a prime location for quick dinners before or after shows at Yoshi's.   Ordered:  Onion Rings - AI thought they were decent. I usually like dipping onion rings in ranch and the consistency of ranch resembled mayo more than anything  Half.Half Bruno's Special/Vegetarian - like a Supreme or Veggie pizza anywhere else. I can't place entirely why I didn't enjoy the pizza. The dough was hard and the ingredients tasted store bought. I'm not saying that I expected everything to made in house, but the sausage tasted no different than something you'd get at Domino's. I was just not impressed.  The next day, someone gave me leftover Pizzeria Delfina and OMG it was still a day later so much better than what we had eaten the night before.  ____  Parking is a little tough, but if you don't mind walking through the shady areas, theres more parking further away Oct '11 Health Score - 98", 
    "review_date": "2012-02-29"
  }, 
  "KYPOgo3QptXs3YcbSFvfGQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tawnee K.", 
    "review_text": "Quite possibly one of the bigger let-downs I have experienced. Bruno's has the certain je ne sais quoi that pulls you in &amp; makes you excited to eat. The classy sports bar &amp; grill curb appeal always draws my attention when i walk by, so I was eager to get my mouth around their food.  I'm not fancy by any means, I can enjoy simple staple foods. This was not simple, this was completely lack-lustre.  I got the Cajun Chicken salad. It was entirely absent flavor, and even more so, absent lettuce. The chicken seemed like a previously frozen Costco patty. It lacked flavor, had a degenerated texture &amp; was entirely unappetizing.   My mister got the Italian Sausage sandwich and his face turned from anticipation to disappointment the second our plates were placed before us. The boy loves sandwiches. *loves*. And it does sadden me to see him unable, or rather, unwilling to finish a meal. The link wasn't Italian Sausage, so much as it was a boring hot-dog. It was completely hidden by a way-too-large hard bun, but surprisingly not covered with sauce. As if you even had to ask, the fries were mediocre as well.  The only stars go to the lovely, personable bar-tender who also acted as our waitress. She was upbeat and inviting &amp; I would go back to sit at the bar &amp; get a beer that can't be messed up.", 
    "review_date": "2011-07-25"
  }, 
  "_hXPFGok5WRD_Z53J-KTuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert H.", 
    "review_text": "Good food for the price paid along with some good music.  Staff are friendly and helpful.  If you're in the Fillmore, it's worth checking out.", 
    "review_date": "2009-09-07"
  }, 
  "I8eQxht8N9lN0h86nO8K2A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marie-Claire R.", 
    "review_text": "I had dinner at Bruno's last night for the first time...it wasn't bad but I don't know if I will be in a rush to go back anytime soon. The cajun chicken salad was good, but the pizza was just ok. And being that there are so many good pizza places I don't see how they will be able to stand out.  I will say that the service was good and the atmosphere was very relaxed. And you get 10% off if you are a club one member.", 
    "review_date": "2009-03-18"
  }, 
  "EZDA0JnQXTSmUGMeDNaYxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry G.", 
    "review_text": "The five stars comes mainly for the staff - extremely friendly waitresses, and the owner is a great guy. I wandered in here after a rather... long... evening, and left my wallet sitting on their sofas. They returned it to me with smiles the next day, and had a little laugh. I've had a limited selection of food from the place, but it is a go-to staple for a take-home chicken sandwich. Great price, and pretty fast.", 
    "review_date": "2013-12-26"
  }, 
  "qrlw6PZaU7FtQuAXdPFciQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine V.", 
    "review_text": "This is for their delivery service. We've never eaten at the location, but passing by on Fillmore it looks like a very clean sports bar.   We order from Bruno's when Bambino's is too busy and we want really rich pasta. Their lasagna and ravioli are pretty good. These are both things that would take some effort to make at home. Delivery is fast, and if you order online, very efficient. They show up at the door and simply hand you the food. Never had the pizza or other menu items.", 
    "review_date": "2013-07-26"
  }, 
  "fhtmsQDGMTFL1qI8aOQTxQ": {
    "user_rating": 3.0, 
    "user_location": "West Roxbury, MA", 
    "user_name": "Jason B.", 
    "review_text": "A not bad pizza place across the street from Yoshi's. My wife &amp; I got the Bourbon Street pizza, with sausage and chicken, and it was quite tasty.", 
    "review_date": "2009-11-02"
  }, 
  "Bx4TnEGP35miIwu3mek_4A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anette N.", 
    "review_text": "Went here for drinks to shelter us from the cold wind that prevented us from truly enjoying SF's gallery art walk. My friend had a list of places to go to for cheap beers. Came here assuming that beer would cost around $2.75. According to our waiter, they changed prices the day before so beer costs $3.60. We came around 8PM and even though they had a good selection of beers to choose from, they ran out of the popular beers. Definitely annoyed me. Two of my friends got hungry so they ordered calamari. It was pretty expensive since they gave such a small portion. The calamari didn't taste good and we wished they applied the happy hour price for an appetizer.   I suggest eating and drinking at Bruno's during happy hour. If you are here after happy hour, I suggest you go find another restaurant/bar: they would probably run out of the beer you want and the price of the food is a bit too much for something mediocre.", 
    "review_date": "2010-09-12"
  }, 
  "PXUe1a0B8YUCAg2UyMJ8Eg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine L.", 
    "review_text": "well gotta say probably the best garden \"side\" salad ive had from a pizza place but the calzone i ordered was seriously lacking in the cheese department, no good... unless of corse you want another salad stuffed into a crust. flavorful and seamingly healthy overall.", 
    "review_date": "2012-03-10"
  }, 
  "M_v6XSNkDOnPDQTzxrpXOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rick T.", 
    "review_text": "Stopped by for happy hour and food during MNF. Nice, cozy neighborhood spot. Not too crowded so you can easily get a prime seat to watch games. Good happy hour specials, especially the Dogfish. Apps and pastas were fine. Nothing that blows me away. Staff is friendly and attentive.", 
    "review_date": "2012-01-10"
  }, 
  "UA-JRbKDmkZfoKLc4Xc5tw": {
    "user_rating": 5.0, 
    "user_location": "South Los Angeles, Los Angeles, CA", 
    "user_name": "Joanna Z.", 
    "review_text": "Pizza is so delicious! Best pizza slices a girl could ask for a reasonable price. Crust is thinner which I love and cheese is soo gooey! Must go to! Plus it opens late for midnight snacks!", 
    "review_date": "2014-09-07"
  }, 
  "M4OZcoLHydGc-M5TTE5Qpg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Molly P.", 
    "review_text": "Good place for simple food and cheap beer, but I had a disappointing experience with a \"create your own\" pizza that came out with the wrong kind of onions and barely any sauce.  If you're ordering pizza, I'd say don't create your own, just order one of the existing kinds, and you'll probably get a better pizza.    The appetizers cost as much as entrees, which is frustrating.  All in all this place is okay but not special.  Next time I want pizza I'll probably go to Fat Angel and get the flatbread.", 
    "review_date": "2010-08-26"
  }, 
  "-20eaO0uYbl2IY1HcyZj3Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tai N.", 
    "review_text": "I was hoping this would be our hang out spot for when we craved pizza but the food was average.  The owner did serve us the first slice of the pizza which was a nice gesture.", 
    "review_date": "2009-03-07"
  }, 
  "-Fa38LRnHRtsgZB3H-53gw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan L.", 
    "review_text": "After an exhaustive search over 9 years through all the pizza parlors, Italian restaurants and late night take away spots in San Francisco my New York husband has finally found a pizza in San Francisco that he deems to be \"GREAT\". At one point, I had a very solid \"Good\" rating from him of Golden Boy but the elusive perfect pie stayed at bay. But like all happy and good things, we made the \"GREAT PIZZA\" discovery when we were least expecting it or seeking it out.  At the suggestion of the woman who waxes my eyebrows (thus making her an expert in things I love, natch), we gave the new Bruno's on Fillmore a try on Sunday. Suffering the lingering effects of a REALLY fun Saturday night, we went to <a href=\"/redir?url=http%3A%2F%2Fwww.sfbrunos.com&amp;s=4af7dc15dd61e13e8648208f25e379196b5c3fb5912b1c342294a1b2426148ab\" rel=\"nofollow\" target=\"_blank\">sfbrunos.com</a> and placed an order for pizza, calzone, spaghetti, buffalo wings and tiramisu (Don't judge! It was supposed to be lunch and dinner!!). Everything we ordered was fantastic.  Their pizza is the right blend of savory sauce, perfect crust and authentic pepperoni...the very pizza that you find in every nook and cranny on the East Coast but which only often exists in your imagination on the West Coast. The calzone was stuffed with fresh ingredients and the crust is an herb garlic buttery shell that could stand completely on its own.  Delivery is quick and easy and prices are on the low side for pizza and a little on the spendy size for pasta so order both and they will balance each other out!  We haven't yet dined in at the restaurant, but I've driven by several times and it is new and looks lovely - they even have iron tables with crisp tablecloths lining the sidewalk in front...you might think you were in Rome were it not for the Fillmore hustle and bustle all around you. Ok, maybe Rome is a stretch.  You might think you were in North Beach, were it not for the housing projects in the background??  Great Pizza.", 
    "review_date": "2009-05-30"
  }, 
  "k54dZhwDMQ7F5uLqe2VFow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam B.", 
    "review_text": "Eh... mediocre pizza. We ordered a large that was half \"margherita\" and half \"Sonoma spinach chicken.\" Pizza margherita to me does not me regular cheese pizza with a couple sliced tomatoes on top. It was average-at-best cheese pizza.  The Sonoma spinach chicken half was marginally better. It was somewhat spicy and included peppers, onions, olives, garlic, and (obviously) spinach and chicken.  We also ordered a spinach salad with goat cheese, almonds, and cherry tomatoes, and supposedly a raspberry vinaigrette. I don't normally order salads at pizza places (cmon, did you really go there to eat something healthy?), but we had a $40 LivingSocial deal that we had to use in one sitting and the pizza was only about $20. It was too lightly dressed, but otherwise it was fine.  Bruno's has a good beer selection. I was pleased to see that they served one of my favorite beers, Dogfish Head 90. On the menu it was $2.75 for a half-pint, but on the bill it was $3.66. Not sure what the discrepancy was, but I didn't question it because we had the LivingSocial Deal that we just barely exhausted. Either way it wasn't a bad price.  I probably won't be back unless I'm really craving a beer and I'm not hungry.", 
    "review_date": "2010-10-07"
  }, 
  "q6QsCHW-ZrJqWYTDLbpF_w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna H.", 
    "review_text": "I have been to here for couple of times. Whenever i am here, i always get garlic fries. Their garlic french fries is soooo good!!! Pizza is also good! But I strongly recommend their garlic fries if you are here.", 
    "review_date": "2014-10-23"
  }, 
  "Dj77pkw_EZJvR-F4RIf_BQ": {
    "user_rating": 3.0, 
    "user_location": "Reno, NV", 
    "user_name": "Jen W.", 
    "review_text": "happy hour is everyday from 3pm-6pm!  half off appetizers and beer...super awesome on a monday night while watching some football on their tv screen and munchin on some fried mozzarella.    a lot of peeps come here just for the happy hour...the bar is full of guys that just got off from work and are throwing down a pint before heading home.    wifey and i decided to check this place out for dinner.  we ordered the fried mozzarella and fried zucchini as an app...pretty decent.  nothing special but the cheese was deliciously ooey gooey!  we ordered a pizza...half hawaii 5-0 and half combo...the hawaii 5-0 was an interesting combination of pineapple, jalapenos, chicken, sun dried tomatoes, and pepperoni...hmmm, it just didn't work.    overall, the pizza itself was good...the crust was cooked perfectly and the toppings were plentiful.  what made this place shine was the service!", 
    "review_date": "2010-10-03"
  }, 
  "bPjNx1NuHCOTAC4FbxB-BQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Mike T.", 
    "review_text": "Good beer. Margherita pizza was good. Basil and tomatoes were fresh. Bartender was apathetic and place was oddly filled at 6pm but empty by 8. Clearly we were missing something...", 
    "review_date": "2014-09-10"
  }, 
  "PlF6dpTrKhWeDqxxMuR2SA": {
    "user_rating": 3.0, 
    "user_location": "Denver, CO", 
    "user_name": "Rhi G.", 
    "review_text": "Meh. The absolute best thing about this place was the $2.50 for all beers policy. Other than that I had the calzone and my boyfriend had the fettuccine alfredo. Not terrible but definitely nothing to rave about.", 
    "review_date": "2010-03-30"
  }, 
  "rWDZ20zpA6S5MmfZ2gVuiA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandi L.", 
    "review_text": "Okay so I live right around the corner from this place.... We decided to try it out even though every time we walk by it, its almost empty.  I had met one of the day manager, can't remember his name, but he was a total douchebag so I just assumed this place would totally suck it up. I was actually pleasantly surprised. Of course it was dead. You'd think the service would be faster though. The girl was real nice, but everything took forever. We had a medium aloha pizza (canadian bacon and pineapple). it was good. If you split it with 2 people, you'd both get 3 slices. I enjoyed it, I wasn't very hungry so that was just right for me. My fiance got a calzone. He assumed it would be \"hot as balls\" and hugely disgusting like the one that is advertised at Pizza Hut, but he said it was really good. I dunno.... it wasn't that bad but I dunno if I'd go back. Then again, I'm not a pizza person.", 
    "review_date": "2009-11-22"
  }, 
  "TiLMZ3Cqr3X0UQS-s_Ls4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diane B.", 
    "review_text": "Bruno's is strategically located just adjacent to where I teach spin; in that context, my standards for food are not high: fresh protein QUICKLY available. Thus, I'm a fan for getting just that tonight.   Specifically, I was weak and light-headed ordered the Santa Fe chicken salad and got the straightforward greens + ample chicken breast. And I got it FAST. Under $10. And served by Mike, who was really cute. \"Yay! I'm a fan\": I'll be back @ my next \"must have food immediately after spin\" crisis!", 
    "review_date": "2010-04-08"
  }, 
  "SSvFjLhejlkFRIZsQCBuKQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "josephina k.", 
    "review_text": "This is my first yelp review and probably my last.  I literally joined just so I can warn the public about this AWFUL place. I've never had worst food! The southwestern eggrolls were obviously frozen and something you can easily buy at safeway (and they would probably be alot better). The spaghetti bolognese consists of watered down, bland tomato sauce, mozzarella cheese and a few meat balls. It is safe to say that the chef has never even heard of a farmer's market! It really is a shame when a restauranteur has the opprotunity to open a place in a culinary mecca like San Francisco and they end up serving contrived, unimaginative, (and depending on what you order) frozen food.", 
    "review_date": "2009-05-25"
  }, 
  "uTDxT-lAVI31gBg9Fgz8hQ": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Nick K.", 
    "review_text": "It's extremely hard to beat their happy hour special: $2.75 for a pint of Dog Fish Head, Rogue Dead Guy, Guinness or any other beer on tap.   Outside of the happy hour window, there really isn't anything too great about Bruno's. The atmosphere is kind of bland, the food is okay (typical bar fare) and the price is not always right.  However, the Friday happy hour lady 'tender is quite friendly and the free mini pretzels are much appreciated. So, overall Bruno's is A-OK.  The advised plan of attack: Stroll in on a Saturday afternoon, have a few discounted pints, eat some pretzels, and head elsewhere for dinner and/or some late night shenanigans.", 
    "review_date": "2011-04-28"
  }, 
  "KzrfdtTlGYX3tGflJ0JRbg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Hira M.", 
    "review_text": "Being right next to my apartment, Brunos has always been my go to place. Not because I didn't have any option! I had options but this place makes sure that it becomes a second home to you! The staff is really friendly!! Food is great (the choices are somewhat limited though but quality is always the same i.e good!!).  Umm the beer is somewhat expensive but I believe the ambiance, food quality and taste does the justice!! Now I've moved from San Francisco but I really miss watching the game, drinking beer and having their great pizza every now and then!!  Would definitely go there whenever I'm around!!", 
    "review_date": "2014-05-27"
  }, 
  "hbkzlNSNMcXEL-h3jzS2SQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyler L.", 
    "review_text": "I came in here on a date the other night and when I first got in a was thinking \"oh this place looks cute..and they have a GREAT beer list!\" The owner (i believe) was very friendly when we came in. I ordered the lasagna and she ordered the chicken fettuccini. My dish was by far better (her's was a little bland). My major critizism was our waitress. She wasnt very friendly and brought us our check instead of asking if we wanted another beer or dessert (which we wanted but went else where since she just assumed we were dont). I dont really think I will be back, unless to watch a game and have a beer", 
    "review_date": "2014-04-23"
  }, 
  "ctU-R89nKL2-A8ze9I-6AA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh S.", 
    "review_text": "I've only had a few things here, but they were pretty good. The pizza is awesome and so are the calzones.  Service is pretty good both over the phone ordering take out &amp; also when you eat there. The atmosphere is pretty relaxed. There's a pretty big flat screen TV in the middle of the place that is big enough to see just about anywhere in the place. You can eat in the restaurant or eat outdoors. If you eat outside, the sidewalk is big enough that you don't feel crammed in.", 
    "review_date": "2010-07-14"
  }, 
  "qK1GKo3gh2J-avGSocfANw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole W.", 
    "review_text": "My BF and I went to Bruno's Thursday 2/18/2009. We drove by and saw that their grand opening sign and decided to check it out. The staff was very friendly and we met the owner Bruno, who was also very friendly. We started off with the hot wings, which tasted like the ones you get from Costco. I ordered a dinner salad and my BF ordered soup and both were pretty good. For dinner we split a calzone that was really tasty.  Aside from the frozen wings we had a very pleasant experience. We would go back again.", 
    "review_date": "2009-02-22"
  }, 
  "4G2gjDsQmQqmSTCPlwie9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron M.", 
    "review_text": "Bruno's is not the place to go for excellent food, a trendy atmosphere or a wide drinks selection. They don't even have a full bar! But for what it is, I like Bruno's and will continue to walk in when I want a cheap filling meal and watch the game. Happy hour deals are solid, wait staff remembers you even if they aren't service pros. Pizza isn't fantastic but if you're drunk enough it goes down easy! If I didn't live so close, I would basically never go out of my way to come here but if you're reading this as you stagger down Fillmore, do yourself a favor and put some carbs in that belly before you call a cab.", 
    "review_date": "2014-09-10"
  }, 
  "5XO4iBD2JlZIoym9fDMV6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin B.", 
    "review_text": "Came here on a Saturday afternoon, and the place was dead. We ordered some lagers on draft, and a large half hawaiann half margarhita pizza. to be honest the beer was tasty, and the pizza was not bad. It was fresh, hot, and tasty. The place has a cool atomosphere and open air seating which i like. id come back", 
    "review_date": "2014-09-16"
  }, 
  "7Ocsisgc0eRz_w8xzOnghw": {
    "user_rating": 2.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Julian N.", 
    "review_text": "DON'T TRUST YOUR GPS!!! This joint is on Fillmore regardless if your GOS tells you to turn on Ellis (Google Maps Navi) otherwise this place is good for a slice or 2 of great tasting pizza after some drinks nearby. Over priced @ $3 a slice + $.50 per topping? Yes. Crummy service? Oh yes. We asked for a hot water, twice, and both times the server said sure, to no avail. When I co fronted the server about the hot water order I was told, \"I'm too busy to make it.\" Too busy to boil some @%&amp;$ Water?! Man, that's rough considering we were 3 people in a group out of 6 people that were in the damn place at 11:32pm. And yes, thanks to Yelp's new feature I'm posting here as I'm eating. Anyways, we're eating the Margarita pie and its super tasty, though again, service sucks...not worth my 15% tip.", 
    "review_date": "2013-12-07"
  }, 
  "V82w6moOmjW7svWbd9eBAA": {
    "user_rating": 1.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Matt B.", 
    "review_text": "This is purely based on their pizza as I have had nothing else there.  Your average frozen pizza is better than the pizza here.  Very seldom will I stop eating a pizza before I am full.  Overpriced and below average.  There is no way I would ever eat a pizza from there again.  For the money you could go to Safeway and get a better frozen pizza and some beer.", 
    "review_date": "2009-08-16"
  }, 
  "-CBHrlm3n1KCsCb69AMePA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny K.", 
    "review_text": "I'm from the East Coast so finding Dogfish Head Ale (and for a deliciously inexpensive price!) made my heart sing. I made my own pizza...loaded a pie with goat cheese and pesto...and I was in heaven. Even the take home box was cute.  Oh, and the little dishes of free pretzels at the bar forced me to spit out a Seinfeld quote after each glass of beer.  I think in the future I'll go to Bruno's for the beer--the pizza was a bit pricey for me.  I came back to this post after my second visit to give it the 5th and final star. The staff are a bunch of dearhearts. And this is the cheapest place to enjoy pitchers of yummy beer. They had Dogfish Head 90 Minute mixed with Rasputin...excellent!!", 
    "review_date": "2010-03-30"
  }, 
  "yq_qqNHc3zR1Zi1Qj0sB3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber P.", 
    "review_text": "Bruno's is a great little neighborhood place. They serve pizza, salads, burgers, pasta...typical fare. It's good for lunch or dinner and they have happy hour. Seating is generally plentiful and their food is pretty good for the type of establishment it is. The pizza is some of the best I've had in San Francisco.   The decor is really nice...seems like you're in a nice old comfy jazz place where you just feel at home. The service is great and everyone is incredibly nice. If you're looking to grab a quick bite or just sit down for a bit to have a cold beer, Bruno's is your place!", 
    "review_date": "2009-10-22"
  }, 
  "At_QB2Kq9YANONrnU0834w": {
    "user_rating": 2.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Rohit S.", 
    "review_text": "Not much flavor to the food, redesigned menu - destroyed all goodness about this place, closes way earlier than advertised time on weekdays, easiest place to catch any games - deadest place on Fillmore.", 
    "review_date": "2014-09-08"
  }, 
  "2wjjPoKIm2E771gE2UkSsQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "marko i.", 
    "review_text": "Food was blah. Older owner/manager who waited on us at the bar was kind of hot and cold. Friendly when we walked in, when we stayed and ordered food and beer, he gradually became less friendly, polite, but definitely decided he didn't like us. Food was okay at best. Beer was like every other beer you can order at any establishment with a license in the city.", 
    "review_date": "2014-08-12"
  }, 
  "5lvfVuWaJPHx93fDQj-teA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Adam O.", 
    "review_text": "So I got here pretty late and they were still serving food which was a Definate plus. Bar was empty so we sat outside. Big windows open to the outside so it seemed pretty open. Service was good. We had the fresh mozzarella ap which was tasty but I wanted more. 3 slices of tomatoes doesn't really cut it. It was fresh and tasty though. We then had the chicken picatta and egg plant Parmesan and both were excellent. Good amount of citrus in the picatta and my vegetarian friend said the eggplant was spot on. Not really a destination restaurant but if you need to grab a bite, your in the area  and you want a safe bet....this would be it.", 
    "review_date": "2011-10-15"
  }, 
  "hj0eXS0TgWtS8aYw7TXdsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph H.", 
    "review_text": "I like this place, the pizza was a 3-4 but the service was good, and it's what gives them 4.5 stars. What counts is how awesome the cooks, and staff are. We arrived in a large group no reservations, and they put the tables they could together immediately, they sat us down served us didn't complain, and all they had was one waitress that did her best, and managed even with a full house and more patrons constantly coming in. The food and pitchers flowed, the food was good, and my only issue would be that the beer was definitely too warm. But the service, and kindness made up for it. Great place!", 
    "review_date": "2014-05-26"
  }, 
  "uRtrQFRnOI33GwQ3PA1dVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin K.", 
    "review_text": "Been here quite frequently lately. It's a great place to drop in for a pizza dinner and some drinks. The staff is always friendly and helpful. The chicken wings are amazing. And the beer is decently priced.  The pizza is not so great though. I mean, it's good, but it's kinda flat and dry. Ah well. Still enjoyable.", 
    "review_date": "2011-01-10"
  }, 
  "Ej58zYMNIfC8RLBtqylagA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nicole m.", 
    "review_text": "Just wanted to add, a couple weeks ago we went on a Sunday afternoon and the wings were half off so with beers and wings we spent $13!!!! And did I mention they are the best wings in SF? I'm from upstate NY where the wings are good and these are right up there", 
    "review_date": "2011-05-29"
  }, 
  "qlWy5_LVTtv7AtWb9ZzwHQ": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Casi C.", 
    "review_text": "All beers are $2.75! Need I say more?!?!   Ok, I'll say a few more words...All the beers are $2.75, like I said before. Including the great selection of draft beers. I enjoyed the 9% abv of the Dogfish Head IPA ($2.75), a Rogue IPA ($2.75), and a Sam Adams Boston Lager ($2.75). The Hawaii 5-O pizza is amazeballs! Especially when paired with $2.75 beer. As is the calamari. The food was not on the same level of cheapness as the $2.75 beers (I guess that's how they get away with the cheaply priced brews), but definitely tasty. I saw several people eating pasta, so when I go back (and yes, I will be going back for some $2.75 beers) I might have to try one of those delicious looking bowls of goodness.  P.S. Did I mention the beers are $2.75!?! Cause they are!", 
    "review_date": "2010-04-24"
  }, 
  "KeGuLjr8x_VDsHspDfrnZw": {
    "user_rating": 3.0, 
    "user_location": "Durham, NC", 
    "user_name": "Rachel L.", 
    "review_text": "Good happy hour, but wish it lasted a little longer.  I don't get home from work in time, so always miss it.   Their slogan is \"We jazz up pizza\". But there is nothing jazzed up about it. It may just be my preference for a thinner crust (so I can taste the cheese on my cheese pizza) so others might like it. But it didn't have much flavor either. Again, it may just be because I had plain cheese, the specialty flavors could be very jazzy! Can't speak to other food.   In their favor, they have a decent beer selection. And they give you bowls of pretzels (which normally grosses me out, but I was starving). And it's not the kind if place where drunk dirty hands are grabbing at them, at least not around dinner time.   All in all, I like having this place in my neighborhood for the good deals and low key atmosphere. I'll be back.", 
    "review_date": "2013-08-30"
  }, 
  "r_etoXEmNJNoySf7yoO1KA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evie F.", 
    "review_text": "We ate at Bruno's for first time on 2/13/09.  Pizza is mediocre at best and it was served barely warm.  The sauce tasted like it came right out of a can.  Service was good though", 
    "review_date": "2009-02-16"
  }, 
  "7M_6FojGZNbT3ZJt_wrV-A": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Braden B.", 
    "review_text": "I had to check these new eats out since I've walked by on Fillmore and noticed the blues a blaring out the loudspeakers onto the street. I came in with another foodie friend of mine and she had a calzone and I had the Sante Fe Salad with marinated flank steak, red peppers, avocado, red onions, and black beans. It was a hearty salad, enough for a meal and dressed just right. The dining experience was the best part of Bruno's, with attentive service, and some check-ins from Bruno himself at our table.   I just read that they offer 10% off for ZipCar users so I'll definitely be back.", 
    "review_date": "2009-03-25"
  }, 
  "VNkEB5PlrESiPP6-3JR-xg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janell D.", 
    "review_text": "We had just come from the Raiders/Chiefs game with our parents who were visiting from out of town- Bruno's was PERFECT.  It was quiet, pretty empty and the food totally hit the spot.  We all ordered starter salads (yummy Balsamic dressing) and a large pizza to share.  The pineapple/jalapeno/pepperoni pizza is super yummy but H.O.T. For a family loving spicy, this threw us for a loop- we were all sweating by the time the pizza was gone.  They have great beer specials, I think $3.75 for all beers after happy hour which is really reasonable for it being Fillmore!  I'll come back for sure- but I may rethink the jalapenos.", 
    "review_date": "2010-11-10"
  }, 
  "1W4FXKzPIiCG2JsDPFlzTg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pat L.", 
    "review_text": "Good $2.75 beers, unimpressive pizza, bad service.  What could fix things?  Pizza that's not just \"mildly better than frozen\" quality.  A server who doesn't go \"BUHHH\" after realizing we had never gotten the requested water to go with salty food (our olives were good though.)  Guess she was having a bad day, and it showed.  (Couldn't any of the 3 who came by have noticed, is it hard to bring water as you seat people?)  OK, it doesn't deserve a slam- it was just unremarkable.  Not 2 stars, not awesome, just a meal.", 
    "review_date": "2010-04-24"
  }, 
  "KzDdqmFfU3hKo3tFnR6uVQ": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Sarah D.", 
    "review_text": "Yeah, we come here a lot. a little too much but hey, their beers are $2.75! I'm not talking about your bud lite variety. I'm talking ALL BEERS ON TAP ARE $2.75. Dog Fish Head, Dead Guy, Guinness, Racer 5, Rasputin's...all $2.75. Talk about getting bang for your buck! Dog Fish Head is something like 9% alcohol. Now that's economical!  The food is pretty good but the music is lousy - all in all a good place.", 
    "review_date": "2010-05-12"
  }, 
  "lkWWdkBRZzq0CyFj73DgaA": {
    "user_rating": 3.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "M-C R.", 
    "review_text": "$1 Coronitas and $2.75 for the other beers. All...day...", 
    "review_date": "2010-09-03"
  }, 
  "newGLjBSOkoj-SEj4CZ6qw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "My BFF was here visiting and we stumbled over this place (literally, we walked from Toronado) as we went in search of karaoke. We were attracted by the giant banner that says \"2.75 drafts all the time\" Cheap booze was all we needed to keep us going...and a pizza. I ordered the cider, but, they had run out earlier that night. I got a bud light, my BFF got the dogfish head ale. We ordered a Hawaiian pizza which was hastily consumed. The only concern was the waitress was very slow in giving us our check. I mean, we had been done for about 20 minutes before she even came up to us to check. Then another 10 minutes to check us out. There was a large birthday party there that night, so maybe they were taking up a lot of energy. I'll give them another chance next time I'm around the area.", 
    "review_date": "2010-04-08"
  }, 
  "2Fc3sdi4VneyJlBH3Ie3xw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zachary B.", 
    "review_text": "Bruno's gets my vote of confidence as they are right next door to where we live in the Fillmore Center.  The food and service has been steadily getting better over the past couple of weeks, and I can see this place becoming a neighborhood favorite.  The pizza is decent, nothing special, but it gets the job done.    Personally, I like to go to brunos to have a beer and order a bunch of their appetizers.  Their garlic bread is awesome, as is the fresh mozzerella app.  Caesar salad and calamari is good as well.    Prices are competitive, plus you can't beat 20 minute delivery to our apartment!", 
    "review_date": "2009-04-17"
  }, 
  "-M0_X_LMxAyScHsLDTaDkw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Jennifer G.", 
    "review_text": "Bruno's on Fillmore is our local pub.  Perhaps not every family with a one-year-old has a local pub, but we do, because they serve $2.75 beers every day, all day.  And good ones, too, like Dogfish Head 90-minute IPA and Rogue Dead Guy Ale and Racer 5 IPA.  But unlike pretty much every other place in the city with good deals on good beer, they love us and little B.  Actually, we ate here the night before B was born, while I was in labor.  It was our ninth anniversary, and we had canceled our dinner reservation at Boulevard that morning when I woke up with steady contractions.  After a full day of labor I could tell we weren't heading to the hospital any time soon, though, so after we took a long walk in the evening, we decided we might as well celebrate!  We walked to this new Italian place that had opened up a little while before, and enjoyed our first meal at Bruno's.  Then we went home and I did our taxes.  The next evening things finally got real, and at noon the next day Baby B was born.  Bruno's has highchairs and extremely friendly waitstaff.  The food is uneven--tonight we liked the ravioli but weren't wowed by the Chicken Fettuccine.  We frequently order the pizza, which is a good bargain, especially compared to Extreme up the street (the DC Mustang BBQ is our favorite).  They aren't breaking any new ground with the food; it's just a really nice place to spend a couple hours with friends, especially if you have a toddler in tow.  High chairs?  Yes. Changing tables?   Nope. Stroller-friendly?  Fairly.  We can always find a place to stow it. Noise level?  Low in the early evening when we go.  In the evenings it heats up due to those bargain beers. General baby-friendliness?  High.  Literally everyone at Bruno's loves our baby.", 
    "review_date": "2010-07-17"
  }, 
  "0LpOrrL-Rz1KIbFAgGBsKA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christian S.", 
    "review_text": "Checked this place out - since it happened to be next to my gym - hey why not right!  Strangely - I got the hankering to order a veggie pizza..which i never do  - well bad move on my part....  Issues. -I requested no olives on the pizza..pizza came with olives..so i sent it back..and 25 minutes later....out came my pizza...which was pretty mediocre..it probably would have been better with pepperoni :) -service was quite unattentive..took forever for the check..maybe it seemed like an eternity since i wanted t get out there.  Bottomline   Ill give this place another shot and see what happens..", 
    "review_date": "2009-04-11"
  }, 
  "rbofc9BEvXlm7RZG0o9eHQ": {
    "user_rating": 4.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Kevin J.", 
    "review_text": "Stopped by for a quick dinner prior to a concert at the Fillmore on Saturday night.  My wife and I split a pizza - combo &amp; Hawaiian combo.  Quality food &amp; service.  Great stop - we'll be back with friends for the next show.", 
    "review_date": "2012-02-13"
  }, 
  "mwML1RyzBswYRi2i5TkTeg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claire M.", 
    "review_text": "There Hawaii 5-0 pizza is so so tasty.  The food is good and atmosphere is so warm and friendly.  I usually go right to the bar and order dinner there.  That way I can watch basketball and chat with Luca who is the attentive and funny bartender.  Every 20 minutes or so, Bruno comes by to make sure we are being taken care of.  This reminds me so much of  some of my neighborhood places in NYC.    My husband and I will come here or sometimes I just come by myself if I don't feel like cooking.  And the prices are not redic either.  Just a nice, down to earth neighborhood joint.  Looking forward to going back soon!", 
    "review_date": "2009-03-25"
  }, 
  "LSQsSMYUdxPs8VXFeYThyQ": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Jamie C.", 
    "review_text": "Pretty cool spot. Food was on point. Nothing outrageously out of the norm, but I liked the way it looked inside. Friendly waiting staff. Decent portion size. Will come here again to try the calzone, and pizza probably. I had the lasagna which probably wasn't the best choice.", 
    "review_date": "2011-12-07"
  }, 
  "wbbAeHIv9651eYj9WiicbA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Samuel B.", 
    "review_text": "Very cozy, yet elegant pizzeria, with delicious appeteasers, large fresh salads, and divine pizza with great sauce and a thick, crisp crust.  OH, AND DID I MENTION THE INCREDIBLE BEER &amp; ALE SELECTION???  To top it off, the owner (Michael) and his son (Sam) are warm and friendly, and make you feel right at home.  HIGHLY RECOMMENDED!!!", 
    "review_date": "2014-03-02"
  }, 
  "Do2W4nySb5D6Cpo1Tyb_hA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "OffToRio B.", 
    "review_text": "Walked in with a girlfriend Friday night at 7:45 and was seated at the bar in about 2 minutes. We lucked out in sitting next to a woman that worked for the architectural firm that designed the place, so we got a little history. The granite bar, dark red walls, darker red ceiling and lights make this a great date spot. It's also a perfect place to eat before an evening at Yoshi's. Besides the musical instruments on the walls, they also have large art pieces for sale. I do think $40,000 is a bit much for a painting with Charlie and Miles however.  We shared an Edge Iceberg Blue Cheese salad ($7.95). It had lovely dressing (and they brought us extra) large chunks of cheese, croutons, hearts of palm and sliced cherry tomatoes. I was practically licking the plate. Mz. Ann had a tagliatelle with ham, peas and an Alfredo sauce ($9.95). I thought the composition was lovely although the sauce could have been tastier. I had the chicken carcioffi with veggies ($12.95). The potatoes were exquisite - braised baby reds. The rest of the veggies were cauliflower, zucchini, broccoli etc that were steamed, a hair underdone, and somewhat lacking in flavor. Chicken breast was a little overcooked, but the sauce was lovely and complimented the artichokes well. We also had a bottle of Ruffino Chianti ($18.00) which is not a great wine, but for the price more than adequate. The waiter left the cork in the bottle after each pouring and I had to put it back, but that's a minor point. The waiters are some of the most drop-dead Italians I've seen in this city, and they pay attention to what you need. Overall, the price is very fair for the quality of the food, and not outrageous for the neighborhood. The wine list is a bargain.  I am definitely going back and look forward to adding a star when they get their groove on.", 
    "review_date": "2009-02-21"
  }, 
  "nLEmRPtgHoumkdvTfNHfTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rochelle E.", 
    "review_text": "So, I returned.  I got the mozzarella sticks without the whatevertheycomewith.  They were delicious, very unexpected, but delicious.  A little pricey - $8.95 - for 8 mozzarella sticks.  Blah, okay.  The service was better than last time, but, their were no other customers in the place when I was there.  Again, the owner seems like he doesn't really care about customer service.  He was standing at the door when I left and I didn't get a \"goodbye\" or \"thanks for coming\".  The end always seals the deal for me.", 
    "review_date": "2009-07-24"
  }, 
  "Sz1ChS5E9bCYxaKwnb8Grg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "chris k.", 
    "review_text": "I live directly upstairs from Brunos and have been in here to drink many times and to eat a few times now .. the only thing the Bruno's staff seems to be competent with is serving beer .. My most recent experience at Brunos was this past weekend when my roomate and I ordered a sandwich and a chickken pasta and were told it would take 15 minutes. After 30 minutes we went down to pick up our food and they seemed perplexed with our inquiry .. we then sat there for another 40 minutes while they made us 2 items? They gave us 2 beers on the house (which they are totally well qualified for) after this our food wasnt half bad. Service level here stinks, though the food isn't bad.", 
    "review_date": "2010-04-20"
  }, 
  "Mx8DbFUMDPl0sPD5y5HaKw": {
    "user_rating": 5.0, 
    "user_location": "Southampton, PA", 
    "user_name": "B J.", 
    "review_text": "We stopped in tonight for dinner.  The salad was fresh, the pizza was hot and the wine was served chilled.  Best of all, the price was very reasonable.  Go for the pizza and enjoy the low prices.  Bruno, welcome back to the neighborhood...you.ve been missed!", 
    "review_date": "2009-03-11"
  }, 
  "IJABCqLsGgT8DxqujUQmiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarcastic T.", 
    "review_text": "We stopped in today and enjoyed the outdoor seating! Great location and I'm thrilled they put the railing up around the cafe tables. The service was superb and a gentleman named Bruno came along and introduced himself to us and admired our puppy.   The pizza was excellent! We have searched and searched for that perfect pizza in SF and this was as close as we have ever found to being our ideal. Yum!   Very happy they joined the neighborhood!", 
    "review_date": "2009-03-07"
  }, 
  "dC5kYsLGGoLLVlMjeMqfLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dru M.", 
    "review_text": "Bruno's has become a go to for my boyfriend and I. One...it's right around the corner from our apartment. And two...I have a healthy addiction to their steak salad. PIcture a bowl of goodness...full of greens, avocado, red onions, black beans, red peppers and tomatoes with delicious steak. So simple, but oh so good. Their garlic bread is legit...with and without cheese.   The bf has gotten the chicken parm, different calzones, chicken salad and a few other things...and has loved it all.   Besides loving their food...they also have a cute restaurant with a large bar. The staff is also very friendly and the service is super quick.   Overall...GET THE STEAK SALAD. Now! :)", 
    "review_date": "2012-07-20"
  }, 
  "lqKjYyeuFtcpbr2P1VeIpw": {
    "user_rating": 4.0, 
    "user_location": "Morgan Hill, CA", 
    "user_name": "Mathew C.", 
    "review_text": "Good food and a really nice atmosphere. Friendly staff and a good selection of beer and wine.", 
    "review_date": "2014-01-01"
  }, 
  "_zT02V9ZbAN2JRCImL2IXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James B.", 
    "review_text": "It's relatively new so the atmosphere is chic and clean. After work, (I work nearby) my co-workers and I stopped by for a draft beer and pizza. The chicken, spinach and cheese (you can select) pizza was very good. I would go back again and will try other items soon. Price is moderate. I noticed the restaurant just added outside seating by the street. It's nice since it's right across from Yoshi's restaurant.", 
    "review_date": "2009-05-01"
  }, 
  "hxHKW9BU9H2D9wKxU440CQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Sean M.", 
    "review_text": "Awesome food, super-friendly staff. And the beer prices can't be beaten. Great selection of drafts, including the phenomenal Dogfish Head 90. I am happy to have Bruno's as my neighborhood hangout.", 
    "review_date": "2010-06-02"
  }, 
  "OFNFtTc48LmXNk_NeZe9dw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amelia M.", 
    "review_text": "This place was really below expectations. The decor is lovely. The food (I only had the pizza) lacks flavor. I had to add balsamic vinegar, pepper and a dash of salt to make it taste better. It is the dough, it is flavorless.   Definitely not worth the money at all.   Service was really good. It is just the food is not up to par.", 
    "review_date": "2009-07-21"
  }, 
  "2loG39q-KBZ6f8ugGbyw7Q": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Valarie J.", 
    "review_text": "As we waiting for a movie over at the Kabuki theater, we stumbled onto this place. It struck our eye when we saw \"2.75 PINTS- ALL DAY EVERYDAY!\" and below had icons of Dogfish Head and ROGUE! This is such a steal as Dogfish Head bottled beer sells for $14 a 4 pack in most liquor stores! Buying a pitcher was even cheaper at $8.95!  We grabbed a pizza too, which was delish, but the beer will keep us coming back!  Service was great, and nice atmosphere with full bar selections and Flat screen TVs.", 
    "review_date": "2010-03-12"
  }, 
  "K1NLdTfT1IizE-6smhsSug": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayrn H.", 
    "review_text": "First thought this place was f'n phenomenal with the $2.75 Dogfish Head 90 Minute IPA's, but that was until I saw they overcharged my credit card a couple of days later.   Walked in on Saturday during Filmore Jazz Festival and sat down to enjoy two DFH's. Paid my bill of $6.03 and gave her a $2.00 tip. Then see that they actually charged my cc...$14.06. Thanks for upping your tip $6.03. Service wasn't that damn good!   Even wrote them on their website to have this reversed, two days ago but am thinking they aren't really caring to respond.   Thanks a lot Bruno's!", 
    "review_date": "2010-07-07"
  }, 
  "rtmt6u29plpLwjkWNLtmXA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carlos D.", 
    "review_text": "Courteous, fun staff. Great food. Nice beer selection (draft and bottles). Good sports games always on the TV screen. Chill, friendly atmosphere. Fast service.   What else could you want in a local restaurant catering to Western Addition locals?  A no brainer: four solid stars for Bruno's. My favorite neighborhood restaurant.", 
    "review_date": "2012-10-02"
  }, 
  "xKpNuBiO8QkjaBKceCvwNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allen A.", 
    "review_text": "What I like most about this place is the staff.... The owner Mike is very pleasant and professional. Its also nice walking into a place where they are on top of their cleanliness.  I think the food is great, and there is never much waiting time for the food to come out. I read on here people complaining about the service, and thats exactly what they are...COMPLAINERS.  The service is EXCELLENT. Its not easy doing what these guys do here, but they deserve all the credit in the world. I would recommend this place to anyone!", 
    "review_date": "2013-12-19"
  }, 
  "dTFhNxs-DJ1RwjVavT0XBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana K.", 
    "review_text": "This place is perfect for dinner and drinks before going to the Fillmore. All beers are $2.75, can't beat that as the same beer, but smaller will be $7.00 at the show.. The food was good, the service nice, the beers cheap and then you can walk to the Fillmore, can't go wrong.", 
    "review_date": "2010-04-12"
  }, 
  "Z7HCPOkQ7q8M8mbZTPUwZg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J B.", 
    "review_text": "Sorry guys, but we can not go back there.  Saturday night we ordered take out Pizza.  We had been running around all day, so it's nice not having to cook and also check the new Pizza place nearby.  We ordered XL 1/2 &amp; 1/2 (Sonoma and Club One)  When I went to pick it up, I was greeted by a friendly lady at the front.  And a gentleman went back to the kitchen and brought my pizza.  We went home and opened the box and we saw only chicken, tomatoes and cheese on the pizza. So we thought that they made a mistake and made only the Sonoma part of it.  We didn't bother to call that night, too much of a hassle.  I called today Sunday night to tell them what happened - I had noticed that there was another receipt that came with the pizza showing a smaller size (large) and a different pizza; I guess somebody got our pizza.  A person who answered the phone was so rude.  He told me that I had ordered the pizza yesterday and I got the pizza, so there's NOTHING he can do!!!  He didn't even want to hear my story. What a customer service they have!!  Especially this is a new restaurant and trying to make it in this tough economy.  I was very disappointed and sad.  I don't like to write negative comments on Yelp, but I can't help it this time.  We go to Yoshi's and other restaurants nearby, trying to support the local businesses. Bruno's looks nice and the the menu is very affordable but............   Hope this comment helps Bruno's think about better customer service in the future. They definitely need better training.   As for the Pizza, it was OK. If you like lots of cheese, that's your place. On the other hand I didn't get to taste the pizza which we had ordered, with more vegetable..  I'm going back to Escape From New York and get my Veggie Combo.   Bye, Ciao/", 
    "review_date": "2009-02-15"
  }, 
  "2RiznzrRsah3Iwv8YpiBPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie P.", 
    "review_text": "just ordered delivery from Bruno's, and I'm so pleased with them I just had to write it down right away.    so, I had just gotten home from work at 11:30pm, and I was SO hungry, but of course there's no food in my fridge.  I dig out the delivery menus, and notice that Bruno's has online ordering (one of my new favorite things) and that their delivery cut off is midnight.  awesome.  so, ten minutes later I have placed my order, and settle in to wait the hour or so it generally takes for a pizza to arrive. . .   but a mere 25 minutes later the delivery guy jolts me out of my internet reverie to hand me a delicious pizza and a gigantic salad!    so, while I'd like to apologize to Bruno's for ordering at the very end of the night, but I'm very happy that they got me my food so quickly!", 
    "review_date": "2010-04-03"
  }, 
  "SV4fFNO61JMTlxTxwESRKg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Travis L.", 
    "review_text": "Holy Damn, this is the only reason i actually made a yelp, at first i thought it was just me but then i read other reviews and reolised they do this all the freaking time! DO NOT ORDER DELIVERY! I ordered using the eat24 app (Which is a really awesome app) and the ticket said 45-60minutes, so an hour and a half later i check in and they say that they sent someone, this store is down the street by the way, probably a 20minute walk from where i was, they say that the driver was here and trying to reach me. Now, im standing outside, on the corner, with no one and no car in sight, my phone hasn't rung once. He finally gets here over two hours after i ordered and tells me some bullshit story about how he was here, called, and no one answerd, so he left. He didnt call the pizza place, didnt refund my card, he just, left? My ass, the food was cold and i swear he must have just have forgoten about me. Read the other reivews, this happens all the damn time.", 
    "review_date": "2014-03-10"
  }, 
  "p-0-WnPB8mTV5b3E0saTGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John B R.", 
    "review_text": "Pizzeria? More like Diarrhea.  They have DogFish Head for $2.75... NUFF SAID BRA!  \"Why does my name sound like a nickname for someones pubic region?\" Forest Whitaker", 
    "review_date": "2010-04-29"
  }, 
  "eGXRRUt2iujlePIu_fnXDA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jay m.", 
    "review_text": "food here is just terrible.", 
    "review_date": "2010-05-06"
  }, 
  "1D5EQITb4hOzPMZT8gDPQQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krista S.", 
    "review_text": "Came here with the bf a couple of weekends ago because I'd gotten an online deal from $20 for $10. Thought I'd give the place a try.  We ordered a medium Club One Special - Roasted eggplant, portabello mushrooms, roasted red peppers, tomatoes, roasted garlic, bell peppers, olives  The pizza was good, but not great. Not memorable. We liked the idea of the variety of veggies, but the eggplant was a little bland and there just wasn't that special something in the pizza.  Other things on the menu sounded good, I'd be interested to branch out and try something else if there is a next time.", 
    "review_date": "2011-01-29"
  }, 
  "Z2PISdtGHThSUUbFccGkrA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Scott G.", 
    "review_text": "Note: This review is based solely on their bar and happy hour.  I have not had any food from Bruno's and have yet to hear great things about it.  But I'm not writing about their food here, folks.  Hell, they could fire the chef and simply make this place a bar for all I care.  I'm here to tell you guys about a great deal that Bruno's manages to pull off: $2.75 pints of any of the many delicious draft beers they offer.  All day.  Every day.  A pint of 90 Minute IPA (which goes for $4 a bottle at most liquor stores)? $2.75.  How about a nice tall glass of Rasputin Stout or Rouge Dead Guy Ale? $2.75.  These bargains alone force me to give Bruno's 4 stars.  I also like how Bruno manages to hire semi-attractive, wild bartenders and waitress whom I've witnessed drinking on the job.  Awesome! I'll probably never eat here but will always consider stopping by here for a drink or two.", 
    "review_date": "2010-03-29"
  }, 
  "UKbUAZX45wnDillEWqb6mw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William S.", 
    "review_text": "Pizza is good, wings are good, but seriously, if a restaurant doesn't know the difference between American Cheese and Cheddar Cheese I can't take them seriously.   Cheap beer is awesome though.", 
    "review_date": "2010-07-27"
  }, 
  "zjWTZQffMRpn5bWDgzaHcw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LoLa L.", 
    "review_text": "This review is based upon delivery and quality of pizza..  It was a late night and my favorite pizza place was closed (Deja Vu), so I wanted a quick delivery, so I decied to call Bruno's which was fairly close..  I ordered the Sonoma Chicken pizza (i believe thats the name) which had baby spinach leaves, grilled chicken breast, olives, bell peppers, garlic aioli.. The pizza, wasnt half-bad, I've had waayy better (at Deja Vu).  I believe it was the pizza sauce that I really didn't care for because you really cant go wrong with toppings, but the grilled chicken breast tasted favorless also.. The cheese however was thick and rich with flavor!  The delivery was fast, prompt, and friendly...", 
    "review_date": "2012-04-13"
  }, 
  "q_cYc9EJN1fzV7zwzc6MkA": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Analisa S.", 
    "review_text": "I didn't eat any food, but stopped in for a quick drink. They have a great happy hour deal and a really good selection of beer. If you sit at the bar, they have the purse hooks I love so you can have your purse down by your knee. The bar is HUGE though, you can't tell just looking at it, but the seats are just a little low so you feel like a little kid.  The bartender was nice and there was good football on, so I didn't mind the little kid feeling behind the bar.", 
    "review_date": "2011-11-05"
  }, 
  "GrktSJ7Bv9t37gwDLIlAwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "2.75$ pints all day !!! sweetness.  This is everything including the drink specials / beer cocktails. The beer selection is good I tell you. You can't go wrong serving Guinness, Dogfish Head, Stella, Fat Tire, Sam Adams, Old Rasputin, and cider. That's like an all star line up right there.  Our waitress was awesome. She was probably one of the best waitresses I've ever had. She would be over at our table in two seconds if we had made eye contact from across the room. That's good.  The pizzas were great too. It was thin and it did not get soggy. We shared a pizza with half of the bayou special on one side and bourbon street special on the other side. I liked both of them. The bayou special was not so salty like most pizzas with clam on it, which was nice. The cheese was not too thick and eating this pizza did not make me feel gross at all.  For three people, we got 4 beers and 1 large pizza. It came out to be about 12$ per person after tax and tip. That's pretty cheap for a nice sit down place like this I'd say. It does look a little on the pricey side, especially when you walk in, but it's definitely affordable and worth it.", 
    "review_date": "2010-04-17"
  }, 
  "x6_8-SBS55EU4xNIjS2rrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "blair k.", 
    "review_text": "im so on the fence between 3 and 4 stars.. the service is always great and the beer and wine and chamapagne is always good... pizza is decent but I had this one pasta dish that was just so awful... And the ambiance is always chill and good time esqe....k.. 4 stars it is... and it is a super good location.. close to me and validated parking for our friends... MY bf always comes here with his friends and they always love it.. I think it is more of a Pub with good food than a Pizzeria that serves beer.  I come here for drinks and it just so happends that they have edible pizza.. like its pretty dang good for being a bar.", 
    "review_date": "2009-10-05"
  }, 
  "hxLQTFMIeezdMnapAZ4Xrw": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "alex g.", 
    "review_text": "I ordered last night on my phone, using their website's online ordering. On the page, it said \"Free delivery!\" but after ordering, the receipt that popped up definitely said $3 delivery charge. That kind of false advertising irritated me so I called to ask and they said, \"Oh, we started charging in January. We will have to change our website.\" No offer to eliminate the delivery charge.  We got the food and it all tasted store-bought. The meatballs looked and tasted like frozen meatballs you can buy at Costco. The marinara sauce seemed like it was out of a jar. Not worth it. Order elsewhere or just make something at home.", 
    "review_date": "2013-08-08"
  }, 
  "icXtXn49JRXM5w_hCbrt9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett W.", 
    "review_text": "So here's the deal.  Bruno's for lunch is great if you're in a hurry. They can knock out a caesar salad and pizza in 15 minutes.  So this would be perfect for a 20 minute lunch for $10.  Dinner on the other hand is solid, especially before a show at the Fillmore. First, order the toasted ravioli. It's yummsters. Then finish off with one of their  pizzas.  Get beer, their sodas are kind of expensive.  Bruno's is an upscale pizza joint, with nice specialty pizzas.", 
    "review_date": "2009-06-23"
  }, 
  "TLVW8-_by4bGXmqSMmr-AQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kalani K.", 
    "review_text": "The place was pretty intimate, had a real mellow vibe.  Nice chill bar with a cherry flat screen t.v. to catch sports. The jazz theme with the music and decorations were cool considering it was Italian food.  Especially enjoyed the Al Pacino, Robert De Niro \"Heat\" commemorative plaque they had posted.    The service was very hospitable and the owner even came up and introduced himself to everyone that was in the restaurant.  Old school moves like that always impress me.      I had a cup of soup, salad, and the Sonoma Chicken Pizza and every dish was good.  There prices are quite reasonable and well worth it for what I had there.    The place had been open for just over a couple weeks, so I definitely recommend checking it out.", 
    "review_date": "2009-03-02"
  }, 
  "ADIMCaJqpUy97l8LMOtHYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda F.", 
    "review_text": "Just ordered from Bruno's tonight for the first time (those pesky fliers DO work).  First off, good customer service. The girl who took my order didn't seem annoyed from the moment she answered the phone (as some other pizza places make you feel), repeated everything back to make sure the order was correct, etc. She quoted me 45 min for delivery. Maybe 30 min later received a call from the delivery guy confirming my cross streets and letting me know he'd be there in 5-7 minutes. MUCH appreciated since I have dogs that go crazy. I like to be able to meet the delivery guy at the main door to avoid chaos. Sure enough he was at the steps of my building in 5 minutes. Also very cheerful and pleasant!  Now to the food...I really do like the pizza! I ordered pepperoni, mushroom and garlic. The crust is on the thinner side, but wonderfully a little chewy. Generous with the toppings, especially the garlic. I love my garlic! I also ordered the garlic bread w/ marinara sauce. It was just ok. It's actually focaccia bread or some type of flat bread, not bad...but I guess I was expecting the traditional sourdough or something.  The  accompanying marinara sauce serving size was generous.  Great experience. Good pizza. Will definitely be ordering from here again.", 
    "review_date": "2013-12-18"
  }, 
  "OY32TwbyMP1z6MIyirm0Yw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vince B.", 
    "review_text": "This is another recent addtion to our Fillmore resturant row.  I believe that they are affiliated with 1600 on Fillmore, just across the street.  To be honest, I like the concept, the chef is very personable, but the food was just ok...they had some authentic italian servers, but I don't think they had a ton of experience.  They were rather unattentive, and kinda slow.  I want to support my local neighborhood resturants, so I'll maybe give them another try...but with Paxti's &amp; Little Star nearby, it's tough...  Oh, they do have one awesome item on their menu that I haven't seen out here since I moved from Chicago - fried ravioli.....mmmmm, breaded/fried, crispy cheese pasta.", 
    "review_date": "2009-02-24"
  }, 
  "pKSVqOWpyVc3dwGogNhphg": {
    "user_rating": 4.0, 
    "user_location": "La Mirada, CA", 
    "user_name": "Anna S.", 
    "review_text": "This place was the most convenient restaurant for us to grab a bite to eat before a show at Yoshi's on a Saturday night. We tried to venture to Little Star a few blocks away and even Fillmore St Cafe (which did not have any seats, and we were not going to eat while standing) so we ended up here instead, but felt good about our fate.   The waitress, Quanie? was very sweet with her beautiful smile, watch out guys and gals, she is a cutie and a great server. She encouraged us to come in the restaurant and made recommendations for pizza. We ordered the Popeye's with spinach, pesto, feta and olives. Prices for the pizza were a little high, but the pizza was good to us.   Chicken sandwich was a good deal for under 9 bucks, with french fries. However, my only gripe was that they could have used a better roll for the sandwich (they used a cheap sesame burger bun).  The server also offered us free tastings of the spicy carrot soup, which was very savory. We even ordered some garlic bread with cheese (a little pricey at 4 bucks for two pieces), but the marinara was creamy and tomatoey which I liked a lot.   I wouldn't say this is a must go to place, but it is worth a stop if you happen to eat right before the show and are not in the mood for seafood at Yoshi's.", 
    "review_date": "2009-08-23"
  }, 
  "b1QHC8ddf96NpOCWWWTihg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brooklyn S.", 
    "review_text": "This place sucks!  I'm only giving it 2 stars because the atmosphere had a cool vibe.  My friend and I came to Bruno's Pizzeria after a show at Yoshi's. (Across the street). It was on the late night , so it was only a few people inside.   We sat down at the bar and the bartender handed us our menus. We were excited to try some of the dishes they had to offer. I ordered the ravioli and my friend order a pizza. ( I forgot the exact name of the pizza ) We waited for 15 mins and our food was served.   First..... My friend couldn't believe her eyes. She thought she was getting punk. Her pizza didn't NOT look like the one in the menu.  So she tried it and spit it back out. She swore that they served her a DiGiorno frozen pizza.  SMH.  Second... I tried my ravioli and basically, I wasn't impressed. The ravioli stated that it came with spinach inside, so I assuming fresh spinach. I was mistaken. It was frozen spinach. I had a few bites and then I couldn't eat it anymore.  Third.. the bartender was nice and all but not once did she check on us to see how are food was and if we needed anything else. She was too busy texting all dam night.   By this time, its only two customers left at Bruno's Pizzeria, so you would think they would have brought back our check in a timely matter. NOT the case!  I was just fed up after we didn't get our change back after 30 minutes.   Please find another place in the Fillmore to eat because Bruno's Pizzeria is not the place!   Please learn from my experience.", 
    "review_date": "2012-09-11"
  }, 
  "xYf9oB8-coHeAkvvEdq79Q": {
    "user_rating": 5.0, 
    "user_location": "Fort Worth, TX", 
    "user_name": "Ed H.", 
    "review_text": "Bruno's s a wonderful Fillmore neighborhood spot. Awesome pizza, lasagna, ravioli, wine and beers. The waitresses are nice and friendly, and nice to look at. giants baseball on big Hi-def, and...the owner is there each night overseeing things. All in all, a great place if you want a locals experience, and not many tourists. Close to the Fillmore, and across the street from Yoshi's. On my most recent business trip, I visited 3 times in one week. Excellent and fresh every time. The atmosphere is also very clean and cool, with a updated modern look, and a jazz theme.Very cool. I entertained colleagues there this last week, we arrived about 9, and they'd loved it too.", 
    "review_date": "2012-07-27"
  }, 
  "mg-HQR5V_geD22hhiHTo6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Demi W.", 
    "review_text": "Pretty good. But not the best. Just a tip, do not get the Bruno's special pizza, it's not good, however the margherita pizza is good. I also have ordered the combo platter on many occasions, it's ok but not as good as it used to be, they now serve the wings as a fried wing they used to be served as juicy marinated hot wings. The cheese sticks are now thicker and harder to chew. Idk if they were being lazy because I ordered at about 12am but this place is starting to drop the ball a little. Anyway some things are good here and a plus is that they are open late and deliver.", 
    "review_date": "2014-10-26"
  }, 
  "8p2sKVE5CE5d1Yuj_O9Zrw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike G.", 
    "review_text": "The calzone is tasty.  Other than that, everything seems to be pretty average.  Everything except the bizarre southwestern egg rolls, or were they southeastern egg rolls.  Whatever they were, they were a tribute to just how bland something can be.  I suppose it is my own fault for ordering such an item at a pizzeria.  You live and you learn.  Anyway, if you are looking for some satisfactory Italian-American food, Bruno's can fill that void.", 
    "review_date": "2009-07-08"
  }, 
  "RxPT7CjNaTdBirCBVj87gQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S R.", 
    "review_text": "I basically live next to this place, and walk by it on the way to the bus stop. I'd check out the renovations each day, and wonder when it would open. After all, that block of Fillmore needs something better than Domino's.  My roommate and I went to check it out opening weekend. We admired the clarinets on the wall (former band nerds, what can you do) and started the buttery-squashy complimentary soup. Then the power went out. The manager hurriedly went out for candles, ultimately returning with a single 5\" stub. The kitchen staff tried to cook using the light of their iPhones. After 20 minutes and steadfastly cold ovens, we gave up our dream of Sonoma Spinach Chicken Pizza and sobbed into our Mexican food up the street.  We tried again one week later, for girls' night out for Valentine's Day. I have one vegetarian friend who also avoids dairy, onion, and garlic; finding a suitable restaurant with a wide array of salads can be *challenging*. But Bruno's came through; she enjoyed her salad, while the rest of us split that Sonoma Spinach Chicken Pizza, saving some for our post-Mission-bar-crawl late night snack. Mmm, ricotta.  I can't comment on too much of the menu, having tried exactly (1) item. But I did enjoy that pizza! My friends and I thought that, given the ambiance and quality of the food, prices were surprisingly non-shafty. I think total came to $8.50 per person! I think appetizers, salads, and the calzones (as entrees) were all *well* under $10.   Bonus points for accommodating our request and switching to the Cal-Stanford women's basketball game on the big TV. I am totally subtracting a star because Cal ended up losing. Come on, Bruno's, you should have stopped the Bears from fizzling in the second half!  Basically, I dig the food and I dig the prices. Also, I like whimsy, and there are some playfully named dishes on the menu, showing some love to Bruno's neighbors in the Fillmore Center. That's cool. I wish somebody named a pizza after me. Well, maybe not, because that would mean I ate a lot of pizza, and that doesn't fit in too well with my New Year's resolution. Anyway, I will definitely come here again and wish Bruno's well.", 
    "review_date": "2009-02-17"
  }
}