{
  "8ph7VS1WW6yJsBhLDJM-kw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "p v.", 
    "review_text": "Brunch here was just okay. Presentation was super basic. Had a butterfly egg benedict and angus steak and eggs. The coffee was quite average and the orange juice tasted like a decent quality supermarket product. Very much felt like we could have cooked this at home in 10 minutes except it wouldn't have cost us $50. The waitress was exceedingly sweet but they were out of several things and she had to come back and apologize for that a couple of times. We ordered 3 times as a result. Ambiance was interesting, very old-timey San Francisco with an emphasis on \"old,\" as in gilt mirrors, quilted seats, pastel colors, heavy moldings. There were a few elderly hotel guests eating there and a large multigenerational Indian family and ethnic us, who seemed the most out of place. It was super quiet in the large dining room, almost hushed, which made me feel a bit uncomfortable, actually. I really wanted to like this place and felt kind of sad about the empty room and extremely boring, overpriced food. Maybe dinnertime is better? I hope so. Afterwards we went to Japantown and bought snacks to fill up. I hope this review doesn't sink this place, because I love San Francisco historical stuff like this, but they need to do something if they want their cafe to be a real destination. Make it more fun please and not so solemn! How about some music? Contemporary cuisine? Or go super kitsch/over the top? Something. Ahhhhhh!", 
    "review_date": "2012-05-14"
  }, 
  "-LwrvRZnR4jj6lUqDEZAxg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mark w.", 
    "review_text": "Sorry, I wanted to like this place. Nice remodel of the dinning room. We were the only party in the dinning room one night.  Service was slow. The waitress was not well trained. We brought a bottle of wine to dinner and she was embarrassed to tell us about corkage.  She opened and started poring for all guest.  Food was marginal. No taste.  Had to ask a few times for check.  With proper training and a little flair, this could be great.", 
    "review_date": "2012-03-21"
  }, 
  "cMJnmHb3rfkutqBvSuCz3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen And Uri W.", 
    "review_text": "*This review is for the bar* Wow... What a great place to have a drink! Hidden at the Majestic Hotel, one of the oldest in the city, is this little wonderful bar. It's small but cozy and drinks are reasonably priced. But beyond the drinks, the service is impecable. Mike, the bartender, is truly passionate about the drinks and he makes them with love. It's is fitting for this old establishment to have such a great, knowledgeable bartender, who truly cater to ones needs and likes.  We've gone three times now, and sure will be back for more drinks in this faboules, throw back place. Cheers!", 
    "review_date": "2012-03-28"
  }, 
  "2Zbbug93dmtp3VNcQReg8g": {
    "user_rating": 2.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Stephen F.", 
    "review_text": "This restaurant is now the Majestic Cafe, located in the quaint Majestic Hotel. My dinner here was one of the most uncomfortable dining experiences I've ever had -- though this wasn't the fault of the management, and the food actually was quite good, if overpriced.  We arrived at 7:30 on a Friday night to an empty dining room. Totally empty. It is a beautiful and ornate space, but with all the mirrors I don't think any patrons could have been hiding from us. It's hard enough to settle in to a nearly empty restaurant, but this was ridiculous. When we left, only two other parties had come in to eat.  To add to the discomfort, our waiter was on his first day serving his first table. A more experienced server coached him through the specials and desserts and watched his performance. Awkward!  I thought my caesar salad was excellent, and a linguine dish was not half bad. But it's hard to enjoy a night out when your restaurant of choice is so clearly off track.  I know I caught Majestic Cafe/Uptown Joe's on a down night, so a 3rd star would not have been out of the question. If you go, you may have a better time. But go soon... or you will miss your chance.", 
    "review_date": "2011-04-17"
  }, 
  "HJrU8B-FGt9huiYZLuhuNg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kim M.", 
    "review_text": "It used to be a great restaurant up until 5 to 6 years ago , changed owner and got really bad to  worse as uptown joe, now back to cafe majestic. We made reservation for Sat. 01/28/12, dinner on open table, no one was at the restaurant but us. Still a beautiful dinning room but the food sucks, it's not an American, not an Italian, not an Indian didn't know what kind food they try to serve and service by manager/waiter/buss boy was bad, we had better at danny's. Also, they canceled my reservation with open table, hello, we were the only people made a reservation and had a dinner. It's very sad that whoever took over the hotel and restaurant don't know what they have and can have. Don't waste your time or money in this place.", 
    "review_date": "2012-01-30"
  }, 
  "VNkEB5PlrESiPP6-3JR-xg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janell D.", 
    "review_text": "This review is really for the (unofficial) \"Butterfly Bar\" right outside of the cafe. Its cozy and perfect for a night cap - buddy up to the bartender and you have yourself a nice little cocktail hour.  The lobby of the hotel is very interesting and very Victorian. It reminds me of a haunted house (in a good way)!", 
    "review_date": "2011-06-10"
  }, 
  "gbpY80XE939rQ3lh9Pxc2Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley W.", 
    "review_text": "I had high hopes but the hollandaise situation on the eggs benedict was not my tastel. I couldn't finish. Incredibly tasty bacon however.   I haven't been to the bar. I may go back after reading the reviews. Check out their happy hour situation.   Beautiful hotel. Parked within 2 blocks.", 
    "review_date": "2014-11-18"
  }, 
  "kFNokJZ-7DWRebk6E9C1GQ": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Emily C.", 
    "review_text": "Very good restaurant. Service was a little slow but very friendly. We just had the ravioli and bread. Bread was awesome and the ravioli had an exquisite sauce!", 
    "review_date": "2013-03-12"
  }, 
  "wbCkK9vVFHsVJRkhGafDJg": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Jodi S.", 
    "review_text": "I really wanted to like the food. But I didn't and I got SO sick after eating dinner there. It was over priced and mediocre at best. I was staying in the hotel and within 3 hours of eating dinner there I was hugging my toilet. I was puking then had mudbutt all night! The following morning I spoke with the restaurant manager and the host guy that was standing there. I told them about getting sick (honestly it could've only been my dinner causing it). And they wouldn't believe me. I was told I couldn't get sick from their food because they only use fresh ingredients....just because its fresh doesn't mean you can't get sick from it! It's all in how the food is handled. The mgr also told me food poisoning doesn't set in for about 2 days after you eat. BS!! I've worked in the food industry and have my restaurant mgr level ServSafe certification. I know for a fact you can get sick from food within 30 minutes of eating. I'm very irritated at the fact y'all wouldn't believe someone can get sick from your food. It happens! You don't have to argue about it! A simple apology would've sufficed but the fact you kept telling me I was wrong &amp; that I couldn't get sick from there is just preposterous. I will NEVER come back. I haven't been sick like this in years.", 
    "review_date": "2013-01-05"
  }, 
  "KmOacbFVIfvIcfgwRPW7Fw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristin B.", 
    "review_text": "This place has gone downhill.  The Butterfly Lounge was one of my favorite bars, so I thought it would be a great place to take my mom for a drink when she was in town.  I ordered French 75s for us, and was served some sort of green martinis.  I regularly order the French 75 at this bar, so know what the drink looks and tastes like!  I politely asked the bartender if he had served us another drink by mistake, and he brusquely lied to our faces that he had indeed served us the French 75 and that was that.  Most places that charge $12 a drink will not only serve you the right drink, but also make sure you are happy with it!  A bit flustered and wanting to have a nice time together, we drank the too-strong drinks we were served.    The real problem came when I tried to contact the hotel manager to talk about what had happened.  I have been by the hotel once and left three voice mails over the course of a week and have not gotten a single response.  Every time I ask about whether the manager is available, whoever I speak to acts totally confused, as if it was the strangest question in the world.  Alas, this was a great neighborhood spot I'll no longer be visiting.  And if the manger is reading this, PLEASE return my phone calls!", 
    "review_date": "2013-07-03"
  }, 
  "zYgstUlIL-TXDuaK-aR79g": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Tim K.", 
    "review_text": "Comfort food, nothing special and city prices. Good bar and decent cocktails. Service comical! Imagine a waiter who has not only never waited tables before, but who has never been to a restaurant and seen anyone else serve. Only one other table occupied, yet our waiter could not keep the orders straight between the two tables. Drinks sat at the bar getting warm, eventually I went and grabbed my own, prompting the bartender to come out and serve other guests their drinks. Waiter eventually asked if we were ready to order, we looked down to remind ourselves of what we had picked, by the time we looked up, he was gone again! At least 15 minutes went by before he returned. A good 20 minutes elapsed between first course and main course. Food seemed to have been sitting ready in the kitchen for ages - it certainly wasn't hot. Three of our party were served, the fourth had to wait some more because our waiter decided to start serving another table. It was a display of charming incompetence worthy of Chaplin. An interesting way to spend 2.5 hours, but I won't be coming back.", 
    "review_date": "2013-01-22"
  }, 
  "i5JiOOqJ4Il98FKq7f9mcw": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Lisa L.", 
    "review_text": "It has been 10+ years since we've eaten at this restaurant.  Last night we decided it was a perfect venue before attending the Edwardian Ball at the Regency Ballroom.  In all honesty the food was fine and the service was unbelievable, literally.  Think Mr. Bean.  We were one of 3 tables on a Saturday night at 7pm.  All customers were in costume attending the same event.  The waiter had absolutely no idea what he was doing and he did it all so earnestly.  He took drink orders one at a time, and delivered them all to the same person.  When we ordered a bottle of wine he appeared at the table with two open bottles, and asked us if we would prefer red or white wine?  We explained that we already ordered red and had no idea about the white.  When pouring, he filled the first glass almost to the top, about half the bottle.  He had no idea what was going on, but he was delightful the entire time and wrote everything down.  The kitchen got the orders right, and although he delivered each entree to the wrong person, we did get most of the food we ordered.  It was quite sad to see this once great restaurant empty on a Saturday night but there is little mystery why the room was empty.  It was frustrating but we kept our humor.  It was fitting for the evening but even if you are nice, service matters.  REALLY.", 
    "review_date": "2013-01-20"
  }, 
  "6RJBeJlbDGrZO91Qc2NG9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A W.", 
    "review_text": "This review is for the \"BUTTERFLY BAR LOUNGE\" ONLY, not the hotel.  I work a few blocks from this gorgeous hotel.  The name of the bar (currently \"The Butterfly Lounge\") changes more than a rapper's handle.  However, the relaxed ambience, \"get away from it all\" feel and very nice bartenders remain.    I recommend this gem of a bar with a sort of a daily happy hour of $1 off drinks, to anyone wanting to get away from the loud and proud crowd after work.  It isn't cheap, but worth it for the chill.  ~Ms. Ali", 
    "review_date": "2012-08-03"
  }
}