{
  "a6Frnz84MJQcHL-BFSqnnQ": {
    "user_rating": 5.0, 
    "user_location": "Orlando, FL", 
    "user_name": "Kelly W.", 
    "review_text": "Walking distance from our hotel. Had breakfast here every morning. The quiche was very filling and the coffee was hot and strong!", 
    "review_date": "2014-07-01"
  }, 
  "WNtaVotVPF7_Pvycj7jlQw": {
    "user_rating": 4.0, 
    "user_location": "Tampa, FL", 
    "user_name": "Lee R.", 
    "review_text": "I order the salmon bagels that were yummy! they were not joking with the capers. not the BEST bagel ever... orange juice was fresh squeezed as promised. latte was amazing and the oatmeal was quite delicious! over all not bad at all :) and not bad prices either!", 
    "review_date": "2013-07-28"
  }, 
  "rVWebsft_jx629iCO6vQ5w": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mo A.", 
    "review_text": "A refreshing surprise for being so close to such a painfully tacky/touristy part of town. The hummus was \"meh\", but the pitta chips were very good (seemed home-made). Delicious salad and coffee with nice outside seating. The cappuccino was beautifully crafted and the buffalo Mozzarella made me kinda weak in the knees.", 
    "review_date": "2010-11-16"
  }, 
  "KxBYaUy007O8hl0LjIVnow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "You won't find a better cafe in san francisco. The food is fresh with a limited but good offering, the lattes are phenomenal and working from the cafe is pleasant as the whir of the coffee bean grinder, the tap-tap-tap as the grinds are placed into the brewer and then the spit of the foamer becomes a rhythmic background beat. If I could only patron a few places in San Francisco for the rest of my life, this would be one of them.", 
    "review_date": "2013-04-02"
  }, 
  "HQJWm2KJIgZX2YSxhCsz_w": {
    "user_rating": 1.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Dusty G.", 
    "review_text": "The staff at this cafe were very nice. However: this place was a complete disappointment.  They got most aspects of our order wrong and worst of all the espresso drinks were un-drinkable. Much better cappuccinos around the corner at DeLise.", 
    "review_date": "2014-12-30"
  }, 
  "F1sBzL5e596rE-Qof5vJPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N S.", 
    "review_text": "Love this place! Great quality, awesome service, free wifi, and great food. A place for a true European Coffee lover.  I would recommend a cappucino or espresso.  If you are not in a coffee mood, the italian sodas are amazing.    The proscuitto is cut perfectly and so tasty. The mozzarella is amazingly fresh.   The one thing I really appreciate about this place is the owner's values.  I had the pleasure of speaking with him once and he places so much value in quality its refreshing.  Take that Starbucks.", 
    "review_date": "2012-07-16"
  }, 
  "sAqu1ueoTR-eK8rQiFkO0w": {
    "user_rating": 3.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Carrie T.", 
    "review_text": "Mocha is pretty good! They make it with the pretty design on top. Their sandwiches and paninis are decent too. Taste very fresh and healthy. I like their smoked salmon bagel. Free wifi, a little hard tk find parking bc hey, its north beach. 3 stars as is. 4 stars if u come w a yelp or <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> deal.", 
    "review_date": "2013-03-27"
  }, 
  "YLy6HF5gqPjDgoT9VO5ZeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sarah m.", 
    "review_text": "My favorite cafe in North Beach! The bagels and coffee are spectacular, magazines are available if you are alone, wifi, and staff is really nice! The only reason for the 4 stars is that the armchairs inside are lopsided and uncomfortable, probably because they are just way too old, but otherwise the place has a good atmosphere.", 
    "review_date": "2011-11-28"
  }, 
  "bOHNFwu8qAvWrzENXfihBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn C.", 
    "review_text": "this was my go-to cafe when i was working in the area.  the roast beef &amp; cheddar melt was delicious every time.  delicious coffee and friendly staff.  quiet, relaxing place away from tourists to read a book or do some work.  good memories.", 
    "review_date": "2012-01-30"
  }, 
  "Q9HjjoP9h6rioykrlJHW-Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Filmer Y.", 
    "review_text": "I've been here a couple of times, and I always love the atmosphere. It's very relaxing, and there's free Wi-fi, so it's a great place to study.  BUT (\"[someone] once told me that nothing someone says before the word 'but' really counts\")  They are quite racist here. My girlfriend ordered a chai latte, and we had to go get it from the counter ourselves. The lady (a different ethnicity than us) at the table adjacent to ours ordered a macchiato... but she got it hand delivered. She also ordered a slice of pie... and got that delivered as well (both by different servers). And she got a heart in it.  Still coming back for the cozy setting, but you'd expect better treatment from a cafe in San Francisco. Guess discrimination never goes out of style.", 
    "review_date": "2014-05-10"
  }, 
  "Px7Wv8upFSmB4660i9bOsg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Vanessa Y.", 
    "review_text": "Cute and comfortable for eats and wifi. We spent an entire day here sipping, noshing and surfing. Plus 5 for amenities and -1 for proximity to the next table. Yummy food, drinks and service.", 
    "review_date": "2010-08-25"
  }, 
  "f0zVd5ka27C9Z3b4eSg8WA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua B.", 
    "review_text": "This is a good place, but gets 3 stars because it is EXTREMELY expensive, especially for what you get.", 
    "review_date": "2013-12-14"
  }, 
  "Rb6CkEdMjzG0umjXpHnzGA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Paul N.", 
    "review_text": "The menu was simple and easy. Not much variety but you know what you're going to get when you walk in.", 
    "review_date": "2014-03-13"
  }, 
  "pVrjPO4yxinuRFmmLHcXrQ": {
    "user_rating": 5.0, 
    "user_location": "La Mirada, CA", 
    "user_name": "Addie I.", 
    "review_text": "Thee best lattes!", 
    "review_date": "2013-11-14"
  }, 
  "-mnri72wyFTXyBVWvosa6A": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Mariel F.", 
    "review_text": "We wanted to sit down for a cup off coffee walking away from pier 39 and walking towards Chinatown we found this small coffee shop, which is hard now to find  Wonderful service and nice variety of coffee and espresso.", 
    "review_date": "2015-01-17"
  }, 
  "A4hD7UPCqliXcWtAq1XXIw": {
    "user_rating": 4.0, 
    "user_location": "WA, WA", 
    "user_name": "Bede D.", 
    "review_text": "Great mocha and good atmosphere.  Found this place when i was in the area.  Needed coffee and a place to sit so i could work (free wifi helped!)", 
    "review_date": "2013-01-08"
  }, 
  "bzLY-VVHEF_Kcig1TTa5SA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A T.", 
    "review_text": "I'm sad. Not only a bad day for the economy, but a bad day for the cafe culture in the Fisherman's Wharf area. I have been going to Cafe Capriccio a few days a week for the past few months and *looked* forward to it everytime.  This cafe had the best food and really felt like a cafe in Europe because of the ambiance and food quality.   Much to my dismay, I walked in today and was greeted by a new menu and new owners.  The menu had a few of the same items, but overall it was dramatically different. They took a lot of the really great salads (NICOISE) and paninis off the menu and don't appear to have a special of the day which was always tasty.     Trying to be an optimist, I ordered the Chicken and Bacon salad to go for $8.95.  When I opened it, I was very disappointed to see there was NO BACON.  It was basically iceburg lettuce, tomato and chicken for $8.95. I also bit into a piece of chicken that was crunchy like bone - not a good!  I really hope the owners can make some tweaks and bring back the same food quality of the previous cafe.", 
    "review_date": "2008-09-29"
  }, 
  "T6SuLkeGko0shJacHYWq6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate V.", 
    "review_text": "This was the first place I ate when I got to San Francisco.  Minus three stars because my bread was a little too 'chewy' (still can't quite describe it), but plus one star because the folks behind the counter were so nice.  In fact, they still waved at me and said hi whenever I walked by for about a week after my first visit.", 
    "review_date": "2007-06-19"
  }, 
  "16p3QHTNAk8dDKVsv8eWdw": {
    "user_rating": 5.0, 
    "user_location": "Greentown, PA", 
    "user_name": "lee m.", 
    "review_text": "As good as a cafe gets as far as I'm concerned,.. Very comfortable atmosphere..", 
    "review_date": "2012-05-07"
  }, 
  "JSZXi3bT-cyvQZKw6HlEAw": {
    "user_rating": 1.0, 
    "user_location": "East Rutherford, NJ", 
    "user_name": "Glenn R.", 
    "review_text": "Horrible staff!!!!!  Did not acknowledge us until they noticed we had a stroller!!!  Didn't bother to stay!!!!  How did this place receive a 4-star rating?!?!?!", 
    "review_date": "2014-08-17"
  }, 
  "1RrUhnJh4KWu1BOrEE6WlQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "D L.", 
    "review_text": "oh, cafe capriccio, how i love thee....let me count the ways:  1. you're almost within spitting distance, if i were one to spit, from my residence 2. your almond torte is no less than divine 3. your hot chocolate isn't too bad, either 4. your husband and wife owners are so very pleasant and lovely, even at the very end of a long day, when the wife half has food stuck in her hair 5. seeing people sitting outside drinking coffee and working on laptops is such a brilliant change from seeing the woman with loofahs in her hair sleeping on the front steps  i'm sure there will be more, but we've just recently become acquainted.  bellisimo.", 
    "review_date": "2007-05-09"
  }, 
  "DHFqJbIP6kUISL8N989Kew": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Sree C.", 
    "review_text": "While day-tripping alone in SFO, super-friendly old woman struck a conversation with me and during the conversation, she advised me to go walk down the hill to north beach and enjoy the best espresso in the city at Capriccio. I am so glad, I checked it out!  One of the best cappuccinos that I ever had!   It is a cute little neighborhood cafe with a casual ambiance! There is some outdoor seating as well! The indoor seating is cozy and comfy with a homey feeling! They have free wi-fi and a lot of electrical outlets!    I had a cappuccino and a panini. I wanted to try their baked goods but they ran out of all their pastries...I mean literally every thing by mid-afternoon. So I am assuming that they must be yummy!  Cappuccino, as I said was super yummy. I am satisfied with the vegetarian caprese sandwich too!  The Italian bread was fresh and very tasty.  Even the side salad that came with the sandwich was delicious!  I would definitely go to this cafe next time I am in north beach area!", 
    "review_date": "2012-06-08"
  }, 
  "DtAoj040upAMISrQoi1D1A": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Kyle M.", 
    "review_text": "LOVE THIS PLACE.  We were totally doing the lame tourist thing and had spent a couple of hours wandering around Fisherman's Wharf.  We wanted to find a nice little place away from the CRAZINESS of the wharf to have some wine or some nice coffee, and we stumbled across this place by accident.  It looked really inviting, and there were people sitting outside sipping white wine.  SOLD.  We darted in.  The wine was really reasonably priced, and they had a nice little selection.  $18 for a bottle of chilled, cheap local Chard?  SOLD.  We expected it to taste a little cheap, but it was AWESOME.  Honestly, one of the best cheapo bottles of white I've ever tasted.  We hung out at a sidewalk table, and it was a perfect end to the afternoon.  This place is a gem, and you should check it out if you are in that area and need a nice place to go and relax with a coffee or glass of wine.", 
    "review_date": "2010-08-09"
  }, 
  "XATAGil0UThklr_eGzI-EA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "May W.", 
    "review_text": "A tucked away neighborhood coffee shop that I cherish! Good service and decent selection on the lunch menu.  And I love their location.  It's in the touristy part of the neighborhood but it's by the residential area so it's still quiet and it's not flooded with tourists like the other cafes.  On nice days like what we've lately, it's so nice to sit outside and have conversations with friends over coffee or wine.   (yes, they also serve wine!).", 
    "review_date": "2014-01-19"
  }, 
  "etwWZaxtOpOYvHivWNIqOw": {
    "user_rating": 4.0, 
    "user_location": "Decatur, GA", 
    "user_name": "Sid P.", 
    "review_text": "Good local corner bakery.  Probably worth hoofing it from Touristman's Wharf hotels and getting something a little more authentic than Starbucks (but then again, if you chose to stay at the Hyatt or the Ramada or whatever, you get what you deserve).  Coffee was great (although they ran out surprisingly fast) and there were a ton of great pastries and sandwiches - I was a pretty big fan of their chocolate croissant.  I feel kind of bad about our stay, though - we got up at 6 AM and were wandering around looking for a place to eat.  Wound up here at 7 sharp and mentioned to the clerk how weird it was to have nothing open early.  The next day, she opened up at 6:30 - but we didn't roll in until almost 8.  Oops!  Great service, great atmosphere, great coffee, great food - it's no wonder it served as our de facto \"base of operations\" for our stay in the area.  Crowd seemed mostly local, although there were a few stragglers (like us) who were staying at the San Remo.  The free wi-fi was what initially led us there, but the greatness of everything else kept bringing us back.", 
    "review_date": "2008-06-23"
  }, 
  "62jaRNAFPQWz-SKmNubPHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "judy g.", 
    "review_text": "Its really nice and Im here now at Cafe Capriccio now owned by Alex a lady and she is doing this with Jessie her partner. Its really nice and I did not like the original cafe. The food was not good for me - I eat low fat and its more difficult to make plates that are low in fat cause you dont have the advantage of the flavor of meat or cheese so the food has to be naturally fine. This is. They went to Coffee school in Portland and this is good espresso.  I didnt like the original owners and these people are really nice. I think the original owners had a lot of difficult to get the place open and by time it was they were already planning their exit...  J", 
    "review_date": "2008-10-08"
  }, 
  "JpwaSyhREorkzcItT8M58Q": {
    "user_rating": 5.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Brittni P.", 
    "review_text": "We were around the corner staying at the Hyatt looking for a breakfast spot offering more than the typical eggs and bacon.  This place did not disappoint.  Our kids indulged in their yogurt parfait and we also had a bagel w/Roma tomatoes, onions and capers - yum!  All in all, skip the busy breakfast diners and try this place!", 
    "review_date": "2013-06-09"
  }, 
  "U400x0nnIYl4WrVNdrM1HA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robynne W.", 
    "review_text": "I should have written a review of this place along time ago. The staff is super sweet, the ambiance is nice and it is a great refuge from work. They are not uptight about dogs. The honey-pear salad is amazing and the vegan donuts are a great low-guilt dessert. A really good spot to chill out and get some writing/thinking done, at least that's what I do there. Inviting, warm and unpretentious vibe. When it's warm enough to sit outside it is particularly special.", 
    "review_date": "2011-08-07"
  }, 
  "LbRZeU6PVYrqFasK8YNysg": {
    "user_rating": 5.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "C S.", 
    "review_text": "Living in North Beach this was my absolute favorite cafe.  Delicious lattes, tasty food and friendly staff.  Loved getting work done here because the seats are comfortable and they have plenty of outlets.  They also outdoor seating which is nice on a sunny day.", 
    "review_date": "2013-07-07"
  }, 
  "g3-4LSFaRu_mDMFg6-SX5w": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Ari M.", 
    "review_text": "Espresso has definitely improved each time I've visited! Very nice spot to relax or work.  Beautiful decor, and sandwiches/deserts are excellent.  Currently this is my favorite in SF -- meets all my requirements: awesome espresso drinks, dependable wi-fi, and chill (not elevator) music.  I work via laptop 7 days a week, so while the fact that I don't want to listen to punk in a cafe may not be hip -- hey, I do what I gotta do.  There's a time and a place for everything... ;-)", 
    "review_date": "2009-07-31"
  }, 
  "lhKV2lxaPG4EJEsXqISDxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matte R.", 
    "review_text": "Amazing: it looks like these guys lived in europe coz they perfectly know the taste of coffee, cappuccino and croissant. Stop goin to starbucks and head here!", 
    "review_date": "2010-08-02"
  }, 
  "jYowMfO4Gzh_kuwgFS_oyA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rachel J.", 
    "review_text": "The best espresso I've ever had. Not kidding. Cafe Capriccio also (and not surprisingly) makes an amazing Americano, which I'm embarrassed to admit may be my favorite type of coffee these days. There's is so flavorful and delicious I think I may be forever spoiled.  I've now been here multiple times, and am able to report that the food is delicious as well. They make a delicious roast beef and cheese panini made with a thick baguette bread that kept me full all day; the vegetarian caprese sandwich is also great. They serve it up with thick slices of mozzarella, tomato, and pesto sauce with a side salad, and I was sad when it was gone. I may have even licked my fingers. My friend tried the quiche - a bold move, since it's such a hit-or-miss kind of dish - but we both agreed that it was cheesy deliciousness.  The ambiance is casual and quiet; even when it's crowded, most people are on their computers. There's a larger table for groups, and outdoor seating is plentiful and lovely on sunny days. If you're in the 'hood and want to escape (or, even better, avoid) the hubbub of Fisherman's Wharf, put this cafe on your list.", 
    "review_date": "2012-04-17"
  }, 
  "FSFdLiR-cB8q4ObQY20aWA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Susie B.", 
    "review_text": "The best coffee !!!!!  The coffee not only tastes fantastic but it looks beautiful as well. Friendly service, wifi and good chocolate croissants .", 
    "review_date": "2012-09-29"
  }, 
  "1K9Q7aOho-pSvGSNs29dEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jeremiah s.", 
    "review_text": "Alex and Jessie have picked up right where Terrick and Lisa left off in giving great food and service in an excellent, relaxing environment. The cafe is bright and open, and they now have extended hours. The new phone number is 415.772.0937, I noticed the Yelp page still has the old one.", 
    "review_date": "2008-10-15"
  }, 
  "jdPe7-jiG7YHtha0W3UVOw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Jane F.", 
    "review_text": "It's a small, neighborhood cafe. Reminds me of the East Village back home. It was outside of the tourist crowds, so that was good.", 
    "review_date": "2012-08-27"
  }, 
  "-z8Z93iq1b5WJpRcibdI0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris N.", 
    "review_text": "Bravo to the new ownership. I do love the coffee. I was told it was Ecco from Santa Rosa. The muffins and pastries are very good. This is a great place to have lunch as well.", 
    "review_date": "2009-01-26"
  }, 
  "1JCoWx4tFjyWS9T0RN2u8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chandley M.", 
    "review_text": "You know when you begin drafting your reviews on Yelp? Well for those who have never written a review, you begin by choosing a star rating and when you hover over 5 stars, the caption next to it says, \"As good as it gets!\" Well Cafe Capriccio really and truly is as good as it gets!  I first happened into this cafe as a North Beach resident out for a stroll, and since then, every other cafe &amp; coffee house has had to measure up to Cafe Capriccio.  The atmosphere is pleasant, and comfortable. On the walls, featured artists exhibit their works, local magazines and publications sit on the racks - waiting there to be thumbed through, and music from Pandora stations drift over the sounds of coffee grinders and conversation. There are a few tables available inside with more tables &amp; chairs available outside on the sidewalk. The workers here are friendly but reserved. Don't mistake their pleasant peace as anything more than an appreciation and respect for the personal space of patrons that choose to begin their day here. Come in, smile, place an order, sit, eat, drink and appreciate!  This little cafe is a crossroads of culture from the diverse mix of local residents, to the steady stream of tourists who bravely stray from their guide maps and happen into this oasis. It became a great routine to my day when I would walk in, grab a cappuccino and a breakfast wrap then sit outside and watch the neighborhood wake up.  I recommend the breakfast wrap with either ham, or bacon or for some lighter fare enjoy one of their well portioned parfaits. Go in knowing that their menu doesn't offer a full array of breakfast &amp; lunch items, but everything prepared here is divine.  They also have a beer &amp; wine license!", 
    "review_date": "2013-04-06"
  }, 
  "jYCBDI70jgsG5GCQ__N-vA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary O.", 
    "review_text": "(Insert usual lament about lack of options when it comes to lunch places around work)  This is such a cute little local cafe!  You will always see people happily working on their laptops, enjoying a coffee, iced tea, or sandwich.  Sometimes this can make it difficult to get a table, but it's good to see it busy!  There is also plenty of seating outdoors if it's a nice day.  My coworkers love the pear salad.  I'm not a salad girl, so I get the roast beef sandwich with cheese.  Oh, it is GOOD.  I also thoroughly enjoy their selection of vegan donuts.  Uh huh, I just wrote vegan donuts.  Try it before you wrinkle your nose!  They have a raspberry one that is yummy, and I feel slightly less guilty eating it because it's vegan, and therefore healthy, and low calorie.  Oh, that's not what vegan means? Whatever.  And the iced tea is SO good. I'm not even big on iced tea and I crave it.  I always add a splenda out of habit but I think I could definitely drink it without.  The service has always been friendly, even when I pout in the rare event that they have run out of iced tea.", 
    "review_date": "2010-11-04"
  }, 
  "_LyPshyvi6c1wT9v1e2OPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess H.", 
    "review_text": "The female barista is so very sweet and friendly, and she makes a mean cup of chai.  There is plenty of seating and lots of outlets (yay!), perfect for having some coffee and snacks and getting a lot of work done.  And free wi-fi!  Minus a star because the benches/cushions/window looked like it could use some serious dusting/PineSol.", 
    "review_date": "2014-01-09"
  }, 
  "L9IPOUR3CyM9Z9H7BQKd6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J S.", 
    "review_text": "Really great coffee here--nice and strong. It's a cute place, with a friendly atmosphere and free wi-fi. A lot of the people seem to be regulars.  I just upgraded them to four stars after having the breakfast parfait. I expected to get a premade blueberry/strawberry layered thing in a plastic cup like most coffeeshops. Instead, she cut up fresh fruit right then, at least five or six different kinds. Delicious, and actually worth $5, unlike other places. My only complaint? They insist on leaving their front double doors open at all times. I know it's California, but it is 45 degrees out people! Obviously the owner is nice and toasty, wearing a t-shirt behind the counter, and he doesn't seem to notice that all of his customers are still wearing their jackets inside. I don't think I'll be back until it gets warm out again. Their outdoor seating looks nice and sunny.", 
    "review_date": "2007-12-14"
  }, 
  "TU1i5AMZxrtyNCVpgUC_zA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L S.", 
    "review_text": "Ten years living in North Beach and that spot is finally something to love. I am still sampling the food to see if I have a favorite, although today I had a Tunisian Salad (in it were egg, beets, artichoke, pickled carrots, and like 10 other things) for the first time and loved it.  The whole place has a great vibe, whether you're sitting outside in the sunny chairs, or inside at a comfy table. But the owners Tarek and Lisa make the place wonderful and warm. I love how the place attracts a diversity of people--- you'll hear Arabic, French, and Italian spoken there. It's feels so much more like Europe to me than the Disneyland version up on Columbus.  They are still sorting out the menu and hiring new staff, so bring some patience just in case.", 
    "review_date": "2007-06-26"
  }, 
  "7r4dPb5OUwao6nJ4DZegNA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Laura J.", 
    "review_text": "We definitely had very tasty mochas there - our favorite of the 3 coffeehouses we tried while in SF.  We didn't explore the menu but the breakfast bagels were yummy and it was a comfy place to enjoy our breakfast.", 
    "review_date": "2013-02-27"
  }, 
  "MhTnja4xyolJEFBapjiTlQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse B.", 
    "review_text": "Any morning that I'm at work, my half hour break is always spent at Capriccio.  Damn fine coffee.  Damn fine.  The staff is comprised of good folks who know how to make good coffee.  The atmosphere is relaxed, but that's not to say it's not always full of people expecting good coffee.  They're busy for a reason.  If I lived in the neighborhood you'd see me in there every morning.  With that said, I've worked across the street from the place for two and a half years now, and I can say from experience that the new management is infinitely improved over the old management.  May as well be a different place.", 
    "review_date": "2010-01-07"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "Kudos for the free internet access, (which should be a standard in cafe's as tables and chairs are).  I like the very cozy location, nestled within inner North Beach.  Staff was wonderful; coffee drinks need an upgrade.", 
    "review_date": "2008-01-31"
  }, 
  "UHd3D1tq_hjlWGgkugQfmw": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Nicholas E.", 
    "review_text": "The best priced cafe food I've ever seen at a coffee shop.", 
    "review_date": "2013-06-26"
  }, 
  "30MGqoQBmgZ1e8K2T_jNHg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "angie b.", 
    "review_text": "i have been here a few times, usually just for the drip coffee which is average..i mean, it's drip coffee. if it's not completely watered down i'm going to like it. i did try the nicoise(sp??) salad here which was good, their salami panini wasn't bad,  but didn't exactly rock my world either, the chicken pesto sandwich with goat cheese is pretty tasty. too much bread though..but i'm not much of a sandwich person anyway, and i like paninis with really pressed or thin bread so i can taste the insides. i do really like the employees. they have consistently been very friendly, and attentive. you can tell that they are making a real effort to give you a good experience, so i give em props.", 
    "review_date": "2007-11-12"
  }, 
  "z0bWP4WUSaj22b69pT6LEw": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Oleg S.", 
    "review_text": "Worst service ever. Food was all right but there was a lady who clearly should be fired: mean, talking about customers with kitchen people right in front of the customers, not taking orders properly. Can't recommend this place to anyone.", 
    "review_date": "2014-08-24"
  }, 
  "kaeGADArxxh_V8lRjsnMaQ": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "diana l.", 
    "review_text": "This place have the best smoke salmon Bagel, it is a nice place to be at in the morning, nice relaxing place to have a nice hot cappuccino.", 
    "review_date": "2012-03-06"
  }, 
  "EuWRgm2NGa3KLNG2zSUJ-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stryrker S.", 
    "review_text": "Coffee = OK Proscuitto di Parma Panini = 5 Stars. Just around the corner = Fantastic.", 
    "review_date": "2010-11-29"
  }, 
  "UBAfc-KuDXV8XLurou_i6g": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Abby W.", 
    "review_text": "Very low-key place to get yourself a coffee, chai or small meal (good salads &amp; sandwiches). Free wifi so great place to, I don't know, job hunt online these days.", 
    "review_date": "2010-01-05"
  }, 
  "XsmCflJwEbBKShKXNCaiwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Parminder Nayyar C.", 
    "review_text": "I have had lunch at Cafe Capriccio twice. I love their salad - both quality and quantity. Also their fresh squeezed orange juice is awesome!", 
    "review_date": "2013-09-21"
  }, 
  "NQ7KIr1wgjPaHO10IkyIwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E H.", 
    "review_text": "Nice find, yummy!", 
    "review_date": "2009-09-05"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "I feel like Matthew R and I were on the \"Douchebag-free Tour Of North Beach\" last week. I am simply amazed, awed, and dumbstruck by the sheer douche-free nature of the places we went with family from out-of-town. See, my brother and sister-in-law are stoners. Because they're stoners, they didn't want to venture too far from their hotel (in case they wanted to get stoned again) for dinner or breakfast (stoners!). This actually worked out in our favor.  Capriccio is a cute little corner cafe with the usual coffee, espresso and pastries...but wait! There's more! Even a stoner can satisfy those munchies at a place like this. They have omelettes and salads and fresh fruit (yes, it comes with whipped cream, you stoner!). If you, like Matthew and I, are not of the stoner persuasion but indeed fancy yourself a bit of a morning boozer, Capriccio has your hungover ass covered with mimosas, too!  I had the fruit, boy had the lox bagel, and stoned and stoneder had the omelettes and something else. All was delicious and the mimosa had just enough champagne to take the edge off. Prices are great and the service can't be beat. This is truly a neighborhood gem. But don't drive here...just trust me on this.", 
    "review_date": "2008-02-19"
  }, 
  "uzdUXO3OPI2Czt14aUrDvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren T.", 
    "review_text": "Recently I've needed to find a cozy cafe with free WiFi and after many failed attempts, Cafe Capricco has become my new favorite.  You can sip on a rich cappuccino, enjoy one of their many great paninis or indulge in a sweet treat. The turkey panini is perfect for lunch and comes with a side salad.  It has a relaxed atmosphere and the service is attentive, but not pushy.  I never feel as though I've overstayed my welcome, as you might at other cafes in the area.  And although it's in Northbeach, it's enough off the beaten path of Colombus to cater more toward a local crowd.", 
    "review_date": "2009-08-25"
  }, 
  "QiU3oQxR0eoGfMLY1_d9pg": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kirill Z.", 
    "review_text": "Decent place to drink coffee and work, but nothing spectacular.", 
    "review_date": "2013-10-21"
  }, 
  "A_BT4EcxzNj-vNXlefXOPA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lianne M.", 
    "review_text": "Came here because of the good reviews on the coffee and its coupon deal. $10 for $15. The cafe staff's service/friendliness varies. Had one with less than average attitude, and one (Asian guy) who were very helpful and friendly. The attitude was quite a contrast.   My friends and I ordered 2 lattes and 2 berry pie. The coffee was okay, the pie was made locally, a bit on the tart side which i'm guessing because they didn't load it with excess sugar, which i liked. They got one of the lattes wrong, the nicer staff easily replaced it with a new one.  I was expecting quite a bit from the good reviews, but one of the staff there let a star down.", 
    "review_date": "2014-09-25"
  }, 
  "PiwOtgwtLWfLjbLMHRkAdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn C.", 
    "review_text": "I wasn't a huge fan of this place previously.  The regular coffee was WEAK, and the service was hit or miss.... Tarek was always very friendly though. I've been a couple of times since the ownership change and the coffee is much better.  I really like french press.  I have yet to try the food but the menu looks great!  The owner is very nice and she really wants to please the customers.  I hope they do well!!!", 
    "review_date": "2008-10-14"
  }, 
  "Vy_UStnQ2CCebOYJDsB6CA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia H.", 
    "review_text": "What WAS a super friendly, cozy, wonderful place to get a cup of coffee and relax on any given morning has become just another crap-hole coffee house.  Since new owners took over, it's just not the same - from the loud, obnoxious music  to the rude staff, our Sunday morning coffee ritual will be changing for sure. Huge mistake in the changes, this place will be going under soon. Thanks but no thanks, Cafe Capriccio!", 
    "review_date": "2008-10-07"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "3.5 stars  It's a nice neighborhood cafe with outdoor seating.  I actually like the indoor space - there's the cozy corner bench seatings inside and the large communal table in the front next to the window.  The menu is up above behind the counter with a separate blackboard with wine list.  You can help yourself with water - glasses and pitcher of iced water at the counter at your convenience.    I wanted to go to a homey cafe for a bottomless cup of coffee since the morning...but one thing led to another and I didn't make it to anywhere.  With the cravings still going strong, I was happy they were still open and still willing to make me a breakfast bagel w/ eggs, cheese and ham.  With limited selection on bagel, I asked if I can have it on toast instead and they were kind enough to accommodate.    We sat at the communal table facing the mirror - it's a good spot to people watch from the inside.  I had my cup of coffee, the ham, egg, cheese w/ fresh tomato sandwich and hubby had a glass of fresh oj.  The oj was very good, quite sweet.  A man who seems like a regular took a seat at the table and he ordered the caprese salad?  It looked really good with a very generous portion of mixed greens topped with sunflower and pumpkin seeds, raisins, tomato and mozzarella.    Look forward to returning, staying longer and enjoying some time here.", 
    "review_date": "2011-08-27"
  }, 
  "q1zJqtcuRob_tk-2BajInA": {
    "user_rating": 5.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Brian E.", 
    "review_text": "This was my favorite hang out spot while staying in Fisherman's Wharf. The coffee was delicious and I liked that they had good breakfast and lunch options, wine included. I spent most of my time inside reading my book and enjoying the music and free wi-fi, but the outdoor seating is nice too. Great if you want to get away from the chain coffee shops.", 
    "review_date": "2010-04-10"
  }, 
  "sXKmP90GCdF0oM0AzYRhaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rika P.", 
    "review_text": "You're not too far from Little Italy, but if you care how smooth the frothing of your milk is, how great the barista is, come here. :) It couldn't be any better than any other cafes in north beach.", 
    "review_date": "2011-03-24"
  }, 
  "HrQVsvm3xcSxVPjry7Mjow": {
    "user_rating": 1.0, 
    "user_location": "Plantation, FL", 
    "user_name": "Dina B.", 
    "review_text": "Horrible service. We stood in front of the register for a solid 5-10 minutes with no acknowledgement. When we came to order we were told that literally half the menu was not available. The kitchen looked dirty and most of the tables had dirty plates and cups sitting out. I was hopeful about trying something good here after seeing some of these reviews but quite frankly I don't understand how anyone had a pleasant experience here.", 
    "review_date": "2014-07-03"
  }, 
  "MQ4zjQaaaAxorJPs31Cjaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenneth F.", 
    "review_text": "Cafe Capriccio is an outstanding cafe and experience for anyone with class, sophisticated style and educated palate.  Based on my experiences and dining with chefs, I determine high value and appreciation for the simplicity and excellent creation.  The cafe is to the way foods are high quality as in Switzerland and Italy.    It is a hidden secret, jewel and a breath of fresh air just outside of North Beach's hustle and bustle.  Unlike most cafes in San Francisco, it is very clean and maintained.  The service is always great.  Owners and employees are genuinely friendly and professional.", 
    "review_date": "2007-08-13"
  }, 
  "jChwEu0CoI54qyuVnmIxmQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry S.", 
    "review_text": "This place is very mellow. Good for grabbing a cup coffee, glass of wine, sandwich, or breakfast bagel. Staff is very friendly. Free Wi-Fi, tons of outlets, and seating with pillows . Great for some studying or reading/relaxing will be back for sure!", 
    "review_date": "2012-05-01"
  }, 
  "M8ZleqEPZWfxWXxZR0lJ2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wangston P.", 
    "review_text": "exiled to the land of no good coffee, i finally turned to <a href=\"/redir?url=http%3A%2F%2Fcoffeeratings.com&amp;s=5f079f80822e0a55016ca7059d77631fa1c03b20eaca1ad7e1a829cb16034dd1\" rel=\"nofollow\" target=\"_blank\">coffeeratings.com</a> for help.  okay, i'm still closer to blue bottle in the ferry building than i am to capriccio, but it's a much nicer walk, and no insane line of tourists to deal with, and the espresso is really quite good.  <a href=\"/redir?url=http%3A%2F%2Fwww.coffeeratings.com%2Freview-view.php%3FratingId%3D1127&amp;s=8f2ea703954839721b8c458707bad0ff34f4b9d3deff591eee7124e208d69832\" rel=\"nofollow\" target=\"_blank\">coffeeratings.com/review…</a>", 
    "review_date": "2010-08-04"
  }, 
  "kivPWpDeplRfJCvVNAH1uQ": {
    "user_rating": 1.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Becky M.", 
    "review_text": "Horrible experience here! Get to the front of the line only to find out the menu that is clearly stated on the wall is completely inaccurate as they are \"selling the business\" the woman making coffee is completely rude as she tells the cashier \"you don't need to explain it to them\". Will NOT be coming back!!", 
    "review_date": "2014-07-25"
  }, 
  "98ayax82c8mMTgxgkIw3Zw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scout F.", 
    "review_text": "Cafe Capriccio has been through so many ownership changes since my last review. The atmosphere and the food have declined so much in quality that even though we live steps from the cafe we never go in, not even for coffee. The last several times we patronized Capriccio it was clear that the turnover of the staff is high. There was never  a manager around. Previous owners were onsite nearly every day. Staff were rude or indifferent. We wonder how they stay in business now. The presence of the San Remo Hotel across the street which does not serve breakfast probably contributes to some of Capriccio's staying power - at least during the early morning hours.", 
    "review_date": "2015-01-06"
  }, 
  "BOkvZ2zPzBjDoH5jo3bvkw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "john m.", 
    "review_text": "This place seems like it's changed hands again. The sandwich menu is the same, but they are using lesser quality ingredients(cheap processed roast beef, for example) and less of them. I ordered the roast beef panini today and it was very disappointing, a shadow of its former self, but the high price was still the same. Coffees are still ok.", 
    "review_date": "2013-11-26"
  }, 
  "HrSXe9zZqYpXVRtUv8X4Pg": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Chelsea W.", 
    "review_text": "I ordered the smoked salmon bagel and a hot chocolate.  The salmon was not good.  When I say \"not good,\" I don't mean \"didn't taste good,\" I mean the meat they used was rotten.  I had someone take a bite of it to make sure, and they agreed it was no good.  Also from the color of the meat, I could tell the fish was farmed...I don't know why any restaurant that resides in the bay would use farmed fish (farmed fish are full of antibiotics, pesticides, and disease from living in cramped pools).  The hot chocolate was really good though.    Kind of pricey for such a weeny bagel, but the service was really good, so 2 stars.", 
    "review_date": "2013-06-10"
  }, 
  "l0ITWlrwFr-27Zg-iTBtig": {
    "user_rating": 5.0, 
    "user_location": "Fisherman's Wharf, San Francisco, CA", 
    "user_name": "Amy A.", 
    "review_text": "Fantastic service and quaint atmosphere. Very relaxed and quiet to allow you to get a bit of work done on their FREE WIFI!!  Beautiful presentation and quality ingredients.  Try the lunch special pictured below consisting of half salad and cup of soup.  Latte was amazing and cappuccino was exquisite. I will make every effort to return before my trip ends.  Try it for yourself.  You will not be disappointed.  A must try for tourists and locals alike.", 
    "review_date": "2013-11-20"
  }, 
  "hLvInByM9UGS13NEaWnH8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erik S.", 
    "review_text": "This is a wonderful and quiet cafe that serves really good espresso drinks. I came here on a weekday with high expectations. First off, the cafe has a nice European air about it, with plenty of outside seating. My cappuccino had nice art, good texture and was only a little bit light on the flavor side of things. I asked where they get their beans from, but I think the barista thought I said meat because he told me Boar's Head. I didn't want to press the issue, so I have no idea. Anyway, it's really good. I'll be back again when I want to sit for a nice espresso drink.", 
    "review_date": "2011-06-07"
  }, 
  "BIIavsSgGqbN_c-lsbkDsg": {
    "user_rating": 3.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Cassandra B.", 
    "review_text": "My latte was the perfect temperature.  The outside seating is nice on a sunny day.  Inside was very busy.", 
    "review_date": "2013-04-17"
  }, 
  "ML_tl5mQ9ThxXNXyKn-NpA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frederick A.", 
    "review_text": "This review only pertains to the panini   I had the roast beef melt here and it is quite dry. The bread is quite rough which rub the skin off the roof of my mouth. Furthermore, the salad was super sour (which I was not told that It was going to be a sour salad).   I would definitely come back for the coffee though!", 
    "review_date": "2013-02-04"
  }, 
  "jAd_EbJNdSSOGu_Nzt3vhw": {
    "user_rating": 4.0, 
    "user_location": "Saddle River, NJ", 
    "user_name": "Jack C.", 
    "review_text": "We went here for a quick bite/coffee before our trip down to LA in the morning.  We had a <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> voucher, and I ordered an oatmeal with fresh fruit (extra charge) and a latte. The oatmeal was nothing too special, but the latte was pretty good.  I always love the unique coffee taste of an independent shop versus the mass produced Starbucks coffee taste.    The service was pretty quick with the food and drinks.  The place seemed like a chill environment to study, lounge and talk with friends.    I would probably go back again if lived in the San Fran area.", 
    "review_date": "2013-06-11"
  }, 
  "zqUtgpnDjAorTI--t-dvFg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Ngozi E.", 
    "review_text": "Beautiful ambiance, great staff, and nice music.  I love this cafe so much, I'm thinking about moving to this neighborhood...just to frequent this cafe.  The people that work here greet you with a smile, take your order, and then leave you alone.  Great place to study and get work done.   Other reasons that earned Cafe Capriccio 5 stars : + free wi-fi with a strong signal + clean interior + outside seating + ample plugs for your laptop (inside) + wine and beer selection + clean bathroom  I didn't eat anything (though the selection is diverse and looks amazing), but I did have the best soy hot chocolate ever.  I strongly recommend this cafe.   If you come, maybe I'll see you there!!  Ciao!", 
    "review_date": "2010-09-06"
  }, 
  "04BUrqUE7Rq9Y5-0mKOGTg": {
    "user_rating": 5.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Ben B.", 
    "review_text": "All you could possibly ask for from a neighborhood cafe: * A simple and delicious menu * Ample selection of tables, benches, couches, stools and even outdoor seating * Free wi-fi with accessible plugs * Coffee that does not taste like like a franchise * And my favorite, a wine selection for when you've had enough caffeine or your looking to wind down (not up) with a good read  That last point bumped this place up from 4 to 5 stars in my book.  I plan to make myself a regular here.", 
    "review_date": "2010-08-08"
  }, 
  "ObTnNcCumzZdNpa22EwwYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregory D.", 
    "review_text": "Could be five stars but I think usually grade low.   My outmeal with fruit breakfast was almost perfect.", 
    "review_date": "2012-10-04"
  }, 
  "v3ial-ln4kh1RgM7BQxXoA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew N.", 
    "review_text": "This is probably my favorite cafe in North Beach. The owners are cool, the wifi is fast - none of that silly zrnet shit, just plain wifi... I work from here pretty often, the place has got a lot more popular with tourists, which kindda turns me off a bit, so I try to avoid it in the breakfast hours now...  Their food is good too, I like the food at Sappore better, but the wifi sucks there. The coffee is decent, you can't expect quality like Ritual or Vivace or Blue Bottle around here, so I'm not overly picky. I care more about the speed and reliability of their wifi than anything else...", 
    "review_date": "2007-08-21"
  }, 
  "wKq30kYS60VvsCFxNH46Cw": {
    "user_rating": 4.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Jose R.", 
    "review_text": "The guy at the register wasn't very friendly but the cap I ordered made by the guy in the back was great! Like that it wasn't surrounded by so many tourists but probably wouldn't come back unless I had nowhere else to go", 
    "review_date": "2014-08-23"
  }, 
  "-0pCM1096pukXVsPb7YDLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Duncan C.", 
    "review_text": "Everything a cafe should be:    -  A+ atmosphere -  A+ coffee -  A+ food, pastries, and snacks -  Spacious outdoor seating -  Free wi-fi -  A staff who care about the place &amp; are friendly -  Good hours  Can't ask for much more.", 
    "review_date": "2010-05-22"
  }, 
  "3Ru1OiTWBmujn9VmM7iNBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Micah I.", 
    "review_text": "great food.  one off the best cappuccino  I've found in sf.", 
    "review_date": "2013-07-24"
  }, 
  "ptfsHN5G68OpIceLCoq0Iw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaimie N.", 
    "review_text": "Amazingly good fresh ground mocha. Great place to hang out, do some work, and just enjoy the sunny side of the city :)", 
    "review_date": "2013-07-20"
  }, 
  "hKU1fWULSln8WYj8hV2E9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Martin R.", 
    "review_text": "North beach cafe at its finest", 
    "review_date": "2013-03-01"
  }, 
  "VkD9M-iw58_ld7pbBWoqeQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Chin C.", 
    "review_text": "Cafe Capriccio is an enjoyable neighborhood cafe that is within walking distance to both Fisherman's Wharf and Little Italy.  The food is fresh, well prepared, and reasonably priced.  In particular the Caprese Salad and pies are delicious.  You won't be wowed as it is not avant-garde or exceptional food, but you won't feel as if you've had a bad meal.  They occasionally run out of items towards the end of the day as they seems to have a substantial morning rush of tourists.  The service is friendly and efficient.  If you're in the area, I recommend that you stop by and enjoy your espresso as an array of tourists and locals go about their day.", 
    "review_date": "2013-08-03"
  }, 
  "spMHR0xUIJqhDTRsczMmlg": {
    "user_rating": 4.0, 
    "user_location": "Bedford, NH", 
    "user_name": "Timmay S.", 
    "review_text": "My wife and I happened to stumble upon this place while wondering around San Francisco and decided to check it out. It is a nice, comfortable place with indoor/outdoor seating and a very friendly staff. I had the tomato sandwich which contained tomato, red onion, cream cheese and capers on a bagel, and although it sounded a little weird at first it was absolutely delicious. I am not much of a coffee drinker but I did decide to get an iced mocha while I was there which was also very good. Would highly recommend it for breakfast or just to kill some time", 
    "review_date": "2010-07-07"
  }, 
  "uMlX0xIG4pgp2xIQlY9PlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth P.", 
    "review_text": "had a delicious mocha here the other Saturday.... barely sweet, rich chocolate taste, no whip cream offered (bonus) and a great ambiance with ample people watching at street side cafe tables. Outdoor seating is dog friendly (another bonus).", 
    "review_date": "2011-04-26"
  }, 
  "Dhq1fZBc3m3EL9pIre297g": {
    "user_rating": 3.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Erin H.", 
    "review_text": "The bf had an early morning meeting at The Cannery so I volunteered to drive him. He insisted on leaving super early and as a result we arrived at 7am for an 8am meeting.   In desperate need of some caffeine (he woke me up at 5am to drive from Santa Cruz!) I did a quick yelp search for cafe's in the area and landed on cafe capriccio.   We entered around 7:15 which was right after they open and I was surprised to already see people inside, good sign.   The bf ordered a chocolate croissant with a mocha and I ordered the breakfast parfait with a plain ol' coffee. These 4 items totaled around $15.   The guy working seemed more interested in chatting with his coworker than he did interacting with us. He didn't greet us when we walked in, despite looking right at us and hearing me greet him. His disinterest became apparent when he forgot about my coffee and was quite rude when my bf reminded him. It's a shame because the other two guys working there seemed pleasant.   Anyway, the coffee was fine, the parfait was fine (store bought yogurt and granola) and the bf said that his croissant tasted remarkably like the frozen ones you buy at trader joes.   Meh. More like 2.5 but rounding to 3.", 
    "review_date": "2012-08-09"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Coffee shop perfection.  Quintessential San Francisco location. A charming interior, plenty of seating, abundance outlets and free wifi. It was just a bit too cold to sit outside, which made the open window looking out onto the mason/chestnut scene all the more perfect.  Fantastic food. My parfait was loaded with bananas, strawberries, nonfat yogurt and granola (perfect), my latte was nonfat with sugar free vanilla syrup (perfect), and my sandwich needed no customization - chicken, hummus, tomatoes, just how I'd make it (perfect). It came with an unexpected salad - nice touch, and good to know in case you're like me and would have asked for no dressing.  Top notch service. Friendly, attentive, relaxed. In other words, perfect.", 
    "review_date": "2009-06-07"
  }, 
  "bq_KRX__zL4WGJWQKEwE5g": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kendall T.", 
    "review_text": "Most reviewers (it seems) love this place for the coffee. We didn't have any, but, if we were to return, that is all that we would get, as the food was disappointing.  We stopped by for lunch on our way out of the city and ordered a pear, gorgonzola salad with chicken and a caprese panini as well as iced tea, a strawberry italian soda, and a water. The iced tea was freshly brewed, the italian soda tasted like soda water, and our water never arrived. When the food came out to the table, there was no chicken on the salad. We mentioned this to the gentleman who brought it. He disagreed before reluctantly taking the salad back to add chicken. It actually wasn't a bad dish, but the dressing was uneven - heavy in some bits, light in others. It was more the attitude of the server that bothered us. In terms of the sandwich, it was ok. Nothing unique or delicious.  I think Yelp best sums up our experience here with a, \"Meh. I've experieneced better.\"", 
    "review_date": "2013-08-26"
  }, 
  "At-RIEC3zPuUO5W_R7f27A": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Howie M.", 
    "review_text": "This place used to be mediocre at best but is now very good under the new ownership. Shame on anyone who goes to the Starbucks around the corner!", 
    "review_date": "2009-01-11"
  }, 
  "MB0quDwn_WbmTt_pAknfTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley S.", 
    "review_text": "I met a friend here for lunch on Wednesday.  The outside seating looked very inviting and the menu looked even better.    I had the proscuitto and salame panino and my friend had the roast beef panino.  My sandwich was delicious:  thick proscuitto, yummy salame, mouth-watering fresh mozzarella, red pepper, lettuce, and tomato were on the sandwich.  There was no trace of the portabella mushroom that is listed on the menu, but the sandwich was still good without it.  My friend enjoyed his panino as well.  Less than a week after opening, they're still working out the kinks on the service side (which is to be expected).  Things moved slowly, but we were treated to a piece of cake on the house at the end of our meal.  All in all, a good place to dine outside and enjoy a sunny day.", 
    "review_date": "2007-05-03"
  }, 
  "JoxKFDq_uQ6khm8lG6H4zw": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Kathy R.", 
    "review_text": "We wanted to find something for breakfast not too far from Fisherman's Wharf, but also wasn't too touristy or crowded.  Cafe Capriccio had a nice neighborhood/local feel with decent prices. The bagels were fresh, the yogurt parfait had a generous amount of fruit, and the latte was prepared well.", 
    "review_date": "2013-08-12"
  }, 
  "Sx2WNZhGIJNSbcBXPhEWng": {
    "user_rating": 5.0, 
    "user_location": "Beaverton, OR", 
    "user_name": "Courtney B.", 
    "review_text": "Delicious Panini, salad, and soup! Fresh and tasty!", 
    "review_date": "2011-01-21"
  }, 
  "NtrF02e7zPm_LsQizEbyxA": {
    "user_rating": 5.0, 
    "user_location": "Salt Lake, UT", 
    "user_name": "Matthew B.", 
    "review_text": "I think I had one of the best mochas I've ever had at this cafe! I also got the egg wrap which was very good and not too small. My wife got the parfait which she really liked and a hazelnut coffee that she said was delicious. Overall I liked this place a lot!", 
    "review_date": "2014-05-29"
  }, 
  "WOlfaz4vzUNvNxCScXeYrg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kirsten V.", 
    "review_text": "Cute cafe.  I always grab a coffee and breakfast here before business meetings.  It's a really neighborhood-y spot where everyone knows the people working behind the counter.  I haven't been there for lunch or wine but I will definitely pop in there sometime soon.", 
    "review_date": "2014-04-19"
  }, 
  "lOnqJeopWcH7CHEUbartEQ": {
    "user_rating": 4.0, 
    "user_location": "Farmington, MI", 
    "user_name": "Jessica M.", 
    "review_text": "Came here for breakfast. The ham and cheese croissant was tasty. The latte was yummy and artfully done. :)", 
    "review_date": "2012-10-04"
  }, 
  "jUtaYycgNE1XCdUO2RS6ug": {
    "user_rating": 4.0, 
    "user_location": "Miami, FL", 
    "user_name": "Leslie S.", 
    "review_text": "We found this place on Yelp and decided to check it out since we were on the way to Pier 33 for Alcatraz.  Not much to choose from the menu when it comes to breakfast.  I ordered a coffee and breakfast wrap with egg, cheddar cheese and ham.  The coffee was alright.  No big deal.  The wrap was healthy and delicious.  My husband ordered the roast beef panini.  I only took one bite because it was too greasy.  We sat outside to have breaksfast since San Francisco has had amazing weather.  It was probably 60 degrees.  Not one cloud in the sky.  Perfect breakfast weather.  Not much for scenery.  Good to grab something fast on the go.", 
    "review_date": "2011-04-04"
  }, 
  "OQImub6evGiBTwpQmoVUjA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jess S.", 
    "review_text": "--Update:  The owners fight with each other behind the counter.  It's soured me on the whole place.  And I hear they're not nice to their employees.  What a shame.  --Original review: It really does take AGES to open a new eatery in North Beach, and now that Lisa and Tarek have navigated the treacherous shoals of the Tel-Hi Dwellers, North Beach Association, and the other myriad agencies, groups, and other interested parties, we can all be glad that they have FINALLY opened their doors.  Anyone who lives in the neighborhood has surely walked by the bright red facade of the former flower shop and wondered: When the hell are these people going to open up?!?  Friday, April 27 was their first official, full day of business.  They opened their doors for a few hours on Thursday to give an unannounced preview to friends and neighbors.  Here are my initial impressions: - Lisa and Tarek are both really lovely, friendly, and welcoming people.  As long as they're in the house, I anticipate a great vibe.  They have worked to be a neighborhood-friendly establishment and plan to host neighborhood events and generally turn their place into our second living room.   - The menu looks great!  I haven't sampled anything yet, but I'm delighted to see oatmeal as an option for breakfast (anything other than fat-laden pastries, please!), plus a caprese sandwich - a personal favorite.  It's a lengthy menu for a place of its size, so I'm looking forward to trying out the selection.  And the prices looked pretty reasonable. - Free Wireless.  There's a pay-to-surf station inside, but if you bring your laptop with wireless card, there's free wireless access from the cafe. - Beautiful south-west orientation for sidewalk seating!  The chairs are comfy and they've done a nice job with the flower boxes.  I predict that you will find me here many an afternoon.  Lisa tells me they'll be open 7 AM to 9 PM, so they'll have a great chance to capture late afternoon and evening business that earlier-closing cafes skip. - They have Ace apple cider.  Bonus point.  I'll be back to post more once I've had a chance to visit a few more times and try out some of the menu.  For now, it was just a delight to sit at the sidewalk table and drink a free beer and chat with Lisa.", 
    "review_date": "2007-04-26"
  }, 
  "zj3FG24HjTjmf8k60EUr4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Al S.", 
    "review_text": "A very nice cafe to visit on the weekend. Cafe Capriccio is a good place to chat with a friend or get work done from your laptop.  It's a bit out of the way and there is only street parking, which is a bit hard to find in the North Beach neighborhood. The hours are short; the 6pm closing time means I can only come out here on the weekends instead of after work during the week.   But it's a nice place. Not very large but seating isn't hard to find. A bit noisy from the refrigeration, but the music they play in the background is light and not obnoxious. There are plenty of outlets for laptops and the wifi is reliable.  All in all, I've never regretted a visit to Cafe Capriccio. It's a trek well worth it.", 
    "review_date": "2013-10-27"
  }, 
  "mOnYWi_51_RfEuDhAW0ddw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R L.", 
    "review_text": "Capriccio is a nice cafe to grab a latte or breakfast.  Their salmon bagel is pricey, but pretty good.  Their salads are ok.  I'm a fan of their drinks.  A good change of pace from Starbucks.", 
    "review_date": "2013-10-31"
  }, 
  "qKIUs9G1VhgJ1wPPbFK1sQ": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Kevin H.", 
    "review_text": "Came here to kill time while doing laundry across the street. Great cappuccinos, pillows, PW-free WiFi. Good alternative to a Starbucks. Oh and I saw they have wine too.", 
    "review_date": "2013-01-09"
  }, 
  "bksi9AKVbg9bsgNqAJhO6g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sally S.", 
    "review_text": "Ive been here over 4 times now and each time Ive had to wait FOREVER. I realize this is norths beach and tourist central but the other cafes around this area dont seem to go through this same problem. Today I waited to see customers after me getting served (they had simple orders, I had a cappuccino) and finally after i got my cappuccino, it was pretty bad quality. I really liked their lattes here, so thats why i keep coming back, but its not worth it anymore.", 
    "review_date": "2014-11-02"
  }, 
  "gPoMPlgeXmHWZS8ny6dW2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Regina P.", 
    "review_text": "This is a real neighborhood establishment. Everyone who works here is extremely friendly and they know most every customer by name.   The cappuccinos are a dream and they only use Intelligentsia beans (very high quality).  Expect a little heart or rosetta in the foam. Yum. They're coffee is all french press, meaning it made fresh constantly. There is no decaf (because decaf is for suckers) but they do carry Mighty Leaf herbal teas.   They have a variety of croissants, including chocolate and almond. I wish they would get them from a better, local purveyor. They're fine but not exceptional like the ones you might get at Four Barrel or local North Beach bakeries.  The food is quite good for cafe-style fare. The sandwiches are hearty and the various entree-sized salads are tasty. You can get basic breakfast foods until 11am, such as bagels, egg wraps and parfaits.  They offer quiche with salad all day (or until they run out). The portions are great.  As of spring 2013 they started a weekend wine-tasting program Thurs-Sun in the evenings. Once they get some better storage for the wine and some higher-end producers, I can really see this taking off. For now it's just an excuse for the locals to grab a glass, sit outside and enjoy the evening.   Capriccio could make little improvements here and there, but on the whole it is a great little neighborhood cafe with nice people, great coffee and tasty food. I highly suggest stopping in to grab a coffee and chat or to grab a table and partake of the free wi-fi.", 
    "review_date": "2013-05-17"
  }, 
  "Ldy03uMFaEEEnh3KIsPP_w": {
    "user_rating": 5.0, 
    "user_location": "Lebanon, NJ", 
    "user_name": "Muriel D.", 
    "review_text": "So I have only gone in there for some coffee drinks, but I have to say that this is my favorite coffee shop in the city so far because of how polite, nice, and fast they are.  I have recently gone to some places where you wait 10 minutes for one latte, with rude service, and only one other person in line. Every time I get my coffee drinks here the lovely blonde woman and the guy making the drinks are very professional and polite.  Not to mention my latte is always delicious and has such a pretty swirly pattern on the foam.  I also like the decor and the comfortable seating arrangements inside.  I wish this place was in my neighborhood!  Update:  Had some delicious cupcakes here after this review.  yum!", 
    "review_date": "2009-04-30"
  }, 
  "xz8zl7Xpo9WS8XitIWTpPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "marc d.", 
    "review_text": "Wow, the warf/north beach actually has civilization.  For this 12 year SF resident, this place is just right.  Macchiato, yes.", 
    "review_date": "2009-07-22"
  }, 
  "EuuyiAuEa_s3VSS9i8okmg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah F.", 
    "review_text": "I used to come here at least once a week when I lived in North Beach.  The guy who works there (maybe he's the owner?) is superduper nice.  They have indoor and outdoor seating.  They serve everything from pastry to coffee to beer and wine.  When I go here, I usually get a chicken panini with roasted veggies and hummus.  It comes with a side salad. What I love about this cafe is that they offer free Wifi.  What I don't like about this cafe are the flies inside the cafe that land on your food.  Without the flies I would give this spot 4 stars.", 
    "review_date": "2008-01-29"
  }, 
  "8vsTU9y4vVs3GjmjPp2AUQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "JAYCE B.", 
    "review_text": "I was surprised. Nowadays, any jerk on the street can open a coffee house. Usually, they: -look awful and make lousy coffee. or... -look great and make shitty coffee.  So going into Capriccio, my expectations were in check. At a glance the place looked great so I'm thinkin' \"heeeerrreeee we go.\" To my surprise, my unassuming paper cup was exceedingly decent. Huh. So I learned my lesson.  This could be a good place to sit and uh drink coffee. You know, there are coffee places that you can't wait to ditch, this is not one of one. In fact if I wasn't on my way out, I would have enjoyed sticking around. It was busy enough to suggest the coffee is a decent staple of the neighborhood, but not so busy that you have to do the whole circling buzzard routine like at Ritual.  So that's that. Not bad at all. One time that expecting less really did yield a positive return. Huh, who knew?", 
    "review_date": "2009-01-18"
  }, 
  "NcwQ9tKFCtpZi2B8OEB_yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marieke V.", 
    "review_text": "I love Cafe Capriccio's mochas. Probably never have a better one in my life. I also enjoy their chicken ceaser wrap. Delicious! I try not to go too many days without getting a treat at this wonderful north beach cafe.", 
    "review_date": "2010-10-23"
  }, 
  "Vh_0zlQ0fcZO1iSghObCWg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda O.", 
    "review_text": "Definitely one of the better cafes in the area. Nice food, nice outdoor and indoor seating, nice servers.  I planned to get an almond croissant, but the guy in front of me bought the last one, so that was sad. I asked and they said that they wouldn't be making any more that day. Sad again, especially given that it was only noon.   But I got the granola and it was nice - my friend got a sandwich and also thought it was pretty good. The coffees not only tasted good, but were presented nicely as well.", 
    "review_date": "2011-09-06"
  }, 
  "p2RNQlGqImPe8DnuSVOVVw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cab S.", 
    "review_text": "i could live there!!!! not even kidding! best coffee in town.", 
    "review_date": "2012-03-06"
  }, 
  "ZWnv69H5I-860VgvjEUvcQ": {
    "user_rating": 5.0, 
    "user_location": "Valencia, Spain", 
    "user_name": "Daria G.", 
    "review_text": "Neighbourhood gem. Real good coffee. The tomato/cheese bagel I had was very delicious, well balanced with salty capers and sweet red onions. Internet worked very well. Friendly &amp; fast service, pleasant interior and exterior. I am hooked up.", 
    "review_date": "2009-08-30"
  }, 
  "5qgJTus1l35A6bqW2fFk0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raina D.", 
    "review_text": "Stopped by the cafe on Sunday morning and had one of the best soy cappuccinos I've ever had (although I usually get my coffee black, weird).  I felt like this adorable cafe probably made amazing drinks and I was NOT disappointed (although ordered with an extra shot of espresso..so I may have been caffeine drunk..).  I got the yogurt parfait to eat and the granola was crunchy and there were BANANAS!!!! I hate places that give you all the fruit no one wants (melons I'm looking at you).   I can't wait to come back for lunch since the paninis &amp; sandwiches looked delish! The guys who were working were extremely friendly and would be a welcome inclusion to my weekend routine :)", 
    "review_date": "2014-03-11"
  }, 
  "7CWRoP0f4TLwRkYR5syiqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew M.", 
    "review_text": "I came here for lunch and it's a cute little cafe. Very tiny, actually. Not sure if I would come here to do work since there is not much space. But for the purpose of sitting down with a friend to chat over a cup of coffee/tea Cafe Capriccio is perfect.", 
    "review_date": "2013-08-13"
  }, 
  "qU3E7ENm8VsMc_IZCpTCZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "The Sock S.", 
    "review_text": "I've only come to get something to go, so can't comment about the table service. Though it does seem like a nice place to have a leisurely meal or coffee. Whoever helped me, whether it was the owner or staff I don't know, seemed nice enough and happy with their job.  The food is ok. The coffee is kind of bleh. It's weak and the plastic lids have a funky smell to them. Not a rotten smell or anything, but you just get the feeling that they've been sitting around for a little too long.", 
    "review_date": "2007-07-24"
  }, 
  "odM7WqRsORcMsFymWEMiAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric H.", 
    "review_text": "So far, I've only had 1 item from this place (the Caprese Panini), but it was very good: tasty &amp; well-presented.  Nice room, too: clean, well-appointed, with outdoor seating as well.  Staff was friendly &amp; overall vibe was pleasant.  I work in Fisherman's Wharf, and I am continually challenged by the lack of decent Lunch places there.  Considering that, Capriccio is a particularly good find.  I will definitely be going back...", 
    "review_date": "2009-11-18"
  }, 
  "kv_coFfYsJ3oAxZu0pIXkg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert A.", 
    "review_text": "Finally - the coffee is good, the new owners are friendly, the space looks better and I will start going back to this cute little corner coffee shop in my neighborhood.  The latte I ordered today was only $2.71 and was outstanding.  So happy with the ownership change and the improvements!  I look forward to seeing them grow and improve even more.", 
    "review_date": "2008-11-03"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "Cute, quiet coffee shop -- great for getting some work done, or for grabbing a book and relaxing.  Located in a cute residential neighborhood, and also has some outdoor seating.", 
    "review_date": "2011-04-17"
  }, 
  "PgrCdD3iPgYzXxO8QsMnew": {
    "user_rating": 5.0, 
    "user_location": "Aurora, CO", 
    "user_name": "Jessica J.", 
    "review_text": "Fantastic!  Wandering around too early on Sunday morning and looking for somewhere to rest, we saw this cafe and popped in for a latte and chocolate croissant.    Cozy, neighborhood shop with tables out front to enjoy your beverage and pastry.  Perfectly charming!", 
    "review_date": "2010-07-26"
  }, 
  "C-zzygTmQhZFA1K5qHND5w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel F.", 
    "review_text": "Met with a co-worker at Cafe Capriccio for coffee and breakfast one morning.  Overall,  this place is a really great local coffee shop and I'll be going back.  I ordered a cafe au lait, which was incredible.  I also had an egg white omelette which was pretty good.  The cafe seemed like it had a lot of locals, and it would be an perfect place to study or read a book.", 
    "review_date": "2010-09-28"
  }, 
  "pKbaS8S9V4nL-p3WCA3rtg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "elaine w.", 
    "review_text": "This morning - 1/12/2012 - honestly got the worst coffee ever - excellent choc croissant though.  Had to stop by a Starbucks to get a proper cup of joe and throw away my $2 cup from this Cafe...that bad!", 
    "review_date": "2012-01-12"
  }, 
  "pHwlLUKTfB2kzBPRV0N4Ng": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scoot S.", 
    "review_text": "Stopped in for a latte. Very good coffee. Seemed like a great place to spend some time relaxing", 
    "review_date": "2012-10-08"
  }, 
  "eBm6v1wUQgrdOJ6DJTfKoQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate G.", 
    "review_text": "Went here for lunch with two coworkers (even though I'd packed a salad) and I was utterly, totally disappointed. The cafe has a cute exterior, but don't be fooled! The baristas (male baristas = barristers?) were distant and unhelpful. Tea was weak -- I ordered a small and received a cup much larger than the 6-ounce mug I was expecting. My panini was grotty: the bread was crisp, but the fillings were tepid (as though the sandwich hadn't been heated long enough?) and the tomatoes were mealy. Chicken cubes tasted as though they'd been prepared days earlier. Adding insult to injury was the fact that I shelled out $12 for the watery tea and sandwich-mess. Oh, if only I'd stuck with my salad...", 
    "review_date": "2010-11-20"
  }, 
  "pOl7HauDeEkcQLZWDbgg6Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Irving G.", 
    "review_text": "What a delighful place with delicious food and charming proprietors!  While I'm emabarrassed to say that I am a picky eater, it's not a problem here. They are inventful with their meals and menu, as well as flexible on the fly. They are kind enough to adjust their offerings to suit my tastes and dietary needs.   I love them and they're right by my office, so it's great for morning meetings and lunch work sessions.   They make life in North Beach civilized. Oh, and they have free WiFi. How cool is THAT!", 
    "review_date": "2010-03-13"
  }, 
  "63magicb7zDNIC_fIwfffA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana C.", 
    "review_text": "I love Cafe Capriccio. It is an adorable little coffee shop that's a bit hidden when compared to all of the coffee shops on Columbus. The seats are comfy, decorated with pillows and magazines are provided to read. This place is a great place to spend a morning sipping on an artsy cappuccino (they put little hearts and pictures in the foam) and eating a granola mixture with milk and fresh cut up strawberries and bananas. Yummmy! They also have sandwiches for lunch but I've never tried them.  For the food and service, this place definitely gets 5 stars. The only reason I gave it 4 stars is because there have been a few times when I needed to get food to go because it was completely packed and because it could be a bit more lit.....But then I might spend hours studying there and they may never get rid of me.   This place is highly recommended. Oh, and did I mention there's free wifi? A gem!", 
    "review_date": "2011-01-05"
  }, 
  "uQyr8iKPugO8pJyfoGOqmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johana A.", 
    "review_text": "Great food! Fast service!", 
    "review_date": "2013-12-06"
  }, 
  "iFGNCGcMu2iZYesalnbOtw": {
    "user_rating": 5.0, 
    "user_location": "Danville, CA", 
    "user_name": "Avital B.", 
    "review_text": "Cafe Capriccio has an absolutely lovely ambiance with genuinely nice owners who care about their customers (they work the counter and see to your every need), scrumptious paninos (freshest bread and perfect fillings), lots of vegetarian menu options and strong coffee. Oh -- and FREE WIFI. Does it get any better? I just moved to the area and plan to be here a lot.", 
    "review_date": "2008-02-13"
  }, 
  "sQT4VOZUwpDqcnrPFibJfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T. B.", 
    "review_text": "clean, quiet, free wifi, yummy coffee, a friendly staff that leaves you alone, the occasional dog that visits - what more could you ask for in a neighborhood joint?  ask for their frequent buyer card.", 
    "review_date": "2010-01-11"
  }, 
  "7sKBX_P0LXeLXJGc2JDYSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S B.", 
    "review_text": "These guys truly make the best coffee in Nth Beach, possibly even the city! Fellow Aussies: their cappuccino is a perfect 'flat white'.  One teeny weeny gripe, certain staff members can sometimes be less than friendly, and their ordering system (whereby the poor barista often has to do everything) needs work.", 
    "review_date": "2011-08-13"
  }, 
  "pPi_DHfkWETrMClkrQ_G9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sani S.", 
    "review_text": "They say, Home is where the Heart is. Well it's more like Home is where the Capprichio is.   Around the corner from it's competitors, Capriccio is that hidden treasure in North Beach that brightens your day at any time between 6-7pm Monday-Sunday. Can't help you after hours, sorry that's when you call a therapist for your problems.  A crew of multi-ethnic, multi faceted peeps that run the show, always chill and always upbeat. Out door seating if you wanna kick in some vitamin D on a sunny day, out door seating if u cant afford a shower on a rainy day. Excellent for studying, or reading, with the assistance of free wifi.  I've been a regular at this cafe for about 2 years for my cup a joe, but it's there Lattes that bring the real shine. I've been so addicted that my cards have been stamped up over and over. 10 star stamps and I'm ordering a FREE large latte with 9 shots pimpskillet, like fiddy cent would!", 
    "review_date": "2012-05-22"
  }, 
  "KnMwl1G5lrIU1N5Bty-rlg": {
    "user_rating": 2.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Olga V.", 
    "review_text": "The food is tasty, but the wait is way too long, long line-ups in the morning, because they have one cook and they always mess up orders, give wrong change..  I came here a couple of times and each time they'd forget something from my order. Once they forgot about my large latte I ordered and when I reminded them they made me small first, then medium and then finally made my large one.  They have a hotel almost next door and the crowd is flowing from there most of the time. Mornings are the worst to come, you'll grow old and die waiting.", 
    "review_date": "2014-12-30"
  }, 
  "AtoDIsk5vEcIIXJqPp-PLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric W.", 
    "review_text": "Small shop, outside seating, free wifi, but really unreliable signal.  Nice service, good food, and good coffee.", 
    "review_date": "2009-03-30"
  }, 
  "c_UiCt7xOZbpZrIrsrUB7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike S.", 
    "review_text": "By far the best coffee in the area. Staff are super sweet. Their sandwhiches are good too. Well done !", 
    "review_date": "2011-01-23"
  }, 
  "H3PFTHE-SL1gg2exnNy1jg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily S.", 
    "review_text": "What a cute little place in North Beach. The interior was so inviting and the Batistas were really friendly. They even offered to bring our coffees to us outside. We ordered a mocha and a cappuccino and while the mocha was really good, the cappuccino was a little over-extracted. Oh well, the ambiance made up for it :)", 
    "review_date": "2012-04-01"
  }, 
  "aIqtnxoopMTWARZNCqlY1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eli B.", 
    "review_text": "Alrighty, I'm a total fan. I can't give them 5 stars with the knowledge that their breakfasty sandwiches are so average, but everything else is stellar.   Their chai tea rivals the Boulange as the best in the city, the pastries are solid and the people that work there are cool and friendly. A bunch of people come and hang out with their laptops or a book and sit in the sun at the tables outside when it's nice. Seating inside is a little limited though.   One of my favorites in the NB!", 
    "review_date": "2011-04-14"
  }, 
  "WH4mAkt2q3exGDyQf_EZ1Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie W.", 
    "review_text": "It was ok.  I got my coffee and bagel with less-than-great hummus and managed to eat it.  The lady called me \"sweetie\" at least ten times and \"honey bun\" once in a tone of not-so-restrained annoyance.  Not a pleasant experience and not great-tasting either.", 
    "review_date": "2013-11-07"
  }, 
  "md0k1UXOOqxbArJNcBpKTg": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Bora P.", 
    "review_text": "The barista/cashier was so nice! :)", 
    "review_date": "2014-01-24"
  }, 
  "-fArTy74H8r8a0goRzpNbA": {
    "user_rating": 3.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Rich M.", 
    "review_text": "Look, there is nothing special here. Well, perhaps they do breakfast better than lunch?  I had lunch here with 6 others.  The employees were nice and efficient, but the place looked a little dumpy, and the food was just okay.  I didn't finish my panini or soup. Certainly not what I expect at 4 star level.", 
    "review_date": "2013-12-04"
  }, 
  "_OCVA417JevjE1ifcftgIA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "V P.", 
    "review_text": "I love this cafe. It's really cute the service is great! I always get the lattes and chicken or beef panini. This is a good spot if you need some time to study or read a book. They have free wifi and a couple of outlets for your laptop. There's an outdoor seating, so it's also a nice place to have coffee with some friends.", 
    "review_date": "2010-05-03"
  }, 
  "jCPCn1wzUDktPxVV2ye6BQ": {
    "user_rating": 4.0, 
    "user_location": "Citrus Heights, CA", 
    "user_name": "John C.", 
    "review_text": "Great cafe for breakfast bagel sandwiches. I'm not sure about the coffee since i don't drink the stuff, although other people seem to enjoy it. I would definitely return for another bagel sandwich.", 
    "review_date": "2013-03-14"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "This place is awesome.  The coffee here is amazing.  Better than that blue bottle crap.  Don't come here so I can find a table to write my fatty yelp reviews.", 
    "review_date": "2010-02-21"
  }, 
  "EGBVfQeXjkoY9aMBXp-S8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin H.", 
    "review_text": "Love this place. Great Chai Latte, best I've tried in the city. Great cupcakes too.", 
    "review_date": "2009-08-01"
  }, 
  "mATkJ62zp1Iobu8wxHmfeA": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Pedro L.", 
    "review_text": "Place isn't bad but not the 4.5 stars it's getting. Starting to feel the taste standards in sf are pretty low.  Saw this place on yelp and figured it was within walking distance and got good reviews.  I ordered the chicken panini and the lady friend got some sort of quiche.  Mine was all bread &amp; hummus without much flavor.  Hers was decent but bland.  Didn't seem to be any seasoning and all you could taste were the black olives.  Strange.  I guess this is more of a place for bread and yogurt, and such.  Don't know.  Baffled.  Keep in mind that all of this needs to be taken with a grain of salt as I'm not a big cafe person, which is why it was strange that I'm here in sf.  This place has more cafes than Wisconsin has bars.", 
    "review_date": "2013-08-25"
  }, 
  "IzWPwr6Hm5qNhrMPcqKlSw": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Cecilia G.", 
    "review_text": "This place is just the spot to go to if your looking for a pleasant environment and great coffee especially the mochas. I also liked the sandwich very fresh and free wifi :)", 
    "review_date": "2015-01-21"
  }, 
  "3CcR8pm-lilG_qW1WhjxHw": {
    "user_rating": 5.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Andrea H.", 
    "review_text": "I absolutely loved this place. The manager and staff were by far some of the nicest, most down to earth individuals. The food (Best panini I've had), to say the least, was wonderful and the cafe  was very well kept.The whole environment there was perfect. I definitely will be coming back.", 
    "review_date": "2014-10-02"
  }, 
  "kAf3fe3Z4T43DYys8j1jaA": {
    "user_rating": 4.0, 
    "user_location": "Bay Area", 
    "user_name": "J K.", 
    "review_text": "A nice place for locals.  The coffee and service are both pretty good; the food is decent.", 
    "review_date": "2008-02-17"
  }, 
  "ele8GHyshSdYpClRbziJVQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maika H.", 
    "review_text": "We came here every morning for 5 days as we were staying across the street at the lovely San Remo Hotel. The food was always delicious.  I especially enjoyed the Breakfast Parfait with yogurt, granola and fresh fruit. The fruit varied each time and was always very fresh and tasty.  The drip coffee was fine and I was told by my fiend that the espresso was fantastic.  The staff was always very friendly.   The best part was the free wireless.  Perfect for traveling with a laptop.  I would definitely come here again if in the neighborhood.", 
    "review_date": "2008-03-31"
  }, 
  "Wflw5pjgoV3nr7t1MSgy2w": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Kai R.", 
    "review_text": "free wifi, good sized tables, EXCELLENT espresso, not crazy crowded, and really delicious pear gorgonzola honey salad.", 
    "review_date": "2010-07-10"
  }, 
  "S2abQwduBzRpEbF_ChBkyQ": {
    "user_rating": 3.0, 
    "user_location": "Saddle River, NJ", 
    "user_name": "Bonnie C.", 
    "review_text": "i had a <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> voucher here and ordered the smoked salmon bagel &amp; a chai latte. the smoked salmon had a bit too much cream cheese on it and the salmon slices were thin; the latte was lacking the chai flavor. food was acceptable, but not impressive.", 
    "review_date": "2013-06-10"
  }, 
  "pqFV6gicp9vMSsxBFlu40g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J A.", 
    "review_text": "Sorry to have to say that my pear salad was drenched in salad dressing which made it very difficult to enjoy, and my turkey sandwich was mostly bread with two petty slices of turkey and two petty slices of avocado.  I guess I really just don't expect to be served food like this.", 
    "review_date": "2014-07-08"
  }, 
  "GM_eP6oJUX2U3iqlpkCpHQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kuzia M.", 
    "review_text": "Great environment, friendly staff good service.   The pizza is GREAT, can't go wrong with the calamari, the coffee is good but nothing out of the ordinary.   Just noticed they are now on OrderAhead, so you can order on your iPhone for pick up and skip the breakfast line - BIG plus.", 
    "review_date": "2013-02-21"
  }, 
  "HceZs_rhc-SJTwlQ52n9JQ": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Debbie M.", 
    "review_text": "Probably one of my favorite places to casually eat in SF. My BF lives down the street so it's the first place we think of when we want a bite - morning or afternoon. The hospitality is unbeatable and the food is incredibly fresh and light. You don't feel like you need to walk around the block a few times after eating there.", 
    "review_date": "2008-08-04"
  }, 
  "hHe9rtIBNwVByKYQhrjJmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mrs H.", 
    "review_text": "What I like: -great outside seating -yummy coffee (love it!) -nice guy behind the counter -great roast beef sandwich  What I don't like: -their chai tea. It's the weirdest thing I've ever had. Not at all what you would expect.  -big screen TV on the wall. It feels tacky and is annoying. -slightly slow service  What I do: I choose coffee over chi and sit outside to avoid the TV. Perfect.", 
    "review_date": "2008-07-31"
  }, 
  "OvR19daYCBiL4FnZOQzQsA": {
    "user_rating": 4.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Alecks R.", 
    "review_text": "Cafe Capriccio was your ideal french cozy cafe'. Its a corner shop in the middle of a nostalgic San Fran neighborhood.   Small tables held up the walls with the coffee bar dominating the room. INstead of the traditioning cakes and pastries, the staff had a selection of quiche in the cooler. I chose the Mexican flavor as my wife chose the Pesto. Both were delicious. Further, the coffee was life changing.   Maybe it was the gloomy weather or the neighborhood patrons coming in and out; either way it was perfect.   We will be back.", 
    "review_date": "2014-10-30"
  }, 
  "h3V10dN21mI06bgcXfuBlg": {
    "user_rating": 5.0, 
    "user_location": "La Mesa, CA", 
    "user_name": "Jon N.", 
    "review_text": "Great place. Owners are awesome, coffee is really top notch.", 
    "review_date": "2009-10-08"
  }, 
  "sZ1QAMEj5zjJq92dhurtug": {
    "user_rating": 5.0, 
    "user_location": "Rockridge, Oakland, CA", 
    "user_name": "rhiannon g.", 
    "review_text": "My fav. cafe.  Free wifi, nice people, and a cute interior, where I can sit as long as I like.  The parfait and the caprese sandwich are fabulous everytime!  They keep things simple, and stick with what works.", 
    "review_date": "2009-06-14"
  }, 
  "UdJavnO3AEOFvzIED1cCzA": {
    "user_rating": 5.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Job E.", 
    "review_text": "I happily spent an entire afternoon here working away.  Complete with a friendly vibe, good background music, and tasty iced lattes keeping me energized.", 
    "review_date": "2011-09-05"
  }, 
  "mlVAa-IySCq1FGLYG2ysqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily S.", 
    "review_text": "I think I have to give this place another star... it's just that good.   I introduced this hidden gem to one of my good friends and together we came here to work on final projects for school several times. We both fell in love with this place more and more with each visit. The coffee is so amazing! Now, even if I don't stop in to do work, I will stop by just to get a coffee to go... it adds a little bit of sunshine to any type of day that I may be having.   Definitely recommend the yogurt parfait, the oatmeal, americano, regular coffee or the cafe au lait. So good!", 
    "review_date": "2010-05-27"
  }, 
  "gi3VkcISbUpd0BQ68FerAQ": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "John S.", 
    "review_text": "Spectacular coffee, friendly staff and very good bagels... yes quality bagels in SF!  That alone is reason to go.  But seriously, the coffee rivals everything from Blue Bottle to Ritual.  I think  they use Illy and big props to the Barista - he knows how to make great espresso and lattes.  PLUS he doesn't come across as too cool for school.", 
    "review_date": "2011-09-07"
  }, 
  "Xd_2uetx9LxA2hQassydJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "F K.", 
    "review_text": "My favorite cafe in the city, and I think I have been to quite a few.  It is not easy to find good cappuccino in the States -- ask anyone from Continental Europe, let alone Italy. This makes Cafe Cappriccio particularly special. I am talking about coffee, instead of indifferent froth thing with some liquid at the bottom.  This place is also good for breakfast/ lunch. The selection is narrow, but everything they make, they make it good.  The place attracts a number of regulars from the neighborhood, myself included, which I think speaks to its quality. I have seen one bad review, which apparently received a angry private message in response. The original reviewer assumes that this was written by the staff or the owner. However, I can surely say that this place has many loyalists and I would not find it surprising if it was one of us. (Nevertheless, everyone's entitled to their own opinion -- people can read and judge for themselves).  Other features: Great for studying/ working, many power outlets, free and fast wi-fi, quiet, cozy, friendly staff, fast with orders. Too crowded only around lunchtime. However, a bit on the expensive side. Definitely recommended.", 
    "review_date": "2011-04-13"
  }, 
  "USGwU83FRXkHT_cB6ucIqw": {
    "user_rating": 2.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Michelle S.", 
    "review_text": "First of all if you want me to return, you should be friendly!! The girl who helped me was so rude! I had a <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> certificate and she looked at it like it was in another language! I asked about something on the menu and she said rudely, I don't know what your talking about. I ordered a mimosa and then said we don't have those. I ordered a chai latte which tasted good but not hot enough. I also ordered a egg wrap which was just okay. Needless to say I probably won't be using my other certificate I bought for here. Very disappointing experience :(", 
    "review_date": "2014-04-25"
  }, 
  "ujHwkKknvFGh7UnJsVn1mg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim R.", 
    "review_text": "Coffee here is quite good, one of the places I like in the area.  There's another cafe around that serves better coffee, but they don't open until 8:30.  If I need a coffee early in the morning, I would come here before work.  Cool staffs.", 
    "review_date": "2011-10-19"
  }, 
  "5hpstpoaZrOFOOQhIzqL4A": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Jenny S.", 
    "review_text": "Why is this place not in Denver?!!?  This is exactly what I am looking for every time I go into another cafe.  Quaint, quiet, wonderful smells, incredibly helpful staff, good food options and the feeling that coffee is to be enjoyed, not slammed in a rush to get your caffeine drip started.  I had a very simple hazelnut latte and the thing just blew me away.  It must have been the quality of the beans, but they were not joking around.  The mug was so big and warm and colorful and they spent the time to make an artistic design in my foam, which is one of my all time favorite things.  In my personal opinion, it is the difference between a place to get coffee, and a cafe.  Way to go staff of Capriccio.  In terms of food, I had the fresh fruit with granola, and it was just that- very fresh fruit with amazing granola.    If I am back in San Fran anytime soon, it wouldn't be soon enough to get here again.", 
    "review_date": "2010-02-05"
  }, 
  "Ka3sTG2hnVP696O72HiJlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregg K.", 
    "review_text": "Cappuccino was very good, and the prosciutto panini was excellent. Very fresh Buffalo mozzarella.  I plan on going back here!", 
    "review_date": "2010-04-29"
  }, 
  "zEEMKVoTrBhomd-8bvbTjw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim E.", 
    "review_text": "First things first - the coffee here is insanely good.  The quality of the espresso has just been cranked up a few notches recently from an already lofty post.  The first few sips especially are creamy coffee heaven.  These guys take their coffee seriously and it shows.  As if that weren't enough, the food is also very tasty with lots of good baked goods and breakfast fare and then an excellent cafe menu of salads, wraps, panini, etc.  And it just keep getting better.  The staff is super friendly and cool, the location is off the beaten path and gets lots of sun on the outside seating.  The inside is cozy on colder/rainier days too.  If you are in the 'hood check it out.  Or even make the special trip - you can hit Trader Joe's nearby on the way home.  Cafe Capriccio is awesome.", 
    "review_date": "2010-01-04"
  }, 
  "SxlJ59sR8frvcCQrT8ZOfQ": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Chris W.", 
    "review_text": "I came here to study after reading the reviews on Yelp and was not disappointed. There are many tables and wall outlets for laptops. The booths against the wall were very comfortable. It was not noisy. Staff was courteous and the all of the food and the coffee were delicious. The only complaint I have is that the prices are a bit steep. Ordering coffee and food came out to about $12.50 per person.", 
    "review_date": "2010-09-16"
  }, 
  "m5cBT7OYfn0HM0d-RCsdZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miika M.", 
    "review_text": "This is a great spot when walking around town with the bf and feeling the need to stop in for a short snack because he forgot to get something to munch on earlier.  Ladies, beware of the man that becomes Grendel on an empty stomach.  Small, cozy, and unpretentious, this is a spot for locals to meander in and grab their cup of liquid caffeine prior to heading out for the daily morning walk.  I requested my usual caffe latte and it came out exceptionally strong.  Not too roomy but for the mid-morning, a good spot on the go.  They also carried pastries but I did not purchase anything as we were to have lunch in North Beach.  Next time, that bran muffin would be mine.", 
    "review_date": "2010-11-29"
  }, 
  "BI_PXSF5M61S8O9bqR7VVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T L.", 
    "review_text": "Such a cute cafe with tons of food of all kinds to choose from. Sandwiches are yummy! They also serve alcohol, which is always a plus : )  It gets busy quick and service is somewhat slow.", 
    "review_date": "2008-06-19"
  }, 
  "Sfgfz2Awh2EGPJvoEwwhKQ": {
    "user_rating": 5.0, 
    "user_location": "Berea, KY", 
    "user_name": "Peter H.", 
    "review_text": "Use the Yelp check-in discount and enjoy the neighborhood ambience, coffee smells and the warm friendly service. I am an out- of-towner yet have started my last three mornings here.", 
    "review_date": "2014-08-09"
  }, 
  "aD_nDmBiRLg9yLzX2dF_8w": {
    "user_rating": 4.0, 
    "user_location": "Williamsburg, VA", 
    "user_name": "Olivia R.", 
    "review_text": "Great neighborhood corner cafe!  I really liked the laid back and friendly atmosphere, the coffee was bold, and my prosciutto panini was super flavorful and delicious.  I especially loved the bread...a local, artisan-made Italian roll.  Everything appeared/tasted fresh and quality.", 
    "review_date": "2012-05-03"
  }, 
  "B9_M5qoWA5tHXQWHfoW0tg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leon C.", 
    "review_text": "Cute little coffe shop in North Beach. I like how the place is setup inside and outside. Definitely a great place to hangout with friends or by yourself. Service is very attentive and friendly. Highly recommend it.", 
    "review_date": "2009-07-22"
  }, 
  "sH_t9HCv3hIxVagul3J3gQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William B.", 
    "review_text": "Wanted to try a new coffee shop, and the proximity of this place brought me in.  You can tell its a local favorite, we saw a long line of people form behind us just after we came in and it didn't really subside while we were in here.  The espresso drinks we had were really good, definitely get my recommendation on those.  I like the vibe of the place, really homey and mellow.  I wanted to also get a bit to eat, and the quiche looked awesome.  But $7.XX for a slice??  Seems mighty steep, I don't care how good this could have been.  But, maybe some day.", 
    "review_date": "2010-03-07"
  }, 
  "TbotEm1b25Wi-kFnVGEHWw": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Matt P.", 
    "review_text": "I was in search of a wifi connection one afternoon when I stumbled upon this place.  And while their internet service wasn't available, I may have enjoyed one of the best mochas I've ever had.  Since it was the afternoon, things were quiet but the girl that was there working was very nice.", 
    "review_date": "2008-10-18"
  }, 
  "4gqCSi1VxP3Rz7JEN2mmTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia C.", 
    "review_text": "Everything you could want in a local cafe.  Surprisingly good food.  I had turkey on ciabatta, which was awesome.  My friend had mushroom quiche, which he said was very good.  Free wifi, outdoor seating.  On Sundays, it's just a block away from the new N. Beach farmer's market.", 
    "review_date": "2010-06-27"
  }, 
  "NK5JRQE9mQERAMBFxR3m6A": {
    "user_rating": 5.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "David B.", 
    "review_text": "Best cappuccino I had in 4 days all over town.", 
    "review_date": "2010-07-31"
  }, 
  "NZF71V_G0LfQeMp8BXaTCA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mikaela H.", 
    "review_text": "I discovered this place a few months ago, during my last semester in law school. They are wonderful here. Free wi-fi, delicious coffee, and the food is good too. I recommend the pear and honey salad. The owners are wonderful people, and will let me order just an iced tea and sit here for hours studying. I'd been bouncing around from cafe to cafe in North Beach trying to find a place where I could sit and study, and this place is the best. It isn't too loud, the music is nice, and they don't come around and harass you every hour like some of the other places up on Columbus.  Jesse and Alex are selling the place though in a couple of months, which is sad, but the new owners supposed to be keeping everything the same.   I highly recommend this place if you're looking for an easy going, relaxed environment to chill, study, get some work done, or just enjoy a delicious cup of coffee or lunch!   The only downside is that they do close at 6pm... It's not that early, but I'd like it if they remained open a couple more hours in the evening.", 
    "review_date": "2010-06-20"
  }, 
  "qGT5bSIIwGlHbX_ocEIDUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barbara C.", 
    "review_text": "This has turned into my favorite cafe in North Beach.  I think they make the best coffee in the 'hood, and people who REALLY appreciate their coffee seem always to rank it highly.  They have some good sandwiches and excellent vegan fruit pies. You can get a real meal here, not just a pastry snack.  And the staff is super nice.  Free wi-fi!  It's also not in the center of all the hustle and bustle of North Beach, which I really appreciate on a weekend morning.", 
    "review_date": "2011-04-19"
  }, 
  "4Z7oCyogvhWw3DDMo7oBFA": {
    "user_rating": 3.0, 
    "user_location": "Rocklin, CA", 
    "user_name": "Danielle W.", 
    "review_text": "They would not honor the free item offered fro checking in on Yelp but they make a great Proscuitto Panini and let me camp out and use their free WiFi for about to hours so I can't complain", 
    "review_date": "2014-02-11"
  }, 
  "dwhDaHf6I0kcncAzo6VSxA": {
    "user_rating": 3.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "peter d.", 
    "review_text": "So, I only come here because its directly across the street from the closest laundromat near me and for the wi-fi. I was so excited when I saw this place being constructed because I liked the awning and how they advertised the promotion of drinking wine during the day. Once I finally experienced it though it was a let down. Ive had one good and reasonably priced pannini but the coffee quality was poor as is the wine selection and salads. 3 stars because its so close to where I live, free Wi-Fi and a cute waitress.", 
    "review_date": "2007-07-24"
  }, 
  "sx9SmmgrCjjmzjW-fXWbyg": {
    "user_rating": 5.0, 
    "user_location": "Cypress, TX", 
    "user_name": "Kristin S.", 
    "review_text": "Awesome little place!!  Best latte ever, awesome Chicken Caesar Wrap &amp; Caprese Pannini and the Mimosa was prepared with a generous amount of champagne!!!", 
    "review_date": "2013-05-30"
  }, 
  "gG6FFEEVRf9qu0cMqosSQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "saurabh S.", 
    "review_text": "nice coffee shop in my neighborhood. The coffee was very good. They know how to foam soy milk perfectly and you'll get some coffee art on your cappuccino or latte.  They carry vegan pies too! Great place to go have a leisurely saturday morning coffee/snack.", 
    "review_date": "2009-04-28"
  }, 
  "Jc69-Q9hOmiCULiHnRPheA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S...... p.", 
    "review_text": "I love this place. I have been going here for a couple years now.  I am a cappuccino lover, I will only go to a few places in the city and this is a winner.   Out of all the places I go for good espresso this one has the most to offer. They have salads and other yummy fresh-food items, electrical outlets and outdoor seating.  There prices are great, too.", 
    "review_date": "2012-05-09"
  }, 
  "0QLMxQmYMkRrSV1Mcmpuxw": {
    "user_rating": 5.0, 
    "user_location": "Santa Fe, NM", 
    "user_name": "J R.", 
    "review_text": "New owners are great. Coffee is made by French press and is excellent. Food is very good, too. Best cafe in the area.", 
    "review_date": "2009-02-03"
  }, 
  "qrviSuPe5fE-pHfiKFvJEw": {
    "user_rating": 5.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Adam Z.", 
    "review_text": "My wife and I stopped here for coffee while in SF for Escape from Alcatraz Triathlon.  My experience here was limited, but the coffee is truly top-notch.", 
    "review_date": "2013-07-12"
  }, 
  "UyQNFKPF8BtNpKiOrXCMQg": {
    "user_rating": 2.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Christine R.", 
    "review_text": "Recently came up for a quick 4-day visit to the Bay Area and decided to check this place out because well, my best friend and I were super hungry and Mama's Cafe a few blocks away closed upon our arrival. I don't think I'll quite understand the early closing of cafes in SF. I like to sleep in thank you very much... maybe it's me? Maybe it's a Southern Californian thing? Whatever. Back to Cafe Crap-iccio...  Verdict: Caprese panini = whatever. Acceptable, edible, satisfying-ish.  Latte = on point. Really delicious, authentic, fresh espresso and soy milk. Free wi-fi = yay! Great place to get work and studying done.  Maybe I came in with higher expectations... I don't know. But $11 for mediocre sandwiches and a latte is not where the money's at. You're better off getting a sandwich and coffee at Nordstrom Cafe. At least you'll be able to shop afterwards!", 
    "review_date": "2013-06-07"
  }, 
  "vc9zEAbb2GJMMJ75bPbsvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coppertop C.", 
    "review_text": "Okay, First the good stuff! Alex and Jessie are two of the nicest people you'll ever meet. That, combined with all of the delicious dishes that they serve, should be reason enough to go there now. In fact I just got back!  Now the bad stuff... They are the *new* owners of this cafe, not the *old* owners that people here are complaining about. That's not really the bad stuff btw, what's bad is that Yelp refuses to take down reviews about the former owners' spousal abuse and poor customer service that don't have anything to do with the great folks that own this cafe now and their business is potentially being harmed by this practice.  Please come by and try the food and drinks here, you'll enjoy yourself and will help right a wrong.", 
    "review_date": "2009-03-18"
  }, 
  "Tj-dZQNgz2pNpBGLvCkm6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taylor C.", 
    "review_text": "I've been here a few times, and I tired to really like it because I live so close, but in the end I couldn't force it. I would be ok paying their elevated prices if I was getting the right quality in return, but I haven't had anything that impressive yet. The lox and bagels (my personal breakfast favorite) was exceedingly mediocre and not at all worth the 9 bucks.... I don't think the atmosphere or cafe itself is that impressive either. Maybe I'm missing something, but I'll be sticking to other cafes in the area", 
    "review_date": "2012-02-12"
  }, 
  "UWbroyc9GGoZMvwpSmvVCg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scarlet P.", 
    "review_text": "I have some mixed feelings on this place.....I really like sitting outside here, the street is not as busy as Columbus and you can just chill there for as long as you want.  The food I have had there was quite good, and I like the European feel that the place has.  On the other hand, the guy behind the counter is not very nice.  I've seen him yell at employees and that's kind of awkward...I definitely would not want to work there!  As someone who has worked in the service industry I take that into consideration.  Not cool!", 
    "review_date": "2007-10-05"
  }, 
  "5P9y1rlgX5fuauKvXatopQ": {
    "user_rating": 5.0, 
    "user_location": "Holliston, MA", 
    "user_name": "Ross D.", 
    "review_text": "Delicious caprese sandwich (unbelievable bread) came with a tasty side salad.  Great place to sit outside on a nice day.  Latte to go kept me moving up and over Nob Hill.", 
    "review_date": "2009-11-12"
  }, 
  "gnlv90bq-zwAXmPCpz7LRw": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "A K S.", 
    "review_text": "this place is completely necessary in the culinary desert that is the general fisherman's wharf region.  i dont drink coffee (despite working in a cafe) so i can't speak for their coffee and fancy espresso drinks. but i do eat panini and salads. and they do both of those really well here.  the funny thing is, i hated the real italian panini in italy because they were too simple and usually just contained some processed ham ingredient like speck or proscuitto. and i hate most of the \"panini\" in the US because its the extreme opposite, stuffed with six cheeses and mayo and every type of meat and vegetable farmed in this country. basically just deluxe subs thrown on a sandwich press. the only type of panini i actually like is the type they have at a lot of little italian cafes in new york, not overstuffed with random non-italian crap but not too plain either.  so i guess thats what this place has, new york italian-american panini. and its served on this soft flattened baguette-like bread that doesnt break your teeth.  the interior is really clean and new looking, and on a sunny day its nice to sit at one of the little outside tables and be far enough away from the wharf to not smell rotting fish in the air.", 
    "review_date": "2007-12-05"
  }, 
  "5j0QmE-ktdY2wfEYX2YStA": {
    "user_rating": 2.0, 
    "user_location": "Otford, United Kingdom", 
    "user_name": "Amy W.", 
    "review_text": "Ive been here a few times. The first, I was with a group of friends from the UK. The drinks took over 20 minutes to get to our table and were prepared one by one, the food took an hour. It was pretty good.   The other times I have been here the service has been quicker but I have not ordered food again.   I am boycotting this restaurant as I have heard they treat their staff incredibly poorly and the way the owners conduct themselves behind the counter is far from professional. ( i,e the guy shouting at his wife in front of customers).  I loved the idea of this cafe. So close to where I live, a lovely cute Mediterranean feel, and a menu to make your mouth water. It's just a shame the people that run it are such a disappointment.", 
    "review_date": "2007-06-03"
  }, 
  "SPgga_p1VUzKb-SRvvF9sA": {
    "user_rating": 5.0, 
    "user_location": "San Juan Capistrano, CA", 
    "user_name": "Alexandria M.", 
    "review_text": "The service was excellent and so was everything that I ordered! Their soup, panini, and pie is so good. I enjoyed every part of it. I definitely recommend this place to everyone and I will be visiting again very soon :)", 
    "review_date": "2012-08-23"
  }, 
  "m1dXgBVwO4c_VO498DcKvA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Madisoon S.", 
    "review_text": "Gerardo is the owner. Awesome guy and funny as hell. He will do whatever it takes to make sure you're happy with your order. I had a dirty chai latte with soy...yummmy.  Other great things to mention: good work place with wifi. great location. Outdoor seating. clean bathroom!", 
    "review_date": "2014-09-28"
  }, 
  "s93PtWbODlx8h5IK86CVSA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Saori E.", 
    "review_text": "Solid coffee, as many yelpers have already said.  The \"small\" is very tiny. I guess most \"real\" cafes have very petite smalls-- I apologize, I'm from suburbia where we really only have Starbucks and Tully's...  I've been for coffee and it looked like a nice, friendly cafe so I went for lunch as well. I had the smoked salmon bagel with cream cheese, capers and red onions. Very yummy-- slightly pricey at over $7.   My boyfriend had their grilled chicken sandwich which he was very pleasantly surprised to find had hummus in it. The perfect addition :) It was $8.50 or so.   These aren't your everyday deli kinda sandwiches-- if you're looking for a slightly classier version of a deli sandwich, go here. Otherwise, head to Freddie's Sandwiches for cheaper sandos.   BUT, for great coffee with complimentary wireless, this place is unbeatable! All of their pastries are absolutely delightful and everyone here is really nice.  Plus, they have books you can browse through-- some true classics and some CA tourism books :)", 
    "review_date": "2009-08-29"
  }, 
  "AwvwZOOhLouAjj_5RuqsrA": {
    "user_rating": 5.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Roses A.", 
    "review_text": "I love this place! The staff is very nice and patient. :) The decoration on the foam of my latte is beautiful, and it is always strong and delicious!  Breakfast bagel sandwich.. Mmmm!", 
    "review_date": "2011-01-24"
  }, 
  "yQx9MNPW-XvPMNpHQBjxEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mariana F.", 
    "review_text": "Pros: This little neighborhood cafe has great snacks and it's usually empty enough for the wifi to seem fast and for it to be quiet :)  Cons: The lighting is not that appropriate for working on the laptop for a long time, but you can easily fix that by sitting close to the windows!", 
    "review_date": "2014-09-08"
  }, 
  "fHkp6WGwESrTVsg9nreWnA": {
    "user_rating": 5.0, 
    "user_location": "Chantilly, VA", 
    "user_name": "Beth D.", 
    "review_text": "In town for a night before a trip to Napa....This was THE BEST Latte i have ever had! Such a rich, roasted flavor w perfect foam art...Sit by the window for a little breeze of a crisp morning air   perfect way to start day  Such a cozy place.  Service was super friendly", 
    "review_date": "2013-03-02"
  }, 
  "O-1WSZmERAutIAtyF7wDEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy S.", 
    "review_text": "Possibly the best latte I have ever had.  Food is really good too.  Fast, friendly service plus free wifi!", 
    "review_date": "2009-05-06"
  }, 
  "Jwm9nGa7PBLm2NoT-jeDtA": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Amanda R.", 
    "review_text": "Visiting San Francisco for work and found this gem via Yelp. It's cozy with character and the staff are very friendly. I worked on my laptop from 11:00 a.m. - 3:30 p.m. and not once did I ever feel like they were trying to get me out of there. Free wifi, plenty of outlets and amazing lounge/chill music. For eats/drinks, I had a cappuccino, double espresso and prosciutto panini - all were amazing!", 
    "review_date": "2012-08-21"
  }, 
  "2qkOI-p3B4g7fKG_lMZMCg": {
    "user_rating": 4.0, 
    "user_location": "Kayenta, AZ", 
    "user_name": "Ellen D.", 
    "review_text": "The restaurant is famous for breakfast and deservedly so. The choices, the quality of the food and the ambience are all very good. The service was good.", 
    "review_date": "2014-12-08"
  }, 
  "ZCzRcRKJ6n8joppQi6zjog": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ivonne M.", 
    "review_text": "I still dream about this place!  I don't even know where to begin. We visited Cafe Capriccio during our trip to SF. The reviews seemed good but do not do this place justice! It was so good that we went back two days later. It was so good that I still try to replicate my breakfast there now that I am back home. The ingredients used by that cafe are definitely the fresh of the fresh, the best of the best. My favorite was the breakfast parfait. The hot chocolate was as equally delicious as the fresh squeezed orange juice and the multi-grain toast with the salted cream butter and real strawberry jam were out of this world.   I'm truly saddened that this place is all the way across the country and that I cannot truly replicate it's deliciousness. Cafe Capriccio is an absolute gem, not just to the neighborhood but to the world of cafes in general. If you are looking for a good cup of coffee (or hot chocolate) and want to accompany it with a delicious yet fresh breakfast, this is your place.", 
    "review_date": "2010-03-02"
  }, 
  "J2j0PBxPAXU5i7M0rrgfGg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaime Patricio M.", 
    "review_text": "When you are in that dicey tourista section of San Francisco the heart wonders \"oh no--just Starbucks!?\" But luckily tucked away a bit and a welcomed relief for the tongue.  French Press coffee with the finest of deep bold grounds; I enjoyed an Ethiopian coffee; there was water for a quick hydration.  Nice and friendly and such cute environs.", 
    "review_date": "2008-10-12"
  }, 
  "nvpWH_DUOJB9fHYeqdTNxQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jon D.", 
    "review_text": "Yes, there is fine coffee in North Beach.  This places rocks.  Their barista is an artist who works hard to make a smooth espresso that is not bitter, burnt, sour, or over priced like most other cafes in North Beach. They use Echo brand coffee.  Soo good.", 
    "review_date": "2010-03-15"
  }, 
  "kzTDJ4Vgzz_Hjix1YPi4Vw": {
    "user_rating": 5.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Hiep N.", 
    "review_text": "Great morning breakfast spot. They have a nice selection of baked goods, quiches, granola, etc.  I got a panini and my friend got the mushroom quiche. Everything was fresh delicious, and affordable. I would recommend this spot if you're looking for a quick bite without breaking the bank.", 
    "review_date": "2013-02-11"
  }, 
  "8QBlOpTcgkldhBtq-4A7YA": {
    "user_rating": 3.0, 
    "user_location": "Royal Oak, MI", 
    "user_name": "Adam P.", 
    "review_text": "Underwhelming. It's pretty average so if you're looking for something special, this isn't the place.", 
    "review_date": "2014-04-19"
  }, 
  "_98SIg0Pev8eG2xZhib__A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle R.", 
    "review_text": "One star because the mocha I ordered was tasty.  Otherwise, it was not a great experience.  I ordered a small mocha for the high price of $3.75.  When I received my beverage, it was SO tiny.  I think it was 8 ounces, maybe smaller.  I'm fine with an 8 ounce mocha, but it should have been about dollar less expensive.  The cup was so small that the cardboard sleeve didn't even fit around the cup!  Also, there was no whipped cream.  I thought that would be standard.    Additionally, the food display cases did not look clean or appetizing, and the guy working the cash register was coughing, sneezing, and wiping his nose on the back of his hand and never washed his hands!  Gross!  I like supporting neighborhood businesses, but this place didn't give me any warm fuzzies about paying a higher price for a good experience.", 
    "review_date": "2014-06-25"
  }, 
  "rHBtyq9TYwxMiqiGKelX_g": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Curt B.", 
    "review_text": "It's been a long time since I have had an amazing latte so leaving a review was a must. Silky smooth foam, delicious espresso. I have been back morning and evening for this drink. Their chocolate croissants are also super super delicious and I compare them to some of the other great ones I've had in Morocco and Costa Rica. I wish I had a little café like this near my house. Thanks for enhancing my short holiday from San Diego.", 
    "review_date": "2012-11-18"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "What a cozy, mellow cafe shop right at the center of a residential neighborhood of North Beach!  Somewhat hipster ambiance with their cushioned wall seats!  I like!  With the pouring rain outside, warm cup of cappuccino, comfortable seats and complimentary Wi-Fi, I was lingering here for some hours!  They provide a stamp card - for the 10th cup of coffee, it will be on the house!  It is definitely a low key cafe shop and that makes it a great place to be at just because it truly provides a time for oneself to be concentrating on stuff to do!", 
    "review_date": "2013-01-02"
  }, 
  "D_MR0falcGODjMOZoS_W9w": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jim K.", 
    "review_text": "GreatGreat morning spot!  Quality coffee made with care.  They have a nice selection of baked goods, quiches, granola, etc.  Sidewalk seating for those spring and fall mornings.   Nice wines in the afternoon and eve...this is a perfect little spot to meet a couple of friends and hang out.  Enjoy.", 
    "review_date": "2010-09-23"
  }, 
  "VRNF7v9PRqnfU3XpNmRxpQ": {
    "user_rating": 4.0, 
    "user_location": "Stavanger, Norway", 
    "user_name": "charlotte s.", 
    "review_text": "very cozy coffee spot tasty soy latte small seating area inside and some spots outside too friendly staff", 
    "review_date": "2009-12-07"
  }, 
  "XBXyyTClrFHHHTI28HsqpA": {
    "user_rating": 4.0, 
    "user_location": "Australia", 
    "user_name": "Josh L.", 
    "review_text": "Nice casual cafe. Beautiful coffee and breakfast treats.  Coffee is proper barista style coffee ( not drip filtered)! Free wifi and power sockets for charging.  Relaxed and friendly atmosphere.", 
    "review_date": "2012-05-01"
  }, 
  "sSIsqHgWruKWRb4SyIRXLQ": {
    "user_rating": 5.0, 
    "user_location": "Garden Grove, CA", 
    "user_name": "Aleks P.", 
    "review_text": "While in SF, we walked by this place, and decided to get lunch here. We only got two things, calamari and a mushroom pizza.  Both were so fresh and delicious. We actually ordered a second pizza because it was so good.", 
    "review_date": "2013-02-04"
  }, 
  "6-AqJH4LlZBidRJbgUFeWw": {
    "user_rating": 5.0, 
    "user_location": "North Highlands, CA", 
    "user_name": "Tom F.", 
    "review_text": "Has to have the best lattes / chai lattes in the city.  You wont be able to go to starhucks after getting coffee here.  Good froth &amp; not boiling hot so you can drink it right away. Outdoor seating is nice as well.", 
    "review_date": "2011-07-20"
  }, 
  "dO3ikdceUFb_6wa1YR53OQ": {
    "user_rating": 5.0, 
    "user_location": "Chatsworth, CA", 
    "user_name": "Rocio G.", 
    "review_text": "great ambiance, food is delicious, not heavy or greasy at all, super healthy options and flavour-packed.... quieche egg wrap and chicken panini... winning choices...oh and great cappuccino", 
    "review_date": "2014-07-05"
  }, 
  "Ri_oAGW6OcO5_WDbJ4A5rA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Good food but cashier lady was impatient when we were a bit not sure what kind of coffee we wanted. Not a smart way to treat tourists.", 
    "review_date": "2014-03-29"
  }, 
  "8526ZJhSR9CEX-vfjSFD-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie C.", 
    "review_text": "i love this place.  one, its clean.  two, the seating is very comfortable with pillows.  three, there are multiple outlets. four, free wi-fi. five, love the air work and the ambiance.   chai latte.... delicious.  smoked salmon bagel... the bagel is to small for everything in it! roasted chicken panini... love it with the hummus.  definitely going back there soon!", 
    "review_date": "2009-04-01"
  }, 
  "UiKgsMJV_s2sOT9x21DZog": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "B W.", 
    "review_text": "I can't say enough nice things about this place. Great coffee, nice staff, good service, not too crowded, free Wi-Fi, loyalty program with free drink after 10 purchases, sidewalk tables. It's everything a neighborhood java joint should be. Way better than 901 Columbus Caffe a few blocks away.", 
    "review_date": "2012-05-16"
  }, 
  "6OwEseljNOF0WCU3qeteBg": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Rachel K.", 
    "review_text": "First time here and definitely not the last!! The workers are very friendly. The food is really fresh and yummy. I ordered the hummus plate and it was SO delicious! Plus, free WiFi!! 10/10 recommend :)", 
    "review_date": "2014-12-27"
  }, 
  "4d5kZit_8oh10s80jfz4QQ": {
    "user_rating": 5.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "Paul F.", 
    "review_text": "I looked in there and thought I would skip it, the coffee couldn't be good.   I mean, nice enough spot, but I wanted a good coffee. Later I was invited me for coffee there  .....  Whatever it was, the coffee there some of the best in San Francisco.  I had the capooch...", 
    "review_date": "2010-10-07"
  }, 
  "gk9jsfaU3RoomWmfoW1tlw": {
    "user_rating": 5.0, 
    "user_location": "Harrisonburg, VA", 
    "user_name": "Maggie S.", 
    "review_text": "Ah! What a great latte. They were invariably sold out of the oatmeal every time I came here, but they had nice, fresh pastries from local bakeries to make me feel better about it. And of course, all can be forgiven because of the coffee. Did I say 'what a great latte'? I shall say it again.", 
    "review_date": "2012-10-12"
  }, 
  "e53cYSPf4v51YmPH2_ludw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Julie W.", 
    "review_text": "Cute cafe! The bagel with lox, tomato, cream cheese, and onion was really good! I like how they made the bagel sandwich neat and manageable instead of stuffing it sky-high or lopsided so that it becomes a huge mess when you try to eat it (that's kind of a pet peeve of mine). The mocha with whipped cream on top was great. Service was great. Sat outside, very nice.", 
    "review_date": "2014-01-04"
  }, 
  "B9YstM-Lu1xKfYYgDjUMpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura L.", 
    "review_text": "You probably shouldn't come here. It's a real gem and I'd like to keep it all to myself. OK? OK, thanks.", 
    "review_date": "2014-03-02"
  }, 
  "ktWY99kJmauw_p3H-aUnvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie L.", 
    "review_text": "A nice cafe serving delicious panini and mimosa made with fresh squeezed orange juice. Had a beautiful afternoon at the patio area, a peaceful spot in North Beach.", 
    "review_date": "2014-04-06"
  }, 
  "04bsEbVV-nRiWT__XrlHOw": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "PJ D.", 
    "review_text": "Great espresso!!!", 
    "review_date": "2010-03-11"
  }, 
  "ddyOFrSxlqcIo-p--x51mQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin G.", 
    "review_text": "Cafe Capriccio is the best! I am excited each morning to stroll down the block and start my day with the perfect triple mocha with whip. Their customer service is the best and the coffee is strong and persistent. Of all the spots in North Beach, Cafe Capriccio is my favorite find.", 
    "review_date": "2011-08-22"
  }, 
  "kN5TZU_4cngfQY8B6PYx1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley K.", 
    "review_text": "A+ - friendly staff A+ - enough outlets for many laptops A+ - free WiFi A+ - takes debit/credit cards A+ - wine while you relax in a comfortable atmosphere  Yay, Capriccio!", 
    "review_date": "2011-01-19"
  }, 
  "Dw5JzepBLJ-L_DAUseocHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris B.", 
    "review_text": "Between the thoughtful service (they take advance calls for orders -- like a pizza place), comfortable seating (padded benches and back pillows), and quality of food/drink I highly recommend this place.  Was originally owned by a wonderful couple but nothing has changed since then :)", 
    "review_date": "2010-11-03"
  }, 
  "1UKab-nmvbBoyp6y6f052A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miran C.", 
    "review_text": "This is the neighborhood go-to spot for breakfast bagel sandwiches on a Saturday morning.  I love the neighborhood vibe here.  Plus, it is a really relaxed and cozy spot to dip in on a crisp SF morning.  Depending on your mood, you can appreciate its coziness over Francisco Cafe (preferable if you feel like having more light and space) and quieter than Columbus Cafe (preferable if you want a whole plethora of drink options and watching America's Cup on TV).        The ham and cheese croissant sandwich is very filling.  Also, the lox sandwich was fresh, which is a nice surprise, considering this is not a NY bagel store.  I also like their soup and quiche.  However, the blueberry pie was a bit tart for my taste, but that's OK...  should cut back on sweets, anyway.  Chai tea and coffee come in big mugs, which I appreciate.        I love it here!  Everyone is really friendly, too.", 
    "review_date": "2013-01-21"
  }, 
  "miY7B32VgfHsdRoVP9Nl-A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sally C.", 
    "review_text": "Saw this super cute cafe and happened to find it on <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> awhile back. Finally went in with it a couple months later and was partially greeted with attitude that they did not accept <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> vouchers anymore and that they stopped the deal. Told them that they should still honor my deal and they begrudgingly did it. Ordered my food and no other words were exchanged.  Panini was meh. No flavor. Cafe vibe was okay that day.   It was just off-putting in general. Perhaps a bad day to come in. Next time- I'll bring my laptop and order a latte instead.", 
    "review_date": "2013-02-09"
  }, 
  "gjfcfzrYZ0O1xINHtnQKiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "A hidden gem on the corner for coffee and tea aficionados with the bonus of great snacks and dishes.  Some highlights include their African red bush tea and chocolate or almond croissants as well as the fig, ricotta and proscuitto bruschetta.  It's a great place to chat outside or indoors as well as get some work done.  Several parents chill here before picking up kids from the pre-school across the street.    Service is fast, friendly and helpful.  The decor is simple and clean with ample seating for hanging out.  Parking is on the street.", 
    "review_date": "2011-12-03"
  }, 
  "9jXWui2JfiBOiFD3oi7XyQ": {
    "user_rating": 3.0, 
    "user_location": "Flagstaff, AZ", 
    "user_name": "Beth S.", 
    "review_text": "Good coffee. Well priced egg wrap &amp; chocolate croissant was good", 
    "review_date": "2011-12-06"
  }, 
  "sXveccnC4lMGJwx0Jhxhqw": {
    "user_rating": 4.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Caitlin W.", 
    "review_text": "Great place when the sun is shining - you can people watch as folks walk in and out of the main area of north beach while enjoying the light and some wonderful coffee (or, if you're me, a glass of wine).   I had the ricotta, fig and prosciutto bruschetta, which was on a really thick, well-toasted piece of bread. It was delicious, although could have used a touch more of the fig jam to offset the heavyness of the pork. But overall it was a lovely meal, especially to just munch and enjoy outdoors. All in all, fantastic atmosphere and tasty food/wine - a must-try.", 
    "review_date": "2011-08-09"
  }, 
  "cCeCQxErE9ToaQQBEVFuFA": {
    "user_rating": 4.0, 
    "user_location": "Bellmawr, NJ", 
    "user_name": "Abigail W.", 
    "review_text": "really hungry, it's two blocks from work, and totally happy with my pastries this morning. the croissant was buttery, flaky, and amazing while the blueberry cheese danish was my absolute favorite pastry that i have had in awhile. i loved how i was able to taste each and every fresh blueberry in the danish, it wasn't too sweet, and flaky. Mmmm Need to come back to try some more goodies", 
    "review_date": "2009-05-03"
  }, 
  "qj6sqH7tvELjO-dmKoiTpg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie G.", 
    "review_text": "Great little place to grab some caffeine in the morning. As far as food goes I've only tried the breakfast egg sandwich and it was just ok. The staff was friendly and I'll certainly be going back.", 
    "review_date": "2011-05-15"
  }, 
  "McWGE_7t-ZQpxawR8nGjxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becky D.", 
    "review_text": "This is my favorite place to get a cup of mocha! Their drinks in general have great taste and consistency. When I had come back from Quebec it was so hard to get used to plain starbucks and peets. Don't get me wrong, I still drink it. But Cafe Crapiccio is what I was looking for. ;P Their sandwiches are really good. Didn't enjoy their quiches as much.", 
    "review_date": "2010-04-21"
  }, 
  "nOe5dewI3cYT9oWwPZ2XeA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elle R.", 
    "review_text": "Girl behind the counter needs an attitude adjustment. Slow service, ok food, ok coffee, wifi inconsistent. But don't complain about the wifi to the girl working there because she'll tell you it's working, although it's not, but she'll give you a dose of her attitude and make it a whole ordeal.", 
    "review_date": "2013-12-24"
  }, 
  "nQPK4pBDlxXNBaYIt87VQg": {
    "user_rating": 4.0, 
    "user_location": "Queens, NY", 
    "user_name": "Nelvin J.", 
    "review_text": "Salmon bagel was DELICIOUS. Coffee prepared with care. I like that.", 
    "review_date": "2012-08-18"
  }, 
  "4ssDCBvb9LC2cMpWxjhpRQ": {
    "user_rating": 4.0, 
    "user_location": "Orland Park, IL", 
    "user_name": "Paul S.", 
    "review_text": "Sitting in a nice little bistro table in the sun enjoying my coffee and egg wrap was nice.  Everything was fresh and tasty.", 
    "review_date": "2014-04-11"
  }, 
  "qGckwq34UeOe3joG2nP1OQ": {
    "user_rating": 3.0, 
    "user_location": "Portsmouth, RI", 
    "user_name": "Rob L.", 
    "review_text": "Nice spot to sit outside and do some work or read but I was expecting better food. I had a wrap and salad and neither were too great but overall it's a solid location especially on a sunny day.", 
    "review_date": "2014-05-13"
  }, 
  "WatN4YVDRNHbS7SwZwUGAg": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Paulina D.", 
    "review_text": "They have a wine bar now! Thursday through Saturday nights from 6-9PM! Buy two flights, get a free cheese plate. I freakin' love this place.", 
    "review_date": "2013-06-07"
  }, 
  "-lzROgx9nuIOO1SkgVvelA": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Noa E.", 
    "review_text": "amazing cappuccino!", 
    "review_date": "2013-09-04"
  }, 
  "viVgjtei9vWe4UQBW3SuSQ": {
    "user_rating": 2.0, 
    "user_location": "Cartersville, GA", 
    "user_name": "Tiffany T.", 
    "review_text": "While visiting San Francisco (and starving after a tour of Alcatraz), I used Yelp to find a cafe or bistro nearby to grab lunch. The reviews for Cafe Capriccio were good and although it seemed that most people were fans of the drinks, a lot of mention was made about the food there. Since it was close by, my family and I decided to stop there.   The cafe looked quite cute on the outside, but when I stepped inside, it felt cramped and dark and muggy. (Granted, it was raining, so perhaps \"muggy\" isn't the norm there). Other Yelp reviewers mentioned baked goods in their reviews, but the baked good display case looked rather empty.  Seating was extremely limited - I suppose people were working from there since everyone seemed to have a computer.  I ordered a caprese sandwich, which did seem to be fresh and was loaded with mozzarella - but even with fresh basil and pesto on the sandwich, I found it to be really bland and lacking in flavor. The sandwich was served with a side salad of mixed greens rather than chips, which was a nice touch, although the vinaigrette dressing was nothing to write home about. My meal was okay, I suppose, but it was a disappointment after seeing such great reviews and knowing that there were plenty of other outstanding places to eat nearby.   Everyone else in my family seemed to agree with me - their food was okay, but bland and nothing special.", 
    "review_date": "2011-02-18"
  }, 
  "NJkKim1vaowyEKtazPdByw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Counter C.", 
    "review_text": "I have been coming here for over a year, it is great to watch these guys get better and better.  The coffee is organic, something they don't advertise.  Actually, a lot of the food they use is organic, sustainable, or of high quality.  Like the yummy Diestel turkey panino.  This hidden gem is the best coffee in North Beach.  They serve Ecco Caffe, known in coffee circles as one of the best roasters in the country.", 
    "review_date": "2009-10-23"
  }, 
  "kUFgqfZ1JkNzsdN4DuaYJw": {
    "user_rating": 5.0, 
    "user_location": "Providence, RI", 
    "user_name": "Cathy H.", 
    "review_text": "Here, Cafe Capriccio in 5 glorious phrases:  1. Giant, homey mugs 2. PILLOWS! 3. Password-free, fast Wifi 4. Baristas chatting (maybe about you) in Italian 5. Small but punchy salads  I wish they were open later, so I could enjoy their trendy European tunes and carry my enthusiastic typing into the evening. I seem to be more productive here than in my apartment, the library, yeah! But then again, I'm no serial coffee drinker and the stuff here is strong. Whatevs. Confounding variables of Cafe Capriccio atmosphere and caffeine. They do well fusing the two for me.", 
    "review_date": "2012-08-22"
  }, 
  "0t-O5--DOfS55A620fO_GA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea H.", 
    "review_text": "**Use the Yelp check-in deal! ($15 for $10)**  I've never roasted an establishment based on service-- I'm more into the food, value, and atmosphere. Seriously. Ugh! There's a first for everything I guess!  Before I even placed my order I was barked at by the barista. Two young ladies lined up to place an order behind me and all three of us were scolded because we weren't standing close enough to the counter. Thankfully the young man that took my order was friendly and pleasant. I grabbed my number and made my way to a table outside to enjoy he amazing San Fran sunny weather.   A few minutes passed and the crabby barista came out with my cappuccino. Again, she scolded me! She made some snide comment about how my coffee was probably cold because she was calling my number for awhile now. Um, you didn't think to go outside?!? It's not like this place is big or anything! The two young ladies that ordered behind me were now sitting at the table next to me, so they witnessed both of my scoldings. All three of us chuckled at how bizarre the barista's crappy attitude was and joked that she must be having a bad day. (On a side note, several yelp reviews mention this barista and her crappy attitude, so I doubt it was an off day) They decided that they didn't want to get yelled at by the barista so one of them went inside to pick up their drinks.   Anyway, the coffee is excellent and the food is pretty good! The outdoor seating is great along the streets of this quiet part of North Beach.   5 stars for food and coffee, 2 stars for service (the order-taker guy was friendly). Also, props for free wifi so I could sit outside and type up this review on my iPad!)", 
    "review_date": "2014-07-27"
  }, 
  "li85I9BtJme3KAmN02CzEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jai D.", 
    "review_text": "Ok, i am lazy and unemployed which are two things that compound each other to last a bit longer then they really need too.  however, i have come up with a few \"strategies\" which help these problems and one of them involves Cafe Capriccio.  As i live in the Mission and have wireless (borrowed from my neighbor) i decided to find a nice local spot on the other side of the city which forces me to get off my butt and actually refrain from cuddling up with my laptop in bed all day long watching Hulu.  so my criteria is a place which has the following: quality breakfast tea cheap breakfast free wireless (Starbucks wireless is not free) Bike rack seating outside  LOT of outlets.  Well, needless to say Cafe Capriccio has these all in spades.  The breakfast burrito is fresh and made to order while their croissant are actual flaky butter croissants and not the ones you buy from Costco.  so pop on down and say hello as i am the pasty white redheaded guy in the back trying looking for a job while sneaking handfuls of blueberries from under the table.", 
    "review_date": "2009-06-16"
  }, 
  "DJFMK-AFPKIFue7hgl676A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "I used to come here when it was still under the previous ownership. The lunch portion was too small so I didn't come back again until recently I decided to give it a try again even though the new owner has been operating for more than one year.  I like the present one so much that I came back three times during one week. The barista knows well what he's doing. The chicken caesar salad wrap came with green salad. Very delicious and the portion of the wrap was so big that I had to take half of the wrap home. My husband had tuna salad wrap and it was very good too. A wonderful neighborhood gem.", 
    "review_date": "2011-10-31"
  }, 
  "X_gJvizrZLyfBy0BLDkIQQ": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Brittani M.", 
    "review_text": "We were in SF from Chicago, and after waiting 20 mins in the Mama's on Washington line, we decided to ditch it for this place. We were not disappointed!! The caprese panini was amazing! I loved it so much that I went back the next day to get another. Will definitely recommend!", 
    "review_date": "2014-11-12"
  }, 
  "xTCHjpvKXBHmsEzlB5h5lA": {
    "user_rating": 3.0, 
    "user_location": "Eliot, Portland, OR", 
    "user_name": "Larissa S.", 
    "review_text": "TL;DR: I had one tiny slice of ham on my ham and cheese bagel, and they were out of two things I wanted.  This place was pretty disappointing considering its rating. Traveling here from Portland I was looking for a good breakfast sandwich and coffee to have fuel for walking around.  Ordered a chai, they're out. Okay no big. I'll take a latte. Ordered a ham and cheese croissant, no croissants. Hm okay. I'll take a ham and cheese bagel.  There was A slice of processed ham on my bagel with cheese that was barely toasted. Like one. The funny thing is I was charged the full 5.95 for a ham and cheese croissant. Also on their menu if you were to add ham or bacon to any other sandwich it's $1.50! I'll be walking straight to the pier for a cup of clam chowder   I swear I'm not hard to please, this girl just wants a little protein!   To end this on a positive note and what earned them a third star: their vanilla latte was delicious and really well made.", 
    "review_date": "2014-10-14"
  }, 
  "BDzCb34GmdUWK-G1FwMCmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika M.", 
    "review_text": "I am only reviewing the two things I've tried: Chai and butter croissants and ice tea.  And both are fan-freakin'-tastic!  Chai is some of the best every, perfectly frothy and smooth, sugary, but not too sweet, and the perfect temperature!  And the croissants are also fabulous - a lovely pick me up on a Saturday am, but beware - they run out quickly!  Ice Tea is great - although I wish they gave it to me in a bigger glass. Great flavor though.  A lovely neighborhood joint for a cup o' anything on a sunny afternoon.  Oh and they also have such a lovely interior!", 
    "review_date": "2009-04-17"
  }, 
  "k_PSkYpsex3vP-f08xfGxg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "If you are looking for some great coffee in the North Beach / Washington Square Park area, forget about Cafe Trieste - make your way to Cafe Capriccio !!  Think in terms of Blue Bottle / Ritual here...  The new owners Jesse &amp; Alex, while very young - have put a lot of effort into making sure the espresso drinks are of great quality. Just check out my pics here on Yelp !  Cappuccinos &amp; lattes are made \"Blue Bottle\" style - with that great micro-foamed steamed milk, with the beans courtesy of Ecco Coffee (Sonoma). The barista in the mornings seems to put a lot of effort into each drink - you may be waiting for a minute longer - but the results - AWESOME.  Food is great too , with huge salads &amp; tasty sandwiches at a great price with huge portions. Decent beer &amp; wine selection.", 
    "review_date": "2008-12-09"
  }, 
  "WKPTh4UmEqXR8TRAp1g2CA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johanna S.", 
    "review_text": "Excellent lattes &amp; a good spot for an alternate \"office\"- free wifi, caffeine, and outlets. I was the only one not using a Mac, so I felt a little dirty, but not so dirty that I won't be back.", 
    "review_date": "2010-09-26"
  }, 
  "LSQsSMYUdxPs8VXFeYThyQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Jamie C.", 
    "review_text": "Down the block from where I work.  Amazing breakfast bagel sandwiches: I've had the chance to taste: egg+cheese, egg+cheese+ham, and egg+cheese+bacon. Not sure which one is my favorite, but you can choose what kind of bagel you want, (I prefer wheat) and it comes with tomatoes, tastes so good. Coffee is just alright, but it hits the spot when you need your fix in the morning.  All are good choices, can't really go wrong. Very friendly.", 
    "review_date": "2010-12-13"
  }, 
  "aZsqL0a9KY0C0bYQo16Hfw": {
    "user_rating": 5.0, 
    "user_location": "Rome, Italy", 
    "user_name": "Beatriz B.", 
    "review_text": "Best part about San Francisco! great coffee with the cute little foam designs and the croissant sandwich was pretty good as well (can't remember the actual name). This place is absolutely fantastic!", 
    "review_date": "2013-05-07"
  }, 
  "Ov-HxS7vDObYZZBdezOg8Q": {
    "user_rating": 3.0, 
    "user_location": "Virginia Beach, VA", 
    "user_name": "Trey C.", 
    "review_text": "The Cafe Capriccio came recommended to us by a San Francisco local. We had a fairly pleasant experience.   The Cafe itself has an excellent atmosphere. As advertised by it's sign, free wifi is offered and the Cafe is packed with college students and other working people with their laptops. It had some tables, and some couches, providing a nice experience.  The food was very good, although the menu was not huge. I had the prosciutto panini, which I would definitely recommend. They do serve wine, as well as beer, and coffee. We did not have a coffee ourselves but it looked and smelled absolutely excellent.  The main problem I had was the staff. They were somewhat friendly, but did not seem to have knowledge of the menu. I asked if they were serving breakfast still, and they seemed unsure. I ordered a breakfast item, they checked to see if they had it (they didn't) and so I had to order something else.  However, it is a fun cafe with a great environment (especially if you have work to get done) and good food.", 
    "review_date": "2013-03-04"
  }, 
  "bE5Swrp3qwsgA_SyVBUfbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Novalina N.", 
    "review_text": "This cafe is so close to my place that I'm kinda ashamed I didn't hang out here much more often. Although the Starbucks nearby isn't so bad *ambiance wise* really.  The space is kinda tiny and there's really only 1 table where I can look outside. I've tried many of their food/drink: americano, cappuccino, almond croissant, plain croissant, and chai latte. All are really good, although the chai latte is a tad too sweet. Too bad they can't adjust the sweetness other than by reducing the chai powder amount. It's still really good though!  I love the outdoor seating on Chestnut st. Very sunny and don't get too much foot traffic. This city needs more cafe with good outdoor seatings.", 
    "review_date": "2010-05-11"
  }, 
  "7jqs8Fe_gWhJtxUsra-XNA": {
    "user_rating": 5.0, 
    "user_location": "Hanover, MD", 
    "user_name": "Chris N.", 
    "review_text": "Best latte I ever had. Saw and heard all the hype about blue bottle but went here first.  I have to say after having 3 drinks at blue b then coming back the taste, texture and aroma is better for me here.  I would come here everyday if I lived here.", 
    "review_date": "2013-03-27"
  }, 
  "BdiFjWA8JDfDlpjJJNyZeg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay V.", 
    "review_text": "A wonderful neighborhood cafe located off the beaten path in North Beach.    I visit a lot of cafes.  A LOT.  This is a true gem.  The best part, they are so awesome and they don't even know it.  No Baristas With Attitude, just great coffee (Ecco Caffe) served on a pristine Nuova Simonelli Aurelia.  Drip coffee was french pressed and stored in airpots.    I am also glad I got a sandwich.  The food was definitely a good value.  For under 8 bucks, I got a killer Caprese panino.  Bread was from Panorama, the mozzarella was genuine di buffala, the basil was fresh, and the mixed greens were delicious and organic.    The owners are super sweet, though a little green.  Any mistakes are due to inexperience, and not at all intended.  That, of course, will only disappear with time.", 
    "review_date": "2008-11-05"
  }, 
  "ybLqwulHnia8WzRPsdmchg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg L.", 
    "review_text": "I honestly don't know why this place has so many good reviews. I only go here when I do laundry and am never happy. Coffee is not great and service stinks. I never feel like they really care if I am there. Let alone acknowledge me or say hi when I walk in. If they are even close to closing (kinda early by the way) up for the day they kick you out or try to rush you.  I'd rather go to any number of the many coffee shops in North Beach.", 
    "review_date": "2011-10-22"
  }, 
  "kPobzzhCQTddMk98ElBwzg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana C.", 
    "review_text": "too expensive for mediocre food.  moreover the waiter was like - tip should be based on non-coupon total..  how rude.", 
    "review_date": "2014-06-20"
  }, 
  "6Fo8xB96WFj8Bk0AK7fRpQ": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Katie R.", 
    "review_text": "This is my new favorite coffee shop in North Beach. It's nestled away on side streets, which means that it is normally quiet and has more of a neighborhood-feel than its competitors on the main street corners. The music is just loud enough to be pleasant, with good variety, but not so loud that it intrudes on your conversation or concentration. There is a lot of small-table seating and a plethora of wall outlets, so it is a great place to work. Also, the drinks are excellent. I'm not a coffee drinker, but it's the best soy chai in the neighborhood (outside of an Indian restaurant). No watering down the drinks here!  The only thing keeping this cafe from reaching 5-star status is the food. It's fine, it's decent, but its nothing great. If you need a snack while working or studying, it will do, but I wouldn't make the food the primary reason for coming here.", 
    "review_date": "2012-07-01"
  }, 
  "rWS5VS6yTzleYVZGtv_URg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bushra S.", 
    "review_text": "What can you say about a breakfast place that runs out of Bagel and orange juice before 11 am on a Sunday?? Glad that they didn't run out of the Sunday  morning peace. Glad that they had tables outside and staff that was polite and friendly. But seriously a little bit of planning on the owners part would have made our experience so much better. I'll try to be back, but frankly with so many tempting options around, I doubt it will happen.", 
    "review_date": "2014-05-12"
  }, 
  "DW-ZUWNrsUkx3qYIglwK_w": {
    "user_rating": 5.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Jonash O.", 
    "review_text": "Amazing food. So fresh at an affordable price. I loved my breakfast parfait! In a convenient location and one of very few good brunch places in the area. All the food was made on the spot and the ingredients were super fresh.", 
    "review_date": "2015-01-09"
  }, 
  "bsaJhKesaQuPVxP9B35m3A": {
    "user_rating": 4.0, 
    "user_location": "Livermore, CA", 
    "user_name": "jamie d.", 
    "review_text": "Very cute! The beef and cheese sandwich was very delicious. The chai is good but too sweet and not spicy enough. Overall I think lunch cost around 11 bucks, so a bit pricey, but tasty and friendly service.", 
    "review_date": "2010-06-26"
  }, 
  "Fh9NV7echtUcN84hawkBbA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "I was in the area and found this cafe via Yelp. Small, cozy little cafe that serves coffee, lattes, sandwiches, bagels, and such.   The latte was creamy and strong, just the way I like it. I also had the salmon bagel and that was good as well, but nothing to swoon over. The service was friendly and quick. Parking in front of the cafe was closed for construction, but finding parking around the block was easy and not to far away.", 
    "review_date": "2013-05-29"
  }, 
  "bp3gTWRKftxkckub_PfA6A": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jennifer T.", 
    "review_text": "Best coffee in the neighborhood, and let me tell you, in this neighborhood good coffee is hard to find. Free wi-fi. Nice atmosphere and friendly, non-pretentious staff.", 
    "review_date": "2011-05-29"
  }, 
  "AqwTAjoyG5HfhQi2-ab4cw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice W.", 
    "review_text": "What an adorable little cafe!! We came here to read and get some brunch on Sunday and this place totally won me over. We shared the chicken and caprese panini and I also got a latte.   The latte was rich and super frothy. The coffee flavor was pretty intense and they put a heart design on the foam :). Our sandwiches were also delicious!! The caprese won by a nose, we both thought. The bread were nice and crunchy without being oily and the amount of pesto was just right. The mozzarella was fresh and the tomatoes juicy. The chicken sandwich had crunchy pieces of red onion, which gave it a zing, and the chicken was moist. I would probably ask for no-hummus next time, though.   Another great thing about the sandwiches were the side salad that came with it. It was very fresh and tangy. I think it's probably one of the best salads that I've had. Simple, nothing complicated. Very San Francisco.", 
    "review_date": "2012-07-16"
  }, 
  "HRpB7f9yqlNdFrfOcFoOAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miss B.", 
    "review_text": "the neighborhood cafe! Quiet , small, Quaint, great food, great service, best coffee. They  do foam designs on lattes!! skill, mmmm . Definitely a secret cafe I'm not sure why I'm telling you but I love this place so much I should share some of the secret gems in the city", 
    "review_date": "2011-01-09"
  }, 
  "AjHFgLursLNKyzsqG_Y4VA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linus W.", 
    "review_text": "Excellent chai. Artichoke quiche was decent, although heavy on the olives and mushrooms in the inside. Artichoke slices are only on the top!", 
    "review_date": "2013-03-23"
  }, 
  "RGjLWrj_M-E3d5N9y8QA2A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "isis n.", 
    "review_text": "My husband and I come here every week. We love the relaxed and quiet atmosphere and the wifi is fantastic! There are also power outlets under the table. My husband gets an Americano which he says is not very impressive but I get the cappuccino or Mocha and LOVE it because they make the milk right! Not that foamy mess I usually get in other cafes in SF. Having said that, we are major coffee snobs.   The food is very simple but lovely and the service is great, so if you are looking for omellettes and elaborate breakfasts, this place won't satisfy you.  Overally, quiet, friendly, warm, great coffee, simple delicious food, awesome place to get some work done.", 
    "review_date": "2009-01-18"
  }, 
  "-7gpOFaeyrw5JYBk4iRDvQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin S.", 
    "review_text": "Cafe Capriccio makes the BEST chai latte I've ever had, and they do it consistently. It keeps me coming back at least once a week. Which is why it pains me to give them fewer than 5 stars.  Their normal operating hours are until 6pm every day except Tuesday, when they close slightly earlier. For the past month, I've come in the afternoon on at least 5 occasions to find them closed early. As far as I can tell there's no pattern to this, and their hours on the door still say they close at 6. So it's very frustrating and a waste of my time when I arrive at 4:30pm, as I did today, and find it closed early.  I'd have no problem if this was an emergency once-in-a-while thing, but it's clearly not, and they haven't updated their business hours to reflect that. So, Yelpers, if you're considering coming by past lunchtime, you'll be taking a chance.", 
    "review_date": "2014-04-21"
  }, 
  "kRIZEt2-Q3h1qsWj5J54EQ": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "Sherry C.", 
    "review_text": "Easily a 4 star place but the guy behind the counter was such a dud- I had to drop a star just for that. He just stood there. No greeting, no \"Can I help you?\"...just awkward silence. Latte was creamy and smooth, served at a great temperature. Be aware that their small is about half of a tall at Starbucks. That made me happy, perfect amount for me. If you're in the neighborhood, you should def stop by and check this place. Hopefully awkward guy will have a shot of expresso and liven up!", 
    "review_date": "2012-12-13"
  }, 
  "rWro8f-TGFgHW9fFEyDdeg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard B.", 
    "review_text": "This is one of my favorite coffee places in the city.  I spend most of my time in north beach/russion hill/filmore area.  So, my comparisons are mostly limited to those areas.  For me, Cafe Capriccio is about the atmosphere.  The neighborhood has the right mix of and activity and relaxation and the cafe itself has a great vibe.  I love to kickback outside and just soak in the neighborhood and the sun  (which is surprisingly consistent for SF).", 
    "review_date": "2011-07-12"
  }, 
  "y24s5qgDbBCGSF7yqApFtw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna G.", 
    "review_text": "I wouldn't say there is anything wrong with this place, but there is definitely  better food and ambience out there, especially since North Beach is such a cute area. Cafe capriccio is on a random street corner with not much going on. If you walk up to Washington Square Park area, there are a lot cuter restaurants. The outdoor seating at Cafe Capriccio nice, but then again, there are a lot of places in North Beach with outdoor seating. It's relatively reasonably priced, but I would rather spend a few extra dollars and get better food in a more attractive location.   Foodwise, I had the caprese sandwich which wasn't bad, but I've had better. All in all, I wouldn't recommend this to a friend, but if there no other options, it's not terrible.", 
    "review_date": "2014-02-25"
  }, 
  "YinFrBmGU9G6untsx1dMQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brian f.", 
    "review_text": "Hands down the best place to get espresso north of cafe trieste. The new owners are simply wonderful.", 
    "review_date": "2009-03-31"
  }, 
  "Us9exfUqT1sMUw1uTXFABg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "antoinette v.", 
    "review_text": "We moved to the neighborhoold (same block) 2 months ago.  We are ecstatic to have Caffe Cappriccio on the corner.   This is the closest one gets to espresso in Italy.  Si mangia bene qua, il caffe e' ottimo.", 
    "review_date": "2010-12-12"
  }, 
  "xH-aBKtlhY9yaJQpsSJg0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate B.", 
    "review_text": "I cannot say enough good things about Cafe Capriccio.  I work within a block of this cafe and I eat there at least 4 times a week.  Everything is homemade and you can taste it.  They use only the freshest ingredients.  If you in for a quick lunch, I wouldn't suggest this place.  The service isn't slow it just takes time to make everything for you right there.  They have great breakfast sandwiches and, I've never had one, but I've been told by a very good friend that the croissants there are better than anywhere but France.  I don't know what that means, but if you like croissants, go here.  They've got a great wine selection, too.  -n", 
    "review_date": "2007-12-29"
  }, 
  "YEB1pj90TVwomI97OBqPKQ": {
    "user_rating": 2.0, 
    "user_location": "Coronado, CA", 
    "user_name": "t d.", 
    "review_text": "I do not like to be the dissenting voice here.  I yelped this place and had to try it due to the many good reviews.  However, we were disappointed with the food.  We came for breakfast and the food was very average.  Coffee was good.  We had four breakfasts and nothing was above average about it.  There are many cafes in the neighborhood and this does not stand out.  But it is very CUTE!", 
    "review_date": "2010-05-29"
  }, 
  "fxm0zUok6cTE7GCS4f81_A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rahul H.", 
    "review_text": "Solid mocha and hummus. The chicken felt a little dry though. We went on a saturday for lunch and was not particularly crowded which I liked. The outdoor seating was perfect with Coit tower peeking from behind a neighborhood building.   I will come here for the drinks but hit up other spots in the neighborhood for lunch.", 
    "review_date": "2014-06-18"
  }, 
  "PUgZrMBCU6-gqlJuBgYcjg": {
    "user_rating": 5.0, 
    "user_location": "Fountain Valley, CA", 
    "user_name": "Asuka I.", 
    "review_text": "Omg, very delicious coffee!! Love the service, love their coffee \"design\" with the foam. I ordered cappuccino and mocha. It was fascinating (my mom and I can be picky with coffee)", 
    "review_date": "2012-08-19"
  }, 
  "nfxndeptiTZLRpA670AS7g": {
    "user_rating": 4.0, 
    "user_location": "Hagerstown, MD", 
    "user_name": "Jamie T.", 
    "review_text": "Cafe Capriccio was less than half a block from our hotel, so we had to try it. It was a nice neighborhood cafe. The quiche was my choice and was very good, although a little pricey. The coffee and chai were top notch! I would recommend this place.", 
    "review_date": "2014-07-03"
  }, 
  "enIWJGnvGkr4e8r26HmN7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lucie F.", 
    "review_text": "I think this is the best place to get a cappuccino or latte in North Beach. Very consistent, very delicious and perfect foam every time. Not that airy, bubbly foam. It's smooth and creamy the way it should be. Only one thing wrong with the place is the owner - the blonde woman (I think it is a husband/wife team) is nice enough, but she's not very warm. I hardly ever see her smile and sometimes in the morning, you want to be greeted with a smile and recognition from your local coffee shop.", 
    "review_date": "2009-11-06"
  }, 
  "EeNxafbMAJg7m4mIe1h95A": {
    "user_rating": 2.0, 
    "user_location": "Gaslamp, San Diego, CA", 
    "user_name": "Megan P.", 
    "review_text": "We went here because the reviews on yelp looked promising. I ordered the ham and cheese croissant and a chia because I'd read good things about both. The person I was with ordered an oatmeal and a hot chocolate. We got our drinks quickly, but they were ridiculously hot and my chia tasted like it had a few shots of espresso in it which wasn't what I thought I was ordering. The ham and cheese croissant was burnt and the oatmeal was kind of bland. The service here leaves something to be desired as they people working that morning were inconsistent in the way the food was delivered. They expected patrons to pick up drinks at the counter, but delivered the food to the table. Overall we won't be going back.", 
    "review_date": "2014-12-08"
  }, 
  "5eHa4S_PXdoznyEGDNRztQ": {
    "user_rating": 4.0, 
    "user_location": "Chino Hills, CA", 
    "user_name": "Lillian Q.", 
    "review_text": "A cute little place for either an afternoon leisure or an on-the-go breakfast. I recommend the almond croissant, quite reminiscent of the ones I has in Paris.", 
    "review_date": "2013-09-06"
  }, 
  "z-L7nBwIm2bgFx96NV-loQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "New management sucks. I ordered the egg wrap (tomato, egg, cheese and bacon). Not only were they out of tomatoes without telling me but they forgot to add the bacon. It costs extra to add bacon. This guy would have found a way to screw up yogurt and fruit.", 
    "review_date": "2014-12-07"
  }, 
  "mDbsLpJ6iV07fAiQy589Lw": {
    "user_rating": 5.0, 
    "user_location": "Davis, CA", 
    "user_name": "Gary H.", 
    "review_text": "Perfect place to come to relax, study or work. Free wifi (need to ask for password), plenty of outlets, cushion settings with pillows. The staff is friendly and provides a welcoming environment.", 
    "review_date": "2013-03-04"
  }, 
  "RsY9F3-xw3l3qDojahFSpQ": {
    "user_rating": 2.0, 
    "user_location": "French Quarter, New Orleans, LA", 
    "user_name": "Sophia G.", 
    "review_text": "This was was ok. I would actually call it pretty mediocre. I got the cheddar roast beef melt. The sandwich wasn't much, but it contained soo much horseradish I couldn't taste anything and it cleared my sinuses. With that much horseradish, anything could have been on the sandwich and it would taste the same. I also thought the price of this place was a little ridiculous for what it is. So many other sweet lunch spots in North Beach. This was one of my least favorites.", 
    "review_date": "2014-02-20"
  }, 
  "1NHberk02xgCXUoRGjuK0w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Trish B.", 
    "review_text": "Delicious! Panini caprese with a salad and spritz on a warm afternoon. The outdoor tables are fun to sit at and watch SF life before your eyes.", 
    "review_date": "2011-08-28"
  }, 
  "yj1I03EW4ZheWLFEJIdRIg": {
    "user_rating": 5.0, 
    "user_location": "Willis, TX", 
    "user_name": "Joe S.", 
    "review_text": "After being in SF on business (I'm from Houston), I stayed an extra day to see the sights. Was going to eat at Pat's Cafe but (fortunately) it wasn't open yet. Desparately needed coffee so kept walking and happened on CC. Glad I did. The danish was tasty and the panini with jam was simple and delicious. The star of the show, however, was the French Press Coffee... Fantastic!!! This place has a cool and comfortable vibe. Will be hitting this place up again next time I'm in town.", 
    "review_date": "2013-07-08"
  }, 
  "p3aOu-ooA3V6yq58qOJetA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frannie C.", 
    "review_text": "I don't really remember too much about the place... I would have forgotten to write a review if I did not check in here. :P  I think my husband ordered a quiche.  I saw that people can use free wifi here. Self-service  Um...that's it.", 
    "review_date": "2012-09-13"
  }, 
  "Q_LoT7uKTgznikHLSfKG2g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vincent E.", 
    "review_text": "Smoked salmon bagel was delicious and was brought to me quickly after I could finally make my order. The waiter left me waiting at the terrace 15 min after telling me to sit there so he'd come take my order right away. When I stepped back into the restaurant, he seemed to be unwinding, taking his time slowly washing glasses and other dishes.", 
    "review_date": "2014-08-09"
  }, 
  "nCCCow84ozoIqbjevZH8uw": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Michael G.", 
    "review_text": "This is a nice little tucked away cafe. I was looking to kill some time and came upon this place. It's a real cozy environment and has comfortable seating. I ordered a ham &amp; cheese bagel and chai. The chai was one of the best I have ever had! It is a great place to catch a snack and relax. They have wifi there also which came really handy. Overall the business was very clean including the restroom. Priced a little high for what I got but the environment and wifi made up for it.", 
    "review_date": "2011-01-11"
  }, 
  "4HeDkrTsapL8IclSL1cT_Q": {
    "user_rating": 3.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Zachary A.", 
    "review_text": "Ive seen some good pics on yelp and thought i try it out. I came here in the morning. I love mocha's and was really looking forward to see some latte art which they failed Guess its a newbie barista. Anyways I had a mocha and the egg wrap. The mocha and the egg wrap was juz...meh. I should have tried their bagels instead. On the upside it is a Cozy place to do my writing since the atmosphere of the dining area has a warm feel to it plus they have free wifi but again most coffee shops in sf have wifi. Nothing special.", 
    "review_date": "2013-09-27"
  }, 
  "eA91tgqdKxJx0Rwekh7E1g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth b.", 
    "review_text": "Given the photos of the cappuccinos and great reviews, I had quite high expectations. Unfortunately, Capriccio came in way under the bar. The espresso was badly burned and the milk was scalded.  A cappuccino should not have to sit for 3 minutes in order not to burn your mouth.  I might give it another try (could it have been a one time thing???? I don't know) but would be quite upset if it failed me again.", 
    "review_date": "2012-11-02"
  }, 
  "Tc0kA7rvOZ5fPOlCycWu8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nancy m.", 
    "review_text": "Alex and Jessie are the new owners and have really set up a great neighborhood cafe with excellent food AND friendly service. The place is nicely decorated, clean and they have tables where you can sit outside too. The food is consistently delicious, hardy portions,  affordable, excellent coffee drinks, cold beer, relaxed and friendly atmosphere, free wifi, dog friendly, amazing happy hour! (3 bucks for a great glass of wine! ) and service with a genuine smile. Alex and Jessie and their staff are some of the nicest people you will meet, even at 7 am in the morning! What more can you want?  They have a great selection of food , yummy deserts (love  the muffins and  pecan pie). Always fresh.  You can't go wrong with this place.", 
    "review_date": "2009-02-23"
  }, 
  "jvahIXlThqHfD_cDfv1HwA": {
    "user_rating": 2.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Kevin A.", 
    "review_text": "Brekki menu selection was pretty small and I definitely didn't see things on offer like some of what's shown in the pics within this place's Photo feed, mainly typical fare such as wraps, sandwiches, bagels, all very bread heavy.  Came here because of the pics and reviews of the coffee but was disappointed as there definitely wasn't the foam art (which to me, shows attention to detail) and my cappuccino was realllllllly sweet despite not asking for any sugars, perhaps it's the soy that they use?  I'll try Pat's cafe tmrw as its right around the corner and looks like it has potential.", 
    "review_date": "2014-10-13"
  }, 
  "5npX5wCH7bOk_UAvnfFdDw": {
    "user_rating": 2.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Jen K.", 
    "review_text": "This review is for lunch, which was really quite terrible.  I work in the area, was walking by, checked the Yelp reviews and immediately walked in.  The chicken and bacon salad sounded good so I ordered that.  I was terribly disappointed when it arrived.  The dressing was a disgustingly sweet poppy seed dressing, which didn't go with the salad AT ALL, the bacon was chewy and gross, and the chicken was barely edible.  There were also a couple thin slices of flavorless tomato on the salad.   For over $10, it wasn't worth it at all.  I wouldn't go back.", 
    "review_date": "2012-10-16"
  }, 
  "jnmczPEkhRsUFos_nBPjTA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simone W.", 
    "review_text": "I'm disheartened. This has been my go-to coffee on uncountable weekends of reading in the sunny sidewalk or writing in one of the inside tables. I've been coming here for years and have seen different owners putting their own stamp in the place. Always having the delicious hummus plate. Always introducing the place to friend in and out of the neighborhood. Always raving about it. Until now. It's been a while since I last came here because the last time had left a sour taste in my mouth. What was once a very friendly service became not only unfriendly, but but disturbing. And today I hit an experience that makes my body cringe with the idea of ever coming back and being treated this way, as if I were doing them a favor for ordering, as if I did something really wrong just for being there, as if I am were a lier. I leave the comfort of my place to go work at a coffee shop so I can have the convenience of coffee, tea and snacks made for me, but also so I can interact with others, smile and smile back, spread love and grace. It's sad for me to see a place where instead of that, I get contempt and scorn. A place filled with people that look like they are hating to be there and hating to have to do something for me. I grieve, Capriccio, and hope that things turn around. Until then, I will explore one of the many options that north beach blessed me with.", 
    "review_date": "2014-03-30"
  }, 
  "uvI72KK0lmzv7_CFexU2-Q": {
    "user_rating": 3.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Gosha K.", 
    "review_text": "Decent enough. Good wifi, pretty good breakfast. A bit of a snooty attitude toward customers. I am sorry that I don't know your rules about not being able to carry something out if it was missing from a table. There is a nicer way to let me know then to say you have other things to do inside.   Otherwise everything was fine.", 
    "review_date": "2014-07-05"
  }, 
  "JVTcskIsqBgyw7jTQC9GYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek N.", 
    "review_text": "I had a good latte here. It's tough not to enjoy this place. The cafe is comfortable and makes you want to lounge for awhile. Win.", 
    "review_date": "2013-04-24"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "Love the outdoor seating here. This place (along with Cafe Francisco) doesn't get a lot of traffic because it's off the beaten path of Columbus St./North Beach territory. They make good coffee, iced/hot tea, cheese, beer, sandwiches, pastries, etc. They also have free wi-fi and friendly service. I have no problem with this place. Even the prices are decent for North Beach food/drinks. It's just a bit small. Oh! And, it has solid background music.", 
    "review_date": "2013-09-18"
  }, 
  "Zmmvs60O_fy_Vzs5HntRqg": {
    "user_rating": 3.0, 
    "user_location": "Tallahassee, FL", 
    "user_name": "Stella M.", 
    "review_text": "Pretty standard menu. As for our meals, I was neither impressed or disappointed. Fairly expensive considering the simplicity of the menu-- could be due to location. Our ham and cheese croissant tasted like it had been nuked in a microwave, but they were willing to make a dish for me that isn't on their menu, so they definitely won me over with that", 
    "review_date": "2014-08-14"
  }, 
  "aJbXWA8OuA4mx0B67dXwNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna b.", 
    "review_text": "I've been waiting, since I  moved here, to visit this cafe- so I'll say that's 2 years but I could be off by months. It opens! And it's far better than I dreamed! Not exaggerating. OK maybe a tad. I've gone here twice now, and each time was great. We're so spoiled in this part of town- there must be a cafe with a block because damn if I don't need another espresso to keep awake, so I can go back to wine &amp; pasta tonight. What this cafe offers is a slightly European flair from Sapore or 901 Columbus. It also offers an affordable menu of sandwiches and great outside seating on a relatively quiet block for Northern North Beach. Note: twice, my companions compared it to Noe Valley! I kid you not. Glad they finally opened. And the wi-fi is very appreciated.", 
    "review_date": "2007-05-10"
  }, 
  "w-a3z9o6y8-m2w-NMW2S3g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Daniel R.", 
    "review_text": "Came here for breakfast. The berry pie was really good. I also like the almond croissant. The place was clean and had nice facilities. The coffee was pretty good. Definitely will return here for a good breakfast with friends. Pleasant place to talk and plan a day.", 
    "review_date": "2010-09-20"
  }, 
  "a265T9fa0U9paf4iCirlgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Selin K.", 
    "review_text": "I live just around the corner from Capriccio and have been coming here for years. I am happy to say that it is a true neighborhood gem- which is tough in North Beach when you're so close to Fisherman's Wharf and Pier 39. The current staff, especially the baristas, seriously know their coffee. Whether you prefer an espresso drink, or a drip coffee, its all amazing. Nothing beats grabbing a book or magazine and heading to Capriccio on a weekend morning to sit outside on the sidewalk in the sun, drinking a soy latte, and reading. (Inside is good too- the music is always delightful)  Minus one star only because sometimes I come in to read or study, and all the tables are occupied by hipsters on their macs leeching free wi-fi.", 
    "review_date": "2011-07-08"
  }, 
  "pFFl_PTR-qHOoqaJu4XKag": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Dan N.", 
    "review_text": "Ooh, a Yelp first for me. It's a real-time review, yo. As I write, I am sitting in a very comfortable chair in the front corner of Cafe Capriccio. And, of course, this is all made possible by the fact that Cafe Capriccio offers free Wifi (You get two stars for that CC!).   I've just finished the Roast Beef Chedder Melt (as recommended by what seems to be a very helpful and decently nice staff), I hope the staff doesn't worry that I am judging them, even though I am. They're doing a good job. Handling customers swiftly and with a smile, I have been here for about 45 minutes and they haven't even shot me dirty looks despite the fact that I forgot to put pants on today. (Okay, I didn't really forget. I have dubbed this day \"No Pants Friday.\" Feel free to celebrate with me.)  The crowd is acceptable. No scary people. No crazy people (which is a nice break), There's a baby. But don't worry, the baby is with his parents. It's not like he's just a random baby grabbing a cup of coffee. That would be weird. He has two people taking care of him. Hope they aren't kidnappers. Hmm, better get a closer look. The guy does have a beard, but he seems to be on the up and up.  Ok, so back to my lunch. I gotta say, it wasn't far away from great. The roast beef seemed like it came from my mom's oven instead of a deli freezer. The cheddar was quite melty and the panini bread was crisp, but maybe a little crummy for my tastes. But then, I am a super sloppy eater, and I was destined to get flakes of bread all over my hoodie. So I won't fault CC for that.  I'd love to tell you about the coffee, but I had to walk here, and I am a large man, so I was sweating when I got here. Therefore, I went for the iced coffee, which is pretty good, but isn't one iced coffee the same as all the rest? I say yes.  Wanna talk decor? I do. Hmm I am looking around right now. There is a very large painting of fish swimming around. I do not know what this means in an arty sense. There are some other paintings that make no sense. But they're nice. Then there is a giant painting of a rhino with zebra stripes. I don't know what this means either, but it is kinda cool. I mean, it's better than hanging up paint-by-numbers or your 5-year old nephew's (probably terrible) drawing of his family. They also have those lights that hang down. I don't know what those are called, but they make me feel like I'm in a trendy place. And that is exactly what I want when I am trying to be trendy in North Beach on a Friday.  So let's summarize: Free wifi, good roast beef sandwich, nice staff who don't subscribe to the tyranny of pants, babies with parents, art. So really, I have very few complaints about Cafe Capriccio.  I'll come here again.", 
    "review_date": "2010-05-14"
  }, 
  "KSWYGDjS99pmJ4CgIJ6lKg": {
    "user_rating": 4.0, 
    "user_location": "Dowell, MD", 
    "user_name": "James H.", 
    "review_text": "Fantastic cappuccino and espresso. It is the closest good coffee we found to our hotel at Fisherman's wharf- it was definitely worth the walk!", 
    "review_date": "2012-07-11"
  }, 
  "nAbwXrHgJx5BshmOcCRCZQ": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Rayna A.", 
    "review_text": "5 star croissants and other quality eats &amp; drinks!  I can't give the place 5 because the prices run a little high to me - but it's a solid 4 for sure.    CROISSANTS- you want these - especially first thing in the morning. Story round here: the owner wakes up at 4am to make sure these are baked fresh by 7am.    This is probably the 2nd best almond croissant I have had in SF, a good contender for those in Marin County. Without exposing my dirty past here, lets just say that I grew up with mad croissant hook-ups in Sausalito, Mill Valley, Larkspur and San Rafael from establishments that cater to European tourists.  I was an overstuffed child with a mother who thought good parenting meant pimping European butter to me like I was one of her clients. And sadly, I've been bribed with food since I can remember - not naming any names, but I kept secrets for a certain baby sitter in exchange for bags of croissants from a touristy spot in Tiburon.  I hit em hard but I also flipped a great deal.  My point is that I have had my share of croissants and this ish right here is - bomB!  Worth blowing up for.  TAKE EM HOME FOR BRUNCH My girl sometimes brings them home when we prep brunch.  Anything within a block under $10 that makes me wanna sing, has the potential to become part of me.  I've been good about these until recently.  Your warning: these aren't sweet, but the toasted almond one can produce bad girl affects.  Butter, fingers, lips, hips, swallow, singing in public - \"pour some [butta] on mey.\"  Not sure you wanna hit this.  SCENE We have been neighbors for almost three years.  This is one of my go-tos to get stuff done because I like that my neighbors pop in and other students hang around to study.  They have wifi, outlets, pillows, and a fair amount of seating.  It can get busy, but I've never had trouble.  The staff is way kicked back even after a spill- I like that.  The music is always crack'n - a few times I have had to whip out Shazam.  I don't know who puts together their playlists but I would probably buy their mixed CD.    OTHER FOOD &amp; DRINK TIPS - I'LL BE BRIEF Do get: mocha, latte, cappuccino DON'T get: regular coffee Do get: yogurt Parfait, salads, wraps, caprese sandwich, paninis, bagels w/ bacon egg and cheese, vegan donuts, warm baguette w/ nutella, pie, and pastries. Beer includes Big Daddy, Deschutes' Black Butte (love), Hef, Fat tire, Peroni.  Wine changes.  SPECIAL NOTE: DON'T get the prosciutto sandwich if you don't like prosciutto - no matter how bomb it looks.  Really, it's a beautiful mountain of raw pig, everyone else is eating it.  However, if that is not your thing - stick to your guns. Pulling prosciutto out of your panini here will get you dirty looks like you're sacreligious.", 
    "review_date": "2012-04-26"
  }, 
  "QjygwsEjxJvrTV3OsCS57Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurent T.", 
    "review_text": "Coffee only review: good pouring skills, the cappuccino is good, but the mocha is way too sweet...  They also have a phone QR based system for buy 10 get 1 free! :p", 
    "review_date": "2011-10-07"
  }, 
  "KMrPwTZjVvNtZaxZIFuXHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "Fantastic coffee, one of the bestin northbeach", 
    "review_date": "2010-06-05"
  }, 
  "r72ak0EL6xP0-zW2ZfL1tw": {
    "user_rating": 5.0, 
    "user_location": "Oxnard, CA", 
    "user_name": "J F.", 
    "review_text": "Real barristas. This was a near perfect latte. We went on different days and had different barristas...same quality.", 
    "review_date": "2012-07-26"
  }, 
  "LJcQhKpUozHdgikIsiqjIQ": {
    "user_rating": 4.0, 
    "user_location": "Albany, NY", 
    "user_name": "Carlene G.", 
    "review_text": "Food: Delicious. Blueberry pie made from scratch with real blueberries.  Coffee: The real deal -- French Press, full of flavor. Service: Staff was extremely friendly and helpful when I needed to ask about ingredients due to a food allergy. Speed: The only place a star was lost. They're making everything for you (no pre-packaged junk), so it's understandable, it would just be a deal breaker on a work day when I needed to get somewhere quickly.", 
    "review_date": "2013-10-05"
  }, 
  "Jt76kMkWSAJyWVvc4hcMEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "aaron p.", 
    "review_text": "Best espresso/latte/mocha I've had at least since Cafe Organica (Grove and Central, circa 2006) was around.  In reality, this is probably even better.    Yes, I've been to Ritual, Blue Bottle, Fourbarrel since Organica closed.  This place still wins.    Hooray for badass coffee in the neighborhood!", 
    "review_date": "2009-12-03"
  }, 
  "D1nCb4_lI-6n0peIgg97vg": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Tracey Z.", 
    "review_text": "I'm actually sitting inside this Cafe as I'm typing this!  I really like this place--it has benches in the back that are comfortable to sit on and allow you to spread your stuff if the cafe isn't busy. They also have pillows, which is a nice touch! The exterior and interior are adorable, and very homey. It's quiet, the workers seem nice, and it wasn't too crowded.  I had a single-shot macchiato and the roasted chicken panini. I'm no ~coffee expert, but the macchiato was delicious, with a cute little leaf pattern on top, and the panini was great--it had a little side salad to it, which was nice.   PLUS! The most important thing to me--they have free wireless! It's fast and free.", 
    "review_date": "2010-10-09"
  }, 
  "A0jt8dFusg__JgVprDmNZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hillary H.", 
    "review_text": "Tried out this place because of the good reviews and the $15 for $10 yelp deal. When I presented the deal to the cashier he looked like he had no idea what I was talking about. Eventually they figured it out and I got the deal but it's always awkward when you feel you're holding up the whole line. My friend had iced tea and a bagel and I had the iced coffee and yogurt parfait, my only complaint was the iced coffee wasn't the greatest but the food was good. There was plenty of outdoor seating and it's a fairly quiet neighborhood so it's a good choice if you're in the North Beach/ Russian Hill area.", 
    "review_date": "2013-06-11"
  }, 
  "k6zYbMle3LI9jhMuY4Tc4w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison Z.", 
    "review_text": "Attention coffee shops! Offer your Americano in 8 oz/extra small cups! ESPECIALLY if you already have the cups in stock! Every good coffee shop (Reveille, Coffee Bar, Trieste, Beacon, Blue Bottle, Coffee Cultures, every cafe outside the US...) will give you this option, because this ratio of espresso to water is much stronger/better.   Tried to order Americano here in 8 oz cup (stacked next to register), even though paying for 12 oz. Guy/manager confirms and says no problem. I remind barista (and point to cup) bc it took awhile to get to my drinks. She also says no problem. But then starts making drink in 12 oz cup? I ask her to stop, but she says \"Look at the menu. An Americano only comes in a 12 oz\" and hands me a drink filled to the brim. Huh? Just use less water? I know it all sounds trivial, and it's not like I didn't drink it, but I just get irritated when people blindly follow procedures without thinking, and are rude in the process.  Bumping this from 1 to 2 stars because the manager was really nice. I stupidly spilled a second drink I had ordered all over the sidewalk, and he offered to give me a replacement. I thanked him, but said I didn't have time (it took 20 minutes to get these two drinks!) and that I'd rather not order again from that barista. In the end though, I have too many other great coffee shops in my neighborhood to frequent this place again.", 
    "review_date": "2014-10-05"
  }, 
  "VT5lqS__Ev8v3FE8bpi0gg": {
    "user_rating": 4.0, 
    "user_location": "Cheviot Hills, CA", 
    "user_name": "Dan Y.", 
    "review_text": "I'm not too familiar with San Francisco or the Bay Area but happened to come across Cafe Capriccio and their Yelp offer while I was near the area. The 4.5 star rating and hundreds of reviews, along with a Yelp deal made it a must try for us.   The cafe itself has an inside and outdoor seating area. Since the inside was packed at 11am on a Monday, we ate outside on the sidewalk. A nice, quiet, comfortable eating area with very few distractions. I could easily have spent a few hours just chit chatting and reading a book. The unisex restroom inside was very clean (important!!!) and the workers behind the counter provided great service.   The food was also delicious. I got a Caprese panini with a glass of unsweetened ice tea and it hit the spot. The ingredients inside tasted fresh and simple, no unnecessary flavoring. The bread may have been a little too hard for my taste but my friend disagreed with me 100%.  Next time I'm in SF, I'll certainly be coming back! Even without a Yelp deal...", 
    "review_date": "2013-08-18"
  }, 
  "1szMCSQX8nRn3Donr4R60A": {
    "user_rating": 5.0, 
    "user_location": "Shingle Springs, CA", 
    "user_name": "Bruce P.", 
    "review_text": "I really enjoyed this place. I had a salmon bagel and a mocha. Both were great. The employees were very friendly and helpful.  The outdoor seating was a plus as well. I'll definitely be back the next time I'm in the Fisherman's Wharf area.", 
    "review_date": "2013-08-18"
  }, 
  "FmS_qwo7hds1dHner5vjgQ": {
    "user_rating": 5.0, 
    "user_location": "Calgary, Canada", 
    "user_name": "David H.", 
    "review_text": "A - List. Location. Great Drinks and Food. Comfortable &amp; Friendly. This is a great place to start off the day or meet up with friends later. For a small operation, this is pretty much as good as it gets. Miss this place badly.", 
    "review_date": "2010-12-08"
  }, 
  "iVxpHjBplVQHgVxtbUKPxw": {
    "user_rating": 4.0, 
    "user_location": "Arlington, MA", 
    "user_name": "Rax P.", 
    "review_text": "I wish I could put this place in my pocket and bring it back to MA with me.   Before I get into any details, I'll preface this review with: I'm not from San Francisco. I'm from Boston, a place that has very few wine bars, so most of the wine bars I've been to are out of state. I've been to San Francisco a total of 3 times, Napa twice. I'm a wine lover. I'm a food lover.   That being said...this is one of my favorite places in San Fran. We came across this neighborhood gem a couple days into our trip and stopped in 3 times before heading back home, twice on the same day.   The staff is great, so friendly, welcoming, and knowledgeable about their wines.  The food was delicious. We didn't try much more than breakfast and a snack, but the egg wrap, the oatmeal with fruit, the bagel sandwich, hot chocolate, and cheese plate were all good... The seats are cozy.  They have free wi-fi.  They played great music every time we went.  They have a wine bar. How many cafes do you know of with a wine bar?  Their wines and wine flights are priced right and their selections are really good. Not to mention that the $9 wine flight essentially gets you 3 full glasses of wine...or maybe we just lucked out. Either way, I love this place!    If I lived in San Francisco, I would make this my neighborhood place. I miss Cafe Capriccio already and am sad I couldn't bring it with me to the east coast.   Do yourself a favor and stop by for some breakfast, lunch, or a glass of wine. You won't regret it.", 
    "review_date": "2013-07-03"
  }, 
  "fgvkzqk6wtgO-kshU3TOSw": {
    "user_rating": 5.0, 
    "user_location": "Garland, TX", 
    "user_name": "rena s.", 
    "review_text": "Free wifi. Great coffee. Great food/well priced. Friendly service. We had breakfast twice during our 4 day stay. Highly recommended.", 
    "review_date": "2013-05-27"
  }, 
  "zwOxvLSjQ7yhRMzQOgYemA": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Avata R.", 
    "review_text": "CostCo quality pastry and Folger's level coffee. Real garbage that I couldn't even finish. Listen, everyone has a right to their opinion but, really, if you're giving this place more than one star you're an idiot.  UPDATED 10/22/10:   Apparently, my review hit a nerve with Yelper, Pamela P., who wrote a compliment to me that read:  \"When you write a review about another city's cafe ( capriccio) make sure you understand and research who has the top 10 coffee in the city. you top rated some shitty cafes and probally do serve costco pastries. so please dont act like your shit doesnt stink. and keep your ass in LA.\"  Okay, first reaction: Must. Stop. Laughing.   Second reaction: Intuition. I can only assume this \"compliment\" was written by the management and/or staff defending this dump, which kinda square roots 'pathetic' by a factor of one hundred... plus five. I'm talking PATHETIC here, like the sweaty guys in the back row of the Pussycat Theater (So I've heard).  Third impression: Logic. Pamela, honey, I don't actually have to \"research\" anything. I paid my money and in return was served a cinnamon bun of sadness and a cup of raw sewage. I now have the right to offer an opinion on the sad state of affairs that operates the business known as Capriccio.   Fourth impression: Reason, mixed with paternalism. Pammie, my opinion is just as valid as yours, if exponentially sophisticated in comparison, if I don't say so myself. Where was I? Oh, yeah. You wrote the following review of \"Cako Bakery\" on 1/29/10:  \"This place is HORRIBLE!!  yes it might look \"nice\" and \"welcoming\" when you pass by, but there cupcakes suck! there dry and don't have a lot of good flavor. i was digging the fro-yo place that was there before. the staff is rude and isnt happy to sell cake! all in all.. something better needs to go in this spot. k thanks! :)\"  You see what I'm sayin'? Glass houses and all that. What, you never heard of glass houses? It's in the bible. Psych! It's not.   Fifth impression: Empathy. Think about test driving a spellchecker.   Sixth impression: Pride. I actually have a pretty nice ass. Really. You should see it sometime.  ;)", 
    "review_date": "2010-10-13"
  }
}