{
  "7KnLMwVAi1DMrqHaod9jmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allen T.", 
    "review_text": "Most mornings, I fall out of bed and stumble into Cafe Francisco looking for coffee and food. I'm  really grumpy before I get my coffee, but the fine folks at Cafe Francisco are always friendly and quick.    Their breakfast bagels are pretty tasty, and their coffee has plenty of caffeine. I usually have several cups (free refills!) every morning.    Cafe Francisco is a good place to work, they have free wifi, and the booths are nice and big. However, only the tables by the front have power. The tables outside on the sidewalk are great on sunny days.  Their sandwiches are pretty good too, the roast beef is highly recommended.", 
    "review_date": "2010-04-27"
  }, 
  "pta-L4bIsr0dl8sOiapTFg": {
    "user_rating": 4.0, 
    "user_location": "Wynnewood, PA", 
    "user_name": "Mark H.", 
    "review_text": "We were looking for a small place to grab a sandwich, somewhat close to all the action near the piers.  Cafe Francisco was a great find.  I went with a club and my girlfriend went with the roast beef.  Neither disappointed.  They were both warm, fresh and delicious.  There is plenty of seating outside, and being away from all the tourists means you can enjoy some peace with your food or drink.  Overall this is a great place to grab a quick lunch and next time we're around the area we'll stop by again.", 
    "review_date": "2012-05-27"
  }, 
  "sktv99q80ieALb11AcfNOQ": {
    "user_rating": 4.0, 
    "user_location": "Indianapolis, IN", 
    "user_name": "Amanda W.", 
    "review_text": "This place is a great little gem in the tourist-infested area near Pier 39. I am a student at a school in the area, and this is one of the few places around there that I can go for good food and good coffee, away from the pier. The food is really pretty good--I usually get the mediterranean plate but I've also had the veggie sandwich and the spinach salad with bacon. All good. And the coffee is really excellent--never needs sugar.", 
    "review_date": "2013-03-21"
  }, 
  "xJiJgVg6GKbEWRy41JJe8g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matteo F.", 
    "review_text": "Decent coffee, wi-fi, locals, the Chronicle and quiet.  Just sit back and relax.", 
    "review_date": "2005-11-11"
  }, 
  "vOQuq2iNvsu_PHv-wrsQmQ": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mark A.", 
    "review_text": "This cafe is a few blocks up from the wharf which puts it in more of a local category than tourist spot.  I was there late evening and had a cappuccino.  It was OK but I think the server was not top notch using the machine.  It is quaint and a neighborhood spot but would have liked to tried something to eat as it looked great.  Would consider stopping there again if I were around the area.", 
    "review_date": "2012-01-26"
  }, 
  "51ILdkZvZ00cn_Xp0NJq5Q": {
    "user_rating": 3.0, 
    "user_location": "Corona, NY", 
    "user_name": "Nes L.", 
    "review_text": "This place is great for Sunday brunch and for taking your time reading a book or people watching on the outside tables. I had the breakfast sandwich which was decent. The everything bagel I ordered though wasn't great but I may just be used to New York bagels. I also had an iced latte which was ok. The service wasn't great. The cashier wasn't friendly and the tables weren't wiped down. This is a place for locals and it was the only place open nearby on an early sun morning. Overall I would recommend it just know that it's no frills.", 
    "review_date": "2012-10-28"
  }, 
  "np3xAqEcWmHPCqDSJO0wuw": {
    "user_rating": 3.0, 
    "user_location": "Pembroke Pines, FL", 
    "user_name": "Raquel H.", 
    "review_text": "I love they're Margarita pita sandwich and the coffee cake BUT they really take their time preparing their food which is great and all but when the line is out the door they should really make an effort to not make you wait 40mins for a Togo order. It's frustrating. It's a Wednesday and its dead here and i've still waited over 15mins.  This is the one thing that would make me stop coming here....", 
    "review_date": "2013-08-14"
  }, 
  "7iPJAJoouV2EegCQwxraQg": {
    "user_rating": 3.0, 
    "user_location": "Indianapolis, IN", 
    "user_name": "Carl B.", 
    "review_text": "Not much to say.  Very generic bagels and coffee that was pretty mediocre.  I'm sure it is better than the touristy places on the docks, but we were not very impressed with the Cafe.", 
    "review_date": "2013-04-24"
  }, 
  "sBwkkmAr8t0H64sqtr33fg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon B.", 
    "review_text": "This might be unfair since I haven't been here in over a year, but I advise everyone to stay away from this place. I ordered a vegetarian sandwich and noticed it was crunchy, though there was no reason for crunch. When I opened it up I was disgusted. The vegetables all had a bad mucousy sheen to them, the greens were black and soggy, and I was crunching on the mostly blackened avocado slices. Those vegetables looked like they'd been cut and laid out in the open for a week. I brought the opened sandwich to the person at the counter and told them it didn't look right. He just said, \"Sorry you didn't like it,\" and threw it away. That's it. I went home and was horribly, horribly sick for 3 days. So I lost three days of work over a bad Francisco Cafe sandwich. My advice: Don't go here, ever.", 
    "review_date": "2010-03-16"
  }, 
  "TqXAebtAtO90ZmN_odc8mQ": {
    "user_rating": 2.0, 
    "user_location": "Alamo, CA", 
    "user_name": "Nora S.", 
    "review_text": "Not at all memorable. I don't even remember what we ordered, but I didn't care too much for it (some kind of boring salad). Coffee wasn't good either. If coffee at a coffee shop isn't good, I can't give it more than two stars.   It was also overpriced for the portion size.", 
    "review_date": "2015-01-08"
  }, 
  "T6SuLkeGko0shJacHYWq6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate V.", 
    "review_text": "A lot of people from work walk over here for lunch.  It's descent, but nothing special.  It was nice sitting outside, but it took awhile to get our food.  Very relaxed atmosphere...On average there is one person out of four at our table who doesn't really like what they got.", 
    "review_date": "2007-06-19"
  }, 
  "zWJvoYtod7KdKnZUY0ZoiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy P.", 
    "review_text": "Cafe Francisco is right by my house.  I think they have the best BLT in SF.  Their salads are great too.", 
    "review_date": "2009-09-10"
  }, 
  "zaIr4I0cjLR8w_0AIJJdDA": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Rocky C.", 
    "review_text": "Right across the street I will be teaching at soon.  Delicious sandwiches, fresh ingredients.  A pretty chill place for teachers and other nearby professionals to have lunch.   I'd recommend the \"San Fran\" sandwich (although no one who is actually from the Bay Area calls San Francisco THAT).  It's filled with lettuce, chicken breast, bacon, tomatoes... and I'd recommend it on foccacia.  Comes with fresh fruit on the side as an added bonus!", 
    "review_date": "2008-09-30"
  }, 
  "efxQL_763AP0tk9GvGmdrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris B.", 
    "review_text": "I go here for lunch at least once a week.  So far I have not been disappointed.  The menu seems very accomodating (I am VEGAN) given the availability of a greek salad (minus the feta) and a falafel sandwich. The olives on the salad were outstanding - always a good measure of restaurant quality IMO.  The yellow split-pea soup is also outstanding on days when they make it.    I love food and stuffing myself so much that I sometimes get a bowl of split-pea and a whole falafel sandwich.  (Total cost is still under $12 for that enormous meal.) The portions are totally adequate for normal people.", 
    "review_date": "2006-09-11"
  }, 
  "cTrlhfni7C3xFlyIL3x1bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luba P.", 
    "review_text": "I come here for lunch a few times a month and my favorite thing to get is a half sandwich half salad combo. You can pick from ANY sandwich on the menu which most places won't let you do and it comes with a side salad with greens, tomatos, cucumber, peppers and dressing. All for $8-$9, great deal!  During the week they get pretty busy around lunch time so come early or after lunch. Overall a nice little gem in the neighborhood.", 
    "review_date": "2013-06-11"
  }, 
  "xwlHo-QHxB8BM9jb2ITirg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy L.", 
    "review_text": "I changed my mind. There are some things you can't do with out. Skippy Peanut Butter, Smuckers jam, Sharmin toliet paper, Ketel Tonic, B52 Sando from Cafe Francisco.   Even in hard times there are things that you cant do without or cannot compromise. I felt Cafe Francisco was too expensive. I thought I could do with just your regular grocery store deli sando. I thought it wasnt worth it.   New Years Resolution '06, Dont lie to yourself.   Those Cafe Francisco sandwiches, although pricey, are darn good.", 
    "review_date": "2009-03-18"
  }, 
  "FdCXDhOuJgY3z00iI1wTng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julian H.", 
    "review_text": "I really like this place as a lunch spot.  The food (the few times I've been there) has been consistently good--I have yet to experience the missing ingredients.  They play old jazz, and the staff is really nice.  Plus, they sell the NY Times right by the register.  The owner dude needs to stop pacing around in the dining area, though.  He makes me kinda tense.", 
    "review_date": "2006-07-27"
  }, 
  "496e9_P-xJnHbR3gEADaVQ": {
    "user_rating": 2.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Yasmine G.", 
    "review_text": "You know the \"good-on-paper, bad-in-bed\" guys?  This is like the cafe version.  I was excited when I ordered my Garden Vegetarian sandwich listed with hummus and other veggie goodies, but in reality there was so little \"meat\" to it, plus it was overwhelmed by the huge (and very hard) focaccia bread slices...and I love focaccia bread.  I also had a cup of carrot ginger soup which did not have much kick to it.  Do not be seduced by the menu.  It all sounds good, but disappoints in the end.", 
    "review_date": "2006-03-28"
  }, 
  "aMBkcgtRHVu2AnRczmtmAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara T.", 
    "review_text": "I live pretty much above this place, so frequent it quite often for coffee and quick bites. They have a great selection of pastries, bagels and other breakfast items.They also have beer and wine and make some great sandwiches and salads. They tend to get pretty busy, so expect to wait a while for anything hot. I wouldn't get the fruit dish though - both times I have it's been out of season and off.  Great for grab and go, but with so many other places in the area it's hard to recommend lunch/dinner items here.", 
    "review_date": "2013-02-27"
  }, 
  "jnQ5GCeAiFPS8sqhSdoYSQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lyndsey S.", 
    "review_text": "gah, gross.  almost $8 for weak coffee and a vegetarian sandwich that had tuna on it.    I ordered the vegetarian sandwich, and asked quite nicely for extra yellow mustard.  The woman behind the counter looked at me kind of funnily, and said that they don't put mustard on the vegetarian sandwich.  I asked her if they had any mustard for other kinds of sandwiches, and she said yes.  So I then repeated my request for yellow mustard, and she said ok, we have dijon.  This whole conversation took a couple of minutes, and could've easily been solved with \"I'm sorry, we only have dijon.\"  Anyways, so I wait a few minutes for the sandwich (which I got to go), and get my coffee while I'm waiting.  Maybe I'm spoiled, but I at least like the option of strong coffee.  I put a little from each variety in my cup to see if any were dark enough, but it was a lost cause.  My coffee looked more like tea.  So not helpful when you've got to deal with a bunch of cranky teenagers later!  Sandwich comes, my weak coffee and I leave.  Later, I sit down to finally eat, and there are two huge problems.  One, every single ingredient has been piled in the middle of the sandwich.  It's like a soggy mountain, I swear.  The avocado is falling off left and right, the 9 pieces of red pepper are sliding around on each other, the tomatos are grainy and the bread is soggy as can be, which means the entire thing just falls apart after I take the first bite.  I open it up to try to rearrange things, thinking maybe if I do that it'll be easier to eat, and find bunches of tuna fish mixed into the hummus.  I ordered the vegetarian sandwich cause of how I'm a vegetarian.  And I'm not usually a picky one...if it'd been some kind of cold cut, I could have picked it off and gotten on with the messy business of eating my damn lunch.  Tuna, though, is a different beast.  All grainy and mushed into the bread and stuck to the vegetables.  Blech.    Lesson learned - inspect your food here before you leave, cause this was just inedible.  Huge waste of money.", 
    "review_date": "2008-01-30"
  }, 
  "mKGWdd2-DOV7lESW50sksA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom A.", 
    "review_text": "Perfectly simple. No bells and whistles, but you won't be disappointed by the quality or price of anything you get.   Great neighborhood and people watching.", 
    "review_date": "2014-03-07"
  }, 
  "La6Bxn5f8jpmj_KVmjyCZg": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Andrea J.", 
    "review_text": "Just a little too dirty inside--it needs a good scrub down. Otherwise I'd give them a four. I like the hardwoord floors and the marble tables and the free wi-fi is great. My americano was nice as well.", 
    "review_date": "2009-05-14"
  }, 
  "2gP8s5dOJmwVKVm0GNMU0w": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Sunni B.", 
    "review_text": "they make a good mocha", 
    "review_date": "2012-03-24"
  }, 
  "7r4dPb5OUwao6nJ4DZegNA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Laura J.", 
    "review_text": "We had breakfast a couple of times here and enjoyed all of it.  The yummy mochas, tasty breakfast sandwiches, and a nice SF atmosphere. It's fairly close to Fisherman's Wharf, but seems far away for crowds and noise.", 
    "review_date": "2013-02-27"
  }, 
  "ieZWhXysO4CkW534sJ2VRg": {
    "user_rating": 1.0, 
    "user_location": "Canton, SD", 
    "user_name": "Taylor T.", 
    "review_text": "It took soooo long to get our food. The tables were sticky and wet, and the staff was not good at keeping up with the (few) people they had to deal with.  We got a bad cafe ole, and when we asked about how long our food was taking they dismissively pointed to the guy who was taking an eternity making it.  Will never come back.", 
    "review_date": "2014-08-10"
  }, 
  "30MGqoQBmgZ1e8K2T_jNHg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "angie b.", 
    "review_text": "i can't speak on what a dining experience is like here, but i can tell you about the wretched presence that took my money for a simple cup of coffee here last wednesday. i wandered in before an appointment in the area, the place was really cute and had a cozy feel, until i walked up to the counter and asked for a small cup of coffee to go, and the raging woman behind the counter shot me dirty looks, and without a word took my money, shoved change at me and walked away barking orders at the other people working with her..lacking my morning caffeine i stood there dazed and a little stunned at what had just went down when she came back and snapped at me that i had to grab the small paper cup from the stack myself- um alright, you maniac, really?! what gives??- so i did, and was super bummed to find that their \"small\" is really taste tester size cups..such a fucking tease, i said i wanted a cup, not a sip. i was running late so i sucked it up and just left. obviously the  two gulps of coffee didn't hit the spot so on my way back from my appointment i begrudgingly went back in and ordered a medium, this time thinking i knew the drill. i dropped my money on the counter, and went to grab my medium cup when she stormed up on me with crazy eyes, and snapped about not touching the cups, she will give me the cup...this is where i had to school her..i thought she would have put up more of a fight but apparently i'm scarier when you fuck with me before i've had sufficient amounts of coffee..later i felt bad and thought maybe she was just having a really rough day, but i later heard from a good friend who works right around the corner that she is this heinous every day...i don't ever plan on finding out if it's true or not. i'd suggest caffe capriccio a couple blocks away on mason and chestnut..the staff there are sweethearts.", 
    "review_date": "2007-11-12"
  }, 
  "XT3iaOBD1eDDi0HqLlPY3A": {
    "user_rating": 3.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Michelle L.", 
    "review_text": "Cafe Francisco remains one of the better lunch options if you live and/or work in the area. On the plus side, portions are large, the food is tasty, and the prices reasonable. On the down side, the service can be slow, the workers cranky, and the place is a bit dirty. My biggest beef right now is that I recently went in and asked if I could order the bagel with lox. The usually unfriendly server told me they only served that for breakfast, so I opted for my usual veggie sandwich. It wasn't until after I put my order in that I saw they had a lox sandwich special, which was identical to the bagel and lox, but on different bread. She couldn't have told me that? I've been pretty miffed with them since. Yet, I continue to go back.", 
    "review_date": "2010-10-22"
  }, 
  "jcS--2oLVgnLOwfuoukxPg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Too Vast B.", 
    "review_text": "This little neighborhood coffee place looks quaint enough and seems a respite from the tourist hell nearby, but I recommend against it. As other folks have mentioned here, the staff are just so incredibly unfriendly and incompetent, it would be laughable if they weren't trying to charge you $10 for mediocre sandwiches. I work nearby and try this place every three months or so for coffee or lunch, thinking that it can't possibly stay that bad for that long (especially when it seems so darned convenient), but it HAS! For three years! ONCE, just once, there was a sweet Irish girl behind the counter who was actually civil (friendly, even)--but she's gone now and it's the usual cretins who seem to resent you for even stepping though the door (seriously, how can this kind of attitude persist? What is the restaurant owner thinking?). A new restaurant just opened up on the southwest corner of the same block, I can't remember the name right now but the food is great and the staff is friendly. Check it out instead.", 
    "review_date": "2007-12-15"
  }, 
  "UnwlB_CahheIvLuANmcWBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua W.", 
    "review_text": "I like supporting the smaller, less corporate folks so this is a nice new find. The menu is inviting and the coffee good.    The European tourist that are there all the time must like it too. StarsB's just can't remind them of home I guess.   People that work there are friendly and again, the food looks really good as it comes out.   I'll try it soon enough. :-)", 
    "review_date": "2014-09-11"
  }, 
  "lFyLouIqT1QBrhZXnsCkOQ": {
    "user_rating": 4.0, 
    "user_location": "Yardley, PA", 
    "user_name": "Michael L.", 
    "review_text": "I'll be here more often now that I've taken a good look at the salads they serve and wished I had ordered them all.  My sandwiches are always delicious.  Easy going in the daytime. Cafe tables outside. My kind of place.  Although...one block away...  Some gnarly guy and his bony, crack-ho girlfriend tip-toed up behind me and touched my head!  I nearly lost it! When I wheeled around my Philly came out and I went to punch him but he beat a hasty retreat. All I could say was 'who the F are you?' over and over. They began raving about conspiracies and taunting me for thinking THEY were they crazy ones. I think they thought I was Donald Rumsfeld or something. Not that I look anything like him.   If homeless people continue to accost me on the street I might have to invent a 'bum repellent'. Problem is: what can I use to offend the nose of a bum? They can out-stink an angry skunk drowning in a port-a-potty. I've seen flies do a 180 when entering their air space.  I don't need to smell that particular eau de no chateau.  What to do?", 
    "review_date": "2006-12-06"
  }, 
  "kIFja02Dxs7KdUHj_rY0nQ": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Alysha K.", 
    "review_text": "Randomly came here while I was waiting to go to a class at the Cheese School of SF (right next door). It was happy hour, so a glass of wine was only $5. And they filled it up to the very brim!!   Me &amp; a friend ordered a greek plate and a proccuito plate ($7.95 each). Definitely worth it! The hummus on the greek plate was really yummy. And the proccuito was good quality, super soft &amp; tender.  The place was relatively clean, however, there were some flies/bugs flying around inside, so one star less for that.", 
    "review_date": "2011-09-01"
  }, 
  "j9vH9szID1ertCOXUWmBQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynn H.", 
    "review_text": "Good sandwiches and nice friendly staff. Try any of the sandwiches on foccacia - yum! I work in Fisherman's wharf and this place is just a couple of blocks away but it's a great escape from the tourist traps of the wharf.", 
    "review_date": "2010-07-27"
  }, 
  "5xFkiPEarQUZMbUcJYz8Rg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza B.", 
    "review_text": "This is THE place for lunch for us folks who work at the Academy of Art near Pier 39. Most of the restaurants / cafes in the neighborhood (by the Pier) are overpriced, have crappy food or more likely are both crappy and overpriced ~ as is usual for tourist trap destinations.  All the food here is very fresh (the first most important thing). The lunchtime salads, soups and sandwiches are very tasty, interesting combos, large portions and reasonably priced. Service is fast and efficient ~ also crucial for work time lunches (although sometimes grouchy--family stuff I think ; )  The Greek Salad and the Mediterranean Salad Plate are both large, fresh and rich in dolmas, feta, olives and the like...  My favorite lunch is the 1/2 sandwich // cup of soup combo. The soups here are delicious and dependable. The half sandwich is usually served on small pieces of bread as a \"whole\" sandwich and can include any of their wonderful sandwich choices. Their Garden Vegetarian sandwich is perfect--avocado, hummus, peppers and more yummy stuff. I usually order it on the sourdough--which is the real deal (from a bakery) and not the pre-sliced crap often served at sandwich places.   I pair this up with a small soy chai latte and I'm good. Sitting outside in the warm weather is always nice.  I wish they would offer a half salad / soup option or even just a half salad option since their salads are too big for me. But they won't budge on this for some reason. They do have a smaller garden salad, though.  I've only tried a couple of the breakfast items--the French toast was too sweet and the omelette was just okay.  Come here Monday - Friday for lunch and odds are there will be one or two people from my office sitting next  to you.", 
    "review_date": "2006-12-01"
  }, 
  "zpXqbJQ2CT4PsUBTy30DbQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jenny W.", 
    "review_text": "Came here en route to Stinson beach yesterday for some delicious sandwiches.  I had the BLT with avocado on sourdough, we had another one of those, the Parmesan Chicken, which comes served open face with chicken, tomatoes, basil, parm, red onion and pepper, and a San Fran, which is basically a BLT with chicken and a pesto mayo.    I loved my sando soo much! The avocado was super fresh and the bacon was cooked PERFECTLY! It was great and I was even able to get half down, considering the hangover I had.  I ended up eating the other half on the beach, which may have been even better, but a bit sandy :)  It's also priced pretty well. My sandwich was only $5.95, which is alot cheaper than most other fancy sandwich shops.", 
    "review_date": "2009-08-30"
  }, 
  "XJhmTEAJuYRgIP4b9wMcTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mason G.", 
    "review_text": "A cute little shop.  Nice place to enjoy the sun and the peace.", 
    "review_date": "2010-10-19"
  }, 
  "s5S0V3lJKPAgQorv-vxxLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather R.", 
    "review_text": "So, I'm probably more like a 4 star versus a 3 star.  I love the falafel sandwich and everything is good. I wouldn't say it's great, but overall good. If you live in the area, it's a perfect place to stop before or after grocery shopping. I like Café Capriccio better for hanging out and getting coffee but they don't have a lot of food options. Café Francisco has a lot of food options. I haven't tried enough on the menu to give it a 4 star, but I'm willing to keep going. It's also nice to sit outside on a nice day. (It's always hard finding places to sit outside with your dog).", 
    "review_date": "2013-12-12"
  }, 
  "thH24NiYyUeWygMMPZZqhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mm c.", 
    "review_text": "we have been living near this cafe for almost 2 years and we get our coffees here every morning.   the food is consistent no matter who is behind the counter, maybe a little too consistent since they never change or update the menu with the exception of the daily soups. the tables outside are great on a sunny day...so drop by and order their chicken parmesan foccacia.", 
    "review_date": "2007-04-18"
  }, 
  "2zuHAB4nAa0MzFuT3KZqlw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela V.", 
    "review_text": "Cafe Francisco is a great little spot I can go on a lazy morning with or without my son to read a bit and enjoy a cuppa joe.    Last time I was there I splurged and ordered a waffle. Nice big portion, enough whipped cream, strawberries and sprinkled with cinnamon.  It actually was quite tasty and for under $7...can't beat that.     I have to say I love the music they play and they hang art from local artist which is always enjoyable.    Last time my son and I were in, we met the publishers/editor of my son's favorite manga, Naruto, and the editor came back in especially to give my son a new edition.  NOW that was really cool. So again, it's a great spot to chill...you never know who you might run into.", 
    "review_date": "2011-02-11"
  }, 
  "LnrQh8PQYTTV84gbHH7xBg": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Dominic P.", 
    "review_text": "Order the San Fran!!! Grilled chicken, bacon, avocado, lettuce, tomato and mayo/Dijon mustard on sourdough...absolutely delicious!!!", 
    "review_date": "2013-08-22"
  }, 
  "vD65y5E3Az3bFc6UW4G1eA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie G.", 
    "review_text": "This place is so quaint.   It is a wonderful neighborhood spot, and hidden just a bit even though it is really close to the Wharf.  The staff was really knowledgeable of the menu, and seemed to care that we enjoyed our meal.    The Francisco salad was light, and had a wonderful presentation. It was a large salad, so it could easily be shared. The paninis looked tasty too. A cup of tea and some nice people watching if you are able to score a table outside, simply perfection.", 
    "review_date": "2011-12-31"
  }, 
  "l7V5w_vf9xv74As3abZukA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John Eric S.", 
    "review_text": "So glad I came across this place while walking down Powell Street the other day!  The girl behind the counter made me one of the creamiest, best-tasting sugar free vanilla lattes I've ever had!  They have outdoor seating out front one side non-smoking, the other side OK to smoke.  Not sure about other amenities, but seems like a popular neighborhood spot across from Francisco Middle School, since it was full of patrons on Monday afternoon at 2pm.", 
    "review_date": "2008-05-21"
  }, 
  "80nHYr2nC5HFGzggG0jsKQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Becca S.", 
    "review_text": "I work over in the lunchtime HELL known as Pier 39 -- so finding this place is refreshing.   The Mediterranean Plate is the best.  It's a ton of food at a decent price. They don't look at you weird when you get coffee refills, which is nice since on occasion we come to work here in order to escape the office.  And the outdoor seating provides some amazing people watching.    Has anyone every bought a ping pong table from that ping pong shop across the street?", 
    "review_date": "2008-07-14"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 3:03pm/70°F partly sunny  Purpose: Came back from south bay earlier and checking out area. Remembering that this used to be a local hangout back in the days.  Ambiance: Your standard neighborhood cafe with mostly locals. Weekends seems more popular when others nearby are packed to the limits. Some mismatched tables/chairs place throughout. Kids will find it boring as no coloring books or play area for them. Place is outdated with not much of any modern but if you come for the food and drinks you will overlook it. You will really need to know the staff here or else you'll get the stink eye treatment.   Staff: A lady about mid 40's not too helpful when ask for specifics. Seems to like doing things at her pace and time.   Cleanliness: Grade B-, needs some new chairs some are cut and some have unexplained stains.  Eats/Drinks: Fresh fruit salad $4.75 and cappuccino $3.25. Can't say it's good or bad fruit was house made cantaloupes needs to ripen up a little more. Cappuccino decent but strong, scolded my tongue, ouch.  Products/Services: Coffee, capps, lattes, espressos, juice, chips, egg products, vegetarian friendly, sandwiches, soup/salad, fruit bowls/salad, french toast, bagels, waffles, sides, create your own.   Punch Lines: North Beach, schools, library, safeway, TJ's, laundromat, salon, bikeshop, Coit tower, hotels, post office, gym, street parking, muni bus, parks, churches, restaurants, Lombard street, art institute.  Tradeoffs: A local place that carries most of the upper north area but at about 20% cheaper than most. Not too touristy mostly locals. Happy hour drinks are price just right.  Final Thoughts: It's one of those places you go on a lazy Sunday afternoon with paper in hand nothing much to do but sit and sip. Perfect for me to hide from friends as all of them are in heavy foot traffic area like cafe treist. Service is just lacking for my daily visit leave it for the weekends you'll be just fine.", 
    "review_date": "2014-05-20"
  }, 
  "3v-ndkzVeMHNLBGevXwRBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "marisa g.", 
    "review_text": "This place is pretty decent. I think the prices are a bit much for what it is but I really do love the mediterranean plate. It's a lot of food that keeps you full and happy the rest of the afternoon. Plus, the various things that come with it provide a nice variety over a standard salad. I haven't had any problems with rude staff or insanely long waits for food, but then again, I only stop in here for lunch once every two months.", 
    "review_date": "2009-09-14"
  }, 
  "rG2oUhknS48-OwszOZ4d2Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark R.", 
    "review_text": "Just go there for coffee. The food is actually good but their service is straight awful sometimes. If you're super hungry, go to Moe's.", 
    "review_date": "2012-08-03"
  }, 
  "becChstN1Nelt61S8j8exQ": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mike W.", 
    "review_text": "Would be 5*'s if the staff hated their jobs a little less.", 
    "review_date": "2011-01-25"
  }, 
  "jLUx__EwC4DcA2BLkDPLPg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sean W.", 
    "review_text": "I work nearby, so this is often the default lunch place. VERY up and down. The food is pretty consistently decent, but the espresso drinks vary wildly depending on who's mixing . . . the owner does a good job, but the staff turnaround is high, and I don't think they are trained well. There was one guy who always had everything cleaned up and ready to close 10 minutes before they actually closed - he was really grumpy when I would then show up, and he'd then have to make me a latte and  clean up again . . . Dude! Close when your sign says you close, and then clean up! I think he's gone now though . . .", 
    "review_date": "2007-07-23"
  }, 
  "jz0pmRLgJD0QxQggItNv3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandissa L.", 
    "review_text": "Awesome! I've walked by this place a few times but it's so unassuming, didn't figure they'd have good food. Gave them a try since the weather's been nice and they have outdoor seating. Had a Belgian waffle (yeah!) with strawberries and scrambled eggs on the side. Along with a coke, came to 10 bucks. Two blocks away around Washington Square Park, same meal would have easily cost me 20. The waffle was delicious and the strawberries tasted fresh. The staff was nice but left me alone to sunbathe and read my magazines. Much quieter than the more touristy part of NB too. All in all, a great experience, and I'll be back to check out the salads and sandwichs.", 
    "review_date": "2012-04-21"
  }, 
  "YEwiTGW3OdWdLeckDN0zCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Smog R.", 
    "review_text": "Hey Francisco's! I admit I may be positively biased to your establishment since I work near by. I've had your coffees almost every morning which is \"good\" but not \"the greatest.\" I've had your morning bagel, consisting of bacon and eggs, which is pretty delicious too.  Some people seem to think that the the staff is rude or otherwise unfriendly. In rebuttal to that, I like to say that they are not the type to talk random BS and kiss up for better tips, that's for sure.  From your secret admirer,  S.R", 
    "review_date": "2009-10-10"
  }, 
  "haI-qPVLSZQTY8TjhIezRA": {
    "user_rating": 4.0, 
    "user_location": "Springfield, MO", 
    "user_name": "Thomas D.", 
    "review_text": "A \"Mediterranean frittata\" for 7.95 with eggs, spinach, tomato , cheddar and feta cheese arrives after 5-10 delightful minutes in the cordial ambiance of this cute north beach gem. The plate came with 4 pieces of whole wheat toast, orange, grapefruit and a side of diced tomatoes, cilantro and onions. As for the frittata, it was baked and still sizzling upon arrival at the table. The sizzling seemed to compliment the big-band sinatra-ish background music. The eggs and cheddar were slightly golden, and sat on top of a layer of feta and onion over a bed of tomatoes followed by spinach. The feta being in the upper layer melted into the lower layers, infusing a cheesy chewy texture which provided contrast against the spinach and tomatoes. If had one complaint, it was only that I do not remember them asking me what type of toast I would like!", 
    "review_date": "2012-01-02"
  }, 
  "w6SaPljfM2KfW9guNXCkGA": {
    "user_rating": 4.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "Meagan C.", 
    "review_text": "Never had food from here, but the lattes are creamy and delish. I sometimes stop by before work and the girl working the counter is nice and pretty quick. Nice neighborhood spot.", 
    "review_date": "2010-11-12"
  }, 
  "Qtvx4lcMkgzwOS15pfB3uw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie C.", 
    "review_text": "I work nearby and when I first started going here, I loved it...but as time went on, the lil cafe seemed to know they were not in danger of being taken over by a Starbucks and things began to slip.  \n  The staff seemed to change every month and the coffee got worse and worse.  The prices also soon went up and the quality went down.  $10.00 for a lox bagel at a lil walk-up cafe?  Or for 2 eggs and toast? (no potatoes)  Come ON!  The manager does pace around a lot like he is the bouncer of some hip club.\n  This used to be my favorite lunch spot but now I only go there if I am tired of the other local choices.  Please bring back the old Francisco's!", 
    "review_date": "2006-08-31"
  }, 
  "4oYtXfZuWsCo3hKQqm_EqQ": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "I B.", 
    "review_text": "I work around the corner from Cafe Francisco and have been here twice for lunch during the week. I've had both the Mediterranean and Caprese salads which were both tasty. The atmosphere inside the cafe is warm and there are a few tables set up outside to soak up the sun's rays while sipping your afternoon latte. I'm giving this place 3 stars only because there's really nothing special about Cafe Francisco that would make me return, aside from its close proximity to where I work.", 
    "review_date": "2008-08-05"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Spent a relaxing afternoon here where the rating got better with each dish. Started with a three stars parfait (nice amount of fruit, but the yogurt was a little bland), next came a three and a half star latte (nonfat milk and sugar free vanilla syrup were great, not so much the $0.85 charge for the latter) and I finished with a five star sandwich (turkey on wheat, made all the more delicious with no charge hummus instead of mayo and a side of fruit).  Food alone is probably closer to three stars, but they earn a fourth star with free wifi, outlets, a corner location perfect for people watching and very friendly and welcoming service (letting me open a tab, asking if I wanted anymore substitutions on my sandwich since I declined cheese and avocado).", 
    "review_date": "2009-04-26"
  }, 
  "MsYxOCzVrVMw4FRdCd8hwQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack E.", 
    "review_text": "I eat here fairly often as I live close by. Breakfast ranges from good to mediocre, sandwiches are better. In general the service and quality of the food really suffers on the weekends - the guys who work there then can't scramble an egg without burning it!  Most people are here for the location and good coffee and selection of drinks. You get a good crossection of locals who go to the place.Free wifi is a plus.", 
    "review_date": "2010-09-26"
  }, 
  "ngnVgB8w-oobiV39HeXFFg": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jean R.", 
    "review_text": "Nothing special . Had parmesan chicken sandwich and iced tea after a long walk in fishermans warf. The location is the best part of it. It is in a quiet corner of powell street close to pier 39.", 
    "review_date": "2014-08-11"
  }, 
  "yfq4INlwaC8dyX6tpwSqrw": {
    "user_rating": 4.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Dee H.", 
    "review_text": "Honestly this is probably the best place to go for lunch in our area.  The service is a little slow, but on a nice sunny day it's nice to sit outside, people watch and take it all in.", 
    "review_date": "2012-06-09"
  }, 
  "byUZpVzun-vVMMCFMXvdXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriel R.", 
    "review_text": "One of my favorite neighborhood spots and a place where the community truly comes together. I love their coffee, food, and the atmosphere and have made many friends and business connections here over the last few years I've lived in the area.   The space has high ceilings and large windows which flood it with light. There is outdoor seating too which is one of my favorite things for eating, drinking, and people watching. If you want to get out of the house and work then use their free wi-fi, I have used this place as a local office on many occasions. The portions are always very generous and the food is consistently fresh.  Great location. Great food. Great people. Great place.", 
    "review_date": "2012-01-18"
  }, 
  "UJ5qM0e5-S_K3G6kN0839Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassandra B.", 
    "review_text": "During a long walk around the financial district, through North Beach and then towards North Point, we stumbled on this little place on the corner. At first I assumed it was going to be like every other cafe/coffee shop in the city with a bunch of bagels and espresso. It was better--the menu boasted plenty of breakfast items, deli sandwiches and salads, and beer and wine. The best part is that as soon as we walked in the door, the man behind the counter actually greeted us--eye contact, smile, and the actual word \"Hello!\" Sad to be shocked that this simple act sets places apart for me here in the city. We ordered a sandwich each; I did the pastrami special and my friend ordered the falafal sandwich...when a tiny fruit fly landed in my wine (it was a beautiful day and their front and back doors were open), they happily replaced my glass. The portions were ample for the price and the cafe has a nice, light local atmosphere. I will come here again when I am in the neighborhood and hungry for basic, common courtesy and a good lunch.", 
    "review_date": "2011-09-04"
  }, 
  "OQImub6evGiBTwpQmoVUjA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jess S.", 
    "review_text": "These reviews are all over the place, with one slamming the food right before another praising it.  I think the problem boils down to *service*.  If you're lucky enough to go when some of the best employees are working, they will make sure that your experience is great. The rest of the time, you'll be disappointed.  It's a tough place to go with expectations!  Staff turnover here is really high, which isn't always the owners fault - some folks work here planning to be short timers.  Heather (the redhead) used to be great, but I think she's gone walkabout in Australia for a while.  Grumpus-in-the-morning never smiles, but the coffee is always fresh and hot and she's efficient at keeping the line short during the morning rush.  But the two boys in the afternoon are slobs and a bit lazy - once I went in late in the day and *every* coffee dispenser was empty; they just hadn't paid attention to keeping them filled!   So, with all of that in mind, I do love to come to Cafe Francisco for a cup of coffee, to grab a newspaper, and watch the world go by.  There's no better place north of Washington Square to do that.", 
    "review_date": "2007-01-03"
  }, 
  "8SUuSxLr83YLi9o7G05OQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan W.", 
    "review_text": "Outstanding establishment for breakfast. Friendly employees, very cool decor and delicious breakfast and specialty coffee. Loved this place!", 
    "review_date": "2015-01-08"
  }, 
  "mOnYWi_51_RfEuDhAW0ddw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R L.", 
    "review_text": "Decent place for breakfast or lunch.  Not sure where they get their bread from, but it's really good.  Sandwiches and soups are the best option here.  I've tried the salads, but haven't found one I actually like.  Fritatas are good also; they take a bit longer to make, so don't order one if you're in a rush.  Lattes are OK.", 
    "review_date": "2013-03-12"
  }, 
  "m0dgIHWg8M8C5GAZQHK6rw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cathryn C.", 
    "review_text": "I'm giving it 5 estrellas because I've never had a bad food experience.  I recommend the Francisco style bagel with lox.  It's the Zeus of bagels.  If you like salad, try the mediterrean plate salad.  For sandwiches, I highly recommend the parmesan chicken and the tuna melt.  Yum!", 
    "review_date": "2008-06-15"
  }, 
  "pVP3VrkakypLrCZgIAM3Dw": {
    "user_rating": 1.0, 
    "user_location": "Folsom, CA", 
    "user_name": "Isaac K.", 
    "review_text": "My significant other and I went to this cafe and received terrible service at the counter. The young man taking our order was obviously not paying any attention, more interested in twirling his pen and dropping it, than writing anything down. He needed to be told the entire order again when he went to the register to enter it. One of our selections was an iced coffee drink, to which he replied that they were out of ice but it was on it's way. We said that was fine and we would wait since we were eating there. We finished our meal, which was mediocre at best, and no iced mocha. We went to the counter and asked and the guy about the iced mocha and he obviously forgot about the drink. I had seen their co-worker bring in the ice more than ten minutes earlier and they had already made multiple iced drinks for customers just arriving. Maybe they were just having a bad day, but it was pretty bad.", 
    "review_date": "2014-07-20"
  }, 
  "khCZ8jR0m8gJlDkI0aRU4Q": {
    "user_rating": 4.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Monica T.", 
    "review_text": "This place always has fresh produce &amp; yummy ingredients.   Friendly staff too!  I've had some of their specialty salads as well as a few sandwiches -- the open-faced Parmesan Chicken sandwich with pesto was delicious!   My biggest complaint is that they're always out of ingredients.  For example, I've never once been there when they still had focaccia bread, but I tend to go there to grab some dinner, so I guess they're more prone to being out then.  Overall, good place, good service.", 
    "review_date": "2010-11-05"
  }, 
  "E_lD-5N1EDXtyvZBDrDN_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aimee W.", 
    "review_text": "I LOVE LOVE LOVE LOVE this place.  The food is always great and so reasonably priced.  I also love the fact that it's a block away and a spot unknown to all the tourists down at Pier 39.    I always order the tuna salad sandwich, and my boyfriend consistently gets the BLT (they never skrimp on the bacon).  The salads always look amazing, but I'm too hooked on the tuna to order anything different.    The food comes out very quickly, surprisingly since the place is so small.  I tend to stray away on the weekends because the experience is ten times better during the week!", 
    "review_date": "2007-06-13"
  }, 
  "wycAo6D84D3fVOCN4iiFqg": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Suzannah F.", 
    "review_text": "This place is by far my favorite place to grab a bite or a drink before work. The hidden gem of the area, tucked away from the riffraff of the fisherman's wharf/pier 39 crowd, they have a great menu of exciting flavors, ranging from savory breakfast frittatas to rich soups and fresh, flavorful salads. Their soups are by far my favorites, they are constantly changing, and are always my go-to no matter the weather or time of day (butternut curry, red pepper Gouda bisque, Mediterranean veggie, Thai chicken basil, I'd go on but now I'm drooling).  Highly, HIGHLY recommend stopping by anytime for a sandwich and a coffee or a beer, have a sit and enjoy the great location, friendly staff, and, above all, amazing food!", 
    "review_date": "2014-06-09"
  }, 
  "pAt8kCOmrCwF7U8yOo1Pkg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Missy L.", 
    "review_text": "I really like this little place.  The food is always fresh and the portions are very generous.   I tend to like Mediterranean food so I usually opt for the salads with feta and olives but I had a cured salmon appetizer that was very nice.   The only negative is that the food sometimes takes a while, so might not be a good place to stay and eat if you are limited for time.  Oh yeah, also, they serve beer and wine but both the red and white wines were way too warm the few times I've had them there.  Just as well, trying to cut down.  UPDATE:  I just learned that their health inspection scorecard is not so great.   Not terrible, but not good.  I have to deduct a star as cleanliness is very important to me.", 
    "review_date": "2008-12-07"
  }, 
  "odM7WqRsORcMsFymWEMiAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric H.", 
    "review_text": "A damn-good felafel sandwich, if I may say so.  Well-prepared, and very well-presented (if a little messy, because of all the tahini.  But what tahini it is!  It's probably the best I've had in San Francisco!).  The felafel sandwich here is actually PRETTY TO LOOK AT.  Imagine that!  If they served this on lavash instead of pita, I think they'd have a real winner (Wouldn't be as pretty, though.  Also if they offered some sort of hot sauce for us folks who like our felafels spicy, it would be great.  And an option of adding hummus to the sandwich...)  I must confess, I'm a bit curious about their EIGHT DOLLAR EGG &amp; CHEESE CROISSANT (Yes, that's right, folks: EIGHT DOLLARS!  For eggs, cheese &amp; bacon on a croissant!), but my common sense prevents me from going through with it.  I mean, what's in this thing to justify such a ridiculous price?!!  Is it sprinkled with GOLD DUST or something?!!!  Can someone please inform me why this sandwich is so incredibly expensive?  Usually, the high-water mark for breakfast sandwiches is about $5, so this WAY surpasses that.  Maybe one day I'll splurge, just to see.  But I'm Vegetarian, and don't eat bacon, so it's even HARDER to justify that price!  I can't imagine them selling very many of these...", 
    "review_date": "2008-06-05"
  }, 
  "m6p5knAyIS79s6WNbeIdGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen E.", 
    "review_text": "I went to Cafe Francisco on a whim yesterday looking for a cafe near my house. I had heard a little bit about this place from friends but had no idea what I was getting into...  My friend and I checked out the menu and ordered the Mediterranean Plate and the Greek Salad. We grabbed a cute little table outside and shortly our feast arrived. Both plates were filled with amazing Greek treats. You name it, we had it on our plates. I have never seen so much food piled high on two plates. We even received side plates with pita and fruit on them after our huge main plates. We left painfully full, but will definitely return again.", 
    "review_date": "2010-03-24"
  }, 
  "9iuFId7D6IIh0uttlYotcA": {
    "user_rating": 1.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Shab A.", 
    "review_text": "Today we bought two cups of juices that they said were \"freshly squeezed\", but they were some Minute Maid juice u can buy in shops. and the wireless Internet wasn't working. We left the place right away!", 
    "review_date": "2011-04-03"
  }, 
  "PHnLOMJagYK15VpD4UT2Fw": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Jarrod J.", 
    "review_text": "Nice little spot. They make good coffee, and serve beer as well. Outdoor seating is a bit limited, but on a day like today (New Years) it wasn't very busy.", 
    "review_date": "2015-01-02"
  }, 
  "LEXK_zrIgJyDw6xY8a1eGA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Christina S.", 
    "review_text": "When I lived nearby, this was one of my favorite little spots. It's the kind of place where the food is so-so but the sodas are cold and cast-off newspapers always abound. You can't really go wrong, whatever you choose from the menu. In all honesty, though, whatever you choose from the menu, they're bound to be out of at least one key ingredient.", 
    "review_date": "2006-07-05"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "Local breakfast/lunch place for good coffee, salads, omelets and simple, healthy sandwiches.   Opens early and closes early/around 5pm.", 
    "review_date": "2010-08-10"
  }, 
  "P2om25pUTgJjatQYCyFaFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kayla M.", 
    "review_text": "Great breakfast. Not a huge selection but what they do, they do great. I love the Francisco bagel. Mediterranean frittata is good too and comes with yummy sourdough toast and sliced grapefruit. Perfect breakfast. Great little local place.", 
    "review_date": "2014-06-29"
  }, 
  "EwRbT2_nkVkpxouNGjJkjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mario G.", 
    "review_text": "Let's admit it. There are few places in this area to really eat. So when you find one that carries a Pseudo-Parisian while it offers you breakfast, lunch, or misc with the possibilities of wine, you have to look deep down and ask:   \"Why wouldn't I want to experience this considering the part of the city I am in?\"  Once pondering this deep thought, you will rise and have at the opportunity of a wonderful Mediterranean Plate or French Toast to make you feel like you are a part of something bigger. That's Cafe Francisco for you, a place where you can be a part of something bigger than yourself.", 
    "review_date": "2009-07-10"
  }, 
  "Qzz49HgnsRDYAIguj_0Nuw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "There is great food here, very nice employees, and a great location.  I very much enjoyed my bagel and hot chocolate.  Great place to take the grandchildren on a Sunday morning - their reviews are above.  Hadn't been here for a while, still a relaxed, non-pretentious locals place with good drink and food, a hidden gem as other reviews say.  Bob, Ronan, Lila", 
    "review_date": "2014-06-29"
  }, 
  "5j0QmE-ktdY2wfEYX2YStA": {
    "user_rating": 4.0, 
    "user_location": "Otford, United Kingdom", 
    "user_name": "Amy W.", 
    "review_text": "you can sit by the window with a hot cup of frothy coffee ..... and a book people watching or immersing yourself in what you have bought to read. The food is generally pretty good .. the pancakes are delicious... the french toast was just a bit tooo sweet for me !   I think what i really like about this place is the unobtrusive feel it has to it. Very similar to a european cafe.   Some staff are better than others so if you have weird service the first time dont let it put you off.   There are also tables outside for when the sun is shining.  mmmmmm!!! pancakes", 
    "review_date": "2006-11-14"
  }, 
  "_OCVA417JevjE1ifcftgIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "V P.", 
    "review_text": "This cafe is pretty quiet and good for studying if you have lots of school work like me! They have Free Wifi, reasonable prices on their coffee and sandwiches. I tried the Tuna Melt and Grilled Chicken Francisco. It's a quiet cafe for reading/studying unless a group of loud people come in of course.", 
    "review_date": "2010-05-03"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "I really enjoyed my time at Cafe Francisco. I went there last week on a lunch date and had the Turkey Club sandwich. My date had the omelet and it looked incredible! I will say the cheese wasn't thoroughly melted in the omelet though. I had no problems with my sandwich. The atmosphere was bright and the tables spaced out with plenty of room if you wanted to bring your laptop in, which they provide free WiFi FYI. I definitely will be back here to study!", 
    "review_date": "2009-03-05"
  }, 
  "IzwmPPTifb-_GtYRGszgtg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blair S.", 
    "review_text": "Once upon a time this was a great place. Really good Greek salad, good breakfast bagel, decent sandwiches. Then about a year or two ago the owner seems to have disengaged so it seems mostly unmanaged. Also, the quality of the ingredients has been declining --for example, said Greek salad use to feature chicken breast. Now it's BK style manufactured chix-strip-meat-parts. Gross. We stopped going there, but the tourists seem to keep them going. Such a bummer.", 
    "review_date": "2014-09-27"
  }, 
  "L4Hr0C6mulgQoY_1zqw84w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karla S.", 
    "review_text": "This place just keeps getting better!  They continue to introduce creative new food for us foodies, and their display of new art from up and coming artist simply add to the great atmosphere.  I highly recommend this place for the food but it's also great in the early evening for a beer with friends, especially during their happy hour between 4:00 and 7:00.", 
    "review_date": "2010-10-05"
  }, 
  "zT5Wc4eIMThDP_EAQGK4mg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg G.", 
    "review_text": "Very great little neighborhood cafe run by very nice people.  Breakfast there is outstanding although for me it is my lunch place.  Their San Fran sandwich is really tasty and the med. plate is one of my favorites.  On nice days, it is a real delight to make use of their outside tables.  It just a little bit of Parisian cafe in my neighborhood and I love it.  It also has internet service. Greg", 
    "review_date": "2011-12-21"
  }, 
  "GvMQfrr0GaGB9C2FxIGlxQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria B.", 
    "review_text": "Very nice place. However, a sandwich with fresh mozzarella on it does not - I cannot emphasize this enough - does not have to be warmed!!! You may toast the bread, if you are so inclined, but I do not need my beautiful mozzarella melted. I want it fresh and cold, not warm and greasy, period.", 
    "review_date": "2008-04-08"
  }, 
  "O2_9--VOPyvJvDJkbgC9OA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason K.", 
    "review_text": "When I was first looking for an apartment back in July 2009, I was at a place around North Beach and wandered into this little cafe.  It was perfect since I was looking for just a quick sandwich for lunch.  I got a Wild Turkey sandwich and it was great.  The smoked turkey was moist and flavorful and the avocado was nice and fresh.  The sourdough bread completely made up for an otherwise shitty weekend.  I also had their freshly squeezed orange juice which was amazingly sweet with just a hint of tanginess.", 
    "review_date": "2010-03-08"
  }, 
  "aJbXWA8OuA4mx0B67dXwNw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna b.", 
    "review_text": "I love the building, but on several important fronts it doesn't provide: the food is so-so, the coffee is so-so, it takes forever to get your order, and there's no wi-fi (last checked July 05)", 
    "review_date": "2006-06-08"
  }, 
  "7qRQdWck6ZWTGzW7TNeDiw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole C.", 
    "review_text": "Food is good, coffee is meh. Seems to have recently raised the prices.", 
    "review_date": "2014-06-01"
  }, 
  "gi3VkcISbUpd0BQ68FerAQ": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "John S.", 
    "review_text": "Save the time and walk another block to Capriccio.  Used to go here a lot for brunch but the omlets took a turn for the worse... barely cooked through with cold cheese in the middle.  Plus the last few times I went coffee and espresso tasted ridiculously burned.", 
    "review_date": "2011-09-07"
  }, 
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "A hidden gem.  Tucked away from all of the hustle and bustle of the Embarcadero and Fisherman's wharf, I would like to consider this my escape.  When I first relocated to SF from the East Coast (Nashville, to be exact), I resided with a friend of a friend in the brewery converted Condominiums that are located next to Cafe Francisco for a couple of months.  I finally found my own apartment and my life in SF began in Lower Russian Hill (near Ghirardhelli);yet, I'll never forget Cafe Francisco.    My first MOCHA and chocolate croissant experience was here.  MMM...delicious.  Plus, this place makes really tasty sandwiches (regular and breakfast).  A couple of years ago I brought my then boyfriend to Cafe Francisco during an urban hike we sat outdoors, drank a beer and we had a discussion about love, college days, and beer.  Aw.  Alex, if you ever read this, I still think fondly of that day spent with you.  To all single ladies out there, I hope that you build moments like these throughout the city.  SF is made for love!  -- H.", 
    "review_date": "2014-03-17"
  }, 
  "f6DEiAQAKywJuF_7GbWIAw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick M.", 
    "review_text": "The service here is unbearably slow. I've been here twice when it wasn't busy and waited almost thirty min for a breakfast sandwich. Definitely not worth the wait.", 
    "review_date": "2013-10-09"
  }, 
  "tHFCCybLhPa5W7Z5A-dOLw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A T.", 
    "review_text": "i come here when i dont know where else to eat, probably like once a week... lots of bad things - i dont like the coffee they use, im always \"too late\" for french toast but they still offer me waffles (which are not good btw). why can you make waffles but not french toast? they charged to pour an americano on ice which is pretty dumb, the girl who i think is the manager has an attitude problem and most of the time is pretty rude even after tipping. seriously not that hard to smile or wait to roll your eyes until i turn around. they also have a fruit fly problem.   good things - its cheap! the garden vegetarian sandwich is good. not good enough to make all the bad stuff better. after my last visit i realized im never eating there again.", 
    "review_date": "2013-08-02"
  }, 
  "m5cBT7OYfn0HM0d-RCsdZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miika M.", 
    "review_text": "I try not to hang out that often in the highly populated tourist traps.  There are many reasons as to why I prefer not to wrangle my way through a bunch of tourists and other unmentionables that clog up the sidewalks in their elastic waistbands and overly done up hair.  Gone are the years of loitering about with locals in unblemished spots of respite.  I do, however, enjoy the occasional bombardment by Italian or German tourists at the local noodle stop.  What can I say, I am biased, especially when the Berlin &amp; Beyond Film Festival is in full swing and the Castro runs rampant with cuties and their fabulous accents.  When guests arrive from out of state or abroad, they mention the several strips that are long feared by locals (Fishermen's Wharf, Ghiradhelli Square, Union Square) and I am swayed in hosting them to a nice walk: me with my camera and my wards with their eagerness to explore.  Café Francisco has saved me many a time and on top of their great Breve lattes, that keep me comforted during the cold evenings, the lack of pretentiousness and down to earth ambiance seduces from the sidewalk.  For the less fortunate in this struggling economy?  The prices are a welcome sight.  My usual purchase of a toasted bagel with cream cheese and jam takes an easy $5 out of my wallet.  Here, only $3.  When my friends visit, this is the easiest place to stop and take a quick respite, especially if you elect for their Belgian Waffle, a fantastic colorful display of fresh fruit topped off with a mound of whipped cream.  And for a mere approx $7.  We were not in the mood for larger plates, but for the so inclined, they also serve omelets, soups, and sandwiches, all for under $10.   The staff here are friendly and quick to respond to requests, no matter how trivial, and remember to take a moment to check out the art.  They host art exhibitions and when I need a moment, losing oneself with a great cup of coffee amidst creativity adorning the walls is a willing surrender.", 
    "review_date": "2011-01-17"
  }, 
  "-21cwFKEb2LsotmcB6U0JA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lothar P.", 
    "review_text": "Cafe Francisco is a nice neighborhood  spot.   It is a good 'go-to' for basic food like sandwiches, and quick breakfast foods. It lacks the 'make everything gourmet' that is so common in San Francisco, but it has excellent pricing. This makes it a place that you can get more than what you pay for.  Worth a weekly visit for neighborhood dwellers and passers-by!", 
    "review_date": "2011-10-29"
  }, 
  "TiLMZ3Cqr3X0UQS-s_Ls4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diane B.", 
    "review_text": "I'm not the only reviewer who has \"stumbled upon\" this place and was consequently very pleasantly surprised. In addition to being located in a corner of the City I have not yet experienced (and am very much looking forward to experiencing more!), Cafe Francisco also delighted me because:  * True to its name, it just *feels* like Classic San Francisco circa turn of the (previous) century: old wooden paneling reminiscent of chowder houses, antique-designed bathroom signs, tree-lined brick-filled street and proximity to Coit Tower. I almost expected the fresh fish catch deliveries to be in the back.  * It has very friendly staff *and* patrons. During my visit, an 80- (or 90-) something man came in to order a glass of wine and a customer looked out for him, asking me to have him step in front of me. How could I refuse? He was adorable! He took a lot of time ordering and chatting...subsequently adding a feeling of familiarity, warmth, community and history to the already historically-ensconced environment.  * Its menu is definitely ample, and my selection was perfect: what else to order but The Francisco Salad, replete with greens (spinach, tomatoes &amp; artichokes) and protein (avocado, feta and chicken which I used to replace the bacon which normally accompanies this)? All of this topped by a beautiful basil leaf and accompanied by lightly-toasted wheat (of course) sourdough with a tasty strawberry &amp; pineapple garnish. Delishhh.  A few nits: the coffee was just sort of so-so, and there is only one functional power outlet (and this was hogged by a less-communal patron...he also had a Mac though, so I empathize). But: there is free wifi!  I'd definitely consider returning here on my next romp in this historical, quaint, sunny part of town.", 
    "review_date": "2010-05-14"
  }, 
  "i8_CmYRkxXDWOEFzvrGL0w": {
    "user_rating": 3.0, 
    "user_location": "Santa Maria, CA", 
    "user_name": "Megan C.", 
    "review_text": "I love their soy lattes, it's what keeps me going back, probably one of the best in the city. Unfortunately, parking is a nightmare in north beach, and the girl at the register either hates people or hates her job. I've never seen a smile or a greeting for that matter. So i try to get in, get my coffee and get out as quickly as possible.", 
    "review_date": "2009-02-05"
  }, 
  "WtDdZoi5HDxFUb3vvbk_1w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "ji k.", 
    "review_text": "Cool little cafe near north beach and pier 39. They make great medit.food (salads are awesome) and sandwiches are yummy. Cool crowd. Nice location and decor. Not too expensive.", 
    "review_date": "2005-04-19"
  }, 
  "Ai_CaCqTCAbyDI0N_8-2Zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Siobhan B.", 
    "review_text": "I LOVE this place!  The food is fresh and the coffee not bitter at all.  They have outdoor seating and the owner is very friendly.  Not much of a wine selection but they do have wine and beer.   I live in the neighborhood and it is a great place to meet with friends. I recommend the caprese and wild turkey sandwich!   If you do sit outside choose the two by the front door the ones along the side can be a bit noisy with the traffic.", 
    "review_date": "2011-07-26"
  }, 
  "zzynnrPsaMIbbBIfHZsaLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin G.", 
    "review_text": "Great place to grab coffee while waiting for the bus. ALSO, amazing smoked salmon bagels with... CAPERS!! Very cute place to have a nice relaxing time.", 
    "review_date": "2011-11-05"
  }, 
  "ZtmeHAQyNFku338dJMIfTg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "I'm annoyed that you don't put your hours on your website.  Aren't I much more likely to visit your website to find your hours than to read about how you \"periodically\" do wine and cheese tasting events?", 
    "review_date": "2008-04-14"
  }, 
  "azADTxWlsnPb3lJe2gnM8g": {
    "user_rating": 5.0, 
    "user_location": "Schenectady, NY", 
    "user_name": "Kira M.", 
    "review_text": "What a gem. Free wifi, friendly staff, the freshest ingredients and the best Greek salad I've ever had. Everything was excellent: salads to sandwiches to breakfasts. The Francisco Bagel and California frittata are great breakfast choices.", 
    "review_date": "2014-10-03"
  }, 
  "kUSYOi3eLzOfxhlwbE2UFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leah A.", 
    "review_text": "One of my favorite lunch spots around.  Almost always get the Garden Vegetarian sandwich or the Mediterranean Plate but their other sandwiches &amp; salads are good too.  Once I sampled a bacon egg sandwich that was pretty darn tasty.  Good food, good price &amp; wine too :O)", 
    "review_date": "2010-02-19"
  }, 
  "RDwtc_cVB9CYOXCubqLXvw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arion O.", 
    "review_text": "Great food and friendly workers!", 
    "review_date": "2012-06-03"
  }, 
  "_V1AMsmtNwhcb6I9e8HfCA": {
    "user_rating": 4.0, 
    "user_location": "Camas, WA", 
    "user_name": "Chad L.", 
    "review_text": "Excellent lunch. I had a group of 6 and we were looking for a place that had a little variety but quality sandwiches. The bread was good. The sandwich construction better. Definitely worth a lunch stop.", 
    "review_date": "2009-11-20"
  }, 
  "vatGxID8GQeM1v6224EhOw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Foodie D.", 
    "review_text": "Very good place for lunch! I've had the French Dip and Chicken Parmegan and both were above expectations!", 
    "review_date": "2011-08-11"
  }, 
  "Q-rcjUuCurPsFxe5OcHVmw": {
    "user_rating": 4.0, 
    "user_location": "Edmonds, WA", 
    "user_name": "Just Y.", 
    "review_text": "(3.5 stars)  In the mid-90s I used to come here every once in a while for coffee and/or desert.  I liked both then, and apparently I like both now, although now I can throw in a liking of their sandwiches and soups.  Very fresh, hot, looks good, tastes good, and very well priced.  I couldn't help but wish I worked closer so I could frequent for lunch more often.   I always thought they were located in a somewhat strange location, but when the weather is nice, windows open, and tables all outside - very relaxing place to hang out, eat, read, Wi-Fi, etc.  Did I mention they had beer?   Makes it just perfect for a morning coffee/pastry pickup and a late lunch stop on the way back.", 
    "review_date": "2009-02-18"
  }, 
  "I-02Mz45H7siHsjjgVxPgQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Richard G.", 
    "review_text": "Came here one morning, slightly hungover after crashing out at a friend's house not too far. I ate here almost a year ago and from what I recall this place is great. I had pancakes &amp; eggs I believe. I still remember how fluffy the pancake was. I plan on coming back here again real soon and will definitely update my review...", 
    "review_date": "2011-06-16"
  }, 
  "lCRntv4-tXaM052bYxmCyA": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Helene K.", 
    "review_text": "This is one of many neighborhood cafes in the North Beach/Pier 39 area. The atmosphere is personal and cozy, though, so many loyal customers go and sit for a couple of hours reading or chatting with friends.  The service is quick, the food is always fresh and very generous on the portions. There's a touch of fresh pepper on many dishes, which adds just the right amount of flavor to the dishes. My top picks from Cafe Francisco are the San Fran, Garden Vegetarian, and Roast Beef Tuscany sandwiches, and the Francisco and Greek Salads.  Breakfast at the cafe is also very enjoyable; the omelets are all very tasty and filling. They recently added new special omelets, which I have yet to try but I anticipate doing so.  I highly recommend this cafe for those looking for a quiet \"getaway\" in the busy tourist area of North Beach/Fisherman's Wharf.", 
    "review_date": "2007-09-17"
  }, 
  "SKC5O-Hs2V2oCxT2z5gTxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "don h.", 
    "review_text": "What a great place to hang out and have a bite to eat. I am starting to write reviews on the places I really did not want people to know about but since the economy is in the tank I feel people need to know about places that have great service and are a great value as well.   I have to say that Cafe Francisco has what i think is the best damn Club sandwich in San Francisco. They also make a mean fallafull as well. Great coffee and so many other food choices it was time for me to share this one.   Every year the owner has a 4th of July party that he invites everyone who lives or lived in the neighborhood to. I lived down here and worked down here for a few years. i love this place and I wish I didn't need to tell people about this one, but it seems that the ones I love are being found any ways.", 
    "review_date": "2009-08-05"
  }, 
  "Cb9G5hXhwDSoLJCsHOVSuw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandro K.", 
    "review_text": "I love this place. I come here quite often. Food is perfect, staff  is great, location is the best! you can work here, check email, read book, relax or just meetwe friend.  I dont think this place has anything to complain.", 
    "review_date": "2014-07-03"
  }, 
  "qNtVmQVjxa2_UICPOWXcKg": {
    "user_rating": 1.0, 
    "user_location": "Carmichael, CA", 
    "user_name": "Magda V.", 
    "review_text": "Filthy, filthy, filthy!!! When one looks at the espresso machines' steam wand, its all white and not from nice and shiny plastic, but rather an accumulation of dried up milk, over the months. The floor is covered with food,(a feast for any rodent), and the tables are so sticky they leave an imprint on the clothes. Then to forget all you have just witnessed, you looks out the window, only to get depressed even more by mistaking the filthy windows for another foggy day in the city. Frankly, I don't know why the health department hasn't shut them down.", 
    "review_date": "2010-09-21"
  }, 
  "SVZd1yDSbXdYfocu-4qkzQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sean C.", 
    "review_text": "Love these guys.  Good food and the service is the best I've had in a long time.  Perfect place to have just down the street from where I live.", 
    "review_date": "2011-09-18"
  }, 
  "HzIMOKhU5Lm-lUxAOWiHqw": {
    "user_rating": 5.0, 
    "user_location": "North Beach, CA", 
    "user_name": "Trish S.", 
    "review_text": "Love the breakfast, the staff are really nice; try the frittata. it's amazing :)", 
    "review_date": "2011-08-17"
  }, 
  "t9e9-sMgkg0DhNHzstc1Ww": {
    "user_rating": 3.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Aaron B.", 
    "review_text": "This place is not a cafe in the traditional sense, but in the expanded sense of a sandwich shop, that also has some pastries and an espresso machine.  Seeing as how coffee was not their strong suit, I decided to get a sandwich.  Well it turns out that the tuna melt comes as an open-faced sandwich.  The toast was burnt on the edges, but otherwise is was delicious: fresh basil and tomatoes topping a healthy portion of swiss cheese and tuna salad, baked on some rather mediocre bread.  Completely filled me, was delicious, and cost under $8.00.  I think that makes this place a gem since it's easy walking distance from the touristy nightmare of Pier 39.  The place also has free internet, but it closes early (7:00pm everyday), so it's not much use as a cafe, but probably great as a lunch and snack spot if you live/work around here.    The ambiance, however, is crap.  Dirty old tables, lame music, and the workers are yelling and banging stuff constantly.  These problems with the environment cost them two stars.  I mean, it's set up like a quiet little deli on a quiet street corner with light (lame) music, but it's like a New York subway in there just because of the noise made by the people behind the counter.  Not conducive to anything pleasant.  If they fixed that (i.e. learned manners and common sense on running a place that's comfortable for customers), then place would be great!", 
    "review_date": "2011-07-29"
  }, 
  "OtscLqgjVKfNbMwQcq76kw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Mini A.", 
    "review_text": "OK--this place has fine food for a good price. But really I come here for the atmosphere and it doesn't hurt that the food doesn't drive me away. Good looking salads, nice sandwiches. Just a great neighborhood hangout. The music is not obnoxiously loud. They have wifi. Great sunlight. Beer and wine if you like. A great place to hang out.", 
    "review_date": "2012-04-21"
  }, 
  "InjOraAe16Eoi1_lIcYq2g": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "tim h.", 
    "review_text": "These guys have been back in action for a while! I meant to update sooner, but, hey, I'm a busy guy. Everything from sandwiches, salads and soups are as excellent as ever. I'm so excited! Another lunch stop to rely on, phew.", 
    "review_date": "2014-04-02"
  }, 
  "yiRZCGwzebRM5mnLpYfFqA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen S.", 
    "review_text": "i love this super neighborhood joint. and i can't believe the FRITATTAs are not mentioned more often. it's SO good. i always think about coming back and getting it. they can be a little slow but its not horrible. this place is great to catch up with friends or to do some work or study.", 
    "review_date": "2014-01-29"
  }, 
  "G1QCbj-a_vciRvCyqZlgCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yasmin K.", 
    "review_text": "This place is comfortable, tasty and has a great, friendly atmosphere. Ziad is top notch and is such a warm and welcoming person leaving me to have no complaints about the cafe.  Keep up the awesome work Cafe Francisco.", 
    "review_date": "2008-12-14"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "Now that Jamie W. and I strap on our Fitbits on weekends, we like to stroll from SoMa to Fisherman's Wharf and back just to see how many thousands of steps we can put on them. For some reason, Jamie always has more steps on his Fitbit which seems cruel and unfair since I walk as much as he does, probably even more because I'm way shorter. When I'm not busy being bitter, we find places new at least to us to park our keesters for a spell. On the way back on Powell, we stopped here since it just seemed inviting before going up that treacherous incline to Washington Square Park. OK, it's not that treacherous. It's not even that much of a hill. We just wanted a Diet Coke and maybe something to snack on before counting our steps again.  There's quite a selection of salads and sandwiches served here. Also a lot of tables occupied by people working on their MacBook Airs (or is it MacBooks Air?). We were able to snag a booth and split the $7.95 Greek Salad, which turned out to be quite a treat with fresh hummus and dolmas added for good measure. There were lots of other fresh ingredients - garbanzo beans, artichoke hearts, roasted red peppers, olives, cucumber slices, tomato wedges, red onion, basil leaves, and feta cheese of course (see photo). It was an unexpected cornucopia of goodness which tasted healthy and delicious. As we munched, regulars walked in with great frequency to get their caffeine boost. Definitely a neighborhood cafe that I wish was in my neighborhood.  FOOD - 4 stars...quite a plethora of fresh ingredients in the Greek Salad here AMBIANCE - 3.5 stars...where everybody knows your name...except mine SERVICE - 4 stars...friendly and attentive TOTAL - 4 stars...a welcome find for casual neighborhood eats", 
    "review_date": "2012-07-19"
  }, 
  "3JOfXWDIe6icTKqkpD0skA": {
    "user_rating": 4.0, 
    "user_location": "Hampton, Australia", 
    "user_name": "Paul G.", 
    "review_text": "Quaint place out of the main tourist hustle down the road. Note you order at counter, no table service (no one will tell you) . Good little spot for breakfast.", 
    "review_date": "2012-08-03"
  }, 
  "9eFAzAZKfd8-39d-v6g4xA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz K.", 
    "review_text": "What's not to love:   It's FAST but not fast food; in fact, anything but. We had the falafel and the wild turkey sandwich on sourdough.  They were both scrumptious.  Nothing was oily-tasting.  I suggest getting the turkey on sourdough because they toasted ours just so that it had that chewy consistency. Loved the mushroom spread on the turkey sandwich - they don't overdo the sauce like too many places.  They have the art of light touch down - same with the tahini and basil on the falafel.  Light but just enough for the palate to appreciate and savor.   MInd you - all this from a small, corner, simple, unpretentious local joint with an old, hodgepodge of tables.  AND the food is so affordably priced.  My two sandwiches were $6 and $7.  Another little nice touch but important thing I love is when you get your order to go, they put your sandwich in a box -- so your sandwich isn't squashed when you get to your destination -- it's the little things sometimes that make a big diff.     They take credit card- thank god.  Just for that, I'll be a regular. There are so many places that only take cash and it drives me nuts since I hate carrying cash.", 
    "review_date": "2011-02-07"
  }, 
  "hf0FUYlOX6ihDQtRixXhaQ": {
    "user_rating": 5.0, 
    "user_location": "Discovery Bay, CA", 
    "user_name": "Ken B.", 
    "review_text": "I eat there 1 to 5 times a week.   I've been doing it for over 10 years.  It's good food at a good price.", 
    "review_date": "2010-10-21"
  }, 
  "jodawPVWDZZXoAdIR6aFOQ": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Gene T.", 
    "review_text": "Great Food and Service Open til 7pm everyday", 
    "review_date": "2011-07-27"
  }, 
  "sZGvynYsvZhjstmQI4VFuA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Geoff Y.", 
    "review_text": "This place is good when you need to stop for food, but it'll leave you questioning a couple of things.  First, table cleanliness.  All the available tables were pretty dirty.  The place wasn't busy, so it shouldn't have been a problem to go around and wipe everything down.  Second, their roast beef was wet.  Like dripping wet.  I'm not sure how cold cuts are on the West Coast, but to me, roast beef shouldn't be wet enough to drip whatever it was soaking in.  Third, their sourdough bread.  I'm under the impression that San Francisco is the place to get good sourdough, but the toasting they put on the slices here took all the flavor out of it and made the crust too hard to be enjoyable.  Nonetheless, the result is more than the sum of its parts.  It surprisingly worked despite my gripes above.  Or maybe I was just hungry.", 
    "review_date": "2011-08-01"
  }, 
  "jX52sZoojxyYV2viWNyO7A": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "David O.", 
    "review_text": "When I first moved to SF in 2001, I used to live half a block away from Cafe Francisco.  It was convenient.   They served decent coffee, had a few tables outside where one could read the paper and just relax, especially on a warm and Sunny saturday morning.  Their breakfast food was ok... nothing extraordinary, though.  I'd give them 3.5 stars, but I'm feeling generous today.", 
    "review_date": "2006-10-19"
  }, 
  "aaHmnToF5k29CgbkFCT4wA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rey G.", 
    "review_text": "Cafe Francisco, a nice place , The San francisco sandwich is great, and also I love the mediterranean plate, The humus is good , and the falafel. all the salads are very good.", 
    "review_date": "2007-12-21"
  }, 
  "p4-tNsuQB6O11lp77KZKJg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H K.", 
    "review_text": "Stopped here while passing by a few days ago for a cup of coffee to help battle food coma. Upon ordering, you get a cup and have a choice of four pots of brews to choose from, from strong French roast to something less strong.  I see here it's not just a coffee shop in that they serve sandwiches and maybe a small number of hot food plates.  Overall, a very good local coffee place.", 
    "review_date": "2012-05-27"
  }, 
  "jnVqZ_bCzotRueQSNcnq-g": {
    "user_rating": 4.0, 
    "user_location": "West Sacramento, CA", 
    "user_name": "Thomas S.", 
    "review_text": "This is one of the better cafes that I've been to foodwise. The coffee is pretty good, but is inconsistent. The food is always really good. I'm particularly fond of the rather pricey, but delicious Francisco Bagel (bagel with cream cheese, tomatoes, red onion, capers) with lox. The ingredients are always fresh (the breads are always fresh, the tomatoes are nice red and ripe, and the lox doesn't smell \"fishy\") and the portions aren't stingy either.    The real problem is the service. The owner doesn't smile much, but is polite. His staff on the other hand is surly and unprofessional - even if you make sure they are watching when you drop some cash in the tip jar.   I went in there a few minutes after 12pm and asked if it was possible to still get the lox bagel. The cashier glared at me a barked \"no breakfast!\" Ok, no problem, just asking. Disappointing, but I understand. So I order the BLT with avocado, which was great, but after paying and sitting down, I noticed that the chalkboard had a lox sandwich special for lunch! Wtf? Is it too much of a strain to politely tell the customer that no, we aren't serving that breakfast item, but we are serving something that is 95% the EXACT same thing as a lunch special? If that's the case, I think that putting my hard earned cash into the tip jar might be a bit too much of a strain on my part.    Regardless of the rotten service and FiDi level prices, the patio tables and the tasty, fresh food will keep me coming back.", 
    "review_date": "2007-07-30"
  }, 
  "ujHwkKknvFGh7UnJsVn1mg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim R.", 
    "review_text": "very average food (3 stars), but coffee was a little under average, but it's affordable (free refill!).  When I'm in a rush to catch a bus, I would get a cup to go, otherwise, I would go somewhere else for better coffee.  Good outdoor sitting to have a beer in the evening after work on my way home.", 
    "review_date": "2011-10-19"
  }, 
  "OXnmwRYK5etGqUAnj3CTbg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff H.", 
    "review_text": "Through no fault of its own, Cafe Francisco is only pretty good. I mean, in a vacuum, there's absolutely nothing wrong with it, and several things right.  Great salads, sandwiches, carefully made to order in a somewhat-speedy manner.  But the fact that Petite Deli (to name only one example) is mere blocks away kind of hurts the whole proposition.  Still, worth a try. And maybe I'll be more inclined to eat here more often if it continues to rain every day. Otherwise, I'll make my own or go a few blocks farther to North Beach.", 
    "review_date": "2009-02-11"
  }, 
  "qU3E7ENm8VsMc_IZCpTCZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "The Sock S.", 
    "review_text": "Very friendly place to stop in for a cup of coffee. The woman in the morning is always friendly and quick. This is just (to me) a place to stop and get coffee on the way to work.   The food is ok. The pastries are store bought, so nothing special. The sandwiches I've tried have been pretty good so far. They also make omelettes. It's not great, but is a decent place.", 
    "review_date": "2007-08-10"
  }, 
  "-uVneM9dPGbbbB3uBzPEtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "Love that you can do half sandwich (including falafel sandwiches) and half salad, but the falafel is a little dry.", 
    "review_date": "2010-11-04"
  }, 
  "QgsKe1LPPOxpv3_o2xmiwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kaitlin M.", 
    "review_text": "I've lived down the street for a year and the long lines on weekend mornings always deterred me from giving Cafe Francisco a try. This AM we ordered the Mediterranean Frittata &amp; Le Croissant - $8.95ea. Hearty portions and delicious. Service was friendly. -1 Star because the gal couldn't tell me what kind of coffee beans they had? Hopefully they'll know next time I come in :-)", 
    "review_date": "2014-11-22"
  }, 
  "URcTgN3LnJvZWrK1jZIY6A": {
    "user_rating": 4.0, 
    "user_location": "Greenwich Village, Manhattan, NY", 
    "user_name": "Alexandre G.", 
    "review_text": "Delicious! Good ambiance. Good prices. Cosy and not pretentious. A bit vintage and seem very typical. Love it", 
    "review_date": "2014-06-03"
  }, 
  "LesmnghGD1xYIWEh8bgFnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean S.", 
    "review_text": "A really nice lunch spot. They make great sandwiches that taste awesome and look great too. Pretty fast service and a nice atmosphere on the inside.  I often get the garden vegetarian sandwich, and it never disappoints. They also have a Greek salad which is insane! It is like $7 and it is frickin' huge! I think the only time I ever finished it was the 1st time I got it.  I can't speak for the meaty sandwiches, but many of my mates get em and love them. From what I can tell they make a great french dip and also some sort of margarita sandwich which has tomatoes and basil and prosciutto, that seems to be a favorite of my friends.  Oh and their focaccia bread really bangs the sammies up a notch.  They have some basic outdoor seating where you can watch tourists go by in buses and loud school kids getting onto buses.", 
    "review_date": "2009-10-17"
  }, 
  "-sIddonB3VH3bc92cQLW_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tiff g.", 
    "review_text": "The sandwiches are delicious, I had the Veggie and my friend opted for the BLT... He had originally wanted the San Fran (ran out of avocado), and then the Wild Turkey (ran out of mushroom spread), so he finally settled with a standard BLT.  It was a little off-putting because it was lunchtime and not all that busy at the time... but shit, if I worked there, I too would snack on avocado and mushroom spread, not pointing any fingers though, just sayin.  The indoor seating is casual, definitely could munch, drink, and work on my computer there.  A coffee shop with good eats-- thumbs up.", 
    "review_date": "2010-09-21"
  }, 
  "Fg1ZhF_2pHcRwgyq_6yUiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles C.", 
    "review_text": "kinda/sorta hidden away, far enough from the tourists so it's always nice and quiet.   the sandwiches are great and decently priced. coffee is good as well.  not much people-watching, but if you're into that walk a couple blocks up to see all the people from arkansas ambling around the wharf", 
    "review_date": "2007-01-12"
  }, 
  "pUQSn75ZJVdQ9HaRhK1Lig": {
    "user_rating": 5.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Seth A.", 
    "review_text": "This place hit the spot on a sunday morning - great frittadas (egg scrambles with great fresh ingredients) and quality coffee.  One thing I would advise someone doing breakfast here to do is to ask for the frittada to be cooked a minute less - mine would have been a little better had it been taken out of the oven a moment earlier.. great nonetheless!!  I was very pleased with the salmon frittada and will definitely recommend this place to anyone visiting SF.", 
    "review_date": "2012-08-05"
  }, 
  "GPBQQikETatAin3zhUsisA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt N.", 
    "review_text": "I come here for the Garden Vegetarian sandwiches on foccacia bread. It's a big messy hummus sandwich that is very, very tasty. It also comes with a slice of melon, some feta and olives on the side.  I can't say much about the service (you order at the counter so what is there to say?) or other items on the menu. It's also a little warm inside, but the old jazz music they play isn't half-bad.", 
    "review_date": "2007-12-01"
  }, 
  "ixYLMqLBLo4tfcuQ-ewk9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karla R.", 
    "review_text": "I like this place because you can sit outside and watch the world go by (or at least all the people making the trek up to Coit Tower).  I've only had breakfast and coffee here, but both have been good and the price is right.", 
    "review_date": "2007-07-07"
  }, 
  "kyG14FyCWmVW3Uefs_GE_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theron L.", 
    "review_text": "This is a frequent lunch spot for me.  I usually get an americano and the chicken sandwhich which comes with a little salad.  Nice place to sit outside and have a quiet lunch with a friend.", 
    "review_date": "2008-06-30"
  }, 
  "RMzVhsnc5Ri4VTbS7lczLg": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mark H.", 
    "review_text": "I discovered this place when I came to SF for the first time back in 2008. Returning now is like seeing an old friend from college... pleasant, but we've both moved on.   The service isn't really up to much... a New York scowl awaits you when you order, and if you have the slightest accent, you'll repeat everything 6 times, mainly because the person taking the order isn't looking at you. The food is pretty good though, the eggs and salsa are top notch. The coffee is a little below par for this town (help yourself from the flask), but if you just flew in from North Korea, you might think it's awesome. The jazz in the background will either add to the ambiance or distract, depending on your taste in music (it makes me tense) but you'll get nothing else for free (water, coffee top ups, a smile). Having said all that, it's well away from the other tourist coffee bars - you'll feel more like a local, which can be refreshing.   It fits the location, pretentious and over valued. Just like that Inuit Poetry major.  **edit - after scouring the area a little further and realizing that virtually every other café gives free coffee refills with breakfast, this place is even more disappointing. Relegated to two stars...", 
    "review_date": "2011-06-14"
  }, 
  "Kqf_CutNJnVASObZbPh_yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "When you work in the Fisherman's Wharf area it can be hard to find good food at the right price. Love their caprese salad. A local lunchtime favorite among Williams Sonoma employees. Get there before noon. Grab a seat by the window. Great natural light.", 
    "review_date": "2014-02-20"
  }, 
  "p2d80keLgCk9YaRPLT5UVw": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Christina N.", 
    "review_text": "We were lucky to find this place when we were in San Francisco. They serve fruit to with most of their dishes.  I had a salmon sandwhich with soup and left satisfied.  It's a great place to stop in for lunch...", 
    "review_date": "2014-10-17"
  }, 
  "xlUJfjrkIzljZaEK5MMGTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia M.", 
    "review_text": "Solid coffee. Simple, good quality cafe food. Straightforward, no-nonsense service. I  The casual, unpretentious vibe is awesome. It's perfect for grabbing food on your own while doing some work, or bringing a book or newspaper. If you bring a friend, the menu is varied enough to suit most people (there's salads, sandwiches, egg frittatas etc.)   To the reviewer below who seemed perturbed about them no longer serving breakfast, you don't seem to get it. The service here is just straightforward and simple. There's no \"hidden message\" in the lady telling you they stopped serving breakfast at 12.", 
    "review_date": "2013-09-08"
  }, 
  "Hoq3DP92TG4BxdWahFqT8Q": {
    "user_rating": 3.0, 
    "user_location": "El Segundo, CA", 
    "user_name": "Ben M.", 
    "review_text": "This was a decent cafe I discovered walking a few blocks up from the wharf.  The food here and it is located in a cute neighborhood and the staff is very friendly.  The only cons were a few tables were pretty dirty even when there was hardly anyone there.  Other than that it was a nice place to grab lunch, but wouldn't be a must see if I visit again.", 
    "review_date": "2012-02-21"
  }, 
  "MjHGDs7ZoawPwqYiztmzHw": {
    "user_rating": 5.0, 
    "user_location": "Jacksonville, FL", 
    "user_name": "Josh G.", 
    "review_text": "Absolute breakfast bliss with a bevy of Bay charm. This cafe rivals any you might come across in the West Village in NYC,  but without the inflated prices and inevitable pretension. I ordered a simple bagel sandwich, and was pleasantly surprised at how it was nearly indistinguishable from my fond memories of consuming bagels on Sundays in Florida and New York. The eggs were scrambled perfectly, fluffy and plentiful. Cafe Francisco is just one of many reasons why I keep coming back to SF.", 
    "review_date": "2013-04-26"
  }, 
  "VpREWOjt5Pna6OIgXI9Jcg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara H.", 
    "review_text": "3.5 to 4? Yeah, another one of those. But after several visits, it's still 3 at the worst on an off day, and 4 on a rather good one.  Free WiFi though!  My co-workers and I hit up this place for a Tuesday lunch, and they didn't balk at the group of 10 that showed up and started moving their tiny tables around. I came most recently for a lunch alone with my book, and it was perfect for that, too. You can come here on a bad day and have a pastry or scone to eat your feelings away, or you can come here on regular, good days and have your choice of salads, sandwiches and espresso drinks.  Caprese salad was almost the perfect size - it was actually a shade too big, leaving a tomato+mozzarella+basil ball for a lucky, still-hungry co-worker. Iced coffee kept me blissfully awake through food coma. The roast beef sandwich on focaccia with pesto is my favorite so far, and all that oil reminds me that I should take the hills home instead of the F. Francisco salad is good and worth the $9 if you're, say, de-toxing from four days in unhealthy Texas.  Speaking of the oil, there is a lot of olive oil in everything. This makes for tasty, but it's perhaps a bit much. Also, the roast beef sandwich and an iced chai latte ran me $11. Not the end of the world, but I'll think twice about how much I'm spending later for dinner.  I've complained loudly, at length, about the dearth of regular-person places to eat in Fisherman's Wharf and North Beach. I'm more than happy to welcome Cafe Francisco to my 9-5 list.", 
    "review_date": "2008-06-19"
  }, 
  "86epNKEYv1x7NcyoGHSVfQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle R.", 
    "review_text": "Great prices and tasty food. Super convenient for calling in a lunch order for pick up. The only thing that would make it better - stop over frying the falafel on the Mediterranean plate.", 
    "review_date": "2013-03-25"
  }, 
  "RhKVKsAoJS6kogEhNn9yPA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "stephen d.", 
    "review_text": "Awesome, quiet cafe with super nice people, great sandwiches and menu. love this place. great prices too.", 
    "review_date": "2012-09-14"
  }, 
  "23wQqI-DYwKkIp1av55A1Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "Great spot for people watching and sipping a beverage on a warm day...if your beverage is made well.  I ordered a cafe au lait, which was seriously just steamed milk.  I don't understand.  Yeah, it's my fault I didn't go back and ask if she knew what she was doing, but still--should I have to? The ambiance is chill and nice, although the bathroom is a bit gross.   And, they close at 6 on a weeknight?  SILLY!", 
    "review_date": "2009-01-31"
  }, 
  "FcjioveW2WDKx8QwTXg9KA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen K.", 
    "review_text": "I am a regular here.  I walk in and they already know what I'm going to order.  That's how much I come here.  Sure its convenient to my office.  But if it sucked I wouldn't keep coming back.  I come here all the time in the morning for my iced chai (with little ice) and sometimes a breakfast bagel.  Wow, those things are awesome but filling!  I only get one if I'm starving, because I don't need to eat for the rest of the day after one of those suckers.  For lunch I either get one of their stacked sandwiches or yummy salads.  They also have a great fruit, yogurt and granola bowl.  Seriously, I've never had anything bad here.  It might be \"standard cafe fare\" but its good cafe fare.", 
    "review_date": "2010-04-03"
  }, 
  "pFFl_PTR-qHOoqaJu4XKag": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Dan N.", 
    "review_text": "Meandering through North Beach one recent day, my girlfriend and I stumbled on Cafe Francisco. Immediately, it became a future staple.  I was skeptical that this tiny place on Powell Street was anything more than a coffee/bagel walk in. Instead, I was greeted with a huge menu that covered at least three continents. I settled on the Greek Salad, to satiate my European craving of the day, and a bagel, because I hadn't had breakfast yet.  The salad? Oh it was Greek enough for me. The lettuce was leafy and green, and it came with several blocks (not crumbles) of Feta, and a healthy portion of hummus on top. The highlight, though, was perhaps the best dolma I have ever tasted. Though the dressing was a rather bland balsamic vinaigrette, instead of my preferred Greek, I let it slide. The rest of it was that good.  My plain bagel, by itself, wasn't particularly interesting. But the welcome surprise of whipped cream cheese made it at least a little adventurous.  And to top it all off, the coffee was strong with a bit of a smokey flavor. I'll be heading back soon to try the rest of the menu.", 
    "review_date": "2010-04-13"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "I have no problems with this place. Drinks are cheap and pretty strong, and the layout is nice, especially with all the outdoor seating (and on both sides of the outdoor area in front of the cafe). They also do happy hour every day of the week. That is no laughing matter, folks. Pastries and coffee are good, and neithe will break the bank. You can spend a whole day just people watching in this cafe. Love it.", 
    "review_date": "2013-09-06"
  }, 
  "GntMzGmDcC0v5cHlGtXiDQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina C.", 
    "review_text": "I am pleased that Cafe Francisco has free Wifi again, but maybe getting that perk comes with a cost.  The coffee used to be very good, but nowadays it's not.  Clearly there's not enough beans being used.  The food is still quite tasty, though.  Nevertheless, I still go there because it's in my neighborhood and I don't drink much coffee anymore.", 
    "review_date": "2009-02-13"
  }, 
  "DK-k2ngGx2aO8-TWbe_qOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JEN W.", 
    "review_text": "I have been coming to Franciscos for a few years now and as many have said in previous posts, the service is the real problem at this bare-bones/cozy neighborhood cafe.   I have a few favorites on the menu including the Francisco Bagel w/ Lox -- although for $10, it's become a \"treat\" instead of \"the usual\" -- and the San Fran sandwich on foccacia with turkey instead of chicken.   Although thing I go back for is the Hazelnut coffee. Sure the morning staff is a bit grumpy, but the coffee helps.   They went through a real rough patch with staff who didn't know how to multitask and were sloppy. Everything suffered, and it was right after they raised everything by $1. Those guys are gone now though -- thankfully the \"little one\" as we called him is ... I once waited for a good 5 minutes at the counter with a line of 4 behind me while he counted tips! -- and the staff seems to be somewhat better ... the food has been more consistent, but I still feel like I only eat there once in a while as opposed to at least 1x/week now.   The ambiance is minimal, although cozy; benches inside are hard and uncomfortable and the owner never seems to be enjoying himself or the fact that he has customers, but the table by the big window or the patio are good options. Mostly bring the food home with me -- I think maybe to escape the chaos of new staff and a sourpuss owner.   Bottom line ... some competition moved into the neighborhood recently -- tried it once and Franny's will always be my default. More like 3.5 stars.", 
    "review_date": "2007-09-02"
  }, 
  "dsX64i3HpIV7JQTnD570RA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saadullah S.", 
    "review_text": "Free wi-fi, decent food and tea/coffee! Only problem is that it closes early, wish it was open till a little late. Love this place!", 
    "review_date": "2011-12-11"
  }, 
  "nAbwXrHgJx5BshmOcCRCZQ": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Rayna A.", 
    "review_text": "They get my food &amp; drink out quickly - then leave me alone so I can get work done!    The Short: I give this cafe 5 stars because they give me what I need when I need it.  I come here when I need to eat a solid lunch or breakfast, drink a yummy latte, heist free wifi, and deal with friendly staff that let me sit and study in peace - for hours.  Good place to focus.  I have a few spots I like in NB, but this is the only one where I actually get work done.  I don't know, maybe because they keep it simple - nothing fancy.  The weekends get a little crazy during certain hours, but otherwise, I can't complain.   Little Longer: When I first noticed this cafe, it looked so homely compared to the others in NB.  I really didn't want to try their food or drink.  But, one day, I was at the super famous cafe around the corner talking to my neighbor who informed me that the good coffee is on Francisco.  So, we walked over and she was right - AND it was quieter (no crazy loud jams)!  Quick turn over too.  After a while, I decided to give the food a try.  I've had almost everything on the menu, but usually stick to the sandwiches, omelets, and falafal.  Occasionally I'll have a waffle with strawberries and whip.  They carry beer too, and I often fantasize about ordering several bottles; but like I said, I come here to work.  Unfortunately, I cannot work with a beer buzz.    Bottom line: you want simple food and friendly service, this is your spot.  If you need to get hopped up on caffeine and/or bang out some work, this may be your spot too.    Note: they do a happy hour and take out...good portions.  Not many electrical plugs for laptops; if you can, charge up ahead of time.", 
    "review_date": "2012-02-15"
  }, 
  "HenOnFWeqHMjNKnD4C0ozQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Thomas R.", 
    "review_text": "Once a week I go to Cafe Francisco to get the Mediterranean Plate (3 falafel, 3 tomatoes, 3 olives, 3 hunks of feta, 300 onions (I omit), lettuce and 1 toasted pita, one lump of hummus, one hell of a lotta dressing). It's funky, but good. Get a sparkling water.   It's a place I like when I'm outside. Pretty quiet neighborhood, especially when school is out (across street). Close to work. MP is like clockwork. Never different.  The service? It seems like there is a mini cultural exchange going on here. There's usually a young euro femme recently hired who leaves within a month or so. Other than that, there is a laughably unfriendly woman who's been there the full 3 years I've been going. She shows up in other reviews here. Attitude: cross between disdain and bored to tears. Not aggressive, but aside from that, really unwelcoming. But hey, I like the MP. Just don't go there for the conversation. Any conversation. No, not even, \"Hi.\"", 
    "review_date": "2008-09-15"
  }, 
  "A-q5Rz4z7k6Kafos0Vx96w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana R.", 
    "review_text": "Ok so if you are looking for a easy going brunch/coffee shop in North Beach, look no further.   This place is awesome. The people are friendly, the food is fabulous, and the chai is perfection. My sister is a big coffee drinker and she loves coming here for their coffee whenever she comes and visits. We never have an issue getting a table and they have outside seating on the sidewalk, which is quaint and enjoyable. You dont even have to wait very long for food.   As for food recommendations, pretty much anything on their menu is good. I usually go for their bagels, but I have had their french toast, which was really good as well. Like it said, you can't go wrong.", 
    "review_date": "2010-02-25"
  }, 
  "2Bm19aO4NequZ7i23z7TBA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cynthia G.", 
    "review_text": "Coffee is blah Food is good Service is pretty bad most of the time :-( Ambiance is great though", 
    "review_date": "2014-04-18"
  }, 
  "bzLY-VVHEF_Kcig1TTa5SA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A T.", 
    "review_text": "I'm so glad I'm not the only one! I logged in to write a review and noticed someone else made the same comment......this place is really dirty! I actually come here all the time so it's not a deal breaker, but Cafe Francisco really needs to do a little spring cleaning! I don't think some parts of the cafe have ever seen a sponge.  The food is good though so I keep on coming back.", 
    "review_date": "2009-05-28"
  }, 
  "gjZp61JZaqcLrKjEDVSPIQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T-Bone L.", 
    "review_text": "The chai had a slight band-aid flavor.", 
    "review_date": "2006-12-29"
  }, 
  "XnbGrJNw0wglmqXekW138Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn B.", 
    "review_text": "this place doesnt have a huge menu and its kind of small, but its a really cute little neighborhood cafe to grab coffee or a light breakfast or lunch.  they have outside seating which is great when its sunny.", 
    "review_date": "2006-05-08"
  }, 
  "itfQekl0lnYNh1-tXbouUA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Dianne M.", 
    "review_text": "Nice little find on a Sunday morning.  Great food, nicely presented. Seems to have a local following.   Service is a bit on the slow side... But not an issue on a sunny Sunday", 
    "review_date": "2013-05-28"
  }, 
  "AAZyvtVjYm_5K72M7A84OA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James B.", 
    "review_text": "We came in and I addressed the server with a \"How's it going?\" or \"How are you?\" No answer.  We started to order breakfast. Monotone response from dark-haired woman with no affect: \"We're not serving breakfast.\"  \"What? Really?\"  \"We stop serving breakfast at twelve.\"  I check the time and watch it go from 11:59 to 12:00. I check server's face and watch it go from blank stare to blank stare and then just briefly take on the subtle hints of blank stare.  I say to my honey, \"You want to find somewhere else?\"  She says, \"Sure,\" and we leave.  TAKE TWO: A few days later server and I meet again. I thought I caught a hint of a smile (maybe a smirk?) but that was quickly replaced by blank stare. I thought about engaging in dialog designed to resolve our issues, to come to some kind of closure and put our past behind us. I thought of protesting outside so that the world would know how cold the service could be here.  But I need my coffee, dammit. I need my coffee. I'm so ashamed...", 
    "review_date": "2007-12-11"
  }, 
  "XhaDy7gAnLCtnAsmmh4EfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allyson S.", 
    "review_text": "This is a really cute neighborhood cafe. I was in the area because I was getting the grand tour of the malt house down the block by one of the project managers, and after four hours of walking around we were pretty hungry. Having worked there for so long, he suggested we pop in here for lunch, siting delicious sandwiches. Now, being a vegetarian I believe there was really only one option on the menu for me sandwich wise. The sammy sounded pretty darn good, and after reading other reviews I almost regret not getting it, but I opted for the Mediterranean plate since I had been craving some good hummus for a few days.  The service was quick, they came and cleaned off our table as soon as we sat down which was nice. The plate was huge, there was hummus and pita bread, plus dolmas and fallafel, plus a giant greek salad. On the whole the plate was pretty damn delicious, but to be nit picky, the hummus could have used a bit more tahini, and the large chunks of feta was a little odd. I did however, really like that they get everyone a little bit of fruit with their meal.  We sat here for at least an hour eating and talking, and by the time we left the near empty cafe had filled up a bit. All in all, if I am in that area again I will definitely stop in for a bite to eat, although the portions are quite large for cafe food. But as north beach, and even more so pier 39 areas are places that I only frequent when I have a specific mission, I probably wont be back for awhile.", 
    "review_date": "2008-12-24"
  }, 
  "DQazGx5MBoY8ICli9LLchw": {
    "user_rating": 3.0, 
    "user_location": "Nashville, TN", 
    "user_name": "Fabiana H.", 
    "review_text": "I like their cafe. And I like how they care about not being conventional. when you order bagel with cream cheese they serve it in a little tray with some fruits on the side.  I would give more starts if the place was a little bit more clean. the bathroom was very dirty when I used. There is the door on the back, just for employees, but it is so dirty.. I pay attention on details.. Makes you wonder if they are careful about hygiene when dealing with your food... Once I got a bowl of fruits and the fruits on top were going bad, probably wasn't fresh...  no internet available :( There is a girl who works there that seems to always be in a bad mood.. The young boy is very sweet tho..", 
    "review_date": "2008-10-24"
  }, 
  "MjlNTynslY_aLDTfGODuIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LL C.", 
    "review_text": "i grew up a block from here, never came here when I was little...luckily, i was fortunate enough to work nearby for a couple of years...this place is a real gym..albeit a bit pricey  francisco salad, mediterranean plate...and the sandwiches", 
    "review_date": "2012-02-10"
  }, 
  "br6sFuJ5BOAP6NBh4g6HEw": {
    "user_rating": 4.0, 
    "user_location": "Borås, Sweden", 
    "user_name": "F O.", 
    "review_text": "Very nice place, just off the Embarcadero for the ones who just can't stand all the tourists. Really recommended!", 
    "review_date": "2014-08-14"
  }
}