{
  "HFECrzYDpgbS5EmTBtj2zQ": {
    "user_rating": 4.0, 
    "user_location": "Albany, CA", 
    "user_name": "Eric B.", 
    "review_text": "Magnolia Thunderpussy!   This is the first thing that comes to my mind when Capp's Corner is mentioned.   For those of you who are perhaps too young to remember, Magnolia's real name was Patricia Donna Mallon. She was a San Francisco burlesque performer, radio personality, filmmaker and restaurateur.  Thunderpussy operated two San Francisco restaurants in the 1960s. The one in the Haight, which bore her name, featured a late-night delivery service and erotic desserts such as \"The Montana Banana\". It consisted of was an unsplit banana, representing a phallus, served \"erect\" in a food service \"boat\" with two scoops of strategically placed ice cream, shredded coconut (care to guess why?), and a small dollop of whipped cream at the \"tip\". She created a host of other such delectables that, at the time seemed deliciously scandalous.  San Francisco columnist Herb Caen was an ardent fan of \"Magnolia\" and wrote about her often in his daily column for The San Francisco Chronicle. She was also very much appreciated by a legion of rock musicians and bands who came to San Francisco to record. Her catering operation would deliver her signature food items to any location in San Francisco at any hour of the night or early morning, and was hugely popular with the bands and their followers. She was also a big hit with the local \"Cannabis Culture\" who for obvious \"Munchie\" reasons, couldn't get enough of her fare.  Loved for her razor sharp wit, sense of daring and flamboyant imagination, she carved for herself a reputation of fun and free-spirit at a time in the Bay Area when all things seemed possible. Ah, the good old days!  During my time living in San Francisco, she was also a hostess at Capp's Corner - a cool family Italian restaurant here in North Beach. It was her name that got me in the door and the old school comfort food within this cool restaurant that keeps me coming back even today.", 
    "review_date": "2011-05-26"
  }, 
  "AiJ2nF4QIw08BuWWCUhXlQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer O.", 
    "review_text": "I grew up going here. My father was a captain in North Beach (lucky me!) I learned all the history about this place. I love the classic family style and the fixed priced menu. The atmosphere is comfortable and historical. Great drinks at the bar (stiff) and right next door to Beach Blanket Babylon! HOW FUN!", 
    "review_date": "2007-05-08"
  }, 
  "jmKtpUz93SGbbpRkp05yWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anita B.", 
    "review_text": "One of the better restaurants in NB. Skip the Stinking Rose (ugh, don't get me started on that place) and head here. Yummy Italian food at reasonable prices. The cheese ravioli is very good. Also check out the minestrone! I can't say much other than what has already been repeated several times but Capp's is very much worth it.", 
    "review_date": "2008-03-14"
  }, 
  "nW_QrEfNEMH5SE5tMy5xwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie D.", 
    "review_text": "Came here for lunch with my husband today. We had fast and friendly service; our waiter made sure we had everything we needed at all times.   He ordered Chicken Parmesan and I ordered the Spaghetti with Mussels and Clams. Both came with either soup or salad...which we had within two minutes of ordering! I even commented to the waiter about how fast it came out.  My husband said the soup was delicious and ate it before I could try any. His chicken parmesan came with both pasta and vegetables. He said it was not the best sauce he's ever had, but he comes from an Italian family (and we know all Italians love their sauce the best).    My spaghetti came with an overflowing amount of mussels and three large prawns and the most delicious creamy pesto sauce I've ever had. The food was full of flavor, the portions are hearty, and the service is great. This place is a north beach gem!", 
    "review_date": "2013-07-17"
  }, 
  "hnxKVPSR1xKM6qPBr7wQWg": {
    "user_rating": 4.0, 
    "user_location": "Oregon City, OR", 
    "user_name": "Dave L.", 
    "review_text": "Great atmosphere, love the old wooden bar and the old cash register. Don't change a thing.", 
    "review_date": "2012-02-11"
  }, 
  "wzSghdm84aLhIfnxanwBFg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jeremy N.", 
    "review_text": "the food here is good, but not great.  the service is very friendly, but the seating space is tight.  over all, my experience was not bad, it just wasnt great.  will i ever dine here again?  its a definite, maybe.", 
    "review_date": "2008-11-06"
  }, 
  "s5XJsJNNI944pvNKsb_OeA": {
    "user_rating": 3.0, 
    "user_location": "Carmel Valley Village, CA", 
    "user_name": "George C.", 
    "review_text": "Review of the bar only. We left The Saloon and headed to Beach Blanket Babylon but were early so we went to Capps Corner to have a drink. It's an old Italian Restaurant and bar. We sat at the bar and the four of us ordered drinks. The bartender chatted with us about the bar, the location and Beach Blanket Babylon. She had worked there for many years. The restaurant did a steady business. We looked at the menus and decided maybe next time. Good company and drinks.", 
    "review_date": "2013-06-04"
  }, 
  "NVei24-9k5GIZNRR1xGcRQ": {
    "user_rating": 4.0, 
    "user_location": "Kenwood, CA", 
    "user_name": "Tom S.", 
    "review_text": "Ate here 33 years ago, and then again last night. Hasn't changed much.  The celebrity photos all over the walls have been updated.    Place was packed Friday night at 9:00 PM. I asked the greeter in Italian for mercy.  We got seated in 15 minutes.    This is old school Italo-Cali-American cuisine at its best.  Family style, shared portions.  Minestrone comes in a bowl with ladle.  The soup was based on a fagioli mash with chicken broth, loaded with sauteed carrots, escarole, barley &amp; potato hunks.  Goes great with the fluffy, tasty bread. Salad equally fresh &amp; full of little surprises like big slices of sweet red beets and stewed ceci beans.    We both \"splurged\" on the $21 osso buco. Portion size was tremendous.  We brought 50% home in a container for another meal. The waitress effortlessly served at least 30 people without breaking a sweat &amp; kept her good humor.   Capp's is an enduring landmark.  Eat really GOOD Cali-Italy food for Pasta Pomodoro prices!", 
    "review_date": "2006-12-30"
  }, 
  "FhkZk24n_Dh-pVLpBKUwEw": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "BRUCE S.", 
    "review_text": "I've always enjoyed the meals I have here and I love the vintage ambience and the photos on the wall.  Great bar, too.  Go, enjoy!", 
    "review_date": "2008-05-19"
  }, 
  "QXRJ2akTpiiEEd0FPbfjQg": {
    "user_rating": 4.0, 
    "user_location": "Atherton, CA", 
    "user_name": "J.M. B.", 
    "review_text": "Classic comfort Italian food with a comfortable price!  I went here with a BIG group (14 ppl) and the people there couldn't have been nicer and more accommodating on VALENTINE'S day with a last minute reservation.  The minestrone soup is to die for and I particularly liked the family style way of serving of the soup and salad (made it feel even more comforting). The main dish was also good for the price (18-22 max!)", 
    "review_date": "2009-02-17"
  }, 
  "1aOld-llmxjrX5sL49-Lpg": {
    "user_rating": 2.0, 
    "user_location": "Houston, TX", 
    "user_name": "Blake B.", 
    "review_text": "Capp's has an amazing, straight-out-of-the-sopranos vibe to it - but the food quality just doesn't match the atmosphere.  When you walk into Capp's, you feel like you just walked into an Italian family's dining room. Big smiles greet you (and even a kiss on the cheek if you're a regular), with a general air of \"welcome to the family\". Raucous Italian discussions outburst at the bar, where the bartender seems to know everyone who walks in.  The food, however, is very generic Italian with little culinary experimentation. I tried their special, the Chicken Canelloni, and it was pretty boring. It wasn't terrible, just unimaginative. I wish I could give 5 stars, but this is a food review.  Capp's is a great family place and definitely an experience, but I'd recommend it for the atmosphere and not the food.", 
    "review_date": "2009-05-13"
  }, 
  "y4GUVhJtuaNifcr3sR6fgw": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Jeanna W.", 
    "review_text": "Great family style Italian food just steps away from Beach Blanket Babylon. I had the petrale sole and it was perfect with the pasta and vegetables. The boyfriend had prawns and fettuccine with Alfredo sauce. The clam chowder was creamy with perfectly cooked clams. There's a reason that this place has been around so long.", 
    "review_date": "2010-07-02"
  }, 
  "N49KzxE5E2Zs88ptsutAnA": {
    "user_rating": 4.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Robin B.", 
    "review_text": "Capp's Corner was one of the first Italian places I visited in SF.  It's great, homestyle Italian food in a family friendly atmosphere.  Great for a big group.  Definitely a good, relaxing dinner.", 
    "review_date": "2013-04-14"
  }, 
  "HZJA620xWYxaJI_PKbK0FA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay A.", 
    "review_text": "Oh boy - Took my sister and her boyfriend here when they were visiting me and it was a cute little decor but there were a number of interesting things. I give it two stars for the fact that it's so old and the minestone soup was yummy.   However, our waitress was either really drunk or there was something wrong with her. I'm guessing drunk because her teeth looked like she just drank 4 bottles of Cabernet. She kept forgetting to bring us stuff after we asked her for things and she was slurring her words and kept wishing us a Happy New Year. The food was mediocre at best. We ordered the veal tortellini, chicken parm, and the lamb. The pasta was a little overcooked and just not very tasty.   The prices are pretty good but I definitly won't be coming back. I'm honestly a little concerened about the waitress we had, how did the owners not notice???", 
    "review_date": "2009-01-12"
  }, 
  "YE6MfcqTdqrqPgubWfYJ4g": {
    "user_rating": 3.0, 
    "user_location": "Providence, RI", 
    "user_name": "Rob K.", 
    "review_text": "I love this place.  It reminds me of the little hole in the wall Italian joints back east that kick out an authentic, tasty meal for a reasonable price.  Marinated beets in the all-you-stuff-down-your-gullet salad, endless bowls of home made minestrone soup (add a splash of olive oil to kick it up) and the veal tortellini, the osso buco, the saltimboca...  The Italian bread is always fresh, the olive oil is extra tasty (and virgin-like) and the service is always excellent.  Bonus points for the tables being close enough together so you can see what others are ordering and meet interesting folks from around the country who head in here just before the BBBabylon show next door.    I would have given it 4 stars but the last time we went in, they forgot to remove several of the bay leaves from the minestrone and we accidentally ingested a few.  non e' buono.  Been here a few dozen times and will go back many more times...", 
    "review_date": "2006-11-08"
  }, 
  "eo0tmepvnDLQfpY2O78o_A": {
    "user_rating": 1.0, 
    "user_location": "Chico, CA", 
    "user_name": "Sam P.", 
    "review_text": "I'll leave it to other readers' to determine if I'm a pretentious asshole or not, but that being said.....  Hands down the worst restaurant I have ever been in and I am a restaurateurs' kid.  I made the mistake of telling my waitress (great service BTW) that my food tasted \"off\" and she kindly returned it and offered me something else.  I declined, but was grateful for the good service and let it go.  A minute later the manager came over to the table ( I was out with my future in-laws) and began bellowing about how HE'D tried the food off my plate in the kitchen and he thought it was fine.  The entire restaurant turned around to gawk at the scene and we left shortly there after.  It was a lot of fun!    Anyway, service good, food overall OK, but the whole place stinks like urinal mints as the Men's is smack dab in the middle of the dining room.  You could not pay me enough to go back!", 
    "review_date": "2007-09-21"
  }, 
  "5tA6XMewAx5PWZHGSgwWbA": {
    "user_rating": 3.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Marshall W.", 
    "review_text": "Nothing to complain about here!  We were a party of 46 and Capps performed wonderfully.  I had the pork loin, wife the eggplant, and both were prepared well.  This lunch was fully featured; soup and salad, bread and butter, coffee and spumoni for dessert.  We were served promptly, and finished to be at Beach Blanket Babylon next door on time.  I read all the Yelp reviews and none of the bad parts happened to us, so I guess I am lucky, no?  This place is not \"fine dining\" -  it is what it is.  I would go back again and that is a compliment.", 
    "review_date": "2012-12-03"
  }, 
  "vM8OfDVTkwkVNsdNaKeHYA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Larry F.", 
    "review_text": "Well we're at Capp's Corner again!  What a great way to spend the day after Christmas!  Today we had about 40 people and they took great care of us again.  From the minestrone soup which is now completely vegetarian to the house salad to all the entrees which are wonderful to the spumoni ice cream for dessert.  I still love the calamari lunch!  Thank you Capps!!", 
    "review_date": "2014-12-26"
  }, 
  "bNLhIisdfB4je0kvq1bUkQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cathleen G.", 
    "review_text": "Delicious food.  For entertaining out of town clients who want a fun atmosphere with a flare for the feel of old north beach.  Also if you don't feel like making momma's home sauce for your visiting guests - take them here.  The staff is welcoming and patient even when it is packed. I've had dozens of delicious meals too at the bar area after a hard day's work - where you can strike up conversations with other down to earth folks.", 
    "review_date": "2008-04-02"
  }, 
  "sFFdPjsKWMfZA0FbAK9pEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren S.", 
    "review_text": "If you have an Italian grandmother who insists on overfeeding you, this place probably smells like her house. That was the first thing I noticed, and I immediately liked it. This place doesn't have the best Italian food by any means, but it seems really authentically Italian. Like, my Italian relatives who are total racists --wait, let me rephrase...my relatives who really like Italian food and that's why they only eat at Italian restaurants would love this place because it's like eating at an Italian person's house. No I will not articulate that further, if you don't know what I'm talking about that means you are clearly not a wop with dago shame.  Ok fine, what I mean is they give you a lot of food, it comes with shitty white bread and butter, the marinara could be better but it's decent, the Manhattan I ordered came in this tiny glass, and the red and white checkered tables looked like they had been there since this place opened 50 years ago. This place is less upscale than the Olive Garden but totally genuine and has great service.   We kind of had to wait a bit so the waitress brought us complimentary garlic bread and charged us for a bottle of house wine when the bottle I wanted was out and she brought us a bottle of Gabbiano Classico, which I actually really liked and went well with the food. I really like when I get great service without getting smoke blown up my ass if I can say that without Yelp HQ taking down yet another of my reviews (I cunt believe those cunts sensor me like that when they aren't busy licking Mike Z.'s old saggy ballsack). Our server (Courtney? I don't know if I'm remembering that right but she asked for our names and I told her Lauren and she ended up calling me Lorraine which, whatever, I'm totally fine with) was really sweet and generous but she did tell us basically to sit the fuck down at the bar and she'd come get us when a table was ready. She kept it real, like this place does with everything else. Also, she was majorly hot and I'd totally scissor her if she's reading this and interested. Not that I'm going to insinuate that I heard from someone who heard from a cop that this place has mob ties because that would be fucking stupid of me and totally untrue by the way, but if I did, she would be like the Adriana from the Sopranos of this place.", 
    "review_date": "2011-06-06"
  }, 
  "I4fws8Fp2ornBJ_zeqlyMw": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Mr. Fist o.", 
    "review_text": "Sorry, this place is a dump.  It looks like a dive bar with some red-checked table tops (not table clothes, mind you) serving food from a can.  The soup and salad are brought out in metal mixing bowls with serving utensils that look like they're from Goodwill, and neither of which is any good.  Poorly seasoned and cheap tasting soup, chopped iceberg lettuce with some store-bought dressing.  Plates and bowls are old and dirty, flatware is cheap and flimsy with paper napkins and not enough of them.  I had the fettucini with prawns for my main...ughh, overcooked, gummy pasta, under seasoned and dry, dry, dry. The prawns were at least well cooked, and didn't taste frozen, like I expected, but weren't deveined properly!  Poop chute city, f-ing nasty!  The GF had spaghetti with meat sauce that was nearly inedible. Very Chef-boy-ar-dee tasting.  Didn't complain, cuz we weren't paying...it was a family thing...but will never go back. Much too expensive for garbage food.    One star is for the service...very well paced and attentive.  Never had an empty water glass or in need of a drink and very friendly.", 
    "review_date": "2010-10-13"
  }, 
  "CUwzHGjRPSNLEy6r-CrOqw": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Chris C.", 
    "review_text": "A Train Wreck That Has No Business Using The Term Family Style.  An Overpriced, Underflavored Disaster Barely Better Than The Spaghetti Factory  Yikes!  I only went here because an out of town visitor picked it.  The only positive: The hostess was friendly, helpful, and accommodating.  The waiter certainly was not.  The thick, stereotype/cliche Italian schtick did not help (and if authentic, maybe tone it done and focus on service it bit more; .and would it kill you to be a little nice to younger customers?)  Now, on to the food.  First of all, don't claim to be \"family style\" if the only food shared is salad and soup.  Can't we get that at the Olive Garden.  And the soup?  I've tasted better from a can.  The salad was a fresh tasting but lackluster.  My grilled leg of lamb was ridiculously overcooked (near mushy) and over-drenched in brown sauce.  For \"seasoned\" lamb, it was bland.  I've had 3X better at 50% the price at Opa Opa here in Sacramento (and that's a small, mid-to-lower end place).  As was the veal milanese I sampled.  At least the side vegetables were very fresh, though also overcooked.  Dessert?  Coffee?  Who knows.  They only have ice cream (that, as one reviewer pointed out, you nearly have to beg for) and basic coffee.  The places was so bad, I just couldn't bear to tell the nice hostess when she checked.  I often think that place near key tourist spots (in this case the hit show Beach Blanket Babylon) get away with a lot because of their location.  That being said, it's not a good sign when the place is only about half to two-thirds full on a Saturday night.", 
    "review_date": "2012-07-14"
  }, 
  "jxlwyBlSbYQ59IxVU70_Yg": {
    "user_rating": 5.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Charlie C.", 
    "review_text": "Family style Italian food North Beach style. This place is in fact an institution. They make most of their dishes fresh here. I used to work on the wharf and would pass by this place smelling the beginings of Ministrone soup being made. This place has fantastic dishes and a wide variety of them.  Generous portions and served in a timely manner. The seating is at long tables Festal style also known as family style.  You get to meet people and share a fantastic meals. The hostess can handle drunks, tourists, old times or harried theater goers who are taking in a quick bite before going in to catch a showing of Beach Blanket Babylon at Club Fugazzi. She has been a fixture here for years.  The Bar can serve you up anything you can think of with ease and speed. Thinking of causing trouble? Think twice as you look at the old Louseville Slugger behind the bar which has seen several altercations over the years. There is parking available at several garages nearby but you will have to get there early. This is a must see if you are visiting North Beach.", 
    "review_date": "2008-04-03"
  }, 
  "zLHd86ObxLWdX34L3kUlGw": {
    "user_rating": 1.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Mike M.", 
    "review_text": "From the moment my girlfriend and I walked in here we felt completely unwelcome. The hostess was flippant and seated 3 parties before us who had arrived later. Waited 10 minutes at the bar before we even got a drink. Then the hostess didn't walk us to our table. The waiter simply asked \"you know what you want?\" The food was decent but nothing special. The highlight was the attentive busboy. We tipped him more handsomely than the waitstaff. Overall, a really rude waitstaff and a bad environment.", 
    "review_date": "2013-08-11"
  }, 
  "mB50b5XbG05whEBXkQRA-w": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Nancy M.", 
    "review_text": "A family favorite!  A North Beach Treasure.  We just had a family reunion dinner here on Saturday Night.  The atmosphere and good service allowed us to reconnect with family, and introduce this SF treasure to our relatives from Italy.  Capps Corner never fails with ample family style meals.  A must visit!", 
    "review_date": "2015-01-05"
  }, 
  "rQrX_XZ2olx0lnZwAbAzAA": {
    "user_rating": 1.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Kim C.", 
    "review_text": "Inept service. They told us it would be a 10 minute wait and then 30 minutes later they seated two groups who arrived after us before starting us.  They barely apologized. I suggest giving your money to restaurants with the professionalism to take care of all guests in the order in which they arrive.", 
    "review_date": "2013-08-18"
  }, 
  "Iz6ajV7u5GR5UYuw2z7Smw": {
    "user_rating": 4.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Garrett G.", 
    "review_text": "I went to this restaurant for my friends going away party. I was surprised at the pricing but I guess you do get a lot of food for it. I had the spaghetti a meatballs and all together I spent 25 dollars. No joke. It was a good size serving but not 25 dollars worth. They did also bring a large bowl of minestrone soup for our table of 6 to share, a large salad, and 2 loafs of bread though. However, I would rather have just gotten my one spaghetti dish for much cheaper and skipped the salad and soup.  BUT, the food was really good, don't get me wrong.   It was odd though, about half way through our meal the waiters sat 2 other people at our table. I don't know why they couldn't have moved the table since we had 4 tables pushed together and weren't using the 4th. Whatever, those guys got to listen to 6 college students reminiscing  on our drunken times together and plans for even more shenanigans for junior year.   Oh, and they get pissed if you split your bill with more than 2 credit cards.  Parking is also a bitch but there's a pretty cheap garage on Jackson street. 6 dollars for 2 hours.", 
    "review_date": "2010-08-15"
  }, 
  "sM9eEe423__2zdsXv8XJTQ": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Nancy F.", 
    "review_text": "I took an elderly friend of mine (91 yo) to Capp's Corner for lunch the other day. CC was an old favorite haunt of hers and I had never been there. First about the staff - they couldn't have been more solicitous and helpful and kind. I was so grateful for their attentiveness. And then we simply had minestrone and a kind of Italian beans/green salad with a creamy vinaigrette dressing. Both were delicious, low cost and their was so much, along with the fresh sourdough bread and creamy butter, that we were stuffed and happy by the time we were done with lunch. Plus the coffee was top-notch. Therefore the 5 stars.", 
    "review_date": "2010-10-21"
  }, 
  "lF6EbR0ikhvegGdm4SetjA": {
    "user_rating": 4.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Lu G.", 
    "review_text": "House salad + soup. Chicken parm, filet sole, decent portions. Friendly and attentive service.", 
    "review_date": "2013-07-07"
  }, 
  "klPD5xE6_L-1fsMIHD5GYw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "W Y.", 
    "review_text": "This was a nice family-style italian restaurant.  It had a cozy feel to it.  My guess would be that it's family owned because it felt like they cared about their customers.  The food was good, the service was good.  Overall, I had no complaints.  I've certainly had better italian food, but at the price point, this place exceeded my expectations.", 
    "review_date": "2009-07-26"
  }, 
  "vU9EkdRbQQr3V08mXmOmcQ": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Nancy P.", 
    "review_text": "Authentic Italian....hard to find these days....come here before taking in a Beach Blanket Babylon show....parking a challenge....as always in SF....There is nothing on the menu that isn't good.", 
    "review_date": "2008-03-21"
  }, 
  "UBVj_v0JVMwuV5hqo-FDdA": {
    "user_rating": 2.0, 
    "user_location": "Fort Mitchell, KY", 
    "user_name": "Lennie C.", 
    "review_text": "It was ok.  I have experienced much better Italian places in SF.  It was crowded and the service was ok.  I was unimpressed with their flavors.", 
    "review_date": "2012-02-13"
  }, 
  "WdfVd3N3muedHNAxQuUktg": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Chris B.", 
    "review_text": "I'm a little biased towards Capp's cause I like the loud bar in the background and I used to work two doors down at Beach Blanket Babylon.  If you want a quite little dinner, then don't go on a night that there's a show down the block, cause it gets LOUD!  You'll be safe before 8 in the evening on just about any night though.  As far as food is concerned, don't go traditional Italian at this place.  The basics are not very good, don't do marinara or spaghetti with meat sauce or any of the usual stuff.  Get the special  or save yourself the headaches and get the Veal Tortellini which is epic.  The pasta is just firm enough to hold all the innards of the tortellini inside and the sun dried tomato sauce on top is just the right combination of spicy and tangy.  The portion is more than sufficient and depending on how much of the delicious Minestrone, made on sight, and house salad you eat beforehand, you may have leftovers.  Take it home!  I ate mine at about 2 or 3 in the morning as a insane dream inducing snack.  I love cold pasta late night and this was one of my better experiences.  If you are up for it, hang out at the bar afterwards with Terry and Rose.  Two great characters that add some fun and entertainment after a few glasses of wine with dinner.  Terry won't kick you out at the supposed 11 o'clock closing time and we managed to keep him there til the bar across the street started closing up.  I know some of the actors from Beach Blanket Babylon and they will be glad to entertain you with their antics and grab ass.  Be ready to be friendly or you won't have a very warm welcome and may get a few cross words.  Don't worry though, everyone is always welcome at Capps as long as you are ready to take and give a smile.", 
    "review_date": "2007-10-03"
  }, 
  "X-GtUMe6QSoPE_kkiXkJKQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg M.", 
    "review_text": "I thought the rude reservations was just a part of the charm until our reservation for 12 for a birthday party showed up and the restaurant said they \"lost\" it.  F' that place!", 
    "review_date": "2011-07-04"
  }, 
  "ehIpQo8mQHxhNIq7WAwKFw": {
    "user_rating": 4.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Kimberly W.", 
    "review_text": "Old school family type restaurant, but they've added a bit of modern touches to it, like the 2 tvs by the bar.  Old school cash register with a mini credit card swiper to the side. All the tables are long and can seat a group of 4-20 people. You don't want to come here alone anyways because the food portions are huge and family style.  I have only tasted the bar so far but am tempted to return to try some", 
    "review_date": "2010-12-26"
  }, 
  "zpXqbJQ2CT4PsUBTy30DbQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jenny W.", 
    "review_text": "Great little family owned, family style Italian restaurant.  The wine is SOOOO cheap.  Had a glass of Chianti for $3.50.  Love the ambience and not so crowded feel.  You automatically get really, really good, hearty minestrone soup to start no matter what entree you choose.  Then comes toe salad which is awesome as well served with beets, chickpeas, and another sort of beans in a creamy Italian-esque dressing.  There are about 10 options for $17 and 10 option for $20.  The pastas are on the cheaper side.  My friend ordered penne with marinara which looked great. I had the chick parm, which was delicious. Came with a small side of penne and a squash and carrot melange of veggies.  Overall, 4 stars b/c the service is kinda slow. but other than that, everything was fab. Loved the ambient feel of this place.", 
    "review_date": "2008-05-28"
  }, 
  "8YGHgREwGVHE5WKXDk1DIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valerie G.", 
    "review_text": "I ate here last night by total accident (the place we intended to go was mysteriously closed on a friday night) and I am so glad! It smelled delightful from outside, and the three of us were hungry so we decided to give it a shot. After a brief wait at the bar (bartenders were friendly and skilled) we sat down and eagerly eyed the menu. Ordering is made simple, two categories of entrees ($17.50 or $20.00) and everything else is included.   Between the three of us, Roasted Lamb, Veal Cannelloni and cheese ravioli was ordered. along with the entrees came a large tureen of minestrone soup and another large tureen of clam chowder (so good!) then there was salad and of course bread. Meat entrees also came with veggies and pasta on the plate. Trust me when I say you won't leave hungry!  The staff was great. We never had to wait for anything we requested, and I watched in awe as our waitress dealt with *very* rude customers with total grace. Leave your diet at the door and enjoy a lovely meal- bring friends for maximum good time (this place is not another cozy, dark italian place in north beach)", 
    "review_date": "2008-02-02"
  }, 
  "zW6RawW6kK8sKA2ruDKhMg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David O.", 
    "review_text": "I came here for the first time after with some family visiting from out of town, mostly because we wanted to show them the area and they could accommodate the size of our party.  I won't go back, at least not for the food.  They say they are family style, which to me sounds like large portions and sharing entrees.  Their version of family style means that they bring out the soup and salad in big bowls and you serve yourself from the communal bowls.  That's cool, the minestrone was alright.  In general the service was ok, but not friendly.  I ordered the Lasagna which was fine, but completely forgettable.  Portions were about right, but certainly not large enough to share.    Basically, it wasn't what I expected and it wasn't terribly good.  I wish we had gone to Valencia Pizza and Pasta in the Mission.", 
    "review_date": "2010-06-10"
  }, 
  "NrxsUYEx6wEMSXjSM6Omlw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michelle A.", 
    "review_text": "**AVOID THIS PLACE***  I was very disappointed in this place.  I have heard great reviews from friends and now that I have told them what happened they also are very disappointed.  We went and had reservations as a group of 14. There was a bartender that had an attitude of a nat.  When I expressed I wanted a drink that he didnt know how to make he just had this look like, \"Really?\" I explained how to make it then the glass was left with over an inch of empty glass to the top. Then you basically charge me $10.00 for a drink that was not even filled to the top of the glass.  Other people ordered drinks and they were charged $8.00 and they still didnt have the glasses filled all the way.  Maybe you should get smaller glasses.  OHHH WAIT.. You had smaller glass that a friend got a vodka and cranberry in and it was Very Cranberry with very little vodka. Then during the Bartender change over, The newer one apparently was a New hire and still learning.  The Food was nothing real special and very bland. Everything including the soup tasted like it was out of cans.  I don't mind canned stuff but you could add seasoning and spices. The Burnt garlic bread that came out was.. ummmm Burnt... But it did have garlic seasoning. =) I ordered t he soup, Pasta and salad for like $15.50 and the meat sauce was bland. But... The noodles were cooked well.  The Waitress with an attitude. Let me see Where do I start,  Where she asked us to hurry up and finish our food and drinks and was not going to offer dessert?  She wanted to tables for others that were not even there. She had short Black hair, White top and top heavy. She was very rude to some of the people in the party and her tone needed adjustment.  When I asked her name I think she said Sherry, then she said; \"  And you can call my boss tomorrrow if you want.\" So, She already knew she was rude.  She made comments to the other servers and they just laughed it off and her body language towards us was un acceptable.   We went here because we were going to BBB and I am not sure if the restraunt is used to just locals but I would never reccommend this to anyone. Such a shame.  I just called to speak with the manager He said he was John and He said he was sorry, as I was just expressing more detail and he said he was not going to fire her but he'll have a talk with her and he hung up the phone.  WOW these people have no manners or consideration.", 
    "review_date": "2012-09-28"
  }, 
  "kTUQpHyIW-W9Hi537DyQAA": {
    "user_rating": 4.0, 
    "user_location": "Angleton, TX", 
    "user_name": "Michelle D.", 
    "review_text": "Good food and great for before or after the Beach Blanket Babylon show since it is next door. I didn't like paying 10 bucks to split my husband dinner when all I wanteed was soup and salad. We were short on time because I needed to get in line for the show. I actually had to leave before the veal tortellini arrived.My husband said it was good. I also liked the atmosphere. I would return. The soup was great.", 
    "review_date": "2010-08-11"
  }, 
  "lTRdr5P664kWt4woydLbuQ": {
    "user_rating": 2.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Scott N.", 
    "review_text": "If you like bland, tasteless food, you're going to love the penne meat bolognese at Capp's!", 
    "review_date": "2013-08-24"
  }, 
  "xLVHXFZ1gi6xP5L_AmUxFg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "This is my first Yelp review, and I had to do it...because I was so disappointed in Capp's corner.  My husband and I just moved to San Francisco and we decided to go to North Beach and have a nice Italian dinner.  I hate to say it but this restaurant gave us such a bad impression of North Beach as an overrated tourist trap.  The decor was cool, in that old school, family-style Italian way, and our server was nice.  But...the food! What a buzzkill!  I mean we were really psyched to be in a new city about to get some authentic Italian food in cozy Italian North Beach and it just wasn't good.  The food was bland and basic.  My ravioli tasted like chef-boyardee!  I hate chef-boyardee!  The sauce tasted like it came from a jar.  Real Italian cooking is based on the idea of using simple, fresh, seasonal ingredients.  This place tasted like everything was pre-made and definitely not fresh and flavorful.  I probably should tell you that I grew up Italian-American in New York, with AMAZING cooks in my family.  I'm very spoiled when it comes to Italian-American cooking (and my husband is too now, by association).  Needless to say, the place was cute, but it really was not an enjoyable meal because of the food.  We definitely would not go back to Capp's corner.  I can cook better pasta at home for an eighth of the price.  We just left feeling like we totally made a bad choice and wasted a ton of calories for our \"welcome-to-san-fran-north-beach-date-night-­dinner\".  I guess this place would be cool if you didn't know \"real\" italian-american cooking, but if you do, then don't bother.", 
    "review_date": "2007-09-14"
  }, 
  "CE94k01X3W3TnBwOZb3HQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna M.", 
    "review_text": "Went for dinner on a Sunday evening.  It wasn't crowded by the time we walked over around 5pm. The menu all looked so good, but we ordered the linguine with marina mussels and clams  &amp; the fettucini with prawns in white wine sauce.  The server was attentive and polite but didn't smile the entire time.  The buser was very attentive and our water cups never got ignored ( i love that bc i drink a lot of water )  Also, the buser cleared our plates quickly and the server never crowded the table... we got everything after we had obviously  finished the prior dish.      This place has a comfy feel and not in the dive bar kinda way, but a homey one.  It has a lot of seating and the cost of dinner for 2 plus wine was less than $60.  It's a great place for a date and also big family gettogethers.  I have been before and will definitely be going again.  4 stars because the waiter didn't smile enough  the service was good, but not beyond exemplarily", 
    "review_date": "2014-09-27"
  }, 
  "1m4Hmm7IbgGjVupM7CQSMw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki M.", 
    "review_text": "love the feel of the place...totally old school northbeach. The waitress was awesome. Food was kinda bland and pretty overpriced considering what it is. I'd totally go there for family style soup tho! :)", 
    "review_date": "2006-06-22"
  }, 
  "Uuhb9K_AsOST6A7yKpIuBA": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Greg B.", 
    "review_text": "Capp's Corner has a special place in my heart. We stumbled upon this Italian jewel  a few years ago and have been going back ever since. I love the decor! Old School. They used to have a neon sign that said Capps Corner inside the restaurant. The last time we ate at Capp's the sign was gone...but the great service and delicious spaghetti and meatballs were still there. The bread and soup are excellent too. I like everything about this place. If you're a pretentious asshole you might not like this place.", 
    "review_date": "2007-01-13"
  }, 
  "OYR-CS6ejlwQI7u64dBSXw": {
    "user_rating": 3.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Cole S.", 
    "review_text": "This place is a good, basic, all-around Italian restaurant.  You really can't go wrong here.  The portions are good, the flavors are good, the service is good.  The prices could be a little better, but hey, it's in SF.  I would go back.", 
    "review_date": "2010-12-29"
  }, 
  "EuVIu9CfmsWX8hkAnZsQFg": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Tamara A.", 
    "review_text": "We had a pleasant lunch here over the weekend.  The service was fabulous and the atmosphere is really cozy.  The minestrone soup and salad were really excellent.  My dining partner enjoyed the italian sausage sandwich.  My pasta dish was ok, but the shrimp was overcooked and the pasta sauce was a little short on flavor.", 
    "review_date": "2012-07-17"
  }, 
  "bqsuQIfgv51v-9TxFR19bQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Tina A.", 
    "review_text": "Long time fav!!!", 
    "review_date": "2011-09-15"
  }, 
  "WMfhqsUYtoY2ugRaiKoPJQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Master C.", 
    "review_text": "Food is below average Italian American diner schlop but the nail in the coffin is a $10 charge to split an entree.  Bullshit!", 
    "review_date": "2009-07-01"
  }, 
  "1I1Zr6yuTkyPRiqe8qD5Ow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabrina L.", 
    "review_text": "I love this place and go as often as possible. North Beach at it's best, old school, family style, great food and they don't rake you over the coals when the bill comes. Plus great service with a real family feel.  Dinner for two: 2 Cocktails Soup, salad &amp; delicious Italian bread 2 Entrees  A bottle of Pinot Grigio  and 2 shots of Fernet for dessert :) all for 80 bucks, you just can't go wrong. Like i said, I love this place!", 
    "review_date": "2009-09-07"
  }, 
  "e2MIDX_YWVVQl7-t-SJf-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittney B.", 
    "review_text": "A solid place to go before Beach Blanket Babylon (then to North Star, of course).  Is it a place I want to go to every weekend?  No.  I'm satisfied if I go there once every 2 years.  You go more for the charm than for the food.     I also go because the corkage is only $10!", 
    "review_date": "2009-12-11"
  }, 
  "ueYNL6GNxCz2Pm4ZP8vpOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter T.", 
    "review_text": "I want to say as an update to my review that the following individuals are to be the best there is at Capps. Joe the bartender who works the weekends is the best bartender that I have known who really knows how to make everyone happy and is down right the best. He has the greatest attitude and the he also makes the best drinks.Besides that he also knows many things about the city. Then there is Jack. He has the funniest comments and knows quite a lot about the area and very up to date on news and other things happening around the city and last but never least is Nicky. This waiter and all around knowledgeable person is so kind and easy going and never seems to get upset about anything. This place is fantastic.", 
    "review_date": "2009-11-12"
  }, 
  "eX35VTC_tQH8TqygIrUo2Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lynn p.", 
    "review_text": "We aren't picky. Went for a nice family dinner Sunday night. My sons fettuccine Alfredo ( they said sorry ran out if fettuccine we gave you spaghetti  ) was barely edible. I ordered pasta garlic tomatoes. Tried adding as much salt as I could to season it. Horrible. Won't be back. Employees were friendly.  I just was disappointed that our night in North Beach was celebrated with bad food.", 
    "review_date": "2014-12-20"
  }, 
  "UuxiH2oLycDhMv7TKQ5EVw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy A.", 
    "review_text": "Ever want to feel like you're in an episode of The Soprano's or Goodfellas or something? Go in and have a drink or two at Capp's.   This place is decked out like a classic Italian diner, the red checkered tables, the smell of pasta and meatballs, classic old wood bar, the works. When you think of an old style North Beach eatery, this place is one that should come to mind.   I wish I could comment on the food here but alas, I've only ever had cocktails here. I definitely intend to enjoy a meal here after the few times I've enjoyed drinks in there.  Salute!", 
    "review_date": "2009-02-10"
  }, 
  "m6p5knAyIS79s6WNbeIdGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen E.", 
    "review_text": "Nothing fancy but very enjoyable. The service was solid, the prices are very reasonable (especially for wine) and the food was basic yet yummy. I sat here last night for hours drinking wine and enjoying yummy Italian food. I will definitely be back.", 
    "review_date": "2010-02-16"
  }, 
  "G5Ykk0BSuDNsoXeLrIyZcA": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "OSEPH E.", 
    "review_text": "somebody took the ronald reagan picture off the wall! it was there for as long as i can remember.now when i walk in the first thing is \"where is reagans picture\"? the cook manny is top notch,i prabably won't return untill reagan comes back.", 
    "review_date": "2008-08-05"
  }, 
  "6KwXl86DhNZn2nJH8GcdIw": {
    "user_rating": 1.0, 
    "user_location": "Outer Richmond, San Francisco, CA", 
    "user_name": "Bartyra P.", 
    "review_text": "They are lucky I need to add a star, because honestly this place deserve 0 stars. The atmosphere was great it felt like a real old San Francisco spot, but the food was TERRIBLE !!!!! The restaurant was very full and me and my husband, son and sister we were excited to eat some good Italian food. The waitress she was good busy as hell since the place was packed and she was the only waitress.  Suddenly she brought us soup , everything in the soup since is part of the family meal, all the ingredients of the soup were out of the can that automatically start giving me pain in my stomach. Than a hour later they brought was the salad swimming in sauce(dressing) there were so much dressing that was nasty to eat. The salad was complete with thousand island dressing and can beans and can garbanzo beans. We all start to be nervous about our meal that was about to come. When finally the food arrived almost a hour later, it was horrible the vegetables were swimming in butter and super soft. I order the chicken parmigiana what was full of marinara sauce and the chicken it self had no flavor it just taste like chicken. The pasta was over cooked and with marina sauce. I felt like I was eating in a all inclusive buffet, I even think that all inclusive buffet would be better. My husbands food was terrible as well he order the sole and was burned, my sister osso buck was so nasty that she tried and was not able to eat. The polenta that came in her plate was so horrible so horrible that I don't think I have words to describe. The worst of all was the time that took for the food to arrive, my son who is 3 had to wait almost 2 hours for a plate with pasta and tomato sauce. Seriously. Just very disappointed I have been in SF for 10 year and have never ate that bad.", 
    "review_date": "2014-12-08"
  }, 
  "OBzOoEpUTXgC8YONTygyNQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John M.", 
    "review_text": "Truly disgusting! I was there the other night and watched a bartender who had poured too much club soda into a drink, realize it then pour it through his fingers into another glass and serve it. A few minutes later I watched a waitress fish out a piece of cork from a glass of red wine with her fingers and take it to the table.  This place is really nasty!  The wine, by the way,  was Crane Lake (about  $5.50 a glass)  which sells at your local overpriced corner store for about $5.50 a bottle.", 
    "review_date": "2007-12-07"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Came back after almost 10 years. Huge delicious portions. I used to think it was expensive - now I think it's cheap. Soup still rocks (minestrone doesn't describe it - it's a yummy bean soup.) REALLY NICE SERVER.", 
    "review_date": "2014-10-25"
  }, 
  "CxzDJHk4P1tA-ze3hrEyhA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff B.", 
    "review_text": "Best Italian food I've had in California, and the staff is very attentive.  The portions are unreal, and the cost is quite reasonable given the large portions.  I highly recommend the minestrone.", 
    "review_date": "2009-03-17"
  }, 
  "6YnpPhuKaGUDOEIpkR7uFA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "michelle r.", 
    "review_text": "Excellent Italian restaurant. It's family style which makes it even that much better. Had the Red Snapper in a lemon butter sauce... umm... yeah, sooo good! Their spaghetti and meatballs was also fabulous. And their linguini with claims and mussels in a white wine sauce. All dishes were great in a very friendly atmosphere. Oh and the bottle of Cab was dope too. Overall, excellent experience and excellent food.", 
    "review_date": "2008-05-09"
  }, 
  "luJuzuWOpA7bF0V2b-OVuw": {
    "user_rating": 3.0, 
    "user_location": "Novato, CA", 
    "user_name": "Mary B.", 
    "review_text": "My friends and I came here a couple of weeks ago after the North Beach Festival. We were a party of 8 who showed up unexpected and only had to wait about a 1/2 hr for a table. For such a small place I was shocked that it was only that long. They had a great family style serving for the beginning salad and soup courses and then our entrees came out at a reasonable time.  Service was great except towards the end when the waitress didn't want to split our checks and said we could walk across the street to get cash out, we fought her a bit and she finally said she would do it. We weren't being difficult with different charges, just wanted the bill to be divided equally between us all. Other then that, it was a great experience. Would definitely come back again!", 
    "review_date": "2010-06-25"
  }, 
  "IdU4HMUZFzN63_bGfn66-A": {
    "user_rating": 3.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Christine C.", 
    "review_text": "Chose Capps at random as it was near Beach Blanket Babylon and looked like a cool old-style place. It was OK, but next time in North Beach I will definitely try somewhere else.  Porkchop in Mushroom sauce - the sauce was the best part! While it was a full bone-in chop, overcooked for my taste and a bit tough.  Minestrone was great! think and not as tomato-ey as some can be.  Salad nothing special with iceburg lettuse and canned beets.  Dining partner had petrole sole - tasty yet swimming in butter.   Perhaps if we had ordered an Italian staple like ravoli or lagagna we would have had a better experience. I did like the red sauce on my side pasta.  Noise level very high, seating is crowded and waiters are a little gruff.  If that's the ambience they are going for, good job!", 
    "review_date": "2012-11-04"
  }, 
  "_BHTC7nyCBoZcfiiD5cOXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gourmet G.", 
    "review_text": "This is typical of a dozen or so family-style restaurants that proliferated in this area for years, although most of them have been replaced by upscale bistros that cater to more contemporary tastes. Capp's, on the other hand, probably will be here forever, no doubt with the same original decor of a generation or two ago. This popular restaurant reeks of San Francisco history, its walls covered with fading autographed photos of old-time celebrities, including hometown hero Joe DiMaggio and Marilyn Monroe, who were regulars here. This is not a place for anyone in search of gourmet dining or nouvelle cuisine. The food here is hearty, wholesome Italian fare like Nana used to make every Sunday afternoon. Most popular are the $17 dinners, which include a huge tureen of decent minestrone, a salad bowl overflowing with crisp greens, beans, and beets slathered with a creamy Italian dressing, and pasta marinara and sauteed vegetables accompanying your choice of entree. Selections include calamari steak, osso bucco, baked eggplant, sausage with roasted bell peppers and onions, roasted pork loin, and roast leg of lamb, nicely pink and succulent. The $15 menu includes the soup and salad, but entrees are limited to various pastas. Fresh, doughy Italian bread is perfect for dipping into the soup or sopping up the nicely spiced sauces. Service at times can border on being insufferably rude. One suspects that the older servers here have been standing on their feet so long that their temperaments are permanently crabby. An ideal spot for families and groups. Sophisticated foodies definitely should dine elsewhere.", 
    "review_date": "2005-07-14"
  }, 
  "5ZpL7gDK75N_-9k2x4Qh0w": {
    "user_rating": 3.0, 
    "user_location": "Marin County, CA", 
    "user_name": "Megan W.", 
    "review_text": "Came here as part of a large (and boisterous) group over the weekend. Our server, Sherry, was very sweet and very QUICK!   Onto the important stuff - the wine list is very....ehhhh. The glasses are very affordable, but don't expect any sparks, even by the bottle.   Food: You start with a huge vat of minestrone soup for the table. It's delicious. Hands down the best part of the meal. The salad...ehhh. It's drenched in dressing that is very thick and cloying. Entrees: They are all over the map: I had simply fettuccine noodles with pesto. The pesto itself was good, but the noodles were a bit overdone, and subsequently settled in my stomach much like a brick would. My BFF had the marinara pasta, and she cleaned her plate. Another friend had the pork chops, which she had three bites of and said, \"no.\" Just to round it out, another friend had the seafood pasta, which she announced as one of the best dishes she had had recently.   So, there you have it. It's all over the map. The atmosphere is rockin' in here, and you can tell it's a San Francisco tradition. It's worth a visit just to say you've been to Capps, and the prices are extremely reasonable.", 
    "review_date": "2011-03-22"
  }, 
  "elmJhxmQdwJtKy8y-PL-2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom R.", 
    "review_text": "Alright, there is one reviewer who hit it, you don't go to Capp's Corner for the food if you expect some outlandish culinary experience, just walking in the door should tell you this.  Your plate will not be sprinkled with dots of pretentious sauce.  It is a family place serving food that most of us can make at home -- this is its appeal, because we don't want to cook.  On the other hand, you can get lucky and get a really fine meal.  People like Gloria don't seem to get it.  BBB has been good for this place and so was Keystone Korner, the jazz place next to the police station that no longer exists.  I tell my kids that they will probably not be able to take their kids to Capp's because I don't know how long it can hold out with the suburbanization of North Beach and the influx of people who have no aesthetic sense.  If it was good enough for Herb Cain, it is good enough for the rest of us.  Have been going here since the '60s and have been in dozens of other places in the city that serve better food, but why is it that I come back?  Can't put my finger on it but I love it.", 
    "review_date": "2010-02-28"
  }, 
  "eWoW5HucSzs4G3UTSi2z4A": {
    "user_rating": 5.0, 
    "user_location": "Foothill Ranch, CA", 
    "user_name": "Melissa-Ann Y.", 
    "review_text": "What a great time we had Saturday night at Capp's Corner. Located in North Beach, we took 7 adults and 7 girls for a late night dinner at 8:30.  The minestrone soup served before our meal was so tasty and all our meals were wonderful. I had a steak that was so large I was able to let my daughter have more than half!  The waiter and bartender were fantastic. They even hailed cabs for us (we needed 4) at 11:30.   We tried all sorts of food, most people had pasta and they raved about the ravioli.   I highly recommend Capps.", 
    "review_date": "2014-05-06"
  }, 
  "TZExGajxC02oetl7iQ77eg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H.A. ..", 
    "review_text": "Horrible experience...  I got  very sick within 20-30 minutes of eating the soup/salad course, and before the entree arrived I was in the bathroom for a half hour ... and then they had the nerve to charge us for my dinner.  Adding insult to injury, I had not even touched the main course, but they insisted we pay for the whole dinner because \"you ordered it already\".... unbelievable.  I refused to pay but my date paid while I went back in the can to get sick again.  The waitron seemed to imply to my date that i was either \"already sick when I got there\" or bulimic... so  insulting.  I was neither sick before walking in nor bulimic, but  I was sick the remainder of the evening.\n  Even if it was a food allergy (I'm not aware of having any food allergies), or a case of \"instant\" flu with no other symptoms,  and not something in the food like MSG or some other thing, it seems odd to me that a restaurant would charge for food when the diner immediately experienced extreme gastric distress after eating some of it, whatever the reason, and particularly strange to charge for the entree which wasn't even served prior to the onset of the distress, and certainly was not wanted.  \n  Most restaurants allow diners to send back food that's unsatisfactory, for whatever reason, and either replace the dish with something else or, if the diner has lost his or her appetite after sending it back, do not charge for it.  Not here.  \n  I called them the next day to complain and they expressed no regrets for how the situation was handled and cut the conversation off.  I found the whole thing unprofessional.", 
    "review_date": "2005-08-14"
  }, 
  "QVAmRIrCxhYLqh7wl4Vlog": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen D.", 
    "review_text": "This place has a cool vibe, fast and friendly service, somewhat tasty food, and somewhat high prices.   + The waiter checked on us so many times and was very friendly + Cool art everywhere made for a nice atmosphere + Wait times weren't 't too long + When we ordered soup for 4, they gave us enough for around 5 servings + The garlic bread was cheap and had lots of garlic - Prices were a little steep for the portions - My vegetables were soaked in a huge pond of butter that flowed all over the plate - The chicken parmigiana wasn't crunchy but instead kind of soggy. I have to blame the weird consistency on that pond of butter nearby...  All in all, this place was A-OK.", 
    "review_date": "2010-02-21"
  }, 
  "8VmxAELPm0CKpKrZnS6NKg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth S.", 
    "review_text": "I worked next door to Capp's (at The Blanket) for 3 and half years, and during those 3 and a half years, I spent just as much time at Capp's as I did backstage, rarely sampling the cuisine. I can tell you some things about drinking at Capp's, though. Boy, can I.  There was a time when the late, great, legendary bartender Neil would see me walking towards the front door and by the time my ass hit a barstool, a \"Beth-size vodka tonic with a shit load of lime\" would be on the counter. Neil has since passed away, his photo framed in the corner reminding me of so many happy memories, or lack there of.  Whenever I'm in North Beach, I still swing by Capp's, saying hi to old friends from the Blanket, throwing a wink to the photo of Neil and reminiscing about my drunken, New Year's rendition of Rapper's Delight, a bottle of champagne in one hand and a microphone in the other. Good times...", 
    "review_date": "2006-11-15"
  }, 
  "bgUmuR8ZuLe_nFUVHXLGSA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt B.", 
    "review_text": "It was years since I was there, and I just went tonight, and oh my - not good.  Perhaps if you really don't care decent food or service - sure - go - have at it.  Why did I go? We had a big group. Now they're all mad at me.", 
    "review_date": "2007-05-16"
  }, 
  "xbDuLijIrSV9Tw_x2al09g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jackie M.", 
    "review_text": "It seems like everyone has said it before, this place is an institution.  Everything is amazing, but the best is the Veal Tortellini!  You feel the guilt as you order it, but the second you taste it, it all goes out the window.  So yummy and it feels like family here.   Great old school family style Italian food.  Their minestrone alone  is worth the trip.", 
    "review_date": "2008-02-18"
  }, 
  "tGju_rBrS8UXBQxbpjukcg": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dude D.", 
    "review_text": "I was really looking forward to experiencing this restaurant again, but never got the chance due to their minimum order per person.  Our family was trapped in SF after a huge traffic snarl, so we decided to have dinner in North Beach.  We ordered wine, kids had Shirley Temples and appetizer order was placed, much to the delight of the waitress.  The fun didn't start until we said the kids wanted to split a meal.  Each person needed to have a minimum \"FOOD\" order and drinks, appetizers and other people's order don't count.  I explained to the waitress that we're stuck waiting for traffic to dissipate and we just got done with a tour of SF ice creameries.  No effect.  Her statement was \"rules are that everyone needs an entree.\"   We walked out.", 
    "review_date": "2011-08-26"
  }, 
  "lNSkba_B8yrvpEuHAi7mXw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marla L.", 
    "review_text": "Love the feel of this place.  Fun place to eat or drink.  The spaghetti and meatballs are tasty, the front bar is casual, it is always easy to carry a conversation and the whole experience is just laid back.  I will definitely keep coming here.", 
    "review_date": "2006-06-10"
  }, 
  "X3zMBh3SLgvrXaRtZ9JthA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pink F.", 
    "review_text": "They fired the best bartender I have ever known and I will never go back there again.  Luckily he's working down the street now- and THAT bar will get all my business from now on.", 
    "review_date": "2013-10-01"
  }, 
  "7SkJ2HcwqTNURER7-lvJ0A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael F.", 
    "review_text": "A really good classic old North Beach restaurant.  Great Italian food.  Three course meal with soup and salad. Close to Beach Blanket Babaylon too.  Nice to take a walk around North Beach afterward.  If you have room, it's fun to walk over to the gelato place for desert and around Washington Square or up to Coit Tower.  Fun to bring out-of-town visitors here.", 
    "review_date": "2007-11-25"
  }, 
  "OK5B_PHxTDlLfhmIV2MxPw": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Rick V.", 
    "review_text": "Capp's Corner is basically a family style, neighborhood Italian restaurant and bar. Great atmosphere... a little dark, wood paneling, red &amp; white checker board accented tables, with lots of pictures of legendary and local celebrities. Place has been around since 1960. Very friendly service from greeting to good-byes. Excellent efforts to be accommodating and make you comfortable. At the bar, well drinks and wine by the glass are around $4.  We had dinner here for wifey's b-day. There were five of us, so there was lots of sampling going on. What we ordered was very good. They must've had their first stringers in the kitchen this night. I ordered the calamari steak with caper sauce. It was so tender and flavorful. Wife had the Veal Milanese, breaded also with caper sauce. She said it was the best, and I had to agree. I also tasted the tortellini, just awesome with a creamy yet light tomato sauce. Grand daughter ordered Veg Fettuccine. It was piled in her plate. Get this, she expected Alfredo sauce which wasn't on the menu, but the waiter took it back and had it added. How cool was that?  So where's the fifth star? The soup tureen was taken with soup still in it, and the salad was a too plain, just not enough stuff... not even any tomatoes or olives or peppers. AND the only dessert is ice cream. No pies, no canoli... not even any tiramisu. Funny thing, the host (great guy, been there forever), when we asked about canoli, laughingly told us to hit Cafe Roma's, a block away.  Capp's Corner is cool, fun... GREAT FOOD. Check it out!", 
    "review_date": "2009-07-26"
  }, 
  "k7AOqQE4mpaQ1UseR1RIlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leo M.", 
    "review_text": "Really friendly staff and humorous server.  Order came quick. Minestroni soup and a good salad (better than your average Olive Garden) to share while you wait for your entrée.", 
    "review_date": "2014-06-21"
  }, 
  "YPkXV7QgbUR7S7tnfAtI_Q": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Frankie D.", 
    "review_text": "Let's start at zero stars.  I found the menu and ordering system to be totally misleading and if you aren't that hungry, you're basically screwed because if you sit down, they make you order an entree.  No sharing of entrees, come on!   Minus one star.  To compensate and continue the myth of dining \"family style\", they bring you a loaf of fresh, crusty Italian bread (yum), a big bowl of minestrone (yuck for me, although my dining companions enjoyed it), and a big bowl of dubious lettuce smothered in beets, beans and too much dressing (ok, but not really for me).  Minus one star.  The entrees themselves, however, were delicious.  I had the veal tortellini and they were melt-in-your-mouth baby cowy goodness in a tomato cream sauce which was to die for and matched perfectly.  My dining companions had the cheese ravioli and the calamari linguine.  I didn't try the ravioli, but Companion #1 enjoyed it very much.  I did try the calamari linguine and it wasn't bad.  Companion #2 ate it pretty happily.  That's three good entrees.  Plus three stars.  The surliness of the waitress, the kitschy decor and the broad variety of clientele added to the charm.  You will not find yuppies and douchebags here, so let's add another two.  And here we are.  Three solid stars.  I recommend it, but you gotta know that their \"family style\" is a myth and you will be made to order; come hungry!", 
    "review_date": "2006-06-27"
  }, 
  "aUbpxUZSdZ9qWU6Hz4_dYg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nedra D.", 
    "review_text": "Good solid home-style Italian food.  I've never had a bad meal at Capp's.  It reminds me of the old school neighborhood Italian restaurants you would find.  Drink and food prices are reasonable.  Portions are more than enough.  Their minestrone is really good.  Everything is served family style.  The decor is very kitsch with old photos.  if you're looking for a fancy Italian dinner, this isn't the place for you.  but if you're looking for good Spaghetti and Meatballs and Cannelloni, Salad, and Soup, then it's perfect.", 
    "review_date": "2009-10-31"
  }, 
  "z-kyHYF6oUad7inUVG0Mzw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason E.", 
    "review_text": "Good place, but a little low key for me.", 
    "review_date": "2011-07-06"
  }, 
  "sAXAyCi1q4zpEAhqugT0Xg": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Norm G.", 
    "review_text": "I love this place. All the photos on the wall, the checkerboard tablecloths, the noise level: just perfect for North Beach. A great place to bring some out of town guests before you take them to see Beach Blanket Babylon down the street at Club Fugazi. Or, in my case, drop them off at Club Fugazi, since I've seen the show several times. I especially like the way they serve the salad and the minestrone soup family style. Even my kids loved it, because they could be noisy and a little messy, and nobody even blinked an eye. A lovely, boisterous San Francisco landmark. The only reason I'm giving four stars instead of five, is the men's restroom is so cramped, and the urinal is right next to the sink, I mean right next to it. Just move the elimination porcelain a little ways from the washing porcelain, and I will add one more star. Oh well, I suppose it's all part of the \"charm.\"  Still, I love Capp's Corner!", 
    "review_date": "2009-01-07"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Holy crap.  Best bar ever after BBB gets out and the front of house staff (and occasional cast member) comes to have a drink.  Thanks to our friend (a server at BBB and a Capp's regular), we got the royal treatment at the bar.  (I won't go into details because I think you just have to go and check it out for yourself.)  Regarding the restaurant portion, I've had the food and it's only okay.  I do love the \"Old North Beach\" vibe about the place, with all the celebrity photos on the walls.  Capp's is kind of a NB institution...and I respect that.  Four solid stars with room for improvement.", 
    "review_date": "2008-11-29"
  }, 
  "0ZG8CwVOFFYrUdybrNzNOw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shadi G.", 
    "review_text": "A family-style Italian restaurant with modest prices and large portions, this little eatery is a good place to come if you don't want to pay too much and you just want some simple, straightforward pasta.  A tureen of soup, a huge bowl of salad, and baskets of bread come with whatever meal you order.  Hint: tell them to put the salad dressing on the side, or you will get far more than you desire.  The atmosphere has a vintage, neighborhood feel.  The servers are all friendly and hard working.  Nothing fancy here.  Nothing fabulous.  But for a quick place to just sit down with your friends, eat, laugh, drink, and relax, Capp's Corner works.", 
    "review_date": "2010-03-01"
  }, 
  "EjVRsZhNyG7vkCxVci7xHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theresa T.", 
    "review_text": "Capp's is a nice change of pace. I recently have been so obsessed with new American and fusion spots I forgot what fun a traditional family oriented restaurant can be.  Capp's is a family style restaurant with pre-set menus where you can pick your entree and soup, salad and bread are included in the price (about $18-21). They have nightly specials, but were sadly out of clams when we arrived for our 8pm dinner reservation. I had the pesto linguini and the pesto was average (and abnormally green, artificial looking).  The servers are totally nice and the decor is standard old-school Italian with red-checked tables, white porcelain plates and a wooden bar. The food is okay, nothing artsy or anything that will shock you, but okay. This type of place is more about the ambiance than the food.   My Tips: - You should know the minestrone soup is not vegetarian it's made with chicken broth - The wine is not good, but corkage fee is only $10 so bring your own - Don't skip the salad, it is delicious - Entrees mostly consist of pasta dishes so make sure you are in the mood for something substantial  I am pretty picky so family style isn't always the best for me, but the experience was enjoyable.", 
    "review_date": "2008-09-10"
  }, 
  "yshuPf-UY_YUdXrfrGUUgA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alli J.", 
    "review_text": "If you're hungry and want amazing food and service-- come here!!   They feed you Italian family style, which means they have to roll you out of the establishment. You will start with soup and salad, with an amazing olive oil and bread for dipping. I went with the spaghetti and meatballs for roughly ~18.00 (pre-tax and tip) and the man candy went with chicken parm.  Pros: Great service Amazing food Good portions   Cons: Carbs= calories", 
    "review_date": "2015-01-07"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "Haven't eaten here yet but they have a great bar seen later in the evening. Take a moment to talk to the bartender, hang out with the kids from the show next door and bypass all the ridiculousness of Columbus Street. Good times.", 
    "review_date": "2008-04-12"
  }, 
  "-_dGQOHpKRFgDy5yTjjlUQ": {
    "user_rating": 2.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Mary F.", 
    "review_text": "I agree with the other reviewers that Capp's has that great family-style appeal.  The prices are reasonable and the portions are fairly generous.  I came with a large group and the waitress was really impatient and rude from the very start.  The attitude was completely unnecessary.  I was really disappointed by the experience and would not go back.", 
    "review_date": "2009-07-30"
  }, 
  "Xv0Kts_5qDIG6WUC2-646A": {
    "user_rating": 4.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Robert H.", 
    "review_text": "I know it's been three years since I promised to update \"next month\" but, what the hey my opinion has not changed that much except that I'm liking it better.  Since my original review, I've been here ten (probably more) times.  The atmosphere is unpretentious.  The service is great and personable, the minestroni is tasty and the salad, while not fancy, is perfect for my taste.  I've had a variety of entres and they're all wonderful.  Of course since you eat family style the quality of the salad may just depend on who in your group is the best at \"salad tossing.\"  Capp's Corner is Cozy and Comfty and is now a regular stop on my itinerary.  I know that parking can be difficult in North Beach but not at all impossible.", 
    "review_date": "2012-06-08"
  }, 
  "RxBmMXaOdkPbj5wUT5-AWQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Paul H.", 
    "review_text": "Absolute garbage. Food on a plane is better. Do yourself a favor and go anywhere else. Yuck!", 
    "review_date": "2013-09-26"
  }, 
  "6ELIw3Kpgh1SAXJoGkf6hA": {
    "user_rating": 4.0, 
    "user_location": "Danville, CA", 
    "user_name": "Sue F.", 
    "review_text": "We went with a large group on 12/22/12 and had a great time. The food was good and the service ok. We were though a little rushed. Loved the soup and salad. Definitely will be coming back!", 
    "review_date": "2012-12-24"
  }, 
  "Ygs2NRPXd8S7_pa9jfOpHQ": {
    "user_rating": 2.0, 
    "user_location": "Livermore, CA", 
    "user_name": "P Lynn P.", 
    "review_text": "Are you kidding me?  I guess it is \"the place\" to eat before or after seeing Beach Blanket Babylon but we won't be back.  The noise was outrageous and we were crowded by very large customers sitting right behind us.  The 'family style' dining means they bring each table a big bowl of minestrone soup that is so bland it tastes like it's been sitting all day.  The big bowl of salad was good - tons of dressing but typical of what you would get in the 60's and I suppose that is what they are going for - the \"pre-foodie\" type of food.  The food was mediocre at best and there was no real 'ambiance.'", 
    "review_date": "2013-10-15"
  }, 
  "k6kMHSAgbwVvneM5ukfJUg": {
    "user_rating": 2.0, 
    "user_location": "Cheswick, PA", 
    "user_name": "Ray O.", 
    "review_text": "Minestrone was decent, salad had beets but no tomatoes (yuck), vegetables were mushy (overcooked perhaps), lasagne was about the same quality as a high school cafeteria. The spumoni was a pleasant treat though!", 
    "review_date": "2012-08-23"
  }, 
  "xpRAjmgL-pIcIY_9iOpcQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay W.", 
    "review_text": "While I've had my share of cocktails here, until recently,  I had never tried the food.  I must say that I was very pleasantly surprised.  The minestrone was pretty  good and thickened with flour just like my nana's.  The salad was nothing to get excited about, but hell it was salad...I never get excited about salad.  I'd highly recommend the fettucine and clams with white wine sauce...I tend to get that a lot in sketchy italian places because assuming the clams aren't bad it's pretty hard to screw up.  Capp's did them well.  The real surprise was the Osso Buco.  It's probably my favorite I talian dish and I'm generally disappointed, but Capp's sauce was perfect and the meat disintegrated when touched with a fork.  Not the best I've had but damn tasty.  And we were out the door for $42 including tip.  \"Quaint\" is a good euphemism for the atmosphere/decor, but it really is authentic.  I've had plastic utensils with more heft than the steak knife they gave me, and the house wines are Inglenook...shudder.  We ate late and the owner was at the table next to us totalling up the night's receipts in pencil in one of those black speckled composition books.  I'm a total sucker for crap like that.", 
    "review_date": "2006-05-08"
  }, 
  "Eaoo4Bh72FSjSxeGNIad7g": {
    "user_rating": 4.0, 
    "user_location": "Santa Ana, CA", 
    "user_name": "JIM W.", 
    "review_text": "Looking forward to visiting Capp's on Sept. 21 when my cruise ship docks. Whenever I'm in The City, I always stop by. The great thing is: it never changes. The ambiance is always there. Good food and drinks and the staff is very friendly. Ran into Margo St. James there on one of my visits. You never know who might be sitting next to you at the bar.", 
    "review_date": "2006-08-29"
  }, 
  "nlOxarS20luHkAloH5YyzA": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Vanessa G.", 
    "review_text": "I really don't understand why so many people gave this place a good review.  I can't even describe how disgusting the food is here.  First they brought us soup and salad.  The soup was a minestrone and very, very bland.  I had to add a ton of salt and pepper just to get it down.  The salad reminded me of something you'd buy pre-made at the grocery store.  Since I don't eat pasta, which might be my problem with this place, I ordered a steak.  There really wasn't much of anything else on the menu that I could eat.  Weirdly, the steak comes with a side of pasta, but I opted out of that since there is no way I'd eat it.  Now, I don't really consider myself that picky of an eater.  I usually eat everything and think most stuff is pretty good.  But the food here was just wretched.  The steak was first off gross looking.  You'd think presentation would count for something, but a hotdog looked more appetizing than this.  But sometimes stuff looks gross and tastes good.  Well, not in the case.  The steak was quite tough and had random chunks of fat in it.  Anyway, my entire meal was just really, really bad.  So I basically never want to go back.", 
    "review_date": "2006-08-09"
  }, 
  "xKGwVnamNpdZAdzoN-_5Hw": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Rebecca M.", 
    "review_text": "This place is so delicious! If you miss Caesar's in SF then this place is the place to go. They do family style courses, which is my favorite! So each dish comes with soup and salad that they serve family style and then you get your main dish served individually. I got the linguine with clams and mussels which was amazing. That is my usual go to dish at Italian restaurants and this one was by fair the best I have had. This restaurant, though small, works wonderfully with groups. We had I believe 20 of us and they worked us in perfectly. Service is great, though the bartender seemed to be in a bad mood. All in all, fantastic food. I can't wait to go back.", 
    "review_date": "2015-01-04"
  }, 
  "YMkkjYuojBf-uOh9atGUiQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer B.", 
    "review_text": "Closest to New York Italian in San Francisco. Great atmosphere and super prices.", 
    "review_date": "2005-02-08"
  }, 
  "aBfT6rp0tfhEyc7fWeuYJA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rose Q.", 
    "review_text": "Not the place for me.", 
    "review_date": "2006-09-17"
  }, 
  "djDpJMnZyLvgG1VGf65PiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob S.", 
    "review_text": "Definitely old San Francisco.  Many of the great family style places with great food and great value in North Beach are gone, but Capp's continues the tradition.  It feels like home.  The veal milanese is fantastic, and is my favorite.  Also expecially fond of the Osso-Bucco (and that's a dish you hardly find in North Beach anymore, though it used to be a staple of family owned places).  The staff are great, and the price is right.  They could use some new chairs, but otherwise it is a great place for the real thing.", 
    "review_date": "2010-07-19"
  }, 
  "oZ4zwTAR2C9kGUL2aCGccQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bert K.", 
    "review_text": "Was here on April 21st, what happened?  The attendant recommended the Lamb Shank plate. My friends had the fresh sea bass and they loved it!  One of the best things about Capps, is when you order the plate dinner it includes a generous supply of soup and salad. Both did not disappoint.  However, when my meal arrived, it looked good and all, but the lamb shank meat tasted as if it was cooked a few days ago. One or two days old would have been reasonable, but my lamb shank tasted reheated a few too many times. C'mon Capps : up your game!  Four people = $165.00 not cheap.  I might go back again.  Customer service: fine.  I have been here more than ten times.", 
    "review_date": "2012-04-30"
  }, 
  "pRQ3cXfNaNsYfN7-ElCpvg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Shane H.", 
    "review_text": "Capps Place is Awesome. Visiting from out of town, my girlfriend and I stumbled in after a walk up and down the hills of SF looking for beer and a bathroom. Just opening Jack and the crew welcomed us right in where we took a seat at the bar.   Anchorsteam and a Champagne Split. Perfect combo for the warm San Francisco day. We chatted it up with the Jack manning the bar and Eddie a local.  It always a great feeling be able to walk into a random bar or restaurant and feel instantly at home.", 
    "review_date": "2010-03-30"
  }, 
  "4kfTglFC5RBcZsXOX6d5vw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kaylan S.", 
    "review_text": "came for a friends bday the other night and was impressed!! me likey! small and homey, great service, decently priced and tasty!  vodka tonic was strong, bread was cold: meh, wine was cheap, clam chowder was good!, salad: meh (even tho i appreciated the beets, kidney &amp; garbanzo beans), linguini with pesto also really good! the servers were really friendly and location is primo for hitting up the bars afterwards...the only downer with that is i couldnt shove my huge plate of linguini leftovers in my clutch or carry around a bag of pasta so that i could have it the next day      :-/  this is a great place to take visitors and also great for groups! do it!", 
    "review_date": "2009-01-04"
  }, 
  "tLz1zvn81gGXIkbrcNtdgQ": {
    "user_rating": 3.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Kasia K.", 
    "review_text": "Came here after Beach Blanket Babylon and  it was just okay for me. The service we had was absolutely five stars! Show ended around 6:40 and we had a reservation for a large party at 7, but they had our table ready early. Our waiter was always refilling drinks, asking how the food was and taking our plates just in time for the next meal. The family style part of the meal is soup and salad, both of which I thought tasted delicious! First time in a while I've had beets in a regular salad. I do wish it didn't come drenched in so much dressing, but I still enjoyed it. The entrees were mediocre IMO. I got the chicken parmigiana and it comes with a little bit of pasta with marinara and veggies. My fiance got the pork chop and I think that tasted a little better, especially being with the mushrooms! Overall the place was okay, and I would return if I needed something close to the area. Service - 5 stars, food - 3 stars, location - 4 stars with easy parking (in the parking garage) and close to the show.", 
    "review_date": "2011-08-25"
  }, 
  "XJhmTEAJuYRgIP4b9wMcTw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mason G.", 
    "review_text": "It's rare that I find a bartender who *demands* a tip, just as I'm pulling out my wallet to give him one...  Needless to say, I paused mid-wallet-pull, finished my drink, and walked out the door.", 
    "review_date": "2012-11-21"
  }, 
  "qMPnrqWXFVDJTVhQwqJHaw": {
    "user_rating": 3.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Erin P.", 
    "review_text": "Overpriced, but good enough. The soup and salad are good. I had some pesto which was very nice and flavorful, but like I said, the place is definitely overpriced for its entrees. But the wine is cheap :)", 
    "review_date": "2012-06-12"
  }, 
  "pbWRfIpJGPxImGFpEy8zsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Duncan L.", 
    "review_text": "Used to be great. Last time it was far to busy and the service suffered greatly.", 
    "review_date": "2014-08-11"
  }, 
  "ss1PGLjfjitXP2o0_95SCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misti L.", 
    "review_text": "I like it.  It's just a quaint bar with a very New York feel. Sometimes there are a lot of Bridge and Tunnel going to BBB but well, what can you do!  No offense Bridge and Tunnelers but you do stick out quite like the tourists.  Ouch!  Don't be hatin' now!", 
    "review_date": "2006-06-07"
  }, 
  "wVpwTZ0ynSgHWn_tgzx2vg": {
    "user_rating": 3.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Kerry P.", 
    "review_text": "I always wanted to have a family-style dinner at Capps.  I frequent the neighboring pubs on the block and always see Capps packed to the rafters.  I got a really good feeling from this place when they let me use their restroom (sad but true) during North Beach Fest when every other place turned me down.    I was a little disappointed by their definition of \"family style.\"  This holiday season I've been eating like it's going out of style, and I was looking forward to \"pick-and-choose\" smaller portions of a shared meal.  The only part of the meal that comes family style in the vat of minnestrone soup (delish!) and the salad (would be better if it wasn't postively drenched in dressing).    The entrees range from $18 (pastas) to $20 (chicken, pork, eggplant parm, etc).  Portions are hefty!  I had the Seafood Linguine special with red sauce, which was exactly what I was in the mood for:  shellfish, calamari and perfectly-prepared flat noodles swimming in a garlicy sea of tomato.  Mmmmm, perfection.  This same dish with the white sauce was reportedly buttery.   The pinot noir tasted like altar wine from my Catholic school days.  The pork chop was reportedly dry.  The spaghetti and meatballs is huge!  In no way will you leave hungry!  Capps is ideal for big groups, and you can tell by all the smiles, roars of laughter and the clinking of glasses between generations that families are having a great time.  At the end of the day, that is the whole point.  Capps in no-frills dining with its checkered table clothes, old North Beach neighborhood photographs which grace the walls, and the over-extended servers who will take your order, give you what you need, but no more than that.    Bring Uncle Mike, Cousin Ann, Grandma Kay, and even maybe that finnicky Aunt Marion...but maybe choose a different venue for date night with your significant other.", 
    "review_date": "2010-12-22"
  }, 
  "KLc0yiHGlmGYWB4NOpOUQQ": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Meagan M.", 
    "review_text": "My friends and I were looking for a nice Italian place to eat at before Beach Blanket Babylon and we thought this place might be good. When we first walked in, the place had a really weird smell but I chose to ignore it and see what was on the menu. After seeing the very little variety they had to offer, I placed my order to the very unfriendly waitress who was very short with us. She served us soup and salad and removed the bowls from the table while we were still eating them. There was still food in the bowls!! She did this without saying more than two words to us. After eating the mediocre soup and salad our main courses arrived. I honestly believe chef boyardee and Kraft can make better Italian food. Finally the rude waitress dropped off the check without saying one word. The check had a sneaky extra $10 charged. After having her remove the \"mistake\" we left.  I have no personal agenda in writing this review. I just wanted to share my experience and say I will never eat here again.", 
    "review_date": "2013-01-20"
  }, 
  "7kmlaGMjjCHN8rL8oncz_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tim y.", 
    "review_text": "pay attention, that's how you do it ....", 
    "review_date": "2008-03-27"
  }, 
  "DeH52RxnApSENsojBaWomg": {
    "user_rating": 2.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Jennifer H.", 
    "review_text": "I wouldn't go there again...ever.. I had lamb and they gave me tiny stingy portions and the soup and salad was poor quality. Not even a tomato in my salad. Don't waste your time and money. Go somewhere else like Gaspare's on Geary. I still miss Original Joes.. too bad that it burned down!  Waiter was nice and very attentive though..... great service and nice decor Capps.. Maybe it was a bad cook working thar day who knows... Just my 2 cents.", 
    "review_date": "2009-06-30"
  }, 
  "cZddOgL-F_qm1s2LzRJO8A": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Khloe B.", 
    "review_text": "This is the only Italian restaurant my Dad respects! He insists on coming here and he tells me this place has been around for a long time--he used to come here when he lived in the city--now you know THAT'S old. My Dad's best friend happens to be Italian, and he swears by this place. I haven't been here in over a year, but i do have to warn people: This is an AUTHENTIC Italian restaurant. Italian cuisine is very light, robust, and rustic. It is not heavy nor rich, like so many chain restaurants have made it. Though I enjoy my fair share of cheesy, creamy alfredo, my skinny jeans probably prefer the lighter stuff.   This is where Capp's Corner comes in. Friendly service, cute kitschy decor (makes me think Michael Corleone is going to come out and bust a cap in my ass--I loves it!), and all around good food. I usually order the linguine with the mussels (I love mussels...and muscles) which is fantastic. I always have leftovers for a yummy lunch the next day. Flavorful yet didn't feel heavy--Wonderful!  I once ordered the chicken parm and it was a little too overdone for my taste--I don't recommend this here. Their soup and bread were great as well.   Final Verdict: For authentic Italian food in the Bay Area, Capp's Corner is the place to go, Come for the food, stay for the decor, that in itself is one helluva show. Really good food at a very fair price, in this economy, that sounds very nice.", 
    "review_date": "2009-02-28"
  }, 
  "-_mQDj52lVub7xIhAWqiJg": {
    "user_rating": 4.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Erica S.", 
    "review_text": "When I can't possibly take sissy Italian food anymore (sorry Pasta Pomodoro; there's only so much of you I can eat) I make the effort to drive out to the city and eat real, wholesome, classic food. I've only ever come with large groups (family twice, friends once) and it's perfect. There are two pricing levels of entrées; each come with family-style minestrone (delicioussssss) and salad (mmmm). Of course with it all you get scrumptious bread and butter with olive oil to nosh on.  Yummy, simple and old school Italian. What more can you ask for?", 
    "review_date": "2011-05-08"
  }, 
  "y34g-mvZ74Qad_B5FQbboQ": {
    "user_rating": 4.0, 
    "user_location": "Walnut Grove, CA", 
    "user_name": "Bruce B.", 
    "review_text": "Here's a small corner spot in North Beach with some real character. The food is great and so is the service. I had eggplant Parmesan and soup. Some of the best minestrone I've had. finish off this great meal with the very best spumoni I have ever put in my mouth.", 
    "review_date": "2013-03-16"
  }, 
  "-PWwpgh0WQFE63KIzyqmKg": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "D M.", 
    "review_text": "I'd heard about Capp's Corner and decided to eat there after seeing Beach Blanket Babylon. I'd heard from many others that it was a great place and right next door to the play so we went.  To be sure, it was old-style San Francisco dining complete with a ZERO personality grumpy waiter.  \"Can we get a smile, please?\"  I thought I was eating in a cafeteria served by a guy who hated his job.  Not even a \"Welcome to Capp's Corner\" let a lone a \"My name is Luigi, I will be your server.\"  OK, I'll admit I'm a bit spoiled. My first advertising job was for a restaurant and I ate at the owners table for dinner weekly, so I got used to a certain level of service.  But isn't that how you're supposed to feel when you are going to a restaurant, that you're with the owner and he wants everything to be right?  As for the food, well, my mom like her meal but the rest of us food snobs barely finished our plates as there just wan't anything special about the entree.  The sautéed vegetable were good.  That was about it.  ONE NOTE.  The bus boy was good and very attentive at pouring our water and cleaning our table.  Too bad he was not serving us, I would have left a bigger tip....", 
    "review_date": "2014-06-17"
  }, 
  "uf-KD798LVjlgeif1KRrUA": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Rico M.", 
    "review_text": "Not a bad place to eat if you're really hungry.    My family and I went there after having mass at Sts. Peter and Paul Church.  Capp's Corner is located in North Beach that borders Chinatown.  The Minnestrone soup was served family style; the flavor was good, but it appears the soup has been sitting in the pot for days!  I can't make out what vegetables or ingredients were in my bowl ;(  The entire meal was acceptable and portions were adequate.  The server was warm and friendly initally, but developed a little attitude towards the end of our meal.  He actually brought to our attention what his gratuities should be and took the liberty to make the necessary adjustments.  Capp's Corner reminds me of a friendly and warm SF local neighborhood drinking establishment back in the good ol' days.", 
    "review_date": "2010-01-13"
  }, 
  "ZtmeHAQyNFku338dJMIfTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "I always tell people.. skip the Stinking Rose, Panta Rei and Calzone's... the places that give North Beach a bad name... and walk yourself one block off Columbus in ANY direction.. and you're bound to find a good Italian restaurant. Sodini's, Contandina, Bocce...  And Capp's...  It's a bit touristy because it's right near BBB but that's ok because it's basic and authentic.  I love the random decor, especially the red and white plaid picnic-looking table tops.  I had the spaghetti and meatballs and I have a feeling it's going to become a new crave.  This place is not fancy. It's simple, friendly, tasty Italian.  It is very family friendly so it's probably not a good date place. Go with friends or family for a casual dinner.", 
    "review_date": "2007-06-22"
  }, 
  "4YK8H4Bu_qoGO6latjaqgA": {
    "user_rating": 4.0, 
    "user_location": "Sylmar, CA", 
    "user_name": "Madeleine J.", 
    "review_text": "I eat here regularly for the last 20 years or more. I am meeting my relatives here tonight. Hope it is as good as usual. I love the laid back feeling of it.", 
    "review_date": "2014-11-06"
  }, 
  "iTXymihtdXLvYbTxVtVjNw": {
    "user_rating": 4.0, 
    "user_location": "Miami, FL", 
    "user_name": "Jennifer M.", 
    "review_text": "Delicious, family style Italian food. My husband and I were meeting some friends for dinner and weren't sure if we were at the right place. I guess the staff noticed our lost look because they immediately came outside to ask if we were the couple - with the baby - that was part of the group of four. They brought us inside, seated us immediately, asked about a high chair and took an order for my daughter (who is only a year old). Service gets five stars from me. I felt right at home.   Being a family style restaurant, all meals come with soup and salad. The minestrone was good, but I didn't have the salad (aversion to creamy dressings). As a table we ordered mussels, lasagne, veal tortellini and canneloni. Everything was delicious. We were all incredibly pleased with the meal (and the service!). I'd say my only comment is that the plate of tortellini lacked presentation. The pasta was just kind of dumped on the plate and smothered in sauce - no cheese, no basil, no veggies...the sauce was amazing, though.   Definitely coming back!!", 
    "review_date": "2013-01-21"
  }, 
  "2cEh0prIgpGMDjBRvVykFw": {
    "user_rating": 4.0, 
    "user_location": "Jacksonville, FL", 
    "user_name": "Ed L.", 
    "review_text": "Like several have said, Capp's is a SF/NB institution. I'm not sure how we found this place, maybe while on a N Beach walking tour, or maybe drove by coming from the theater. But, none the less, so grateful a find. It's basic, its unassuming, it's old world SF, and it's great food, elite service and they run it like a nickle balanced on edge. Nothing ever seems to go wrong, although, like any place that serves to please people, I'm sure this is not true,  The minestrone and salad is what keeps us coming back, and I'm not a soup/salad person. But the entrees, although not remarkable, are equally delicious. Just GREAT basic Italian/American fare. It's one of those, you know what to expect, service, food and wait wise places, and they never disappoint. Good spumoni too.", 
    "review_date": "2008-01-09"
  }, 
  "Q894BDSToSiwhMRWYDCYRw": {
    "user_rating": 5.0, 
    "user_location": "Carmichael, CA", 
    "user_name": "Michelle R.", 
    "review_text": "We stopped in right before dinner service ended. Not only was the service friendly and quick,  but the food was incredible. The atmosphere was welcoming and we had a great time. We usually like to jump around to different places, but we'll definitely be returning here soon!", 
    "review_date": "2014-06-01"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "i love capps! usually always packed and thats because of 2 things.... all the people going to see BBB next door come here, and also because the food is good. service is even pretty good despite it always being so busy.", 
    "review_date": "2005-06-10"
  }, 
  "0XXIv9a0LWiaCjAkurjMMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "The soul of North Beach is alive and well.    Thirty or forty years ago any number of restaurants along Columbus Avenue competed for customers, serving prix fixe dinners, all with about the same menu, \"family style.\"  Most have gone, but Capp's is going strong.    We arrived at 5 pm on Saturday, and nearly had the whole place to ourselves.  Walking inside, we noticed the bar next to the front door, conveniently placed so customers could wait in comfort on busy nights.  The hostess on the right, at her podium, where she has probably been stationed every night since 1945.  The long tables, where people were seated next to each other, without regard to personal space.  That's family style.    We had a choice of entrees.  Margaret chose lamb, and I went for the hot Italian sausage and peppers.  The opening course was minestrone soup, the exact same recipe that has been served all over North Beach.  Then a salad, with the beets, kidney beans, and garbanzos.  Penne pasta with a Tuscan marinara came on the side of the entree plate -- even some pasta entrees come with a pasta on the side.  One glass of chardonnay, one glass of merlot.  For a perfect Italian finish, we accepted a dish of spumoni ice cream -- they were generous with the chocolate, moderate with the cherry, and not so generous with the pistachio.  Perhaps it was the luck of the scoops.  All of this for $55.50 plus tip.    Midway through our dinner, a party of four arrived to celebrate a birthday.  Their conversation drifted to other birthday dinners they had celebrated at other restaurants.  Reminiscing, being out of the moment, somehow seemed appropriate, for much of North Beach has changed.  But Capp's Corner is still the same.", 
    "review_date": "2007-04-30"
  }, 
  "dw309iAtnodDKeVyeA6pjw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Rachel C.", 
    "review_text": "I was introduced to Capps by The Man years ago, on our first trip to The City together as he'd been coming with his Italian family since he was a kid... since then, this is literally my go to place when in SF.  I come here with him, without him, during the week, on weekends, holidays, whenever i happen to stop in the lovely City by the Bay.  A few things you should know... leave pretense and attitude at the door.... this place is legit.  NO you won't get frou frou small food on a big plate, NO your salad won't come with dressing on the side (maybe it will, never asked because when in Rome...) NO it's not Burger King and you won't get it your way... unless you happen to be charming like my Man who could charm the honey out of a bee... and even he can't have it all the way he wants it... NO they don't have a great dessert selection either, but my god don't you want to go walk around North Beach for that?!  What you will find is a fantastic little corner place that's been there forever, with waitstaff that knows when to approach, when to leave you alone and what to suggest.  The bar has a great selection of basic and not so basic potables for just about every taste and I've never felt overcharged or underfed / underserved in each of the oh... dunno... 25+ times I've been there?  it's kitschy, local, relaxing and filling...the food is always satisfying, and thoughtfully prepared... all high marks in my book.  Next time you go... ask the bartender for a Galliano.... tell em the lady in the Beehive sentcha...  :)", 
    "review_date": "2011-11-02"
  }, 
  "dM9OJJzpM0omMjwIlUBGfQ": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Cam T.", 
    "review_text": "Over the years Chinatown has been slowly expanding into North Beach &amp; the old school Italian restaurants have been slowly dying out as well.  Capt Hook used to go here from his days as a Golden Bear so whenever we hit town Capp's is always on the menu.  The communal tables are dwindling but they still plop down a bowl of minestrone soup as soon as you sit down.  If you come on Friday you get either minestrone or New England style clam chowder or if you give them puppy dog eyes a little of both!  Mmm, creamy clam chowder with cooked down chunks of potato &amp; tender sweet slivers of clam or savory minestrone with tangy tomatoes, starchy beans &amp; veggies.  [gahhh...slurp!]  And then, they bring out a truly yummy salad with pickled beets, chick peas, kidney beans, sunflower seeds &amp; creamy housemade Italian dressing.  So by now, you've definitely bought yourself enough time to figure out what you want, right?  The Osso Buco is classically done--braised veal shank that you can eat with a fork in a tangy tomato sauce &amp; tender diced veggies with polenta &amp; penne alla arabiata on the side.  Definitely satisfies the carnivore within.  I always overeat which causes me problems later in the night but that's what hubbies &amp; tummy rubs are for, no?  The Cannelloni is also a winner with ground veal &amp; ricotta in a pink sauce--creamy, cheesy, &amp; velvety.  Be ready to take home leftovers because it's too rich (in a good way) to finish in one sitting.  Oh &amp; don't forget the specials.  We had a roast half chicken in a marsala mushroom sauce that was so succulent &amp; tender that during our plate rotations (we like to eat family style) it was definitely the belle of the ball.  The clientele is definitely aging &amp; the communal atmosphere is changing over to separate tables--younger diners don't seem to want to rub elbows with strangers &amp; get caught up in fascinating anecdotal tidbits which is a shame.  Hopefully Capp's will still be there for next fall's Berkeley games so Capt Hook &amp; I can overeat ourselves into happy food comas when we're in town.", 
    "review_date": "2008-12-26"
  }, 
  "T9-I5G3KQJoF9od3q7Xvrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett C.", 
    "review_text": "The best place in the city for Family-style Italian dining. Sit at the beautiful bar, or cozy up with some friends in their comfy dining room. Bring an appetite, or clear out some room in your fridge, because the portions are BIG! The fare is surprisingly affordable for the quality. I brought my parents here who were visiting from the East Coast, and the owner came out and personally welcomed ALL of us. I highly recommend their Italian Sausage dinner...YUMMM!", 
    "review_date": "2014-09-19"
  }, 
  "PKGTuC21BbBFEYzh31u3yg": {
    "user_rating": 3.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Jill L.", 
    "review_text": "The minestrone soup is very good. And they give you lots of bread. I had the chicken parmigiana that was satisfactory. Our food server was very attentive and we were never low on beverages. My friend had the ravioli which she loved!  The location was perfect for dinner before Beach Blanket Babylon :) I would go back for the soup.", 
    "review_date": "2013-08-26"
  }, 
  "ytxm744qKpJ04EK3EF7prw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen W.", 
    "review_text": "It's in North Beach and has been serving for decades.  You're not going to find anything other than a kind of Americanized Italian food, but it's tasty.  I particularly liked the minestrone that comes with dinner along with salad.  The soup had good flavor, was murky (a plus for me) and could be a meal in itself along with the good bread/butter that they served.  I had the calamari steak dore' which I enjoyed.  I also tasted the fettuccine with prawns and I liked the flavor, but the prawns were cooked too much so they were a little tough.  It's not fancy and it's loud when the bar fills up, but it satisfies when you're looking for something that's good and inexpensive (soup, bread, salad, entree', ice cream is 20 bucks)   Andiamo!", 
    "review_date": "2007-11-20"
  }, 
  "UhN9RrW19vz7vFWgWVLn_w": {
    "user_rating": 1.0, 
    "user_location": "Sahuarita, AZ", 
    "user_name": "Debby A.", 
    "review_text": "Boy has this gone down hill. The worst minnestroni soup I ever had. Taste like left over lental soup. Very bland. Capps What happened????", 
    "review_date": "2013-10-13"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Came here with one of my law school professors, who had been coming here for the past 15 years.  The first thing you'll notice about Capp's is that everyone here is, \"like,\" really old.  Capp's has been around forever, which means you'll see people like the owner of City Lights or Mayor Ed Lee's friends.  Seriously, though.  Around noon on Fridays, there will sometimes be group of 20+ old senior men sitting at a table... they have frequent reunions!  Adorable.  All the food tastes homemade, so the flavor won't be super intense or MSG-y.  Everything is rather mild, which I prefer... because I'd like to think that it's kind of healthy.    For lunch, if you like seafood, I recommend the filet of sole (the lemon butter flat fish).  It's $14, and comes with a side of veggies, pasta and your choice between soup or salad.  One guy in our group got a little less pasta, so we notified the waiter, who just brought out a brand new bowl of pasta for him - no questions asked.  My other friends also ordered the cannelloni, but the filet of sole was definitely the most ordered / most popular item in our group.   Don't forget to top off your meal with some spumoni, either (:  That way you'll get the full North Beach / Little Italy experience!  ALSO there's a full bar.", 
    "review_date": "2013-07-11"
  }, 
  "9wJQDStmRRabC5Yx978peQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Russell C.", 
    "review_text": "Before being offered dessert we were offered the check.  Despite that, I requested dessert to the waiter's disappointment.  He gave us the dessert free but then explained he wanted us to pay the check immediately so he could go home right away.  And that's too bad because the family style food was good.", 
    "review_date": "2012-07-01"
  }, 
  "fGpQET0VduXx4lbDSBCgtA": {
    "user_rating": 3.0, 
    "user_location": "Rocklin, CA", 
    "user_name": "Jessica S.", 
    "review_text": "The food is good, but they advertise themselves as \"family style\" yet when you share a plate they charge you $10 extra!  I do not know what they mean by family style then as every other place I've been to that is family style serves you an order in a big bowl meant to share with 2-3 people.   In any case, the soup was fantastic! Got the lasagna and it was ok.", 
    "review_date": "2011-06-16"
  }, 
  "JzmJ6U20uJ9pZonwKGvMuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua W.", 
    "review_text": "I'll forgo my usual verbose review and simply say, \"GET THE VEAL TORTELLINI IN SUN DRIED TOMATO CREAM SAUCE!!!\".  That is all you need to know about this place.  Fellow carb addicts, mangia!!", 
    "review_date": "2008-02-01"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "3 stars because of their historical value.  I really doubt people come here for the food - there are plenty within a stone throw away with much better food and likely more service.  Have heard about this place and walked by too many times.  Finally, we decided to try this place since we are running out of place to try in the area.  Maybe because it was a Friday before the show, the place was full when we walked in but it was warm and it felt homey.  The lady took our name and when I asked how long it'll be - she said she doesn't know it can be a long time but it will likely be very soon?!?  She's older and maybe confused...anyway, she suggested sitting at the bar while we wait, not a bad idea.  When the bartender approached us, we told him we were waiting for our table so we would like to look at the wine list.  He asked by the glass or bottle - we said both.  He gave us the menu which included the wine list, both by glass and bottle so not sure why it mattered?    The wine list is very inexpensive - the lowest is $10/bottle and $4/glass.  We decided on a bottle of Montepulciano d'Abruzzo - $16 - think of it as a house red that are served in carafe.  It's light and easy to drink, probably good enough to have w/ the food.  The bartender asked for $ but then said he can add to our dinner tab if we wanted.  We were happy to pay first and leave him a generous tip, he was much friendlier when he saw the tips.  Happy Holidays to you too pal.  We must have waited an hour? before we were sat.  Another 15 minutes before we were a glass of water.  Waited for another 15 minutes and still no bread so I asked hubby to flag someone down.  The waiter and waitress and the busyboys are never to be found and they never give anyone eye contact.  We got the hostess to get us the bread.  When the waitress made it to us, she was apologetic and friendly but still she was mostly a ninja throughout the night.    I can't keep track how long we waited for everything, let's just say a simple dinner took about 3 hours total.  We were not in a hurry but we really can't understand why it took so long for everything.  Except for the entree, everything is readily available.  The bread and butter, the soup and the salad.  The soup and salad were brought to us in a tin bowl, the kind you can find in dollar store  The minestrone was all celery and carrot with one kidney bean and few slices of onion and some Italian herb floating.  The salad was iceberg with canned garbanzo and kidney beans, julienne strips of beets and dressing.    We decided on: linguine w/ clams and mussels in white wine sauce - it was ok, the clams and mussels didn't taste fresh - I do give them credit for serving it piping hot  leg of lamb - there were probably 5 slices of thinly sliced meat.  hubby said only the bottom 2 slices tasted like lamb.  he gives them credit for at least not over cooking it.  it was served with probably 10 pieces of rigatoni in marinara sauce and a spoonful of overcooked mostly carrot and few pieces of zucchini.    Throughout our stay including at the bar - we hear the waiter and waitress asking for drinks to comp customers.  The table of 7 next to us got comp 2 bottles of wine.  When we got our check, we were given a 30% discount because we have been so patient.  While it was appreciated, the amount + more went back to tips.  I will consider this as a SF experience but will not return.", 
    "review_date": "2008-12-27"
  }, 
  "HO9VpfYRzD0QFom85uYNDQ": {
    "user_rating": 4.0, 
    "user_location": "Westlake Village, CA", 
    "user_name": "Steve R.", 
    "review_text": "Fun, crowded, and crazy.  This San Francisco landmark may not have the best italian food in town, but it sure has the atmosphere.  Go to it with a large party, not a quiet intimate dinner.", 
    "review_date": "2010-05-04"
  }, 
  "SXfbXQQ5_Vgd80aTkjliNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Soo C.", 
    "review_text": "Celebrated John G.'s birthday with him here and it was awesome.  I'm sick and tired of going to expensive, pretentious restaurants for birthday celebrations, and this was really relaxed and laid back.  Our party of 30 showed up half an hour late and no one gave us any grief.  The waitress kept checking to see if we were okay, and refilled our wine at no extra charge.  There was plenty of wine and food for $30 - soup, salad and an entree.    The best part was I put my card down at the bar and then promptly forgot about it.  When I went outside to smoke, the bartender came outside and reminded me not to forget my card, which clearly I had.     I will note, that on a fairly nippy SF night, it was hotter than balls inside the restaurant.  Within moments of stepping inside, we had all removed layers.  Guys were unbutton their shirts, and there were definitely some glistening foreheads.  There were ceiling fans, but they were about as effective as sticking a 5-year old on the ceiling with a paper fan.    Gas rating: 2 Italian food gives me some gas.  So does seeing sweaty men all around me.  So there's your two points on the gas scale.", 
    "review_date": "2006-08-09"
  }, 
  "wfLtwPY91-EYA7wi3xM-pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie S.", 
    "review_text": "Everyone knows you don't go to Capp's for the food. That said, it's an SF institution with a fun, old school atmosphere. It's family style, so be prepared to sit close to your neighbors, but the portions are big and the prices are fair. It's not that the food is bad, it's just that you can make it yourself, if you feel like it. If you're really hungry and don't feel like cooking, then head to Capp's. Otherwise, save your money and make it at home.", 
    "review_date": "2010-02-01"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "So sue me. I like this place. Always have. Always will. Why? It's simple. I'm a pig. A gutless pig. I never order a soup, salad or pasta side dish on top of an entree because I fear the patronizing smirk of a server who gives me the once-over as I hide myself in black because I am under the delusion it's slimming.  Capp's cuts the crap. They give me the soup, the salad, the pasta side dish and enough bread to feed a small French village during the Resistance. No questions. No a la carte nickel-and-diming here. No way. They serve up each item in quick succession. They don't even mess with checkered tablecloths. They just paint the pattern on the formica. Now that's what I call efficient.  So they have a list of $17.50 dinners - all the pasta dishes sized up to be entrees - or you can have one of their $20 dinners - which are the even heartier meat and seafood dishes. Or you could go for one of the two luxury $25 dinners - osso bucco with polenta (really good!...and you'll be stuffed for days) or the grilled NY steak. For real cheapskates, they have the $15 soup/salad/house pasta combo with \"house pasta\" being code for penne tubes they must order by the ton.  Last night, even after having all those hoity-toity appetizers at Scott Howard during the Yelp Elite event, my friend Carlos and I were still peckish enough to come here. We decided to go for a $15 dinner with penne bathing in the creamiest pesto sauce I ever saw. I've never seen pesto combined with cream before, but hell, who's complaining? And then we decided to split the $20 Chicken Parmigiana dinner. You would think we were bulimic but no. Just two husky guys who don't know when to quit.  The veteran waitress, I'm convinced, can probably serve us with a blindfold on. Here comes the minestrone soup in the dented aluminum bowl. I don't care if the stock predates the arrival of Columbus, it's still the heartiest I've had as it's chock full of chunky veggies. Next comes the salad - which comes in a similar bowl. Iceberg lettuce leaves, tomatoes, cannelloni beans, sliced beets from a can - all of it mixed in a creamy vinaigrette. Reminds me of the school cafeteria. I start to cry 'cause I get all nostalgic.  Ah, here comes the creamy pesto penne and then the man-size serving of chicken parmigiana scorching hot. The side veggies, especially the big chunks of zucchini and carrots - are unbelievably delicious. Must be the stick of butter they obviously use when they heat 'em up.  Full. Uncomfortably full. Too full to go to the men's room in the middle of the restaurant. Capp's Corner never disappoints me. The name always makes me think a one-eyed pirate will come out with a concertina. Ahoy, me mateys. Argh. Maybe it ain't fine dining. But it is about the eating. And who cares? I'm a pig. An unapologetic pig. Go bore someone else with the Zone Diet.  FOOD - 4 stars...a glutton for punishment or a punishment for gluttons...I can't decide because I'm a pig AMBIANCE - 3 stars...North Beach at its Barbary best...hey, if' it's good enough for Marilyn and Joe DiMaggio... SERVICE - 4 stars...like clockwork TOTAL - 4 stars...it's a SF institution...forget Beach Blanket Babylon next door...just eat here to get all the local flavor you want", 
    "review_date": "2007-10-02"
  }, 
  "7JplYGgWFV7EcEHIaQxHpA": {
    "user_rating": 4.0, 
    "user_location": "Danville, CA", 
    "user_name": "Rachel S.", 
    "review_text": "My family and I came here for dinner before Beach Blanket Babylon. As soon as my brother walked up to the Bar, we felt like we had been here 100 times before. The bartender and other waiter who was sitting there made us feel welcome. I was having a low blood sugar attack so I was extremely pleased that we had bread and soup waiting for us as soon as we sat down. Our waitress was sarcastic and funny! My chicken parmigiana was too bready, but I'm used to my dads where he doesn't use any breading. I loved the soup and salad. Everyone else seemed to enjoy their meal.  Would definitely visit again to try something different on the menu.", 
    "review_date": "2010-10-12"
  }, 
  "m9oL5PQ_Sjqpmgqe85qvSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily M.", 
    "review_text": "Yesterday a friend and I were looking for a place to get a glass of wine or a beer so we could sit and chat before heading home.  Two places we went into in North Beach were  not for us--one was too noisy for conversation and the other too expensive for a glass of wine.  So we went into Capp's and sat at the bar.  Decided to have a beer (Anchor Steam on tap) and asked if they had any appetizers we could order.  Oh, No!  they don't.  but the bartender drummed up cheesy garlic bread and meatballs for us.  Delicious!  And so filling that I realized I was going to call it dinner and just have a bowl of salad when I got home.", 
    "review_date": "2014-04-04"
  }, 
  "DQj7DnJiDV9TAxS0ott-3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon N.", 
    "review_text": "Really like this place! Been here a few times, both with out-of-town guests as I think it's a good example of a fun, great tasting North Beach eatery. The house wine is pretty decent too-- just one gripe though - the waiters always seem to have very little patience, and don't really wait around if you have to think for a second or two... probably becasue they're so busy, but still - not the friendliest.  But the food speaks for itself...", 
    "review_date": "2005-07-12"
  }, 
  "Om29zM-B9jsEK28m382QWA": {
    "user_rating": 1.0, 
    "user_location": "Truckee, CA", 
    "user_name": "marsh m.", 
    "review_text": "Restaurant half empty at 5:50pm on Sunday night but hostess wants to seat my husband and me at the worst possible table in the house.  (in the back, near the bar and 18 small children.) Allegedly, a large group was due to arrive shortly after us.  Very poorly handled.--take it or leave it mentality.   We didn't stay.  Won't go back.     Guess there is no such thing as customer service anymore.  Please don't patronize this restaurant.", 
    "review_date": "2007-11-19"
  }, 
  "y3HFVx8nbNmomSc-PWOy-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy N.", 
    "review_text": "Had dinner here Monday night with a friend that was visiting from Italy who remembered this place and wanted to come here.  This place is old school, no doubt about it.  In a lot of ways, it's almost like this place is in a time warp, forever stuck in the 70's, 60's, or worse.  Sadly, this is also true in a culinary sense with the food here as well.  If you are looking for something trendy or sustainable, this is not the place.  However, if you are looking for a charming old school Italian restaurant in SF which is almost exactly the way things used to be (except for prices, LOL), look no further since this place is authentic.  All in all, if you take it for what it is, this place can be a fun and most enjoyable dining experience, especially with good friends.  It's certainly not fancy, but it can be fun.  Lots of old pictures and caricatures on the walls of celebrities over the years gives this place a true old school Italian/SF vibe.  My favorite dish here over the years has always been their osso bucco and like the other night, is what I always order.  Not trendy, but nicely cooked and tender while the sauce had a good depth of flavor.  As always, the dinner came with soup (minestrone), salad (I skipped the salad), and bread.  Years ago, it also included a choice of ice cream, but apparently that has changed.  What happened to the spumoni?  The one expression that keeps coming up over and over is old school.  The quaint little straw bottle chianti that she ordered was the worst wine I have had in recent memory and yet in this environment it all somehow worked.  Perhaps the alcohol from all the wine tastings we did earlier in the evening was a  factor as well.  Afterwards, we bounced around the neighborhood and said hello to all my friends in North Beach.  Definitely a fun night and very Italian or as Italian as you can get in SF.  Bella notte!  Capp's Corner is a true SF icon, may it last a hundred years.", 
    "review_date": "2010-02-17"
  }, 
  "jX52sZoojxyYV2viWNyO7A": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "David O.", 
    "review_text": "We had a group of 20 and we were looking for a \"family friendly\" restaurant that served good, cheap food with appropriate portions.  Oh, and the place had to be tolerant of crying and moody kids, 7 of which we were bringing along...  Taking all those criteria into account, Capp's Corner fit the bill perfectly.   I had the Osso Bucco.   It was good, but it certainly wasn't amazing, and at $25 for the meal, it wasn't particularly cheap.  It's a pretty \"funky\" place in that it's old school, and I certainly enjoyed the meal well enough, but it still set us back about $110 tax and tip included (with a couple of beverages each) and I didn't really feel like it was worth the money.   I don't see myself coming back unless I had to.", 
    "review_date": "2007-11-25"
  }, 
  "wnjLfAVNDoUzlkm8SVptcw": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "K F.", 
    "review_text": "Well, Sorry Greg. I didn't much like this place, and I'd like to think I'm *not* a pretentious asshole.     Went with family at the insistence of my brother in law, who described it as \"old school\" and \"authentic Italian.\"  It may have been both of those things, but also wasn't terribly good.  All entrees were rather ho-hum -- sauce was not interesting, rich or flavored -- a tad watery.  Bread wasn't to my liking.  Salad was boring.  We had to ask for olive oil and butter and never got either (although she apologized many times once she realized).  What my B.I.L. ended up admitting, is that he'd gone here for years with his father when he was as teen growing up in San Francisco, so his recommendation was based on pure nostalgia, and had nothing whatever to do with the food.  We'd never return for the food -- there are simply better meals to be had elsewhere, at exactly the same *type* of place -- unpretentious.   One star for the funny waitress, however, who couldn't reach to the back to serve one of our diners. She said to my brother \"Take this plate from me, honey ... my ass is too fat to get back there.\"  (My brother *actually* bent around and looked to see if she was right.  She was.)", 
    "review_date": "2007-01-29"
  }, 
  "DodFQgkojJ2hCXuI85RR3A": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Vanilla C.", 
    "review_text": "I went there over 4 months ago and had Veal Milanese Sautéed breaded veal with lemon butter caper sauce, a glass of their house wine.  We were seated right away since the place was not busy yet. The server and the host attended to us right away.  Bread came out shortly after.    The place reminded me of old-style San Francisco.  It had tons of photos of locals and nationally known stars.  It was very homey and had lots of large family-style tables.  It is clear that the place caters to families and lots of locals.  The place has a bar right in the middle of the dining area so it was kind of loud.  Especially when that lonely drunk was yelling across the bar at people he did not know and was getting into their conversations.  So, be forewarned that you might want to sit in the back away from the bar.  Back to the food.  I loved my food.  It was well cooked, seasoned, and I had plenty.  So if you are a light eater, this is not the place to go.    To early around 5:30-6:00, cause it gets busy right around 6:30 - 7ish. parking sucks, so allow 1/2 for parking in the hood.", 
    "review_date": "2010-07-10"
  }, 
  "80c1C8Wdj_gklIYOP_MV-A": {
    "user_rating": 4.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Nancy C.", 
    "review_text": "I love \"hole-in-the-wall\" Italian restaurants, and Capp's definitely fits the bill.  The minestrone was excellent, the salad was good, bread was a bit of a disappointment (not sour dough), but the penne with Italian sausage, onion, and bell peppers was delicious.  The atmosphere is definitely \"little Italy\".  One deterrant only, can't mention here... but the food was great!", 
    "review_date": "2009-11-11"
  }, 
  "ziZds2vvl4g8bHciN8-6TA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick T.", 
    "review_text": "This place is such a time warp for me.  I really love its old school no nonsense charm.  Rose is and was awesome.  We were here for a couple of drinks on New Years Eve with a few friends.  Loved it...", 
    "review_date": "2011-01-01"
  }, 
  "lCUazm0F3GhbVMM7J0wzuQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jessica A.", 
    "review_text": "Since we were in a rush and needed to have dinner, we ended up here since it was conveniently located right next to BBB. I had the spaghetti and meatballs and my bf had their lasagna. Each dish came with a minestrone soup and a salad. The soup was okay. The salad was nothing exciting. Just lettuces and a heaping of ranch dressing which I did not enjoy. Looking forward to my spaghetti...because how can spaghetti ever go wrong...i had one bite of the meatball and it was the worse I ever had. The meatball looked blacked and was extremely bland. Although their portions at this place is huge, what's the point if the quality and taste do not justify? And to top it all off, our 2 dishes came out to be around $40 with tax. For that kind of money, I would enjoy something else. Even McDonalds...", 
    "review_date": "2009-09-18"
  }, 
  "YdRlFZAkjUEhmO1KT7oKtg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate G.", 
    "review_text": "yum, yum, yum....  it has great home-style italian food... you get minestrone and an incredible beet/garbanzo bean/iceberg lettuce creamy italian dressing salad with your entree.... its just fun! great for a crowd or a date night.  the bar is cool too but only if you're with a bunch of people", 
    "review_date": "2007-01-24"
  }, 
  "OniLiyqsK0qKv4kptqzipg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Isaac L.", 
    "review_text": "Time warped into historic San Francisco Little Italy.  The place is real humble - picnic colored table cloths, a well stocked bar, and real class act staff.  The host was take straight outta The Sopranos - loved the retro bowling shirt, the dew, and a real fun attitude.   A waitress dropped a bottle of wine that startled one of the guys.  He walked away clenching his heart mumbling something about an 'incident gone bad' back in the 60's.  It was hilarious!  All the items are family style.  Theres an $19 menu and a $22 menu, depending on the entree.  You get all you can eat minestrone soup and salad.  Both were average - standard but very hearty minestrone and a salad resembling House of Prime Rib (garbanzo beans, red beets, lettuce sloshed with thousand island dressing).  Was pretty full even before the entrees came out.  The entrees were delicious.  Had the Veal Tortellini with tomato cream sauce.  Wow this was really really good.  Perfectly cooked, creamy but not overly, and tasteful not heavy.  The Chicken Parmigiana was excellent.  Grilled with char but not fried.  Probably hammered down super thin and had great cheese and marinara on top.  Really good!  The veggies it came with were standard issue from the freezer boiled.    Overall the experience was nice.  Really feels Italian - a bit commercial but super casual.  Something perfect for a rainy and cold night like this in San Francisco.  Could use an upgrade on upholstery, but otherwise its a warm place.", 
    "review_date": "2009-01-21"
  }, 
  "FrEgyUjcmy9LOxfTdzQhFA": {
    "user_rating": 4.0, 
    "user_location": "Watsonville, CA", 
    "user_name": "Marie B.", 
    "review_text": "Topped off a perfect visit to SF from down peninsula fo three seniors.  Was great to see BBB, find easy access nearby parking at Vallejo Garage, and dine just steps from BBB at this couldn't-be-homier little spot.  We happened to arrive as a large busload of seniors from Grass Valley arrived - unbeknownst to waitstaff, who couldn't be more cordial and inviting.  I could definitely imagine stopping in frequently if I lived nearby.  At the invite of waitress and ok from bartender we started our meal at the bar instead of waiting.  Yes, the minestrone was lighter, less pasta-laden than I am used to but I found it a nice lead-in to the salad and entrée, rather than being too filling.  The salad was traditional, as expected.  We did love the luscious beets and remarked at the creamy dressing.  We were informed it was simply egg and olive oil! Whoa-tasted like creamy cesear or...  Each enjoyed our entrée and felt a 3 course dinner under $20 in 'the city' was great to come by.  Thanks to all for a lovely cold winters night out.  We've recommended already..", 
    "review_date": "2013-12-13"
  }, 
  "5rK8eYZHUvugbVoAjvUX0g": {
    "user_rating": 2.0, 
    "user_location": "Point Richmond, CA", 
    "user_name": "Barbara C.", 
    "review_text": "we felt 100% swindled when we left which of course ruined our enjoyment of the meal and i do not plan to return.   this place reminded me of the type of place my parents would take me.. kid friendly, cozy feel with the red and white checkered table cloth and family style pasta that we can all share and not worry about being to loud or spilling..so we thought.   the menu displays 3 options... family style for $18 with various pasta only options, family style $20 with various pasta and meat options, and an individual meal for $15. all 3 of these options come with soup, salad, and bread. the way it was read was that this would be the price for the family portion (at any other italian family restaurant i have been to this is enough pasta for 2-3 people). We ordered the family style chicken parm and our waitress told us for family style we get to choose 2 entrees which threw us off so we ordered the pork chop also to share. when we got the bill we were charged for 2 family style meals.. $50 with our drinks when we were under the impression our total price would be the $20 with drinks.   i asked the waitress to explain and she said that family style there only means we share the soup and salad and we each pay the $20 \"family style\" option. then she gave examples of families who come in and try to order family style for a table of 8.. obviously this means we were not the first to misunderstand their menu and she knew we didn't understand when she took our order and could have clarified then.   note to Capps: asking forgiveness rather then permission is not a good way to do business.. this may work for tourists but not return customers.   note to future customers: the food was very tasty and we enjoyed the environment casual dress laid back environment but for what you get $20 is to high.", 
    "review_date": "2010-08-16"
  }, 
  "wqUN9yXv_bJi4O7Z-bIHew": {
    "user_rating": 1.0, 
    "user_location": "Gilroy, CA", 
    "user_name": "Scott C.", 
    "review_text": "I am really surprised that Capp's has slide to an all time low.  The food was far from what it used to be.  The Sole was so rubbery that you had to saw it with a knife.  The fact that the staff was stoned out of their minds might have had something to do with it.  Several were taking terns going out front and getting stoned.  I do not care that they were high but the output of their efforts were not worth the money we spent.  As a past fan of this restaurant I am sorry to say that it comes off the list of places we eat in the City.", 
    "review_date": "2011-12-04"
  }, 
  "qh6Mkc7Xr-h0QdfY2atfoQ": {
    "user_rating": 1.0, 
    "user_location": "San Gabriel, CA", 
    "user_name": "Calvin L.", 
    "review_text": "Pros: 1) The busboy was the only person there that was friendly.  Cons: 1) Unfriendly servers 2) Impossible to get servers' attention 3) \"Family Sized Portions\" doesn't mean what it is supposed to mean. By Family sized portions, they mean the soup and salad, which doesn't make any sense at all. Everyone orders their own entrees, which defeats the purpose of \"Family Sized Portions.\" 4) I got the Spaghetti and Meatballs, and I could have made it better at home. 5) The Clam Chowder was watery. 5) VERY pricey", 
    "review_date": "2012-09-04"
  }, 
  "AUF3-APCh1q_QD8AaMHRhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren Y.", 
    "review_text": "I was having a little adventure with my friend and we decided to try somewhere new to eat. We found ourselves over by Capp's and decided to walk in.   It was around 3 when we walked in and we were the only ones there except for several people at the bar. We were brought the lunch menu and told the specials. I was debating on whether I should go with a classic Italian sausage sandwich or eggplant parmigiana. I decided to order the latter, a la carte.  We were given a basket of bread which seemed a little burnt but it was still good, especially with olive oil. It also went well with the eggplant parmigiana sauce. The EP was pretty good; there were three pieces of eggplant, a little side of penne, and a side of veggies. Overall, I really enjoyed what I ordered.", 
    "review_date": "2011-10-08"
  }, 
  "CnLNC8VMErPASEq_uimDaQ": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Meg T.", 
    "review_text": "Capp's has a special place in my heart.  I came to SF with my family a lot as a kid and we always liked to eat at Capp's.  Always eat the minestrone soup and the bread.  I get that people have gripes with Capp's because it has tacky, Bucca de Beppo style interior, but the food more than makes up for it.", 
    "review_date": "2010-11-18"
  }, 
  "p-rz5nElTuSyUV1Dzui6Yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marz W.", 
    "review_text": "Pretty darn authentic East Coast Italian. On some Thursdays they have an open blues jam. Sitting family style is always fun if the people you end up sitting with are fun, so it only improves the experience.\n  Its a great place to eat if you are going to see Beach Blanket Babylon as its basically next door.", 
    "review_date": "2006-02-03"
  }, 
  "pq5zcn8SFFct5fUhDpe24A": {
    "user_rating": 3.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Bla F.", 
    "review_text": "This is the second time I ate at Capp's. Both times I had a great time - the atmosphere, the service are special and first rate.  Food is plenty (actually one could order one dinner and a second plate, and both parties would be satisfied).   The minestrone was fantastic and worth the admission alone, well almost. However the main dishes are average. Both times I was underwhelmed. I would've given it 2 stars, but the ambiance of the place and the minestrone are worth one additional star.", 
    "review_date": "2007-07-18"
  }, 
  "E60eQKsPuaFOiKi9vCTW7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany d.", 
    "review_text": "So my family took me here years ago and i was always thinking to myself where was that little cute italian restaurant that gives you SALAD, SOUP, and ENTREE!?! Sure enough we go there again and i lovve it!! FIrst of all the salad is pretty good! For everything your paying? And the soup, ohhh the soup, ive had minestrone soups everywhere, evvverywhere. The majority tastes like progresso soup company walked in there kitchen and poured all there can soups! This capp soup however is homemade and delicious!!! Perfect for those cold windy sf days right? The soup is one of my favorite parts about this place. The entree was pretty great as well! I had the mussels and clams linguini which was delicious. Go there for some yummy \"home cooked\" italian and bring your friends and family. If you want italian thats way over priced and pretty go somewhere else!", 
    "review_date": "2009-08-27"
  }, 
  "Bp-TQEtc6Vs6ldnLgjqglg": {
    "user_rating": 4.0, 
    "user_location": "Wellington, New Zealand", 
    "user_name": "May T.", 
    "review_text": "Let's not kid ourselves about the food. It's mediocre at best, but the size of the entrees and price doesn't hurt much at all.  This place is a North Beach neighborhood institution, with a cheerful Italian vibe and the one of the best host and bartender duos I've met.   It is a place where you roll up your sleeves and sit at the counter to talk with the locals or share a bottle of wine with your neighboring table(s).  Nothing beats the holidays without a visit to good ol' Capps for a drink and a hearty meal with good friends.", 
    "review_date": "2009-12-17"
  }, 
  "1Aiv-gmtJUVoId41CqpDEQ": {
    "user_rating": 2.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Jeff W.", 
    "review_text": "You can't go back.  You know the saying.  Well, Capp's unfortunately fits this truism.  Years ago I went several times.  But somehow time has not been so kind to Capp's.  Let's focus on the strengths first.  Nice big bar.  Great place to get lit before waltzing over to Broadway and Columbus and getting thrown out of a strip joint for asking the wrong questions.  Very friendly people. Homey, cuddly, oh baby how's my snookums, here's a big plate of spaghetti, honey, love ya.  And that's where the problems start.  \"Problems\" is too strong a word.  Average sums it up.  There are a few high points.  The prices are lower for North Beath Italian, but there comes a point where even a Cheap Ass like me is not taken in by the price.  There are three prices on the menu and a selection of choices at each of the three price points.  Everything comes with soup, salad, side of spaghetti, dessert, and a plastic crab.  I'm kidding about the crab. But Capp's trys real hard to give you value.  I give them 4 stars for Value Effort.  The issue is nothing makes me want to rip my clothes off.  Or even unbutton my shirt and start singing, for Chrissakes.  The Osso Bucco was the best of the 5 entres that graced our table.  It was very homey, comfort food, brown sauce-y, reasonably good.  The soup was actually fine.  But other than that, I am afraid I would only come back for the bar.  Right before going to Broadway and Columbus to... oh, nevermind.", 
    "review_date": "2007-02-16"
  }, 
  "CiJat5Up2jAO3B0qTbiN5Q": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Denise M.", 
    "review_text": "This restaurant was a family favorite when I used to live in the neighborhood.  It's loud, packed, food is in huge portions... what more could you ask for?  Minestrone and salad are the classic starters.  And then just sit back and enjoy basically anything their menu has to offer.  I see promotions of this place for the Beach Blanket Babylon show, but to me it's an old neighborhood staple.", 
    "review_date": "2008-07-04"
  }, 
  "poKMUP5vdmsmIBRWgtnX5Q": {
    "user_rating": 1.0, 
    "user_location": "Contra Costa, CA", 
    "user_name": "amy c.", 
    "review_text": "Ambience and food sorely lacking.  Loud,cramped, and bland food. With so many fantastic restaurants in North Beach, one should go elsewhere.", 
    "review_date": "2014-06-29"
  }, 
  "IH1iOatR3UkGxuiZVD4Xqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron W.", 
    "review_text": "This is a very perfect place to celebrate a birthday or other occasion with a larger-than-normal group.  The food is good and classic and the atmosphere is fun.  The only drag is, of course, parking is near impossible. Try up the hill, if you have good shoes :-)", 
    "review_date": "2006-11-29"
  }, 
  "zM-wgtx033u-yHoxk_1GEQ": {
    "user_rating": 5.0, 
    "user_location": "Bloomington, IN", 
    "user_name": "Jessica T.", 
    "review_text": "Great service! People are so friendly. They also gives lots of food. Bread, soup, salad, and then the main meal. We were satisfied even before the main meal! Great family restaurant.", 
    "review_date": "2015-01-10"
  }, 
  "4QgjwgYbvfRwbHEKuPaDug": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Debra H.", 
    "review_text": "Sunday night, 8pm, no wait, family seating.  Comparing the service here to Tadich Grilll.   Capp's wins hands down.  Great server, the place was packed yet they sat down us down quickly with a family from CO.    We ordered a bottle of wine and it was served promptly.  Soup and salad were delivered promptly, and we really enjoyed our entrees of pasta and chicken parm.  Have been here a few times before and the place does not disappoint.", 
    "review_date": "2011-08-01"
  }, 
  "UjAHXZHm9dJzbzK-h870Hg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nanette L.", 
    "review_text": "This must be my lucky place due to the fact that I once won a raffle for dinner here and now this time, dinner was comp by the owners, The Ginella's.  This family style Italian restaurant has been here for eons.  Decor is cool with posters and celebrity photos abound.  A picture of Tom Ginella is post next to the two TV's facing the bar.  I can't help but notice baseball and football were on the two screens.  The meals here are simple, family style Italian and portions are huge.  Our dinner came with bread and butter, minestrone , beets and beans green salad, pasta, veggies, and Veal Milanese and leg of lamb polished off with spumoni ice cream.  I must have been very hungry as I can't believe I ate the whole meal.  Service here is great.  Seeing how busy it was on a Sunday night, the staff was attentive.  Parking can be difficult or park in the nearby lots.", 
    "review_date": "2007-10-21"
  }, 
  "_ijx1PqANQVFLGNWCibdig": {
    "user_rating": 2.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Ursula U.", 
    "review_text": "Afterday a full day of well whatever we could crame into one day in the city my inlaws who live in SF were thinking of a place that would be good,comfortable and not have a long wait. They enjoy Capps and are regulars so off we went  to dinner at Capp's.  Capp's at dinner is not cheap - it's kinda like the Olive Garden in that your entree comes with soup, salad and bread but you have to pay extra while the entree prices are already high to begin with.  The soup was kinda bland but a sprinkle of salt was good enough. The Salad was kinda bland also so off I go to my friend the always there for you SALT. Bread was Bread what can I tell you..... Nothing in the menu really caught my eye so I got the Shrimp Scampi but with creamy sauce instead and on fettucini pasta (WTF - no Angel Hair pasta!!). The pasta looked good but once again the taste or should I say seasonings were lacking.....off to Mr. Salt again.... It was the same situation with my daughter's alfredo fettucini.... Even my inlaws who love this place were constantly sprinkleing salt on every dish- I do not enjoy going to places in which I am paying for tasty food but I'm left with the job of  flavoring it so that it is tasty. The food should come out yummy already.....AHHHH Anyhow, the ambiance was kick back, loud though and depending on where you sit cramped. But as compared to most places in this city I would consider it spacious. The owner was nice - he came over and chit chatted with us a little.... They do need to put some updated pics on their celebrity wall cause man I don't have any idea who those people are....funny thing was we were for sure that their was picture of Elizabeth Taylor,Ophra Whinfrey and young Michael Jackson but as confirmed by the waitress we were wrong so go figure..... Bascially I've had way better Italian food and for less money!!!", 
    "review_date": "2012-01-02"
  }, 
  "fj1Px899gEisDyZOanIcrg": {
    "user_rating": 2.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "aya o.", 
    "review_text": "SO disappointed by our experience here. After reading reviews on Yelp it seemed like a good place to bring family from out of town for a SF standard good for family style dining. I ended up embarassed to have brought them here. The waitstaff was awful and gave us complete attitude any time we asked a question and were generally unattentive. The restaurant was barely full, there were just a few other tables, so they weren't busy. The busboy was the only one on top of his game, and was very friendly. Not so for anyone else. The food was mediocre/average, and very expensive for what you got ($18 for a relatively small plate of fettucine). But I will have to say that the service ruined it for me. Won't go back...", 
    "review_date": "2010-06-09"
  }, 
  "EFyqM9FSEAAKsCIiY1bzxg": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Bob F.", 
    "review_text": "Another lunch at Capp's on December 19, 2013.  Excellent as usual.  The prices never change.  Where else can you get an excellent lunch for $14?", 
    "review_date": "2013-12-20"
  }, 
  "r6Uw1QCfYS1CKtVQrjupag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy R.", 
    "review_text": "Lots and lots of regulars at this place! It seemed like most people in the place knew each other. A group of 4 of us just happened to be lucky enough to get a table without a reservation on a busy Saturday night. The entire staff was very friendly and the atmosphere reminded me of the TV show \"Cheers\".  Before your entrees are served, bread, soup and salad are brought to the table for everyone to share. The prices are decent and the food is good, we were all satisfied!  The only funny thing (not so much a complaint, just funny) was that I think our server was drunk! Actually, I know she was since I saw her taking shots behind the bar. That being said, she actually did a pretty good job! She was overly friendly (of course) and did forget to bring us our check after we asked, but other than that, she was fine. There's nothing wrong with having a little fun at work every once in a while! :)", 
    "review_date": "2010-07-04"
  }, 
  "Wdc_L1VlVDfqxtRArJHjfQ": {
    "user_rating": 2.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "Tiziana Z.", 
    "review_text": "Horrible service and bland food. I had to add seasoning to every single dish including the soup!", 
    "review_date": "2014-04-27"
  }, 
  "4khHC8aiQ-SyaNGdPGRmVQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Will L.", 
    "review_text": "ALWAYS good!  Consistence is key here.  Old school Italian done simply well.", 
    "review_date": "2015-01-12"
  }, 
  "WRc1yA_1Lddz6YKC9VtPUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan G.", 
    "review_text": "Found it. An Italian restaurant that serves food family style. As in big, filling Italian portions. Many Italian restaurants are seemingly not. More a new wave California restaurant with a pasta dish. Or a nicely decoarated Trattoria that charges an arm and a leg, has a good wine list and decent Carbonara.   Capp's is the place you go for some good food, hearty conversation, friendly atmosphere and the feeling of being ten pounds heavier. Walking in you are greeted by a version of your grandmother and seated promptly. If you have to wait. There is a full bar right in front of you.  Order the family style meal. It is moderately priced. And you get way to much food. Salad, soup, bread, pasta, and then comes your main entree. This is how you do it! Save the over priced thin crust pizza with mussels and California goat cheese for another time.  And the TRUE test of this place. Wine is served in glass cups, not wine glasses. Nonna would approve.", 
    "review_date": "2008-09-29"
  }, 
  "3xGTOnOzdqxdZjkaphk4qA": {
    "user_rating": 2.0, 
    "user_location": "Concord, CA", 
    "user_name": "brigitte B.", 
    "review_text": "Went here for my Mother-in-law's birthday. All the food looked great, except for what I ordered. The veal I ordered was dried out, and hard as a rock. Maybe that is not there speciality. Don't live in the city, so I would probably go to Buca di Bepo instead.", 
    "review_date": "2013-10-18"
  }, 
  "8DKSh-Je6p11yEP7lNn_ng": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ellen G.", 
    "review_text": "Capp's has been a favorite restaurant in my family for three generations so far, and it's easy to see why. The food is yummy and the atmosphere is somehow reminiscent of older times.  The family style minestrone and salad is awesome. Capp's has the only minestrone I've ever liked. Boy is it good!  I love the veal parmigiana. It's cooked just right and has the perfect amount of cheese on top. Top notch. The pasta and steamed veggies are great with the entree, too. I had a glass of white zinfandel with my dinner and it really put the finishing touch on the meal. Wait.. I take it back.. the spumoni put the finishing touch on the meal. Big ol' serving and so good!", 
    "review_date": "2008-09-30"
  }, 
  "srj-v0WSYa-1gpmffbeypg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yvette F.", 
    "review_text": "First and foremost, the food is cheap!  They're also just fine.  Had dinner here about 3 weeks ago.  Soup was not bad (unlike what another reviewer said, the ingredients in our soup was distinguishable, not mush), salad tasted fresh and my leg of lamb was quite tasty.  All for a little over $20.  What else can a girl who doesn't cook want?  The servers are a mixed bag though.   There  was one rather rude guy who sat us at our table and a waitress who, when she finally arrivved to work (several tables were waitiing to place their order.  But no one else would take them until she started her shift) was a very sweet one.  So, if you're on a budget and want plenty of decent food and not too fazed by a waiter who ignores you after bringing you to your table, this is the place to go.", 
    "review_date": "2010-02-06"
  }, 
  "JC99U5y-KAchZIjBhf_DiQ": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Vanessa K.", 
    "review_text": "I've only gone to Capp's for lunch, the menu is different at lunch, and there's no pesto pasta for dinner. It's a yummy place and prices are reasonable. Food is fresh and tasty. The only reason why it dropped a price was because some things have changed, portions are smaller than I remember. I've always liked the steamed clams and the shrimp and mussels spaghetti with pesto cream sauce. Those are the best.", 
    "review_date": "2010-12-04"
  }, 
  "1qgjpD9Iz4DtPklG0RgEOg": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Kristen W.", 
    "review_text": "Perfect!! Service to food- awesome dinner after show up the street! Have many friends that drive 45 min into the city just for this place!", 
    "review_date": "2013-09-16"
  }, 
  "6gAcTsq6Eyur4yNFo-K_nw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marnie P.", 
    "review_text": "After watching beach blanket babylon, these usually is the place to be.  With a homie atmosphere and a family style serving. Food here is really good.  If you like italian family style food i think Capp's can meet your expectations..:-)", 
    "review_date": "2014-08-20"
  }, 
  "btNAzOwxZR-mgQk-J7_BxQ": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Chris L.", 
    "review_text": "hello yelpers. Capp's is an interesting place to eat. If it wasn't for Beach Blanket Babylon next door, I'm not sure how long this place would survive. The food is ok. I've had better Italian food in Chinatown. What really pisses me off about this place is the disrespect that I received. When my gfriend and I arrived the hostess/waitress sat us in a corner table which is always nice and private. However, while we were sitting enjoying our \"meal\", she came back over to us with our check and secretly asked that we hurry up and finish because her boss/owner was pissed because we were sitting at this table they wanted to use for a larger crowd. Are you F'n kidding me! Is that my problem! We had just started with our entrees and you are pushing me out the door! Granted a table top of 8+ guests is more money for them, but WTF about the rest of us paying customers. I find it very rude to even ask a customer (in the middle of eating) to please hurry so they can sit others. The place had several other open tables they could have pushed together to accommodate the other party. Or they wait like every other normal restaurant does. I complained to the waitress and all we got were two weak-ass free drinks to enjoy at the bar. Plus they offered a free bottle of wine the next time we come in. Do they honestly think we are coming back? Go scratch yourself Capps!", 
    "review_date": "2009-12-31"
  }, 
  "yhvT5W0IDPx81zVE8_qwGQ": {
    "user_rating": 5.0, 
    "user_location": "Pinole, CA", 
    "user_name": "Alana S.", 
    "review_text": "I have to give Capp's Corner five stars.    Service is excellent and will even accommodate large groups.  The food is outstanding and portions are large.  There is a full bar.  The tomato sauce used in the pastas is one of the best I have tasted, as the acidity of the tomatoes is tangy and perfect.  I wholeheartedly recommend the spaghetti and meatballs - I no longer THINK of ordering anything else because I find myself craving the meatballs and sauce.  The family-style soup and salads are also fantastic.  The minestrone is clearly homemade and has been simmering for some time.  (If you have ever made minestrone, you know that it thickens and gets better the longer it sits.)  I have also tried the sole (delish!), and the mussels, which come with a few large pieces of cheesy, garlic bread.  My boyfriend ordered the veal ravioli once and said the dish was pleasing.  This is a restaurant that my family adores.  We make plans to visit Capp's whenever we are in the city.  As mentioned in previous reviews, it is a San Francisco North Beach establishment with an old-time ambience.  I am hooked.", 
    "review_date": "2013-07-07"
  }, 
  "obG-AA8CvhYORG0GDyeixw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rachel G.", 
    "review_text": "My friends and I were at the North Beach Festival this past weekend and the selection of food at the fair was so so. We scanned the nearby restaurants and they were packed. My friend suggested Capps after seeing it on Bay Area Back roads and trying it a few months ago. We walked the two blocks and walked in. It was defiantly that family owned been here since the gold rush vibe. Definite authentic feeling. Old head shots on the wall along with red and white checkered tables. The  bar was crowded with regulars and everybody obviously knew their name.   We were seated immediately. It took a minute for the server to come but when she finally did, she was very friendly. We placed our orders and waited for our drinks. First the bread came out. It was delicious!! I loved the artisan taste of it. Crusty on the outside and warm and soft on the inside. Every meal comes with minestrone soup and salad. The soup was good but the salad was amazing!! I love dressing and the garbanzo beans in the salad. Not something thats normally in a house salad but enjoyable. By this time I was already stuffed. I still had my lasagna to look forward to and was already leaning back in satisfaction. When our food came, I was surprised to see the large portions. We had already filled up on bread, salad, and soup, and I was not sure how we would finish our entrees. Even my friend who finished the pho challenge went home with leftovers.  I would defiantly go back to Capps in the future. I'm willing to overlook the parking situation in North Beach to fill up on the fantastic food at a fantastic price!! The bill for three of us including drinks was $81...I heard that its just as good for lunch for almost half the price.", 
    "review_date": "2010-06-21"
  }, 
  "Fepez6v1NidY-G8YDj_0kg": {
    "user_rating": 4.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Brooke C.", 
    "review_text": "This is a family Italian restaurant that may not rival the food in Italy, but it will reel you in with the hospitality! Food was good with healthy servings. The staff and the welcome you receive upon entering and throughout your meal create the experience that is lacking in dining these days. You are a part of the family as soon as you enter and it feels like Sunday supper without the crazy in laws. Definitely a place we will return to.", 
    "review_date": "2014-08-28"
  }, 
  "6qEZ-1pK1pzaAgox8OXn9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zach K.", 
    "review_text": "Great restaurant off of the beaten path. I had my birthday dinner here yesterday evening, really enjoyed the atmosphere and food. I had the LINGUINI WITH MUSSELS AND CLAMS, it was on point with the minestrone and salad before the entree.    Met a lovely lady who had lived in Telegraph Hill for 98 years, her entire life and started to talk about the changes she has witnessed in the city. Great wealth of knowledge topped off with a delicious dinner.   Will be back soon.", 
    "review_date": "2013-04-09"
  }, 
  "kCAcbbltX-M6GO6aQgYlbw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mary M.", 
    "review_text": "Excellent family-style, hearty,  Italian American fare. It was exactly what we needed on a cold, rainy night in SF. If you're looking for haute cuisine, you won't find it here, but you will get great food and service, and a lively, comfortable atmosphere.  What they did well: minestrone to die for and salad to savor. Yum! Pasta entrees, veal tortellini and meat ravioli had delicious sauces. The ravioli was cooked perfectly. Anyone who knows ravioli know what this means.  Could use some work: the bread was basic. Not bad, but nothing to write home about.  Overall, this was a great meal and we'll be back!", 
    "review_date": "2012-12-18"
  }, 
  "PKtB9kGhQvr3g22_3t5BXQ": {
    "user_rating": 2.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Barbara P.", 
    "review_text": "Go here for the atmosphere, but not if you want good authentic Italian food. I was here with a group of 11 for lunch.   Service was pretty good though we had to keep asking for soda refills. Food came very quickly after we ordered &amp; empty plates were quickly whisked away.   Started with salad with a creamy Italian dressing. Not bad, but nothing much to it - lettuce, canned beets, a few garbanzo beans. Lunch was the Cheese Ravioli Pomodoro. It came swimming in what looked like chicken broth (huh?) with anemic looking canned diced tomatoes. I was a bit scared to try it &amp; never did figure out what the \"broth\" was, but the dish was okay.   Big thumbs down for the Parmesan cheese shakers. What real Italian restaurant uses the green-canned Kraft grated Parmesan cheese? This one does - for shame.   Didn't have dessert or alcoholic drinks, so can't comment on those. I'd come here again for the ambiance &amp; a drink at the bar, but not for the food which is mediocre at best.", 
    "review_date": "2009-12-07"
  }, 
  "CtIcO-vIqRytQpXrN3lNIQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T. C.", 
    "review_text": "The food was pretty meh. Meh bread, meh soup, meh salad. Entrees were fine but really nothing spectacular. Two stars for having bottles of wine for 20 dollars.   Service was horrible. HORRIBLE. Rude waiter.   I'll never come back.", 
    "review_date": "2012-08-05"
  }, 
  "i7OUiEm1HSvvXNb66Z7SUQ": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Ho H.", 
    "review_text": "Good for celebrations, my kids love it, cheap well drinks, solid and unpretentious atmosphere.  Food is good, certainly not out of this world good, but I keep coming back with groups and family cuz it's fun, one of a kind, an SF tradition and has flavor beyond the food.  Plus there's Courtney... I'm sure I prolly got caught by the missus with my eyes following her around the room, but that's OK, she's good at her job in addition to all that.  Not 5 stars for the gourmet experience, but the overall experience.", 
    "review_date": "2011-06-22"
  }, 
  "QfuxXxo3bKG0HiAiSoKO7w": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Margo M.", 
    "review_text": "This was great!  Professional, friendly service.  Wonderful food and drink.  Perfect location", 
    "review_date": "2015-01-22"
  }, 
  "II3SZQD1NE0zcN4fQqohug": {
    "user_rating": 4.0, 
    "user_location": "Northridge, CA", 
    "user_name": "Danny D.", 
    "review_text": "My favorite resurant in SF.   Food is ok, but it is the atmosphere that makes this place special. The fact that Edie has been razzing customers since the 50's makes it that much better.   What other place can you get a turine of soup (the only minestrone I ever liked), a salad, an entree and a cup of spumoni for 20 bucks. Granted ten years ago it was only 13. But that is a deal!   Great wine selection too!", 
    "review_date": "2008-09-08"
  }, 
  "AGraTma9eEgsiJFDIy6tbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maile N.", 
    "review_text": "3.5 stars rounded up!    Before catching a show at Cobb's Comedy Club, we decided to stop by Capp's for a quick dinner.  I loved the yummy minestrone soup (great flavor, comforting, it hits the spot on a cold San Francisco night, brrr!) and the salad (nice tangy dressing and I love garbanzo beans) we shared.  I got the calamari steak (calamari cooked in egg, yummm, it was cooked just right and it was flavorful!).  The service was so nice &amp; friendly and our food came out nicely timed and quickly (which was good because we were hungry!).  Grazie, Capp's - ciao 'til next time!", 
    "review_date": "2011-01-11"
  }, 
  "5CZDtRWuEw5-NQ5CN5Db-Q": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Yvonne K.", 
    "review_text": "How do you get just the right combination of family style Italian food, San Francisco attitude staff, and cheap, tasty grub? Hell if I know, but Capps Corner seems to have that recipe down to a science. One of the things I love about places like this in the city is the people are real. By that, I mean that they are not putting on some act, following several volumes of company rules and regulations. They are simply themselves, which is friggin awesome! No matter what meal you order, you receive a family style tourine of minestrone soup, and a family style bowl of salad. How can you go wrong??", 
    "review_date": "2010-02-19"
  }, 
  "yan0OV0G1jgv0TnQqj4TBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becca A.", 
    "review_text": "Yeah...so the night started out like any other. Pondering where to go for italian food, me and two of my friends settled on Capp's, knowing little about it. We were delighted by the soup and salad course but the bowls that they were served in--ew! They were scratched up stainless steel mxing bowls. Anyway, so we ordered our entrees and then a forth friend was going to join us. When she did, we made the decision to share our three entrees with her, but they would not allow it. They wanted to charge her $12 for \"soup and salad\".  So we obliged and actually ordered another entree.  When the food came it was really nothing spectacular. I had the veal picatta and it was tough and the sauce had an off flavor. But, they hooked us up with dessert which scored them some points.  As we were enjoying dessert, I felt a small metal object in my mouth. Tainted food, you wonder? No actually my tongue ring had become undone. When I went to the bathroom to re-enstall it, it fell out of my mouth and into the drain. You should have seen the look on the bar tenders face when I asked him for a pipe wrench.", 
    "review_date": "2005-08-30"
  }
}