{
  "aTcai7UJqimgBFR8cxsj6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vee V.", 
    "review_text": "Moment you walk thru the glass entrance, the lighting takes your breath away. It's an upscale scene. I luv the openness n plenty of places to sit. Whether with few girls for GNO or as a huge group. We were delighted to be invited to their soft opening and decided to celebrate a bday there as well. Place got cozy quick. Owners were attentive to our table, bartenders were quick. It is a great place to see new faces or rekindle with old friends.", 
    "review_date": "2012-07-18"
  }, 
  "JShWUURdNc-dQ0PMH9zwwA": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Angela B.", 
    "review_text": "I went here with a friend a few weeks ago to get out an try something different. I was disappointed by what I saw. It was a bit late since we went to another bar prior to coming here but it was about 12:30 am on a Saturday and talk about ghost town. There were about 10 people dancing and dressed in jeans and a t-shirt. The decor is really modern and looks like a great place to throw a bday bash but if you're looking for a good time look else where.", 
    "review_date": "2013-01-20"
  }, 
  "R_6eAqfVlVfqx2bgs_zY0g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trang L.", 
    "review_text": "I really wanted to like this place after reading all the positive reviews, but I just don't. Perhaps, I'd give another chance, maybe... The place was nice and chill, but my experience with one of the bartenders was not so pleasant, hence the 2 stars.   We went to Carbon last Saturday for our friends' birthdays. The place was nicely decorated and spacious for our group of 15. We decided to get drinks at the bar by the back of the room. The bartender (this bald Asian dude) was obviously irritated cause we took a little longer to order. The place was empty, let me repeat - empty. I apologized anyway cause I understand it could be annoying to make people wait for your orders.   The worst part was when I accidentally knocked one of the shot glasses over. I apologized. Again, the bartender didn't say anything, his facial expression remained annoyed and irritated. I said I'd pay for the replacement shot. He looked like he didn't even acknowledge me. Then, he proceeded to clean the counter top with napkins annoyingly and splashed the spilled liquid all over my shirt. I was like \"what the f@*%?\" No apologies, whatsoever... Did I mention that all this time, the whole place was EMPTY??    I probably would not come back here again, not for that kind of BS service...", 
    "review_date": "2013-09-16"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Cool place cuz nobody is here.  I am a fat loaner.  I don't want to be bothered but half naked chicks trying to rub my big belly.  This place would do better if they lowered the price of their drinks.  The new decor is way better than suede.", 
    "review_date": "2013-03-20"
  }, 
  "CK8IMKH8X5gj73GWRHHZpQ": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Michael Q.", 
    "review_text": "This place is actually pretty nice. The drinks are cheap ~$8-10 and the music was good was well (primarily hip-hop). The lounge has a very modern look and feel to it, we reserved a table and did not have to pay cover for our friends (15+ people). The staff were all very nice and lines for drinks were short. The dance floor is a bit small, so don't expect a super clubby environment. Overall, a great and relatively unknown lounge to hang out with your friends.", 
    "review_date": "2014-03-23"
  }, 
  "76vIFZcC7owykCBjMfGVXg": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Amy D.", 
    "review_text": "WOW, this is this old Suede? Carbon is definitely swanky looking, but it was pretty dead on a Saturday night at 12:30pm. It's free cover all night, so at least we didn't have to pay to get in, and there was no line. However, the place was barely half full, and there were less than a dozen people on the dance floor. The music was ok, they placed some decent hip hop songs, but also some not so great music. Drinks will run you about $10 each for hard alcohol. At least there are places to sit since it wasn't packed, and plenty of street parking (you can also park in the Safeway parking structure if there is no street parking available). Although Carbon is definitely upscale, I don't know if I would come back unless I knew it was more lively.", 
    "review_date": "2014-04-01"
  }, 
  "BBel1uYoIcRXhxgzPeg2BA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anji W.", 
    "review_text": "Carbon is a contemporary lounge with modern decor. The music is kool and the vibe is nice. The place is pretty small and it's just a place to socialize. What I enjoy most about Carbon is the unique and delicious drinks the mixologists create. Yes, you can find bartenders anywhere...... But when the bartender can mix up a different cocktail with unique flavors, you get the title of an awesome mixologist!", 
    "review_date": "2013-03-27"
  }, 
  "mVWJtz5O1riPoplNKjo5OA": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Ted N.", 
    "review_text": "Carbon is relatively new to SF's night scene, but it is a welcome alternative to the old, regular clubs or lounges that are becoming increasingly overcrowded and expensive.  First off, there is no cover charge or dress code. However, the crowd there is still dressed well and good-looking. The interior design of the place is ideal for a lounge with a blend of classic and modern design, and is held together with sleek dark colors. They have two bars seating areas for those that like to mingle and relax and a lively dance floor for those with the urge to twerk.  I met the owners of the place outside and they are easy-going guys who are willing to socialize with patrons and want to ensure everyone is having a good time. Can't say that about a lot of other places in SF. They even offered our group free shots!   Overall, the place is new, modern, and welcoming. Great place to try out and there isn't a cover!", 
    "review_date": "2013-09-23"
  }, 
  "tBRb3aoS94FHCiqtrdYtiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marilyn J.", 
    "review_text": "I'm not big on night light going out and drinking. Whenever my girls do drag me out though I usually prefer lounges and bars over clubs with overpacked dance floors.  We came to Carbon this weekend and had a great night. Love love loved their decor, very modern meets rat pack feel.  I also loved the atmosphere and crowd. I usually end up people watching because the crowds in clubs/bars because I feel so out of place I end up looking at the people in there and their actions rather than just relaxing and having a good time. Carbon was a good time from the moment we walked in and had great cocktails. They were right on that fine line of strong enough but still tasted good. Carbon is on my list of places to go if you're gong out in SF at night.", 
    "review_date": "2013-03-11"
  }, 
  "wtWX5z33QlczP5J0Mp4m_A": {
    "user_rating": 5.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Evan C.", 
    "review_text": "We threw our company's holiday party here for 70 people.   BOTTOM LINE: Stylish venue, top notch customer service, reasonable rate.   Ken responded quickly to our questions, addressed issues that were mentioned in other yelp reviews and cleared up any concerns we had. Great bartenders, had space up front for our studio styled photobooth, wireless mic for announcements, nice clean bathrooms, and worked well with our outside caterer.   We had a slideshow to play from the projector. They use a playstation 3 as the projector interface and we weren't able to make the slideshow work via thumb drive. We brought out HD cable just in case, and Ken was quick to help us hook up the cable directly into the ceiling suspended projector and tape it down so that it was safe for guests. He also tended to all of our guests coats and jackets. Ken and the other co-owner were on it all night, tending to our every need and always available.   DJ (included in the package at a a reasonable hourly rate) was a bit late so there was no music for first few minutes, but he made up for his tardiness throughout that night by playing great music that got guests on the dance floor.   Here is an example of the level of service experienced from Ken (co-owner). The wife of one our executives was hoping to get some hot tea from down the road at Starbucks. As our executive was bundling up to make a \"tea-run\", Ken saw them leaving, insisted that he go and get the tea so that they did not have to go out and come back. It was the little things like that that can make for great customer service! Thank you Ken!", 
    "review_date": "2014-02-24"
  }, 
  "U_wcc2TXMaKhTpjUuyxiKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark G.", 
    "review_text": "Pretty nice venue and not that crowded. Dress code was casual. Saw people wearing anything from full on suit to chucks, jeans, and a tee. Not too sure if it's a club, bar, or lounge? They have a DJ and everything but very little room for dancing. Music was hip-hop from when we got inside 10:30 until 12:30 when it switched to EDM. Went here last Saturday night and had a good time. I do have one suggestion: have bouncers inside. Plenty of drunk people that need to be regulated, when a fight did occur, it looked like the bar tender had to break-up the fight. Bouncer outside was nice though. Funny thing after the fight was the DJ played \"Why Can't We Be Friends\" to lighten the mood.", 
    "review_date": "2014-03-17"
  }, 
  "x1paA3aUHJTurbtFkBSOGg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiff C.", 
    "review_text": "Small space but has that modern feel to it. Since it's small it gets hot inside so no need to layer up. Music was good, hard to find places that still play hip hop. Bartenders are good and drinks are stiff. Wouldn't mind coming back for a chill night out with good friends.", 
    "review_date": "2014-05-05"
  }, 
  "zzERAXUF_mzRnEkh1bZWAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A b.", 
    "review_text": "No dress code. No cover. That's all that I ask for in life.", 
    "review_date": "2014-02-05"
  }, 
  "HlJ8GXKKi2gV2erAh6kC0A": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tiffany W.", 
    "review_text": "Carbon is a really pretty lounge/bar. It's a great place to bring a date to enjoy each other's company. When my friends and I arrived, they were actually doing a speed dating thing here, lol.   However, I don't think I would specifically come here. The drinks here were very watery. I got a melon ball here, and asked for Belvedere vodka, because I'm allergic to cheap vodka (just kidding, it just reduces my chances of a shitty hangover). Anyways, my melon ball ended up tasting like flavored cough syrup. It tasted terrible. I only ordered it, because I've been watching Archer, and he drinks that a lot so I wanted to try it, LOL.   As a second drink, I just decided to get my usual, coke and Hennessy since trying new things was not working out for me. My coke and Henny tasted more on the watery side than anything. I barely tasted the coke, so it was more like water and Henny.  Oh, and the music here is just awful. I heard a better mix in my car from Pandora than the DJ here. One minute it would be old school rap, then it would be some random alternative song, then some top 40's hip hop. Completely random music that I had no idea how to dance to. It was honestly killing my buzz.   All in all, Carbon is top notch decor wise. It's clean, and beautiful. If the drinks, and music were better this place would be the spot. As for now, I would not come back here.", 
    "review_date": "2014-07-26"
  }, 
  "9MNumsdViMbqwH3LjGRCSw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Elease T.", 
    "review_text": "Saturday night, 10 45 pm and we were 3 of the 11 people that were there. You will miss the place from the outside because there isn't a sign. Well at least I didn't see one. The layout and decor is sweet. It seems like this would be a good place to throw a gathering for yourself. The music that was playing was a bore. It didn't go with the place. The bartender was real cool. I enjoyed watching him make our drinks. We stayed and chatted for a bit until our drinks were done then we headed out the door to the next place that had to be jumping. This place is definitely a lounge. I would take a date there. There were lots of parking and I liked that. I would go again", 
    "review_date": "2014-10-11"
  }, 
  "hOgg9W0g7R0Xv9vA6Vz90g": {
    "user_rating": 4.0, 
    "user_location": "Berkeley Hills, Berkeley, CA", 
    "user_name": "Lily G.", 
    "review_text": "can i just say that i am so exhausted but feel like i have to write about what a great time i had at this place?!  first of all, it was really freakin' gorgeous inside.  the place is clean and simple but super elegant.  i would most definitely come back for a special occasion or just for the hell of it b/c the DJ  was on point!  he played the usual EDM but mixed it up with some old school hip-hop.   we were here for a friend's going away party and we got bottle service.  the girl who served us was awesome and always made sure to have the ladies taken care of first.  she was really pretty and sometimes you'd expect girls like that to be rude or just ignore you after dropping off the bottle but she always checked up on us, gave us new shot glasses and even danced with me and my girlfriends for a little bit.  my bf bought several drinks at the bar too. service was quick and the bartenders were pretty nice.  (my friend janine wants to add that they're good looking too)  no complaints there.  we stayed way past closing and they were being as nice as possible but i know it's tough to get a crowd to leave.  our server Rb!  My bf just reminded me!  told us we needed to start making our way to the door.  she even offered to call a cab for us if we needed.    overall, this place was impressive for my first time. i can't wait to come back!!!   btw, 4 stars just b/c it wasn't as packed as i expected. but some people like that.", 
    "review_date": "2013-12-21"
  }, 
  "5RifcJP_Lf-MzojTHybBNw": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Susan M.", 
    "review_text": "Came here on a Saturday night around 11:30pm-ish for a birthday party. For a Saturday night, the place seemed pretty empty. Not sure it's such a great location, but there was plenty of street parking.   Drinks weren't too expensive, about $8 for a whiskey &amp; ginger ale. Didn't take long to get drinks, but then again it was pretty empty.   Music was pretty good, a mix of edm and hop hop.  No cover so that was a huge plus!   Seems like this place might be more of a place to pre-game at.", 
    "review_date": "2014-05-05"
  }, 
  "AkMPDtRwmMzQu0f2_hqa6Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alice L.", 
    "review_text": "Carbon serves the BEST cucumber martini!    It's chic and quite modern!  It's usually possible to find an empty seat to sit on.  So,  this leaves you with plenty of room to chill, joy a fine glass of cucumber martini and carry your engaging conversation with friends without shouting at the top of your lungs.", 
    "review_date": "2014-07-22"
  }, 
  "aw973Pm1nrTbRjP4zY9B9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenny L.", 
    "review_text": "Carbon is like a hole in the wall lounge - literally!   Came by on a saturday night for a friend's bday and it was half empty! no joke! Oh the front has no signage either so you're going to have to assume this is the place because there aren't any other lounges around here.  Drink prices are average with top tier lounges in the city. A bit more than dive bars.  The bartenders are really nice - one bouncer in the front who is one chill dude - well until you mess with him lol.  anyways - they have a dance floor but not many people dance - I suppose it depends on the crowd. I had a good time here since there was no cover all night - always a plus!", 
    "review_date": "2014-03-04"
  }, 
  "A-BN3z_DRyu51FNZLThCTw": {
    "user_rating": 4.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Rikki S.", 
    "review_text": "Went here for an anti valentine party which my bf had got free tickets for from a friend but it also worked great as a bday celebration for me as I ended up inviting friends to join us there..  I had trying buying a ticket for a friend and I paid via Paypal but did not get any confirmation or any option to print the tickets therefore I emailed the event coordinator Pete, he emailed me back really quickly telling me their system is down but not to worry as he is putting our names down on the guest list, this was on wed, few nights before the event.. And until aatursay morning I was emailing Pete with names to put on the list and he was amazing to do us.  When we got there, it was a nice little place.. Two full bars.. Plenty of booths to sit.. We were able to get a booth even though we didn't reserve it.. nice music..  I had fun and so did my friends.. It was an awesome way to start my bday :-)", 
    "review_date": "2014-02-11"
  }, 
  "NT5nxkVJ_sj9L5tjIhBO5Q": {
    "user_rating": 5.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Teresa K.", 
    "review_text": "I reserved a large booth for my boyfriend's 30th birthday at Carbon this past Saturday night and we had a grand time. Our party was about 40 people, and our reserved area comfortably accommodated all of our guests.   The venue was modern, upscale, and clean. We were greeted by Tina (the manager's wife) and she was extremely attentive to our group. She helped set up our three-tiered cake and balloons, and started my night off right with a couple complementary glasses of wine. There was another waitress checking up on our booth intermittently throughout the night.   Music was great (our group loves EDM). The venue was packed around midnight. Booking the booth through the manager (Ken) was a seamless process. He was friendly and answered all of my questions. Highly recommend Carbon for birthdays!", 
    "review_date": "2014-01-19"
  }, 
  "UvRUygcyvpJuHh1BiZrrbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess B.", 
    "review_text": "This was a really cool place. Location wise not so good, its across the street from Safeway in North Beach but more Fisherman Wharf area.  Our friend rented this out for her bday, great idea!  The place is super modern, great decor, fresh stiff drinks. I'd recomend coming here to rent it out for a party for sure!", 
    "review_date": "2013-04-30"
  }, 
  "6OdcNCknviaeI4tqZFhU5Q": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jam T.", 
    "review_text": "It's an OK place to hangout. Went there on NYE. There was no cover and staff was nice. But drinks were not well made and lack some kick for the price. This place seems too popular with Asian folks and white guys with yellow fever :P.   I met few really cool people and some gold diggers too. There were couple of girls getting guys to buy them drinks and then turn their back on them. Although I did tell them that's not nice and they're embarrassed :)", 
    "review_date": "2015-01-01"
  }, 
  "uCC1lkUzHP2iz2DF0z3fZw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda L.", 
    "review_text": "Very hip and modern place. A perfect place to grab drinks with friends. Very chill atmosphere. 2 big bars for folks to get their drinks on! The walls are lined with comfy couches.", 
    "review_date": "2012-07-17"
  }, 
  "TAzGPFt9x99JCYWtDmZDWg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Derrick C.", 
    "review_text": "Classy and upscale lounge in SF w/ a laid back attitude.  No cover!", 
    "review_date": "2012-11-27"
  }, 
  "igwvKoNBN2qfxwMn1eD5cg": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Paintball N.", 
    "review_text": "It is a great venue for private parties, if you want a nice place to throw an event, this is the place.  Nice decor, great sound system.  Friendly and easy going bartenders.  They do have some special drinks made with fresh ingredients.", 
    "review_date": "2013-12-23"
  }, 
  "WAkm2t9rJu3yxig-qRPaFQ": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Con T.", 
    "review_text": "Super cool, super swanky, super lounge.... Loving the new remodel! Staff is always helpful and nice and mixologists behind the bar definitely know what they are doing!", 
    "review_date": "2012-10-22"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "WOW.  If you had been here when it was Suede, you would agree that this is a helluva upgrade!  No more 2nd level or dj. Bathroom is completely redone but only 2 stalls.  Plenty of tables and seating.  Table service is great. Primarily Asian crowd so far but I'm hoping once word gets out the crowd will be more mixed.", 
    "review_date": "2012-08-29"
  }, 
  "Yjto3xoDfg-dgMMVjEPuvQ": {
    "user_rating": 1.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Joe Z.", 
    "review_text": "$11 a shot..no one in there..we came here for a bachelor/bachelorette party and it was dead. Felt out of place the whole night. Never again.  The best Bartender was Ian Owners: Ken &amp; Jason", 
    "review_date": "2014-08-24"
  }, 
  "tcKm7Gk7wia7OR8Io829AA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elaine V.", 
    "review_text": "Came here around 1030 on a Friday night and it was really dead. Music was kinda bleh and it was SO HOT. Like no air circulation what so ever. The decor and everything was nice.   Everything was cool besides the temperature.", 
    "review_date": "2014-10-07"
  }, 
  "JCXX0PsGak6HlF8w1P3uiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lester W.", 
    "review_text": "I was lucky enough to be able to attend the soft opening of the brand new Carbon lounge.  The decor of this place is very upscale, modern, and elegant. They have several lounge areas that are perfect for both small and large groups. There is a white couch area that is sectioned off behind a glass railing that I assume is the VIP section. This will probably be a great place to celebrate your birthday.  There are two large bar areas so getting a drink wasn't a problem. The bartenders were attentive and they made their drinks quickly.  I'm looking forward to visiting Carbon again with my friends for drinks.", 
    "review_date": "2012-07-16"
  }, 
  "cvNHL2TIus0dKSZOlGwC8Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Pam S.", 
    "review_text": "The interior of this place really is beautiful.  The night my friends and I stopped in here I think we walked right into someone's wedding after-party because it was super crowded and people were dressed to the nines (leaving us feeling very under-dressed).  The bartenders were really friendly, and the overall vibe is classy/posh.  Not in the most convenient location if you're mostly a public-transiter like myself, but eh, that's what uber or cabs are for I suppose.  I would like to check Carbon out again on another night.", 
    "review_date": "2013-08-25"
  }, 
  "swocJWD8R1iH20-lveXh0Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosalind S.", 
    "review_text": "Nice upgrade to what Suede used to look like.  They totally did not utilize the whole space as the upstairs seemed to be used primarily for office space.  What a waste.   Very nice bartenders, comfortable couches and chairs and a huge womans bathroom with only one stall?  Did I miss something here?", 
    "review_date": "2012-12-09"
  }, 
  "x5tIQxVOTeUe1TGLnFYVrg": {
    "user_rating": 2.0, 
    "user_location": "UC Campus Area, Berkeley, CA", 
    "user_name": "Michelle P.", 
    "review_text": "If you like feeling squished in a herd of Asians, then this is the place for you. I personally don't like the set up of this lounge. Even when there were less people, I felt like the entire place was like a long narrow rectangle. People are constantly running into each other and spilling drinks.  The bartenders were not very friendly and the drinks were mediocre in my opinion. Overall, I feel like there are better lounges than this.   However, I did like the music since they were playing a mix of both edm and hip hop.", 
    "review_date": "2014-05-07"
  }, 
  "-OODneV01sxed0jBUv8XVg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy L.", 
    "review_text": "My favorite lounge in SF.  The new look is sleek, modern, and chik!  Service is impeccable...I asked for hot tea and of course they did not have any ( haha, most bars don't ) BUT the owner went next door and brought some back for me!  Now that's what I call service.   This venue would be awesome for private parties and networking events too.  The space is big enough for about 200 people, there is a lot of sitting area, and they have a fancy ladies restroom.  Keep in mind this is not a CLUB, so the music is not over bearing and you can actually hear and converse with your friends. There's two bars, so its easier to get drinks.  IF you come with a big party, I highly suggested getting table service.    ***** Ambiance  ***** Drink Prices ***** Service  Oh did I mention there is parking too! :)", 
    "review_date": "2012-12-17"
  }, 
  "F0KIbMTE8w5BVow2yopKpQ": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "James Y.", 
    "review_text": "Beautiful place and great staff. I was surprised when someone told me that this was the old Suede location. UPGRADE COMPLETE", 
    "review_date": "2012-10-21"
  }, 
  "6XCZoufB_S-sY6vsxMGd8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jason g.", 
    "review_text": "A long overdue review for this place.  It's a very posh lounge. Everything is updated from the previous establishment.  It would be an ideal venue to hold a private party, networking or catered event that can hold 200+ ppl comfortably.  I would even recommend to the owner or to potential customers(obviously you would have to get permission from the proprietors but these guys are very cool) in bringing in a good pop up in here too.  From my personal experience here, it would definitely help if they had food.  Judging from the look of this place, it would be a waste not to have some basic bar food.  I do understand why many bars don't have food because of the cost to operate and food cost.  From my experience, you want those customers to stay in your place as long as they can. That is the reason why I believe the pop up idea would work. They have a pizza joint next door which is cool because who wouldn't want a slice of pizza after a night of drinking?    Once of my go to places in the City.", 
    "review_date": "2012-10-08"
  }, 
  "Ve6Yq7F9Chf8N0JuJ7cQ2g": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jocelyn C.", 
    "review_text": "I reserved this place to celebrate my 29th birthday. This place is a very cute lounge. I like it because of the decor &amp; large booths. This place has two full bars and a very big projector that plays music videos. They also have a decent size dance floor.  Its a cute lounge that has everything I want.   Its in the North Beach area of SF &amp; let me tell you, its a great area. There's no traffic. I felt like I was in the East Bay, because I'm used to SF being so busy.  Carbon is hard to find, because there's no sign &amp; nothing lit up &amp; its very small on the outside. So, look carefully.   Ken Wong &amp; Jason Gee are the owners and are very nice! I had reserved a booth there prior to my birthday event &amp; when I walked in &amp; introduced myself to Ken, he immediately told me that I could choose any booth I wanted, he bought me a drink for my birthday &amp; he introduced me to his partner Jason. Not to mention, I didn't expect a sign that said, \"Reserved for Jocelyn Cheung\" that he put on the tables near the booths I wanted to settle for the night. I felt very special &amp; definitely is thankful for everything they did for me.    Its too bad I was expecting more friends to show up, but I still had a good time with the friends that came &amp; is thankful for that too. I am definitely coming back to Carbon as I am very thankful for everything Ken &amp; Jason did for me.   Those who want to have a great time with friends, want great service, want to dance &amp; also want some really pretty decor, this is the place for you.  Its a cute lounge with everything.", 
    "review_date": "2013-10-22"
  }, 
  "vdZaeSDbsWd_JeNqt92NmA": {
    "user_rating": 2.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Regina B.", 
    "review_text": "Came here around Halloween with some friends.  I was extremely underwhelmed.. haha!  It has potential to be a great lounge if they played better music, maybe live or DJ..?  Seemed like we were listening to someone's iPod.   Lots of space, but I just felt for Halloween with lots of people in costume, it wasn't all that fun.  Maybe stronger drinks and better music would do the trick :)", 
    "review_date": "2013-01-20"
  }, 
  "ty-OlvcgAykAM8Es4REs9w": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Dreamer L.", 
    "review_text": "They did a really nice job with the remodel. It's a very beautiful lounge now. I would've gave it a better rating if the music was played louder. The music is played wayyyyy too low.", 
    "review_date": "2012-12-15"
  }, 
  "yH2rurK5sYobprHb0ziyxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jossy S.", 
    "review_text": "Went to this place last night for the first time and I live 2 blocks away from here. The ambiance is nice inside ***** which made the pictures we took came out even better and the bathroom was clean w/ lots of mirrors for us ladies. Music was good but no one was dancing so by the end of the night I was dancing by myself which was fun also. Talked to the bouncers there they were nice, met the owner kewl guy also. My overall experience there was good and will definitely go again with my friends.", 
    "review_date": "2013-04-28"
  }, 
  "fXKRTax3LU5mLat_-Z13zQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L C.", 
    "review_text": "I came to Carbon for a friend's birthday party on a Saturday night. It was pretty busy but I didn't have a problem getting drinks at all since there are 2 bars. I loved the sleek decor and the seats were comfortable. The VIP area in the back had enough floor space for people to dance but it's really more of a lounge than a club. People were dressed up too, which makes the ambiance that much nicer.   My only complaint is that the restroom only has 2 stalls. One of the stalls are super hidden too. I do like the vanity in there though.", 
    "review_date": "2013-01-14"
  }, 
  "viiCNVsQ42oIzbVRo9cgRw": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Mandukhai E.", 
    "review_text": "The one thing I love most about this place is their decor. Since i'm a die hard decor lover, I was instantly drawn to the pictures on yelp! Decided I HAD to have my bday here. Another thing I liked was that this place is sort of \"undiscovered\" and doesn't really get super packed.  We went on a sat night and yes, this place was maybe a little tooo \"undiscovered\" as there were barely any ppl there! But the ppl who were there were mostly asian, and dressed really nice.  This place has a more \"loungy\" feel than anything.  The bathrooms are clean and again, the interior was amazingly done.  Bartenders were nice, but the drinks could have been cheaper...or they could do specials maybe? Might draw more people in :) If you are celebrating your bday, def let the waitress/bartender know! Might get a free shot or two out of it :P", 
    "review_date": "2012-12-12"
  }, 
  "0zZk826vbqYCx_yV8WGvtw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wing L.", 
    "review_text": "Chic, nice decor, clean women's bathroom (with two stalls only but it was huge).  Came here on a weekend when some friends were visiting town. We were at the wharf and didn't feel like going far so we decided to come here. Walked in and the place was hosting a matchmaking/speed dating event - interesting!   This place doesn't get busy til about midnight. Two bars so not really any lines. Plenty of sofas and places to sit.  There were only a couple tables who reserved bottle service. Music was okay. People were okay. The crowd was pretty okay except for maybe a few questionable folks. No designated dance floor but there's an area for it.  Women's bathroom has two stalls and lots of mirror space all around.", 
    "review_date": "2014-06-04"
  }, 
  "DL-hyIzDjq2PWQFRaUDU8Q": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Bella M.", 
    "review_text": "I came here to celebrate a friend's birthday. She had described it as a classy lounge that wasn't too crowded. She was definitely right about that. On a Saturday night, there were enough people to make it seem full but not enough to make it seemed like I was suffocating.   I definitely enjoyed the ambiance of Carbon. There was plenty of space to dance and enough couches around for others to sit around to people watch. I never had to wait long to get a drink from the bar. However, 2 of the guys in our group had been waiting for quite a while at the bar and thought the bartender wasn't paying them any attention. I stood in between them for about a minute &amp; they were finally able to get served.   Two things I absolutely did not like: 1. Women's restroom does not have a soap dispenser. I thought perhaps I had too much to drink &amp; didn't see it, but when I asked another lady in the bathroom if there was one she said there wasn't. She told me she mentioned it to the owner before &amp; their response was that they would get to it eventually. I'm sorry but that is a poor excuse &amp; definitely unhygienic. Luckily, I had hand sanitizer in my clutch.  2. My group of friends stayed all the way until closing at 2 am. We knew closing time had come, but the birthday girl wanted to thank the bartenders &amp; owner for having us. I'm assuming it was a worker or a friend of the owner's, but a lady come up to me &amp; another friend and put her hands on us as if she was pushing us towards the doors to get out as she mentioned the cops tend to come around the area at that time. I felt that was incredibly rude and unnecessary. We were leaving on our own &amp; she didn't have to touch us.   Despite those occurrences, I would go back to this establishment because I thoroughly had a great night with friends.", 
    "review_date": "2013-12-02"
  }, 
  "Rgf9lI8RTU5q8-rc5wwklA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megha A.", 
    "review_text": "This place has major potential.  the DJ on Saturday absolutely sucked -- play house, play hip hop, play something with a beat that people can dance to! On Halloween you gotta have the place bumping but the DJ was just not doing it.  Also, you can't really get cabs in this area...at all.   but....it seems this place is new, people are nice and friendly, I like that it's not crowded with douchey/sloppily drunk people, drinks were strong, table service was really good.  Just have to fix the above 2 issues and it will be good to go.", 
    "review_date": "2012-10-29"
  }, 
  "SXfvHWScLghzoTSBqb_e6w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Angela L.", 
    "review_text": "Was debating between 3 and 4 stars, decided to round up.   For our annual triple birthday bash, my friends and I were looking for a place that had enough space to hold all of our friends and would be fun for everyone. None of us had heard of Carbon, but the photos looked great and we liked reading that the place is spacious, with plenty of seating. We emailed Carbon about 5-6 days before our event, and never received a response (we were going to reserve a table and buy a bottle). Luckily, when we got there, we were able to do so that evening.   The interior is modern and chic. Lotttttts of places to sit, and two bars. Contrary to other reviews, there WAS a live DJ the night we went (Saturday). At first the music was heavy on the EDM, but then switched to some really good hip hop. Not sure if one of my party remembers requested it or the DJ just did it, but either way I was grateful!   Getting a bottle was a bit hectic. At first I couldn't find Ken, who seems to be in charge of bottle service. Once we did get a hold of him, it took awhile for us to get everything set up at the table. Still, we had a great night, and these were minor hiccups.   However, I checked my credit card statement the next day and saw the charge for bottle service, but an additional separate charge of $36. I emailed Ken to ask what the charge was, and it's been four days now with no response. It's only $36, but it's a bit unsettling that a simple explanation is taking so long. Regardless, the good definitely outweighs the bad with Carbon, and I would come back again/recommend it if you're thinking of hosting a party there.", 
    "review_date": "2014-07-31"
  }, 
  "jipgimnSNp3qdK2dKUQvBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "Sexy, sleek &amp; big enough!  I never went to Suede but my friends that have said that Carbon is a big improvement, though they've done away with the upstairs that Suede used to have.  If you want a table/bottle service Vana is your go to girl!  She is wonderful!    There is no live DJ, but the music played with the iPod hooked up was good enough.  Women's restroom had 2 stalls (lighting over the stalls was dim), was clean and just like the lounge..sexy.  Gotta love the exit which leads to the lounge!  I heard the men's room was super dark though!  Drink prices were pretty reasonable, my Yelp Elite buddy Cherylynn treated me to a tequila sunrise with Don Julio in it &amp; it was $10.  There were a ton of guys there...I don't know if it was just cuz all the b-days going on or if that's a normal night.  Something to think about though.    I had a great time here for my birthday.  I suggest Carbon if you want a not so crazy night at a very nice lounge, but want some music in the background unlike other lounges.  Parking I thought was going to be difficult but everyone found parking easily.  Come to Carbon if you want to have some good drinks and a sexy ambiance where you have room to move and breath.", 
    "review_date": "2012-08-20"
  }, 
  "etasmSW3t5QoKhl5V6jAYA": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Gary S.", 
    "review_text": "Great ambiance and people. Mostly came here for birthdays, but would love to come here on a regular basis. It's definitely hit or miss here, but this lounge is still overall awesome.", 
    "review_date": "2013-10-06"
  }, 
  "6JeTaXe3rtyvoPQP71IbKg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Geo D.", 
    "review_text": "Carbon is pretty interesting. Went here for a couple of my friends' birthdays.    In a nutshell:  Pros:   -Awesome space, lots of potential  -two bars  -friendly staff  -great edm music - awesome place if you're super comfortable with a predominantly asian crowd  Cons:   -Bartenders water down drinks like nobody's business (ordered a manhattan and 40% of it was water) Pro Tip: Just order shots - yep, dat 90% asian crowd  -There's an awkward \"DJ Corner\" near the bar which kinda ruins the dance floor mood- bring him to the front!  Tips: -  If you're looking for a more diverse crowd, you might want to skip out on this place -  If you're looking for quality premium drinks, you definitely might want to skip out on this place", 
    "review_date": "2014-01-21"
  }, 
  "SVw6xcxsTY1yB7XxMwoCog": {
    "user_rating": 5.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Connie O.", 
    "review_text": "Been here only twice and I have to give it a 5.. I had a good time the first night, but left early.. Return with 2 other gals the following night after bar hopping.. And had a better night..!! - Jason was always great and polite and I am honored to always shake his hand  every time I go in and greet him.. And I shall do the same when I leave his establishment..!! - Ian, Mr. Bartender, the first night that I was there was cool.. Literally HE IS..!! - Cause Mister was \"Mister Cool\" on the Dance Floor and HE WAS THE HOTTEST DUDE there.. Even though he was saying he was a dork.. He knew what he was doing.. We were laughing and having fun dancing..!! THANK YOU, IAN, FOR THAT DANCE.. Very unforgettable.. Hahaha.. I know that besides the \"Vegas Bomb\" nickname.. You will remember your \"Studly Dance\" and it was me dancing like a dork.. Hahaha .. - So Carbon.. Thank you.. Yall made this female happy moving back to The City - exactly 1 week now..!! -", 
    "review_date": "2014-06-15"
  }, 
  "XzDCNhJeyxswut6qBprEJw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Jenn G.", 
    "review_text": "The first thing I thought of when I walked in was that this place was very posh.  I loved the couches and how spacious the place is.  Unfortunately it was dead on a Saturday night at 10pm.  I know 10pm is early still, but there was no more than 20 people there (and my group alone was 12 people).  It did pick up a little bit later, but overall the place remained pretty empty all night.  The bartender was very nice, he made custom drinks to our liking and was very chatty.  Overall I enjoyed the venue, but parking is a pain in this area.", 
    "review_date": "2013-05-08"
  }, 
  "neDxqHwdJKLC30IbJTaRUQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lynna C.", 
    "review_text": "Came here for a friend's going away party &amp; I really enjoyed it here!  It was a bit empty when my girlfriends and I got there around 11:30, but it quickly filled up by midnight! They have two bars with a small dance floor and couches lined up against the walls.   The music was on point with a mix of EDM, Hip Hop &amp; Top 40. What I really liked about this place was that it had a more classy atmosphere and there were no strangers creeping up on me &amp; my friends.   The bartenders were AWESOME. One even offered me a bottle of water after seeing me help my intoxicated friend. Kekeke ^__^  Another plus: my friend forgot she left her coat in our reserved section and they let us come check for it AFTER they had closed. Not only that, but they were SUPER friendly about letting us check AND use the bathroom before we left.   All in all, I had a very good first experience here. Will definitely be suggesting this place to my friends when I come back to the city.", 
    "review_date": "2014-04-07"
  }, 
  "aomNqHWFUDimNx7bkxuarw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Komendi K.", 
    "review_text": "Awesome Fun place! First time here, celebrate friend's Bday party.  For the service, bartender make a good strong drinks. Friendly staff", 
    "review_date": "2013-01-26"
  }, 
  "8ymlt8ygqjoV18IXVIcT8A": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Tramy V.", 
    "review_text": "This place is super nice and upscale.  However, it was super dead for a Saturday night.  Hopefully, word will spread and things will pick up.  It is a nice place to just hang out and chill.  If you're looking for a massive clubbing scene with a large dance floor and DJs, this isn't the place to go.  It is more small and private.  Good job on the redesign!", 
    "review_date": "2012-10-19"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Wow! That was my first impression of this club because I didn't expect this trendy club to be settled in the low key area of Fisherman's Wharf!    The Saturday night I went, however, there was like about 20 people...it was really empty for a club!  How unfortunate, but I see a lot of potential in growth with word of mouth!  It's probably because the club isn't located in central Downtown and that the exterior looks really glammed down!   This is my kind of dance music! Hip hop with a mix of electronic and mainstream! Yeahhhhhh, you got the music right!  The lounge seats on the sides and decor lighting looks chic!  There is a bar near the entrance and near the end of the dance floor area!  Their bathroom was trendy and clean too, but it was probably clean due to the lack of people there that night!  I have to go to this club again when it is crowded because the crowd keeps it tight...get it right!  DJ keep playing that music!  Right on!", 
    "review_date": "2013-03-22"
  }, 
  "o-AvZ1UAOMjSqkw_LZ5TnA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Maria H.", 
    "review_text": "Really pretty place. Personally, not my cup of tea.  Maybe this proves I'm a hoodrat chick, but this place is a little douchey for my taste. Have you ever watched the episode of The Simpsons and Moe starts a new, posh lounge called 'M'? The vibe was EXACTLY like that! It's a high maintenance, fraternity/sorority breading ground.  \"M U S I C\" (If you can even call it music) They play backdrop noise. If there is an artist to the instrumental, synthetic trance-like.... thing, I've never heard of it. Music that you would use for a mock fashion show like in Zoolander.  D R I N K S I did not really partake in drinking here because I was in charge of taking care of the birthday boy/DD. Yay me?   A M B I A N C E Yea, I totally pregamed before I came here. I needed to drink ASAP so I can sober up by the time we were done bar hopping. (To make a point that I wasn't a sober party pooper) I rather go to a trashy bar than stick around such a snooty crowd. I stood in line in the bathroom and different groups of girls are just a-holes in there: banging on the stall doors, yelling at the other girls to hurry up. \"There's a long line out here!\" \"We have to peeee!\" \"If you have to take a sh!t, do it at home!!\" \"Mother effer get out of there!!!\" They were seriously threatening girls in there. One girl cut the line because she had to puke and some of the girls didn't let her use the faucet.                          AND THESE ARE DIFFERENT GROUPS OF GIRLS!  Ack, so horrible. I'm proud to say that my group of 7 guy friends all hated the nature of the place as much as I did, no matter how hot the girls were! Our group grabbed some drinks and we headed out asap. Not my scene, not my crowd of people. But I didn't see anything technically wrong for other people to enjoy this place.", 
    "review_date": "2012-12-02"
  }, 
  "302jnQA1vup2oNMabmcSbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sujan J.", 
    "review_text": "I was linked up with the owners (Jason &amp; Ken) by a friend of mine for couple events I wanted to throw.    They were super accommodating, friendly, and willing to go out of their way to help us with our events.  Interior is classy and modern, and music is at a just right level so you can chit chat with your friends without having to yell at the top of your lungs.  This is a lounge not a club!  Oh and parking was super easy too. Got VIP right outside the door parking two nights in a row (not sure if it's the area OR if I just happened to have arrived at the right time both nights in a row).  Bar tender DOUG is your man. He will concoct any drink you want. You just tell him spirit of your choice and he'll whip up something amazing for you!   Definitely consider Carbon if you are wanting to throw a private event, and definitely check out Carbon if you want a cool lounge to chit chat with your friends over really good cocktails.  Thank you Carbon Lounge!!!", 
    "review_date": "2012-07-21"
  }, 
  "ymPziCT9HyrXKB6CD9lgxA": {
    "user_rating": 4.0, 
    "user_location": "Melbourne, Melbourne, Australia", 
    "user_name": "Kevin S.", 
    "review_text": "We went to Carbon on a Friday night after getting back from Alcatraz and we were actually very surprised because we were the only ones there! That was a massive letdown in terms of ambiance.  The bar itself is pretty cool though. It's fresh, modern and the decor, layout, tables, chairs and couches work well together. The Dim Lights (love dim lights!) give Carbon an intimate and romantic atmosphere which is great if you're on a date - trust me, she'll know you mean business!  The bartender was really nice and our drinks were pretty good. I was happy with my Vesper Martini.   You should definitely try Carbon if you're in the area..", 
    "review_date": "2013-07-08"
  }, 
  "bp9b4_fS94ALQ3DxN0YG2A": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jor S.", 
    "review_text": "The rating system is kind of hard for clubs and bars.  Most people would want to rate it as the fun-ness factor or how much fun they had at that particular time.  I'd like to think I've been going to bars for a while now and I can tell when one is a good one or not. This bar has all the components of a great bar.  The decor is classy with a hint of the retro (the lighting) and the seats, walls, and bars definitely had a modern look which was aesthetically pleasing. The drinks were...well..drinks...moderately priced like you would find at any other nightclub. For some reason, the night I went it was a really dead night.  There were tons of room to walk around and hopefully it would get a little bit more crowded to help the ambiance of the place.  I suppose that my only complaint is that it is damn near impossible to find.  Everything is blacked out on the outside and there isn't any indication of which building the club is located.  I found another group of people outside before looking for the place and didn't know where it was either.  Luckily, i saw a nicely dress man and a girl with a lack of clothing that entered an unmarked door.  Just FYI.", 
    "review_date": "2012-10-09"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "The strawberry and berry mojitos are good here (if they have them - they didn't last Saturday).  A lot of the older Asian crowd have their birthdays here for some reason.  I hope to not have my birthday here when I'm their age.  There's a dance floor but no one dancing - just a standing meat market.  The bartenders and staff are professional.  We were in for two shots then went to tradition for better drinks.", 
    "review_date": "2013-07-05"
  }, 
  "Wj0tIFlWz_1Uam1VDWYG5g": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Ron R.", 
    "review_text": "This was one impressive, sleek, and stylish lounge!  And just like fellow yelper Tiffany D said; I too said Wow!    We arrived early for our friend's birthday celebration with another fellow yelper Mark J.  Everyone dressed with class.  Except for this one character that wore an exclusive home made Karate Kid Cobra Kai jean jacket, complete with torn off sleeves.  Haa-yahh!!!  He was cool talking about it.  Said that it was created by his girlfriend who was at work that night.  Daring to wear, but Impressive indeed!  You da man, John!      Now, I'm not sure if it was because of a Cochella weekend, but there really wasn't a lot of people that night.  In a way it was a good thing for the birthday celebrant, as his mutual friends got to know everyone.  This really is a nice place to lounge and have a drink or two.  Too bad attendance was low.  The owner Jason was a nice guy and took good care of the guest that were there. I was also impressed with the well dressed server taking care of the champagne.  As for the bartender, Ian, well done on the drinks!    If you've never been to this place, it might be hard to find; So look for the Adult boutique next door.  If you cannot find parking, there's always space at the Safeway garage across from it.  FYI, I ended up paying $26 for being there over 3 hours.", 
    "review_date": "2013-05-11"
  }, 
  "3cnIyELXdZa9C9nFH5NXtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veasna H.", 
    "review_text": "This place was nice.  The remodel is still fresh and there is plenty of open space...although most of it is up because of the high ceilings.  It might also be because the place doesn't get crowded.    The ambiance is definitely a lounge setting with \"background\" music.  Most people are there are younger asians.  Not a bad looking crowd, but I find it ironic that the people here are usually more dressed up than most places even though it does not have a dress code.  It probably cause most people that come here are here for a special event of some kind.  Bar service is speedy, but again because it wasn't crowded.  Overall not bad, but with so many other lounges in the city, it just feels like it hasn't been fully developed or realized.", 
    "review_date": "2013-06-10"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "I went here with my friends on 1-20-13 12:50am'sh.  As I entered the lounge, noticed it's remodeled to an upscale bar ( I been here before when it was called bien bien,etc), I think they try to copy Las Vegas. I ordered a corona for $6 (as expected).  My friends were dancing towards the rear of the bar, pop music was played and some others I recognized in this outing.", 
    "review_date": "2013-01-20"
  }, 
  "81c6DgPqxdZ_QFNzvVsI6w": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Kenneth H.", 
    "review_text": "Five reasons why it's a 5:  1) No dress-code (meaning you don't have to wear dress shoes). 2) Bartenders are quick and friendly. 3) There are places to sit. 4) There is music, but not so loud that you can't carry on a conversation. 5) See all the above.", 
    "review_date": "2012-12-11"
  }, 
  "-Ryl_0mZE_71CMPIcbzZhg": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Derrek O.", 
    "review_text": "Came here last nite to celebrate my wife's birthday. I had been in e-mail correspondence with Ken, the owner, for about a week working on particulars. My plan was to have a surprise birthday setup for my wife and Ken allowed my friends to come in early to setup. When we arrived Ken introduced himself and offered us a \"birthday shot\" on the house for my wife and I. That got our night started right and the rest of the evening quickly became a blur. We brought a birthday cake that Ken kept in their fridge up until the moment we were ready to surprise my wife with it. I must say that the whole staff were genuinely friendly and Ken and his business partner Jason were the models of hospitality.   The venue itself was chic and decor contemporary. There are two bars and maybe half a dozen booths for bottle service. Ours was the largest, white booth which comfortably seats up to 20 people. The DJ played a nice mashup of Top 40 which had our group grooving all night long. What I liked best is that the clientele wasn't ratchet and that the venue wasn't overly crowded like most clubs. It was the perfect combination between chill lounge, yet poppin' enough for people to get off their asses and on the dance floor. I'm sure I will be a patron of this business for a long time to come!", 
    "review_date": "2014-03-02"
  }, 
  "KUYTHplcbhYVMrTsBI1gaQ": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Warren A.", 
    "review_text": "Was browsing the wharf area and stumbled upon this very modern looking lounge.   thought it would be stuffy and pretentous but was surpised by the attentive wait staff and trendy crowd.  it was not overly crowded and the music was not over powering so its easy to converse with the person next to you.  They also are into the mixology thing which was great for those who don't like the regular drink fare.   Fresh fruits line the bars providing ample ingredients for the bartenders to whip up whatever peaks their interest.   A great place to start the night.   A nice hidden gem in fishermans wharf.", 
    "review_date": "2013-01-16"
  }, 
  "bKmLqpm3ukBfOzETXpNSYA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BizzyLizzy K.", 
    "review_text": "Cute place, clean &amp; all but no diversity in clientele.  Way too many Asians.   Has potential, as Ian, the bartender, was nice &amp; the drinks were good.", 
    "review_date": "2014-02-06"
  }, 
  "R_2Fiq7E58QXif7WCerWVw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rupa A.", 
    "review_text": "Carbon is a hidden and relatively undiscovered gem in San Francisco. Located in the Fisherman Wharf area, it's easy to miss Carbon if you are driving past it. Look for the glassy looking double doors and the address.  In the past month, I've been here twice already, and really enjoyed my night both times. As all other yelpers mentioned, the decor is great-- classy, sexy and sleek. The lounge itself is long and narrow and lined up with couches and tables. There is plenty of space to sit and mingle with friends. There are also two large bars, with strong drinks, and no lines. Bartenders are attentive and very nice. The second time I went to Carbon this month was for my birthday. The manager of the club made me feel very welcome and gave us two rounds of champagne on the house. There's also a pizza place next door that stays open late-- perfect for when you have the drunchies!   The only downside is that Carbon has yet to attract large crowds to it, which is surprising because it has all the elements of a great lounge. The plus side to this is there's no waiting to get in and there is no cover! A perfect place if you want to hang out and meet with friends without getting drinks spilled on you, listen to ear defeaning music, and wait hours in line to get in.  I'll definitley be coming back again!", 
    "review_date": "2012-10-25"
  }, 
  "2Yg3D3xUNNzmn-SicXZOnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy C.", 
    "review_text": "By far, one of my favorite lounges in the city. Came here a couple times and parking were close by every time. The atmosphere is pretty, classy and nice. I love how they have so many nice couches and tables. The crowd are quite dress-up in here--girls in dresses with their Chanel, Louboutin, Jimmy Choo, etc etc, and some guys with ties and all. They play pop music, and it was loud enough to carry decent conversation.   The cocktails here are awesome!! The bartenders at the front bar are super nice and really take their time to mix the drinks and use fresh ingredients. The drinks here are strong and delicious, which definitely worth the bucks!  Oh yeah, the bathroom has a mini female touch up lounge in it...reminds me of Vegas or something.   Two thumbs up for this place!", 
    "review_date": "2012-09-25"
  }, 
  "LIrrvzP1dEb5FUnmKtiL6A": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Marc M.", 
    "review_text": "This place is almost hidden from the street, but I'm glad I gave it a try.  The Bartenders are quick and friendly and there are lots of places to sit.  There is good music and a cool vibe, but not blasting to disrupt conversations.", 
    "review_date": "2012-12-16"
  }, 
  "VB2FbK8dq9Poz-ZPGXgmeg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "ED L.", 
    "review_text": "Carbon is another place I have been to a couple times.  It's a small lounge that's nicely decorated with lights around the sides, with a nice surrounding bar area, and decent hip hop and pop music.  It seems like a very elegant place to hang out with friends... with drinks (beer) at around $8.00 each which is pretty much market price in bars.   I really enjoy hanging out there, but for some reason I don't feel the energy.  Yes people came and left steadily, but the time we were there... it seemed a bit on the energy less side.  The music was good, but where did everybody go when the clock strikes 11:00 P.M?    Luckily we were amongst a few friends.  I never thought I could be heard just by speaking normally.  I usually need to raise my voice for another person to hear me. Thanks goodness we were with good company so we entertained ourselves.   I like this place, but I think the business needs to do some sort of exciting marketing to attract the people.  In Los Angeles, the bar/lounges are just as nice... if not better.  There are always crowds of people inside mingling with hip music pumping whether it's hip hop, pop, or even EDM.  I encourage the owners at Carbon to market and do something exciting every week to attract the right crowd.   It's just a thought... well, maybe we were there on an off night?  Good luck Carbon!", 
    "review_date": "2014-03-13"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Nobody likes a sloppy drunk.   The last time Mr. Jack Daniels and I met, I ended up on the floor of John Colins in tears and ranting, \"I think it's broken...I think it's broken.\"  Apparently, Mr. Jack Daniels took my breath away and I slipped on my way out of the bathroom. I sprained by ankle badly. Badly enough that my left foot swelled up and exploded out of my flats like Big Bertha's would...for over 3 months. SeXy.   The situation was embarrassing enough that I vowed to stay away from the partying scene and being a sloppy drunk for a long time. (Guys HATE sloppy drunk girls. Just ask them.)   Enter Carbon.   Formerly the dark and gloomy ghetto Suede, Carbon has been transformed to a stunning venue with two large bars, bright white and dark brown leather couches, bronze gold beams and art deco lighting fixtures. No longer a club but a sheek lounge; Carbon is the perfect low-key place to pop bottles and sip bubbly with your friends. No booty popping or dry humping on the dance floor; this ain't Temple or NV folks. Carbon is a place to drink and socialize the classy way.   On my first visit, I came for the beautiful Cat C.'s birthday and loved it enough to host my friend's birthday party later that month. I worked with Tina to organize bottle service. She was super sweet, professional and very easy to work with. She responded promptly to all my emails and was the perfect hostess that night while rocking those 5 inch stilettos. YOU GO GIRL! As I was setting up cupcakes and strawberries for the birthday girl, Tina brought me a glass of bubbly to take the edge off (I'm very anal) and kept on bringing the birthday girl yummy Basil Gimlets to get her \"happy\". It was her birthday after all so the plan was to get the birthday girl drunk (the classy way of course).   FAIL.  Birthday girl was fine and walked out on her own two feet.   As for me, I drank less than birthday girl and...  Me: \"Who's giving Lap Dance Linda (birthday girl) a lap dance first?\"  Jason (Mr. NSS' BFF): \"I'll be fourth.\"  Me: \"Ok Robert, you're first...\"  Mr. NSS: \"WTF, Robert IS Linda's brother!!!!\"  Me: \"Sooooo?!?!?...Yay, Robert...GOOOO!\"   *Everyone shakes their head*  OTHER NOTES: *No cover. *No dresscode but people dress up. *Very Asian crowd (the only downside) and everyone are in their late 20s - 40s. *Friendly staff and bartenders.  *Good for private events and parties.  *No DJ but there's a mixture of Top 40s and Untz, Untz, Untz background music. *Drinks are $9-$10. *Bottles start at $50 for bubbly and the typical Mr. Goose, Mr. Henny and Mr. Patron were $250/bottle plus 20% gratuity. *8-10 table service areas. *You can bring desserts if celebrating a special occasion and Carbon will provide the plates and utensils.  *2 stalls in the women's restroom.  *Next door to a sleazy XXX store. *wink wink* *Easy street parking.", 
    "review_date": "2012-10-19"
  }, 
  "eZNhFI6m07dvu1zfLfJc-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy N.", 
    "review_text": "What a beautiful lounge! Even though there is no dress code at this place... it makes you want to dress up to come here. This place gives a very upscale and classy vibe. Love the atmosphere and it is a great lounge to socialize, hang out, and meet new people.  Bottle service are priced at $250 for Grey Goose/Henessey/Jameson. Definitely worth it for group parties.  There's not much of a dance floor to dance on because this is not tailored to clubbing. But hey, you can dance if you want, wherever you want. ;) You do your thing!", 
    "review_date": "2012-11-30"
  }, 
  "JVL0eReGF-IPtiMypmuqSw": {
    "user_rating": 4.0, 
    "user_location": "Marin County, CA", 
    "user_name": "Stephanie T.", 
    "review_text": "Classy, modern lounge complete with abstract art and leather furniture. I like how there's a wide walkway to bottle service areas that eventually doubles as a dance floor. Great place if you're into a certain persuASIAN, like many places in SF tend to be. Nice place to sit back and catch-up with friends; not a place you'd go to meet people necessarily, unless you linger at the relatively open bar area.", 
    "review_date": "2013-12-16"
  }, 
  "iIQx9XCpNZHqPvhL4Cp1rA": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Goldie L.", 
    "review_text": "Remodeling of the old suede nightclub turned Carbon into an upscale lounge. Modern and classy indeed. Plenty of parking space near the venue. It is a mystery to me why this place is empty on a Saturday night. Lack of advertisement? If Carbon were to bring a following and charge consistent prices on their drinks, I would have rated it as 4 stars.", 
    "review_date": "2013-02-27"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "Not sure how much I want people to come. Its a good default lounge place, but I don't want to wait in line to come here...like ever.  Place is where Suede used to be, and I hadn't been to Suede for years. Bright side, they got rid of the stripper pole that was here. It looks nice, and is a great place to people-gawk. However...a nice place in general...that depends on your crowd and what you're looking for.   For the service, bartenders are great. They're pretty fast about the service, though you need to look like you want a drink. IE, LOOK AT THEM. They're not good at approaching you if you have your side toward them...or back. Really, just face them and appear as though you want alcohol. The owner (I assume?) was good at getting his hands dirty if need-be. I mentioned someone broke a shot glass and he was quick to clean it up himself.   Why do I give it a 3 instead of a 4 or higher? Well...not all the bartenders are trained as bartenders. We ordered a berry mojito and a rum/coke (I'm the easy rum/coke person), and the bartender we went to said we have to wait for the other guy for the mojito. I guess not everyone is fully trained? The other thing? Environment.  I read one of the reviews that talked about bitchy/drunk girls. Yeah, you get those. But seriously, just break them. They're all petite Asian girls that can't take their liquor. Its all talk, no action. These females are just itching to get...SOMETHING at night. If you're a guy who wants the best chance to score an Asian girl, Carbon is really your go-to lounge. They get drunk fast, and I swear half of them are wearing some sort of \"fuck me\" apparel. Beyond the heels, I constantly see girls wearing dresses too tight, gaping holes that aren't supposed to be there (weirdly, on tight dresses too), skirts where you REALLY SHOULD NOT SIT DOWN, shirts where the entire back was open (and honey, either don't wear a bra or wear one with no back on it), or one where it was so low-cut that if she had boobs it'd be indecent. I said it was an Asian go-to, right? Yeah...we don't tend to have a lot going on in the front.   Yes, I'll come back, mostly because of good drinks and the ability observe drunk slutty girls pretend they have some class. Once that's overplayed, it's peace-out Carbon.", 
    "review_date": "2013-01-04"
  }, 
  "Sg_BvnTHsbc1AABiJjaiPA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian H.", 
    "review_text": "The bartenders are really fab, and there's at least one super-cutie. No dress code but people tend to be kinda dressy anyway. C'mon, you're going out! It's a nice place to hang out with your friends, lots of space, comfy lounges to snuggle in. And even with just one stall in the huge bathroom, no lines! It is mindblowingly Asian though.. like 99%.. and that annoys me.", 
    "review_date": "2012-12-14"
  }, 
  "b_1jh8ZK2rd-FHYCpD6BzA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan B.", 
    "review_text": "This is my neighborhood bar/club scene. It's beautifully decorated and the staff are amazing! You won't find anywhere else this classy in North Beach.", 
    "review_date": "2014-11-19"
  }, 
  "CSfjaTVpxugpRNEd0RtsxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria M.", 
    "review_text": "Absolutely love this place.  I like places where I can sit, where its easy to get a drink, where it is easy to find parking and has a great ambiance.  Carbon is IT!!! This place looks very classy and upscale with a very relaxing and comfortable vibe.    It is a bit hard to find since there is no sign above the entrance door. But once you get there it is totally worth it.  Great modern, minimalist decor, nice lighting.  It does not get too crowded.  The ladies bathroom was clean and very spacious.  Drinks are reasonable. Service is great.  It does not get too loud. You can carry on a conversation wihtout having to scream. A great place to celebrate birthdays and other special events catering to big groups.  Would definitely come back here!", 
    "review_date": "2013-05-06"
  }, 
  "UNbRVJql-hopPSuvYmsDmQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Suki B.", 
    "review_text": "Wow, this place is SO CUTE!  I went here a few weeks back and I was pretty impressed.  The decor was very chic - a perfect lounge-y spot.    But wait, there was one downfall - how come there was no one else there besides us?  I was super disappointed that it was completely dead on a Friday night because if it wasn't, I swear I would be here every other week!  Nonetheless, I'm giving it 4 stars because I completely loved the decor and I'm hoping we were just there on a super, SUPER, S U P E R slow night.   I'll definitely go back again to check it out.  Perfect place to go with your girlfriends if you want to get all dolled up and go out, but don't feel like going to a club.", 
    "review_date": "2013-02-23"
  }, 
  "651O9OjViLIE8O5aUBxZ7Q": {
    "user_rating": 2.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jessalyn C.", 
    "review_text": "Eh. Place looks classy and open and all in the pictures, but I guess you reallllllly have to be in the lounge mood to enjoy this place. My buddies were throwing their bday bash here, and coming from out of town, I invited about 15 of my friends who I haven't seen in a while.  I read the reviews and warned my clique that it might be boring in case they wanted to make back up plans or head to another venue after stopping by. We decided that since there wasn't much closeby and we had a pretty good sized group, we'd just make the most of it. Oh yeah, it seemed like a lot of people had good experiences with bottle service, so I e-mailed the hosts about that and they didn't get back to me until a day or two before with the menu asking if anyone replied....  So we get there; bday boy is already pretty sloshed, so are some of my gfs, and one instantly complains about wanting to leave. So much for trying to make the most of it! The back area had a ton of food laid out, and we pretty much just kicked it by the back bar the entire night. Maria H was right about the music being background noise, which made my gfs not want to give me my bday lapdances haha. :( womp womp.  In the end, a club or more energetic venue probably would've been too much for us since we just did a day trip to Lake Tahoe, but we would definitely not enjoy coming back. Glad we didn't pull the trigger on bottle service, too.", 
    "review_date": "2012-12-25"
  }, 
  "yuhu7mu_VZeCOvKLRT-G0g": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Chi N.", 
    "review_text": "Carbon is still my favorite place in the City to close out my night, whether I am attending a benefit at Manor West or having drinks at Rumors. I suppose a lot of it has to do with the fact that my favorite bartender is IAN. When we first met, he was dressed as Elvis and the man certainly rocks at shaking those drinks up! I tell him what kind of vegetable or fruit I am in the mood for and he magically whips up some alcoholic garden concoction that just puts me in a good mood. My favorite so far has been his Cucumber Martini and Strawberry Shots. Just remember ladies - don't get sloppy drunk because no matter how hot you may be, that's just not attractive to anyone.", 
    "review_date": "2012-11-20"
  }, 
  "ZuCP8O71LHKl6tlXkS7Ziw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine C.", 
    "review_text": "im just at that age where im very very lazy to go out now unless its for a special event.  i still love getting dolled up once in awhile but cannot standdd the long lines and overly packed clubs. ive heard that suede had been remodeled and is now carbon and came last weekend for a bon voyage party.  there is no cover! the venue is very modern and upscale. there's not really a dance floor (which is fine by me since my friends and i always just hang out at the bar anyways) but there is music playing in the background, not too loud so you can still conversate, and there plenty of sitting space.  i had a great time here :) carbon is officially my new favorite lounge in SF!", 
    "review_date": "2013-01-03"
  }
}