{
  "hc4FcL3cdt0I_IvrDMhp2A": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jaimie M.", 
    "review_text": "This place is really cute but not secret/hard-to-find at all as a lot of things I've read suggest.  So that's a good thing!    We went around maybe 7 pm on Friday and every seat in the place was filled so we went down the street to Grant and Green for some cheap PBR (I guess that's pretty much a redundant phrase but I'm going to leave it.)    Around 8:30/9 pm we got the urge to take off but swung by Church Key to see if any seats had opened up.  And indeed they had!  The entire upstairs loft was empty, so we grabbed a perch up there.  The atmosphere was very cool, laid-back and kind of a luxe-vintage thing going on.  They had a really nice diverse beer selection and I saw a bunch of people drinking the Sofia Coppola champagne-minis which are awesome.    Everyone seemed friendly and there was even a huge pug dog eating french fries at the banquette in front as we left.  The fries looked good so we asked his owner where they were from.  They were from Mo's down the street so that was our next stop of the evening...", 
    "review_date": "2009-01-12"
  }, 
  "wVv8-yw8wlzDyYJMDEXFVw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elise G.", 
    "review_text": "Great vibe at this bar with good beer and friendly service. There was a live DJ spinning on Wednesday night which was pretty cool. I loved how low key this place was without feeling like a dive. It was recommended by a bartender at La Trappe, so if you like that bar, this will definitely be your scene too.", 
    "review_date": "2013-10-25"
  }, 
  "5Z-3tcM07Pyc4mOF2Rjt6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "What makes a good bar?  Is it the mixologist churning out innovative and potent cocktails?  Is it the carefully selected lineup of beers on tap covering the whole spectrum of the public's hop palate?  Is it the crowd that fills the booths and bar stools?  Or is it the architecture of the bar itself?  I don't know if the bartender was a good mixer and I wasn't pleased with their beers on tap.  The crowd was a good mix of urban intellectuals (I went on a night where there was trivia), but in the end I fell a little in love with the ambiance created by my non-sentient surroundings.  Love the red couch along the back wall.  Love the few small tables and high tops, which left the space feeling intimate.  Love that there is an upstairs.  And the lighting was perfect for good conversation of any and all sorts.  So what makes for a good bar?  A good bar is a space where you want to drink and converse and you feel more of yourself than you did before.  Bars like this make me feel more sophisticated, but casually so.  The Church Key to my heart!", 
    "review_date": "2011-03-09"
  }, 
  "QRHS2i4DWS6R0fpkCalvaQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Margaux N.", 
    "review_text": "This place is tiny but darling inside. Sit at the bar for an idle drink with a friend and the bartender is sure to provide some good banter and/or recommendations from the impressive drink list, which includes some pretty obscure and delicious beer from around the world. If you have a group or want a dark corner there's a loft upstairs as well.", 
    "review_date": "2009-09-24"
  }, 
  "3yiIhApUdcsNHnMx76_GVg": {
    "user_rating": 4.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Stephanie B.", 
    "review_text": "Really liked this place and definitely want to go back.  They've got a great beer selection and the bartender of the night was really knowledgeable. Good music too!", 
    "review_date": "2011-11-19"
  }, 
  "IXAYirFUR2Gs0zNkJi0rXA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Katherine N.", 
    "review_text": "Loved the ambiance early in the evening meeting Jason. They have a thing going on there that is soft and lively. Good vibe, nice ambiance and Katherine is a nice girlfriend to the Biz. She and He are a hot couple . Try it out .", 
    "review_date": "2009-02-01"
  }, 
  "4Po_4vgdBFk2GPeKfJqVww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan L.", 
    "review_text": "I hate to admit it, but yes, I do judge a first date on the bar he chooses to take me to.  So, when this fella asked me to meet him at Church Key, I knew things were looking up.  With what feels like 100 IPA's on the menu, i felt giddy with all the possibilities that could be tasted and swallowed that night (get your mind out of the gutter, sicko!)  I have to admit, I must have clearly looked a bit overwhelmed, so the bartender came up and suggested one that I might like and he was right...hoppy goodness!  Small space that gets kinda crowded...but the people are chill and the bartender adorable and helpful.    Some of the brews are STRONG and I felt kinda F'd up after only 2 glasses.  (Yeah, my date was no fool...he knew exactly what he was doing when picking this place!)  Looking forward to coming back and tackling some more of those IPA's!", 
    "review_date": "2010-07-27"
  }, 
  "3waAQbBf5b3R4LKLXeSDdw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Kate G.", 
    "review_text": "My girlfriend and I stopped in this bar last night by chance for \"a drink.\" The beer was amazing. The bartender and a few other folks at the bar were really funny, nice people. Good music, good jokes, good times. This place is a hidden gem in North Beach- a bit pricey when you compare it to other awesome beer spots such as the Fireside in Alameda or the Tornado on Height but about the same price as the Monk's Kettle and the atmosphere here is nice and chill so worth paying a few extra bucks. They also have some interesting beers on tap so our \"one drink\" turned into a couple. Next time I'm in the neighborhood I will stop on in for another tasty beer adventure...though with so many amazing beers to chose from... and with the affable bartender...and chill relaxed vibe... it can be a bit dangerous if you have to be somewhere the next day-be warned that you may end up \"tasting\" more delicious beers than you bargained for.", 
    "review_date": "2009-06-18"
  }, 
  "cMoQqT_j_FD1gO6EEZzOIg": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mitch E.", 
    "review_text": "Hey lets go to the loungey type place that serves only beer, said no one ever.  A unique mix. A lounge that serves only beer. I'm not complaining, I had a good time and a couple of rounds.  Large beer selection, which will cater to your needs and desires. Not those deep, dark desires. Don't tell the bartender about those. Just the beer you desire, and they should have something you like.   The upstairs is cool, with some plush seating, nice artwork and good decor.   They did close early on a Thursday and this is where I discovered that when a place does last call in SF, it's usually half an hour before they're suppose to close down. It's like being in college all over again.  Something different and worth checking out.", 
    "review_date": "2014-02-24"
  }, 
  "u7yxMVwLli7Aj8dZwQnOGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "This place was great. They had an excellent beer selection and described them similar to wines with the ingredients and tastes. For those of you that don't prefer to branch out, they even have an American beer that rotates - it could be Pabst, could be Bud Lite.", 
    "review_date": "2009-03-06"
  }, 
  "TppZ9nrqpH3Y9NHmP_8Bbg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "David M.", 
    "review_text": "I like north beach... this is on my fav list for the area but it's def nothing special.  The atmosphere is nice... cool lil' venue; it never gets too crowded, but they only serve beer and wine.  I don't know if it's a regular occurrence but a couple of their beers on tap were tapped out one recent evening.  If they started serving the hard stuff and didn't have issues with running out of beer I'd definitely bump my rating up to four stars.    Feel free to ask the bartenders about their unique beer selection.  They are usually more than happy to share.", 
    "review_date": "2010-05-11"
  }, 
  "bpgbVPJcG-wQ4cNBcPPIxw": {
    "user_rating": 5.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Monica O.", 
    "review_text": "I was in the city livin it up because it was my birthday, so we were bar hopping from one end to the other, and we stopped in at the Church Key, walked in and saw there was a group with name tags, ah I do like the parties that involve you wearing name tags, but they were a private party that had just ended.  Also upstairs in the Church Key was Open Mic night, but honestly even though I was sitting at the bar downstairs I rarely heard a joke being told, either great sound system downstairs or nothing laugh worthy was being told haha, sorry.  (not sorry)  Bar tender for the night was Thomas, and he is a pretty cool dude, told him that I'm fairly new in the beer world so I got to try a few samples of what they had on tap, after finding a few that I liked I went ahead and ordered a glass, can you believe the 1st one was on the house because it was my bday! WOOT WOOT!  Lots of fun was had here everyone who came in was friendly and fun, even met a man who worked for Google, but didn't liked to be called a googlier haha.  Music was playing the in the background, for the life of me I couldn't tell you who, but then a song came on and I was like hold up isn't that George Michael and of course everyone said NO WAY this is Queen, and then I was like nope thats George, being a George Michael fan from back in the Wham days, I know the man's voice, and Thomas checked the IPod and said well shit it's both. It was funny fun night.   Had a great time down at the Church Key, if you are in the area go give it a try!", 
    "review_date": "2014-08-12"
  }, 
  "ksLEtpBAdVGaEramRXYYSQ": {
    "user_rating": 4.0, 
    "user_location": "Haight-Ashbury, San Francisco, CA", 
    "user_name": "Shanna T.", 
    "review_text": "This place is a great option if you want to grab a drink with a friend or two. The downstairs is small so I wouldn't suggest taking a large group but the service was good, the music was pretty descent and we were able to grab seats right at the bar. Most importantly they have a serious beer selection and the bar tender was able to provide some solid recommendations based on what our preferences were. I would go back here for a drink any day.", 
    "review_date": "2011-12-23"
  }, 
  "Vcadamdv04NuyAiRIWSkOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terence P.", 
    "review_text": "First off let me start by saying \"I LOVE BEER!\"...  Now that i got that off my chest, lets continue.  This is a cool spot.  To me, it seems like one of those high class places for intellectuals but welcomes everyone and is not snobby at all about it.  There was so much beer here that i didnt know what to do.  I seriously must have looked like a deer caught in the headlights when i looked over the menu.  But the bartender was really friendly and asked what do i like and offered me some recommendations.  They really do know their stuff here.  Down to the very last bit of what hints of different flavors are there with subtleties and what not.  And im talking about beer, not wine.  So thats a plus.  When someone can tell me a lot about it, it shows that they are passionate about it.  I weill come back, and i will ask for more recommendations.", 
    "review_date": "2009-06-11"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "Intimate. Understated. A welcome sanctuary from the North Beach madness for beer lovers in the neighborhood.  I really love Church Key. For a bar that is tucked in this narrow nook, it is chocked full of yummy brews from obscure domestic micro-brews to evergreen Belgian favorites. Unlike other bars along Grant St., this isn't a \"chug a beer\" bar. Instead, come and take your time, catch up with a friend, and savor your beer. It is a wonderfully cozy space that is never too loud so you can have great conversations here. I particularly like the space \"upstairs\" although sitting at the bar (if you can snag a seat) is the way to go if you want to engage with the bartenders who are always more than willing to offer you suggestions of new brews to try.   No neon signboard here but instead look out for an illuminated key as your beacon for a night of beer discovery at Church Key. I'm glad I did.", 
    "review_date": "2012-09-24"
  }, 
  "LOKBrpZFR_rWiEkuULrLgQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick D.", 
    "review_text": "This place is decent.  Pretty nice ambiance and a fairly good beer selection, albeit extremely predictable.  They've got some Allagash (White/Curieux), Dogfish Head (90 Min/Midas Touch/Palo Santo Marron), Delirium Tremens, some De Ranke, Nogne, Duchesse de Bourgog....(yawn).....zzzzzzzzzzzzzzzzzzzzzzzzzzzz­zzzzzzzzzzz.  Ok, maybe I've become too much of a beer snob for my own good.  But really, nearby La Trappe dominates this place, and that's not even considering La Trappe's awesome moules frites.  Church Key prices are also pretty high, although not unexpected for a high-end North Beach beer bar.  One interesting feature on the menu is the $2 \"mystery beer.\"   ***SPOILER ALERT!*** It's something crappy, almost definitely some variety of bland American macro adjunct lager.  (As I always say, \"Adjunct?  More like adJUNK!\")  If you're lucky, it'll be PBR.  If you're unlucky, well, let's just say I hope you have lots of Advil and easy toilet access the next day.  Still though, it's another place to get a good beer in the city, and with 90% of the beer consumed in this country still being that awful Bud/Miller/Coors crap, we sure as hell need it.", 
    "review_date": "2009-06-24"
  }, 
  "ex1ypGlvo2OiNhSDzWSDGQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Megan K.", 
    "review_text": "This is a classy and cozy place -- the perfect mellow alternative to Grant &amp; Green or Mojito.  We went for an \"anti-Superbowl party,\" (advertised on Yelp) for which Danielle, the bartender, made incredible bean dip and brought in delicious salsa and chips.  She is extremely knowledgeable about the ever-changing beer list and gave us a few suggestions (Three Philosphers and Allagash -- loved the latter, so-so on the former).  This place is packed on Friday and Saturday nights--it's definitely a place to check out when you make the rounds in North Beach!", 
    "review_date": "2009-02-01"
  }, 
  "ssuWkMne1wQ6_WmxmXhl5Q": {
    "user_rating": 4.0, 
    "user_location": "JACKSON HEIGHTS, NY", 
    "user_name": "Brian K.", 
    "review_text": "Awesome hole in the wall bar up on Grant Ave.  If you aren't paying attention you will most likely walk right by.    Arrived right after it opened on a Tuesday afternoon.  I was the only one here for a bit and enjoyed shooting the shit with the bartender.  She definitely knew her beer.  Though the stated policy is that \"samples will cost you,\" I was afforded one and subsequently enjoyed a goblet.  I went with the Heirloom Pumpkin Barleywine.  Definitely enjoyed.  This is my kind of place.  The bar area is not terribly bright and decorated eclectically but with a purpose.  Ween's Quebec album was playing in the background and just set the mood for a really peaceful drink.    It seems like some pretty hard to find stuff comes through on a pretty regular basis.   I will be back.", 
    "review_date": "2013-09-04"
  }, 
  "kMBb6jZm2U0fcksceorcSw": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "mary b.", 
    "review_text": "I wish I could transport this place to Sacramento. Very low key and chill. The space is tiny and intimate and I wouldn't recommend bringing a big group of people...it isn't that type of place. The beer menu is huge and seems intimidating at first, but it's broken down by variety. Just close your eyes and pick a random page. I can say the hibiscus beer and the coconut porter were delicious! Props to the owner...there was a douchebag, drunk and obviously trying to network him, sitting next to the bf and I. The owner kept drinking his PBR, not having it, without being a shit to him. When my guy from Indiana, slightly awed, asked him some questions about the bar, the owner was the nicest guy. We went back twice in one week. It would def. be my first choice for a beer.", 
    "review_date": "2011-09-15"
  }, 
  "9vT5aq2pVYb4gpnY-9Bpzw": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Tyler A.", 
    "review_text": "friendly people, great beer selection, small knit group, cheap prices  need I say more,  Definitely a spot for a beer enthusiast to visit while living or vacationing in san fran.", 
    "review_date": "2013-04-29"
  }, 
  "dy4OvKg-9GBhgGaZFaKqTQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris D.", 
    "review_text": "Great beers on tap, and also in bottles. weird space to sit down stairs there aren't many places to do so ,we took a walk upstairs and there was a party going on but we kinda fit in and had a blast with them drinking beer so if you like beer and you're in north beach this is your spot. A younger crowd generally... But probably the best bet if you find yourself in North Beach...", 
    "review_date": "2009-02-22"
  }, 
  "tyOr6NpS35q7fnPjHNQ9KQ": {
    "user_rating": 4.0, 
    "user_location": "Hell, MI", 
    "user_name": "Jacob X.", 
    "review_text": "We had a great time Monday afternoon. No one there, we had the booth to  ourselves and the beer was flowing. First time there but not the last time!", 
    "review_date": "2010-03-16"
  }, 
  "gi0khkeuBNFZiERf6OQJ3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer E.", 
    "review_text": "Best beer selection.  Friendly bartenders, and the COOLEST FUCKING WALLPAPER EVER.  Yeah, that's right, I said it.", 
    "review_date": "2010-02-24"
  }, 
  "mXPpMRWMYXCZUqDPD4Fycw": {
    "user_rating": 4.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Joe U.", 
    "review_text": "Great place to go after work to try a bunch of different beers.  Thrillist turned me on to this hidden spot, and it didn't disappoint.     Insane selection and yet a little too insane at times.  Some of the beers were a bit expensive, they have moderately priced ones too.  Not sure how well they will do with the really expensive beers since this area tends to attract the party type that sticks to the basics to get loose.   The inside is small.  Coming here on a bar hop over the weekend isn't ideal; there's just not that much room to move around.    Props to them for being different and opening up a unique spot for beer lovers.  Not since living in London have I found such a spot that caries as many beers.", 
    "review_date": "2009-02-09"
  }, 
  "CZU1RZavKV2fHhTvRRWdew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen C.", 
    "review_text": "awesome selection of beers, limited seating, but friendly and knowledgeable staff - great for beer lovers !  relaxed and unpretentious environment - go check it out!~", 
    "review_date": "2009-07-26"
  }, 
  "oPW-LM0pXja0lDwZybXd9g": {
    "user_rating": 3.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Dmytro A.", 
    "review_text": "\"Exactly what sort of theme or aesthetic are they going for here? Neo-gothic Nigerian?\" - my out-of-town friend  This is not a casual pint-ing locale.  The decor is ghastly, it's a really tight space, and all the beers have *very* strong flavours.  Also, most of their beers are bottled or canned, not on tap.  Still, it manages to be enjoyable if you go with the right one or two friends, and is probably a good place to \"test\" a date who claims to be a beer enthusiast.  Points given for its being-hard-to-find-itude.  The sign for this place is just a golden, um, church key, so between that and the fact that this place is so small you'll need to keep your eyes peeled to find it.  More points for actually stocking the beers on its menu, which is more than I can say for other mega-menu beer houses around the country (e.g., Brickskeller and RFD in Washington, D.C.)  Finally, I like that the music you'll hear likely is coming from the iPod of the guy serving your beer.  That always seems to work out pretty nicely.  If you enjoy beer, you'll likely find one here that you like (just don't count on help from the guy behind the bar to find it).", 
    "review_date": "2010-10-19"
  }, 
  "dZclswnuCC3xomr8-Wk3Zw": {
    "user_rating": 5.0, 
    "user_location": "Rockaway Beach, OR", 
    "user_name": "George D.", 
    "review_text": "First off, the bartender (long haired blonde guy) is a beer NINJA. He opens bottles with such precision and keeps his bar so clean, it is amazing. Second, he knows anything and everything you need to know about his selection. He even gave my gf and me a sample, along with himself, of some japanese commemorative ale. If you LOVE beer, you GO HERE!  I forgot to add....if you \"check-in\" on foursquare, you get 50% off your first beer. Don't be afraid to ask \"the beer ninja,\" he was totally cool with looking at my phone and saying \"you checked-in...that's you, right?? It's that easy.\"", 
    "review_date": "2010-08-23"
  }, 
  "c4bNOJ5XnKKoHJoQE4zrcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber M.", 
    "review_text": "Great local dive with fabulous beers! Always ask the bartender their recommendation if you are not sure, she knows her stuff!", 
    "review_date": "2013-12-19"
  }, 
  "NDH7N_TqW7uZPqLBuGTWqA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anita D.", 
    "review_text": "low key and cozy.  Good place to enjoy drinks but not get smashed.", 
    "review_date": "2012-03-28"
  }, 
  "0i0r2t1qDdUdxBBRZTzXRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie S.", 
    "review_text": "This venue gets five stars from someone who doesn't fancy too many types of beer. The bar tender is very knowledgeable and recommended Dogfish Head Midas Touch Elixir. This is officially my new FAVORITE Beer!!! Thanks!", 
    "review_date": "2010-08-17"
  }, 
  "tvuGWTCPKe4fu5NOMTxGlQ": {
    "user_rating": 5.0, 
    "user_location": "Poughkeepsie, NY", 
    "user_name": "Jack S.", 
    "review_text": "Awesome place. Great beer. Cool folks.  We went on an off night, just to check it out and ended up staying for a few beers. The small crowd at the bar was really friendly and the bar staff was knowledgeable and welcoming.", 
    "review_date": "2011-06-22"
  }, 
  "wUHRkLuCyEYz4AXURA2RbQ": {
    "user_rating": 4.0, 
    "user_location": "Lutz, FL", 
    "user_name": "A K.", 
    "review_text": "We were looking for a great lounge to sit and drink some beer while it rained. We saw this on Yelp and decided to stop by. It was our group and one other couple (it was 4pm so it was a little early) and we sat at the bar and read through the extensive beer and wine list. The guys in the group were impressed with the selection of beers available and loved their choices. I ordered a Baltic Porter that was delicious. The bartender seemed knowledgeable but was very laid-back and hipster. It was a great, quiet place to stop in a get a beer.", 
    "review_date": "2011-06-05"
  }, 
  "r9h5k6keLFuFzhzWgn8x5w": {
    "user_rating": 2.0, 
    "user_location": "Charlottesville, VA", 
    "user_name": "Nick L.", 
    "review_text": "As a beer lover, I was excited to try Church Key but I found their beer selection only OK, prices to be pretty aggressive, and the space has an odd layout which lacks ventilation.   There are better beer bars in town. For instance, La Trappe is nearby on Greenwich St and has better beer, food, and cooler space. So I'm not sure why you'd choose Church Key.", 
    "review_date": "2009-06-22"
  }, 
  "mSxHHZ9XifErXXFHvVaFew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deva H.", 
    "review_text": "Great beers. Great bar. Great bartenders (and staff in general).    Great belgian style quadrupel? check (netherlands something) Great porter? check (something from denmark) Great IPA? check (dogfish head 90 minute IPA) Great belgian? check (hommel) Great light flavor? check (affligem) Great beer? check (De Proef Reserve Signature Ale Collaboration with Port Brewing)  I picked a couple myself, then just asked the bartender and server for recommendations based on styles I was in the mood for.  They hit a home run every time.  100% A+ positive.  Also, they have 4505 chicharrones.  Mmmmmmmmmmmmmmmmmm.", 
    "review_date": "2009-06-13"
  }, 
  "kogGss_XELN7P0ivFk721g": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jessica H.", 
    "review_text": "This is where my b/f and I decided to ring in our New Year!  We both wanted to be in the city but at somewhere totally mellow.  Church Key was the perfect spot for that.  This place is for the beer lover (although they have some lighter and fruitier beers that will make non-beer drinkers happy).  The pricing was really reasonable and the bartender was a really awesome guy.  It's super small and two floors but a really rich red color and hidden enough that you may miss it.  So happy that we went here and started this year off right!", 
    "review_date": "2010-01-11"
  }, 
  "W82cYXhC2_Rm1IFpGGW8Pg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea D.", 
    "review_text": "We stopped by this place during the soft opening months ago, and I've been meaning to write a review....  Amazing beer list. A little pricey, but you don't come to get drunk, you come to try new and tasty beers. The bartenders are knowledgeable and super friendly and if you have questions or don't know what to order they are wonderful.  If you have a few extra bucks the beer champagne is like butter. You can split a bottle between 4 people. Try it!!", 
    "review_date": "2009-06-03"
  }, 
  "B4cJvWuf59j7XlTdexnVZw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marc S.", 
    "review_text": "Cool place with a nice beer selection and good spot for getting away from some of the madness that other places in the area turn into since it's a bit lesser known.  Nice upstairs.  Clean bathroom, though no paper towels when I was in there last.", 
    "review_date": "2012-12-15"
  }, 
  "newGLjBSOkoj-SEj4CZ6qw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "Holy sugar smacks, this place is awesome! My fiance brought me here on a date and I had this deeeeeelicious beer called the Duchess de Bourgeone. It tastes like...well, I can't entirely describe it, but, it's tasty as all get out! My man had this coconut flavored ale, which I stole a sip of and that one was amazing too. The mood everytime i go in is way relaxed and the locals are friendly. Plus the beers are all reasonably priced.  If you want to try some great beers at great prices, give this place the old college try. They have a trivia night going now on Tuesdays which seems like an awesome time to give the place a go. (I also hear that the trivia mistress is easy on the eyes.)", 
    "review_date": "2009-11-03"
  }, 
  "Dk5EPbo1T7F6YA-S2_ZOiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jessica b.", 
    "review_text": "I am not a huge drinker, but if I were an alcoholic, this would be my bar of choice. I've been multiple times and every time we end up in epic battles of who can order the most ridiculous beer.  They have 7 pages of beer.  7 PAGES. That is crazy.    its hidden farther down on Grant, so, its usually not too crowded.  You're pretty much guaranteed to find a spot upstairs to have a quiet moment admiring the art on your beer bottle or wondering why they have 1 small mirror on the ceiling.  Once you've had one too many, you can mosey down to golden boy or any of the other late night joints in the hood to soak it all up.", 
    "review_date": "2010-08-09"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "\"Hey!  It's 11:45pm.  You all need to get out in 15 minutes!\"  Umm, I do?  Why?  Oh, you close at midnight.  Hmm. Ok.  Buzz kill.", 
    "review_date": "2012-06-25"
  }, 
  "DICLJDdq0HpvOVYR5mB4gA": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Eric F.", 
    "review_text": "Great laid-back spot for a couple beers with friends.  Their biggest strength is the extensive selection of Belgian ales and other European brews as the interior is nothing to write home about.", 
    "review_date": "2010-01-27"
  }, 
  "sEUgANQTEUKFjlhEZiOcLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Niket D.", 
    "review_text": "Finding a bar with character is actually tougher than it sounds. Don't be fooled by the rest of the bars you've been to. It takes something real special.  Church Key only sells beer, and for good reason. It's a damn cool bar where you can find all sorts of beers you've never heard of and people smart enough to get you something you'll like.   The first time I went there (I'm a regular now) I was intimidated by the number of beers they have available, and they have some cheap stuff if you just want a 2 dollar beer too. The staff are ALWAYS super down to earth, mellow and can talk beer like it was their first born child.   They have a nifty second floor and if you have a big group you can go up there. I like the decor, it's slightly darker with an unassuming appearance.   I highly recommend checking it out and I'm fairly certain you'll be a convert. Cheers and I'll catch you in my favorite bar in the city.", 
    "review_date": "2010-07-14"
  }, 
  "6cRPIeOU1HJK19C7Cpx68Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colton L.", 
    "review_text": "This is a hidden gem in North Beach. Good luck even finding it because it is nicely tucked away between stores on Grant Street. When you do find it, however, you'll find a great little dive with plenty of beers to choose from. The taps are constantly rotating, so you can always have something new to enjoy.", 
    "review_date": "2014-06-13"
  }, 
  "HEPfqAH6ObF36Fp1B9Fi1Q": {
    "user_rating": 4.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Sally M.", 
    "review_text": "Awesome joint if you love beer, which unfortunately (since it's so bad from a slimming-down perspective), I do. The menu is overwhelming, and reminded me a bit of the menu at \"Falling Rock Tap House\" in Denver, or maybe \"The Brickskeller\" in Washington D.C., but the ambiance is unique and cool as well.   It's a small, intimate bar, with an awesome bar tender and cool tunes. I say awesome bar tender, because I was on vocal rest and he gave me a book of old, recycled beer menus for my new notepad. Stellar!  As for the beer, I tried the \"Aventinus\" at the suggestion of my pal Aaron, and loved it. Highly recommend it, and I'll definitely be returning in the near future.", 
    "review_date": "2009-05-30"
  }, 
  "HQvlXqSeRF3nhAnZw2IL8g": {
    "user_rating": 5.0, 
    "user_location": "Inner Sunset, San Francisco, CA", 
    "user_name": "Anthony B.", 
    "review_text": "One of the best beer bars in all of SF. Just plain awsome. Huge beer list.", 
    "review_date": "2010-03-20"
  }, 
  "v3Fm96Fm6oe0YpoHPUPZ-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Billy Ray V.", 
    "review_text": "This place is for beer connoissuers. It's a very specific niche that they are going for, and it works incredibly well. Go to this bar if you want one thing, and one thing only: a really unusual beer that you can't get anywhere else.  If you are the kind of person that likes to talk about the subtleties of a beer for ten minutes, then this is your heaven. I must say that I am not that kind of person, but after drinking two of the beers, which had 9% alcohol content, I was happily drunk and ready to spend the rest of my life here.  This place is great. Beer lovers, the Church Key should be at the top of your list.", 
    "review_date": "2009-01-29"
  }, 
  "hrWnftKtSg5kOlMkMUW0cQ": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Christine L.", 
    "review_text": "I came to Church Key on a Thursday night for some beers.  They play some freaky ass weird music here, but I still dig it.  Great selection of beers that the hipster bartender that is way, way too cool for you will sort of help you navigate through.  They've got seats around the bar and a couple of tables and a couch with a table on top of kegs in the front.  Very small intimate place, it's funky and very San Francisco.  I dig it and would come back again.     FYI the beers are highly alcoholic.  I wish someone carried me to the next bar, but alas, I had to walk.", 
    "review_date": "2013-09-17"
  }, 
  "Lr-B-r-KF80yFy-2u336bw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Eugene L.", 
    "review_text": "It was a warm night in North Beach tonight . There were a lot of beautiful people roaming North Beach. Church Key was one of our stops. They have a good selection of beers on Tap . My companion and I had a few . I was digging on the DJ he was spinning old school 45s and dance music . The place was a packed house .There were a lot of attractive women there. The only marking outside was a Key on a sign.", 
    "review_date": "2010-09-02"
  }, 
  "4pzr6KuS85859EICMI7MDw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea P.", 
    "review_text": "Jason, you have outdone yourself again!  While it's still in its opening and final remodeling phases, the Church Key brings to an all-around wacky and wild neighborhood is a solid delivery of pints with a punch. I'm talking about beer, folks, and lots of it.  You can find brews from all around the world, eight on tap, and scores upon scores by the bottle. There's wine, too, but I want to conquer CK's beer menu before I embark upon the fantastic ports. Note, beer and wine ONLY. But really, with such a great selection, why would you want anything else?  Jason is so friendly and knows his stuff, too. Totally a different vibe from the Broken Record. I already love it just as much.  Formerly an aspiring trendy soju lounge, I think this is a major upgrade. It's now the ultimate CHILL and intimate place to go for a nice brew with friends or a special someone. Oh yeah, oatmeal stout head 'staches are HOT.", 
    "review_date": "2008-12-17"
  }, 
  "2nBPGg56am7XoOdGR4tofg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Caroline T.", 
    "review_text": "I really like this place. It's perfect for when you're in the mood to drink a couple of beers and unwind with friends, but aren't really up to Going Out and stumbling your way back home in the wee hours of the morning (a different yelp review for another time). I usually come here when I want to grab a drink or two with a friend or a small group of people, but wouldn't really recommend going here if you're with a large group because it isn't huge and seating is somewhat limited. The beer list is LONG, so if you plan to come here with someone who \"doesn't like beer\" there is probably something on the menu even for these foolish people. The bartenders also let you sample the beers on draft, which helps you avoid the disappointment that comes with spending $9 on a beer you thought you would like but actually makes you want to gag. Ok, I haven't actually had a beer that makes me feel like that, but I could imagine. The bartenders I've encountered here have been pretty knowledgeable and helpful, so I've only gotten good suggestions so far. I just came here again this past weekend when a friend was in town, and he was both impressed by the local feel of the place and happy to see an obscure beer he loves on the menu (which made me look cool). It is definitely worth trying sometime!", 
    "review_date": "2011-11-14"
  }, 
  "opSbHEfHYfCZvfff7vKvYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Camille B.", 
    "review_text": "My friends and I started our night out in North Beach at Church Key. We arrived around 930/945pm and the bar was pretty busy. There was 1 bartender at the time, so we waited a couple minutes to be served, which was fine, since they had a long menu of beers to choose from. The menu was printed on about 4 8 1/2 x 11 paper stapled together..nice and simple, but the text was kind of small, so it was a little hard to read under the dark lighting. Once we had our beers, we sat upstairs where there was ample seating to enjoy the drinks and talk it up a bit. Church Key was probably the only bar we went to where we could have a decent conversation without having to yell at each other. Of note..this place does not have a full bar..beers only, but I can dig it.", 
    "review_date": "2014-11-30"
  }, 
  "LdeYSL_KsoilCqj7HJsWDQ": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Albion R.", 
    "review_text": "my companion arrived about 10 minutes before I did. all the chairs along the bar were full so she sat at the closest table.  when I arrived, the bar stools had cleared out and we took two.  the menu is quite impressive.  but...... at $7 to $9 a glass, I would really like a bartender to have some input - other than to say that they are good. how about offering samples?  and my friend was a bit put off that he hadn't acknowledged her before I got there.  the music was horrible.  we moved on.", 
    "review_date": "2011-10-20"
  }, 
  "b_UoSaXEdNQIYnx1K9eqaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gerardo C.", 
    "review_text": "Let's start by saying I know nothing of beer haha I only know I like drinking it, and this is a great place for the drinking of beer.  1. It has A LOT of options, that come in all different sizes ;) 2. It has a second floor with a nice sofa space, and there is usually space for a big group. 3. It is super close to many different food places (lots of pizza!)  That's about it, have nothing else to add.  Check it out, it's great!", 
    "review_date": "2012-06-14"
  }, 
  "hzJpuehCf7OR_UwEB9O5xw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica W.", 
    "review_text": "Great beer selection!  And the staff is very nice and helpful as well.  It's a small place but they do have an upstairs lounge area.  Probably wouldn't bring a big group there but for a date or just a few friends, it's the spot to go.", 
    "review_date": "2009-10-05"
  }, 
  "LEho8AFSA-H6M9SekKxb_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maggie L.", 
    "review_text": "Definitely a tad different from the normal bars in North Beach, where you can walk in with shorts and flip flops.   Church Key is a little on the fancier side. Nice plush couches and cute little bar stools for people to hang out and chat. Dim lighting and no smelly BO that you might find in the bar across the street (ahem... Green and Grant!).   This place is all about beer! No cocktails, and their wine selection consisted of 4 different things.... a Merlot, a Pinot Noir, a Chardonnay, and a Pinot Grigio. The beer selection, on the other hand, consisted of a booklet. The waitress we had was extremely helpful too. Very knowledgeable. Picked a great beer called Pranqster that tasted like a Blue Moon.   Cute little bar. I like it!", 
    "review_date": "2009-06-30"
  }, 
  "5_kcuB0zrG3guGlBOcW-JA": {
    "user_rating": 4.0, 
    "user_location": "Placerville, CA", 
    "user_name": "Ron G.", 
    "review_text": "Great little North Beach bar with a solid beer selection. Lots of bottles, all quality. Good stuff on tap too if you're a brew geek. The night I was there they were running out of quite a few things but its a very enjoyable spot!", 
    "review_date": "2012-03-07"
  }, 
  "9XamBJ9gDGlpK3-0djd0UA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lise M.", 
    "review_text": "Great atmosphere, great location, great libations, and friendly bartender. I'm gearing up to be a regular.", 
    "review_date": "2010-02-08"
  }, 
  "cCPjASKs5YpMB4BmN2oSZg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike H.", 
    "review_text": "Very good beer selection and good service but the death metal was playing very loudly. Also, the bar was empty when my gf and I first entered, because the bartender was smoking on the sidewalk with his friends.   Keep in mind, this was a Friday night, not an off night. The small crowd, even for a small space, was surprising.", 
    "review_date": "2013-05-07"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "I understand the need for friends of the establishment in question to give rave reviews, but I'm just gonna be honest. Definitely a quality beer menu with some nice items on tap. The whitbier I tried was good and refreshing. The seating still remains a problem though, not enough downstairs. Upstairs has a lot more space, but it just felt like a weird lounge and not so much a bar where you'd go drink good beer. I have a feeling the guy to girl ratio will be extremely high, as the girls I came in with didn't seem too impressed. Oh well, the beer is definitely the attraction here. I'll definitely be back for some more beer tastings and hopefully for the wild game pies once they are cookin...", 
    "review_date": "2009-01-15"
  }, 
  "-g3XIcCb2b-BD0QBCcq2Sw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa I.", 
    "review_text": "Popped into Church Key for a quick drink while waiting for a table at Tony's Pizza down the street.  I had been here once time before when it was a tad more crowded and ventured into their upstairs area.  This time around, we parked ourselves in the back corner away from the door/draft.  Their beer selection was impressive, and I enjoyed the off the wall decor and characters that were seen hanging out at the bar.  The place seems to have a lot of locals and usuals, so this was a great place to chill out and steer away from the more bro-ish places on Grant.  Definitely stop in here for an eclectic beer collection (and be prepared for strange looks when you want to order wine - ain't nobody got time for that at Church Key).", 
    "review_date": "2014-08-12"
  }, 
  "FJFt4-W5UNeqF1r9vOklvw": {
    "user_rating": 4.0, 
    "user_location": "Marina del Rey, CA", 
    "user_name": "Eric D.", 
    "review_text": "Great place to stop. Bar-tendress is very knowledgeable and helpful with great recommendations. Not crowded and quick service.  Great place", 
    "review_date": "2014-11-29"
  }, 
  "YdbvKA27AazwRdIY-FRbWw": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Joshua G.", 
    "review_text": "I am so late in writing this review. This place is so friggin awesome.  One of my favorite things to do in SF is host networking mixers, and Church Key was one of the best ever.  I'm a bit of a beer fan, so when I saw Lost Abbey's Serpent Stout on tap, I knew that we'd found the right place. Extremely knowledgeable bartenders, lots of rare ridiculousness, appropriate glassware and friendly folks.  Also, they had the Black Keys album on repeat. *WIN*!!!  The place is a little small, but it's cozy. Upstairs has a low ceiling, which, at first, was oppressive, but after a few beers, it kicked ass. One caveat, which doesn't matter so much during the winter months, but during the summer it gets hotter than a supermodel in a Microbikini. Like, literally uncomfortable. Other than that the setting is great.  They have a pretty quick rotation of kegs, and their website is inaccurate. Just go there, ask them what's best and drink away. You won't leave disappointed.  TL;DR: AWESOME Beer bar, right up there with Toronado, but a little smaller.", 
    "review_date": "2011-01-19"
  }, 
  "N67UV9tXgKEqFINl1P2kQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greenballoon X.", 
    "review_text": "I liked the relaxed environment of a Sunday evening at Church Key. Had a deliscious cherry beer while waiting for our table at Cafe Jacqueline.", 
    "review_date": "2009-12-03"
  }, 
  "_SVAW_bwFx3G2tDqmsmOBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven R.", 
    "review_text": "Church Key is a great name for a bar.  Unfortunately I'm not really into going to church these days.  It's always good to find another place that has a devotion to providing a good variety of interesting international and local beers to the masses.  I had two draft beers while here; Hacker-Psorr Helles and Allagash Black.  Both were delicious and I have tasted neither one before.  There were a few other options available in addition to a healthy selection of bottles.  Unfortunately i have to give the three stars based solely on those pluses.  The bar area is awkward; if you're not sitting at the actual bar, you're in a weird position because the one bathroom is at the end of the walk space behind the bar seats.  So it's nice to be close to the bar but be ready to move a lot.  Other than that the rest of the place looks like a cheap lounge not to mention there was an insanely overpowering smell of bleach emanating through the place.  The candle light was a little cheesy and the place definitely doesn't have the feel of your average beer bar (maybe that's a good thing for some people?).  The prices on some of the bottles were a little ridiculous too.  I know that the Schneider-Brooklyn Brewery collaboration brew called Hopfen Weiss is somewhat limited, but i thought it was ridiculous to see it going for $16 a bottle when I've seen it for $8 at other places.  It kind of makes me think the place cares more about seducing chumps too drunk to know better (well, it is North Beach) than actually sharing a love of beer with the rest of us.  The one saving grace is that while I choose to mostly dodge North Beach, if you want to meet in a bar somewhere in the area, I would make it be this one.  The place wasn't packed like a sardine tin and the clientele seem to be mostly enjoying themselves at a moderate pace instead of trying to get completely obliterated.  Just don't try to get me back across Green St. now...", 
    "review_date": "2009-09-10"
  }, 
  "mAhty2OHDTtLm00quB5Xjw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Jon F.", 
    "review_text": "Upstairs loft is a good place to get artisanal beer with friends.", 
    "review_date": "2010-08-02"
  }, 
  "Cfo08zrATMf9m9Qh1UtcXA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lyra S.", 
    "review_text": "Since long time i wanted to come and enjoy some beers in Church Key and i finally did it tonight.   It is located at bars strip of North Beach along with others. Have much better selection of beers. Most of them in bottles which i prefer and not more than ten top.  Sadly there is a problem with Church Key; it  just does not feel like a beer joint, there is no beer character.  Yes they have some selection of beers but sadly they can be enjoyed at a better environment.", 
    "review_date": "2013-02-28"
  }, 
  "kcYMw-UIj7naRMuCstTQqg": {
    "user_rating": 1.0, 
    "user_location": "Baton Rouge, LA", 
    "user_name": "Issa K.", 
    "review_text": "Generally I like this place. Especially when they played some Gojira on the bar stereo.   My gripe is that the bartender on 12/30/10 was acting shady. I ordered a peach beer of some brand. The bartender gave me different beer of the same brand, which was my fault because I named the brand only and not the variety. He offered to take the beer back and give me the one I wanted, but I relented and accepted the beer he had already poured; he insisted that I was getting a good deal on the beer. I took the beer back to my table and checked the menu to see what I had gotten, and it seemed that I had been overcharged by $1. I decided not to bring it up cause I had already left the bar area.  The second time I ordered a round I checked the menu and added up the expected total in my head. I gave the barkeep my order and he checked the menu on his own to get the correct prices, but the amount he told me overcharged $2 for the round. I pointed this out on the menu and he apologized and charged me the correct amount.   The lesson is this: Go to this bar, be prepared to pay a premium for good beer, and definitely double-check your bill like you're getting Chinese take-out.", 
    "review_date": "2011-01-16"
  }, 
  "gFB-b7IeNR3leLq8q-qeGQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kenny L.", 
    "review_text": "OK, so I get the \"Key\" part of Church Key... there's a picture of a key above the doorway.  But where's the \"Church\" symbol?  Maybe put a cross on the key or something?  Curious.  Anyhow, Church Key is a pretty solid place.  The beer selection is quite nice... my friend was pleasantly surprised he was able to find a couple of his favorite beers.  It was a tad crowded along the bar area for our group (there were 8 of us), but it felt cozy and warm.  The bartender let us bring food in to munch on while we drank... bonus points for that.  He was laid back and let folks sample a bit of his beer recommendation before they committed.  All-in-all, a great place to have a drink and hang out with friends.  It never got too crowded on a Friday night, but it never felt dead either.  C harming H uge beer selection U pstairs area with more room R estroom a tad hard to get to at the back of the bar C ozy downstairs H as a picture of a key instead of a sign outside  K ind bartender willing to let you sample first E veryone will find a beer they like Y ou should go!", 
    "review_date": "2009-01-17"
  }, 
  "OpzqHzqod7FZusRzin5KRg": {
    "user_rating": 1.0, 
    "user_location": "Durango, CO", 
    "user_name": "Tony S.", 
    "review_text": "Surly bartender.  Expensive beers at $7 for 12-14 oz drafts.  Beer choice was lacking.  Both the Columbus Cafe (around the corner on Green St) or Kennedy's (down Columbus Ave) have far broader beer selection, and much better attitude to customers.  We would not visit Church Key again.", 
    "review_date": "2013-01-26"
  }, 
  "IQymtwcSb7elorFDr_6YUQ": {
    "user_rating": 2.0, 
    "user_location": "Winooski, VT", 
    "user_name": "M L.", 
    "review_text": "I'm not a huge fan of this spot. I am a huge fan of beer but I can't afford anything on the menu! The beers basically start at $7 and go up to $50. When I went the place was dead which can be a good things if that's what you're into, we were the only ones in there which was not what we were looking for at the time. I do give them some props for playing pretty good music off real LPs. I may go back but unlikely.", 
    "review_date": "2009-06-04"
  }, 
  "bIt7A8ooqfjvP-2SQ_RUFw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rosie W.", 
    "review_text": "It's a nifty little spot with a low-key vibe.  A sophisticated yet simple addition to Grant, I went in wanting to like it.  And I did.  But there were a few things that were off key at Church Key.   The first was the douchetastity of the clientele.  Certainly not the bar's fault, so I do not deduct stars for that.  But can we devise some kind of  busing program for overachievers?  Like they did that time with the homeless before the Democratic convention?  Just once, I'd like to sit on a barstool next to a plumber or a poet or a vet tech in the north side of town.  Because when it's nighttime and I hear things like \"ROI\" and \"synergy\" shouted in my ear, I get depressed.  My city's been hijacked, and I'd like it back.  But more importantly, Church Key served me hot wine.  Twice.  Even though I ordered two different kinds, in an attempt to avoid the nosehair-searing, eye-watering experience of the first glass.  I think the wine was sitting under a hot light or stuffed in the bartender's pants before we got there.   It's partly my fault for not saying anything, but the bartender was already annoyed because the Mr. had the audacity to ask him about the beers.  Not like, \"Why don't you carry Bud?\" but simply, \"Do you have a pilsner?\"  I guess our not knowing which of the selections was a pilsner was bothersome to our expert bartender, the server of hot wine.   So I think I'd really dig this place if they'd move the wine and check the 'tude.", 
    "review_date": "2009-04-21"
  }, 
  "LkdzvgX0V4yn5MKscJ4j6Q": {
    "user_rating": 3.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Ivy N.", 
    "review_text": "Ehhh. Was not that impressed with this place. We were staying at a hotel nearby, so decided to stop here for drinks based on the reviews. Beer selection was good and the menu is kind of hilarious (skip to the wine selection and have a giggle). Other than that it's super tiny and I could do without the pretentious hipsters.", 
    "review_date": "2014-06-14"
  }, 
  "1DAzZPdaN78njTKhbC1JFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "Have I told you lately that I love you? Over the past year ChurchKey has become my go-to bar in SF -- it has NEVER disappointed, even when it was completely crowded during the North Beach festival. The beers are FANTASTIC -- completely diverse, always changing and never dull.  I happened upon trivia night recently when I was out with a group of friends -- and it was great. Good crowd, good service, great beer. Well done CKey.", 
    "review_date": "2010-08-14"
  }, 
  "b0lXNnfnZpKPv7xNwpG3Ig": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jen C.", 
    "review_text": "The bartender is so, so nice here.", 
    "review_date": "2009-03-09"
  }, 
  "xNIFzp7I9v6XEkIgjvavEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zac w.", 
    "review_text": "This bar is great. Nice and small, great range of beer, chilled out music, and friendly people. Feels good.", 
    "review_date": "2009-10-16"
  }, 
  "mOCM896HwdM4sL961RRNHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric G.", 
    "review_text": "I guess I would say that this is the closest thing I have to a neighborhood bar. Keep in mind however that I have a hard time staying in my neighborhood to hang out. When I do however, decide to stay in the North beach/russian hill-ish area, I love to start by getting a slice down the street then stop by here for a couple well selected beers.   Go ahead and ask the bartender questions about the selection. He has opinions and will ask you questions back to find out exactly what you want. This place also has a fair amount of regulars who are cool and appreciate good beer. With all of the beers on the menu here both in bottle and on tap, I find it so funny that they have PBR on the menu as their \"mystery american beer\". You can usually make a pretty accurate character assessment of a person at the bar if they passed up all of the awesome options for a PBR (im just sayin).   One strange feature of this place is the placement of the washroom. It is just passed the bar where there is a very narrow place to line up. This means that people waiting for a chance to relive themselves are inevitably standing right next to a group who is having a conversation at the bar. This oddly enough leads to some interesting new conversation dimensions.", 
    "review_date": "2010-01-10"
  }, 
  "t9OAdJcdL3suwm0jsAzQEw": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Leslie H.", 
    "review_text": "Super chill North Street bar that is a bit off the main drag (Columbus). Come here if you're looking for a relaxing place to enjoy a beer without having to deal w/ obnoxious clubbers and pushy Marina-types. Their beer list is extensive, and you better believe that the bartender knows his stuff because the only thing they serve is beer.   Random aside: First listing on the beer menu is the \"American Mystery Beer\" which can be anything from PBR or Natural Ice to something that actually tastes like beer!  Samples for $1 if you're not sure what you want.", 
    "review_date": "2012-01-30"
  }, 
  "w6SaPljfM2KfW9guNXCkGA": {
    "user_rating": 4.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "Meagan C.", 
    "review_text": "I have been really feeling this place lately. Went on Monday. Back again on Wednesday. It is the perfect spot to meet a friend or two for a relaxed drink and some catch-up conversation. Doesn't hurt that all i have to do to get there is basically roll down the hill from my apartment. To motivate me for the climb back up I stop and get a slice at N. Beach pizza.   Monday night there was no DJ and about 5 regulars posted up at the bar. Other than that, my friends and I (loving the big booth in the window) were the only people there. It still had a great vibe though. Drank Alagash White all night. Yumm.   Then went back last night (wednesday night) and it was definitely more full. There was a DJ but my friend and I were still able to talk without shouting. We sat upstairs in a nice quiet corner. This time I couldn't resist the PBR light in a PBR chalice. Just fun.   Might go back tonight. Too early to tell...", 
    "review_date": "2010-09-16"
  }, 
  "lhvKgF5nrS9B5j2FUbxRhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samir C.", 
    "review_text": "I was never much of a beer drinker until I moved in with my current roommate. He introduced me to higher quality beers than what you normally find at your typical bar or restaurant.  These beers are not the cheap college-drinking brew you pick up from 7-11 or Safeway and pound when you get home.  These are ones which provoke your palette like wine does. This is what Church Key is all about.  A few to try out if you are not much of a beer drinker but are looking to explore:  Tripel Karmeliet (which was on tap when I last visited) is a sweet Belgian beer.  The Chocolate Cherry Stout is also a great choice for those who have a sweet tooth.  Church Key has a very extensive menu which is always changing.    There's room upstairs to sit and hang out with your friends.  It's fairly low key and not very noisy so you can actually carry a conversation.  The only thing I don't like is that it last call is at 11:30pm.  However it is close to Grant and Green, Maggie McGarry's, etc., so Church Key is a great place to start your night in North Beach.", 
    "review_date": "2011-08-06"
  }, 
  "q0HDybhT0V9dXrs63_WqWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa G.", 
    "review_text": "At first sight, you'd think this was just another little casual bar like the millions of others trying to stand out in the city. Church Key is definitely a bit unique. Their beer selection was fantastic, to be honest. The Allagash Witbier is phenomenal, a mild yet well-rounded flavored beer. The beer menu alone was about the same size as a Cheesecake Factory menu, which is impressive.  As Phil H. said, the trivia questions were tough and I applaud the Hipster Holiday Sweater team for apparently knocking it out of the park! I had no idea Ronald Reagan had cheated on an eye exam just to get accepted into the cavalry (I believe that's what the question was).  Not a big fan of the bathroom being at the front (or back) of the bar, where you have to climb over adamant trivia-knowing locals; everyone staring at you as you patiently wait for the person inside to hurry the hell up (yes, you look fine, plus everyone's drunk already).  I would love to come back with a team of ass-kicking trivia players though.", 
    "review_date": "2009-12-30"
  }, 
  "vLyk1ugUbbX_wj-gPysizQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "paulina o.", 
    "review_text": "Great beer.  Bad ambience.  Worse service.  We came in about 1130pm to have a beer.  Bartender was rude when we asked about the menu.  Then she walked away for a while.  Eventually we got our drinks.  Beer was undeniably excellent.  Short while later another guy grabbed the mic and announced that everybody needed to \"get the f*** out\" by 12 o'clock sharp.  Overall vibe was one of drinking in somebody's unkempt apartment.  Somebody who did not want you in their apartment.  If I wanted to be treated rudely, I'd go to work.  I'll not go back to Church Key.  Next time I'll drink expensive beer at home, where the bar is clean, the people are more friendly, and I'm seldom told to \"get the f*** out\".", 
    "review_date": "2013-08-15"
  }, 
  "iI5hC_uNUBGkkvtWrBIaZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joey S.", 
    "review_text": "Fun little bar if you like good beers and want to spend a bit of money enjoying random beers ranging from $6-$50.    They even have the \"American Beer Surprise\" for $2 - which randomly gives you Mickey's, High Life, or PBR.  This is basically the best surprise ever, because no matter what you get, you always win.  The place is your average thin, two story dim loungey style place (like Jade, Mr. Smiths, Duplex, etc.).  In fact, the bar area is really narrow - you end up brushing against every beer enthusiast's backfat on your way to the bathroom.", 
    "review_date": "2009-03-10"
  }, 
  "_nDLZ65hEbo6xjvj5MR46g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike W.", 
    "review_text": "I went there too just relax after a hard day in the pit, the beer is cold and the ladies our hot, the bartender is nice and the well drinks out strong, just a place to kick back and forget your problems.", 
    "review_date": "2011-08-01"
  }, 
  "Z-crhxj5qLhPIRiGwE8D7g": {
    "user_rating": 1.0, 
    "user_location": "Portland, OR", 
    "user_name": "Terrance L.", 
    "review_text": "I was really disappointed in this place. The bartender was really slow, impersonal, and seemed annoyed he had to serve me instead of talk to the girl down the bar (the only other customer in the bar). I've bartended for years and usually I'm understanding but this place just seems snobby and too hip. Its also way over priced. This place is over-hyped for sure.", 
    "review_date": "2013-07-22"
  }, 
  "BwTPj8XS_iqdSTLPBVMs1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie Anne N.", 
    "review_text": "We walked down to Church Key after spending some time at Savoy. When we asked the bartender for something nice like a beer or something, he rudely stated that it was all he served there. Sorry buddy...didn't know that. It was our first time there. Anyway, water under the bridge. He gave us a nice bottle of some Belgium beer and another bottle of beer that we enjoyed. Hipster place. Not loud or full of annoying drunks. Good place for a chill mello night out.", 
    "review_date": "2010-03-09"
  }, 
  "WaQ7KcZd3wVozXiDFWIDVA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Niniane W.", 
    "review_text": "This bar has nice decor.  It has a huge list of beers.  I'm a wine drinker, and they only had one choice of white wine, which I drank.  It was actually nice to have no choice on what to drink, for once.", 
    "review_date": "2010-10-10"
  }, 
  "UdnFa74MR3BIHFoN_tsLwA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "David G.", 
    "review_text": "Stopped in during my trip from Boston and was really impressed with the beer menu at this place. Nice selection of various Belgian brews, although it tends to be biased towards the bottles quite a bit.   The bartender is absolutely great and knows his stuff big time. If you've been looking for a place to gulp down quality beer and converse with a bartender who's being paid because he knows his stuff and isn't a pretty face try this place out.   Anyone shocked by the prices needs to do some research on what these beers cost at a liquor store before you pass judgment. Good beers are not exactly cheap. Not to mention the alcohol volume in many is that of two standard beers like many of you are used to.   Good people, cozy bar (pretty small) and a small upstairs area. Give it a try, but stay away if you like loud music, dance floors and guzzling Bud Light.", 
    "review_date": "2009-04-18"
  }, 
  "KTs38V5KZE7HLoSaq1vrKw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chia C.", 
    "review_text": "I dig this place. The beer selection alone is what makes it a solid in my book. Good beer is easy to find. Unique, great beers on tap are HARD to find and this place has 'em. The beers are kinda pricey - it's true, but I don't know...even Whole Foods has beers that are $15+ a bottle...at least here I get served a glass and can send the beer back if I don't like it.", 
    "review_date": "2009-08-25"
  }, 
  "T1onvez6kj1aKChjFQCTOQ": {
    "user_rating": 5.0, 
    "user_location": "Tracy, CA", 
    "user_name": "Robert R.", 
    "review_text": "Scenario: A random Saturday night out with friends, one of which seemingly knows every bar in the city.  Product: Unique beers and wines you probably don't know (and soon meat pies from a chef!). For example, there was everything from an oatmeal stout to local wine to a sparkling wine in a can. No joke, surprisingly good stuff.  If you're going to pay $6-7 for a beer, come here and get something unique and well-crafted.  Service: Jason, the owner was tending and doing a wonderful job of serving the dozen or more of us in a timely fashion and giving everyone some personal attention. He was even cool with us bringing in pizza, though I expect you won't need to once the meat pies start arriving.  Atmosphere: This place is new so still unknown. The menu is unique, constantly changing, and very descriptive. The snozzberry beer tasted like snozzberries, whodathunkit. OK, it was blueberry, still delic.  As clean cut as the place is and as knowledgeable as Jason is, there is no sense of pretentiousness.  Uniquity: Chill place, great owner/tender, unique drinks, fair prices and the right 'hood make this the place to be. I almost don't want to yelp this so it can stay a secret from the 4-collar popping types.", 
    "review_date": "2009-01-08"
  }, 
  "ZBLZIOrO3DZJzDFlFO-bJw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Carlos A.", 
    "review_text": "Didn't mean to stumble into this place, but after roaming north beach need a not-so-crowded place to have a drink.   Church Key was a cozy little space with a small bar, a hilarious bartender and a nice loft space upstairs.   It's a great place to come with a small group of friends and take over the upstairs area.   I don't know what the bartender's name was, but he cracked me up.   Line of the night at closing time: Get out unless you're bangin' the bartender! hahahaha.   I'd definitely go back for their unique selection of beer. I'm not a beer connoisseur by any means so I was pleasantly overwhelmed by the 10+ page menu of beers.", 
    "review_date": "2009-08-16"
  }, 
  "rWad0m47ODrKbYh50TNk3A": {
    "user_rating": 5.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Niko X.", 
    "review_text": "Church Key is one of those bars that has a good combination of modern style and local charm.  The latter quality comes in the form of the really down to earth staff.    I patronized Church Key rather early in the evening, and found the vibe to be really laid back.  The staff were patient and conversational... offering some good suggestions on beers and wines available.  The prices are nominal for a bar of its caliber, and there are a variety of seating options from an intimate bar, window seats, high tops, and even a more intimate upstairs area with a balcony.    While I didn't sample any mixed drinks... the beer list is rather extensive...and there are some great wine (including sparking wine) selections.  Definitely a classy spot to hit up before or after dinner, if you're looking for good conversation.", 
    "review_date": "2009-07-15"
  }, 
  "nOvi-L-rwaClqfXFW5H_OQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James M.", 
    "review_text": "love tasty beers -- live around the corner. this place should be my goto -- but i get a bad vibe two times out of three.", 
    "review_date": "2012-12-11"
  }, 
  "c-EMjMBY4uKaxr-s33Q61g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Cool place, great neighborhood, great beer selection", 
    "review_date": "2010-11-11"
  }, 
  "DJ_pDxBy1L-La_qg8EADnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim W.", 
    "review_text": "Amen!  The  Church Key has proven my Atheism to be a false doctrine of idolatry indeed!!  Hallelujah!  Rejoice!  For Dionysus has revealed to me on this day that awesome craft brews can in fact come in cans!  I bear not false witness, I swear to it!  I hath seen with my own eyes that aluminum doth not be a barrier to the rich, complex tastes that are most often associated with deep, chilled drafts of the popular proclamation!    There *is* a life in hops that come from Maine!    Colorado *is* more than Anheuser Busch picnic niceties with cool Superbowl commercials!  Go!  Go now to the bar at the base of the T-Hill!  Go and spread the word, the blessings lay in wait for those that can hear...  Live!.", 
    "review_date": "2009-03-05"
  }, 
  "4T2uVlRjkl0eogswfL2bTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie J.", 
    "review_text": "This place is easy to miss! The dark exterior only has a symbol of a white key above the door.   The interior is dark with a bar at the back and a few tables. There is also an upstairs, but I didn't go up.  The bar has tons of bottled beer as well as 10 rotating taps of locally brewed beer and micro-breweries from across the country. Awesome!   The bartender knew her stuff and was very friendly.   I went on a Wednesday after work, the bar was not too crowded. They also have live music every Wednesday!  I will definitely be heading back", 
    "review_date": "2014-01-14"
  }, 
  "qV7KFRaoWy3oplj8e9rGtg": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Andrew M.", 
    "review_text": "There's only beer here. But, they have a big list of beers to choose from.   They are mostly bottled, but it's fun going through the beers and the description for each beer.  Sometimes they have a DJ spinning funk, adding to the nice ambiance of the smallish place.  Grab some friends, grab a couple of beers from the guy wearing glasses behind the bar, and then grab a booth upstairs.  Oh, and say hi to the tattooed girl sitting at the bar.", 
    "review_date": "2012-03-01"
  }, 
  "0E7L58EyWJV5mOC4qxvjXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "Can one say enough good things about this place, the selection, or the service?   YES, one can. So I'll mention a couple of other particulars that interest me at the time:   -- Cool copper bartop. I saw an apparition there the other night (see photo). It's like chemistry experiment and religious experience all at once.  -- La Folie for sale (like Duchesse de Bourgogne but not so sweet)  -- Mezzanine with mirror on ceiling. It's pretty small, don't go gettin any ideas...", 
    "review_date": "2010-09-01"
  }, 
  "pgHCj7DSqI8NWx7WucnH3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew S.", 
    "review_text": "Really great beer place in North Beach. HUGE, i mean HUGE selection of unique beer from all over the world.  Beer connoisseurism is on its way up - so this is a great place to expose yourself to all different types of brew if you want to become a beer sommelier, or at least someone who knows a thing or two about beer beyond keystone and natty ice.  Try the Chai Tea Beer - its awesome.", 
    "review_date": "2011-01-27"
  }, 
  "029nDskge0gV-LSw-MYWvw": {
    "user_rating": 5.0, 
    "user_location": "Kirkland, WA", 
    "user_name": "Debbie M.", 
    "review_text": "Went here with a few friends and we all LOVED it!  Great prices on fantastic wines too!!  Keep up the good work, the great prices and awesome wines and we will be loyal fans!", 
    "review_date": "2009-01-25"
  }, 
  "eAzWJ1Wwky3wGw2kmmT_BQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel V.", 
    "review_text": "Unbelievable. Been here many times before and liked it, but I won't be back. Feel bad that this is my first negative review, but the bartender \"lady\" has some serious anger management issues.  I have never been treated this unprofessional and rude. The worst bar experience I had by far in the 7 years I live in this city. Still stunned...  What happened? We got a bottle of white wine for our group. It was the worst wine I drank in a very long time but OK, it's a beer place and they have lots of good beers there. Guess our own fault. When we (nicely!) asked whether we could exchange the still almost full bottle of wine for a beer or 2 (they sell the same wine by glass also) she suddenly got grumpy. She poured the beers, then made us pay for them and then asked us to leave right after. Just like that. Speechless.  Please dear Church Key, get rid of that bartender. You are a great place otherwise.", 
    "review_date": "2013-10-16"
  }, 
  "kaRMd5xowixbhF6QPYYxKw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed C.", 
    "review_text": "There is only 1 thing wrong with Church Key but it's a big wrong - the prices. The boyfriend and I have each been in San Francisco for over 20 years so it takes some really egregious pricing to shock us but Church Key managed to do it. And in these extremely difficult economic times, I find their prices pretty offensive.   What's sad is that the Church Key has the potential to be one of the most unique, enjoyable bars you could ever have the pleasure of being in.  As the other reviews note, the ambience is very chill:  great lighting, colors, very cozy, and music that adds to the experience but doesn't drown you out.  I never made it upstairs, but down below there is no TV, which is also an  added plus.  My boyfriend and I did not find the bartender particularly friendly, although he wasn't overtly rude, either.  For unusual beer selection, there are a plethora of choices such as City Beer, Healthy Spirits, and Toronado. Or head to Lanesplitters in Oakland, Barclay's in Rockridge, The Warehouse Cafe in Port Costa. While these places not might have the ambiance that Church Key has - their pricing is much more palatable.   If you really want to spend ridiculous amounts of money on beer, go to Mays Field and watch Tim Lincecum pitch, head to the Cliff House for the view, or go the the Top of the Mark for a styley time out.", 
    "review_date": "2009-03-10"
  }, 
  "muPKUHFQnK5_G55k48Avkw": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Brandon B.", 
    "review_text": "North Beach pretty much sucks in most aspects. The bars are pretty douche-y, the Italian restaurants are mostly tourist traps, and the parking is just crap. That being said, there are a few bright spots. I personally didn't like the attitude at La Trappe, and well, if you're not into Belgian beer, you're pretty much SOL.   Church Key pretty much takes a teeny weeny little beer/wine space and gives North Beach a mellow little spot with a great beer lineup. The bartenders are nice guys, and the lineup is ever-changing. Are there beers with bigger selections, rarer beers and lower prices? Sure, but not in North Beach, and not with the \"welcome to my living room\" atmosphere of Church Key. There's a big resurgence in quality and craft beer in San Francisco, and it's always good to see more places pushing the word of good beer.", 
    "review_date": "2009-06-25"
  }, 
  "6AlZdIUJCy-zAp0AG9NXAQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Elizabeth K.", 
    "review_text": "Awesome beer selection!  If you have friends who are into beer this is place to be.  It is a small cozy spot so it is perfect if there are only a few people in your group.", 
    "review_date": "2010-12-11"
  }, 
  "bk3LC4qjyk3VEVtpP4P68w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kierstan G.", 
    "review_text": "This is a good bar to find when you finished an amazingly filling dinner in north beach but you either don't want your date to end or you just don't feel like making the treck back to your neighborhood quite yet...after all its a friday night. you didn't blow dry and curl your hair to turn in early...  or maybe its both, and that was my situation...the place is dark, small, apparently theres an upstairs that I didn't see it...for a friday night the crowd was kind of perfect, enough people to feel social but not so many that we couldn't get a seat.  we saddled up to the bar and began looking at a very decent beer menu.  of course the one sour beer I wanted to try they did not have.  And he made it worse by telling me how much i would have loved it had they had it...thanks dude...  luckily our choices were both yummy and i'll will probably be back...for sure", 
    "review_date": "2012-09-08"
  }, 
  "BupxMA1KZEV08MHfBD1EuQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Cesar E.", 
    "review_text": "so difficult to find this place with no sign at the door. just the key  logo.  and buzz  after try drink after drink and different bars over the area. well. its too bad only beer and wine  anyway. we had super aswesome time.    the bartender from this bar is  muy buena onda.", 
    "review_date": "2012-06-03"
  }, 
  "9nG4nzUjOQ4vLCiFok2_1A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Claudia O.", 
    "review_text": "First off, if it wasn't for Yelper's I would have never visited this place, so THANK YOU!!!   I love going to cozy and casual bars. Especially, the ones where I can wear jeans and never once feel like I'm under-dressed.   This bar is amazing! I absolutely love it. The beer list is like a book, seriously, it is pages. We ranged from dark beer to light beer. We had 3 different beers each. I thought it was fairly priced however, I stayed cleared of the $15 and plus beers. I would really like to see a beer tasting, that would be awesome! We had the best seat in the house. If you can, get the booth on the first floor (next to the door), it's away from the traffic at the bar and allows you to talk without having to scream. Our server, Lisa, was great. Super friendly and always came to check up on us.   I want to give it 5 stars, but parking was horrible. I had to park about 4 blocks away, but it was well worth the walk.", 
    "review_date": "2009-10-26"
  }, 
  "s3kRi7b8t2sdtYcsMbqlJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jazzy l.", 
    "review_text": "My first time here. Very friendly service + customers. I think they were mostly Jason's friends/buddies.  They have an upstairs sitting area.  We went around 10pm but it started getting crowded around 11pm.    THEY ONLY SERVE ECLECTIC SELECTION OF BEER AND WINE!", 
    "review_date": "2008-12-21"
  }, 
  "drI9J9xeWephVGlfMC487w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole M.", 
    "review_text": "What a wonderful beer selection! There were too many good choices, so in the end I asked my bartender to recommend something rich and dark. The beer he guided me to was really lovely. It was a chocolate cherry stout from Stone Brewing.  The beer was a deep mahogony color. It's cherry and chocolate flavors were perfectly balanced and the beer had a smooth,clean finish. It was definitely something I would drink again or buy on my own. They also had a rose hibiscus beer in stock that I am awfully fond of. Needless to say, there is a good mix of the offbeat and some of the usual suspects. The tuesdsy night trivia was fun background noise. And, the upstairs area is perfect for a small gathering. Which is terrific comsidering I was there for a birthday. Parking is a  bit of nightmare, so walk or take the bus. Don't forget to build in some time extra time to check out the uber cute boutiques on the block or to have a bite at one of the myriad of restaurants nearby.", 
    "review_date": "2011-08-09"
  }, 
  "r-8eQ28RhnQPJdZXHcTXrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika C.", 
    "review_text": "When I was seventeen I drank some very good beer I drank some very good beer I purchased with a fake ID  My name was Brian McGee I stayed up listening to Queen When I was seventeen  ---  Got a 750ml bottle of Duvel Triple Hop for $50. This can be had at a store for closer to $25. Pretty standard to charge double at bars/restaurants, but I was still surprised I spent $50 on beer.   Luckily, it was very good beer. Not $50 good though.   Come here for a Mission vibe in North Beach.", 
    "review_date": "2011-11-12"
  }, 
  "gEUrtbRV0VLgwS3Da-CndQ": {
    "user_rating": 3.0, 
    "user_location": "Orangevale, CA", 
    "user_name": "Daniel K.", 
    "review_text": "I had been trying to find Church Key after it was recommended to me, for weeks!  The fact that I frequent North Beach and had to make multiple attempts to find this place is bogus.   HINT: Look for the TINY white key above a door, the type of sign that anyone who's already had a drink prior to looking for this place will never find.  Other than that the beer selection is solid but pretty pricey. An ideal place for someone not worried about price, only quality. Bring a beer guru here to find more than a few difficult to find brews with completely unique taste.   If I'm spending this much and looking for selection I'll typically stay with Rogue across the street, but the two aren't really comparable.", 
    "review_date": "2010-12-19"
  }, 
  "ICdUj6pw9-GtbKMeqcKQOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ramin R.", 
    "review_text": "Very laid-back and mellow to get some great beer and chill. Come in from the chaos of North Beach weekends and relax. The upstairs loft is very nice. Don't bring big groups. Just not gonna work.", 
    "review_date": "2011-03-31"
  }, 
  "Z8Lv1KMN_EE2WM1bSwo7Ng": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel K.", 
    "review_text": "I'm not a bar person.  I prefer restaurants, you can hear people easier, there's less drinking, and more food.... all things I like.  That being said, I really enjoyed my evening last night at the Church Key.  My husband and I got there early, trying to avoid the crowds, sat at the bar and ordered a couple of beers.  I'm also not much of a drinker of beer, but they had this amazing Belgium Apple Beer that tasted much like apple juice, which I now love!  And, my husband who is quite the opposite of me and loves to drink beer, found great beer and was able to talk hops and barely (???) with the very informed and friendly bartender.    Last night they were trying out their food, trying to get the timing right, and so I got to sample their meat pie.  Ox tail and other veggies, and I loved, loved, LOVED it!  If you like beer, meat pies, or tasty apple juice that apparently has alcohol give it a try!", 
    "review_date": "2009-01-18"
  }, 
  "A2mx9xsHoIDNnd81_lxiFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Javi V.", 
    "review_text": "Nobody is uptight here, it wasn't very crowded the Friday's night that I went, and the waiters are super friendly. What else can you ask for? Good beer. And they have it. Try the \"Double Bastard\".", 
    "review_date": "2009-01-10"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "I dig this place. Indie rock music and Belgian beers.  And Belgian-inspired beers. Konigshoven quad?  Yes. Maybe a Rochefort? Yes. Taps with other tasty selections?  Yes. Can I walk home? Yes. Is it hard to find because there aren't any words on the sign?  Yes. Beer prices high?  Sure, $7-8 per beer, but you're not ordering coors and bud here.  If you want the watery, cheap stuff, go to one of the touristy bars.  There are plenty. No more questions.", 
    "review_date": "2009-07-27"
  }, 
  "NJkKim1vaowyEKtazPdByw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Counter C.", 
    "review_text": "The best beer focused bar in SF!  Totally chill atmosphere and friendly staff, both things seriously hard to find in North Beach.    Seriously, they have the best selection which is always changing, and the owner is very knowledgeable and friendly.  Only dock it one star for being so expensive, but that's the price of good beer.  It doesn't stop me from coming here, it only means I order one really good beer instead of 3 mediocre ones.", 
    "review_date": "2009-11-03"
  }, 
  "vi1Ta_3XtGTqkl4p83ZbEQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Toby C.", 
    "review_text": "Church Key, I get that you're the \"new kid\" on the block.  I understand that you have a massive beer selection (as \"beer is the new wine\").  I also get that you're too cool to have proper signage (prompting me to tell my friends \"it's the place with the key outside\").  But why did you charge me $51 for a 5 bottled beers?  Don't you think that's a little steep?  Don't you think that's highway robbery?  Nevertheless, I'm sure I will see you at some point again and maybe I'll be in a better mood next time...", 
    "review_date": "2009-03-28"
  }, 
  "rXops73qsJgW91oImt7UJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Broke-Ass Stuart S.", 
    "review_text": "I have the unfortunate distinction of having known Jason King for many, many years.  I knew him when he was a long haired metal head who wore nothing but Pantera and Cannibal Corpse t-shirts.  I was around for his brief and, dare I say, mediocre foray into motorcycle maintenance.  Hell, I even knew him when he lived in a dilapidated squat with trannies, junkies and people so fucking punk rock that having a reasonable conversation with them was impossible.    Yes, I know Jason King, and of all his phases and incarnations his best yet is bar owner.  I mean really, have you been to the Broken Record?  Jason took some shit hole in the Exclesior and made it one of the best bars in the city.  So it is with this in mind that I relate to you the excellence of The Church Key. Sure I can go on and on about how it has high-quality, unique beers you've never heard of from around the world that rotate on a weekly basis.  Or how it has the coolest wall paper I've ever seen (some type of Victorian/Hieronymus Bosch hybrid).  I could even go on about the great local wines or how The Church Key will soon be selling European style meat and veggie pies.  But the best part about this place is that it has been instilled with Jason's trademark unpretentiousness and...well, who am I kidding?  They've got $2 beers!!!!  Woo-hoo!!  Thanks for not being a douchebag Jason!", 
    "review_date": "2009-01-05"
  }, 
  "X9nN47rcS97gHnde2cJf1w": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "Eric L.", 
    "review_text": "Church Key is the best thing to happen to North Beach since Italian food.  Unassuming and laid back, this bar welcomes everyone, but luckily much of the crowd walks right by it to Savoy or Grant &amp; Green.  Too mellow for the hard partiers, it welcomes those who want an excellent beer and place to hang out with friends.    The beer is amazing, all hand selected by the owner, Jason.  Props to him, because it's the best beer list i've ever seen at a bar.  Sure, Toronado has more on tap, but not as wide a selection.  There's another bar in North Beach (not going to say the name, but it rhymes with \"Tra Lappe\") that has more Belgians but is over priced.  I saw a bottle of Kasteel Bruin for $18 there, when Church Key had it for $8 on tap (sadly, not available any longer).  The staff is fantastic, friendly, and tattooed up (the job requires a tattoo on your chest)  and knows their stuff.  The best kept secret in North Beach!!", 
    "review_date": "2009-10-30"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Tucked away on discreet Grant Avenue, a wordless sign with a symbol of an old-fashioned skeleton key hangs over the entrance of this tiny bar.  Formerly Magnet, the new owner has taken the sterile brushed steel interior and warmed it up a bit - gorgeous rich-hued wallpaper along one wall, pressed tin around the bar, Edison bulbs upstairs, and flickering candles...with plans to incorporate more classic touches reminiscent of an old British study or Sherlock Holmes.    This is not your typical North Beach bar.  Church Key's specialty is domestic and imported brews from all over the world - spanning from a microbrew from Escondido, CA, spiced ales, a hibiscus-rose beer, to a $50 bottle of beer called \"Lust\" that hails from Brasil.  Don't worry - for you non-beer people, there is also wine to choose from, including a careful selection of ports.    The space is quite cozy and good for conversation and lounging.  Since we went on opening night during a holiday weekend, it was very mellow and uncrowded for a Friday (actually, almost all of North Beach was, which is unusual).  Definitely one to watch as an up-and-comer on the North Beach scene...", 
    "review_date": "2008-12-01"
  }, 
  "7oywa3APEn2yb3eGlsr6Xg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Karina R.", 
    "review_text": "By the way, I just wanted to add Rob to the great staff! Jason has made some really good staffing decisions!", 
    "review_date": "2009-03-10"
  }, 
  "SKEtwR6wa_MUUoNDWLLefg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William G.", 
    "review_text": "Finally, a bar in north beach worth going to...  Sure, the Kerouac fan in me just groaned, but it is true.  North Beach's nightlife has always turned me off.    But the folks at the Church Key are as unpretentious as they come.     The beer list is ridiculous and offers beers impossible to find any where else...   yes, even torando, monk's kettle, and city beer store...     I had a barley wine, Mikkeller's  \"Big Bad Barley Wine\",  at $22 bucks it is worth sharing with someone just to try.   It was one of the greatest things I have ever put in my mouth.   Taught me how to love again.  Anyway, they have other great beers that are cheaper and come in large format bottles, great to share.  This place is only going to get better, once the old \"Magnet\" vibe is gone and good people start filling the place.   I really can't wait!!   See you there.", 
    "review_date": "2008-12-03"
  }, 
  "RFuMyqihKYlTKx8SNAjrVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamar D.", 
    "review_text": "I received an explanation from the owner of ChurchKey about the reason why the bartender was so hell-bent on getting us outta there.  They got a shakedown a few weeks ago because some patrons were in there a few minutes past closing.  Liquor Nazis in search of fine money, it sounds like.  I love my City but it really can be just as anti-business as they say.  If a bar can stay open until 6am but stop serving liquor at 2am, then certainly this cool and eclectic little place can last a few minutes past the witching hour.  Patrons who don't want to leave are a sign of a place worth staying.  Thank you to Jason, the owner, for such a polite and courteous email.  I will certainly return to your establishment.", 
    "review_date": "2010-05-17"
  }, 
  "cVgfo9k2D0s-KXtO9MDTPw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle C.", 
    "review_text": "Decided to pay a visit here Saturday night with my roommates after hearing about their awesome beer selection + chill ambiance. Super stoked to experience \"the Church Key\" and unfortunately, I was let down, not even five minutes into my visit.    Here's what went down in those short five minutes- right as we walk into the door, a man standing outside warned us that the bar just closed and were no longer serving drinks AND that the bartender was a \"DB\". Since it was only 11PM, I decided to go in and scope out the situation. I walked up to the bar tender who didn't seem very busy and politely tried to get his attention. \"Excuse me\", I said lightly and got no response from him. Since there were people chatting around me I tried again, but with a little more volume, \"Excuse me\". He finally decided to make eye contact with me after the 3rd try. \"Is the bar closed?\" I asked and he shortly answered, \"Yes.\" That was okay, life goes on. As we're walking out, I noticed the bartender was saying something in my direction. Not hearing what he said, I turned around and said to him, \"Excuse me?\" and he shouted, \"But thanks for asking politely...\" in a condescending tone. I just walked out, it wasn't worth my time.   Truth be told, the Bartender Saturday night was a \"DB\".", 
    "review_date": "2011-09-18"
  }, 
  "eAhUW3Lt_V2-LbiaUUcg-Q": {
    "user_rating": 1.0, 
    "user_location": "Cincinnati, OH", 
    "user_name": "Chris N.", 
    "review_text": "Tried going here twice, the beer list looked decent. Unfortunately, the service wasn't, as they kick out anyone who isn't a regular after about 10:30pm. I never actually got to have a beer here, and I won't go back!", 
    "review_date": "2010-12-03"
  }, 
  "kORGcgi0Iw2RG8gJl84MVA": {
    "user_rating": 5.0, 
    "user_location": "Barcelona, Spain", 
    "user_name": "Caroline C.", 
    "review_text": "They keep it simple and it keeps you unstressed. Great beer selection + my favorite viking bartender!", 
    "review_date": "2012-11-29"
  }, 
  "WfePuaS_iXGNGU6bfDe3JQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Justin A.", 
    "review_text": "Beer Stop 23 ---  I walked past Church Key a few times before realizing where the door was. Too funny. Completely nondescript sign with a key above the door that keeps a lot of the riff raff out.  ChurchKey had ten beers on tap of all different variety. They had Santo Marro from DogFish on tap, so that was pretty cool. There was only one bartender but he did a good job of providing recommendations when needed.   Also, no kitchen. You are free to bring in your own food though - plenty of pizza joints around the bar.  Good stop here.", 
    "review_date": "2013-04-14"
  }, 
  "zpmViTr7g_1Ig8jPO0VNSQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynsey C.", 
    "review_text": "I've always been a fan of speak-easy type lounges and bars. I don't know what it is about them, but I love to be incognito for awhile and drink my libations in secret. The past few months, I have casually strolled past the Church Key on my way to Savoy Tivoli, or Grant and Green or Gino and Carlo's, or Golden Boy, or...well, you get the picture (this is my 'hood after all), and wondered what the heck it was! The outside is dark, the windows tinted and there isn't any other signage other than a mysterious key hanging over the door. I was dying to know what sort of secretive behaviour was happening behind those doors. Did I need a password? Or better yet, a special key?  Luckily, my intrigue was put to rest last night when my date suggested we check it out for a beer. A-ha! So it's a bar...good to know! We arrived at 7pm, and the place was pretty empty, which was great for us because we could chat and hear one another. We sat at the bar and the bartender was extremely knowledgable on their extensive beer list. I told him I usually drink Stella and wanted something similar. He quickly offered up a Hawaiian Beer that was called \"Blonde\"-something and had a picture of a hula girl on the front. I'm easy...sold! My date grabbed his favorite German lager and we happily talked and drank our frosty brews for the next hour. We joked around with the bartender and wanted to know what the word was for a beer sommalier. Brewlier? Beerologist? Anyone have answers??  The atmosphere is simple yet cozy and dark. I loved the lounge-y music and low lighting. It appears there is an upstairs loft area to get lost in, but we did not make our way up there. They also claim to have pub quiz on Tuesday nights, so I will have to come back and check it out.  Overall, this is a great place to meet someone for a drink, especially if you are an adventurous beer drinker. I think it would be fun to have a large group here as well for some after-work shinanigans.", 
    "review_date": "2009-11-18"
  }, 
  "YVEBucA-FoCaXXXPUpuenA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joy H.", 
    "review_text": "Good selection of beer. The bartender was incredibly rude though. My husband asked the bartender to turn down the music a notch because it was so loud that we had to yell to hear each other. It was also hurting my ears. And she said no. WTF? Seriously? What happened to customer service? We would have stayed longer and spent more money but got out of their because my ears were hurting. I regret not taking my tip back. And I will avoid this establishment if that particular bartender is working.", 
    "review_date": "2014-10-11"
  }, 
  "axYXuuUJh4eMW-gsb5jR2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John K.", 
    "review_text": "Great bar for beer - if you don't want great beer, don't come here.  The menu is amazing - so detailed and so complete.  The bartenders seem to know their stuff - and are happy to help you if you don't know what you want, most of the time.  The only problem - closes too early: Church Key - why do you close at midnight?", 
    "review_date": "2010-09-19"
  }, 
  "ugHHCgv-MU3mPfSuHBHNlA": {
    "user_rating": 4.0, 
    "user_location": "Camas, WA", 
    "user_name": "Lauren H.", 
    "review_text": "Do not judge a book by its cover. When I first spotted this place, I actually made fun of it out loud for looking like a place that lonely businessmen go to drink alone. That was on a Wednesday. But on a Saturday? The place was packed, and for a good reason. They have an incredible selection of beer and - to my surprise - one by Avery Brewing Co. in Boulder, CO that I had been wanting to try for the past year! The beer selection made our party of 10 beer fans happy, and the duck meat pie was comfort food. I will definitely be back, on a Wednesday or a Saturday or really any day that ends in y.", 
    "review_date": "2009-02-01"
  }, 
  "e21xOMduxvfeXGUOnsLvNA": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Holmes R.", 
    "review_text": "I hosted a private event at Church Key on a Sunday afternoon (during a time when the bar is typically closed). The owner Jason was easy to work with, accommodating and made some helpful suggestions. Bartender Stellar was low key and also easy to work with. We had a great time - comfortable setting, wonderful tap list, great space for a smallish gathering. Enough folks were having fun that many people stayed on for hours after the bar opened to the public for normal operating hours. I would without a doubt host there again (and hope to do so). An unpretentious, awesome resource that I'm grateful to have discovered.", 
    "review_date": "2013-03-18"
  }, 
  "kBnQt4jIADaep59-XX0waQ": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Katy H.", 
    "review_text": "error. i have not been to this place", 
    "review_date": "2014-11-16"
  }, 
  "BmipmKVTx37gpfPzK7eU4A": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Kirstin E.", 
    "review_text": "We dropped into the Church Key this past week on our visit to SF.   What a cool little spot! I would love a place like this in PHX! Small, Dark, no hipsters in sight, nice staff and a HUGE beer selection. Like ridiculous selection.   For sure go check this place out.", 
    "review_date": "2011-05-24"
  }, 
  "vTfoN4FU_wcdX2AKRwb2Hw": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "sanjee w.", 
    "review_text": "Neato little gastro pub tucked into a quaint street in North Beach. Fantastic beer selection. Amazing range. Super friendly bartender that will help you select. Tried the venison and rabbit sausages and it was great! Cool crowd from the neighborhood.", 
    "review_date": "2010-12-29"
  }, 
  "SPK6XrxnSFxbeY-YLW3Yyg": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Sean M.", 
    "review_text": "This place is stupid good. I love the coziness, and a bartender who not only knew just about everything about every beer on tap, but also was a great conversationalist. The night we went, the music was good, just a nice selection of mash-up mixes and various older dance music playing off a laptop somewhere. I really loved this place, and would definitely go back and recommend to others. Also, fair prices on some delicious drinks. The menu had us laughing, as someone else pointed out. Just read the wine list.", 
    "review_date": "2014-08-10"
  }, 
  "FzJRCkoalWORV9MskE2CuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy K.", 
    "review_text": "There might not be a Table of Contents for the gazillion beers available, but holy shizznit...!!  TONS of beers/ales from all over, and they're serious heavyweights.  We're talking over 10% A.C. average, some even more potent than wine!  The novella of a menu can make your head spin, but just ask the barkeep for suggestions.  Small space is usually filled with low-key clientele just out to enjoy a few cold ones and shoot the shit.  Only downside is that it can get stuffy, especially on the 2nd floor mezzanine.", 
    "review_date": "2010-10-21"
  }, 
  "nHnNraNUct25HJJTRAGYkA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Susan L.", 
    "review_text": "Church Key has been bookmarked for a while and I finally made my way there the other night. The joint was dead on a Thursday after work, which meant the bartender could spend plenty of time with us recommending beers. I wanted to test him out by requesting a belgian-style ale that was light and crisp. He first recommended Allegash, which is one of my favorites. But I wanted to try something new so he then suggested Prankster, a northern California brew. Prankster hit the spot and was exactly what I was looking for! Church Key is missing a star because I'm curious to know what the crowd is like on a busy night.", 
    "review_date": "2009-07-31"
  }, 
  "aJbXWA8OuA4mx0B67dXwNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna b.", 
    "review_text": "I'm so glad Jason opened a spot in North Beach. I love beer, and this kind of spot in the heart of North Beach, with quickly rotating beer menu and a nice laid back atmosphere, is just what the doctor ordered. Yay!", 
    "review_date": "2010-06-21"
  }, 
  "1nJtgBCiMuiRkESt9izaIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff H.", 
    "review_text": "Nice little spot with 5 or 6 beers on tap. Some bottles as well. I like that you can taste a few beers for $2 each before paying the $6+ for a full beer. It was dead when I went so didn't get to see the atmosphere. The Bartender knew the beer well. I've been before but never reviewed it.", 
    "review_date": "2013-01-25"
  }, 
  "sRQu5rrkNXe5yXjKvPqWrQ": {
    "user_rating": 5.0, 
    "user_location": "California, CA", 
    "user_name": "E P.", 
    "review_text": "Perfection! The bar is cozy and chic without being pretentious.  The beer list is really long and has a good variety. The staff is friendly, helpful and fun.  I really love this bar.", 
    "review_date": "2010-02-20"
  }, 
  "BBwqj15pm04Hhm9b3R57bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mez L.", 
    "review_text": "Definitely a cool, comfy place, if a bit hefty for your wallet. Not too pricey for the amazing beer choices, just more than I'd spend on a beer or two if I wasn't planning for this kind of atmosphere. Definitely recommend it.", 
    "review_date": "2010-06-26"
  }, 
  "zTE8KUu2ukFQZ67fZypLtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christy I.", 
    "review_text": "good good beers on tap.  i had an allagash something, don't quite remember exactly what... it's bourbon-based or something like that (i won't even pretend to be an expert on brews, all i know is that's what he said).  it was GOOD.  strong alcohol content, and sweet and fruity.  even better was my friend's denogginizer.  WOW.  trust me, the taste of this beer (i think it was an IPA) was even better than its name.  denogginizer.  love it.   beers on tap range in price from $6 to at least $10.  seems like they have an even bigger selection of bottled beer, but that is something i'll have to check out next time.  the place is small and a bit uppity for a bar, in my opinion.  looks too \"loungy\", and space is small and there aren't too many places to sit.  not good for big groups.    ladies, the guy-to-girl ratio at this place works in your favor.  i went with my two friends, one guy and one girl.  my female friend and i were the only females on the first floor, in the midst of approximately 15 men scattered about.  just an observation...", 
    "review_date": "2009-05-25"
  }, 
  "bW3HC_sBuEHRvE5FYTYO0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy T.", 
    "review_text": "You go here to enjoy beer with an intimate group of 2-3. It's quaint for a reason, don't bring a party.   + selection  I would make this my neighborhood bar if I lived nearby.", 
    "review_date": "2011-03-20"
  }, 
  "tFId1_3TcZLzp4lhrjYLWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa W.", 
    "review_text": "Love love love love LOVE this place.  Classy, laid-back and quiet interior with a friendly bartender and a HUGE selection of beer (it gets pretty overwhelming so I would suggest you ask for recommendations if you don't see something you like right off the bat). This is not a place to rage - it's a place to sit down with a few friends and have a nice conversation. Beer and wine only!  There's a large seating area upstairs with ottomans and couches, so even though the space is small you should be able to find a seat. We invaded the place with a large group of 10+ on a Saturday night and there was enough space for everyone to fit.  There's no sign above the door but keep your eyes peeled for a white key on a black background.", 
    "review_date": "2011-03-02"
  }, 
  "fMpvkGS2D32arEnYSysGOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "NB B.", 
    "review_text": "This place blows Le Trappe out of the water for beers and atmosphere.  And there's no douche baggery.  They might also appreciate your yelp review unlike the owner of Le Trappe who thinks anyone that yelps is a complete loser. Support businesses that care! Glad these guys are in the neighborhood.", 
    "review_date": "2011-04-11"
  }, 
  "V9I-TUdXUWtKJkJ3u22gpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Muse E.", 
    "review_text": "Best bar in North beach? Yeah I think so. Look I like a lot of bars. but I like good beer even more... I'm a shit talkin snob when it comes to beer and When I  actually know what I'm talking about. I like to my brothers, friends when they  come into town or even one best friend's mom who loves to go out on the town with me like I'm Billy Dee Williams.... (Ms. C Luv ya). I go to Church key. Damn good Beer selection...Damn good atmosphere.  It ain't cheers and nobody know my name...And quite frankly I don't give damn. But they know what I'm drinking. I love the beer, I love the Bartender and I love the Church Key.  I wish there was a Church Key in my neighborhood....Sniff Sniff", 
    "review_date": "2010-03-03"
  }, 
  "Z3vY6CM1aSJcyDMrFfhPIw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Nick C.", 
    "review_text": "I really enjoyed this place. I forget the bartenders name, but he is very good. The beer list here is huge and he has the knowledge to properly navigate you through it. The bar itself is quite small so conversation amongst the patrons is common. I didn't head up stairs, but  I assume their is some type of restaurant? If you are looking for a good beer spot, then look no farther, Church Key is it.", 
    "review_date": "2010-07-03"
  }, 
  "EHwNw8KOy8PbkCz46mdhhA": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Owen S.", 
    "review_text": "A nice little bar... a descent selection of high quality beers.  Prices are a bit high, but that is what you get for high quality beers.  Staff are always very helpful.", 
    "review_date": "2011-10-31"
  }, 
  "uZ_y3gL63fJ843L53UW_XA": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Morgen N.", 
    "review_text": "I heard about Church Key and had a feeling I would like it.  I am by no means a beer connoisseur, but I enjoy trying new things.  They had more than a large selection of beer I had never tried before, and the setup was quite nice.  We especially enjoyed the loungy (but laid back) feel of upstairs when we had a small group there.  I felt the bartender may have been a little overwhelmed by himself on a Saturday night, but I was won over later in the night with the offering of $2 really cheap cans of beer (I know, not the idea of this place but cheap beer is always good beer in my book).", 
    "review_date": "2009-03-17"
  }, 
  "bCoalme4xOkSseWM63y9jA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Missed F.", 
    "review_text": "soon after i wrote a yelp complaint, the owner of church key sent me a cordial and earnest letter of apology about my experience.    i really appreciated that.  it's nice to know that a professional and tactful entrepreneur who cares about his customers' opinions owns the joint even though it is *sometimes* (i heard from friends that the other bartenders have always been nice to them) operated by a jack*ss.", 
    "review_date": "2010-06-15"
  }, 
  "yLNVf92fT7e9clI8Vm9e2A": {
    "user_rating": 4.0, 
    "user_location": "Fort Myers, FL", 
    "user_name": "Layla M.", 
    "review_text": "The only place I've ever had bacon beer...I love the casual vibe, the extensive bottle list and the iconic sign....", 
    "review_date": "2010-10-17"
  }, 
  "SUQk-LIalVZvAO_lVAGR8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ted G.", 
    "review_text": "This is a great bar if you're looking for a low-key atmosphere with a solid ber lineup.  They don't have a huge selection, but every time I've gone in, they've had several beers that I wanted to try out.  I feel like there has been a different bar tender every time that I've been there, but regardless they've all been great.    This is kind of my go to spot when I'm out in North Beach and I want to get away from the crowds and enjoy a beer with a friend or two.", 
    "review_date": "2012-10-01"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "a wet tuesday evening...days and weeks lagging...stroll from south beach to north beach...craft beers at church key...ten ounce deschutes stoic $eight...smooth fruity and easy drinking...seated downstairs at bar...sipping beers and chatting...wooden and great old school bar charm...small, but second floor available...quirky entertaining bartender...taking a fruity pursuit of happiness next for $five...taller glass and easy sweet beer....and, another....black xantus $eight the fourth beer...dark coffee flavor, but surprisingly smooth down...easy sipping beer enjoying with no aftertastes....fifth selection the speedway stout...the least favorite of the beers...dark and fruity, with a medicine aftertaste...not liking, but finishing...three seated at the bar drinking....harolds and kumar evening in north beach...", 
    "review_date": "2011-10-05"
  }, 
  "CU6B8xPsxveZueDewBECXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan H.", 
    "review_text": "I love hole in the wall type - small bars with low music and good crowds.  This bar is that, and more.  Over 100 beers available?!  Love this.  Great little spot.  I am a new fan.", 
    "review_date": "2010-02-19"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "I'm certain they call this place \"Church Key\" because it's literally access through the gate of beer heaven.   Rarely crowded, superbly staffed and wonderfully stocked, this beer bar in North Beach is THE go-to place for beer lovers who want a nice space and great prices. There's even something for cheap asses - the \"Mystery Beer,\" a $2 can of PBR or an equivalent. Yeah, it's shitty beer, but it's only $2 when some other bars charge up to $5.   Options, bitches.   For the rest of us, there's a huge menu of great brews, paired with the bartenders' great stories of beer and woe (but mostly beer).", 
    "review_date": "2012-11-08"
  }, 
  "zp3tRNqyeL7-kGDJwMkgpQ": {
    "user_rating": 5.0, 
    "user_location": "Nevada City, CA", 
    "user_name": "Michele F.", 
    "review_text": "I just got back from the Church Key, and yeah I'm a major fan.  I looooove beer, and this place has all of my favorites plus some that I have never seen before.  Tonight I had two different beers that were both fabulous and super high in alcohol content.  The first was a spiced beer called Midas Touch which I had never before seen, and the second was one of my old time favorites from Canada, La Fin du Monde.   The beers come to you in the appropriate glass for the type, which is so very cool.  Another reason why I love this place is because the menu tells you everything that you would ever need to know about the beers that they serve.  There is an alcohol content, origin, and description of flavor listed for each.  While the overwhelming amount of beers makes it hard to decide, the menu allows you to decide with some certainty that you will like it.    Besides all of the great beer that they serve, the Church Key has an ultra cool environment.  The lights are turned down low, the giant red lounge bench upstairs longs to be sat on, and the live music just makes you want to stay all night long.  When you stop by, be sure to check out the rad wallpaper when you walk in.", 
    "review_date": "2009-01-31"
  }, 
  "VIIRzZBd7bjTucH637_CcA": {
    "user_rating": 5.0, 
    "user_location": "Chico, CA", 
    "user_name": "Danielle C.", 
    "review_text": "What a great bar! Very kick back, hip, fun. Fair prices, cool people, awesome music.", 
    "review_date": "2012-10-24"
  }, 
  "i1IUqcMBd9DyEgkRoySCkQ": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Michael H.", 
    "review_text": "Four stars for the beer, unlimited stars for the bartender and the crowd.  Its a great place to drink great beer.  Placed in the old North End Cafe's spot, it has the same vibe: Like minded folks liking each other.  This is good.", 
    "review_date": "2010-02-10"
  }, 
  "tMOuv9A8TC-rvMQ5KrD3hw": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Alli Q.", 
    "review_text": "If you're a fan of beer you definitely need to stop by Church Key. It's a small but cozy spot. They have about 15 beers on tap and an extensive bottle listing - with that you're sure to find a beer that suits your taste! The bartender who was working while we were there was really helpful and knowledgeable about every single beer on tap and in bottles.  My boyfriend and I stopped by early on Saturday night (around 8pm) and were able to snag a seat at the bar. It got a lot busier later in the night. The sign for the bar is a bit ambiguous so just look out for the lit up key over the door!", 
    "review_date": "2012-09-04"
  }, 
  "dkkMQorZE0EF-F5wOiqA7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle V.", 
    "review_text": "Always fun to try somewhere new...   As soon as I arrived it cleared out, so I am not sure what that was about, I did shower. The beer was really good, flavorful and strong. It was a one and done. A nice addition to the North Beach scene, and apparently you can even grab a pie there, and the owner makes really good ones.   Had some friendly conversation with the locals.  Was a bit hard to find as there is not a specific sign that says Church Key, you just have to look at the sign with a key.", 
    "review_date": "2009-03-02"
  }, 
  "ZjBGkPbzgRfvoekv6Syw9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie F.", 
    "review_text": "My girlfriend and I went there it a place that you relax and not worry about what people our thinking, the drinks were good and the bartender is nice we were able to have a conversation without people interrupting us. So next time well bring some friends", 
    "review_date": "2011-07-27"
  }, 
  "wZG2xlICfUkJiY1NdPJH2A": {
    "user_rating": 4.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Naomi K.", 
    "review_text": "love the laid back ambiance.  Must get the Coconut Porter from Maui Brewing Co. So delicious! Definitely low key, cozy, muted, and wait... clean bathrooms! Service was excellent and beer selection perfect. Nice tunes though they should kept the live dj and dance floor upstairs. So non-North beachy... it's great! Wish I could keep this a secret", 
    "review_date": "2009-10-10"
  }, 
  "kMYBGRBSMLkkoUYeNUhcNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ivana z.", 
    "review_text": "Like this place a lot!! Unassuming and chilled, fantastic beer selection, nice bartenders, i dig it!!", 
    "review_date": "2014-12-17"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Good selection of beers.  They need to play music that won't put you to sleep.  Drinking a beer in the dark with chill music makes me want to go to sleeeeep.  Some of the beers they sell are priced like bottles of wine.  CraZy.", 
    "review_date": "2011-05-08"
  }, 
  "CfV_axQI2rK0eHB9FfG_GQ": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Cori W.", 
    "review_text": "What a great little beer bar! I really like the decor and atmosphere; since we were the first ones in at 5:15 on a Sunday we had a relaxed, friendly visit with the bartender. They have TONS of beers on their list, though don't expect them to have all of them in stock in the small beer fridges. Only gripe was that the prices of the bottles were insane in some cases. A beer you can buy at City Beer Store, Healthy Spirits or Beer Rev for $15 or so would be almost $30. Not sure why the huge mark up. Definitely stop by if La Trappist is closed and you want your Belgium fix without dealing with the bros at Rogue.", 
    "review_date": "2011-01-17"
  }, 
  "F5PeWdJZqT8BAQD7LnY6_Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Grace P.", 
    "review_text": "Pretty interesting hole in the wall type place in north beach. I work in the area and must've walked past it during the day a million times and never noticed it was bar till one night I was there late. Good beer selection, decent prices but pretty limited hours. Also the artwork upstairs made it feel a bit exorcism-y.", 
    "review_date": "2013-12-31"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Strangely I'm craving beer today (and I thought I was over beer!)... but not just any beer... Church Key beer! Uh oh! Might mean a stop-by is needed tonight...", 
    "review_date": "2009-01-23"
  }, 
  "shfhrdFn8aGgFP8dyXNyxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eater S.", 
    "review_text": "A fantastic place to explore sour beers! Intimate and pleasant decor in a fun location and the bartender was awesome - super helpful, attentive, and fun. Well, she flirted with me. I'm a sucker for that.", 
    "review_date": "2012-08-23"
  }, 
  "dVzvSnYe_pY_8GOE-QDQQQ": {
    "user_rating": 5.0, 
    "user_location": "Litchfield, CT", 
    "user_name": "Robbie F.", 
    "review_text": "Really dig this place.    Great beer on tap, with all sorts from bottles as well. Low key atmosphere and very knowledgable bartender to boot.", 
    "review_date": "2013-08-06"
  }, 
  "3t2oRnqVpvPDbFhfrKpeXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe W.", 
    "review_text": "If you want great beer in a loungey yet unpretensious space, Church Key is it! They have a big yet awesome beer slection with a helpful bartender. The bar is girl friendly especially for those just learning about beer. The only negative is that this space is a bit small and tends to get overpacked.", 
    "review_date": "2012-08-30"
  }, 
  "h0FPJR1jCDpwq0C4t8ArLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline M.", 
    "review_text": "A quiet, understated bar in the heart of North Beach. The draught beer selection is great, and the bartenders are very knowledgable about what they pour.  One of our favorite ways to drink here is ordering a sample of 5-6 beers, bartender's choice. Tastes are about $2 each, and you try some styles of beers you might not otherwise pick.", 
    "review_date": "2013-10-03"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "Clearly I have been drinking, since I have not been spending my time writing reviews. But where, you ask, and what? Oh, you didn't ask.... well I don't give a crap; I am going to tell you anyhow.   I have been drinking beer that tastes like cocoa butter slathered on some hot body on a warm day, and I have been drinking it at Church Key, because they are the only place I have been in SF that serves a beer with this distinct flavor.   They have a lot of other delicious unique beers as well, in a cool, cozy, faux brick, hip, framed bugs on the wall and fancy lighting fixtures to compliment the tattoos of the bartender type of way (you know the type, right?). They also have a dark upstairs loft where you can probably get away with licking any beer off any body, but that is up to you.", 
    "review_date": "2009-07-15"
  }, 
  "YlJNqoHqIssCHP25h2sUFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie N.", 
    "review_text": "Feeling the need to update my Church Key review.  It definitely wasn't fair to base it on one night, especially on a busy night.  I've been here a few times since then and I find that it's best when it's not crowded (ie don't go on a Friday or Saturday night) and you can sit and relax with a good beer and good friends.  Their selection of beer is pretty great, with several on tap and even more in bottles (or cans as we found tonight, thank you Oskar Blues Old Chub).  The crowd on quiet nights is usually pretty mellow which is what I love about this place.  They play music on an old record player which has charm and isn't too loud so you can still have conversations.  That being said I'll still stand by some of my earlier review.  I do remember it getting rather hot upstairs when it's crowded so just be prepared for that if you go on a night that it is.", 
    "review_date": "2009-11-22"
  }, 
  "H_DAhIymP_8kpu1kw07Xtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina L.", 
    "review_text": "solid little beer bar in the heart of north beach! there's one bartender manning all the guests. we grabbed two seats at the bar on a recent friday night, it was pretty quiet because it was early, but the bar was fullll. all drafts are $7, and there's a good rotating selection. i was stuckkkk on the christmas bomb! it was so nomsies, lots of layers of flavors - at about 9% ABV, it is served in an 8 ounce pour.   we went a few rounds, checked out the bottles llst, which is in the form of a small binder, but i'd stick with the drafts. cheaper and fresher and in season! the best part is you can buy a beer for someone  as indicated on the chalkboard behind the bar - for example, james from london bought a drink for the next english guy. pretty nice!", 
    "review_date": "2014-12-22"
  }, 
  "qyPIxexV1Bi0W8Nm11F2CQ": {
    "user_rating": 1.0, 
    "user_location": "Laurel Heights, San Francisco, CA", 
    "user_name": "Leslie M.", 
    "review_text": "Stay away...there are better bars in the area! Overpriced,dirty, horrible drinks and rude staff -those are my only impressions of this place!", 
    "review_date": "2013-10-16"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Nice little beer bar!  Great selection, nice staff and a clean place.  Since it's small I'll assume I should avoid it during the usual high traffic times, but on a Sunday afternoon it fit the bill.  I watched Kia B. have a beer revelation here.  It was quite a sight to behold.", 
    "review_date": "2009-10-19"
  }, 
  "tZ7guKlHjEg0ZhBHt6fCyg": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Frank D.", 
    "review_text": "Killer beer selection, great vibe, nice music.", 
    "review_date": "2009-11-22"
  }, 
  "FuQEA599CgkRu2QZ70TkgA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha R.", 
    "review_text": "Alright, as far as chill spots around North Beach, this and La Trappe are my GO-TOs for beer.  Church Key has a great selection as well as solid prices that both Nifty Thrifties and Baller Shot Callers can appreciate. The place has a lot of character, and its a dive bar you can be proud to frequent. For newbies, it can be hard to find--especially for those of you who are bad at wheres waldo. Look for the closet sized store front on convoluted Grant St with a key over the door, thats it.  This one lacks seating though, and gets really crowded Fri-Sat. Come early to chill out, or maybe at night to stand around and listen to someone spin.", 
    "review_date": "2010-08-12"
  }, 
  "YC4xH6hxgAQks-ngsr_Whg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "She-Ra ..", 
    "review_text": "A tiny little gem in the heart of North Beach that appears to cater exclusively towards locals.  Grab a seat at the bar, be overwhelmed by the huge selection of beers, poll the bartenders and your fellow barflies on what you should order and then presto!  A lovely beer and conversation.  I walked out wanting to check out all of the great sounding places that were recommended to me.  As for the beer selection, you won't find Bud, Guinness, Sierra or any of the other regular suspects.  Think Toranado, but cleaner.", 
    "review_date": "2011-02-27"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Simple bar place that offers more room upstairs!  They only serve beer and the ambiance to this place is very low key!    I dropped in on this place one evening and in seconds, there were many cop cars that surrounded this place!  Some sort of drug dealer was caught right in front of this dive bar!  Nonetheless, enjoyable place for drinks and chit chatter!", 
    "review_date": "2013-07-15"
  }, 
  "h_ewbDmZ3M3Z2QfyAqm24w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mahsa K.", 
    "review_text": "Was looking for a nice low-key hang out spot in North Beach on a Wednesday night and was shamelessly drawn by the 2 for 1 sausage special. Loved the vibe, small local feel, chill music that was not too loud to have a good convo with friends. The 10+ page beer menu is amazing and meticulously (yet not annoyingly) detailed.. Ordered: Duchess de Bourgogne- sour, fruity, red-ale style beer, yumm!! La Caracole Saxol- smooth blonde ale, sweet malt with a touch of spice, also recommended Wild Game sausages- I tried the boar and rabbit, came served with a slice of sourdough bread and sauerkraut, good stuff when paired with your beers.. Unfortunately wasn't able to spend enough time here given its early closing on that night so will hopefully be back, maybe on a weekend next time, to try out some more beers from their extensive menu!", 
    "review_date": "2011-01-25"
  }, 
  "DYhdsxqPPUhpZfwILtlo1g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert S.", 
    "review_text": "Beer me!   I do like this place. They have a great beer selection, scratch that, they have an amazing beer selection!  The bartender is helpful at getting  you a beer that you would like and appreciate.  I love how they list percentages of alcohol so you can maximize your drink to drunk ratio.  My only problem is SOMETIMES this place can be dead.  The last thing I want to do is sit in a bar all by myslelf drinking exotic beers.  That has alcoholic written all over it.", 
    "review_date": "2011-04-06"
  }, 
  "aZSVgQ9neOltdxViIwSzTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frankie S.", 
    "review_text": "What is up with the bartender Ben's snarky and cocky attitude.  It doesn't get the ladies and it also doesn't get return customers.  However, as a local in North Beach, I can't help but choose this bar as my go to place, with an ever changing beer list that intrigues and tantalizes, as well as some pretty awesome records blaring overhead.", 
    "review_date": "2009-09-27"
  }, 
  "ztd0ck9f5dCQK322QuiZHg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate P.", 
    "review_text": "Service was very poor. Place was dead. Small. Shabby. Good beer selection is their saving grace. They had a rare German bier that was from my date's little village in Bavaria. So that should have scored me points but I can't be sure because it's just all so ambiguous. Anyways probably wouldn't return.", 
    "review_date": "2009-07-03"
  }, 
  "2--3--v8yHU3a3FljCcBRg": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "William S.", 
    "review_text": "AWESOME bar in North Beach with a GREAT beer selection.  Their beer list boasts Allagash Curieux, Dogfish's 90-minute IPA, Stone's Double Bastard, and Young's Oatmeal Stout.  Yes this place has something for everyone.. as long as you're a beer enthusiast.  Otherwise, you can get the *American Mystery Beer* which is just a bottle of America's finest, meaning it could be Mickey's, Natty light, or if you're lucky, the champagne of beers.    Other than the beer selection this place is just chill, nice calm atmosphere, cool bartenders, and just a great place to sip on an awesome beer and hang out.  Go to golden boy after to sober up.", 
    "review_date": "2010-02-28"
  }, 
  "0M6iVk5VtlS9wk45FfPvZw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jake H.", 
    "review_text": "I stopped in for a beer on my way back from the butcher.   -a very loungy feel...complete with funk, jazz, dub music and Harry Conrick Jr. with a forehead scar tending a bar of expensive, but good, beer.   When I went (6ish), I was literally the only person there, so I can't comment on the crowd. Small place on a narrow strip of grant st, which looks great. -But you might have to wade through dawdling tourists. The decor is something of the, cigar room+12yro's tree house+mod touches. I liked it.   Beer and wine only. They have a large and diverse beer selection. Personally, I was hoping it'd be more extensive...a collection! The list has 50-75 beers. I had a good Saison (Belgian farmhouse style ale) that was on tap for $6.   On the other side of Columbus in North Beach is kinda far...and remember, there is absolutely no parking.   I'll be back to try a new beer soon.", 
    "review_date": "2009-06-11"
  }, 
  "0pElQxebrLfIezkediVQVQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy E.", 
    "review_text": "I gotta say that Jason has succeeded again. His other bar, the Broken Record, became one of SF's  best scotch bars within a year or two. Now he's moving on to beer and from the looks of it on my visits, he's succeeding again.   While I usually prefer bars with some liquor, it never actually crosses my mind when I'm at the Church Key. There is such a ridiculous range of tastes that you get a bit obsessed with finding your next brew. Seriously, some of the beers here really change the way you think about how a beer should taste.   The best thing though, and this holds for the Broken Record when it comes to buying scotch, is that Jason is super helpful when it comes to making your choice. He doesn't make you feel like an idiot for asking questions and seems to make it his mission to find you a beer you'll like. Just give him a vague idea of stuff you like and he'll hook you up. I definitely recommend this place if you're in North Beach and want to hang out in a chill place free of the normal douchiness of North Beach.", 
    "review_date": "2009-01-11"
  }, 
  "jy_RGAeAvNeCv5BxZsUWFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom R.", 
    "review_text": "I'm not a very well followed yelper. I've deduced from my FUC's that there are between 10 and 20 people reading my stuff on yelp. I believe that among the few people reading my reviews there are some really influential yelpers and maybe that makes me influential in a way.   I've noticed that once I give certain places a good review within two months the place is packed. Am I the fountain head or part of the water, part of the process? Am I just at the front of the wave?  I loved The Church key, unequivocally!   There is only a key for a sign and it's the easiest place in the world to miss. I was looking right at it and still didn't see it until I checked a piece of paper that I wrote the address on.   They have an excellent selection of beers without the pretense of La Trappe or Monks kettle. I had the quadrupple at 11% ABV and enjoyed the hell out of it. This is my new favorite place in North Beach.", 
    "review_date": "2009-03-22"
  }, 
  "XN7gmypk2antDlllPKFgxQ": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Victor C.", 
    "review_text": "Vic + Good Beer = Happy Vic  I'm by no means a beer snob, if such a thing exists... but good beer always brings a smile to my face.  We came one a random weeknight (either Wed/Thur). Not many people here... which wasn't bad thing at all. I forget which beers I had... but they were both delicious.  Definitely a place I want to go back.", 
    "review_date": "2009-03-03"
  }, 
  "IC8jJYeX3fzzogfP1VwbJQ": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Phillip Z.", 
    "review_text": "Great (but only if you like drinking beer to feel a little bit like homework).", 
    "review_date": "2010-06-26"
  }, 
  "DzjvkZwIEeIVL0lIRSKEtw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Nick S.", 
    "review_text": "I was in North Beach, which is where I am most rarely, and a friend took me here. Said they've got really good beers, which is what I'm into if I'm not at a bar solely to see if I can talk to pretty girls without being awkward. I must say that I was impressed, and as my football coach in high school used to say, \"It's the little things that count, Nick. It's the little things. You gotta wake up early in the morning, get a banana in your belly, you know, get your potassium, and do a lap or two, get a good stretch on. . . .\" shit, I'm rambling again, aren't I? So yeah, the little things make this place fucking charming. The wallpaper is demons. They've got a beer that tastes like smoked meat. The people are classy and approachable. The bathroom flush doesn't scare me like the one at every Starbucks in the world. And I believe there are at least 5 beers on the menu with an alcohol percentage over 10%, and they taste GOOD! I will go there again. Oh yes, I will.", 
    "review_date": "2009-01-29"
  }, 
  "AsjL5K34C7QgXiT3rCN_9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moe J.", 
    "review_text": "Excellent addition to North Beach!  Solid Beers and great low key atmosphere.  Tucked away on Grant Street, this place is my favorite low key spot to have a great craft beer and relax in North Beach.   Solid music - via Ipod to set for a great relaxing vibe.    Will be back for sure.", 
    "review_date": "2009-12-14"
  }, 
  "DpkpCFdMKYSJAYAPtkvq_g": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jeremy H.", 
    "review_text": "My brief was to find a nice, quiet bar that wasn't too expensive. So I go to Yelp and look for lounges $-$$. Ooooh, Church Key has only been open for a month and has 5 stars. I felt very trendy in suggesting such a new hotspot :)  I like the way the bar was on the quietest block of North Beach and denoted by a simple church key sign. The barman was friendly and knowledgeable about the eclectic beer selection. It had a cool vibe, definitely a place to have a quiet conversation with friends or perhaps go on a date.  I would say that the selection is not necessarily any better than La Trappe and Monk's Kettle, and certainly Toronado has more beers on tap.   In addition, they had the door open all night and it was FREEZING!  Overall though, a good place to drink some interesting beer and have a quiet night. If you want somewhere a bit more lively, I would go to Monk's Kettle or Toronado.", 
    "review_date": "2009-01-03"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "What an improvement from the old Magnet!  First of all, it's no longer empty all the time.  Secondly, it's no longer too dark.  It's perfectly lit for a bar/lounge.  Thirdly, there's no incense burning.  Also, no funky white cloths on tables!  Let's just fast forward...it's so much better and interesting, seriously!  The vibe is cool, friendly and relaxing.  We were greeted by the bartender (one of the owners name Jason?) as soon as we walked up to the bar.  He even moved someone's top away from the counter to get us seats.  He then asked if we've been in and went on to tell us about the place, gave us the menu.  I asked about the food and he apologized because they were all out for the night - someone just ordered the last duck confit meat pie. DAMN!    He told us to ask if we had any questions or if we wanted to have a taste on any of the drafts.  I tried the 90 minute IPA and liked it.  Hubby tried Oaksted (sp?) Bastard and liked his.  A regular, Don (maybe another part owner?) was very friendly.  He is a distributor and has a couple of the wines served there.  He even offered us a taste of his bottle of Black Orchard, a champagne like beer - maybe a nice start for any ladies who are not into beer.  It was really a nice evening enjoying good beer and chatting away with other patrons.  To end the evening, we both tried a lighter beer in bottle.  Hubby had something from Germany and I forgot what I had but I picked it because the description says very carbonated.    If you enjoy beer, you need to check out this place.  It has 8 drafts and about 50 varieties in bottles or cans from 12 oz. to 24 oz from $5-$20+ all around the world.  Yes, plenty with high alcohol content so drink accordingly.  They do have a one page wine list including Sofia sparkling wine.  Both the menus, yes even the beer menu, has a simple description of the flavor.    We also met another patron who happens to be a neighbor across the street!  This maybe the best beer pub in North Beach.", 
    "review_date": "2009-01-30"
  }, 
  "aNKbZV7sTLqeZau7hf7fJQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yowz A.", 
    "review_text": "Great selection of obscure, high-end beers, staffed by friendly and knowledgeable bartenders. This place leaves the ridiculously over-rated Toronado in the dust.", 
    "review_date": "2012-05-31"
  }, 
  "1T3wowEMmP3U1K3RRdI61g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynn C.", 
    "review_text": "Really love this place. Of course for some reason by the time I get there I am usually already two sheets to the wind and upon leaving am officially three sheets.   New goal for this weekend, start at Church Key, end the night elsewhere. haha.", 
    "review_date": "2009-10-28"
  }, 
  "T1upaPMzuW7pNj74fO1rjA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Shachi B.", 
    "review_text": "I found Church Key through <a href=\"/redir?url=http%3A%2F%2FThrillist.com&amp;s=2318db7cc9d2a933066949f28dc05a7139148ba530a91c0fa15454d6d09279f9\" rel=\"nofollow\" target=\"_blank\">Thrillist.com</a> (*waves* Thanks Thrillist!) earlier this year and was pleasantly surprised.  The interior is a little sparse, but the beer selection is solid. The bartender is very helpful in helping you choose, which is a plus since I could go nuts trying to pick.   The only downside is that some of the beers are really expensive (25 dollars for a beer? No thanks!) and the music could use an upgrade.", 
    "review_date": "2009-11-18"
  }, 
  "gfyW0vuJls8ARoHmogfcmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marilyn T.", 
    "review_text": "Super low key place where you can just chill with your friends without going deaf or being crowded.   They have music (kind of a random variety of stuff plays throughout the night) comfortable seating, and it's spacious.    The bar has a huge selection of beers on tap, including pomegranate beer, a fruit cider that wasn't overly sweet, a smoky beer that was reminiscent of beef jerky....  And they also have melt-in-your-mouth fried pork rinds for purchase  No cover, and it's totally unpretentious.  Only downside - they close at 12am :(", 
    "review_date": "2011-05-28"
  }, 
  "ooU_nkSOHtcMdlRdvPHDTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza Z.", 
    "review_text": "The Church Key is hands down my favorite bar. You can barely notice it from the street (luckily it's not on Columbus) so only people who know what awaits them inside come in. This is definitely one of those places you don't want tons of people to know about but it's so fucking awesome it's hard not to want to tell everyone!! Absolutely phenomenal selections of beer. Well done!!", 
    "review_date": "2011-03-27"
  }, 
  "4mzGeIRXTrzC85xjYqYGSw": {
    "user_rating": 1.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Mike J.", 
    "review_text": "This place is run by jerks.  Always \"closed\"!", 
    "review_date": "2013-06-25"
  }, 
  "DZnK4o2UmAidIf_1_eSEqw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Christiana V.", 
    "review_text": "My boyfriend and I stumbled across this bar randomly on NYE 2013 and are so happy we did!  The place is small and unassuming but the beer list sure is not.  We came to SF at the last minute for a trip and did not have any plans in place, which is how we ended up in this awesome little place.  The bartender was super informative and (somewhat surprisingly) a great mc and dj.  I would absolutely return to this bar the next time I am in SF.", 
    "review_date": "2014-03-02"
  }, 
  "Ln0Q0eO_GQ8A8-zu8d_7Pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cristina C.", 
    "review_text": "Beware if you have a large group. This place is super tiny, composed of only a small bottom floor and an upstairs loft area. I was trampled on many times and heard others grunting under their breath that the place was too small. I do like the fact that they have 50 beers to choose from and their wine list is not bad, with reasonable prices for a decent glass of wine. The only problem I had was that I ordered a glass of white wine, which smelled really, really bad. I do give them four stars however, because upon me complaining the bartender agreed that the glass of wine smelled in his words \"like a wet dog\" and proceeded to open a new bottle for me and pour me another glass without hesitation. That is good service.", 
    "review_date": "2009-01-11"
  }, 
  "qdssYyyQfBJPjIUMEGTykQ": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Michelle W.", 
    "review_text": "great ambiance. great beers. great location.  this place is un poco pricey though.  for distinguished taste buds only, otherwise you blow a hole through you're wallet not drinking bud light.", 
    "review_date": "2009-04-12"
  }, 
  "D7muLs_6RcKH97S6fu5zmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel H.", 
    "review_text": "Update to my previous review: last night, as he helped a fellow patron navigate the beer menu, the bartender referred to the Church Key as a \"professionals' only bar.\"  It was awesome.", 
    "review_date": "2011-05-25"
  }, 
  "WnK7DqYVUrYb7xZFx0k69Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suzanne J.", 
    "review_text": "I was here on an early friday evening.  It wasn't crowded at all and had a cool atmosphere that was good for just chillen and drinking a really good beer.", 
    "review_date": "2010-10-16"
  }, 
  "eZB9uAnb3CYI4AYYzl5F-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zachery H.", 
    "review_text": "Went to Church Key on a Friday night and I had a good experience. It was Super busy and packed so standing may be the only option for you. The selection is better than most bars and they carry about 8 different taps and the rest bottles. The bartender was a bartender, no complaints. A friend of mine even got the end of a keg and wasn't charged for it. I've been to bars that just throw it away. The only thing I wish it had was more space. One of the more interesting things to see was a sign that said \"Pliny free since 2008\". I like Pliny and Russian River, but I respect their open opinion. I'm more of a empty bar kind of guy instead of a crowded one so ill be back on a weekday.", 
    "review_date": "2012-02-05"
  }, 
  "82dCHyU-ANOgdhxUgZsUeg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marlon T.", 
    "review_text": "It's a small bar that serves some nice microbrews you won't find at every bar.  Aside from that, when I came, there was a stand-up comedy group going on upstairs so I couldn't not go there and listen in. This is the second time in my life I was at a bar/cafe and a random stand-up comedy group was meeting up to provide a space to practice their material. I had a good Belgian beer in chalet, had a few laughs, then left to my next North Beach bar.  I would rank this spot high on anyone's North Beach bar hopping list. Be sure to include 15 Romolo as well.", 
    "review_date": "2013-07-23"
  }, 
  "onMQq3O_OWqv6JqajDOu3g": {
    "user_rating": 5.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Scott R.", 
    "review_text": "at the corner of an alley in north beach. good music, good beer. really good beer. but you kinda have to know your beer bc they will have some pretty rare stuff. otherwise, you're gonna be paying top dollar for something you might not totally like.", 
    "review_date": "2011-01-25"
  }, 
  "oeSP4tyY8VKMW-ndSMVv1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kameron K.", 
    "review_text": "This place was actually pretty cool.  I had passed by it many times without even noticing it.  The drinks were reasonably priced and there was a large selection of beer/wine to choose from.  Only downside was the lack of seating when we went on a thursday night so probably don't suggest going with a group.  I only noticed a couple of tables that could seat more than 2.  If you like beer and want to try something new, Church key has got a large selection to choose from beers all around the world.", 
    "review_date": "2009-08-07"
  }, 
  "dEl_kFfpApgY-zXjAA9Kvg": {
    "user_rating": 4.0, 
    "user_location": "Lomita, CA", 
    "user_name": "Andy D.", 
    "review_text": "Pretty cool little spot in North Beach.  I'm an out of town'er, and we happened upon this place after SF Beer Fest. Decent tap selection and slightly better bottle list. I enjoyed having Cuvee des Jacobins Rogue, as it's one of my go to sours. Pricing is not too bad either.   My friend ordered Firestone 14th anniversary, but the bartender couldn't find it. I would've loved to try that!  -1 star for closing at 12AM.", 
    "review_date": "2012-04-30"
  }, 
  "gC9syNZtvy4iYv4zftxzJw": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Rebecca D.", 
    "review_text": "I went to Church Key on a Sunday, because I was visiting for Labor Day weekend. My friends who live on Lombard Street walked me there - I guess it's their local hangout spot. And rightly so! Church Key's atmosphere is something I can't quite put into words yet (it felt oddly nostalgic), but I will say this: Patronizing that bar is one of about three reasons why I've decided to move to San Francisco. As I was sitting on the stool, I looked over at my friends and said, \"Oh my god. I think I'm going to move here.\" The lady bartender I encountered was rough around the edges (maybe a bit too rough), but I have to give it to her on the music selection. She was rocking Refused and some other really great bands, so I'll take a few death stares for that. Also, I think she was displeased with mine and my friend's request to drink coffee. She obliged us, despite her obvious annoyance at the request. C'est la vie, especially because our other friends were drinking. Honestly though . . . one of THE best times I've had at a bar without drinking booze. That's gotta be a world record or something! I'll definitely be there often when I move up.", 
    "review_date": "2012-09-07"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "Such a small place but Church Key holds a lot of character.  The selection of beer here is like nothing I've seen in San Francisco.  There literally are pages of beers that they have available from all over the world.  Our bartender wasn't too responsive or on his game but it might have been the owner who had a lot of knowledge about beers and gave some good advice.  The beers are a little expensive but you expect that in coming to a place like this.", 
    "review_date": "2009-02-21"
  }, 
  "bg0UwYapIKm6-bFkuaGEMg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John M.", 
    "review_text": "Fantastic beers and great music intermittently on vinyl.  What could be better?", 
    "review_date": "2010-09-23"
  }, 
  "u6ms8jCUMd3qhlB6hufV-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly C.", 
    "review_text": "This place is one of the best additions to North Beach in a while.   I can't remember the last time I was really impressed by a new beer. I felt that way about every one I had at Church Key. They've got a ton of beers from Belgium to Canada with descriptions ones you would expect on a wine list. I chose an awesome Canadian beer with hints of hibiscus and pear. It was surprisingly tart, and I was really charmed by the Victorian-goth label. Dorky, I know. I also had a great thick stout that could have doubled for dinner.   The owner (I think his name is Jason?) will spend a long time chatting with you about the beers he stocks and the work he has put in the bar renovations. It takes about 15 seconds to realize that he has poured his heart and soul in this place. He also knows his beers like nobody's business and will admit  he likes the hibiscus and pear beer. Nothin wrong with that.", 
    "review_date": "2009-01-22"
  }, 
  "8KnhKUEcOmLlpsoBGYUdzA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah A.", 
    "review_text": "This place is bar none my favorite in town.  My husband and I have started brewing our own beer, and with that, have expanded our tastes beyond even the Belgian variety, which I must say is a big deal for me, as I have spent the majority of my life sucking down bourbon.  (I am from KY)  We came here for the first time about a month ago and were able to sit at the bar and chat with the main bartendress, Kat, who is super nice and sweet.  The second time we actually met the bartender and his lady, and both are not only non-pretentious, but also extremely educated about their selections.  I might add that the wallpaper in this place is the tits.  We hit Church Key up this past Saturday for some post-SF Beer Week fun and were a tad shithoused by the end of Round 1.  My husband was so affected by the camaraderie on display here, that well into the evening, he decided to announce his run for Mayor of San Francisco.  The bartender, Ben, was quite nice to my husband, under the circumstances, which also gives Church Key a huge thumbs-up, in my book.  Some of the selections I count among my favorites include Dogfish Head's Midas Touch and the Allagash.  The taps are switched out periodically, so you can sample a variety of the bests every few weeks or so.    One thing I would LOVE for them to add is Russian River Ales, such as Temptation and Sanctification.  These folks got an A- in Beer Advocate.", 
    "review_date": "2009-02-09"
  }, 
  "m8nQ9i-Peo5zfZqfnc7LuA": {
    "user_rating": 5.0, 
    "user_location": "Cranston, RI", 
    "user_name": "Cara I.", 
    "review_text": "Came here with my husband during our California honeymoon beer trip. Cool little spot. Very chill vibe. The beer selection was outstanding. Kind of small but they do have an upstairs. After walking up and down hills all day in SF it was nice to be able to just hang up there and have a beer.", 
    "review_date": "2013-09-03"
  }, 
  "XLxgaY6X64BRVF25aqDmXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eliza S.", 
    "review_text": "Oh how I love this place, at least in the very early evening. It has fueled recent cravings for beer, when in normal times I would just drink wine or a cocktail. I wish it opened around 3 in the afternoon, rather than at 5, for I, oddly enough, concentrate (on work, study, or reading) so well there. At Church Key, mysteriously to this neophyte, the beer remains delicious with microbubbles even after an entire hour (I limit myself to one, so try to make it last). When the bartender plays great music, not too harsh, I'm happy, and feel like I'm in Berlin or NY, but for that I had to wait until 5 to visit.", 
    "review_date": "2010-03-26"
  }, 
  "0t-O5--DOfS55A620fO_GA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea H.", 
    "review_text": "Look for the picture of an old church key-- there is no name, sign, or verbiage calling out this location!    I like taking my beer snob friends here because of the very impressive menu.  So far all of them have been nothing short of VERY impressed.    The bartender is friendly and approachable.  She is always very happy to please and always willing to give patrons a small sample before they commit to an entire glass of beer.    The crowd here is very interesting-- it's an eclectic mix of artists, townies, hipsters, ....pretty much anyone!  The music played is also a crazy mix.    My most recent visit on a Friday night featured a young photographer/artist.  Her beautiful fantasy photos hung on the wall and were very reasonably priced!  Many bar patrons purchased her work. She spoke to the entire bar just before last call and added a really cool personal touch to the experience.    Church Key closes early (midnight on weekends I believe), so make this an earlier stop rather than later.", 
    "review_date": "2014-08-14"
  }, 
  "txvgzVJIv7kyHNnyZWUFDA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cristofer P.", 
    "review_text": "Lots of Belgium beers and a good vibe on the weekends. I wish more of the beers were on tap instead of bottled. I went on a Saturday night and the place felt a bit cramped and the service was whatevers.", 
    "review_date": "2009-02-26"
  }, 
  "AqBNpXElwesY8zwGXQ2xbA": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "John D.", 
    "review_text": "This place is a snooze fest. Its generally empty and the beer they serve are micro brews, most I haven't heard of (which is both a good and bad thing). I've been to better!", 
    "review_date": "2013-08-14"
  }, 
  "bLJIo69bG7osEyXxCPSewA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "elmer d.", 
    "review_text": "no cocktails @ this place people....jus wine &amp; beer beer beer....wouldnt have discovered this hidden gem if it werent for parking in front lol....only sign this place has is a key light above the entrance....they were playin MJ records on the old school record player....selection of belgium beer  off tap was good~had the stout stuff....make a stop over here when in the beach", 
    "review_date": "2009-06-27"
  }, 
  "H0DVR43Q_a-0qKJChBxQAQ": {
    "user_rating": 5.0, 
    "user_location": "Acton, CA", 
    "user_name": "Megan G.", 
    "review_text": "This placed opened just a few months before I moved away from San Francisco, and I loved it. The atmosphere is kind of quiet, dark and moody, but gets louder as the night goes on and more people come in. They have an impressive selection of craft-beers at a very reasonable price, and a very knowledgeable bar staff that can make great suggestions should you want to try something new. It was Church Key that turned me on to my current favorite - Allagash Curieux.  I've taken a group of people from work to hang out in the loft upstairs, had a date at the bar, met girlfriends for drinks, and I've even been by myself for a quick relaxing beer at this place, and everyone has loved it just as much as me.", 
    "review_date": "2010-01-17"
  }, 
  "PEizYQ4dkrdmXjfQpxGj7A": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Steve N.", 
    "review_text": "I live on Telegraph Hill, so having the fantastic beers, nice friendly crowd &amp; warm ambiance at Church Key just around the corner has made this neighborhood WAY cooler.   Good luck Jason and Team in getting the LCB to extend your license past 12, I know it's really disappointing to have to ease a happy, post-multiple-8% beers crowd out the door before the witching hour.  Besides the staff, who are always great, I love: 1) the crowd - it's totally diverse &amp; super-friendly and I meet new interesting people every night I'm there. It's not too noisy, too small to get really crowded (I'm slightly claustrophobic). I especially love meeting the traveling beer nuts from all over who have heard through the grapevine that this is THE place to hit when in SF.  I've never seen one disappointed.  2) the beer! This is really a great place to push your tastes in beer well past your comfort level and discover flavors you didn't know you loved. If you know a brand of beer that you do like, don't go for it again, ask for something similar but with a different taste.  You may not love everything, but you'll definitely find some completely new types that you will. I've tasted my way into some weird corners of the beer world here, and grown to really love the diversity of the Lambic/Sours/Brett family.  3) the meat pies &amp; the wild game sausage (gator, pheasant, venison, and rabbit ATM, sometimes boar).  If you get a chance to catch them when they're doing the food pairing nights, that's a don't-miss.  last time it was 3 courses - cheeses, salumis, and chocolates, and it was *fantastic*.   This place is good for groups, but either a) early, so you can claim the upstairs lounge or b) small - less than 5 people.  Churchkey is great especially with small landing parties of 3 or so.", 
    "review_date": "2010-06-13"
  }, 
  "OVVPi514igEwIXKRI8aCrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donna M.", 
    "review_text": "3 words: apple beer YUM! :)  I'm not a beer lover but this place could possibly turn me into one. It's a small space but didn't get too crowded for a Saturday night.   They have a large selection of beers so if you're ever feeling adventurous, they have a beer to fit whatever mood you're in. Friendly service. The place attracts a diverse, friendly crowd.  Tip about driving there, DON'T. North Beach is known for having horrendous parking especially on a weekend night.", 
    "review_date": "2010-11-26"
  }, 
  "UzxCvpCQDdoDwPomXHMUgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jared L.", 
    "review_text": "This is a neat place and you can tell it's going to come along nicely.  And what I mean by that is, the atmosphere is still in its infancy.  Which is fun because you can go witness it grow.    I didn't get to stay long but I did get to sample several fine beers (Allagash and Oak Bastard) and check the place out.  I liked the upstairs loft although some found it too hot and stuffy.  Needs more furniture and a fan up there, we all agreed.  It's very dark inside, but that gives the place a nice conspiratorial, speakeasy vibe.  The staff were welcoming and helpful, especially for a bar with many Belgian-style beers.  And the bouncer/hostess lady is hot (in addition to  friendly and helpful)!", 
    "review_date": "2009-01-20"
  }, 
  "k3UDoJwjBIWE9WFSoourvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Timothy S.", 
    "review_text": "For those of you Belgium beer lover who miss, or maybe don't remember the Belgium pubs crawl on your last trip over the pond, this is the place!   Word of advice, don't go into this place and order a Sierra Nevada, the bartender just might kick you out. Not that he hates Sierra Nevada, it's just this place works hard to maintain an extensive 8-10 page menu of beer from all corners of the world.  Can't decide what you want? Tell the bartender what kind of beers you like and he'll find something that suits you needs. You won't be disappointed in his recommendations.", 
    "review_date": "2010-12-13"
  }, 
  "zGOXKICJ-X6tcoIHaGaITg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kia B.", 
    "review_text": "We like to stroll leisurely through Sf on sundays.  A few weekends ago we ended up in Northbeach.  \"OOOOh\"! I exclaimed, we have to try Church Key.  Laid back and cool, and located in the old magnet space.  After flipping through a 10 page extensive list of brews I chose mine.  And it was in a can!  :/  The CocoNut Porter from Maui Brewing.  Be warned, this is very sweet robust porter.  Described as being 'brewed with six varieties of malted barley,  hops and hand-toasted coconut'.  I am in love. . .   Insider Info: Mr. V also found out that this is carried at Bev-Mo  and grabbed me a four pack. . . . .", 
    "review_date": "2009-10-28"
  }, 
  "DI7mg1oQHeUApMm-9Y-BGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "b s.", 
    "review_text": "As a patron of the city beer store, I was a bit sad when I moved across town. No longer. This place has great selection, friendly people, and you can bring your own records. Can't beat it with a stick.", 
    "review_date": "2009-07-22"
  }, 
  "vRVyOzmEKGOxMFkJI_-XKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron F.", 
    "review_text": "A friend's recommendation led me here on a Thursday night recently. I had just finished dinner at Sushi on North Beach and we were seeking a place where we could chill out and have a beer. The first thing you notice is Jason the bartender, who is as jovial a host as you can have. Beyond that, it's clear he takes great pride in the variety of the beer menu - a menu which changes virtually every week. And that includes what's on tap.   Try the Aventinus for notes of \"caramelized banana\" - a tasty and smooth beer that is a bit strong (8%) but worth every penny. I also tried a 14% malt liquor beer that was a bit heavy called samichlaus. I can't wait for food to be included cause I'm DEFINITELY coming back here!", 
    "review_date": "2009-01-31"
  }, 
  "yXlI99c98ruR5ZRDGIUNsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric P.", 
    "review_text": "Good beer selection, knowledgable bartenders. Pretty chill spot, sometimes has a DJ spinning, yet not too loud to have a conversation.", 
    "review_date": "2014-03-07"
  }, 
  "94f2JzIeAO4RtU5SOjtpGg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathaniel G.", 
    "review_text": "Had a small group of people, maybe 6, meet up at Church Key several months back on a Thursday or Friday night. I get that Church Key might not be the best place for a meet up but we started pretty early.  The folks meeting me there are more typical of pac heights, marina and snob hill crowd. Prime real estate for the ridicule of the edgy bar tender. My friends were spending a lot of money and being respectful. The issue the bar tender seemed to have was that we were crowding the bar toward the bathroom as that's where I had been sitting and my friends joined me. Rather than ask us to move or try to accommodate us with another space he went on with passive aggressive actions and commentary. He barged his way through us with glasses several times, mocked the group in front of his regular patrons and gave some folks who were asking for a recommendation the worst tasting beer on their menu. My friends came to me and said \"taste this beer it's what the bar tender suggest...it was like $9 and tasted like it was infected. Way to communicate, barman. Way to be a professional. It's your bar space---Manage it. You certainly didn't refuse the money pouring into your till or tips in your jar. But that's not what it's about right? It's about holding onto this one little place that allows you to continue to believe that you are better than everyone else. This is SF....it's chill and people bar hop on weekends keeping your job in demand and your pocket lined. Don't be a dick.", 
    "review_date": "2012-07-08"
  }, 
  "ZS_SiPpiLocKfYNjRZTeww": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Taylor O.", 
    "review_text": "Church Key: your beer selection, atmosphere and patrons are right up my alley but i'm gluten-intolerant and you're a**holes for only having one self-admittedly bad white wine and a cider that is less dry cider and much more alco-pop.  Just give me one decent alternative and I'd be there all the time bringing friends who'd love it.", 
    "review_date": "2011-06-15"
  }, 
  "HF4y2SSKPb80TWjECxCcRA": {
    "user_rating": 1.0, 
    "user_location": "Half Moon Bay, CA", 
    "user_name": "Sebastian E.", 
    "review_text": "Nice bar, please fire the old grumpy woman that plays the bartender!  Seriously, I have never left a negative review on yelp so far. But the lady that is running the bar at some nights is literally doing financial damage to this place.   Had a bunch of customers leaving the place last time cussing what is wrong with her and did not understand what they meant. Now I do. She was rude to a degree where I left my beer untouched, paid and left. While I walked out the door she yelled after me and my girlfriend! Needless to say I did not leave any tip...  Please get rid of her if you want your customers back.", 
    "review_date": "2013-10-15"
  }, 
  "JdYG-9VhkFs6IEyc1ea9fA": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Andrew H.", 
    "review_text": "This is my favorite bar in San Francisco.  Now, let's get one thing straight: don't like beer?  Don't go to Church Key.  There are half a dozen not too shabby wines available, but you come here for beer.  That's OK, though, because the beer is amazing.  They have eight or so brews on tap, and at least thirty or forty more bottled from all around the world.  The list changes somewhat every two weeks or so, and covers more styles than I even knew existed.  The menus give great descriptions and inform your choices, the bartenders are knowledgeable, friendly, and funny (with great tattoos!) and the ambiance is great (if you like dark cozy places.)  Hipsterish, but otherwise awesome.  Oh, and try the Mephistopheles Stout.  But don't have two.  :)", 
    "review_date": "2009-08-30"
  }, 
  "uls-cZizgGwlESXA0gb7wg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan F.", 
    "review_text": "Summary:  Great bar with a great selection of quality beers.  Church Key is not easy to find (corner of Grant and Green under a sign with no name, just a white key), but it is worth the effort.  Grant is filled with lively bars which definitely hold their own, though Church Key is the place I go when I want to avoid the crowds and enjoy a craft beer.  The bar offers one of the better beer selections in the city, with thick printed menus available at the bar.  Also, rotating local brews are available on tap, keeping things interesting.  Another point of note is the quality bartenders.  A few regulars rotate and all have an impressive understanding of their offerings and beer in general.  If you are unsure or overwhelmed by the large selection, I am confident you will be in good hands.  This is definitely not the place for a crazy night (closes at midnight), but worth a try after a tough day at work.", 
    "review_date": "2011-04-25"
  }, 
  "FMVQUpa5g5EQsPEzuBMpDg": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Saunders C.", 
    "review_text": "Name as many movies starring Woody Harrelson as you can.  If you came up with more than 5 (White Men Can't Jump, Zombieland, Natural Born Killers, People vs. Larry Flynt, Kingpin, and the list goes on...), you would have won the trivia night here. Trivia nights, I love 'em! Just one of the reasons to go to Church Key.   They have a wide selection of beers and a pretty detailed menu that actually describes each of the brews. Beers on tap seem to change pretty often, so there will always be a reason to stop in. I'd say the bartenders lean somewhat towards a 'too cool for school' attitude, but maybe they just prefer having their regulars here. There's quite a bit of seating both downstairs and in their upstairs area. On a weekday, you can definitely chill with a bunch of friends and have plenty of room to sit. I think they set up a DJ upstairs on the weekends, sometimes.   Ok, but it's in North Beach, the land of no parking (or $10 parking lots), so unless you have somehow appeased the parking gods and find parking within 5 blocks of this place, it's not the easiest bar to access. Maybe that's a good thing for the locals. Also be aware that the sign is just a picture of a key so you have to keep your eyes peeled for it, as there's not neon sign announcing its existence to the world.   So if you want to test out your trivia savvy or try out some new microbrews, head on over to Church Key.", 
    "review_date": "2011-03-21"
  }, 
  "CCJ9MEk39jYA2mRNQjkWrA": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Suzanne F.", 
    "review_text": "When The Big Man is in SF working he finishes his day by stopping in to Church Key for a beer. I have been hearing about the beer wonders for ages &amp; since we all were in town last weekend, I had an opportunity to visit. It was great! It is tiny, dark, &amp; not touristy - everything I like in a San Francisco bar! Beer reigns King here &amp; there are so many choices! If you are a fan of the hop, I would encourage you to try Church Key.  We happened to get here on a very warm Saturday evening - it was in the 80's, unheard of in San Francisco! Things were pretty steamy, and not in THAT kind of way, inside the bar. It was just very warm, kind of crowded, &amp; there is no where to sit other than the bar or a couple of window seats.  If I were in this neighborhood again, this is where I would stop in for some great beer!", 
    "review_date": "2011-10-26"
  }, 
  "RQ2ZkfsL4C-5G449Qrv_Ww": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Raquel C.", 
    "review_text": "I've popped into Church Key on a few rare occasions- I don't find myself bar hopping in North Beach very often...or, ever. But there are those rare occasions, and the few times I'd been there the beer selection and vibes were always enticing enough that I wanted to check it out on a more languid weekday with a few close friends.  A friend's sister, visiting from the UK, was staying in a North Beach hostel with her boyfriend and thus I decided on Church Key for post-dinner drinks. We went on a Wednesday. We sat at the bar. The DJ was playing upbeat jazz and soul and it was a gooooood!  I really like the vibe here when its somewhere between moderately mellow and almost loud to the point where you need to start raising your voice. It feels vibrant, yet still relaxing- perfect for mid-week.   As for the selection, well the beers on tap are rotating pints of perfection and they have a great book of bottled as well.   Everything up to this point is good.... but don't expect the bar tender to help you figure that out. This is where Church Key looses some stars. See, I only know a little bit about beer- such as: I like it!!! Other than that, I'm pretty clueless as to what's what save for that golden beers are light and dark ones are heavy, and that IPAs are from India and a stout will make you fat :)   When I asked the bartender about a particular draft I've never had, the answer I got was \"well, it's a pale ale, soo... it's kinda light.\" Well, what do ya know? A beer with \"IPA\" in the name is a pale ale? Reaaallly??? I wanted to know about the flavor or whatever makes the beer interesting and work $12 a pint! The bartender told me I could have a taste or two of beverages I was curious about.  This only half makes up for the fact that in an establishment known for unique beers, the person serving them appears to know nothing. He also acted aloof and disinterested in taking care of patrons. Not really cool in a small little joint like this  Obviously this guy isn't the only bartender who works here. But still.  I'm also knocking off a points because even though I am one of maybe a handful of people that knows Church Key offers a half off pint to anyone checking in there on Foursquare for the first time, Mr. Charisma behind the bar didn't offer me the deal after bringing it up and explaining how I forgot my phone at home. The one day!!! He didn't even seem slightly amused I knew they had a Foursquare deal. Dude?!? Just indulge my geekiness a little when you see me geeking out! You know? Bartender fail.  I'd throw in a half star if I could, though, for the $1 PBR they serve in a chalice :)", 
    "review_date": "2010-08-26"
  }, 
  "amH97PB5Yk_AZAabksFyWw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie F.", 
    "review_text": "Awesome selection of beers. Although they didn't have the first three I wanted in stock... Cute little tight knit place with neat decor. Showed up around 11:40 on a Saturday night in a group of 5... Ordered beers, sat down, 10 minutes later the bartender told us that they were closing up shop. He was cleaning up the entire place while we sat there and pretty much pounded the rest of our beers. It would have been nice if he had told us they were closing at midnight so that we didn't have to pound our expensive 9% alc/vol brews....lame.", 
    "review_date": "2011-02-07"
  }, 
  "iWB9XmMieth96cD2-6fAaA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dave J.", 
    "review_text": "The first time I came here was, I believe, not too long after they'd opened. I'd been walking and drinking all day with santachy, and as the sun began to set, and the rest of the drunken santas left for union square, I wandered in here with a few friends.   We had the whole place to ourselves, and were pleasantly surprised by the beer selection. Also, the bartender (who may have been from boston) was charming and friendly. Possibily he was just happy to have some company.   I went back a couple of months ago, and though it was subsantialy busier, it was still fine place to get a beer. The waitress was helpful, and took time to recomend some beers to my middle aged aunt who's not really much of  a drinker.   In any case, good selection of somewhat obscure brews, good sevice (thus far), though slightly on the pricy side.", 
    "review_date": "2009-06-22"
  }, 
  "fkawweeCwxO7cWq8EgEkFw": {
    "user_rating": 4.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Dan M.", 
    "review_text": "I ran into the Church Key on accident, but glad I did.  This place in North Beach has a great selection of brews on tap and by the bottle.  You'll find some rare and interesting brews, but don't expect to find any weak beers here.... most will be upwards of 7-8%.  The bar is pretty laid back and has a good vibe.  Enjoy.", 
    "review_date": "2010-08-27"
  }, 
  "VOD79PseKkg08eIMvNbNHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David H.", 
    "review_text": "Long overdue review as I've been coming here since it opened a few years back...definitely in my Top 3 bars whenever I'm craving a beer (along with La Trappe and City Beer Store).  Definitely a great place to stop by on a weekday evening when it's not particularly crowded (and you can get a seat upstairs) and if I recall correct there's a pretty dope DJ on either Wednesdays or Thursdays focusing on lots of old school hits. In general it has a pretty low key vibe and most everyone there are avid beer drinkers which makes for good company and good conversation.  The beer selection here is phenomenal, although it'd be nice if they provided more tasting notes in their menu, otherwise it's like throwing darts when it comes to picking a beer although I'll generally steer towards any of the saisons whether on tap or in the bottle. But if you're completely stuck and undecided, the bartenders are definitely helpful.", 
    "review_date": "2012-07-28"
  }, 
  "50W6VKW498OCuH2itdEbfw": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Kenny J.", 
    "review_text": "This is a nice low key pub in North Beach with a solid selection of craft beers. They had about a dozen taps and several pages of beers in bottles.  The downstairs area is pretty small, but upstairs they have a spacious lounge area. It was the perfect escape from the other bars where people were glued to the Giants game.", 
    "review_date": "2012-10-15"
  }, 
  "CBwPegIptHW0vwGsaxcfHQ": {
    "user_rating": 4.0, 
    "user_location": "Danvers, MA", 
    "user_name": "Chris B.", 
    "review_text": "Any bar that plays Meshuggah (and loud enough to hear it from the sidewalk) to get people to leave the place after last call is a winner in my book.    This place really does have great beer.  Not so much the tap selection (which is rather small and ever-changing), but one hell of a bottled selection.  Not the best I've seen, but if you are a total beer geek you will appreciate the selection.  Otherwise you might not know what the hell you're looking at.  One of the beers they had on tap while we were there was this bacon-beer.  No, it didn't work together... man that was some god awful shit!", 
    "review_date": "2010-04-20"
  }, 
  "qe9r7hfzHbNm1amyCPqECQ": {
    "user_rating": 4.0, 
    "user_location": "Columbus, OH", 
    "user_name": "Tullia F.", 
    "review_text": "The beer menu is amazing, the bar tenders know their stuff, and the vibe at the bar is just right.    The prices can be a bit high relative to other places, which works for the many beers they carry that you won't find anywhere else, but may give you pause on familiar favorites.", 
    "review_date": "2010-10-24"
  }, 
  "ZV1Zx__ce8FJT_PnroH6ZA": {
    "user_rating": 5.0, 
    "user_location": "Helsinki, Finland", 
    "user_name": "Jenny S.", 
    "review_text": "A very small place with excellent local beers.  I am not a beer drinker, but I was blown away by this place.  Blaecorn Unidragon and something else incredible that I can remember the name of unfortunately... However I can tell you it was velvety and chocolate-y in a very good way.    I remember someone telling me that church key refers to bottle openers!  A wonderful place for conversation.  The bartender was very nice, and she did a great job of describing the different beers on tap. It was a Sunday night!", 
    "review_date": "2013-05-07"
  }, 
  "QTLL0xbcy7AyLUPJogk5kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Britney K.", 
    "review_text": "Haha, when you search La Trappe on yelp this is the second result. Yelp, you said it for me!  I just gave this place a 3 star review, then rethought it. Its not a-ok, I am a fan. just not a huge one.   If I didnt live directly across for the aforementioned bar, I might like church key more. I finally came here after being reccomended it every single time I told someone I lived in north beach. Seriously, every time.   And it is a cool little spot. Emphasis on the little. The beer selection IS good but its yet to win me over completely. Maybe I need to come back for trivia and pot pie.", 
    "review_date": "2010-04-13"
  }, 
  "T7s8TWpBlvPAnxS52yi_bw": {
    "user_rating": 4.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Gina R.", 
    "review_text": "Neat ambiance, interesting beer selection.", 
    "review_date": "2012-08-24"
  }, 
  "AtO1W65ZqJ2RVo3iMimd4Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily M.", 
    "review_text": "Went here to try some Belgium beers on  Friday night.  After trying Monk's Kettle we were excited to compare.  We arrived around 9pm, and there was enough room for me and my friend to sit at the bar, but it definitely wasn't dead.  I think the owner was bar tending when we first arrived, and he seemed eager enough to help us find a good beer we would enjoy.  But as the bar got busier and the bartender changed, we were more on our own to pick out our next beers.    They have a mystery beer for $2, which this night was Miller High Life.  I can't believe people come to a bar like this for a MGD, but even the owner admitted he drinks them (especially when he needs to drive later).    As far as prices, I can't complain because my tab was half what it should have been. Some guy kept putting our beers on his tab (and buying us wine) and wasn't even trying to hit on us!    The music was picked by the bartender and played on a turn table.  Started out with Johnny Cash, but then switched to something I didn't recognize (or enjoy as much).  The atmosphere is dark, but friendly.    We gave ourselves a 3 beer limit because from past experience, these beers typically leave us with bad hangovers and lead to poor decisions.  Next time it might have to be a 2 1/2 beer limit.  Can't wait to go back!", 
    "review_date": "2009-05-03"
  }, 
  "b3oJ4cJwG7sgbVAvP-Rs_w": {
    "user_rating": 2.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Benjamin R.", 
    "review_text": "The selection on tap is enticing but the bartender does not seem concerned with pleasing the customers.  I won't go out of my way to visit again.", 
    "review_date": "2010-07-10"
  }, 
  "Zv-P1-QsgO8INjY7UHMYsg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie G.", 
    "review_text": "Awesome little hole in North Beach's Wall.  Been twice to this little establishment and really enjoyed both visits. It really is not your average NB bar. They have pages and pages of different beers including a delicious dark beer that i swear tasted like a Tootsie Roll!  Now this is not the place to go after a heavy meal. These beers are big in flavor and often size and last I checked there was not a Michelob Ultra on the menu.  I did have to knock off one star because when we sat down stairs at the bar it smelled like bathroom, and that was kind of a mood killer. But the upstairs is odor free.", 
    "review_date": "2009-08-27"
  }, 
  "WF1o6AyXm6-NovD5dFnMOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike K.", 
    "review_text": "Great new spot in North Beach.  Tucked away on Grant, this little bar is going to make a solid name for itself with its extensive beer list, and more importantly, their great bartenders who know their stuff.  Church Key has a wide and deep selection of foreign beers. I didn't even know that many beers existed!  From Belgium to the UK, this place has stocked up on every beer from every corner of this globe. (Strong ones might I add)  Ben, the bartender last night, was amazing. He was open, willing to talk about the beers and gave solid recommendations.  This is no place to order a Stella, and I think if you were to mention Bud Light you might have a bottle up.... (you get the gist)  One of my favorite beers last night was the 'Kwak' from Belgium. Strong beer ( 9%) I believe, and later I had a beer that was (11%) from...   Yeah, it's hard to remember when the beers here are flooring you.  Check this place out, it's a great find, and is a great introduction to the world of tall pints!", 
    "review_date": "2009-01-22"
  }, 
  "_HVQorAvXWMwJ0cxwDp7Zg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna H.", 
    "review_text": "I went here on a Sat night \"beer tour\" with some friends and thought this place was great! It's off on a quiet side street in North Beach away from the main drag of Columbus and the owners asking you left and right to come in for dinner. Ugh. So this location was refreshing.   I had the Midas Touch beer. It was a spicy, but not overpowering beer great for a fall night out. And the owner/bartender was excellent. We ended up sitting upstairs in the loft-lounge and he came up a few times to check on us and make sure we liked our choices. Great service!  I only take a star off because they ended up playing music that was a little abrasive (aka metal) for my tastes.", 
    "review_date": "2009-12-02"
  }, 
  "ogKe2zG3WtKU2LF8MlkP4g": {
    "user_rating": 5.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Kent S.", 
    "review_text": "Tactical nuclear penguin! Yes you heard me! Its an imperial stout at 32% abv. And I just had to try it who the hell wouldn't?. Anyways very delicious and a once in a northbeach lifetime tasting some delicious beer from scottland that many would mistake for a hard liquor if they didn't know any better.  Lone behold I will definitely be coming back to church key for the ultimate beer selection and hilarious bartender!", 
    "review_date": "2011-12-03"
  }, 
  "_brL8a7RCoF1QkVFMp9TcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah F.", 
    "review_text": "Love it. Super nice bartenders, great beers and atmosphere. One of my favorite bars in the city!", 
    "review_date": "2010-09-19"
  }, 
  "UqOSpuFXffTisC1ahPbaWg": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Megan H.", 
    "review_text": "Love it.....LOVE IT LOVE IT!  This is a great addition to the neighborhood.  I think La Trappe is a bit less expensive, but I really like the location of this place.  Its perfect to stop by and have a couple beers and then move on to the next spot.    It is really small, so be prepared to be in close company.", 
    "review_date": "2009-02-23"
  }, 
  "8t_A2p5RrI3cvATfREs3-A": {
    "user_rating": 5.0, 
    "user_location": "Edinburgh, United Kingdom", 
    "user_name": "Sheila M.", 
    "review_text": "If you are a beer aficionado who needs a break from the Toronado, check out newly-opened Church Key for some off-the-beaten-track brews and a knowledgeable and friendly bar staff. Formerly the North End Cafe, then an unfortunately-sterile-feeling, Russian-run bar, the owners are working hard to change the decor back towards the style of this once-beloved local drinking hole.", 
    "review_date": "2008-12-08"
  }, 
  "F1zn5vyTpYV4v02LEfdejA": {
    "user_rating": 4.0, 
    "user_location": "Hawthorne, CA", 
    "user_name": "Christine T.", 
    "review_text": "Although it's a small bar, it's definitely cozy. You walk in and theres about two small round tables on the left and right before you reach the bar. Environment is very relaxed and super chill. I kind of wish there were more than one bartender. It took about 10-15 minutes of waiting (in a not so packed environment on a Saturday night) to finally get my order in. The bartender is also the DJ so I guess I can't blame him for multitasking so well.   There's a great selection of beers! I've never flipped through so many pages of beer before! They even have a selection of cider and wine for decent prices ($6-8). There's a tiny upstairs lounge area to hang out with friends. Very cozy and very relaxed environment.", 
    "review_date": "2012-02-12"
  }, 
  "ADIMCaJqpUy97l8LMOtHYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda F.", 
    "review_text": "Visited Church Key for the first time Friday evening, to grab a couple of drinks. Mind you this place seems to specialize in beers, lots and lots of beers, but alas that is lost on me, the non-beer drinker. However, they do have some fantastic red wines. My friend and I got there early enough that we were able to grab the front couch/seat that faces the sidewalk. Great people watching! We sat there and had a couple of glasses of wine and chatted it up. The bartender was really friendly and generous with the pours! This place has a pretty relaxed atmosphere with chill people, nothing too pretentious.", 
    "review_date": "2013-05-12"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "I started going to the space that Church Key occupies back in the late nineties when it was the North End Cafe. Yes, I'm old, get over it.   Anyhow...I've been hearing a lot of buzz about his new beer mecca and popped in with Alyssa G. last night after dinner at Don Pistos. Unknowingly, we walked in during trivia night but were still able to grab a couple of beers (Allagash Witbier for her, Anchor Steam Our Special Ale for me) and had the upstairs loft to ourselves.  The beer was tasty, the company great, and the trivia harder than I would have thought. Congrats to Hipster Holiday Sweater, it sounded like you were running away with things when we ducked out.  Church Key is the type of bar that I could imagine spending hours at with friends on trivia night or bellying up to by myself to work my way through the taps. Either way, I'm a fan and will definitely be back.", 
    "review_date": "2009-12-30"
  }, 
  "dEW7W1vrAwOL1XDtf3dwTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albert C.", 
    "review_text": "Nice place with another extensive beer list and a few on draft. Beer lover rejoice!", 
    "review_date": "2009-07-17"
  }, 
  "itsafKCQAOWrViTzNaTbow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe D.", 
    "review_text": "Overpriced but better than most places around. Plays LP sides on the turn table, now that is cool.", 
    "review_date": "2010-03-05"
  }, 
  "IG9oulUO-tprUZOY4jfG3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa W.", 
    "review_text": "New favorite bar.  Great staff, relaxed vibe (it's casual but cool, and a good place to go with friends), and of course the BEER.    The location (3 blocks from my place) also happens to be ideal for stumbling home at 2 am after helping my brother drink a bottle of Mephistopheles to end the evening.", 
    "review_date": "2009-02-27"
  }, 
  "JWQe8stuylRF5AG7gX4BxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "emily f.", 
    "review_text": "Great beer selection.  Not crowded on a Friday Night.  Nice place to talk and catch up with people.  If you like IPA's, get the Dogfish Head Double IPA, high in alcohol content and pretty tasty.", 
    "review_date": "2012-02-05"
  }, 
  "yq_qqNHc3zR1Zi1Qj0sB3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber P.", 
    "review_text": "I happened upon this place last weekend and really liked it! It's a small place and they only serve beer and wine. We decided to go for beer that night and I had an amazing macademia and coconut porter. The staff was really helpful and the crowd was lively. I will definitely be going back!", 
    "review_date": "2009-10-14"
  }, 
  "VnNayEuKjMjWWVf1Nij8wQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert B.", 
    "review_text": "Like everyone else says, a little inconspicuous.  But if you know the corner and look for the key it's not that hard to find.  The beer menu is over flowing with great choices, including a Southern favorite Turbo Dog from Abita Brewing in Louisiana.  The bartender wasn't very friendly.  Maybe he didn't like the fact that the one night in the last year I actually wore a shirt with a collar on it was the night I walked into his bar.  Or maybe I just didn't seem hipster enough.  Although I have to admit that his saving grace was that Pantera was on his playlist that night.  Why the three stars?  Small and decorative but not very cozy.  I expect a warmer atmosphere from a neighborhood bar.  Lastly, they have very few beers on tap.  It's personal preference, but I prefer mine out of a keg.", 
    "review_date": "2011-01-04"
  }, 
  "7yfwAe066qZDjHedoV2h8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T V.", 
    "review_text": "My current favorite bar.  The bartenders really know about beer and can lead you to an amazing selection from their ten page beer menu.  There is no pretention in this bar, but it's also far from grungy.  Take a seat at the bar and join the conversation or head upstairs to their loft for a more intimate experience, either way, you can't go wrong here.", 
    "review_date": "2009-11-16"
  }, 
  "5ZXT4BQB-C1XjUpKmh7kaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne Marie B.", 
    "review_text": "if you're a fan of good beer, and trying new brews, Church Key is for you.  Cozy, dimly lit, with a nice vibe.  Peruse their menu for good descriptions of more beers than you've ever heard of.  Plus helpful commentary from the bartenders regarding your selections.", 
    "review_date": "2010-06-07"
  }, 
  "yfr7xoIX77mmatXrim9EZg": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Will A.", 
    "review_text": "Definitely a hidden gem in North Beach. Good place to get a low-key drink and they have a great beer selection. Not a ton of seating downstairs, but the upstairs lounge is spacious. Good place for a weeknight beer or to start out the night.", 
    "review_date": "2012-09-30"
  }, 
  "yC8z3ISBoVLdPMoR8PCJkw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Henriette P.", 
    "review_text": "This place is way overrated. Yeah their beer list is good, but nothing compared to Monk's Kettle. I ordered their sparkling wine and was unpleasantly surprised to find it came in a can and tasted pretty awful. They played headbanger rock the whole time, which is cool if you are into that, but I'm not. Maybe its because I've seen pictures of Church Key that made it look ultra fab, but I was pretty disappointed with my experience here. I won't be coming back", 
    "review_date": "2009-08-09"
  }, 
  "kxj7TPtJY2zbEjGV0PYfAA": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jenna S.", 
    "review_text": "We definitely would not have stumbled upon this spot without the help of some locals, but Church Key is totally worth the stop.  TONS of beers on tap and in bottles.  Their beer menu is huge - it took me about 5 minutes just to pick my first selection.  The bartenders are friendly and knowledgeable when it comes to helping with a pick.    Make sure you sit upstairs.  On a Monday night, there were no other people upstairs so it was a nice, cozy spot to have a drink with friends and sit and talk.    Oh, and did I mention they have a dog?  The owner's dog hangs out in the bar every evening and is super cute and loves pets!  Obviously, this sealed the deal for me.  I love dogs and bars with dogs is just too cute!", 
    "review_date": "2012-03-24"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "I like this place because it's off the main strip of bars and restaurants in North Beach. It's small, hasn't been packed each time I've been in and it's mellow. Unfortunately, I'm not that into the beers on tap, even after doing the $1 samples. They have a pretty extensive list of bottles and I think that's the best way to go. Worth checking out on a Friday if you don't care for crowded bars.", 
    "review_date": "2012-05-23"
  }, 
  "ZgLLB512gp3xDOXEzV0GDQ": {
    "user_rating": 3.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Cinds C.", 
    "review_text": "The best part about this place is hands down the beer.  The owner selects it all and is very knowledgeable about his choices which makes it fun.  Honestly though, that's all that I really like about it.  I can never tell when I am there if it's supposed to be upscale-esque or a casual non-divey bar.  There is nowhere to sit and unless you want to go upstairs where it is a. a sauna and b. too effing loud.  Downstairs is super limited on space but not quote small enough to feel ok about blocking the entrance/main area/what have you.  Probably a good place for pre-game, or a Thursday, low key night with delightful brews.", 
    "review_date": "2010-01-25"
  }, 
  "f2kprM12LzRr9KcP_X-87Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex B.", 
    "review_text": "Where every self proclaimed beer aficionado should come to be humbled and happy. Reddish low-light ambiance, and great upstairs seating area / window booth. It's what you'd expect from one of the nicer North Beach bars, plus a locally unparalleled selection of international brews. If you come for the beer and only the beer, you will not be disappointed.", 
    "review_date": "2009-07-08"
  }, 
  "LdWIjNvjdaAoAfpQhT6F9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tinna H.", 
    "review_text": "After several months of anticipation [yes, I kept count!], we finally got a chance to check out Church Key. The space sits a storefront away from the corner of Grant and Green, a skeleton key marking its spot. Its interior is cozy and inviting with seating along the bar downstairs and tables and seating upstairs.   I may not be the beer aficionado, but Church Key seems to provide that venue to try something different and new. It is comfortable enough. There are a bunch of beers on tap, ranging in color, price, and taste. And then, there's the menu with even more hard-to-find brews in bottles. For the non-beer drinkers, a selection of wine/champagne is available. From what I understand, the beers will keep on changing. The good stuff will stay longer, while everything else rotates every few weeks. Not sure what to try? Just ask!  What I'd really love is an email list to inform me of what's new at Church Key!   It IS in North Beach and quite the trek for some of us [a worthwhile one though!]. The best part is that it is just one bus ride to/from home base, Broken Record.", 
    "review_date": "2008-12-09"
  }, 
  "K06taXHoLcwVf2N_5b-wbg": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Josh F.", 
    "review_text": "Small location with seating at the bar or upstairs for a quiet evening with your friends and good beer.  Amazing beer selection and our bartender was very knowledgeable about all things beer related.  A must try for beer lovers.", 
    "review_date": "2012-12-30"
  }, 
  "F9tOE0d09SLkCIZwt8I-0g": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Patrick N.", 
    "review_text": "This place is kind of deceiving -- it looks like one of those fancy, snobby wine bars from the outside, and you walk in to order your favorite Pinot Noir (because you're a wine snob, yo), and they ask ya, \"Red or white.\"  Because, well, they have two wines.   Red and white.   Not exactly a Sideways tour.  What they do have is a beer list that's longer than most books, and a fine one too. Everything from that Midwest standby Pabst Blue Ribbon -- in a can -- to some 50 dollar beer that the barkeep remarked that was special occasions. I had a red beer -- don't recall the name -- and it was a fine choice. They really know their beer (read my monologue about 4th Street Vine), so I don't feel stupid about asking for a particular flavor. I tell them what they want, they get it.  What's nice about the place is that it doesn't have that North Beach tourist and drunken college student (read: not the Savoy) vibe; the place is nice enough that people think that they have to act civilized (as said by the barkeep, Benjamin), and the runnin' soundtrack is hip enough to make us older types feel young without the youngins throwing up on our shoes.  I'll be back.", 
    "review_date": "2009-12-05"
  }, 
  "YMZS2HlyK4LzlJU9KZbbNA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lizzie T.", 
    "review_text": "Definitely one of my favorites.  Great beer selection, cool atmosphere, good service, close to my apartment.  And a $2 mystery beer selection for the rough times!  Though last time it was PBR light, which is just wrong.", 
    "review_date": "2010-09-20"
  }
}