{
  "IG-aN4r4ODf0QDucWPibyg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M C.", 
    "review_text": "seedy and shady. mari is definitely greedy and behaves like a gossipy, puerile school girl and is operating a business illegally on multiple levels without the needed licenses. you may also end up unwittingly paying for drinks that aren't yours and patrons smoke. staff is underpaid and mari is dishonest and takes tips for herself.", 
    "review_date": "2014-06-14"
  }, 
  "FBioFMZiHGRCIXg-Qg0z4Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Majorpacman M.", 
    "review_text": "This place is wack, if you are young bachelor looking for asian girls. This is not the place, it is a hostess bar after all. Besides, the majority of the girls already have boyfriend or not interested in you since they have to work. I have been a customer at the place for about five years now and when business is slow, the bartender try to make you or not inform--  you're paying the hostess's drinks.Save your money, go to other bars and hang with you friends. You will have a better time. The mama-san paying the illegal working japanese girls only 10per hour and no tips. The mama-san a bitch and greedy. So save your money and you will have a better at other places and go to other countries.", 
    "review_date": "2008-11-01"
  }, 
  "ySVppiyeqALQ7DKLCosmOw": {
    "user_rating": 5.0, 
    "user_location": "Lagraulière, France", 
    "user_name": "Button L.", 
    "review_text": "absolutely in love with this place. it is expensive, but worth the authentic japanese experience. and i mean authentic! in love with mari, she is just adorable.", 
    "review_date": "2012-11-30"
  }, 
  "PwTw7oEmPNspuikMQLXYlg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jory M.", 
    "review_text": "Been here several times during the week and had a great time. Stopped by on a Saturday with 5 of my male friends for my birthday and got turned away because the seats at the bar were \"reserved\". Even though the place was empty...  5 dudes? Maybe. Because we were all gaijin? Probably. Never again, Mari. Sorry.", 
    "review_date": "2014-08-02"
  }, 
  "d-SascNeaL8yD5f6MNC_Og": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "Kelly S.", 
    "review_text": "I got ripped off! Mama san is very greedy. People are smoking inside that is illegal. Please someone report! This place must be shut down!!!!", 
    "review_date": "2014-04-01"
  }, 
  "OQBeD6RvLNjfgB64MBI1IQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly O.", 
    "review_text": "Japanese hostess bar realness!  You need an invite or an introduction to get in, but no matter: chances are don't wanna know how much a visit to a place like Mari's will set you back. Let's just say that if you can't charge at least one bottle for the keep system to your corporate expense account then forget about it boo. There is no menu or price listing (save for the \"table charge\" which I think I remember as $20 for a plush couch niche, $10 for a stool at the bar).   Mogura, Mari's place next door seems to serve as a soft gateway of sorts for this namesake joint: a young patron and his date from Mogura, who were initially turned away from Mari's, wandered back in to the club during the wee hours of the night. The newbie guy boldly sat down at a table where a quiet club member and his hostess has been snuggling all night while his date was quickly snagged by another patron of the bar. After about 45 minutes the intruder was delivered a bill that apparently included a charge of three shots at $100 a pop --- shots that he was urged to order at the behest of the hostess and patron with whom he had haphazardly sat down to chat with. He told me later that he was a student at SF State and that he had almost no qualms about losing his date as \"she doesn't put out anyway.\" I give him an F- for charm and decorum and a C for an expensive lesson learned.   Anyhoo, If you really want to check out the scene at Mari's go on the third Friday of the month: \"cosplay night.\" All the hostesses dress up in shiny black patent leather teddy-dresses, lace garters and stockings and spank guests with riding crops --- naughty but nice.   Also, smoking is permitted at Mari's so if you go be warned that you'll be drenched in ashtray scents for the evening. And the karaoke is pretty cool: they have a wireless mic that gets passed and proffered about the club as if it were a bottle of bubbly to be presented and enjoyed.   p.s. Mama Mari's stylish kimono and Japanese traditional-meets-late-80s inspired up-do are remarkable!", 
    "review_date": "2010-05-07"
  }
}