{
  "xDqGPRY2nTRGWvuDH85mgA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darren M.", 
    "review_text": "Neighborhood dive bar. Great happy hour promotion involving chips or something like that. I have trouble exactly remembering what the promotion is because of said promotion. All I remember is FEEL FREE TO TIP ON THE CHIP. (bartenders love me)  Sports happen. Wii bowling on Tuesday nights. Young happy bartenders raising families. Working class bar vibe. Pictures of longshoremen striking on the walls. As if anyone in this neighborhood made less than $90k a year these days. Still, it's a good place for me to watch people my age act embarassing the instant anything by Journey comes on the juke box.", 
    "review_date": "2010-06-04"
  }, 
  "9Dj1F91KRmO9ARrKmvkWjQ": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Ann B.", 
    "review_text": "Where else can you come in for a drink, get an excellent recommendation for dinner, go to eat dinner, and return, with a tiny chip, for a free drink?  I loved this place!! My hubby and I wandered in after a day of touristy sight seeing. The restaurant we had planned to go to was closed, so we stopped in for a beer and to figure out where to go. Michael, the bartender, was wonderful!!! He suggested a local restaurant. So, we went to eat and returned for our second happy hour beer. Cool to offer the special until 9 pm, even after happy hour has ended. Michael introduced us to Furnet, which is a lacquer sort of like Jager. So yummy!! Michael was so cool; we wanted to be regulars. Sadly, we had to return to Phoenix. He made us feel at home and comfortable in a \"foreign\"city.", 
    "review_date": "2011-03-16"
  }, 
  "QRHS2i4DWS6R0fpkCalvaQ": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Margaux N.", 
    "review_text": "2 for 1 Yay!", 
    "review_date": "2009-09-24"
  }, 
  "tviRa0oeyDx0-LmKwsHJnw": {
    "user_rating": 4.0, 
    "user_location": "Rineyville, KY", 
    "user_name": "Tim G.", 
    "review_text": "definitely a chill spot, good tunes in the juke box, a mixture of different types of friendlies minus the hipsters, good service... can you really ask for much more.", 
    "review_date": "2009-06-27"
  }, 
  "89XdXGptcUPmrNRLF71Pzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan C.", 
    "review_text": "This is by far one of my favorite Bars in San Francisco.  You can't beat the happy hour here.  2 for 1 beers everyday from 4-8pm.  Great selection of beers on tap, bar tenders kick ass, you can always find a good game of pool here too.  My kind of bar.", 
    "review_date": "2008-09-12"
  }, 
  "wY2OPBVOOJ9kvjuqXBamtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen L.", 
    "review_text": "Don't roll into this place if you wanted to be treated like a princess or you have a #basic attitude. This place is a chill dive bar with a great beer selection and upgraded TV's (the best TV situation in north beach). The Happy Hour is unbeatable (2 for 1 draught beers 4-8pm They play the sound for big sports events, and allow you to bring in your own food. Limited seating, the bar does get crowded at times (especially on thursday/fridays after work).", 
    "review_date": "2014-07-07"
  }, 
  "x2-TP8fd4G0OqkgDyKt3IA": {
    "user_rating": 4.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Elaine N.", 
    "review_text": "A friend of mine was DJing at Monroe Saturday night and we wanted to bar hop before we got there so we ended up at Columbus Cafe. My friends love this spot and I totally get why -- it has a great vibe, cheap drinks, solid tap selection, music, pool tables, and a chill crowd. We ended up staying here for more than a few drinks and had a great time. There are some screens too, looks like it would be a fun place to catch a game.", 
    "review_date": "2014-11-30"
  }, 
  "4Po_4vgdBFk2GPeKfJqVww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan L.", 
    "review_text": "Ummmm...ok, so the name is a little weird:  it's not on Columbus...and it's not a cafe.  What is it?  Only one of the best bars in the city!  I love this place.  Just divey enough not be a lounge.  Just clean enough not to be a dive.  The happy hour is awesome...oh the love of the poker chip and the free beer it represents.  Great beers on tap, by the way.  Bartenders?  Friendly and fast...no better combination.  And to top it all off, I came back after dinner for another beer, it was PACKED, and some guy let us have his stools.  Really?  Who does that?  In North Beach?  Nice.  Very nice.  Meet you there for happy hour?  That little stretch of Green St is adorable...", 
    "review_date": "2008-10-20"
  }, 
  "M-Omxs825UaLyqud8g4eBA": {
    "user_rating": 4.0, 
    "user_location": "Bismarck, ND", 
    "user_name": "M G.", 
    "review_text": "I love the tattooed bartender with the bleached hair! She is so cute and friendly. Definitely the perfect bartender.  The place is alright. Fun to drop by during a night in the city. Busy even on a Tuesday.   :)", 
    "review_date": "2008-08-08"
  }, 
  "HkKQnZd8jT8WtlJKH0X77w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison R.", 
    "review_text": "I have been here after SEVERAL dinners/evenings out.  Meaning, i never START here.... but i always have the idea to go later.  i don't even know what that means.  hm.  anyhoo, it's a fun friendly bar with A LOT of regulars and well, booze.", 
    "review_date": "2009-08-04"
  }, 
  "N0F5oCQeCfowPCEtuxiDsA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew H.", 
    "review_text": "The last two times I've been there, the male bartender (the one working during the day on Sunday, June 29) has been unbelievably rude. It's alarming that he still works there.  If you want to be treated like a valued customer (or even a human being), skip this place.", 
    "review_date": "2014-06-30"
  }, 
  "hq1X6tIBTNQufilIhrZK7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ash C.", 
    "review_text": "I like this place a lot.  You really can't beat the 2 for 1 happy hour (with the creative poker chips).  Not a huge draft selection, but it's more than good enough for me.  The bartenders are friendly, and the patrons are in there for a good time and a friendly chat.  For the most part, it's a dudes bar - but it's not so meathead-ish that they all want to watch Entourage after a few chugs.  Single girls or groups of girls don't really come here for some reason.  CC is also a bit of a dive - dingy, dark, damp.  But all in all, it's really easy to have a good time.", 
    "review_date": "2008-08-17"
  }, 
  "ygh1FAM5zmfWFeKsV6wJRg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alice C.", 
    "review_text": "If you can rile a crowd and have a packed bar by 2:30pm on a sunny Saturday afternoon, you're doing something right.  Bonus points for dealing with all of us ridiculous St. Patty's Day bar crawlers.", 
    "review_date": "2010-03-14"
  }, 
  "SeG2NWwKVAZmRoQDzL-bNA": {
    "user_rating": 5.0, 
    "user_location": "Royal Oak, MI", 
    "user_name": "RJ J.", 
    "review_text": "This is a terrific happy hour, great beer selection,  2 for 1 till 8pm. I paid ten bucks for 4 beers. Best happy hour in SF as far as I'm concerned. Great old time character bar, gotta love the pictures of Rocky Marciano on the wall. I'll return.", 
    "review_date": "2012-11-29"
  }, 
  "WI9UJah3bVB258wzEIh34A": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kate K.", 
    "review_text": "The last fuzzy thing I remember from my evening at the Columbus Cafe was Starla grabbing me by the elbow and ushering me into a cab with her to get me to stop making out with someone...  it must have been a good night.  Great little North Beach bar, drinks are reasonable and the joint is cozy.", 
    "review_date": "2008-01-29"
  }, 
  "nYufXwZH9ooB_zjNJf8Xlg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Morris D.", 
    "review_text": "My spot in SF. There are many like it, but this one is mine. The beautiful and charismatic Karlee D has installed many hangovers upon me and got the B into Bubbies pickles and told us about Broken Record, a place we all like. We have also met a myriad of madcap individuals here including a Chilean miner and a House. Can't get no cooler than that..", 
    "review_date": "2011-03-20"
  }, 
  "EypheQVNvJdQIN5Y9Tr98A": {
    "user_rating": 4.0, 
    "user_location": "Crawford, TX", 
    "user_name": "George B.", 
    "review_text": "We came here for New Year's Eve and the place was perfect for what we were looking for.  Cute girls, cheap drinks, friendly people, great music selection...can't really beat that.  The only reason I am subtracting 1 star was for the fact that there were 3 bar fights in the span of an hour...although I doubt that is a regular occurance, that is just out of hand.  Maybe it is just because I am from SD and have seen about 1 bar fight in the 3 years since I turned 21 down there (most people are pretty chill) but I was pretty shocked.  Then again, it was New Year's and all of the people looked like they were 3 sheets at the time.", 
    "review_date": "2009-01-05"
  }, 
  "Q65so6iZytMNO6mdMckifQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith B.", 
    "review_text": "this place is pretty great. anywhere with 1.50 draft beers cant be beat. i've only been here once, but i would definitely go back. cheap beers and board games makes for a very fun time.", 
    "review_date": "2008-11-24"
  }, 
  "G6C5MhtajK2srA5pjeg2ww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ria D.", 
    "review_text": "Looks like a total dive from the outside.  Well, okay, so it definitely isn't \"fancy\" but no Marina folks!!!!  Two stars.  This place has happy hour and fun tokens.  What more could a girl want, it's great for groups, and has TVs for watching UCLA kick Cal and USC's ass?  :o)", 
    "review_date": "2009-09-24"
  }, 
  "yXqD9UU_RvU4jfP1UmKW9Q": {
    "user_rating": 5.0, 
    "user_location": "Staunton, VA", 
    "user_name": "Jack M.", 
    "review_text": "Best happy hour in town, indeed.  Not a bad place to hang out.  Nice bartender.", 
    "review_date": "2008-04-27"
  }, 
  "lM9ZDLy3Uz4BOPmyB6euWA": {
    "user_rating": 5.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Sabrina P.", 
    "review_text": "I just moved to the city and was going to try to find a good local, when low and behold the most amazing bar fell into my lap!  Really nice staff, nice people, good happy hour.  Also sometimes there is dancing but its not meant for that purpose, people just like to dance because this place makes everyone so happy!", 
    "review_date": "2010-09-19"
  }, 
  "79X-pfwVx-URimuRU21ITA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Nicole W.", 
    "review_text": "Beer selection good, check. Great happy hour deal, check. Friendly crowd, check.  I liked this place. Can get really crowded at times but overall has a good atmosphere. Fun for a group of people, or just to lay low and get a drink and play some pool...  or even some tunes to drunkenly sing to on the jukebox.", 
    "review_date": "2012-09-02"
  }, 
  "VAI4LygxcbgHctXSS63kbg": {
    "user_rating": 5.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Emily G.", 
    "review_text": "Hanging out in my friends SF apartment and I found out that we are both fans of this place. Really. I live in AZ, what are the chances that out of all the freaking bars in SF, we are both fans of this hole in the wall? Its like.. its meant to be!  I don't have much to follow up. Columbus Cafe still rocks even though it literally is a tiny little bar. As I waited to use the 1-stall bathroom I watched and talked to the dudes playing pool. I hear the door unlock and turn around to get ready to enter the bathroom, where I see a girl coming out.... followed by a guy with the biggest smile on his face.  -_-  I look at him and say \"what.the.fuck\". \"Oh its not what you think\" Sure its not, loverboy. Now get the hell out of my way and let me pee. I don't want to even begin to think where you left all your love stains. Ew.", 
    "review_date": "2013-07-16"
  }, 
  "RxcIU7cJGxFtMgx84HaHRA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carmen C.", 
    "review_text": "2 for 1 pints during happy hours! :D When you get your first drink, you're given a token chip for your second drink. For people like me, this is great because you don't necessarily have to have both your drinks at the same time. From my understanding, you can come back any time and use your chip on your second drink.   Friendly staff, friendly crowd &amp; cheap drinks. &amp; There's a photobooth and pool table in the back as well. I will definitely be back with friends :D", 
    "review_date": "2012-11-01"
  }, 
  "zpswu_OyqtF4ib1ydsCR3Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy B.", 
    "review_text": "Upstairs was fun but a little crowded and it was kinda hard to get a drink.  Downstairs smelled like vomit and it the lights hurt my brain...shockingly easy to get a drink.", 
    "review_date": "2007-02-11"
  }, 
  "mXPpMRWMYXCZUqDPD4Fycw": {
    "user_rating": 4.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Joe U.", 
    "review_text": "Happy hour spots in SF are a dime a dozen. Even with this handy Yelp app, you can always try a new one, almost daily. As we made our rounds around North Beach, we decided to give Columbus a go.   The drink specials during HH can't be beat. The draft beers and between $3-4 and include a token for a free beer after. I felt like I was in Vegas with all the chips I collected by the end of the night.   Great spot for large groups and it's located so close to an amazing drunk pizza spot just 3 doors up the street.", 
    "review_date": "2010-02-14"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "best happy hour ever!!  buy one beer and you get a token for a 2nd beer, and you can use that token even after happy hour.  you can't beat that deal!  great beer selection too!", 
    "review_date": "2012-10-23"
  }, 
  "nFPpHjvJgcE7M66MMrbs8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sparkle m.", 
    "review_text": "This is just about my favorite place in the city.  2 for 1 happy hour beers (you can save the free beer chip and redeem at a later date). bartenders that are as nice as they are adorable. and THREE DOLLAR FERNETS!!! all day, every day.  jukebox is good, with the feature to download music, but it's always better when the bartenders have their ipods playing.  much M.I.A., punk rock, and reggae.  I'm still holding out hope that they will rent out the downstairs as a studio, so i can just live here.", 
    "review_date": "2008-06-26"
  }, 
  "8d6Mdzh_GWk9gZTqrsGJrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "A cool bar in North Beach!   Went here for a friends birthday, good amount of bar stools and tables for seating, cool movies on the TV's, bartenders are nice, not a bad place to be! We asked the bar tender to make us all a shot and she whipped up an electric blue sort of drink that was smooth going down!   Great happy hour specials which is always a plus in my book, and the window by the door makes it easy to people watch and chat with the people outside smoking (if you have friends that smoke!) Seems to bring back regulars and I can see why!   Cheers!", 
    "review_date": "2007-06-02"
  }, 
  "tEStbT_jIZzmGrkBwLx-kw": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Andrew H.", 
    "review_text": "This is my local watering hole and I love it. The 2-for-1 happy hour on a solid selection of beers is just awesome!   I like all the bartenders and have developed a nice coalition of regulars to hang out with on any given night of the week. The place has a punk-rock vibe until somebody gets on the jukebox. Attracts a nice mix of people.", 
    "review_date": "2013-08-13"
  }, 
  "TFpNMh-yRcPiWcFMuIY2bg": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Christina D.", 
    "review_text": "2 for 1 draft beers 7 days a week?!? What's not to love??? Great location and cool people? I will defenitely be back!", 
    "review_date": "2010-04-19"
  }, 
  "1Yp3zswZk9jR5wfqJWVFhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J G.", 
    "review_text": "the 2-for-1 happy hours are just plain fabulous.  i became a regular here a while ago but every time i turn up the old bartenders, bouncers and regulars remember me.  they are always friendly and willing to get me drunkety-drunk-drunk.  the crowd can be 50-50. some nights it's just a sausage fest, other times it's like you're surrounded by a high school graduation class but thus is the gamble for kicking in north beach.  But on those nights when the crowd is just perfect, it makes me wish last call didn't exist.", 
    "review_date": "2006-09-27"
  }, 
  "J7Ko9iOG1Hg74PCtP9mLxw": {
    "user_rating": 3.0, 
    "user_location": "West Sacramento, CA", 
    "user_name": "Eric K.", 
    "review_text": "Cool bar wasn't too packed on a saturday night.  $15 minimum for credit card tab.  Just happy they actually took credit cards since a lot of the bars down here only take cash.     Will update the review if I come back for more than a few drinks.", 
    "review_date": "2013-02-19"
  }, 
  "aM3T4jeHY_fswn6xQ41rtw": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Nick D.", 
    "review_text": "Great happy hour spot, 2 for 1 drinks.   Rolled in here because it looked like a cool spot, and I was pretty happy with the decision. There was a very lively happy hour crowd on a Friday evening. They played good music and had a few games on TV. Not too much to hate here.", 
    "review_date": "2013-07-17"
  }, 
  "-ty5eC5N6uWkEAt-j-E6SQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty M.", 
    "review_text": "Home of the 2 for 1 beers. Is there really much else that needs to be said for this bar? I came here straight from work (Potrero Hill dude) one day and was desperately needing a drink. I suddenly realized that I actually needed two drinks. How the heck was I gonna remedy this need for two drinks...at the same time?! Two drinks For the Price of One!! Are you kidding me? Incredible...and you're telling me that if my mom calls me and says, \"Mike, you need to come home and clean up the dog poop from the back yard right now mister!\" that I can keep my chip for the next time? Now you guys must be pulling my leg. Wait....am I still in N. Beach? Maybe I took a wrong turn and ended up in the Sunset or something. Nope - there's 4 guys playing pool and wearing striped, untucked button down shirts over there, so I know that I'm in N. Beach (I keed, I keed.) Anyway, this place gets 4 stars outta me - also because the bartender tried to down sell me into a PBR cause I was wearing an Olympia shirt.", 
    "review_date": "2009-04-20"
  }, 
  "1qXTfHO55GmMpVhKKfZA8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan H.", 
    "review_text": "When I first drank Fernet I was in this dive bar with a bunch of ad people. I thought it was the most disgusting thing I ever ingested and vowed never to have it again.  The second time I had it was on Forbes Island. I then discovered its curious ability to cause and cure motion sickness, at the same time.  Third time was at Love Fest in front of the Listed float. At this point I was drinking it straight out of the bottle.  The fourth time, however, was at Columbus Cafe. After 6 or 7 shots, you begin to see things. Matt M says he saw a unicorn, but I saw penguins. Four of them. They came into the bar single file, shot a round of pool, and left out the back.   To this day, I don't know where those peculiar web footed transients were headed, but I hope they found their way.", 
    "review_date": "2008-01-09"
  }, 
  "L2X-a5KWRPhCp62rqBroSQ": {
    "user_rating": 5.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Pascal C.", 
    "review_text": "Probablly the best bar in North Beach. Great draft beer selection, even though I always seem to drink the same kind. $3 shots of Fernet. YUM YUM,  The Happy hour has 2 for 1 drinks! A bunch of restaurants everywhere. NEED I SAY MORE?", 
    "review_date": "2007-10-12"
  }, 
  "W82cYXhC2_Rm1IFpGGW8Pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea D.", 
    "review_text": "Let me preface with - we love this place. And Karlee is a sweetheart...  We were there a few months ago, normal Saturday night, super busy, which we expected. So I go up to the bar and order a scotch and 7up, and a vodka soda. Somehow the bartender (which was the bar back at the time) gave us a vodka 7up and a scotch and soda. Honest mistake, so I turn around (had a sip of each) and said, hey pal, so sorry to do this but you switched the two. He YELLS back, Nope, Wrong. So, calmly, and knowing that neither of us had ordered anything above well, I lean over and say, Maybe we misheard each other, but really, this isn't drinkable. He rolled his eyes at me and walked away. Refused to serve me again...  Hopefully this guy isn't working there any longer.  On happier notes, the drinks are way cheap, the music is always bumping, and you can usually get a spot at the pool table or a seat at the tall cocktail tables. I'll be back, and be sure to order from Karlee...", 
    "review_date": "2010-01-13"
  }, 
  "uXSVu2ldBncOGMcvI9SW2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noelle Q.", 
    "review_text": "I hate Fernet- hate it with a fiery passion- and the only place I've had it is here- so it says something that this place still gets 4 stars from me. Cheap drinks, two for one happy hour, fabulously nice bartenders, a great jukebox, and the ability to order in pizza. The only problem with the place (and its not really a problem, just an observation) is that the floors get so sticky and grimy at the end of the night that you can see dirt and grime on the bottom of your pants when you leave. But still, awesome place. And now, they sell the cutest t-shirts now, adorably slim-cut for girls.", 
    "review_date": "2006-10-17"
  }, 
  "2gP8s5dOJmwVKVm0GNMU0w": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Sunni B.", 
    "review_text": "really cool bar. great music and the bartenders are awesome. good vibe all around.", 
    "review_date": "2012-02-02"
  }, 
  "6ATfXxQLQuRAQ30-nLI6Yg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph F.", 
    "review_text": "I think every single review starts with this, but YES, they definately have 2 for 1 beers at happy hour.  You get a poker chip with the first one, and you can use it for a freebie.  Kinda nice that you can save it for another day.  That being said, I'm not a huge fan of the place.  It's chill for a dive bar, but it's crowded quite a bit and I can't really figure out why.  The bartenders absolutely ROCK so I'll give a star to each one I know....   No cover, cheap drinks, and almost always a sausage fest, come here when you want to get shitty drunk with a friend or two and don't care who you meet.", 
    "review_date": "2009-06-09"
  }, 
  "cY2O_YfM_e45jkiYl4U3Sg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jordan S.", 
    "review_text": "The bartender on Sunday afternoons is not a very nice guy. It made the experience here a much less enjoyable one, I was afraid to go up to the bar and order something else...scared he'd yell at me or say something snarky.  Besides that...It's very divey, not many tables, but a good spot to get away from the usual go-to's.", 
    "review_date": "2014-10-30"
  }, 
  "pKYOy6OsyQBRv188IKbPHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bailey D.", 
    "review_text": "Columbus Cafe is fine.  They have 2 for 1 beers before 8 and I often start birthday bar crawls there.  The crowd is pretty heavily male and it can feel a little bit like Marina East, but there's nothing really wrong with that.", 
    "review_date": "2012-02-26"
  }, 
  "DjXEUA6ltpOCgzy3Q8D_xg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Troy R.", 
    "review_text": "I normally like a little yuppier place with yuppish people but I have seen the light. Take away the facts, that I live across the street from this place and that my awesome roommate works here, but this is good times. Always a good time with good drinks to be had and you can even meet some good people, possibly a few good entertaining drunks too. If you're in North Beach and you want a chill time, come on down to the Columbus Cafe, you won't be disappointed.", 
    "review_date": "2008-06-26"
  }, 
  "u9RU-VYTrsY9c9yfTsgNww": {
    "user_rating": 5.0, 
    "user_location": "Columbus, OH", 
    "user_name": "Basil A.", 
    "review_text": "Best espresso I have had in San Francisco yet! This gives me hope (please let's not mention the Greco incident). The barista is an absolute artist. Didn't seem at all like a bar to me (though I was there for lunch). The food was good, but it's hard to concentrate on eating, with an oustanding specimen of a white mocha demanding all of your sensory inputs.", 
    "review_date": "2006-04-04"
  }, 
  "FI0dcCAuFmW0lutdKO2UwA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle K.", 
    "review_text": "Bartenders here have big tudes but otherwise it's an ok place.  That is, cool when the loud and annoying 20's somethings aren't acting like absolute retards down in the clicky little corner of the bar.  Seems like a lot of young 'I've got the world by the balls\" class A young morons like this place.  Happy hour on the weekend rocks though!   Not a bad place to watch a game.", 
    "review_date": "2009-07-07"
  }, 
  "B33KEetBrqpnJbQZetY3sQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beau G.", 
    "review_text": "It all started to go wrong when I ordered two $3 shots of fernet, and then did both of them within five minutes of each other.     Why?   Why?  Why?  Answer:  So I could end up with Jaime's hat.", 
    "review_date": "2008-01-27"
  }, 
  "jyZ1RHNDbzBvEzxjKEaPBw": {
    "user_rating": 3.0, 
    "user_location": "Cincinnati, OH", 
    "user_name": "Mike D.", 
    "review_text": "Nothing too special about this place, I just like coming here with my buddies.  Good place to drink, shoot pool and listen to the jukebox that boasts an impressive selection.  Oh yeah, 2 for 1 happy hour is obviously a good thing.", 
    "review_date": "2006-10-18"
  }, 
  "k3WjpSYRz0l7NUHSuc_Ybg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carly B.", 
    "review_text": "Went here on Halloween as it is nearby work. I couldn't believe the two for one pints until 9pm! It was awesome. I think I got drunk for like 15 bucks and it was a nice Belgium beer!  Definitely coming back.", 
    "review_date": "2012-11-02"
  }, 
  "4pzr6KuS85859EICMI7MDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsea P.", 
    "review_text": "Columbus Cafe is one of my favorite no-frills bars in North Beach. It doesn't have an overly cheesy theme or gimmick, there isn't a cover during special days like a lot of their neighbors (St. Patrick's Day), the drinks aren't obscenely expensive, and the bartenders actually give a damn and pay attention to your order and fill it quickly.  I love starting my night and ending my night here, because it's conveniently in the middle of North Beach, and just a few doors down from Golden Boy Pizza.   I was most recently here on St. Patrick's day when my friends and I didn't exactly want to pay a silly cover charge to go into a crowded bar or corral in the streets. We had no problem getting in and no problem getting drinks. I've also been her countless times before on the weekend, before dates at local restaurants or shows at Beach Blanket Babylon or... the Hustler Club.  It's not the biggest bar, nor is it the best bar, but it's definitely a great bar that I frequent almost every time I come to the neighborhood.", 
    "review_date": "2013-03-29"
  }, 
  "PFv_v-hEebIktD7WLrltLw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jessica T.", 
    "review_text": "I generally don't make it over to North Beach, but a friend was visiting from out of town and staying in Fisherman's Wharf (uuugh), so we found this little watering hole.  Once we were inside, I thought this place was pretty great.  (The doorman was a total dork.) The people were friendly and the bartender was chatty.  I usually hate when bars have TVs showing sports, but while we were sitting there my friend says \"The only sport I like showing in a bar is big wave surfing.\"  I thought that was a great sentiment and as we sat milling it over, basketball ended and (no joke) a big wave surfing competition started.  Creeeepy.", 
    "review_date": "2009-02-09"
  }, 
  "fD57AENiuVILooHbpWfcCw": {
    "user_rating": 5.0, 
    "user_location": "Wellesley, MA", 
    "user_name": "Cameron L.", 
    "review_text": "Awesome bar.   The buy a pint get one free deal is excellent. Enough said.", 
    "review_date": "2014-07-27"
  }, 
  "-qDiotF8Qd0ThdLNEpg9Aw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Why you should come here:  1) 2-for-1 beers on weekday happy hours  2) Football on plasma screens  3) Great beer on tap (I for one would do terrible things for a Rogue Ale Honey Brown Nectar)  4) Golden Boy pizza next door, mmmmmm", 
    "review_date": "2008-11-21"
  }, 
  "PlRQBvaBCEkZeetp9QUNXg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie N.", 
    "review_text": "I used to like this place a lot a couple years ago. Jukebox, pool, rock and roll. Now it's bro-town. The bartenders are nice, but the crowd here is always full of tools. I wonder if they share a crowd with Northstar.  I went by the other night (dead sober) to pop in and see if a friend was shooting pool inside. There was no door guy in sight. I walked in and felt someone GRAB ME BY MY WRIST and pulled me back, THEN asked for my id. I was really confused about where he came from, and had he not said \"I need your id\" when he did I would have slapped the living hell out of him.  I'm so over you, Columbus Cafe.", 
    "review_date": "2011-07-02"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "Columbus Cafe use to be my second home.  I can be found here at least once a week sippin' on a pint glass of beer or taking a shot of Fernet when I first moved to North Beach!    Update: 12/11/2007 A casual date with an awesome guy named Nick on a Tuesday night.  We had 3 beers each.  Karlee, the coolest bartender, and I also had a shot of Jameson.  Yum :-)!    Update: 7/1/2007 Meet up with Patrick M. at Washington Square Park and headed over to Columbus Cafe.  Good times, great company, interesting conversation, 5 beers and a shot of fernet each -- perfect way to get to know someone better ;-)!  11/28/2007: Wednesday Night The roomie and I decided to spend a weeknight at Columbus because of Thanksgiving the next day... no WORK!  As we sat having some great conversations, random guys started approaching towards us.  The guys were decent, but not good enough to pursue.  Update: 3/25/2007 Sunday night drinking with a fun, cool guy.  CHARTREUSE, FERNET, and TUACA shots.  Then two pint glasses of Hoegaarden on tap made Miss C very, very happy ;-)!  ********_________________**********  It's been a stressful week because of moving, but I finally had some time last night to relax.  After watching LOST, Randy (Guy #1) and I took a stroll down North Beach to Columbus Cafe. The bar wasn't too crowded, just a few people here and there and a group playing pool -- a very chill atmosphere.  We sat at the bar.  He got a pint of Stella Artois and an Amstel Light for me.  We talked, kissed, as we sipped our beers while watching \"Hooters Beauty Pageant\" on TV.    It was a perfect night: \"At Last\" by Etta James was playing from the digital jukebox, a handsome man by my side who occasionally whispered sweet nothings into my ear, 26 microbrews on tap, $3 fernet shots and Smiroff Ice, friendly bartenders (they are awesome), clean bathroom, and happy hour everyday from 4p-8p with 2 for 1 specials (2 beers for the price of 1).  Beer makes me happy.  Beer with a man who is a great kisser is even better ;-)!   I predict that I will be a regular here at Columbus Cafe because it's a few blocks away from my apartment.  Will probably be here at least once a week.  It's a great place to hang out with friends afterwork or with a date for a late night drink or two.  Try the Pyramid Apricot Pale Ale -- it's yummy!  Total Beer Count at the end of the night:            Celeste: 3 Amstel Light           Randy: 4 Stella Artois  PBR me, ASAP!", 
    "review_date": "2007-03-08"
  }, 
  "bSY04kIrbB3J9cyNBiKfcQ": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Paul C.", 
    "review_text": "Been here a few times when I am out in the city.  It's a cool place to get some drinks in before hitting the bigger bars/clubs in the area.  Drinks are reasonably priced but service is a little slower.  Each time I've been here, there was only one bartender but I still got my drink.  I'd come back for a visit next time I'm in the Northbeach area.", 
    "review_date": "2009-04-11"
  }, 
  "GVeOyQJ1uTKvxNF-9d6eFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mike m.", 
    "review_text": "After a long day at work this is my go to place. $2 fernets and a huge selection of 2 for 1 beers till 8. This place is a bar, nothing more nothing less. Bartenders are always cool i.e. karlee, zoe, danielle. If you want a laid back place to get a beer with no pretense this is the place.", 
    "review_date": "2007-01-28"
  }, 
  "xO1fXjGulknU5nWbKghKMQ": {
    "user_rating": 3.0, 
    "user_location": "Trinidad, CA", 
    "user_name": "Maggie D.", 
    "review_text": "2 for 1 happy hour = good  However:  I'm sick of walking to work and sidestepping 6 piles of puke from CC casualties.  Early weeknights = good Thurs - Sun nights = oh hell no.", 
    "review_date": "2007-09-14"
  }, 
  "8Kg5_KZ2rdvjJclbqgrBiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "California B.", 
    "review_text": "We had a great time in here with Angelita. Nice bar w good drinks and cold beer.  What else would you need to know?", 
    "review_date": "2013-11-18"
  }, 
  "tRoHSuw45Gex_Eeu1g3xRg": {
    "user_rating": 4.0, 
    "user_location": "Mount Airy, MD", 
    "user_name": "Rick P.", 
    "review_text": "Great local bar. Everything was awesome here. Great beers, customers, and staff...except for one. The bartender named Evan was really rude, condescending towards me, and borderline offensive. He never gave me my free beer (BOGO) and accused me of lying when I asked about it. This guy could really ruin a good thing. I asked the locals and apparently, he is rude to just about everyone.   Overall, ill go here when I'm in SAN FRAN.", 
    "review_date": "2013-03-04"
  }, 
  "_SVAW_bwFx3G2tDqmsmOBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven R.", 
    "review_text": "Sometimes you travel around North Beach in disgust.  You're surrounded by overpriced restaurants, you get stopped by tourists for an Italian restaurant recommendation and finding a parking spot is atrocious.  But then you happen upon an awesome spot like Columbus Cafe and you regain trust in the neighborhood.  It's just off of Columbus on Green, away from all the terrible crowds and other tourists too scared to veer off the main street.  They have a slightly above average selection of beer with Speakeasy and Dechutes to keep some of the more beer savvy happy.  They had non-Sharks hockey on the tube along with other sports (I call a Bay Area bar legit if they're willing to show more than just Sharks' hockey).  The place is low lit and has the perfect amount of ambiance (and tiny bathroom) to make you feel like you're at home in San Francisco.  Adding it all up, I probably could've been here for at least a few hours if I didn't have to be somewhere else.  I doubt it's going down as one of my \"favorite\" bars just yet but Columbus Cafe is definitely worth a stop if you're drinking and in the 'hood.", 
    "review_date": "2013-06-02"
  }, 
  "_yS8hvlOf9B48h_qgyd0CQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Tom A.", 
    "review_text": "After about 20 minutes in this cafe/bar, I was pretty impressed.  The draught beer choice was good, the service was friendly, the location was great and the ambiance is entertaining.   Columbus Cafe has a lot to offer, whether you're looking for a snack, happy hour special or just a place to surf the internet on their computers.   Another cool aspect: the ceilings in this place are HIGH, which allowed the decorators to get creative and give CC an even more amazing feel.   Go there immediately and be merry!", 
    "review_date": "2010-02-06"
  }, 
  "WNQNNhAVbtX4Ki-Xn1EfCQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel M.", 
    "review_text": "I guess I was hitting on the bartenders lady, because he kicked me out. Must be nice to have faux power bitch. Have fun bartending at a jenky ass spot.", 
    "review_date": "2015-01-24"
  }, 
  "xW7Umtxl_-eKnVQmm3wLbA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer U.", 
    "review_text": "Don't be fooled by the name of the place, it's not a cafe, but rather a place to have good drinks, beer and watch sports!   I've been here a couple times while waiting for a table for dinner at a nearby restaurant. It's always super packed on Friday or Saturday nights, especially when there's a Giants game on (or any other Bay Area sport!) Both times I've been here, I've had a good time drinking and hanging out with friends. It's a nice little spot to hang out if you have nothing to do and you're around the area.   The drinks aren't expensive, but the bar can be packed at times, so be prepared to wait a little, mainly because there's usually only one bartender. There's also a pool table inside, so you can hit some balls into holes if that interests you at all.", 
    "review_date": "2013-01-22"
  }, 
  "VQG45LKVq2H_Owa7hnUV-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "P J.", 
    "review_text": "I've only sailed in here once, but it's a fun dive bar in North Beach with a lot of decent beer on tap and they're likely to be showing \"the game du jour.\"     There probably isn't a better bar in San Francisco to celebrate a guy with bad navigation skills who named the people already living there after the land he thought he was in and then traded corn for infectious diseases.  Happy Columbus Day!!", 
    "review_date": "2009-10-12"
  }, 
  "vTugBdYg34rX4KvGpzBrNA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sonya D.", 
    "review_text": "A group of us went here after dancing and of course I was WAY over dressed. I didn't get too many weird looks which is always good! There was fun music playing and some people were all out dancing in the small space. I shook my butt a little bit, but nothing too extreme. The bartenders were really nice and fast, I never had to wait more than a minute to get a drink.  I was also told that there is a cool downstairs area for private parties which sounds pretty cool too. This is just a really chill, fun bar to go to!", 
    "review_date": "2009-01-26"
  }, 
  "G8RpowvR9LodKj4_BCPMaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "I remember coming here! I do! I swear to it! I have a happy-hour drink token to prove it.  That's what I like about Columbus-- two for one beer at happy hour.  At any other time... I don't think I'd give Columbus four stars.  Just, please, for goodness sake, stay away from the fernet, especially on an empty stomach. It may taste alright at first, but it's got a horrid aftertaste, and will fuck your shit up. Thankfully I had arrived in the company of a beautiful woman who was more than happy to short-circuit that trainwreck and get the heck out.", 
    "review_date": "2008-02-14"
  }, 
  "9VXqxCMuYybCpk-Wuf3Nvw": {
    "user_rating": 5.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Stephanie F.", 
    "review_text": "Best dive in town in my opinion..and right next to the best pizza and Italian place. My boyfriend often works in SF and stays in North Beach so we can just crawl back to our room if we need to, ha! Lots of good people watching too..mostly locals who are regulars like the Chinese Johnny Depp and Def Leppard Mullet Man. We love the jukebox and playing pool there..everyone is usually happy.", 
    "review_date": "2014-12-02"
  }, 
  "8fgiuFMuN5yfoALzts-K7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "A cool bar, I find myself hanging out at this place somewhat regularly.  Pool table in the back and a few TVs to watch a game on.  Good prices for drinks.  They even play some pretty good rock music on the speakers.  Only problem is, as with most bars in San Francisco (and North Beach especially, it seems) the douchebag clientle can sometimes make an appearance.    Best time to go to this bar is on weekdays so you can avoid the crowds and get in on the drink specials.", 
    "review_date": "2008-03-17"
  }, 
  "PvMpZhBQ03nfa19yxMZo9Q": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "katie f.", 
    "review_text": "best bar i found while visiting the bay area...amazing happy hour! its always crowded but the bartenders are super nice and quick at getting you drinks", 
    "review_date": "2012-12-07"
  }, 
  "XP32BMm5JmcogLMTf-JUGg": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Helen V.", 
    "review_text": "I love their happy hour special. To top that...I once got a beer and grey goose and sprite for $13. How awesome of a price is that!", 
    "review_date": "2010-08-16"
  }, 
  "zC42MRNl9NLKzbtYzAG24g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karl B.", 
    "review_text": "2 for 1 happy hour with reusable poker chips = yippee skippee.  I went here on a random wednesday afternoon and ended up touring the world via beer.  They have enough beers on tap to satisfy any thirst you might have.  Had a lot of fun hanging out with everyone inside.   Joseph M's review below says it all.  Check it out.", 
    "review_date": "2009-01-21"
  }, 
  "B_aCdiBTkte92sOGlmLWlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate H.", 
    "review_text": "$2 FERNET SHOTS. Need I say more??", 
    "review_date": "2006-08-08"
  }, 
  "jXzwG-IK0Xw0khZTPFsFxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon L.", 
    "review_text": "My favorite place so-far for Happy Hour in the City. You buy one round of beer and get tokens for each beer to redeem a free beer before 8:30pm. If you don't make the time you can take them home and come back with them next time.  On the outside the place doesn't look like much, and it's actually a little small but I always seem to have a great time here!  I've seen two bartenders here and the guy is much nicer. Once he gets off around 8ish expect to be carded by the girl bartender. She doesn't mess around, even if you have been drinking...she'll still ask.", 
    "review_date": "2009-08-17"
  }, 
  "xADAW32u15sgA18Hfy9PsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin F.", 
    "review_text": "Happy hour till 9pm. huge tv for MNF. good times.", 
    "review_date": "2012-12-18"
  }, 
  "rCuvDG-3Mo7jB1sJehZZsg": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Tuan N.", 
    "review_text": "best happy hour in town: buy 1 drink and get a token to get another drink free  couple that with the fernet shots and you're in for a good time.", 
    "review_date": "2007-10-31"
  }, 
  "R2p221627ZK5IhFBVI0OzQ": {
    "user_rating": 4.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Constance C.", 
    "review_text": "I finally found my favorite neighborhood bar, a quick walk through the alley and I'm home which is a perfect stumbling length since I seem to enjoy their drink specials a little too much when I'm here.   I went here for the first time during the day with my roommate, we were the only ones there. The bartender hands us water balloons and informs us we need defense because we're in the line of fire. We got caught in a water balloon/super soaker fight with the bar across the street. A bloody mary, 2 fernet and sodas, 2 beers (these just being the drinks I consumed) and a few hours later my roommate and I left soaked in water and spilt beer.   I of course had to do my research and went back the next night to check out how the place was at night and I still loved it. Fun bartender, jukebox, photo booth, pool table and a small but not cramped bar. So far, so good.", 
    "review_date": "2009-08-11"
  }, 
  "ZbOK_2m4kifew3lzTep1yQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Jaime L.", 
    "review_text": "This place \"hosted\" my *very first* DYL, and I'd have to say I was SUPER excited!!! I was already in North Beach visiting a friend who had surgery, so I thought \"why the hell not? She's sleeping, might as well have a drink for her\".   AND I WAS RECOGNIZED!!! Thanks to the manwhore who boosted my ego up like a damn puffer fish by recognising me in public as a yelper, we headed over to Columbus Cafe so I could meet-and-greet the people I had been harrassing and stalking on a daily basis online.  Carl was ever so kind as to purchase my drinks for the night--two shots of PATRON SILVER (note: Irish Bank no have-y), and a beer. I was able to ward off Amanders and her Fernetsluttish ways by playing the game \"Pass the Fernet around, don't let it stop at you\". It was almost like Hot Potato, only instead of burning your hands/getting out, you would be passed out on the floor vomiting and wondering why and how anyone could ever let you do that.  $3 Fernet shots = deal = bad idea.  The music was awesome, great for the Jaime who dances when she drinks. The bathroom was all kinds of strange, though--?? But still fun! It had a shower curtain...there was adequate room, and a POOL TABLE!! Now, I was too busy meeting and greeting, so I didn't get to play..but rest assured if and when I come back, there will be heads rolling at my sk1llz.   I still ended up almost puking at the end of the night, though. For that, 4 stars. It means it was a good night.", 
    "review_date": "2008-02-05"
  }, 
  "Q5p1GebACk8bLbCAbhjPCw": {
    "user_rating": 4.0, 
    "user_location": "Hilmar-Irwin, CA", 
    "user_name": "Louis B.", 
    "review_text": "First time at this bar and felt right at home.  Happy Hour can't be beat - 2 for 1.  And if you're hungry Golden Boy Pizza is practically next door.", 
    "review_date": "2010-03-16"
  }, 
  "vTlojZMXP1SsYUit4urP7Q": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Spenser T.", 
    "review_text": "This place was a sh:thole.  Maybe it was just because we stopped in during a football game, but the bartender was rude, at one point a \"regular\" started yelling because the bartender wouldn't serve him unless he paid cash (apparently a long overdue bar tab) and are drinks were terrible.  The advertise fresh squeezed Russian Standard greyhounds, it tasted like well vodka and he used a half a grapefruit in the press for our 3 drinks.  When you looked at them the first was dark pink, the second light pink and the 3rd was clear, I wouldn't have cared so much if it weren't that there were $8 drinks.  The place was filthy and sticky, I hear they have better specials during the week so maybe I'll give them a second chance, if I'm very very drunk.", 
    "review_date": "2015-01-20"
  }, 
  "h3w0zczOY4rETWz1FLwPPQ": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "GreenEyez M.", 
    "review_text": "Here's why you should give this bar your business:  <a href=\"/redir?url=http%3A%2F%2Fwww.sfgate.com%2Fcgi-bin%2Farticle.cgi%3Ff%3D%2Fc%2Fa%2F2011%2F06%2F25%2FBAMN1K2H7U.DTL&amp;s=16f200dbfba68b8d01d2d0a12f9541dc922a36f57582fd6ebd78b01b0bdae1d5\" rel=\"nofollow\" target=\"_blank\">sfgate.com/cgi-bin/artic…</a>", 
    "review_date": "2011-06-25"
  }, 
  "f81Y2EzuRqefayCrL1Ra3Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Winé C.", 
    "review_text": "Columbus Cafe is just ok.  The place is tiny and from what I saw, served mostly beer.  The bathroom line was intense for such a small place... It almost made me feel like I was at a club.  Chill, quiet, normal, no frills place. Just be wary of when it gets crazy busy!", 
    "review_date": "2014-03-19"
  }, 
  "vNlpdOzG7WpH2Wz0oNVuug": {
    "user_rating": 1.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Shawna N.", 
    "review_text": "Oh man. All I remember about this place is this bitch bartender yelling at us to get out of the bathroom, saying that we don't all need to go together and blah blah blah.   We may have been on lush time, but I swear we were in and out of there in like under 3 minutes. I don't know what her freakin problem was.   And it was St. Patty's day! irish car bombs and guinness galore and you don't think we are going to have to frequent the loo at least once??? Jeez lady, we are paying customers, except next time we'll be paying somewhere else! Beeezy!", 
    "review_date": "2009-05-07"
  }, 
  "IxKVvGmFIEz77YYL-5_YxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N S.", 
    "review_text": "Love that this place does 2-for-1 drinks during Happy Hour. Except, beware of the color of your chip when you redeem your next drink because your second drink has to be of equal or lesser value. I didn't know that the first time and the bar tender wasn't nice about it. Whoops, looks like your going to have to \"sit on that Guinness all night\", bro.", 
    "review_date": "2011-03-08"
  }, 
  "92X37S-hY1cYhl4IgedpMA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "jamie z.", 
    "review_text": "I get off three and its a hop and a skip away from the financial so i can beat the rush, the best part about this bar is the two for one happy hour... does anything else really matter????  i think i still have tokens left over for this joint..", 
    "review_date": "2007-06-21"
  }, 
  "tmxIsLKcNd9qG6nbL6ONbg": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Stephen S.", 
    "review_text": "Came in here for a late night beer as was hopping around the area. Good beers (and I'm all about extensive beer menus) and good prices, plus it was still open and bringing in people late on a Tuesday night.", 
    "review_date": "2010-11-12"
  }, 
  "iOjwFYpHWo7P0rqmIfLm9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah M.", 
    "review_text": "I think for those of you who know me...I am a classy girl. Classy with a C and not a K.   I DO love a dive bar, however, and feel mostly at home at a place like the Columbus Cafe...becasue of its unpretentious airs.  You can't rate this place on what the crowd is like- you never know what you are going to get here with that- but you will get a great stiff drink, you might play pool and you can always get in the photo booth with some strangers.  Our favorite friend- Summer is the manager here and she is so customer focused- you'll feel like you are in her living room.  The owner comes from a long line of Long shore Union members and a lot of those folks still consider this their place to hang...so for the girl looking to meet a Salty Sailor, Fireman or a guy who works with a lot of rope- this place is for you!", 
    "review_date": "2012-07-13"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 4.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "I love coming here for their two for one tap beers. Buy one and get a token for a second free one. The awesome thing is that you don't have to redeem it right then, you can come back during any happy hour (4-8, 7 days a week) and use it. Which is good for me since I often am great after just one.  One thing to take note of, though, is that you can't use the free drink at the same time. If you buy a beer and want to give the free one to your friend, unfortunately they won't let you (boooo).  Pool table in the back which is always a good thing.", 
    "review_date": "2010-05-03"
  }, 
  "XiVlH054UZ3A964ZIrBkPg": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Devon S.", 
    "review_text": "I am tall. I am white. I refrain from clapping when cheering because I can't hold the beat. When I was nine, I was subjected to three months of Advanced Russian Character Dancing, where I was constantly chastised for no flexibility or grace.  On all accounts, I am not made for dancing.   And yet, after a strong long island and some devilishly good vodka redbulls from the super chill bartenders at Columbus Cafe, I was providing the bar patrons with some real entertainment via my ballroom dancing skills to Heart's classic song, \"Alone.\"*  I think that my time to be a superstar has finally come.   *Based off a hazy memory that is undoubtedly certain to be 100% accurate based on no facts whatsoever.", 
    "review_date": "2007-11-18"
  }, 
  "2_cvh63d0CM33n1cP-3YZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "Good 2 for 1 draft specials, and a jukebox for your own music, but it can get kind of crowded for my taste during peak hours because its such a small spot.", 
    "review_date": "2013-04-02"
  }, 
  "SBRh4JMlv64ZC8pp3Bidlg": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Clyde F.", 
    "review_text": "Dear Chuck,  Last night I saw Vietnam Tom (a/k/a Epic Beard Man) exit Maggie Maggary's and gruffly announce that he was going to the Columbus Cafe.  This gives me hope.  All the best, Clyde", 
    "review_date": "2013-02-12"
  }, 
  "vtX_fsEbpSMYBQYHwbontA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stuart M.", 
    "review_text": "This is an outstanding performance here in the place. The bar is awesome and very decorated place too. The staffs are so cordial and fast in their work. Wine collection is strong and rare. I will be back to the place again. Highly reocmmend it to my friends.", 
    "review_date": "2014-04-25"
  }, 
  "3K_kEI0iHKf-G8ePsBM4ZA": {
    "user_rating": 1.0, 
    "user_location": "Little Tokyo, Los Angeles, CA", 
    "user_name": "Angie F.", 
    "review_text": "The ambiance was great, but unfortunately the only bar staff (this bald guy with a fedora and glasses) was the biggest dick to me and my entire party. He was abrupt, condescending, and overall unpleasant. Not coming back because of that guy.", 
    "review_date": "2014-09-01"
  }, 
  "ZDYUxVKv2dd3CpOlc1ahRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geir R.", 
    "review_text": "I love the Columbus. The bartenders are awesome, and somehow they manage to 'persuade' me to have more drinks than I initially intend to! Whenever I just stop by for a night cap, it turns out not just the one...  And for some reason the late Sunday nights I've been there have been just crazy. Not crowded at all, but those staying until the small hours.... usually compensate!!", 
    "review_date": "2011-01-17"
  }, 
  "sBf5IfUPxTowTdUebPZVTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie K.", 
    "review_text": "Fun bar in North beach. The drinks we reasonably priced, the bar tenders were friendly, and the guy at the door likes the Giant's. All in all: a win.   The place had a decent sized crowd and we were still able to snag a table. They had TVs on with various News and Sports, music playing, and a bathroom = all crucial.", 
    "review_date": "2012-08-18"
  }, 
  "irw57xeOQP8ulpMGW06JCA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Pilar K.", 
    "review_text": "Delicious!!!! What more can you say??", 
    "review_date": "2011-03-18"
  }, 
  "BJWHEhjxxuBZ1HTtsUgBTQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "J. B.", 
    "review_text": "2 for 1 beer happy hour.  That should say it all.... but wait! There's more! Fernet.  There, I said it.  Fernet.  I love Fernet and when I first started coming here it was $2 during happy hour, i think it went up but still, its there and people drink it (it is SF after all).  The crowd is mixed, lots of regular, good group of regulars that play pool and the juke box always has something interesting playing.  I wish I still worked around the corner, I still have some beer chips.  Good joint.", 
    "review_date": "2010-08-05"
  }, 
  "XQMaAvF3YUslCD-0tZY1xg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brian D.", 
    "review_text": "Stopped in on Tuesday December 27th, 2011 around 6:30 while waiting for a friend. They're daily happy hour - except for the North Beach Festival runs from 4 to 8 PM with 2 for 1 draft beers which runs $5 with taxes included! Otherwise Fernet shots were $3! Screaming deal for SF.  Becca, the bartender, who was Johnny on the Spot was wearing an interesting helmet and was always quick to offer a drink. When entering they had the Celtics vs Heat on the TV's, however, they were playing club music on the jukebox which was making some patrons leave as it was only Tuesday at 7 PM. Becca, did offer a few dollars to one of the patrons to put into the juke box to fix the music selection.  Otherwise, one of the patrons - who must have had too much to drink - young, blonde gal was throwing up outside at 7 PM and had everyone laughing - only in North Beach does this occur i suppose. Location is amazing as it's right next to Golden Boy Pizza, which has some of the best pizza in town.", 
    "review_date": "2011-12-29"
  }, 
  "a-CtXGkmHkaaXSvnOLFxOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura W.", 
    "review_text": "Really cool bar... the two drinks I had were delicious and strong, and the atmosphere was just what a bar in the city should be.  It was a little pricey but I guess that's normal for North Beach.  The people were friendly and I would totally recommend this place.", 
    "review_date": "2008-02-22"
  }, 
  "xHI0MUS26PbAs92LYWKvTA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Joe K.", 
    "review_text": "I loved this place.  I loved the atmosphere, the bartender was really cool, they had plenty of beer to choose from on tap, there are plenty of televisions to watch, and it is roomy so you do not feel cramped. Definitely a great neighborhood bar.    The Wizard says; check it out.", 
    "review_date": "2010-04-18"
  }, 
  "gEUrtbRV0VLgwS3Da-CndQ": {
    "user_rating": 3.0, 
    "user_location": "Orangevale, CA", 
    "user_name": "Daniel K.", 
    "review_text": "Decent location in the middle of North Beach.   Typically a very diverse crowd any night of the week, fair prices on a bar with decent-good selection. Beers on tap are where the stars are earned and lost with bars, here they lose one. With the amount of tap-lines they have, they could surely manage a better selection, however, during Happy Hour decent beers being BOGO make it pretty much your last concern.  Pool in the corner, people getting ridiculous, photobooth option or a piece of wood with a hole in it for drunken pictures out front. Check it out during HH", 
    "review_date": "2010-12-09"
  }, 
  "QRyXsigFa4R3p4iXab0AKg": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Tyler C.", 
    "review_text": "Walked in and ordered a beer. Bartender was inconsiderate and didn't seem to want to be there but,but, he gave my me and my three friends free beer so I can't complain too much. Was very clean and the atmosphere was super fun. Was a good find and enjoyed my time.", 
    "review_date": "2014-01-04"
  }, 
  "ELpbKN6MrObbWoUdggUCJQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lake C.", 
    "review_text": "If you can't make it here for their 2 for 1 happy hour, then there is really not much reason to come.  Although during happy hour it's great.  Overrated bar with zero personality and no attraction.  Maybe I just don't get it.", 
    "review_date": "2008-12-28"
  }, 
  "zaBX3i2WgmixzgQBwA33GA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick C.", 
    "review_text": "I was happy to celebrate my 23rd Birthday here with some friends for late night drinks. The manager was SUPER nice (Janessa). I gave her a call last minute and explained how I am looking for a bar to having drinks with friends, she made the extra effort to help reserve a couple of tables for me and my friends.  She also was nice enough to give me my first drink on the house. When you have a bar ran like this, it's no wonder the place is packed.   They have a WIDE variety of beers on tap, and the place is warm and cozy. Their HAPPY HOUR is AWESOME. 4-8pm seven days a week. Buy one beer get a token to get one FREE! They accept the chips up till 9pm, so even after happy hour you can still drink FREE beers...pretty awesome!  They have a juke box with all different types of music. Moreover, they also have a pool table, and a nice size T.V. to catch up the the day's sports.   If you are in the area and looking to celebrate an event with friends and family. I would definitely recommend coming here.", 
    "review_date": "2011-01-17"
  }, 
  "_5uZ9Ur33MnFvpjeryyKMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystle S.", 
    "review_text": "This place is sort of hit or miss for me.  The bartenders aren't terribly attentive and I've been plenty of times (on a Friday, mind you) when it was pretty quiet and I was one of the only girls at the bar.  I know, I know, \"But you're a girl!  Aren't you supposed to love that?\"  Yes, I would if the pick-up lines weren't so bad.  On occasion though, the jukebox is hoppin, the Golden Boy pizza is pipin hot, and all my friends gather here for a super fun night.  Since the location is so central, and the drinks are reasonable, it's a good gathering place to start or end the night.", 
    "review_date": "2010-11-07"
  }, 
  "QDWVaK7QLAmSV0GJyc6g1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John W.", 
    "review_text": "Golden Boy to Columbus Cafe is the best 1-2 punch in the city. If you make it during happy hour you likely find yourself leaving in the wee hours without breaking the bank. Top it off with a pool table, photo booth, and awesome crew of bartenders and I'm happy.", 
    "review_date": "2011-07-27"
  }, 
  "l7V5w_vf9xv74As3abZukA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John Eric S.", 
    "review_text": "Great spot to have a few beers &amp; shoot pool with friends while watching a game on a non-weekend afternoon or night.  The bartenders are great &amp; know how to take care of their customers.   And you are sure to run into familiar faces from the neighborhood at any time.", 
    "review_date": "2008-05-22"
  }, 
  "PAuzCcKBzwRkiQhdqS0ftA": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Papandreou A.", 
    "review_text": "Not a cafe. A bar.  Lots of cheap drinks.  Thats good drinks and cheap prices not bad drinks with cheap prices.  Internet jukebox allows you to find almost anything you can imagine to play while you knock a few back.  Yay", 
    "review_date": "2006-12-06"
  }, 
  "sFWRvq9jgh8Co2tmwm_6SA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Joe A.", 
    "review_text": "This place is great. Great happy hour spot. Love the 2 for 1 drinks. Other bars have similar deals in the area.  Definitely a spot to drink up after a long day of sightseeing. Also a pretty good selection of drafts. Keeping this place on my list when I'm in the city.", 
    "review_date": "2013-08-23"
  }, 
  "q4bOVbSM9yb8RwIAcYedbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "monika l.", 
    "review_text": "Great vibe, great service, great great bartenders i.e. Karlee, great two for ones happy hour every day.   Now that is something great! Great!", 
    "review_date": "2006-10-17"
  }, 
  "OqH85SAF0oLijVY_SeAk8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donna H.", 
    "review_text": "Like cheers, I like a bar that knows my name. And though I work near by... Like around the corner literally, the bartender still never remembers our faces..   Gooood thing the happy hour is decent and within immediate reach.. Especially after work.", 
    "review_date": "2011-01-05"
  }, 
  "-0Nvk7jIo79LaxChQtDyLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex G.", 
    "review_text": "The last time I was here, one of my friends said something rude to the bartender (who I happen to be neighbors with) and then we proceeded to get our asses kicked out. \n  We weren't on the street for long, when a couple of guido tools we talked shit to back in the Cafe started gettin' salty. One of 'em grabbed my buddy Mike by the throat and started shaking him. Before long, people were just swinging all over the place, and some guy threw his cell phone at my face, which just *barely* missed. I picked it up and did my best Kerry Collins impression and threw that thing waaaaay over to the other side of the street. Perfect diversion, as the tool dropped my buddy Mike.\n  Fast forward 20 minutes, and we managed to sneak back and apologize, which netted us a couple shots of Fernet. On the house. \n  Gotta give some love for the redemption shot.\n  The juke box is always playing something upbeat and fun and occasionally a live band will perform. Not necessarily the best-sounding space to see a show, but it doesn't sound horrible. Funny how everything sounds decent when you've been having 2-for-1 drinks since 4 pm. ;)\n  The drinks are pretty cheap, the crowd is fun and as the night moves on, the whole place turns into a crazy dance-lovers dream. \n  Minus one star for the fact that every time I go here, I end up waiting in some line to use the bathroom. Unlike some patrons, I wasn't ok with just going outside and taking a whiz behind, next to, or worse, ON a parked car. What if that was *your* car?! \n  I'm not gonna be that guy!", 
    "review_date": "2006-07-27"
  }, 
  "lI_BQEP8HctfwKQQc18EhQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Nate E.", 
    "review_text": "Probably the best after work happy hour in town - get there as early as possible before it gets too crowded. They have 2 for 1 beers until 8pm and a great selection on tap. Bartenders are great, the girls are cute and the jukebox has a great selection.  The best part about this place is that they are next door to Golden Boy Pizza, so once you get some drunk munchies stop by for some of the best slices in SF.", 
    "review_date": "2008-05-14"
  }, 
  "doz_wwj6F6Ln9ykODiLtZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett W.", 
    "review_text": "I schlepped halfway across town to watch every Giants World Series game here. They've got great atmosphere, great regulars and a great Happy Hour special-- you buy 1 beer, you get a token good for a second one free. 'Nuff said...", 
    "review_date": "2012-11-02"
  }, 
  "_Idlsaw2hXJN8NtNWamt2Q": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Meg W.", 
    "review_text": "I made good on my threat to come to Columbus Cafe outside of North Beach Festival.  I gotta say, I don't mind this place at all.  It was lively, people were friendly.  Some cute young girl told me I was *incredibly hot with [my] joan jett thing going on, and [she's] not even gay either!*  I bought her a drink.  We met a lively bunch from Liverpool, had a lovely time playing some iphone truth or dare with them.  When \"I felt the rains out of africa\" came over the soundsystem -  within seconds the entire bar was singing along, quite loudly and quite badly.  The bathroom was roomy enough for two.", 
    "review_date": "2010-07-10"
  }, 
  "z-kyHYF6oUad7inUVG0Mzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason E.", 
    "review_text": "God I love this place.  The bartenders are awesome, Paul the owner is great.  I got to know them all over the years and they're flippin awesome.  $4 Fernet shots, 20+ beers on tab, and a pool table...I almost lived there for my first year in North Beach.  Hell, I still live there. Do yourself a favor and go!!", 
    "review_date": "2010-04-06"
  }, 
  "_lbgVbWTvxV9VTVWU0YnwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noneya B.", 
    "review_text": "I like the happy hour... and the girl that works during those times.  When that one guy works... yeah, you know who you are, you're not so friendly!  But, that's ok... we're there for the deals, not for the friendships.", 
    "review_date": "2007-10-08"
  }, 
  "0M6iVk5VtlS9wk45FfPvZw": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jake H.", 
    "review_text": "It's cool. -but  I'm not sure how much original personality it has.  -for the area it's awesome.  I recco it to anyone that is around drinking in that part of the hood.  The bartenders are nice, but sometimes seem a little cheesy.  Apparently they have a pool team that competes!", 
    "review_date": "2009-04-10"
  }, 
  "1xvmDofA0MvWDSD2hJAvyw": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Lauren M.", 
    "review_text": "Awesome happy hour.  Two for one drinks during happy hour.  Kinda dark.  Super casual.  Great bartenders.  Awesome jukebox.  Pool table in the back.  And I always forget they have a downstairs!  I think its only open on the weekends though.  But its' like an entire other lounge below.  Great bar.", 
    "review_date": "2007-03-15"
  }, 
  "RR-hNSxTUs4CSkGQZLEWyw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jamie L.", 
    "review_text": "Happy Hour = Buy a beer and get one free.   Dodgy bar but with a BOGO deal I'm all good. Too far for my taste, but when I roll with my co-workers its always fine with me.", 
    "review_date": "2009-03-01"
  }, 
  "R4DVayqiW63jHle7AG_NXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha M.", 
    "review_text": "Quite nice!  Went there for a couch surfing underground meeting/good bye party and was not dissapointed. They have a variety of different drinks... they had Campari and Midori, which was quite a refresher, it's crazy, usually I go into a bar and they carry one and not the other. Weird!  They made drink specials available for us (since we had a LARGE group of 40 + people!) and the bartenders were all really sweet, nice ladies.  -- We interrupt this review to talk a litle bit about bartenders-- When ordering a drink at the bar I made sure not to forget my pleasantries, I always ask them how they are and how their nights are going. You wouldn't believe how nice and sweet they can be after that. People who usually have trouble with bartenders often forget that they're people with feelings too, not just machines who's sole job is to look cute and keep the drinks flowing. --Now back to the review-- There were pool tables, ample places to sit and congregate and REALLY REALLY REALLY nice and friendly patrons. I will definitely be back. I never went in before because I thought it was one of those overpriced cafe restaurant type of establishments, boy, was I happily mistaken. Great bar all around!", 
    "review_date": "2010-02-10"
  }, 
  "CkhhGX0pkLcUmgpXVfx95g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marcin P.", 
    "review_text": "Spend some time in this par this past fleet week... I was very surprised at the fun had by all here.  The bouncers were cool in--fact i'm almost sure i got one of them laid.   All n all i was too drunk to go into details on this but trust its a great recipe for a  random Saturday night in the city!!!", 
    "review_date": "2011-10-20"
  }, 
  "NZwGgyT2BVjfWm6h-orOrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve B.", 
    "review_text": "A great newly discovered North Beach watering hole. Amazing 2 for 1 happy hour, affable barkeeps, solid tap selection, good jukebox, pool table, plenty of TVs for the game, and an unassuming, down to earth crowd.   3 craft beers and a shot of Makers and my bill was only 16 bucks. Will definitely be back. Glad I stumbled across it.", 
    "review_date": "2014-05-29"
  }, 
  "iY41hl-J7Nw32spi0BalUg": {
    "user_rating": 5.0, 
    "user_location": "PORTER RANCH, CA", 
    "user_name": "Linette P.", 
    "review_text": "Awesome hole in the wall bar a friend and I wandered into while visiting S.F.  Our first night there and we were in luck. We found parking right across the park and stumbled in here since I was dehydrated from the walk across the park. So glad we ended up here. Awesome drink specials; awesome people. I couldn't have asked for a better first night in S.F. Thank you folks for making my night memorable-somewhat ( blame the alcohol) . :)", 
    "review_date": "2013-05-25"
  }, 
  "sXLAy83l7EwdZjsYFbaq0A": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kara B.", 
    "review_text": "My first visit here a few years ago, I really thought I was being taken to regular café, and was pleasantly surprised to find a dark, low-key, chill watering hole - complete with a couple of TV's, jukebox, and pool table.   Cool, friendly bartenders. They also have a great happy hour - buy a beer, and get a poker chip good for a free beer - but ya gotta use your chips by 9:00pm, so chug-a-lug. (I'm always finding random poker chips that the old man didn't use, in my purse). And, I just love their t-shirts and hoodies - adorned with a sexy pinup mermaid holdin' a cold one.  And, I love the photo booth... I got some good blackmail pics of the old man as a sexy blond!  We always end up making a stop here whenever we're in town. A café, it is NOT - A great little dive bar, it IS!", 
    "review_date": "2010-01-26"
  }, 
  "B4cJvWuf59j7XlTdexnVZw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marc S.", 
    "review_text": "Despite the \"Cafe\" in the name, this is only a bar.  Great 2 for 1 special every day 4-8pm on a nice variety of draft beers.  You can use your free beer chip until 9.  The place is a dive basically, but they have some TVs for sports, a pool table and it's close to Golden Boy Pizza for a slice or bring in some North Beach Pizza.  Smoking seems to be allowed and though I don't, I feel it adds to the \"charm\" of the place.", 
    "review_date": "2005-04-07"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "A surprisingly chill weeknight spot, considering the two for one deal. Stopped in last night with friends before getting pizza at Golden Boy and heading to Cobb's for a show.   Buy one get one free draught beers till 8PM, and your token is usable till 9PM, which is awesome. I'm thinking it's a more laid back vibe because it's off the beaten Financial District path. If Columbus was on Montgomery or Market, it would get weird more often during the week, methinks.  I went in a few months ago with my friend who was visiting from San Diego and she loved it. We got shots and beers and their special of the night, Sweet Tea, and we got a tad wasted. But popped over to Golden Boys to soak up the booze. You can bring your pizza to the bar with you.   They have a juke box, photo booth, pool table, lots of TVs, and a downstairs area too for when it gets packed. Nice to have the option of escaping the douchery.", 
    "review_date": "2014-06-20"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Surprisingly great bloody mary's, 2 for 1 beers between 4 and 8 PM even on the weekend, great beer selection (hoegarden, franzikamer, apricot ale, etc), nice bartenders, pool, great music, convenient location, love it!!! :)", 
    "review_date": "2008-08-11"
  }, 
  "8zQczqnkwWkLENdlMMdqBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee L.", 
    "review_text": "Great Happy Hour. I love to use my drink \"chips\" on cold nights", 
    "review_date": "2007-11-19"
  }, 
  "SapOcLmnu_E3WpCb0lYiKg": {
    "user_rating": 5.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Mariah M.", 
    "review_text": "Let's say that your average bar gets three stars.  A bar doesn't need much more than alcohol, a place to sit your butt, and someone that will pay attention long enough to you to take your money and pour.  So, following is a list of things that make the Columbus Cafe earn those extra two:  1. 26 (or somesuch) \"microbrews\" on tap.  They have their own Columbus Cafe Amber, and they have Franziskaner. Cheers!  2. Friendly staff - the people behind the counter have been very cool each time I have been here.  One bartender recommended an iphone app (shazam), another one ran out to my table because I forgot my poker chip at the bar.  Which, of course leads me to...  3. 2-for-1 beers during happy hour.  Can I get a hell, yeah?  4. A pool table, and non-wankers playing pool at the pool table.  4 1/2. A disco ball over the pool table (it's the little things).  5. A jukebox that seemed to have a good selection.  I heard the Yeah Yeah Yeahs three times one night.  Of course, it was the same Yeah Yeah Yeahs song each time...  6. They accept credit cards, and don't seem to give you any crap about a minimum on the card (I've only ever charged for two beers or more, though, so I don't know if they'd balk at closing out after just one).  6. A clean toilet.  This cannot be overrated. Ooh, and there was a swanky velvet curtain as well.  So posh!", 
    "review_date": "2009-01-18"
  }, 
  "TSdV_lsddT4F3TJvmdmXag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie K.", 
    "review_text": "Enter, stage left: Amanda C and her going-away-to-Paris-for-work-oh-darn-life-is-so-­hard party. Enter, stage left, five minutes later: two people mildly inconvenienced by Amanda C, for which Amanda loudly proclaimed something about being pond scum/parasitic/an amoeba/whatever, there was a lot of beer consumed yesterday, I DO NOT REMEMBER.  And then ENTER THE BEAUTY OF COLUMBUS CAFE: 2 for 1 beer happy hour, and if you don't use your beer tokens, YOU CAN TAKE THEM HOME AND REDEEM THEM NEXT TIME.  Amanda had a few beer tokens.  Guess who ended up with those free(ish) beers?  You are a smart reader.  Yay:  2-for-1 beer happy hour until 8pm. Naked lady photo hunt! Pool tables! Pretty decent music - although, seriously, patrons, Motley Crue and Van Halen? Buttrock makes the baby Jesus cry (I won't deny I know all the words to every song that was played last night, though).  Nay: Patrons with popped collars Too far away from my home in the Sunset  All in all - I've been several times, including one night in the first year of law school during Fleet Week, trying to find sailors to ogle - and it's always been a fun time.  Bringing your own sailor helps, though.", 
    "review_date": "2009-05-02"
  }, 
  "XaKHchLtf0Ypqlad0oMpRw": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Skyler W.", 
    "review_text": "I came here after eating some delicious golden boy pizza next door and decided it was time for another shot. My friends and i came in on a Wednesday night at around 11:30, the bar had a decent amount of people drinking and it seemed like it would be like a cool spot to get some drinks on a Friday or Saturday night.   The shots were pretty cheap and they were filled to the rim, not much more you can ask for other than that. I will more than likely come back to this bar, it served me well and there were also some cute chicks in there, so thats always a plus!  Happy drinking", 
    "review_date": "2011-03-05"
  }, 
  "GR1A-sSEgU64aU30FWJhew": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Jim D.", 
    "review_text": "I used to get pulled here by my buddies when they wanted me to watch them get drunk and stupid...Well they got the drunk part here they brought the stupid part with them. Nice little bar with friendly bartenders and patrons.", 
    "review_date": "2005-08-31"
  }, 
  "zpmViTr7g_1Ig8jPO0VNSQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynsey C.", 
    "review_text": "I have a confession to make. North Star...I have been cheating on you.   It's been going on for a little over a year now and I really don't know what to say. I happened to go by the Columbus Cafe for NYE 2009 and after a few drinks, ended up having one of the best night's of my life. I told myself, this will be the only time I will allow this to happen...but a few weeks later, the neon sign in the sky beckoned me inside for just...one...more...time.  I couldn't say no! During the week, I was tempted with a buy one get one free happy hour and three dollar fernet shots. Then I somehow spent a wild and crazy Santacon pub crawl stealing kisses in the dark corners of the billiards area, and it was all over.   I assure you, it meant nothing...but I was wondering iNStar, if I can have you both as my favorite bars in North Beach? We can split our time...I'll come to you for Superbowl and Sunday funday, but on my birthday, I decided to rent out the CC Basement for a private party. For a small bar tab minimum, they are letting me bring my own food, DJ and have a private room for me and 50+ of my friends. I hope you understand.   I still love you NStar, but I have a secret lover called Columbus Cafe and I have no intentions of breaking it off.", 
    "review_date": "2010-01-20"
  }, 
  "H9uW3vt-lMQbvnNVubuwbQ": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Reino C.", 
    "review_text": "Always a stop when we\"re in the area! Fernet friendly, and 2 for 1 pints till 9pm!! Bartenders have always been cool to chat with!", 
    "review_date": "2011-09-22"
  }, 
  "yiMJmGMwDiwlld39R2Tm-Q": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Justin S.", 
    "review_text": "This is one of my favorite bars in the city... There are $3 Fernet Shots, 2 for 1 beers every weekday, and I love all the bar tenders. Karlee, Danielle, and Janessa... all are beautiful and all know how to tend the bar. Deffinitly check this place out if your in the area.", 
    "review_date": "2007-06-23"
  }, 
  "HPa7MNIwUyV5QBHVMMXujg": {
    "user_rating": 5.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Michael E.", 
    "review_text": "Been to this place once....and only once. As you can imagine though it satidfied all my alchololic needs. The bartender was cute (I forget her name but she was blonde and tatted)...Anyway nice, small, cool bar with good quick drinks....Can we ask for anymore?....I think not.", 
    "review_date": "2009-02-15"
  }, 
  "hYWwocw-J4KdyGLrUlOYXA": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Felicia L.", 
    "review_text": "While waiting for a table at Sotto Mare next door, my boyfriend and I went to this bar to chill and have a beer. We were lucky to be there at happy hour, where it was buy a pint, get one free. Super cool!  They had a pool table in the back so my boyfriend played with a few guys. The bar seems like a big local spot. It was already crowded by 8 PM lol. Overall, a chill bar with good happy hour and good vibes.", 
    "review_date": "2014-06-28"
  }, 
  "WJnEifJRkI6bCH2iw8brFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nenette Y.", 
    "review_text": "Fun easy bar in NB... yes, it gets PACKED but with cheap drinks and yummy chips who cares.   Great spot downstairs for a private party... will be back!", 
    "review_date": "2007-09-08"
  }, 
  "VOYvD-kerR204k0WrR0J3A": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Joe B.", 
    "review_text": "So we went here last night with a group of people. It took 40 minutes to find a parking spot. Missed most of first half of the Warriors game. Anyway, we liked this place. There are pluses and minuses. You can get two for one drinks before 8pm. The place was very crowded. Mixed crowd. They play some music and have a few big screen tvs. It wasn't bad for watching the game, having a few laughs, enjoying the scenery and having a couple beers. The bad part was the parking. I guess we already knew that would be an issue. The one other bad spot was the bartenders. I don't know if they are always that slow, but there is a point when enough is enough. It seemed like they were just laughing and talking to themselves more than trying to pour drinks. There were two of them, the bigger one who looked pregnant and the really slow one. I would suggest going to the biggger one.  We would go back. Stay away from the smaller bartender. Oh and they didn't say thanks after we dropped off a tip each time. Sort of rude. In fact, I don't even think either of them smiled.", 
    "review_date": "2007-04-14"
  }, 
  "PyFyZ6aJcGD0iPMSo9ag3A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nathan K.", 
    "review_text": "This is a great place to stop in for a beer. They have one of the best and most diverse (sometimes) beer selections (25 taps) in the area (one of the better in the city).   Generally - always - when wondering about the city if I am in the area, I will stop in for a lip smacking delicious pint (big supporter of the Tricerahops abd Racer Five which they carry regularly). They have a good amount of big TV's so if your in the mood to watch a game or an event is a nice place to come. The pool table offers additional entertainment, during the day it's easy to get a game in, but later into the night it becomes a little to packed to come  just for the pool. My favorite time to come is in the mid/early afternoon, not very crowded.   If you come here and you are hungry, a few store fronts down is Golden Boys pizza, I highly recommend (make sure you bring cash) a slice or three. You can grab pizza to go and bring it into the bar.   Happy hour is super unique! You buy a beer during happy hour and they give you a token (poker chip) good for a free beer (during happy hour). You can take it, you can use it then, or even for the eccentric  few - you can hoard them to build a tower.. (I have a few)..", 
    "review_date": "2014-09-06"
  }, 
  "xpRAjmgL-pIcIY_9iOpcQw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay W.", 
    "review_text": "How can you not love a place with Tenacious D on the jukebox?  As divy as they get...especially Kenny's Lounge downstairs...which I'm sad to say is gone...but used to be you could smoke and shoot pool while getting blitzed on very stiff cocktails while being serendaed by the vocal stylings of the worst karaoke artists North Beach has to offer.  If only they'd had \"Fuck Her Gently\" on the karaoke.", 
    "review_date": "2006-04-13"
  }, 
  "aBlXIipUwzl3wCIFIrFY-g": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Cesie A.", 
    "review_text": "I really enjoyed their happy hour. The bar is a little small with few places to sit but it was still cool. Love the buy 1 get 1 free beers. I'm a fan!", 
    "review_date": "2012-12-12"
  }, 
  "aON_SCN0U9G9OiHPye6pCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "andrew m.", 
    "review_text": "Happy hour - 2 for 1 - nuff said. The place usually doesn't get the usual trash that shows up on Grant street for Fri &amp; Sat night. Great place to hit up after work to get drunk for cheap.", 
    "review_date": "2010-04-12"
  }, 
  "PMbivTX8hrJ5E3kqhaDtcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Muki M.", 
    "review_text": "$3 fernet... how can you go wrong :0) Nancy, our bartender, was amazing and incredibly attentive and helpful.  She made sure we never had an empty glass and really made sure our group had a great night.  Usually went to grant and green, but I will definately be coming back here in the future.", 
    "review_date": "2010-01-13"
  }, 
  "wpazdZ37epyyUslec-ujcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jackie M.", 
    "review_text": "Owned by a friend's friend, Columbus Cafe is a locals dive bar. Located next to great Italian restaurants and a drunk person's heaven, Golden Boy, Columbus Cafe is a great bar to venture to if you're in the North Beach area. I only live a block or two away so after a bunch of tequila shots I just walked my ass home.   They have a pool table and photo booth. Unfortunately, I didn't get to try the photo booth out :( . Anyways, there is minimal seating; only at the bar and like 2 or 3 high tables. But everyone is just as content standing as others are sitting.  Will visit again I am sure.", 
    "review_date": "2012-06-08"
  }, 
  "_V6qMBCSzhwx96FLB3CJRw": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Pam S.", 
    "review_text": "It's amazing how many places I've learned about because of DYLs.  I came here for a recent DYL, and because I was sufficiently buzzed on the bubbly and some white, I'm not entirely sure how great or bad this place is.  What I do know is that someone bought me a beer, and apparently it wasn't the beer he expected.  While that was the fault of the bar or the orderer, I don't know, but I know the orderer is pretty on top of things.  It's not a huge bar, and I'd probably miss it walking down the street, but I'm always a fan of running into random exes (and I use the term ex very loosely)...provided we're still on good terms.  I wouldn't be adverse to going back, but I wouldn't make a point of doing it.  There are other places to get reasonably priced beer and hang with my friends...especially places where I don't feel so old.", 
    "review_date": "2010-06-18"
  }, 
  "tzCNZD_I-46eSHGpf3b9mQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Celia C.", 
    "review_text": "Pretty sweet spot with what I consider CHEAP DRINKS!!! ($5 cocktails) What is it about SF where I find their drinks and food so affordable (and BETTER) compared to LA. In LA, all our drinks are averaged at $12. Grr!! This place had more of a pubby-divey feel and great place to interact with peeps.", 
    "review_date": "2012-06-19"
  }, 
  "Qg4jyRW5sZa2N987Rgdsdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Solar E.", 
    "review_text": "Good playlist. Good happy hour.", 
    "review_date": "2010-12-08"
  }, 
  "1EQjprcscCLDBJDAT6oDIA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Merrill W.", 
    "review_text": "The staff here is amazing, which makes this place a favorite! They obviously make great drinks, but they're also incredibly friendly and attentive, which makes all the difference in a bar experience - especially with so many bars to choose from in North Beach.  I recently forgot my wallet here late at night, and the staff held onto it and returned it to me the next day. I mentioned the experience to a colleague, who had the same thing happen to her at Columbus Cafe and also got her wallet back - that says something about the kind of people who work there (as well as how much fun it is, because people are constantly having such a great time that they lose their wallets).", 
    "review_date": "2013-01-31"
  }, 
  "zvKDfdMm6K_xcc1i4GT5Yg": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Dela S.", 
    "review_text": "Recently stopped in here during an all day bar hop. I had one Greyhound and I couldn't leave for a couple hours. I'm a sucker for fresh squeezed drinks , cool bartenders and awesome crowds. I'll definitly head here first next time I'm in the city.", 
    "review_date": "2014-09-07"
  }, 
  "6KpxOoUnQyYGTd3Fuwk_lA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paige W.", 
    "review_text": "I think I've been here just once.  It's super divey and kind of small.  Draft beers.  Pool in the back.  Since I'm a fan of dive bars I'll probably end up going again sometime!", 
    "review_date": "2014-07-05"
  }, 
  "wSufVW03qQTQr1kSZ5pdFA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea B.", 
    "review_text": "Typical dive bar next to the amazing Sotto Mare in North Beach - a  few standing tables and a couple screens. We watched a sailing competition in Venice yesterday.  2 for 1 draft beers from 4-8, seven days a week.   Bartenders seemed friendly.", 
    "review_date": "2012-05-20"
  }, 
  "PAGIppDXVg12CyCa-gdLoA": {
    "user_rating": 4.0, 
    "user_location": "Incline Village, NV", 
    "user_name": "Nick H.", 
    "review_text": "2008 started off with two very pricey beers at Columbus Cafe.  $13 for two beers!?  $6.50 per beer?  $0.54 per Ounce?  Damn, thats some expensive beer. Thats like London prices.  Man, you fools in North Beach must be ballers to not be fazed by prices like that.  --- UPDATE a couple hours later --- I just got a message from one of the owners informing me that only the Chimay is that expensive. I think they need a bright, blinking warning sign on the Chimay that says: \"I'm SUPER pricey! Only for North Beach Ballers!\" I'm bumping them to 4 stars in anticipation of that sign, and because they seemed like a reasonably cool bar with a cool basement lounge.", 
    "review_date": "2008-01-02"
  }, 
  "LkM20gbDNUqXnGM1tLldlg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Devin G.", 
    "review_text": "If you're in North Beach looking for a good spot to hang out and grab a drink after work, Columbus Cafe is it.  Their happy hour is second to none...buy 1 beer and get a chip that's good for a second beer of equal or lesser value, redeemable at ANY future happy hour. So, if you're like me and frequent this place a lot, you'll eventually amass a stash of chips that you can use when you're short on cash, but still want to go and get a couple of beers after a hard day at work. Just don't forget to show the bartenders some love and be sure to tip on the chip.  While you're there, pick from a wide selection of beer on tap, as well as a full bar (yes, they have cheap Fernet shots, for anyone foolish enough to actually drink the filthy stuff). Be sure to try the house Amber Ale...it's fantastic, and something you're not going to get anywhere else.  There's also a pool table and a couple of TV's that will be showing the big game if it's on, and whether it's the jukebox or the bartender's ipod playing, there's always good music blasting.  And if you need a snack after all that drinking...Golden Boy pizza is just down the street.", 
    "review_date": "2011-05-18"
  }, 
  "ASi-DVa3LezKHCTOra_YAA": {
    "user_rating": 5.0, 
    "user_location": "Delavan, WI", 
    "user_name": "Ryan B.", 
    "review_text": "Evan is a solid bartender.  Very knowledgeable and friendly.  I was able to watch a Packer game and enjoy the locals tales of the previous nights craziness and laugh along with them.  This place made me feel at home.", 
    "review_date": "2013-12-15"
  }, 
  "XJhmTEAJuYRgIP4b9wMcTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mason G.", 
    "review_text": "Fun, friendly, and full of people, even on Xmas night who love to tell a story and hear one in return.  Give it a try!", 
    "review_date": "2008-12-26"
  }, 
  "qsJL1wqlNOrxvp_ItIV6Aw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter M.", 
    "review_text": "So happy I stumbled upon this spot just in time for football season. First off they have Sunday ticket so you can watch all NFL games at once. They have a bunch of TVs and even play the sound for niners games. Bartender was super friendly and made a killer Bloody Mary for me, my girlfriend had a fresh squeezed greyhound. They also have tons of beers on tap with good variety. This is definitely going to be my new Sunday spot", 
    "review_date": "2014-09-23"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Nothing special crowd, space, drinks. There are better places to spend your hard-earned cash.", 
    "review_date": "2006-05-21"
  }, 
  "ubF5zarbyXJVMTOZrSUFyQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ling H.", 
    "review_text": "Ok, this place is a great place to come to if you're a little short on dough.  2 vodka tonics for $11. Whaaaaaaaaat?! Drinks are super cheap compared to other bars, but that's what makes this place great.   And in my previous review of meeting fun/crazy people and the unexpected, I met a very forward lady in the restroom. She taught me how to work my pectoral muscles and made me feel her left and right ones as she showed me the difference in the working of those muscles. Very interesting. You get a diverse crowd here though.   The front doorman was also very nice and offered to take our picture outside with the Columbus Cafe stand. Thanks!", 
    "review_date": "2010-02-28"
  }, 
  "yJpv-WotvnyB-kvTwbycNA": {
    "user_rating": 5.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Steven N.", 
    "review_text": "Great place! Awesome beer/coffee/food and friendly service. Glad my fiancé and I chose to come here. ;)", 
    "review_date": "2013-02-14"
  }, 
  "dSnRjLEwAtqVAlz9NEbp3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "osmahn k.", 
    "review_text": "This is a great little bar. They have a small dance floor downstairs, friendly, quick bartenders, and cheap shots of Fernet.", 
    "review_date": "2008-01-02"
  }, 
  "MQL7RSeMrcmPdqf7ilF3zw": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Jeanie H.", 
    "review_text": "Great place to hang out with friends!  Back seats are comfortable and you get drink chips (vegas type chips) for a free drink.  Bar tender is very chill!! Great dive bar!!", 
    "review_date": "2013-10-05"
  }, 
  "R872fZFQmb9WPi3UaNkvew": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John G.", 
    "review_text": "Historical value, 2-for-1 happy hour, and attractive bartenders are good in my book.  $4 for a fuckin' Pabst in a non-nightclub, non-restrictive-entry, neighborhood bar setting is most definitely NOT good in my book...in fact, it tempts me throw my book through the front window.  Yeah, you ain't going blind. You read that right:  $4     for         a            P               B                  R                     !!!!!!!!!  Shit, throw in a tip and you're basically paying the price of a full PBR 12-pack at Safeway...for one fuckin' glass of Pabst with too much foam and air on top. Why bother? Stay at home and ignore the usual nighttime clientele of postgrads, fratboys, and off-duty waitstaff looking to score.  I might be tempted to let it slide and throw 'em 2 stars for that 2-for-1 happy hour, but mix in the shitty digital jukebox* and they should count themselves lucky to get one star and no window damage.  JG  * \"Internet jukebox\" directly translates to \"owner is a bland and non-committal man lacking distinctive class or tastes\" in this or any bar. Scrap 'em! They're crap!", 
    "review_date": "2007-08-05"
  }, 
  "vsaHsatoJrQjChsprt4Kxg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Toy L.", 
    "review_text": "Used to go here after work in the financial district and get the 2 for 1 beer specials.  Get a slice of pizza next door and you're good for the night.  Played plenty of pool games here.  damn, i miss living in the City.", 
    "review_date": "2012-08-13"
  }, 
  "DStFb_pjHJ0jtdWkXhVjMA": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "J D.", 
    "review_text": "Yes it's a dive. Love it. Yes 241. Til 8pm. Had prohibition beer how appropriate...  Best local hole in the neighborhood...give it a try!", 
    "review_date": "2011-04-13"
  }, 
  "dj-a8NPdDsPcBcSES2eflQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "patrick o.", 
    "review_text": "Thursday night drinking?  Wow.  Haven't done that in a while.    So long farewell fellow co worker!  Ah the only reason I get out on a Thursday night.  Parking is easy when its at 11 at night!  We all got our drink on and sad goodbye at the CC.    This place was so cool on a Thursday that there was about 4 locations when the homeless came in to clean up the drinks.....?  Haven't seen that before.", 
    "review_date": "2007-06-05"
  }, 
  "MvoJm96n-KJqmyrpEmyTVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claudia L.", 
    "review_text": "Amazing happy hour! 2 pints of on tap beer for $5 and you can keep the token for your second pint and bring it back any time during happy hour (I think it might be good until even an hour after at 9pm!?). There's a pool table and everyone is nice. I would definitely recommend this place!", 
    "review_date": "2013-09-04"
  }, 
  "CFL1vDhDfriHesGPJX09tg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anne Marie M.", 
    "review_text": "Why had no one told me about this happy hour? San Francisco friends you fail me. I just may have found my new favorite dive. I love this place! An amazing selection of beers on tap. But best of all, happy hour is 2 for 1 beers! AND it goes 'til 8! We're not just talking bud light here kids--Leffe, Magic Hat, Big Daddy, Wiedmer. $5 for two belgian beers?? I'm sold.   When I went in with my gal pal around 5 on a Tuesday the place was virtually empty. It was great for catching up, chatting with the people next to us and watching sports highlight reels. The bartender was super friendly to boot.   If only I lived in North Beach Columbus Cafe would totally be my Cheers!", 
    "review_date": "2012-07-19"
  }, 
  "pdML8Iv3MxVbQ1T94xZbiQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "George D.", 
    "review_text": "My favorite place to watch the good ole' Giants play! The best team in baseball deserved to be watched at a great bar and no where in this city is better than Columbus Cafe!   Cheap drinks, tasty food, plenty of tv's and above all a lively crowd!   Win or loose everyone still boozes at Columbus Cafe :)", 
    "review_date": "2013-06-13"
  }, 
  "qstOF_b3pvyVPyq4Qsyw-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "edward k.", 
    "review_text": "Came here twice so far for happy hour. The BOGO beer is definitely my achilles heal and plus they have franzikhaner!!! I love that beer!  The place is divey and the bathrooms are kinda gross but hey its a dive bar. Definitely located in a good area with plenty of food and other bars. The bartender is friendly and helpful if you are looking for good suggestions or something new.  I suggest taking public transit or cabbing as it is north beach.", 
    "review_date": "2012-03-30"
  }, 
  "pdnNeemAs7mcAg3n_UKeUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carlos M.", 
    "review_text": "Franziskaner Weissbier, naghhhh  Cool place, gets a lil' rowdy, killer happy hour specials, and surprisingly spacious... considering bars in the area.", 
    "review_date": "2011-06-29"
  }, 
  "yTNuMXKuqbgrn88Q-iwIlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "flo t.", 
    "review_text": "I'm nervous about doing a review on CC because everyone seems to talk about what's going on upstairs when the action is really down there - I mean downstairs. Make a left right after the bathrooms and it's like you're going down your grandparents basement to a makeshift/shxt living room. It's awesome! Live DJ and the oldest couches around to lounge sink in. Tony the bartender is great and will let you try a few of his lucky hats if you're not a rude asshole with too many stripped shirts. This is the ultimate North Beach dive hole for sure. Try it out for yourself.-no lines, on one bumping up against you, cool beats and enough seating for all.", 
    "review_date": "2007-03-09"
  }, 
  "yfG8hiLv0mA0ltTNXERuYQ": {
    "user_rating": 5.0, 
    "user_location": "McKinleyville, CA", 
    "user_name": "Roxanne S.", 
    "review_text": "Stopped in here for a few drinks and to catch some of the Giants game, and had a great time! We had never stopped in before because it's always so crowded, but this time we spotted two open seats at the bar and grabbed them! Had a few good drinks, talked with some other friendly customers and the bartender, had a good time and will definitely be back.", 
    "review_date": "2013-04-20"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "Sunday Funday  Highlights *A real bar *Great happy hour *Fernet *More Fernet *And more Fernet *Great Ipod playlist provided by the Bartenders *Happy hour beer token  Downers *ummmmm next to Golden Boys? *Fernet *More Fernet *And more Fernet  My bartender friends took me here on Sunday Funday.  Drinking when I have to work the next day.  Monday going to be interesting.  I just hope I don't staple my tie to the reports.  This is a bar with a bar feel.  A little on the small side, but once you start drinking that will all melt away as you stumble down stairs to the other part of the bar.  Play some pool  on the small table and throw some change in the jukebox.  They have TVs all around for your viewing pleasure.  To Sunday Funday!", 
    "review_date": "2007-12-13"
  }, 
  "wAeREtzI0ca_QCQiuXDwIQ": {
    "user_rating": 5.0, 
    "user_location": "Arcadia, CA", 
    "user_name": "Nelson W.", 
    "review_text": "Classic dive bar.  You buy one beer, get a token for a free beer later on when you make another purchase during happy hour.  Gotta love it.  Great place to meet old friends and to make new ones, unpretentious and totally chill.  Come in a t and jeans and sandals...grab a beer, take a sip, and relax.  You've arrived at the right place.", 
    "review_date": "2009-09-12"
  }, 
  "Z_yi5X0C-yFMA_sTKFvesA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark R.", 
    "review_text": "2 for 1 beers, seven days a week from 4-8!  It sounds like I'm a spokesman, but it blows by mind.  It may be me, but I can't understand why anyone would give this anything less than a five.  BOGO beer is amazing--cherish it.    It's a \"dive,\" sure, but for SF only.  Most places in the world this place would be considered a normal bar with no pejorative attached.  Four years in and this city still confounds me at times.  It's a bar, you're there to drink.  If you require more amenities, pay for it.  Can't discount a place because you get more than what you pay for.  And, \"tip on the chip.\"  I was there today and saw a few douches fail to tip on their \"free\" beer. If anything, be extra-generous--you just saved five dollars.", 
    "review_date": "2012-03-30"
  }, 
  "Un138zBMZ-FviGziY9oLFg": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "kevin b.", 
    "review_text": "It's part of my circuit when I go to san fran!  red's place,li po, buddha,vieni vieni, geno and carlo, and columbus! Plus kennedys pub later if I'm not too wasted", 
    "review_date": "2010-09-14"
  }, 
  "YrgVqQKtKFcJGg5RoE8cvg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Stephen K.", 
    "review_text": "Looking for a local hang out with a great happy hour in North Beach?  Look no further than Colombus Cafe, cause it's the best in the neighborhood!  Two for one tap beers?  If you don't have time for the second they'll give you a token to use later?  What the hell more could you ask for?  You picky, picky Yelpers;)", 
    "review_date": "2011-02-13"
  }, 
  "KyGkyqSPuJW-Sq7OXPVu2w": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Brian B.", 
    "review_text": "Decent Dive bar in North beach. My friends and I went here after a Friday Giants game. The interior of the bar is pretty nice. I like how the bar is next to Golden Boy Pizza,when  the bars closed we got pizza at Golden Boy Pizza!", 
    "review_date": "2011-04-27"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "This is just a regular dive bar. Nothing too special about it. It does have a pool table that you can play for $1. You can also watch some sports while you hang out. The service was okay, and if you use your card, there is a $15 minimum. For some reason, they give you poker chips for every drink purchase. I have no clue why they do that, it's pretty gimmicky. And they also make sure you keep those souvenirs, like they will hunt you down and make sure you have your chips. Why???? Not a bad place to hang out while you wait for the other bars to open  Update: Karlee, I'm guessing one of the bartenders here, messaged and informed me about those poker chips. Apparently you can redeem them for free drinks during happy hour. If anyone wants free drinks, I left about 6 of those tokens near the pool table haha I wish I was aware!", 
    "review_date": "2013-05-30"
  }, 
  "5XO4iBD2JlZIoym9fDMV6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin B.", 
    "review_text": "This place ROCKS,   Been here about 10 times over the last year.   Nice local dive in Northbeach. It has a great happy hour with cheap fernet shots, and buy one beer get a token for another. The bartenders here rock are friendly and sweet. The crowd here is real legit. No fake wanna be's, just normal workforce getting off of work who want to mingle and have a nice cold beer. Everyone should stop by and grab 2 for 1 beers @ 5 a pop, and a 3 $ fernet shot to give u that herbacious happyness!! :)", 
    "review_date": "2012-01-23"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "This place wasn't good or bad - I'm indifferent!  I had fun because I was there with a bunch of friends on a bar crawl, but I can't say what the usual crowd is like.  A couple of my friends had purchased tickets to get discounted drinks on the pub crawl, but I found that it was unnecessary.  Drinks were cheap to begin with (:", 
    "review_date": "2012-09-19"
  }, 
  "QsM6BSlosKUpMnH9iAgvZA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Lawrence T.", 
    "review_text": "Looking for a nice bar to have a beer, a dark sports bar with happy hour to 8:00 is always a bonus. 2 for 1 beer tokens. GREAT!! It is nice when you have a beautiful girl serving you beer from behind the bar ... it is a little weird when she is 6 months pregnant and schlepping ice from the back room to replenish the bar. Nice local bar, a good selection of beers but no Boddingtons on tap... kudos to the bartender for knowing the brand.", 
    "review_date": "2007-05-25"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "another little north beach dive... the only time i come here is after the big 'NB Beer &amp; Oyster' festival. its the only time it has a decent crowd. otherwise its just a small little bar with a pool table and some TV's.", 
    "review_date": "2005-05-14"
  }, 
  "h0FPJR1jCDpwq0C4t8ArLA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline M.", 
    "review_text": "This might be my favorite bar in North Beach to grab a casual drink.  Bartenders are usually great, the beer selection is never ending, and it's rarely crowded for football on Sundays (they also have Sunday Ticket).  Oh, and bonus points for having fresh squeezed juice.", 
    "review_date": "2013-10-08"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "If you come to this old North Beach bar for happy hour you get a drink chip for every beer you order. They are pretty high quality chips so you can either cash them in or save them and use them next time you want to play poker.   I recommend saving them and getting the hell out when happy hour comes to a close, because this carriage turns into a pumpkin after about 8:00.   The evil stepsisters take the place over around this time, looking to take Prince Charming home for a quickie. However Prince Charming is generally downstairs dancing at this point as a prequel to barfing on their not so glassy slipper as the evening progresses.   I assume this has something to do with the $3 Fernet shots they offer up, all of the time. Or maybe it has something to do with the internet jukebox, which, in the earlier hours can be a fairytale, but as the evening progresses and the douche bags show up to the ball, turns into more of a nightmare.   The bartenders are super nice and the happy hour is good, but save this destination for early in the week or early in the evening if you want a happy ending.", 
    "review_date": "2008-01-27"
  }, 
  "ZHyfXWIUUtBsCat-DT9PWQ": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Corey P.", 
    "review_text": "The old faithful never fails. ...  And rene had 4 tokens in her bag. ;)", 
    "review_date": "2010-06-08"
  }, 
  "daEKn0SlW3j3-8zAXx3xBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer s.", 
    "review_text": "I was standing out front with one of my friends we were both trying to capture an image down Green st with our digital SLR's. So this guy walk up to me and says are you from Spain? I said no  I am from here. He then proceeds to tell me the bartender inside was admiring my boots and she wanted to know where I bought them.  He then invites us to come in for the two for 1 pints happy hour. The bartender was very friendly and cool. The patrons were a hoot. A great spot in North Beach for happy hour.", 
    "review_date": "2007-04-30"
  }, 
  "7mzACXQ5F4EduE9jF_tI-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hailey P.", 
    "review_text": "My Tuesday began with a conversation with my girlfriend about Taco Tuesday, and our wonderful plans to stuff ourselves full of tacos, burritos, and any other 1 dollar mexican specialty.   Miss Nicole L. decides to make her way from NB to the Nob for tacos at Nicks. After a late return home from work by me, and a missed bus (silly 12) it came down to one fact... if we went to Nicks Crispy Tacos right now, we would have to wait in line for a while for food.  FUCK THAT I'M STARVING. OK I say, I will walk to NB and we can go do beer and pizza at Golden Boy, and it's not really a downgrade from taco tuesday if it's golden boy.   So shortly thereafter Nicole L and I dominate our beer about as fast as we inhale that glorious slice of pizza. I look to Nicole and say... I'm not ready to go home, wanna hit up a bar?!   While we had the motivation to go out after food, we did not have the motivation to go far. Well Columbus Cafe is right next door, lets stop there. Upon entering it didn't seem promising (I have been here before, but tonight was slow, I mean it was a Tuesday). Shortly after we sat down Nicole and I played the \"I don't know what I want\" game, only because we were looking for the cheapest drink out there.  Dropped out of heaven land two strongly accented Bostonians who tell the bartender, put these girls drinks on here too. Suddenly, as if a fog had been lifted, NIcole and I knew what we want, \"JAMESON AND GINGER!!! JACK AND DIET!!!!\"   The night wasn't complete without a few shots of whiskey and 3 games of Wii bowling... yes that's what I said, WII! Columbus Cafe is BRILLIANT with this idea! If you provide me with free competitive games, I will most definitely be purchasing another round.. or 2.   Columbus Cafe, thanks for giving me a great weekday spot! XO", 
    "review_date": "2010-01-19"
  }, 
  "a8N9dAsIZHQNKZZZehRACg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zhenya S.", 
    "review_text": "Happy hour 2-for-1, save your tokens for a late night. Pool table in the back, the music is usually good. The crowd is nice, although it can get yuppified on the weekends. But nonetheless, a great place to have a drink and grab a Golden Boy pizza on the way home.", 
    "review_date": "2009-03-08"
  }, 
  "ep3MfPqeQX0FdT0G5ne4FA": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Princess Lea C.", 
    "review_text": "My first experience at this place sucks! Place looks dirty. Bathroom smells really bad. Their private room is horrible. Drinks are over priced! Snobby workers. The only person who was friendly was their security guard at the entrance door. Would I come back to this place, hell no.", 
    "review_date": "2013-09-22"
  }, 
  "I-02Mz45H7siHsjjgVxPgQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Richard G.", 
    "review_text": "Well this was another cool bar I discovered during Santacon and I have to admit this place looks fun. A bar that  has been there for years was a great place to stop and have a nice beverage while the madness was going on outside. I didn't get a chance to stay too long because it was getting very crowded and I started to feel like a sardine.... I plan on checking out this bar again very soon!", 
    "review_date": "2012-12-18"
  }, 
  "rO2YKN1PqAJjd6YgP0PM0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen S.", 
    "review_text": "Great selection of beers. Drinks are strong and service is great. Friendly people.   A few cons are - frat central - I felt like I was in the Marina. Tiny pool table in the back so when it is crowded (it usually is) you get to be jabbed by pool sticks if you awkwardly try to stand near the back of the bar.", 
    "review_date": "2011-02-24"
  }, 
  "cs1GMqTt5eGmLqQyPijYcw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jen S.", 
    "review_text": "The bartender was totally flirting with me and gave me a free shot of their infused vodka.  Deelish!  (The vodka and the bartender)   Then my boyfriend at the time came up and gave me his bag.  WTF?  Anyway, the bartender goes \"is that your boyfriend?\" and when I answer in the affirmative, he goes \"OUCH!!!\" and acts like a moody 13-year-old dick the rest of the night.  Amazing happy hour (2-for-1 beers) and the infused vodka will keep me coming back and braving the awkwardness of a bartender scorned.", 
    "review_date": "2007-07-31"
  }, 
  "cMICirZm69WlJHyasuUPTg": {
    "user_rating": 1.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Danielle K.", 
    "review_text": "Normally, I love Columbus Cafe. I have been here a few times and it's usually a fun place.   We stopped by here last night, which happened to be St. Patrick's day. Two of my girlfriends and I were in the bathroom, you know the one that has the curtain as the door.... ya that one.   If you know us, then you know how fast the three of us are in the bathroom at bars. We were in there for seriously no longer than 5 min.   All of a sudden the door comes flying open. The bleach blond bartender starts screaming at the top of her lungs, in our faces, that only 1 girl is allowed in the bathroom and people want to use the bathroom. Excuse me?!... uh ya, we are THOSE people who need to use the restroom. Paying customers REMEMBER? She continued to yell at us on the top of her lungs, until we walked out of the bathroom.   That whole experience changed Columbus Cafe FOREVER for me. I seriously don't think I will ever be back. I have never felt so awkward and well insulted in my life! And all over using the god damn bathroom.   That bartender is bad news. This IS the reason why I don't like girl bartenders.", 
    "review_date": "2009-03-18"
  }, 
  "HtZUb1bbN-lExBuyLdVD0g": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Flexoh B.", 
    "review_text": "As dive bars go this place is awesome.  Lots of beer on tap and friendly staff.  I I am in the city I will be here for at least one drink.", 
    "review_date": "2011-06-07"
  }, 
  "v8KXET42yEGlMRbKoQOp7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sierra d.", 
    "review_text": "This place is a great place to go for a beer but not feel like you have to get all dressed up which is rare for a bar in North Beach.  The bartenders are fast, the beer is reasonable, and they have PHOTO HUNT and a juke box. I have never been here for a happy hour but it is pretty cool on Saturday nights. It gets crowded but you don't feel like you have to fight to to order a drink and the noise level is such that you can hold a conversation with someone and understand what they are saying.  Update: Am adding another star for the fact that it is 2 for 1 during happy hour!", 
    "review_date": "2008-06-24"
  }, 
  "QuZbJquRtbY9O9JrB9NpxQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jim W.", 
    "review_text": "@Columbus_CafeSF There are so many great bars around here...they really should export some to other cities that are sorely lacking great local bars.  Spent an hour or more here awhile back nursing a glass of scotch with a friend toward the end of one of the long evenings that seem to victimize me whenever I am in North Beach...ok, I'm a willing victim but that is beside the point.  @onlyinsf #SFO", 
    "review_date": "2014-01-19"
  }, 
  "E3CmcQiN8YeQbfsCnNv_cQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie L.", 
    "review_text": "Great, great, great Happy Hour spot!  2 for 1...Come on...doesn't get much better than that!  And it's not on just cheap beer, they have some great drafts to choose from.  Although it can be dangerous and at some point you might say, \"No, no I just want one!\" but when that point happens you won't even remember what is going on.    4 stars because the ambiance isn't the best, but I mean it's a sports bar, what do you expect!  Don't go there if you are looking for valet and a coat check... You will not be received well.    I would definitely recommend this place for an excellent happy hour experience and the best part....RIGHT NEXT TO GOLDEN BOY!  Hellooo...enough said.", 
    "review_date": "2010-03-03"
  }, 
  "GawyLibaMGt3PCsv-hI5sA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy C.", 
    "review_text": "I love this place. My local neighborhood bar.   I bonded with the bartender over MIA and Mickey Avalon. Whenever Kelly bar-tends, she plugs in her ipod.... and we rock out to music while she pours us endless fernet shots with ginger backs.....the industry drink that only the pro's and bartenders can handle. Are you man enough?", 
    "review_date": "2009-01-03"
  }, 
  "cVc4PCDC7Qj_NZKKogPs5Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris P.", 
    "review_text": "This is my favorite bar in North Beach.  The bartenders have always been super cool and the atmosphere is friendly.  Non HH prices are pretty solid and I've always had a good time.  Decent beer selection.  If you need any more details then you are too picky.", 
    "review_date": "2009-11-18"
  }, 
  "Q4RsL67tkjfRclgTfTPUdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brad R.", 
    "review_text": "I really like this bar.  The have lots of good beers on tap, as well as a pretty decent liquor selection.  Prices are pretty good considering the location as well.  The bartenders are friendly and pretty quick with the service even when it is packed.  On the weekends this place is cracking.  However I did stop through with some friends for a couple beers on a weeknight once and I have to say that it was pretty dead.  When raging it in North Beach I do usually try to stop through here for at least a beer though.", 
    "review_date": "2010-07-28"
  }, 
  "FxqfMKUXHlrtTTZC2xexbQ": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Serai S.", 
    "review_text": "I have never in my 32 years witnessed such unprofessional and ridiculous behavior on the part of a bartender. The bartenders name is Carly and she should be fired if Columbus Cafe wants to stay in business. After a relatively laid back evening at this establishment, my friends and I ordered a last round of drinks. Immediately upon paying for them, Carly instructed her bouncer to remove our drinks (meanwhile her friends still sat comfortably at the bar with their beers).They proceeded to yell at us to get the $&amp;@# out and then Carly yelled some very offensive language at me insulting where I was from. She then proceeded to spray me in the face with her seltzer gun, unleashing a rambling of profanities. She then came out from behind the bar and threw a metal bottle opener at my friend. It was shockingly uncalled for and completely unacceptable. I am appalled.", 
    "review_date": "2014-10-11"
  }, 
  "V6n7b90ijL6PhCGvfDt43Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cyn B.", 
    "review_text": "i feel a little too old being here.  it's definitely your typical north-beach 20-something crowd but it's a fun dive bar with a great jukebox and a friendly atmosphere.  good place to pop in for an after work beer.  beware of the scary local men who like to hang out there though...last time i was there, one guy had really bad gas and prectically cleared the place out!  haha!", 
    "review_date": "2006-03-14"
  }, 
  "IRyIguNlHptFCC4JZEkg4w": {
    "user_rating": 5.0, 
    "user_location": "Elk Grove, CA", 
    "user_name": "Lilmissap L.", 
    "review_text": "Just left this place and I give it 5 starts for how much we spent.  4 beers and 2 shots of Jameson = $22!  That's dirt cheap compared to other bars I've been to around this time.", 
    "review_date": "2012-10-16"
  }, 
  "ItxM2SMn40Vmmsqa_8b4ZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom L.", 
    "review_text": "2 for 1 pints till 9pm is all I have to say.  I spent $10, and received 2 pints of Tricerahops, which is such an awesome beer.  Than followed it with 2 pints of blue moon because the IPA was hella filling.  Awesome prices, and friendly staff.  Recommend!", 
    "review_date": "2012-09-15"
  }, 
  "TlUqnP5QPbKXfHRNM_fa3Q": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Megan C.", 
    "review_text": "As we were tramping through North Beach we stopped off at this rad dive bar. Great 2 for 1 beers and packed with locals getting their drink on. Affordable and great bartenders. I regret not buying a shirt, they were really cool also", 
    "review_date": "2012-07-06"
  }, 
  "mP6MeNAciCpSSgvgWoutFQ": {
    "user_rating": 1.0, 
    "user_location": "Orange, CA", 
    "user_name": "Larry P.", 
    "review_text": "This is usually a cool environment. I've been here once before on another trip and specifically located this bar to go again. Unfortunately, the bar tender tonight was so high/drunk that he didn't seem coherent enough to take our order. Had a huge attitude problem and acted like it was a problem to serve us. I got the impression that this may have been a \"locals only\" issue. It was a rather hostile environment. Walked out and left. Completely ruined the experience and I would not recommend this dive to anyone. Not worth your money!", 
    "review_date": "2011-01-03"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Always wanted to try this place but never made it in for one reason or another...mostly because it's always packed and hubby prefers mellow places where \"you don't have to wait forever or fight to get attention for a drink\".  One day we'll have to take advantage of their Happy Hour, it's just too tempting to pass given how close it is to home.  Finally had the chance on Fleet Week.  As we were greeting sailors and thanking them, two of them were outside and I asked if we can buy them a drink and off we went.  It's a cool place indeed and it's bigger than I thought it would be.  The bartender was friendly and prices aren't too steep.  I think for 3 drafts and a shot of vodka were under $20?  I can't be sure since hubby paid, I just down my shot and chatted with the sailors a bit before we moved on to thank other servicemen in the area.", 
    "review_date": "2008-11-12"
  }, 
  "XkLK2iBsgqF6mWwDfRgqqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seong P.", 
    "review_text": "this place reminds me of amber, one of my best friends from college and maybe the funniest person i know.  she was my chubby mexican friend (she really wasn't) and i was her, er, korean friend.  when we both worked in the city, we'd meet at the token bar pretty frequently for 2 for 1 happy hours because she loved/hated one of the bartenders.  we'd drink stellas and talk about her brother who looked like george clooney (drool),  what we were going to do with our lives, whether she should move back to LA and why i was dead inside.  good times.  i went back recently on a weeknight and i would recommend not doing that.  this place is fun for happy hour but if you stay beyond that, you do so at your own peril.", 
    "review_date": "2008-02-03"
  }, 
  "Ub7_eU6tHduSPQVHdeLDOg": {
    "user_rating": 5.0, 
    "user_location": "Chico, CA", 
    "user_name": "Braydan Y.", 
    "review_text": "AMAZING happy hour.....come early get a spot at the bar and save those poker chips to keep buying drinks...also try there brew that they make it is really good", 
    "review_date": "2011-11-03"
  }, 
  "PZvyqN7sgHI-o4f8z7O-ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew S.", 
    "review_text": "There's really nothing spectacular to say about this bar, apart from the fact that it's a solid place to drink in North Beach. Great beer selection, drinks are good and stiff, lively atmosphere, and best part... during happy hour they give you a chip for every drink you buy, which is redeemable for... another drink! And you can take the chips home and use them on another night (though why you'd do that, I have NO idea...)", 
    "review_date": "2007-01-25"
  }, 
  "fy9_Fneu9b55iLSRk3YjYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seanté B.", 
    "review_text": "Came here with a date last night after dinner. The drinks are strong and the prices are reasonable. Kelly is an awesome bartender. She's really friendly and accommodating, and even took a shot with us after I told her I was new to the neighborhood.  I was also introduced to Fernet. Let's take it back to SAT classes in high school: analogies. Absolut : Grey Goose as _____:Fernet. Answer: Jager.   I can't say I'm a huge fan of Jager, but this was after my 3rd round of drinks, and I was feeling a bit adventurous, so I went for it and it was okay. If I were on my 5th round of drinks, it wouldn't have been a good idea, but I would definitely come here for another one...or two...or three.   One of my new favorite spots with chill bartenders. Can't wait to try their happy hour!", 
    "review_date": "2010-08-16"
  }, 
  "DfWF5fnzufqzP9smf4oaHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate D.", 
    "review_text": "A chill dive'ish like bar in the North Beach area. Good beer and booze available. A pool table and a few seating areas for everyone. All the people that work here are super nice and pretty fast at serving everyone. Even on their hectic Sunday afternoon and evening during their happy hour time.", 
    "review_date": "2011-08-09"
  }, 
  "pHwlLUKTfB2kzBPRV0N4Ng": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scoot S.", 
    "review_text": "Excellent value for a SF bar. There are some serious drunks frequenting this establishment, but it adds to the dive bar atmosphere. Highly recommended.", 
    "review_date": "2012-10-08"
  }, 
  "agBczBvwLZR4_svBpNX-Wg": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Nicole P.", 
    "review_text": "Nothing beats a buy one get one free happy hour! It gets really crowded, so getting there at the beginning of HH is a better way to go.  I always love a bar that has Racer 5 on tap!", 
    "review_date": "2013-10-02"
  }, 
  "BHzUHvI1f85Z6urstaZvJQ": {
    "user_rating": 4.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Jessica J.", 
    "review_text": "I love this dark old bar. Love the atmosphere. Love the people(with the exception of the extremely fucked up drunk chicks.) Love the bartender, big tall drink of water was the nicest and coolest guy! Awesome selection and cheap prices! Cant wait to come back. XOXO.", 
    "review_date": "2012-01-04"
  }, 
  "FQN6HYUKduEjBYIHps_SCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby P.", 
    "review_text": "2 for 1 beers... they get pretty specific about the poker chips they use for redeeming the 2nd drink, but all in all a good deal and some cool people.... meaning I randomly ran into other friends I wasn't out with when I came in here. Good times.", 
    "review_date": "2009-01-14"
  }, 
  "gjfcfzrYZ0O1xINHtnQKiA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "I'm not a big fan of bars, but this is one of the joints for a good drink with a friendly bartender while shooting some pool.  Service is good for recommending drinks especially to the ladies.  Happy hour deals with 2 beers for $5 make it worth visiting.  It's in the heart of North Beach and close to all the major bus lines in case you need to get to and from the place.  Parking is tough on the street.", 
    "review_date": "2010-09-02"
  }, 
  "TS2j_gt5qugbmQ1R_fq6TA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim B.", 
    "review_text": "Hands down best happy hour in SF. I never seem to be able to rid my dresser of the 2 for 1 casino chips they give out here. Good crowd and decent place to watch a game.", 
    "review_date": "2011-12-23"
  }, 
  "OO7v2zxAQbkj432uve08ow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex F.", 
    "review_text": "Pros:  Very solid place overall. Strategically located (center of NB). Pool tables. Probably in the top 3 for happy hour. Near Golden Boy pizza. People in general are happy.  Cons:  Parking. Herding during peak hours (to be expected of course). Not good for dancing. Hard to get a table (there's only 3) making it bad for groups.", 
    "review_date": "2010-09-17"
  }, 
  "E9m9adcWg9h8mRX9idm9Qw": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kelly C.", 
    "review_text": "This was the first bar I visited after moving up to San Francisco. I'd been no stranger of this place, had frequented it a couple times visiting. My dad even told me he used to come here all the time in the '70s and '80s for happy hour. But this time was special, since I was now a resident, and coming from Irvine (the land with no soul) it was the most rewarding feeling to see people out laughing, drinking, eating pizza, loitering on the street, and know this was home.   Great happy hour spot, 2-for-1 beers on tap until 8pm. They let you cash-in your saved chips for drinks until 9pm, or you can take your chips with you and save them for another happy hour. (Chips are customized Columbus Cafe, so I wouldn't recommend trying to use generic poker chips for a free drink.)   Crowd is mixed, pretty chill, not your standard tourist NB or barely legal Saturday night Kel's bar binge drinking, frat boy crowd.   Besides happy hour, I prefer coming here on a lazy Sunday to watch a game. But, I admit, there are those times that I find myself lingering here after happy hour on a Friday night and singing to Bon Jovi on the jukebox. Good thing there's Golden Boy next door to lure me away when Journey starts to play.", 
    "review_date": "2007-07-16"
  }, 
  "64J57rMLWzaC_IJW8_S6ug": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kelly N.", 
    "review_text": "I stumbled into this bar on a weekend b-day getaway with my best friend. We were drunk and lost walking around North Beach and just so happened to see the Tamale dude we met the night before at Vesuvio, the bar next to City Lights book store.   Anyway, we decide to go in, because, hey if you can find that guy, his cheese and chili tamales are f**king amazing, even if you find them in your purse the next morning and eat them for breakfast, which I did.   Anyway I got an awesome shirt there with a naked mermaid on it serving beer, like a true turist. And also, the lovely bartenders served us many, many creative shots.  We ended up having a dance of with a swedish guy and then walked home happy with many new friends, and tamales.   I will surely visit this bar every time I am in San Fran.", 
    "review_date": "2008-03-09"
  }, 
  "pbhQDJ2h3VCTu0bxSzFIsw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "DJ B.", 
    "review_text": "OK boys and girls of the drinking age. let me begin by saying \"happy times happy times at this spot on Saturday nights\" so if you like juke boxes, well they got one. Now if you like pool,don't fret. if you ,Like myself and many other geniuses prefer your drinks strong but done with taste then they not only have it covered but they will even provide you with live entertainment that is very easy on the eyes if you go to the back and follow the steps behind the blue door......... The night to go is Saturday night .why,because for free the dudes downstairs get their international and local DJ bad asses  friends in for a live DJ sets  served while you socialize in a non pretentious setting. look for  good looking crowd no further because they are all there. boys and girls i believe i found my new favorite hang out spot in town. now also when i went down to the DJ lounge underneath the bar i told the bar tender i am a yelper and he let me in on a little secret: if you say yelp 3 times you get $2 fer nett shots all night. so imagine my face when i kept yelping for about two minutes and sure enough i don't really remember how i got home and how this beautiful  i was having breakfast with even got to meet me. but in conclusion don't think it's paradise that's OK  because i do", 
    "review_date": "2007-02-01"
  }, 
  "Zm9A2hOZ9y1VaJgJBSL51A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy A.", 
    "review_text": "Love this place. One of my favorite dive bars in the city. Always come for the 2 for 1 deal and always end up staying longer... and drinking more... than I intended. Everyone is always having a good time.  The pool table is never empty and the jukebox is so popular it's almost impossible to hear your song play unless you request next play! Although sometimes it seems to be nothing but heavy metal music which isn't my favorite, but to each his own! I deal.   I've never used the photo-booth but have always thought it's awesome that they have it. It's definitely a spot a lot of locals hit, but everyone is welcome. There are so many bars close by, it is definitely worth stopping in on your way!", 
    "review_date": "2014-12-04"
  }, 
  "68xw9Oy5J4UuurV5bwJbvA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Philip M.", 
    "review_text": "last night i went to columbus cafe for the fourth time, and decided that it definitely deserves 5 stars.  i'm probably repeating sentiments found in many of the other reviews (which i did not read), but i couldn't resist the urge to gush about this place.  the music is always excellent (really; i think they have a jukebox thing but there's absolutely no need for it), the bartenders are kind and accommodating, and the place is relatively clean.  a generally attractive clientele also helps, as do the generous happy hour and decent draft selection.  oh, and it's right next door to golden boy pizza, which is transcendental, to say the least.", 
    "review_date": "2009-08-21"
  }, 
  "LlQEmHgFDMGOJrYVJaf3eA": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Pete F.", 
    "review_text": "This bar is great. We stumbled in here one night trying to get away from the bustling, pompus natured bars on Union St. Columbus Cafe reminds me every time why I love North Beach so much. The drinks are stiff, service is fast, friendly, and knowledgable. We always end up meeting new friends here.", 
    "review_date": "2012-04-08"
  }, 
  "dAmglI3_6Z1MS3efeEM4SQ": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Dre C.", 
    "review_text": "We were there on Sun, 10/26/14, for the World Series.  First, the rudest bartenders ever.  You can check my reviews--I'm not a psycho venter.  I'm 44 and write real reviews.  At this bar, they obviously don't like patrons unless you're young, douchey and/or blonde. I honestly believe I was treated rudely b/c I don't fit into those categories.  No food, but you can bring food in.  Good beer options &amp; prices.  If they could JUST get professional staff.  I guess they don't care b/c of the cheap beer prices.  Sigh.", 
    "review_date": "2014-10-28"
  }, 
  "YlnOzp45KWr1-VGN1WIJoA": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Ada C.", 
    "review_text": "$5 beers AND a token for a free draft beer if you come during happy hour and purchase a beer?!? Too good to be true!  We came here to watch the Niners vs Packers playoff game, and this place was packed! However, the bartenders did an incredible job of making sure everyone's glasses were full; I don't think I ever waited more than a minute to order and receive my next drink. The crowd here is very fun, and it never got too overwhelmingly packed. A plus is that if you're a girl, there wasn't a wait for a restroom even though there is just one women's restroom. I know that seems ridiculous, but when you're used to waiting in long lines, and you've broken that seal after one too many beers, it's something you can really appreciate!  This place is also conveniently located next to a lot of good food, so after you have a good buzz on, you can just walk a few steps and be on your way to some delicious drunk food.", 
    "review_date": "2013-01-15"
  }, 
  "tIYV3B9e6JeCfyZiNAJ4QA": {
    "user_rating": 5.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Dave T.", 
    "review_text": "Amazing, awesome dive bar. I lost a Saturday here a few weeks ago. With the low prices and the happy hour special, a  whole evening of drinking cost about $50 for two, and they have some very nice beers on tap. Good jukebox, too. I vaguely remember rocking out to the Clash at some point.", 
    "review_date": "2011-11-26"
  }, 
  "BdcNkjxcse8y48YISk6low": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael D.", 
    "review_text": "Columbus Cafe, you're a bad influence on me.  Why do I ALWAYS get into trouble within your neon radius?  Maybe it's because you're always my third stop on the pub crawl trail, maybe.", 
    "review_date": "2011-11-29"
  }, 
  "z1ixmBo0A8IbRwS2WVRUwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crispin M.", 
    "review_text": "Ever since I've been going here it's been a consistent good time.  I can't say I vibe with the clientele certain times, but the bartenders are always great, Karlee, Kelly, Danielle, Christian and others all quality staff.  I'm definitely a fan of the three dollar shots of fernet branca(miss it when they were $2, if you can believe)  The shots are usually overflowing to boot.  They have a great selection of taps my faves being the high octane Racer 5 IPA(7%) and the more mellow Guiness(which is usually pricier than other drafts elsewhere).  The only cons are that some people smoke to close to the door and it drifts inside &amp; besides that smell sometimes it smells like disenfectant, hey it's a bar though.    The two for one happy hour is a great deal especially with their selection of drafts.  One pint at $5 between 4-8pm will get you a chip redeemable for another pint before 9pm or keep it and save it for another night.  With good times &amp; deals like these don't be a douche &amp; skimp on the tip.  I tip a dollar a drink, even on the free ones, &amp; the staff definitely appreciate &amp; recognize their better behaved regulars.", 
    "review_date": "2008-04-06"
  }, 
  "IJMSf5JMroRpxpO09zt8Ug": {
    "user_rating": 5.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Mary H.", 
    "review_text": "My dream drinking establishment has a full bar, is fairly empty and has an amazing juke box. This place has all of that and more.   On Saturday, April 18th I stumbled into Columbus Cafe with some friends after a birthday dinner. At midnight I turned the big 2-4. That's when the bartender bought me a shot. Then at 2am as the bar was closing up I realized they didn't get to the song that I played on the jukebox so, being the annoying birthday girl that I was, I asked if they would skip ahead and let us stay to hear it. They agreed and I was grateful. This place was such a great find. In my drunken stupor I forgot to close my tab and collect my debit card so when I realized this, the morning of my actual birthday, we walked on down to Columbus Cafe, kept my tab open from the night before and had a beer. This turned into two, then three, then a shot with the bartender, Christian, who gave us one of the shots for free. After a game of pool, many attempts to beat the high score on exotic photo hunt and a few delicious drinks, we decided to head out on the town and do some sightseeing before heading home. I can thank Columbus Cafe for an amazing birthday. I liked it so much that I got a business card so I can have a private party in their room downstairs on my birthday next year!   Thank you, Columbus Cafe! See you next year!", 
    "review_date": "2009-04-23"
  }, 
  "XrzkP-EPpql8cis-GlQ57A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas D.", 
    "review_text": "Not for me.   Young frat boys and inattentive barkeeps. Twenty-somethings yelling and pushing each other and throwing fake punches. It felt like college all over again--thank god that phase is over..... Great variety of beers on tap though.", 
    "review_date": "2014-11-22"
  }, 
  "_dUFC3yYJLnZf1iF2_oqtQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jory R.", 
    "review_text": "Kona porter: THREE DOLLARS!  You can't beat that.  Bartenders were great.  The place was crowded, but not too crowded.  Got to play first game of pool in over a year.    Only bothersome thing was I was approached twice by some people trying to sell charity stuff.  The first guy was like, donate $10 and then you get some beer for $2.  Hmm, that still means I'm paying $12 for a beer.  I don't even know what charity you are talking about.  Approached later by someone selling raffle tickets.  As it was later, and I had a couple more drinks, I bought one.  Still didn't know what the charity was.  And I never heard the raffle drawing results.    Anywho, good time was had by all.", 
    "review_date": "2008-06-15"
  }, 
  "L3mmNtzxkBBBvB5yAbqL2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Larry A.", 
    "review_text": "Two for one!!!  I don't know any places in the Bay Area that have 2 for 1 during happy hour, but this North Beach spot is pretty cool.        They lose two sta\\rs because they don't know their heavy metal.  They JDFU.  Gotta fix that.", 
    "review_date": "2007-04-04"
  }, 
  "SgZQwfobmImCDSrO0Vvcmw": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Grace B.", 
    "review_text": "2 for 1 happy hour that seems to last forever! When my fiancé and I got our tab it was under 30 bucks for 3 hours of heavy drinking. Can't beat that shit! It was exactly what we needed for a night of football and beers.", 
    "review_date": "2011-11-11"
  }, 
  "ctr_BlCf3Ogny-vLs8E9tQ": {
    "user_rating": 1.0, 
    "user_location": "Marseille, France", 
    "user_name": "Justin C.", 
    "review_text": "I was 86'd from this place.  Apparently so was the bartender who 86'd me.  Does that mean I want to go back in for a cold one sometime?  Absolutely not.  NEXT!!", 
    "review_date": "2009-02-03"
  }, 
  "_xTGGyRuzGUUWujaE4s7hw": {
    "user_rating": 1.0, 
    "user_location": "Lanoka Harbor, NJ", 
    "user_name": "Lars J.", 
    "review_text": "First time here with a group of newly arrived international students. The place was nice, but the female bartender kind of killed the mood when she started yelling at the customers for tips. \"Hello people, I don't work for free!\". Maybe customer service isn't quite the place for her...", 
    "review_date": "2014-01-23"
  }, 
  "mgAZNT7sMVKy9LY0U1Iihg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor R.", 
    "review_text": "I would like to give this bar a fair review, since I really do enjoy the feeling of neighbourhood bars, especially modest ones, since that is always a plus. The atmosphere in the Columbus Cafe was pretty good, and everyone seemed to be having a good time. The drink prices are reasonable for the area. The only issue with the establishment was the bar staff this past Friday night/Saturday morning.  When I went up to the bar I was promptly attended to by a 20-something barman, and asked what I would like. Assuming the bar was fully stocked I asked for a gin and tonic. I saw him make the drink and noticed that he put a copious amount of gin (always a good thing) and he filled the rest of the glass with what I presumed was tonic. Wrong. He filled it up with sprite, and I could clearly taste it.   I called him back to let him know that I didn't order a gin and sprite, that I wanted one with tonic, instead of saying that the bar did not have any tonic, he snapped back \"oh, you want tonic? Well here you go\" and he pulled the soda hose out and overflowed my drink with whatever soda button he pressed.  For the rest of the night he chose to ignore me, and didn't attend to me until the lady at the bar (who seemed busy on the other side) insisted he stopped cleaning glasses, and go and help me.  Although I did enjoy the atmosphere, I don't plan on going back to this bar /cafe anytime soon.  Update:  Still don't like this place. Service is still bad.", 
    "review_date": "2011-08-21"
  }, 
  "qwBq50vfZX9xc8oqi-nIhg": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Amy B.", 
    "review_text": "Yesterday my boyfriend and my Italian friend head to North Beach after watching the SF Giro for a beer. We've been here before and we always have fun and heck, the 2 for 1 happy (4) hour(s) is something you can't really pass up. We sat down in the window at the end of the bar where a pleasant young lady asked us what we'd like. We order our beers and relax. We're feeling the \"lazy last day of holiday weekend\" set in on a beautiful, sunny SF day.   All of a sudden in my haze of sunshine and beer, I see the bartender, Kelley, with the soda gun aimed at someone saying \"I will spray you if you don't get out of here right now!\". What? ^^ What the heck is going on? I look and there is this old lady (not too old, don't get all crazy! She was like that old leather-worn from smoking and drinking too much type. Not the cute grandma type). The old lady tried to take a swing at Kelley with her bag but she was most likely too drunk to follow through. Kelley starts spraying the lady in the face like one of those carnival games where you spray in the mouth of the clown. A guy comes over and pushes the lady straight out the door and they leave her dripping and wide-eyed on the sidewalk.  WHAT THE F*** JUST HAPPENED???   OMG! THAT JUST HAPPENED??!!!  \"She comes in here all the time, she's mean and she always bails on her tabs!\", says Kelley.  Now that I have my jaw off the floor I start dying laughing!! This was SERIOUSLY the funniest most random but absolutely HILARIOUS thing that has happened to me in YEARS!   So, here's your break down..   1 star for 2 for 1 beers (26 beers on tap but only 25 of them qualify for 2 for 1!). 1 star for good atmosphere and the ability to being in outside food since they don't serve any 1 star for great location - right next to Golden Boy!! YAY! 1 star for the best bartender EVER 1 star for making me laugh the hardest I have in FOREVER!   I will be back. I will most definitely be back. Every time I go to North Beach. It's my new religion.", 
    "review_date": "2009-09-08"
  }, 
  "wHvO5kK43yjqkcQ4HdtNAQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Stacey L.", 
    "review_text": "My friends and I accidentally stumbled upon this place when we were trying to cab it from Columbus and Green to Bubble Lounge on Montgomery. Beers were served in huge mugs and only $5! It had a very chill atmosphere with a younger friendlier crowd which I liked.   I'm from San Jose so if I could compare this bar to one in San Jose, I would say it most closely resembles Firehouse in Downtown San Jose, which I am also a huge fan of due to its chill atmosphere and bartenders. I will definitely be back for more than just a quick stop next time!", 
    "review_date": "2011-03-02"
  }, 
  "9jZAXnAaulEC40wtEZK6Fw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stanley K.", 
    "review_text": "$3.00 Fernet, 2 for 1 specials from 4-8pm Daily. Need I say more.  A woman walks into a bar with her 5 pound Chihuahua and sits down next to this guy, whom she notices is feeling a little bit queasy. A few minutes go by and the guy looks at her and blows his chunks. He looks down and sees the little dog struggling in a pool of vomit and says, \"Whoa, I don't remember eating that!\"", 
    "review_date": "2007-03-27"
  }, 
  "xLgipMEceGu1iKT5As9iZg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelley A.", 
    "review_text": "This is the best bar ever!!!! And not just because Im friends with the awesome Bartender Karlee but because of the $3 dollar fernet and 2 for 1 pints. For someone who loves fernet, beer and Karlee... this is good. Atmosphere is great. Definitely check it out", 
    "review_date": "2007-05-22"
  }, 
  "aS8mvg6EYBQrPp7n36MUOw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taylor B.", 
    "review_text": "The bleached blonde beezy behind the bar needs to chillllll the fuck out. My friends and I waited, patiently, for the bathroom for a good 15 minutes. When it was our turn, we went in.  Now I get VERY annoyed when dumb bitches take forever in the bathroom. Like seriously, I think most of them are doing blow in the stalls, cuz what could be taking so long? But not my friends and I...we get in, we get out in under 3 minutes for 3 of us to do our business.   After spending our precious 3 minutes in the bathroom this crazy bitch comes barking at us to get out of the bathroom. She kept SCREAMING in our face to get out. We are paying customers, and that is no way to treat people. It's freakin' St. Patrick's Day! Lighten up, have some holiday spirit and calmmmm yourself! And try smiling....it might help, and you might not be so angry at the world.", 
    "review_date": "2009-03-18"
  }, 
  "ubmbxYDfthzthk3RpjkvlA": {
    "user_rating": 1.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Josie A.", 
    "review_text": "1 star for the one of the RUDEST bartenders I have ever encountered.  It was last Sunday, the glorious day when the italian heritage fest took place. After the parade, we wandered in here. the first bartender we encountered was pleasant and gave my pal some free drink tokens after we were there for a while.   Then SHE came in. She was a short haired thin chick. I was nice and she had an attitude from the beginning. I played over $10 worth of songs on the jukebox and she preceded to fast forward through all of my songs (there were a lot) while making side comments to trolls at the bar that she was flirting with. So impressive. When I finally said something she said I could ask for my money back and continued to skip through my songs. You could have that $10, girl. You need it way more than I do. YOU'RE WELCOME.  My group was literally there for 5+ hours buying tons of drinks, making friends, and being merry. I don't like to base my reviews on one bad apple, but come on, you're a bar, so bartenders are pretty important. 100s of dollars later with stink face fast forwarding through all of my songs my buzz was totally killed. Needless to say, I will not be returning. YOU'RE WELCOME.", 
    "review_date": "2013-10-16"
  }, 
  "J5MJGJr939qH0XfBqEC81A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny S.", 
    "review_text": "Whenever I'm in North Beach, I wind up here at the end of my evening. This is the kind of place where you can get a good drink, play some pool and rock out to the juke box. Depending on the 'tender, the drinks are usually strong, the crowd is always interesting and they rock $2 Fernet shots.   This is definitely a dive where I don't care what I am wearing and I'm dancing like no one's watching! Love it!", 
    "review_date": "2007-03-06"
  }, 
  "oQBbnY3W8FYYQpU0UGqjRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dik Shun K.", 
    "review_text": "2 for 1 drafts until 8 and golden boy pizza a few stores up for your drunken munchies.  Enough said.", 
    "review_date": "2007-09-04"
  }, 
  "4InFkxzE3nxy5hd5IfLSFw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Patty O.", 
    "review_text": "This place is pretty crackin' on Friday nights. Filled with young peeps.  There is also a downstairs area too with couches and stuff...I'd have to say that the location of the bathroom (there are 2, one for girls, one for boys) is the shittiest planning ever created because it's right by the entrance to the stairwell downstairs, so if you're waiting to pee, you need to be careful of traffic and getting hit by the swinging doors from people coming to and from the stairs.  There is a pool table too, so you can play some pool, or drink your face off, whatever floats your boat.", 
    "review_date": "2011-11-19"
  }, 
  "adVI87W7gLjHM4fw58Ce_g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam S.", 
    "review_text": "I'm going to have to second Andrew \"Dice\" K on this one...   Where else can you get 2 x1 draft beers during happy time in the city? Shhh... I hear its illegal. They hand you a pint glass and a poker chip, and you can either have el segundo on the house, or you can bring it back another day when you need to wet your whistle. Czechvar on tap. Solidne.   If you go, say \"Hi!\" to Lopair and Christian (bartenders).", 
    "review_date": "2008-11-25"
  }, 
  "vE9wz9IgvRfMMpNtLbg68A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay T.", 
    "review_text": "North Beach \"attitude bar\" with too much attitude.   Once upon a time there was a bar that catered to locals, and pushed an attitude to be different than the rest. it was a locals bar and a treasured spot. The service was good, and the attitude was a theme more than a requirement.  Now, after many years, the \"attitude\" has caught up with itself and attracted folks from all around. The service has been poor, and the attitude is part of the atmosphere.   I've gone to CC for almost 6 years, now, i can say that after a few bad experiences with the day manager, and some of the \"new staff\", i can say that the once great treasure has become fools gold.  Go to Columbus Cafe if you want to mystically teleport yourself into the mission and hang out with Hipsters and other people who are \"too cool for you.\" If you are in north beach, try Rogue, Kennedy's, or the Saloon and skip the Columbus Cafe.", 
    "review_date": "2012-06-14"
  }, 
  "p6qMidPaJ96LgB_9z7xZVw": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Anna W.", 
    "review_text": "I think this may be the best happy hour I've found in San Francisco so far.  2-for-1 specials every afternoon! And if you don't spend your free drink token, then you can keep it and use it whenever you next make it back to their happy hour. Fantastic. A bit of a walk from the Financial District after work, but I would be willing to make the trek because of the deal. Bartender was also pretty friendly when I was here, checking in with us often enough to feel like we were being taken care of, but not so often as to feel as though he were pushing us to hurry up and get our next drink.", 
    "review_date": "2013-10-11"
  }, 
  "uFQHvEPRDwiU2s1zbSLghw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Bill C.", 
    "review_text": "If a Boston re-plant feels comfortable in a place, that says something. this place is \"legit\"! It also helps to have a good pizza place nearby...burp! I love it!", 
    "review_date": "2010-10-11"
  }, 
  "T1kRNW8UyZkcs1K1O0Gb_A": {
    "user_rating": 3.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Nicole F.", 
    "review_text": "Total neighborhood bar. Popped in last night for a drink and it was really fun. I wish the gents would have been more outgoing, but this is another story. We sat in the window, had a few cocktails and had a blast. It gets a bit crowded after happy hr, so word to the wise. BTW they have this super cool system that is for beer. 2x1. They give you a poker chip w/ your beer and you turn it back in for 2nd one. Love the system:)", 
    "review_date": "2009-04-02"
  }, 
  "0u5JfFEbkHwqWUOQtewU8Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha H.", 
    "review_text": "Considering how many great bars are in North Beach, i'm surprised this place is still in business. The drinks are mediocre, it smells like a barn and they consistently have the rudest bartenders I've ever met.   Do yourself a favor and go to one of the 20 awesome bars in this neighborhood instead.", 
    "review_date": "2014-06-30"
  }, 
  "jEyb7v42sgIZZhwxnynFfg": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Chuck F.", 
    "review_text": "This is THE best frikin' dive bar in North Beach - it does get CRAZY here when they have specials but being within walking distance when I lived in 94133, I could drop in often.  I actually used to see people light up a smoke INSIDE the bar and no one even blinked. Don't know if they allow that anymore but imo it added sort of a cool factor to the place being SF is so pissy about smoking unless it's pot.", 
    "review_date": "2009-11-27"
  }, 
  "9u8d_na5feZSZYok-Wb-BQ": {
    "user_rating": 4.0, 
    "user_location": "Woodside, Queens, NY", 
    "user_name": "Daniel D.", 
    "review_text": "Good prices, good selection, friendly bartenders, and a great music selection.  Pool table, drunk people.  New Jersey salutes you.", 
    "review_date": "2012-07-02"
  }, 
  "jqJMZO-kXWdZ-oghWGZ35w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diego C.", 
    "review_text": "A nice dark bar.  Went here for an office happy hour and had a great time.  the 2 for 1 beers are definitely the way to go and they have a respectable variety of scotch.  Would definitely come back", 
    "review_date": "2008-07-13"
  }, 
  "vQ5_AFIOkvY6jiL8FNPsAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kara P.", 
    "review_text": "Highlights: 2 for 1 happy hour Pool table  Photo booth Jukebox TVs  Columbus Cafe is that cool divey bar you grab a chill drink at durning the week and can come again Saturday night to get a little crazy with friends.  There's a great mix of oddball locals and randoms from other neighborhoods seeking the easygoing vibe. It's a mainly mid-20s crowd, but not obnoxious. It can get pretty crowded during the weekend and for sports games so make sure you come early if you want a seat.  Pro tips:  Make sure to tip the wonderful gentleman behind the bar when using those poker chips!  They can skip jukebox songs so don't choose something overplayed.  Pool sharks abound! If they look like they know their game, then back off for a hot minute.", 
    "review_date": "2014-11-05"
  }, 
  "v1MgXY1gKx1qwcIZ2QGAoQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Lena V.", 
    "review_text": "This bar gets high points for what will likely seem entirely inconsequential to anyone but me, but which absolutely made my night: Stevie Wonder songs playing all night long!  At first I was just thrilled that I heard one song come on. Then I was astonished to hear # 2, 3...4, 5!, 6 hotdamn!, 7!!!, 8....:D  Yes, other music came on as well which was enjoyable but the Stevie Wonder marathon is like the epitome of good music for a party night in my (admittedly dorky) opinion. And when I asked the bartender why all the Stevie Wonder---because she and the staff like it! Good people!  The bar was actually pretty empty when we came in and we had access to the pool table and enjoyed a round. Just a chill, sorta divey but fun place!", 
    "review_date": "2009-09-30"
  }, 
  "3k3hFdi0DqlGMSJ4Fmxknw": {
    "user_rating": 4.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Betsy R.", 
    "review_text": "Columbus Cafe is my new favorite place to drink beers in North Beach. Clean \"dive\" bar, good jukebox, friendly bartenders and 2 of my favorite beers on tap - Franziskaner and Hoegaarden! Plus 2 for 1 beers during happy hour!", 
    "review_date": "2010-12-24"
  }, 
  "63SQPROZ48xwGUb2LloFQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason R.", 
    "review_text": "A pretty good thing to do is walk down to this block of Green St. with about 20 or 30 bucks in your pocket. Duck into the Columbus Cafe before happy hour (I think the bartender said 4-8) and order a draft beer. He'll then give you a poker chip redeemable for a second beer until 9pm.   Repeat this process several times and then go up the street for a couple of slices of Golden Boy.  If that doesn't make you happy I'm not sure what will.", 
    "review_date": "2007-12-29"
  }, 
  "o5W5bvXZMZ_oqeMq7IZ6Ng": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chad H.", 
    "review_text": "Super cool little place.  Owners are nice people who helped out my friends with their breast cancer walk.  Bartenders are solid and nice looking.  Got to love drink deals and a pool table.", 
    "review_date": "2008-03-30"
  }, 
  "2AW-NegGX-SOjtk6UqVXjw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ryan M.", 
    "review_text": "If I was to rate this bar for the first hour and a half I was there, it would have been a definite 5 stars. Great beers 2 for 1. The first bartender we had was very personable and nice, sorry I don't remember her name but she was blond.   The 2 stars comes from the second bartender who started at 7pm, brown haired. Watch out! She was extremely rude, I'm not sure if she was having a bad night but literally the worst service I have ever experienced. We left before we used our free chips because we couldn't stand her. Beware", 
    "review_date": "2013-09-23"
  }, 
  "O3Ro7mtNn86NRlCMaZ3F0A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole M.", 
    "review_text": "Been going here for 10 years and have nothing but great things to say about the bartenders and the place. Great pool and great drinks. Music is great and the bathroom is always clean. No place to dance but people do anyway. It will always be my little local.", 
    "review_date": "2009-02-08"
  }, 
  "PadmV2GEoA6mWpQUpPh7Ig": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Monica F.", 
    "review_text": "I totally dig the vibe of this place...  No pretensions..just a bunch of cool artistic looking people with a mix of people who don't give a f*ck about other people but themselves (in a good way) and people who are truly wasted dancing and singing to the sound from their modern jukebox... No need to wear those sky high heels... and short vaginal dresses...no need to put on heavy makeup and fake lashes... no need to do your hair and look like a barbie doll...  It's so cool; all you need is yourself and your dranks and a few cool friends and you'll have fun...  $15.00 over only for Credit cards....  Recently priced shots.... Cool bartender... nice place to hang and even with the music..it's pretty bearable to sit on one of their tables and have a conversation with your friends over draaaaaaanks....", 
    "review_date": "2013-07-30"
  }, 
  "Bjxnb734DA3PxFyif6f0hA": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Joseph M.", 
    "review_text": "One of the top 5 happy hour spots in the city! 2 for 1 is obviously beyond fair. The bartenders are always cool, the crowd is chill. I don't know how many times I have gone here, but I know how many times I have left sober. Notaone!   Do me a favor- go to this bar for happy hour, take advantage of all the delicious beers they have on tap, 2 for 1 of coarse, strike up a conversation with some of the regulars and the bartender, and if you still don't have a good time. Go home and watch The Real House Wives of Orange County with your 9 cats and Costco size Bon Bons, cause you don't deserve to take up space in a bar anyway.  They lost one star because parking is nearly impossible. Take a cab, your gonna need it when you leave anyway.", 
    "review_date": "2009-01-13"
  }, 
  "olMvJFXQMMU-trU9D3F05w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam L.", 
    "review_text": "2 for 1 beers every night. Nuff said.  Gotta love the fact that the backpack I carry to work every day now has a pocket full of chips just in case we stop at the Cafe after leaving the office (which we do way too often)", 
    "review_date": "2009-06-05"
  }, 
  "GiBM39Ljmkk7u3kWarUpFA": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Ted T.", 
    "review_text": "I went here with a few friends and we shot some pool and drink some beer, happy hours is a fun time the bartender knows how to make a well drink and a excellent pour on shots. Fun Bar.", 
    "review_date": "2011-08-02"
  }, 
  "awmRirDC7WWig6R07XZ_oA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wakako U.", 
    "review_text": "The best place to watch the Giants.  I love the fellow fans here.", 
    "review_date": "2012-10-22"
  }, 
  "w4z9qW0B-camy3OtEHaxog": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine N.", 
    "review_text": "One star for the 2 for 1 beer happy hour and another for Wii bowling.   I've given this place a try a couple of times and there's a meathead vibe that I can't quite put my finger on here. The two highlights were getting drunk really quick and on the cheap and kicking ass on the Wii.  And there's just something wrong about a digital jukebox. Too many options for really bad music.", 
    "review_date": "2010-04-14"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "*update 1/28/2008* I returned to Columbus Cafe a year and a half after my initial review...this time around, service was fantastic (it probably didn't hurt that Yelper Karlee D. was behind the bar) so I'm bumping them up to four stars.  My one complaint is that the music at happy hour was LOUD.  Love the jukebox selection but why turn it to 11 so early in the evening?  *original review* Good happy hour (2 for 1 beers) and a great jukebox should earn the Columbus Cafe at least 4 stars but the bartender was kind of a jerk hence the 3 stars.", 
    "review_date": "2006-10-31"
  }, 
  "fxJcpYyCBgi61PtmlZXTjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina A.", 
    "review_text": "I think this might be my favorite bar in North Beach. The 2-for-1 happy hour draft special is fantastic - 7 days a week they give you a token you can redeem for another beer until 9pm. They have a nice selection of draft beers that makes this a genuinely good deal, a well-stocked full bar and skilled, efficient bartenders to back that up. There's also a pool table and Wii sports (when a game's not on).  Happy hour is from 4-8pm: All tap beers are 2 for the price of 1 (except Chimay)! Every beer you buy you get a chip for one free draft beer. Chips good until 9pm.", 
    "review_date": "2010-06-20"
  }, 
  "WnzRueYdRWNSbkXB0_0i4Q": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chuck N.", 
    "review_text": "Come here for happy hour $5 or 2 for one beers. Staff isn't as friendly as other places, but drinks are good and they have TV's to watch sports. A decent dive bar in North Beach.", 
    "review_date": "2013-11-01"
  }, 
  "SH6Vg0t4-dKnG0rzeNjMTg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "J H.", 
    "review_text": "Columbus Cafe knows that it is and knows what it is not. It is a divy, old school, north beach bar, popular for strong drinks. It is not a classy back lit over priced bar like it's neighbor, Amante. I'm not sure how the other reviews failed to mention Kenny the bartender. Thursday through Saturday the small bottom portion of the bar is open and Kenny the bartender serves strong  - but not stronger than whatever he's drinking - red bull and vodkas in pint glasses. Make sure to get to know Kenny while you're there (he'll probably give you a free drink), then hang out in one of the old torn up office chairs and watch people play pool and smoke. You'll always meet some interesting, and very drunk, people down there.", 
    "review_date": "2006-03-08"
  }, 
  "fbiJKax4YBWUBw6Jz4psCA": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Lyman M.", 
    "review_text": "If you are looking to host an awesome party for ~50-100 people, Columbus Cafe is your spot! We had our annual holiday party here after multiple years of angry landlords/police/neighbors, and it did not disappoint. They let us wrap the whole basement in holiday wrapping paper, choose our own special holiday drinks, and control the music the whole night. The basement will definitely bring you back to your college days (in a good way) if you spent a lot of time at fraternities.  The staff (mainly Evan) were incredibly accommodating and even let us take over upstairs once it become clear we had too many people for downstairs. To host an incredible party with our own drinks, decoration, and music for only $100 cleaning was an absolute steal. Thanks for making our annual holiday party an absolute blast CC, see you next year!", 
    "review_date": "2014-12-28"
  }, 
  "Ad9CVmXNegnsfYZWBYKoxw": {
    "user_rating": 4.0, 
    "user_location": "Bronx, NY", 
    "user_name": "Edgar E.", 
    "review_text": "One of the best happy hr bar in San Francisco. Two for one happy hr is freaking awesome.You can save your tokens and return another time to cash them out if you don't feel like getting wasted. Beer selection is good and prices are fair. Every time I come here I'm never can save any of my tokens :) and pay the price the next day.", 
    "review_date": "2013-02-24"
  }, 
  "rDTr5r0xEMpQpkPphe66KQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick A.", 
    "review_text": "Where do you put a dumpster that is too dirty?    Another dumpster?  I guess you'd need a real big one.  Try Columbus Cafe;  a special kind of dumpster for trashy trash.", 
    "review_date": "2007-09-24"
  }, 
  "Hl1f4VO0a9KdGrrRCPMqSA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela K.", 
    "review_text": "This bar can get a little overrun with drunk idiots. The employees are cool, the scene varies.", 
    "review_date": "2007-07-07"
  }, 
  "YSVavZvOLsknCoQnMG8_HQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Leo C.", 
    "review_text": "Buy one beer get one beer free happy hour is all good. Chill watering hole. Got great beers on tap. We had amstel lights, tecate, apricot ale and the list goes on. They had like 20 beers on draft easy. Cool bartenders and good drink specials. Only been here once but i was glad to have a beer hear. Great neighborhood next to great restaurants.", 
    "review_date": "2009-04-22"
  }, 
  "LahgT0Dec0B6NSws7VHiJQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matt m.", 
    "review_text": "I'm a bit of a masochist, and that's why I drink Fernet.  It takes a certain type of person to drink this stuff, and I happen to be one of them. Really, it's a love-it or hate-it type of shot, and actually meant to be sipped after a big dinner so that one can calm their stomach after gorging themselves with (insert food here).  Columbus Cafe doesn't have food (although Golden Boy Pizza is a few doors down and you can bring it inside Columbus Cafe if you like), and they believe the best way to drink Fernet is in the form of a shot &amp; in large quantities--that's why it costs a mere $3.  I've been here twice now &amp; both times things started to get sorta fuzzy as the night progressed. I may/may not have eaten too much pizza, and I may/may not have flown home on a magical Fernet unicorn...  The bartenders here are great, provided you don't act like the typical weekend clientele that visits North Beach.  Columbus Cafe, Do you have my new beanie? I may have left it there, or perhaps the magical Fernet unicorn needed it to keep its unihorn warm &amp; dry instead.", 
    "review_date": "2007-12-30"
  }, 
  "dE9YaRaUtkDm-xJrW3BSPg": {
    "user_rating": 3.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Shane R.", 
    "review_text": "again, a pretty typical small sf dive bar.  a couple screens to watch sports.  bartenders were quite inattentive.  2 for 1 beer special is hard to beat.", 
    "review_date": "2012-04-01"
  }, 
  "xt8tqNaVPzgBhhftXBr-5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven M.", 
    "review_text": "A true dive bar with \"buy one, get one free\" everyday from 4 p.m. to 8 p.m.  If you're in North Beach and want to escape the tourists, this is a great spot.  Caution:  You go here to get wasted and have conversations with crazy North Beach men who talk about \"the old days\" and stare at you when you talk to your other friends.  Once you are nice and wasted, go to Golden Boy and get a slice, it's two doors over.", 
    "review_date": "2005-12-15"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "Heyyy!! What's not to love??  I got to know Columbus Cafe when I was working in the area. Trust me, people who work with the 18 and under after school are probably the most alcoholic WHILE BROKE in the world.  Why should you come here? TWO FOR ONE BEER. That's right, TWO FOR ONE. You buy one, they give you a chip. Chip is good until 9! Now, make note. The chips are given until 8PM, but are good until 9PM. Any night. Say you drank a few too many but have a chip left over. What to do?? Well...clearly, come back another day for another drink!  Another plus: You can bring in food. Golden Boy less than half a block away?? Winning. You can venture out every 10 minutes to check if the clam garlic pizza is free while sipping 2-for-1 beers!   I've been here on those strange nights where there's dancing downstairs. Not bad...not what I expected, but its all good.   Only two awkward moments here, which I clearly must share:  1) For a while (about a year ago) one of the bartenders was heavily pregnant. Wow...good thing no mixed drinks, otherwise fetal alcohol!  2) A random guy leaning over to my friend and I ordering Hoegaarden and correcting our pronunciation. \"I don't mean to sound pretentious, but its pronounced 'who-garden' \" WHO the fuck are you and WHY do I care? I've tried ordering a \"who-garden\" and no one knows wtf it is. Fail guy, fail.  ***I've been corrected. It was 2.5 years ago the bartender was pregnant. And for the record, there's nothing wrong with it. It was just a surprising thing to view at a bar (for me).", 
    "review_date": "2013-01-05"
  }, 
  "aei-4QBYVdUAcQOyu9jSGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chuck C.", 
    "review_text": "Probably falls into the category of Dive Bar for most, but I like this place.  The bartender on Tuesday nights is nice and puts up with my (and my friends') annoying qualities.  Read: drunken stupidity.  One pool table in the back malfunctions and kicking it does no good.  Asking the bartender to fix it works much better.  Ask for a shot of Fernet's - most of you will regret it.", 
    "review_date": "2007-10-11"
  }, 
  "wb2I6PxYjRStE7OGLL4S7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "Photo Booth + Strong cocktails = Endless hours of fun and embarrassing photos  p.s. $3.00 Fernet, 2 for 1 specials from 4-8pm EVERY DAY", 
    "review_date": "2009-10-01"
  }, 
  "w7CvXX2dtmPCm67TRJw7kQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel F.", 
    "review_text": "What a fantastic respite in the midst of some serious douchiness. I love the beers they have on tap, the drink specials, the dankness of the environment (hey, what can I say, I love a good dive), and the fact that they give you chips to carry around making you want to come back and get a 2 for 1 beer during the week.  It's easy to like the bartendresses too. They are hot and give good customer service. Even to the douches who come in thinking it's a douchey bar.  I promise my next review will be sans douche.", 
    "review_date": "2008-12-07"
  }, 
  "fsmEp-zDD-sqXoMnmBX6Yw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve L.", 
    "review_text": "Columbus Cafe Haiku:  Three dollar Fernet Night gets fuzzy, morning gone Day vomit awaits", 
    "review_date": "2008-11-03"
  }, 
  "MNSEAVrRq-7KrleJfeLQ7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kat W.", 
    "review_text": "Best Happy Hour in town. 2 for 1 drafts 4-9 EVERYDAY!   Great place for Sunday Fundays. Had one of the strongest Bloody Mary's known to man. Thanks Yoel!", 
    "review_date": "2010-01-11"
  }
}