{
  "dUjWYjb8F-bWeKsS_lMfBg": {
    "user_rating": 5.0, 
    "user_location": "Cathedral City, CA", 
    "user_name": "Amy R.", 
    "review_text": "I had a birthday party here and nobody came and now I'm emotionally scarred for life...but it's nothing a good therapist, drinking during the day, and the $600 worth of wine I took home can't numb.  I was nervous about my iPod Shuffle working with their sound system, but the guy told me all it needed was a headphone jack.  It worked great!  They let me bring my own food which was also awesome.  The space is really nice and if it weren't for the fact that I'm never having a party again...I'd have another one here in a heartbeat.  So if you're having a party, invite me.  If I say I'm coming, I'll be there.  The bartender was really sweet and made the whole humiliating thing as nice as possible.  I would find the coolest bartender ever at place that hosts private parties.  Anyway, if you have me over for dinner some time soon I may just show up with a hundred dollar cabernet sauvignon (Indigo must have a great wine list btw).  However, since I devote the greater portion of my leisure time to keeping the makers of great $20 cabs in business...I can't promise that it will be better than what I'd bring normally.  For those of you that were there...thanks for coming and sitting there for 5 hours while you were probably so bored that you wanted to stab your eyes out with your mother's brooch.  PS Anthongy is a nerd.  My music is the bomb.", 
    "review_date": "2009-01-12"
  }, 
  "InYEk99o-tYrv_wqMa18Ww": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "ems o.", 
    "review_text": "I hosted a birthday party here with 2 of my friends. The party was a wonderful success. The Crimson Lounge was a perfect venue for our event; not too formal, really affordable, private, and set for fun.  For a Saturday, the room fee was just under $200, with a minimum register ring of about $1200. Since we were hosting the party, we ordered around $1000 in food, hosted around $500 in drink stubs, and rest went to tax and service charges. All-in-all, it cost us around $35 per person for around 60 people.   A private venue, with food (good food too) and hosted drinks, for under $35; what more can you ask for?  VENUE: The venue is right next to the Indigo restaurant. No private parking. There is no street signage, so you'll have to give your guests a heads up. You have to walk down a steep flight of stairs, and I have no idea whether there is wheelchair access. You can have around 50-70 guests in there comfortably, but wouldn't go over that---unless you're into saunas. The decor is red, vinyl red. Tealight candles are lit throughout and there are booths and tables sprinkled throughout the lounge. The vinyl is a bit of a turn off, but after 4 drinks, no one noticed. There is a definite odor (if you're one of the first to arrive, you'll notice the musty carpet smell), but it you get used to it after a while.  MUSIC: You have to bring your own music, or listen to theirs. Sound system was decent enough.  RESTROOMS: You have to share restrooms with the Indigo restaurant. However, the restaurant closes much earlier than the lounge.  SECURITY: The bouncer was really nice and was heaven sent, because he managed to get rid of a few evil party crashers, help a drunk guest get a cab, and always had a light.  BAR: The bartender was really nice and was generous with the booze. His tally and the tally that I brought with me were exact down to the penny, so I don't question his honesty (I brought a tally with me, because I knew I'd be hammered).  FOOD: The $1000 in food that we purchased was good and there was enough of it to serve all 60 guests, with some left over. The smoked salmon, tuna tartar, and chicken skewers were big hits.  PARKING: Parking in SF sucks.  Before I booked the place, I read all the previous reviews, so our expectations were set accordingly. If you are on a budget and need a private venue, with a bar, security, decent food, and music, then this is a good bet.  If you're looking to host a fancy smancy party, a baby shower, or your Grandmother's 100th birthday, then you might want to look at a different venue.", 
    "review_date": "2007-12-04"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "Pretty cool venue.  Came here for a farewell party and the organizers had reserved the entire place for ourselves.  The color scheme of crimson red everywhere takes some adjusting (red rum!), but definitely a comfortable feel.  The place is spacious, with plenty of bench seating around the dance floor-ish area, as well as the booths to the side of the bar.  No resident DJ as far as I could tell, as our music was supplied by someone's iPod, so that was a bit of a downer.  However, looks like if you have a DJ friend, they have some space for them to possibly set-up.  The bartenders were great, and really friendly.  They hooked it up with well mixed drinks and friendly banter as the level of inebriation grew and grew.  If I recall, there were also a free or two that made have made their way out to the crowd as well.  Cheers to the staff!  As for the bar itself, it doesn't seem like it's a truly full bar, as they seemed to be somewhat limited in the alcohol selection.  However, they seem to carry the bulk of the staples for every bar, so I imagine they are capable of addressing most orders.  Definitely a solid venue, but it seems as though it's catered more towards larger, private parties.", 
    "review_date": "2009-04-16"
  }, 
  "o9t6P2UtTtDKUJ30CwCCvA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Deionte R.", 
    "review_text": "After reading all of the comments posted on Yelp! I decided to book Crimson Lounge for this Red and White Canadian themed event I am planning for work.   Greg the Event Coordinator was very accommodating and promptly responded to all of emails and calls.   Sadly, at the last minute I found out that one of my Canadian colleagues is wheelchair bound and Crimson Lounge doesnt have wheelchair access. Since I signed a contract, standard procedure would mean that I would have to pay a hefty cancellation fee.   However, Crimson Lounge waived the fee as this was a special circumstance...very classy establishment!", 
    "review_date": "2011-02-11"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Like a little dungeon of love - dark, velvety, and great for private paddling parties. The area's a little projecty - so take a cab home!", 
    "review_date": "2005-12-13"
  }, 
  "h3KpLypa9SZEw2ydFNC19Q": {
    "user_rating": 3.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Alvin D.", 
    "review_text": "3/5 it's a bar.  came here for a friend's bday...it really is a CRIMSON lounge. could be romantic, could be goth, could be sleezy. guess that helps to keep the options open! the drinks were okay, nothing served my way too exciting.", 
    "review_date": "2011-04-04"
  }, 
  "IfKwuAdOcGur-aW1covIMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rhonda H.", 
    "review_text": "this was the second bar that I visited on my birthday. It was ok. Apparently it was booked for someones event and one my friend's friend knew them. By the time we got there, it was pretty empty already. Its a nice underground bar that is covered in red everywhere. Had our two rounds of shots and left. not much more i can say.", 
    "review_date": "2008-04-09"
  }, 
  "mhq25N4nvURbUJ57FzX-SA": {
    "user_rating": 3.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Cindy C.", 
    "review_text": "My sister's boyfriend and another friend of ours hosted a party here, partially in celebration of a couple birthdays. Judging from previous reviews, there were a few things that I didn't expect from the venue.   1. It was a LOT bigger than I expected. Too much empty space that needs to be filled. While I don't want a meat market, I'd like to party in places that's reasonably packed with people. We had around 60 ish. I would definitely go with 90-100+ for any decent size party. There were 3-4 booths in the back that can fit a good 10-12 ppl each and sitting places everywhere.   2. We ran into a little issue with my coworker's driver license at the bar. His expiration date did not match the day of his birthday, partially because he lost his license recently. Robert (our bartender) said this would be an obvious sign of a fake license. I understand that establishments can get into serious trouble serving drinks to a minor but my coworker is 27 years old. Besides, there is NO where that says the expiration date has to match that of his birthday. I dug this up from the CA DMV site.   Notwithstanding subdivisions (a), (b), (c), and (d), the department may adjust the expiration date for any driver's license issued pursuant to this code. Amended Ch. 1240, Stats. 1992. Effective January 1, 1993.   His ID was legit... so I guess this is just an unfortunate issue when the bar just didn't know any better and err on the side of safety. Nonetheless, that kinda pooped the party. If you're spending that much money, you kinda don't want that happening. -1 star.  3. Never order a Manhattan. Tastes absolutely horrible. However, their other drinks were ok. I would shoot for typical drinks like long islands, mohitos, etc. Shots are fine too though they didn't have any shot glasses.  4. Sound system was too soft for my taste and they wouldn't let us turn it up. Aside from a deep base, I could barely hear any songs. Maybe we were talking too loud. -1 star  5. Too much lighting. It kinds of kills the atmosphere when you can see everyone's faces way too clearly. I like the whole dark, mysterious, faded lighting. It would probably help if you bring some kind of lighting ball (if the establishment would let you)  Ideally, this would be a venue for older crowds? Mid 30s++? I was turning 25 so my idea of partying must've been different than the establishment's. It was more loungy, chatting and sit down than dancing :P.   On the plus side, I got to see a lot of my friends I haven't seen in a long time and met a few new friends of friends. That's always a plus. Good to have friends and I was very happy to see everyone. All in all a good time. I'd come back with different expectations. Live and learn :D", 
    "review_date": "2009-08-17"
  }, 
  "dzw1eVaDJ4mB9iHOuI1qeg": {
    "user_rating": 4.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "thats r.", 
    "review_text": "i liked this place a lot. its a large enough place that will hold about 80 people very comfortably.  the venue has a retro kinda vibe, the drinks arent too expensive, and the appetizers from the restaurant above are delicious.  the only crummy part for me was that the bartender kept turning down our music.. so if you're looking to do a dance party, it may be tough unless you make it very clear from the get-go.", 
    "review_date": "2009-05-18"
  }, 
  "ca0N3Fl3FckAWyupp6sDgQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art D.", 
    "review_text": "I had the chance to go to the Crimson Lounge recently for a friend's birthday, and I thought that it was a pretty cool space. The drinks were a bit pricey (and were somewhat randomly priced - I paid $6.50 and $7.00 for the same drink), but that didn't detract from the feel of the lounge or its ambience.  The only negative was that it got pretty warm in spots, but it was probably the clusters of people hanging out in areas that were not in the space where air was circulating through.  Definitely a place to consider for your next big event!", 
    "review_date": "2006-03-28"
  }, 
  "Fg1ZhF_2pHcRwgyq_6yUiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles C.", 
    "review_text": "a great cozy place for a private party  it does get warm though, but i wouldn't recommend cooling off outside because it's right next to the projects", 
    "review_date": "2006-09-12"
  }, 
  "4dxRuRVQbSPfQtRM_Rd_Ug": {
    "user_rating": 4.0, 
    "user_location": "Ethel, WA", 
    "user_name": "Ann D.", 
    "review_text": "With my husband and I went here last night for a private party.  The space is really wonderful. The entire floor is very clean.  At first we order bar. Their service is friendly and helpful.  Good food and hosted drinks. Parking is strong.  Really nice.", 
    "review_date": "2013-11-24"
  }, 
  "S8MQlXd_IIqfzsiium0lmw": {
    "user_rating": 1.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Ken J.", 
    "review_text": "The Crimson Lounge is a cool looking place to throw a private party. As other reviews have stated, the private booths are cozy, the red decor is pretty hip, and the bar is OK. But with a bar minimum of $1995, one would expect the lounge to be clean. There was a \"funk\" in the air (it kinda smelled like an old mop). We had about 70 guests and we only made around $1200 at the bar,so we had to come with the difference of $800 plus the $200 rental fee.So needless to say, it was not worth it.In addition to this, after signing the contract , the owners increased the bar minimum to $3000.In my opinion, a bar minimum of $1000 would be fair,and not the current bar minimum. You and yours guests will have to do some serious drinking to meet the bar  guarantee. Plus, the lounge can only hold 100 people tops.", 
    "review_date": "2008-07-21"
  }, 
  "rbPJO1Mc5ddzgucXelSQ0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony L.", 
    "review_text": "Nice and quaint, this place is like a cellar. Not exactly a wine cellar but, then again, the wine for Indigo is located on the left side of the hallway you walk down to get to the bar on the right. So maybe cellar is more appropriate.  Last night was Amy R.'s birthday and she threw together a little shindig. I thought I came to the wrong place until I spotted her waving at me. The lighting was dim but not to the point it was making me blind like a bat. It was mood lighting, I guess. Candles were on the tables and the whole place was color schemed to match the name. They have a few booths in the back of the place that makes it look like a strip club that offered sleezier action. Hmmmmmmm...Anyone got a HD cam handy?  The bar had a nice selection. Most notable for me was the bottles of Macallan 12 year single Malt Scotch and Hangar One Vodka. Two names that should be found in more bars in the City. Music was courtesy of Amy's iPod. Weird playlist shuffled together. Rap with Techno with House? Whatever floats her boat, I guess.  All in all I had a great time. I don't spend much time with Amy so I made it a point to be there this time. Place has a nice feel to it and I wouldn't mind coming back again if someone else threw a private party there.", 
    "review_date": "2009-01-12"
  }, 
  "enQQMC0gI942FaPe9Gz9qA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Lilly O.", 
    "review_text": "Celebrated my 30th birthday and 5th wedding anniversary here and it was ah-mazing. I mean, it is your own private bar...can't get much better than that! We rented it out for $150 fee with $975 bar minimum for 5 hours. Pretty damn reasonable if you ask me. We are broke and brought our own appetizers (thanks Costco) and they were fine with that. Our Ipod playlist totally rocked and everyone had a fantabulous night....I have 250 pictures to prove it.  It does get hot in there...take breaks from dancing to hang out with the nice door dude. Oh, but watch out for drive-bys. We got pelted with eggs; egg shell in the hair really sucks. Luckily the drinks were strong enough that I didn't notice all that much.", 
    "review_date": "2007-05-01"
  }, 
  "ZpSOBH-W7AvyaAeiOneqCA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle W.", 
    "review_text": "Crimson was perfect.  We had our wedding after-party at Crimson and we loved it.  To reserve it is also the easiest process (was the easiest part of wedding planning and booking, actually). The bartenders were in the zone - really attentive and poured really good beverages (read: heavy pour).  A friend made the best dance mix of all time, so the dancing was pretty much off the charts.  We also had friends bust out their costume boxes and the Crimson peeps were down.  It was SO FUN. We had the place for the later shift (from 9-2am) and around midnight, the bartender checked in with my husband and I to let us know that our friends were drinkers and we were quickly approaching the minimum bar tab.  He gave us options about what we could do:  turn it into a cash bar, keep paying for the bar ourselves until a certain time, or keep paying ourselves.  We really appreciated that.  Options, we love options! We had an unfortunate drunk guest and they handled him with ease as well.  People get drunk at open bars - it happens.   So, we ended our wedding day/night in a cozy place with fantastic beverages, fantastic bartenders, and fantastic music.  What else could you want?", 
    "review_date": "2012-10-03"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "Located under Indigo Restaurant, the Crimson Lounge is their basement space that is typically booked up for private events, or at least that's how I've experienced it.  Plenty of seating, some cozy and intimate booths, all bedecked in, guess what, crimson.  The place can hold about 100 people tops, probably 60-80 very comfortably.  There's a dedicated bar just for downstairs, fully stocked, and since it's part of Indigo, catering can all be taken care of in one swoop. If you're interested, ask for Greg, one of the owners (they also own nearby Jade, in an effort to corner the market of color-inspired establishments, I guess).", 
    "review_date": "2008-01-29"
  }, 
  "tbYCj_yUXd0kjdipFJs2iA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Monica N.", 
    "review_text": "Very cool place for a private party. You can fit about 80-100 people in there comfortably. It can get hot, but there are side lounge rooms  for extra seating. Cheap to rent out (about $125) and the bartenders are very nice. A little weird to have the people walk through the restaurant first, but there is a side door you can tell them to go to. You can't bring a DJ, so make sure you have a good mix of CDs!", 
    "review_date": "2006-01-13"
  }, 
  "Ct456aEICzDfn03MHZCzsw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miriam b.", 
    "review_text": "dis iz a red womb...drinks for non-caeserian exit...felt claustrophobia spell coming on", 
    "review_date": "2006-07-28"
  }, 
  "kgHcYU5dZRgwZQFoVrzNnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Baochi N.", 
    "review_text": "I rented this bar for my 30th and boy, it was a great experience. First, the fee is about $150, then there is a 950 minimum bar tab. But if you invite not only a large number of people but the right people (i.e., drinkers) you will have no trouble meeting that minimum bar tab. Basically, you just have this miniature bar/lounge all to yourself and your peeps, a private bartender, and you can submit your town music. I burned 5 CDs filled with hip hop and rap and my friends got down on the floor. It was a great experience, and one I highly recommend.", 
    "review_date": "2005-07-01"
  }, 
  "sFFdPjsKWMfZA0FbAK9pEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren S.", 
    "review_text": "I went here last night for a private party and I'm still pretty hungover from it so bear with me. First of all, I do love the fact that this place is only for private parties, so you can avoid having to interact with weird people you don't know and then going home and sleeping with them because it's the least you could do for them buying you a couple drinks, right?  The Crimson Lounge reminds me of hanging out in my friend's basement in high school except everything is red and slutty-feeling including the lights and instead of drinking whatever bottom shelf vodka we could get our hands on (from stealing) from the local Meijer (I'm from the Midwest, this is sort of like a step above wal mart but a couple steps down from Target), there was a full bar in the corner. Goes without saying that since the drinks were already paid for, I got pretty shitty on the free wine because while I don't like to get drunk, I do like to take advantage of a good deal. It's frugality, not alcoholism and there's nothing you or AA or any judge can tell me to make me admit to my drinking problem that I totally don't even have.  At one point my friend showed me the makeout room in the back, which is just this little cubby with padded benches all around and it's really dark. This is the perfect place to go if you're feeling slightly uninhibited from all the free booze and you want to be fingered by a rando stranger/possibly one of your better friends whose face you can't see. Note: this did not happen to me or anyone I know in real life but it's not like that thought WOULDN'T cross my mind.", 
    "review_date": "2011-04-16"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "this is an exclusive little lounge located in the basement of Indigo Restaurant. I believe its only available for private parties... I was here for a birthday party and it was a blast! Its dark, intimate and sexy with a deep red atmosphere (hence the name)... a perfect venue for small to medium-size groups. i wouldnt recommend a big group. the party i was at got too crowded and it started feeling cramped and hot down there. the good news is, the birthday boy was a friend of mine who is gay and i turned out to be the only female attending...  lets just say standing there in a sea of goodlooking well-dressed men all night sure didnt suck.    <a href=\"/redir?url=http%3A%2F%2Fwww.crimsonlounge.com&amp;s=9c98bb8038eb3cc24c8f8ae9a91fe081cd8ee08424dec070991ab79f8005cd0a\" rel=\"nofollow\" target=\"_blank\">crimsonlounge.com</a>", 
    "review_date": "2005-04-27"
  }, 
  "oGH3lIoBzpV76TRoxPRAoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marie M.", 
    "review_text": "Hey that was my engagement party! Glad you had a good time. This place is awesome! The staff is very nice, reliable and professional...I couldnt have asked for better people to work the event. The space is great...we fit about 100 people in there and it was fine. I didnt feel hot at all like other people have talked about. I didnt think the sound system was bad either...and I am pretty picky about sound.  The rental fee is $195 with a minimum ring of $1195.  We chose to buy $500 of food in-house to help us meet our goal.  Though I didnt try any of the food myself, everyone said that they enjoyed the satay, the tuna and the salmon.  No one commented on the chipotle beef and I guess the risotto fritters were so bad that my friend had them sent back.  If I had to do it all over again I would change nothing. They really made my night one to remember and I thank them for opening up such a wonderful venue at an affordable price.", 
    "review_date": "2007-08-13"
  }, 
  "A3uskcv_ZKxtLy17XM4OyA": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Anquan R.", 
    "review_text": "This place is awesome! We recently had a joint 25th birthday party here and they were more than accommodating.  First, the communication between myself and the managers was very professional and they were extremely quick to respond.  They let us decorate to our desire and we even allowed us to visit numerous times before our event took place.  The pricing was very reasonable as well. The room rental fee was very low and the bar minimum was not bad considering it was a busy time of the year and most restaurants and bars are in high demand for private parties during the holiday...so this place was a deal! We reached the minimum no problem.  Second, the space was great.  We invited about 115 people to our event and not everyone showed up, but at one point we most likely had about 65-85 people in the bar and there was plenty of space and could easily fit a little over 100.  We brought our own stereo equipment but they provide some as well, their system is decent with a nice quality sound and great for the bar.  You can hook up your iPhone, ipod, computer etc.  We created a party mix on itunes beforehand.    Third, the bartenders were great.  No one had to wait for drinks long and they were quick to give you want you want.  The drinks were very reasonably priced as well.  They have a pretty good stocked bar considering it seems like a low key place.  They even allowed us to bring our own ice luge and were more than happy to pour shots for us and even kept the energy up.    We had read some reviews saying the place gets pretty hot but if you leave the front door open it brought some nice cool air in and the place was never stuffy. Plus they provided two fans but we didn't need them.    Lastly, at the end of the night some people who attended got rowdy and created a scene and a bit of chaos, but the employees were professionals about the situation and were very helpful in finding a solution and kicking people out who should not have been there.    Bottom line if you and your friends are looking for a place to have a private party at a bar with great prices and friendly staff...this is your place.  I will recommend it to anybody I know and hopefully they'll let us back one day to have another private event!!", 
    "review_date": "2013-12-28"
  }, 
  "X3EkIJdiBg-NaOwFM_0eqw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fabian M.", 
    "review_text": "I've hosted a few parties here. The space is great. Thhey need to add is a coat check or closet for guests. The food is good, and the overall process is smooth.  The one major downfall is the bar minimum. You need to have 100+ guests to meet the minimum. I spent almost $2000 last time I was there for only four hours. Looking back, I could have just had a great dinner with 10 of my closes friends and I would have still had money left.", 
    "review_date": "2009-11-15"
  }, 
  "jipgimnSNp3qdK2dKUQvBg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "My friend had a birthday party with three of his other friends a couple weeks ago.  We packed this place over the suggested 100 guest capacity, I guess this may have partly been due to the bar tab minimum.  The place got pretty hot and stuffy with the only ventilation being the entrance door being left opened.  The lounge location seems totally random too!  You have to look for Indigo Restaurant &amp; then to the right is the unmarked door to Crimson Lounge below.  Parking was easy to find even with so many events going on that night, including the Black &amp; White Ball.  Decor was okay....a little outdated.  Definitely thought it could have been nicer especially since you have to pay to party here, as it is only available for private parties.  Seating would have been plentiful for a smaller group.  One of the booths was occupied by a pile of coats since they didn't have coat check.  There were only two bartenders, but the wait was not super long despite the crowd. And because I was tired from work earlier that day &amp; another birthday party, my butt missed the free drinks hour!  My rum and coke ($7.50) was kind of watery.  Oh, how I miss awesome Vegas bartenders, I haven't had a super well made tasty drink since my Vegas trip almost 2 years ago!  There was food on the table, which was probably provided by the restaurant, but I didn't dare try any since it was so hot in there!    Overall, it was nice to have a more controlled setting to celebrate my friend's birthday.  But I wouldn't recommend having a big private party here, especially for the price.", 
    "review_date": "2010-06-03"
  }, 
  "dpEtyfB2o7MH1Mc_Ygoolg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron V.", 
    "review_text": "I'm over this place. I've been to Crimson Lounge twice now. They only host private events so you have to rent out the whole space. There is a $1000+ bar tab minimum in addition to a room fee of several hundred dollars. Both times I've been here, the night has been overshadowed with concerns of being under the minimum and trying frantically to get more people to show up and buy drinks -- talk about a buzz kill. This happened even at a decent sized party of 30-40 people.  It's worth noting that the bar has a very limited selection. They don't have draft beer or high-end tequila which is beyond lame. $5 bottled Heineken anyone?", 
    "review_date": "2009-01-12"
  }, 
  "NDdAkv3Ygc30PcPw7zg5kQ": {
    "user_rating": 3.0, 
    "user_location": "Bordeaux, France", 
    "user_name": "Shari Z.", 
    "review_text": "Crimson Lounge -hidden. elusive. kinda sexy. Rents out for a reasonable price to private parties only. Not marked on the outside, so you actually feel quite sneaky about showing up. Fun to get tarted up and drink fancy drinks in the dimly lit Crimson. reeeer!   Only thing is, you DO feel like you're in the basement at your friends' house who has the cool parents... it's all red (duh) and mirrored (oh! so seventies! ) and.. well. It's in a basement.  So there.  Restaurant upstairs seems okay,  but if I were the people dining there and had to watch the bar patrons go between the tables back and forth back and forth all night, I would have neen irritated.", 
    "review_date": "2007-05-11"
  }, 
  "nH8hED18wsxWurL0cleebA": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Aubrey S.", 
    "review_text": "I hadn't known about this somewhat \"underground\" space (both in its location as well as that it falls under the radar) but it was the perfect place for my friend's going away party last evening. Located under Indigo on McCallister Street, it's on a somewhat shady corner but that's all forgotten when you descend into the red leather, dimly-lit lounge. We rented out the entire space, and the experience was painless...the bartenders were attentive and friendly, and the proprietors (from Indigo) made sure our transformation from a swanky dinner upstairs into the party-time atmosphere at Crimson Lounge was seamless. We even brought our own iPod and the place turned into a pretty serious dance party with decibels off the charts. I would definitely have another party here.", 
    "review_date": "2008-01-27"
  }, 
  "wpr6gw4FnptTrk1CeT8POg": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "N B.", 
    "review_text": "the company I was with last year had their holiday party here, and I liked it because it was so cozy &amp; loungy. Food was good, bar service was good. I can't complain--a good little space for a small group of about 50 people.", 
    "review_date": "2006-12-03"
  }, 
  "hByUtyZ0_NJRZ7SC7mC-FQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kerry L.", 
    "review_text": "I rented them out for a company Christmas Party this January (yes, January).  They were extremely nice and accomodating.  The space was fun.  In fact, it ended up being a bit too large for our purposes, but, man, you really can't beat the price for what you get.  I was super pleased and would definitely consider them again for a larger event (we only had like 50 people or so and they probably weren't ever all there at the same time).  Oh, and some of the food was really good, but some was kind of boring appetizer food, I'd subtract a half star if I could, but oh well...", 
    "review_date": "2007-07-16"
  }, 
  "qcXm7gmXSLpozOl13xuppQ": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "sarah b.", 
    "review_text": "My husband and I held our wedding reception here--it was the perfect size for about 40-60 people and had a sexy atmosphere.  We found all the staff to be outstanding, especially the bartender, who seemed to be enjoying the party as much as we were while working his ass off.  There's no dance floor per se, but everyone ended up dancing in the middle of the room.  The best part is that it's a great deal--about 200 bucks for the room rental, plus a reasonable bar minimum and well-priced and very generous portions of food (we ended up with leftovers) meant that we left extremely satisfied!", 
    "review_date": "2006-09-24"
  }, 
  "6bfcLLL35DpsxAxxk5ZNAQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Tracy A.", 
    "review_text": "We had a great little private shin-dig down here.  Helps to know the chef too me thinks.  Too bad Larry left.", 
    "review_date": "2006-10-02"
  }, 
  "hQ8To_s10kfhi2rc4js5cg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jack p.", 
    "review_text": "I walked down the stairs and was assaulted by what I thought was the smell of vomit.  Now, I'm not quite sure what it was, and shortly after I arrived they lit some incense.  But I do believe somewhere in that dank basement there's a pile of vomit, just waiting to be discovered.  For the first half of the event, the drinks were free.  I decided to give the bartender a minimal test with a Manhattan -- it did not go well.  Waaaaay to heavy on the vermouth.  About 4 free drinks into it, I forgot about the failed-Manhattan and went for a dirty martini.  EWW -- who knew it was possible to so poorly combine gin, vermouth and olive juice?  If I had paid for any of these drinks I'd have to stabbed myself in the leg to prevent myself from making a scene.  As soon as the free drinks dried up, I ordered a simple whiskey soda that cost me $7.  Youch.  All in all, if it's free I'm there, otherwise, pass.", 
    "review_date": "2008-06-01"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "This place is decent for what it is: a private basement converted into a bar with lots and lots of crimson. Ron is a cool guy though, and the drinks aren't cheap but are definitely not watered down...", 
    "review_date": "2007-07-01"
  }, 
  "-W3ZtZ11Rdq4fH2RPD-t9Q": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Mahogany G.", 
    "review_text": "I organized my work's holiday party here and everyone complimented me on the choice of venue.  This place has a great decor when the lights are turned off (came here during the day to scout it out and it was a little grimy) and the bartenders were wonderful.  The manager was very accommodating (I think his name was Greg) and the food was outstanding.  They even let us bring in our own desserts  because he knew we were on a budget!  All in all, I am very pleased with my experience here.", 
    "review_date": "2006-04-27"
  }, 
  "OUmvbYx8PuiIUn_r8NHTxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karin C.", 
    "review_text": "This a great room to hold a special event for about 50 people. Before your party, enjoy the delicous food upstairs at Indigo.", 
    "review_date": "2005-05-02"
  }, 
  "_q_z9bIwYg2q0mSNbwxmGA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Timothy O.", 
    "review_text": "Great party space located in the basement of Indigo Restaurant. The decor is dark red, with plenty of nooks and crannies and couches for separate conversations. The space is confined and down a stairway, so larger groups have problems with feeling cramped and hot.", 
    "review_date": "2005-10-03"
  }, 
  "hkOiI-ctPYFuurzJZF6H9Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anjali K.", 
    "review_text": "A cozy little space with warm colors on the wall and plush comfortable couches lining the walls - Crimson Lounge is a cute space for a private party whether you're the host OR the guest... the only negative is that the entrance is a tiny steep staircase with a rickety old banister that is not exactly crutch friendly... luckily, most of us have gotten good at hopping :)", 
    "review_date": "2005-07-24"
  }, 
  "aIk07jxkia9izLMKRbaHHw": {
    "user_rating": 3.0, 
    "user_location": "Columbia, MO", 
    "user_name": "Max C.", 
    "review_text": "Fun space for parties, minus two stars because it gets HOT down there.", 
    "review_date": "2005-05-03"
  }, 
  "Fz3y-d7Ru7wMRnPuwG-OLA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mick F.", 
    "review_text": "Having been the doorguy for this place pretty much the past two years off and on, ive seen my share of great parties. There is a good chance i was that douchebag who politely told you to be quiet and cut the racket if youve been to any event here. It is always reserved for private parties, and it used to get effing hot down there. Like, swampass hot. They have since built their own entrance which when the door is open, circulates a lovely breeze through. I hang with the barstaff, so i think theyre peaches. Book your next Xmas party or 30th birthday or turtle race here. Tell em Mick sent ya for a free weird look involving a squinted staredown!", 
    "review_date": "2005-07-01"
  }, 
  "UzUnpnlH1n346MDgaFMOmw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Stephanie W.", 
    "review_text": "This is a nice, private lounge that comfortably fit about 60 people without feeling too cramped.  The staff that run this downstairs venue are super helpful.  They rent the space for a very nominal fee and also will do the catering (which was mediocre) and either a cash or hosted bar.  I was impressed with how everything was setup and it was super clean.  \n It had a relaxed atmosphere and they let you bring in your own decor as well as  your own iPod, but their speakers suck!!  \n All in all, this is a good place to throw a small private party and have it feel both intimate and slightly on the decadent side.", 
    "review_date": "2005-12-19"
  }, 
  "3rWdCM2_AK7GWQlwzRO99Q": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Charles C.", 
    "review_text": "Crimson Lounge is absolutely wonderful.  Hidden away under Indigo, this is by far one fo the best quant small private bars to rent out for any special event.  There is something really cool about this place, perhaps its just the low key feel but yet classyness to it.  Whatever it is, I had an amazing time when I came here for a friend's engagement party.  Drink prices were extremely well priced, a great bartender who was not sheisty with the alcohol and great company.    I highly recommend renting this place out if you are looking for a medium sized venue for a private party.  I hear its very affordable and a very doable bar tab to meet.", 
    "review_date": "2007-08-13"
  }, 
  "60LyeKIn5DWHQtTlzi01vg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E C.", 
    "review_text": "Disclaimer - I did not actually hold an event at Crimson.  However, I did want to report on my experience trying to book the room for an event.  When I called to inquire about the date and ask when the best time would be for me to come in, I was told that it was open on my date and that I could come by any time after 5pm to check out the space.  When I came by the next Saturday to check it out, I couldn't because they were hosting a Dining in the Dark event which I believe is something they do frequently on Saturday nights (beware).  This was quite annoying since they could have told me that over the phone when I asked.    I came back the next day to see the space, which was a perfect size for a 60 person event I was planning.  I loved the fact that you could bring your own music and food.  They also had some fun twinkle lights strung up on one side of the room.  The downsides of the space are that the bench cushions and other shelving is run down.  Not sure how important this would be during an actual event but it was still noticeable in low lighting.  There was also a weird smell in one corner of the space that was not very nice. Not sure if this is something that could be fixed or not with candles/baking soda magic.  After much deliberation, I decided I wanted to book the space and was filling out the contract the next day.  I then got word that the space was taken the day of my event, when the previous day they told us it was available and it would be fine to send back the contract in the next 24 hours.  Overall, the service/organizers are amateurish but the space itself was exactly what I was looking for at a reasonable price point.", 
    "review_date": "2011-12-13"
  }, 
  "E9m9adcWg9h8mRX9idm9Qw": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kelly C.", 
    "review_text": "Attended a private party (roaring-20's themed) here a few weeks ago. As the name implies, it's lounge that's crimson red inside. Underground basement feel, big enough to fit a pretty decent-sized party, cool for the speakeasy 20's theme of the evening.  One of the highlights of the night didn't really have anything to do with the space or party itself, but with the crimson lounge staff. Our male bartender for the night was a perfect clone of Kip from Napoleon Dynamite. Complete with physical appearance, outfit, glasses, and attitude. I think I would have lost it  if he uttered \"Your mom goes to college\" when I ordered my drink.   Beyond Kip the bartender and the party itself, the place was OK. Drinks were a little pricey and at certain points I thought I was partying in an east coast college party house.", 
    "review_date": "2007-07-12"
  }, 
  "Uqg8zgMw-JYJNpjVtFXqng": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "Nicole R.", 
    "review_text": "As everyone has said, this is a great place for a party!!!  The lounge is very sexy...a great size for smallish groups though I've been to work parties here where there were a lot of people.   And yes, it does get very warm. So don't wear long sleeves!", 
    "review_date": "2007-01-25"
  }, 
  "vSTi9G85c5c8RNPFIEMETQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny K.", 
    "review_text": "I came here for a private birthday party. This is a great place for an intimate gathering of friends. As the other Yelpers have noted and the name suggests, this basement bar and lounge is red all over. I thought the plushy red surroundings gave the place a cool, retro vibe. The ceilings are rather low. Anyone over 6'2\" would probably be uncomfortable. However, there are plenty of plush couches and leather bar chairs to sit on and chat.. The air gets very stuffy and warm unless you're standing near a vent or doorway.   The bartenders were very cool and there is considerable privacy for parties as it is located underneath the Indigo Restaurant and can be reached by either entering a signless door that goes directly downstairs, or through a staircase located at the back of the restaurant.   I would definitely consider hosting a private party here.", 
    "review_date": "2007-05-25"
  }, 
  "ssXAz7RahuYNDx7FeRe4Aw": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Alex L.", 
    "review_text": "Great place to stop for a drink before or after Indigo, or just for a break from the hustle of the more happenin' parts of the city. I never knew it was \"private-event only\", I've always just walked in and never been hassled *shrug*  It does get a little hot down there, kinda adds to the velvet dungeon feel in a sexy sort of way. And it's in stark contrast to the often cold and wet city air.", 
    "review_date": "2005-12-09"
  }
}