{
  "fqZ4q0tL8chJ_vJWALMfnA": {
    "user_rating": 4.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Emily R.", 
    "review_text": "Loved this hip bar! The bartenders were very nice and made me a great martini, atmophere was fun and playfull. Even the double stall (or lack there of) in the bathroom cracked me up. Shot some pool and ordered a pulled pork sandwich that blew my mind with flavor that was outta sight! Dear Mom, I will come back for more. From, Eme.", 
    "review_date": "2013-04-15"
  }, 
  "kdFUM8jwXDcOhxJ0k3SoFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "c l.", 
    "review_text": "super nice tenders. great food from Laurent. will be back for sure. thanks dear mom dudes.", 
    "review_date": "2011-12-12"
  }, 
  "DUGfV_bCL14QXdOyyG-saw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlyn M.", 
    "review_text": "I went here last weekend and ordered The Burger. It blew my mind, it was so good. The ingredients were so fresh and the combo together was so tasty. My friend ordered the Papas Fritas and they were delicious as well. The atmosphere was chill and welcoming. I will DEFINITELY be going back soon.", 
    "review_date": "2014-11-18"
  }, 
  "pAOfQZX3jD1f0kS569tzZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kellsie F.", 
    "review_text": "Good time all around. PBR &amp; Jameson shot for $7 sure did the trick all night. Really good food too!", 
    "review_date": "2014-01-08"
  }, 
  "u19H4x_V9pUjLY4a1jc3tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John D.", 
    "review_text": "Awesome burger if a bit overpriced.  Beer selection will appeal to IPA lovers.  Happy to have this place in the neighborhood.  To my original review I would add the following:  Outstanding burger.  Rivals the the best in SF (may be the best; another trip will tell).  Terrific bartender.  Still though, I wish the beers weren't $6 each on a Saturday with few patrons.", 
    "review_date": "2014-09-13"
  }, 
  "tgUvk_rJXFr24q-X7I1U2A": {
    "user_rating": 5.0, 
    "user_location": "Mesa, AZ", 
    "user_name": "Stacey D.", 
    "review_text": "My Giant loves this place, so we went in yesterday (Monday July 2nd) to see if we could reserve a table for his birthday. The bartender, Paul, was awesome. He made sure to let me know that they would accomodate, reserved us the big table in the front, and is going to allow me to bring in my cheesy Star Wars decor. :)    And we couldn't just go to Dear Mom for just a reservation. This is the second time I've been there and the food never disappoints!  I had chipotle wings with a blue cheese dressing that I LOVE!  Best blue cheese!!!  Of course, I had to have a coctail while I was there too.  Heck, it was happy hour!!  Love this place - recommend it for everyone!  Space and decor is great, and welcoming.", 
    "review_date": "2012-07-03"
  }, 
  "OXYtOFX9xXukagW5Ku5dfg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sofia R.", 
    "review_text": "Some friends and I were looking to go bar hopping one night. We had a bar in mind but while we were looking for parking, I saw this place and decided that we needed to check it out.  The place itself has modest decor. Dim lighting via interesting, hanging light bulbs, chalkboard menus, wooden furnishings, games, a photo booth....honestly the most hipster bar I have ever set foot in. It's also rather spacious with a good amount of seating. It was pretty packed for a Sunday night so we sat at the bar.   Service was friendly and patient. Really chill people who seem to have a lot of character.   I ordered a pint of Anchor Steam ($8) while my friends got Anchor Porter ($9) and water respectively. We also ordered a Spanish Chorizo pizza ($13) for us to share.  The beers were good. I rather like Anchor Steam. The pizza took a little over 10 minutes, but it was quite tasty. They bake the pizza and then pan fry it to make the crust a little crispier. I like that a lot. This is a pretty small pizza though so don't expect a party size.   I really like this place a lot and I do plan to go back one day. Really chill place!", 
    "review_date": "2012-02-03"
  }, 
  "XXi_Q7XMI7I9iqfXi_W42w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle M.", 
    "review_text": "Fun crowd on  a Friday night. But, when it is super crowded it's irritating. Cheap drinks ($4 well!). If you sit down at the tables in the back, there is waiter service.  They also have a rotating art gallery which is fun.   They also have a decent space to rent out for events and give back to the community.  The food is very overpriced for the venue.  $10 for a half cup of mac and cheese? Ripoff.", 
    "review_date": "2012-02-13"
  }, 
  "NCg53EdDxLZrVAF2PQppTw": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Jon W.", 
    "review_text": "Cash only...tough decisions...beer or beef.....dam those burgers look good with my beer goggles....", 
    "review_date": "2013-06-02"
  }, 
  "wJgtf18VKKZq9A6ZQUybQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candace R.", 
    "review_text": "I walked with a friend one Friday night and to say that the exterior does not match the interior is an understatment. I was pleasantly surprised at the vibe and this is a spacious, cool place to hang out with friends, grab a drink, eat a meal, or just kick it. I only had a drink while I was there, but the food menu, as small as it is, looked really appetizing and I would definitely come back.", 
    "review_date": "2014-11-09"
  }, 
  "qPGhjScyxtuHrWXN4A8VXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Loli L.", 
    "review_text": "There is so much space in here it makes me want to rollerskate.   Drinks were great, food was fantastic, but the ladies bathroom situation is totally bizarre. It's a lovely bathroom, don't get me wrong. In the absence of stalls, the partition was a nice touch (though you can still see through them). However, that one toilet in the front - the one that's exposed when someone opens the door- that's just a teeny bit awkward.   Apart from that, this place is fabulous.", 
    "review_date": "2012-01-17"
  }, 
  "TsbkNTS0_AzCaRbhhe4C5A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay N.", 
    "review_text": "Don't be fooled by the title, it's unfinished, the full title is actually: \"Dear Mom, We're a Bunch of Hipster Dickheads\".  I know that sounds harsh, but these people were inexcusably rude.  My boyfriend has been dying to hang out at this bar for ages, so when his birthday rolled around, he decided to make a reservation. He didn't want to risk it getting lost or confused, so we actually walked to the bar to make it in person. This is when I should've noticed the first red flag.  [To preface this, this was NOT a busy night. It wasn't really late and there weren't a million people to attend to.] It took forever to get anyone to talk to us. Everyone who worked there completely ignored us. I stood at the bar in case I could speak to the bartender when he came to ask me what I wanted to drink...mistake, he never asked me what I wanted to drink. I just stood there trying to get his attention like an idiot, until my boyfriend finally just stepped in the path of the server who was ignoring and walking right past us, and asked about a reservation.  They had him write all his information down, told him for the 20-30 people he expected, they'd have to book him the back room, and then said they'd call to confirm.  A whole week passes, no call. My boyfriend calls every single day, can only get through to answering machine, and still no call. However, we weren't THAT worried since it doesn't usually work like this: If it's not confirmed, we won't even bother to call and tell you that.  So finally it's his birthday, we all show up, to bring massive business to this place, and OOPS, they LOST THE RESERVATION, and they gave the room to someone else.  Okay, any decent, professional business would try to compensate for this somehow. Or at the very least apologize profusely. But not Dear Mom! I guess they're above that.  Instead, they pointed to a table that was pushed against the handicap ramp and video game machines (hence making two sides of it inaccessible for anyone to sit) which didn't matter because for our party of 20, they provided us with exactly two chairs; and they told us we could have that. Actually, \"provided\" is a loose term as that would've required they'd put in any effort at all. The two chairs were already at the table.  Then, they proceeded to completely ignore us for the rest of the night. That's how they treat someone on their birthday, bringing tons of business to their bar, who bothered to try to make a reservation.  TL:DR- Don't bother making a reservation here. Don't expect any kind of kindness, politeness, or the bare minimum of civil customer service, even if it's your damn birthday. What you'll get instead is unfathomably rude and disinterested service, if it can even be called \"service\".", 
    "review_date": "2012-07-16"
  }, 
  "n9NEd4wwuMs72gffl21AOg": {
    "user_rating": 2.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Sebastian L.", 
    "review_text": "Hmmmmm, this review is a toughie. Swung by with my brother and some friends last night after having heard that Dear Mom was going to be another SF hotspot. Severely dissappointed in the result.  First the pros: door man was so easy that he didn't even check for ID's. Drinks are served at dirt cheap prices. The interior is a vast space, though there is no interior design to speak of. You've got Foosball tables, pool tables, video games and a massive Connect Four game. Oh, and a photo booth too. All the ingredients for a decent time.  Now the cons: the crowd...just wasn't my scene. Like, at all. Was there even one remotely attractive female there last night? I don't think so. Instead, it was a hodgepodge of hipsters and alternative types. Oh, and there was some random guy walking around all night with his skateboard, so I guess if you're a skater, this would be a good spot for you too.  In reading the comments, I note a distinct sense of disdain for hipsters in this city. I'm not going to hate on hipsters...they need a place to hang out too.  But what can I say? I guess I'm just a mainstream kind of guy. I like my ladies in Size 0, 2 or 4, in mini skirts and heels and with a Chanel or a Birkin. I don't go for Size 12's with multiple eyebrow piercings and 13 tatoos. That's just me.   And so, while freely admitting that this place probably just wasn't meant for a guy like me, I'm going to say that I can't recommend coming to Dear Mom. Especially given it's out-of-the-way location.  And you can trust me on this one; I'm an Elite. ;)", 
    "review_date": "2012-02-26"
  }, 
  "YBtElKhZ2i8KXUSgXwuKZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chandrika G.", 
    "review_text": "Beer is great. Food is delicious. I loved their sriracha buffalo chicken sandwich. Very friendly and accommodating. We had a meetup with about 15 people and had an amazing time! Thank you Dear Mom. I'll be back soon!", 
    "review_date": "2014-02-27"
  }, 
  "ReDoGveUTyzlfC0bZOQ3bA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Negien M.", 
    "review_text": "Very self-aware hipster vibe.. I think the special was PBR and a shot of Jameson? Yuck.   I had a Michter's Old Fashioned that wasn't actually with Michter's because they \"ran out\"... I saw two bottles in plain view.. couldn't they have at least hidden them? Still, it was fine, and despite the madness at the bar, I got my drinks pretty fast. The bartenders were definitely hustling... never seen hipsters sweat like that.  The photobooth was awesome, and the lighting was fantastic.. got that can see each other, but still totally flattering thing down.. tricky. The pool table was sorta awkwardly placed.. makes for a lot of being poked since the bar is CROWDED.. One of my friends couldn't get in later in the night. I think I'll come back in a few weeks (months?) once things die down.", 
    "review_date": "2012-01-17"
  }, 
  "J9HamWsxKorlPGUAXy-M9Q": {
    "user_rating": 3.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Ronald L.", 
    "review_text": "Interesting bar they have here in the Mission district.  It's pretty dark inside but at least there's sunlight shining through the front doors to allow you to have a decent game of foosball.  There's a wide variety of microbrewery beers on tap along with some bottle beers for those weird fellows who hate drinking draught beers.  They do have a kitchen which surprised me as I thought this place was strictly a bar.  The food were fairly priced but nothing too spectacular.  Overall, a jolly good place to go during happy hour.", 
    "review_date": "2012-07-17"
  }, 
  "9FPm9wj_zcBWJuB9-Tlqcw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Laura A.", 
    "review_text": "Really enjoyed this place. Loved the shape of the bar. Makes it easier to talk to people. LOVED the food. So delicious and pretty reasonably priced. Staff was super nice too. Also, who doesn't love playing Big Buck Hunter in between drinks?", 
    "review_date": "2012-08-16"
  }, 
  "Myy-tV1aKksxkQ2R7QUkAQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kwoky L.", 
    "review_text": "Not a fancy bar by all means but I quite enjoyed their friendly bartenders and great drink specials on a weekday. There was this Bulleit Bourbon shot and PBR combo for $8 or something, which was interesting. Not my kind of crowd though.", 
    "review_date": "2013-05-25"
  }, 
  "Q0qo1Gi99LihNjitnpfCAw": {
    "user_rating": 3.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Audrey C.", 
    "review_text": "Cash Only. Divey, but not really. Kitchen's open until closing. Last call's at 1:05 am.  Good place to go with a group of friends. There are huge tables/booths. It's not too crowded.  There's a full bar. Jukebox with great music. Great people watching! A bit too brightly lit.", 
    "review_date": "2013-12-01"
  }, 
  "nMTE1riYtYBLLAbaXwZA1Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Atom H.", 
    "review_text": "Guess you love it or hate it, guess Im just a hater. This place had overly sticky floors its not from sweat since the bartenders are not rushing around to get you drinks, must be a co-op. Anyways I went for food, and they were out of everything, everything that is but condescension. I like a crappy bar, I like a bar where the bartenders are jerks but the drinks are strong, I dig that crap.  But give me my damned drink, yes there are some cute hipster chicks in the place and they need drinks, but I need them too... much more now....         Its still newish, its still getting to its place, hope it gets better since its down the street.", 
    "review_date": "2012-07-27"
  }, 
  "IDdafFBKpl9HPAtMlTmyOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole N.", 
    "review_text": "Four stars or five? Can't decide! Came here on a date last night and I realllllllllly liked it. I've walked past here so many times and it way surpassed my expectations. Though we were laughing over the 8$ kale tacos (*eye roll*) Cash only !", 
    "review_date": "2014-01-31"
  }, 
  "0CqAmHUSWPEQdrnCbDiaVA": {
    "user_rating": 4.0, 
    "user_location": "Marina del Rey, CA", 
    "user_name": "Brian B.", 
    "review_text": "Surprisingly neat little place in an otherwise unremarkable part of town.  I recommend Dear Mom.  When we went it wasn't too crowded.  Staff was friendly and food was pretty good.  I enjoyed it rather a lot.", 
    "review_date": "2013-07-14"
  }, 
  "hA8et-LncZc1F1_seQl4eg": {
    "user_rating": 1.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Kelly M.", 
    "review_text": "Dear Mom has the illusion of being a great bar. When you walk in you think \"wow, this place is huge! AND they have Radeburger (sp?) on tap?\" Stop yourself there. The bar is huge but they never have enough bartenders. Tonight I waited over 20 minutes for a drink at the bar. Then when i was seated at a booth, I waited over 30 minutes for a waitress, who I requested to the barback every time he came by. When she finally came by , she didnt know what a greyhound was. Enough said. The ladies restroom is a joke- reminds me of the camp latrines as a 10 year old girl scout. And finally, they turn on the lights and begin shouting at you to finish your drinks at 1:15. Yep, 1:15. Does anyone else remember we are in a recession? Do I have to force someone to take my money? Oh wait, they don't want it. Nice try Dear Mom. Fail.", 
    "review_date": "2012-02-12"
  }, 
  "hfFndkuiExobJkSV_Apqfg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katrina R.", 
    "review_text": "Mom should have raised the staff here better...  After bending over backward to get a reservation for my friends birthday, we arrived at Dear Mom - only to discover that they had completely dropped the ball and given away our semi-private room to some randos who had just walked in. The incredibly unhelpful staff then dismissed us to the worst table possible - a table that literally had two chairs for our party of 20+.  To make matters worse, the drinks were no good. Everything was expensive. Every staff member was a total jerk. It's really too bad, because the space is cool, not too crowded, with a pretty entertaining crowd.  Awful, awful, awful.", 
    "review_date": "2012-08-02"
  }, 
  "ti4lRf8rv9KICw6msOJT0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ameer N.", 
    "review_text": "We played the PBR connect four, ate a hot dog and slider. The bartenders had 2 people deep but still managed to deliver a short wait time for drinks.  I'll be back, yes I'll be back.", 
    "review_date": "2012-01-12"
  }, 
  "QpWqxub4dJ97Y65J6t-GDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coco M.", 
    "review_text": "Went in last night after a 12 hour shift for a brew. Great ed by a lovely dark haired bartender with big smiling eyes, i was sitting and enjoying my draft beer  and her company within seconds of walking in. The scene was lively with a good looking crowd and the staff was working harmoniously to keep drinks topped off.", 
    "review_date": "2012-06-24"
  }, 
  "8b9GJsvhIfbyLRyFTbIUqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Good for brown drinks. Great pop-ups for food.", 
    "review_date": "2013-07-25"
  }, 
  "rkag74WYKAPSJ_DvtdfgTQ": {
    "user_rating": 5.0, 
    "user_location": "Colton, CA", 
    "user_name": "Anthony A.", 
    "review_text": "Wifey and I came in to meet a friend one mid-afternoon, and they happily served us some beers while we waited for them to switch from lunch to dinner in the kitchen. Nice atmosphere, friendly staff, I could kick it here.  Then I tried some food. We didnt have too much time so we tried some simple fare. Edamame and Papas Fritas. Let me say that I was blown away by how complicated the \"simple fare\" was. The Edamame was soaked in the perfect amount of lemongrass and sesame seed, it was terrific by itself. Then I tried the Papas Fritas. It is a delectable and cheesy comfort food with a bit of heat to it. Impressive. Definitely recommend this spot, in the daytime anyway. Ill be back.", 
    "review_date": "2013-11-02"
  }, 
  "StJ9m1-R2EGNJVS6CJl4SQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasmina T.", 
    "review_text": "I didn't try their food. I was there with friends and drinks :) Enjoyed my time definitely. Nice hip bar!", 
    "review_date": "2013-04-17"
  }, 
  "PQPk3yifh1O0C7tYAmGfLg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark i.", 
    "review_text": "+4 for service - Olvier, Matty Bo, Big Nate, and Jean Jean are at the top of their game. Let them take care of you - they're in it to win it.   +4 for the bar food - listen - trust me on this one - get the steamed hot dog in baguette - it's bomblicious.", 
    "review_date": "2012-01-14"
  }, 
  "adKonsQWY64vJYglPotH5Q": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Stefanie C.", 
    "review_text": "I pass this place every once in awhile so I decided to come here with my friend. It's kinda confusing when you walk in if you haven't been to Dear Mom before. There's a bar in the center of the room and I think most people just come here for a drink, but there is an option to be seated if you approach a waitress and say that you want to eat something.  The menu is disorganized and doesn't make sense. It looks like someone just threw everything onto a piece of paper. It's not in order of price or separated into appetizers and entrees. Nevertheless, we ordered the Papa Fritas and Buffalo Burger. YUM the Papa Fritas ($8) are cut potatoes with cotija cheese, chile, tapatio aioli, green onion, cilantro, and lime. The tapatio aioli makes this dish AMAZING. I already know I'm going to have specific cravings for this later. The Sriracha Buffalo Chicken Sandwich ($12) has lettuce, onions, tapatío aioli, and scallion sour cream... served with waffle fries. The waffles fries are okay but I love the sufficiently spicy buffalo chicken. So tasty! Good place to lowkey come in and just get some upscale bar food and a beer... granted they don't run out of the beer on tap like what happened to me.", 
    "review_date": "2015-02-01"
  }, 
  "nbfyMmgqnxXIp7EDqTmkqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kajal G.", 
    "review_text": "They have a lot of pop up restaurants here (brunch and dinner hours) and man are the results tasty. Ate some pork cheek sammy which was delish and house made potato chips that had gorgonzola, pepper and green onions. Yum! Lots of beer for cheap and they were practicing making Manhattans so we scored one for free and it was probably the best one I've ever had. Very citrusy and didn't taste like straight alcohol. I'm also a big fan of the Ante Meridian pop up here. Black truffle waffles. (insert homer simpson drooling noise) Crowd is hipster-ish but the bartenders were super nice. I liked the Boston transplant working there too. Also the bathroom was huge for a bar and had 3 stalls and was super clean. But remember- CASH ONLY", 
    "review_date": "2013-10-14"
  }, 
  "OHLr0T6mAF31tcjSskvK4w": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Michael A.", 
    "review_text": "Cool spot! Cheap drinks (relative to Los Angeles)! Makers on the rocks is $6. Tried their pork bao and it was pretty good as well but at $11 for two small bao's I'm not sure I'f ever buy them again. I'd come back! Make sure to check out the drink specials on the wall.", 
    "review_date": "2013-08-31"
  }, 
  "5O8fn99pTl2r72AfySA_9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsey K.", 
    "review_text": "This was a really cool place. It's great for groups and the assortment of liquor is pretty awesome. My hubby enjoys trying various bourbons and whiskeys and he more than approved of their selection. The ambiance is pretty casual, yet I feel like everyone in the place \" had it going on!\" They also offer a very unique assortment of bar bites. Aside from your typical grilled chicken sandwich, the menu items were very creative and not necessarily typical of bar food. For example, I ordered these fried chicken wraps, but they were actually fried chicken wrapped in an egg roll with Asian spices. Very delicious. My husband ordered the nachos. Again, they were not tortilla chips and melted cheese...they were more like breakfast potatoes mixed with cheese, peppers, and some other stuff. Very good and interesting. Dear Mom is a little out of the way for us and requires a can ride, so I don't think it'll become our Friday night go to spot, but it will happily and excitedly return for a special occasion.", 
    "review_date": "2014-04-10"
  }, 
  "Ck1vY1icLM3X51yqr2SGWg": {
    "user_rating": 1.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Pavinder M.", 
    "review_text": "Made a mistake wearing a suit and had to wait about 20 mins for a drink, Friday night trying to have a good time for my friends bday... Grow a stash and wear a beanie. Slim pickings!!! 20-35 for a drink wait....", 
    "review_date": "2013-10-11"
  }, 
  "tHJyFHGH_mnBxZ7WffZlZw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alexis D.", 
    "review_text": "I ended up at this bar on New Years Eve, which of course means it took way too long to get a drink and it was crowded.  However, that was expected and I thought the bartenders and bussers were nice.  The bussers actually asked if I was done before taking my glass away, which is always a plus!   No tanqueray (my personal favorite) but the bartender was nice enough to recommend and pour us a gin from a local distillery (209 Gin) for the well drink price ($5 i think).    They have a photobooth, but only an internet jukebox (boring in my book).  It'd be nice to see a DJ in here on the weekends. CASH ONLY, and their ATM machine was broken with no nearby ATMs.  Come prepared!   In the end, I'd try it again!", 
    "review_date": "2012-01-01"
  }, 
  "s4g5fAinKE8U84z9LfXwsA": {
    "user_rating": 4.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "Amy A.", 
    "review_text": "This is my first time at dear moms and I like it so far. There is plenty of seating, and the drinks are good. The prices are average, but the overall atmosphere was really great.  They have a jukebox with a really decent music selection under the one credit plays which was a major plus.   I had the kale tacos, my goodness they were delicious! They were made just right, and had a really good spicy kick to them.  They have a great beer selection as well. So you can pair your beers to your food really well.  The bad: the service at the tables was average, the server took forever to come check on us.   That's really the only bad review I have was the slower service at the tables. The bartenders were definitely on point though.", 
    "review_date": "2015-02-02"
  }, 
  "tlY0QMQDyfjQAEwHnzvFnw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken G.", 
    "review_text": "3.5 Stars is the perfect summary for this place.  This isn't typically a place I'd go to, but I did like my experience here.  The crowd is a bit more hipster-like and the space itself is a bit on the divey side.  We had a couple of drinks (Vodka Tonics) and they were great- really tasted perfect and refreshing.  We also had their Papas Fritas, which were very good and a nice generous portion of flavorful potatoes.  Our server was very nice and attentive.  I'd go back to this place if I were in the area.  I do have to say, the Burger looks awesome...", 
    "review_date": "2013-09-23"
  }, 
  "RcG6xWQi9f5lz6XmNqBV3Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristen K.", 
    "review_text": "Dear Mom,  Turn the music down.   I never thought I'd have to say that, but perhaps your hearing is shot. You know I just want to relax on a Tuesday night with friends and enjoy the wonderful pool table, over-sized Connect Four, drinks and food you've provided.   I'm very appreciative of this, I promise, along with the space to breathe. Thanks for not smothering me.  I'm thinking of moving out though. It just doesn't feel like home.   With love, Your Mission daughter", 
    "review_date": "2011-12-14"
  }, 
  "WmCkuhKALpZM60kJrbOFKQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick T.", 
    "review_text": "do not be mistaken, this is a total bro bar.  it's good if you like that sort of thing...", 
    "review_date": "2012-04-20"
  }, 
  "qPMyo8LL1wvwirF5URHzxQ": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "James A.", 
    "review_text": "Great space and great vibe.  If you come here thinking of it as a restaurant with a full bar, you're probably going to be a bit disappointed. Really, Dear Mom is a pretty sweet bar that just happens to have some great food options. On the subject: try the chicken sandwich and the pork belly bao. Both really good, though the latter could be a bit bigger.   Missing a certain je ne se quois that's required for a 5 star rating, but for our group of 11, it made for a great night.", 
    "review_date": "2013-05-19"
  }, 
  "9fg9i7ke1NAGhf8W3e97VA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth m.", 
    "review_text": "This spot was so amazing  it's hard to believe it used to be El Ricon. Looking around now you'd never guess that it used to be a dark, forgotten, shady bar with no appeal....COMPLETE TRANSFORMATION!!!!!!! You walk in to a large open area, great music playing, pool table, more open space, booths that can sit like 10 people (finally someone realized people don't always travel in packs of 4)   You stroll up to the giant U shaped bar to get a beverage that can range from a beer and a shot to a fancy pants cocktail that could impress the biggest of cocktail gurus. Not to mention the bar staff is totally awesome and friendly, giving this place a muuuuch needed neighborhood vibe.   I had actually never tried anything from Chez Spencer before (yelp elite, please don't hate me) but luckily they have a menu and a kitchen right there at Dear Mom!!! My friends and I got several appetizers to split and loved them all. I was especially happy with the slider, the mac and cheese, and the asparagus salad. It was really nice to actually have decent food while enjoying drinks.  A good reminder for all, this place does close at midnight...it will be the first stop on many of my nights out. Welcome  to the neighborhood Dear Mom!", 
    "review_date": "2011-12-05"
  }, 
  "nv8YtTruvxRwBDaDyxgGCw": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Jason S.", 
    "review_text": "Stumbled into Dear Mom on a Sunday afternoon and wound up closing the place down!!!  It was amzing!!! they have this cool concept on Sundays where a Guest chef can come in and tear up the kitchen with their skills....the food was fantastic!!!! The ladies were great, and the atmosphere was way laid back for the \"City\"!!!  Go MOM!!", 
    "review_date": "2013-06-19"
  }, 
  "4bmt96Q-UMZC8WzWTx8p-A": {
    "user_rating": 5.0, 
    "user_location": "Clawson, MI", 
    "user_name": "victoria z.", 
    "review_text": "Our favorite new lunch spot!  We have been here twice, I believe they just opened this week. We were walking past and saw the chef out front, he explained the entire menu to me willing to answer any annoying question I had, and we went inside. They have done an incredible job of renovating the space. Giant wooden tables and bars, Edison bulbs hang from the ceiling they have a homey feel made modern it's really great.  Ordering You walk to a window in the back and they have two menus, the pricer menu which is their daily specials. which average about 16 dollars and are huge portions. Today was the trout, it came with spinach and was an entire trout for 16 dollars ( I did not have the trout my friend did.)  the second menu ( both are on adorable chalks boards.) Offers up french slider 9 dollars-My boyfriend had this,  a hot dog in a baguette Soy or beef with a small green salad, and fingerling potatoes 6 dollars -I had had this,  It's a steal and my favorite thing I have been looking for is a normal soy hot dog, its been so hard in sf to find one they isn't a sausage variety. This is the perfect hot dog, I believe the mustard is homemade. It's a perfect portion and high quality ingredients.  I have also tried two Mom's daily soups, yesterday was potato leek with a pepper sauce. Today was cauliflower with a crunchy Parmesan circle about the size of the bowl laying on top this added a ton of flavor and crunchiness to the soup. Both were very good.  We also tried the asparagus Salad 6, with pepper cream sauce, like a way better version of ranch served over asparagus some other littler greens served warm. Outstanding. I loved this dish.  Now for the best thing we ate, it gets better? It does! We ordered there mac and cheese. It is 5 cheeses with the same Parmesan thingy on top, in rich creamy sauce. This is the best mac and cheese I had ever had. It's creative and fresh tasting, I will be coming back and getting this often. the only downside is the serving size is kinda small so for lunch alone it's not as filling as the hot dog or slider. But I imagine it's priced the way it is because they use 5 very fancy high quality cheeses.  Also you order directly to the chef and he is the nicest guy, his food is amazing, the staff makes sure you are happy with what you have ordered, he has personally come over twice to ask we were pleased with our dishes.  Today he remembered us from yesterday, and threw in 2 free cookies. They were little sandwich cookies one vanilla and coconut with a vanilla cream and raspberry  jelly in the center. The other a chocolate cookie with peanut butter in the middle. I will now be getting the cookies every time. They are 2 dollars.  We spent about 25 today and 20 yesterday. Also pint pbr cans are only 3 dollars, coke is 1 dollar. They also threw in my coke for free today.  I think we will eat here everyday this week. I'm especially excited for Thursday it's a Fowl special. Fowl simmered for an entire day in a tomato and olive sauce. Saturday is a beef special with cheesy mashed potatoes.  If you are in the mission looking for a new great place to have a couple beers, or a fabulous meal this is your place. I debated writing this review because I'm seflish and want them to stay slow because I'm enjoying the staff interaction, but this place won't stay a secret for long it's too wonderful.", 
    "review_date": "2011-12-06"
  }, 
  "v0k97XEwlDWwUTt8M8CJ4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy J.", 
    "review_text": "Sometimes the best bars are the ones playing the angriest music.  Big, open space, some booths, a pool table (I think?), some angry metal music, but solid beer selection if you're into IPAs (who isn't?!).  Nice place to come for an evening to catch up with some friends. And they have a juke box so you can actually play whatever you want if you don't like the angry music.", 
    "review_date": "2014-09-14"
  }, 
  "jf6_EW7qBrXVKEKbrjz7jw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colt S.", 
    "review_text": "Great place to get your hipster on.  If you're looking particularly \"Marina\", be sure to steer clear, we were heckled to the point of being kicked out during our last visit.  Just the same, I'm always up for a Dear Mom night.", 
    "review_date": "2013-07-28"
  }, 
  "Dsn0E5ad3oom8iGIrFXPsQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle N.", 
    "review_text": "Dear Dear Mom,  What.  The.  Hell.   I was kind of excited to come here. For what feels like the first time ever, a majority of Yelp reviews mislead me... Or was it an early April fools? I don't know why everyone is giving this place 4 or 5 stars. In my book, to receive 3+ stars you should at least learn to do some--NO, ALL of the following:  1. Learn how to make a proper Old Fashioned cocktail. Not one that is clearly 90% club soda and sugar. It's not hard to please alcoholics!  2. Don't charge $15+ for \"French food\" that is way over-salted. Was that lamb cheek polenta you served me or an actual salt lick?  3. I don't know if you're just trying to be assholes on purpose, but who serves hot dogs and doesn't provide ketchup? The guy working in the kitchen said, \"Oh, we don't even have ketchup in the building...\" and then maliciously rubbed his hands together and laughed in my face.   Disclaimer: Ok he didn't, but he might as well have. Actually, the guy was kind of nice and felt bad (maybe embarrassed) they didn't carry simple every day condiments.  4. Putting a hot dog in a french baguette and charging $7 felt like being robbed. Good thing we already felt robbed earlier when paying for watered down drinks so we were already familiar...  5. Don't open a bar with food and not hire a single soul to bus tables. Sitting next to 10 empty glasses and a plate of leftover salt lick isn't really the ambiance I was expecting.  1 star for the jukebox. Which had Hall and Oates. AKA a bar staple.", 
    "review_date": "2012-01-17"
  }, 
  "fh5C2dLPt0m6AITsZnkVyA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Margarita M.", 
    "review_text": "Hipsters to my left, my right, front, and back. It was fun. I think they are also cash only? (not to sure about this). But i do remember the huge tables, huge awesome jukebox, foosball and photobooth. All the things you need for a night out.", 
    "review_date": "2013-02-26"
  }, 
  "i0C4bhHjTVaAMKvz6G7fOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole O.", 
    "review_text": "Still need to eat here, but the drinks, games and juke box will bring me back. The bar was a bit crowded but I didn't have any trouble getting a drink on an especially packed night.", 
    "review_date": "2012-04-25"
  }, 
  "9WzUerODzyYUkQO0u3Nyjg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy S.", 
    "review_text": "Chill bar, good music.  Food on the menu sounds interesting, almost like something off of a food truck.  Too bad we've already had food prior to this, but I would want to try next time.    Very spacious, and good for a group of friends.  $5 for beers on tap.  The only bad part - cash only.", 
    "review_date": "2012-11-28"
  }, 
  "sMfAazU842DN6NNTC7PUuQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Anna P.", 
    "review_text": "Great bar with a unique food selection. I've heard they occasionally host a pop-up restaurant here or there, but never been on one of those nights. Lots of seating. Large wooden table that you can take over with a big group.", 
    "review_date": "2012-12-19"
  }, 
  "7tr0p8KS1pb8qtfZAdqh-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J. T.", 
    "review_text": "I love this bar!  Cash ONLY folks so make sure you bring it!  Lot's of space and nice bartenders.  It definitely fills up on Friday and Saturday nights.", 
    "review_date": "2012-11-01"
  }, 
  "4t3t5fE3umHifiMq77knNA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cheyanne C.", 
    "review_text": "Very nice place, but ruined by one solitary employee.      I went here for my first time last night, and enjoyed the guest food they were serving (which is a FANTASTIC idea) as well as the above average selection of beers they had. I was still on my first beverage (a phenomenal Peach Cider from Dogfish Head Brewery) when 1145 rolled around and a bartender shouted that we had ten minutes to all get out. My group, which consisted of 5 people, were all surprised at this, but took note of it nonetheless. Most of us, including myself, are servers and completely understand what it's like to want the last few people out when you're trying to close up. There were only a couple other people at the bar, so we were concentrating on finishing our beverages.     A couple of minutes later, a young woman came up to the table to take what she could, and specifically told me that \"I need that, too\", referring to my 2/3 full pint. I said \"ok, not yet though\"...which seemed rather obvious to me. I proceeded to drink it as fast as I could without feeling a little ill, and a few minutes later she came back to the table and took everyone else's cans, then stared at me. Acknowledging her impatience, I said \"I'm guzzling as fast as I can.\" and took another drink. She stood right next to where I was sitting and insisted \"No, I really need it now.\" I then said to her that we heard them say we had ten minutes before we had to leave (which, may I add, is pretty short notice), to which she replied \"Yes, and that was 8 minutes ago.\"  \"O.K.\", I said, \"let me just drink this, then.\"     At that point, as if her aggressive presence and proximity to my person weren't enough, she said \"Oh my God, I am NOT having this conversation with you!\" and kept staring with her hand lingering as close as possible to my glass. I merely said to her \"Then don't. Let me drink my drink.\" I took one more drink before she actually grabbed it out of my hand and stormed away. I didn't resist her, because I was too busy wondering how in the world someone thinks it's ok to treat a guest like that at an establishment. In my many years in the service industry, as well as many years frequenting bars, I've never experienced such rude and awkward behavior from an employee.     I had been planning to go back to this bar because I enjoyed the atmosphere as well as its selection. Unfortunately though, I can't overlook such mistreatment, and will take my business elsewhere.      I can't say I don't recommend this place, but when you go, try to avoid a twenty-something-ish African American girl with shoulder length curly hair. Especially if you are one who enjoys tasting your beverages while you drink them, or being treated with respect.", 
    "review_date": "2012-10-23"
  }, 
  "SUT-5m76n0LZxnp_AL7biQ": {
    "user_rating": 1.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Michael U.", 
    "review_text": "Came here this past weekend for a friend's bday celebration. Reservations were made so that our party would have the back room, but apparently it was double booked so we had to share the room that we already knew typically gets hot. Food was decent, but nothing to write home about.   The worst part was the service of the bartender (blonde woman). She had a bad attitude, sarcastic and was rude. She then complained about a bad tip from my friend when I ordered and that just made it worse. We are usually very generous when we tip, but not when the service is this bad.  With so many other places in SF that give great service, do yourself a favor and skip this place.", 
    "review_date": "2014-07-28"
  }, 
  "cnUg80v3CcNki6n-rQrWmw": {
    "user_rating": 3.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Jenn D.", 
    "review_text": "Dear Mom came recommended from a few friends, but it's just not my taste. It was excruciatingly hipster. There are so many dive bars with real people and cheap drinks in the mission. It's like people come here to avoid realness. Or maybe for the food - the food did look good.  There's lots of space, booths, communal tables, and games (it's just like your start up office!).   The music was loud as hell, which made it hard to have a conversation. The night I went in everyone was playing 90s hip hop on the jukebox - cool, but I don't want to watch SF hipsters who think they can dance. That's not your jam, clearly.  The drinks aren't cheap either - $20 for a cocktail and a beer. And cash only.  Three stars because really, it's not a bad place, it's just...meh and annoying to me.", 
    "review_date": "2014-01-20"
  }, 
  "-iiuT7X9wG37wGTxcsnklQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine L.", 
    "review_text": "I actually don't enjoy going to bars because a) I think alcohol is bitter and b) I'm not too enthused about being in crowded areas with drunk people. However, I came here with a large group of people and was happy that we were able to sit in their back room which was large enough to hold 20 people comfortably. It felt more like a lounge than a club. When we left and had to walk through the more crowded area was annoying though with sweaty people trying to flirt.  The drawbacks of this place would have to be thee bathroom. The women's restroom is pretty awkward. The toilets are separated by (for lack of better terms) shower curtain-esque cloth. Fortunately there is a main door to the bathroom so if you're fearful of someone opening the curtain while you're doing your business you can lock the REAL door. Another disturbing part of the bathroom are the photos of people tacked to the wall. I feel like I'm walking into a scary movie. The pictures on the wall, dim lights and awkward shower curtained toilets were enough to give me the creeps.  The other drawback was the menu. Granted, it did say slider on the menu (note the singular form here) but honestly, when I think of bar food I would have expected sliderS! My friend and I paid $9 thinking we could share, but we ended up getting a slider and a small salad. Granted, the slider was tasty, but for $9 it was a bit of a rip off.", 
    "review_date": "2012-04-25"
  }, 
  "cCPjASKs5YpMB4BmN2oSZg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike H.", 
    "review_text": "Good recommendation for tall beers and big burgers. Dear Mom offers plenty of room for both. Despite all of the burger \"research,\" I go there to drink. Once you get service, the alcohol will be strong, and cheap if you get one of their specials.   I ate two burgers there: the Angus and the chorizo. The Angus was good though the chorizo was a bit better. The latter is more moist, aided by a fried egg. Each burger comes with huge potato chunks, like Epic, not regular fries. You can fill up these if you aren't careful.   Day or night, and by day I mean after the SF Marathon, the music will be a good mix of your old favorites. Sometimes you'll pick up a theme, sometimes you'll just want to dance in your seat a bit.   Mixed diet crowds will like the menu because vegetarian dishes make up a good percentage of the menu.  The guys on the grill are nice and work their tails off. The other folks there are definitely nice but not fast. More slow service means drinks and food won't arrive as quickly as they should though, regardless of bar or table seating.", 
    "review_date": "2013-09-01"
  }, 
  "2Qfa3o72sq04_MCUxy3Shg": {
    "user_rating": 5.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Emily D.", 
    "review_text": "OH. OHHHH BOY.  This bar is RAD.   Goddamn it I love the (former) Thieves crew. So much.   Get the raspberry Liefmans. Thank me (actually thank the bartender who gave it to my roommate who gave it to me) later.  Kinda creeped by the bathroom situation. But the music ROCKS.  Did I mention its HUGE? (No probably not cus I was too busy sippin raspberry beer and dancing in my booth to the awesome music.) BUT IT IS. Bring all your friends. Take 5 dollar shots with a PBR and sing your night away!", 
    "review_date": "2011-12-08"
  }, 
  "6qRwXIHd30vwBijjOVFVeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda V.", 
    "review_text": "Came here randomly with a few friends recently, mostly because it was the closest bar to us and we were trying to escape a storm. None of us had been here before, and weren't aware that it was cash-only. To top it off, the ATM was broken. We pooled together our cash, and came up with a measly $5. I sheepishly went up to the bartender and asked what we could get for that much. Taking pity (perhaps it was the helpless wet dog chic look...), he offered to make the cocktail I was originally intending to order. He asked how many of us were splitting it, and I said three. Not only did he make the cocktail...he made two additional ones, all for $5! We couldn't even tip him, so I felt really bad, but his level of service was definitely appreciated by all of us. We will be going back for sure (with cash money), and will pay a fatty tip next time!  Other than awesome bartenders, the music was great and it was a really chill place, and easy to talk amongst our small (and poor) group.", 
    "review_date": "2012-12-10"
  }, 
  "E6cw3Hd-xB05ghEr3_0zRw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kent M.", 
    "review_text": "It's big.  It's open.  It's fun.  It's festive.  It's everything you'd want in a bar if you're not a pretentious jerk.", 
    "review_date": "2014-01-27"
  }, 
  "rnLazkgHW1cUqu240A2XmQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alicia W.", 
    "review_text": "Picked Dear Mom as the place to go for celebrating my birthday with friends.  We knew ahead of time the bathroom situation may be a bit of an adventure - and on that front, happy to say the strange partitions have been replaced with shower curtains.  Yes - still a bit odd, but for the most part, offer reasonable privacy.  On to the drinks... The \"special\" cocktails were unfortunately terrible.  I ordered an old fashioned and was surprised to get a glass filled to the brim with ice and soda water (oh, and some whiskey and an orange peel).  Maybe they need a review on the definition of a \"splash\" of water?  Needless to say - don't put the drink on your \"specials\" board if you don't know how to make a proper old fashioned.  My friend also ordered a drink from the \"specials\" - no bueno.    Good news is that it seems if you stick with something simple (gin and soda... whiskey and ginger...) you'll be far more pleased.  And the beer and wine is quite reasonble (after the old fashioned fiasco - I stuck with wine).  The food = meh.  Wasn't amazing and wasn't cheap.  Kudos to not just having fries, but if you're going to charge $10 for a small side of \"4 Cheese Farfalle\" (aka mac &amp; cheese) - please just add a bit more flavor... maybe throw in some gruyere or even some herbs.  The best part about the places is really just the space.  It's big - it's open - it has a great feel!  Best to go, grab an beer or wine - and pick a song on the jukebox.", 
    "review_date": "2012-01-20"
  }, 
  "REGjppkq2IkDLRQVmRj_Bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin J.", 
    "review_text": "Dearm mom,  Oh how I've missed you!  This place is a welcomed addition to the edge of the Mission.  With a pool table, digital jukebox, private \"dining\" room in the back and a bar that's always hopping, Dear Mom is sure to keep the party going.  The food menu looks delicious and what more could you want from a drunken night/day of debauchery? Imagine if you will Zeitgeist having a bit more refinement without being stuffy or unassuming of anyone who enters.  The crowd is mixed for sure with hooligans and professionals alike.  Grab a beer or some hard liquor and make the night memorable.", 
    "review_date": "2012-04-23"
  }, 
  "y_jl-bErj1mnb4KF04F74Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "We went because the burger was on a 'top SF burger' list. Our group was disappointed: dry, no additional topping options (such as cheese, bacon, onions). The bun was good, but it stops there. Tator tots served with it - boring.  The bartender service was friendly and good.   The music was cranked up really loud about 30 minutes into our stay.", 
    "review_date": "2014-09-08"
  }, 
  "Bd8V3uFgfhY28pqR0WQy7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin D.", 
    "review_text": "I moved to San Francisco about a year and a half ago.  As an avid and good eater one of the first new dining experiences one has to embrace upon moving to this food utopia, is that of the food truck.    I experienced for a good part of the first six months of my time here with various food trucks and the madhouse that is Off the Grid.  But it wasn't until I found Fogcutter that I found my favorite.    Fogcutter was, in my opinion, the BEST food truck San Francisco had to offer.   They served up a Californian spin on Mexican fusion of delicious tortas.  The best thing to boot, was that Fogcuter would be conveniently parked outside my favorite Mission coffee hole on Saturday or Sunday mornings, meaning I always had a convenient and tasty brunch option.  Nowadays, Fogcutter has a permanent home as the resident restaurant inside Dear Mom.  I've been twice since their move and while the menu is different, it is still AMAZING.  The hamburger I had last night was honestly one of the best freakin burgers I've ever had.  It had all the fixins complete with America's new burger sensation the fried egg...LOVE IT.  The time before I had the fried chicken bao, a great and flavorful chinese style bun with fried chicken and cabbage.    This place is the bomb, and you should all go.  As it now has a permanent home, I'll be there all the time!", 
    "review_date": "2012-08-22"
  }, 
  "QufLijljxuxJquyFg4DOgA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian T.", 
    "review_text": "Pretty bad experience.  A friend of mine made a reservation a week in advance for his birthday (in person, no less), for ~25 people, was told he'd have the back room, and was also told he'd get a phone call to confirm.  No phone call, and repeated calls to the bar over the next week resulted only in an answering machine (which they apparently don't listen to).  We arrive at the appointed time, and... what do you know, they've \"lost\" the reservation, and grudgingly give us a small, crappy table crammed in a corner with only two chairs, after which they proceed to completely ignore us.  We lucked into a booth when another party left (a good half hour later), and once a critical mass of our group had arrived, we left en masse.  Aside from that, drinks were poorly mixed: two friends had a terrible Old Fashioned and an abhorrent Manhattan, respectively, and somehow the bartender even managed to make my gin and tonic taste... weird.  Didn't bother to try the food.  Not much to recommend here.", 
    "review_date": "2012-07-17"
  }, 
  "tV27p1gguxWbWQfH_VjzNQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Savier M.", 
    "review_text": "I could easily rate this place 5 stars. The Jameson and PBR $7 special was right on the money. The atmosphere was definitely trashy enough, only lacking a slight touch of class. It's definitely a place to get wasted, which warrants a few stars on my yelp page.  The negatives include a busted ATM and chasing down the bartenders for my drink. I am not accustomed to either and both would've had me heading for the door if I wasn't there for a special occasion.", 
    "review_date": "2012-01-01"
  }, 
  "rcmCREatKyxozZXQsEv1YA": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Kelly M.", 
    "review_text": "2.5 stars.  Although the food looked good, the drinks were not.  Also, the waitstaff and bartenders were rude throughout the night (kicking us out of a table because they didn't understand that we were the ones who had reserved them and then not apologizing when corrected, bartenders refusing to give us water when the single pitcher in the corner was empty, etc.)", 
    "review_date": "2013-12-15"
  }, 
  "IPYIi9LH0zddqKEscbDjYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly K.", 
    "review_text": "Loved the anthony yang brunch popup. We tried the rice porridge with pork, spinach creme, poached egg  and and kimchee. Great breakfast food. Also the beef fat toasted bagel, not really toasted far as i could tell. Anyway, the smoked sturgeon cream cheese was fab, not very cheesy, and very thinly sliced cucumber and charred scallion atop.yummy! Also enjoyed the slow scrambled eggs with fried oysters, three, spinach and lardons.  We def needed three items to fill the two of us. Only real knock was the bar. One bartender can't fill orders for 25-50 people, at least this one. Tried to order but wasted my time. Food came and i gave up. . Prices were $9-12/per item for the food. Dark and hipster inside, I'd like to see what anthony yang would do with his own restaurant.", 
    "review_date": "2013-07-28"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Cool bar with a weekly pop up.", 
    "review_date": "2013-03-31"
  }, 
  "2XgvN35TRQdFsYV0njVM6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cliff S.", 
    "review_text": "Still a great place to get a drink, drinks are still pretty darn affordable.... I love that they take card now so more of my money goes down the drain.  But what the hell happened to the damn food menu?  It's full of a bunch of healthy crap?  What happened to the tater tots or the tacos?? And what happened to the burger?? a slice of lettuce as extra?  Don't get me wrong the patty is still good, but no bacon? No tomatos? pickles? onions?  As for food, this place has taken a big dip, maybe its because to satisfy all the lame hipsters that go here?  change your food menu back to something that taste better... after a days work, I ain't trying to go to a bar and eat wood chips and kale.", 
    "review_date": "2015-01-12"
  }, 
  "4odC28scHx_y9URM0_1wyw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dizzy L.", 
    "review_text": "HU-MUNG-GO!   Really great space and things that they've filled it with - the giant wooden table at the front and all the booths and the table at the back.    I like the horseshoe bar seating.    I like the variety of beers they have.    They have good snacky food - and I feared that they might not have anything veegs but they do!  Way better than the creepy places that have been at this location in the past - meaning NOT CREEPY at all - super great!  One thing I think they should do is add more bartenders on the bar.   It's a really big bar and having just one person doing it all is too much crazy for that one person and too much waiting for me.   I think of places like Thee Parkside that has a fairly small seated bar and will put 2/3 on to work it and they sell drinks non-stop. I think if they added more people on the bar people would buy more drinks and they would make more cash for the place and more tips for themselves and I would think I had died and gone to bar heaven!", 
    "review_date": "2012-09-28"
  }, 
  "e6QRXwwzhebaLVX0JEztpg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg B.", 
    "review_text": "Overall no strong feelings about Dear Mom - except that my friends and I had a lot of fun with the photo booth in the corner.  Although, being the practical one, I couldn't quite figure out why we paid like $30 for low-quality B&amp;W photos when I had my digital camera right there... but, the girls loved it, and happy girls means happy Greg.", 
    "review_date": "2013-01-13"
  }, 
  "8nqcdY9b-zolA3DgfeHSxw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dick S.", 
    "review_text": "I have to say, I was disappointed by Dear Mom, because at first glance there is so much potential.  The bar is large, generally has a good divey or local feel, but it was so crowded and impossible to walk that it was hard to enjoy.  The ping pong was a nice touch, but the general inability to maneuver made it feel more like a club than a bar.", 
    "review_date": "2013-10-29"
  }, 
  "Obc-VP99cOlLa0Z0tG_BPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna L.", 
    "review_text": "5 stars for bomb service!  Hosted a small, work-related happy hour here last week, and the folks at Dear Mom could not have been more helpful.  I called to see if they could give us a deal on drinks.  When you call about an event, what happens is this:  -You leave a message on their answering machine. -The manager calls you back in about 10 minutes and offers your group a sweet drink special. -You can communicate with the manager via text from then on.  Why isn't it this easy everywhere?  When we got to the bar, the bartender (I'm bad with names, but going to go with Robert?) was awesome and set up tables for us in the back room, even though I hadn't reserved the space.  He came by mid-way through the evening to make sure everything was ok, and didn't seem to care that we weren't spending a ton of money.  (We all work for non-profits ;)  The man also makes a mean hot toddy.  Probably helped that it was a Tuesday night, but nonetheless: Dear Mom comes HIGHLY recommended, as a casual, after-work happy hour spot.", 
    "review_date": "2012-12-18"
  }, 
  "_tHjjf_pvM7i0QALYsKxdQ": {
    "user_rating": 5.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Lauren P.", 
    "review_text": "I love Dear Mom. I go out a lot with a big group of friends, and Dear Mom is one of the only bars that can hold us all!  They have a great PB&amp;J special, $7 for a tall PBR and a shot of Jameson. They also have really good bloody marys here.   The food is great, the baguette hot dogs and the soup are my favorite.   I dig the jukebox and the photobooth! We hit it up every time we stop by.", 
    "review_date": "2012-03-02"
  }, 
  "ZLVaLX6E4olh6h5o6ihjLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex W.", 
    "review_text": "I'm going to review Dear Mom from a single person's perspective and then my own.  Single perspective: the drinks are stiff and the clientele is attractive. SOLD!  Me: it's too loud to carry on a real conversation, sometimes the bartenders can't keep up with orders (not their fault), the bathrooms are clean, the beer list could be better BUT you can always find parking within a block. SOLD!", 
    "review_date": "2014-09-29"
  }, 
  "xNIFzp7I9v6XEkIgjvavEA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zac w.", 
    "review_text": "As a bar, this place is pretty cool. There's a pool table, booths, lots of open space, and decent beer selection. But I would NOT recommend eating here. The food is very lackluster for the price and you'd be lucky to find a place to sit down and actually be able to have a conversation with the people you're with.", 
    "review_date": "2011-12-11"
  }, 
  "vjWMqGJ9bJpUQ_1t44IuTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam K.", 
    "review_text": "Dear Mom,  You know how we have that never-ending quest for that perfect bar with great food? This place isn't quite it, but it's damn close.  It used to be this really run-down dive bar but they've gutted the place and now it's nice and comfortable. Big and spacious, plenty of seating (even a huge table with benches on all four sides if you've got 12 or so with you), natural wood everywhere...  Decent beer selection, and the bar looked pretty stocked. Custom cocktail menu, changed frequently.  And oh, the food. Papas fritas with cotija cheese/tapatio aioli/cilantro, deviled eggs with salmon roe and togarashi, pork belly bao with bean sprouts and peanuts... they change it frequently and it's all good.  In short, Mom, we'll be coming here next time you visit.  Love, Sam", 
    "review_date": "2012-09-27"
  }, 
  "rbg0gOdbEZwmLW1H9mWBGg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Milki M.", 
    "review_text": "I am honestly surprised that the food here is really really good. I ordered 'The Burger' and wow, that was a good burger. Large patty cooked just right with a good selection of toppings with a side of awesome fried potato wedges. One bite and I was sold. The burger was juicy and deliciousness.  My friends also ordered the Fried Chicken Bao's. Also an excellent choice full of flavour and crunch.  It got pretty crowded and it was hard to find a table for our large group. It felt like a bar/club/lounge/diner. We had a great time. Definitely order food when you get here!", 
    "review_date": "2014-03-01"
  }, 
  "W9RU376D6Ny0GzFKtc7uNQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Christine C.", 
    "review_text": "Tall cans of PBR everywhere. Been here a couple times, but this past time, I came for Pop Up (where chefs come and cook their specialties). Cool venue that hosts cool events (like Pop Up and Berlin style ping pong). They also have a fooseball table.", 
    "review_date": "2013-01-22"
  }, 
  "5jLkKtE4HPlrbjw-0w9lvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon T.", 
    "review_text": "A cool bar with a good beer selection, but the Hella Vegan Eats brunch, lunch, and dinner pop-ups are really where it's at. Dear Mom's has other food pop-ups too, but how can you say no to a donut burger and a pint?", 
    "review_date": "2013-10-03"
  }, 
  "XHuNSjrPA3Vyi7n4iVhZaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "I'm much too old for this shit.   Brunch was not good, drinks were just okay, crowd was cliqueish and strange, and cash only? You can't get yourself a square account?   That being said, there's not much else out here. Maybe I'd stop in for a shot under duress.", 
    "review_date": "2012-04-28"
  }, 
  "CQ8OSQFPCCoo0ujxEyEVRA": {
    "user_rating": 3.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Raina B.", 
    "review_text": "I had been meaning to check out Dear Mom for quite some time and finally made it last Saturday. The style and decor is simplistic and perfect for the hipster crowds of the mission. I love the communal tables as they are great for large groups. While it's nice to actually have a place in the Mission that will accomodate a big party, I think the size of dear mom takes away from the bar. Everyone is largely engaged with their own groups and physically quite far from others despite it being a busy weekend.   I was a little disappointed by the cocktails. I suppose I was expecting speakeasy style craft cocktails so maybe I was wrong for going in with that expectation. On the other hand, they did have a decent beer selection.  To be fair, I'll probably return to Dear Mom when I want some one-on-one time with a friend over a drink but may opt for other bars with a little more personality for later in the night.", 
    "review_date": "2013-01-15"
  }, 
  "Oyi2vE1-zrCT4IUbXMuzQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Savannah S.", 
    "review_text": "The bartenders here are really hot and really nice. One of the tall hot brunette bartenders even gave me Lisa Frank stickers.", 
    "review_date": "2012-08-20"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Smart lady.  Perhaps it was a special. Or perhaps Dear Mom is super special for offering vodka tonics for only $5 on a Saturday night.   For all the reasons in first two reviews they get four star stars. For this reason in my third review Mom gets a fifth.  Smart choice.", 
    "review_date": "2014-12-21"
  }, 
  "ZDnwnGRhpflkAqwehZADZQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack K.", 
    "review_text": "Ok, this place has a good space but they have the worst service ever. Most asshole bartenders there are! They have really good potatoes with super good sauce. Definitely say wassup with those! I also recommend the Pilsner Bulleit combo. It's where the money's at! Seriously though, I've had a bartender that has refused to serve me, and several that have yelled at me for minor stuff. Some of them are cool, but the majority that I've dealed with are way too high strung. Super hard to find a table if you are coming with a crew, too. Don't count on being able to hang out with a crowd larger than four.", 
    "review_date": "2013-09-14"
  }, 
  "rbqHGnbuoz5HgPpUAIXL8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rachel g.", 
    "review_text": "super cool", 
    "review_date": "2014-01-03"
  }, 
  "AetbB5SON94n7Yy-dZiZOQ": {
    "user_rating": 4.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Rachael M.", 
    "review_text": "I like straight forward establishments like this. \"This is what we have and do. Like it or don't\" is in the air. Grab a beer and have a seat.   They have a large and worldly beer selection and the staff is knowledgeable.   However, according to the internet they have a large Connect 4 game (nerd alert!) They do not any longer I'm sad to report.", 
    "review_date": "2014-10-05"
  }, 
  "p1BSvgmuGZuDg3xPnzwUww": {
    "user_rating": 4.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Jeff H.", 
    "review_text": "Nice place... Friendly bartenders and some unexpectedly good French influenced food.", 
    "review_date": "2012-06-19"
  }, 
  "0Ky6edFOAOCkKpKVX7u8GQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian M.", 
    "review_text": "Dear Mom is love.", 
    "review_date": "2012-05-27"
  }, 
  "XFFCSts3EYKwSZdHZQ4wew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine R.", 
    "review_text": "After years of only reading other yelp reviews, I signed up for an account today simply because I loved Dear Mom so so much! Went last night and was overwhelmed by the friendliness of Oliver and his staff. This will certainly be a regular spot for me. Can't wait to get back soon and sip delicious drinks in a fun atmosphere while visiting with Oliver. He's so great!", 
    "review_date": "2011-12-14"
  }, 
  "YFZLBlnojAFjdii1ufdNXA": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Ash T.", 
    "review_text": "this place was surprising.  kind of in the middle of nowhere, but at least there is plenty of parking around.  it took me a few to get oriented, as there is no drink menu save the beer list on a chalkboard near the ceiling that i could barely read.  i wasn't feeling like beer, and i don't like trying to invent my own cocktails.  so i just asked the bartender to make something involving bourbon.  whatever she made was amazing.   she explained to me what it was: bourbon, lime, and honey, i believe.  there may have been some other ingredients, but that captures the essence of it.  One of the best cocktails i've ever had.  Plus she was generous with the alcohol.  After drinking half of it, I was seriously buzzing.  But still I went back for another.  The also serve some small plates.  We got mac n' cheese, the baked hot dog and shrimp and grits.  All of it was surprisingly good for a place in the Mission/Potrero nether world.  I definitely think the mac n' cheese was the best.  I generally don't get mac n' cheese at restaurants because it never tastes as exciting as it sounds, but this place got the job done.  Also I found it unpretentious in general.", 
    "review_date": "2012-02-25"
  }, 
  "DUixVL_rtpaMl-PruJEzZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan K.", 
    "review_text": "I was there on their opening night and I hope they do really well.  Great vibe, nice people, flash space (think dark warehouse with iron and muted cements, an irreverent giant game of Connect Four and a ping pong table in the back.  Their food was terrific, and they hadn't gotten their sellers license yet - so had to give all the food and drink away to a thrilled crowd - and here's the clincher - they seemed utterly unpained to do so.  Like someone before me wrote, the Thieves Tavern crew is hard not to love, and so is Dear Mom, their new joint.  It's slightly off the beaten path (though 16th is a huge main drag in SF, and Treat Street, the cross street, is really not that far from the Mission), but that'll keep it from ever getting douchy.  I'll definitely be back.", 
    "review_date": "2011-12-13"
  }, 
  "7At-2aosTzh6pJcQyMrubA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "J P.", 
    "review_text": "Very cold...shut the door already! Like it enough, neighborhood bar, right around my office. Good value, happy hour $4/well, &amp; $5/premium! Food... but limited menu. Shrimp &amp; grits are bland, asparagus is savory, sliders...meh.", 
    "review_date": "2012-05-03"
  }, 
  "oPe4O-S8FmKgjHwbciEH2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James J.", 
    "review_text": "Pros: good food at great prices.  Sriracha burger is tasty but on the spicy side...actually tastes more like a buffalo chicken burger.  Char su bao-like creation is very tasty, but wish it came in a 3 pack vs 2.   Cons: not being a hipster, felt slightly intimidated.  Buck hunter shotgun doesn't reload that well.", 
    "review_date": "2013-05-18"
  }, 
  "TkqX-ROO2Lcujp0iTowP9w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy M.", 
    "review_text": "This place used to be one of my favorite bars. It was a great combo of good beer selection, a full bar, and incredibly tasty pub grub like carnitas tacos and papas fritas. For some reason the menu has changed drastically and gone too upscale for this place. The prices went up and the food quality went wayyy down.  Without that fantastic bar menu, this place is just another middling bar with a decent beer list. Those bars are a dime a dozen in this town. Guess I'll be heading back over to the Sycamore for now...  PLEASE bring back the old menu!", 
    "review_date": "2015-01-12"
  }, 
  "iTfXuRhOQ-SgEVoIuRy-yQ": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Lily S.", 
    "review_text": "This bar felt like some awful purgatory where 30something yuppies go when they're too groomed and wealthy to go to the bars they used to go to but aren't ready to admit that their partying days are over. i don't plan on returning...", 
    "review_date": "2012-07-31"
  }, 
  "yYjPSau4U6eXG2S6Qt6NmQ": {
    "user_rating": 2.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Mark G.", 
    "review_text": "Service SUCKED. 15-25 mins waiting on each drink no good. Each bartender charges differently for the same drink. Black chick w/ snake pants seemed to charge more. 3 shots of Jameson is 18. She charged 21. A can of PBR is $3. She charged $4. Asked why N she said cause its 8. Got there at 11. What really bothered me is I gave her $5 bill for the $4 PBR and she put my $1 change in the tip bucket. She noticed I was waiting for my change so she took $1 out the register and gave it to me. Stealing.", 
    "review_date": "2013-07-14"
  }, 
  "tGgTIueZy1JNTzQD9rkZLQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "02.02.12 || bookmarked 12.21.11  It's Thursday at 8.  We were a few drinks in from happy hour.  We had this place in mind to meet a bigger group.  I was hungry.  They serve food!  Yay yay!  Potato leek soup + asparagus salad to the rescue.  $12.  Cash only.  ATM to the left of the entrance next to the neon colored jukebox.  Foosball table eats quarters.  Did not spit out balls.  Boohoo.  Drank beer that I couldn't pronounce.  Wish I could remember more.  Left three hours later.  Where did all our cash go?", 
    "review_date": "2012-02-03"
  }, 
  "dVpYTO1J8ipOCgVAzU5-lA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Philippe M.", 
    "review_text": "I love this bar, lot of place, and good american food.", 
    "review_date": "2013-06-16"
  }, 
  "vD65y5E3Az3bFc6UW4G1eA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie G.", 
    "review_text": "Nice spot, but the cash only thing always does irk me.  We came here after starting the day at Zeitgeist, and this spot has quite the impressive bar menu.  We had a sampling of food, which was good, and if in the area again, I would snack here.  - Pork Belly Bao: A little asian goodness with some slaw. Definitely an upgrade from the $.80 one in Chinatown. But I get it, the $9 version is much fancier. - Papas Fritas: Fancy pants fries with cheese. Yum. - Tacos Camones: Fresh, light, and pretty good.  All in all, this place is good.  While the cash factor is bummer, its a good spot for a quick bite. Its knocked down to three stars only bc of the cash only deal.", 
    "review_date": "2013-06-04"
  }, 
  "AJYM2G-iFT6oDVwAbRYhGg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "Dear Mom did its job, and did it well. Can I see us getting close and perhaps having impromptu rendezvous? Naa, but a cool place on a Friday night none the less. The bar was pretty full yet the bartenders were keeping everyone happy!", 
    "review_date": "2013-08-18"
  }, 
  "SJ5nSicfp9DsWk6npyEl4A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen O.", 
    "review_text": "Pros: A *lot* of floorspace so you're not all up in everyone's grill. Also I didn't try the food but it seemed to be a pop-up-y sort of indie fusion thing that warmed my foodie-hipster heart.  Cons: I got really excited when I saw the racks of delectable-looking brown-colored alcohols on the wall and ordered an old fashioned. Sadly, it seems to be a bait-and-switch sort of setup, because what I got was easily the WORST such cocktail I've ever had. It tasted like watery whiskey, bitters, and nothing else. Everyone at my table agreed that it was terrible. I might expect that from an open bar at a cheap wedding, but a hispterriffic bar with more bourbon bottles on the wall than distressed-wood paneling? I expected far more of you.", 
    "review_date": "2012-09-05"
  }, 
  "fHnAHkd0rNscAXlWpy7M9Q": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Paul B.", 
    "review_text": "Hipster Nation Babaaay  Haha that's the first thing that comes to mind. I saw a guy from the Real World here last time I went, so I guess it's popular enough? There's plenty of standing room. There's some game machines / photobooths in the back and seemed to be where everyone wanted to congregate.  Aside from that, I think it's a little too far off the regular Mission for a leisurely stroll. Plan accordingly.", 
    "review_date": "2013-01-22"
  }, 
  "2iHZ1h1rDds2iw-_1iDJlA": {
    "user_rating": 5.0, 
    "user_location": "Allston, MA", 
    "user_name": "Nick C.", 
    "review_text": "Great layout, 4 foot connect-four,  and earnest bartending - you should absolutely bring your friends to this gem in the Mission.   Only 6 weeks old so you can be the first to know about Dear Mom", 
    "review_date": "2012-01-16"
  }, 
  "cDlnwHPRkqITteeqANH2zg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lara G.", 
    "review_text": "I just got done snackin HARD on the burger here. Truth is, this is the third night in a row I have been here. Internet at home is down and I have a lot of work to do in the next week, so I searched for places in the Mission (close to BART) to go to after my day job where I could be comfortable, go late night, grab some food, grab a beer and use free wifi.  Dear Mom ended up to be the place, I am now a super fan.   Hipster? Fine, I can see why, but I don't see that implemented here in the negative sense. I mean everyone and everything under 35 yrs old is pretty much hipster these days in some way or another.  Live in Williamsburg, NY and you will see why hipster became a dirty word.  People at Dear Mom are really friendly. The bartenders helped me find an outlet for my comp and one moved a beer when he saw it close enough to do damage if spilled. Everyone I have encountered have been really warm, nice and helpful.  I have had their papas fritas and the burger.  Holy shit their burger is so good, best I've had in awhile. Pink in the middle, pickles and white sharp cheddar. um...yeah.  Now, five stars is like the perfect score. There is one thing I don't like.  The music is deafening. It is a bar, so I don't expect it to be a quiet cafe, it doesn't need to be quiet at all. I actually think most bars should turn their music down. Everyone shouts over it and I feel like I'm damaging my ears and my voice box at the same time.  Anyhoo, I gave them five anyway because they have saved me and made my long work week really pleasant.   Oh, and I love their layout, it can fit a lot of people. I have so far been able to find a seat away from the crowd each time I come.", 
    "review_date": "2013-08-28"
  }, 
  "6H_dtENKchTvC80Uacepzg": {
    "user_rating": 5.0, 
    "user_location": "Santa Paula, CA", 
    "user_name": "Rochelle S.", 
    "review_text": "I was not able to attend a co-worker's going away, since I live in another city many, many miles away, so I emailed the folks at Dear Mom to coordinate buying a round of drinks for my team. Apparently, they are not set up to accept credit cards, so a very nice gentleman phoned me to let me know that because they thought I was attempting to make a nice gesture, they would COMP a drink to anyone who said my name. Have you ever heard of such a thing?!!! I have not. And we were expecting about 15 people to attend...  I am still floored by their generosity. I'll be brining my business to this business next time I'm in SF. You can count on it.   Dear Mom, thanks for being so thoughtful and considerate!", 
    "review_date": "2013-11-11"
  }, 
  "5qgJTus1l35A6bqW2fFk0w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raina D.", 
    "review_text": "A more up-scale divey bar in the Mission that has a pretty good scene on the weekends.  Nothing too special but decent beer selection and a very casual atmosphere.  Cash only.", 
    "review_date": "2013-01-13"
  }, 
  "tD1a0zdA1UvjBIH7vHKK3w": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Alyssa J.", 
    "review_text": "I'll admit it- I rolled my eyes when my friends wanted to go to the Mission for drinks. I can't take the surly bartenders, the entitled tech geeks, etc. Wound up picking this place since we had a few vegans in the group and they have vegan options on their bar bites menu.   The bartender was really nice and attentive. She also put credits in the jukebox which I love. I was with a group but probably would have sat at the bar if i was not. Also the food was really good! We had lemon-sesame edamame, and papas fritas. My co-workers had the fried chicken bun, and a burger and raved about both.  I would totally come back here, and they're really close to BART.", 
    "review_date": "2014-07-24"
  }, 
  "Plba67hIC8cVnBjz0tpymQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris B.", 
    "review_text": "'a bar with a kitchen, and not the other way around.'", 
    "review_date": "2012-08-29"
  }, 
  "vjKo265gMl01lhqg8fCylA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Boris C.", 
    "review_text": "Don't recall having a fried chicken bao, but it was awesome. As is the kitchen in general. I don't see how you can go wrong. Given the place looks like a giant dive bar, it's easy to miss how good the food is.  Along with great food, there's a great selection of beer and hard stuff. There's even some local distillations available, such as Old Potrero Rye. Nice to try something new and local.", 
    "review_date": "2013-12-14"
  }, 
  "qc2NbphhxhWcwn_J-x-Pqw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phill R.", 
    "review_text": "Dear mom.... (better known as \"dear god don't go here\").  Where shall I start? We came here for the pop up sushi and what was promised to be a good experience. We left feeling like I'd had a meal at the Hilton Guantanamo bay.  The pop up sushi was good. But the bar girl (dark hair and wearing blue tonight) clearly was trained by Kim Jong Il.  She was rude, obnoxious and offensive. I won't waste words on her and her abysmal and complete outright rude behavior. It's best I forget people can behave like that.  Our second bar tender (the tall guy with beard) was amazing. He was knowledgeable and courteous but due to general Pinochet (aka bitch in blue) we skimped on your tip. I feel bad for this because he was such a great guy.... but by now we'd all had enough.  Add to that the last server (the OTHER dark haired female bartender) asking us to move and then adding \"I didn't want to throw you out your seats\".... Well... Uhm.... Clearly you need to be educated. Asking us to move OFF the bar when there is ample room cannot in ANYWAY be construed as making us vacate our seats. Unless ... Wait.... You are dumb. Clearly you are.  The sushi was good. The bar and staff ..... Sorry... They were abysmal. The staff make you wonder if they were trained by forest gump. Wait... He has manners.", 
    "review_date": "2012-05-08"
  }, 
  "IIurtwGhcPMxHd3VSKmeJw": {
    "user_rating": 5.0, 
    "user_location": "Atwater Village, Los Angeles, CA", 
    "user_name": "Courtney H.", 
    "review_text": "favorite bar in SF", 
    "review_date": "2012-06-03"
  }, 
  "eYFvWSniiwPMrqlF8R9fiQ": {
    "user_rating": 1.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "Leroy A.", 
    "review_text": "I want this place to be good but it's just not. It seems to have everything you'd want, full bar, big space, kitchen, brews on tap but the  crowd is a little weird, cocktails are horrible and the food is even worse. I kept thinking I had just ordered the wrong thing off the menu or ordered from the wrong bartender but nope, it disappoints every time. Whatever you're looking for or hoping dear mom to be it just won't meet your expectations. In a city like sf there are so many better options.", 
    "review_date": "2014-09-20"
  }, 
  "drI9J9xeWephVGlfMC487w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole M.", 
    "review_text": "After months of plotting, I finally made it to Dear Mom. It's kind of an akward location, unless you happen to live in one of the lofts or condos nearby. I don't. But when I finally had a couple of hours to kill before going out with friends, it was time. It was pretty empty when I was there, close to opening, so I got to really observe. It's a terrific spot for a group. They have several very large tables wnd alot ot seatng around the bar. There are also various amusements like a Simpsons pinball machine and a room dedicated to table tennis. They have food, too. The menu is somewhat eclectic, but you can probably find something. I tried the bao, and they were delicious. I just had a beer, so I can't comment on the cocktails. The staff was friendly, if a bit distracted. I liked the vibe enough that I want to go back sometime, hopefully when the place is bustling.", 
    "review_date": "2013-01-17"
  }, 
  "fuwIz5sJlCwG_gSRSbk8IQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel M.", 
    "review_text": "I love this bar. It has a nice dive bar atmosphere, with great contemporary american food. I love the eggs on eggs (deviled). They have a great on tap and bottle/can selection, plus a very full liquor selection. I'm not sure if they have wine, but this isn't the type of place you'd order wine. It can get crowded, but I've defiantly filled out a booth and met some cool people.", 
    "review_date": "2012-09-07"
  }, 
  "ilesK4CRarjiblkxUDL_tQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vickie Z.", 
    "review_text": "I think this place is really awesome! I came here on a date with my husband and had a great time. For a bar, the food was pretty good and the drinks were excellent! I love the vibe and atmosphere of Dear Mom, it's a great place for small and big gatherings!", 
    "review_date": "2013-07-18"
  }, 
  "kOVxC6FyaxQdxkhsztnd7Q": {
    "user_rating": 4.0, 
    "user_location": "La Jolla, CA", 
    "user_name": "Holly C.", 
    "review_text": "Really cool place for the neighborhood. It's got kind of a biker bar feel inside. Every couple of weeks the chefs change and they get a whole new menu. It's a really amazing way for young talented chefs to showcase their cooking. I went this weekend for brunch with a few friends and everything we tried was amazing. I know that they're open late as well and they have a full bar but I can't really comment much on that.  Only complaint I have is that it's cash only but at least there's an ATM inside!", 
    "review_date": "2012-01-16"
  }, 
  "q16FcvZyP5SURJEX8iGcTg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelica C.", 
    "review_text": "This place definitely has a hipster vibe! I came to meet a friend around 5pm on a Monday so it wasn't as crowded.  The place itself looks relatively clean, but the back table we sat at had a horrible smell of vomit.  I don't know how else to describe it.  Plus it was warm outside, so the smell was really gross  I wouldn't come back unless a close friend really, really, really wants to have a drink here.   They don't accept American Express.", 
    "review_date": "2014-05-13"
  }, 
  "ZQ4_ofeB5WT-5F3szISbXA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha W.", 
    "review_text": "So... decent place, but when a member of our party (who none of us knew) argued with the bouncer, all of our drinks were picked up off the table and taken away. When I tried to talk to the bartender about it, she stuck behind her busser and refused to replace/refund/apologize. Not really cool. Not a nice attitude. Not going back.", 
    "review_date": "2013-12-11"
  }, 
  "V3kb9duvevsDAx3WQdvk1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Todd B.", 
    "review_text": "I had been counting the days for this place to open as I'm a big fan of Jay's from the Thieves Tavern days. Cavernous, comfy, and dark, it's a locals-friendly (not gonna use the \"h\" word) dive bar with exceptional food. (the pop-ups vary, but this is for the regular DM menu). She ordered the angus burger w/ white cheddar and we both agreed it alone was worth the trip, I had an awesomely spicy sriracha spicy buffalo chicken sandwich: succulent with a nice even heat. Good selection of beers on tap, really more of a shot-and-a-beer place than a cocktail bar.  Only complaint: we were told dogs were not allowed because of CA health code, which is technically true. But there is -ahem- another famous bar WITH a smiliar kitchen just a short walk away on S. Van Ness that is enthusiatically dog friendly. No one's really enforcing the law and considering the giant size of the space and the proximity to both the pound AND the SPCA it's a real drag that they aren't dog-friendly.", 
    "review_date": "2013-01-26"
  }, 
  "VWLyPIJoyz6mBZ1XKM23qg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea S.", 
    "review_text": "Two words:  Kale Tacos!", 
    "review_date": "2014-06-07"
  }, 
  "JKgZX5ebfgy9CCzkQcpWwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily P.", 
    "review_text": "DEAR MOM is THE BEST! I love the vibe of this joint. the $4 happy hour is perfect and the food is delicious. It is even VEGAN friendly! I really can't say enough about Dear Mom!", 
    "review_date": "2012-10-22"
  }, 
  "v8JQa5Ma-n0WDLeImJN-0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tootie p.", 
    "review_text": "Dear mama,   You are nice and coool. Oliver is a good bartender. I like this place a lot. It is off \"the strip\" oops that is a las Vegas term,but I'm  sure you understand the term. Duh. Good Spot you should COME.", 
    "review_date": "2012-06-18"
  }, 
  "JycHzRPyWcAWeUrt5pPKgQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mr. X.", 
    "review_text": "The food has a good deal of originality and most items are very good. I particularly like the pork belly bao. Service varies depending on who is behind the bar and how crowded it is. Best server I've had: Devon. That guy hustles and still takes the time to make you feel welcome. I wish they'd rotate the taps (or add some more), but they've got some nice options.  It's a very comfortable environment.", 
    "review_date": "2013-02-06"
  }, 
  "Oxtl_KTWQOM_4WYvY7jVMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David G.", 
    "review_text": "I really like this place.  It is definitely not a happening block and the space feels big and a bit cold, but the food is really good - sort of everything you could want in SF/fancy bar food.  Drinks are good and they have lots of good beers on tap.  You can also get in and get served, which I definitely like in a bar.  They are oddly often out of things - like coke - not what I would expect for a bar.  It is also cash only which is a bit annoying when the drinks are $10.  There are not a lot of great places in this neighborhood and this one is good.  Definitely worth checking out.", 
    "review_date": "2014-03-11"
  }, 
  "IfBFgK8ZEIe3h5fBFLEJBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J L.", 
    "review_text": "Dear Mom doesn't quite live up to its original hype. Nothing wrong with it--the space is fairly big and the drinks are fairly cheap. The night I went with a group of friends had good people watching. Location leaves something to be desired--this stretch of 16th is a wasteland and is a bit sketchy late at night. We all expressed amusement at a bar selling sushi. Don't get me wrong--I love sushi--but if you're looking for a food to stave off a hang over, sushi ain't it. All in all, it as an ok night and I\"d go back, but it probably isn't at the top of my list.", 
    "review_date": "2012-07-01"
  }, 
  "JofB0WipvKvTAdY51E7yPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Borden O.", 
    "review_text": "everyone who works here almost always has a smile, open to a good chat when they have the time between all the patrons, and their juke playlist has a range that'll satisfy everyone. between the pool table, huge connect four game, kitchen, and large unity booths, you can't find yourself not entertained unless you're trying.", 
    "review_date": "2012-03-08"
  }, 
  "2o6x7CL7q1OA7FSwLJ8kog": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trevar M.", 
    "review_text": "I really, really wanted to like this space. The neighborhood needed a bar like Dear Mom, but unfortunately the place just didn't deliver where it counts... the drinks. Worst Old Fashioned I've EVER had in my entire life. Pretty sure the barkeep used vermouth instead of Angostura bitters, which made the drink nearly unbearable. Also, he served it to me in a rocks glass, sans the rocks. Word of advice to the owner(s): Hire bartenders that know how to properly mix a cocktail, especially a classic like the Old Fashioned.  Also ordered the French slider. Not sure what made it French, or a slider. Really just a hamburger. Was decent, but nothing to write home to Mom about. Also, listing this place in the French category is a serious stretch.  The layout is cool, but I agree with others that there seems to be a ton of wasted space.  I hate to dish out a negative review, but I want to see the place succeed and sometimes you need tough love to grow.", 
    "review_date": "2011-12-22"
  }, 
  "gji92ao5NAIrb3akKyqTZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "It's cute. Large and open, great for casual gatherings. Wasn't too crowded but it was also Thursday after NYE. Staff are friendly, crowd was fine. I'd definitely go back.", 
    "review_date": "2013-01-08"
  }, 
  "Rv8RlO-39CGTdgx6jVqSmw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate R.", 
    "review_text": "Good food, friendly service, pretty large space, but the internet jukebox douche fest keeps me from ever going here anymore. Seriously, do not go here on a weekend night if you're above 25 years old.", 
    "review_date": "2014-02-19"
  }, 
  "5OhYji5NDiWFp1j8xoNDbg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophia N.", 
    "review_text": "I came here on a Friday night around 10PM for a birthday and it's pretty much a hipster bar.  One star because the whole place smelled like puke the couple of hours I was there (and this place is pretty sizable).  If what I was smelling wasn't puke, it must've been some cheese and chili concoction.  Pretty gross.", 
    "review_date": "2013-10-19"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "More and more friends keep planning birthday parties at Dear Mom. I think it's because it's got a good vibe, a lot of space, stiff &amp; reasonably priced drinks, and some food options. The bar is cash only (they have a high-tech ATM) but here are some of the highlights/prices:  - can of PBR - $3 - greyhound - $6 - Moscow Mule (with good ginger beer!) - $8  Some of the waitresses are friendlier than others (one barely let my friend get two words of a question in) but they make the drinks fairly quickly so I'm typically happy. Some food highlights:  - edamame with lemon and sesame seeds - $4  - papa frites with various spices - $6 I think  - chicken sandwiches, tacos, and more  There's also a photo booth, pinball machine, and Foosball for your entertainment!  Our friend brought in cupcakes for the party and the bar didn't seem to mind. She had reserved the private room which is especially perfect for parties! I'll be back with or without birthday parties to attend...!", 
    "review_date": "2013-01-21"
  }, 
  "X_Ggdxi4F2E4yzSFl9-GEQ": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "C V.", 
    "review_text": "First timers need to try the Papa Fritas which also can be substituted if you get a burger and fires. The lamb burger is also good.  Tons of parking especially if you drive a big truck for work.", 
    "review_date": "2014-08-21"
  }, 
  "6iShvMPfeDS3dq6grbmmbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "On a whim recommendation, I mentioned Dear Mom as a place to eat in the Mission. I knew they had a back room for small parties, and that was it. Parking was easy on Saturday dinner time. The place was rowdy, but not packed, definitely a locals hangout.. so far. They had the typical combos of PBR and a shot (whiskey or bullet - depending on your selection of poison). The order, 1/2 lb burger with side potatoes and an added fried egg. ($12 + 1) My company ordered another burger with an egg and papa style fries (mayo sauce, cheese, and other delights ($12 + 1 + 2), and the last got a fried chicken bao ($9).  There is an ease to this place. They place hits (classics really) of the 90s era - Mandy Moore, TLC, etc., though mostly chosen from a digital juke box - which is telling of the crowd that patrons. Cut the burger in half and RUNNY EGG GOODNESS. That alone made my night. The side potatoes were crispy, slightly on the salty side, but that's easily amended with ketchup or to sponge runny egg residue. Medium rare burger was juicy, and with the egg - got messy. The bun did it's job of not being destroyed. Tried a bite of the fried chicken bao. Thought it was going to be spicy because of the red sauce, but it wasn't. Bao and chicken were fantastic, however I expected a bit more chicken. Seemed like you needed to ration it with your bites. Decent size though.  Recommend as a fun place off the beaten path, and if you want to seem cool to your out-of-town friends.", 
    "review_date": "2014-01-07"
  }, 
  "RaSq7WPbxH7Dm5yfVBAgYw": {
    "user_rating": 2.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Stephanie Y.", 
    "review_text": "They don't do pitchers... LAME! My friends were flying in from out of town and some of my other friends were here, so we met up there. The place wasn't packed, but every seat was taken. I went up to order drinks for us and we just hung around in the area with our beers.  The customers here are snobs though. A couple got up and someone else took their  seats, but because we were standing nearby and my friend had already found a seat before they left, they told my friend it was their seat. I'm sorry, you lost your seat because you went out for a smoke and then demanded someone else to give you a seat back. I thought we were at a bar ....", 
    "review_date": "2012-05-29"
  }, 
  "PMsYObBYWQbBP8KTSPT91A": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Lijia W.", 
    "review_text": "It takes 30 minutes to get a drink. No waitress, no hostess. No one cares to take your order. There is no cocktail that require any garnish such as mint, only the very basic one you get from a club like jack and coke. Beer selection is also minimum. People are not nice and don't seem to give a s* about you. Crowd is like all hipster. You can't pay me to go back there.", 
    "review_date": "2014-07-24"
  }, 
  "LhdIGJbwAgfslLaruuQq3A": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rebecca P.", 
    "review_text": "Tried the food on Saturday night and am upping my review to five stars. Takeaway dish: the macaroni and cheese. It has a parmesan chip on top! It's like the chefs got ahold of my dream journal.   If my own dear mom fed me this well, I might go home more often.", 
    "review_date": "2011-12-13"
  }, 
  "pI15RINDqpXIk5492xx7PA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel R.", 
    "review_text": "Dear Mom,  Thanks for pouring me multiple rum &amp; cokes at $4 a pop. Your sticky floors may make me feel like I'm in college again but your chill bartenders remind me I'm in the real world where service can be legit.  Let's talk soon.  xoxo, Rachel", 
    "review_date": "2012-02-21"
  }, 
  "4wooaHkthPXYPektXIPkBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate M.", 
    "review_text": "Says JD: I am a man that has many buffalo chicken sandwiches, and this is maybe the best I've ever had.   Other things of note: Service is always amazing for me (tho I have heard otherwise from other people (dudes) but this is my review so...)  Many large shared tables so you have to have basic social skills to find a seat.  The pickles are not good (less one star)  The chicken sandwich is the best thing on the menu and is consistently amazing.   Good beer selection.", 
    "review_date": "2014-04-10"
  }, 
  "vptc3noadIRyqS-ZJoaKUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna M.", 
    "review_text": "\"Whoa! Are you sure there isn't a \"1\" in front of that drink price?\"   That's what you'll say when you get your bill at Dear Mom's. Besides the competitive drink prices ($4 for mixed well, $7 beer special) the bar is large, has ample seating and a range of billiards/games.   The service was friendly and prompt. I didn't try the food but late night favs like tator tots and hot dogs are sure to taste deee-licious after a few cheap drinks. The scene is also great for hipster-watching.", 
    "review_date": "2012-02-23"
  }, 
  "EZDA0JnQXTSmUGMeDNaYxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry G.", 
    "review_text": "This bar serves the legendary pickleback: the new york wonder of pickle juice and whisky. Came with some colleagues and had a great time: good music, good-looking food, and great ambiance.", 
    "review_date": "2012-09-02"
  }, 
  "hGO5cbeAemnSyQssQ4VQlg": {
    "user_rating": 5.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Kevin M.", 
    "review_text": "Great spot! Service and atmosphere was second to none. More of a hipster crowd, but I still had a great time both times I was here. Highly recommended!  Can't beat the shot and a beer special for $7.", 
    "review_date": "2012-02-22"
  }, 
  "fMUhrOBWCqy1z-TBAogpxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lani H.", 
    "review_text": "I am so stoked that Dear Mom has finally opened its doors.  This warm, atmospheric bar armed with a delicious menu crafted by chef Laurent Katgely of Chez Spencer electrifies this otherwise quiet portion of 16th St.  My new favorite neighborhood spot has tasty pub fare and a nightly changing main dish.  Their ever-present Tofu Hot Dog served on a baguette toasted to perfection is infused with notes of mustard.  I used to hate mustard, but the Chef has turned me into a believer!  The dish, accompanied by fresh greens and salted fingerling potatoes, was sublime when paired with an Anchor Christmas Ale.  Drinks are always on point here.  Hats off to bartenders Oliver and Jay for their excellent customer service and heavy pours.    Lots of space to mingle with close pals or total strangers so bring friends or make some over a glass of whiskey.  Bonus for the generous bar space and jukebox.  I'll be coming here too often.", 
    "review_date": "2011-12-05"
  }, 
  "bLxJThAh2C7XeGA598xhww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Margaret B.", 
    "review_text": "They just went through a little facelift. Looks way better; a Sienna color throughout the place now and the private room in the back has a lounge feel---lots of cool black and white photos on the walls with 60's pix. It's cool without feeling pretentious....And there's a long 60's sofa (just ok comfort) with small tables and two long tables to accommodated my recent office party. Music was a little loud but they adjusted it and all went well. Highly recommend!", 
    "review_date": "2012-07-13"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Dear Mom,   If you'd spend less time hipster-izing and more time flavoring (your food) I might just like you more.   Because your drinks are cheap and that's all I really ask for.   Semi-turned off,  Janice", 
    "review_date": "2012-03-20"
  }, 
  "Vt4HOP_Bjc1NrmLQ-HdBxA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan R.", 
    "review_text": "Drink list is pretty decent, but good luck getting that drink. Sure, it's friday, but they're understaffed enough that a beer took 20 minutes to order, and the tacos took about 30min to arrive. Bad workflow issues, we won't be back.", 
    "review_date": "2014-08-08"
  }, 
  "Lp4FBC8lVI3cdfM2it3lnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lúcia C.", 
    "review_text": "We just came for drinks on a Saturday might. It was def hopping. Music pumping. Drinks were cheap which was awesome. Atmosphere is very friendly and lots of crazy characters. It was a bit loud and a little crowded but I'd say its nice cuz its a big spot. Didn't try the good but wish we had", 
    "review_date": "2014-01-25"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "Ahhh, nothing like the rarity of an open, space-filled bar in San Francisco.  In the Mission area, nonetheless.  Dear Mom has a few pinball and arcade games, and it rounds out what is a very nice experience in terms of bar hopping.  Great for larger groups.", 
    "review_date": "2012-06-30"
  }, 
  "YG5EroFMYByZODecz3U_kQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany W.", 
    "review_text": "Dear Mom is like the hipster version of a frat bar. Think laid-back, sports-inspired atmosphere, only without the douchey crowd. But whatever the clientele, a frat bar is a frat bar. I prefer a place with dimmer lighting and an emphasis on cocktails, not draft beer and gargantuan shots.  Of course, my review of their cocktails may not be fair because I hadn't brought cash ... yes, Dear Mom is cash only. Boooooooooo.  I'm certainly not opposed to coming back, and perhaps I'll up my rating after sampling more of their drinks and food.", 
    "review_date": "2013-09-17"
  }, 
  "qXpEaTxiOoKtibjZoj9DPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy N.", 
    "review_text": "Chill, cool, spacious bar in the Mission. I went here for brunch on Saturday and it wasn't packed which was nice. The service was spotty though. Our drinks came really fast (love the bartender!) but the food took almost half an hour. But it was delicious and worth it. I ordered the hash which came with two eggs, potatoes, cotija cheese and an amazing aioli. I wish they accepted credit cards!", 
    "review_date": "2013-03-24"
  }, 
  "KKiBmRUU9vzIqtzi-sd7yQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris G.", 
    "review_text": "I really like this place.  The bar has great ambiance, the beer selection was good, and they make quality mixed drinks.  The Manhattan was great!", 
    "review_date": "2012-01-06"
  }, 
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "My opinion:  overpriced asian-fusion gastropub dining.  Portion size is itty-bitty.  I went here with co-workers for a beer and food.  The atmosphere is of a local mid-scale dive bar with beer and booze (saw bottles of my fave whiskey on the shelf).  The service was decent, the food was decent, the atmosphere was dark and there was music from a juke-box playing in the background. The beer prices are pretty great!   The crowd that day were Mission Locals (prob in their 20s) congregating over some alcohol and enjoying the afternoon.  Not a bad place at all if I were in the area and in the mood for some cocktails or a beer.  I just wouldn't go back if I were uber hungry!", 
    "review_date": "2013-06-23"
  }, 
  "-BmxaEcrKfbuNuQifLiG8A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben G.", 
    "review_text": "Such a disappointment.  Was giddy with excitement when I heard a cool bar/food joint was coming to the neighborhood, but everything about this place is wrong. The space is cavernous, but yet there are only five (5) tables, and the bar arrangement is awkward and bottleneck-y. Our first attempt to get some food here on a Saturday night was obviously insane, but gave it a second attempt recently at 9pm on a Tuesday and guess what, it was exactly the same -- because there are FIVE TABLES which YOU WILL NEVER SIT AT.  Moreover the menu is pretty ridiculous, just 3 or 4 items, including a \"french dip slider.\" Also, a hot dog in a hard, crunchy baguette is annoying and gum-shredding, not gourmet.   Moreover the general vibe was just weirdly hostile, like, I sort of felt like I was going to get beat up by hipsters whose territory I had invaded. I don't mean to hipster-bash, but like, people wouldn't move aside as we tried to get through.   Why? Why did this place have to suck?", 
    "review_date": "2012-04-16"
  }, 
  "_Kt01zAkzGDjSphy7W3qOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber K.", 
    "review_text": "The transformation of El Rincoln, a shady Mexican bar, to Dear Mom, a neo hipster haven, is a stunning example of gentrification. But whatever, I'll take it.   The space is much more open than before, the people are more friendly, and it's still stumbling distance from my house.   Just don't go here at hipster o'clock, or you won't be able to move much or order anything.  Hot tip: ask for a pint glass full of mimosa during brunch. It'll cost you double but it's worth triple. Trust!!", 
    "review_date": "2012-02-22"
  }, 
  "-l-TorsR28LHE40duDEGKg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristin P.", 
    "review_text": "I see the potential, but for now, if you're interested in having a meal here, I'd give them a couple of weeks.  I was excited by the idea of a casual bar space with sophisticated food. Hell, if I opened a bar, itd probably be a lot like Dear Mom. So, I'm totally on board with the vibe here, I just think a couple things need to be streamlined.  Ordering at the counter and having the bartenders serve you is a little awkward.  Food sat out for a bit while the bartenders tended to other things (understandably).  And once our plates were delivered I had to get up and get my own silverware on the other side of the room; should have some at the bar to prevent that.  Space at the bar was limited-- we squeezed our way into a corner.  Which made eating the fairly fancy dishes a little awkward. Like, I dunno, I'm not sure I want to eat a whole trout with people hovering over me trying to get a drink.  I don't mind eating a slider at a bar but nothing that requires significant knife/fork action. Didn't love the fishy-flavored grits (lots of shrimp essence), but maybe that's just me.  Liked that there were three salad/veggie options, it's usually hard to get something healthy at a bar, so that's a good direction.  Cool space...too much space maybe; I'd suggest a couple more tables, if y'all are taking suggestions.  For me, it seems like a great place to bring a big group for a drink, or four.  But I think the whole dining concept needs a little more work.  Hope to give it another go once they get in their groove.", 
    "review_date": "2011-12-06"
  }, 
  "HpBvzMzchFrJ6XJmtRIsMg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Callie K.", 
    "review_text": "I love dear mom! my favorite watering hole, here's why:  + cheap, stiff drinks($4) and local brews on tap($5)  + jukebox which takes cards (kinda a plus/minus if you have a tendency to wanna play d.j., today I charged $10 because I couldn't stop, so much to choose from!)  + games, games, &amp; more games   + PHOTO BOOTH  + TONS of seating, lots of room to move around, high ceilings, etc. consistently busy but you can't really tell with all that space!  + laid back &amp; friendly bartenders  + easy street parking- a rarity for a mission bar  + sweet affordable collaborations with local chefs (today I had a $8 breakfast from the fogcutter folks that was one for the books)  + cute details abound like the \"did you write your mom today?\" message scrawled on the outside, barrel tables, even the bathrooms are cute!", 
    "review_date": "2012-04-01"
  }, 
  "V5Th21KjUiYLJQyV-vGtpg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ben H L.", 
    "review_text": "Dear Mom has a solid dive bar vibe.  Before midnight, this place wasn't too crowded or loud.  Although the bar area was packed, the other areas of the room were not that bad.  Of course, after midnight, the place really gets packed and walking to the bathroom really becomes quite the challenge.    This is a perfect place to hit after hitting a fancier bar earlier in the night as they are not fancy micro brewed things but canned beers like Negra Modelo and PBR.  There's a hand written menu for food which looked pretty affordable although for the life of me, how do the staff here find and deliver food in this dark cave-like atmosphere?    I was the DD so I was drinking sodas most of the time here.  I'm hoping to be back here to try the food and a PBR on a weeknight.", 
    "review_date": "2014-01-25"
  }, 
  "pKAP3HaZdehkocyWZ_6UTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa G.", 
    "review_text": "Update: Moms are always so on top of it. ATM is up and working.", 
    "review_date": "2012-02-22"
  }, 
  "tiyVdJpo_1Bnyv9gi7V9LA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G X.", 
    "review_text": "Dear Mom - the lights in your place are way too bright.  I don't get it - you have edison bulbs, the place is cool, but the lights are so bright that it reminds me of a school cafeteria or closing time when bars turn on their lights and it ruins the atmosphere.  Otherwise your place is good.", 
    "review_date": "2014-11-30"
  }, 
  "Gh7a3aAOlB2zMRocFzGEZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mariela D.", 
    "review_text": "Dear Mom is the spot! Shout out to Rebekah T for bringing me here :) It's so unassuming from the outside, you might not even notice it.  They've got a great selection of beers, nice bartenders, a jukebox, pool table, and a great happy hour menu. It's the basic stuff that makes a place great. And the place is huge so there's plenty of space for larger groups.  I got to try their yummy sliders but the rest of their menu looked good too. I was told it changes daily, which gives me yet another reason to come back.  By the time we left at 8, the house was jam PACKED. So get here early if you want to snatch up a coveted seat at the bar.", 
    "review_date": "2012-04-10"
  }, 
  "t_RZY__XZZgbfEmF5SrHGw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chrissy H.", 
    "review_text": "Pretty open bar but SO many people and impossible to get a drink. Nice place to just kick back and relax, but a bit out of the way. I think there are better places in the Mission and in SF as a whole...but not gonna lie, the barrels were pretty sweet. Almost like a primped up frat house", 
    "review_date": "2012-01-01"
  }, 
  "R8PjB3faVGyziWd7llQgkw": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "Mike B.", 
    "review_text": "I've been wanting to check out Dear Mom since day one, and haven't had a chance til today (day 12). Everything I'd heard has been fantastic, so I was preparing myself for an underwhelming experience like when you hear Super 8 is the best movie of the year, and then it's just another monster flick that ripped off Stand By Me.   Anyway, Oliver is the coolest dude ever. He makes a mean Violet Bouregard (try it trust me). And despite what he tells you, he's more than bad jokes and overly inventive drinks.   Ambience: 10 Food: 9 Drinks: 10 Music: 9 Go-there-again-ability: 10+ Go-there-tomorrow-ness: 10+  I see myself here many many many times in the very near future.   Congrats fellas, and game on.", 
    "review_date": "2011-12-14"
  }, 
  "w3grIL6Sbcv1w_ZQAV5MWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marlee F.", 
    "review_text": "Dear Mom,  You had the most incredible bartender working on Christmas eve. You could be stuffier than Zietgiest and smeller than the 16th st Bart station and I would still come.  regards, cancerian", 
    "review_date": "2012-01-03"
  }, 
  "upRh352VwnipRRWsnJP8SA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlin F.", 
    "review_text": "I think this is an excellent bar and eatery. That last two times I've gone there, they've had a different pop up restaurant in the back. The food was excellent and it's a great place for a quick bite before a little mission bar hopping.   It has got a pretty hipster vibe but there is usually a fairly eclectic gathering of people. I also really like the aesthetic design of the interior architecture. The bar is a pretty cool T shape.   Good for groups and good for a quick bite!", 
    "review_date": "2013-06-16"
  }, 
  "mOCM896HwdM4sL961RRNHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric G.", 
    "review_text": "Pretty sure nobody has a better mix of bar food, beer, and spirits. The atmosphere is always friendly and fun. You rarely wait for anything. Oh, they also have pop-up chefs. Usually something amazing and always very local.   Did I mention games, they have games. I love this place.", 
    "review_date": "2012-11-18"
  }, 
  "3ebGuvvDgFEd5wu6GB2fWw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kevin D.", 
    "review_text": "Dear Mom gets annoying. I don't like places that are super packed and have slow service and rude / too-busy bartenders. Also, no, ladies at the bar, I will not buy you a fucking drink.", 
    "review_date": "2012-09-23"
  }, 
  "wZG2xlICfUkJiY1NdPJH2A": {
    "user_rating": 3.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Naomi K.", 
    "review_text": "LOL, my friend told me he's not cool enough to hang out here. No, no, you just aren't hipster enough to like PBR, I'll take a 21 amendment, thanks! The bouncers at the front were cool. The place was packed. The bartenders weren't the friendliest. So rumor had it, the dogs were the hot ticket on the menu. Hipsters dogs were great, but nothing really beats the bacon wrapped dog on the street corner after a night out, right? I guess I had to just check out this mission spot.", 
    "review_date": "2013-01-06"
  }, 
  "rR6WsKV5tmOhF0o-vuOeeQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mari O.", 
    "review_text": "I have a recurring nightmare. I luckily hadn't had to actually live it, until I went to Dear Mom. The nightmare goes something like this: I have to go to the bathroom, but the only available one has no proper door, or lock, or there's people watching me.    I don't even know where to start with the bathroom situation at this bar! As described in other reviews, it is two toilets next to each other, with a see-through screen \"dividing\" them. You are also visible to anyone washing their hands as the sink is right there.   I was excited to check out this new bar, and if it weren't for the bathroom I'd have given it 4 stars. But since it's a bar, and drinking equals peeing, it's one star for botching something so basic. I was with 4 other girls and we and everyone in line were baffled.  The sign on the door didn't help. It's to comply with ADA? Riiiiight, so ALL the other public restrooms I've been in have been breaking the law...  At one point a male staff member needed to get into the closet in the restroom. I told him this wouldn't be a problem if, you know, you had some DOORS. Even the curtain at the Hemlock is way better than this.   One thing girls sometimes have to do in bathrooms is to change a tampon or sanitary whathaveyou. Should we use the men's room for this?  We wanted to stay for longer but had to leave. To find another bar where we could go to the bathroom.", 
    "review_date": "2012-01-18"
  }, 
  "FpOste6Fh4ppO7jol-JlQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacqueline G.", 
    "review_text": "The drinks are good, the crowd is fun. What more can you ask for? In the three times I've been here I've tried their...   Beverages: Gimlet (very tasty and you can't really taste the alcohol, just feel the buzz) and shots of tequila. *Please make note and beware... these shots are XL shots meaning that they seem to be well over your typical 1oz.   Food: Papas Fritas ALL. THE. WAY. This stuff is too good. I've also had the edamame, which last time was just okay. Portions are really big so share away!   Why minus the one star? Because their food is cash only... their drinks too? I'm not sure. Their ATM charges almost $3!", 
    "review_date": "2013-07-29"
  }, 
  "PKUW9VOkdAs-FOFt0KlibA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexia A.", 
    "review_text": "Dear Mom,  How time flies by.  I wanted to come visit you when you first opened. Turns out when I was there with my friend chillaxing, you said you'd been open for close to two years? Tell me the bartender was drunk and my youth is not in play here.  When I think of bars on 16th, I think, closer to Valencia and Mission. This one is a bit more between Mission/Potrero Hill.   It's a bar where you can take your friends, and no matter how many you take, you all fit and can listen to each other. You don't have to walk back to the heart of the Mission to get some food, they make awesome shrimp tacos. They have a huge communal table for all your birthday party needs. It's a huge bar, I tell you.   About 6 beers on draught, full bar, and if you are lucky (like me) you will run into a hot pack of male Finns as you walk right in. Yes!", 
    "review_date": "2013-07-05"
  }, 
  "3N7jujuHSGc2Goe7s9ZB7Q": {
    "user_rating": 4.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Zoe H.", 
    "review_text": "This place is the perfect place to go if you want good beer and good company. Not to mention the food is pretty darn good for bar food.  The layout is very spacious and full of big tables. It's nice and bright in there- so you won't have trouble seeing the whole place or your friends like many bars in SF. The prices are reasonable. It is kind of in a random part of the mission (by condos), but well worth it.   The best part? There is a photo booth for when you get a couple beers in you! And who doesn't like photo booths?!", 
    "review_date": "2013-01-22"
  }, 
  "u9puWE0vMhedUrIFjOQk0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayele A.", 
    "review_text": "Dear Mom, you're always so welcoming and so engaging on those Sundays when all I want to do is pretend that Monday will never come. From the fairly priced drinks to the amazing food pop ups - by the time I leave I don't usually care that I can't escape Monday's impending arrival.", 
    "review_date": "2014-07-16"
  }, 
  "gosNE62t1GQnbdITjC2bBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie S.", 
    "review_text": "Stopped by yesterday afternoon after giving up on the 40 minute wait for beer at the SF FunCheap Speakeasy Brewery event.  A little cranky, hungry, and in need of receiving a beer in a reasonable amount of time...my friends and I decided to go to Dear Mom.  I got a pint of Anchor Steam and Radeberger, along with one of the best plate deals I've had in SF.  Their $6 hot dogs are unbeatable. I was skeptical when my friends placed their orders because $6 for just a hot dog seemed a little steep.  But not only do you get an amazing steamed hot dog in a warm baguette, but you also get a delicious salad and fingerling potatoes with some aioli to dip it in. Talk about stoked.  My cynical attitude went right out the door, and some of my friends were even considering ordering seconds.", 
    "review_date": "2012-04-01"
  }, 
  "O4CcO-vP1jxSReCFeCNIFw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Melissa A.", 
    "review_text": "Food: Amazing. Ambiance: It's a bar.  Bar Games: Abundant. Service: Perfect.   Do it!", 
    "review_date": "2012-03-20"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Came here on Sunday night - the night before President's Day with a couple of friends.  As per usual, I was hesitant about coming to the Mission because of my disdain of alleged hipsters.  As I begrudgingly walked into the bar, I was pleasantly surprised.  Yes, there were hipsters everywhere, but this time around, EVERYONE WAS SO NICE.  Now, my main issue with hipsters is that they tend to - as a huge generalization - give me dirty-ass looks because I over-dress like it's my job.  I wore my faux leather jacket today so I think I fit in more.  Service was fast and friendly.  The first bartender we talked to was really sweet.  He joked around with us and served us pineapple vodkas without judgment.  Since he had extra left over, he just gave us an extra shot on the house.    The second bartender was a bit more judgmental.  Gave us a \"look\" when we asked for Dirty Shirleys and Lemon Drops, so we just asked for IPAs.  I get that this isn't a place to get girly-ass cocktails, but I would like to order sans judgment.  Whatever, he was nice.  We severely over-tipped both of them just because.  I liked the vibes from both of them because they were talking to us like we were old friends.  OHhh there was also a decent selection of beer.  I LOVE that they had Pac Man.  I also saw the giant Connect Four, which = AMAZING.  If it wasn't so far from where I lived, I wouldn't mind coming back.", 
    "review_date": "2012-02-20"
  }, 
  "36Sa9t7qX9ptIUmIk8sJtA": {
    "user_rating": 5.0, 
    "user_location": "Kansas City, MO", 
    "user_name": "Kendall D.", 
    "review_text": "I followed these guys over from the venerable Thieves Tavern.   This is a great space which is large enough to never really full too suffocating. The bartenders are true pros and the service is reliably excellent. The food is great too.", 
    "review_date": "2012-01-13"
  }, 
  "Lu8y2ayxVlAzuJEVfVcH4w": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Rebekah T.", 
    "review_text": "Dear Mom,   Thanks for having good beer on tap. I love bars with good taste in food and drinks and you have quickly become my favorite little Happy Hour bar to start my weekend off at. I often bring friends, because we all enjoy a good beer.   We also like playing songs on your fun jukebox and eating those tasty beef sliders with fingerling potatoes. The bathroom mural to Moms is pretty cute too. I love old family photos.   Casey is one of the nicest bartenders in town with great taste in beer. I've had the Maredsous (Belgian Ale) based on his recommendations. I love the N'ice Chouffe and the Chouffe IPA on draft as well. The Linden Street Red is also a good one they have on draft.   I love how the beers change but they have different Belgians. That's the key to my heart Mom, good times, good food and good beer.   Love, Beks.", 
    "review_date": "2012-04-04"
  }, 
  "vF9C7jqC2uPkBfTiecUeuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kori M.", 
    "review_text": "That have a GIANT-SIZED game of Connect Four!!!   Oh, and a decent selection of booze.   What more do you need?", 
    "review_date": "2012-02-13"
  }, 
  "jB6gZt_YgnsJ6M1VcWXNFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay, CA", 
    "user_name": "Patricia M.", 
    "review_text": "Enjoyed some drinks with my friend and her crew of family and friends last night for her birthday celebration last night. I cannot keep up with my friends and their drinking antics, like EVER-- no matter how much I eat beforehand-- so I needed to split the fried chicken sriracha sandwich and potatoes with a friend, who said he would have been better without the layer of coleslaw. Oh dear lord there's a reason why they give you a knife and a fork.  Pack some wet naps and pass them around to share because that was some messy deliciousness right there.  It gets super crowded so hope you don't mind feeling cozy in hipster nation! Fun times all around.", 
    "review_date": "2014-01-19"
  }, 
  "YFNHieKTAnKxPVbo8Y5peA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deb L.", 
    "review_text": "Come for the great beer. But come back for the Kale Tacos or Sriracha Buffalo Chicken.   This is a solid place to meet a large (7-20) group of people for affordable dinner and drinks. They offer much better options than your standard, heavy, pub food.", 
    "review_date": "2014-10-02"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "Dear Mom,   SF is great. It's so diverse. Kind of expensive to live here but whatevs.  There are tons of great places to grab drinks and tons of great places to eat.   Oh, but probably one of the best places to do BOTH is a \"hipster\" spot called Dear Mom (I'll explain hipster another time). There's an amazing Sriracha buffalo chicken sandwich that changed my life. If you don't believe me then you've got to get out here and try it. The hipsters might be a bit too loud for your liking late at night so maybe we will go for an afternoon beer and grab a bite?   I'm probably going to gain some weight. Oh, my wallet is a lot thinner though. This place is ca$h only.   Love and other indoor sports,   Susy.   P.S. Rum &amp; coke floats for dessert sound good?", 
    "review_date": "2013-12-17"
  }, 
  "Z-4Ow2j7kRPyUMuxsebmvQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Klondike B.", 
    "review_text": "Food is legit. Then you find out it's spun up with connections to Chez Spencer and you get it. Decent selection of beers at ridiculous prices.", 
    "review_date": "2013-01-24"
  }, 
  "qUJmdUBUXEy7_73Ie_CWrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sydney L.", 
    "review_text": "Good place to grab a drink and bounce some quarters off the communal table.  Bao wow!", 
    "review_date": "2013-08-28"
  }, 
  "EYLy8HaGh8SzP9vZbRAFzg": {
    "user_rating": 4.0, 
    "user_location": "Cloud County, KS", 
    "user_name": "Erica H.", 
    "review_text": "Y'all, it's a bar with a kitchen, not vice versa.   Great little joint. Nice folks slangin dranks. Best value for eats in SF outside of taqueria fare - and it won't inflate you with carb-farts like that thigh-sized burrito will. Avoid (OK, OK, or seek out if you must) vegan fare by checking their twitter page for weekly pop-up schedule: <a href=\"/redir?url=https%3A%2F%2Ftwitter.com%2Fdearmomsf&amp;s=7f289e66a366461285a2a9c52f2a717639de9e29eebbbf80a1c69d409137c1a6\" rel=\"nofollow\" target=\"_blank\">twitter.com/dearmomsf</a>  Wish they'd get their pool table back so we'd have an excuse to show up more often.", 
    "review_date": "2012-07-20"
  }, 
  "jB76CTiIEQDGUxnJpWBuvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha H.", 
    "review_text": "Love that it is two blocks from my work! The bartenders are soo friendly and there are a million games/distractions. I felt like a kid in there. Minus one star because you have to semi share the bathroom?? But other than that, good drinks, music, and times! Def. will be back :)", 
    "review_date": "2011-12-27"
  }, 
  "bOHNFwu8qAvWrzENXfihBg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn C.", 
    "review_text": "Came here for lunch on a weekday with a friend.  We got the beef slider (bigger than a slider, really, which was good since it was $9 and came with roasted potatoes and salad) and the three-cheese farfalle. The food was delicious but took a while to come out. I think there was only one person in the kitchen?   There was only one other group of a few people but it took 10 minutes for the bartender to open 2 cans of Coke and pour them for us. He seemed a little stressed out.  They're probably still working out the \"new bar kinks\" so just give them some time and they'll be even better.", 
    "review_date": "2012-01-04"
  }, 
  "Wf4a2oE_GXProo_AAu1TeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica D.", 
    "review_text": "I love, love, love Dear Mom! I've been here multiple times for drinks, but when I was choosing a place to throw my 26th Birthday, I instantly thought of Dear Mom. Even better, they have a back room you can reserve for private parties free of charge! I worked with the owner directly to plan my party and he was exceptionally kind of attentive, even giving me a free gin tasting. The bartender and staff was extraordinarily nice and all of my friends had an amazing time. We ordered finger foods like the papas fritas, edamame, and jalapeno croquettes and the open kitchen allowed my hungrier guests to order full meals. Overall, one of my best birthdays ever and I would love to throw other parties here!", 
    "review_date": "2014-08-04"
  }, 
  "m1jzeTBPmQZ1ojxHUz4scQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lizzy U.", 
    "review_text": "I came here for a friend's birthday a few Fridays ago and was pleasantly surprised. We were with a huge group (30 people) and when we showed up at 6pm it wasn't too crowded. There was a big private room with one person sitting in there so my friend and I walked up and asked if there was anyway we could use the room. Turns out it was the owner and he was SO nice! He let us have the room and bought a birthday beer for our friend.   This was a great place to do a big group dinner becasue you walk up to the bar to order your food and drinks. There was no need to split up the bill at the end and people could come and go as they pleased. I got the chicken bao and it was SO good -- like thinking about it the next day becasue it was so good. I also tried the patatas bravas and the kale tacos, both were delicious as well. Their wine selection was minimal, as in house red or house white but they had lots of good beers on tap and cocktails.  The crowd is to be expected for the Mission, pretty hipsterish. But the staff was all so friendly and accommodating (which honesty can be so hit or miss in the Mission with people thinking they're too cool). I would definitely recommend this if someone is looking for great food in a bar type environment. Definitely a repeat!", 
    "review_date": "2014-07-30"
  }, 
  "zcomZb2vYCcZjpPqFA4Qlg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luba J.", 
    "review_text": "If we had one last day to live, we wanted this to be our last meal.    Me  - Kale Tacos... It doesn't sound very appealing, but they were Absolutely amazing!      My boyfriend - Siracha chicken sandwich.  He ate the whole thing in four bites and he didn't give me a bite... but he almost ate his hand it was so good.  He's still freaking talking about it tonight and we went last night.    Drinks - We only had beers, but the bartenders were awesome, beers were cheap and it was all around awesome.", 
    "review_date": "2014-05-16"
  }, 
  "xM54EZxtxKehUN_YaWC7Rw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C K.", 
    "review_text": "Meh. It was fun until the droves of Yuppies showed up.    Gripes: Join this century and PUT A TELEVISION SET IN              Join this century and ACCEPT CREDIT CARDS  Probably will not go back. Too many other options with TVs that take credit.", 
    "review_date": "2012-06-08"
  }, 
  "Dhl0d-8Tgp4ihCtVc6LYSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Minh H.", 
    "review_text": "Cool place, mixed crowd, cheap drinks, and cash only. I don't like how it's cash only but can get over it. Other than that, it was a fun and chill night to hang with friends.", 
    "review_date": "2012-06-03"
  }, 
  "ZqEW0hByiV8PtMvHS00OIw": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Quentin J.", 
    "review_text": "Great new bar converted from a shady pool hall that I walked in and out of once when trying to find an amiable bar to watch the Giants pennant race.   I was only in and out on this occasion too but the little time I spent I can say that Dear Mom utilizes its space well. It's filled with games: skeeball, pool, arcades (think I saw some?) Tunes from a Jukebox that takes credit cards (super rad) offer soundtrack for drinking. They look to have a good selection of beers.   My personal highlight was the chicken salad sandwich. It was to die for. Fresh chicken mixed in a delicious aioli (a hint of dill maybe) and arugula on the freshest baguette you'll find at a bar.   Unfortunately you may not be able to enjoy this sammie on your visit as Dear Mom's kitchen changes it menu daily and only offers one item a day. Limited but I respect their desire to do one thing right.", 
    "review_date": "2012-04-09"
  }, 
  "0Sq_p5k5MJ3_DIlzbdOmtg": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Megan G.", 
    "review_text": "Love this place!  I went there for a birthday and it was great.  The food was delicious, the atmosphere was laid back, and the bartenders/manager were amazing. We ordered the papas fritas and the tacos camerones and both were delicious!  The drinks were reasonably priced.  I will definitely be going back!", 
    "review_date": "2013-02-27"
  }, 
  "DCnWy4XBG6ZiEquVqoCLOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeannette G.", 
    "review_text": "I used to work nearby, and often swung by Dear Mom either for a work happy hour or for 'on-the-way-home' drinks.  I have lovingly commented to friends that this place is called 'Dear Mom' because of all of the babies who hang out there. (I'm about to turn 40, and most of the clientele is in their 20s, maybe 30s. I'm thankful I look younger than my age!)  Despite my initial reservations about this place (a place for hipster babies and bright-young-things), Dear Mom has grown on me and my fiancé-who is even 10 years older than me and a bar owner! The ambiance is cool, and it's a great place to have a shot and a beer back. Their food is super tasty--it would be great if they opened for lunch.", 
    "review_date": "2014-01-22"
  }, 
  "Jldzk3pQnaang4nhTQsGzg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy H.", 
    "review_text": "I came here because i heard the food was good. i didn't know what to expect when i decided to try this place, but upon walking in, it reminded me of every bar in mission - very hipster and grungy.   Upon writing this review, i decided to urban dictionary the word grungy; because the word itself sounds dirty, but i wanted a more accurate description of Dear Mom. As UD puts it - not just dirty. Army boot dirty. Men's room floor dirty.  I guess i wouldn't say this bar was \"men's room floor dirty\", but it definitely gave off that vibe.  When we sat down at the bar, the servers were a little slow - ignored my friend and I for some time even though I was staring right at him. We finally got his attention and ordered 2 beers, their potatoes, kale taco (i dont know why, it sounded and was too healthy for bar food) and their chicken bao.  the best thing was probably the bao. everything else was just ok. they gave a generous cereal bowl sized of the potatoes, which i thought was nice if i wanted to gain 10 pounds.  Would come back for drinks, but not food.", 
    "review_date": "2014-06-02"
  }, 
  "lK_32lYJ-p_fjc01G-DPLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eliza D.", 
    "review_text": "I'd been excited to check out Dear Mom for a while, and finally made it a few weeks ago. II don't think there was a popup that night but I'm not 100% sure. Shared the steamed pork buns and potatoes with friends. Both were good but not worth the cost.", 
    "review_date": "2013-07-24"
  }, 
  "dGtsHOFYxPyJL5qK8k49kg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken M.", 
    "review_text": "This bar rules they have a good selection of whiskey beer and food. Plus its close to work so if I need a break or I have to meet clients I don't have to go far. So long dive bar and hello to a nicer scale kind of place.", 
    "review_date": "2012-03-07"
  }, 
  "ms5cezvfYjEHadbvuHD63w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Min M.", 
    "review_text": "Cute, hipsterish bar with a good amount of space. We were here last night for a birthday and the space in the back is nice for such an event. They did, however, come and kick us out for another group which they did not inform us of ahead of time.   They serve the food from Voodoo food truck which i hear isn't bad. I'm gluten free and was told that there wasn't anything I could eat (hence the 3 stars).   My wife is vegetarian and she liked the summer tacos - \"refreshing\" she says.", 
    "review_date": "2013-03-16"
  }, 
  "PVpeB-fTAd5qi1vxDTSehw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S. M.", 
    "review_text": "Been wanting to check this spot out for quite sometime. The name of the bar I really liked and the location is close to my work. Finally came here on a warm Friday night. It was packed, young crowd - but diverse in style from Marina douchebags to tattooed hipsters, it was a good mix I suppose.  Now for the oh-so important pros - fast service, friendly bartenders, somewhat decent pricing and very large space. I hate a cramped bar.  And now for the even more oh-so important cons - super sweaty hot, no air circulation, and the lights were a lil too bright for my liking.  Food looked good - didn't try it but interesting menu - more then just your average hot wings and fries. All in all, not bad, I'd be back for an occasion.", 
    "review_date": "2013-05-04"
  }, 
  "ldBOnh5lUiiPrPhZpDjPTQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Kiki V.", 
    "review_text": "Best bar in San Fran. Don't even bother with trying to find a place more awesome.  Good food, reasonable drinks, amazing staff.  They CARE.  Most of SF has been overrun with douchebaggery these days.  Dear Mom is an oasis.  Love, love, love.", 
    "review_date": "2013-09-30"
  }, 
  "rtd4t1APKJCWlZkZZry5Jg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kat M.", 
    "review_text": "I would do 3 1/2 if we could! I have only been to this bar one, but I liked it. The major problem was being overlooked by the bartenders (One was chatting up people next to us and the other was helping people who were walking up to the bar even though we had been sitting at the bar for awhile (10 min or so) and it wasn't super slammed or anything).   I am curious what their food is like as it looked pretty good.   Cash only. Large space. Fun music. And games.   I would go back and would hope the service was a little better.", 
    "review_date": "2013-06-11"
  }, 
  "_dKFcQEIOkJNzk74BPKBhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina M.", 
    "review_text": "Pretty cool, large low-key bar in the mission with cheap drinks, a pool table, some arcade games, a foosball table and a digital jukebox that allows you to select songs from your phone. I didn't try any food but it looked decent (bar food though). Would definitely come back!", 
    "review_date": "2012-05-18"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "not my type of scene with half hipsters and half marina crowd last night, but the door guys are hella cool.", 
    "review_date": "2012-03-04"
  }, 
  "ljtnTY6FOWvky4DXDXo_GQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan W.", 
    "review_text": "Outstanding food for a bar.  Community bench is good for larger groups.  Plenty of hipsters to punch in the face.", 
    "review_date": "2014-03-14"
  }, 
  "_rxqb3IOo_ZDrk1JUD0_AA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy D.", 
    "review_text": "Came by here after a sunday night rehearsal for a few drinks with a medium size group of friends. I do understand it was a sunday evening but it was 11:30 when we walked in and they were quick to tell us we had to order immediately because it was last call. We were the last to arrive so our friends already had their drinks. The un-friendly bartender told us he could only pour us shots since he called last call. I asked for a flavored vodka (clearly displayed on the wall) and he said he couldnt get it for me, my friend asked for patron which he was also denied, so we said just give us whatever... the bartender proceeded to grab silver tequila for my friend form the EXACT shelf the flavor vodka i had requested was on. We went to pay and it was cash only ( now this is my bad i should know better in the city) so i grabbed cash from the ATM .. he took 5 minutes to get back and get my cash which i dont know why because we wasnt serving any drinks. They quickly began flashing lights and making everyone leave before they even finished their drinks. The staff was rude, and unapproachable and I never plan on returning to this bar! ICK", 
    "review_date": "2013-05-21"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "I drunkenly had a burger and strongbow cider here and would highly recommend both.", 
    "review_date": "2013-09-18"
  }, 
  "yLeWNfBQ45opcd7DIQMQOQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor C.", 
    "review_text": "My office employees chose this bar as a place for a going away party. I wanted to be a cool boss and buy my employees some drinks. I asked the bartender for some drinks and two old fashions that were meant to be top shelf. The bartender asked me what label I'd like for the top shelf and I explained that I didn't know anything about old fashions and if he could choose for me. He then went ahead and picked the most expensive label and charged me 35 dollars each for the two drinks. That makes 70 bucks for two drinks and he didn't tell me how much these drinks would cost or give me an option. I felt taken. I'll never return to this place based on this bartender and his attitude. It was really awful. This was last night. You cannot trust this bars staff, period.", 
    "review_date": "2014-08-05"
  }, 
  "K0Zu6TQcFWnPVE0jGrGozg": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Tony L.", 
    "review_text": "Preface: We went to this place with a group of about 30 people. Each kind of in their own subset, so about 3 groups of 10. One of those groups included children and babies. We have awesome kids in our group, so don't think that they were running around the place spilling drinks and knocking over chairs. They behaved as any drunk patron would have: they told tall tales and lacked fine motor control.  When a restaurant or bar has dozens of people show up all within about 15 minutes of each other, it usually means that their service crumbles apart and their attitudes aren't very far behind them. Not so at Dear Mom. We put in food orders and within about 10 minutes our food started streaming out from the kitchen. Our drinks were served up at the bar by great bartenders that were plenty attentive for a fairly busy night. The music was loud and awesome. Seriously, Metallica, My Bloody Valentine and Buddy Holly all fit in just fine throughout the evening. The well drinks were generous (comparing prices to a few other bars in SF, some nearby and some not). The beer selection was more than adequate. The Foosball was epic.  I had a chicken sandwich thing, it was spicy and awesome. The homemade corndogs were epicly corndoggy. The Curly fries were curled just like the hair where as a child I'd hide and pray for the thunder and the rain to quietly pass me by-yigh. The Jalapeno poppers were poppingly spicy.  Can I mention again how chill and cool the staff was? Yes, I can? Then I will. Maybe they just had the A-Team on that night, but all of our needs were met and the one flub ( a forgotten fried egg) was rectified quickly. A buddy of mine loved his burger which had the fried egg included on first attempt. Typically there's a coldness when staff see children being brought into a bar &amp; grill... you know... like their cool spot is being encroached upon by breeding yuppies. We experienced no such cold hard stares or sneers. Instead they applied the age old practice of smiling and waiting for people to prove that they are assholes before treating them as such. Considering there's not an asshole to be found in our bunch, we had an expectedly good time and the staff were happy to have us around.  Go to this place happy and ready to enjoy a bar that at least for us on that Sunday night delivered on all the promises a bar can make: Staff that is timely, food that is not complicated and tastes great, and libations that flow nearly freely.  Kids are ok until 10pm, in case you were wondering.", 
    "review_date": "2014-09-22"
  }, 
  "sjzpz7oCW0t7m7sI_3hHeg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah A.", 
    "review_text": "Who plays Vanilla Ice 2 times in a row? My opinion of this place is not a positive one. The ladies room had 2 toilets with no divider. I had a conversation with a red head lady while peeing  just to be considerate.   A woman at the bar was completely unaware that it isn't polite to swing your foot around carelessly into a crowd of people. A random pool table is awkwardly placed in the middle of open drinking space.  If I didn't get so turned off by all of it , I might of actually scoped out the beer selection.  This place is may have been appealing in college.", 
    "review_date": "2012-01-08"
  }, 
  "Om3XzO7bUOz9bkSR8bYtcA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa A.", 
    "review_text": "Like the bar. Like the food. Can't stand the crowd of inconsiderate smokers they allow to hang out directly in front of the fully open large front door. Disgusting.", 
    "review_date": "2012-10-28"
  }, 
  "L8Om2473wuZK4LTxLL6RUg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christina R.", 
    "review_text": "I'm fawning so much over Dear Mom, they should change the name to \"Deer Mom.\" Okay, that may've been ridiculous, but this place is no joke.  Hosted my birthday shindig here a while back and had a very lovely time. They crafted a waffle with berry jam that'd go down in the Waffle Hall of Fame. Off the hook, off the grid, off the charts. These ain't no Eggos, kids. The food here is utterly superb.   Come on Wednesdays for whiskey and a pickle back (yes, that's pickle juice chaser) from the local celebrity bartender. I'm not gherkin your chain! (Ugh, sorry about the puns.) Come any night for a game of giant Connect Four or billiards.", 
    "review_date": "2012-02-06"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "They have updated the sign to say Daily Special...which is more apropos then Happy Hour Special.   I'd pay $7 for a Jameson &amp; PBR during the  hours of nightly bar frolicking in the Mission. I have not yet attempted a second visit to the food but the staff is nice and the beer selection is small yet solid.   I guess this just falls under the classification of bars that don't do happy hour at all.", 
    "review_date": "2012-05-22"
  }, 
  "XYLpZqLEp3eF0LnTaNAZ3w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kyle d.", 
    "review_text": "Recently changed the stars I have this place. The beer is good and the atmosphere is fun. Devon is a great bartender and overall, the others are good too. They have food that's good with typical trendy mission prices. Cheapest thing on the menu is edamame for $4.", 
    "review_date": "2012-07-15"
  }, 
  "Rp8hHh-2U8Nh-7FhhspVxQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Joy A.", 
    "review_text": "Dear Mom.   You just have to love the name.  Reasons why I'd come back again: -Cool dive-y bar -Open, airy, and spacious -Pool table available -Photo booth available -Private backroom available -Juke box available -Nightly specials available (PBJ: Pabst Blue Ribbon beer &amp; a shot of whiskey =$7) -Street parking available (easier to find parking here than in the Mission) -Lots of bar food choices:  *Daily Specials- Lamb w/ Polenta, Roast Beef, etc. *Regular dishes- Beef Sliders, Shrimp &amp; Grits, Steamed Hot Dog, etc.  Bottom line: Cool spot to hang w/ friends and throw back a couple of beers.  Note: **CASH ONLY**", 
    "review_date": "2012-03-19"
  }, 
  "K9-4EkmJo1Qd1Pt5GCn5Hw": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sash P.", 
    "review_text": "The bartenders are slow and have a bad attitude. People waited at the bar for over 45 min to get served. They never made eye contact and it didn't look like they had their own stations or any bartending experience for that matter. You should try other bars around this area, Dear Mom just isn't worth it.", 
    "review_date": "2014-07-27"
  }, 
  "K9E4zQSmE9KguCxCQZ42Kg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "Cool place I popped in on my stroll home when visiting. Definitely a Mission hipster feel but still friendly and open. I had a couple of mixed drinks and a beer and didn't think the menu was the most voluminous, but definitely had some great options.  Service at the bar was great. I didn't have any food when I was here but everything I saw people eating looked great. It was quiet when I was there so I was able to play ping pong for a solid hour in the back room, a place that had a weird old sunken ship feel to it and I was somehow drawn to. I would definitely like to go back on a busier weekend night and see how my thoughts change.", 
    "review_date": "2012-09-20"
  }, 
  "BdcNkjxcse8y48YISk6low": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael D.", 
    "review_text": "For a hipster bar, and I DO mean hipster bar, Dear Mom is pretty darn cool.  It's spacious, rustic, and the bartenders know their bourbon like the Yankees know how to put together dynasties.  Adding \"In Rainbows\" to the jukebox was also a nice touch.", 
    "review_date": "2011-12-22"
  }, 
  "jEVqZq_r0zd9GNrxbliGag": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Adonis V.", 
    "review_text": "Dear Mom,  I'm wearing skinny jeans, skinny ties and thick rimmed glasses.  I thought you would appreciate the vibe I'm bringing to your place cause I seem to fit here perfectly.  I certainly like ample space you have in your house but I don't appreciate you charging me cash only when in this modern day and age, everyone carries plastic...Even me!    I really do appreciate your cooking and your falafel burger is very tasty.  I threw a big event here with my snowboarding buddies with nearly 100 peeps showing up and you didn't mind the drinking and debauchery that ensued.  You even gave me a special on the the Chimay and a whiskey shot...You are the coolest Mom in the world!  Sincerely, Hipster guy", 
    "review_date": "2013-03-22"
  }, 
  "duymKKwUruH8GwbvcaFd0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene X.", 
    "review_text": "Jay and Oliver have put together an amazing space.  I've been by three times now and I can't wait to actually try the food since all I've done so far is drink.  It's very spacious and they have a pool table and giant Connect Four game too.  They also have an arcade machine with a bunch of old school games (Mappy, Xevious, Mr Do, Burgertime, Donkey Kong, Frogger, etc.)    Good bourbon list and other whiskys too!", 
    "review_date": "2011-12-05"
  }, 
  "T81dEo4yH-O9JUQ71-Dgpw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "teri s.", 
    "review_text": "I love this place!!! Food is really good! I love the buffalo chicken sandwich!! I took one star away because they got rid of all the board games and giant connect four game :(", 
    "review_date": "2014-03-09"
  }, 
  "UvrnceI8CFCjoJo4iPEjUQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brit H.", 
    "review_text": "hello.  i am a hipster*. (see reference below as cited from the scrupulously well known  urban dictionary)**  i also don't drink (but my friends do). the ginger ale is delicious.  as far as drinks, thats where admittedly i cannot  continue to help.  bartenders brunch on sundays is nice. yum waffles and ritual coffee. the food preparation is done alternately by various cooks/chefs/food trucks/restaurants etc.  all of the bartenders are terrific (chris is a doll) including the eager to please and down-to-earth owners; jay and oliver. great guys. not douchey. not to your face anyway.  they have a giant connect four.  video game machine.  pool table internet jukebox.  photo booth. a large space to accommodate the massive hipster encampment.  someone complained about there being too much space? really?  the difficulty in getting a drink on a busy night? it is a new bar and it is busy. wear stilts.   OR  tip a bartender REALLY well on the first round(s) and they'll remember you. speaking from previous career experience.  regarding the women's bathroom being weird and stalls separated by mere shower curtains? for some reason it is to comply with the american disabilities something or other. additionally, most girls go pee in flocks together...myself included. who cares. you probably didn't mind peeing openly at burning man...  people have mentioned the doors being open and they are cold. drink more. move. this is san francisco. sport the \"double hoodie\" \"*** i do. because i am hip, i invented this...you're welcome. bars do this so people know they are open...especially when they are not surrounded by other bars. this isn't fine dining. they have combination specials of PBR and Jameson dude.   * by admitting i am a hipster i may have lost the title since a hipster probably wouldn't admit that.  ** \"Hipsters are a subculture of men and women typically in their 20's and 30's that value independent thinking, counter-culture, progressive politics, an appreciation of art and indie-rock, creativity, intelligence, and witty banter. The greatest concentrations of hipsters can be found living in the Williamsburg, Wicker Park, and Mission District neighborhoods of major cosmopolitan centers such as New York, Chicago, and San Francisco respectively. Although \"hipsterism\" is really a state of mind,it is also often intertwined with distinct fashion sensibilities. Hipsters reject the culturally-ignorant attitudes of mainstream consumers, and are often be seen wearing vintage and thrift store inspired fashions, tight-fitting jeans, old-school sneakers, and sometimes thick rimmed glasses. Both hipster men and women sport similar androgynous hair styles that include combinations of messy shag cuts and asymmetric side-swept bangs. Such styles are often associated with the work of creative stylists at urban salons, and are usually too \"edgy\" for the culturally-sheltered mainstream consumer. The \"effortless cool\" urban bohemian look of a hipster is exemplified in Urban Outfitters and American Apparel ads which cater towards the hipster demographic. Despite misconceptions based on their aesthetic tastes, hipsters tend to be well educated and often have liberal arts degrees, or degrees in maths and sciences, which also require certain creative analytical thinking abilities.\"  *** not to be confused with (double rainbow)", 
    "review_date": "2012-01-29"
  }, 
  "XOHKDnt58mENLSjlrSHAyA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phantomfemmmme p.", 
    "review_text": "So, I've been here a time or two. The first time for a private party in the side room and a couple there after for a early Saturday night sip. Well, this last visit just blew my socks off...   I hosted a lil going away shindig in the back room for some special friends of ours. Dear Mom went way above and beyond our expectations. Set us up with some table tennis, organized the pop up trucks so we were fed throughout the event and even gave us some free plays on the jukebox. Everyone was super impressed with the service, the shots &amp; the stellar food (Whiskey Commons rocked the pork sammy).  Needless to say, I think they really set the bar for customer service. I'll be back, again and again and again.", 
    "review_date": "2012-07-29"
  }, 
  "erZZ9K9wgdSswAm6TEh7Qw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly M.", 
    "review_text": "Was invited here for a going away party, it's a bit out of the way so I wouldn't normally come here. The bar itself is cool, a very chill vibe and lots of space which is nice. They take cash only, which is annoying but I got over it. They have limited vodka options, which sucked but I was fine with it since that's just the way it was (and it wasn't expensive). My 1st vodka tonic was fine, but my second was luke warm - really, warm vodka tonic? What is wrong with this place, I was pretty much done after that. The people I was with seemed to like the food, but I didn't try it. In any event, I won't be back - I like a good vodka tonic and one that's cold!", 
    "review_date": "2012-11-19"
  }, 
  "mJHhMXJK8yWnG1CNgJKxGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allyson D.", 
    "review_text": "Dear Mom,   I'm sorry I wore a sheer shirt last night that you could totally see my bra  through.  Thanks for not saying anything.   I know I don't tell you enough, but I really appreciate your cheap drinks and the entertainment you always provide for my friends and I in the forms of buck hunter and photo booths.    I can't believe you let me stay up so late on a school night!  I'm also grateful you taught me well, and that I should only buy drinks with cash.  Who needs cards anyways?  I hope next time you will make me a midnight snack, those hotdogs you made the neighbors looked AMAZING.   I love you and I promise I will come back and visit soon.", 
    "review_date": "2013-03-29"
  }, 
  "1kaSMeWkDuVASaQ2A30tQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna W.", 
    "review_text": "This off the beaten track joint is a really great spot for a weekend night of drinks and hearty bar food. The bartenders are extremely friendly and the Violet Bouregard I had was fantastic. We tried the sliders and the mac n'cheese from their regular menu, and it was all tasty. Hadn't it been for the holiday spirit, I might have had to cut half a star because of the sometimes alarmingly high volume from the jukebox ... But for having been open for only 16 days, they are sure doing a fine job and I'll be back.", 
    "review_date": "2011-12-17"
  }, 
  "OONSLml-Z1Cn62Y6JyuEbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole A.", 
    "review_text": "Reading through the reviews, there is a lot of misinformation about the staff behind the Dear Mom food. They are not Chez Spencer, they are not Voodoo truck. They are Guillermo and Caroline who used to have a food truck named FogCutter. And they are DA BOMB!  Upscale bar food that is crazy inventive and awesome. Once a week there are pop-ups on Sunday, but the rest of the time they are working their tailfeathers off bringing all the drunk people fantastic food. Shout out to Sherie and Jay who also flex their chef muscles in the kitchen (Sherie is from Voodoo).   Yes, the bar is cash only, but if ya'll look around, there is an ATM right inside. It's not rocket science, it's just a bar with food, but it's a good one and you should be nice to your Mom.", 
    "review_date": "2013-04-02"
  }, 
  "-vqUxKdYbH12DsFS9Tbj1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel F.", 
    "review_text": "this place is fantastic. i think they opened about 5 days ago, and you could not tell at all that they were new. great staff, friendly service and they were quick at the bar. drink prices were great, food was amazing. welcome to the neighborhood!", 
    "review_date": "2011-12-03"
  }, 
  "3JMY7N7dsaQsjqwN5cZUVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lou Z.", 
    "review_text": "This could become my favorite neighborhood bar but they need to get a better selection of IPAs. The only one they have kinda sucks and it's 5$ during happy hour.   I had a slider which was delicious but for 9$ I expected either a larger/normal size burger or a couple of them. The cook was friendly.   My biggest complaint is the lack of places to lock your bike.", 
    "review_date": "2012-01-22"
  }, 
  "NX1kf75zOXFXSwpiN7YYcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J S.", 
    "review_text": "Bars to love are really easy to choose for me...Here's my check list... DO they have .... *Good/interesting beer selection.... CHECK *Good snacks....UHH yes ... (The menu's bomb, so far I've tried shoyu eggs [soy-marinated hard-boiled eggs with cucumber kimchi] &amp; they were AWESOME...I'm in the process of trying more) *Good venue....yup...HUGE with large tables &amp; a large backroom (with a picture of Sophia Loren I might add which if you know me ... beautiful ladies on your walls are a plus to your establishment) *Great location - very close to all the Mission happenings &amp; to public transit &amp; is very convenient to me ... *A mellow crowd *&amp; a juke box....  What else is there to ask for???  I am kinda sad that they tore down all the awesome vintage photos &amp; 'roids in the bathroom though...I always thought Dear Mom had the coolest bathroom bc of that but not anymore...:(", 
    "review_date": "2014-06-22"
  }, 
  "PDw6E484ow3Wp2k0_An6iQ": {
    "user_rating": 4.0, 
    "user_location": "Claremont, CA", 
    "user_name": "Laura H.", 
    "review_text": "Bring your Mom to Dear Mom.  Good beer, music &amp; atmosphere.", 
    "review_date": "2012-11-07"
  }, 
  "yi9eAPNgnqBGaRQ_Eyz2Aw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaylena P.", 
    "review_text": "\"Dear Mom, I came to this bar because I have been walking past it the last two years and I finally decided to stop in. Remember how you always used to say,  go with your gut instinct? I should have listened! No wonder I have passed this place for so long. It's totally wack!\"   First, who told you that Jameson &amp; PBR should be paired? I think the Jameson family and the Ricard folks would be appalled. Second, why do you have PBR on the blackboard like it's champagne? PBR is worse than Coors &amp; Miller combined. Yes, I just said that.   My gin &amp; tonic was more akin to diluted rubbing alcohol sprayed with lime perfume. Just downright awful.   The atmosphere reminded me of the bars near UCSB and Pepperdine. What the sign should really say, is Dear Mom, please send more money so I can party it up at the bar with watered down drinks.  No thanks, I think I'll stick with Señor Casanova.", 
    "review_date": "2014-11-22"
  }, 
  "H5EY1CeIx4m_pNChKZkq7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathy V.", 
    "review_text": "Looking for a bar to kick it ..after work? Well Dear Mom, is the place to be!!  Came here on a Friday night for our Tough Mudder Reunion. Met up with Yelpers Devora, David, Peter, and Janice C. Shout out!! LOL Any who, venue is roomy and gets packed quick. Setting is kind of dark, pool table in the back and a huge bar that outlines the wall. Most importantly the drinks are good! LOL there not watered down, so please enjoy yourself.   Gotta love the name, DEAR MOM!!", 
    "review_date": "2012-03-20"
  }, 
  "YxPczw0Ge_-t2LBqzqNr2A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica C.", 
    "review_text": "Dear Yelp,  I like this place.  A lot.  The bar is large and roomy and service is quick.  Their specials: typically Jameson or Jim Beam and a PBR is great.  Giant Connect Four and a pool table.  Small room in the back can be reserved for parties.  Nothing fancy but a solid place to have a drink.", 
    "review_date": "2012-03-23"
  }, 
  "4RlzFohEgBdFXUGoqvpZqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa N.", 
    "review_text": "I came here late last Thursday. Although I hate cash only bars, I was willing to give this one a try. The space is big, open, and airy. So much so that it was pretty chilly as they kept the door open (which I totally understand, otherwise, you may not know this place is here). The bartender quickly came over to us and we got some tall cans of PBR (when in Rome...). What I really liked about this place is that there was space to sit and have a conversation, which you can't always find in this city. I'd def. be willing to come back and have a more diverse range of drinks with a big group of friends!", 
    "review_date": "2012-09-22"
  }, 
  "AU5oQS6QSwZHDyI4dJTmsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joann T.", 
    "review_text": "Came here for dinner with friends--the ambiance doesn't make it the best place to have a meal but the menu is a pretty interesting blend of bar food with an Asian twist. For apps we had the edamame, papas fritas, and pickled vegetables w/ quail egg (the third being our requisite nod to current foodie trends). I also ordered a buffalo chicken sandwich since nothing is not improved by Sriracha. The edamame was a standout--sesame seeds and lemon were a nice touch.  There are a lot of comments about this being a hipster bar and while that was the case it wasn't oppressively so. Granted we were there on a Wednesday night.", 
    "review_date": "2013-04-25"
  }, 
  "wnOvtPxuET5MvxOHKCzxgQ": {
    "user_rating": 1.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "John J.", 
    "review_text": "San Francisco hipsters managed to buy a bar.  I'm never going here again, ever. Our experience was so bad it makes me cringe every time I drive by this place (we had a terrible experience with a birthday get-together).  Dear management at Dear Mom: real businesses don't let snotty little entitled hipsters run customer service for a reason.  Oh, and the drinks were completely boring and overpriced, before we walked out.", 
    "review_date": "2014-03-10"
  }, 
  "AjHFgLursLNKyzsqG_Y4VA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linus W.", 
    "review_text": "Cool looking bar, pretty empty on a Sunday morning for brunch. This review is just for the food though. Probably way cooler as a bar on a fri or sat night.  Fried chicken sandwich had a nice crispy crust and tender enough, but the slaw that came with it had too much mayo for my tastes. Also the chicken batter appeared to rely more on the korean chili sauce for flavoring than spices in the batter itself.  The chilaquiles verdes was a tasty messy-looking bowl of stuff. Avocado on scrambled egg on pork shoulder on tortilla chips with salsa/sour cream/cheese all over it, and a lime on the side. Seemed like a pretty good hangover dish if that's what you're looking for. The dim interior lighting would help that, as well. ;)  We were really hoping for the fall hash as shown online, but the menu of the day was different from the example on their website, oh well. Prices are alright, however, and we definitely left full. Seems like a good spot for people in the neighborhood esp if you want something less frou frou than a mimosa to pair with your brunch, but there are lots of other interesting brunch places elsewhere in the city!", 
    "review_date": "2013-12-22"
  }, 
  "2pPNxXnyh6EDUuBJVuoQmA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Brandi W.", 
    "review_text": "I think it's a wonderful idea to have pop-up restaurant nights in the bar. They have a small kitchen space just off to the side of where the drinks are served, which they frequently rent out to up-and-coming catering companies or food trucks.   Hella Vegan Eats comes in from time to time. Those lovely individuals make some of the tastiest food. It's a shame they don't have their own restaurant yet. But I digress...  As for Dear Mom, I haven't tried their drinks yet. It's a dive bar, but not totally sketchy.   Yes, seems to be Hipster Paradise. You'll probably get a few up-and-down looks from the regulars, judging you on whether or not you're cool enough. Don't worry, they'll leave you to your business.   Seems like there aren't enough tables. The last time I was in, two booths were completely covered up with jackets and backpacks, not allowing anyone else to sit down. Not okay.", 
    "review_date": "2012-12-16"
  }, 
  "bM1vovFIegj7naEzhIRIDg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C D.", 
    "review_text": "To the guy on the pool table last Saturday night:  I get it. You're a showman. You're somewhat decent at pool, and it was nice to see you keep up with me even though I walked into the bar completely hammered. No need to make snarky comments to your friends or prance around every time you put a ball in. By the way, try to give a straight answer when someone asks \"who's next on the list?\" A shrug and a cocky look isn't an adequate replacement for your ignorance.  The rest of the assholes in the joint were only slightly less annoying, if only for the fact that they didn't talk to me. A saving grace, indeed.  Dear Mom,   Your bar sucks.  -Love CD.", 
    "review_date": "2012-05-07"
  }, 
  "yJAkBODmbaBQnaCgMlGsbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz C.", 
    "review_text": "Presented with a flight of interesting whiskeys, by an interesting bartender, under golden filament bulbs, on a deliberately angular counter (because everyone wants to sit at the END of the bar, says amiable owner J), this New Yorker was again plagued with Mission District envy.   Why have I never seen a full-sized pool table at a bar? Why was there seating at the bar, seating in booths, and seating around the various scattered oak barrels? Why, despite all our pomp and circumstance, can New Yorkers only muster a dilettantish penchant for amber liquor (and liquids: I asked what 'Ritual Coffee' was, and received a sad shaking of the head-) compared to West Coasters?   Dear Mom? I want to move to San Francisco.", 
    "review_date": "2012-01-06"
  }, 
  "2G9534Zx7ph7y9k_QhbMOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serena Q.", 
    "review_text": "Between Dear Mom and Gracias Madre I am starting to think The Mission has a serious mommy complex.", 
    "review_date": "2012-10-29"
  }, 
  "eRAiAu1ZmvagwfE565ckOw": {
    "user_rating": 2.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Bantu Z.", 
    "review_text": "This place is a fad. Drinks are not that cheap, its way too hipster for my taste and they close too early.", 
    "review_date": "2014-03-01"
  }, 
  "h9NqARoD3oR5p4z5p6uJzA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Amber M.", 
    "review_text": "This would totally be my neighborhood bar because:  --it's 2 block from my house --they have good &amp; cheap beers (we're talking $4) --it's spacious but doesn't feel too big --large U-shaped bar --there's a pool table --chill, relaxed environment --they have food  But it's NOT my neighborhood bar (yet) because: --it's always crowded --I don't know the bartenders (that's important if it's gonna be \"your\" neighborhood bar) --I can never order food because all the seats are taken --the cookies are $2, and they suck --they don't have any of my favorite IPAs on tap (probably the most important)  I'll still go all the time though! It's a new bar to the mission, so I don't blame everyone for wanting to try it. AND they can always add some good IPAs to their menu...", 
    "review_date": "2012-01-20"
  }, 
  "YP8WqkDOhkir9Tj3K5U94g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie F.", 
    "review_text": "Hipsters unite. Menu served 24/7. Good beer selection.  I haven't tried any cocktails here but know that some of the bartenders are reputable from other bars.  PBR-themed home-made Connect-Four would be great if they had a full set of pieces.  It made for a very disappointing game due the premature end.  Their website is through facebook ... Foul play.", 
    "review_date": "2012-01-15"
  }, 
  "3G9Jkn7hKc8fmbdK8_lC8g": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Regina C.", 
    "review_text": "I dig this place! BUT I went at a time that wasn't crowded and we had a big table to sit at so that could've made a huge difference. had it been an extra crowded night I might have a different story. it seemed pretty spacious and chill. the food was more than decent and the bartender wasn't a hassle to get a hold of. I've yet to come for a popup but fully intend to.", 
    "review_date": "2014-07-22"
  }, 
  "OnFVuSyFNX_f0C606KXH7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy S.", 
    "review_text": "Three of us went for a snack and everything was amazing!  The cuban style sandwhich was packed with flavor, the banh mi was fresh and delightful, and the gumbo was sooooooooooooooooooooooooooooooooooo fantastic!", 
    "review_date": "2012-03-01"
  }, 
  "hkEmdF3NXVS7H4CzSDlqkw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin B.", 
    "review_text": "This might be one of my new favorite bars in the Mission for the papas fritas alone. The potatoes (they're too thick to be called fries) come covered in chili powder, lime, chives and cotija cheese, and I apologize if reading that made you drool all over your phone.  The drinks are stiff and there's a surprising amount of floor space for a Mission bar. Entrees are decent, I had the falafel burger which was plenty tasty, although it wilted into a tzatziki sauce mess within a few seconds of picking it up. (No worries, burger salad is just as tasty.)  The place is cash-only, but you're in the Mission, so you can't be surprised. It's a bit of a hipster magnet, but don't worry, they're only pretending to like it ironically. Try this out!", 
    "review_date": "2013-02-27"
  }, 
  "kcT0hcsvvl2F7VomQ8yoEQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauri C.", 
    "review_text": "Came here on a Wednesday night (apparently they close at midnight during the week).  It was 11:30.  Ordered a beer.  At 11:45 I was told to chug my beer and get the hell out.    \"Can I please finish my beer?  I'll be out by 12.\"   NO.  GET OUT.  Worst. Customer Service.  Ever.", 
    "review_date": "2012-04-12"
  }, 
  "yb2erMSDuAAl7-KRnPX_RA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth D.", 
    "review_text": "ehhhh this is my personal opinion...if you are hipster youd love it! No my scene, quiet, lame no music! boring!!", 
    "review_date": "2012-11-27"
  }, 
  "7-6e12HAy1XIT2pG1pMFhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob K.", 
    "review_text": "I drive up and down 16th St. a lot and always wondered what's up with that odd building on the corner - part bar, part dump, part art project.  Well, Ante Meridian did a pop-up brunch that sucked us past our doubts and into DM.  What a pleasant surprise.  This feels like it would be a great hangout. The room is open, not cramped, with a nice big bar and some bar entertainments about.    The AM pop-up was great.  Especially the rice porridge with pork, poached egg, kimchee and spinach cream.  YUM. One of the best congee-style creations I've enjoyed... WINNER!   Check out Ante Meridian if the pop up on your radar, and don't be a dork like me and prejudge a place by it's neighborhood and facade.", 
    "review_date": "2013-08-15"
  }, 
  "KEPtqEP50ibJNwCOxTwJFQ": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Justine F.", 
    "review_text": "So many hipsters! Things I love: The BURGER &amp; FRIES, drooling just thinking about them. The foosball, The amount of seating, The photobooth, the jukebox the atmosphere  Things that need work: beer selection, not much variety on tap", 
    "review_date": "2013-02-01"
  }, 
  "__05rytNjsye9MBhqB0DMA": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Marck N.", 
    "review_text": "Great  bar. The burger I ordered was prepared how I asked. Medium rare with all the juices running out. The beers that I had were good.  Plus the whiskey shot for four roses bourbon was a good palette cleanser.    I like this bar and will be a return customer when I am in the neighborhood.", 
    "review_date": "2013-08-18"
  }, 
  "xRWRDXapx5HYVIxi9tqSjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ashley m.", 
    "review_text": "Came  here after work and had some nice drinks and food. It was a nice spot for after work drinks because it was relaxing and good music. We had their fries, which were more like chunked up potatoes with cheese on them. They were so very good. The rest of the menu looked really good. I'll for sure come back to try more food.", 
    "review_date": "2014-03-27"
  }, 
  "WWhxtBLG2FVRv8n5K0HnWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Devon C.", 
    "review_text": "I wish Dear Mom was closer to my house, because I'd then be able to drink there 5 times a week at least! This is hands down one of my favorite bars in the city. Jay and Oliver go above and beyond with customer experience. I've never felt so welcome at a bar as I do here. The food is excellent, and the whiskey selection is huge. Every time I recommend it to a friend, they always text me later with how much fun it was and how much they love the place.", 
    "review_date": "2012-01-06"
  }, 
  "zst5ol5eBsx-Uz6wfKDzAA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny M.", 
    "review_text": "Right off the bat, 5 stars for food. I've only had the burger and salad that comes with it, but they were really, really good. Surprisingly good frankly.   The bar leaves something to be desired. The bar itself is a mess of a design. It's a zigzag, not a long straight bar, so you can't see any brands that they carry on the back bar. Unless you have remarkable vision.   It's cheap so that's good for some. But I always wonder what's going in my drink if it can warrant it being so cheap. So I stick to beer. It looks like they have an interesting, off the beaten path beer selection.   And the bartenders. Wow. 5 stars for our girl with the glasses and really pretty eyes, but one star for all the rest.   This place, like most Mission Hipster type places, hire people with distain for everyone that isn't like them. Tattooed all over, poor, or poor looking, ratty unkept hair, bizarre sense of \"style\", if you can even call it that.   And we even heard a couple of the bartenders talking shit about the rest of the staff, their job in general and hating working there, and about customers, right to their face.   It was, in short, comedy to watch.   It's new, so it's busy. And it'll probably lose a little of their following due to the overall poor service and attitude.   I'll be back for the burger.", 
    "review_date": "2012-02-21"
  }, 
  "UJkhP7wNRUW9KzYektCtuA": {
    "user_rating": 4.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Hailey H.", 
    "review_text": "I've only ever been here at night, but it is pretty poppin' most of the time.  Couldn't tell you what kind of music they play but it isn't weird, they have pool AND ping pong tables, and last, but definitely not least, they have a photo booth.  Every bar needs a photo booth.  The only drawback is they seriously need a bigger bar/ more bartenders, but doesn't everyone?", 
    "review_date": "2013-11-20"
  }, 
  "DkFR-AE68Nr0jRR8mKQmlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sin F.", 
    "review_text": "Dear Mom is pretty right on.  Nice whiskey selection, didn't try any food but the German pilsner I had was nice.  Roomy and friendly place as I experienced it.  Probably the best thing going in the immediate area.", 
    "review_date": "2012-03-28"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "Preface: I remember the first time I started to drink coffee in bars. It was shit. Pure sludge of an experience. In the good way. Indianapolis, Indiana. Red Key Tavern. Shit coffee on deck. Smoking cigarettes, drinking shit coffee with Wanda Jackson on the jukebox.   The scene is covered. The lighting. The beers and cocktails. The big tables. The pool table. The food. The din. The location. The friendliness. All covered. What has been missed in the past year of reviewing Dear Mom? Well, something that comes together to create something that doesn't exist anywhere else in the city outside of your home or your office:   1. Ritual coffee on deck -- free refills. I repeat. Ritual coffee. Free refills.  2. Free wifi.  3. Big tables.   What's that create? That creates a work environment. That Rituatl coffee is brewed by the batch and it looks like they're doing bulk pour overs? Also, their water boiler is more adorable than R2D2. It's true.   I'm not going to abuse the privilege of these guys pouring free refills, so I'll be tipping well and I won't be here every day to work or even every weekend, but when I'm in the mood to work here with friends, I'm coming. And I can't say that this enviornment -- with refills -- exists anywhere else.", 
    "review_date": "2013-01-14"
  }, 
  "a5bVNQAqI_oYrHq0oLMGkQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C A.", 
    "review_text": "Surprisingly great! Went there for brunch n it was really good. Chill atmosphere. I will go back.", 
    "review_date": "2014-03-21"
  }, 
  "Kqef_0Rtq4W-Bp7S_Wn-GA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dodi G.", 
    "review_text": "This, in my opinion, is one of those hipster bars with a random name. I must admit that it was not bad, though! it is the perfect place to chill in a group and have a beer. I got ID'd for the first time, so that was a milestone for me. Besides drinks, beers and shots, they also serve food: tacos, burgers, fries and edamame! I had a kale taco, and it was interesting because the avocados in it had a red (spicy I think) powder on it. Also the two small slices of watermelon served with the tacos were covered in it. Do not know what it was but it had a unique (spicy) flavor. The ambience was very casual and the place was a bit crowded. Because of where it is located, it really does not look like a bar until you are up close, so do not give up and look around if you are trying to find it!", 
    "review_date": "2013-08-24"
  }, 
  "0zvXh6uOzQQxxB3g0zfeYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "anisse-Marie G.", 
    "review_text": "They say Dear Mom is closed at the moment, but that's because the internet doesn't know everything.  My mother is the greatest person that ever lived.  I'm not sure how to live without that fact beating in my chest every moment of every day.  I run anxious, so I think alcohol, as Joan Didion says, is the most effective anti-anxiety agent known to man, aside from a living, loving mother.  My mother, and the occasional drunken adventure, combined with my life as an artist is what saves me day in and out.  Thank you for creating a bar that commerorates everything worth loving in life. Also thanks for boss bartenders, a location that serves the fringe, and everything else that makes us sound and happy.  Here's to the way yelp should be.", 
    "review_date": "2011-11-29"
  }, 
  "jhlypqpD38ms7mlIyPwzcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "AK F.", 
    "review_text": "Such a fun spot - cheap drinks, super nice bartenders (who are also the owners), games, big booths, plenty of room to stand and mingle, AMAZING food from that window in the back - I've been here a few times with a few different groups of friends and everyone said the same thing - let's go back soon!!!!!", 
    "review_date": "2012-02-27"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "If there were an Advent Calendar that spanned roughly six months, but featured shots of Jameson and tall cans of PBR instead of mediocre chocolates and visions of sugar plums dancing in heads, trust I would have swooped it up the second I learned of Dear Mom's plans to take over the old El Rincon space in the middle of 2011 as a way to celebrate my impending excitement. After a few bumps in the road delaying their original opening date, they're up and running now, and I couldn't be more thrilled.   Being the bar fly that I am, I've been looking forward to Oliver and J's new project since being tipped off at their former place of employment, Thieves. And after my first visit over the weekend, it was everything I'd hoped for and more. The space is huge (which is a bit of a rarity in this city), the Edison bulbs rappelling from the rafters give off a warm, inviting vibe, the staff is quick and efficient behind the racks, and most important of all, they've curated quite the lovely group of people to enjoy a drink around. Chalk it up to their impressive network of family and friends, but on the night I dipped in, I couldn't help but notice how good looking and energetic the crowd seemed to be. That may be a shallow observation, sure, but it is what it is. That's not always the case if you frequent enough watering holes around the city...  Being a neighborhood bar, they're darn near always open. Currently, they're open for roughly 12 hours a day beginning at 11:30am, and they've tasked the folks behind Chez Spencer with supplying bar bites that'd pique the interest of any self-proclaimed epicurean food snob. They feature a daily specialized entree Monday - Sunday with corresponding price points, they have a roster of permanent comfort food fixtures, and it looks as though they have a pretty fun little brunch set up for the weekends as well. Have yet to treat my palate to a taste of what they have to offer, but already being a fan of Chez Spencer, I can only imagine I'll enjoy every last morsel.   Though I love the coordinates of where my apartment sits, a genuine locals hang like this is enough to provoke me to peruse Craigslist just to see if there are any available rentals within stumbling distance. Maybe the best thing to happen to society since Callin' Oates (<a href=\"/redir?url=http%3A%2F%2Fwww.callinoates.com%2F&amp;s=35424e248ccec991c85fd72567d794cb1a329f89a69a6c99a645fbaf756d5e9d\" rel=\"nofollow\" target=\"_blank\">callinoates.com</a>)? Only time will tell.", 
    "review_date": "2012-01-03"
  }, 
  "-qnZYtMnvPt4XWYH5oXDUw": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Jasmine S.", 
    "review_text": "Rad corner hipster bar in the Mission District.  No cover charge, on a Saturday night?  Sounds good to me!    The place was really chill, lively at the same time...  Nice laid-back attitude.  Dim lighting, but not so much that I couldn't see the people I was talking to.  Great mix of music, some old stuff, some new stuff, R&amp;B, 90's Hip Hop, Pop, some Alternative.    Even though there were a lot of people in here, finding a place to sit at the community table or in a booth seemed to not be a problem at all.  The bar was crowded though, and for brief moments it seemed almost impossible to get a bar tender to help us, but after the surge I saw the perfect opportunity to order a round of beers.  $5 for a Blue Moon.  Not too bad.  Yes, you can almost buy a six pack for that amount, but in San Francisco, on a Saturday night I have never paid that little for an adult beverage.  I was a very happy camper.   The bao that my friends ate looked delicious.  I didn't try any of their food offerings while I was here, but my friends devoured them!  Worth visiting again.", 
    "review_date": "2013-08-19"
  }, 
  "O48Zm9ZWPxG4yiouRtdOeQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie D.", 
    "review_text": "This was a tough one for me, I really wanted to love this place. I wanted a large space for my friend and I to celebrate our birthdays, very laid back, chill, fun. And Dear Mom definitely hit all of those points. Also great location. So if you're a beer drinker that likes open space, games and fun, stop here and give yourself the 4 star benefit. If not, keep reading and see why it dropped to a 2.   First of all, the drinks were terrible. Not just a little watery or a little too strong, bad. My friend sent hers back, I quickly switched to a bottled beer and at least 3 friends had the same opinion. Even their \"specialty\" drinks were not well made. My Beauregard was bitter, overly strong and not at all tasty.   Second of all, the food was overpriced and bland. For bar food, I want it to be delicious or cheap. Doesn't have to be both. I'm willing to pay for something different, but this was bland pasta, bland shrimp and grits, crunchy stale cookies, and a nothing special salad. Not worth it.   Finally, we happened to be there on a freezing day and they would not, no matter how many times we asked or closed the doors ourselves, allow the doors to be closed. A number of friends left because they were too cold.", 
    "review_date": "2012-01-24"
  }, 
  "jsxNHAaLcHkkd3QYG5xSzg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adrian M.", 
    "review_text": "nice place, fairly easy parking by car, much easier parking by bike, as there is a space full of bike racks right out front!   Bartender was super busy, didn't look like he had much help.  It was kinda weird though, he was eating food from a bowl on top of the bar in between serving drinks and taking money. Like take a couple bites, serve some drinks, take a bite, etc.   drinks were good, average prices, but on our 2nd round of drinks we each had a bug in our glasses, so that was bad. Dude was very cool to take them back and give us new drinks in clean glasses though.   totally plus 1 star for having the Hella Vegan Eats girls making some really good food back in the kitchen there.", 
    "review_date": "2014-11-25"
  }, 
  "xpyElLYq-hHTA0VVQXra8w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Tracy F.", 
    "review_text": "First night and I'm already a fan. What a perfect combination...  with the backing of Whiskey Thieves owner, his two best bartender's Jay &amp; Oliver have started their own place. They bring the gift of making you feel welcome while Chez Spencer's owner/executive chef Laurent Katgely supplies the menu. The result: you have the perfect hang out spot where you you can get high-end bites. See you again at Dear Mom!", 
    "review_date": "2011-11-30"
  }, 
  "6_VkzelWeSHzjTVDlGl-Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "ATMOSPHERE Has ping pong table in the back! I think they put it away last time tho. Middle of Mission area, I've stumbled in here few times whilst on the drunken mission. har har. Otherwise, a spacious basic place for drinking.   11/1/13", 
    "review_date": "2014-12-13"
  }, 
  "Y6AnR_5l_RgdSM-GDsqRgA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trina M.", 
    "review_text": "I'm back in action ! Dear Mom....  - Hipster Bar  - Dim lights - Cash Only - 1 Pool table - Serves food - Wide selection of beer - Closes at midnight  HIGHLIGHT: Wednesday nights they have pickle back !! WHOA !! Can't go wrong with a shot of Jameson and pickle juice !! One of my most favorite drinks!!", 
    "review_date": "2012-03-09"
  }, 
  "F2_vU0hLpKMYhZG8X0Fztw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Queenie C.", 
    "review_text": "Convo with my co-worker on our way to Dear Mom:   Co-worker, \"I'm really glad that we have a place that's easy to walk to for a drink after work and we don't have to walk, like, 8 blocks to the Mission. They're not regular blocks either; we have to walk through the dirtiest part of the in-between to get there...\"  Me, \"Me too. It's a good change from the Double Play. Also, I was always afraid to go into the bar that used to be Dear Mom because it looked like one of those places where I wouldn't come back out...\"  So, yeah, Dear Mom is a welcomed establishment to the 'hood. The space is a lot bigger than I imagined and the design of the bar is optimized so that there are plenty of corner seats, which my friend explained to me is prime real estate (I did not know...) I started getting into whiskey last year so I'm excited that there's a wide variety here to try. They even serve food, so lunching here is most likely in my future.  I came in around 5:30, when it was still quiet, but it filled up pretty quickly come 7ish, and even when it did get really busy, the bartenders were still attentive and friendly. I've mentally bookmarked Dear Mom as a regular spot.", 
    "review_date": "2012-01-13"
  }, 
  "TlcOomCmGcPc6u-HzOq4dg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay M.", 
    "review_text": "+ Killer Manhattans, solid beer selection + Gourmet Chez Spencer hot dog in a hollowed out french baguette w/potatoes and salad for $6 + Large central bar you can ogle strangers across  + Great space, great booths", 
    "review_date": "2012-01-06"
  }, 
  "c2IcHHOTgQXf-9AA0DLLRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A A.", 
    "review_text": "Hire some bartenders you moron management.    Other than that comment, I liked this place.  Chill, away from the mess of Mission, and just a chill local bar.    Was peeved we went there on a Friday at like 6PM, was not busy at all, but enough for the 2 bartenders to be overwhelmed.  If your business is selling drinks, why wouldn't you try to be good at your business?", 
    "review_date": "2012-04-17"
  }, 
  "fxJcpYyCBgi61PtmlZXTjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina A.", 
    "review_text": "If you like Whiskey Thieves, Thieves Tavern and/or the Blind Cat (fka Dirty Thieves) but wish they had grubbin' food, way more space, a private room and were in Potrero Hill, this is the place for you! The fourth edition to the former Thieves trifecta is a very welcome addition with its spacious interior, pool tables, central bar with lots of seating and it's large private room which makes up for in communal beer-hall style seating what it lacks in a private bar. The food menu is classic pub food done gourmand-style, their bourbon/whiskey selection and knowledge of their bartenders about it is just what you'd expect, and their Manhattans and sazeracs are on par with the Whiskey Thieves - in other words, very strong and expertly made.  Why only four stars? Like their counterparts, this bar is CASH ONLY. A huge pet peeve of mine when I'm spending lots of money on high-end bourbon. Also, the night we were here for a long-announced private party with scores of guests, the ATM was out of order. Fail. Luckily, it's not a long walk to the Potrero Hill shopping center. Also, the women's bathroom has a very odd and IMHO unacceptable set-up: there's two toilets but they're only separated by a screen that you can see right through so no one is going to leave the door unlocked so a second girl (or anyone else) can let themselves in to use the second completely unshielded toilet. If anything, I guess it's good for facilitating girls going to the bathroom in pairs as they often do anyway. Still, installing real stalls would be a big plus.", 
    "review_date": "2011-12-27"
  }, 
  "3iefE-Wn9RKGmS78GdRiOg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christian A.", 
    "review_text": "This is a the perfect place a pirate party. They have the space where all your friends can get dressed up a like a pirate and party like rock stars...  The food is you typical bar food but over all it was fun. I am sure I will not be writing my mom to tell her what I saw.  I was caught of guard when the kitchen was all cash. So if you are hungry make sure to hit the ATM...", 
    "review_date": "2012-09-26"
  }, 
  "4ZaqBJqt7laPPs8xfWvr6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina M.", 
    "review_text": "Very fun, slightly \"hipster\" bar.   Came here for my friend's birthday &amp; had a great time.   There was ample room to dance and to sit (large tables in the back, booths, and barrels to plop down on - very cool!)  There is a counter where you can order delicious food items like gourmet hot dogs (see photo), cheesy potatoes, burgers, etc - YUM-O! Exceeded my expectations. CASH ONLY!  The only thing that could be improved was the sound quality/volume of the music. There was really only one place (by the photo booth/video game stand) where you could hear it loud and clear.   I will be back ;)", 
    "review_date": "2012-09-14"
  }, 
  "AGraTma9eEgsiJFDIy6tbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maile N.", 
    "review_text": "I cannot wait to come back here for fried chicken bao and beer!  Love it!  That's all I would have - ok, maybe a salad to be a little bit healthy, but the fried chicken bao is a MUST HAVE!  The ambiance is ok, a bar scene, sort of dark with big tables to enjoy your bao and beer.  They have a nice beer selection - that's all I need, really!  Go to the bar and order up and they will bring your food and beer cheerily.  Hmmm, when can I go to Dear Mom next?  :)", 
    "review_date": "2013-07-02"
  }, 
  "CZ36wJqV-Xit758UaOr81A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Bruce C.", 
    "review_text": "When you walk into Dear Mom your first impression is \"This place is SO Mission\". It's divey yet hip. It's industrial yet chic. It's, well, very hipster.   This joint is a fairly large open space with a pretty big bar sitting in the middle. With large tables littered all of the place, Dear Mom is a casual spot to grab a bite - perfect for big parties. Decked out with distressed wood, dark tones and little hints of color throughout (they have a few bouquets of fresh flowers), this place is screaming \"kickback\". Think of the ideal place to grab a bite with your closest buddies before hitting the town. That's exactly what Dear Mom is.   SHOT OF WHISKEY &amp; A 24 OZ PABST BLUE RIBBON ~ $8 ~ 4 stars: I thought this was a great deal. You get a shot of mid-shelf whiskey. Not sure what kind it was but I did see the bottle and it wasn't well. Usually a shot will run you $6-$8, at least. So it was pretty awesome to get a 24 oz Pabst Blue Ribbon on the side to enjoy after you main vein the whiskey.   THE BURGER w/ BACON, WHITE CHEDDAR &amp; FRIED EGG ~ $17 ~ 4 stars: The burger by itself is $12. After adding bacon ($3), white cheddar ($1) and fried egg ($1), my tab came out to an even $17. I love how tax is already built into their pricing - I hate carrying loose change. The burger also comes with a side of fat home fries. They were the perfect starchy compliment to my ultra juicy and delicious burger. The bacon, egg and cheese paired so well with the FAT burger patty. Cooked medium rare, it was the perfect burger to soak up any booze you plan on consuming that night. Served on a soft bun, pickled cucumbers and lettuce, this thing is a must have. I absolutely loved it. Excuse me for the slightly blurry picture. I was already buzzed. <a href=\"http://www.yelp.com/biz_photos/dear-mom-san-francisco?select=0eQ9L5oZpwvZINi1faTS8Q#0eQ9L5oZpwvZINi1faTS8Q\">yelp.com/biz_photos/dear…</a>  Everyone got the burger except for my friend Adam. He got the Sriracha Buffalo Chicken Sandwich. Although I didn't try it, I must say it looked and smelled amazing. He also scarfed that thing down in a flash so I'm assuming he dug it. A few other Yelpers have also given the chicken sandwich props so I'll be sure to try it next time.   Don't be afraid to pick your favorite tracks on their jukebox and play a game of foosball while waiting for your food.   Awesome place. Good food. Nice bar.   Dear Mom, I love you.", 
    "review_date": "2014-02-19"
  }, 
  "Y03E-SGURjA65yXvCYQtDA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff D.", 
    "review_text": "Great beer and great service.  The vibe is laid back.  There is always good energy, yet there is always a good place to stand and you'll get a drink quickly from the bar.  One of the best bars in San Francisco hands down.", 
    "review_date": "2014-11-03"
  }, 
  "n4JfQLR3ZyVhUizKCDgdLg": {
    "user_rating": 4.0, 
    "user_location": "Hanover, NH", 
    "user_name": "jack d.", 
    "review_text": "Got dragged here however, the food is very good, am always surprised about how much good food there is in the mission.  Other than the food, it's a bar in the Mission, if that's your thing, this place is great, if it's not, this place is not", 
    "review_date": "2012-08-22"
  }, 
  "scIyLRiFryYbzCcJG5l1Fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J. S.", 
    "review_text": "Great new(ish) bar in the Mission.   Let's just say this is not an undiscovered spot. A complete clusterf*#k. Wow the hipsters spread the word quickly.  I really like the place but it was slammed so it did take forever to get a drink. The bartenders were hustling but it was tough for them to keep up and I totally understand.  The lighting was cool and its nice to offer the pool and foosball table. On the Saturday I was there the music was a bit all over but who doesn't like to hear David Bowie back-to-back...maybe it's a juke box.   Drink prices seemed okay.   Next time I'm in the Mission I'll probably stop in.", 
    "review_date": "2012-01-09"
  }, 
  "qIDy9zJfCuqxy6A3exPe_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne C.", 
    "review_text": "I love the style of Dear Mom. It can get hipster but you have to expect that since it is in the mission. It's also kind of in the middle of no where in the mission so there is plenty of parking nearby. It is also cash only so be prepared to hit the ATM before you go.  They have picnic style communal tables and a very large bar on the left. I had my usual red bull vodka, but they have a wide array of beers and liqueurs. You can play foosball, pay the juke box to play a song.  Fun place for a big group.", 
    "review_date": "2012-12-27"
  }, 
  "UZPHtlRP3v6qM6hvMcQ0kw": {
    "user_rating": 4.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Casper G.", 
    "review_text": "Bar is pretty cool, however I will say this place has been getting a little bridge and tunnel over the weekends. I would recommend checking it out during happy hour or during the week. Super down to earth bar-tenders and AWESOME Bloody Mary's. The music is often shit during the weekend nights when the bros and bro-hoes roll through but during the mellow hours you can hit the jukebox and spin some sweet jams, after that you could hit the pool table. I love this bar, I think this place might be owned by the same peeps who own Thieves, next to boxdog.", 
    "review_date": "2014-06-29"
  }, 
  "TiPH2ZwSX53uK7IvFSHVYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily P.", 
    "review_text": "The chicken sriracha sandwich with potatoes were really good! They also had the fried potatoes bowl, watermelon, and etc. The edamame was decent but nothing too amazing. The best was by far the porkbelly bao...OMG perfect mix of crispy and juicy. I love sprouts that came with it. Ths servers here are very friendly and I always get the same white ale. My bf really likes the random specials they have too.", 
    "review_date": "2013-07-23"
  }, 
  "hIKZzXX_GExXe_NrHFXVMg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bradley H.", 
    "review_text": "Great spot, especially for a large group given all the space. Agree with other reviewers tha tthe music is a little on the loud side. I had the hot dog - it rocked!", 
    "review_date": "2011-12-20"
  }, 
  "DdVubY9qgnPZ9lhtjJOtWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat B.", 
    "review_text": "Fun spot. I love that they have food too. But this is a bar that has food, not a restaurant with a bar. Usually pretty packed, diverse crowd. Good location", 
    "review_date": "2013-05-30"
  }
}