{
  "WPBrjBbk76ZtZQ8QpG09cQ": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Henry L.", 
    "review_text": "Decent neighborhood bar, with a pretty cool jukebox, a \"bookshelf\", pool table, and interesting posters. The interior is pretty spacious, and the crowd varies. Everyone there is pretty normal, and generally everyone there is with a group, so this a good place to stop by if you have a small group with you.", 
    "review_date": "2014-03-10"
  }, 
  "7MO-6ny6ydqZe2RyEe1oLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam S.", 
    "review_text": "Cheap drinks, friendly bartenders and a chill atmosphere. It's small but cozy and I love any bar that allows dogs.", 
    "review_date": "2007-09-29"
  }, 
  "AcIahYYgwMKBxLg0cMZMLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanie F.", 
    "review_text": "Dovre Club feels like home.  I look over and have to doubletake - is that my uncle Rob?  Is that my old neighbor Margery?  No, but they could be.  This is not the upscale faux Irish pub, but the real thing, and I believe it was popular with the Irish crowd way back when, when the Mission was packed with big Irish families.    When I am homesick, I visit Dovre.  I have a Guinness. Then I call my mum.", 
    "review_date": "2007-12-06"
  }, 
  "ti4lRf8rv9KICw6msOJT0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ameer N.", 
    "review_text": "where else can you plop 'hey jude' into the jukebox and have 1/2 the bar singing \"nahhh nahh nahhh nah nah nah nahhhhh\". sure, lots of places. but this is definitely one of them.  $2.00 pbr all night for me.   and there's books to read if that's your desire.", 
    "review_date": "2010-02-26"
  }, 
  "rk3deA0rPWqjH5ylNK2y4g": {
    "user_rating": 4.0, 
    "user_location": "Carmel by the Sea, CA", 
    "user_name": "Clyde R.", 
    "review_text": "Hanging out at the Dovre Club Friday night, I was half-expecting Sam Spade to walk in at any moment to order a scotch straight up, no ice.  Sam didn't show up, but I had a great time at the Dovre, a small neighborhood dive bar in the Mission District with great character, friendly bartenders and patrons, and reasonable prices.    The bar is small and divided into two rooms: the first room by the entrance features a wooden bar table that wraps around into the next room where there are also some tables, chairs, and a pool table.  It's a simple set-up. But simple and dive bars go together.  I got to meet one of my favorite Yelpers at the Dovre, Tom R., who puts together the dive bar meetup groups in the Mission District. Tom's awesome, just as his reviews indicate.  And, those at the Dovre were an eclectic mix of people who were friendly, funny, expressive, bohemian, artistic, smart, happy to meet others and have a good time.   There's nothing like standing shoulder to shoulder with some good people sharing drinks, stories, and good times in a relaxed, down-home, unpretentious dive bar setting.    Tom R you are the real deal, a true Mavin a la Paul Revere calling the local townspeople in for drinks and good times. This is Community Action....!", 
    "review_date": "2009-08-16"
  }, 
  "LPKqLViZjptqfkQEKEXw4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jb O.", 
    "review_text": "I adore this place and call it my neighborhood bar despite the fact that I live in the Haight. I've been kind of reluctant to review this place, since I'm selfish and want to keep this bar to myself and the rest of the cronies that frequent the place. Everyone there that I love, which are about twenty people, have always made a night there a good night. Many of which I can't really remember.  I even met my husband there. Who ever said you can't meet Prince Charming in a dive bar?.", 
    "review_date": "2007-08-29"
  }, 
  "2AOUvDvG7rvAX1hLI5QZKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kelly M.", 
    "review_text": "I am happy to say this actually is my neighborhood bar. Its a block away and I can stumble my ass home after strong drinks and cheap beers. I can go with 10 people or I can wander in alone and always find someone I know from my block. This place is a dive bar at first glance.....Billie Jean the pitbull chilling at the door, old soul or 80s coming out of the jukebox, bags of chips for drunk snacking, but it's better than just that. The bartenders here rock, they remember you and your drink, they're super nice, have great stories and are funny. I like that on most nights I can count on: strong drinks, a bag of cheetos, seeing my neighbor, getting hit on by a guy who can barely stand and then stares awkwardly as he catches his balance, fun shit people sing along to on the jukebox (which is not always a good thing as I heard Fat Bottomed Girls last like 3 times yesterday in here). Chill ass place to play some pool and chill. Gay, straight, weirdo, whatever,...all welcome here. Love it.", 
    "review_date": "2007-09-09"
  }, 
  "60iCXLkb9xqhe5cvEun0kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher K.", 
    "review_text": "Dovre is a classic dive bar.  The dark lighting keeps the furniture looking clean and you looking good that crazy guy talking to himself down at the end of the bar.  The dark lighting also helps keep the falling-down drunk guy across the room attempting to focus on your face rather than actually falling down.  Key features of this bar include: * pool tables with league night * a meticulously curated jukebox (at-the-time-of-writing features Old 97s!) * a free book exchange (at-the-time-of-writing features The Da Vinci Code!)", 
    "review_date": "2008-12-22"
  }, 
  "SIcz9tmyUGlZtiaa39fBsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon P.", 
    "review_text": "After a fine meal at GFC, stopped in for a couple beers before calling it a night.  A little nervous approaching the swinging doors, door swings in like a saloon and we find cold beers, lots of Irish stuff on the walls and plenty of places to take a load off.  Exactly what we were looking for.", 
    "review_date": "2006-01-26"
  }, 
  "5oMVpkSdEhqfjiVmrGUe9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan M.", 
    "review_text": "great establishment  ,, . best guiness hands down,,,", 
    "review_date": "2010-11-11"
  }, 
  "HshIhF76Uea0-2ht_KUisw": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Christine M.", 
    "review_text": "This is a dive, as in, leave your push-up bras, Kate Spades and stilettos at home.  My ensemble of choice consisted of slightly stained sweat pants and a hoodie.  You don't come here to a lure a potential mate, you come here to drink. That said, this is a great place for some good tunes via the jukebox and a few games of free pool.  Oddly, for being what it is, the beer list is slightly lacking; however, the mixed drinks carry quite a punch.", 
    "review_date": "2006-12-11"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "Exactly what you'd expect from a neighborhood Irish bar.  Smallish, yet comfortable.  Not overdone in that \"look how Irish we are!  It's like you're in Ireland, we're so Irish!  Do you think we could put more Irish stuff somewhere to make it feel more Irish?\" sort of way you find at far too many \"Irish\" bars in SF.  No - at Dovre, it's subtle in a way that makes you believe it.  Good basic beer-on-tap selection, plenty of nice warm wood in the walls and over the central bar, a pinball machine, and a pool table on the far side. Dovre is a place to relax with friends, especially if you live just down the street, enjoy a pint or three, and chill.  It's not raucous, and it'd feel wrong if it were.  It's comfortable. And to those calling it a dive - I respectfully disagree.  El Rio is a dive.  Dovre is your best friend's place, and he serves booze.", 
    "review_date": "2006-12-15"
  }, 
  "smx4hf_nkWhFklxLwfGLjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trav W.", 
    "review_text": "Dovre Club is a real dirtbag's paradise, so naturally I feel right at home here. It even looks enticingly seedy from the outside. Actually they've got books in the bar for your reading pleasure, so it's a little more highbrow than your average s-hole. Good tunes, cheap beer and mouth-wateringly large shots. And I mean \"mouth-watering\" in that \"Uh-oh, I think I'm gonna throw up\" juicy mouth sort of way.  Quiet by bar standards and out-of-the-way by Mission standards, the Dovre is a nice neighborhood place to puke n' rally.", 
    "review_date": "2011-11-19"
  }, 
  "k0-JeLPVuBkQfu_MY_Oqww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregg M.", 
    "review_text": "A Jameson neat at Dovre while watching football (the real one !) ... what more can you ask. :-)", 
    "review_date": "2010-09-15"
  }, 
  "XwMMH25aOYBec9o7MeOOqg": {
    "user_rating": 3.0, 
    "user_location": "Alexandria, VA", 
    "user_name": "Rawley V.", 
    "review_text": "Superb jukebox, chill and neighborhoody.  Would be 4 stars if they'd re-invest some of the profit off those $5 pints.  A dive would have cheaper beer; a \"good\" bar would have a cleaner bathroom.  Dovre, please decide.", 
    "review_date": "2008-01-02"
  }, 
  "r0N7ck7_quS_kvh9JEmfWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul A.", 
    "review_text": "Met a girl here with a mother of pearl dragon inlaid into a black pool queue. She then won 5 out of 9 games and I had to do a car bomb (Irish whiskey shot dropped into a pint of Guinness for the millennials) after each loss. She won 5 straight as I recall. She threw me into a cab, took me to her bed, made me some soup, and tucked me in. So, you meet some interesting girls at the Dovre.", 
    "review_date": "2014-11-09"
  }, 
  "n4IepFnHiVuvLcGc35zjtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gustie L.", 
    "review_text": "A bar, a large, rather Irish bar --- yet it is inifinately better than Cloony's.  One could describe it as an Ur bar, elemental in its barness.  The Dovre has many bar activities: A nice (currently Twilight Zone) pinball machine, A solid jukebox (Irish Folk, Supertramp and Elliot Smith), a pool table and the infamous bar touch screen video game system.  Also drinks are reasonable and bartenders (frequently the guy that owns the place) are skilled and friendly.  There is nothing much kitschy to look at and ever since the pin vending machine got broken nothing remotely hipster to upset those whose feeling are hurt by the phone booth.  The clientele is very neighborhood, with the occasional sad shot-drinking group from the funeral home across the street.  Strangely the Dovre is also a long time politics bar, or at least it used to be, I haven't seen many of the SF populist types in here of late though.  Edited: 1/28/08 -- Just need to reiterate my love of the Dovre, again.", 
    "review_date": "2006-09-01"
  }, 
  "HpBvzMzchFrJ6XJmtRIsMg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Callie K.", 
    "review_text": "Nice. An unpretentious non-hipster reasonable low key dive on Valencia. With a solid jukebox.  I'll take it.  Oh, and a 7 minute walk from the 24th St./Mission Bart station.  Just remember, last train for the East Bay leaves around 12:15 AM. We forgot. Somehow it's fine when you're planning on missing the last train, but when you're running to catch it and you don't it can sometimes ruin your night. Welcome to a $45 cab ride and and a 20 minute argument about whose fault it is that we missed the last train. A one way ticket to bummer city.", 
    "review_date": "2009-03-01"
  }, 
  "3_FKjtRXuVqGOPiEalOIsg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cooper M.", 
    "review_text": "i came here to see what the hub bub was all about, well kind of, actually i decided to see what the sf dive bar group was all about, they do a different dive bar every other thursday, so i found out that the Dovre was the place to be, I got here at 8, fairly crowded, lots of construction worker types, drunks and your regular miscreants. I made my way up to the bar and ordered the standard, Capt and Coke. hmm, fairly light poor, but then again i'm not a local. So i ease on over to the juke, CD's not DL so thats a plus, they did have a pretty good selection from Tom Waits to Fugazi. NIIIIIIICE, my kinda stuff. So while sitting at the bar i start talkin to a local, tells me some of the history of the place, and once your golden here you stay that way. (Apparently he gets 86'd every now and then) So i have prolly 7 or Cpt's, all light on the pour, cept for the last one as maybe the bartender got the hint as i was downing them like shot of water.  -hey if you know me, i tend to drink fast, all night. After people watching for a bit, to see who are the DB folks, i see that well maybe because it was a \"Christmas party\" they aren't too keen to talk to anyone but their own group. One guy in particular seemed to enjoy snubbing the locals, LOL, what a tool. anyways I digress, So i said hello and goodbye to the gent who organized it (Dicky) and headed back to my usual haunts.  Dovre is A-OK in my book, a bit out of the way, but worth the trip.", 
    "review_date": "2008-12-21"
  }, 
  "TzVKEIW46exGDGAjc5amTA": {
    "user_rating": 2.0, 
    "user_location": "Washington, DC", 
    "user_name": "N S.", 
    "review_text": "When you say \"last call\" and then someone says \"I'll have a gin and tonic,\" you can't just say \"Sorry, i just made last call.\" Yes, you did just make last call, however the whole point of last call is to allow people to make one last drink order. It wouldn't have troubled you that much to pour one last drink, which as it turns out, would have been my first and only drink for the night. No there were not a ton of people waiting around us and it would not have created a \"me too\" phenomenon. You may not have done anything wrong I suppose, but you just didn't do anything that cool either. This probably should be a one star review but whatever.   This is something I've noticed about the city of San Francisco. For all the bad rep that the east coast gets, I have found that overall the people who work in the service industry in SF are far more douchier. Perhaps they've realized that they can treat people like shit and still get the same 3 buck tip on a 10 dollar order. In some ways, I think they are right.... I mean, this is probably because I spent years working as a waiter so I always give them the benefit of the doubt. A waiter/waitress/bartender has to pretty much beat my groin unmercilessly not to get at least 20%.", 
    "review_date": "2008-11-01"
  }, 
  "eurIEcpGa_tTi1LMWa1pUA": {
    "user_rating": 4.0, 
    "user_location": "Lufkin, TX", 
    "user_name": "Wes T.", 
    "review_text": "I don't really see what's not to like in this bar, except for personality issues with staff. Being that Dee the bartender was nice to me, I like this place.  The drinks are reasonably priced, and they have a nice happy hour special. There's a lot of space in the bar area, and they have a pool table on the other side. I like the layout of this place.  This is kind of a no-nonsense bar. It is divey, and being in the Mission, it will fill up with hipsters on weekends after 9PM. Expect lots of skinny pants and cigarettes outside.", 
    "review_date": "2009-11-09"
  }, 
  "ghRwENzjazf5b94m5ga5NQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth G.", 
    "review_text": "I like this place and I like its friendly and interesting bartenders.  I also fancy the canine patrons that tend to frequent this comfy bar.  Sweet jukebox too.  What more can I say?", 
    "review_date": "2006-06-14"
  }, 
  "7fvNQNjSw4ieblOZyZ58Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rachface -.", 
    "review_text": "dive bar afficionados flock here for the cheap drinks, good jukebox and charming bartenders.  smokers are welcome and the couches are comfy.  come here for your last drink of the night", 
    "review_date": "2006-07-31"
  }, 
  "WRGJX46lHlSxrVCA0iWNnw": {
    "user_rating": 3.0, 
    "user_location": "Nashville, TN", 
    "user_name": "leslie a.", 
    "review_text": "i'm not a big fan of valencia street nightlife nowadays -- too many wanna-be hipsters coming from elsewhere on weekends. so even though i go out a lot, it's rare that it ends up on valencia street.   this friday, though, a friend an i went to find a place to have a drink and catch up. we started at martuni's, which was overrun by people who apparently had come right from work, in their black jackets and skirts. then we tried amnesia which was too crowded, and then the phoenix, where after ten minutes at the bar, the bartender hadn't even glanced our way, and there were drunk squealy girls next to us that we knew we'd have to get away from.  so we got back in the car and headed back toward my friend's neighborhood, when we saw the dovre, with a parking place out front, and said to ourselves... bingo.   good call. it's a totally no-pretense neighborhood bar. no decor. no booze showing on the back bar because it's open to the other side of the room where the pool table is... but friday night, there was a wedding party there. bride in a long white dress, groom with a flower on his lapel, and all their friends having a blast. damn, a dive bar with a wedding reception going on? that's what i'm talking about!  it's not your frou-frou cocktail place, that's for sure. it's also not a pick-up place, though i bet you could meet some characters there. and the jukebox was awesome. prince and hank williams and tom waits. we'll definitely be back.", 
    "review_date": "2009-04-05"
  }, 
  "N4_TkjvXk7N-XPdVqttCFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa A.", 
    "review_text": "I'm not sure why, but I like this bar. The crowd is pretty diverse, meaning that it's a neighborhood bar that you don't have to get all dressed up for or worry about fitting in. There's not a scene, just people enjoying a few cocktails.  The few times I've been there, the bar staff was friendly. I'd rather go here on a Saturday night then anywhere else.", 
    "review_date": "2007-10-26"
  }, 
  "sx64BpoAn-Q2in04Pk5Lhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott M.", 
    "review_text": "Good dive bar, close to my house. The jukebox is a bit lacking (I spent a good 5minutes trying to find 5 songs to play), usually a couple of drunk pool players hanging around, waiting to whup all comers at the table.", 
    "review_date": "2005-06-17"
  }, 
  "akcAEHfAwx4bkez02JVsdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek K.", 
    "review_text": "1st gotta thank the person who kicked off the night yesterday with born ruffians, kidda, and arcade fire on the jukebox.  This is a chill spot to hang out with friends.  Also, they have a pool table and are dog friendly.", 
    "review_date": "2011-06-18"
  }, 
  "xfAteb-Mah0PKewUKZtNXQ": {
    "user_rating": 1.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "John B.", 
    "review_text": "came in late for a drink and got turned away and scolded by the bartender for not being there while he  was alone for 3 hours earlier in the night.  I'm not in charge of bringing people in.  but when a few thirsty people come in for a drink at the end of a slow night maybe serve them and make some money.  wont be back ever even though its around the corner from my house.", 
    "review_date": "2010-10-25"
  }, 
  "nVwyhZ6f5F-rcK78A1ILtA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Cee cee R.", 
    "review_text": "I like the energy of this bar!! Cool local people and the drinks are super cheap. We ordered two beers and two shots and total came up to 20 bucks. You can't beat that. They also have a juke box that has a large selection of music!! Will return", 
    "review_date": "2015-01-17"
  }, 
  "oSovOkH1cI9DlSl-s7BAQg": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Andyman S.", 
    "review_text": "I love the Dovre.  I miss the Dovre, so many miles away.  Filled with regulars, this is my kind of place, and my home away from home (The Horse Brass) when I'm down south.  Cheers to Elvis.", 
    "review_date": "2014-11-24"
  }, 
  "T_faaeeI2rvrAE5-eXR4_w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alia M.", 
    "review_text": "Dovre, Dovre, Dovre.  Home away from home, my \"third space,\" and the place I'm most likely to find my fiance on any given night between 6 and 7 PM, aka happy hour-- which isn't totally necessary as the drinks are already way reasonable.  This is the best possible bar to have within crawling distance of my apartment, and I love that I so often run into friends and regulars there.  It gets pretty rowdy and crowded on the weekends, which is great, but my favorite time at this place is any given random weeknight, especially when it's rainy and cold and the bartenders are nice enough to make me (several) hot toddies.  They've recently added a \"free book\" shelf-- picked up two gems just yesterday-- which pushed my geeky love for this bar way over the top.", 
    "review_date": "2008-12-15"
  }, 
  "EmC10KU7K5ZTZKdksfznMg": {
    "user_rating": 5.0, 
    "user_location": "Ventura, CA", 
    "user_name": "Terri M.", 
    "review_text": "this place feels like home.  let's count up the stars for this place, shall we?  awesome bartenders--star. excellent juke-box--star.  happy hour--star.  friendly crowd--star.  cheesytouch-screengamesthati'llonlyplayafteracoupl­edrinksbecausei'mself-consciousaboutstaringatneked­folksinpublic--star.  occasional potlucks--star.  AND it's right around the corner from me--double-star.  i think that makes for a grand total of eight.  sadly, yelp only allows five.  but seriously, great place for a low-key night.", 
    "review_date": "2011-05-19"
  }, 
  "n8aIAWT3f87eszrvFMNYvw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Grizelda F.", 
    "review_text": "Best dive bar ever! There's nothing you can't get here. Great drinks, good convo, good pool, even a good mate.", 
    "review_date": "2014-11-24"
  }, 
  "tdy_9y5Hgp0LWX3KF8CowQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rikki D.", 
    "review_text": "I mean, talk about a dive. I have only ever been at like 2pm on a Sunday. Good for a beer and a shot. Totally random.", 
    "review_date": "2009-03-17"
  }, 
  "ZGBaby3K0ye7msmgut45AA": {
    "user_rating": 5.0, 
    "user_location": "Berlin, Germany", 
    "user_name": "Atousa A.", 
    "review_text": "Elvis and Brian make STRONG drinks.  Be prepared to drink it with no complaints or else they'll call you a pussy.  D is an awesome bartender.  She's SUPER sweet and makes fantastic shots.  Jukebox is ok, the pool is only 50 cents, you can smoke inside, Toad's is across the street and Wild Pepper is a block away.    Awesome place to go with one person or a big group.", 
    "review_date": "2006-08-23"
  }, 
  "LhdIGJbwAgfslLaruuQq3A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rebecca P.", 
    "review_text": "Magical things happen at Dovre Club, like: I got into my first bar fight, one of my girlfriends pinned me to the floor and made out with me on her birthday, and I found a North Face raincoat in my size squished between the couch cushions. I'm not going to list the even more magical things because I might jinx it, which would be terrible.", 
    "review_date": "2011-12-06"
  }, 
  "XHuNSjrPA3Vyi7n4iVhZaQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "I'm a dive bar kind of girl so I was excited to visit the Dovre Club. Unfortunately, I went on an off night -  I felt like I was crashing some body else's party. And don't get me started on the obnoxiously drunk gentleman who kept screaming \"Woo\" every 5 seconds.  I'll try this place again on a weeknight.", 
    "review_date": "2005-07-04"
  }, 
  "Zn6_1t5LujJZLkkMOBgntg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachelle P.", 
    "review_text": "Pear Cider gives you the grossest breath.  But I guess that's what I get for ordering a Pear Cider.    This place is a dive, which is cool, and which I like, but it was a boring dive.  There was nothing going on that made me intensely want to return.  Three stars for letting me watch the Food Network Channel.", 
    "review_date": "2012-01-30"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "This is a super chill bar, frequented by Irish men and locals with dogs. Two of my favorite things, served alongside booze! Steph is an awesome bar mistress and is always quick with a smile.", 
    "review_date": "2008-12-19"
  }, 
  "oJ6bb4wnKCNT8v4U53FzFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katelin H.", 
    "review_text": "Considering the only people that laughed at me when I fell flat on my face entering the Dovre were my friends, I'd say this place is OK by me. They make a mean Irish Car Bomb, have a sweet Jukebox, and a candy machine that has little indie punk rock buttons. Woot. Real people, real drinks, and real Irish blokes. What more could you ask for? (Cept maybe a little tidy up in the restrooms, please...)", 
    "review_date": "2006-01-26"
  }, 
  "UTE4vlM3JjfP48-HbxK08w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sherry K.", 
    "review_text": "Walked by this awesome gem of a dive bar SO MANY times over the years, and finally went in last Friday. Divey, friendly bartender, good stiff drinks at a reasonable price. The power went out after we got our drink, and it was really fun! A kindly patron went out and bought candles, and it was cozy and a nice change of pace. Will definitely be coming back.", 
    "review_date": "2015-01-30"
  }, 
  "83wHDpKcaNYlBHiLXfEiEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emma S.", 
    "review_text": "I recently moved to the neighborhood and decided to check out this bar last night.  Not too crowded, we quickly made friends with the bartender who has worked there for 8 years!  I had an incredible drink made with Seagram's Sweet Tea flavored vodka (a new discovery!) and we happily stayed there several hours.  The place also had an incredible jukebox with everything from David Bowie to Snoop Dogg to MGMT.  The bartender said that him and another employee go to Amoeba every month or so to pick out new music.  I love this place and will definitely be back!", 
    "review_date": "2009-10-02"
  }, 
  "m5cBT7OYfn0HM0d-RCsdZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miika M.", 
    "review_text": "Ready for some groping, eyeballing, and acts of strangeness that may/may not hinder your thirst?  Dovre is the place for such moments of libation.  During a bar crawl, I snuck in behind several male counterparts and the haggard and strong ambiance of this bar hit me as well as the people there.  No need to dress up for this place.....locals and regulars are what make this bar a hot zone.  The bartenders (both male that night) were quick with the drink orders and I seriously thought my gin and tonic lacked the tonic.  I felt woozy after three sips.  Some odd thing was going on where I could not figure out if the couple was drunk and dancing, or just drunk and moving about in some strange snake-like fashion.  Then again, it could have been the shadows wisping about in my somewhat loose stupor.  If it were not for the males around me, I probably would not come here alone, but with a group of friends, this bar rates a 4 stars in my book.  I left feeling lighter and definitely with memories from all the people-watching from my little corner.", 
    "review_date": "2006-10-10"
  }, 
  "nqypNPoiczjrxHYqy44nfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cathy H.", 
    "review_text": "Classic Irish Bar with a strong local neighborhood contingent even during the weekends. The second room that houses a pool table appears to be an expansion of the bar, and the place is comfortably roomy. The attraction is by far the staff and beer. The music is really just background noise and not the sole attraction like other Mission dive bars (i.e. Casa Nova or Beauty Bar on the weekends). If I lived in the neighborhood, I would encourage people to meet me here to decompress after a day of hard work.", 
    "review_date": "2007-09-09"
  }, 
  "Kdz_RA7T1pCh9UexU-Laaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice S.", 
    "review_text": "I've heard the Dovre referred to as 'a second livingroom' and I agree.  Whole-heartedly.  :)  Maybe it's because my friend bar tends there and maybe it's because now I feel like I can go there any time and be treated like a regular (hmm, perhaps that's a bad thing).  But, I think what I really like about that Dovre is that if I don't feel like being at home (alone) and all the usual suspect friends are busy, I can hit the Dovre and feel like one of the family.    That's a nice feeling.  A \"5 star\" feeling.  There's always someone who likes to chat sitting at the bar and they have plenty of Bowie goodies on the jukebox.  If Dee is working (can't miss her bright red hair), I recommend getting a dirty martini.  She makes the best!", 
    "review_date": "2006-12-11"
  }, 
  "Or-5choooobXikcd02etTA": {
    "user_rating": 5.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "Danyell K.", 
    "review_text": "This place was a splendid find! After a decent dining experience across the street at Toad's, a co-worker and I walked over to Dovre and discovered heaven in bar-form.  The bar is unique. It's a REAL Irish bar...not a touristy clover-stuffed joint.   There are comfy couches in a side room surrounding a classic pool-table, with crazy-unique art on the walls. The bar itself is neat as it is divided by the two rooms with a window in the middle so the barkeep can serve both sides.  The beer selection is decent, the prices reasonable. The ATM fee is $2.  I'll be back.", 
    "review_date": "2007-12-21"
  }, 
  "36LgEtwt6ROhrCtuPjfRmQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Shayna N.", 
    "review_text": "A good sized neighborhood dive bar with beer, liquor and pool.  Our housewarming party got foiled by noise complaints from the old ladies upstairs.  We managed to successfully funnel 40+ of our drunk friends over to the Dovre Club. It was a freakin' blast!  I attribute the fun more to the company than to the bar itself, but THANK YOU Dovre Club for providing the perfect escape from our crotchety old upstairs neighbors.", 
    "review_date": "2007-11-16"
  }, 
  "lJ6XPasUHaSDvIkonzQ7oA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "eric f.", 
    "review_text": "not the most exciting place... but... FREE POOL.", 
    "review_date": "2010-08-15"
  }, 
  "vpK9ef7L85Zl0wAwCdb4yQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes H.", 
    "review_text": "Great little divey Irish bar.  Some of the best pints of Guinness to be found in SF.  Pool table in the back room.  Pretty decent jukebox.  This place wears its politics on its sleeve (Irish Republican anti-Brit posters and memorabilia) but I've been here with British friends and they've never gotten any attitude.  There are occasionally rambunctious dogs allowed around the place.", 
    "review_date": "2011-03-17"
  }, 
  "rMVXoEPm5gzfFfW8Ig1GkQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Soul E.", 
    "review_text": "Dear Heidi,  You're a fucking idiot if you went to this bar to use wi-fi. Also, you're exactly the kind of person who I pray to god never becomes a local here. I've been drinking here for years, and with the times comes new faces, but yours can go fuck itself.", 
    "review_date": "2008-11-06"
  }, 
  "3FAb-ch2K3K9uQz7N49ITA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Light Bulb J.", 
    "review_text": "The drinks are strong.   The people are not hipster assholes.  There's pinball, pool, and...  NUDE PHOTO HUNT- 25 cents a game, funny, laid back entertainment.   I've never seen this place get too crowded, and I've always had an excellent time.", 
    "review_date": "2009-04-19"
  }, 
  "2pBmUTpG-ckHwMsUvYN-Jw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D J.", 
    "review_text": "This is an ok bar with a great jukebox. The prices are cheap and the pool table is  nice. I used to come here to shoot a game of pool, play some good tunes and drink some cold beer. Sometimes the regulars could get a little territorial, but thats kind of expected in a dive. Not my favorite place, but it is bearable at times.", 
    "review_date": "2008-03-20"
  }, 
  "5JBUr02Eemexu4f3nVIRvA": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Andrew C.", 
    "review_text": "I'd love to give a well-rounded, all encompassing and well thought out review of the Dovre Club, but I can't because while I was there, I was in the middle of a war and taking on friendly fire. The bombs came in the form of decent sized shot glasses filled to the brim with sweet brown nectar. My friend Cody was on a mission to put as many paid-for shots of Jameson into my hand as possible and when that sort of onslaught occurs, how can you say no?  What do I remember? Umm... Walking in. That was nice. There's a juke box. I'm pretty sure that was nice. The bathrooms.... no clue. I imagine they were nice in my head, though. I'd tell you the bartender was top notch too, if I had ever ordered my own drink for the few hours we were there.   No complaints to start, and no complaints when my judgment was walking funny. I'd say that's a good sign.", 
    "review_date": "2009-09-28"
  }, 
  "aipoRF-bcAF_EJh6ZMwH6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Z.", 
    "review_text": "I always assumed this place was an Italian social club, because \"Dovre\" means \"where.\" I dunno, you get the picture. So one day my roommate and his friend invite me to a place pronounced \"the Dover Club\" and our conversation goes something like this:  \"Where's that\" \"Just on the corner, right there.\" \"Oh. You must mean DOVRE\" \"Um, no, it's pronounced Dover\" \"No, it's Italian, right, isn't it DOVRE\"? \"Um. No. It's Irish. Look.\"  And I see evidence of this being an Irish pub all over the outside, such as a clover-shaped neon Budweiser sign.  ==================================================­===  OK, so I said I'd write again after I've been here a few times. The bartenders are really friendly, the beer is reasonably priced, and the pool table costs 50 cents. Bonus half-star for the night I came in when a pair of dogs kept sitting on the bar stools. This place is my official neighborhood bar.", 
    "review_date": "2008-03-11"
  }, 
  "kXOaOpAaAd1pRdaLOUM4Fw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "E C.", 
    "review_text": "Favorite bar in the mission. Mellow, good happy hour, completely unpretentious, friendly but overly so, Irish but not overly so, divey but not overly so, and best of all it's rarely crowded.", 
    "review_date": "2011-05-28"
  }, 
  "mj2wCBzx7RtoL4J2m0xu4Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shadi m.", 
    "review_text": "Neighborhood dive bar. Cheap drinks, nice bartenders, pool table, and always see a face in there that I recognize. It helps that a hand full of friends live within 2 blocks of the place. I would say half the time I end up in the mission after a night of drinking, I stumble into the Dovre at some point. It's either that, or getting the first drink before heading out.", 
    "review_date": "2008-10-23"
  }, 
  "Q2Iest8oggBub6nVBFEcNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes M.", 
    "review_text": "Ah, the Dovre Club.  I remember when they got kicked out of the Women's Building on 18th St...ol' Paddy Nolan would be rolling in his grave.  (And by \"remember\", I mean read it in the newspaper article framed on the wall here.  Now that would have been one cool spot for a pub).  They're also known to throw a St Patrick's party so hot it just about burns the block down (now that I *was* around to see--and a mighty big cloud o' smoke it was...)  Most of the time, though, Dovre Club is just an unassuming, rather shabby Irish Pub that the hipsters haven't yet seen fit to colonize.  Despite the authenticity, it's not that full of Irish either--at happy hour it was just a bunch of locals enjoying their cheap drinks and chatting it up with the bartender lady.  I'll definitely be back to toast the final defeat of the British (and of my ancestors, the Ulster Scots) in Northern Ireland...I'm sure Paddy would want drinks to be on the house, ya?", 
    "review_date": "2008-05-14"
  }, 
  "We9qK9M-oI6LUULbQo_InQ": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "angela n.", 
    "review_text": "Our group of six took over a couch here a couple nights before Christmas.  The bar had a lit-up tree, but happily no holiday music. Instead, the jukebox played classics by Prince, Tom Waits, Elvis Costello, and the Clash.  I could chat comfortably with the friends sitting next to me, but it was too loud to hear the rest of the group. One friend loved that a Stooges song was playing (which I learned after feeling my phone buzz from his Facebook post -- since the Stooges were so loud I couldn't actually hear him).", 
    "review_date": "2010-12-28"
  }, 
  "JmItCh53c-ZXNarntuqHqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric M.", 
    "review_text": "WTF!  As a smoker, I always knew when I went to the Dovre, I knew that when I wanted to light up a Camel, I didn't have to step outside.  I went last night, and much to my dismay, Found out you can't smoke inside anymore.  After talking to the bartender, I found out that they had receive some 300 citations for smoking inside.  After further inquiry, I was told the bulk of them was on Saturday night(Amateur Night) People who don't frequent this homey dive bar were complaining about the regulars having a cigarette while enjoying their drink.  That's lame!!  If you don't like the smoke leave, don't narc out a place you'll probably never return to.  It's is still one of my favorite spots, but it's lost some of its charm.  If the smoke offends you go back to the marina and stop slumming in the mission.", 
    "review_date": "2007-01-16"
  }, 
  "oBeu8CPl9c1gZ4JoG3diiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lenny K.", 
    "review_text": "One of the last real mission outposts. Unpretentious,  no douche bags and awesome bartenders. Long live the Dovre Club!!! If you haven't been here before. Stay OUT!!!", 
    "review_date": "2014-06-22"
  }, 
  "9GCCoFw_UHiAHjZ4kygHgw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren V.", 
    "review_text": "dude working there tonight, you were cute!!!thanks for the matches  need more places to sit though :/", 
    "review_date": "2008-07-03"
  }, 
  "yvr3BGnQVzACGtMw-ucKiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mingus R.", 
    "review_text": "I don't utilize this spot enough, considering it's proximity to my place. Old habits die hard I guess. Nice prices and a pool table make it worth stopping by. Besides who wouldn't want to buy a drink from a real Irishman named Elvis.", 
    "review_date": "2006-01-31"
  }, 
  "U-7EVbeRf1wlSZfHW_gujQ": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Kim M.", 
    "review_text": "This is like a grungier hole-in-the-wall (HITW) version of Cheers - where everyone knows your name.  I'm not from San Fran or anywhere in California, but I went back to this bar hours after leaving ... and the people there - both workers and patrons - remembered me! Hah. What a friendly bunch. :)  Dee was the \"day\" bartender. She was a hoot! So friendly, playful, helpful, and fun! I would definitely go back to visit her. These are the kinds of bartenders that make these kinds of HITW dive bars special. ...Stereotyping? Maybe. But whatevs. Dee is awesome.  This is the place to get your fernet on. Dovre popped my fernet cherry! This is the place where I was first introduced to this minty black licorice drink. It's not exactly minty, but it did leave a menthol-like finish in my mouth. And it's pretty dark in color and almost syrupy. ...Only at a place like this would I try something so bold and scary-looking like fernet. Hah. (TGF HITW bars like the Dovre.)  VERDICT Go for it. If you're any sort of dive bar enthusiast as I, you will quickly become a Dovre regular. No joke. I was only in the area for a day / night...and I felt right at home!", 
    "review_date": "2013-11-02"
  }, 
  "q4yMVuGp1JZW1n2eSleEvw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi P.", 
    "review_text": "Two stars lost for two lies.  THIS PLACE DOES NOT TAKE CARD! Yelp said it did.  It cost me $2 at the ATM to believe yelp, but I guess that is more a bad review for yelp than for the bar.  But they have an ATM, so relatively chill.  Also  THE ROUTER IS BROKEN   I called and asked tonight for the election.  I wanted to be able to look up details on my laptop at the bar.  If I couldn't that was chill I was just not going to bring my laptop.  The person who answered the phone at the bar as of about 5 pm said they had wifi.  The bartenders and associates said they didn't as of 7 pm or so - the router was broken.   In the last 2 hours? really, no, they just lie.  The drinks were good, the layout was good, the bartenders seemed awesome, but I can't give them more stars because of the  two above lies.  This place would be a four to five star bar if I didn't feel personally misled.  I'm definitely going back.    But because I am so excited about Obama, I give them stars. But I need to remember to lower yelp's rating ....", 
    "review_date": "2008-11-05"
  }, 
  "-fqqS4erqvQmU2VkaPp9Aw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R C.", 
    "review_text": "What's not to like?  Everything you'd want in a neighborhood dive bar.  pool table, juke box, chill bartenders and crowd.", 
    "review_date": "2012-11-19"
  }, 
  "MU_bppwgP03jfpTo6vtZ5w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lisa H.", 
    "review_text": "Not a bad dive bar so long as you stay out of the restroom,.. Not only will you seem the same couple of bartenders if you frequent the place but you will see the same bar patrons in the same seats each time as well (maybe there are bunks in the back). Anyways the place totally has the Cheers vibe down. And that's always a really cool thing to see in a big city.   The lay out of the bar is well thought out and makes the most of the limited space. The bar itself is a horseshoe that devides the place into two rooms. One room is just seating and the other has a pool table. There are books around to read if your date or friends bore you I guess. A little weird but I love to read so right on. (Although once I start drinking I typically have to close one eye to focus on the words..) The pool table was free when I last played and that in itself deserves a couple of stars.  Since Dovre does not have a Patio all the smokers congregate right outside of the door to the bar in front of the cross walk at 26th and Valencia. The last time I ate across the street at SouthEnd I could literally smell the smoke (and I'm a smoker so if I noticed that's impressive). There are often dogs hanging out so it is a dog friendly bar for which I gave them another star. The drinks are super stiff and reasonably priced. Friendly bartenders, speedy service- plus plus!  The clientele is extremely eclectic. 9pm on a Friday night you will see guys in skinny jeans, guys in baggy jeans nearly around their knees, old guys, young guys, tough guys, nerds.. But not quite as many women- except those there with one of the previously mentioned guys. A great spot for a single lady. She will feel like she's hunting- at a buffet table.", 
    "review_date": "2010-09-05"
  }, 
  "DgyQTiDR4UMIRiwyMIok-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lisa w.", 
    "review_text": "Love this place, staff and general atmosphere!", 
    "review_date": "2012-07-31"
  }, 
  "Sk0FrFPoaC3QU5bvBcexGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan L.", 
    "review_text": "love this bar, great bartenders, cheap drinks, chips and snacks and good selection at the jukebox. the crowd tends to be older and this is a good spot to so some afternoon drinking. I always play some pool or put some music on and hang out with my friends. they make a GREAT michelada here and its never too crowded. real divey, real good time.", 
    "review_date": "2014-06-23"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "So, my boyfriend and I are going to our favorite over-decorated (think Christmas projectile vomited on the walls) tranny gay bar tonight, because that is where we met and true love began.   No, it is not the Dovre. But, in the spirit of our relationship not starting out in a traditional place we decided that nothing could possibly tip the romance scale more than not just seeing a drag show but seeing it hungover and tired. True love, bitches. You should be jealous.   So, THIS is where the Dovre comes in. It is a lovely sort of worn, but in a good way, place to go and hang out with friends over a few strong cocktails, a game of pool and a some really good tunes in a low key atmosphere. You will enjoy yourself so much that you will not realize you are shutting the place down and forcing yourself to go on your special obnoxious decoration tranny bar drinking date on a mere 3 hours sleep.   Awwwww....... thanks again Dovre for being such an awesome bar and, this last time, helping contribute to our very special date night!", 
    "review_date": "2008-12-19"
  }, 
  "6h2nzPjZhuvg-d7Eq1E2jw": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Joanne H.", 
    "review_text": "The first homey dive I found when I moved here so it has a tender place in my heart.  Reminds me of east coast neighborhood joints like in B'more and Southie, where it would be pretty pointless to expect to meet Mr./Ms Right or to network.  You go there to drink.    I've only been there on weekdays before 5pm, still pretty quiet, cozy, and dark; essential for afternoon drinking, removes any lingering guilt about skipping outta work early.", 
    "review_date": "2006-11-30"
  }, 
  "8DNiwBb0__aB3WehK4JYCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stefanie L.", 
    "review_text": "Is it weird that my favorite aspect of this bar is its KELLY GREEN bathroom?   Okay, I'm kidding, that's not actually my favorite thing. But it was a nice, vibrant touch. This bar is way the heck out there for me (in terms of distance from home), but worth the trek for a nice, chill place to grab a well-priced drink and actually be able to hear your friends as you chat it up. The couches are comfortable (though a bit low, which is a little weird, but forgivable) and the tables are spaced well-enough apart that you don't feel like you're breathing down the necks of the people next to you. And I didn't even try out the arcade games and pool table, but I'm sure they work just fine and get more fun with increased inebriation. Solid.", 
    "review_date": "2011-05-22"
  }, 
  "jy_RGAeAvNeCv5BxZsUWFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom R.", 
    "review_text": "I had an Elvis sighting; he's serving drinks at Dovre club.  Actually the owner of the place is named Elvis. I didn't ask him about it because I'm sure he's tired of the question.   Dovre club used to be on 18th street, in The Women's building, but was evicted years ago. I don't know if Elvis owned the old Dovre Club, he looks a little young to have, but this location is a vast improvement.   The Staff and regulars are a friendly bunch. Elvis himself is a great host; more in line with what they'd call a Publican in the old country than the typical American Bar owner.  I brought in a large group of people, over 40 and maybe better than 50, and Elvis was not only easy to deal with but he knows how to treat someone that brings in business.  Dovre is definitely in the rotation.", 
    "review_date": "2009-09-08"
  }, 
  "J28-pk9OsV-7kF9vxPLwQw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bitter J.", 
    "review_text": "Yes, it's a dive bar, but there are plenty of other Mission dive bars where you can get something besides beer prepared with a modicum of competence.  They have managed to screw up Long Island Iced Teas, which, admittedly, require a small amount of skill, as well as rum and Coke, which requires virtually none.  How hard is it to splash some rum and Coke into a glass in a manner which provides the correct quantity of each?  The bartenders, on the occasions that I've been there, seem like they would rather be doing anything else except serving beverages.  On the plus side, the bar has a pool table and a couch, so it can be worth enduring the apathetic and incompetent service for a spot of comfort and a game of pool.  Just don't order anything besides beer.", 
    "review_date": "2009-03-14"
  }, 
  "YPM4OnKm39CStg1JRHNXIA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "christoph s.", 
    "review_text": "WORST  BARTENDER  EVER.  Not to be confused with some other bartenders who work there and are apparently cool, this chick was a bitch.  30ish, short brown hair, hopped up on coke or something, low evil cackling smokers laugh.  You know how sometimes a bartender or waiter will ask you what you want, and you're not quite ready yet, or your friend hasn't shown up yet and you're just buying time, and you respond that you'd like another minute - then they proceed to be a rude prick or ignore you for the duration of your stay because you were not ready when THEY were?  Well that's what happened.  And let it be know, I was totally polite. I am not one of these \"treat service workers like crap\" people that Yelpers love to hate on.  I'm a southern gentleman and try to be nice to everyone.  Anyway - after my friend arrived we sat at the bar TOTALLY IGNORED for a good 10-15 minutes, the bartender didn't even GLANCE at us while we sat there.  It wasn't very busy either, everyone else had a drink.  She proceeded to talk to patrons, hug patrons, make a second round of martini's for the couple sitting across from us, bitch about how they were out of martini glasses, then went in the back and WARMED UP HER DINNER IN THE MICROWAVE!  WTF!  Still being ignored, finally she bent down under the bar where we were sitting and I said \"Hi\" really loudly to which she quickly responded \"hi\".  Then she finished what she was doing and said \"oh sorry\" and finally made our drinks.  My friend frequents this place and said she hadn't seen this bartender before, so I guess we just had bad luck.  The rest of the bar is actually ok.  Mixed crowd of Irish construction guys, older people, and a few Mission hipsters.  20 oz Guinness for $4.50.  Reminds me a lot of The Ivy Room in the east bay, minus the music stage.  But this is part of what Yelp is for... real reviews reporting the bad apples even if they work at good places.  Don't think you can get away with attitude and bad service in SF and it won't show up here for someone to read it.  UPDATE 2008 - I went back on a date.  The bad bartender was there, but just done with her shift and heading out the door.  A much nicer bartender (with long dyed braids) took over and was very sweet and flirty.", 
    "review_date": "2007-12-15"
  }, 
  "BCcozpMUq9UGTkz_pyc2gA": {
    "user_rating": 3.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Samantha R.", 
    "review_text": "Not to shabby for a block away! They have a pool table, a jukebox and a full bar! Yummy. The crowd is kinda iffy. But for a block away im down for a vodka tonic every so often!", 
    "review_date": "2009-11-22"
  }, 
  "AFbjyBOAiFuHQSeIfgVazQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "celine n.", 
    "review_text": "Your pub away from home. Friendly bar crew and lots of regulars who easily strike a conversation. A true dive family feel, right on Valencia. Good people. Good jukebox. Pool table. Dog friendly. I like.", 
    "review_date": "2008-09-01"
  }, 
  "dTA2SxDuI602k_AlzTiCqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "maria a.", 
    "review_text": "i've been coming here for 9+ years and finally decided to write a review. go for the non-ambiance, the darkness, the slouchy couches, the cheap drinks, the pool table, the jukebox, the after work regulars (older irish gents), the late night regulars (non-hipster hipsters), the weekenders (oh never mind), handsome, brave and strapping owners/brothers Elvis and Brian, their lovely, talented and friendly S.O.s Julie and Meagan, and all the assorted bartenders that know your name, know your drink, and know your game.   Also, there is usually a dog or two.  You can't go for the indoor smoking anymore, alas, (and by \"alas\" i mean \"FUCK\"), but it's still a nice cozy dive bar with personality and without attitude.  ok, there's an occasional brawl, but after all, it's still the Mission.  what's a little blood on the sidewalk?  it helps wash away the puke.  and on the way home, with only a slight detour onto Mission, you can grab a bacon-wrapped hot dog.  heaven.", 
    "review_date": "2007-07-03"
  }, 
  "XJmuD-FRjRXEAyVNe3-sQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brooke B.", 
    "review_text": "The Dovre is so old and venerable, even in its \"new\" location since its eviction from the Women's Buiding 10 years ago, but it has absolutely no pretension whatsoever. Every bartender I've encountered has been friendly and efficient, particularly Corey - nicest, sweetest, most adorable guy EVER. I only go here periodically (it's too close to my house to make it a habit - dangerous), but never have a bad time. Now that one of the owners is ill, I feel like supporting this place in any way imaginable. If that means tying one on every other day, bring it. Worse things could happen.  Sure the pool table is wonky and the sofas are torn up, but hey, they have em! And yeah, there are drunks, but if you don't want drunks, go to your hipster WASP bars, yuppies. Several levels above Clooney's, where it is so bright you can perform elective surgery on any number of unconscious drunks any hour of the day, although if the Dovre had Clooney's jukebox I'd be an alcoholic, and happily so. Dovre's jukebox is a good one - just not quite great. Yet.", 
    "review_date": "2007-08-21"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "$4 beer, unoffensive dive. Awesome.", 
    "review_date": "2009-07-28"
  }, 
  "kgnoey45lJCNgxAJOnAraw": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Scott L.", 
    "review_text": "Unassuming on the outside but Irish goodness on the inside. Speakeasy Big Daddy IPA on tap is a definite plus! Had never been here before but met some friends here before dinner and will definitely return. Good beers and good prices (plus a good restaurant across the street) equals good times.", 
    "review_date": "2011-09-26"
  }, 
  "CZuWm7MBYDsYdtJ0sIE6pQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James C.", 
    "review_text": "Nice enough for a dive bar, but the pro-IRA slogans are just not appropriate in this day and age.", 
    "review_date": "2012-06-03"
  }, 
  "aHkN15XSGeDqkM85voZG3Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy C.", 
    "review_text": "This casual bar gets 4 stars for:  1. Charging just $4 a beer (in SF too!). 2. Being spacious and quiet enough that you can come with a group of your friends and chat. 3. Having a decent selection of beers on tap - Boont Amber Ale, Widmer, Blue Moon, Guinness, Sierra Nevada and some others. 4. Being conveniently located.  Just a few blocks from the 24th BART and El Farolito.   It smells like stale beer when you first walk in, but once you get a few drinks in you, it's not that noticeable.  It's cash only, but there's an ATM in the bar.  There's also a pool table and a few tvs.", 
    "review_date": "2011-06-08"
  }, 
  "NSPc5WAzKjQr2D3SiFAeXg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Vivian C.", 
    "review_text": "I like this bar.  4 well-deserved stars.   And here's why.  Aite, here we goes again:  LIKES: + It's definitely got a great, local, unpretentious neighborhood bar feel to it, which I like.   + The patrons are locals and really chill.  You'll see folks from the neighborhood in their hoodies and slacks.  It's very comforting, and the people are not assholes or totally dressed-up douches/bitches trying to prove a point.  Which I like.  Yay for good people. + They have an AMAZING jukebox.  Seriously AMAZING, with everything you can imagine.  Loves it! + There's also an OMGPINBALLMACHINE!  This appeals to the 10-year-old in me, which generally comes out pretty often and is easily excited by bright, shiny objects - like UFOs, random kitchen gadgets, and pinball machines.  Also loves it! + Pool tables!  I can't play pool to save my life, but hey, still cool that they have some here.  Other people seemed to be enjoying themselves! + They have a bunch of books lining a shelf in the main area.  English major/nerd here!  I like this a lot.  I mean, I don't think anybody will actually sit there and start reading a book but it's a great conversation starter, isn't it?  I mean, most people I know get pretty excited when they see a book they like and there's always so much to talk about when you meet someone else who also loves the book(s) you love. So I think that's what they're there for.  WIN! + It's located close by the 24th and Mission BART station, which means easy access to public transportation as well as easy access to El Farolito.  Double win! + Oh yeah! I forgot!  It's a BAR!  So I have to comment on the alcohol, which is decently priced and good.  Nothing extraordinary because I mean, it's a dive bar, but yeah, still good.  DISLIKES: - Uh. . .I can't think of anything to write here.  Final word:  There's nothing that I really dislike about this place.  I like it.  But to get 5 stars, you have to impress me beyond words, and this place ain't there yet.  Still, though, it's gettin' there.  Not swept off my feet yet, but maybe a few more dates might do it.", 
    "review_date": "2009-07-11"
  }, 
  "K9U2qxPFi5llft8KuZIPjg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria C.", 
    "review_text": "I don't drink much and seldom drink beer, so Corey and Elvis hooked me up with pear cider, much like one will give a child a Shirley Temple so they feel special.   I felt special and if a non-beer-drinker can feel special at an Irish pub, well, that's saying something...", 
    "review_date": "2007-04-05"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "I like it.  I like it quite a bit.  The bar tneders recognize most anyone from the area.  Most of the loudmouths are harmless and the drinks are average price.\n  There is $2 tecate all day everyday.  With a little luck a bartender will buy you a drink after your forth round.  This is a real bar.  Not really a dive, not really anything special.", 
    "review_date": "2005-11-22"
  }, 
  "TcwuK4j8qXbtszyDTxKiyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Essron J.", 
    "review_text": "I like to go here after band rehearsal to mercilessly shout at my guitarist's friends for a few hours. Elvis has suffered and enabled this without complaint, for which i think I owe him something. Like 6 stars. But that's impossible. Bummer.", 
    "review_date": "2008-06-06"
  }, 
  "D_N655jiuar-2CT1QWye6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve F.", 
    "review_text": "I've been there a few times in the past month, and weird, memorable stuff has happened each time. Most memorable were the drunk failed musician who strongly opposed that most basic physical force, gravity, and then the completely evasive possible serial killer who tried to entice my companion off to dinner at the Tonga Room. (At least serial killer dude bought us some drinks.)  The liquor and draft selection is adequate, if not extensive, and not overpriced. Like bars in Ireland, they may not have your favorite, but they'll have something you like well enough. Bartender Elvis may even wax philosophical with you about choice, desire, whatnot.  The atmos is cozy, especially on a cold winter's night. The jukebox is serviceable, and there's a (rather easily tilted) pinball machine, too. Maybe a \"dive\" by SF standards, but I've seen divier even in SF. (They don't even let you smoke in the bar anymore!) Don't be scared, give it a try!", 
    "review_date": "2007-01-04"
  }, 
  "xsMd6OnEJ6_Np6Es0uxOIg": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Gerard Y.", 
    "review_text": "It's ironic that I grew up in this neighborhood and would always pass by this bar on my way to a doctor's appointment so many times, but tonight was the first time I went. It was chill and not so loud so you can actually hear a conversation even if music is playing in the background. They have a tv hooked up on each side of the bar which was cool since they were playing the Home Run Derby at the time. Anyway the only reason why I stepped foot here is I'm in a pool league and the match just happened to be at this bar. The pool table is nice. Plays just like a bar table should. Who wouldn't like to sip a beer while sitting on a leather couch too. That's all I need. The only minor complaint I have is it tends to get a bit too warm here even with the doors open.", 
    "review_date": "2012-07-09"
  }, 
  "la3b5Hrm-4DgMpTsBITJVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy C.", 
    "review_text": "It's a Sunday evening.  Tummies full off Peruvian food at Mi Lindo's, we stumbled into Dovre.  Something about the cute golden lab running in and out of the place seemed like a good omen.  They have Big Daddy IPA on tap - that makes my bf happy.  I get a vodka-cranberry .  .  . and ooooh I think my drink was just barely tinted pink.  Good value if nothing else!  The group of us played some pool, kicked back with our drinks, and had a jolly ol' time.  Yeah, it's a good place to have around.", 
    "review_date": "2007-07-19"
  }, 
  "YeHmglfOMn_11z48oTGvKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mat h.", 
    "review_text": "The Dovre is the greatest kind of dive bar: one with regulars, a great jukebox, and a truly great bartender, Elvis. I've been heading to the Dovre for eight or more years now, and it's like a second home at this point.", 
    "review_date": "2008-07-29"
  }, 
  "-nrgXJqgTiiQEPOL-gTTDw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Louis M.", 
    "review_text": "ok .. miss pippy long stockings, ur time has come. i am a USER of yelp never felt the need to \"yelp\" just used it for req's but come the time when u get miss-treated i feel the need to speak out and warn fellow yelpers... good people with cash come into ur bar, we spend a good amount and are not being out of order yet you feel the need to be rude and force us out of the bar while yer \"locals\" can chill &amp; enjoy a smooth bevie after we are long gone.   u could have increased yer locals by a good bit, after \"the night\" ....I'm out, not planning on going back there  i think it was bad a move for a business, but pippy, ur not thinking along the right lines.  You loose,  sour taste, please ...walk on by.", 
    "review_date": "2008-11-30"
  }, 
  "dnuqcgZ2Hc75tXRG9_LiWA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mathias G.", 
    "review_text": "Words can't really describe how down this place is...the bartender is awesome, there are some great beers on tap for cheap, quarter pool table, nice comfy couches; all in the heart of the Mission District.  Hell, we ordered a pizza whilst playing pool, and it was pretty classy to cure our drunk munchies via delivery without leaving the bar.    The Big Daddy IPA is the beer of choice for me.  Oh yeah, this place has the best music out of any bar I have been to, if you like indie rock", 
    "review_date": "2009-08-28"
  }, 
  "XdWJx9K81bVdFl_nmy153Q": {
    "user_rating": 4.0, 
    "user_location": "Australia", 
    "user_name": "Oleg N.", 
    "review_text": "Feel genuine like for this place after finishing there two nights in a row. Laid-back staff and clientele. Pool table, juke box, tv to stare through. Not much else to add. Quality grubby local bar.", 
    "review_date": "2012-03-14"
  }
}