{
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "TOTAL Awesomeness!  Love the vibe and crazy 80s ish feel. Michelle, the bartender, was uber nice.  My phone was out of juice and of course, I needed to \"check in\" on yelp.  Tah-dah, Michelle came to the rescue and hooked my phone up with some electrical lovin' with an outlet behind the bar.  Heart it so much!    Killer restroom... with high profile toilets and it reminds me of Japan b/c you can press for a \"#1\" or \"#2\" type of flush.  What can I say???   I'm easily entertained.  This is a great place for GROUPS.  I totally encourage drunken debauchery with CROWDS of people here.. they seriously have the space!  I didn't wander downstairs because it was COLD, but saw a stairway leading to what looks like OUTDOOR patio seating ...SCHWEEET!    I ordered Henny because I was too much of a wuss to try the ORANGE PUNCH.  I'm sure I would have been a TKO if I had gone that direction even if watered down.  Of course, the neighborhood can be a little \"iffy\" at night, but it's up and coming (like the Jefferson's...) and I totally loved it that when I walked in the door there was a HELLA cute pitbull with a huge head wagging its tail greeting me and trying to kiss me.  AWWWW --- AWWWW...", 
    "review_date": "2013-11-21"
  }, 
  "22QbXLWewVXkPevXZXcVcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Armando C.", 
    "review_text": "If you want professional service and exceptionally well made drinks come see : Emily at Emperor Norton's BoozeLand ! A real pro behind the bar - no nonsense service and a smile to light up the dark side of the moon.", 
    "review_date": "2014-07-13"
  }, 
  "i7zuRDllj1KTqoSHUayV_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brynn D.", 
    "review_text": "Credit where credit is due - this is a perfect spot for a low-key drinking night with friends. We commandeered some corner tables for cards night cause goodness knows my apartment is too small to host more than 2 guests. Noise level is fine, bathrooms are squeaky clean, drinks are good and cheap, staff is friendly and attentive. They even let us order pizza delivery when we realized we were all drunk and hangry. This is definitely going to be a new regular spot.", 
    "review_date": "2014-01-24"
  }, 
  "MiQeYnItNMiAdwFXQzY_Mg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Molly B.", 
    "review_text": "A drinking oasis in the Loin.  The front door has images of ballerinas dancing and a creepy mannequin that supposed to be Emperor Norton.  I wonder what this building used to be.  Anyway the bar is great, good bartenders, juke box, pool table in the back and downstairs is an outside area for smokers featuring a giant bunny head.  What else can you ask for?", 
    "review_date": "2013-09-05"
  }, 
  "pSms5uzIwl_eM6Gi7vVFYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin W.", 
    "review_text": "Great spot for a relaxing Sunday afternoon game of cards paired with a few g&amp;t's. One star is just for the back patio - it's wonderful to be able to have a drink in the fresh air - sitting inside a bar on a sunny day is way too depressing. There was a bit too much smoke in the air for me but to each their own...", 
    "review_date": "2013-12-03"
  }, 
  "Nfw6KZys6dVXnB5oiuZPdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex D.", 
    "review_text": "How come I just found out about this place like now? I mean, if I were in my twenties, I would give it 5 stars!  Damn, time.  Damn. A co-worker of mine had his going away party here and I was hesitant to go...you know, drink around fellow employees.  Things always get awkward...but I joined the fun and managed not to make a complete ass of myself!  I can't believe this little gem of a bar was a foot away from me for the past year...crazy.  Here's the pro list: 1.) Great Bartenders 2.) Awesome atmosphere 3.) Back yard/patio with tables 4.) Pool table in another area 5.) They let you have food delivered if you're wasted and need to soak it up! 6.) Good prices  And the cons:  1.) Neighborhood  Clearly the pros outweigh the cons, so drink up!", 
    "review_date": "2014-01-09"
  }, 
  "vEQQq1GPkAurMrMcW4W6ag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee Dee R.", 
    "review_text": "Picky about customer service lived in San Francisco longer than most techies have been alive but how could that be since I'm only 21.  Love this place!  Visited ENB after a long day of art-slaving and fruit &amp; veg shopping  at Civic Center Famers Market enough SF bohemian name dropping - dude behind the bar had ...gasp, MANNERS!! He actually was clever enough to effectively read people and believe that I'm an artist and have lived in Little Saigon for, well, a hell of a long time.  Being a mannered man he bought the first drink.  That is the sign of a good and serious bar-tender.  They want neighbors to drop in. We neighbors  have friends, relatives and in my case a weekly public access TV show (Dee Dee TV Saturdays 11pm Ch 29, streaming) that nobody has watched every week since 1995 but still people seem to listen to me!  I drank the free wine and the second one cost SIX BUCKS That right there shows they are real! Real about getting chicks in the bar. Chicks like wine. Chicks don't like 10 dollar basic wine at least not this chick. If I am paying 10 bucks for a basic glass of wine it'd better be served by a half-naked man who does hair and nails.  Shared the table with some ladies who were  plus size. More realness!   Anorexic SF gals are usually tweeking  big girls are more relaxed and I wanted to keep drinking cause it was so relaxing the vibe is cool but I stopped at 2 and I want to go there right now but I'm finishing a Trader Joes bottle and watching PBS  and will visit ENB  this week but don't listen to me I've only lived in San Francisco since 1984.", 
    "review_date": "2014-12-07"
  }, 
  "GvRp_GU1_2DeLQbyZH1R9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elsa S.", 
    "review_text": "Warning: cash only  Awesome! Great atmosphere, fun games, chill crowd, and clean dive bar!   Can't wait to come back!", 
    "review_date": "2014-03-10"
  }, 
  "kQD1sGBFsIgIoEl8ydimMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rob h.", 
    "review_text": "This place is awesome. Cool bar setup, outdoor hangout/smoking area. And they have Science trivia napkins! And, you say there's a rumor it used to be a sex club??  This place is awesome! Come support your new neighborhood bar.", 
    "review_date": "2013-08-30"
  }, 
  "_j-ypXEgHRztluuQ_jziNA": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Martin R.", 
    "review_text": "This bar is one of few nice attitude, clean and most the bartenders are so nice good ZERO drama environment I will definitely recommend it. Hope to see you soon...", 
    "review_date": "2014-08-03"
  }, 
  "lb2o-YhsjACX4kgUdrXz7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nora M.", 
    "review_text": "Bunch of cool blokes behind the bar,  short but good list of beers on tap. Back patio and a much bigger space than you'd imagine for a \"dive\" bar. And the toilettes give a #1 or #2 flush option! How moderne!", 
    "review_date": "2013-08-28"
  }, 
  "nxUocCceCH9sIJjN0M9jnw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave G.", 
    "review_text": "You've decided to take an improv comedy class in hopes of overcoming your crippling fear of public, semi-public, and non-public speaking. Since you found out about this particular class from a flier posted on the message board of your local laundromat - in-between a flier for a lost overweight Persian cat named \"His Meowjesty,\" and a coupon for \"15% Off Sapphire North's 30 Minute Spiritual Psychic Healing Session\" - it really doesn't surprise you when your class ends up being in the back of a  white 1984 windowless Ford Econoline van parked at the corner of 6th and Mission.   \"Can anyone tell me the first rule of improv?\" your instructor, Christian Lightning, a part time magician and two-time felon, asks to the group, as he takes a slow drag from a glass stem connected to a hollow bulb, filled with a rocky substance. Your classmates, a malnourished Mexican foreign exchange student who misses his pet turtle, a recently married lesbian couple from Texas who own and operate the largest iguana farm in California, and that old-timey villain who ties ladies to railroad tracks, all shake their head side to side in a 'no' fashion.   \"Yes and pass,\" Christian says, and hands you the glass pipe. \"Never forget that.\"   Two hours later you will all be arrested for smoking meth in the back of a van. Your improv instructor will have to serve some heavy time since he was on parole.  Because you've read Tina Fey's \"Bossy Pants\" you are pretty sure you can organize your own improv class. Invite all of your old classmates over to Emperor Norton's Boozeland, which is the raddest new bar in the city and the perfect spot for starting a comedy troupe. A pool table, shuffleboard, patio, whiskey, tables, booths, beer and bears oh my it has everything. \"This is the bar Gotham deserves, and also the one it needs,\" you think to yourself. So we'll drink there. Because this bar can take it. Because it's not our hero. It's a silent guardian, a watchful protector. A dark knight. \"You know that day that you once told me about, when Gotham would no longer need Batman? It's coming,\" you say to your group, as you take a pull from the glass pipe.  \"AND SCENE! AND SCENE! AND SCENE!\" you hear your classmates yelling at you, which has become code word for \"Stop smoking all the meth!\"   It's then that you take a cold hard look at yourself in the mirror that's mounted above one of the greatest booth seating areas of any bar you've been to and realize that you are wearing a Spiderman mask and one big plastic green Hulk glove on your left hand. Some dark knight you are.   \"And scene indeed...\" you whisper to yourself, crushing the meth pipe in your Hulk glove and vowing to never do improv again, as you walk out of one of the coolest bars in the city.", 
    "review_date": "2013-08-20"
  }, 
  "QrbVXDB120omUG2bINhGBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Louis D.", 
    "review_text": "Loved it! We came here for happy hour the other day, on a Friday, and it was lively without being crowded. The bar offers good drink specials (hard to find in SF), I had my pick of the IPA's for $3 and pitchers were $12, mixed with a ton of space, outdoor patio, and overall very chill vibe. Can't wait to come back!", 
    "review_date": "2014-12-01"
  }, 
  "DqvPZh-crUdz4vN4tuVw-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chelsey G.", 
    "review_text": "A lot of creepy bars in the TL.  This is not one of them! Monday afternoon, World Cup playing.  Decided to sneak out of work and have a beer and watch the game.    Franziskaner on tap. Check! Estaminet on tap check! 2 Tv's.  Just dark enough to forget about the real world, but not too dark that you cant decipher if some one is hot or not.  Guy behind the bar was helpful and down to earth.  Pool Table, Outdoor Patio.  Not too hip.  A great spot if you are in the TL.", 
    "review_date": "2014-06-16"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "Great, big windows to enjoy the local entertainment that is Larkin St! Hallelujah for great drinks at great prices in a sultry &amp; fun filled setting. Thanks to the bartenders - who are all fabulous.", 
    "review_date": "2013-09-06"
  }, 
  "t12Z0azl9prYc7n_Bo8AtQ": {
    "user_rating": 1.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Db C.", 
    "review_text": "visited from santa cruz. would never go back to emperor. loud, obnoxious, rude , kids who do not know how to communicate with anything but a computer.  absolutely disgusting .  smoke weed. forget the booze and boozeland. do yourself a favor.", 
    "review_date": "2014-10-15"
  }, 
  "hH_QPpRV8mDnkL0ECmIa3Q": {
    "user_rating": 5.0, 
    "user_location": "Lakeside, San Francisco, CA", 
    "user_name": "Molly S.", 
    "review_text": "Why is no one making a bigger deal about how freaking good the bloody mary is??? It's spicy, sure, but the best part about it is the addition of pickle juice which makes it briny and crisp and delicious. Super basic garnish with a lovely pepper top seals the deal. I got a mary and a wee baby MGD for ten bucks. And they gave me the can of tomoato juice so I could refill as I went.  lovely staff and surprisingly classy atmostphere inside. If it wasn't in the deep tenderloin I'd call it a great first date spot.", 
    "review_date": "2014-08-22"
  }, 
  "7eR3QevWrQAFyrtVpFksdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan D.", 
    "review_text": "I came here for the name, was pleasantly surprised by how much I liked the place. There's a nice \"upscale-psuedo-dive-bar\" thing going on here that should scratch any dive-related itch you have.  To wit: they've got the requisite dimly lit barside area, the spacious game room (feat. shuffleboard and a (purple) pool table), the dark corner booths, and the outdoor patio (with Pabst BR-themed street art, of course).  Nice beer/liquor selection, friendly bartender. I'd definitely come back.", 
    "review_date": "2014-08-09"
  }, 
  "CSeWID1TbPxeFwaLRATjfA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie B.", 
    "review_text": "Shuffle board, a patio (which closes at 9 or 10), and dog friendly! Yes please!", 
    "review_date": "2014-02-24"
  }, 
  "5B2VMahlkYu71SLlywg8Aw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle L.", 
    "review_text": "Emperor Norton's is my favorite destination for an afternoon of playing shuffleboard and enjoying some good beer.  The bartenders are friendly and have always provided great service.   They've got a nice selection of tunes on the jukebox and an outdoor patio with picnic tables and a cool mural of the Emperor himself.    The art deco bar is really something to behold.  This is now my go to spot in the TL and I look forward to many more fun times in Boozeland.", 
    "review_date": "2014-07-17"
  }, 
  "gnUuzmVCy7m3Gk4j_qAaaA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel C.", 
    "review_text": "The owner Kevin messaged me about my recent unpleasant experience hear and apologized for the strange night... I really appreciated that he took the time to read my review. While I would be open to trying Norton's again in the future, I'm not sure if I can convince my friends to again...but I shall try!", 
    "review_date": "2014-12-27"
  }, 
  "CiYRhDyFbsDbWR45uv822w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fannie S.", 
    "review_text": "Drinks are good. Cash only. Prices are reasonable. Attitude is not so much. Decent space with pool table, shuffleboard, and a small old-school video game console.  Bar seating and tables available.", 
    "review_date": "2014-08-30"
  }, 
  "nbfyMmgqnxXIp7EDqTmkqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kajal G.", 
    "review_text": "Pretty nice spot in the tenderloin. About 10 beers on tap. Cash Only. Pool table and shuffle board.", 
    "review_date": "2014-08-17"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "I'll start off by saying that my friend's boyfriend owns the place, so my opinion is likely more biased than most.   When she told me that it was opening, I sent a message out to all my friends at Hastings hoping that they would check it out because I'm SO sick of Soluna (the go- to place for drinks for Hastings students).    And they did check it out!  And they liked it. And they brought more Hastings students.  And we all lived happily ever after.  But srsly, check it out.  It's chill!  I get that it's in the tenderest loin, but just go earlier if that really freaks you out.", 
    "review_date": "2013-10-09"
  }, 
  "Lf7MRy1_uFxgKUYn6ov5yw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Da Wei S.", 
    "review_text": "Great owners. Great bartenders. Great clientele. Everyone is super friendly and the booze flows freely and is cheap. What else could one possibly want?", 
    "review_date": "2014-01-31"
  }, 
  "fKN1WhWWuqlIKPL2NjAJ0A": {
    "user_rating": 4.0, 
    "user_location": "Fussa, Japan", 
    "user_name": "John H.", 
    "review_text": "We came during the St. Paddy's parade, and seemingly all the firedogs were here. But everyone was just hanging out and having a good time, so it was cool. This place is MUCH bigger than Harrington's down the road, with the same sort of booze selection. It's definitely more my style of bar, so I'm being biased with my score.", 
    "review_date": "2014-04-09"
  }, 
  "XstzXwzYhK9EONtiOB41UA": {
    "user_rating": 5.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Robert R.", 
    "review_text": "So I was in town for a friends wedding and Beyond Wonderland (electronic music festival) and decided that me and my girlfriend would just wing it and not do the Normal tourist thing so we came here as we ended up here. The bartender Michelle was the best she not only gave us tips and advice on what to do but she gave us a crash course on the SF culture. I recommend this place to anybody looking for a chill bar during happy hours which is when I went. The place itself is very clean very nice and awesome vibe with cool local characters walking in and out. 5 stars thanks Michelle you are amazing and we loved Golden Gate park if I'm ever back in town I'll make it a point to stop by have some drinks and chat it up.", 
    "review_date": "2014-09-26"
  }, 
  "ZC5XEWsIbxsxSQb5zN1gpA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly H.", 
    "review_text": "Love coming here for happy hour and shuffle board!   bartenders are nice and beers are cheap! can't ask for more for hh!", 
    "review_date": "2014-01-08"
  }, 
  "t5KBjGt6359jIBItCzGC2A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney P.", 
    "review_text": "Great new bar! The bartenders are great and the drinks are good and well priced. They have a pool table, shuffle board and patio out back. It's a perfect place to chill at the bar or have big groups, the place is huge!! My new regular bar!", 
    "review_date": "2013-11-26"
  }, 
  "v0ANF5-KxIWBtQQB0PfI4w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Enrique C.", 
    "review_text": "What a cool spot!  The Boozeland sign caught my eye on our walk to dinner.  It was so inviting we made plans to check it out on the walk back to Bart.   The front bar was crowded but on a Friday night that was no surprise.  Both bartenders were hard at work taking orders and pouring strong drinks.   Even with the crowd at the bar there was still plenty of room and a few tables available.  The shuffle board was occupied a juke box was playing good tunes and the bathrooms were clean.    I'll definitely add this to my list of watering holes.", 
    "review_date": "2013-08-10"
  }, 
  "9GCCoFw_UHiAHjZ4kygHgw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren V.", 
    "review_text": "Quite the change from the Deco days, very nice redo. Some cool drink specials", 
    "review_date": "2014-02-14"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "A name like this calls to me.  A mixed crowd was evenly spread throughout this large space and we were able to snag a table.  Surprisingly, the bartenders were extremely kind while pouring $5 Jack &amp; Cokes for such a funky atmosphere deep in the Tenderloin.", 
    "review_date": "2013-11-20"
  }, 
  "hWzFphZ3sdxX6XolsXC1Jg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana W.", 
    "review_text": "The drinks were cheap and we had a fun time playing shuffleboard, especially after the table glitched out and quit scoring the game so we could play as long as we wanted.  I can't really recommend this as a place to go out of your way to visit though.  Something about it creeped me out a little bit, probably the black wallpaper and suspiciously large stalls in the ladies' room.  Also, if you're not a smoker don't bother going out onto the back patio.  That's pretty much what it's for, I couldn't stay out there for long.  I'd go there for happy hour beers again.  I was pleasantly surprised at the \"not bud\" brews on tap for the price they were offering.", 
    "review_date": "2014-08-04"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Spacious bar that has a pool table and a shuffle board in the back room!  That was already a win in my handbook for bars!  Their restrooms are contemporary and clean, which was unexpected for the location that it is in!  5 bucks for a round of beer.  The norm, more or less.  Loud music and they have side tables.    You had me at the shuffle!", 
    "review_date": "2014-02-24"
  }, 
  "dvjDCmUpQh8i-i_7ywUbFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "teo w.", 
    "review_text": "Nice new bar, clean and pleasant but not fancy. They have some of my favorites (Franziskaner on tap, Herradura silver, Templeton rye and Lagavulin).   There's wooden tables with bar chairs throughout, and a large booth, pool table and shuffleboard (yessss!) in the back room.", 
    "review_date": "2013-08-09"
  }, 
  "PbmtoKdQ_Td9Ez_WwlEZig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam S.", 
    "review_text": "And the winner for \"Best Named Bar in San Francisco\" goes to:  ...Emperor Norton's Boozeland.  Every time I tell people I was here, they seem intrigued by the name.  Granted, about three out of four times I have to clarify that this is the old location of Deco, which occupied the spot a few years back.  And, truly, Emperor Norton, you built a solid empire of booze for fun-loving Civic Loiners to enjoy their libations.  There are four distinctly different areas to the bar, and there's a little something for everyone.  Want to go smoke on the back-patio?  Check.  Want to play some pool or shuffleboard?  Great game room/area.  Have a big group from work (hi, after-work lawyers)?  Big common area with TV's.  Just want to sit at the bar?  Heck, you can do that too.  Good beer selection, and reasonable HH specials until 7pm.  They open fairly early during the week (noon), so you can get a head-start if you wish.  I think it's a really good mix of clientele.  The space is really well decorated - they've done a great job.", 
    "review_date": "2014-05-28"
  }, 
  "UEzBP1NzgmlM2DdiYXfPBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ms J.", 
    "review_text": "After the fun/sh*tshow of opening night (which, full-disclosure, left one friend unable to remember how he got home, and me puking in the street - good times!) we decided to give it another go. There were nine of us, and we all fit into the cozy seating area upstairs. The outdoor area is cool to hang out in, too.  Surprisingly spacious, clean and dog-friendly. All good things.  Gotta say I really like this place. As long-time Bender's-ites, we knew the staff was cool, but they really seem in their element here (but what's with the happy, smiling, Kevin? Disconcerting!)  One star off because, seriously, WTF is up with the women's bathroom? The toilets are so high! Needing to be on my tiptoes to get to the seat is not cool!", 
    "review_date": "2013-08-29"
  }, 
  "4Xfeyf-yYN9MLx-jVW_5zg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert D.", 
    "review_text": "Look like a great place came in for a quick drink...", 
    "review_date": "2013-09-13"
  }, 
  "gZdAW6ah6mo6DIfyg5_umA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley D.", 
    "review_text": "Very, very clean! Really cute wallpaper and efficient bar service. The outside patio is also nicely kept and there was always good music playing. Pool table, shuffle board (a fancy one) and pac man to play. Will def be back!", 
    "review_date": "2014-11-01"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Very cool bar but WATCH OUT for their ATM. They are cash only so I tried to use it to buy drinks for my myself and my friends. It didn't give me the $60 I requested but still took the money from my bank account - not okay! Luckily the bartender/owner is helping me deal with this ridiculous, sneaky ATM.  The bar has Photohunt, a pool table, shuffle board, and reasonably priced drinks. I'll come back but will get my cash elsewhere (and I'll save ATM receipts in the future if money does not come out!).", 
    "review_date": "2013-10-11"
  }, 
  "Jph_YiKlWPqW9USS2Ih7-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "How could one possibly resist the allure of a kingdom known as Boozeland?   If that's not the promise of a good time then nothing is!  So, this a new bar that's clearly owned and run by experienced, cool people.  They  know what they're doing and have clearly thought about their space.  The front section is a remodel / vast improvement of the place that was previously there.  Just that part is a great place to chill out and have a drink.  But follow me!  The good times continue in the back with shuffleboard, a sweet-ass purple pool table and a comfortable booth where you can share your most intimate, kinky, dirty, nasty secrets.  Or just a pitcher with friends.  Your choice.  Let's pretend for a moment that you get tired of shooting the shit, shooting pool and sipping delectable double IPAs.  You and I are probably not on speaking terms at this point, but let's pretend...    You're in the 'Loin.  Ok.   Feel like sitting outside?  Yup.   Want to enjoy your cold beer, but don't want to be panhandled, accosted by crack zombies or hassled by \"the man\"?   Fuckin' a right!  Where, oh where do you go?   To the back patio!   They have really thought of everything.  On a hot date?  Come and sip a cold one here with your hottie. Just got out of work and need liquid refreshment?  This place has it.  In glassware, son!  Oh, there's cool music on the jukebox too.  You can pick the songs while I beat you at pool.  Oh, thanks for the IPA!  How did you know?  Wait, how'd you just make those four balls?  Have I been drinking...?  What do you mean this review makes me look like an alcoholic?  I'll have you know, good sirs, that I only drink on days ending in y!", 
    "review_date": "2014-01-24"
  }, 
  "HSBLLW5nZGuz4zfCMp5-gQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curly G.", 
    "review_text": "I love this place! It's so nice to have a cool place to go to in the tenderloin before and after shows or whenever I'm in the hood. It's so awesome that they have an out door area and truly the best bar staff ever. I always feel at home! And particularly the blond girl with the big smile. What a sweetheart! She is the sweetest most inviting girl!", 
    "review_date": "2014-06-13"
  }, 
  "aTgKyFecb7MWAf6txFXa_g": {
    "user_rating": 2.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "Taylor B.", 
    "review_text": "I used to love Deco and was sooo happy to hear that the place would re-open. Soooo much potential. Marlenas did something similar in Hayes valley and re opened as a  trendy spot Brass Tax. Unfortunately the same did not happen here.  The first time a group of us came back since the reOpen it was awesome. Cheapish drinks, fun pool table and awesome improvements to the outdoor patio. The bartender was way cool too. Dark hair and ?tattoos? I think.. Neway, this even was on a Sunday and was enjoyable enough for us to return the following Saturday. Waayyyyy different experience...  We arrived and noticed a different (completely wasted) bigger blond woman tending bar. We ordered a whiskey ginger and two last words (I was staring at the chartreuse and maraschino and it looked sooo good). She futsed around a bit and came back with the  whiskey ginger then went away. We waited...and waited... Then we made eye contact again and re ordered the drinks. She drunkenly rolled her eyes and told is she didn't know what that was. So we changed our order to two negronis.. Off she went..   She took a shot with a ?friend? Took another groups drink orders.. Nearly knocked over a bottle from the bar as she staggered to make someone else's drink. THIS WAS ALL AT 5pm!!! Holy smokes.. I'd bet she had a rough Sunday.. We cut our loses (time) and left. I was sooo hoping this would keep on being a cool place but apparently the staff (minus the awesome woman from the first night) are incompetent...The second star is for our first night and I won't be back unless I poke my head in and see her.. IF I happen to be in the neighborhood", 
    "review_date": "2014-06-12"
  }, 
  "ztgvckfHOu9rc01PfQoVtw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gordon A.", 
    "review_text": "Love it, another great spot to hang and drink with friends from the guys who run another favorite, Benders in the Mission.", 
    "review_date": "2014-02-26"
  }, 
  "hgrhfiO4CYGbLVuQESjDDQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Holly R.", 
    "review_text": "Just divey enough (but actually pretty nice), new bar in the Tenderloin (don't be a big baby about The Loin). They have an Irish bartender named Liam, Woodford Reserve Bourbon, and allow doggies - pretty perfect.", 
    "review_date": "2013-08-19"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "Emperor Norton's Boozeland is right beneath my coworkers apartment so it was a no brainer this was our first stop on our night out. He has lived in the area for the past 4 years so was no stranger to this bar. He said they recently had a huge renovation which has really helped to make a difference in the overall experience.   I liked the décor and felt there was plenty of room to sit comfortably. The prices were fair and poured well. They also offer a shuffleboard court in the back area.  Overall Thoughts  I wouldn't be upset to call Norton's my local bar", 
    "review_date": "2013-09-01"
  }, 
  "2pdQeER_Z1R-1db2b6WGEg": {
    "user_rating": 4.0, 
    "user_location": "Alamo, CA", 
    "user_name": "Steve L.", 
    "review_text": "Pool table, shuffle board, juke box and cash only. Sounds like a good bar, looks like a good bar, must be a good bar right? Large selection of draft or bottled beer to accompany a full scale bar is nice. The place can get busy so coming a few drinks in, or early is a good choice. Did I mention Cash only? They have an atm but it charges you $3 and so do the bartenders when you ask for three different draft beers ... or she couldn't do math. One or the other. Overall a pretty chill place you can get a beer at with your friends or a date if you don't mind sitting on top of each other to hear what's going on.", 
    "review_date": "2014-08-20"
  }, 
  "pDeXCLgyh7uLwOUsUlYb0Q": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Brenda N.", 
    "review_text": "If you want  to feel like family even though you've never been here before come see Emily and she will treat you like family. LOVE this bar!! EMILY YOU ROCK!!! Can't wait ro see you again.", 
    "review_date": "2014-07-13"
  }, 
  "fzjHSd_g27KYT00i_PgUfw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael G.", 
    "review_text": "The service at this place is the worst, unless Courtney or one of the other female bartenders gets to you. Everytime I come in, the guys behind the bar are just ignoring people...EVERYTIME! Not only that but they have no fucking clue on how to act in public. The tall bald guy had a massive meltdown over some shit one day I was in there, punching the bar and just acting like an idiot. I went in last night just to see what the male/female ratio was (fucking sausage fest) and 3 bartenders were behind the bar but only 1 was working. The tall bald guy and the fat guy with with long 80s metal hair were standing around looking stupid, talking to some girl at the end of the bar while paying customers stood around trying to get drinks. Another fine example on how service sucks in SF.", 
    "review_date": "2014-09-07"
  }, 
  "Fbp3Sxo6jnBCu0mgTVHE6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hank S.", 
    "review_text": "Excellent new bar with back patio, pool table and well priced drinks. Checked it out last Friday with a bunch of friends.   Definitely a fun spot with a hip (but not too hip) crowd. Neighborhood is better than I remember it to be. I'll definitely go back soon.", 
    "review_date": "2013-08-05"
  }, 
  "d2x5qJYjYRxH6rfOIWypNg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "Place sucks!!! Bartenders suck and are rude!! Prices are determined by the bartenders and the same homeless guy is always at the bar", 
    "review_date": "2014-04-12"
  }
}