{
  "PKPt-PE4BMQ0ZHuGnXulAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher L.", 
    "review_text": "Haven't been to the Exploratorium since it was at the Palace of Fine Arts. It is now located on the Embarcadero. Came here for the Thursday night after-hours. So much to do and see...However, I ran out of time! I will be coming back!  HOT TIP-  Don't wait in the long line to buy alcohol at the bar by the front entrance. Go to the restaurant in the back..there is no line!", 
    "review_date": "2014-08-15"
  }, 
  "tEwfqXV5LM26cMlquBYgjg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Garold F.", 
    "review_text": "It is one of the favorite places for fun. The staffs are also well furnished to behave and helping me treating as friends.  The cocktails drinks and the others foods item are really too thundering and delicious.  They take the fair charges and I will be come back with some of my friends. Good and better environment at all.", 
    "review_date": "2014-03-03"
  }, 
  "u3xrhsGlVglrDwCp0ZgR2w": {
    "user_rating": 4.0, 
    "user_location": "Newark, CA", 
    "user_name": "Hadrianus C.", 
    "review_text": "First of all, the new Exploratorium looks great and gives a fresher experience to those of us who've been visiting the old facility multiple times since childhood, despite most exhibits being the same. And as another reviewer mentioned, this place would really benefit from more signs so it's easier to navigate around. My bf and I visited After Dark, so it was great not having to fight with little kids that either don't share or cut in line. However, that also means you have to fight with a bunch of drunk young adults that just won't leave certain stations. Overall, the drunk adults cancel out the inconsiderate kids, so your overall advantage to visiting After Dark is the opportunity to walk around with booze and to pay less for general admission. They also have special events such as concerts, so some Thursdays may be busier than others. While I had a lot of fun visiting a lot of stations, there were a lot of adults that burned most of their time waiting in line to get booze. If you're planning to eat at the restaurant there, be prepared to wait in a long line and then spend more time trying to find a table to sit at. The chicken there was quite tasty and way better priced than anything else you'd find along the Pier, so it's definitely worth a try if you're hungry.", 
    "review_date": "2013-06-16"
  }, 
  "1scP-I_N0AsKLVdzPe3YIw": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Darryl S.", 
    "review_text": "This place is pretty awesome. Totally unexpected and had no expectations. Some complained about the $15 but c'mon it costs money to pay for these exhibits in sf. Didn't drink but there was drinks and wine available for everyone.  If highly recommend checking it out at least once. Fun fun and fun!", 
    "review_date": "2013-09-05"
  }, 
  "FIlJ2W-dfrlfVQm4KZsiXA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi P.", 
    "review_text": "I do like the concept of 'No kids allowed' since I am a young adult who likes to have a few drinks but I didn't really enjoy it here.    The lines for the bar was super long AND it's cash only AND you can only buy one drink at a time AND there's only like 10 things to choose from.   It was really pack at each exhibit making it hard to experience everything since most things you would need to sit down and do it hands on.  The layout was kinda hard, since it wasn't straight forward or in a circular shape.  I do think it's nice that it's so much bigger now but I don't think the After Dark experience was that fun.", 
    "review_date": "2013-07-05"
  }, 
  "h9AS6_xuu_9U058y-cYgRQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Neville B.", 
    "review_text": "I am glad that they moved.  I had visited the old site way too many times and now it feels fresh and new.  There were definitely some new sites and activities to see.  Warning:  two hours is not enough time to see everything!   Only thing is, I think there should be more bars available.  The space is so huge, it's quite easy to lose your friends or find them.   There is an indoor and outdoor area.", 
    "review_date": "2013-04-29"
  }, 
  "cvNHL2TIus0dKSZOlGwC8Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Pam S.", 
    "review_text": "While I still have a certain nostalgia for the old Exploratorium location near the Palace of Fine Arts, I do like the more accessible location of the new Exploratorium, and the nice view of the Bay Bridge on my walk there.  As for After Dark itself, the drink lines were waaaaay long, and they were really pricey/cash only.  I did have a lot of fun checking out the exhibits with my friends.  Adding a few drinks to the mix always seems to make things so much more entertaining anyway, doesn't it?", 
    "review_date": "2013-08-25"
  }, 
  "OXYtOFX9xXukagW5Ku5dfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sofia R.", 
    "review_text": "Exploratorium is great as long as it's new to you. If you go once, it's not as fun the second time no matter how many drinks you put away.   Food court looks WAY better than the one at NightLife but it is also WAY expensive.", 
    "review_date": "2014-03-23"
  }, 
  "zcGjmm1fRERP8mBxV6tAIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina K.", 
    "review_text": "I'll update this review once I've gone a few more times since this was my first trip to the new reopened museum. The lines were long but that's to be expected when a museum first opens...   Pros: The outdoor space is lovely and my kiddo enjoyed crawling around the gyroid structure at the entrance.  The staff - as always - were really helpful and friendly.  The restaurant food was absolutely delicious and we enjoyed being able to eat outside right on the water. We had the pizza, fruit salad, milk (and a cookie for the little one). The price wasn't as bad as I thought it would be - around $16 for all of it, and the server even served up extra banana slices for us when my son mentioned he loved them. Hands on. This is truly a hands on museum. Nothing holds a toddler's attention for long but this place comes close!  Cons: I was a little surprised that many of the exhibits were the same ones from the old location - though there were a lot of new ones too.  The restaurant trays weren't big enough to fit two plates. $25 tickets - yikes. Glad they have free days here. Limited/bad signage. The first thing I noticed walking in was the arrow on the \"enter here\" sign was tiny. People with tickets were waiting in the really long \"to purchase\" line because we were unsure where to go. Inside, it was hard to track down bathrooms and there were little to no signs letting us know where to find food. It's shocking how many parents are oblivious to the lines forming behind their children playing with one of the exhibits. What ever happened to the taking turns rule? (This is really a parent-related complaint though I wonder if having more staffers at the popular exhibits moving people along would help each kid feel like they have a turn.)  Can't wait to try the place out again on a day that isn't so crowded!", 
    "review_date": "2013-05-30"
  }, 
  "0t-O5--DOfS55A620fO_GA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea H.", 
    "review_text": "For $15 I was entertained for a solid 4 hours-- and that's not easy to do!  First of all, the Exploratorium is much larger than it looks from the Embarcadero.  After wandering around for 4 hours I still don't think we covered every exhibit!  This is ok because we are definitely going back next month :)  There is certainly no shortage of bars throughout this event and the lines to obtain a cocktail were non-existent or minimal.  Seriously-- even the auditorium that we ducked into for a presentation had a bar in the back!  Sweet!  The far east end of the Exploratorium has a terrific view of the water and the Bay Bridge light show.  We spent the last 30 minutes or so of this event hanging out and taking the view in.  Oh, and of course a bar was nearby so that was cool too!   Side note:  My group of friends had a few happy hour cocktails at PIer 23.  This was an awesome meeting point and it's very close to the Exploratorium!", 
    "review_date": "2014-07-09"
  }, 
  "9mSQt20-HY5bycsWPFeLZQ": {
    "user_rating": 5.0, 
    "user_location": "Cambria, CA", 
    "user_name": "Sasha W.", 
    "review_text": "What a fun idea!  My husband and I drove into the city after a fantastic dinner at the Townhouse in Emeryville and had a blast.  We unfortunately only had 2 hours to \"play\" so will definitely return.  \"Refreshments\" are limited, so would suggest you enjoy them before and after.", 
    "review_date": "2014-08-28"
  }, 
  "x2-TP8fd4G0OqkgDyKt3IA": {
    "user_rating": 5.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Elaine N.", 
    "review_text": "I have always been a huge fan of the Exploratorium! I love that all the exhibits are hands-on and that they really stress that you experiment and try everything. I was pretty sad when the old Exploratorium closed (I had one last visit before the Palace of Fine Arts location closed forever). But now that I've seen the new location, I'm in love. The location at Pier 15 is HUGE and I love that it is very accessible by both MUNI and BART. It's even more awesome that they have After Dark every first Thursday of the month -- $15, 18+ only, and alcohol is served all night. I love kids and all, but fighting them off to get a turn with the exhibits during the daytime gets annoying! There were so many exhibits, we could barely finish all of them in one night, I guess that means I will need to visit again soon!", 
    "review_date": "2014-01-27"
  }, 
  "S2xFYP8M7AxzxLacDIMgZg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "Huge fan of the Exploratorium. It just reminds me of being a kid. I never seem to read the instructions, I just end up touching everything and trying to figure it out on my own. It's about trying new things and figuring it out.  They also do After Dark every first Thursday of the month. Drinks are served ($5 beers, $10 cocktails and like $7 for wine or something like that). It's so cool to be able to walk around with a fun crowd and just play. I can't say enough good things about this place. Absolutely LOVE IT!", 
    "review_date": "2013-11-08"
  }, 
  "SlK2n98MVsq1rctfPc8Sng": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roberto G.", 
    "review_text": "I was there for After Dark on 6/6/2013. Exhibits were fantastic and the wait was not all that bad. Tip, buy your tickets there and then you can skip the long line of people that already bought tickets. The reason I am giving this event a one star is the fact that they do not have a coat check. Instead they have these pathetic lockers... This is not high school!! I figured that such a busy adult event would have had a coat check. People, like myself, come straight from work with briefcases or gym bags. It was annoying carrying all of that around the facility. FIX THIS ASAP.", 
    "review_date": "2013-06-07"
  }, 
  "XnClYmLG2mBcha2JaeMB4w": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Kathleen N.", 
    "review_text": "Had fun but probably won't coming back. It's a good one-time experience.. But it was so overwhelming with so many different activities going on at once. The inside kid in me wanted to go crazy reading and playing with all the gadgets but there was so much that I didn't even know where to start! A lot of the exhibits were just a refresh of the things that we've all been taught in grade school .. Explanations of optical illusions, how our eyeballs work, and color play just to name a few. There were also experiments to engage in with a partner such as a lie detector and a \"gut instinct\" test, as well as talking to each other from across the room (pretty darn amazing!) I must be getting old because a lot of the exhibits gave me a headache with all the lights flashing in my face and the spinning boards. I can see that this is truly a place that's catered to little ones. Adults.. Ehh.. Not so much.  We opted for the foods at the food court and I have to say that it is absolutely not worth it at all. Overpriced with sub-par quality foods as well as small portions. We had the macaroni and it was watery and almost flavorless. The other dish was a cheese enchilada and nachos that were of microwave quality. Skip out on this.  The theme for the night we went was \"Rock, Paper, Scissors\" and they were offering haircuts as well as held a huge game tournament. I had fun for the most part and I enjoyed my time there but I wouldn't see the need to go a second time. We were able to run through everything at least once and we left pretty satisfied.", 
    "review_date": "2012-01-10"
  }, 
  "a1jaqBDi3A71yS8fA6ckYA": {
    "user_rating": 4.0, 
    "user_location": "Burbank, CA", 
    "user_name": "Corie L.", 
    "review_text": "Nightlife cost $15 :D you can go buy online or in person. The exhibit is about the same as during the day but most things during the day. Day costs $30 or so. These are non-member prices by the way.  Came here first time and I enjoyed all the hands on displays. It takes up the whole pier. Adults come here after work and to relax and they do serve alcohol. No it's not open bar. But overall I enjoyed my experience here.  Difference between day and night:  Day: you wait with after kids for the displays Night: you wait in line after adults to play with the displays (depends on displays just cause some tend to be more crowded than others just keep your eye open and look at other things and come back to the less crowded later", 
    "review_date": "2014-08-17"
  }, 
  "zPxvMIlv0W0HgTlMoU-WaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruby C.", 
    "review_text": "Been to the Exploratorium a few times back when it was next to the Palace of Fine Arts. At this next location, there are more exhibits since the space is larger. The After Dark event is neat since there aren't screaming children running around &amp; you can browse around with a drink in your hand. The tactile dome was a great experience!", 
    "review_date": "2014-01-03"
  }, 
  "JjTusdmnjHxKe-Kqwr0YGA": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Albert H.", 
    "review_text": "I am, in principle, thrilled that more and more museums are doing these evening events for the more adult crowd.  It's great to be able to wander around with a drink in hand and without kids getting in the way.  Only problem is ... it's often *too* popular.  We went for the Gastronomy night, and fortunately arrived early enough to find street parking ( I heard a lot of people grousing about being unable to park later ).  We also had the foresight to stand in the first line we saw once we got in the door, and just barely made it into the auditorium for a presentation.  When we came back out, the line stretched about halfway down the building - no way there were going to get everyone in line into the auditorium.  We spent much of the rest of the night standing in a very slow line trying to get a drink.  Don't get me wrong - it's a great museum, but the crowds and lack of competent crowd control that night made the experience worth a lot less than it could have been.", 
    "review_date": "2012-04-10"
  }, 
  "rdYds7DdlCczgctT7WzNlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynn T.", 
    "review_text": "Buy the members pass, and you can hit up any of the after dark events for one year. it's about the same cost as buying separate passes for 2 after dark events.  I went to Sugar a couple of Decembers ago, and totally love the experience. Way more enjoyable than CAS's night life.   There were vendors, tasting tables(all types of sugar served in a variety of ways... macroons, sugar cane, and other cultural treats), demos (Sugar Masters who turned sugar and chocolate into art.), and interactive activities. At the same time you get to play with their permanent displays/installments that lets you explore your senses through art and science.   Worth more than the $12 price.", 
    "review_date": "2012-02-19"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "I'm really going to miss this place when I moves to the Embarcadero.  And I'm really going to miss the monthly \"After Darks\".  Drink plus learning plus music plus crawling around in the dark through a maze of tunnels?  there's nothing like it.  I'm sure the new location will have the same feeling as the new Academy of Sciences, great, modern, clean, and better lit... but sometimes, you can't compete with a classic.  I've heard people say the new location will have better parking.  Seriously? have you BEEN to the Embarcadero? And I don't even want to think of what will happen in a few years should you have a Giants game AND a Warriors (new stadium pending) game on the same night.  All the pedicabs and extra MUNI trains in the world won't save you.", 
    "review_date": "2012-08-09"
  }, 
  "zokfv2tiS3NEaAl9IW-LiA": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Earlene C.", 
    "review_text": "Too much fun! The Exploratorium was always the cool field trip to take in elementary school. 20 years later, it is just a fun as I remember it to be!  There are a ton of hands on exhibits that let you play with the laws of nature and tickles your scientific mind.   Some friends and I had way too much fun with the Lie Detector Test, the Shadow Box Room and the Listening Vessels.   It's a unique place to go for a night out. We'll definitely be back! There's just too much to explore!", 
    "review_date": "2011-02-06"
  }, 
  "Ibvdl6OEndPYBLaI5TX9DA": {
    "user_rating": 4.0, 
    "user_location": "Silverdale, WA", 
    "user_name": "Jess W.", 
    "review_text": "What's better than a beer or cocktail mixed with science fun? I'm not sure what could top this.. but the after dark adults only Exploratorium experience was one of the most fun times I've had downtown!   Every Thursday 6:00-10:00pm, $15 per person to enter. There are beer/wine carts throughout the place to 're-up' your alcoholic beverage requests. And the Cafe in the back has a full bar as well.  Definitely fun with a group of people. You will feel like a kid again. I would suggest to do this after dinner or plan on getting dinner afterward because the cafe can get pretty busy and I wasn't hearing good things about the food while sitting at the bar.", 
    "review_date": "2014-07-25"
  }, 
  "sMfAazU842DN6NNTC7PUuQ": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Anna P.", 
    "review_text": "The Exploratorium's \"After Dark\" events are held on the first Thursday night of every month for adults-only (6-10 pm). Bars are set up all over the museum with special exhibits, presentations and performances related to different themes each month.   Even though there is a parking lot, parking is quite an issue at these events if you come late. It does get crowded later in the night but at least you can be pushing people the same size as you out of the way to get to an exhibit instead of running over little children.  You can order a \"After Dark\" membership online and can pick it up at the museum for quite a deal. The membership is a year long and allows you access for \"After Dark\" events as well as a discount at the museum store. Definitely worth it.", 
    "review_date": "2011-02-03"
  }, 
  "bwDMEak5Webut2H0E5xMdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janet T.", 
    "review_text": "A place for curious minds.  I like this place!  Although a little crowded and it seems as though they tend to place exhibits in a random fashion in the building; nonetheless you'll find a section that you can't leave.  The ExplOratorium is always fun because you get to experiment on your own.  They've brought over a few exhibits from the old exploratorium which is nice because the experience becomes a bit nostalgic for those who remember the old one.  After Dark opens every first Thursday of the month which explains the crowdedness.  Come early if you plan to seek out the exhibits.  We watched a show about the history of rap which blew my mind and there was also a break-dancing crew battling it out in the courtyard last week.  It's nice that there is an outdoor space and a segregated cafeteria.  It's easy to navigate through the building.  I enjoyed the fog bridge concept because it really encompasses all that is San Francisco during the summer.  The line for drinks can get pretty long.  Again, the earlier you make it in, the less crowded it is as you make your way through.  Since this site is located at around Pier 15-17 on the Embarcadero, you can opt to take public transportation (BART, Muni) or park in the outdoor lots.  There is also validation for discounted parking in the Embarcadero shopping centers.  Even though it can get a little tough to get to this location, there is a reason it's on the Embarcadero.  From the observatory you can see the Bay Bridge lights and the city skyline upclose.  It's quite romantic after dark :)  I'd come again :)  Getting lost in the crowds and stopping to ask strangers questions about what they think is going on.  It's part of the experience :)  I love it.", 
    "review_date": "2013-08-09"
  }, 
  "be_VC6SjhIABLvpGqRlMow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Veronica H.", 
    "review_text": "Came here in February and it's a fun way to spend an evening. Lots of people but not overwhelming. There is a ton of interactive stuff, some more fun than others, but all pretty educational in one way or another. Some of the displays/activities seemed like they were a bit worn down though. But you definitely get to feel like a kid as you wander around exploring the different exhibits.   Come with a friend, a honey, or a group - it's easy to split off and then find each other again later. There's a lot of tactile things so if you are a germaphobe,  you will be reaaaallly uncomfortable. I definitely had to wash my hands afterwards - they felt grimey.   Parking is free and pretty easy when we arrived around 6:30ish. The best part is the Palace of Fine Arts too - definitely plan to walk around before/after you do the Exploratorium. At night, it's beautiful.", 
    "review_date": "2012-04-05"
  }, 
  "2Yg3D3xUNNzmn-SicXZOnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy C.", 
    "review_text": "This place is amazing! Whether you go during the day or night. I guess since I'm an adult, it was better for me to go at night not only because of the alcohol (about $5 for canned beer and $8 wine), but also because you get easier access to all the exhibits and not having to \"fight\" with the kids for all the hands-on exhibits.   The place is like a long rectangular floor plan with divided science topics.My favorite had to be the Living System with all the plants, insects and such, as well as upstair in the Bay Observatory Terrace. The terrace has a open balcony with the view of the Bay Bridge! I think it'll take more than two to three hours to finish going through everything--it took me two hours to walk through both wings, but I selectively check out some and not all exhibits.   Parking is pretty convenient, there is a parking lot across the street but charges $15/hr after hours. I suggest parking on the street and pay the meter for about half the price.", 
    "review_date": "2013-05-16"
  }, 
  "JiUmz7l4rNz4-YmOj13i9g": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Vicky L.", 
    "review_text": "Tonight was my first time ever to the Exploratorium, and I had a great time! I was happily surprised that the After Dark programming was geared towards adults, while using the usual displays. It was pretty crowded. There is usually a few people in front at every display, but they moved on fairly quickly, so I was able to see the display. I kept losing my friends and bumping into people though. There is a lot to see.   I wish they published that night's program earlier or online so I can plan out my visit better. There were a lot of shows and discussions that I was pretty overwhelmed and didn't really know where to start.   Drinks were pretty expensive. I'm just not used to paying for $9 glass of average wine.   Pro-tip: Excellent place for first date. If you guys have trouble finding things to talk about, you can always go play at the next display.", 
    "review_date": "2014-02-09"
  }, 
  "wZG2xlICfUkJiY1NdPJH2A": {
    "user_rating": 3.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Naomi K.", 
    "review_text": "I loved taking my school kids to the Exploratorium but chasing after them was a lot of work. It was nice to do an \"adult\" night, and actually try the stuff out for yourself- however I must have picked a popular night. The gastronomy definitely drew in the foodie crowd and boy was it ever crowded. Exploratorium didn't seem to worry much about capacity but it was too crowded to actually try many of the exhibits, old or new. There were just too many people and the lines were very long. A lot of the special booths ran out of food samples before the lines finished. It doesn't seem like an easy place to start random conversations or meet people either. People are already in groups or on dates and are preoccupied with the exhibits.  I do have to give the Exploratorium some credit for giving a student discount, even Cal Academy doesn't do that in the evenings. Some of the old exhibits are just as fun as I remembered when I was a kid. I saw some ad about them relocating to another space- I hope they don't get pushed out. This is a classic.  The one take home lesson that you can actually do (since most of us don't have easy access to liquid nitrogen, etc) is wine + blender = hyperdecantation (decanted faster and tastier!) Give it a blind taste test and determine if the 5 volume cookbook set stands up to the test.", 
    "review_date": "2012-04-24"
  }, 
  "CxWcGXtQSRJn6_C241xC9A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Angelica D.", 
    "review_text": "While I much prefer the Academy of Science's \"Nightlife\" (<a href=\"http://www.yelp.com/biz/california-academy-of-sciences-nightlife-san-francisco\">yelp.com/biz/california-…</a>), in terms of uniqueness and sheer AWESOMENESS, the Exploratorium's \"After Dark\" once a month on Thursdays is a must-try for anyone over 18.   It's all the fun of the Exploratorium (science presented in fun and often amusing ways), except at NIGHT, with ADULTS your age and oh, did I mention the full bar? Hands down my favorite exhibit is the Shadow Box in the far corner of the venue--try it out and you'll see why!  After Dark runs from 6-10 p.m. and costs $15 for gen admission, $12 for students with ID (drinks sold separately). They also have cool workshops that change every month (but you have to get there early to sign up for a good slot!).", 
    "review_date": "2011-01-11"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "The after dark experience here sucks.  My lioness bought a groupon for membership so we will have to go back when the entire city isn't here at night.  The Cal science museum still has the best night xp cuz they have cool animals to harass when drunk.", 
    "review_date": "2013-06-12"
  }, 
  "JQ1iRiBigVstJVH3QLT-OA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Morgan W.", 
    "review_text": "I love the new venue for the Exploratorium, I absolutely love it.  Watching the Bay Lights display from the observation deck was wonderful.  They spruced up a lot of the exhibits and added more curiosities, like the \"tinker\" stuff.   However, the current California Academy of Science Night Life blows the Exploratorium's Night Life out of the water.  The cocktails at the Exploratorium were more overpriced, and they overbooked the hell out of tickets.  For such a hands-on place, especially during the narrow circuitry exhibit passage, I wanted to not be bumping into five hipsters per minute (5 hpm) with a buzzing ear.  Oh well, of course museum nightlife is still a great idea.  Maybe it'll be less crowded and more enjoyable when the novelty of the location wears off.", 
    "review_date": "2013-08-03"
  }, 
  "lbrxN0BHNMNUXj0dAe-dQg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D G.", 
    "review_text": "HOW DO YOU GET TICKETS?!?!?  I'm on my 4th or 5th click off of google....not acceptable :)", 
    "review_date": "2014-06-03"
  }, 
  "WGDlDc6K3zYRgEZSJlqYCw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Liza C.", 
    "review_text": "You know...I had high hopes for this...and it didn't quite deliver. I used to go to the Exploratorium all the time when I was a kid and absolutely loved it. Going back as an adult was a sobering experience because I realized not much has changed since I was there 15 years ago. Some of the stations were pretty interesting but some of them were old and didn't work.  I enjoyed the After Dark experience mainly because my manfriend and I could walk around and not have to deal with crazy kids everywhere...and the booze helped :) Caution: DON'T eat the food there! My date got sick from the ahi tuna wrap and I thought the popcorn tasted like cardboard.   Bottom line: Cool to do just once, especially if you have never been to the Exploratorium before.", 
    "review_date": "2012-02-05"
  }, 
  "a4lwrXr3BoEYcJvZAafogw": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Bored P.", 
    "review_text": "As somebody who is interested in science, cool places to hang out in the city, and avoiding a cameo appearance in Lord of the Flies (See; the Exploritorium in the daytime), this was an extremely fun time.   I didn't go during one of the nights when a sponsored event was being held, so the crowd was manageable and respectful. All the exhibits opened up after only a few minutes, and I was able to see almost the entire building in around two hours. This is not a place to rush through, though! Grab a cocktail, find a place to hang out, and either enjoy the beautiful view of the Bay Bridge (and the bay itself) visible from the back of the Exploratorium, or enjoy the exhibits throughout.  I wouldn't have dinner here, because the food is a little overpriced and not that great, but it's the Exploratorium, not a restaurant! Plan a nice dinner for after it closes, or hit Mel's afterward like my party did.   Even if you're not big on science, give this place a try.", 
    "review_date": "2014-08-03"
  }, 
  "qkreXL6AorI19QA3f2wvlQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vira P.", 
    "review_text": "It was my first time at the After Dark event at the Exploratorium.  I went because of the flying machine (which was totally amazing btw).  If you like going to the Academy of Science's NightLife event, then you'll definitely like this one.  After Dark is a great way to explore this museum as an adult.  It can get overwhelming as there is so much to do!  But the event lasts for 4 hours so if you're not going to any of the special demonstrations, you can easily pace yourself.  But if you've been before, then I say enjoy the exhibits and atmosphere!  The drinks are around $5-$9, and there were only 2 food stations when I went (steamed pork buns for $3 each and shrimp tostadas for $5 each).  I didn't check out the Sea Glass restaurant, but I won't be surprised if the prices were high.  There are other places in area to eat, so I'd eat before or after.", 
    "review_date": "2014-08-09"
  }, 
  "cDG7Tx7kUxYmJz108Vg57g": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ray C.", 
    "review_text": "I absolutely love the exploratorium after dark!  It's like going to the exploratorium, having all the hands on fun you normally would, seeing all the interesting things, without the annoying kids, and having the magic of booze so you forget to be annoyed that none of the exhibits come with any explanation - yeah I do want to know how some things work thank you!  The one I attended had a petting zoo with snakes and crocodiles, and they brought along a wild cat and tanks full of creepy crawlies - exactly what you need to appeal to that inner child.  Best exhibit? I couldn't really say, whilst there was some gratification electrocuting strangers (by my explaining at one exhibit which generated an electrical current, that if I touched them this would increase their body mass and thus the affect of the current on them), and also playing drunken 4 way PacMan... Everything was pretty fun and I was impressed with all the great stuff they had.  One issue was the price, at $15 a ticket and then $9 a wine - it can get expensive - that said, it was totally worth the cost.  And although I caught a couple of the talks, I have to say, I would in the future just skip these and run out to play!", 
    "review_date": "2014-10-09"
  }, 
  "FYhBWQ1tX9rRnC5vx1bWxg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Joey B.", 
    "review_text": "A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G! A M A Z I N G!", 
    "review_date": "2013-12-19"
  }, 
  "RwYpOuwWaBecLEcqFNliDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Kate T.", 
    "review_text": "The Exploratorium is the most compelling museum I've ever been to! The \"After Dark\" event is a must-attend for anyone who's even mildly interested in science, drinking, how interesting phenomena work, or all of the above.   Location/Atmosphere-5/5. First of all, I love the Embarcadero, and how unapologetic-ally tourist-friendly it is. The museum itself has an amazing layout. It's  modern and open, dimly lit to emphasize the exhibits, and easy to walk though. Every 15 inches or so there's an exhibit to look at, touch, and experience. I've gone twice to this event and haven't managed to see every exhibit. If you make it to the back of the museum, there's a trendy bar, SeaGlass Restaurant. The decision to have Exploratorium After Dark be adults-only is brilliant. Why go to a regular bar when you could go to a top-notch museum that effectively functions as a bar? The no-kids policy gives it a nice vibe, and makes it a \"safe space\" for grown-ups to walk around buzzedly and examine earthly marvels in wonder without having to worry about being impolite if you're blocking a 7 year old's view of the cloud chamber.   Exhibits-5/5. My favorite wing is the Living Systems gallery; I'm consistently blown away by live chicken embryos, touch-sensitive plants, algal mats, and giant logs. Upstairs there is a Landscape gallery that has a fog machine, cloud chamber, rift machine,  and even more..The cloud chamber was amazing; you can see alpha radiation from the decaying lead on the brass rod in the middle of the chamber. I also love the Central Gallery, with exhibits on diffraction and other light phenomena.   Food/Drink-3/5. The first time we went we had Mahi Mahi tacos and Papas Bravas to eat; they were very flavorful and delicious. The drinks were a great selection and reasonably priced, as well! The second time we went my friend and I actually both got ill from our food--vegan chili--which was unfortunate. We were both sick for a day after attending. This is the reason I'm giving 4 stars--I would go there again for sure, but I'm hesitant to order their food, now.   Overall: This event is my favorite that I've had the pleasure to attend so far in SF!", 
    "review_date": "2015-01-23"
  }, 
  "aZejV7wXqrttp3gNpWjmBA": {
    "user_rating": 5.0, 
    "user_location": "La Jolla, CA", 
    "user_name": "Amber Y.", 
    "review_text": "Great place to bop around and have some fun. Grown ups love it, kids love it.   Bring your curiosity.", 
    "review_date": "2013-11-04"
  }, 
  "Syt_iQqW_c9T2_lrvsddqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gwynnie p.", 
    "review_text": "The most fun I had at a recent \"After Dark\" event was watching the crowd have so much fun! The delight and smiles on everyone's faces as they played with the exhibits was just great. I kept walking around smiling at everyone smiling. How many evenings do YOU spend doing that??!!", 
    "review_date": "2011-10-10"
  }, 
  "2xb2kHnC-mFhtGggWBhZFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krista L.", 
    "review_text": "I've been here a few times and had wildly different experiences, but all the basics are still good: fun stuff to look at, play with, and learn about in a really big space.   Overall, I like After Dark because I don't have to fight children for the chance to play with the exhibits. The booze helps, too. (This is also what's great about the Cal Academy's NightLife, though that's 21+)  Sometimes there are maps, which help tremendously. I wish they'd offer those all the time, or post floor plans in each wing to orient visitors (I did see a couple signs with arrows, but not maps or at obvious junctions).   It seems there are two very different After Dark experiences:  -1st Thursdays of the month, which are heavily marketed, have partners presenting demos around a theme, and are pretty crowded, and: -other Thursdays, which are not themed and while still lively and have in-house demos, are not very crowded at all.   Pros: -no kids = no guilt for playing with the interactive exhibits.  -is 18+ (so I can bring my sub-21 coworkers) -live demos and friendly staff. One station was dissecting a cow eye last night! -enormous, so I can go multiple times and see new stuff/skip stuff I find less interesting but still feel I got my money's worth. It also seems they change some things out pretty regularly.  Cons: -group tickets aren't individually printed, so you have to arrive together or have someone with the ticket meet them at the door.  -food is pricey, without a ton of variety. Filling, though.  -hard to prioritize what you want to see without a map.  -enormous, so you won't be able to see everything in one evening/would get tired or overstimulated spending the entire 4 hours trying to do it all.", 
    "review_date": "2014-08-02"
  }, 
  "UgOhVGUOMfCPFt7AF5MWog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsey G.", 
    "review_text": "This was awesome!  I'm a total kid at heart and the exploratorium did not disappoint my inner child!  First of all, this is a great date night.  You're busy enough playing with all the gadgets that you barely have to talk to each other.  And if you do wanna get chummy there's delicious and STRONG cocktails at the bar to get you all liquored up.  We opted for option #2, it's not like me to turn down a fancy cocktail...  Ok, so once have you have the drink in hand, time to explore!  There are endless things to do here.  I spent a good 15 minutes just staring at the goldfish tank - they were some kind of mutant goldfish - I'm not crazy.  I was also loving the optical illusion section with tons of different mirrors and other things to stare at.  If you're overly competitive like myself, there's tons of things you can turn into games, just use your imagination and yell \"I win!\"  I definitely can't describe all the exhibits, just be sure to make a trip here.  I can't wait to come back and see everything I missed.", 
    "review_date": "2014-10-09"
  }, 
  "Viy5aHH06oo2Po3rT52u-A": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "A R.", 
    "review_text": "The \"After Dark\" event is on the first Thursday of every month. The event is only for adults, it was nice since there weren't a bunch of kids running around, screaming, and crying. It takes place from 6pm to 10pm and they serve alcohol, with a few bars set up in various places around the museum.  I had fun, and this was my first time going, however it will probably be my last. The exhibits were cool but not too exciting. People were definitely on another level at this event, and it was pretty obvious that some people took full advantage of the alcohol being served.", 
    "review_date": "2012-01-25"
  }, 
  "lCB2P0vuS1M7rdhRSI2Cyw": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Katherine F.", 
    "review_text": "The old STEM folks were in heaven....three ex-labbies and a programmer played for several hours.  We took our daughter many times to the old location and she in-turn has taken the DGD's here, but we had not yet been to the new facility.  Not far from BART, very big with many, many fun displays. Wow....location location!!  Beautiful views at night...  I love that this is adults only....then you can get your hands on without risking taking a young persons turn.  My personal favorite?  A clear sphere that demonstrated the concept of particle acceleration.  Just resonated!  We could not get to everything.....  We did attend a lecture on Lasers. For the three ex-labbies it was cool to see our joint ex-project featured as an application. Did we learn anything?....maybe not ;-)  What fun!!", 
    "review_date": "2015-01-23"
  }, 
  "zQxDUhxKOHdZygnNRZ-4ng": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiff W.", 
    "review_text": "unfortunately I did not enjoy this experience, way to many people. Lot of great things to see but didn't get to do many because the sold out of everything.", 
    "review_date": "2014-08-14"
  }, 
  "WjvIGdLc7ZZpiux3P6xSEg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina G.", 
    "review_text": "I went last night to After Dark at their new location on the Embarcadero. I am only giving it 3 stars because the huge crowd and lines really hindered my experience. The new venue is at least twice the size of the old location but I felt like I couldn't really enjoy it with the overwhelming elbow-to-elbow crowd condition. The new space is very modern and it has a fancy looking restaurant downstairs (Seaglass restaurant) - I did not make it in there so can't really review that section.", 
    "review_date": "2013-05-03"
  }, 
  "hkEmdF3NXVS7H4CzSDlqkw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin B.", 
    "review_text": "The old Exploratorium setup in the Palace of Fine Arts was a larger room with higher ceilings, and prompted everyone I ever took there to suffer a few minutes of sensory overload when they first walked in. The new campus along the waterfront is longer, but not as tall, allowing you and your guests to drink in the science slowly instead of sucking the science fire hose.  But everything you loved about the old Exploratorium is still here! The toilet fountain, the hanging piano, the interactive playthings, and the great demos. We popped by for Sexplorations, and I was impressed with how cranially-focused and thought-provoking the entire arrangement turned out to be. They challenged and amazed the audience with a variety of tactile presentations that drew in capacity crowds, or let you play all over the multitude of exhibits (some of which I remember from visiting as a kid).   The new campus is way closer to the city, making it a lot more accessible for visitors and city-dwellers alike. My one gripe is that the new thinner design did lead to more choke points as crowds tried to worm their way through the museum. Beyond that, this is a great evening for you and your playful friends. Get there!", 
    "review_date": "2014-02-07"
  }, 
  "B3cOX_VmahpCGvZzyVIEig": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Richard N.", 
    "review_text": "YAY!  I really am a fan.  The first Thursday of every month, the Exporatorium holds a playground for the 18 and over.  The Exploratorium was pretty fun to begin with, but when they add alcohol it gets even better.  The festivities begin at 6:00 and end at 10:00.  Parking sucks.  They have a tiny lot out front that is immediately packed, regardless of how early you arrive.  They have a much larger lot that is a ways away from the entrance and is poorly lit.  I swear we almost hit someone before.  At the February event the lot was closed and we had to park across the street.  Each month showcases a different topic.  January was \"Chill\", focusing on the art of relaxing.  We got there a little late and didn't really get to participate in the featured events, but we still had fun walking around and playing with the stuff they had there.  There are a million photo opportunities there.  We spent a while right up front playing with the bubble wall and the water drop photospeed demo.  Everything is interactive.  February was \"Surrealism\".  If you dressed up as your favorite surrealist you got a discount.  There were quite a few people dressed up.  The biggest event that night was the Alice in Wonderland Tea Party and characters walking around.  It's fun, even when you're sober.  If you are planning on going to more than one event, I would suggest buying the annual pass.  To go to one event it costs $15.  The annual pass is only $30.  I've already gotten my money's worth by going to two events, and I still plan on going to more.  The gift shop has a bunch of fun stuff to play with, too.  If you have an annual pass you get a discount on any merch.  There isn't much to eat there.  They have a cafeteria, but the food is limited and looks like it's been sitting there for a while.  The specialty drinks are STRANGE. We had the drink thats a beer and a shot and it was pretty horrible.  I don't suggest it.  I think this place is a great DATE place.  Especially if it's a first date.  There's a lot to play around with so it's never a quiet moment, alcohol if you're a little shy, and it ends early enough that if the date isn't going well, you can bail.  If it's going great, you can move it to a good late night dinner place and see where that goes.", 
    "review_date": "2011-02-18"
  }, 
  "jipgimnSNp3qdK2dKUQvBg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "The handful of times that I've been to the Exploratorium in it's original location by the Palace of Fine Arts I loved it.  Of course we all have our nostalgic moments.  Bf &amp; I &amp; several Yelp buddies came here the other month for Exploratorium After Dark, add booze to anything &amp; you'll have a better time, right?  And admission at a discounted price...cheapassness ftw!  Admission is still a pricey at $15 though.    There's a lot of the old favorite exhibits and some new ones too as the space is a lot bigger.  We went into the Seaglass restaurant just to say hi to some friends that were eating; the food they were eating looked okay, but man was the restaurant packed.  The museum itself was packed too early on and though there were multiple bars stations, lines got long and drink selection wasn't very great.  My Sauvignon Blanc was awful.    Rounding up to a 3, because it's still cool and due to nostalgia, but different from what it used to be and pricey.", 
    "review_date": "2013-07-31"
  }, 
  "gknlDjIdkrtpf8zvEPs3Cg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Monica L.", 
    "review_text": "I have never been to a place like Exploratorium After Dark before. It's like a club for nerds and artsy people where you can let loose and have your mind stimulated at the same time.  I came here a while back, in August. It was for the Mars Rover landing, and that was the theme of the night. I personally LOVE dressing up (I go to a lot of anime conventions) and so it was cool to see everyone's costumes. I went as Marta from Star Trek ;)  The full scale model of Curiosity was really cool, and the hands-on exhibits WOULD have been cool, if I hadn't drank too much. The alcohol was a little expensive, so I would recommend bringing your own.  There were a lot of people there, so if you don't like big crowds, I would be wary. I like meeting new people though, so I really enjoyed myself.", 
    "review_date": "2013-02-13"
  }, 
  "-8ZM-jzJEGkKCxYEJnFrqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David M.", 
    "review_text": "Science of Cocktails event tonight was an absolute blast. Every cocktail booth was turning it out with super innovative, unusual and delicious drinks (HAAAY Solerno crew!)- TONS of delicious food and hilarious party people- I felt under dressed as people go all out. Thank goddess and Bulo for my hotness shoes.  This event is not cheap, and they limit the crowd to 1,000- this ensures you're never in line for too long for the popular stuff and besides, SCIENCE! A very well run, fun and worthwhile night out- 5 + stars!", 
    "review_date": "2014-01-25"
  }, 
  "oxweEEnMFLCIuFMZxv43hQ": {
    "user_rating": 3.0, 
    "user_location": "Bay Area", 
    "user_name": "Mary K.", 
    "review_text": "Living in the East Bay, it is usually a trek to get out to Nightlife at Cal Academy, so I don't go too often. I was intrigued at the Exploratorium version primarily because I don't have to sit on BART + Muni for a significant amount of time to be able to drink in a museum! It is a quick 10 minute walk from the Embarcadero BART station.   The idea of this museum is great--a hands-on approach to teaching people, primarily kids, science and how it works. I don't think that it works too well in a 21+ adults only type setting mainly because if you aren't at an exhibit or demonstration, you can't really be doing much else. Also since it is a kid's museum, there are lots of things that are meant for small people. Very awkward for the tall people and girls dressed in club heels. The big bar near the entrance has 2 bartenders--one who is cash only and one who takes credit. Not sure if it is like this every time but the long line went by very quickly. Mixed drinks/wine were $9, and specialty beers were $5. There were not really food options unless you eat at the pricey restaurant inside or the $13 sandwiches from a vendor in the outside area (at least Cal Academy has cheap food options as well as expensive). The highlight of the evening was views of SF, the Bridge, and East Bay from the second floor outdoor area. Also it was fun to watch people from above. The outside wharf area of the building has a sculpture that you can climb. Kudos to them for providing a ton of options for seating around the whole space if you aren't lucky enough to participate in the exhibits inside.  I probably will not go out of my way to come back here again like I do for Nightlife at Cal Academy or Off the Grid at Oakland Museum (tickets are $6!!!!!). Many other museums offer similar 21+ events and although this cost few bucks more, I didn't feel like I got my money's worth. I guess it costs more because its a bigger space with a ton of exhibits inside. Who knows. But... nice try.  Also it was sad to see the signs taped up all over the place that said \"This exhibit was created by someone who is about to be laid off.\"", 
    "review_date": "2013-09-06"
  }, 
  "neYMMlTQOAY7UCZiP4iOww": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Rohan N.", 
    "review_text": "Went with a few friends and had a great time! Getting there was a bit of an adventure as we missed our stop and thought we were going to take an inadvdertant trip across the GG Bridge. Luckily, the bus stopped at the toll plaza and we reversed directions.  It was a super low key event but still a lot of fun! It wasn't very crowded so we felt free to meander, spend time at exhibits we liked, and generally enjoy ourselves. Cocktails are expensive so we... brought our own, and that worked out swimmingly.  All in all, highly recommend you check it out before they go on hiatus in September!", 
    "review_date": "2012-07-09"
  }, 
  "oPtHQcHndjSxf10EYIvZPg": {
    "user_rating": 3.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Pamela S.", 
    "review_text": "Ok, so I'd say I had just an ok time here... I had never been to the Exploratorium, so I didn't really know what to expect. It's a cool place to check out, yes but maybe on a free museum kinda day...This was an experience, good date kinda night but nothing crazy exciting. Somewhat overwhelming where I caught myself more interested in people watching than playing around, only so much to do, that could keep my interest, for so long. California Academy of Sciences has a similar night - which I'd say is more enjoyable and would go back to, not the same feeling here.", 
    "review_date": "2013-12-21"
  }, 
  "JRzz9yYsoREvGbBaf22W7Q": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Hannah P.", 
    "review_text": "Visiting from the other coast and luckily happened to be in town on a first Thursday. Went with my mom and sister and had a blast wandering around with beers in hand. We would have enjoyed more elaborate scientific explanations for some of the activities but definitely had some pleasant surprises and wow moments. I'm very happy we missed the daytime crowd and would be back if I was a local.", 
    "review_date": "2013-10-03"
  }, 
  "DZR64EIaMYL3-ZR1lV4A-g": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anna P.", 
    "review_text": "Good place for date night. It gets really blown out by 8pm so get there early and make sure you have cash for drinks. I went last night which was themed Sex. They had a tinkering area where you could take apart and re-assemble dildos! It's a great place for science geeks, has tons of things to see, explore and be interactive.", 
    "review_date": "2014-02-07"
  }, 
  "2844knqT5JznVAJqiDVyBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Judi B.", 
    "review_text": "The exploratorium is absolutely fascinating. Felt like a kid in a huge playground of gadgets and sciency stuff.   The theme was \"carnaval\" and they really did a great job: samba music, dancers, drummers, Brazilian cocktails and food, mask making, etc etc etc.  Had a blast with my friends exploring the permanent and themed exhibits.   Too bad it ended at 10pm. I will definitely return.", 
    "review_date": "2014-05-02"
  }, 
  "OphDzZtaiDs5grWP-Enjpg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curran H.", 
    "review_text": "I decided to start a new Yelp listing for the \"Exploratorium After Dark\" event because it's such a different experience from the regular daytime Exploratorium. Reviews of it in the regular Exploratorium section would just get lost, and very likely confuse parents who are looking for information about the hands-on science museum in preparation for taking their kiddies there. Parents: keep right on looking. This isn't for you.  No, Exploratorium After Dark is a totally different experience. It's more like the \"Matcha\" events that the Asian Art Museum hosts or the ArtPoint ones at the deYoung / Legion of Honor. Imagine the Exploratorium being open at night, with the vast majority of people being stylish couples and singles in their 20s through 40s (and only a handful of children in attendance), two full bars, good music (everything from old Bowie to the Decemberists) piped at a nice low level throughout, the conspicuous lack of the din of shrieking children, and  s p a c e   t o   s p a r e ! How unlike the Exploratorium is THAT?!  Instead of having to wait to use the more popular exhibits, there are no lines. Instead of being rattled by crowds of shouting pre-teens and their harried chaperons, you can stroll around with room to spare, with a glass of wine and a nice buzz. And as a bonus, the Tactile Dome (normally ridiculously overpriced at $20) is just $5, which is what it should always cost (but doesn't). Call me strange, but I somehow prefer crawling around in the dark with attractive adults after a couple of drinks, rather than with hyperactive 4th graders.  \"Exploratorium After Dark\" happens the first Thursday night of every month, from 6pm until 10pm. It's only open to members (or those who buy \"Exploratorium After Dark\" passes), and you must be at least 18. Beer is $5, wine is $6, and mixed cocktails are $7; a little pricey, but how else are you going to be able to drink while operating dangerous electromechanical machinery in a museum setting?  For stylish adult science geeks, \"Exploratorium After Dark\" is nirvana.", 
    "review_date": "2010-09-03"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "This is a great place for a date.  Or double date.  It was not that crowded.  They serve food if you are hungry.  We had a lot of fun and saw a couple of presentations.  There is so much to see, you will not be able to see it all in one visit.  I'd recommend it to everyone.  My fav exhibit is the toothpick display of SF that took 37 years to build.", 
    "review_date": "2014-10-06"
  }, 
  "MjCIBCRp7p4B_ITMWDpKzQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley J.", 
    "review_text": "My first Exploratorium After Dark experience happened last week during the Senses exhibit. A group of friends and I decided to check it out as it's been on our list of things to do for quite some time now. All of the exhibits/pieces were really interesting to interact with. We had a lot of fun playing around with everything, and learning too. It was nice to be able to walk around with a glass of wine or a beer, and not have a bunch of kids running around everywhere. This is a great place for a group of friends or a date. There's always something to talk about when walking around here.  Parking was easy. We arrived around 6:30 or so and found a spot a small walk away from the entrance. Maybe it fills up later in the evening as some people seem to have had difficulty finding it according to some of the past reviews.   I was there practically from open to close that evening and still felt like I didn't get to see it all. I'm excited to come back and do this again sometime. Looking forward to the next themed event!", 
    "review_date": "2011-11-07"
  }, 
  "UPP1RCn3J4rtdmzVEMBoCw": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Ryan D.", 
    "review_text": "+ I now know where my old middle school teachers get their classroom posters + A lot of great exhibits, staff members and new ideas presented  - Membership is only an investment if you visit more than four times a year - Restaurant is super expensive for portions served - Lack of hand sanitizer in exhibits that are touched every second of the day. Yuck!", 
    "review_date": "2013-06-03"
  }, 
  "Ym9bClLm4BVtujNgOVIKzw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Katie H.", 
    "review_text": "What a fun time!  I'm truly still a little, nerdy kid at heart so this really appealed to me just for the concept. I'd had the Exploratorium on my list of things to do since I moved to the Bay area and finding out about the late night events seemed like the perfect excuse to go.  I went with a meetup group and my boyfriend tagged along at the last minute.  It was a great experience on both fronts and I'd definitely suggest this as a date night or just friends' night out.  I loved getting the chance to explore the exhibits without any inhibitions that come with being a 'grown-up' and was so excited to see most all the other attendees took part as well.  There were so many instances of strangers working together to solve (or compete) in various exhibits as well as laughing together when things went not quite as expected.    We got there around 6:30 and walked right in with our pre-purchased tickets (you can just show them on your phone even though they say print them out).  We stayed until closing, and I still feel like we didn't get through all the exhibits, so it definitely leaves more to explore if you'd like to go more than once.   The only negatives were that I wish the talks were a bit more regulated/varied and that there were better food options.  We hung out at the restaurant bar for a bit and chatted with a few people and no one seemed really impressed by the (rather expensive) food.  The night we went, there was a talk on fermentation that turned out to be really interesting, but there were tons of people there so it seemed rushed and disorganized. I almost wish they had some sort of limit on people for the talks.  Also, I haven't been really impressed with their upcoming line up on the talks, they seem to be filling in gaps with random things now that they're having the event weekly.  They don't really match up to the quality of the Cal Academy evening events.  But I think even without the talk everyone would have a good time so I suppose it's a minor quibble.  All in all, I'll definitely be back and will recommend to (and bring) friends!", 
    "review_date": "2015-01-14"
  }, 
  "pois1eQIEqu2tJi36tzH4Q": {
    "user_rating": 1.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "N T.", 
    "review_text": "This review is of the After Dark experience, which was impossible to get into at 8pm.   I checked out the website beforehand, and there was no mention of a limit to the number of tickets sold. I could have purchased tickets in advance, but the website made that a somewhat lengthy looking process, and it didn't seem critical.  Also, there is a student discount at the door not available online ($12 instead of $15).  We started out at 4pm from the peninsula, and needed to eat dinner before going to the event.  Between traffic, parking for dinner, eating dinner, more traffic, and parking for the Exploratorium we got there a little after 8pm.  Hordes of people were leaving, and hordes were milling around inside.  We were met at the door by a smiling, but rather mean girl who was very pleased to give us a lecture on all the mistakes we had made by not coming earlier or buying tickets online in advance.  She said you should come back next week...  Well, I do not live in SF, spent $75 on a zipcar and two hours driving through traffic to get there, and brought an out of town guest who lives over 2000 miles away and will not be here \"next week\" when we are supposed to do everything right so we can be allowed in.  Very poor customer service!!  Also, as far as I can tell the next event is not next week but next *month*!  It turned out the store was not restricted entry, and we could go in there.  We could have also walked around the new building to check it out.  Neither of these activities were suggested by the Exploratorium employee, despite her lengthy lecture to us on how we did everything wrong.  A better approach would have been to say \"I'm really sorry I can't let any more people in tonight, please come back and visit us tomorrow.  Here's a brochure about next month's After Dark event.  You can still visit our store and take a walk around the building\"  Even better would be selling more tickets!  More tickets = more money for the Exploratorium, more happy people, and common sense.  After all, a lot of people were leaving, so there was no way the space was at maximum capacity.   Overall, this was a horrible experience.  This is a poorly run/managed event and the staff members are not at all well trained in empathy or customer service.  We were treated like naughty children, not like valued customers or welcome visitors.    It might be a fun event if you jump through the website hoops, or skip dinner and show up at 5:30 to get in line for a ticket.  I'm not very eager to find out anymore though.  Note:  This is a very bad event to attend if you are easily stressed out, don't like massive crowds, or suffer from sensory overload issues.  As other reviewers have noted, parking is also a disaster ~ the \"official\" parking lot (~$5/hr) was closed and full and there aren't a lot of other options at any price.", 
    "review_date": "2013-06-07"
  }, 
  "zjtQJ8eYWVedJpWB2sFB2g": {
    "user_rating": 3.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Rachel C.", 
    "review_text": "This is the second place I've gone to where it's a family museum by day and on Thursday Night it turns into Adults Only.    It's similar to California Academy of Science Night Life.  Only difference is they don't have a live band, dance floor and you get to touch all the different tinker toys.  They serve booze here all over the museum but it cost $$$.  Which is not worth it in my opinion, since the Pier is full of restaurants that can provide you liquor at the reduce rate.  We came here on 4th of July.  Our intent was to watch the fireworks from here, but later found out it was not visible from this location.  So sad face :-( but we found an alternate place and walked to Coit Tower.  On 4th of July, the theme was \"BOOM\".  They showed different demonstrations of things that would blow up.  We weren't able to stay for the main event, since we had a long walk ahead of us to Coit tower.  We were able to experience this place WITHOUT KIDS!!!  Ok, I love kids, don't get me wrong, but when we came here the first time, during the day.  It was infested with kids.  I wanted to play the pin ball machine but they were hoarding it, as if they never played a video game in their life.  I was like damm, did your parents ever teach you about sharing and manners.  I had so much fun playing with the different toys, I felt like a kid for a moment.  Did I mention NO KIDS!!! Just in case you missed that part above.  411:  The Exploratorium After Dark is only available the First Thursday of Each month, unlike California Academy of Science which is every Thursday night.  Fee: $15 (General) $10 (Members)  They give validations at the Embarcadero Center Garage $10 &amp; Levi's Plaza $10 (4 hours)", 
    "review_date": "2013-07-23"
  }, 
  "WWHgHMeA93HRpxAaqq4W1Q": {
    "user_rating": 5.0, 
    "user_location": "Saint Louis, MO", 
    "user_name": "Katherine Y.", 
    "review_text": "This was a lot of fun but make sure you go right when they open so you have enough time to explore everything you want to!", 
    "review_date": "2014-10-26"
  }, 
  "C7OKvBYjMzEr81l1u2drYg": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Joe N.", 
    "review_text": "I had recently watched the episode of How I Met Your Mother where Marshall was trying to get the gang to figure out whether he was doing certain stupid actions when he was drunk or a kid, when Google offered a two-for-one deal for this place.  I thought that it was a sign that I needed to go here since I used to love going here as a kid and being drunk is potentially the closest we'll get to being kids again.    I was pretty disappointed by this place.  I guess I was expecting drinks to be a little cheaper, so everyone could just get hammered and run around playing on everything, but that probably wouldn't be fun for the people that had to clean up the mess. Instead, my friends and I went around playing on weird contraptions while we were pretty sober.  I'm rereading this and it doesn't make much sense, but I'm posting it anyways...", 
    "review_date": "2012-02-14"
  }, 
  "0hYKETd0tbjHhLz3MLvNwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miquela S.", 
    "review_text": "Attended the \"Get Surreal\" event this past Thursday.  What's not to love about enjoying an alcoholic beverage and playing with sand, bubbles and magnets? It's amazing. It's like a drunken trip down memory lane. The boy and I walked around outside and climbed one of the structures to drink a few brewskies before going in, because we'd heard the drinks are pricey and we're young lovers on a budget...good plan! once inside we decided to splurge and get the specialty cocktail which advertised a splash of absinthe.   Well, that was probably dumb, but we were drawn in by the enticing idea of having absinthe in a science museum. It was tasty, but it was very weak and tasted mostly like sprite and lemonade with a \"mist\" of absinthey licoricey taste on top. So yeah, I would recommend going with your staple mix drink, wine or beer to get the most for your money.  One thing I have to mention in the tactile dome. IT IS A MUST DO. I don't think I'm very easily freak-out-able, but the first few minutes of total visual deprivation were intense, heart pounding and TOTALLY AWESOME. Tip: wear socks, cuz you can't wear shoes. If you want to wear heels and look hot, stick some in your purse because think of all the little baby snot nosed kids and people with athlete's feet who have gone through there before you!", 
    "review_date": "2011-02-05"
  }, 
  "gdTAebkameev_DQq_NCZzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine W.", 
    "review_text": "Been meaning to check out the new exploratorium! Came here on a Thursday for their after dark series. Admission is cheaper at only $15 admission. But they do get ya with the drinks. Beers are $5 and cocktails and wine are $9. The bars do accept cash or credit so that is nice. Also I didn't see a food court so make sure you do snack a bit before getting here.  The space for the exploratorium is really big! There was lots to see and do and so I do want to come back soon. I don't feel like I even saw or did half of the things that were there.  You'll see crowds around certain popular exhibits and you'll probably won't want to wait but you should. It's an interactive museum so wait for the exhibits. None of them take too long so it's not too bad. Also they are fun! Some exhibits are fun to do with a partner making this a fun date night spot ;)  Would love to come back here again especially for the tactile dome! It's pitch black And you have to navigate your way out. Tix are an additional $10 but it did say preview night so the price may be adjusted later.  Yay science!", 
    "review_date": "2014-04-05"
  }, 
  "vExvNdXkFobZFCIuyE--BA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Akiliano T.", 
    "review_text": "You can act like a child with your adult drinks! =P", 
    "review_date": "2013-07-20"
  }, 
  "FQWGEabA-GiyEBMcZOPGRw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monica G.", 
    "review_text": "Exploratorium After Dark is always really fun. You always learn so much more than you would expect.   The last event \"Sugar\" played songs about sugar, gave out South Asian candies, there was a guy that did sculptures with sugar, eating skittles under the sodium light and guessing which flavors the skittles are, and learning about the different types of sugar you use.  I can't wait for this month's \"Chill\" event!", 
    "review_date": "2011-01-02"
  }, 
  "AEod0K1dByeCXMHoj6q9Nw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Hillary J.", 
    "review_text": "I love that they took a good thing (the Exploratorium) and made it better!  Once a month you can visit this place in the evening and experience even more than they usually have to offer, including presentations and special guest speakers, all pertaining to something in common, like the color Red.", 
    "review_date": "2011-07-11"
  }, 
  "hRCa5gk-TchVtiLQYUmtJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cecile S.", 
    "review_text": "If you are an adult, I really suggest you visit Exporlatorium after Dark instead of coming during regular visiting hours. I did both before. The price is cheaper and there are slightly less people. Yelpers on here are complaining that $15 dollars is expensive for admission. I think it is cheap, you have to pay $18(student discount) and $25(adult) on regular days. Even compared to academy of science $24(adult regular hours); this is considered a bargain. I rather pay this than the same for a cover at a seedy club any day. Quit yer yappin.   The exploratorium is a great two story science museum, and all the exhibits open at the day time are also open at night. So you get the full experience being here. There are tables where you can buy alcohol, but I don't suggest it. The drinks, both bottled and cocktail, are very expensive $5-10 and aren't very good quality. I didn't see alot of people buying it. And just because they serve drinks, this is not the place to get sh*tfaced. People here are having good clean adult fun. I had alot of fun playing with all the displays and just hanging out with my buddies here. The crowd is mixed with all ethnicities and age range of 21-50. Most people were 20s and 30s though.   Aside from the great exhibits, you can go outside to the deck and have a great view of the ocean and bay bridge. Because the exploratorium is on the pier, you are right on top of the water. There is also an outdoor observation area on the second floor.   Once you are done here, you can try the great night life and restaurants within walking distance.", 
    "review_date": "2013-09-06"
  }, 
  "R-i4F_rOYAMipGlvlP7A-Q": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "Aivy C.", 
    "review_text": "It's definitely different WITHOUT kids running around, and WITH a drink in hand!  Attended the \"Heartworks\" event on February 2, and while we didn't arrive in time to be able to build our portion of the love machine, we were able to see the final chain reaction that completed the exhibit!  It's so much fun to watch grown men and women geek out together and have fun in the name of science and art.   Also, I got to go through the Tactile Dome, which I was pleasantly surprised to see open since the Exploratorium website said it was closed for repairs until February 3. I hadn't been there since I was an intern in 2004-2005... it's definitely different when you are crawling through that shit in complete darkness WHILE under the influence (what? I ain't gonna lie), but just the same, it was a challenging good time!  Definitely recommend when you feel like having one of those nights that straddles cutting loose like an adult and having fun like a kid.", 
    "review_date": "2012-02-03"
  }, 
  "3wXdaXJmZLcoah2Guo81gw": {
    "user_rating": 4.0, 
    "user_location": "Reno, NV", 
    "user_name": "Edith D.", 
    "review_text": "Exploratorium After Dark   is awesome. great views of the hollywood sign and the San Francisco, CA  basin. Also a bunch of cool stuff to do on the inside. oh, and it's free. definitely worth checking out!", 
    "review_date": "2015-01-22"
  }, 
  "AGraTma9eEgsiJFDIy6tbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maile N.", 
    "review_text": "It was my first time to the new Exploratorium now located on the Embarcadero, so it was a great way to spend 4th of July at their After Dark \"Boom\" event!  They have many of same scientific exhibits, games and things to try as they had at the original Exploratorium with a few new ones, live demonstrations and beautiful views of the Bay.  This new Exploratorium is on multi-floor levels with a yummy eatery Seaglass downstairs.  My bf had the roasted chicken with potatoes and I had a salmon salad - yum (a little pricey though , think eatery prices at the Academy of Sciences, very similar)!   To go with the \"Boom!\" theme for 4th of July, they had Japanese taiko drum playing outside and later a demonstration of liquid nitrogen with cold and hot water - explosions of water and steam - fun!  It was a blast for us all!  I'm thinking about getting an annual pass - we'll see!", 
    "review_date": "2013-07-08"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "The Exploratorium is SO COOL. That said, they need to not overbook the After Dark events. Way too crowded, it felt like being at a festival. Massive lines for everything, people bumping into you everywhere. No way you can explore the whole place fully while you're there because there's a line and a crowd for everything.   The Exploratorium itself is freaking awesome - After Dark is fun, but know what you are getting, more of a party than an experience.", 
    "review_date": "2014-02-07"
  }, 
  "z72bj7TDPCi0Sovmsm4KOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate F.", 
    "review_text": "This was a lot of fun!  A great way to see the Exploratorium minus children and huge crowds.  I went on a first Thursday- which after reading the reviews below I was worried it was going to be packed.  However this was not the case, I never felt crowded and I very rarely had to wait at an exhibit.  Plus you save some money coming at night!  All of the exhibits are great and the place is so spread out and large that you can play around with almost everything.  They had 3 different bars plus the restaurant opened when I was there.  The longest I waited in line was maybe 10 minutes and that was toward the end when everyone was trying to get one last drink.   They also had some food- ceviche and mac n cheese.  They weren't very popular but it was nice they had that option.  There was an ATM on site as well and I didn't use it but it did have a sign on the outside that said no ATM fees.  Most of the bar areas took credit cards but one had a cash only line so you could get in and out much quicker with cash.  Overall this was a great way to see the museum and I definitely will be back!", 
    "review_date": "2014-09-08"
  }, 
  "fZOv7Wh8UfEQpRHEeSF5ZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather C.", 
    "review_text": "Went to the Molecular Gastronomy event last month.  The place was dimly lit, (ok, it's always dimly lit) but this time it felt more adult.  This was likely due to the copious amounts of alcohol.  Parking in the neighborhood is awful.  Take. A. Cab.  Even if its going to be $30.  It is worth your sanity.  The lines were super long. After looking for parking for 60 minutes, I only stayed an hour.  This meant I only got to see one demonstration.  It was great!  I'm a Supertaster!  Yea!  That being said, all demonstrations should require the following: 1. Good Signage.  Oh heck, how about signage period? 2.  Some kind of audio system - the presenter should have a microphone.   3. Any visual things - like monitors - should be where everyone can see them, not just the 4 people in front.  I'm not the only one who was frustrated.  There were plenty of people complaining about the event planning.  At the Academy of Sciences they hand out passes.  That way you can have some fun while you wait to see your show.  'Cause no one likes to stand in line all night.  Right?  PS: Don't go hungry, the food isn't great.", 
    "review_date": "2012-05-06"
  }, 
  "e6QRXwwzhebaLVX0JEztpg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg B.", 
    "review_text": "Such a fantastic date night or night out with friends.  Enjoy food and drinks while exploring the museum.  During After Dark, there are far fewer children and families, and it mostly attracts young professionals for happy hour after work.    Drink prices are reasonable, about $9 for (bottom-shelf) cocktails.    I'm a member of the Exploratorium, so my one complaint is that membership doesn't include After Dark :/  We get a $5 discount, but I've only been to the Exploratorium once during the day - all my visits end up being during the one time that's not included.  I also don't like that there are other exhibits inside that have an extra charge.  But, $10 (or even full price at $15) is still a good deal for a full night of fun.  Note: Only happens the first Thursday of the month.    Watch out for parking meters.  The meter maids are particularly aggressive during after dark.", 
    "review_date": "2014-12-06"
  }, 
  "1y1bshOsGD0_TtEOHmeBWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helene O.", 
    "review_text": "Tons of fun and so much to experience.  I think I love the Exploratorium even more as an adult than I did as a kid, so I love the idea of \"adults only\" nights.  At After Dark I got a turn at each exhibit without having to feel bad about cutting in front of kids.  I loved having a glass of wine while tinkering with circuits.  And I appreciated  the many patio spaces where I could get some fresh air.  It gets pretty warm inside.  I was pleasantly surprised to find so many exhibits that I couldn't possibly see it all in one night.  This gives me a good reason to go back again.  You should visit too--it's a lot of fun and a great way to support this local gem as they're experiencing tough financial times.", 
    "review_date": "2013-09-07"
  }, 
  "6ImN7CLRvsDnrAx6DF4nIw": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Joan T.", 
    "review_text": "The Exploratoirum throws a night life very similar to the Academy of Science. I think Academy of Science is every Thursday night, but Exploratorium is the first Thursday of each month, so put a reminder on your calendar if you are planning to go!   Hmm. I got there at 7, and it was kind of dead... but it started to pick up around 8! So if you want to play with some of the exhibits, I suggest getting there early so you can 1. get parking and 2. play with exhibits without people hustlin you to hurry up. Haha. But even if you come later, you still have time to play with the exhibits and find parking in the residential areas. SO no worries.  Alright if you aren't a Physics nerd like me, I think the exhibits are just fun to just play around with. It's interesting since I have no idea what the concept behind each one is. There are placards with information on why... but I just skimmed it. Haha. I'm there to have fun, not really learn. But if you're interesting behind the concepts of it, then read away!  So every After Dark is themed... I went to the heartworks one that happened last night, and it was fun. Hearts all over and you can make your very own secret encoded QR tag. I still don't know what it is, but its that square bar code thing. There are scavenger hunts and did I mention always a new activity to do at each After Dark. It's just nice to look around.   This is an 18+ event, and 21 to drink. So there are no kids hogging up the exhibits or running around the museum. Pretty nice if you ask me. I don't have to worry about walking into strollers or wait for kids to be done playing with an exhibit, since some can take forever! This is great for a date night or just a fun night out with friends! Check it out.  I'm not sure how much it is usually. But I had a google offer which was 2 tickets for 15... I think originally its 15 a person", 
    "review_date": "2012-02-03"
  }, 
  "LdWIjNvjdaAoAfpQhT6F9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tinna H.", 
    "review_text": "A super fun date night. Hello Tactile Dome (temporarily closed for maintenance)! If you're not into the big crowds, go any Thursday evening, except the first of each month. You won't have the major programs, but you'll get plenty of exhibit time.   At first I wasn't a fan of the new location b/c it seemed difficult to park and what not, but there's plenty of neighborhood parking in the evenings. Make sure you don't get stuck with a Port Authority meter (24 hour enforcement!).", 
    "review_date": "2014-09-05"
  }, 
  "DjlOT2cnbimXBAc1nzStKQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Brian P.", 
    "review_text": "came here for a company event. the food at the cafeteria is very pricey, but pretty good. good thing i didn't have to pay for it. if you go, definitely get the humphry slocombe exploriyum ice cream. it was pretty good. reasonably priced alcohol is easily available. the tactile dome is pretty expensive but lots of fun.", 
    "review_date": "2015-01-07"
  }, 
  "QxwMPYIlW1FTZHTk6R4iOQ": {
    "user_rating": 4.0, 
    "user_location": "West Covina, CA", 
    "user_name": "J P.", 
    "review_text": "Arrived in SF luckily on the night of one of these events. I heard about After Dark from Time Magazine. So I thought I would definitely give this place a shot.  Nice vibe, lots of interactive science contraptions and experiments/shows. I'm from SoCal and enjoyed this much more than Griffith Observatory. The event was 4 hrs and I honestly think more time is needed to truly enjoy this type of neat event. I was planning to have a drink or two but refrained due to the long lines. Prices seemed high for small amounts of drinks. Otherwise, great atmosphere. Awesome for potential dates and groups of friends to just have a good time.", 
    "review_date": "2014-07-06"
  }, 
  "FDRlrLDhgaQJ7Y0HwJypKg": {
    "user_rating": 3.0, 
    "user_location": "Davis, CA", 
    "user_name": "Jennifer Y.", 
    "review_text": "I have to say, I absolutely loved the idea of after-dark adult-oriented museum events.  But this particular event that I participated in was a bit of a disappointment. The title was \"Gastronomy,\" so of course it was jam-packed. Apparently, most of these events tend to be relatively quiet, but as soon as food is on display, it's a completely different story. I have to say, the crowds really did detract from my experience here. Parking was a bitch (though to be expected for SF, even after dark), the exhibits were crowded, the film viewings filled up, and the lines for cocktails were way too long. As a result, we didn't view any films, drink any cocktails, or watch any demonstrations.  I did like the idea of the exhibits. They had a salt booth teaching the differences in various salts, a nitrogen ice cream booth, one for teaching knife technique, a tofu- and cheese-making demonstration, and one for making caviar out of jelly. There was one demonstration about taste buds and nerves that I really enjoyed. They brought sweet-blockers and sour-blockers, along with various sweet and sour items (lemons, twizzlers, sugar packets, preserved mango) to experience. So, three stars for the thought and the learning that went on in here.The only problem was, we didn't actually /do/ anything. I have no idea what the films were because we were unable to get in.   Oh, and the Tactile Dome is for kids. Just trust me on this.", 
    "review_date": "2012-04-11"
  }
}