{
  "cG5l8teICW5NRtRJ0GpMww": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Keith K.", 
    "review_text": "Festa's is my new #1 spot for karaoke in the city. I was a latecomer to Masae's takeover from Sachi, so I was surprised to see the remodel and the name change.  And things just got better from there.  Ken, the manager/bartender, brought us up to speed on the change. The place looks terrific now. More seating, better lighting (not brighter, just better), new karaoke system and much nicer staff.  There are several English books here, so it's not just Japanese songs.  Yes, the songs are $2 per, but worth the price.  You can now use a wireless mic if you don't want to sing on stage (unless it's super busy like last night and then only special people like me get to use the wireless; otherwise, it gets lost in the crowd).  I used to introduce a lot of people to Sachi's. I'll be stopping by even more often now.  UPDATE: And I'm bringing Mani.", 
    "review_date": "2007-05-26"
  }, 
  "h6wT6La3fOG0PuLPjmP2xQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "sandra s.", 
    "review_text": "Ended up here a few months ago to meet up with friends who love this place, and I had a blast! Small, intimate but nice lounge (not gritty/divey), and because it's small it's more casual and fun, rather than feature some intimidating stage. Full bar plus lychee cocktails. I would've had fun just watching everyone and hanging at my table, but yes, we ended up singing. It felt like our own party after a certain point, with one guy from our group singing Sinatra and a bunch of us dancing up front. Great neighborhood spot if you can find it (it's just inside the Japantown mall).", 
    "review_date": "2012-07-20"
  }, 
  "dVribG2G7Ae3lgz66f3kpg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cece S.", 
    "review_text": "I know SF is an expensive place to live and run a business- but geeez! 6 dollar Sierra and 5 dollar BUD?? Im still giving them 3 stars because its a fun place to go with a nice decor.  I recommend getting there early to get a seat - and coming already tipsy will help your pocketbook.  The crowd was nice and friendly and the staff was good too.  I would go back when feeling like I didnt mind spending a hunk of cash to have fun time in a low key karaoke bar. By the way- they have a non-traditional song list so dont expect all your favorites will be there!", 
    "review_date": "2008-03-23"
  }, 
  "8Q0xnxT-KrvCl2pQF1qsFQ": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "omar b.", 
    "review_text": "So this place used to be Sachi, which i heard was pretty fun for Karaoke in a group setting...tonight was not the case.  I believe the new ownership just took over mid Dec and did a great job on the layout and design aspects of this very intimate lounge.  Had a fun time with Mike telling Aaron and I about how Nancy Pelosi has screwed up things for all us men in SF- being she is from here and that SF women are already very well u know where iam going with this.  I was cracking up all night on how animated and excited he was on Pelosi ruling the US.    Seating is comfortable and service was just above normal.  I think this place has potential, especially if more people discover this lil nook right across from Kinokuniya Bookstore.  Stuck with Gin&amp;Tonic for the evening and had an okay cheeseplate.", 
    "review_date": "2007-01-08"
  }, 
  "KOWl_ZhqhYqY33-CbaJubw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bobby L.", 
    "review_text": "\"Making your way in the world today takes everything you've got.   Taking a break from all your worries, sure would help a lot.   Wouldn't you like to get away? Sometimes you want to go where everybody knows your name,  And they're always glad you came.\" ..........(Gary Portnoy, \"Cheers\" theme song)  I dedicate my 300th review to a place that I've visited over 100 times, sang at least 100 songs, and probably drank 100 drinks.  Why did it take me long to write this?  I must've been busy on their stage, or taking it EASY!  What draws me here on a weekly basis is the cozy setting, their friendly staff, and of course...Karaoke.  I always feel at home here.     I don't like singing in front of large crowds, and I usually prefer private karaoke rooms...but this place is intimate enough with a small lit stage, supportive crowd, and not bad of a sound system (considering the absence of a resident K-DJ).  Their extensive song selection isn't bad either.  They update with new songs every so often, but I tend to sing the older stuff anyway.  This place can get really packed on weekends, so don't expect to sing your songs close to closing time.    The bartenders are very down-to-earth, sincere, helpful, and fairly quick in making drinks upon order.  They do an exceptional job keeping the place clean, accommodating all their customers, creating a safe and fun environment for all.   This place is great for small private parties too.  Masae and staff are excellent in catering to their guests.    Some people call this place FIESTA on accident, and I think they nail it every time I hear that.  If I could come here every night, I would!  Actually, I think I have in multiple weeks.  I just hate leaving my heart in San Francisco.  Thanks to my duet partner, Ting A, for the introduction!", 
    "review_date": "2011-12-15"
  }, 
  "qrxiK9XxmBIlz0xuO6jRBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul J.", 
    "review_text": "This is a follow-up review - After 4 years and counting Festa remains the best, coolest, most authentic Karaoke bar in SF - bar none.  The bartenders know their stuff, so a visit to Festa is a good occasion to try something exotic - and it doesn't hurt your performance either.", 
    "review_date": "2013-05-14"
  }, 
  "5mqVb1VI-S6WzVALebRLQw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Molly G.", 
    "review_text": "$5 sprites and unfriendly staff.  One star for cool location.  I think this place is homophobic.  C'mon this is SF, haven't you ever seen a drag queen before?", 
    "review_date": "2009-08-31"
  }, 
  "jzaJsPcfkjphAeR8mNZEVg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MIBC G.", 
    "review_text": "Hey! I want to Festa with several friends last night again that was packed even on Thursday night, wow!! Understandable for its super fun venue to sign and drink! The staff were so cool to serve us even it was very busy and they even looked having fun! I like the fact that other customers were also fun feeling like my own friends. I will write again when I go again to Festa that would be very soon!!", 
    "review_date": "2009-12-18"
  }, 
  "vTugBdYg34rX4KvGpzBrNA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sonya D.", 
    "review_text": "This is a super cool spot for karaoke...well for watching other people. The bartenders selected a song for us, and it was so bad that we got booed off lol. However besides that, these are definitely some of the nicest bartenders in the city- a boy kept buying me shots and drinks, and I because they could tell I didn't want any of them (or need anymore), they kept swapping them out for non-alcholic versions. That was definitely a first. The only downfall was that I almost got my ass kicked by a very scary girl. I accidentally spilled a little of my drink on her purse and she was not happy about it. Luckily a random guy spent his time doing damage control and talked her out of it. How sweet!", 
    "review_date": "2010-09-19"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "I LOVE watching douchebags and B&amp;T sorority girls get drunk and beg for attention as much as the next person, but this is going a little far. I felt like I was in a bar in Lafayette during Spring Break and all the seniors were home to get drunk and screw like they did back in high school.  However, if you have friends like mine, the Party Olympics will be easily won and before you know it, the Chets and the Chips and their drunk groupies will disappear (possibly dropping all of their money for you on their way out- thanks again!) and you will be left with a cozy bar, a little stage, and a decent sound system and song selection (this is karaoke, bitches).   Drinks cost a fortune (as in- you're likely to promise your first born in exchange for a well drink) and they're not that strong. So it's a good thing those yuppies got sloppy and left my dog and I with fistfuls of cash to cover all those vodka sodas. Good times! And right near my house. Three stars.", 
    "review_date": "2008-04-10"
  }, 
  "j4HYyybTRy6uOa46co8EdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabrina V.", 
    "review_text": "Festa is always fun. The drinks are pricey and I've never been to a karaoke bar that charges patrons to sing, but I'd still consider this one of my favorite karaoke bars in the city for its intimate ambiance, friendly bartenders and extensive(-ly cheesy) song list.  BONUS: Last I went, a super-drunk Gavin Newsom-lookalike bought the entire bar a round of shots. Hope he comes back soon, too!", 
    "review_date": "2011-11-27"
  }, 
  "Jc0T3q_8bOjg9pPlJb3MBQ": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Lenny C.", 
    "review_text": "Pros:  -A great variety of songs -Great drinks -Good atmosphere  Cons: -Very small place -Karaoke should be fun, but it seemed like it was an American Idol competition that night. -Drinks were expensive", 
    "review_date": "2009-07-11"
  }, 
  "T4jjNW_6HFQNXwD3eeBhAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Badmaanyam M.", 
    "review_text": "Festa is my favorite place for karaoke. Friendly staff, great drinks and good selections of songs. They always update the songs too. People are always supportive and fun no matter how good or bad you sing. If you like to sing this is the place!", 
    "review_date": "2014-01-04"
  }, 
  "Q0qo1Gi99LihNjitnpfCAw": {
    "user_rating": 3.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Audrey C.", 
    "review_text": "If you're looking for a chill, divy karaoke bar, this is your place!  It's a very small, and intimate establishment, but the perfect place if you just want to have some drinks, sing and have fun.  The crowd is mixed, so you'll get a wide range of songs sung throughout the evening.  You pay per song, and songs are $2 each.", 
    "review_date": "2012-01-15"
  }, 
  "Wcksq23HgF45mPFZOUFy6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "I LOVE Festa! The people here are so nice. It's in Japantown (and I love Japantown). Oh, and the ambiance is just the best among karaoke bars - I love the city lights and stars along the walls and that you can look out the window over the street. The music selection is good, too. I almost always find the songs I want to sing. :)", 
    "review_date": "2013-11-30"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "Had a fun time singing \"Anyway You Want It\".  Did you ever try to karaoke a Journey song?  No.  Well, Steve Perry can sing.  Or could sing.  And I'm no Steve Perry, but I try, except without the mullet and the cheesy 80s moustache. Small place.   Cool stage backdrop good for pictures.   Has Hawaiian songs in the book too.", 
    "review_date": "2009-07-22"
  }, 
  "itXMelaTleEjLIFWCJtnwg": {
    "user_rating": 4.0, 
    "user_location": "Durham, NC", 
    "user_name": "Christina G.", 
    "review_text": "As we piled out of the taxi onto the sidewalk, we could hear the rest of our clan in joyful choruses: \"Doooon't stop belieeevin'. Hold on to that feeel-ayayayin.\" We looked around for the entrance to Festa and merriment, and were like: How the hell do you get inside??  Luckily, the night's previous cocktails hadn't dimmed us enough to prevent discovering that the shopping mall entrance is the gateway to Festa. Up the staircase and round the corner, sure enough, we found the cubby-hole bar with a cityscape stage. The two bartenders were really nice, though there was the occasional drink mix-up. HIghballs seemed to run around $7.   It's $2-per-song, and the books have everything from show tunes to goldie oldies to pop. We heard it all too... yes, even a rousing closing rendition of All That Jazz (cue: jazz hands).", 
    "review_date": "2011-07-01"
  }, 
  "Omomh1jRNEi8L6-osElVxw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "QuodE D.", 
    "review_text": "I think this place is pretty good...despite the really bad drinks.  The mixed crowed is great--from young hipsters to old fogies (like me).  It welcomes all.  I'm not a karaoke fan, but with a stage and \"city lights\" Festa is the place I could be converted.  But shaken manhattans and warm martinis at Tokyo prices don't help. With better bartenders, Festa could rock--even with an off pitch riff of Britney.", 
    "review_date": "2007-11-24"
  }, 
  "K_sMuRAvaXRHP1nBSajxRQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dexter L.", 
    "review_text": "Dropped in here on a whim after dinner in Japantown.  It's a small venue, very intimate.  Upon being seated, they ask you if you're going to be singing and hand over a song book.  The crowd is entertaining (mostly drunk) and the drinks somewhat original.  Unfortunately, because the crowd is so small, you end up seeing the same people onstage over and over again.  I did not have the courage (not drunk enough) to get up on stage....", 
    "review_date": "2015-01-11"
  }, 
  "4_raRCaI4wuheAgO7RtFCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dzu N.", 
    "review_text": "YES.   A karaoke place that has The Darkness? Green Day? Red Hot? Nirvana?  All the songs I've ever wanted to sing at a Karaoke bar. Not that I'm raggin' on asian tunes or 80's classic (I did a beautiful job on Mike's \"Rock with you\" before my voice gave out to the high notes only he can master!) but it's really really nice that they included a lot of the....unusual fare. That right there was 4 stars.   The get up and go rotation of songs is the fun part I think: getting up in front of your friends and a bunch of strangers is nerve racking (plus there are some pro frequenters too! Some dude was killin' it on stevie wonder!) but its great fun just lettin' loose. I think people will have a better time if you're not trying so hard you know? You have a good time, everyone has a good time. Words to the wise indeed.   I couldn't blame em for the rest: the major wait times, the fairly weak cocktails: they're just they way they are. Man that long island was some turrrable business though. Glad I only had a beer. Gotta protect the voice to swoon the ladies! hahaha.   Its 2 bucks a song and the drinks are a bit pricey (6 for a bottle of saporro? meh...) but pro tip: get your song list in order. If you want to sing 10 songs, write down 10 songs. If you decide mid way through, tough luck if you got a pretty nice crowd building up. Stake your claim and just relax for the rest of the night! That's what I'm doin' next time.", 
    "review_date": "2011-08-11"
  }, 
  "9pF7_fqg8T8HdTtWggZYcA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe N.", 
    "review_text": "Fairly good music selection.  Great ambiance.  Love the staff.  Horrible martinis that have too much vermouth --- other drink options are good.  Will come back often.", 
    "review_date": "2012-10-01"
  }, 
  "2b_VpbCZGiWic0kLSei4ZA": {
    "user_rating": 1.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "Ernie A.", 
    "review_text": "Expensive drinks. $2 per song. Will not provide free ice water without harassing you about the drink minimum (which I had already met in spades).  Attitude after receiving 16% tip on sub-par service.  Normally I have fun here but it seems lately the service/vibe has been totally off.", 
    "review_date": "2013-05-27"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "this place was way smaller than i anticipated!  i came for a bday party last wknd and had a lot of fun!  there are a lot of song choices, but they are a bit difficult to find in the huge books.  each song costs $2 to sing, so it makes for a pretty cheap evening.", 
    "review_date": "2014-09-14"
  }, 
  "I2uNXg4uOhZyPq-a3FmLsg": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Anna F.", 
    "review_text": "I went here a week ago for my first karaoke experience in the Bay area. I come from Las Vegas, where karaoke nights and bars are a-plenty and generally free (with a small tip for the DJ being recommended) -- so the $2 charge after 9pm was kind of strange, but I'm not going to fuss over $2.  If you are with the right group of people, this place is awesome. We came for a friend of a friend's going away party, and the whole place was made up of our group and one other party. The drinks were flowing (and poured heavily), everyone was in a good mood, everyone cheered each other on.  Their drinks were a bit expensive - $8 for a well vodka and cranberry - but if you can afford it, the service and atmosphere was worth the cost.  Come with a good group of friends and you'll be alright.", 
    "review_date": "2011-09-27"
  }, 
  "vLqbQkcSkvbWJRB96UTAsA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M. M.", 
    "review_text": "I had so much fun here. It's small, chill and super friendly :)", 
    "review_date": "2014-04-30"
  }, 
  "zMDJYPyZhgkXl6WvRQvsNA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jas W.", 
    "review_text": "Such RUDE people...   Here's what exactly the people working there saying:   \"ok, we fuck'in lost your song... if you can write down the song number again we will put it in the queue...\"   Ugh... after waiting there for 2 hours ordering drinks and tipping the bar tenders big time, and wondering what was going on, this is our answer for keeping us waiting forever? After such long wait and horrible service/attitude, who still wants to continue to sing there?  I ordered 3 songs at the same time, 2 of them played after about waiting there for an hour. I went up there saying that I ordered 3 songs all at the same time, is the 3rd one forgotten? and put down the 4th one. I was told that she could not play my songs all the time had to play others too, so I had to wait, it would be my turn after another 6 songs. After 6 songs, I went up there and asked again, she said it would be mine the next. After another a few rounds seeing others singing back to back, we thought it was not right. I went up there for the 3rd time to ask, the gal who was in charge of running the songs said: \"see others were tipping us and you never give us tips!\" AH...there were reasons behind it...  So we explained that we had been tipping the bar tenders big time... however, apparently, she randomly throw out my 3rd song, it was no longer even in the queue any more...   At that point, we felt so sick with these rude people. We asked for refund - really rather not to deal with them... she threw the money on the counter with another one song's refund short...   I will never return that place again. If you do not want to ruin your fun night, don't ever bother go there.", 
    "review_date": "2009-05-02"
  }, 
  "ahVwnO5O_AqY2PaZbnBW1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kissyfit M.", 
    "review_text": "I come here a lot. I really like this joint cause of the karaoke, ambiance, and bartenders are cool. Sunny is an interesting character, he's one of the bartenders there. I love it when he sings L.O.V.E. I like the little stage too. I have a great time singing up there, I feel like a pop star sometimes! they also have newer songs than most karaoke spots I've been to in the past.", 
    "review_date": "2009-05-03"
  }, 
  "SxyI2BAJm-S-SSJoMNvfkw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kalin K.", 
    "review_text": "Went here for a friends birthday and it looked really cool. Intimate stage, good crowd, and a large hot sake was $10. I was ready for a good night. My friends and I put our songs into a tall gay asian man and then we waited. 3 hours later my song never comes up, I ask the man where I am at in line, to which he just looks at me and points to the trash. Now I had never done anything to this man nor acted rudely to justify his behavior. I spent $40 on drinks, gave up my seat to a nice couple who had been standing and was in a smile mood all night but apparently only generous tips to the diva with the karaoke machine will allow you to have fun on stage with friends. If I was looking for a diva with a karaoke machine I would have gone to The Mint, at least there the singers are amazing AND you actually get to sing.", 
    "review_date": "2013-07-07"
  }, 
  "pxnaGI13FrogazowZy-Lxg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jay W.", 
    "review_text": "Drinks are expensive but the atmosphere was great. I'll def come back to sing and laugh. However, the space is small and you could feel a little cramped inside if you're uncomfortable with small spaces. But i think that's part of the intimacy and attraction of this place.", 
    "review_date": "2013-12-30"
  }, 
  "ZSretWXlve11q9hP6SrScQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex H.", 
    "review_text": "A karaoke bar that puts that boom boom pow in their cocktails", 
    "review_date": "2009-07-15"
  }, 
  "Syt_iQqW_c9T2_lrvsddqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gwynnie p.", 
    "review_text": "Festa turned out to be a swell place for a recent Sunday evening bday gathering. I see from their info that they'd like to charge you $100-$150 an hour to have a private party but on a Sunday you might just *cough* tell all your friends to show up and presto change-o you pretty much got the joint to yourselves especially if you've got a bunch of show-tune loving queens cuz the room is small and nobody is gonna want to hone in on your action. Or be near you and your Annie-Guys-n-Dolls-Seven-Brides-For-Seven-Brothers loving chums. Probably. But I'm not one to gossip and you didn't hear that from me.   Minus a half-star for the sourpuss owner lady, (crack a smile, you're in the hospitality industry whether you like it or not) and minus another 1/2 star for the expensive drinks. Well at least I can tell you the least expensive glass of wine is $9 and that is one kind of wine the others are all much pricier. I imagine the cocktails are 'spensive too tho I did see some manual mint muddling going on so, you know, that drives the flavor and the price up.", 
    "review_date": "2009-03-18"
  }, 
  "jgi0iam1b2XEqYAQBP7NRQ": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Jacqueline W.", 
    "review_text": "4.5 stars as a karaoke spot, but I'll give them 5 because it's more than a karaoke bar: it's an awesome place to have some drinks and watch people with wonderful voices sing. It's small and it's not too loud. So, you can have drinks with friends in a comfortable environment, and enjoy the show. The staff is friendly, and the regulars are hilarious -- they clearly practice for performing on the stage at Festa. Drinks are a little pricey for the quality, but you're getting a show too.  Really fun place!  My one complaint is that they charge $2 a song after a certain hour (8pm?) even if there is clearly no one singing and few people in the bar. I'm grumbly about disincentivizing people from singing, when I came there to watch people sing (and that's why I'm paying a little more for booze).", 
    "review_date": "2014-02-20"
  }, 
  "zSFkfZWK3BgmsWUQvZGPHA": {
    "user_rating": 5.0, 
    "user_location": "Altadena, CA", 
    "user_name": "Jim M.", 
    "review_text": "This review should be prefaced by an admission:  I love Japan.  I don't mean I love Japan the way a person might love water skiing or chili dogs.  I love Japan the way you loved the girl you had a crush on in seventh grade.  About a year after I moved to Japan, I realized that if Japan had been personified as a woman, I would have either married her or gotten arrested by the Japanese Godzilla-helmet wearing police for stalking her, depending on how I did.  (And no, I didn't marry a Japanese woman as a way of fulfilling that strange desire and projecting it onto a person...that would have just been weird.)  So instead, in the many years since I've been back in America since living there, whenever I wander into places that are truly Japanese, I have a feeling of nostalgia that colors my judgment.  That would explain my behavior at Festa the other night.  Or it could be the drinks.  Both are perfectly plausible explanations.  So for starters, it's in Japantown and the bar is populated primarily by Japanese people.  I speak Japanese almost fluently (take note, Nance W. :) )  but of course, no one expects me to, so I get in what we used to call the 'language bubble' in these places.  The language bubble is a situation where nobody expects you to speak a certain language, so they feel free to speak in that language, often in ways they wouldn't if they knew you could understand them.    I knew this was a real Japanese karaoke bar for two reason:  the menu was small and had overpriced 'sunaku' (that means 'snacks') including the 'assorted plate' for $10, which was about 7 grapes, some cheese and crackers straight from nabicso and some kamaboko slices (don't ask.)  The second and more important reason is that everyone was doing what karaoke is really for:  humiliating themselves equally.  It's one of the ways of leveling society in Japan.  You bow to people all day higher or lower based on your social status in Japan, but once you're at the karaoke bar, everyone sucks equally, even the boss.  It's a pretty awesome tradition.  After a couple of fun-loving, corn-fed midwestern gals left the place after singing everything in the Michael Bolton catalog, it was time to get down to business.  Japanese songs were sung.  French 75s from earlier in the evening were impairing my ability to read kanji, and I never got around to singing my favorite Japanese karaoke song, 'Shima Uta.'  Buy me a drink there sometime and I'll do it.  Instead, I was pushed up onstage and made to sing (I forgot about this but it happens a lot) Elvis.  I decided that the thing to do was to just fully own it, so when 'Jailhouse Rock' came up, I just rocked that joint.  To paraphrase Samuel Jackson, to them I was Elvis.  Then came 'Are You Lonesome Tonight?' which was fine until I realized there's about a 2 minute speech in the middle of that song.  (\"I wonder if...you're lonesome tonight...\"  Itunes it if you've never heard that part.)  Anyway, it was effective, judging by the reaction of the bartender, but after that we still had to take it up tempo, as one more sappy tune like that would have killed me.  Finally, we got , as all white people in a Japanese karaoke bar must, to the Beatles.  After one rendition of  \"If I fell,\" I wanted to try it again, with my college buddy singing harmony, so from the stage, with microphone in hand, I asked them to play it again, but I spoke Japanese.  This was almost more than the room could bear.  What kind of a freak was I?  The language bubble was thoroughly popped, but the rockin' still didn't stop.  Finally, at the end of the night, the bill was inexplicably a lot higher than we thought, which almost brought a tear of joy  to my eye because that's always what happens in Japan too.  Plus, I wasn't paying.  Don't go to Festa (or any Japanese karaoke bar) hung up on singing well, or you'll make a jackass of yourself.  Just remember three words the local barkeep at the karaoke place where I lived used to say to us:  you must enjoy.  That's right.  You MUST enjoy.  The most Japanese thing of all is that just because it's fun doesn't mean you have a choice.  Festa is definitely on my list of places I must enjoy again when I'm in SF.", 
    "review_date": "2007-10-31"
  }, 
  "SQoQOFZcyrgasZ4_5_l5Qg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Winter M.", 
    "review_text": "Brace yourself... this place is SMALL (maybe 400 square feet) and you have to be BOLD about karaoke. The selection is extensive, the sound is great, and -- for first timers -- the karaoke holds your hand well. May we recommend doing what our friend Ahmed did and renting the joint for a couple of hours, filling it with friends who are VERY good singers, and enjoying the drinks and ambiance? I only wish Festa had one or two REALLY good beers on tap and maybe something to nibble, since it's a bit of a umbrella-in kinda frou-frou cocktail bar... drinks fine for \"Xanadu\" and \"Homeward Bound,\" but not as good for \"Foxy Lady!\"", 
    "review_date": "2008-09-16"
  }, 
  "ee2ALG_x2ZC20uwF4D6n4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike T.", 
    "review_text": "Wanting to sing a little to wind down a long night, I headed to Festa. I am starting to become a regular at this place for several reasons. The service is cool. The owner, Masae, is perfect to run this place. The setting has improved 100% over the previous management. They have a good selection of my favorite songs. The karaoke system works well. Stage and wireless mics. Cool patrons. It just feels at home.   The bartender of the night was cool. He sported sideburns that were long, and looked as if they could double as knives, LOL!!! After a few beers, he whipped up my Blue Tokyo, in layers. It was a pretty drink to look at, and tasted great.    Being a slow night, made it easy to get on the mic, but I must say that this place is fun when you have a lot of people who really get into the singing aspects.", 
    "review_date": "2007-08-03"
  }, 
  "58dvonndIVTMue5jJdJPFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christian N.", 
    "review_text": "Awesome place for a song and sake.  The bartenders are super nice.  I went there a few weeks back with my drunk buddette from the Lower Haight, gave the bartender a tip to bump us up the line for a song and lo and behold, my friend was too drunk to sing.    Then I went back last week and guess what...Marina folks!  A group of Banana Republic dress shirts/jeans guys and their Gap wearing girlfriends took over the right side of the bar being obnoxious and drunk.  The best part is everyone in the bar was laughing at them because they thought that they were so kool.", 
    "review_date": "2008-11-17"
  }, 
  "vxR_YV0atFxIxfOnF9uHjQ": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Debbie N.", 
    "review_text": "My new favorite local drinking place... Of course, since it is close to home that is a plus.  The bartenders are nice... drinks and pours are not as heavy as I would like, but everything in moderation right?     I do not sing, so I just sit at the bar, and talk to whoever my drinking buddy is that evening.  Since I do not know Japanese, if they sing badly or good in Japanese, I wouldn't be able to tell.  But I can tell if people sing badly in English.  And let me tell you... it can get pretty bad.  Just imagine drinking so much you are compelled to pay the $2 surcharge to sing a song.  Well sometimes it ain't pretty.  I'm not passing any judgment because as long as they are having a good time, it's cool with me.  Who knows, maybe one evening I will get piss drunk and sing, \"Baby one more time\" by Britney", 
    "review_date": "2007-10-08"
  }, 
  "n-LZIcHGmWfRl1GwdNlFzQ": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Jonathan M.", 
    "review_text": "True Pros -Very small &amp; intimate venue which means lots of song time -Very friendly staff who check in occasionally -Never too crowded -Dancing, wandering, &amp; having fun with the mic are all totally acceptable (no uptight dj)  True Cons -Drinks could be stronger -Single venue? -An additional mic and air instruments would make it better -Fancy cityscape background  So why 5 stars... You come with a party of 6+ people, and the stage is pretty much yours. It's just always fun.", 
    "review_date": "2015-01-01"
  }, 
  "GXSbU3uyKGEYsz0gKJ95iA": {
    "user_rating": 1.0, 
    "user_location": "Austin, TX", 
    "user_name": "Ian S.", 
    "review_text": "Assholes. Expensive drinks. Terrible karaoke. They were terrible to us, and didn't let us sing. The KJ was awful. We paid him $10 to sing three songs... And he didn't put us on in three hours. We were at the front of the song line for two hours and the KJ kept telling us there were a lot of other people waiting. Try Encore instead.", 
    "review_date": "2013-11-29"
  }, 
  "EFa2cyL13XY85o2bw4pajQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bryan K.", 
    "review_text": "This is a quaint little karaoke bar in Japantown, in the Kinokuniya building plaza area.  I remember a couple years ago it was dark and tired, with ancient Japanese patrons belting out oldies on stage.  Now its updated, better lit, and filled with younger folks singing their hearts out in front of everyone, publicly humiliating themselves like the karaoke gods intended.  The big Japanese beers here are ten bucks.  A carafe of cold sake will set you back about thirty bucks.  Being the Asian math whiz that I am I asked my drunken buddy from LA, would you rather have another sake or 3 big bottles of beer?  Not the math whiz but a practical fellow of course he picked quantity over quality.  I came here again with another friend from LA, in town for training this week.  She was dying to go out since she has 3 kids and her husband hates dancing, which is normal, doesn't drink, which is kinda abnormal, and doesn't like making a fool of himself in public singing karaoke, which hmmmm, is kinda normal.  I ordered a glass of sake and she got the lichee cocktail.  Oh the lichee was incredibly good.  So I made a pact with her.  I'll continue ordering sake for myself and foofoo drinks for her.  Then I'll drink half her drinks and we'll go through the entire foofoo menu... that way I can secretly indulge in my foofoo drink passion while maintaining some semblance of my masculinity.  Finally I gave up and just ordered myself a foofoo drink.  I just drank my pear cosmo like the man that I am... whatever that means.    Overall the lichee cocktail was by far the best.  An extra star for that plus the cool vibe.", 
    "review_date": "2008-08-01"
  }, 
  "oddhpGKipWerYXKScmlYVg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Takashi Y.", 
    "review_text": "Pros: cozy atmosphere, near home, nice staff Cons: pricey drinks and charges per song, outdated song selections (especially for Japanese songs)", 
    "review_date": "2009-08-16"
  }, 
  "Lr-B-r-KF80yFy-2u336bw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Eugene L.", 
    "review_text": "I rolled to Fiesta with the Yelp Posse after the Elite event at Barrelhouse .  Its Bobby L. hangout and that boy can SING!!! Its a small intimate place in J Town . It reminded me of one of the Karaoke Places from the movie Duets.   Its a place to have a few drinks cut loose and just have fun and sing .   It has a Unisex Restroom.   The Bartenders run the Karaoke Machine.  At  times its can be a Yelpers Hangout.", 
    "review_date": "2011-06-24"
  }, 
  "HshIhF76Uea0-2ht_KUisw": {
    "user_rating": 2.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Christine M.", 
    "review_text": "The only reason this place gets 2 stars is because it's small and dispenses alcohol, thus enabling me rock out to NIN in front of strange 50 year old men.  I would really chalk that up to beer and patronage, though...  Ordering a drink here must be a joke.  In theory, there are two bartenders.  Keep in mind that this place is the size of a large closet.  Not only do the bartenders ignore you while you wait at the bar to order, but when you actually lean over, wave them down and ask politely to order a drink, they still ignore you.  It's so absurd, I have to assume they think I shat on their shoes a few minutes prior.    When I finally forced myself upon one of them and ordered 2 drinks, they gave me one.  I had to do the whole song and dance again (with no one else at the bar!) to get the other.  I then asked to open a tab.  They ran the credit card and gave it back right away.   The whole joke of a process took 20 minutes.  They also charge for songs intermittently.  One song is $2, the other is $3, and the other is free.  Oh, and the drinks that take 20 minutes to order?  Overpriced and small.", 
    "review_date": "2008-07-02"
  }, 
  "DfmtZlDE8JJv-boorp1PAg": {
    "user_rating": 4.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Glenn G.", 
    "review_text": "Doing Karaoke and playing Rock Band are simply NOT the same thing!  I can now say that with first-hand knowledge, having finally visited Festa, my first-ever Karaoke bar.    Does singing in the shower count by way of preparation?  Sure!  Will enough practice with Rock Band let you swagger up on stage and start belting them out like Bruno Mars?  It can't hurt (and for that matter, neither does a few rounds of Dutch Courage), but at the end of the day, there's absolutely nothing like singing in front of a live audience.  I always wanted try Karaoke, but I never did; then I joined Yelp.  Some Yelpers are terrified of Karaoke, some are passing fond of it, and some (like my friend Bobby L., who's \"The Duke\" of Festa) were born with a mike in their hand and a song in their heart.  The Elite of the Elite Yelpers all have one thing in common though - they'll try almost anything once!  At the tail-end of a Winter night earlier this year, a car-load of uber-Elites and I drove to this very-well hidden bar in Japantown.  Earlier that night, we had visited Little Star for some world-class deep-dish pizza <a href=\"http://www.yelp.com/biz/little-star-pizza-san-francisco#hrid:pakEuBxSaTX6zgJmErQ0GQ\">yelp.com/biz/little-star…</a>, then moved on to Cantina for some premium pre-Karaoke fortification.  I was feeling well-fed, well oil, and ready to wrestle 'gators when we arrived at the strip mall that contained Festa.  It's a good thing Bobby L., was driving - I never would have found the place in a 1000 years, even with the nav app in my Droid; well hidden doesn't begin to describe this bar!  Bobby could have found it in his sleep (and he probably has a few times) - displaying the ease of long practice, he guided us unerringly to the door.  We all walked in, and I took a look around.  The space is decidedly not big, about the size of an airport lounge; it has a small stage, with a twinkling city skyline backdrop, and a few tables huddled around it.  There's a bar against one wall.  The vibe is dive-bar intimate, and the crowd is friendly and supportive.    Got any particular song in mind for your Karaoke debut?  They probably have it here!  There are 4 huge song books which are alphabetized by song title, artist, or language.  One of my friends started leafing through the book looking for a tune; I glanced over her shoulder, and saw \"That'll Be The Day\" by Buddy Holly - I remembered most of the words (heck, there are only about six of 'em) so that was my choice!  It's $2 per song, and no \"official\" DJ, so watch the prompter for your song - when it starts, you're on!  One by one and in pairs (duets are no problem here) my friends did the deed; then it was my turn.  I grabbed the mike, jumped up on stage, and sang for all I was worth...  While I probably could have scared The Dead with my caterwauling, I lived to tell the tale.  I got a real kick out of the Karaoke experience, and I'm sure I'll be trying it again in the not-to-distant future.  Festa is a great place for first-timers and veterans alike.  As this visit broke my Karaoke cherry, and I now fall into the latter category, I'll be back!", 
    "review_date": "2012-05-25"
  }, 
  "zyLIp7DRFqeIE1Grrh3Zng": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derrick V.", 
    "review_text": "They have \"Sure Thing\" now... and I ripped it.  What a night!", 
    "review_date": "2011-09-15"
  }, 
  "Plf9SP6LVqg7mVU3DgaX8w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Takeo E.", 
    "review_text": "I've walked past this place so many times I can't even count but I checked it out on the suggestion of some yelpers. My friend (a gal who also turns out to be a powerful singer) and I walked in just to see what was going on. I was a bit dismayed at first because it was empty but we asked to see their song book.   Wow! They have an up-to-date selection. The cool barkeep and cute waitress spoke BOTH Japanese and English so I flipped back and forth with them all night.  They had such classes as \"yume no naka\", and \"Space battleship Yamato\" and a few others.  The crowd that showed up later was quite mixed in age and race and remarkably supportive. Totally a bomb place to do duets, so make sure you bring a friend!", 
    "review_date": "2009-01-07"
  }, 
  "HbERm3eEVFAveflAJU-dxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine P.", 
    "review_text": "This place is all about community -- it's basically San Francisco's \"Cheers\" -- just where everyone is singing and even the most aloof manly-man warms up with lychee martinis.   I've been coming to Festa for more than a year, and it only gets better and better for me and my friends who come one or two times a month. The bartenders are exceptionally nice, (Ken, Shogo, Satoshi) and Masae-san the owner treats us like family. We feel like family to them because this place is so small -- they make an effort to get to know their customers, but also it's part of their business: they depend on their customers to become regulars and support their bar. I've brought more than 30 different friends here over the past year and everyone leaves craving another go; it's just hard not to fall in love with the support always ready for the singer, the service always ready to ensure you have a great time.  I think any of the disgruntled Yelps on this place haven't given it enough of a chance or don't fully understand how hard it must be to crowd control this place given it's so small -- it can get really rowdy in there, people start screaming into the microphone, get so drunk they break glasses or tip over tables, and because they do have a reservation policy for larger groups, sometimes you do have to move for folks who've paid an extra cover.  I agree with a lot of the Festa regulars who've said it's even better on a weeknight; part of the \"Cheers\"-like draw. There have been many a work conflict or a friend disagreement thawed out by the incredibly fun and hilarious environment. I've never walked out of the bar without someone's email address for future karaoke nights. Also, you get to sing more often as fewer people are in the bar, and this has been the best time to bring people nervous to sing. Interestingly, every single person who's ever been to Festa with me who was intimidated by the Festa stage upon walking in never wanted to leave it after their debut song.  It's just an awesome discovery in a town where going out at night can be frosty, unfamiliar and too much of a scene.  None of that here. I hesitate to profess my love for Festa because I'm afraid it will become even more popular. But my love for this place (and appreciation given how great they've been to me and my friends) is the reason why I'm shouting from the rooftops.   Go. Have fun. It's great.", 
    "review_date": "2009-11-14"
  }, 
  "jBa1tIHKkVyVPS-l-KQ4Ww": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Holly D.", 
    "review_text": "Ok. So let me say.. I have loved this place for years. I have had many great experiences and spent A TON OF MONEY here over the years.. They normally have a great staff that is super friendly and generally attract amazing guests.. But last night was EPICALLY bad terrible customer service and I have been in the service industry for over 10 years so I'm not just being a bitch.. The kj last night not only was rude and dismissive but he basically told our friend that if she came outside and had a cigarette with him then he \"might play our songs\". Are you seriously blackmailing us after we paid for songs to be played? Not only do you owe us our money back for purposely not playing our songs but you are never getting a single dollar from us again. and I'll be telling all our karaoke loving friends to never come here again.", 
    "review_date": "2013-11-29"
  }, 
  "4DrYldibe6ziPkwbU5NSOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ginger K.", 
    "review_text": "I love love loooove their martini cocktails! I'd go there just for their saketini (w/premium sake)  Plus, you get to watch people singing while drinking. Free entertainment show :)  Welcoming bartenders, nice decor, and nice location. Definitely should check out.", 
    "review_date": "2014-02-01"
  }, 
  "IrT4wZj9Oc8595VgiAGfFA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chris P.", 
    "review_text": "Went here with a couple of former colleages from Japan here on a business trip. We got here early on a Saturday night ~7.30pm. The place was almost empty, just a couple of others. We got in about 6 songs each before it filled up quickly at around 9pm. This place is small so it fills up fast and you won't be singing many songs after that. Sound system was definately sub-par though compared to what I'm used to (7bamboo in San Jose Japantown is way superior). Mikes are sub-standard and they had the echo up way too high. Also, music level was often much too high, drowning out the singers voice. I had to ask the barman to turn down the music on some of my more quieter numbers. Place seems pretty friendly, staff OK. Can't comment on the cost as my Japanese colleagues paid but $2/song isn't too unreasonable I guess for Japantown. (7Bamboo in SJ charges $1 for a song). They had a huge collection of Japanese songs which was great.", 
    "review_date": "2010-04-01"
  }, 
  "KUIv4oJcC2zKT1uiqURqHw": {
    "user_rating": 1.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Brenda T.", 
    "review_text": "I cannot say that this place is the worst establishment that I've ever been to however it's close to it.   I just went here tonight.  The place is really small and there is about 6 tables total in addition to the 6 or 8 stools at the bar area.  There were two-three bartenders working.  I arrived there at 10PM to meet with my party of seven people and it was really mellow and a little bit dead.  Around 10:30PM, people started to sing and once they started, the ball started to roll.  I've never done public karaoke before, so I ordered some Lychee Martini's to loosen me up :)  It was quite tasty and the bartenders were very fast in delivery and attentive as well; they came around a few times to check on each table.  The negative is each drink cost $9.00.  There was a huge binder of songs, which was pretty cool --oldies to current pop/rock.    I thought I'd actually be much more nervous on stage but I wasn't.  You come here expecting that people do not sing very well --it's not American Idol.  The people that I've met and witnessed tonight have all been really cool and friendly --very supportive and interactive with you when you are stumbling upon lost words.  I was actually singing a song that I have never heard and I got so much support from the crowd :)  They are very encouraging but in a non-pressuring kind of way --good folks.   Things were good until the owner started to move people around.  My group and I were asked to scoot in and squeeze together so that another group of people can sit down. This also happened to another table that was nearby us; there was an empty table where no one was sitting and the owner of the establishment had asked them to move from one table to the one where no one was sitting.  In addition to that, she took my drink away without asking if I was done with it.    Keep in mind that we've been there for over an hour or two and we were drinking and singing actively on stage.  I thought what she did was extremely rude --the rest of my party agreed so we left.  To make matters worse, we went to close our bill and found out that they had charged us for three additional drinks when we paid for them already in cash.  We tried resolving the issue by speaking to them and they refused to take the amount off.   Our night turned sour very quickly -- we will definitely never come back to this place again.  Also, I saw the cheese plate from another table and I definitely would not recommend ordering that.  It was literally slices of over priced cheddar or cheap looking cheese.  I am not impressed at all.", 
    "review_date": "2009-08-30"
  }, 
  "siuckubgSMp1DF3xNgZB1Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N K.", 
    "review_text": "I really wanted to like this place, especially after reading some good reviews about it.  I will NEVER return here.  Money grubbery - It is WAY too expensive.  My friend just had her birthday party there (weekend night) - they charged her a $10/person cover charge, my drink was $8 for a well drink, and then on top of that it was $2 PER song.  Then when she wanted to pull out her cake, they wanted to charge her an additional $20 to serve it.  So for 16 of us at the party to sing a song each (and have a SINGLE drink) it was $320!  You can get bottle service (including entry) at a shwanky night club for much less than that price.  Disorganization - On top of that they are incredibly disorganized with the karaoke.  Unlike other bars, which request people write their own names down on an organized song request form, this place hands you a blank piece of paper and no one writes their own name down.  When you hand it back to them, they put it in a disorganized pile of paper.  I put in my paper upon arrival at 9p and by 11p still it had not been entered in the machine (it shows the waitlist).  My friend paid for 20 songs for her party and had only used about 2-3 of them when I left - while the table next to us had one girl who went up three songs back to back.  Their complete lack of organization means a lot of the same people end up singing multiple times, and other people never get to go - all the while paying $2/song!  Other bars will usually let \"new\" people get priority to be more equitable.  Quality of atmosphere/service -  1.  Bartenders both bartend and KJ which means they are overwhelmed (explaining the disorganization) but it means it takes a while to get a drink or submit a song.  They should delegate one person to KJ only. 2. The microphones are awful!  Granted it's a karaoke bar not a music studio or anything, but these are perhaps the worst I've ever heard. 3.  One redeeming quality is that the bar itself has beautiful lighting and wood paneling, and it is a small intimate environment like other reviewers say. 4.  They do have a large song selection - which is also a plus.  I strongly recommend against this place.  I usually only write yelp reviews when I love or hate a place.  I think it is not worth the money.  There are too many other great places in SF.   If you're reading this from the restaurant, I've offered constructive concrete changes that could improve your place of business.", 
    "review_date": "2009-02-14"
  }, 
  "VixWUwYtTBrXSiS-JAfGow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "How L.", 
    "review_text": "This is a great local place to have fun!  I went there last night and it was consistent with the previous times I've been....tons of fun, great vibe and energy, the wine and cocktails were great (yes, I sing better after knocking back a couple), and the service was fantastic.  Plus, it's a perfect place to meet  a bunch of friends to sing your hearts away!", 
    "review_date": "2009-08-31"
  }, 
  "CxRRtAs6F5roJ9z18tfw8g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew H.", 
    "review_text": "I have had some legendary evenings at this place, but the last time I went I left rather disappointed.  A friend and I wanted to go in for a drink and a song (drink for her, song for me for her =).  We sat down at the bar, were greeted immediately and given an English karaoke book.  My friend comes for the Lychee martini (with SKYY) which I have to admit, is a silent killer.  Delicious.  I had... regrettably... a five dollar bottle of Crystal Geyser.  I wish I'd have paid attention to the menu, but keep in mind, I did ask for a \"glass of water, please.\"  Apparently, they do not offer water to their patrons.  The prices of drinks at Festa are astronomical, and there have been times where I felt like the large Sapporo was half water, but it all seemed tolerable when drunk and singing songs of joy and friendship.  It would have helped had either of the bartenders there cut us some slack and let us sing a song for the one dollar we had left after closing out our tab.  There's a ten dollar minimum for credit/debit card usage, and we weren't going to sit there and belt out five songs, so we had to accept the fact that rules is rules and sit there and listen to yet another rendition of Sweet Child o' Mine and the murder of All You Need is Love, while I tried desperately to convince myself I was drinking the best water on the planet.  \"Now I gotta know what five dollar Crystal Geyser tastes like.\"  Festa... I love you and I will return, but man... I'll never order water again.", 
    "review_date": "2010-08-26"
  }, 
  "aYJHYl5zvQ73u82AlwGlBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tati K.", 
    "review_text": "\"There is NO WAY I am singing!  I am SO scared!\"  45 minuets later...  \"Honey, this is your 6th song in a row, would you please get off the stage?\"   What can I say?  Cute, cozy, inviting place + Sake + Sake + Sake + Sake = me singing in Japanese without speaking a word of it; going on stage JUST to dance; and going back this Friday to do it all over again.", 
    "review_date": "2008-05-27"
  }, 
  "6veSoRwdfGBjxigxV91BsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurence H.", 
    "review_text": "Very cool and friendly karoake bar in Japantown.  You have to look to find it.  Lots of locals, a full bar, and huge encyclopedia of music.  A very United Nations crowd.  It doesn't look like much, but just hanging out for a few minutes and you feel like you are with a group of your closest friends in Tokyo.", 
    "review_date": "2008-05-27"
  }, 
  "ACUVZ4SiN0gni7dzVDm9EQ": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Tiffany N.", 
    "review_text": "When everything else closes up shop in the Kinokuniya building Festa is ready to party. My favorite part of this karaoke experience is that it's run by the bartenders. And they don't make any announcements about it being your turn to sing. They just keep the songs coming one after another and you have to listen for the one you submitted. When you hear it you run up to the stage and hope you make it to the mic before the words start. So if you like singing karaoke kamikaze-style in a place that's no bigger than most living rooms then get your vocal cords over to this spot stat.", 
    "review_date": "2010-12-31"
  }, 
  "-mbArZZDfAL1vjRA7YRjgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriela O.", 
    "review_text": "Intimate. And nothing beats watching your friends make complete fools of themselves after taking a few of Fernet- Branca.", 
    "review_date": "2008-04-20"
  }, 
  "wm_8WajM1ByByrF1di3tKQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kirsten M.", 
    "review_text": "Thanksgiving night worst customer service ever. Great customers celebrating a birthday party but the guy in charge of songs apparently thinks American idol missed him on their great search for talent. He's an arrogant \"kj\" who thinks he's going to be the next great thing and has no respect for his customers at Festa. Your loss.", 
    "review_date": "2013-11-29"
  }, 
  "lLfcbYGTeVxQN5Ig0ompJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elena N.", 
    "review_text": "Review #700 goes out to Festa! I don't know why, but it's seems very fitting that my first time here was with the Duke of Festa, Bobby L. He sure knows how to karaoke! Lol!  Located in the Japantown mall, it's a small bar with a karaoke stage. I've been to a couple bars with a public karaoke stage, but most of my karaoke experience in Japantown has been in private rooms, so this was a little new for me. I'm not much of a singer, but I love cheering on my friends!  We came by last Thursday and it was busy, but we managed to find a table shortly after we got there. A couple drinks, some karaoke songs, more drinks and even more karaoke songs and suddenly it was last call! Has it really been 3 hours already?! I guess I didn't notice since I was having so much fun!  The staff and bartenders are super nice and the atmosphere is very homey and cozy. Even though I'm used to private karaoke rooms, Festa has changed my mind about karaoke bars. You can have fun singing in front of strangers too! Well for me, cheering on friends in front of strangers! Lol!", 
    "review_date": "2014-08-03"
  }, 
  "E1p1QZj9sYDkoWLnIX-qsA": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Vivek V.", 
    "review_text": "a fun place but don't take it too seriously   on NYE table service was a bit slow but so what, we went to the bar and got drinks  the crowd was fun and the place had a cool vibe!", 
    "review_date": "2013-01-01"
  }, 
  "CDtbuyJBYyDT21lJMod6OA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kitty O.", 
    "review_text": "This place is still fun, still wonderful, still magical...  But seriously people, if you can't afford it, DON'T COME HERE. Don't bring 20 people for a birthday party and expect VIP service when you DIDN'T make a reservation, DIDN'T know about the cake charge (this place is CARPETED so yeah, spills of outside food not acceptable), and DIDN'T see the 18% gratuity charge.  DUH.  I was in here on a date, hanging out with the bf in the corner, when a giant group came in under the above circumstances.  They didn't just attempt to sneak their cake twice, but they didn't clap or cheer for ANY OTHER customer singing, one girl was even literally rolling her eyes through an entire song that wasn't her friends'.  Can you believe how rude that is when Festa's atmosphere is so intimate and friendly???  I was overhearing them argue about the cake stuff with the bartenders... sheesh!   So yeah, Festa is a good time... but if you can't afford it, tough for you.  Don't come here!  Because you will end up complaining when it's really not Festa's fault.", 
    "review_date": "2011-09-23"
  }, 
  "xqe8QcpRryKuK2wn5TZJYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Virginia L.", 
    "review_text": "After throwing a birthday party here for my boyfriend (nothing says love like public humiliation on a stage), I was horrified when I scrolled through my flipcam the morning after to see myself singing awkward renditions the likes of Johnny Cash, New Kids on the Block, and Olivia Newton-John.  Holy crap.  What happened that night?  Though I'm embarrassed to say I was only lucid for half the night, apparently that is the very essence of a really good time.  It seemed everyone else either didn't care, or rode the same shameless, tone-deaf bus that I did.  Needless to say, the drinks are strong.  REAL strong.  Pretty cool bartending crew.  I had reserved for a party of 12, so I had to pay about $10/head, PLUS 18% gratuity.  It's a bit steep for a kareoke bar, but given how packed it was, we were happy to have the prime real estate with a big table in the back.  By the end of the night, somehow an extra $34 got tacked onto the bill.  I'm pretty sure the final check was somewhere around $199 which already included gratuity.  That means, I had to have gotten out my little blackberry calculator and figure out 18% of $199 (the $34) - all in my totally inebriated state.  I don't remember doing it and was pretty unhappy to find that extra charge on my credit card a week later.  Now, the next part is what really made me like Festa - I called and left a message asking for a copy of the signed receipt. Masae, the manager who was out of town the day of my party, called me back personally to go over the charges.  We're still not clear on what happened that night.  Given my utter blackout, it's very possible I just made a mistake.  But she was happy to send me a credit for the extra amount to use the next time I went in - even though she said that amount probably went home with the bartenders and not to the bar.  And because of this I will definitely be going back.", 
    "review_date": "2009-11-20"
  }, 
  "Qfjh51erKvZi_dODWg_7Yw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel M.", 
    "review_text": "OK, so I understand that SF has more than its share of overpriced hole-in-the-walls. I can accept that. As Festa is located in Japantown I had the feeling that their financial strategy was to cater to out-of-towners wanting some karaoke action in the city.  That's all fine and good, what I cannot accept is charging $8 for Doritos and trying to double tip trickery.  If you are charging $8 for guacamole and chips, and you cannot serve Doritos. I'm pretty sure there's a law against it. Now, don't get me wrong. I love Doritos, but I love them when I pay 99 cents a bag, not a $8 dollars. The second offense was more serious though.   When I went to pay the bill, my credit card had been charged a little more than I had expected. There was still the tipping space left blank so I assumed that maybe another item had been added to my bill. Low and behold, they had an 18% tip added because we were part of a group. The waitress explained this fact after the matter and pointed to a dark corner where there was 12-point font that explained their policy. OK, that's fine that that's your policy, what is not ok, is trying to get a double tip by presenting a receipt where there is a blank spot for the tipping section, and not mentioning that you've already received tip.   Service was terrible anyway, which makes that 18% tip all the more ridiculous.", 
    "review_date": "2011-03-04"
  }, 
  "_don8EWxNsvRdjDJqWbw0w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine E.", 
    "review_text": "Came on a Wednesday night fairly early, which meant basically having the place to ourselves. Cute little karaoke bar. I have never in my life had to pay $2 per song at a karaoke bar. I can see how having to pay per song would limit the number of songs people would sing on a busy night, but if we are the only two people in your bar, is it really necessary for us to pay?  The drink menu was on point, but the appetizers we ordered were not. Edamame was soggy and watery and gaucamole out of a container and stale chips....YUCK.   $22 to sing 4 songs, have one glass of wine and eat some soggy edamame.", 
    "review_date": "2014-05-10"
  }, 
  "skar1XyXyjTKKUawy-NlyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian W.", 
    "review_text": "It's been awhile since I've actually gone to any other Karaoke place because my friends LOVE LOVE LOVE Festa, so I almost can't compare.    First off, I almost always have a super fun time.    Second, it's a lounge, not private rooms, so it's definitely the place to go if you either a) want to sing in front of a room full of strangers, or b) you are with just one or two others and it would be a little weird to book a private room elsewhere in Japantown.    Third, it's pretty cozy, and the drinks are pretty good (both wine and cocktails, like lychee martini).  I also like the city skyline background when you sing, as it makes for great photos!    Finally, they do a decent job of taking your requests and rotating between different tables to make sure different groups get a turn.  (Of course the negative side of this is that if you have multiple people in your group, it can take awhile for you to get to sing).    But it's a decently up to date song list (not the most current songs though),  $2 a song, and about $10 a drink.  For a few hours of entertainment it cost us $25 apiece so that seems okay.  The crowd definitely ebbs and flows - you have your regulars who sing Frank Sinatra and other oldies - but as always, the fun quotient depends on who else is there too.  It definitely gets more crowded sometime around 11 pm, and then it can be standing room only.   The only other thing I'll note is that it's in Japan Center, and it can take awhile to navigate between those buildings!", 
    "review_date": "2014-02-17"
  }, 
  "CLn96S95pDqWGkgTZS2AnA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jedd J.", 
    "review_text": "Tiny fun karaoke lounge not full of boisterous drunks.", 
    "review_date": "2010-06-30"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "The first time you walk in here, you might think it's pretty darn small and will be too cozy with the rest of the audience. I mean, we don't go to a karaoke bar to show off our singing skills and perhaps dancing talents. No, we come here to have a good time, laugh about our tone deafness, and share our drunken embarrassment on stage in front of strangers, who are also doing the same.  It's pretty inmate here, I wish it was bigger or that they'd expand it a little. The bar area could be minimized to increase the efficiency. The same could be said about the narrow hallway as well. What's really funny is that the sound of the place could be projected out onto the streets, and delight people passing by.  Drinks weren't cheap, and the bartenders had a hard time keeping track of who bought which drinks, so our tabs were mixed up pretty well at the end of the night. They have every single song you can think of. The stage is tiny as well, but we managed to fit 8 people up there, although it was a very tight squeeze. They charge for each song that you sing, which is a first for me at a karaoke place. You mean I have to PAY to humiliate myself for other people's entertainment? I guess it's to limit people from singing too much  Pretty cool place to come and hang out at.", 
    "review_date": "2014-07-06"
  }, 
  "XHuNSjrPA3Vyi7n4iVhZaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "If men didn't find me repulsive (and trust me, the feeling is mutual), this is the kind of place I would go on a date. It's tucked into Japantown and you feel as if you are in Tokyo, or the kind of place I imagine Tokyo to be: excessively priced drinks (9 dollars for a gin and tonic!? what am I, in Vegas?) and a fake skyline everywhere, with drunk old men trying to cop a feel on my hot friends.   Anyway, as a place to do karaoke, Festa is just okay. They charge per song (inexcusable, especially since there is no KJ) and this is the kind of place you will hear 8,000 renditions of Sweet Caroline in one night.   However, as a place to close out the night and ogle a cute bartender, it gets 4 shining stars.", 
    "review_date": "2008-04-13"
  }, 
  "emF8KqAfI2VL6Sfaek9gFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate V.", 
    "review_text": "Have you ever waltzed into a karaoke bar and immediately graced the stage with one of your favorite songs without even having to request it? It's the way to go, folks. And I speak from my experience at Festa!  We had just done room-style karaoke at a random sketchy place a little further down Fillmore. The lack of English selection there was just not cutting it for us, so we peaced out after an hour in search of something else in the area. Walking on Post, I saw the sign for Festa, and remembered my cousin had always raved about that place. We decided to hop into Japantown to check it out.  The minute we walked in, I randomly saw my supercool friend Jason C. on stage singing with a drunk dude and instantly knew it was gonna be a good night. He saw me just as the next song he requested--Total Eclipse of the Heart, one of my go-tos--was coming on, and called me up to sing with him. So I did! Ain't no thang. The crowd loved it... just sayin'. That's how I roll at karaoke.  But seriously. This spot has officially won me over as my favorite karaoke bar in SF. It's a bit smaller than the other ones I've been to, but as a result there are less people and you have more chances to sing. I think the size also makes it's impossible for you to have left the bar without making new friends (maybe it was just the night I went, but the crowd vibe here is super fun). There's also a full bar with the friendliest people ever serving you huge Sapporo beers ($10). The twinkling city skyline backdrop on the stage is not as cheesy as it sounds and only adds to the magic.  And of course, you never know who you'll run into here. Shoutout to my buddy Jason C. Til we sing together again ;). Festa forever!", 
    "review_date": "2011-09-20"
  }, 
  "QPGP_UNEkzrWPPyWeUZv2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Athena E.", 
    "review_text": "Festa rocks my world.  This is the place I come to a few times a month to knock a few drinks back and sing my heart out. After a long week at work there isn't a better way to unwind and decompress.   The intimate, friendly atmosphere is what makes this place tops. The crowd here is fun and supportive so even if you're a little scared to sing up on stage alone, everyone else will be singing along with you anyway. :) It's also nice to come to a karaoke bar where you don't have to deal with rude karaoke DJ's or wait around for 3 hours to never hear your song come on. Plus, their pomegranate martinis are yummy and potent.  Some people are complaining about the $2/song fee. If you're complaining about spending $2 then you should head over to your nearest seedy dive bar instead of coming to a place with a nice ambiance.", 
    "review_date": "2010-11-19"
  }, 
  "0WcUP0kdhdx4A-L9d7mHgw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Susan C.", 
    "review_text": "Um why haven't I ever known about this place before???  Yeah, hello.  I'm ashamed for being a native and not knowing about this cute, tidy, little place where I would not be ashamed to take people to.  My cousin knew about this place and he took me and our other cousin visiting from NYC and I was like \"where the hell are we going?\"  And low and behold a little bar where like one couple was drinking at the bar and chatting with a sweet waiter.  But I also felt like only early-bird special citizens would be kicking it here but none were in sight.  We ordered drinks and because only the couple and the waiter were singing I mustered up some courage and sang a song.  Then like 15 minutes later 2 huge groups of white people came in and started singing and drinking.  I was like \"how did they know about this place?\"  They must have Yelped it.  LOL.", 
    "review_date": "2009-05-20"
  }, 
  "deMySa63_mE3Jy2lWMU1Dg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "max c.", 
    "review_text": "So we spent around 50 bucks at a table for drinks and songs. I go outside for a call and see a  vending machine. I buy an awesome grape drink with REAL GRAPES in it. I bring it in. I wasn't trying to sneak it in or anything. It was a spur of the moment buy cause I was a bit tipsy. And these grape drinks are awesome.   The owner comes up to our table and tells me no outside drinks. The owner knows my friend is a regular, and still doesn't let her rule slide, so I just leave.  I give them one star for them having  \"great\" business sense!  Never coming back here again.", 
    "review_date": "2011-02-05"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "What do you say about a Karaoke bar the size of a doctor's office waiting room that has lots of asian pop and at least one Children of Bodom song in its songbook, and a bartender with sideburns that extend down onto his neck (Does this count as a neckbeard? why are there no web pages mocking this?) and six dollar bottles of sapporo?  If you think of something, let me know. I'm drawing a blank for this review.", 
    "review_date": "2008-04-11"
  }, 
  "5h4F3RxA2qLLm3wdTjcbtQ": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Stephanie R.", 
    "review_text": "Fun atmosphere and great drinks. Gets crowded on the weekend but everyone is very cool so come early grab a drink and a seat and enjoy!", 
    "review_date": "2010-10-04"
  }, 
  "oi8bxWg-Pxj4W8mV7rN6EA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael F.", 
    "review_text": "This is one of my favorite bars. The staff is friendly, the stage is intimate, and the Sapporo is served ice cold in chilled glasses, the way it should be. On top of that, there is an immense song selection (just be sure to look in multiple books) and it has carpet. Carpet? Are you kidding me?   Where else will you find a clean, carpeted bar?   Oh, and if you're lucky, you might see a local celebrity or two. This is the kind of place where you'll never run into anyone you know...unless they're on the up-and-up with secret karaoke bars in malls ;)", 
    "review_date": "2013-03-11"
  }, 
  "rrOqDzMFTvpJ4akcIYuGTQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "None O.", 
    "review_text": "I have never reviewed an establishment for yelp but I feel compelled to after last night.   I went there with a few friends for a quick drink and some entertainment. When the server came over, I ordered a shot of whiskey and a coke chaser.... When the bill came, I was charged $9 for the shot and $5 for the coke chaser. That makes a $14 whiskey and coke! I asked the server if something was wrong and he looked at me like I was crazy... Never going there again.", 
    "review_date": "2010-02-27"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "You want to go karaoke, but you don't want to rent a room and you don't want to go to a big place that has a hundred people all trying to sing.   Festa to the rescue.  The drinks aren't cheap and the songs are $2, but that's good cause who wants to spend more than an hour in a karaoke place anyway?", 
    "review_date": "2009-02-17"
  }, 
  "NLvNv-Au5Jldu84CubsoEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leroid D.", 
    "review_text": "This much is \"True\"- Festa is \"La Isla Bonita\" for you and your folks after a long day of working \"9 to 5\". \"I Swear\" if you can get Festa all to yourselves, the stage is \"Open Arms\". Otherwise, when there are other parties that are filled with mic hogs, you're \"Living on a Prayer\" and Festa just becomes a plain ol' bar. The service is attentive and friendly even for the \"Dancing Queens\". The faux skyline backdrop on stage makes you \"Hip to Be Square\". (PS- apologies for the lame karaoke-ish review.)", 
    "review_date": "2008-04-10"
  }, 
  "nGozHYFspeWe2DliD9GqcA": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "liz c.", 
    "review_text": "This place is perfect for those of you who: think you hate karaoking (I know, can you believe those people exist??), have never gone karaoking or think you're \"tired\" of the sport.  I always ask myself why I don't come here more often. It has all the qualities of a great night: amazing bar and bartenders, easy (FREE) street parking after 8 pm, several hundred songs to choose from AND those classy Asian karaoke music videos playing in the background. There is absolutely nothing more I could ask for.  Festa is such a local joint. If someone snaps a picture of you singing in front of the fake skyline onstage or merrymaking with some pals in those obnoxious red swivel seats, only locals would know where you are. I love that about Festa. Plus the door guy is cute so don't forget to chop it up with him.   I suggest coming in March during the SF Asian American International Film Fest to watch all of the festival staff unleash their inner Mariahs and Left Eyes (90s reference).", 
    "review_date": "2012-04-01"
  }, 
  "SaHQtjBdJtbjQBdq80cRMg": {
    "user_rating": 4.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Kay T.", 
    "review_text": "When I rolled up to Festa late on a Tuesday night and the entire shopping mall was deserted less a tiny bar full of people jammin' karaoke, I had no idea what type of fun awaited me.  I'm no stranger to a karaoke night. I have hit many a bar in search of a mike and some cheesy 80's music. But this one is different. It's tiny and there's no formal announcement when it's your song. You just hear the music and take the stage. It was fantastic.   Drinks were pouring. Ice cold beer and tasty cocktails all around. And there may have been a shot or two once or twice. All great and pretty easy on the wallet.   Recommend!", 
    "review_date": "2011-07-04"
  }, 
  "xH4xGSXYrctie4dHZNdflw": {
    "user_rating": 1.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Jessica J.", 
    "review_text": "If there was a way to not give this place any stars I would.  It started out okay and fun was to be had by all.  But then things quickly turned around...the owner forced us to move from our long established seats in order to make room for the already crowded room.  Then if things couldn't get worse, they double charged us for three drinks and refused to fix it.  Never, ever, ever again will I enter this place.  Never.", 
    "review_date": "2009-09-24"
  }, 
  "PBmotLhDczArA10xRJ-_5w": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Dominic C.", 
    "review_text": "BRING YOUR CAPE AND BOOTS.   This is an old school karaoke bar. You'll see the hot middle aged Japanese women tending bar and the creepy old white guys who seem nice enough but are just a little too touchy by Asian standards. Good song selection and plenty of high kick room on stage. Make a fool of yourself in front of others, there's no feeling quite like it.", 
    "review_date": "2011-04-28"
  }, 
  "WB-ivH1N3Jew0oFs98NqYQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Daisy T.", 
    "review_text": "La la la la laaaaaaaaaaaaaaa.... *glass breaks from the high pitched screeches*  When I think of a karaoke place, I think of those Korean owned places with individual rooms. There are endless booklets of English, Korean, Chinese and Japanese songs to choose from. And ALL the music videos have absolutely nothing to do with the song it's played with.   Well, this is definitely NOT that kind of karaoke place.  This is an OPEN MIC karaoke place. Brave souls (or just really drunk people) can sign up to sing whatever song they want to the entire bar. I can see where the appeal is after you've hammered a few drinks. They may be loud and out of tune, but they're definitely having fun!  The bar itself is tiny and located inside the Kinokuniya building in Japantown. It's shoved in a little corner on the second level. If you have a hard time finding the place, just listen for the faint yet amplified screams of tone-deafness.   It may be small, but it's a full bar inside! They even have soju and sake by the bottle!   With a great selection of alcohol and the endless volunteers for karaoke, you can be entertained for hours! And if you can't stand the sound, take a breather in the hallway or down another drink. =P", 
    "review_date": "2013-04-01"
  }, 
  "BRh5hZvTU-xYXux5WnjBMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "Seriously.  I'm a HUGE fan of the Mint.  It's my go-to place.  However, sometimes it's crowded.  Sometimes, the talent is pretty amazing.  Sometimes, it's a s***show.  Regardless, karaoke is in my blood and needs to sing.  I was having an early dinner at State Bird Provisions (see that review too!) with some periphery friends.  I'm just getting to know these folks and dinner was great for conversation only to discover a mutual love of the karaoke.  They mentioned that Festa is their fave place and right around the corner.  Epic.  The place was empty on a Saturday at 6:30.  We sang 9 songs before the next people came in.  When they did, so did everyone else, but that hour almost of just us and the drinks and the stage and the decor and everything.  It was pretty great.    While I hate to yelp about this for fear of other folks finding it, I still think you need to experience it.  I'm likely not due for another karaoke adventure until July, so have at it until then and maybe you'll hear my mean \"Careless Whisper\" like a siren song luring you there.", 
    "review_date": "2012-04-09"
  }, 
  "S34qI4Jvdn-Nn5rfuKzgYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jiajia C.", 
    "review_text": "Leave your dignity at door.  This is the effing real deal, the Karaoke BAR.  None of that bullshit booths with people humming along...  It's just you and the strangers.  There is an intense correlation between utter excitement and the anticipation of being possibly humiliated.  The latter usually breeds the excitement, I think.  But ultimately the environment at Festa is more than friendly, as long as you're drinking.    And be warned: Sweet Caroline is the herpes of Karaoke song.  You'll be guaranteed to hear it for days, annoyed, yet incapable of getting rid of it.", 
    "review_date": "2008-07-01"
  }, 
  "v27Rcd0iqJNvIQ_3gtaD4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi V.", 
    "review_text": "\"So I put my hands up, they're playing my song...\" YEP. My friends and I sang Miley Cyrus and so much more.  Our large group came here on a Friday after dinner together and found this to be one of the better places to spend the rest of our night. There were so many music choices and all different types of people in here. My white friends were so shocked to find other white people who were able to sing in Japanese and Chinese - they were confused. REALLY CONFUSED. It was great!   My friend really wanted to come here because as a frequent customer, she loves hearing one of the bartenders sing and HE WAS REALLY GOOD!   PLEASE - for the sake of everyone else. If you ever come here, sing an upbeat song. You should only be allowed to sing a depressing song IF you are amazingly good and have soul. Otherwise, spare us - we're all trying to have a fun time!   Overall, I think everyone had a great time. Great for large groups of people, but not too large because it does get a little crowded. It started filling up around 9:30 p.m.   They also have lychee martinis here - YUM! Perks of asian-inspired bars...", 
    "review_date": "2013-08-04"
  }, 
  "KWqtFdvWPN4viYncgRANfA": {
    "user_rating": 5.0, 
    "user_location": "Coppell, TX", 
    "user_name": "Jennifer W.", 
    "review_text": "BEST.PLACE.EVER.  I'm not a lover of karaoke, but I LOVE FESTA.  I usually refer to this place as SHOGO'S! (let's go to SHOGO'S!) because he's one of the bartenders (this chill Japanese guy who's in some punk Japanese band), and, for some reason, around the end of the night, we start yelling his name over and over again (SHOGOOOOO!! SHOGOOOOO!).  Usually, it's while we're trying to shove a shot down his throat.  Whatevs.    Anyways, it's a small, kinda cheesy room with a bar, some seating, and a stage - none of this private room crap.  Song selection is pretty good (Japanese, Mandarin, Cantonese, prob Korean and of course, English) and they're pretty current.  People who frequent the place appreciate good singing but appreciate it even more if you just lay it all out there on stage.  Just belt it, who freaking cares if you're not an awesome singer and don't know all the words?!  EVERYONE ELSE THERE SINGS WITH YOU!  EVEN IF IT'S IN A LANGUAGE THEY DON'T KNOW!!  It's like one big happy family!  You may not get all the songs you put in, but that doesn't mean you can't sing along with everyone else's!    Not for those looking for a quiet place to sing every song they know.  Cuz it ain't gonna happen.  At least on Fridays and Saturdays.  Only thing is drinks are on the pricier side so a little pre-partying wouldn't hurt.", 
    "review_date": "2009-08-06"
  }, 
  "DvVj-bD8-ccNW1m7zCO7WA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Doctor L.", 
    "review_text": "Best karaoke bar in SF.  Great selection, real track music or at least close to it (not that crap muzak they use at Nap's).  Unquestionably worth the $2/song.  My performances last week: \"Dreams\" by Van Halen (ie: Van Hagar) \"Just Like Paradise\" by David Lee Roth \"Goin' Back to Cali\" by Notorious B.I.G. \"Mr. Roboto\" by Styx  ...plus some more that I can't recall right now.  I need to hang out in Japantown more often.", 
    "review_date": "2008-10-31"
  }, 
  "LeKErORR7n1_Z4WeWxhWHA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah C.", 
    "review_text": "As a previous Festa fan of four years, I'm truly disheartened by the fact that the bartenders hassled my party to buy drinks not even 10 minutes upon arrival. Also hassled again when a new comer came in to check it out and just say hello to us- we were still working on a large sake. For some reason they SHORTENED happy hour to 1 hour (okkkk?). They advertise happy hour for 2 hours when in actuality it's one hour from 8-9pm and by 8:30pm they will charge $2/song for the simple reason that by the time your song gets played it would be past 9pm. Now no one is saying that $2/song is too much for karaoke but when you're friends are being told to, \"not make a big deal about it\" it really sends a tactless message to new patrons. I talk this place up all the time but truly- it seems to be turning into a sham of a nightlife establishment. It is so unfortunate to us veterans to know that a gem like Festa is going down hill from here. We ended up paying just as much for a private room at DoReMi karaoke studio down the street and had an epic time!", 
    "review_date": "2014-03-06"
  }, 
  "fjhiDNGbrSfzfDxWbWgimA": {
    "user_rating": 5.0, 
    "user_location": "San Luis Obispo, CA", 
    "user_name": "Paul B.", 
    "review_text": "To view the entire review, check out my blog (link in my profile)  What an absolute blast! Nice ambiance, a welcoming vibe (especially for a trembling first time karaoke singer like myself), nice drink selection and awesome bartenders!   Atsuko, one of the bartenders, was so friendly made us feel right at home. Service was quick even as the place started to heat up. And you didn't have to wait all night before your song came up like some places I've been in LA.  Bravo! I'll definitely be back!", 
    "review_date": "2014-03-04"
  }, 
  "IqZGTaY2zNP5CT0xY6JsBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "The only way a karaoke bar can beat Festa is if the Bon Jovi, Guns 'N Roses, and Elton John songs are actually being sung by Bon Jovi, Axl Rose, and Sir Elton John.  Don't let the unassuming entrance and small size fool you, as this intimate bar packs a serious punch.", 
    "review_date": "2012-04-23"
  }, 
  "JADdo9NEeO5Az9aOYbyvZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Manda Bear B.", 
    "review_text": "********************* 1225 **********************      A cool karaoke place inside the Japan Town, tiny, and it was jam packed at 9:30 PM on a FRI night. A few tables, a small bar with less than 8 seats. Limited wines and cocktail list.      Capacity can not be more than 30 people.  I counted 40+ at the time I was there. I came in for a quick drink. They substituted the wine I ordered. I guess no one drink wine on a weekend night but me! Somm problem, ehhh!      The white bartender was nice and cute. Nice owner too, she remembers my friend. People were signing, laughing, and having a great time. Service was nice and fast. Just got into the bar to order your drinks was a struggle because it's too packed. I got a seat at the bar, and I got a few girls pushed me and knocked their giant handbags over me. I guess this is why I rarely go out anymore :-)     If you like me, like a personal space, this is NOT for you. If you like to smell other people sweat and people screaming at your face. You would fit right in here. It's definitely a cool joint if you are into karaoke with a group of friends.", 
    "review_date": "2014-12-18"
  }, 
  "Q9nLBFOUMpEfAUU_lncZpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francisca C.", 
    "review_text": "This is the funnest place. Yes, the drinks are pretty expensive, but it's just the cost of night life. I just wish there were more people who went there to sing who weren't so good. Everyone seemed to sing pretty good. Oh well, I still didn't mind singing badly. Yay. Oh, the song book was great, BUT, my only problem with it was it's organization was confusing. You could sit there for hours looking for stuff. Other than that minor issue, this place is a blast!", 
    "review_date": "2008-12-22"
  }, 
  "lUfLgIjISLFmWbJNkkqNxQ": {
    "user_rating": 5.0, 
    "user_location": "Placerville, CA", 
    "user_name": "Alisyn g.", 
    "review_text": "One of my favorite spots!  They are oh so very accommodating when let's say I get the urge to pop in and sing a song right before closing time.  Excellent customer service.  A fabulous selection of songs.  And the drinks and cocktails are super yum!  Who could ask for anything more really?   This might just be one of the Best karaoke spots in the Bay Area!", 
    "review_date": "2009-08-10"
  }, 
  "SjYund2wfZYp5M5VtuFtlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James W.", 
    "review_text": "Cool place, lots of people coming in for one or 2 drinks and belting out a favorite tune. There is a stage with 2 mics so if you are shy, you can invite a friend to sing with you. Staff and bartenders are friendly. Even if you are not a good singer, the crowd appreciates the effort.", 
    "review_date": "2014-02-15"
  }, 
  "1nu_dQuqLsRC8kP_CJCQsw": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brian P.", 
    "review_text": "The place is a rip off vodka and a beer 17 dollars. Don't come here!!!!!!!", 
    "review_date": "2011-05-22"
  }, 
  "Szg--2wonu3BEdIav_vbCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rohan D.", 
    "review_text": "I'm reviewing this place as a place for a private Karaoke Event.  So I've had two friend's birthdays where they decided to Karaoke. One was at a regular Karaoke place and one was here. My friend rented out the entire room for some unknown amount of money. But it was worth it.  Unlike the regular asian places where there's no central point of look at everyone just looks at the screen, this is more how I thought karaoke should be. With one or two people singing the actual song in front and being able to put on a real performance.   The alcohol was decent and regularly priced, the service was excellent, and they had giant song books with pretty much every song known to man. There are of course exceptions (really no OffSpring?), but whatever. They also have far more modern stuff, this is the only place I've seen Lady Gaga in. They even had the latest Katy Perry song (the one that just came out from the date of this review).   One weird thing was that the books titles were mixed up. The one that was sorted by artist was sorted by title, the one by title was actually by artist. UPDATE: This was fixed, apparently the owner reads Yelp reviews, if only there was 6 stars?", 
    "review_date": "2010-11-25"
  }, 
  "FgBx3WFYm7R-T_sSp2XK7g": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Ishmael V.", 
    "review_text": "this is a japanofile mecca!  you can get your drink on and sing till your heart's desire.  you may even be able to pickup a kogaru if you try hard enough.  on any given night you may be able to spot a group of salarymen here for business, singing britney spear's songs.  prepare to dish out some okane, and expect some nihon style prices.....they charge per song  other than that...this place is awesome!", 
    "review_date": "2007-11-07"
  }, 
  "ICwMfseYkrB0ZEK8tDUOHw": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Annie D.", 
    "review_text": "I would have never known this place if not for Tiffany N., who wrangled quite a few of us into this shopping mall for karaoke the other night.   The tiny lounge is nothing much to look at (unless you like fake cityscapes gracing the walls), but the atmosphere was super friendly with everybody cheering and singing along. The bartender was one of the smiliest people who ever lived too.   The bartenders do everything, so you pop them your song and two bucks (paying to sing is still pretty foreign to me, but I hear it's common in SF). Then, everyone stares at the screen after each song, braced to sprint up to the stage if they hear their song starting. This flustered me the first time since I didn't know (and missed like, three lines of my song before I made it up there). However, it's super efficient and it works well for them here!", 
    "review_date": "2011-06-30"
  }, 
  "dpEtyfB2o7MH1Mc_Ygoolg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron V.", 
    "review_text": "Possibly the best karaoke bar in SF even though it's fairly unknown. Festa is all about the music. I saw some fantastic singers here. They were so good that I was embarrassed to go onstage. Eventually I worked up the courage to bust out a 10 minute performance of Rapper's Delight -- a song I haven't seen elsewhere.   The song selection at Festa is huge and bigger than any other place in SF I've been to. The friendly bartender kept the hot sake coming and I had a great time here.", 
    "review_date": "2009-09-09"
  }, 
  "lsSiIjAKVl-QRxKjRErBeg": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Cin T.", 
    "review_text": "Nice ambience and owner/bartender Ken is fun and down to earth. The other bartender doesn't speak english well....or at all? It took a while to explain/ask her if they had Level Vodka because she didn't understand me (it wasn't loud in the bar, there were only 3 other people aside from our group of 5).   I asked for Belvedere instead but she couldn't read the labels of vodka that was on the shelf. I kept telling her \"the last one......the only one on the shelf that has the letter 'B'!). She went down the line, pointing at each and every bottle while asking me if that was Belvedere. Oy vey.....  The song selection was good and the sound system was decent. The only thing I didn't care for was the stage that you have to stand on to sing. Luckily for shy people like myself, Ken has 2 cordless mics set up in addition to the mics on the stage. I was able to sing from the comfort of our table.   Songs are $2 each but they do have a Karaoke Happy Hour that runs from Mon to Thurs, 7:30pm to 9pm. Just mention \"yelp\" to get in on that deal.", 
    "review_date": "2011-03-22"
  }, 
  "nwfojiMFQQJhNkR7vCCwyw": {
    "user_rating": 5.0, 
    "user_location": "Piedmont, CA", 
    "user_name": "Miya K.", 
    "review_text": "Festa is my favorite karaoke bar in SF. The cityscape backdrop is so cute! They have a great sound system, so you actually sound good and can hear yourself, unlike other places that have crappy mics and speakers. Pretty good song selection-they actually have two different books, so you might want to check them both if you're searching for a certain song. Ken, the bartender/server, always makes us feel welcome. The vibe is cozy and the crowd is friendly and supportive. Festa wa totemo subarashii, desu!", 
    "review_date": "2008-10-04"
  }, 
  "puS8HuNdeXhhl5F4bb0EEg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam S.", 
    "review_text": "I dig karaoke...a lot!!!  But I had a very bad experience coming here.  So I came here with good friends of mine.  The place has good decor no doubt but $2 a song?  Come on now, really?  I wanted to have spent that money on drinks instead.  And there was a time where they were playing songs of people who requested after us and turns out they had put my paper at the bottom by mistake.  We had a little disagreement with some drunk girls who tried to steal our stage during our turn.  No respect at all.  If that wasn't irritating enough, the management didn't do anything about it.  Okay, one of my friends was a regular here.   And he's been bringing 4 or so people with him each time.  Where's the pay off for loyalty?  Apparently, they didn't care.  We left that place annoyed.  Too bad Festa, you lost one good customer, oh wait, make that 10 and some customers.", 
    "review_date": "2010-09-16"
  }, 
  "WUrP2e3c4UnfOvrZw9mpNw": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Dinelle L.", 
    "review_text": "I call this place \"The Water-Hoarders\" due to the surreal struggle i had getting a glass of precious hydration in this pace. I walked in with a group of about 8 friends around 11. The server asked me for my order first, and being that we had just walked about 15 blocks, I said I just wanted a \"water for now.\" The waiter told me I had to order something else. I thought he might be joking, so I just stared at him. I told him I was going to order a drink in a bit, and he said \"everybody lies and says that. You have to order your drink now or else i will charge you for the water.\" I turned to my friend and audibly requested that she order the controversial H2O on my behalf. She ordered a beer and a water, and when he brought back all the drinks for the table he shot me a dirty look and ceremoniously sat the water down RIGHT in front of my friend.  We all sang a bunch of songs and actually had a pretty good time (although I credit that to the musical stylings of my crew). We were not at all shocked to find that when our checks came we found mysterious and random charges. I asked why my $9 lychee martini (which was made with well vodka and was one of the worst I've had) came out at 12. The bartender told me \"sometimes the owner adds a gratuity. If you have an issue you are going to need to take it up with her.\" The owner was glaring at our group (which brought in the bulk of their business that night and made friends with most of the other patrons) so I just paid and left. Even though I begrudgingly admit it is a fun environment, I will NEVER go here again and encourage you to find a place that does not bite the hand that feeds.", 
    "review_date": "2009-09-20"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Who knew that J-town was totally happening on a Saturday night?    When we couldn't fit our entire party into the small karaoke room at Playground, a few of us drifted over to Festa, located near the Kinokuniya Bookstore in the Japan Center.    OMG.  THEY HAD KARAOKE THERE TOO, Y'ALL! (With a pretty damn good song list, including songs in Korean and Japanese.)  There weren't that many people when we got there, so we commandeered a few tables and a lot of chairs and ordered some drinks (a liiiiiittle on the pricey side, but it's near a hotel, so I guess that's somewhat understandable).  I did my best Mariah Carey impersonation and was warmly received by the enthusiastic audience.  As the night went on, more and more people came in and joined in the karaoke festivities.  Fun little spot, complete with swanky decor and illuminated cityscape backdrop on the karaoke stage.  It was fantastic, and I would most definitely go there again!", 
    "review_date": "2008-04-06"
  }, 
  "F_5_UNX-wrAFCXuAkBZRDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rodney H.", 
    "review_text": "I've been to Festa numerous times and I must say that performing karaoke there is not for the shy folks.  But if you are one, it's a great way to conquer your shyness and just let loose and have fun.  It took A LOT of visits for me to finally have to courage to go up and sing.  Keep in mind, I am not a singer, but I enjoy singing tunes while I'm driving so this was a way to share some of my favorites to the audience at Festa.  Of course once you get used to being up on their stage, you get really comfortable and then actually want to belt out tunes on a whim.  If you're just starting out, I really recommend going Sunday-Wed when it's not as busy and you can get in more than one song.  The crowds are usually full of regulars during these times and they are really cool folks.  The song selections are pretty extensive and they get updated periodically.  I don't drink much alcohol but they do have a nice menu of wine, cocktails, and beer.  So it's a great spot to take a group of friends or family for some drinks and entertainment.  I really have to thank Bobby L. for introducing me to Festa.  It's become a great new hangout for me with a great atmosphere, cool people, and fun musical entertainment.", 
    "review_date": "2014-10-24"
  }, 
  "Pf1unbro2fH4lkd_9yfm3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connie B.", 
    "review_text": "Wow! Ok years ago I used to come here...it was double the size and served shrimp treats...super cheese... Fast forward Now.....Much Much Better Cool intamate stage....Love the Background... I had a really Great Time here. The Bartendars were Very Friendly. Drinks are Pricey but that's exspected...I think its odd to charge $2.00 per song when people are paying 10.00 a pop for coctail s , I understand more when its slow...but one has to Pay to Play ...its all Good.... I had a Blast , the Cat's I ended up chatting with were so much fun and were such nice people.They come here alot, and geeze they had Amazing Voices...so so fun....I rarely get out...They were forsure the Big Bonusus to meet.Thanx so much for not laughing at me singing buck owens stuff....Im glad the guy from Texas moved here...R&amp;B suits him well...Lol, fantastic Voice..... I was stopping in for one Cocktail after the Bathhouse and ended up staying until 2:00.... Im. Not sure about others but The Staff was very very friendly..singing was absolutely free until 9:00. Its 2014 get over yourself for complaining...shame on the Negitive reviewers.... Thanks japantown for keeping this place inside....keep laughing", 
    "review_date": "2014-06-19"
  }, 
  "MwMSwfSGVkebwH2FZaZybw": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Liz T.", 
    "review_text": "I found this place while visiting family during Thanksgiving break (Sister in law played a show at Yoshi's around the corner). The first time we walked in it was completely packed, so we hit another bar and came back at around 12:45a.m.   When we (party of 5) returned the place was about half full, yet it still took over 20 minutes before anyone approached our table (the guy at the front entrance). I asked him if I could order a drink from him, he went and got someone.   By now only half of us wanted to keep drinking. Our waiter told us it was a rule that each person had to order a drink. At this point our party kept looking at the menu.   Two songs were ordered at $2 each before the book was taken away from us because \"we're just full.\" Another, delightfully smiley server came and asked us to order drinks- one per person. All but one of us ordered a beverage.   During one of our songs, another girl jumped on stage and stole the song.   When I was billed, I was arbitrarily charged $2 for not having everyone buy a drink at my table. I asked the server to charge me appropriately. He did, rudely. Then added a dollar in \"sales tax.\" Not only is alcohol not supposed to have a sales tax unless you're in a restaurant, the tax was just not right.   I asked the server for his name and he replied, \"I don't have to give you my name.\" Of course not. He was the only white server on the Friday after Thanksgiving with brown hair and some facial hair.   I love supporting small business because of the quality of service. I am an excellent tipper and say my please and thank yous. This place gave me the worst service in San Francisco during my 5 day visit.   If you value your time and money, support someone who does too.", 
    "review_date": "2013-12-06"
  }, 
  "re3AdczLFP4D7xwI6DkBNA": {
    "user_rating": 3.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Vicky T.", 
    "review_text": "bathroom smelled like vomit but considering several individuals were over the limit on their libation intake made sense..   cute small venue  owner was super cool  TONS OF SONGS!", 
    "review_date": "2011-07-12"
  }, 
  "bG6DkJKwhKMMQ0Z3GSOpmA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete J.", 
    "review_text": "When you're rolling to a karaoke joint with someone who considers the Art of Karaoke more of a Bloodsport than an Art, you know you're in for a good time.  I'd argue that the ambiance of Festa is worth the trek to Japantown alone. Then again, I was really drunk when we got there. There's really no excuse for the wallet-walloping drink costs &amp; the $2/song request fee.  Seriously? You're CHARGING for each request? Aren't we supposed to just TIP really well so that you'll play them? They're really not down with Formalities here.  Still, a great time was had by all, &amp; this is definitely the kind of bizarre place you will feel priviledged to close your night out at. Just make sure you save Guns N' Roses for the finale, because there's really no way you're going to be able to sing anything else after shredding your vocal chords on that Axl impression.", 
    "review_date": "2007-07-15"
  }, 
  "bxPYREtZeH98clXftApGhg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren P.", 
    "review_text": "i'm surprised at all the rave reviews for this place.  the group i was with arrived to festa around 9:30pm or so.  the five of us camped out in the booth in the corner.  it was my first time.  man, what a small place... not in a bad way, just intimate and i never would have known this place existed.  i don't think it's divey at all like some of the other reviews said.  i've done divey and festa is not divey.  you can't call a place that charged $9 for a gin and tonic a dive bar.  speaking of $9 gin and tonics, i order a tanqueray and tonic and it was $9 and on my next drink i thought to specify that i wanted their well gin thinking it would be at least a few bucks cheaper... nope, $9.  i had three drinks and i could have taken that $30 and purchased myself a bottle of gin, tonic and limes and gotten myself sloppy drunk.  ANYWAYS...  i'm a huge fan of karaoke and was surprised to learn that you have to pay $2 to sing.  uh, come again?  and the guy who manages the karaoke thing told my friends that the song order is not done by who gets their songs in first but instead by table to limit repeats or something.  yeah, well, what we didn't know is that you can slip the karaoke guy some extra money to get your song bumped up to the top of the list.  we learned this when someone in our group had to wait like 45 minutes for their song.  seems like it could be a fun place... but over-charging for drinks, charging for karaoke, limited seating... no thanks.", 
    "review_date": "2012-03-29"
  }, 
  "Qrza-_Tu6MCBYZ4B1M06pQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claire C.", 
    "review_text": "OK here's the date:   1) Sammy Hagar concert at the Fillmore   2) Pancho Villa Taqueria for tacos and beer   3) Festa Wine &amp; Cocktail Lounge for Karaoke   Is this a weird date?!  YES, it really really is.  Was it awesome to be the first person to have to sing in front of a crowded room of blank faced Japanese men, YES, I seriously kick ass at Whitesnake songs so that was no problem.  Bizarre but cool that on said date we did not one but TWO (God I'm sure everyone was SOO sick of us) duets, one to summerlovin' (yes, we did that, everyone groan) and one to Patience by G n' R.  God, I mean really this was the most unconventional date in the history of the universe but also super duper fun.  This karaoke bar RULES.   Apparently the dating bar has been set, I can't really humiliate myself any more than I already have with this guy so the door is wide open.  Perhaps on the next date we will go to a mime class or improv, really the sky appears to be the limit.", 
    "review_date": "2008-01-31"
  }, 
  "Jt_GERujHtgp65YYN2c9gg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "andy d.", 
    "review_text": "Tuesday night. Jtown is quiet. Eat sushi. Wander the empty halls. 9pm. Doorway seeps dark energy. Pulled in. Koji cleans glasses. Kim at usual spot. Three red wines. Nobody singing yet. Make that two wines, one Sapporo. Chatter in Japanese. Koji laughs. Nice to see you again. Green Day comes on. Remember last time? Yukiko pulls my arm. Do you have the time? To listen to me whine? Dance like Jagger. More Sapporo. Koji plays a Gibson SG. Older Japanese guy sings. Respectful lull. Devastatingly sad song. Applause. 11pm. Yukiko is a pilot? And a bartender? Sachiko is given the mike. I didn't know you could sing! You're a nightingale! Elvis has entered the building. Air guitar on Yukiko's leg. Kim loves Elvis. Harmonies on Lauryn Hill. Club soda, then more wine. 1am. Finger food. Promise you'll fly me to Vegas? I'll totally do it. Another sad song. Quiet. Old man has heart! AC-DC. Devil horns, rock faces. We salute you. Gulp down Sapporo. Goodbye, thanks. Come to my gig. I didn't know you could sing? Vegas, we're doing it. Stumble to cab. Daydream on the way home.", 
    "review_date": "2007-07-08"
  }, 
  "X7PUjszRgvM7fllXP3AwtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "AJ L.", 
    "review_text": "We love Festa!  It's a small, fun Karaoke bar in Japantown.  Good Karaoke selection, the service is great and prices are reasonable.  And there's always a fun crowd.", 
    "review_date": "2014-02-17"
  }, 
  "ET8n-r7glWYqZhuR6GcdNw": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Michelle C.", 
    "review_text": "Ben B said it best when he described Festa as \"looking like an airport watering hole in Tulsa mixed with a stage borrowed from bad nineties stand up.\"  I couldn't describe the place better myself, and I won't try. Walking into this scene made me instantly melancholy and perhaps a little icked out, but I knew there was a bigger reason for my presence, and it wasn't the decor. Karaoke!  When I discovered the drink list and the option of a lychee martini, things were looking up considerably. Especially when the bartender humored my request to modify the recipe ever so slightly. My drink was fantastic, so I had two more.  Liquid courage on the rise, I jumped on stage with my cohorts for a group effort and then once more on my own. The friendliness of the crowd encouraged these actions; everyone there was like one big support system and the biggest fan of whoever was on stage at any given time.   Songs were $2 a pop, which could add up quickly depending on how much you like the limelight. Our final group song started playing only after we started to make our way towards the exit. In unison, we graced the ears of Japan Town with our loud homage to The Darkness' \"I Believe in a Thing Called Love\" as we stumbled into the night.", 
    "review_date": "2011-01-13"
  }, 
  "SmjeMKNlfHWjVwQ2sDQKvQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "alita c.", 
    "review_text": "Came back into town recently to visit and of course I had to stop by. Had a blast and their lychee martini's are still the best around :)", 
    "review_date": "2010-09-24"
  }, 
  "icl0oYE-ykZ_EHyYtKZmKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Winnie Y.", 
    "review_text": "I just celebrated my 30th birthday at Festa.  The tiny little karaoke bar was perfect for my cozy party of about 30 people.  The folks who run the place are super nice and friendly and the bar/lounge/bathroom are surprisingly clean.  They also let us bring in a birthday cake and provided a knife and extra paper plates at no charge.    The crowd at Festa was awesome.  My friends and I pretty much took over the bar for the entire night and not only did no one complain, everyone sort of just joined in the party.  You can tell there were a few regulars but a couple of the groups looked like they just went to check it out and they were good sports and even helped us celebrate.  The best part was the cheesy backlit cityscape behind the stage which provided the most hilarious backdrop for photos!        They charged us $10 a person cover since we were a large group and took up 80% of the bar but they also threw in 20 free songs which are otherwise $2 a piece.    Despite the extreme smallness of the place or maybe because of it, I had a great time at Festa and would definitely recommend it to people who like karaoke.  It's a change from the usual bar night and even if you're not a singer, you'll be thoroughly entertained.", 
    "review_date": "2007-11-25"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "There are certain songs that are best left in the privacy of your own shower. These are examples of what you shouldn't sing at Karaoke lounges:  1. Depressing songs -- i.e. I will remember you by Sarah Mclachlan. You may have the voice of an Angel my dear, but this song gets everybody down.  2. Super looong songs -- remember Meatloaf's I will do anything for love? yeah. it goes on F-O-R-E-V-E-R.  3. Prince's songs complete with an exact rendition of Prince's voice. (same goes for the Bee Gees!) Just DON'T. Unless you're cute like my sis then it's okay.  This intimate lounge sure brings the fiesta to Japantown. It's located inside the Kinokuniya strip mall. There isn't a happy hour for drinks, but if you come between 8 - 9pm on Mon - Thurs, songs are free just mention yelp. Otherwise, It's $2 per song (good luck finding it!) if you're like one of those people with crappy memory like I do who can't remember the artist or the exact song title, the thick binder of songs will have you searching for awhile. Plus, you have to watch the screen when your song comes up and make a dash for the stage since there isn't an official DJ here.   You'll have a good time here for sure! The crowd is supportive and it doesn't matter if you've fallen off your chair twice (some guy, not me!) or can't carry a tune, people won't judge you here. Think of it as training ground before unleashing the karaoke queen in you at The Mint.", 
    "review_date": "2011-01-04"
  }, 
  "AETw9Uu23KSsxs6KREz6gw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz D.", 
    "review_text": "Yay Festa!  This place is great.  Damn expensive but oodles of fun.  And it never fails to impress; everyone I've brought here seems to agree it is like no karaoke bar they know.  Come to think of it, it kinda reminds me of the karaoke bar in \"Lost in Translation\" and if I came here one night and found Bill Murray covering Roxy Music, I might only be mildly surprised.  The space is super intimate which only makes the idea of getting on stage all the more dangerously enticing.  Oh yes, I've seen many a hardcore opponent of karaoke go down at Festa, try as they may!    The best thing about this place?  Number one with a bullet: the stage backdrop!  I think the owner, who is cute as hell and saccharine sweet, nicked it from the set of a Cars video (I'm thinking specifically of \"You Might Think\", but any would do).  It's pure 80's class, which if you can remember wasn't very classy.  It's classy like that Nagel print you bought from Deck the Walls in '84.  Bring everyone you know here some night, maybe a Tuesday or Sunday night, and just take that joint over.  That's really the best way to do it.", 
    "review_date": "2008-05-01"
  }, 
  "JcDXaiU3uOVAgi_c6JM2Zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "adam b.", 
    "review_text": "it was saturday night, I guess that makes it alright ...  actually it was \"awesome\".  went in at midnight and the place emptied out by 1 am and my friends and I pretty much had the entire place to ourselves.  A LOT cheaper than playground across the street but of course .. you have to share :(  it's a very small and the lighting is waay bright - they need to turn that down a notch.  If you are not comfortable being close enough to sit in someone's lap while you sing, this may not be the place for you.  the song selection is decent and they've got 2 books listed by artist which I like much better than listed by title.  if you are a heavy drinker, its gonna hurt - my last tab was $200+, next time I'm getting nackered somewhere else before heading there.  bartenders are very cool, I highly recommend buying them shots :D", 
    "review_date": "2008-10-16"
  }, 
  "vSTi9G85c5c8RNPFIEMETQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny K.", 
    "review_text": "This is my best friend's favorite bar. I was rather apprehensive because I really don't like singing in a roomful of strangers. I prefer doing karaoke in a private room with only friends and/or family present. However, this past New Year's Day, after a few drinks, I conquered my shyness and belted out a few tunes on the stage. I was surprised that I wasn't more freaked out. In fact, I had a damn good time.   This bar is quite cozy and intimate, with several tables and chairs set up all over the room. The stage is small with a rather cheesy cityscape backdrop. A TV screen in front of the stage displays song lyrics. The song selection was pretty good - a fair number Western, Japanese, and even Korean tunes.   This Japantown spot is Japanese-owned and bartended. The bartenders are very cool and the atmosphere is lively and fun. The crowd is an eclectic mix of older and younger folks, mostly Asian and Caucasian.   While I still prefer the private karoake room, I would definitely come out to Festa again. And if my friend has her way, it will undoubtedly be soon!", 
    "review_date": "2008-01-02"
  }, 
  "yaELxT1PMcGOPOQKy2wzgA": {
    "user_rating": 3.0, 
    "user_location": "Danville, CA", 
    "user_name": "Juan M.", 
    "review_text": "Great!", 
    "review_date": "2011-01-02"
  }, 
  "vCyvUmbQkCYct6JXlmXRaQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Eva Y.", 
    "review_text": "Ah! This place is one of my friend's favorite places for karaoke. This is a nice little bar and karaoke bar. Their lychee martini is yummy and the service is very good here. The only down side to this is that it's so busy on Friday and Saturday nights. If you get there after 10pm, it will be standing room only! Other than that, great place to chill, sing a little, and hang out with friends over a couple of drinks.", 
    "review_date": "2011-03-14"
  }, 
  "Wmx35wh-_dt8cjjDmDsGtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily K.", 
    "review_text": "So I'm Korean... and I've done more than my fair share of karaoke! While Festa isn't perfect, by any means.. they have an ammmmmmmmmazing selection of music! music! music! I was amazed and basically wanted to sing evvvvverything.  Also, love the decor.", 
    "review_date": "2008-12-08"
  }, 
  "TLzwLBhPoO33w85VOXz97g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobu K.", 
    "review_text": "FESTA! Do you think Japanese are all crazy? The answer is .....Yes.  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DxnSw-0Ut0jk&amp;s=e600f1649f906c730f44a6d5e80f19a4e573a0e676d6e9f5afadeeccaaad423a\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=xnSw…</a>  But there are few differences.  Japanese from Japan, as JJ. Japanese from Hawaii, as JH. Japanese from North America, as JNA. Japanese from South America, as JSA. Korean from Japan, as KJ Chinese from Japan as CJ. Philippino from Japan, as PJ.  They are all crazy ass and grew up with Japanese language.  In my case is, I do feel close to all of them.  JH and PJ, I think because we are both in a small Island. KJ and CJ they have been there for a long enough and many of them become real JJ. JNA is most different than others. Even though you have parents both from Japan, grew up in North America does make separates. Separates what? What happens living North America? Well, you know,  Fat, laud, baseball cap, T-shirts, shorts, FXXXin' birkenstock, white socks and sneakers,.... those. No, that's not a point.  That's a good part of US. Do wear whatever you want, but I don't. I just hate shorts.  Thing is this, if they speak more text book perfect Japanese gets more obnoxious because sometimes missing the etiquette. I don't really care all hysteric-Japanese etiquette but there is something you shouldn't say certain thing in Japanese especially to older man. To speak older Japanese men is annoyingly difficult because they are such an arrogant prick sometimes. Am I arrogant prick sometimes? FXXX No, well, I try not to.  Translate perfect Japanese from English does not make a perfect communication yet between real persons.  But, Karaoke? Karaoke. Kuh lah oh kay? Key raw o kee? Do I Karaoke? Hell No. I was always Karaoke hater. I thought Karaoke is such a pathetic Japo-thing.  But talking about communication.  I found out Karaoke is the thing, universally effective to get together, to be happy to all kind.  I had a great Karaoke time at Festa in the west building at Japan Town. It's a small but nice, modern, cozy and cool place for Karaoke &amp; drinks. There are really cool &amp; nice bartenders.  I think there were 5 different group of people but it was like a talent show. I liked that no one was pushing me to sing on the stage! That was great. If you don't want to, it's OK. You can have fun too like I did.  I still think the guy sang Xanadoo and the theme song for Hanshin Tigers were BLAST! Can you imagine that all of us were singing so loud Xanadu?  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D7m1UWSD-FaA%26feature%3Drelated&amp;s=3f5c70befdaec1483f49642c668e8ff696db9bcc2d3cf315fce651e6904182b9\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=7m1U…</a>  Oh FXXX Yeah, we were so gay and I loved it!  But the greatest singers were following: Berna Diva Gracy Pho Kay Jay. she isn't Korean Japanese.  No one can beat them. No one. So as Ed M. It was his birth day party but we forgot all about it but just singing. Happy Birth day Ed!", 
    "review_date": "2008-04-11"
  }, 
  "Qy-xv4IrZHzdnxoGnyxovQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Mina S.", 
    "review_text": "So fabulously giddy that they have S-Club 7's \"Never Had A Dream Come True.\" You simply cannot deny the strange sense of liberation, of empowerment, that getting up on a mini stage and singing in front of total strangers gives! All of a sudden you find yourself grasping onto the mic just a little bit more, that sort of thing. Karaoke is to have fun and Festa, without a doubt, provides a fun atmosphere where patrons can sing the blues, wail about love, and anything else their little hearts desire. When there are more than 2 singers on stage, they ever so graciously provide another mic. Nice touch, as not everyone wants to be just another back up singer. Ahhh, minor detail: Requested water, and was brought a bottle of it. Hmmm. Like I said, minor detail. Belt it out, honey.", 
    "review_date": "2009-06-03"
  }, 
  "-TV1mL9W8CFxzpFLKtwL_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Felix T.", 
    "review_text": "Festa lounge staff are very friendly. Great drinks. Great decor. Awesome place to have fun with a group and karaoke!!", 
    "review_date": "2013-12-18"
  }, 
  "DiAUiaoDKFlifJK0FCkEWg": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "danny e.", 
    "review_text": "I would like to being with... The owner? The fancy lady who is also in this pictures... she does look mighty fancy, and that fancy factor alone gave you a star, so it saved you from a two star rating.   So lets begin...   1. You are a small little venue that makes it hard to believe that my imaginary manager would book a venue that small to rock out in.   2. I guess your drinks are a bit pricey. I spent $22.00 on two drinks, and decided that: -a. I will not be drunk enough to rock, out especially in a venue so small that it wouldn't be able to contain all the glory that is... DANTASTICO!  -b. I had already had 2 liters of beer for free so I wasn't jones'n for more alcohol.   3. What the hell city scape in the background of the stage is that supposed to be? Toronto?   4. I will admit, it is one of the more... fancy karaoke bars I have been to, especially in San FranDisco.   5. The patrons there are magical. Everyone clapped for everyone, everyone was a back up singer for everyone, even if they didn't know the words to the songs... ITS KARAOKE there are words on the t.v screens so everyone was able to do back up vocals.   6. You have a good list of song options, BUT not a great list of song options... yeah I said it.   7.You turned me down! YOU TURNED ME DOWN WHEN I WAS GOING TO SING BOHEMIAN RHAPSODY!.... Whats wrong with yoooou!? Don't you know who I'm not!  all in all, it was quite an enjoyable night.", 
    "review_date": "2008-07-26"
  }, 
  "f6jNWRAxqR0UmAR2jvtNFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nel S.", 
    "review_text": "What fun!  This attractive little hideaway in SF's Japantown is a jewel.  Knowledgeable bartenders create your drink of choice and go ahead - take a stab at karaoke! The lists of songs are huge and you are sure to find one you like. Great place to meet friends and have a lively evening. You'll love it.", 
    "review_date": "2013-12-04"
  }, 
  "Z9bOjahuxvMju3mO3ac9_g": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Simon C.", 
    "review_text": "ahaha i ALWAYS have fun here!! there are definitely regulars that i always see no matter what day i go, but everyones nice, and its fun to sing in front of people  they've got a full bar, and cool people working there  def helps if u speak japanese (i don't).  the crowd is a mix of young asians in a group to old white guys there by themselves. whatever, everyone's there to have fun, and everyone does.  $2 per song, so make sure u make it count", 
    "review_date": "2010-04-02"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Been here about a million times but had a HELLA bad experience tonight.  The girl working here tonight pissed me off. I walked in late on a Sunday night - place was very quiet and there was hardly a queue for songs.  My family was visiting from Puerto Rico and had never heard me sing, and had never seen karaoke. I said - is it OK for me to sing one song. This young girl working there (Caucasian) had such an attitude. She was drinking a beer, and made me buy an $8 water. After the transaction, she lectured me on how everyone has to order a drink. It was so awkward. I told her I had been there a thousand times and would be happy to pay extra to just sing - that we were full and weren't going to stay long. t could understand if the place wasn't empty, or if I hadn't already paid for the overpriced Voss water. More than the policy, she just gave me the heebie jeebies.  I'd like to emphasize that my issue was more with the *ATTITUDE* than the POLICY.", 
    "review_date": "2014-06-15"
  }, 
  "O1yqX-Blt6ntmsndo2wT7w": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Rebecca L.", 
    "review_text": "So much fun!  This is a perfectly-designed Karaoke lounge.  The atmosphere is friendly and the stage is optimally set up for full enjoyment of performances.  (That said, poor performances and song choices are somewhat of an issue, but I can't deduct stars for the clientele...)  I would come back every week just to sing my guts out and watch others do the same!", 
    "review_date": "2012-09-16"
  }, 
  "rS4OEY7fWDZG_JuJjR9HWg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle L.", 
    "review_text": "I went here with a friend one Tuesday evening and we had a really great time singing. The joint is small and intimate, so it feels like you're singing to a contingent of friends. Beware if you show up on a Saturday night it's worse than going to the DMV... there's a crowd spilling out the door.  I found the cheese plate to be a waste of money. If you typically have cheese plates at restaurants, you'll be sorely disappointed with what Festa is offering... a couple of blah American cheeses and some soda crackers? Hmpf.  Since I haven't lived here for very long, I've not had a chance to visit many karaoke bars in the city. However, I find it mildly offensive that they charge $2 per song to sing. When I'm racking up a hefty tab from drinking their $10 cocktails all night, I expect the karaoke to be gratis. But maybe that's a San Francisco thing. The staff is friendly and the crowd is fun, but I won't be returning.", 
    "review_date": "2013-01-24"
  }, 
  "KltM7KJixE6NksDGXaRZWg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelo B.", 
    "review_text": "Are you the type of person who has no shame? Do you sing in the shower? Do you think you can carry a tune even if your friends say you can't? If you answered yes to all of the above, then you are just what Festa is looking for on a nightly basis. Located in the heart of Japan Town, this karaoke bar is just what you need to prove your friends wrong. Rock the mic without shame and I assure you, the crowd will be behind you 100 percent!   I'm more accustomed to private room style karaoke where the only people who can witness your shamelessness are the people in your group (usually your \"so-called\" friends). This type of karaoke should be more intimidating but once you realize that the people that go up on stage ahead of you don't have any qualms about looking like complete idiots, your confidence will take a significant spike.   It's funny how cheesy 80's and 90's songs bring everyone together. At one point, I got up there and rocked \"Semi Charmed Kind Of Life\" with some drunk sot who was up there butchering the song. Everyone in there, regardless of which group they belong to, always cheers you on and sings along no matter how off key you are. I guess that's why it's always a good idea to pair karaoke with alcohol. Can you imagine how we must sound without it?  Good times!  4.4 stars", 
    "review_date": "2009-07-09"
  }, 
  "UvrisvZ9TIpBJ7s7l3NsXg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "I have to agree with Megan C.  The scene is really cool in appearance here... but don't be fooled!  First, the cokes were $5.  Seriously.  The guy told me, \"it's on the menu,\" but it wasn't.  Then he said \"you should have asked what the price was before ordering it... what did you expect it would cost?\"  This was not a supersize coke.  It was in a whiskey-type glass.    OK, whatever.  The KJ was totally discriminatory towards our table.  Some people, even those who came after us, sang four songs to our one.    I really like the scene, but the super rude staff and ridiculous mark-ups on drinks will keep me away... there are much better places in the city!", 
    "review_date": "2009-11-29"
  }, 
  "duFP2mFpWc-qc21T5XKvNg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Badri N.", 
    "review_text": "I recently discovered Festa because my good friend and fellow Yelper Bobby L. just can't stop going here and introduced me to this little gem.  Located in Japantown in the Kinokuniya plaza, you'd not find this place easily if you didn't know what you were looking for!!  We usually come here weeknights so parking is usually never a problem :)  The place is small!  Really small!!!  Like, maybe, 50 people max and it will be really crowded with that many.  I'd put the comfortable capacity at about 30 people.  Which is perfect for most of us aspiring singers - get on stage without the stage fright of having to sing before an audience of 100 plus people :D  Fortified of course, by the awesome drinks from the bar :)  Songs are a very reasonable $2 each - for this, you get the privilege of getting on stage and belting out your favorite number to your heart's content!  I love the staff as well as the people who frequent this place.  You can tell several are repeat and regular customers which always speaks well of a place in my opinion.  I've been here twice and I know I will be back here many many more times.  It's a fun place filled with friendly people and people having a good time.  You can't go wrong with that recipe :)  ~ 4 stars overall - there's no doubt in my mind I'll be back here.  Soon.  # 233", 
    "review_date": "2011-03-13"
  }, 
  "MrNmuLOMTPbhAJgA2xo4fQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A H.", 
    "review_text": "If you are ever looking to hang with Japanese businessmen, this is the place to be. During my time in Japan, I learned that Karaoke, and drinking (particularly whiskey) were key components of the post-work routine for Japanese professionals. It's not wonder that you can often find Japanese tourists/businessmen hanging around here in Festa, drinking sake, and belting out american and japanese ballads.  The drinks here are excellent. While on the girly side, the Peach Bellini and the Sparkling Sake were great. Of course, I didn't order either--I wrapped my manly paws around chivas in a whiskey tumbler. But perhaps my companion ordered some and was overly gracious in her sharing.", 
    "review_date": "2009-09-27"
  }, 
  "rP1JhMcc7sZTzW3KzLpL9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jade T.", 
    "review_text": "LOVED IT!!!  A friend of mine had a birthday party here and it was such a fun experience! The place itself is pretty small.. you go in, there's a bathroom in the hallway (which was spacious and clean!), then the room opens up with the bar on the right and the tables and stage. That's it. But it is the fact that it's small that makes it even better! You get a really warm feeling, everyone is friendly to each other and the popular songs get sung by the the whole crowd.   $2 a song, with a really good selection (it's guaranteed that everyone will find something they'll want to sing) and still the feeling of being a star when you get on the stage. The wait for the songs isn't bad either, and the waiting list is displayed at the end of every song so people can get ready. Overall, a really fun place with reasonable prices and good service. I had one drink and it was strong, and I'm sure every one else's were too. My only thing was that one of the two microphones wasn't working as well as the other one, and being a Singstar on Singstar.. I've grown to be a little picky about sound.   Despite that, I can't wait to come back and fill the place up with my singing friends!!!!!!!!!!!", 
    "review_date": "2009-01-20"
  }, 
  "k_7Ii_BNYDocMr3bUeJgFw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T.J. L.", 
    "review_text": "WOW, I really wish Yelp had a negative star feature.   The Staff and Owner are RACISTS and LGBT crowd haters, while also being out right thieves.   FESTA is a small, odd &amp; yet interestingly conceptual place.   WHEN you can get the staff to bother paying attention to you and get your drink order which they are supposed to do, they take their time like we are serving them...They need to remember the customer is the person being served (not them), wait staff is supposed to serve their customers in a polite, warm and inviting way so customers will return, insuring wait staff income to live.   A date introduced this place to me in November of 2008. They were rude from the first second we walked in....it took forever to get a drink and them they were wrong every time we order another round.   Paying eight bucks a glass for a wine that I would not serve mass murders is a crime. Ever changing pricing is illegal and a crime here.   The wait staff was suspicious of my date and I at first, but they were making too much fun and saying disgustingly ignorant remarks about a table of women that they concluded were lesbians. When they when they realized we were gay became out right offensive. They talked about us, not realizing that between the two of us we understood fag comments in the several languages they tried to hide their barbaric attitudes.   All night long PEOPLE complained about not getting to sing their songs. That is because we found out later after some people left not getting their requests is because if you are not a friend of the owners then you are screwed. They charge $2.00 for the song request, then keep the money after not playing them and they use the money to buy drinks later. If they were an intelligent customer serve oriented business they could just keep a simple list in order to request songs and avoid the whole thing, but no they deliberately piss off paying customers.   If your WHITE in this bar, forget it, the owner and staff are going to make you pay for whatever transgression every white person has ever done to anyone in the history of the planet. And God forbid you are Asian, but not Japanese, you are even more screwed.   I think everyone on Yelp should call the Mayor's Office, Police Dept and the Human Rights Commission and complain about illegal business practice, racism and hate crimes toward the LGBT community. Then we could form a class action suit and sue their asses out of business.   And for the Japan Town business community, I feel sorry because this place does not reflect the good people that run professional businesses in anyway....it just hurts that community.   They should change the name to FESTER, because that is what it does and one day someone will lance the boil of that Festering place supposed there to serve people.", 
    "review_date": "2010-01-13"
  }, 
  "FdbS53mLhoLazosBDURrzA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "John C.", 
    "review_text": "Festa's is my favorite place to sing karaoke in San Francisco. Good atmosphere with a good sound system for singing, very friendly people and wait staff, and good drinks. A nice size place for karaoke also. Everyone has a god time here. A friend took me here years ago, and I still come to Festa's when I am in San Francisco.", 
    "review_date": "2013-12-31"
  }, 
  "UVxY0iyPaqY7s4BSFtt-xA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wanugee N.", 
    "review_text": "Small, intimate Karaoke Bar upstairs in the Japan Center in the Kinokuniya building near the internal bridge overpass.   Japanese owned. The older couple sitting at the end of the bar helps with the welcome feel, with the classy lady smiling you in, and the gentleman sitting next to her at the end of the bar, getting up and singing old favorites in the slow moments. The tall, thin, younger male and female bartenders are Japanese, too.   Huge songbook with many current releases in large binders. Lotsa J-Pop, but tons of American favorites, too, in any genre.   One small stage with a small LCD monitor for the singers. A handful of tables and a small bar.   Most Americans call this activity like they're lifting and hauling a redneck, or \"Carry Okie\".     The Japanese pronunciation is like them telling you the vehicle they drive is in good condition, or \"Car, uh, Okay!\"  This place is packed on the weekends, so try coming on a school night for more singing opportunities. No private rooms.", 
    "review_date": "2011-07-29"
  }, 
  "YbZg36FoMgkKcTEPae5siA": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Amy J.", 
    "review_text": "This place is tiny so don't plan on bringing a whole army of friends here. I'm glad we didn't have a huge group with us or it would've been tough to get our songs played. They charge $2 a song and they don't announce your name so you really have to pay attention if you want to sing. The song selection is pretty good. They even have songs in Japanese if that's your thing. I witnessed several people singing songs in Japanese here - bartender included.  There's a one drink minimum so be ready to shell out at least $9 for a cocktail. The bartenders are pretty good here. We didn't wait very long to be served and they seemed happy to take our orders.  We must've went on a pretty good night because it wasn't overly crowded until later and most of us got our songs played rather quickly.   I didn't realize they had a bathroom here until the night was almost over. Instead, I ran downstairs into the Japan Center mall.  I'd probably go back but I don't know how many songs I'd sing since they'd already be getting my money for a drink and at least one song.", 
    "review_date": "2013-09-07"
  }, 
  "QF9vzRcKOUn32wgnTcTG9Q": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Eric P.", 
    "review_text": "The five star rating still stands.  No question.    That said, I am dismayed by the ingratitude and cheapness regularly demonstrated by a lot of the hipster patrons who would drunkenly dispute a tab they festively racked up buying rounds of shots for their friends, and after having their itemized bill thoroughly run down for them, still leave a 5 percent tip for the bartenders who have to put up with a lot of pushy customers who bitch about their songs not being played two minutes after they put in their request.  I've taken for granted the fun derived from people watching.  The bartenders make the bar.  Not the hoards of tools singing their crap cornier than my leavings after eating a Chipotle burrito.", 
    "review_date": "2011-06-25"
  }, 
  "AAI8mmWem4zQU7qanPrOmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nance W.", 
    "review_text": "I have a confession to make! Promise not to tell anyone?  Okay... I have a fetish for people speaking the Japanese language... Is that weird? So if you ever see me; please don't (and by that, I mean please do) bust out with the Japanese... You'll make me weak in the knees and have butterflies in my stomach.  So I wrote my chinese name on a piece of paper and challenged Koji (bartender) to read it. He had me clapping like the happiest sea lion in the world!  This place is small, but cozy. I don't think they even have their own restroom, you'll have to use one somewhere in the plaza.  But don't worry, you won't drink to the point where you'll throw up; because it would be such a waste to throw up 9-12 dollar delicious, well-made cocktail drinks!  I remember long ago when I made a promise to myself that I'd never sing at a karaoke bar...   I broke that promise.                 I got up and sang my two-dollar song, \"More Than Words\" by Extreme.  Thank God I had the balls and liquor courage to do that... Because I ain't doing that again!!!  Now what the hell did he put in my drink to get me to do that???", 
    "review_date": "2007-09-17"
  }, 
  "s93PtWbODlx8h5IK86CVSA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Saori E.", 
    "review_text": "I feel very bad for T.J. down below who had a really bad experience here, because when I've gone, I've felt like Festa has a really positive, welcoming atmosphere.  Nice hostesses and bartenders, and I just like the idea of being able to pay per song and just hang out for a few hours without having to pay a \"per hour\" fee like private karaoke rooms.   Pretty good drinks too. My favorite so far has been the lychee cocktail. The Blue Tokyo is a little too strong for me, and the saketini is.. interesting. If you like sake, you'll probably like it.   There is a wide range of singers/people that come here. You don't have to be the \"karaoke-type\" to enjoy it. You seem to get them all here-- Japanophiles singing in Japanese, Asian people, non-Asian people, good singers, amazing singers, not so good singers, older Korean lady belting out cheesy Korean songs. Good oldies seem to dominate the list of requested songs.    The downside:  Here are some reasons why I knocked off 2 stars. - The price of the drinks. I know a cocktail for $9-10 isn't ridiculous, but... it gets old after a couple of drinks, and I wish they had more of a variety on their menu. They basically have expensive cocktails, cheaper beer ($5-10), and very expensive wine.   - the selection of the songs. Ya, they have Japanese and Korean songs, and a great selection of older songs, but their newest page (as of March) was songs from January 2010, and even then, they didn't have any Gaga! This complaint is really only half-serious, but how could you not have any Gaga? Even just a few from her first album?? Maybe they don't wanna hear it every night.   - the wait-time for your requested songs. Our group waited about 30 minutes for one song, and about an hour for our second song, even though we requested them within one minute of each other. You definitely have to come in, sit down, request a song first, and then buy drinks, enjoy yourselves, etc. If you hold off too long to request a song, your wait time will just get longer and longer. Definitely a different kind of karaoke experience for me, because I'm used to private rooms. Just keep in mind that you can't just decide at the last minute you wanna sing something--", 
    "review_date": "2010-03-14"
  }, 
  "YMxJL6OrtPT8SeZfBaFH5w": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Adrian D.", 
    "review_text": "Came here w/ the sis as we were waiting for our table at Mum's.  We were actually pleasantly surprised as to how the place looked.  We chatted to our polite bartender about how the place is.  She said that it got pretty full on the weekends.  My sister asked her to make a drink and it came out wrong.  We asked her if she could fix it and gladly did w/ much apology.  We also had a lychee martini which was very tasty.  The karaoke book they had had everything under the sun from pop songs, love songs, songs in Chinese and Filipino!", 
    "review_date": "2008-02-22"
  }, 
  "fQuLe-KuojSco4DRbcFpGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa D.", 
    "review_text": "this place marks the very first time i sang karaoke in public. i don't care what other people say: i have star quality, dammit!  i call my singing style \"eccletic experimental yodel folk\". have you ever sang fleetwood mac's dreams in the voice of jennifer tilly and the timing of both tricky and prince circa 1995? didn't think so. cuz then you'd be biting my steez.  serenading my pitbull with my own rough rendition of george clinton's atomic dog while she stares at me with her ears bent back just doesn't count. NOBODY PUTS BABY IN THE CORNER!  so for all you jennifer greys out there with the fat luther vandross stuck inside of you, go to festa for your first stab at this obnoxious pasttime! the crowd is tolerant (and small), there's no interior visibility from the outside (so you can save face), they have a decent soju/sake selection, and the service is friendly.  oh, and it's LEGAL! it's a perfect stepping stone towards ultimate voluntary public humiliation, which is auditioning for american idol and not being picked, a la william hung.  go!", 
    "review_date": "2009-02-06"
  }, 
  "TNWQuWa3kLH2Llx10LW1Yw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sally T.", 
    "review_text": "the bartenders are always cute and polite. the videos need an upgrade into this century. the drinks are pricey for a place that's essentially inside a strip mall. thanks, that is all.", 
    "review_date": "2011-10-17"
  }, 
  "h8pthOnqCxV94D8-JkZXCQ": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Cecilia S.", 
    "review_text": "I have never karaoked like this before!  A stage?!  Singing in front of total strangers?!  What happened to the little private rooms with the disco ball and plasma TV with strange Asian music videos????    Needless to say, I was a little intimidated.  I was there with the veterans!    First of all, you have these 4 huge song books.. alphabetized by song title, artist, or language.  You pick a song, write it down on a piece of paper (I think it's $2 a song?), and wait for your turn.  It was sooooo nerve-wracking!  I was scared I was going to crack.. or worse.. what if I get boo'ed off?!    But I had such a blast!  The first time is always the scariest, but everyone was there cheering everyone else on.  Plus, it's not a very place.  There's a full bar, maybe 5 tables with booth seating, the small stage, and a bathroom. You'll probably never see these people again, so it's ok to embarrass yourself.  AND, they were all pretty drunk, so everyone's just having a grand ol' time :)  I love it.  I don't think I'm ever going back to traditional karaoke :)", 
    "review_date": "2012-03-14"
  }, 
  "fHS0bQ-l5rHME_xXKQSYXQ": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Kevin N.", 
    "review_text": "If you figure one universal karaoke truism is that you don't always win at karaoke 'cause you can best belt out your favorites -- you win at karaoke on style points -- Festa might well prove the most apt metaphor for karaoke going. Tucked in the side pocket of a shopping mall in Japantown, I happened in here on the tip of some folks in the know for an evening of revelry and off-kilter crooning.   The best part about Festa has to be that they don't announce your track - essentially, you have to pay attention -- and even then -- once your song starts, you have to haul ass to get up there in time for the beginning (or chorus, or coda, or whatever's left) of your song. This results in more than the requisite helping of hilarity, and at some point in the night a pack of my group camped out on stage for what no doubt seemed like four and a half years. Shorter to run, I gather. I love the cityscape backdrop, a tiny homage to the city surrounding (and cities everywhere, I gather). And like most knock offs in this place, packed with personality.", 
    "review_date": "2011-07-03"
  }, 
  "myC_mD2WIkvpcJb1wFnV1g": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "megan n.", 
    "review_text": "Went here last minute for a quick drink around 1am right before last call on a Monday night. The place is small but very well decorated with a decent karaoke stage in the corner of the room. Drinks were strong (too strong for my gin and tonic. It tasted like straight gin but some may like that! ) and a little on the higher end price-wise (16 for the gin and tonic and a bud light in a bottle).   The bartender was a bit rude, forgot our beer and acted put off that I reminded her about it. We only ended up staying a few minutes before she came to our table and told us that they would be closing early due to lack of customers (there were at least 11 other people in the place, which was a decent amount considering the size). We weren't even halfway done with our drinks before they were kicking us out, which was a huge turnoff. I've never been booted out of a bar before (well, only when I've been a bit naughty) and it made us uncomfortable, so we left without even finishing our drinks. Wish we had made it a block further and headed to the Boom Boom Room instead. We won't be returning.", 
    "review_date": "2011-01-07"
  }, 
  "KeCR-77rIw-rWUAYa7O3Bw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James B.", 
    "review_text": "This place is a terrible rip-off. A one (very overpriced) drink minimum AND karaoke charged by the song? Come on guys, choose one or the other.  So my group comes in, gives them money for a few songs, and sits down. So they charge per song and don't even have a DJ to call names? You have to pay attention to the screen or you might miss your song. Whatever.  Usually when there's a minimum someone comes up to you and asks for your order right away, but we weren't approached for about 30 minutes. When they did, they asked if we ordered a drink and that they found a whiskey bottle near our table. They falsely accused us of sneaking it in, and told us that if we didn't order drinks that we'd have to leave - never mind the fact that we already put in money for karaoke and were still waiting for one more song. Thankfully the song came up, I belted the tune, and we promptly left.  Rude staff, rude owner, overpriced drinks, karaoke charged by the song. I am never coming back.", 
    "review_date": "2013-01-13"
  }, 
  "-jvNk13xR2-M2kV3Ylyxbw": {
    "user_rating": 1.0, 
    "user_location": "Buffalo, NY", 
    "user_name": "Xavier G.", 
    "review_text": "I didn't really like coming here with my friends and I. They charge 2 dollars per song, which is pretty pricey. And I put in a song, and other people sang two or three times before I could. I asked them what happened, and they couldn't find the song, and then they found it and said I was next, but then 3 other people sang instead, then I asked again, and they said I was next, but then another person sang again, until I was next.  When I asked them about it they said they organized the song order by table. But I don't know how that explains how I waited an hour and a half to sing a song, and other people sang 2 or 3 times. They didn't seem to care though, so I would rather like to just never come here again.  One last thing I'd like to mention, me and my friends ordered tea here, which cost $5 each. Sounds really expensive for tea, yeah, but I've spent that much at tea lounges before, and it's usually worth it, but they gave us the cheapest brand of tea you can get for $1 a box in chinatown. It was a complete and utter rip-off.", 
    "review_date": "2010-07-20"
  }, 
  "u_S974PQHPNoGkdst27F6w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "neko c.", 
    "review_text": "I went back to festa lounge again. Every time I go there I have such a great time. I don't sing!! but still great place to hang out friends. I love people who works there. I love there even you are alone, you can enjoy a cocktail.", 
    "review_date": "2009-10-30"
  }, 
  "f874Y8CQ59wKrzornHlFlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn H.", 
    "review_text": "Hot damn they charge $9 bucks for drinks, $4 for a cup of green tea, and $2 bucks for each song!  Ridiculous.  Also embarrassing is the size of Festa, maybe 400 square feet, you can see everything, and everyone from anywhere in the bar.    Price gouging and claustrophobia aside, I like this place.  It's clean, efficient, and perfect for jeering or cheering your friends on.  Not to mention there's a fun cardboard skyline backdrop on stage, backlit with Christmas lights, and part of the ceiling twinkles with fake stars.  It makes all those sappy love ballads, and slow jams all the more authentic.    Get in early.  I went from 8 pm and stayed till 2 am, and discovered it gets packed at  around 10:30 pm, and a second wave settles in at around 12:30 am.    Overall, a nice establishment I could take my mother to.    Note: the volume doesn't get adjusted.  Bring ear plugs, and fist wads of cash or plastic.  Some songs are in Japanese or Chinese (not sure), and the crowd is well-mannered clean, and wholesome.  For a dirtier night out- with cheaper drinkers, and cheaper people- I'm a fan of Encore on California St.", 
    "review_date": "2008-07-26"
  }, 
  "Ct456aEICzDfn03MHZCzsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miriam b.", 
    "review_text": "Hey, sorry haven't been in the warbling mood for a while and since my singling tomodachi requested karaoke in J-town, thought this space would work and WOW...Sachi is now called FESTA...getcho FESTA on for a biggu biggu checkkkuuu. But it was FUN for once in a blue moon entertainment value. (But in reading the other guys reviews, beware of those screaming, obnoxiolla, amoebas crawling and drawling their bad juju into noFESTA,justaPesta.)", 
    "review_date": "2007-08-05"
  }, 
  "MDQHCmuIB6WF01aqExEfXw": {
    "user_rating": 4.0, 
    "user_location": "Campbell, CA", 
    "user_name": "David P.", 
    "review_text": "Karaoke brings out the inner rockstar supernova in all of us. A small group of friends and I dominated here last weekend for a birthday party. When I say dominated, the place is small and it is very easy to cruise in, feel comfy and get the party started. The atmosphere is intimate and  non-intimidating, which promotes everyone to sing, even those that should keep their lyrical talents private can be found screaming their asses of. It's a good mix of people, only problem is pricey drinks and $2.00 songs and ultra long waits. So if you plan on putting on a performance, better get a few songs lined up at once. All in all, fun experience, did someone say mic check 1...2...?", 
    "review_date": "2009-02-20"
  }, 
  "IpXqOHIFUZN6YD9KhVIIJw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina R.", 
    "review_text": "This is the best place for Karaoke in the city. Good stage and good crowd. They have a good selection of song. The bartenders are pretty nice. Pretty small place*********** Place is well decorated and better ambience. Karaoke bar and the staff are friendly.", 
    "review_date": "2013-11-30"
  }, 
  "LFha-r2VljAzN13YwySTXw": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Tisha G.", 
    "review_text": "I remember stepping onto the stage,  my song of choice playing in the background while lyrics hit the screen... all the while with an obnoxiously mischievous look on my face.  FESTA IS AWESOME. It's my favorite place to go for karaoke, hands down! Great staff, great venue, all kinds of alcoholic brands to choose from including sake and soju and FUN!  I can't wait to go back again...", 
    "review_date": "2011-10-03"
  }, 
  "XNAgIeA4UNqcMOcLA70qDg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan C.", 
    "review_text": "I am a fan of karaoke bars and will saunter up to the microphone in a dive bar or a classy joint.  I was excited when I walked into Festa to see such a nice atmosphere and hear an older gentleman singing some Sinatra. I thought then that I was in for a good night, but boy was I wrong.  I don't even know where to begin.  I went on a Friday not expecting to get a million songs in, but hoping for at least 1 or 2.  I understand how the queuing process generally works at karaoke bars, so I had no problem putting in a couple song requests, having a couple drinks, taking in the other performances, and waiting. The cost per song here is $2, which is fine by me if that means less people will be inundating the KJ with drunken song requests.    I watched as the same people came up to the stage over and over, as many as 4 times, before anyone in my party even got a single song in.  It was not a question of the other people getting to the bar before us- I saw them come in at least 20 minutes after I arrived at Festa.  As the night passed, I realized that some of the repeat singers were friends of the owner.  They were seated at a table that we were told was reserved for a large party.  When the party came in, I was asked to move from my non-reserved table to make up for the space that the friends were taking at the table that had been reserved.  If the table moving experience wasn't enough of an annoyance, my song NEVER came up.  After 90 minutes had passed, I inquired about my song and saw it about 3 songs back in the queue atop a large stack of my groups requests (some of which had been paid for in cash in advance at the bar).  30 minutes later my song still didn't come up.  When I asked about it this time, hoping for a real explanation, the KJ said that it was the way the line worked and assured me it was all fair, and that my song was still 5 songs away.  So after 2 hours of patiently waiting, cheering on other singers, and buying drinks, I told the KJ to remove all my songs requests.  When I went to close out my tab, I was charged an 18% automatic gratuity for being a part of a group of 6 or more people.  Granted, there were 6 of us, but we were never served as a group, and none of the others were charged this gratuity.  It seemed to have been made up on the spot.  And after 2 hours of being ignored, I was in no mood to leave a tip at all, none the less an 18% tip.  The entire night my group got 3 songs in TOTAL while EACH REGULAR got AT LEAST 2 songs in, and as many as 4.  It really is a shame, I was ready to give up on other karaoke spots in favor of the warm ambiance of Festa.  But after being treated as I was, I can't say that I will ever go back.    Only go here if you are a friend of the owner.  Don't go in groups of 6, don't make friends with another table so they think you are a group of 6.  But better still, just go somewhere else where you won't be treated like shit.", 
    "review_date": "2009-08-03"
  }, 
  "DhSbHfqhjoFZ-nmsgwZXBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bibi B.", 
    "review_text": "I came here on Saturday night around 8 pm and the place was  packed. Luckily our friends had gotten tables for us, so we don't have to wait long for. table. i ordered peach Bellini and it was ok. A little bit sweet to my liking and a little to pricey. The crowd was great, and some people really have good voice. it was entertaining.  The spund system was good, song options were many and up to date. $2/song was ok, although you can wait for some time for your song to show up. i had a good time and would come back.", 
    "review_date": "2014-03-31"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "This place is in the mall so people that come here purposely do.  It's a tacky karaoke stage and the bar itself is really small.  I can tell the service is good - they keep it clean by clearing alcohol glasses and wiping down the tables.  I probably would not come back unless the whole place was rented out with my friends, which means a private karaoke room would be more efficient.", 
    "review_date": "2013-08-09"
  }, 
  "09T1oyi6c-9lvyt7gQCD2w": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Peter L.", 
    "review_text": "There are no separate private rooms here but you'll still like it. Not the typical karaoke joint that have rooms for rental and you pay by the hour - the typical karaoke experience. Here, it's all about the on-stage experience. Warbling and all this is the karaoke I go most often now.  Songs are $2 per, which is not cheap compared to other places. The drinks are not cheap either but also not super expensive. The money saved on not renting a room goes towards my drinks, yeah! Factor in the cost of renting a private room the bill for the night is actually cheaper.  And, like at any bar or club or lounge you should become a regular. Then, the bartenders will treat you better. I like the staff here, very friendly but not displaying favoritism like at other venues.  Note there are other karaoke joints in the Bay Area that has a stage for singing, some of them have rooms and some don't. I still prefer having both options so can pick and choose depending on the group. It's really a four star venue but the bartenders and owner earned the final star.  Bonus: <a href=\"/redir?url=http%3A%2F%2Fyoutube.com%2FTheKARAOKEChannel&amp;s=6b0c29bda9b2cb9a61ef84156608b90c48a47b0f6980302a9c7c603bb8b8e754\" rel=\"nofollow\" target=\"_blank\">youtube.com/TheKARAOKECh…</a> <a href=\"/redir?url=http%3A%2F%2Fyoutube.com%2Fsingkingkaraoke&amp;s=7d74d872b6c7415113fc3d5d5ae8dc896a5c3bb90b76bbae335b2bd199ecacf5\" rel=\"nofollow\" target=\"_blank\">youtube.com/singkingkara…</a>", 
    "review_date": "2014-11-11"
  }, 
  "VMkROPn0M45Ga7h4osJuqA": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Baldwin H.", 
    "review_text": "Small, intimate, public karaoke bar that delivers on big entertainment and guaranteed to make you feel like a rock star even though your caterwauling is making everyone's ears bleed.    By small and intimate, I mean just that.  The place is no bigger than a two car garage.  There are no booths, just you, the stage, and untapped glory.  You may be intimidated by singing in public, but you need not fear this place because no one here will judge you.  Everyone is supportive, they know the lyrics, and they'll sing along with you.  Afterward, when you're done making a mockery of yourself, the audience will clap and cheer you on.  There's no greater ego boost, deserved or not.  I, myself, am a terrible singer.  But the atmosphere, and camaraderie lead me to fearlessly sing My Girl with fearless abandon.  I surprised myself.  Sure, liquid courage helps somewhat, but the enthusiasm of this place is infectious.   That, combined with the clean, cushy interior sets this place apart from other whole in the wall places that make you afraid for your safety.", 
    "review_date": "2008-07-15"
  }, 
  "DCnWy4XBG6ZiEquVqoCLOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeannette G.", 
    "review_text": "I karaoke a lot, and Festa is my favorite place to karaoke in SF. It's the perfect mix of intimate space, public stage, and convenient bar at the ready--instead of having to smuggle alcohol into those little karaoke studios. Plus, Festa has the best song selection--other studios either don't have a lot of good songs or the musical accompaniment sounds like a 7-year old playing on their Casio keyboard for you. And let's not even talk about the weird videos other studios show while your song is playing.  I've witnessed others having a bad time at Festa, and it's usually because they're totally hammered or they expect Diva service. Public drinking and karaoke can get really messy, and I often sympathize with the staff at Festa because the crowd often gets unruly, especially towards the end of the night.  I highly recommend going to Festa early in the evening during the week. (The drinks are cheaper and songs are free before 9:30.) All of your requests will be played immediately and you get excellent service. Once the place gets packed around 9:30/10pm, all hell can break loose, and at that point you just need to go with the flow.", 
    "review_date": "2009-11-23"
  }, 
  "zKm4j3JJLgnqe1F3q_qZFg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Miranda S.", 
    "review_text": "I had very little expectations about coming here last night for my friend's birthday.  I am not a karaoke girl.. I sing in my car, I sing at concerts, heck I even sing in taxi cabs if I'm drunk enough!   But I'm not big on singing in front of crowds.  This place. Is. Awesome.  Great drinks--lychee martini, phone book sized song selection--in English and Japanese (if you're into Asian pop music).  Nice cozy environment and really really cool bartenders!  Thanks for cleaning up after us last night!", 
    "review_date": "2008-01-11"
  }, 
  "mowGolovKzs6HmiIjtL-gA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Margaret G.", 
    "review_text": "This is the best karaoke bar in the City.  Don't come.  : )", 
    "review_date": "2009-01-25"
  }, 
  "xr5DO7X4pz1IK-Et-M1rXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J V.", 
    "review_text": "I've spent two evenings at Festa.  Beautiful, intimate room, good cocktails and karaoke. Charging for each karaoke song on top of expensive drinks seems excessive, but I rolled with it.  I brought 30 friends there on my birthday, was happy to pay a serving fee for bringing my own birthday cake (to be expected in nice restaurants) I offered a piece to all the servers and was stunned when a bartender smiled at me later and pointed to my cake turned on it's side in a box on the floor next to the door.  Seriously,  WTF?!!!  Second visit I gave a credit card to run a tab.  Had 4 drinks and was presented with a bill for $70 with room to leave a tip.  When I asked for an itemized receipt, my drinks were not only overpriced, but an 18% service charge was added without explanation. I ordered these at the bar, not even table service.  I was then asked \"wasn't I with a group of 6 or more?\"  I've worked in restaurants and this is a dirty and greedy trick.  If I ever go back, I'll bring a flask.", 
    "review_date": "2012-10-16"
  }, 
  "AzN4B04BxO5bV1lvSou8Qg": {
    "user_rating": 3.0, 
    "user_location": "Valley Center, CA", 
    "user_name": "Bernadette M.", 
    "review_text": "$2.00 per kareoke song.....  Like other reviews, I\"m not sure how I feel about paying to sing kareoke.  I'm already there buying drinks.  I guess I\"m spoiled by the other kareoke bars  I\"ve been to where you don't pay to sing.  But the two bartenders were really nice and even chatted with us a bit at the bar.  No drink specials when we were there Sat night, at least none that I saw or heard of.  This place is located in the Kinokuniya plaza.  We stayed at the kabuki next door, but if you need parking there's a lot in this plaza down below.  You can easily miss it if you're not looking out for it.   It's a really small spot with no actual stage.   You could basically sing a song from your table. There's some chairs and tables and maybe 8 stools at the bar.   I guess this would be great if the whole room is you and your friends, otherwise get ready to share Festa with say 20 of your closest strangers.", 
    "review_date": "2011-03-28"
  }, 
  "1f33vJNISFbw0GaMYpEncw": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Amy D.", 
    "review_text": "I crashed a birthday party at Festa after a Yelp Elite event on a Wednesday night.   Funny story: There's only one bathroom here. I was waiting for it, when the birthday boy sat down to wait, too. Knowing that he was the birthday boy, I introduced myself and said he could go first unless he was going to pee all over the seat. He said he could hold it, and shoved me toward the bathroom. When I came out, he was on the stage singing \"Poison\" by Bell Biv DeVoe with his friend.   (which is a great transition to my next thought)  My thoughts on public karaoke in the words of Bell Biv DeVoe:   If I were you I'd take precautionnnn...  before doing karaoke with Yelpers, because the odds are, one of them has it recorded on their camera.   And if you slight one of them, ooooh, that might surface on the Internet.   But then again, my threshold for public humiliation might be really low, so what do I know?", 
    "review_date": "2011-06-26"
  }, 
  "aqWXHhcR_CdmKmxggFOlEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy L.", 
    "review_text": "I am not a big karaoke person but as far as karaoke places go, Festa is pretty cool.  The fake scenic background is perfect for photo opportunities, and the mini-stage is also great for you and your back-up singers.  There is a pretty good selection of songs, though they were missing one of my friend's favorite karaoke songs - Bye Bye Bye by N Sync.  The drinks are a bit pricey - $9 for specialty drinks like their martinis - but tasty (I had the lychee martini).  The place is pretty small so if you're going with a large group (like I did), you should call ahead so space is reserved because the place was packed when we were there.", 
    "review_date": "2007-12-03"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "Quite possibly the best karaoke spot in the entire Bay Area...   Nestled in a Japantown shopping center, this is an itty bitty bar. You could easily walk by and miss it altogether, especially since it doesn't get bumpin' until way after all of the surrounding stores are closed. If you walk in and see an unidentified skyline on the small stage, you know you've come to the right place.  What I like best about this particular karaoke joint is the fact that everyone pays $2 to sing and there's no cheeseball KJ there to sweet talk. Just write down your song selection, hand it to the bartender and they'll queue it up and add the monies to your overall tab. Brilliant! This way, it's all fair and square.  I've been here a handful of times and it's always a blast. Since the setting is so intimate, it's impossible not to get  caught up into whatever song the person on stage is singing. Definitely a great place to make new friends. Or run into existing ones, like I did the other night when I ran into Bobby L and a few other South Bay yelpers :) BTW, what were you guys doing so far from San Jose so late????", 
    "review_date": "2011-06-30"
  }, 
  "zORQY85qUfWiIEltLOxG1g": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jacquelynne S.", 
    "review_text": "Warning do not go here if you're feeling EMO.  You'll end up crying in your martini glass after hearing every breakup/emo songs in the book.  This may cause you to drink even more and then to eventually text your ex something along the lines of, \"why did we break up again?\"  \"Because you cheated on me bitch!\" kidding.  The lichee martini is like no other.  At first I was a bit iffy about the place.  I mean it really is as small as my dining room and you have to PAY to sing karaoke.  Also the drinks are overpriced.  But man, they really know how to make good drinks.  After 4 glasses, you'll definitely have no shame singing along.  Another thing, you'll spend the whole time at Festa planning to download the songs you hear, but fail to do so when you go home because you'll totally forget what songs they were.  Damn Sake Martini!  I enjoyed my experience... +3.5 for the amazing lichee martini and for the mixed crowd.  Maybe because the place seems small and intimate or because everyone there was drunk...regardless, we all had no shame in making a fool of ourselves.", 
    "review_date": "2008-09-09"
  }, 
  "JFRdv_Q9-f8I7Q1pbnwVCg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah T.", 
    "review_text": "Sadly our experience tonight was disappointing. I have been here before a few times and loved the vibe, even celebrated my birthday here last year. Tonight I went with my boyfriend. We put in 6 songs around 8:30pm. By 10:15pm the KJ had played two of our songs and a million of everyone else's. I wouldn't have minded if it were crowded, but there were a total of 9 other people in the room, five of which sang multiple songs within that two hour stretch.  The bartender kindly refunded me the $8 for our songs because it's a work night and we had to go home. But I couldn't help but feel a bit put out. What's the deal? Is there something we should know in order to get our songs played or was this just a disorganized fluke?", 
    "review_date": "2015-01-29"
  }, 
  "x4hSo91JUPcp3w5wwEg5Ng": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ilona G.", 
    "review_text": "Here's what you get on a Fri/Sat night:  the place is packed, the cost for a song is $2, you hand your $10 bill to the karaoke attendant who asks you if you want change. Obviously you do. But not if you want your song to come up in the next 90 minutes. She/he takes your $8 tip and then calculates your spot in the sea of paid slips. $20 will get you pretty close to the front. We learned that $10 will get you slot #7.  When only half the words to our duet came on, we asked for a refund or a free song. They explained that it's \"the machine.\" No refund. Oh, you'd like another song? $2. Terrible. Go to Do Re Mil.", 
    "review_date": "2012-02-05"
  }, 
  "PSJ9LP_U3jF5K9avjvPPRw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rob L.", 
    "review_text": "This place is mainly great for karaoke &amp; drinks.  Located at the end of the bridge between the Japantown malls, Festa is a small lounge with one bar and one karaoke stage, where most people hop on stage immediately or after a few drinks.  Overall, this place is great fun if you're into drinks and karaoke at night. Beware it's fairly small, where no more than 50 people can fit into this place. It's great to rent out for the night if you plan a birthday party!", 
    "review_date": "2010-06-26"
  }, 
  "wrhOaPospStRs5q15ot4bA": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Joshua B.", 
    "review_text": "I will admit that before going here I'd only done karaoke once. I'm pretty sure I'm tone deaf, but the nice thing is at 1am after a bunch of drinking, it doesn't matter. Just sing with conviction and everyone will cheer you on.  I find the location (inside this odd indoor strip-mall thing) kind of weird, and the place is small and tacky - but maybe that's part of the charm?  Nothing else stands out about the place - so I'm only giving it 3 stars - but perfectly OK place to take a few friends out to get your karaoke kicks on.", 
    "review_date": "2013-09-12"
  }, 
  "m_H93eDKdiBlRv8K7Ffgsg": {
    "user_rating": 3.0, 
    "user_location": "Halifax, Canada", 
    "user_name": "Ben B.", 
    "review_text": "If after a big Italian meal and multiple bottles of Prosecco someone suggests it's time to pop your karaoke cherry, say 'yes'. If en route to a mysterious karaoke bar someone tells you it's in a Japanese strip mall, say 'bring it on'. If entering the mysterious karaoke bar it ends up looking like an airport watering hole in Tulsa mixed with a stage borrowed from bad nineties stand up, say 'hell yes'. If after a few songs you realize that you've unknowingly crashed somebody else's office party, say 'I can rock these bitches under the table.'  Pay particularly close attention to the completely unrelated b-roll footage that rolls behind the lyrics - it ranged from Demi Moore headshots during Total Eclipse of the Heart to water treatment plants during the Backstreet Boys. Or maybe it wasn't unrelated...  Staff were incredibly friendly which is great since the bartenders themselves are the ones managing the song order and making sure larger groups have enough microphones. That said, there were a couple of downsides in the overpriced drinks, the fact that performer names aren't announced so you need to bumrush the stage when you hear your song, multiple appearances of Baby Got Back, and the fact that you're pretty much guaranteed a hangover.", 
    "review_date": "2011-01-07"
  }, 
  "5PMiSCo8nXgf6VB1meCIGQ": {
    "user_rating": 4.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Alena W.", 
    "review_text": "Festa = Fun!!!  This little bar/lounge is located in the Japantown shopping mall.  The bartenders are super outgoing and fun and make you feel like they are your best friend by the end of the night.  Drinks were okay (lychee martini = yum, dirty martini = nasty).  It costs $2 to sing a song and, since there were only 10 people there, I sang 4 songs and my husband sang 2.  I definitely recommend this bar!", 
    "review_date": "2007-10-23"
  }, 
  "4GSnJSiWMWTpSAsLv3qR2g": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Jo C.", 
    "review_text": "This was the second time I've been to this \"establishment\". The first time me and my friends had a wonderful time. We were enjoying our drinks and performances. But last night... wow... me and my friends (the same ones from last time) decided to come here after a late dinner for some drinks and entertainment. Boy were we in for a treat! We came in it was pretty empty which we didnt think much of because it was a Wednesday night. This man (theres a picture of him in all black wearing a hat) came to seat us, we really didnt need his help being that only 2 tables were being occupied (we were waiting for the rest of our party, but we followed him to the table. He giggled and made our party show ID. So we were looking through the book of songs from \"Septemeber 2008\" and the waitress came over to take our drink orders. 2 people in our party didnt want to drink but she said \"there's a one drink minimum\" (which we didnt have before) so they ordered drinks and we moved on. So we waited a little while for our drinks, when they came the waitress spilled one of them on my friend. I had a mojito that was VERY watery and small for $9. Before we could finish our drinks she came to ask us about our bill. 2 people were together and the other 3 were with me. She came back with 3 checks, i had my card out already so i grabbed my two checks and handed it back to her... My other friend decided to keep her tab opened. So the waitress returned with my reciept I signed it. Left no tip becuz I was planning on leaving cash after I was done drinking. The waitress took the check. After the males in our group stepped out for a smoke, the giggling man came to our table and told me \"Um, you didnt leave a  tip\"; I told him \"I know, I was going to leave cash when Im done\" He then says \"This is America, you need to leave a 20% tip!\" Um... I don't recall seeing that in the constitution, so my response of shock and laughter was understandable. When our other friends come back we tell them the story and they laugh. So Im still there sipping on my mint water when one of our friends goes to get one more drink and to close their tab. The giggling man told him \"Make sure she gives a tip\" which my friend tells me. His wife is going over their tab and they were charged extra money. So we approach the bar because we are leaving; they tell her they charged her $3 tax for keeping their tab open... Now, to me this is something that  they should had stated when they decided to keep the tab open. So, in the end they over charged my friend and recieved no tip from me because they were very rude by asking me for a tip when I was not leaving. Guess I we will have to just find a neww spot because I will never be back to this place ever again!", 
    "review_date": "2010-12-09"
  }, 
  "96IKLbNHdK-sOAjuMwoegw": {
    "user_rating": 4.0, 
    "user_location": "Jacksonville, FL", 
    "user_name": "Julie A.", 
    "review_text": "SELECTION OF SONGS GETS 5 STARS!!!! Never in my life have I seen such a huge selection of Crystal Kay and Amuro Namie jams to sing. I was in heaven!  When I first got there, it was about 8 or so so not many people were there yet. I had a saketini. It was OK. (After trying my 3rd saketini at this bar, I'm beginning to realize I'm not a fan of the saketini. Lol.) Luckily it was free bc some old Japanese dude bought it for me. Hooray!  Since there weren't alot of people in the beginning, there were many opportunities to sing. Everyone was really friendly and welcoming. I just got there that day and already I felt like I was at home. Is this what they talk about when they say friendly people live in San Francisco?  Maybe... but singing here does not come free.  Well, before I left, I was told to pay $2 PER SONG and the guy scribbled a bill on a scratch sheet of paper. I've been to so many karaoke places and never did I have to pay per song. I thought he was joking, laughed it off, and left the bar. Well, next thing you know, the guy follows me and shows up OUTSIDE of the bar still asking me to pay for the 5 songs I sang. He tells me I owe him $10 and his manager was going to get mad at him if he didn't pay for those 5 songs. I still think he was joking. He insisted he wasn't so I followed him to the bar so he could show me proof. O man o man. He wasn't joking!! In fine print, it says \"$2 per song.\"   Ironically, I come in here later on to show this place to some random people who were wanting to karaoke. And apparently this happens alot. Another confused customer was listening to another worker from this bar explain about the $2 per song bill. Lol.   I was in Kinokuniya on Monday and I could hear people jamming it out here through the walls. Lol. I guess they are open everynight.  So, in short, I REALLY REALLY REALLY REALLY like this place for their very friendly atmosphere, extensive song collection listed by artist, and being open everynight. But I don't like it for their $2 per song deal.", 
    "review_date": "2008-12-01"
  }, 
  "UOvgLYlLJ3mKgwuih9E8hg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kit P.", 
    "review_text": "Music, booze &amp; fun.  Thumbs up!  Atsuko knows how to concoct my poison.  I love this place.", 
    "review_date": "2012-09-02"
  }, 
  "tOMSnjbKoPGaDMqSFnpCiA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jean f.", 
    "review_text": "This was one of the worse places!  Not only were the drinks extremely pricey,  they added the gratuity already. Even on individual checks. Which would be fine, if it was posted somewhere. Not sure how 3 beers and 3 shots cost $78.  And it was $2 per song. Again would be fine, but if I paid $2 I assume I get to sing the song by myself. I put in a song and there was another girl singing with me. I asked her why she sang with me.  She put in that song too. And she did and she paid $2 also.  Huge rip off of a place. I would have even this place one star if yelp would let me.", 
    "review_date": "2013-06-07"
  }, 
  "24pirQC_JSQ-UunYOV5-6Q": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Holly C.", 
    "review_text": "After reading Jim's tomb below (pretty comprehensive stuff there!) I am not sure what else I can bring to the party. But I will say this much - I love karaoke, mostly consisting of the secret-room-where-no-one-but-close-friends-and-­loved-ones-can-see-me-make-a-fool-of-myself kind, but Festa opened my eyes to what the make-a-fool-of-yourself-in-front-of-everyone thing is all about. The drinks may be pricey (I just glommed onto someone else's big beer bottle orders) but the atmosphere totally makes it worth the cost. I even sang along to one of the few Japanese pop songs I can wrangle. I love Namie Amuro! Go. Have fun. Be a fool.", 
    "review_date": "2008-02-04"
  }, 
  "XrzkP-EPpql8cis-GlQ57A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas D.", 
    "review_text": "Japantown looked so beautiful last night with all of the trees in bloom.  I attended a private party  last night at Festa Karaoke Bar.  People sang their hearts out while others consumed cocktails and sang along from the sidelines and cheered for their fellow co-workers.  It's a bit on the small side but yet so inviting, clean and friendly. Good times were had by all.  Yeah!", 
    "review_date": "2011-04-15"
  }, 
  "s6xZpSHNteqqsLzuC3Jd8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suany W.", 
    "review_text": "This is my favorite karaoke bar! In the past few years, I have frequented this tiny joint many times to ham it up onstage and purr into the mic. $2 per song, supportive crowd and nice staff. \"Gangsta's Paradise\" is MY JAM!!!", 
    "review_date": "2012-09-29"
  }, 
  "6LDH0BvEy1IPsd3WsSOtJQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Shintaro A.", 
    "review_text": "This is def the best Karaoke place in the City!! I like how they are in obscurity in Japan town. This place is a little small but I like how it becomes like a private retreat.  Their wine and cocktail is good, and I love their Lychee martini!  The staff are welcome and friendly too.", 
    "review_date": "2014-04-12"
  }, 
  "a21yEFhTXEJImb9hGl0JyQ": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Walter P.", 
    "review_text": "Three dudes butchered my favorite Aerosmith song. Cutting their throats would have been wrong. This was going to be a short visit instead we stayed long. I work the next morning why the hell did I come along. F**k it i'm here now so help me belong. Yes, i'm Filipino and don't sing...You stupid ding dong. The size of this place is rather small and oblong. With plenty of room for mahjongg or beer pong. Bobby L sang so brave and so brawn. He'd be the sh*tz if he performed in Hong Kong. Thank you Badri, Hana, Bobby, and Chang (Chong). You wore a short skirt what color was that thong?  LMAO!  I'm being stupid!     Thank you Festa!   I'll be back!   Three stars for now!  And thank you Donna Y and Alex C for taking my drunk ass home back to San Jose!  =)", 
    "review_date": "2011-06-28"
  }, 
  "jXOcTKisD-R97eyHYNyU0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kerry N.", 
    "review_text": "let me tell you about the hazard that is Festa.  Suppose you go out with this guy and he totally surprises you by taking you to a kick-ass karaoke bar where the drinks are strong, the background is fittingly cheesy, and everyone is drunk and and singing along to the tone-deaf exhibitionist onstage. As you finish a round of drinks and get up to slur your way through a forgotten-favorite song, you think to yourself: this place is freakin' awesome.  A week or so later, you grab your friends and introduce them to this glorious world of alcohol-filled public embarrassment. And again, it is awesome beyond comprehension.  A few weeks pass, and you haven't been to Festa in a while. A visit is long overdue! You enter the tiny place, and to your horror you recognize more than half of the people there. You realize that, like wildfire or syphilis, word has spread from one friend to another, and before you know it, you're performing to a packed house of vague acquaintances and semi-friends.  Damnit, people, karaoke bars are for anonymous idiocy, where there is no fear of negative backlash or the need for damage control in the days following!  And thus, am I going to have to say: The first rule of Festa is: YOU DO NOT TALK ABOUT FESTA.  Thank you and goodnight.", 
    "review_date": "2008-05-20"
  }, 
  "vYTgM0Oke2pcd0X33yEcaA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike R.", 
    "review_text": "we had a very similar experience to other reviews here., surprisingly high priced drinks for the atmosphere/service and extra drink charges on the bill.  The bartender also refused to fix the bill for us.", 
    "review_date": "2009-08-31"
  }, 
  "dC5kYsLGGoLLVlMjeMqfLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dru M.", 
    "review_text": "C'mon...who doesn't love singing in front of a bunch of strangers?   A few things... *pretty small place...only about 10 tables. Would suggest getting there before 9p on the weekends if you want a seat.  *each song is $2, but the list is long. They have every decade, as we'll as show tunes.  *affordable drinks...and pretty quick service at bar and table.   Overall...great service, fun atmosphere and large song book. Time to get your sing on!", 
    "review_date": "2013-09-02"
  }, 
  "tkcUGC5N4WvUPlSG-KCfhw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie N.", 
    "review_text": "Came here on my birthday last summer with a few friends after dinner and never had the chance to review. It's  a very small and intimate place where people can get drinks and karaoke which is located inside of Japantown plaza.   Although most karaoke places have many rooms where people sing for their own privacy. Not this place!! You pick a song from the folders and when it's your turn, you go up to the small stage and you sing in front of everyone. It's very entertaining just watching those people sing no matter how good or how bad they sing. You have to be 21 to get into this place if you want to sing since they serve alcohol drinks.   If you order drinks, it's a bit pricy. I order Pear Cosmo for $9. I order this drink cause I never cosmo with pear flavor and also thought it'll be a sweet kind of cocktail. I was sure wrong. You can really taste the volka strong alcohol taste which made it harder for me to drink.", 
    "review_date": "2013-01-30"
  }, 
  "-OS9MY0ZfvMFh8UpiAeb5g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh L.", 
    "review_text": "As folks have mentioned, $2 a song, but what a selection!  They have a CyberDam system for all those who need to scratch the J-Pop itch (I'm a bit of a Hirai Ken junkie), and another system for more recent English songs. The Japanese system also has a better-than-average selection of songs in other languages.  If I'm in Japantown, it's a great follow-up to dinner.", 
    "review_date": "2008-12-09"
  }, 
  "x6_8-SBS55EU4xNIjS2rrA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "blair k.", 
    "review_text": "******UPDATE***** Was 2 stars.. Now 1, after essentially being called a liar.   We had a few friends with us but if there are 2 glasses, 1 bottle, 1 bill and no wait staff there shouldn't be an auto gratuity, let alone 30%!!!!! Bad business practices...  Shame shame shame  ****************  I think without my bad experience this would be 3 stars but experience shapes the review so 2 it is.   I have been here before and had a great time.  We come, we karaoke, we drink, we laugh... Good times.   The last time I came here it was a tad off.  Firstly, it was crowded, which is good for business but I think that's a sign that the *****DJs shouldn't sing in between people.*****  It takes up room for the patrons to sing... Not all of my friends got a chance to sing and I had a party of 6 and we were there for 3 hours.  Secondly, the song selection is very weak and you can't hear yourself sing. No Roy Orbison?  Thirdly, they start cleaning and kicking people out right at 1:30 am.  I hadn't finished my very expensive champagne and I was being ushered out!  They did try and be nice about having poor customer service saying  its the law and all this business about their license... I get it, but how is their licensing so different from any other joint in SF? Whatever.. Fourthly, this is the worst part... When they asked for my card to close my tab I did as I was told.  I bought one bottle of my favorite champagne for $80... They handed me the receipt to sign and said they added gratuity....??????????? I shared 1 bottle of champagne with my boyfriend!!!!! And they charged me 30% gratuity without asking!!!!!!!! 30% ?! ?!?!  Where do you get a number like that and why do you charge your patrons a gratuity?!! I filled our glasses each time... I shouldn't have to tip them $30 for walking a bottle 3 feet from the bar to my table, right?!?! And not have a say?!?! Of course when I try to dispute this I am ushered away and out,  not even able to finish my last glass.  Very bad service!!! The readers of this review may wonder why there is 2 stars instead of 1..... Well, the fact they HAD my favorite champagne for sale at a karaoke joint is notable.  And I did have fun, more because of my friends and the other patrons but never the less... I will not come back!  There are way too many karaoke joints.. Ones that stay open till 4 am... That won't charge your party of two 30% gratuity .", 
    "review_date": "2013-04-29"
  }, 
  "KiiaeP1jVSKgNSXzHTZ5kw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolina S.", 
    "review_text": "Did i miss the memo that karaoke is charged by the SONG?? what the hell?? the drinks  were supremely overpriced and the staff was a little snobby. i guess it used to be a little lower key coming to Festa, but unless you're in to drop a hundred dollar bar tab, skip it and go elsewhere", 
    "review_date": "2012-04-29"
  }, 
  "EA3pUAO5kubhX4rYO_BICw": {
    "user_rating": 4.0, 
    "user_location": "Waynesburg, PA", 
    "user_name": "Leigh W.", 
    "review_text": "Great little karaoke bar!! Extensive song list to choose that perfect song and impress the crowd with your awesomely alcohol induced voice!! Bartender was nice and very attentive when drinks were running low.", 
    "review_date": "2014-11-28"
  }, 
  "Dp9vtkpgNti0BuG3202PGQ": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Cyn D.", 
    "review_text": "Very cool 70s retro + loungey karaoke bar in the middle of the Japantown mall.  The drinks are a bit pricey and they charge $2 per song for karaoke, but the singers were all entertaining (esp Corey) and the bar offers a welcome respite from the mall atmosphere.", 
    "review_date": "2009-02-18"
  }, 
  "JckM9f0L5q5xJR_lcsfB7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher D.", 
    "review_text": "I honestly do not understand the low scores given to Festa so far. I've found the staff to be attentive and fun, the drinks strong and delicious, and the song selection better than almost every karaoke place I've been to in the city. The stage can seem intimidating but the truth is the crowd and staff always appreciate and applaud every performance. Very accommodating, fun, and festive!", 
    "review_date": "2012-04-30"
  }, 
  "TJ7vY6598yC_mdh1eIK09w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miyuki T.", 
    "review_text": "It's my favorite bar in San Francisco. Nice wine selection, the staff is very friendly and accommodating. I always have a great night there when I'm the area.", 
    "review_date": "2013-12-25"
  }, 
  "MhXQCjMV2uio3rr2IvdYvQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "I was there last saturday and the bartender called one of my friends a jackass after he left for no reason. After i asked him why, he was very unapologetic and was then rude to the girls I was with. None of us had any bad interactions with this bartender that night so he was just taking out some aggression on us. Not worth your time. A far better place is Town Studio right around the corner for Karaoke. Great place and extremely friendly staff. Don't waste your time here.", 
    "review_date": "2009-11-10"
  }, 
  "6q3RKPxoCV8ZxSFkILg1eg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Petra S.", 
    "review_text": "I've been passing the place by in J-town for a good number of years, without realzing what this place really was.   After an evening of hopping lounges and karaoke bars, my group decided to head here to finish off the night. The prices are a lot cheaper than renting private rooms and the stage and lounge area is intimate enough to where you don't feel intimdiating standing up on stage. I thought the sound equipment was also a lot better, although, a few additional screens (namely in front of you) would have been better than having to keep looking off to the side on a smallish screen on a shelf for lyrics.   Again, great intimate lounge with some of the best singers I've heard yet (aside from Martuni's) and at only $2 bucks a song, you truly only pay for the songs you end up singing. The drinks are obviously still pricey as with any bar/lounges are, however, since I'm not into drinker, I was able to just pay for my songs and then leave whenever I wanted.   Overall, it was a great first experience here and I even made some a few fans at the end of the night! :)  PS. If you're going to be doing karaoke late night 9pm+, I highly recommend parking in the J-town garage which charges only $1 late night hours. It's a lot more secure than parking on the street around here!", 
    "review_date": "2013-07-06"
  }, 
  "nqHHZRKZ3cGlmzzbBFMdvw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "yaji-san k.", 
    "review_text": "Nice design for such a small place. However, beware of the cost. In addition to the $9 well drinks (and you'll be sold bottled water if you ask for water), there can be a cover charge of $10 per person, plus a charge of $2.00 per song, should the owner choose! Was totally surprised when asked to pay for selecting a song at a karaoke bar!", 
    "review_date": "2007-04-22"
  }, 
  "qkreXL6AorI19QA3f2wvlQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vira P.", 
    "review_text": "Awesome song selection in 3 languages!  I went here with the regulars (the ones that have their own song book selection) and i had such a great time belting it out!  The weekday crowd was non judgmental and encouraging.. Someone even asked me to sing again!  I had a delicious bellini, which was $10.  I believe there is a one drink minimum.  And Atsuko, one of the bartenders, was fun to hang out with.  I'll definitely come here again!", 
    "review_date": "2012-12-10"
  }, 
  "qVMqPrHedv8pYOtf5FAaCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Craig J.", 
    "review_text": "I always have a good time here.  The bartenders are excellent, I'm always telling my friends this is a great place to get a drink.  As others have said, the drinks are $8-$12 but the quality is high, in my experience.  And the staff are very friendly and quick to serve.  This is a fantastic place to bring a small group of friends (recommend a weeknight - the weekends get crazy).  Very warm, cozy atmosphere and you get to sing often.", 
    "review_date": "2009-04-29"
  }, 
  "ZzYZaE8P-zV2AXfN3WTfAg": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Krystle M.", 
    "review_text": "Love Love Love this place!!! I have been inspired to take singing lessons and learn Japanese after staying at this place at this place for hours when I only randomly walked in with a friend to see what this place was about.  I plan on making this a regular hangout!!! The owner and the service is awesome and the crowd is friendly. This little gem of a venue is going to be discovered by the rest of San Francisco soon...", 
    "review_date": "2008-05-28"
  }, 
  "UzG5IHFUu6H1UyCRbqHHZw": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Ting A.", 
    "review_text": "for a while now, late at night, i've walked into the sleepy kinokuniya building (thanks for the introduction, jason c!)...  goodnight, sophie's crepes.  goodnight, kinokuniya bookstore.  festa, you're still awake?  fantastic.  i'd like to tell you about my day via song over a bottle of sake.  ...and that's how everyone should embrace festa.  it is the emotive haven for all.  whether you're heartbroken fools (who request 'always' by atlantic starr) or middle-aged businessmen who just came from gold club (who request 'i'm in love w/a stripper' by t-pain), this is where you are welcome.  ....except for the obnoxiously drunk.  you belong in a private karaoke room.  w/acoustically enhanced walls.  and linoleum floors.    are you a karaokein fool?  songs are free before 9pm during the weekdays ($2/song otherwise).  if you see me there, let's sing a duet!  : )", 
    "review_date": "2010-12-17"
  }, 
  "En6ApCOKEHIM7Ea24uXuUg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stuart C.", 
    "review_text": "Hands down the best Karaoke bar in California, let alone San Francisco, possibly the WHOLE world! For all the one-star no-life, haters below, if you come to a karaoke bar expecting white-tablecloth customer service, well, you have a one-star brain! The point of this place is that you come, have a fantastic time, sing your heart-out right before you black out, and be sure to black out so that the next time you come back it's all new to you, so even if you did have shitty service - who cares! And on that note, in fact, the staff are awesome, good friends, great people, lovers, and Masae is simply the best. Rock-on Festa - I think I have been there, but I never can quite remember. LOVE IT!", 
    "review_date": "2013-12-17"
  }, 
  "2--3--v8yHU3a3FljCcBRg": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "William S.", 
    "review_text": "WHOA totally didn't notice I hit the 100 review mark and didn't do anything for it!  Oh well, for my one hundred and FIRST review I will write about a little karaoke bar called FESTA.    Came here for Aileen's unbirthday last weekend and it was pretty awesome.  Not only did our group of 8 make up practically 50% of the patrons, but by the end of the night we were friends with (almost) everyone else at the bar.  Yes, that includes the table of world travelers from Japan and Germany, the table of SoCal Koreans, and the brave solo artists at the bar.  It does not however, include the group of hooligans in newsboy caps and plaid scarves who thought singing as loudly and as annoyingly as possible would make everyone like them.  I guess that only works in the movies.    All in all it's a chill place and an (almost) judgment-free zone for the performers.  Drinks are pricey but hey it's Japantown.  Also, there's a 10 dollar cover if you wanna reserve a table (comes with 2 free songs).  I think they lowered it to 8 bucks for us though because we were awesome or something.    Songs are 2 bucks each if you're buying them a la carte.  Never been to a karaoke bar where you had to pay for the individual song.  But then again I don't go out that much.  Only enough to make it to my ONE HUNDRED AND FIRST YELP REVIEW.  WOOP WOOP!!  Thanks for the memories, y'allz!", 
    "review_date": "2009-10-03"
  }, 
  "Et26UlD026zi8sinFl_NdA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John D.", 
    "review_text": "This is the best place to sing Karaoke in SF. Small and intimate setting, it's about the size of one of the larger karaoke boxes in Tokyo. Staff is friendly and fun, song selection is very good in both English and Japanese. The overall atmosphere is very Japan-like, including the Tokyo pricing of the drinks, and their willingness to \"over serve\" their customers. What I like most about it is the people who go here are fun and cool, and everyone is getting their rock star on.", 
    "review_date": "2009-06-20"
  }, 
  "hvOlTjSeucPuK_LJC7fU8w": {
    "user_rating": 4.0, 
    "user_location": "Bay Area", 
    "user_name": "H C.", 
    "review_text": "Entertaining for sure, if the right person and/or song is up.  We came here after dinner at Benihana and continued the birthday festivities.  About a third of our group were willing to take the stage.  The rest seemed content to watch and laugh (and probably inwardly smirk).  I did brave the stage - only for the birthday girl - and had a good time.  Of course, the song we picked seemed to last forever, but I hope we got an A for effort...  Songs you think may be easy to sing take on a different challenge when you're actually on stage.  However, the crowd was very friendly and encouraging, even to the worst acts.  Guts!  So take a swig of beer and then ante yourself up to belt out a few tunes.  Sweeeeeet Caroliiiiiine!!!", 
    "review_date": "2007-12-08"
  }, 
  "yUEST-mxyXkK_3f-qwTtgg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lyndon M.", 
    "review_text": "Randomly walking around, after visiting Harry's Bar up Fillmore, the peeps and I were looking for something to do in the area.  We were walking down Post, when we heard some noise 'singing' upstairs in the Kinokuniya building.  We decided to check it out, not knowing what to expect.  Alas, a karaoke bar! We decided to stay. The crowd was young, and the mood was right. We ordered the best Sapporo's I've ever had, nice and cold in a frozen glass. Then some pro decided to bust out some Whitney Houston on the karaoke, and then they closed. Didn't realize it was getting late.  Anyway, this place was great, cozy, and fun. Didn't sing, but we were just there looking for some entertainment over drinks.", 
    "review_date": "2011-04-14"
  }, 
  "cWoTq95aJuNKT26cZnxbAA": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Keri R.", 
    "review_text": "I looooooove this place!!!! I have been to quite a few karaoke joints and this one, I have to say, hands down, makes me feel so comfortable and at home and I keep wanting to go back. I love that it's sort of hidden, off the beaten path. It's kind of small and cozy...not intimidating for non-pro singers if you get my drift. The staff is very attentive, classy and also fun. They sometimes sing themselves! The drinks are really well done. I get a lemon drop ever time...done to perfection. This place is in my neighborhood which I love. I have had many many friends come here and we've all had the best time. Each night is slightly different of course. Weekends are more crowded and get big groups sometimes. Weekdays are nice, a mixture of people just getting off there bartending/waitressing jobs nearby, people staying at the nearby hotel and locals wandering in. EVERYTIME I have been here, what I have been impressed by is the support of the crowd. It can be all types of people, old and young, all ethnicities and we're all cheering each other on whether good or bad. It's a real confidence booster to get on stage and sing your heart out and have adoring fans around. A real nice way to let loose. I did read some of the other reviews on here before I wrote this and I almost wish I didn't because I'm saddened to see how they diss the staff. You have to know this staff deals with people yelling into the mic and getting a bit carried away in intoxication at times. They are trying to accommodate new comers and trying to please everyone. So I don't find it unreasonable that they accommodate as they see appropriate. I am so happy and proud to have this relatively new restaurant in my neighborhood. It is one of the finer new establishments to bring the Fillmore district back to life in a positive sense. I have come here for brunch, dinner dates, a company Christmas party, for the drinks at the bar and for apps and drinks in the lounge area. I love decor: the historical jazz pictures with the light behind them on the walls, the unique decorative hanging lamps, and the dark wood. I really like the way this place sections off to make it more intimate whether for private parties or if it's not that buy and they close off certain sections. Oh, the music is jazzy of course. Romantic, classic, soulful, happy and fun. The staff are cheery, helpful and knowledgeable. Ok, the best for last...the food is AMAZING! I have gotten the pork main (YUM!), the shrimp and grits app (YUM!) and the butternut squash soup (YUM again!). I've gotten a lot more than that but that's what comes to mind..haven't had anything bad or even mediocre there basically. This a really classy without being pretentious place and I highly recommend you go there NOW!", 
    "review_date": "2009-09-29"
  }, 
  "HKC-j6ShF_wUfB0q1BH5cw": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Sebastian F.", 
    "review_text": "Frank Sinatra probably started off small. It must have been on one of those tiny stages like they have at Festa - you're in the spot light, but it still feels intimate. The drinks are good, the crowd fun and relaxed. And they definitely get loose the later it gets.  Sadly, during my many visits there I only felt like Frank Sinatra ONCE - when I was performing a classic that I can't remember. Nowadays, I'm mostly content with sitting and enjoying the performances that range from close-to-ear-damage to San-Francisco's-Got-Talent.  Festa's extensive list of songs provide fun for nights to come. Get your Frank Sinatra on and hop on stage.", 
    "review_date": "2014-11-14"
  }, 
  "PadmV2GEoA6mWpQUpPh7Ig": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Monica F.", 
    "review_text": "I am probably one of the few Filipinos who can't sing. And not only that... I've always refused to sing. And how i wish i could!!!!   You know how like when you're little and it's your grandma's birthday, and your mother would ask you to sing as a cutesy little present?? yeah. that scenario. My mom bribes me with Money just to sing. And it was an epic fail for her. I would still never ever Sing. (I played the piano instead and bowed- or recited a poem --and if i weren't cranky, danced to the beat of whatever in a ruffled skirt)  However. people change. Monica grew up and learned not to give a f*ck and what not.   And coz Yelp friends are pushy (in a good way). and with them and karaoke, i am a pushover.  And at Festa... man...if i could only hog the mic for the whole night, I would. That mini stage...that gigantic, super updated songbook (They had Rolling in the Deep by Adele!!! - but that's for my next show ya guys -- when I'm not driving and i can drink and be drunk)... the awesome crowd who clap no matter how crazy one sings... the awesome bartenders....the clean restroom...the yummy cocktails....the comfy lounge chairs...  I love FESTA!!!!!", 
    "review_date": "2011-06-24"
  }, 
  "Q1OcZih_TjD3VmL0enjKVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R M.", 
    "review_text": "Was walking through J-Town and heard singing so we stopped by to check it out and ended up staying.  It was fun watching people do karoake - there were alot that were American Idol standard!!!  Its entertaining.  The place is well decorated, very cozy, and good ambience.  We would go again.", 
    "review_date": "2013-08-30"
  }, 
  "s1mD1PvJQrAYHfNG9UDYJw": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Lily T.", 
    "review_text": "Overall, Festa can be a fun place, but get this:  One night, my friend couldn't drink anything alcoholic for some reason (I forget why), so he ordered a plain Diet Coke. Guess how much he was charged? $5. It was straight out of a can too. He thought, \"Well, if you're going to make a 500% profit off of a can of soda, can I at least have the rest of the can?\" The answer is \"NO.\" What kind of world do we live in? How do you say \"wrong\" in Japanese?", 
    "review_date": "2009-05-11"
  }, 
  "jt49xjEjQisu6wTTGn6B3A": {
    "user_rating": 3.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Annette J.", 
    "review_text": "The drinks are strong with this one. Oh so very strong. Like, my head hurt for a solid day after a night of drinking/karaoking here. But boy was it fun at the time!  The downside, of course, is that the drinks are pricey. But you won't need many glasses of liquid courage to get on up and sing!  The space is small, looking pretty airport loungey, but that's part of it's charm. Teeny stage, a few tables huddled around it. You'll most likely get pretty intimate with someone you don't know as it gets standing room only pretty quickly. Another bonus of the small space is that it doesn't take long for your song to come up since it doesn't fit very many.  The staff is super nice, the bartenders chatty and friendly. The biggest issue that I have is that you have to pay to sing! 2 bucks a song. Maybe I haven't been to enough karaoke only places and this is the norm but round Michigan the singin' is free (although I have been known to tip the karaoke master from time to time). So to have to pay was a little bit of a surprise. The staff runs the karaoke too, so it's not like they're paying someone separate. Hmm.  Otherwise it's a great place to enjoy a night out with friends, new and old. Karaoke is a fabulous ice breaker, dontcha know??", 
    "review_date": "2011-01-21"
  }, 
  "5Ug6Dy69REkQ4c3tFabKdQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mari S.", 
    "review_text": "Hands down the worst customer service I've ever had at a bar in San Francisco.  I came in with a large group but had no intention of ordering anything even though other people were.  My friend and I asked for tap water, and the waitress brought us bottled water that she wanted us to pay for.  We refused it and politely clarified that we wanted tap water.  She came back with two Sapporos.  What?? Fine. We'll take the Sapporos, which she said (and the menu said) were $6 each.  (Reading the reviews I now realize there is a drink minimum so maybe that's why she did this, although that was not made clear to me).  I gave her my credit card, and she came back with a bill for $15.50.  $15.50?!  When I challenged it, she said I had to pay 18% gratuity because I was sitting with a large group.  But I was ordering as a party of 2!! I wasn't paying for everyone's drinks!  And even so, $12 plus 18% gratuity is $14.16, not $15.50.  I obviously refused to pay this.  Then she had the gall to come back with a $13 check, which was STILL ripping me off (since drinks aren't supposed to be taxed in a non-restaurant, and there's no way sales tax on two drinks is an even $1), but I was too fed up to protest more.  Absolutely appalling. On top of all this, they charge $2 per song and have a pretty lame selection of music.  This place does not deserve your business.", 
    "review_date": "2013-12-15"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "$12 for a well dirty martini? Unless their bottom barrel vodka is Grey Goose, me thinks not.   Still a great spot for a fun night of karaoke, but some recent service failures have taken a bit of wind from out of my sails.", 
    "review_date": "2011-09-14"
  }, 
  "hhIYp_VDKZSzMecFF3YJAg": {
    "user_rating": 1.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "Lucy L S.", 
    "review_text": "Totally agree with Brenda T. regarding Festa Cocktail Lounge!  I've never been to any Karaoke that charges customers $2 per song that they sing. I have been to Karaoke bars which are more upscale than this one wherein you get private rooms to use and sing your lungs out but does not charge for the number of songs you would want to sing.  Not coming back.", 
    "review_date": "2010-02-01"
  }, 
  "SdX6ZlW4YHwZf75-S5eO7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Takashi Y.", 
    "review_text": "I came this place for friend birthday I really love this tiny karaoke bar. So many selection of song and sound system was best !!!", 
    "review_date": "2013-12-16"
  }, 
  "Bp-TQEtc6Vs6ldnLgjqglg": {
    "user_rating": 5.0, 
    "user_location": "Wellington, New Zealand", 
    "user_name": "May T.", 
    "review_text": "can two people step into a karaoke bar on a friday night, not sing, and STILL have a great time?   the answer is a resounding, YES.   they have the best j-video collection of songs i have ever seen, and the bar is intimate and fun. a lot of older japanese men mixed in with the crazy young and boisterous crowd.   the bartenders are super cool and everyone in the bar is extremely friendly.", 
    "review_date": "2008-05-10"
  }, 
  "3bRM3cStV70e8utZpOemCw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diego B.", 
    "review_text": "WHOAH. Was this place shady? Check yes!  I have been here a few occasions prior and had quite a pleasant evening, but apparently when you bring a large group of thirsty divas the shit hits the fan.  Yes, this place is cute, small, and the decorative atmosphere is lovely, but when taking into account the snobbery and rudeness of the people that work here, I will never ever come here again. And I highly recommend that you stray away from such businesses.  Shady example 1:  The large group that we were with opened a number of tabs. The same drinks were charged on multiple tabs. Sure, they wanted to take more of our money for booze, but they definitely weren't overwhelmingly excited to play the songs our party requested.  Shady example 2:  A friend of mine opened her own tab with a few drinks, put in a song when she arrived, and waited two hours. Her song never came up. People that came to the place AFTER her got multiple songs in. Upon asking the \"KJ\" if he lost it, he was--apparently--quite rude.  Shady example 3:  There were a number of tables reserved for the evening. That's fine. They sat us in the reserved section and said, \"At 11:30 you'll have to find another table or stand.\" That was no big deal at that point. Come 11:30, we all get up and move to another section of the bar. I was sitting at a table for about 10 minutes, and the owner came up to me, placed a reserved place card, and said, \"This table is reserved, you're going to have to move.\" She then goes to MY FRIENDS (who came later than the first wave of people) that I INVITED (to spend money at her corrupt establishment) and asks ME to move so they could sit down. It's a good thing I knew these people, seeing as they walked into the bar after me, or I would have been so much more disappointed than I already was. It was such a dick move--her judgment of socioeconomic class was very apparent as she asked the casually dressed brown man to move for the \"classier\" dressed white girls.  All in all, don't come to this place unless you're already friends with that owner that has the worst stink face I have ever seen. This place could really be awesome if the owner wasn't corrupt in her business decisions.", 
    "review_date": "2009-08-03"
  }, 
  "gBEihTFxWQ5CzOH1tGjAPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mona C.", 
    "review_text": "4 Stars  + Open Late + Large Selection of Songs + Good Service + Accepts Credit Cards + Happy Hour  +/- Open Mic haha  - No Private Rooms - Small  My girlfriends and I found  this place after having dinner in Japantown a few weeks back. We originally walked in to get a few drinks and then realized it was a karaoke bar also! Great haha.  Drinks we ordered were: White Peach Bellini (White Peach and Sparkling Wine) $10 <a href=\"http://www.yelp.com/biz_photos/cFTXkg5aU2rLJPBpsL3pmQ?select=1M8EjXJKyNQ973KvpVv7vQ\">yelp.com/biz_photos/cFTX…</a>, Pomegrandetini (Vodka, Pomegrande, and Lemon Juice)  $9  <a href=\"http://www.yelp.com/biz_photos/cFTXkg5aU2rLJPBpsL3pmQ?select=noCVBoWMKghA0tMAEW56dw,Blue\">yelp.com/biz_photos/cFTX…</a> Tokyo (Vodka, Pineapple Juice, and Blue Curacao) $9 <a href=\"http://www.yelp.com/biz_photos/cFTXkg5aU2rLJPBpsL3pmQ?select=_mKkiDS6joctXF1BP7hZlg\">yelp.com/biz_photos/cFTX…</a> and Ginger Lemon Drop  (Lemon Flavored Vodka, Lemon Juice, and Ginger Syrup) $9 <a href=\"http://www.yelp.com/biz_photos/cFTXkg5aU2rLJPBpsL3pmQ?select=UGErfVOmHE_JMipWMcM0DA\">yelp.com/biz_photos/cFTX…</a>.  There weren't that many people in when we arrived so we were lucky enough to sing a few songs on stage. They have a pretty large selection of songs to choose from. English, Korean, Japanese, Chinese, you name it. Festa is open mic, therefore no private rooms and everyone gets up see you sing haha. Happy hour for free Karaoke starts from 7:30 pm and 9:00 pm.", 
    "review_date": "2010-04-01"
  }, 
  "a2DI4ToFCOMnxXqsu4Ur5Q": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Susan G.", 
    "review_text": "Terrible! Rude owner and bar tenders! Is it that hard to be nice when we're paying way to much for bad drinks and paying two bucks per song to do Karaoke? It shouldn't be. I will not go here again, unless they get now ownership and staff, and better drinks. Booooooo  I can't stand this place!", 
    "review_date": "2010-09-15"
  }, 
  "j6wBhprUCU3XC7aQe8u6Qw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren H.", 
    "review_text": "We've been to this place twice and  our experience could not have been more different. The first time we went, we found it to be one of the only authentic karaoke bars in Japantown that did not serve as a brothel on the side and we had a terrific time singing with the owner and buying our $6-$8 drinks. However, we went there tonight with a group of friends and when our final tab came, the bartender took the priveledge of charging us $10 a drink, added on drinks that we paid in cash to our friends' tab, and charged us $2 a song without ever notifying us of the \"karaoke song\" charge in the first place. We will never go there again and would advise likewise.", 
    "review_date": "2008-01-06"
  }, 
  "vgkevqurpV4oZur0ThA-pQ": {
    "user_rating": 4.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Beth F.", 
    "review_text": "I've learned some tough lessons at Festa.  Japanese businessmen love songs by Britney Spears and will get up and dance with you making you feel like the young, hot version of Britney - not the freaky, can't keep her children, shave her head Britney.    Japanese businessmen do NOT, however, like Barry Manilow.  They will stare at you stonefaced and make you feel like a fallen star.  They are probably right.", 
    "review_date": "2007-10-04"
  }, 
  "P_0MidHAEbcO8gmHE6eQcw": {
    "user_rating": 5.0, 
    "user_location": "East Palo Alto, CA", 
    "user_name": "Yan Biao B.", 
    "review_text": "The familiar warble of a karaoke song wafted out a nondescript set of doors, catching my attention as I was walking towards the parking garage. My curiosity was piqued, and I forged through the veneer to find myself transported to a bar in Tokyo. My friend was similarly delighted with the kitschy skyline decor and fabulously modern red chairs. We settled in quickly even though there weren't a lot of patrons around, and after a bottle of delightful sake called \"poochi poochi\" we took to the mike stand and never looked back. More of the bar's regulars strolled in later in the evening, and none shied away from belting out some classic oldies as well as more current tunes. I ended up spending a pretty penny there but I don't think I can say it wasn't worth it.", 
    "review_date": "2008-04-17"
  }, 
  "jPG9VvKCfp4RAMuaRFD91Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thi N.", 
    "review_text": "Anyone who knows me well knows that I LOVE to karaoke.  Though I usually prefer singing in a room with just my friends, there's something exhilarating about getting up in front of a crowd of strangers.  I've introduced many friends to Festa and everyone has enjoyed coming here, as far as I know.  They keep pretty up-to-date on their songs, but also maintain a nice list of the classics.    So, this is how it works: you write your song on a slip of paper, hand it to the staff at the bar, and wait nervously for your song to play.  While waiting and feeling somewhat regretful for the situation you just put yourself in, you end up downing a beer or taking a (few) shot(s) to calm your nerves.  By the time your song is up, you're too buzzed/drunk to even care; as far as you know, you rocked it!  It's a formula for a great night, if I do say so myself.  Drinks are a bit pricey here; you can easily rack up a hefty bill between drinks and songs, which cost $2 each (free before 9 on M-Th, I believe).  It's always a fun time though, and the patrons here are always nice and supportive of whoever is up on stage singing, so don't be shy!", 
    "review_date": "2013-10-07"
  }, 
  "fSvOdnryI9FPJ2ylcsE2ig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "Love this place. It's intimate and they have a full bar. Costs $2 per song and sometimes you do wait awhile. Go early and get your songs in. Their list of songs is huge too. You go up on stage and can sing to your heart's content. I hate singing, but I got up there to sing with friends, of course. Great find in J-Town and way classier than do re mi (ew disgusting!)", 
    "review_date": "2010-06-03"
  }, 
  "2bHSZhM0huV8LRh3YHaOSQ": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Dark, swanky, sexy. . . excellent backdrop of lit up city skyline for singing Japanese karaoke.  I don't know about you guys, but I can't read or pronounce Japanese characters, so add that to the fact that I don't know any of the songs, and this will make for some damn obnoxious (or entertaining) karaoke. Add it to the JTown Crawl. **Update** I'm going with damn obnoxious karaoke.  We did indeed add this spot to the JTown Crawl on Friday.  What I have only seen as a dark lounge filled with a couple of businessmen during the week, but have heard as a noisy hotspot on weekends or later in the evening, proved its hotspot chops.  But not with the crowd I'm used to seeing.  It seems to me that Silver Cloud got too crowded for some of the more SF savvy karaoksters and they've moved on to more intimate pastures.  Unfortunately for the rest of us.   We perched at a corner table for just a moment before the waitress asked if we'd like to sit in the corner booth (which had a reserved sign on it).  Boy did we!  We snuggled in and placed our order and waited to watch some folks sing their hearts out.   I only made it through two lychee martinis (which were excellent, even if the lychees themselves were too sweet for me - canned it seems) and a little bowl of \"outlines\" which I ordered based on their name alone.  It's just snack mix - sesame stix, breadsticks, pretzels and nuts.  Why they call them outlines I have no idea, must be something lost in translation, but I love that they do.  It made them that much more delicious.   As for enjoying the dulcet sounds of undiscovered American Idols, those dreams were shattered as we winced through our evening.  Two large groups of drunk and obnoxious white folk took turns singing, reading lyrics in monotone spoken word style, and/or screaming and grunting into the mics.   Luckily you need do nothing more than catch a bartenders roving eye and signal for another drink when you're dry.  If I had to get up and wade through the boisterous crowd and their cupcakey fingers I would've only had the one drink. I think I'm only grousing because I was hoping for the quieter, more singing based karaoke experience I had seen on previous stops, instead of the Marina spillover screamfest/microphone fight we ended up with.  Oh and because we were the only couple in the entire place that didn't get offered birthday cupcakes.  What's up with that?  That's just mean.", 
    "review_date": "2007-05-18"
  }, 
  "3c3w_jRC2PwrA2MmC7ChGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gopal R.", 
    "review_text": "Ordinarily, I'm pretty much scared shitless at the though of standing up in front of a crowd of strangers and singing karaoke. This place is just cozy enough, however, that it really rubs the edges off of my stage fright.   The cocktails are little bit weak, considering the price tag ($9-12).   They really reverb up the mics to sweeten your voice.   One time I sang Just Like Heaven, and ended up singing into both mics at once. I think I even sat down on the stage for a little bit. It must've made a pretty strong impression on my friend Dan, because he brings it up every time this place gets mentioned.   One of these days I'm going to find a song that I can flap my arms and jump up and down to.   Their English-language pop menu somehow skews towards a slightly new-wave/alternative sort of vibe. For instance, you can find Jon Spencer Blues Explosion songs on their menu, but no Space Oddity.   What am I gonna fatally embarrass myself with if there's no Space Oddity?", 
    "review_date": "2009-02-12"
  }
}