{
  "gyvBwQPhZiJkND2tpjYz1A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly C.", 
    "review_text": "Adore this place. I don't really want to write this review because I don't want you to know about this little gem I found. I want to keep all the tasty local brews and wines to myself. Everything on the menu is made in California. They have some really interesting stuff and it's all high quality. Go if you are looking for a relaxing space with refreshing drinks but please don't tell your friends.", 
    "review_date": "2014-01-06"
  }, 
  "EtSplbpy1iYCWLvln1N-EA": {
    "user_rating": 5.0, 
    "user_location": "Rosemead, CA", 
    "user_name": "Ivan T.", 
    "review_text": "Wow, where do I start? I'll keep it simple bybsaying this place is so awesome!! I love the ambience here! The workers here were super nice and the customers here were also friendly. They have an amazing wide selection of wine that anyone will love. I will definitely be back with a group of friends!", 
    "review_date": "2014-07-10"
  }, 
  "s9CDz1Sw9xO2T5hRRKc6Nw": {
    "user_rating": 2.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Gigi G.", 
    "review_text": "I heart wine bars. I heart charcuterie plates...even though they are always overpriced...I heart small wine bars. We visited this fig and thistle spot on a Friday night and cozied right up to the bar. Great gal served our cheese plate and we chatted for some time...then some guy walked in and posed as a bartender. He asked if we wanted to drink anything, which yes we did want to drink \"something\" at a bar. Our drinks and charcuterie arrive...charcuterie was ok...not so impressive over priced $22.00 charcuterie (note Jardiniere has a mind blowing $18.00 charcuterie!!!) anyway I digress. So back to weird male bartender...as we were sipping and eating he proceeds to open up the little plastic case that holds pickles and nuts and proceeds to stick his bare hands in and grab food to put in his mouth! Then every few minutes he'd grub some more. I guess he was hungry? Onto the bread... dips his bare hands In the bread container...man handles the bread grabs a few then chomps away! All in front of the patrons..5 min later he was talking to some other chicks at the bar then reaches over to the grape bowl and BAMN grabs a few and tosses in his mouth. I feel bad for the owner..I'm sure she would have had a mild coronary should she have seen her hungry employee grubbing with bare hands in the food tray. I never saw homie wash his hands from man handling the iPad to man handling the bread to later on after he had his hand in mouth preparing someone else's charcuterie!!! Gross!   Maybe we'll go back for an expensive glass of wine..but who knows. And dude that serves beer and wine at this place...eat something before starting work!", 
    "review_date": "2014-11-15"
  }, 
  "ZWsPEEG02S6VazbjUC1q6Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SFlover D.", 
    "review_text": "Wonderful wine bar, done very tasteful. Amazing wine selection, the owner/ bartender is so welcoming and sweet. This wine bar is great to get together with a group of friends, its not loud, perfect to catch up over yummy cheese plates. Love the location too!", 
    "review_date": "2014-01-01"
  }, 
  "cHFc7QATeFr6OvX_Pk9D8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "This intimate wine bar is charming, has a great but small wine list, and best of all is not crowded! (Yet.) For its great location tucked just off Hayes st, this is a rarity.   Friendly staff, nice atmosphere. Trendy hipster decor (library card catalogs, edison bulbs) but not overbearing. Good curated selection of wine and beer. They also have small plates which I haven't tried. Will definitely keep coming back, at least until it gets discovered and becomes completely overrun like the rest of Hayes valley.", 
    "review_date": "2013-09-05"
  }, 
  "goZ-kSTFH5Ujpf54GwbaRw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kris O.", 
    "review_text": "This is a date spot wine bar hands down. The bottle of rose we had was so-so. (It was the Santa Barbara Groundwork).   But I really loved the quaintness of  Fig &amp; Thistle. I felt like I was going to my friend's house for a wine party.", 
    "review_date": "2013-06-24"
  }, 
  "MaQnQG_rrTbIzEvbfyx0gQ": {
    "user_rating": 5.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "bob o.", 
    "review_text": "what a neat place! we stumbled in on their 1st anniversary and met Angel who is all you'd want tin host, caring about the guests, and her touch on the place. Nice wine and beer list (all we had) but will be great to go back when we're in town. Congrats on your first!", 
    "review_date": "2014-06-07"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Really cool little beer and wine bar in Hayes Valley.  They seemed to have a good selection of both...at least none of us complained about the options.", 
    "review_date": "2013-07-24"
  }, 
  "mJHhMXJK8yWnG1CNgJKxGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allyson D.", 
    "review_text": "Nestled in A petite Hayes Valley Alley, Stumbling upon this gem will make you rally.  Cheese, beer and a bunk bed to play, With lovely servers, this is a place to stay.  A variety of wine to choose from, And a picnic table for your bum.  I hesitate to type this,  and I know it isn't the nicest,   but I hope others go else where, A place like this in SF is rare.", 
    "review_date": "2013-08-06"
  }, 
  "88Es01sQHe5ZOiu3lUXUKQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zara S.", 
    "review_text": "Cute and very cozy with an intimate feel. We went at the end of the night on a Saturday, thirty minutes before closing. The bartender was still very friendly and accommodating. We did have some delicious wine and enjoyed the quiet atmosphere.", 
    "review_date": "2015-01-04"
  }, 
  "_iobGls750wUaWmIlXkR7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T L.", 
    "review_text": "Love.  This.  Place !!! Must go 4 wine and beers !  Cheese plates r fab , their only food.  Cute seating area inside.", 
    "review_date": "2015-01-18"
  }, 
  "04FXqIM17V2qup1oB1xqAA": {
    "user_rating": 4.0, 
    "user_location": "Santa Margarita, CA", 
    "user_name": "Ariel D.", 
    "review_text": "Really loved that we stumbled upon this little gem.  Staff was great (all two of them), and they nailed it as far as ambiance goes.  Would like to have seen a few more food choices, but they explained it had something to do with licensing, so we opted for the cheese plate, which was very generous and delish!  Wine list was pretty great...would like to see a few more options.  Beer on tap would be nice, too, but not sure the small space/kitchen they have permits that.  Will definitely revisit this gem on my next trip to Hayes Valley!", 
    "review_date": "2014-01-07"
  }, 
  "V_Qm7QN3tkNObRxAdifdEg": {
    "user_rating": 5.0, 
    "user_location": "San Gabriel, CA", 
    "user_name": "Vanill L.", 
    "review_text": "My boyfriend and I came across this place after a dinner date one night. We heard alot good things from our friends, so we thought we should give it a try. To my surprise, they had a huge variety of wines to choose from. The staffs were so helpful and friendly. Plus, the ambiance is awesome here! I am planning to go back this weekend with my girls to try other wines on the menu!!", 
    "review_date": "2014-07-10"
  }, 
  "mW8fvDQ3JAtzeLjU--CjTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rowena L.", 
    "review_text": "I just love the atmosphere of this place. Perfect for a date or just catching up with friends. The first time I tried to go it was packed to the score (apparently Thursday nights are crazy b/c it's pastrami night) but this past Saturday it was nicely spacious with a good flow of people in and out.   The bartender was really nice to my friend but pretty inattentive to me, either b/c he just liked her or b/c he was too busy chatting w/his friends when I was trying to order. But that interaction was like 3 minutes, so it didn't really affect my time there.   Had the malvasia bianca per a yelper's tips and it was really good. A dry white but with a tinge of sweetness.", 
    "review_date": "2014-08-18"
  }, 
  "IDdafFBKpl9HPAtMlTmyOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole N.", 
    "review_text": "Wow. Love this place. Def $$ but between the james blake playing, the sweet bartenders, and the awesome seating this place is a go-to, favorite wine bar in the city so far. They serve wine that you cannot buy in stores, apparently a friend of mine had it the time before we came. We were there on a Wednesday evening and they were very adamant about last call. This place is good for dates or catching up with friends. It makes me feel like i'm sitting in someone's kitchen abroad, catching up and sharing stories. if you're looking for a more intimate place with great wine, this is it. they're very generous with their pouring too by the way.", 
    "review_date": "2013-08-01"
  }, 
  "BRh5hZvTU-xYXux5WnjBMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "The shooting star wine is sumptuous.", 
    "review_date": "2013-06-27"
  }, 
  "GtWXLPk8sPn8yyIFP3eRKg": {
    "user_rating": 5.0, 
    "user_location": "Fair Oaks, CA", 
    "user_name": "Raymond I.", 
    "review_text": "I gotta say... I LOVE THIS PLACE! I come to to sf from sac about once a month to see an opera and it has become a ritual for me to go there after. Great location from the opera house/civic center.  The design inside is awesome. Really cool, relaxing, trendy without trying too hard, and an awesome bathroom! I really like the individual hand towels.. A very nice touch.  The staff have all been great. Very helpful, nice, and enjoyable to chat with.  The wine and beer selections themselves are also very well done. A good variety and all quality. Would definitely recommend this for a place to take a date.  Over all, you just can't go wrong. Looking forward on going back today!", 
    "review_date": "2013-10-27"
  }, 
  "IcJfiXkrYuu30aVxnY1Z0Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen R.", 
    "review_text": "I was excited to try this place, but was a little put off by the sweltering temperature inside, and the extremely loud noise level. My husband and I stopped by on our way to the opera and were looking forward to a nice \"date\" spot... so I wanted to like this spot, but honestly neither of us enjoyed it. We left feeling overheated and rattled from having to yell to communicate with each other. Also, the prices were a bit too steep, in my opinion..", 
    "review_date": "2013-07-03"
  }, 
  "ibvH1Y7Rh_tstiWgH0OFTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica S.", 
    "review_text": "Cute and cozy neighborhood gem tucked on Ivy Street in Hayes Valley. Fig &amp; Thistle is casual, warm and inviting. There are about 3-4 seats at the bar, 4 tables that comfortably fit a pair at each, but if combined, can accommodate larger parties, or the cute lounge/couch like corner spot.  They do not have a kitchen so the food they serve will consist of Charcuterie or Cheese - the variety is good though and great for sharing! They also welcome you to bring your own food as long as it doesn't have a potent smell.  Good beer and wine selection - beers are by the bottle only (range $3-7 for small bottles and upward  of $20 if you get the large bottle which are great for sharing) but they have some wines on tap as well as wines by the bottle.  Overall - it's such a comfortable spot I'd pop in here for a drink  before or after dinner in Hayes Valley or simply catching up with a small group of friends anytime!", 
    "review_date": "2014-09-29"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Love this charming little bar nestled in Hayes!  Fig and Thistle has an old speakeasy sort of feel, hidden on a small side street around the corner from One Sushi. They serve a variety of wines and beers (none on tap, all from a bottle/can) and a charchuterie plate with some fruit and bread.   Tip: Credit cards accepted.", 
    "review_date": "2013-09-03"
  }, 
  "Rdesw9ekWdVNbvHfLYjQdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacob K.", 
    "review_text": "They have a bunk bed.  THEY HAVE A BUNK BED!  The wine is delicious, the tunes are rocking, the space is intimate, and Angel is an angel, for lack of a better word.  Welcome to the neighborhood, F&amp;T...I'll be back soon and often (especially once you get more beer!).", 
    "review_date": "2013-06-04"
  }, 
  "97YdD8tkMkUSvGUw6_u4GQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca C.", 
    "review_text": "Cute little tucked away spot. Laid back. I sat the bar with my friend and it was really chilled on a weekday.  All of the wines are of California producers. I have to admit that I wasn't crazy about the wine list, tried a few of them, really liked the pinot noir (Krutz Family Cellar's 2009 pinot noir anderson valley) and the orange wine, but didn't really care for the rest.  The cheese selection was quite good.", 
    "review_date": "2014-01-11"
  }, 
  "JG2-Z87cVoVQRiCaTtc7jw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison S.", 
    "review_text": "What a charming little spot!   My wife and I wandered in after a night at the symphony (don't worry, we were just seeing Home Alone accompanied by a live score, it wasn't that fancy), and we were delighted. It's small and cozy. Just a few seats by the bar, a few tables, and an interesting bunk bed-cum-bench type thing. It's all very of-the-moment, with slate and reclaimed wood. I was also really happy that we were surrounded by other folks who weren't in their early 20s. It was slightly sophisticated, but definitely not stuffy.  The wine and beers are all Californian, and they have a bit map of the state drawn on the chalkboard, with arrows to point out where each selection is from. Amy and I enjoyed some bubbles from a super interesting flute that held at least double the normal amount, so I felt the slightly higher than normal price for a prosecco ($14) was worth it.", 
    "review_date": "2014-12-29"
  }, 
  "wmpOUcPCRjU9kb0-YdIusQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clayton S.", 
    "review_text": "i love this place. i dont know the history of the location, but it looks like someone converted part of a small san francisco apartment into a bar and lounge area. it's got a really cozy and dimly lit atmosphere, creating little pockets of privacy despite the fact that this place can get pretty packed. they serve wine and beer only, but the selection is great. fantastic place to take someone on a date for drinks or while you're waiting for your table to open up at a nearby restaurant.", 
    "review_date": "2014-10-28"
  }, 
  "ypSFIqHZNeCt_4-kKfdA4g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "It's a fine spot to go in and hang out with a glass of wine.  Seems a bit like they could use the space better for more seating/counter space/small bistro tables or something.", 
    "review_date": "2014-03-14"
  }, 
  "SHLsXd5jg0UgpDQoSWBHkA": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Anita T.", 
    "review_text": "Convenient location to a lot of other shops and eateries that are open late night (including Smitten ice cream!).  Chill atmosphere, not too dressy, and the bartender was attentive, helpful and willing to suggest (and pour generous samples) to help you decide on a wine.  Location is a little small but not cramped, the amount of seating is appropriate to the space.  Also not loud and good for a date night or place to have a conversation without screaming at each other.  Very enjoyable.", 
    "review_date": "2014-07-06"
  }, 
  "YB6lFrreyxzsWhipnXAPOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ron E.", 
    "review_text": "Nice, quaint low-lit place to relax and catch up w/ a friend or two.  The bartenders were courteous and knowledgeable as we asked for recommendations.  I'd come back for an after dinner or post-show drink.", 
    "review_date": "2013-10-18"
  }, 
  "iOluSwJF1x09ve8QHLUkmg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt W.", 
    "review_text": "This place sucks. It's cute inside, but is staffed by assholes and attracts a similar clientele. A sad addition to Hayes Valley.", 
    "review_date": "2014-03-10"
  }, 
  "4Q2e5kHX5qlJqlH0JC3Y3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "julia s.", 
    "review_text": "Just celebrated my 29th birthday and had an incredible time at Fig &amp; Thistle! It was the perfect venue to hang out with a group of my close friends and enjoy each other. The wine and beer menu was delicious, the space was perfectly simple, laid back, and comfortable, and Nguey/Angel/Johnny/Chaz were amazing hosts. They were personable, social, and joined in on helping us celebrate.   Thank you all for a GREAT birthday!!", 
    "review_date": "2014-03-09"
  }, 
  "yq6bZrd4Hs23d5eFTiv_2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "I came here recently for the first time with a couple of friends and really liked this place!  It's small and quiet so you can actually hear your friends talk.  Also, the space is decorated very cute so I think it's a great place to catch up with some girlfriends.  We thought the glass prices were a little high (no happy hour specials here) but the bottle prices were reasonable so we ordered bottles instead (woo woo for more wine lol).  We also ordered their cheese plate (I think this is the only food item?) which was also good.    I would recommend giving this place a try if you're looking for a wine bar where you can actually have a conversation with your friends or date! :)", 
    "review_date": "2013-12-17"
  }, 
  "AWxCkQtik5voWho0DaqzoQ": {
    "user_rating": 5.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Tommy E.", 
    "review_text": "Super chill place to hang with new people and old.  Great selection of beer and wine.   My favorite place in the city to hang!", 
    "review_date": "2014-11-22"
  }, 
  "kDk5Sun6adcCkcMdslBJIg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Christian D.", 
    "review_text": "I like coming to this place to have a glass of wine! its really chill and layed back. the service is great and ptices are very reasonable. I almost fell asleep on their bunk bed... haha", 
    "review_date": "2014-09-29"
  }, 
  "s8nkbQAlrVPfg1u4anGKtw": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Kelly S.", 
    "review_text": "Like so many places in SF, this bar is teensy tiny. So here is what you can expect: First, you lurk around being creepy while waiting for someone to move off a spot. Then when you secure one, you're perched atop a tiny chair/ the bottom of a bunk bed/the side of a bench you happened to snag, elbow to elbow trying vainly to ignore other peoples conversations.  The beer selection is good, the wine looks well thought out (if spendy) and as you might have gleaned, this spot is not good for groups. They can't avoid the small space of course but for me, it's most likely never going to be a destination if you've got more than 3 people in your party. And I got the sigh and side-eye combination when asking for their wifi password so be warned.", 
    "review_date": "2014-04-17"
  }, 
  "gS3zU9LHebWvlGchrrFqog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zari Z.", 
    "review_text": "Great little bar for a good conversation. Cosy, with friendly service and a pleasant ambiance, it's perfect for a low key night with friends.", 
    "review_date": "2013-07-20"
  }, 
  "cmAHVj0b5Wz5Tun6Op0ksw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Skye W.", 
    "review_text": "Nice small, intimate space.  Wine and beer only. Prices are a bit higher than some other places, but I feel like wine bars are always a bit posh.  I arrived around 10pm on a Saturday night and all the seats were full.  The crowd was mostly people on dates or girls in their early twenties trying to be classy.  By 1045/11ish the place was half empty- very strange. I had one drink with my friend and decided to go somewhere a bit more upbeat. I'd definitely come back for an early evening drink or to catch up with an old friend.", 
    "review_date": "2014-08-17"
  }, 
  "6Qw7mFltr_MrdO9cNGgQbQ": {
    "user_rating": 5.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Ali L.", 
    "review_text": "To put it simply...  This place is dope. Super cozy. Wine/beer selection is top notch.  Lots of love to Angel and Nguey! :) Our LA/Seattle crews will be back to say what's up in the future.", 
    "review_date": "2014-07-11"
  }, 
  "xQjaz9qpIsoi5VtZHrBz4Q": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Gregg O.", 
    "review_text": "How could you go wrong with such a great hideaway. The selection if minimal but the atmosphere is fantastic! Met some great people here on vacation that I will never forget. ...and that bunk bed!", 
    "review_date": "2014-01-05"
  }, 
  "DICLJDdq0HpvOVYR5mB4gA": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Eric F.", 
    "review_text": "A brand new wine bar tucked away in an offstreet in Hayes Valley.  The bartender was very helpful with regards to wine recommendations and I ended up with a seriously excellent Teroldego from Santa Maria - never thought I'd find this varietal from a California winemaker!  Fig &amp; Thistle serves a nice selection of draft beers as well for those more inclined towards hops and barley.  I haven't tried the food yet, but the cheeses and bread certainly looked tasty.  Quite the neighborhood gem and absolutely worth checking out especially if you have dinner plans at Jardiniere nearby!", 
    "review_date": "2013-06-20"
  }, 
  "fS9vRXSmi6IW8ULnUMgrFw": {
    "user_rating": 4.0, 
    "user_location": "Chula Vista, CA", 
    "user_name": "Berenice D.", 
    "review_text": "While I was visiting my old neighborhood .   I loved the drinks and the ambiance. I will definitely check this place again when I visit the city.", 
    "review_date": "2014-05-05"
  }, 
  "-lqBTASZsEfF9A9iZ8Yu4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Collin C.", 
    "review_text": "This place (Fig &amp; Thistle) is the fuckin TITS!! An insane selection of wine and beer, complimented by a trio-selection of cheese dishes. The bathroom: modern, urban sleek black brick-tile decor with floral influence = cozy and pleasant. Also, real friggin hand-towels in the bathroom... NO paper towel waste from overuse by drunk folk; NO loud hand dryer that dries out your cuticles... Hand towels ppl. Enjoy!!", 
    "review_date": "2013-09-19"
  }, 
  "ubLk5i03a3v5_HnmSCJUXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew L.", 
    "review_text": "Fig &amp; Thistle sets a standard for small, homey bars and would make a perfect night for a date. Seriously though, the interior is perfectly crafted and is very intimate while at the same time the staff knows there stuff. They have a very very well curated selection of wine and beers as well as a rotating list of small plates, which are all very reasonably priced. Do yourself a favor and impress your date by taking them here and you won't regret it!", 
    "review_date": "2013-07-10"
  }, 
  "ekUx1Y39k7lpWkR37LBiNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "V V.", 
    "review_text": "This is my new FAVORITE wine bar. Terrific selection of wine and very reasonably-priced beer selection. Love their champagne cocktails too.   The servers are knowledgeable, attentive, and super nice. They never make you feel like you're doing them a favor by being there. They'll spend time actually helping you find a wine you'll like.   Love the chill atmosphere and the decor. How can you go wrong with a bunk bed and beautiful dark wood? The place is warm, inviting, and elegant without being pretentious. Terrific date spot and location couldn't be better. I'm quickly becoming a regular!", 
    "review_date": "2013-08-04"
  }, 
  "qCrAu3LAbj4zkDYVST2efQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine B.", 
    "review_text": "This place is brand new in the hip Hayes valley neighborhood. Tucked away in a little side street on the bottom floor of a classic San Francisco Victorian.   Wonderful wine list and amazing service (Fran from pause/yield is here!)", 
    "review_date": "2013-06-01"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Whenever I am in Hayes Valley, the name reminds me of Napa Valley.  I picture doses of small, wine vineyards or something along the lines of that sort.  Hayes Valley is a mini, cozy district, where there are hidden restaurants that is awaiting to be explored by simply walking in between discrete alleyways and going about.  Located in the middle of an alley, Fig &amp; Thistle proves to be just that.  It is mellow on the outside and a great place to hide out from the main crowd if you are seeking a low key wine shop.  The inside is like an indoors patio lounge and there is some sort of charming feel to it.  They have a good variety on wine and some petite cheese, fruit, cured meat and cracker tidbits to order up and go along with it.  You just have to venture in to Fig &amp; Thistle to see what I'm chattering up about.", 
    "review_date": "2013-09-07"
  }, 
  "Mnc4UxKdlr9J0VSic9mpFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seghel Y.", 
    "review_text": "The beer and cheese plate special for $10 is so yummy!", 
    "review_date": "2013-07-06"
  }, 
  "YuGgcM5Es9wSfAzRknAaww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherlyn M.", 
    "review_text": "I finally paid a visit to this lovely bar and it did not disappoint.  The ambiance is casual and classy and it's a great place to go for a drink after work with friends (like I did) or for pre or post-dinner drinks if you're in the Hayes Valley area.  The owners (Nguey &amp; Angel) are fantastic and did such a great job with the space!  I love the bunk bed and the mix of high and low tables - so fab :)   The wine selection here is excellent - great mix of everything - red, white, rose, bubbles.  Also, the service is top notch - we loved the bartender!  She is so nice!. Snacks are yummy.  I mean, what more can you ask for in a wine bar?    My friends and I will be making this a regular spot on our drinking list.  You should too :P", 
    "review_date": "2014-02-15"
  }, 
  "ksZDfuMT7Pk51WFax981Pw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Myles J.", 
    "review_text": "my friends and i were walking around hayes valley after a day filled with delicious sf goodies. we were looking for a nice little bar to relax for a bit, and we stumbled upon fig &amp; thistle. the wine list, although short, offered a wide range of selections. we got the cheapest bottle \"matchbox\" ($32) and posted up on a little bench with comfy cushions. the wait staff was extremely friendly and helpful and helped us pick the wine by letting us all taste it. the atmosphere was warm, quiet, and inviting. my friends and i want to live here!", 
    "review_date": "2013-09-15"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "At first thought for my second return was... well, damnit if this place isn't one of my favorite places in the city that's top of mind but will be overwhelmed spilling out the door. Instead... Wednesday night my favorite place was exactly what I wanted. Rose. Close friends. The room's din at a level where we can hear each other. Imagine that. Real people. Talking. Face to face. Who knew!", 
    "review_date": "2013-11-06"
  }, 
  "D-p_7WVdlyGUE3XFsTt8YQ": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Candice H.", 
    "review_text": "Cute small wine bar.  Didn't see any food menu, just beverages at the time we went.  Definitely a place to try and see if it is your style, but would prefer other wine bars in Hayes Valley with cocktails.", 
    "review_date": "2013-10-28"
  }, 
  "2h1B3IUp1TejELkxfffEkg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Giselle B.", 
    "review_text": "Love that there's a new little wine bar in the neighborhood. We went there last week to check it out. It's small &amp; intimate which is nice but the place is super loud. Most of the patrons were drinking beer, not a lot of people drinking wine. The staff was nice but after one drink we had to leave due to the noise level and headed over to Noir Lounge which is not noisy at all.   Advice to owners, get some fabric draperies or something that will better absorb the sound. The concrete &amp; wood design is overplayed in SF &amp; the effect is high noise levels.", 
    "review_date": "2014-07-21"
  }, 
  "nVz8UFFUCQSzTyWi5yXLbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sebastian V.", 
    "review_text": "I love this little bar. It's more then a bar, it's a destination, a gathering. Ideal to bring a date or friends or meet complete strangers, Fig and Thistle offers superb service in a cozy and elegant setting. The selection of beverages is well crafted with a great variety of Californian (&amp; occasionally Oregon) wines and beers.", 
    "review_date": "2013-11-13"
  }, 
  "hvA4tVC-TCzbwCTAt4wjeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David H.", 
    "review_text": "Very small with a limited selection might be bad things elsewhere but here they are an advantage. Very personalized service in a cute, cosy and inviting space. Just lovely, if a little expensive.", 
    "review_date": "2014-05-24"
  }, 
  "m7ulbgBB7Z-0STPpBMiOuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B. Y.", 
    "review_text": "Great neighborhood wine bar.  Very cozy - love the bunk bed seating on one side.  Wish they had more selection in terms of wines, though.  Also, loved that my grenache was \"on tap\" and therefore chilled to perfection.  The bottles they had out were a little warm.", 
    "review_date": "2014-05-12"
  }, 
  "WfbuXOSUGmFksyFvFEs95g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marianne A.", 
    "review_text": "Super cute spot for wine in Hayes!  The bartenders are really friendly and make great drink recommendations. Ambiance is chic casual, great for a date or a friend but not groups. The price points are comparable to other wine bars in the city, so on the pricey side but that's just wine in SF. They have a lot of quirky wines I haven't seen elsewhere, so fun to try new stuff here.  The one downside is that it's super small, so usually hard to find a spot to sit, and not big enough bar to stand by.", 
    "review_date": "2014-05-01"
  }, 
  "u_tsaDmAgGnmOUGdbA2tNg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Racquel N.", 
    "review_text": "Hayes Valley has a new gem. Hidden away in one of its little streets, Fig &amp; Thistle offers a quiet space for you to enjoy a glass of wine and a few nibbles. It's a friendly, intimate wine bar that seats about 20, making it perfect for small groups or a solo trip. Angel and Francesca are warm and welcoming, and are eager to help you find a wine to your liking.   They set me up with a dry riesling that was crisp and sweet without that over-honeyed taste. It went perfectly with the cheese platter that I ordered, which had a generous slice of truffle goat cheese, mini-baguette slices, almonds, fig jam, and thinly sliced apple. They have a pretty good beer selection as well.  It's a very simple set-up, but one that has obviously been done with a lot of love and it shows. Fig &amp; Thistle is delightful, charming and is a wonderful addition to the neighborhood.", 
    "review_date": "2013-06-05"
  }, 
  "BuFqet66kcFaI0viNdcvMw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel K.", 
    "review_text": "So adorable, helpful staff and incredibly fun. I highly recommend the cheese platter :)", 
    "review_date": "2014-02-05"
  }, 
  "9d9kgq7womnxi_NGKsJMEA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Frank J.", 
    "review_text": "A really nice addition to the neighborhood. A small wine bar right next to the new construction being built on Ivy - might be a little easy to miss if you are not looking for it. The staff is very welcoming and the owner is extremely nice. It is a small space so on a busy night I am sure that it will get a bit crowded. The wine and beer selection was limited for opening night, but good quality, so as they continue to operate I am sure that they will have more options to choose from.  Definitely a place to check out if you are in the area and grab a drink or two.", 
    "review_date": "2013-06-02"
  }, 
  "qqKddLtLxbPnTf6c7yqS3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "around town e.", 
    "review_text": "Hiding behind an alley way on hayes straight...this place is a great place run by two rad owners.  Great selection of wine complimented by a nice cheese plate.    Addendum: have gone two other times and just as great of an experience.", 
    "review_date": "2013-06-30"
  }, 
  "6tvWRIAmRIXFAd4j-z_u7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tarah O.", 
    "review_text": "Great new addition to the neighborhood! Angel the owner is very educated, the wine selection is great and the pairing was perfect! Sweet atmosphere, clean and elegant design. Kudos!", 
    "review_date": "2013-06-11"
  }, 
  "LVcYNLGkb44VfIeQCK9tDQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "John L.", 
    "review_text": "Very cool ambiance - small intimate wine bar with good selection of beer and wine. Place probably holds 30 to 40 people and we went on weekday so it was great.", 
    "review_date": "2014-05-07"
  }, 
  "CDtbuyJBYyDT21lJMod6OA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kitty O.", 
    "review_text": "I was excited to try this place, but the hype I heard over the grapevine was over done I think...  Interior is boring, artwork on the walls was laughable (sorry my peeps and I are all art school grads, we couldn't help critiquing it...), and it was TOO BRIGHT for an intimate little bar.  Wine and beer selection... you can find something similar at way more ambient and cozier craft beer/wine bars...   If I was to hang here with a friend... it's alright, but the experience as a whole was just so meh... boring.", 
    "review_date": "2013-08-07"
  }, 
  "5YMCOtIk__0Pp7IqQZ4FPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Winnie T.", 
    "review_text": "Cute and cozy wine/beer spot tucked away. The place looks like a converted house and there's even a bunk bed inside.   I love the intimate feel to the place but the tables are too big for couples to really get close. My friend and I felt like there was a lot of distance between us. Make a move for the bottom bunk that's been converted into a bench if you want to be able to cozy up after a couple glasses of wine.   Wine selection is great!", 
    "review_date": "2014-11-10"
  }, 
  "2Uk2uycFxJlP0yqWNpgtGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Uly J.", 
    "review_text": "Fig &amp; Thistle is a hidden jewelbox of a bar.   The focal point is a well-chosen, if esoteric, wine and beer selection, made accessible by the charming staff and good prices. Tasteful appointments, a cozy atmosphere, and a down-to-earth crowd round out the experience.    It feels like a locals' bar, but caters to a surprisingly diverse set of SFers.   For a clean new venue, it has a disarming patina that evokes 'lived-in mountain retreat meets seaside speakeasy.' Redwood tables and iron fixtures mix with sodium lights and denim drapes.   If you're in the area, it's the perfect place to drop in for a spot (say, before or after a performance at the symphony), but the conversation and charming balance of sophistication and warmth may just keep you all evening.", 
    "review_date": "2013-07-02"
  }, 
  "6TMrfAI26FK3JKULW6K5oA": {
    "user_rating": 4.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Debra P.", 
    "review_text": "Rotating wine and beer menu? I'm in. Rose was delicious! I can't wait to see what they have next. It's super cute, cozy and quaint there. The seats are uncomfortable though, only complaint.", 
    "review_date": "2013-08-20"
  }, 
  "vlAFcJnCSwvPjO1tn_oxFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara K.", 
    "review_text": "We were searching tirelessly to find a place to host a baby shower for about 20 people that wouldn't depend on the weather and wouldn't cost thousands of dollars, and as we almost lost all hope, we came upon Fig &amp; Thistle. By now you know where it is and that it is cute and casual, but what you may not know is it's perfect for a smaller private event! We ended up with about 15 people, the space was perfect, bright during the day and the owner was SO nice and accommodating, let's just say the mom-to-be was in tears over how wonderful it all was. I highly recommend this place for the after work drink (it can get a little busy, but where isn't in SF these days?), or weekend wine and cheese, or for a private party if they're available. I'd absolutely host my next event there without doubt!!", 
    "review_date": "2014-04-16"
  }, 
  "hTsLsZfkfcoBPrbPxuodig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake P.", 
    "review_text": "Hayes Valley just keeps getting better! Fig &amp; Thistle is a boutique wine bar with excellent beers &amp; cheese plates. Rustic wooden bar &amp; tables &amp; a fun bunk-bed to sit in while sipping on your choice beverage. Staff was very accommodating too.. Close to my work, even better;)", 
    "review_date": "2013-06-29"
  }, 
  "04JttCeiTpGmy-7XJtn2Gw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin O.", 
    "review_text": "My new favorite wine/beer spot in Hayes Valley. The place is essentially in alley and has a bit of a hidden gem feel to it as it is never too crowded, but is never empty.  The beer and wine menu is very tight and well pulled together. A nice selection of fine varietals to choose from, you'll always be able to fine a glass of vino to please you. For brews, they do a great job getting some small production beers so it's a treat to peruse the list. You'll be able to easily find a cerveza to quench your post work thirst.", 
    "review_date": "2013-10-25"
  }, 
  "OnFl0tfH-6BcFNYH-2uyXw": {
    "user_rating": 3.0, 
    "user_location": "Civic Center/Tenderloin, San Francisco, CA", 
    "user_name": "Fung S. O.", 
    "review_text": "We swinged by first time on a Saturday night when it just opened up. Totally cozy and it was almost empty with a couple tables filled only. BUT, it wasn't a bad thing! the cozy atmosphere was supposed to go with that kind of crowd with that kind of music. It's just a space you supposed to feel hidden and cozy, and thus the small street it resides on. And the beer selection was great too.  But would have given a 5 star just for the decor. .   Came back couple weeks later, apparently the place had become the most happening place around. And you can hardly find any space to even stand. Filled with people, loud shouting and loud music. People are hanging out at the staircase, and the streets as there are already no space inside. The friend whom I wanted to show the place to thought I brought her to a frat party. Well, it was that kind of crowd with that kind of music.   I felt it is a great thing for the business that they are doing well. But I hope they can keep to the vision and character that first inspire them to open the spot. With the decor you have got, this can't have been what you intend for.", 
    "review_date": "2013-11-16"
  }, 
  "wrhOaPospStRs5q15ot4bA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Joshua B.", 
    "review_text": "Tiny little wine &amp; beer bar hidden in what feels like an alley (but I'm told is Ivy Street) in Hayes Valley.  Place is pretty cute on the inside with the converted \"bunk bed\" and the other dark wood tables and long bench seating against the other wall.  Went here at around 5pm to meet/catch up with a colleague of mine - had no problem getting a table by the window.  Wine and beer list is tightly \"curated\" so you're not going to find a huge selection - but there was plenty of variety for my taste and I enjoyed the rhone blend that I had. Also shared a plate of cheese, bread and fruit which was tasty - especially the cheeses which they rotate through various producers.  Would definitely go back again to grab a drink with friends.", 
    "review_date": "2013-11-15"
  }
}