{
  "s5XJsJNNI944pvNKsb_OeA": {
    "user_rating": 4.0, 
    "user_location": "Carmel Valley Village, CA", 
    "user_name": "George C.", 
    "review_text": "This is a traditional S.F. Italian restaurant. I come here for the real feel and taste of North Beach. This is a new location for them. They had a severe fire at the old place. I had my favorite hamburger sandwich for lunch; about a pound of delicious burger between two big pieces of sourdough bread, cut in half. Add your own fixings. If it was dinner time, I would have had the veal piccata. Love it. Drop by and give them a new send off. Oh, I forgot. They are now located where the Old San Remo restaurant used to be.  San Remo was one of my all time favorites as a kid. My parents brought me here all the time. Great place, great location, lot's of memories. The new location for Fior D'Italia works as both are real North Beach Icons. Trust me, you'll love the place, the food and the service.", 
    "review_date": "2013-01-26"
  }, 
  "56m6H1yIfMqGJMN5cNe-TA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jessica c.", 
    "review_text": "To sum it up this is not authentic Italian food so i'd suggest you just go to The Original Joe's  They don't serve their pasta family style which is.... oddd when at an AUTHENTIC Italian place.  Steak was overcooked.  Pasta was dry.  No one came and checked on us so we didn't get the opportunity to inform them that the steak was well done and not medium.  i'm always willing to pay top dollar for great food but the service was horrible and i guess i shouldn't have been surprised by the amount of tourist there.", 
    "review_date": "2014-01-29"
  }, 
  "OhYHYsIaKtHqJAPUHB9Ifw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "P S.", 
    "review_text": "Came back this evening and WOW!  What a great experience.  Had the chicken pesto with sun dried tomatoes and it was amazing. Others at my table had the veal, salmon and steak and everyone's meal was fantastic.  I don't know why others have given bad reviews. Perhaps the place was just reopening and had some stumbles but go back and give it a second chance.   Had the chocolate mouse for dessert and it was perfect.   This is now my favorite North Beach restaurant, the staff are extremely helpful and welcoming. They remembered me from the last time I came and even remembered what I had ordered. This is definitely a family establishment and I now feel like part of the family.  Great food, services, and ambiance. What more can I saw", 
    "review_date": "2013-01-27"
  }, 
  "b6FQC-NpY6rHDu4ND0chMQ": {
    "user_rating": 5.0, 
    "user_location": "Fairfax Station, VA", 
    "user_name": "Sandra M.", 
    "review_text": "This is the best Italian restaurant I've been to. They accommodated us even though we did not have a reservation. The food was very authentically Italian, and the service was better than excellent.  The owner, Lucio made an effort to speak to each table individually, and to make all of his guests feel at home. I now understand how the oldest Italian restaurant in the United States is still thriving.", 
    "review_date": "2014-05-17"
  }, 
  "c4mkYDTjJc-_lOM32YaPPQ": {
    "user_rating": 5.0, 
    "user_location": "Decatur, GA", 
    "user_name": "Nicole A.", 
    "review_text": "I brought my family (visiting California) here for lunch on a weekend - there was no one in there!  The decor was very nice, made me fear for much higher prices than we found (though it was lunch).   The food is very good - relatively authentic, rather than Olive Garden-style Americanized-Italian.  I had the pumpkin ravioli, and they were excellent.  The lunch servings were a good size; our plates were empty at the end, but we didn't leave hungry.  My family was very impressed by this place - while they ate at other Italian places while in California, they said this was the best meal they had and a highlight of the trip.", 
    "review_date": "2013-07-01"
  }, 
  "YetZf3si95tfvy3uoh360A": {
    "user_rating": 5.0, 
    "user_location": "Shoreline, WA", 
    "user_name": "Natasha M.", 
    "review_text": "Service was great, food was delicious. Very accommodating to my kids. The live music was a really nice touch. Loved it!", 
    "review_date": "2014-04-29"
  }, 
  "RXfdydazH--y8v6D4Iy9XQ": {
    "user_rating": 5.0, 
    "user_location": "Corrales, NM", 
    "user_name": "Randy L.", 
    "review_text": "What a gem to find amongst all the alternatives. Such a wonderful atmosphere with great food. We travelled with 3 couples and traded off selecting where to eat. We had already dined at 4 fantastic restraunts and the pressure was on me to select something to top them all. Well this place did not disappoint!!!  And I found it on YELP so thanks to you all for your reviews.", 
    "review_date": "2014-06-07"
  }, 
  "dm2VCR5rvPAzxh0Yum0swQ": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jonny B.", 
    "review_text": "I went to this restaurant on 2 Jan 2013 (wednesday night) with 11 people (my wife's and I families). This was my first time along with my family, however my wife's family has been here plenty of times before with good reviews. I called a week prior to make reservations with the manager and he insisted that we would be able to be seated in a \"somewhat\" excluded room that usually fits a party of 12. Once arriving to the restaurant the tables were set up in the middle of the restaurant and no one knew about the reservation for the side room. The employees stated that it would've been too small for our party of 11. I was thought to myself well why was it offered? To include non of us are on the hefty side. To make things easier I agreed and sat where the tables have been set up.   The next issue we had was that we ordered 3 different appetizers (1 of each) and they must've assumed that we wanted 3 of each. They kept saying \"we will take care of you.\"  The appetizers were WAY more than enough and went to waste where they just pulled it away and never asked if we wanted to save it. Afterwards I asked if the appetizers served were 1 or 3 servings of each, where they answered 3 and caused us to be dumbfounded since no one ordered 3 of each.  However I feel no one complained due to the fact that two different families were still trying to get to know each other. On a good note the Calamari in Cesta and Salmone in Carpione were excellent dishes, however the Gamberoni allo Spiedo in Pancetta was very salty where we had shrimp left over.   The last issue here was a miscommunication. We asked the newly young if we were able to have a couple wine glasses. He states \"we can take care of you\" so he wraps 4 glasses, and quickly puts them in a bag and I said \"thanks!\" He seemed busy so he went straight to the register while I gave him a \"bye\" wave and said thanks again while walking off (he said nothing nor tried to stop me). Half the party slowly exiting he hands a receipt to one of my in laws saying \"heres the receipt\" and in law replies \"thanks\" and starts walking off. The manger replies \"someone needs to pay for the glasses.\" Once again confused, the in law hands me the receipt and I pay for that after spending $600 for dinner which I thought was complimentary.   I do have to admit my chicken breast was cooked very well, however the in laws said the food was mediocre compared to before the new ownership and the menu is half of what it was before. Just my 2 cents.", 
    "review_date": "2013-01-16"
  }, 
  "P5eH3XZdl4pLcpmJSA1qww": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Tiff A.", 
    "review_text": "LOVED EVERYTHING!!  Great food, great service, great atmosphere.", 
    "review_date": "2014-09-29"
  }, 
  "gD9a4wXND51R3c9lpbf_Lg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott L.", 
    "review_text": "I went for lunch with my wife and some friends. I was told a few of the reviews mentioned that they had excellent Osso Buco. Problem was that's only offered for dinner my bad for not confirming and looking at the menu myself. I ended up having a burger, which wasn't really all that good. Having a burger at an Italian joint is probably some sort of crime and I'm just having to pay for my crime by having to eat a bad burger. My wife had the Monte Cristo and it sounds like it was slightly better (maybe three star). It was still a disappointment considering all the good Italian Restaurants in the area. I won't feel the need to go back. Cafe Macaroni still remains my favorite in the area even with the funny name.", 
    "review_date": "2014-12-24"
  }, 
  "76wF5ee5p9bAMgbhpwHeLA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michael L.", 
    "review_text": "Came here on a busy Saturday night in a party of 8.  Our server was fantastic...  There was a dining room with a party of 75 and he recommended that we get our order in before them to avoid delays.  This wasn't a rush tactic - with 2 children in our party the last thing you want is a delay in the food.  All aspects of service were good.  In terms of appetizers, we had the fried calamari.  It was done perfectly with just a light batter and good seasoning.  Someone in our party ordered a veal dish and our server actually came back afterwards and apologized for the small serving, took it away, and came back with a new dish that had an additional medallion.  Granted, the servings was still on the small side but it was a nice gesture.  I had the seafood pasta special.  Lots of seafood (clams, mussels, shrimp, bay scallops), pasta done just right, and the cream sauce was perfect.  I also had the opportunity to try the black risotto and it was cooked perfectly..  It was a little pricey but I'd come back again to explore more of the menu.", 
    "review_date": "2013-12-10"
  }, 
  "SEa4GAiJRsHPfAZeaL7XDQ": {
    "user_rating": 4.0, 
    "user_location": "Scotts Valley, CA", 
    "user_name": "Buba M.", 
    "review_text": "We were a party of six that were in town for the day and looking forward to a nice italian dinner.  We were driving around North Beach on a Saturday night looking for parking - dumb!  We were just about ready to give up when we drove by Fior D'Italia and noticed they had valet parking for $9/per car.  We were hungry and tired of driving around so it worked for us.  We checked out the menu and it looked great - and they were able to accommodate the six of us with no reservation around 8pm.  Several of us had the house salad (a little bland, $7) and I had the minestrone soup (very tasty and not too watery, $7).  The french bread served was warm and delicious.  Following are the entrees we ordered:  Lasagna (good, a little bland $14) Bucatini Amatriciana (requested linguini instead of spaghetti and the dish was very tasty! $14) Tenette al Pesto (very tasty, $14) Veal Chop (huge, very tasty, $36)  Cocktails ordered were gin martinis (made perfectly) and house red wine.  No desserts ordered as we were tired and didn't want to extend the evening longer.  It did take quite a long time to receive our entrees after the apps and they didn't have a full house, but, oh well.  Overall, our dinner was nice.  The prices were very reasonable and the ambiance was great.  We'll try other restaurants in the area before we come back, only because there are so many other options.  But we will be back some day", 
    "review_date": "2013-06-04"
  }, 
  "nR1vilPzSphe6fYW6ckXmw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Greg C.", 
    "review_text": "Just got into town. This place is charming.  The chicken with prosciutto and fontina cheese was delicious.   As we were walking in another Patron was leaving and said he was in restaurant business.  And that this place was delicious and reasonably priced. He was right.  Waiter was very friendly and professional  I would come back.", 
    "review_date": "2015-01-03"
  }, 
  "2df2el0XrwUmSHdz9iEF7Q": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Leza M.", 
    "review_text": "The oldest Italian in America we are told circa 1886.  Good food and service.  I had the catch of the day which was DELICIOUS.  This is the first time I've ever been to an Italian restaurant when I didn't order pasta.  It's a wonderful white table cloth quaint place.", 
    "review_date": "2013-08-26"
  }, 
  "wQjwszAYtjt9-prktyCtzg": {
    "user_rating": 5.0, 
    "user_location": "Oakhurst, CA", 
    "user_name": "Martha V.", 
    "review_text": "We have been patrons of Fior d'Italia for many years, my husband for over 30 years and myself for about 15.  We visit this treasure every time we visit the city and are always greeted as if we are family.  We recently introduced my brother to the restaurant and he now is also a fan.  The employees make us feel welcome and appreciated, and the food is authentic and delicious.  We started with a prosciutto wrapped shrimp appetizer and continued on through a delicious cesar salad.  Our entrees consisted of 2 veal entrees, the fruitti de mare and a side of the best fettuccini alfredo I've ever had. Unfortunately, we had no room for desert. They have a nice wine list with a good selection in all price ranges. There is a reason we visit Fior d'Italia at least once every time we are in SF, it consistently exceeds our expectations and we always leave with full tummies and big smiles.", 
    "review_date": "2013-03-05"
  }, 
  "xT0xDFsG81gLzDZeDgPmeQ": {
    "user_rating": 2.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Julia B.", 
    "review_text": "I'm so sad....after years of coming here when we come to SF for the holidays I don't think we will be returning. In the past, we always knew what to expect - spotty service but fairly consistent food. You go here because its a tradition and old school. We knew they had closed and re-opened with new owners so we were hopeful - however the first bummer was the plastic label from the soda gun for Root Beer that was floating in my daughter's soda and the second bummer was the big piece of thick clear plastic that was in the middle of her bolognese. Of course, they didn't charge us for the bolognese and offered dessert on the house which was very nice and we could tell that our server was trying his best. The kids ordered the cannoli and that was not good either - and that means it must have been really bad because my kids don't turn down dessert easily. So to sum it up, I'm sad to lose our tradition but in a town with many great Italian options I'm sure we can start a new one!", 
    "review_date": "2013-01-02"
  }, 
  "1wCNjmyXUH2qv-4mg2419g": {
    "user_rating": 1.0, 
    "user_location": "Stinson Beach, CA", 
    "user_name": "Fai K.", 
    "review_text": "Over priced, both undercooked (the lamb) and overcooked (the potatoes) food. Waiter was nice and professional, but a bit harried (it was Saturday evening and the place was packed). The dish was not seasoned at all and tasted bland and boring. I recommend to give this place a miss and leave it to the tourists who do not know better.", 
    "review_date": "2014-08-03"
  }, 
  "aMBkcgtRHVu2AnRczmtmAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara T.", 
    "review_text": "This place is exactly what it bills itself as - a great old school Italian joint. It's the type of place you walk into and they know your name and drink order. The bartenders and servers are all extremely friendly and love to make suggestions. Lots of good Italian food in the area, but Fior's stands out for the quality of their food and the ambiance. Get the Bucatini Amatriciana - perfect amount of spice for a pasta dish.", 
    "review_date": "2013-02-26"
  }, 
  "w_Qf4Wz0JykrYJx5mHWBag": {
    "user_rating": 4.0, 
    "user_location": "El Granada, CA", 
    "user_name": "Drew M.", 
    "review_text": "This was a walk by decision.  Nothing to complain about.  Our server and the staff were all very nice, professional and attentive.  My wife and I both had pasta dishes and both were tasty, good size portions and well prepared.  We did have cocktails and they were a generous pour.    Relaxing and delightful atmosphere.  I don't think I would make a special trip in San Francisco, but I would go back if in the area.", 
    "review_date": "2014-07-19"
  }, 
  "c4bNOJ5XnKKoHJoQE4zrcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber M.", 
    "review_text": "I was so excited this place finally opened back up! They have an amazing happy hour, 50% the bar menu and drinks (I can't remember if its the specialty drinks or well drinks?). We have only been for happy hour and have never been disappointed! The mixed greens salad on the bar menu is very hearty with salumi and cheese more than greens! The Capri cocktail was fantastic, although I was a little sad they buy their lemoncello instead of making it. The meatballs are a must try on the bar menu, the sauce is amazing. The bartender is always friendly &amp; chatty!", 
    "review_date": "2013-02-20"
  }, 
  "m3z-8J-XSZ3uXn8CHXaI7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Desiree P.", 
    "review_text": "I was so excited to go on my date here. It's one of those places I've passed a million times, but for some odd reason, never went in.   Last night upon arriving we were instantly sucked in to the fun vibe of the bar area. Everyone was glued to the tv as some guy was tight rope walking across the Grand Canyon. Hilariously bad jokes were made, but the staff and patrons were all in on it for good natured fun.   We then got our table on the restaurant side. They let us choose from a window seat or booth. We loved we had the choice and opted for the booth.   There are fresh cut roses on every table. That was a nice touch.   Our waiter was super friendly and walked us through the different dishes and sauces as they have a bunch of appetizers and entrees I wasn't familiar with.   We got the roasted peppers with anchovy cream sauce, shared a mixed green salad, bf got lasagna and I had the beef bolognese pasta. It was all delicious and fresh. The portions were generous too--we had plenty to take home.   The timing of the meal was perfect too. Glad we did date night here with howaboutwe idea as we will definitely come back as we are most pleasantly surprised at the charm of the restaurant and the fun nature of the bar area. It caters to both casual and elegant dining.", 
    "review_date": "2013-06-24"
  }, 
  "ccrP195iAGLrua4KI4cXfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noah F.", 
    "review_text": "This is a great spot with an excellent bar! Staff was friendly and very accommodating.", 
    "review_date": "2014-04-02"
  }, 
  "_MdnsXCXAb8u_spzqmMayw": {
    "user_rating": 1.0, 
    "user_location": "Rancho Cucamonga, CA", 
    "user_name": "Neal S.", 
    "review_text": "After looking at reviews I thought this place would be a great place to celebrate my wife's 35th bday. However we are not pleased with this place.  SERVICE::We sat down and it seems that we were not wanted there. My wife is Mexican and I am Indian so I hope it's not because of race. Anyhow, we wanted bread and saw that everyone has a basket. We waited for 22 mins and no bread showed up. I asked politely if we could have some from another server.  Bread came out 5 mins later. Now waiting is not the bad part. Our main server had stated that I demanded bread and he didn't want to deal with me. That got me upset because I was polite. I asked to speak to a manager so we could leave. The manager was nothing but respectful and polite and offered to pay for the apps and drinks we ordered. and he asked if he could take care of us. We were uncomfortable and I just asked if we could pay and leave.  He would not let me pay. Very nice of him. FOOD:: Salad was overdressed and salty. The melons were not ripe. The soup was very bland. Even though we could not try the main course. What we did eat was not worth the trip.", 
    "review_date": "2014-07-13"
  }, 
  "T5_fCbNOLoiXAJsIgyJJPg": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Danika F.", 
    "review_text": "I came here about a month ago with my mom for dinner.  We arrived and it was mostly empty but a nice looking place overall.  We ordered drinks, an appetizer and dinner and everything was really good.  After dinner we got the bill and informed our server that we had a half-off coupon from Half Off TV. We were told that they could no longer accept those because ownership of the restaurant had changed and the new owner was not accepting them.  WOW! what a load of cr*p! There is no expiration  date on the voucher nor does it specify that it would be void if ownership changes.  On top of it all we spoke with the general manager who offered to give us 15% off our bill.  Gee thanks, but no thanks. Unfortunately we will NEVER go here again.  They should have honored our coupon considering how much money we spent and we also would have returned many times.", 
    "review_date": "2013-09-24"
  }, 
  "vPiN6vv1Feayr48hI5mM2Q": {
    "user_rating": 5.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Andrew M.", 
    "review_text": "i went here with my girlfriend and some friends on a Saturday night and i must say the restaurant was packed and cracking! i think they had a huge party in the back and the main dining room was completely full--the atmosphere was really lively and festive (i swear there was a table of diners all dressed like santa right next to us!) My girlfriend and her friend loved their pear cocktail (i cant remember the name) and the calamari appetizer was hella good. the bread was crazzzy good lol i think we asked for too many extra baskets but the busboy didnt seem to mind. i got a perfectly cooked rack of lamb - delish.  my lady got the tutto mare pasta and i couldnt stop dipping my bread in her sauce...she kept getting mad at me! AND i really dont even like seafood! anyways i was too full for desert but the girls shared one and i swear that it looked like some food network/ Picasso type stuff (artsy) and they liked it. We had a couple more drinks at the beautiful bar after dinner and had some good convos with the locals and this really chill bartender who's name was Nino i believe. I usually dont even eat Italian out unless my grandma makes it...but this place really was on that level! ima fasho come back", 
    "review_date": "2013-12-15"
  }, 
  "bRGNQX5BbcJaCcfamPdexg": {
    "user_rating": 1.0, 
    "user_location": "Corona, CA", 
    "user_name": "Noah W.", 
    "review_text": "WOW!! Never ever go here for Thanksgiving Dinner. Food was horrible. This was my parties first time going here and the waiter definitely recommended that we get the thanksgiving dinner which was 50 dollars per person. Worst decision! Had a group of seven and we each paid around 87 dollars (tip included because we had 7 people but definitely did not deserve tip).   Food 1.5/5: The food consisted of a halibut cake appetizer, pumpkin ravioli, turkey, and pumpkin pie. From reading the menu and reviews, I expected a better menu or more choices. However, our waiter told us that this was the food to get.   The meal began with a big piece of bread. Who doesn't like bread? But the problem was they gave us a huge piece of bread and did not tend to our order until literally 45minutes later. By the time, I got my meal I was already half full from the bread. We asked our waiter on multiple occasions that we were ready to order. Around the 20minute mark we flagged him again but he said \"No, you finish your bread and I will come back later.\" Although it was taken as a joke and their were really short laughs, he literally left our table and didn't take our order. We felt that this was very rude when we were hungry. Finally, after flagging him down again, he took our orders.   The halibut cake was just a simple deep-fried fish dish. Nothing amazing, I rather order another appetizer than eat this. Very plain tasting.  Pumpkin Ravioli: oh wow, never ate something so horrible in my life.  Basically ravioli with pumpkin filling. The taste was horrible. I love pumpkin but this seriously did not suit my taste. Basically eating pumpkin pie but worst because its in a ravioli dish. Literally, no one finished their 4 pieces of ravioli.   Turkey meal: Usually turkey is hard to cook so I will give them credit for making it edible. But nothing special. Just simple turkey with gravy.   Pumpkin Pie: Once again, just a simple pie you can buy at costco or make yourself.  Service 0/5: As mention before, waiter was horrible. The waiter also did not know anything about their wine menu. We asked him which one he recommended. His answer was \"they are all good.\" He also had to come back multiple times because he did not know which wine we ordered (almost gave us the 400 dollar wine). We also spent a total of 2.5 hours at the restaurant. Not because we were having a good time but because our food would not come out. Felt like Food hell. I was literally fighting to finish my food.  However, one thing to note is that we never tried their other food so this restaurant might actually be good but based upon our first experience, we will never go to this restaurant again.", 
    "review_date": "2014-11-27"
  }, 
  "GoxjwCFdXRun4LpP5Igy5g": {
    "user_rating": 5.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Debbie M.", 
    "review_text": "This is the best place to have gnocchi's! This is always our first restaurant when we come to SF! Thank you for always keeping your food &amp; service always consistent.", 
    "review_date": "2014-06-01"
  }, 
  "pfGb5X4S5C8IGc4LcOP5VA": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Geoff H.", 
    "review_text": "Restaurant is charming and really nice inside - feels like a typical old Italian restaurant with lots of character. The wine list is nothing to write home about - actually pretty lazy, lots of Safeway bottles - but you could find something for everyone. My wife had the pumpkin ravioli, which she said was fine, but lacking salt and seasoning. I ordered the quail stuffed with sage and sausage. Big portions of the sausage looked underdone, if not raw, and the texture only confirmed my suspicion. It was bright pink, unlike the rest of the (cooked) sausage. I left it on the side of my plate - it was too sage-y, and I didn't really want more, so I wasn't going to complain. The waiter, when clearing our plates, asked if everything was OK, and I said that actually the sausage was underdone. He took the plate, and returned a moment later saying the Chef had checked it out, and everything was as it should be - the sausage was supposed to be that color, and it was only the dim lighting in the dining room that made it appear otherwise.   I actually found this pretty insulting. First of all, the customer is always right. Second, that sausage was seriously underdone. There was no question; it looked raw, and the texture of it was underdone. Third, it was still broad daylight outside, and the dining room was not *that* dimly lit. Fourth, sausage is not \"two-tone\" in color. If the Chef can't tell the difference, he's an idiot and should be fired. If he refuses to admit his mistake, that's just a food poisoning lawsuit waiting to happen. I didn't even want anything in return - no comp on the bill, no free dessert - I just wanted him to admit it was raw. If the winelist was amazing, or the other stuff on the menu was great, I'd consider returning and ordering differently, but since nobody in our party was thrilled with what they got, I see no reason to go back.", 
    "review_date": "2014-04-21"
  }, 
  "5o80NhNXzPwb4EcWAdjiqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dmitry K.", 
    "review_text": "My favorite place!!!  I feel like I'm at home!  EVERYONE that works here is as friendly as apple pie!!!  The happy hour from 4-7 pm is awesome! Great food and drinks!  Cheap especially  for the quality of the food!!!  Great service!!!  I cannot say enough good things about his Fior!!!!  Just come by and you will alway return :)", 
    "review_date": "2014-04-21"
  }, 
  "umsytAFtFphEQeomY_Oo4Q": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Theodore H.", 
    "review_text": "A very friendly restaurant with lots of history.    We ordered a Linguine with white clam sauce and we were not satisfied with the sauce, it came too dry, not creamy enough.  The waitress took the plate away and talked to the manager.  The manager came over, apologized, explained to us the way they made the dish and had the kitchen remake the dish.  Will definitely come back again, especially with the Groupon deals.", 
    "review_date": "2013-10-01"
  }, 
  "dZ0IV4EcVWKjRpHdcT4_Uw": {
    "user_rating": 2.0, 
    "user_location": "Fairfax, CA", 
    "user_name": "Gordon C.", 
    "review_text": "I visited this twice since they moved to the new location.  Before the move it was expensive but worth it because of the location, ambiance gave it a extra value.  So now it is struggling to measure up to the same celebrity status.  Looks like a hit one visit and miss the next time.  The personnel makes a big difference also.  The last time was during happy hour and with a friend.  I requested a table booth across from the bar. Wanted a comfortable area to have more than happy hour fair.  The water had to ask the owner because the booth sat more than two.  We had cloth napkins and they picked them up because maybe being happy hour and replaced with paper ones.  We had to requested more sourdough bread and food.  They charged us extra for the bread. I thought this was poor customer service .  This is the end of a once iconic  restaurant.", 
    "review_date": "2014-03-16"
  }, 
  "xIRuiA5X7d11e7LaM7aXiA": {
    "user_rating": 4.0, 
    "user_location": "Pauma Valley, CA", 
    "user_name": "Ken G.", 
    "review_text": "We had a wonderful dinner on Christmas Eve. Welcoming staff, nice &amp; knowledgeable service in this very comfortable setting. I'd go back.", 
    "review_date": "2014-12-29"
  }, 
  "IcinCxbsH_EQBoi520fzkQ": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "mike d.", 
    "review_text": "Caesar salad and bread alone are all you need.  Had the salmon with dill sauce and it was cooked perfect. Great place", 
    "review_date": "2014-12-15"
  }, 
  "ZRp-2jWU8qNmFCiYcMETNA": {
    "user_rating": 4.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "J O.", 
    "review_text": "Fior D'Italia just opened late 2012. Went there New Year's Eve. The food was delicious. Authentic Italian. My wife loved the Burrata salad. I had the veal chop which the waiter recommended. Deserts are delicious also.", 
    "review_date": "2013-01-06"
  }, 
  "Cp3i9koV3ryHFQ8CM764zw": {
    "user_rating": 1.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "R M.", 
    "review_text": "The single worst piece of fish I've ever been served in my long history of dining. Pathetic. I'm not one to complain excessively about food .. even my negative reviews here are tempered and balanced. But that this piece of petrale even made it out of the kitchen is proof that this restaurant, under new ownership or not, is already in grave danger. Awful ..  not fresh or properly cooked, splashed carelessly with some oil and adorned with the sorriest small portion of unappetizing green beans ever assembled. Honestly, the plate was a joke .. its appearance alone seemed a pointed attempt to discourage the recipient to ever come back here. Whoever was in the kitchen and allowed this to pass as edible, presentable, or just plain unoffensive, should be told to switch professions. Fior D'Italia may be the oldest restaurant in San Francisco .. but that tenure is about to end if they keep this up.   The service was fine .. a real shame that a competent waiter would be forced to bring a meal like this to the table.  1/5/13 - Following up a few days later. With perspective and having had time to process the experience reasonably .. I stick by my assessment that this was the worst, most poorly presented, unappetizing piece of fish I've ever been served in a restaurant. Read my other reviews .. I never express such extreme distaste. Simply awful.", 
    "review_date": "2013-01-03"
  }, 
  "jaaBZ77bg_wJsfYyq860Tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krista L.", 
    "review_text": "The service was excellent!!  It is an absolute family friendly place with a wonderful Italian atmosphere.  The food was delicious!!!!!!!!  We love your place!!", 
    "review_date": "2013-06-17"
  }, 
  "hQ5uGeM3C_yRLBgLGTCppQ": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "David S.", 
    "review_text": "Excellent food and it is off the beaten path outside of the normal tourist restaurants.  The gnocchi and the pumpkin filled ravioli were great and the dessert was amazing. Try the cream caramel.", 
    "review_date": "2014-10-23"
  }, 
  "x2vGqNFmII-6YfBD9QLXww": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Josiah B.", 
    "review_text": "Loved our dining experience here! I am Italian and I've made pasta with my family many times growing up. The homemade pasta is spot on! It's off the beaten path which is perfect for the non-touristy feel. My wife started with the minestrone and I had the fried calamari. Both excellent! Bread was scrumptious!  The calamari was perfect and the soup full of flavor and substance (not a ton of liquid).  We kept it simple with the lasagna and gnocchi. Both light, simple, yet full of flavor. I prefer beer over wine and they do have an IPA on tap which is what I had.  Highly recommend! Good start to the new year! We'll be back :)", 
    "review_date": "2015-01-01"
  }, 
  "zQxDUhxKOHdZygnNRZ-4ng": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiff W.", 
    "review_text": "Its a beautiful restaurant but i was disappointed by the ny steak. Sauce was really heavy. They ran.out of.lamb. Service is good and they have valet. Panna cotta was really stiff.", 
    "review_date": "2013-11-19"
  }, 
  "oXlHY_jy6bx2BLeT2M_JdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clara M.", 
    "review_text": "Went to the new Fior D'Italia. Our  luncheon was delicious. We all had the fish of the day, Petrale. It was absolutely fresh and  cooked perfectly for all. The al dente fresh string beans were delicious and the lemon completed the dish. We had a side dish of pumpkin ravioli which were good, but I think it is my personal taste that I like the traditional ravioli better. All in all, it was a great place for lunch.  The salad was quite large but the made on the spot. Lovely. I would certainly go again.", 
    "review_date": "2013-03-12"
  }, 
  "Ofdbb524sSnjtsdcXAwnKw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Michelle R.", 
    "review_text": "I don't understand why there wasn't a 2hr wait to get in. With a fresh rose on every table and an attentive server, the 1st impression couldn't be beat. We started with the Caesar salad for two. I am a fan of that salad and it did not disappoint- the lettuce couldn't be more crisp, the dressing, more flavorful, the cheese, more fresh. I then had the lasagna that was pretty fantastic. My love had the chicken with prosciutto half portion with the linguini and meat sauce. OMG- the meat sauce was divine and the linguini was the epitome of Al Dente. I'm in love and will be returning upon my next visit!", 
    "review_date": "2013-09-03"
  }, 
  "-K2Tcgh2EKX6e6HqqIrBIQ": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": ".Hon H.", 
    "review_text": "My family had a lovely time at Fior D'Italia on Christmas Day.  One of us usually likes to host and cook a big meal, but since my stepmother had a stroke a few years ago, she can't make it up the stairs (and we all have stairs) so it's simpler to go out to dinner.  Based on our experience at FDI, we may make this our holiday restaurant.  The restaurant is very pretty and light, with lots of huge windows and beautiful Christmas decorations.  I especially liked the tin ceiling.  Our waiter was charming and attentive, as were the rest of the staff.  We had brought champagne with us and it was carefully put in a chiller and served to us in flutes.  Our appetizers ranged from oysters to Caesar salad to minestrone.  I loved my oysters, but heard that the Caesar's had a little too much dressing.  The bread that was brought out was probably the best bread I've ever had in a restaurant.  A delicious crust with a tasty sourdough middle - yum, especially when dipped in their olive oil.    We switched it up again on our main courses - an assort of pumpkin ravioli, fresh pasta with pesto, chicken, etc.  We all enjoyed our meals and were regrettably too full for dessert.  There were only a couple of missteps that I will point out - there was no valet on duty when we arrived for our reservation, although the sign was out.  We had to ask for butter several times, and finally, even though we had made a special effort to let the restaurant know that my stepmother uses a walker and we wanted to make sure she wouldn't have to walk too far, that was not heeded and there was a lot of confusion when we arrived.  No big deal, but when you call the restaurant 2x to confirm the table location, your wishes should be honored.  Definitely worth going back to!", 
    "review_date": "2014-12-29"
  }, 
  "fB0IXH_knLsp1PQX73KLlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cameron A.", 
    "review_text": "Best place to belly up for a great experience at the bar, and enjoy the soft, tasty home made pasta and a few glasses of wine.  Geo and his brother Michael are the nicest bartenders.  I have been here over 10 times and only eat at this beautiful long bar.  When they closed last year, we were so sad, and now they have re opened and still have the great pasta on their menu.  I guess the old chef is the owner now, and he has added some good treats to bar menu.  They now have a great happy hour where it is half off wines by the glass and half off appetizers every day!  Score! I will definitley be back for that!", 
    "review_date": "2013-05-19"
  }, 
  "qQu-7rmF-Ml3xI0XgbNlXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ash S.", 
    "review_text": "Ordered the risotto milanese - it was still uncooked and wholly tasteless. overpriced is an understatement. unfortunate, since its a cool neighborhood, but yet another reason to avoid north beach eateries.", 
    "review_date": "2013-05-29"
  }, 
  "vj-71bWcddq5l-FEkThVbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie F.", 
    "review_text": "3.5 stars.   I swear I've seen this restaurant on TV but can't recall which.  The bar area was crowded with some regulars and the bartender was quick and friendly.  Our group was seated in the main dining and for a bit it was just our group with a couple smaller parties that would trickle in and out.  Service was attentive considering it wasn't that busy (but hey it was a Tuesday what do you expect).  We ordered a few appetizers to share with a few bottles of wine.  I wanted to try a few things that I heard great reviews about so our waiter was fantastic to accommodate - got a small plate of pasta with gnocchi, ravioli and a pesto pasta.  All delicious! I was able to sneak a few bites of lamb shank and potatoes which was tasty as well.  Dessert was ok- had a tiramisu mousse type thing but still tasty to finish off the night.", 
    "review_date": "2014-04-06"
  }, 
  "hEancnyDeZGSnwh525PNZA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "P M.", 
    "review_text": "Not great!  Friendly environment, nice wait staff and cosy environment.  The staff and host were very friendly!  The food not so friendly!  If you don't care to be impressed with your meal and don't care about money this is the place!  If you care about how your food tastes and aren't a millionaire, steer clear of this place!  Why can't all Italian food experiences taste like Incanto on Church street?!!!", 
    "review_date": "2013-11-03"
  }, 
  "6TLy8KZvioG4oc4bK9mqtQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim F.", 
    "review_text": "this place is back open.  the food was excellent.  the services a bit off but still well worth a visit.  there was a group of five and each person was very satisfied.  One great aspect is that because they were previously closed, getting a reservation was easy!  I had the ravoli and it was excellent.  The selecton of italian meats as an app was tasty.", 
    "review_date": "2012-12-29"
  }, 
  "bchuaSDWnLIBoxpLAhdsIw": {
    "user_rating": 4.0, 
    "user_location": "Riverside, CA", 
    "user_name": "Steve P.", 
    "review_text": "Good food. My only gripe is that the bus boy set a water pitcher on a fresh side dish (plate) when cleaning a nearby table. Otherwise a nice place.", 
    "review_date": "2014-09-24"
  }, 
  "adasXGqXs0C9xR6w6cOOnA": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Jim L.", 
    "review_text": "great!  food &amp; service are outstanding.  best italian food In Little Italy.", 
    "review_date": "2013-07-21"
  }, 
  "FB7ndGfaaL413FkMq7tYyw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ifred M.", 
    "review_text": "Atmosphere: very nice &amp; friendly. There was a jazz playing the night I was there &amp; the music was nice  Food: I had the calamari as an appetizer and the pesto pasta for the main dish, both were salty, flavorless and below average overall Service: just ok", 
    "review_date": "2014-05-28"
  }, 
  "MPq0HDBUxGMSaRKqovt34w": {
    "user_rating": 5.0, 
    "user_location": "Dacula, GA", 
    "user_name": "Steve W.", 
    "review_text": "One of the best Italian meals I have ever had and I have been to Italy 5 times. The food was great and the service was the friendliest I have ever had.  If I lived in San Fran I would be a regular. The waiters wear ties and suits and the atmosphere is wonderful. By the way, I order calamari at every restraint that serves it, this was the best calamari I have ever had, period.", 
    "review_date": "2014-01-03"
  }, 
  "ZTWKWRng0cA5I6f7zvzFDA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Joe R.", 
    "review_text": "I would like to formally thank Fior D'Italia and their staff for helping me and my wife Nicole to have a beautiful wedding reception!! Lucio was helpful from the first time I called to brainstorm about using this establishment for my wedding reception. As an Italian-American I had high standards for the food &amp; service of a Ristorante Italiano, and Fior did not disappoint. They stuck by their word, they were accommodating to the different foods, table seating, additions to the menu, music, and much more. We were treated liked family from Lucio and his staff from the moment we met, and the service was always first class. If you are planning a wedding reception or are just looking for a fine place to dine, this is definitely a wonderful place. The experience we had for our wedding will not be forgotten, and the staff here will always be like family.  Grazie mille Lucio &amp; Fior D'Italia,  Joe &amp; Nicole &amp; il mio figlio Luciano...  Wedding Reception was September 27, 2014 Guest Total = 115", 
    "review_date": "2014-10-11"
  }, 
  "tBhRk7fMlVhU3nMN2-0Tdg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica S.", 
    "review_text": "I love this place!   O.M.G! The homemade pasta is delicious!  I've tried the lasagne, loved it. Another time I had the ravioli and it was equally good.  One of my friends order the fettuccine alfredo and was also very good. Another friend order the linguine with clams, delicious.   I like the location, is quiet, close enough to walk from Fisherman's Wharf, far enough from the touristy crowd. No dress code, but you have the option to be dressy since it looks all fancy (white tablecloths and all)  The servers/bartenders are polite and friendly. (and cute!)  Happy Hour?? (<a href=\"/redir?url=http%3A%2F%2Fwww.fior.com%2Fhappy_hour.html&amp;s=f1dae3982dead11af875dca9483194913bd78d2e17021bd9d4f2b52029cf7847\" rel=\"nofollow\" target=\"_blank\">fior.com/happy_hour.html</a>) yes please! =D  I will be back for the Live Jazz on Wednesdays! (live music also on Sundays)   DESERT! DESERT! DESERT! We tried like 4 different ones, all amazing!   WINE WINE WINE (I'm on my 4th glass right now...yuuum!!)", 
    "review_date": "2014-11-09"
  }, 
  "s9WK4BVK3aSJ609dKhv_pA": {
    "user_rating": 3.0, 
    "user_location": "Salinas, CA", 
    "user_name": "Lisa M.", 
    "review_text": "Friendly waiters and well maintained decor, but food tasted just average.  Portions for appetizers and main dishes are attractively arranged but lacking in size for the price ($17.00 for meatballs and spaghetti).  Will not go back.", 
    "review_date": "2014-12-23"
  }, 
  "CMq2GqTWflFO184P5WhQfQ": {
    "user_rating": 4.0, 
    "user_location": "North Hollywood, CA", 
    "user_name": "Terry Y.", 
    "review_text": "Hadn't been to Fior D'Italia in 10 years (before they moved from North Beach), but found the food hadn't really changed.  Fish dishes were fresh and flavorful, linguine with clams were tasty and tagliatelle bolognese was properly al.dents AZ we'll.as delicious.  Wine list had many good options, but many of the Italian imports were marked up too much.  Atmosphere was quiet, decor simple but very nice and service attentive and efficient.", 
    "review_date": "2013-11-11"
  }, 
  "JqRImxQ0yI07ltrRXF-Aog": {
    "user_rating": 4.0, 
    "user_location": "Outer Richmond, San Francisco, CA", 
    "user_name": "Tara Y.", 
    "review_text": "Attentive and suggestive staff   Good food. Nice wine.", 
    "review_date": "2013-10-14"
  }, 
  "Vn5BQEssjOPPHvycrJDKeA": {
    "user_rating": 4.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Crystal W.", 
    "review_text": "Planned a corporate event here for about 30 people.  Not easy to please that many people, but, Fior d' italia pulled it off.  They were great working with us ahead of time on the specifics for our group, they were flexible with all of the last minute changes.  The service was great for our dinner and they even checked in with me to make sure that we were enjoying ourselves.  I personally had the Salmon as did a number of people in our group and it was delicious, perfectly cooked.  I don't eat dessert normally and the server was nice enough to bring me a bowl of fresh berries ......look forward to coming again in the future.  Also nice jazz band playing that evening", 
    "review_date": "2014-08-04"
  }, 
  "mIo2cFs_89a7i0DWHT9F-w": {
    "user_rating": 5.0, 
    "user_location": "Arnold, MD", 
    "user_name": "Courtney K.", 
    "review_text": "Awesome service. Delicious food. Classy ambiance.  That about sums up my experience here but if you want to know more, here it is:  -calamari was perfectly fried, accompanying sauces were tasty too -fresh cantaloupe with prochuitto was also a nice light starter -the olive oil and balsamic vinegar made the house bread even better -enjoying freshly made gnocchi and ravioli was a great treat -one diner did say she felt her food was salty but otherwise everyone loved the experience here -restaurant decor is beautiful including the table linens and a fresh rose on each table -love that the staff dresses eloquently and most of the patrons dress up a bit too -staff was top notch here, very attentive, warm and friendly -lots of locals and some tourists  (As seen on Travel Channel's \"Food Paradise - Pasta Paradise\")", 
    "review_date": "2014-05-30"
  }, 
  "E6pjxxvm90pUwJkHG3oMjQ": {
    "user_rating": 5.0, 
    "user_location": "Palm City, FL", 
    "user_name": "Patty S.", 
    "review_text": "Unbelievably impressive - both with their food and their service.  This is a MUST go to restaurant when in San Francisco.  Oldest one still in existence.  You will not be disappointed!!!  Fresh homemade pasta, entrees and desserts.  Can't wait to return.", 
    "review_date": "2014-06-06"
  }, 
  "OxAKq5m-Dfqiv2TDy0L6fg": {
    "user_rating": 2.0, 
    "user_location": "Orangevale, CA", 
    "user_name": "Julie M.", 
    "review_text": "The food here was really good and not horribly expensive. But our waiter took a ridiculously long time to do everything. It took us over an hour and a half for a simple meal. I watched other waiters working quickly and checking their tables frequently, whereas I watched our waiter walk around and talk to his coworkers instead of checking on us. I didn't even get my leftovers boxed because I knew it was going to take him forever to do it. We were done eating for a good 30 minutes by the time we got our check. It was to the point where even the host noticed we were just sitting there waiting on him and went to go get him. To me that's just very bad service so we of course tipped him very low. I probably wouldn't come back here.", 
    "review_date": "2015-01-24"
  }, 
  "tzqYxQzNTPYFd6mMZpdczw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Eunice K.", 
    "review_text": "My bf and I were looking for a place to eat near by. We yelped a place near by and saw that Fior D'italia was open until 10 pm.  We walked at 9:20.  First of all..no one was at the front.. we just waited until someone show up  The servers did not seem happy to see us since we were walking in close to closing time; no one even greeted us. We felt like we were unwanted.. but whatevers.. we were so hungry, we just ignored it. We got seated and quickly ordered their lasagna and pesto pasta. We literally finished in less than 20 minutes since we were starving [wasn't even 10pm!]  Our server's mood brightened up; he was much nicer in the end as he cleaned up our plates. He made a joke, saying that he will see us tomorrow and dont be late.  The bf was not happy. Wouldn't come here again", 
    "review_date": "2014-09-08"
  }, 
  "tBPNMSwLjDaTVZmiYvHv8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "My family and I decided to try something new for lunch. Usually, we go to Scoma's, but my mom heard of this place and wanted to try it.  This place is really good. I had their ravioli de zucca, which was delicious. Some restaurants that make this same dish go a bit heavy on the butter, but this place made it very light. I didn't get that oily feeling. My brother had the linguine with clams and loved his dish. My mom had their house salad. My dad had their linguine with meatballs. My parents enjoyed their food. The portion size is just right compared to Scoma's, which are huge and their dishes are in the 25-34 dollar range. If you're looking for good italian food at an affordable price come here.", 
    "review_date": "2014-02-13"
  }, 
  "-x2Ulw6ijKqlmlZTcuXWbg": {
    "user_rating": 4.0, 
    "user_location": "Circle Pines, MN", 
    "user_name": "Jon-Louis H.", 
    "review_text": "We arrived at Fior D'Italia about 6:30 pm on Saturday, September 28. No reservations. They were just finishing up a wedding reception, and weren't open for supper until 7:00. We were told it would be about 45 minutes and that they had to clear 7 and 730 reservations. Since we could smell the garlic, olive oil and wine, we decided it might be worth the wait.  The restaurant clearly caters to locals and regulars. We sat at about 7:50, but they seemed to somehow make room for everyone who came it.  We started with the shrimp wrapped in prosciutto, which was frickn awesome. Garlic, olive oil, salty - and served HOT. Delicious. My wife had the saltimbocca, which was excellent. I suggest about 25% less sage, since that was the dominant flavor, but it was rich and flavorful. Pounded thin, cooked in butter, olive oil, with a nice sauce with broth and wine. Very tasty. I had the Osso Bucco, which is one of my benchmark dinners at an Italian restaurant, and Fior did not disappoint. There was no gremolata, but the broth was rich enough with the right flavors that I found it did not matter. Tender and juicy, full of flavor, with just a little pink. Again, full of rich flavors. In both cases, supper was served very hot, so the food had obviously not been sitting out before it was brought to the table.  We had dessert, but for the life of me I can not remember what we had - so I would probably say that it just did not make an impression.  Overall, even though we had to wait for a table, they made room for walk ins on a busy Saturday evening, the food was excellent, and the service was fast.", 
    "review_date": "2014-10-06"
  }, 
  "B99Mlf1RqUYdGiPPxTrjMg": {
    "user_rating": 2.0, 
    "user_location": "Huntersville, NC", 
    "user_name": "Ralph E.", 
    "review_text": "Decided to give this restaurant a try after reading reviews here. My impressions upon leaving the restaurant are the following: the food is just  okay, nothing special here. If you prefer a more lively atmosphere I would  not suggest dining here. My dish ( risotto ) was under cooked and bland.  My girlfriend ordered penne but got ziti. The bread was very good but I had to ask the waiter for butter, strange. There are better restaurants to choose from in the area and I'd suggest personally stopping by rather then just reading the reviews on Yelp exclusively.", 
    "review_date": "2014-06-30"
  }, 
  "pWVXFjJl9G29UtPpueDMvw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Justin S.", 
    "review_text": "Amazing old-fashioned SF style restaurant with great character!  The bartender was great and accommodating in changing our order for us when some of our group left, and the drinks were great as well. The chef and owners regularly walk around the restaurant and meet the customers, and the guy even speaks Italian!!   Ravioli off the happy hour menu was good, get the clams as well.", 
    "review_date": "2013-11-25"
  }, 
  "EsUDOQenJq3zbbZba3EKvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace H. B.", 
    "review_text": "After nine years and the big fire, my husband and I were able to find the \"new\" Fior d'Italia.  We aren't always in SF on weekends, so this was something we had wanted to do for a long time.  WHAT A THRILL!  The new restaurant is so nice and still has the white table clothes, silver and crystal!  Surrounding the tables are wonderful photos of the history of SF's oldest Italian restaurant (since 1868!).  We started with cocktails which were generous and well-mixed.  Then, delicious salad....and our main courses.  I had the fabulous OSSO BUCCO, which no one is SF makes more delicious....and my husband had fish of the day, which he enjoyed.  The bread was homemade and served warm, and the waiter was so attentive and took great care that we had everything ALL the time (including water).  For dessert, we were hoping for zabione, and it was on the menu....and OMG perfect!  Both my husband and I highly recommend Fior d'Italia.....if you want authentic Italian, gracious service, delicious food &amp; drink, and atmosphere......  Can't wait to spread the word!!!!", 
    "review_date": "2014-08-10"
  }, 
  "uK7Xw-N8Doj9cfJuGEmMWA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valerie C.", 
    "review_text": "Met 6 of my friends there for a long overdue get together. We ordered calamari, antipasti, lasagna, Osso buco, spaghetti, and a dish they are well known for - pumpkin ravioli. Everything was delicious! Service was very attentive. Great place to hold a conversation with a big group. One of my friends took their banquet menu and wants to bring his plumbers union there for one of their monthly dinners.", 
    "review_date": "2013-11-27"
  }, 
  "Xv0Kts_5qDIG6WUC2-646A": {
    "user_rating": 5.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Robert H.", 
    "review_text": "Where Italian food is concerned, people have different likes and dislikes. It's not easy to keep everyone happy.  In my humble opinion that's why many of these TV programs featuring restaurant \"makeovers\" involve Italian restaurants.  I think that Italian chefs use recipes handed down for generations and have very personal touches.  If you order dish \"A\" in a place and order the same thing in another place, they may have the same core ingredients but the flavor palette may be entirely different.  I have a friend who thinks genuine \"Italian\" food starts and stops with spaghetti and meatballs.  The Fior D'Italia doesn't eschew those \"American staples\" but has enough variety to suit anyone and everyone.  I went there the other night for the first time since Chef Gianni took over the place and reopened (hence I'm treating this as a new review rather than an update).    Service was spot on attentive, bread hot and water glasses filled and coffee replenished.  I have absolutely no complaints whatsoever.  I was impressed by the fact that one of our party, a vegetarian, was able to get a \"special\" dish just by asking the waiter (Donny) politely if it was possible.  No problem.  I always read the bad reviews just to get a sense of how a place clicks.  I noticed many were because some coupons from a few years back aren't redeemable under the new owner.   I remember the old owner - a heck of a nice fellow but  prone to giving out coupons and free dinners (I had a free dinner there myself several years ago).  That may be patriotic or civic minded but it impacts negatively on the bottom line.  Personally I would never expect a coupon more than a year old to be honored and don't think anyone else should either.  Kudos to Chef Gianni for trying to make things right  with people that do try to use them.  I had a mixed green salad for starters and the saltimbocca (literally jumps in your mouth) for the main course.  The presentation was excellent and the taste was very exquisite.  This dish could be very bland in the hands of an unskilled chef but Gianni's kitchen did a outstanding job.  There were some potatoes and asparagus to complete the dish - not so much as to waste but definitely enough to satisfy.  My wife had the veal chop (Cotoletta alla Piemontese) and it was huge.  My companions had the vegetarian \"special\" and a chicken dish (Petto di Pollo) respectively.  I didn't sample any of their food but I noticed that very little if any was left on their respective plates.  I declined dessert but one of them ordered a chocolate gelato and let us have a taste.  If you like chocolate ice cream, you will love chocolate gelato.  The Ambiance was classy but comfortable and pleasant.  It's upscale but doesn't over do it.  Staff was attentive and friendly.  The food was hot, tasty and delicious.  The menu has been cut back from what it was but that's a good thing as it allows them to focus.  The bar seems to be a local neighborhood hangout.  I understand they serve finger food but I didn't try any so my  comments are based on my experience.  The menu is Northern \"Italian\" style with pasta, soup and salad courses  separate items on the menu.  For a special  treat and a wonderful meal, Fior D'Italia can't be beat.  Thanks Gianni!  I'll be back!", 
    "review_date": "2013-05-21"
  }, 
  "1iYdD-BcWhqtJYHcHkFPXA": {
    "user_rating": 4.0, 
    "user_location": "Elko, NV", 
    "user_name": "Chip S.", 
    "review_text": "Dinner nice. Lasagne was piping hot and good. A little cramped but okay. Waiter did a good job. Only complaint bread nothing but air and no butter.  Will return!", 
    "review_date": "2014-07-04"
  }, 
  "chp92HO6dpDRPE6NiBuN6w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard T.", 
    "review_text": "The girlfriend and I came here armed with a groupon this weekend.   The place was pretty empty at 6pm on Saturday, but the bar was lively.  First off, this place had really good bread, olive oil and vinegar.  Very Italian.  We ordered the bacon wrapped shrimp.  Out come four tasty, but very salty, large shrimp.    Next, I order the veal with polenta and veggies.  The veal was very tender and tasty, but again, very salty.  This time, it wasn't too bad because the polenta was a little bland so mix them together and it masks the saltiness of the veal.  For dessert, we had the cooked pudding, which was bland, but the sauce was good.  The service was very good and the waiter was funny without being awkward.  There were some flies buzzing around, but only because they keep the doors open.", 
    "review_date": "2013-07-16"
  }, 
  "-6ARLVd9TMrovJcHQZTdxA": {
    "user_rating": 4.0, 
    "user_location": "Kenwood, CA", 
    "user_name": "Steve S.", 
    "review_text": "Had not been to Fior D'Italia in many many years and was not disappointed that we made the journey into the city. The restaurant had moved some years ago and this was my first time at the new location. Very nice! The bar and dinning room have a great feel to them and the service is just what I expect when I go to dinner in San Francisco.  We started of with drinks and calamari, then moved into the good stuff, dinner. I had the rack of lamb and my wife had the veal picatta. Both spot on. Wine list was good, but not great. A few more Sonoma County wines on the list would have been a plus.  All in all, a very good evening. The only reason I did not give it five stars was the three dogs that where inside the bar when we walked in. They where still there when we left. Dogs in a restaurant? I am a dog lover, but I do know when to leave him home.  I will be back, definitely.", 
    "review_date": "2014-05-07"
  }, 
  "aQNkFINQ5TFiZVc3h4Q6Qg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Melissa G.", 
    "review_text": "Service was absolutely incredible! I went here for a banquet and they were extremely attentive the entire time. Also, between the appetizers, pasta dish, main entree, and tiramisu dessert, I was in heaven! They have a great wine selection as well.", 
    "review_date": "2013-08-26"
  }, 
  "hCaoacG_9-bPet6s0HZfng": {
    "user_rating": 5.0, 
    "user_location": "Excelsior, San Francisco, CA", 
    "user_name": "Jessie A.", 
    "review_text": "My family and I had decided to try Fior DItalia tonight for my moms birthday and from the moment we arrived at the door, we were given the best attention and care that most guests ask for, but never get from other restaurants. The Fior team was attentive, enthusiastic, and on point throughout our whole stay, which added to the amazing food we served this evening. I almost feel bad to say that I expectations, but I feel even better knowing that those expectations were met and exceeded. I HIGHLY RECOMMEND Fior DItalia to anyone interested in a great night! Much love to Lalo who guided us through the experience!", 
    "review_date": "2014-02-16"
  }, 
  "-whAL6MCPsH6RPzQLC3fgA": {
    "user_rating": 2.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Stacy S.", 
    "review_text": "We went here because we had a gift certificate, and it was very close to our hotel. We ordered the cheese plate, ceasar salad, and potato gnocchi to share. The prices were reasonable, but the food wasn't very impressive. The cheese plate had a lot of cheese, but not much variety. The salad had a bit too much dressing and no crutons! :( I'll admit the gnocchi was very good, but not enough to make me ever want to return. Also our waiter was a bit weird and the decor seems outdated.", 
    "review_date": "2013-03-13"
  }, 
  "evnyfXDWW39FI3NUYU1fFQ": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jenny C.", 
    "review_text": "Came here for an early dinner on a Sat evening. The service was pretty good. The food would've been a lot more enjoyable if the dishes weren't all too salty. I had the quail stuffed with sausage for my entree, the bland polenta balanced the saltiness out a bit but I still would've preferred if they saved some of the salt in the bird for the polenta. Had panna cotta for dessert. I've never had panna cotta before so I'm not sure how it's supposed to be. I liked it ok, a bit too rich/creamy for me.", 
    "review_date": "2013-07-16"
  }, 
  "uNUes8XDdlzmEbGZ_cNe7w": {
    "user_rating": 2.0, 
    "user_location": "Portland, OR", 
    "user_name": "James W.", 
    "review_text": "Recently ate here.   The price of the dinner can add up since everything is separate.  When you add in the salad, entree, and a just a glass of wine hits the tail end of the spendy range.  The Good: The salads that we had were excellent.  The just OK: I had the raviolis in bolognese sauce.  It was good, just not great. My wife had the fettuccine alfredo which uses an egg noodle.  It was not that good to us.  The Bad: Service.  Very slow service and the waiter did not do the standard how are you doing and is there something else I can get you.    Don't think that we will be going back on our next visit to SF.", 
    "review_date": "2013-04-08"
  }, 
  "g33nz0olhXKe9TgwUh7zMQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SFCAFOX S.", 
    "review_text": "So I would normally give this place a super solid 5 review BUT last night's experience changed that. The food is normally soooooo amazingly good, too. There were six of us in our party. We were seated in a booth with two additional chairs which was somewhat uncomfortable but we were fine with that. Our waiter seemed very busy and finally after almost 20 minutes came over to take our drink order. We ordered martinis and wine. He brought back the martinis but the martinis were the wrong ones he totally forgot the wine for almost another 10 minutes. By now we are at the 25 minute mark the restaurant was very busy. Finally the wine came and he placed our food orders most of us had pasta I had the halibut. Everyone's food came except my halibut and he apologized saying it would be out shortly so another five minutes passes while my friends are going ahead and eating I'm sitting with just my glass of wine. Then the maître d' came out and also apologize saying the food was on the way he apologized and said there was nothing more he could do please except my apologies which was very nice. Then my halibut came and I was relieved because we had a dinner theater show afterward so now I could start eating my friends were already at least halfway through their meal. The first bite of the halibut was okay but I noticed it was a little tough. The second bite I couldn't even pull the halibut away from the rest of the piece because it was 100% completely raw inside. I had to send the raw fish back it looked like it had been poached in hot boiling water for no more than maybe two minutes it definitely had not even been inside of a sauté pan. When I asked another waiter if he could help us and explain my fish was raw he immediately looked at us and yelled at our table \"Who's your waiter?\" And walked away. I understand when restaurants get busy and things go wrong in the bar or the kitchen it happens we understand but the rudeness of the waitstaff and the fact the food wasn't even properly prepared was not cool. it finally came back out another 10 minutes later. By now my friends had completely finished their meal and I am just starting mine. we're now late for a dinner theater by almost half an hour so the entire experience from my side was somewhat ruined and I know my friends felt bad as well. Mostly because I recommended the restaurant. I'm not sure I would go back after being treated this way. San Francisco has so many restaurants with grateful wait staff and properly cooked food. I will say the Pasta Fagioli soup is to die for, comes in a very large portion crock, large enough for a meal actually. Next time I'll just have that, IF there is a next time. What a shame.....", 
    "review_date": "2014-08-03"
  }, 
  "YB2J9lFC_QQ8K98AAo2xKA": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Shireen S.", 
    "review_text": "My husband took me to dinner here for my birthday. This place is class A service! Our waitress, Chelsea, was fantastic! She was very attentive to our needs and made excellent recommendations for our entrée choices. We had the Osso Buco, Rack of Lamb, Risotto alla Milanese and shared oysters and caesar salad. Everything was fantastic! Chelsea surprised us by belting out Happy Birthday in Italian Opera style! WOW! Amazing! Thank you for a wonderful dining experience and we will be back!", 
    "review_date": "2014-05-12"
  }, 
  "cY2O_YfM_e45jkiYl4U3Sg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jordan S.", 
    "review_text": "I live only 1 block away and I cant' believe I hadn't tried this place sooner.  I came here with my family and it's a very quaint and pretty restaurant. I liked that it wasn't loud and that I could have good conversation without having to yell, like other touristy restaurants in north beach.  To start, we got the pancetta wrapped prawns and the calamari. The prawns were AMAZING. Make sure to save some of the bread to dip in the garlic sauce afterwards!! The calamari was really good as well. It came with lemon and two different kind of sauces. Very fresh and very delicious.  For dinner, my mom and I split the Tagliatelle alla Bolognese and the Bucatini Amatriciana. Both dishes were superb. The  Tagliatelle alla Bolognese is a fresh house made pasta with a meat sauce. The pasta was perfectly a'dente and the meat sauce was great.  The Bucatini Amatriciana is a \"dry\" pasta (not housemade?) with pancetta in a spicy tomato sauce and it is soooooo good. I honestly couldn't decide which one I liked better because they were equally tasty. Also, the portions were huge- we had half of each pasta left to take home.  We topped our meal off with two bottles of wine.  Do yourself a favor and come to Fior D'Italia so I can say I told you so.  :)", 
    "review_date": "2015-01-30"
  }, 
  "CRWJ5Hy5MABz-qXV_faLKQ": {
    "user_rating": 5.0, 
    "user_location": "Davis, CA", 
    "user_name": "Joy B.", 
    "review_text": "We happened to stumble upon this restaurant while walking through SF and decided to make a reservation. We are glad we did! The food was absolutely delicious. I had the seafood linguine and my fiancé had the pesto pasta. My fiancé even tried my seafood linguine and enjoyed it, even though he's not the biggest fan of seafood! We tried several drinks from sparkling wines to martinis and a port with dessert. Dessert was just as good; we tried the chocolate gelato and the caramel creme. The service was awesome - very attentive and made several suggestions when we couldn't decide. We definitely will come back and hope to try new things on the menu!", 
    "review_date": "2013-12-03"
  }, 
  "t5JM5GkpxgjHONamc6lHzQ": {
    "user_rating": 2.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Tee K.", 
    "review_text": "I really wanted to like this restaurant. Came in on a Saturday night just before 9pm. The restaurant was not full, however there was no one to receive guests at the host's desk. Waited for a couple of minutes until a waiter passed, said someone would be there shortly and then patted my shoulder. UGH.   Finally someone came along, showed me to a cute little corner table. Ordered calamari as a starter. It was OK, nothing special. Ordered the risotto bolognese as a main. It was terrible. The pasta was OK but the meat in the was bland, and had the consistency of blended patted down meatloaf. Didn't taste like meat at all.  Really bad. I could find better box raviolli.   Will not be coming back. There are many better restaurants in the area.", 
    "review_date": "2014-09-20"
  }, 
  "np9Rwz7v21EyvCyTIUCXqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amit V.", 
    "review_text": "Came here for dinner on Easter. This might be my new favorite Italian restaurant in North Beach. All our entrees were flawless, and they got all the little things right too (e.g. great tasting olive oil). The staff was extremely fast and friendly. For example, the manager stopped by to ask us about our meal and saw we were sharing entrees - he immediately ran to the kitchen and got us extra plates to make things easier (without asking).", 
    "review_date": "2014-04-23"
  }, 
  "M82mB7Hw8B98J4uNlEIfog": {
    "user_rating": 5.0, 
    "user_location": "Boca Raton, FL", 
    "user_name": "Dan B.", 
    "review_text": "I'm 100% Italian, grandmother from Naples... have eaten at the beat Italian spots in North Jersey, Brooklyn, South Florida, Kansas City, Vegas... This place is the best you can get. The real deal and service is impeccable.   Get veal (chefs been making it for 30+ years), bread (made in house), pasta sampler with gnocchi marinara, pesto rigatoni, and stuffed alfredo tortellini.  Filet can be cut with a fork... literally.   You cannot go wrong here if you know and crave Italian.", 
    "review_date": "2015-01-26"
  }, 
  "TQ42P2aYySg7PMJi37okaA": {
    "user_rating": 5.0, 
    "user_location": "Morgan Hill, CA", 
    "user_name": "Gregory N.", 
    "review_text": "Like Cafe Pistola, not sure why this place isn't rated higher.  It's another classic North Beach Italian dining experience.  The meat entrees are pricey, but the pastas are delicious and reasonable.", 
    "review_date": "2013-07-21"
  }, 
  "f2ZPSOKftYC6eA2J3t7ZTQ": {
    "user_rating": 5.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Robyn T.", 
    "review_text": "The service was exceptional and food was good.  I guess this place is suppose to be one of the first italian restaurants and it is interesting to read all the articles and look at the old photo's.  It was easy to make a reservation and they were very accommodating even though we were dressed down compared to most of the crowd.  I ate the seafood risotto which had so many clams, pieces of calamari, and scallops that it was hard to find the rice, I couldn't finish it there was so much food.  In retrospect I would have ordered the fresh made cheese ravioli which someone ordered next to us which was a more reasonable portion.  Wine list was pretty good, including by the glass and bottle options.  They let us order a bottle and take it with us, which it was unsure if that was allowed or not.  Overall, I would return if back in San Francisco and suggest others to go if you are looking for a very good italian restaurant with great value.", 
    "review_date": "2014-06-14"
  }, 
  "MGUYt2J9rcIejbrexEShiQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "John R.", 
    "review_text": "The service and the food was absolutely amazing!  We would love to live next door to this quaint little Italian place just to drop in every Sunday afternoon. You won't be disappointed.", 
    "review_date": "2014-09-01"
  }, 
  "NQWQKAMXYU3lTBnyk9N9FQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Martin D.", 
    "review_text": "Nailed a classic that is often looked over with the fettuccine. The pasta itself felt house made. Just sat at the bar and was happy to stumble into. Bartenders were accommodating and attentive to all at the bar. Crowd was definitely an older crowd as I believe this place is viewed as a classic. Id still bring a date ;)", 
    "review_date": "2014-07-16"
  }, 
  "MXSitJNErMSywAtHvyR5TA": {
    "user_rating": 5.0, 
    "user_location": "Glendale, AZ", 
    "user_name": "Colleen Z.", 
    "review_text": "Great food and even better service!", 
    "review_date": "2013-06-29"
  }, 
  "_SKk9INdZ_pEkPXkfrqRhg": {
    "user_rating": 5.0, 
    "user_location": "Mesa, AZ", 
    "user_name": "Tim M.", 
    "review_text": "Very glad to see them re opened. Food as delicious as it ever was- most of the staff is back as well. A real San Francisco Treat. The lasagna is too good for words!", 
    "review_date": "2013-04-01"
  }, 
  "vOpaVbzCF5Kn1bzJv_p3CQ": {
    "user_rating": 3.0, 
    "user_location": "Littleton, CO", 
    "user_name": "Todd E.", 
    "review_text": "We saw this restaurant featured on a tv show and were excited to visit - especially in light that is has a tremendous amount of history and that the pasta is home-made.   The folks who own the restaurant are missing a huge opportunity here - no one bothered to mention anything about the restaurants history!  The food was very good but the waiter seemed very disinterested in serving anyone while we were there.", 
    "review_date": "2014-04-02"
  }, 
  "yPQbgqxrwTquVxLrK0QpGg": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Daniel J.", 
    "review_text": "I bought a coupon from Halfoff.TV and drove out to this restaurant from Fremont on a Monday night. The staff was very friendly and the food was good. The first thing that kinda through me off was when they served the bread I asked for some garlic to put in my olive oil for dipping and he said I could not have any because it would insult the chef. Which I thought it was a little strange when it is only for dipping. Then when my seafood pasta came out we asked for Parmesan cheese he said we could not have any. I have never been refused either of those items at any Italian restaurant I have been to. We then had desert which was the Tiramisu and a pudding with fruit on top. The desert was delicious.      Then our check came. I gave the sever my coupon. He looked at it and said that I could not use it. I was very upset about it so he took it to the manager to see if I could use it. He came back with the manager and the manager said that he does not have to take because that they changed ownership. So we went around and around about this coupon. He told me that he would give me a little off my bill. I said whatever and do what you gotta due with a pissed off attitude from me. He then came back and gave me a better discount which made me a little happier. It was a little to much drama over this coupon that should have never happen. It was a Monday night and there was mane a quarter filled up. I explained to the manager that he should be happy that people are coming in to use there coupon because it brings in business that you would normally have. I think it is a great promotion idea from the previous owner. The coupon was good only from Monday through Thursday for food only.My advise to people that have this coupon is to not even waste your time and try to use it there unless you want to battle with the manager. Like I said , other then the drama that happened , the food and the service was good.I would have rated it a 3.5.", 
    "review_date": "2014-01-01"
  }, 
  "2tZDiBpss5AGZHd7JFqnrA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Martha S.", 
    "review_text": "We were staying at the San remo right next door, so thought we would have to give \"Americas oldest italian restaurant\" a try. We had high expectations due to this claim. The happy hour specials are totally worth it - really good apps and drinks, and for cheap - but the dinner fell short. My fiancé liked his tortellini, but my veal was really dry, and came with no pasta and one tiny little baby potato (should have come with like 6). They also only gave us like 3 tiny slices of thin bread. Needless to say, we were still hungry. The service was pretty good though.", 
    "review_date": "2014-09-12"
  }, 
  "sN1lNwR5J_P0k83f-5IOsg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H. L.", 
    "review_text": "I ordered the seafood pasta. The seafood and pasta were over cooked, and the sauce was bland and runny/watery. There was a bad mussel in there, which we pointed out to the waiter, and he didn't care and made me feel like I was an annoying customer. We never got our water filled and only saw our waiter when the check came. I would not recommend coming to this place.", 
    "review_date": "2014-08-03"
  }, 
  "wXCYlrMfERpEQ1CaZB8Nzw": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Kristen M.", 
    "review_text": "Excellent food, wonderful service and atmosphere. The restaurant was very busy the night we went, yet the staff recognized this and made sure we were attended to. I had the lasagna, the food tasted authentic and was delicious. The owner was walking around, making sure to meet all of his customers. The entire staff was very friendly and treated you like family. Excellent, I cannot wait to come back!", 
    "review_date": "2014-12-13"
  }, 
  "C9cnLjLBvRbYanAeO7tl1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sannie C.", 
    "review_text": "Happy hour. One of the best in town. So surprised this place is not commonly listed as one of the best happy hour spots in town.  They offer half off apps and drinks 4-7pm M-F. You can't beat that. The food is good, not great. The drinks are amazing. They have great bartenders. Hidden happy hour gem that I hope doesn't get too crowded.", 
    "review_date": "2014-03-04"
  }, 
  "GcJgeZYHetMVeSYAKAAe9g": {
    "user_rating": 2.0, 
    "user_location": "Idyllwild Pine Cove, CA", 
    "user_name": "punk l.", 
    "review_text": "We have been looking forward to a reopening, and took the train out from the sunset specifically for some fine Italian dining. So sad and disappointed, we so wanted this to be a good experience. However I can't stress enough how gracious and friendly the service was. We sat at the bar first and ordered mussels and a couple of martinis. The drinks and bartenders were great (very reasonable happy hour BTW), but the mussels came out COLD...I mean even the butter sauce was cold. Decided to hope for the best with dinner. We got a great table, again the staff was a class act, it was such a shame to be so disappointed with both our entrees. The chef agreed to do a chicken parm (not on the menu). That was wrapped up after two bites and went to the dog. It was bone dry..just not edible. We also had the butternut and sage raviolis and brown butter sauce. This was totally dry and had no sauce. Jeez was the sous chef off that night? Then the clincher..I asked for some type of cream sauce to try to save this dish, the waiter came back and said the chef refused. WOW. I asked for it on the side and finally got it for my now cold dish. I don't know what is going on in that kitchen, but at this rate I would be surprised to see them open next week. The two stars are for the staff ...cheers, guys, you are the best.", 
    "review_date": "2013-01-03"
  }, 
  "uUNE-uipfRTZjFwEoYnJzA": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Maria P.", 
    "review_text": "The oldest and one of the Best Italian restaurants in the country. So many delicious choices at very reasonable prices. A real San Francisco treat!", 
    "review_date": "2013-11-09"
  }, 
  "rgJA_FjtKqOujjukAhqYbA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda B.", 
    "review_text": "Go to Trattoria Contadina or North Beach Restaurant instead. We had an awful meal at Flor D'Italia. The gnocchi was soft, the sauce was bland and all meat dishes were overcooked and over sauced. Very unimpressive meal.", 
    "review_date": "2014-07-06"
  }, 
  "Tx1d9dUakvjcimLfzgdwoQ": {
    "user_rating": 1.0, 
    "user_location": "Clearwater, FL", 
    "user_name": "Alfred C.", 
    "review_text": "Last week while in SF we went to Fior di Italia for lunch. We had been to their old location many times . This visit they brought water and our wine. I looked in my water and there was a bug in it. I told the waiter and he brought another and guess what another bug. My looked in hers and it also had a bug. If they do not pay attention to the condition of their ice machine I wonder what else could be Filthy. Only 1star", 
    "review_date": "2013-11-10"
  }, 
  "akWP3TXxxMeECZzQZ22NPg": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Leonard A.", 
    "review_text": "Yesterday, 5/10, we came to Fior D' Italia for an early dinner.  Our party included 5 adults and two children, one of which was 5 1/2 months old.  Even though we were not dressed as well as some of the other patrons we were treated with the same respect.  Though the food was excellent it was the service that made us instant fans.  We came in with a stroller that didn't seem to bother the staff-when it started to become a bit busier they placed it in another location and brought it to us as we were leaving.  Through out our entire meal we were well taken care of.  I must say thank you for a great experience.", 
    "review_date": "2014-05-11"
  }, 
  "VxLDLEO4AgL7R0mKTX21tA": {
    "user_rating": 4.0, 
    "user_location": "Duluth, GA", 
    "user_name": "John G.", 
    "review_text": "Nice. Felt pretty italian and upscale. Somewhere in between italian district and fishermans wharf so not perfect location, but close enough that I walked from the Wharf.   The atmosphere was great and the food was good, though my pesto was a little more \"creamy\" that I would have expected for authenticity's sake. But in America you can't expect perfect Italian.   Aside from that my wait service was a bit slow, but on observation i felt everybody else had extremely attentive and friendly staff. 4", 
    "review_date": "2014-04-02"
  }, 
  "zryZ3TFMMMob-gbsDKsjvg": {
    "user_rating": 5.0, 
    "user_location": "Englewood, CO", 
    "user_name": "Holly H.", 
    "review_text": "Upon the recommendation of my grandparents, my husband and I had dinner here during our first visit to SFO. Given that my grandparents had held onto the business card from their visit 15+ years ago, I had high hopes. And they were met. The food was excellent, particularly the chicken tortellini my husband had. We also really liked the still steaming bread that was served while we waited for the entree.  What I was particularly impressed with was how the host treated us. We wandered in off the street, not dressed fancy in the least, and the host was extra engaged with us, when I expected the opposite. He stopped by multiple times, and was very friendly and engaging. We will certainly recommend this to other friends and family who visit the city.", 
    "review_date": "2014-06-19"
  }, 
  "wZMS_PogmM77_9gpUtPL7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jack d.", 
    "review_text": "Me and my wife and son ate at Fior D'Itaiia for New Years Eve. It is located in the North Beach district off of Bay St. It is a short distance from Fisherman's Wharf also. The reservations were for 6:00 so we arrived on time and entered through the bar door and escorted over to the restaurant's entrance where we met with the host who is a amiable and friendly guy. The ambiance of this restaurant is pleasant and the noise level here was reasonable. It was not crowded at all at this time of the early evening. We were seated and the waiter quickly arrived and took our orders. I had the veal picata which came with potato and sting beans, the wife had the chicken with the same sides and my son had the fish. We also ordered a side of sauteed mushrooms which were good/ Dinner also comes with bread and there is olive oil for dipping. The food was presented well and tasty. For dessert we shared tiramisu and my son opted for vanilla ice cream. I also ordered a capuchino to go along with the dessert The tiramisu is served in a sundae glass and doesn't look like the traditional cake I am used to but more like a ice cream dessert. It was okay, not what I expected though.The price for dinner including a mixed drink and a glass of house chardonnay was very reasonably priced. The waiter was efficient and the other waiter staff were all good. There is valet parking for $9.00 which is very nice. Overall we had an enjoyable experience here", 
    "review_date": "2015-01-01"
  }, 
  "gxhL4EPRyUEmx7jZhQTQvg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Googie G.", 
    "review_text": "I am really quite disappointed with the re-opening of one of SF's oldest restaurants. I went in to have a holiday cocktail and re-visit a restaurant I frequented many times prior to their closing.  The place was empty on a Sunday during brunch hours. We sat at the bar and was greeted by a young man who took our order then went to the back and brought out an elderly gentleman who made the cocktails. Nothing fancy champagne cocktail and a 7&amp;7. The bartender ? stated the man who made our drinks was the owner. That surpised me as the recent SFChron article on the re-opening stated it was a couple (who appeared much younger in the photo than the man who made are drinks). The restaurant now has a bar menu and we ordered 2 small plates which were fine. The place was freezing cold and no one came in while we were there. But, the killer was when I got the bill I was charged $30.00 for 2 champagne cocktails (which were made with splits that were placed on the bar). I still kick myself for not calling this out! I eat out alot and I know what drinks are costing these days and as a native San Franciscan I patron alot of restaurants that have been here for a long time and wish that they continue. I don't know if this restaurant will pick up but for a Sunday during brunch an empty restaurant is not a good thing. I wish them well but won't be going back.", 
    "review_date": "2013-01-08"
  }, 
  "-q33cZAyZojX5w6mMogqxw": {
    "user_rating": 1.0, 
    "user_location": "Saint Helena, CA", 
    "user_name": "Matthew G.", 
    "review_text": "Tried to eat at Fior d'Italia at the end of December... we had a gift certificate purchased for half off about 2 years ago, which said that it never expired (but could only be used Mon through Thurs)  We finally got a chance to go into the city on a weeknight, and made a reservation at Fior d'Italia. When we got there, the place was practically empty.   No wonder. The service is awul. As soon as we sat, the first thing the waiter said to me is \"you look tired\" -- wow, thanks for the compliment, buddy! (I should have replied with: \"You look like a 60 year old man waiting tables in an empty overpriced restaurant.\")  Since I had already spent $25 to eat at this place, I let them know about the coupon/certificate before we ordered. The host/manager comes over and says \"management has changed, and we will no longer honor that deal.\"  Hmm... interesting. I have, essentially, a contract saying that it never expires, for an establishment with the exact same name and location as they have, and they are saying they don't have to honor it.  Well, the meal would have been over $100 for the 2 of us anyway, since the food is so overpriced (minimum price for a meat dish is like $30+), so we decided to just take our business elsewhere. Instead of getting the chance to (a) honor our ALREADY-PAID-FOR certificate; (b) win over a repeat customer for the future (we are relatively local); and (c) have us bring additional big-spending business associates there when they visit for company matters... instead, they got ZERO dollars from us   (it was a blessing in disguise, because we went and spent $130 at Le Trappe, the Belgian food/beer place a few blocks down on Columbus, which was a great little discovery...)  From the fact that a nearly-empty restaurant still treats their customers like crap and won't honor existing agreements, they clearly don't care whether they get your business... so I suggest you just don't give it to them. I know I won't.", 
    "review_date": "2013-02-09"
  }, 
  "3nF1_mLfesXslABHct2nOA": {
    "user_rating": 5.0, 
    "user_location": "Florence, Italy", 
    "user_name": "Rachel M.", 
    "review_text": "Happy hour here is amazing! Half price bar food and all drinks. Doesn't get much better. Plus jazz on Wednesdays. We come here a lot and always have a great time!", 
    "review_date": "2014-04-17"
  }, 
  "VlcErpGoBWMZSGNgBlC2eg": {
    "user_rating": 5.0, 
    "user_location": "Anaheim, CA", 
    "user_name": "Admired Drunk V.", 
    "review_text": "If you love gnocchi then you have to try this place. I guarantee you will be amazed how good it is. They melt in your mouth.  No other restaurant prepares them as good as they do trust me I tried many..... I've been coming here since I was a kid.  The restaurant had been open for over a hundred years. Food is always consistent and staff makes you feel so welcome..... I drive over 400 miles just to eat their gnocchi's I'm not kidding!", 
    "review_date": "2013-07-21"
  }, 
  "GZ57sdLhywdfjXbCHbYjfg": {
    "user_rating": 4.0, 
    "user_location": "Spring, TX", 
    "user_name": "Dave D.", 
    "review_text": "My wife and I had our first date at the Hotel San Remo 31 years ago. We drove by to show our now adult kids \"where it all began\". We pulled up and saw that Fior D'Italia had relocated where the old restaurant had been. I had enjoyed Fior years ago at it's original location near St Peter and Paul church. So we had an early dinner with other tourists in shorts and sweatshirts. I was surprised there were about six or eight groups eating at 5:30 pm.   I had the osso bucco which was done perfectly. My wife had the chicken with prosciutto that was delicious. The meat sauce was as close to my homemade as I have had since Patsy's in Manhattan.     My only criticism was the meatballs my daughter had. It may be authentic or their preference but it in my opinion. It was over seasoned with (I think) sage. It was just too strong a flavor for all of us (we all tasted it). In fairness to them we didn't complain. We had plenty to eat.   Peaceful location between North Beach chaos and Fisherman's wharf.   Surprised valet parking was around $10.", 
    "review_date": "2014-07-12"
  }, 
  "D-y2sUlngXEc3ukVs87Jsw": {
    "user_rating": 5.0, 
    "user_location": "Indianapolis, IN", 
    "user_name": "Amalia B.", 
    "review_text": "We walked in today in and had a lovely meal. Service was excellent, risottos were all very good but seafood risotto was excellent and the pasta bolognese. The raspberry sorbet and ricotta cheesecake were great.", 
    "review_date": "2014-08-04"
  }, 
  "jEekGB8GY5KHBVhF4Aoh2g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aimee P.", 
    "review_text": "I guess I wrote my original review on the wrong page? Hopefully this page is correct.  My boyfriend and I went out on a date night here a few days ago and it was just lovely!   We had a deal from <a href=\"/redir?url=http%3A%2F%2FHowaboutwe.com&amp;s=623a1304478b501ce2dd14990e79ffd9d175421e29df2657da37f4ce6f119886\" rel=\"nofollow\" target=\"_blank\">Howaboutwe.com</a> that got us one appetizer, one salad, and two entrees. There was a bit of a mixup at first and our waiter (Gill, who was very sweet and helpful by the way) told us to order only from the list of items that were excluded from the offer (which was a very small list) but once we sorted that out we ordered our actual items and received some bread and drinks very promptly! Gill also made a delicious wine recommendation. Also the maitre d was very attentive and apologized about the menu mixup and stopped by a few times to see if we were enjoying everything.  In addition to the items we ordered from the deal, we also ordered fresh oysters and some cocktails. The Suffering Bastard is delicious. My boyfriend got it and I almost wanted to order one along with my wine. :P The oysters were also very delicious and fresh but out of the 6 we got, two had some grit. It was also super awkward as I was picking shell bits out of my mouth when the maitre d stopped by and asked how we were doing so I had to cover my mouth and just be like, \"MMMMHMM, GREAT, THANK YOU\"   But besides that, everything was delicious. The ravioli I had was awesome. My boyfriend liked the gnocci but said it wasn't as good as his mom's (but that is biased obviously, I enjoyed it and thought it was good). Everyone there was super friendly, attentive (but not overly so) and helpful and made the experience wonderful!   Also, at the time of day we went (5:30-6:30 or 7ish) the sun was coming through all the glass windows and it cast everything in such a lovely glow. It was beautiful. I really enjoyed the whole atmosphere and even though the neighborhood outside isn't particularly visually appealing (there was some construction and street cleaning going on) it looked lovely that day from where we were sitting. I definitely want to go again sometime!", 
    "review_date": "2013-06-04"
  }, 
  "MvkkQ42ulIv-9Vafrs_QvQ": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Noelle R.", 
    "review_text": "So delicious and great atmosphere! The staff is very friendly and made us feel welcome the moment we walked in. The food is some of the best Italian my husband or I have had.  They serve delicious warm ciabatta bread while you wait. We tried the Caesar salad, Tortellini, and Gnocchi for dinner, loved it all. We asked for a scoop of their vanilla gelato with a shot of espresso, and poured it over the gelato. So incredible! Their cannoli was also very good.  Highly recommend it here. They've been here since 1886. Our server Octavio was really great too.  We will definitely be back.", 
    "review_date": "2014-08-14"
  }, 
  "TSXhE-W7FF2wQA4SBg0EXA": {
    "user_rating": 4.0, 
    "user_location": "Victoria, Canada", 
    "user_name": "Flemming A.", 
    "review_text": "On holiday in San Francisco and went here based on recommendations and we were not disappointed. Lucked out with live music on a Wednesday night. Service was excellent. We never felt rushed and the waiter anticipated our every need. After dinner we sat and enjoyed the music.   We had oysters and kalamari for appetizers. Both were good, the kalamari portion was huge. Followed with fresh pasta which was also delicious. The wine list is not huge but still a good selection with a number of good Italien wines. Finished off with an excellent espresso.", 
    "review_date": "2014-04-23"
  }, 
  "I9wjC0MrCfMbnXYwYvXCDw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David J.", 
    "review_text": "Truly a special place.  The food is excellent, especially the mushroom risotto.  As others have said and I can verify, the service is really exception.  Quite a neighborhood gem.", 
    "review_date": "2013-07-19"
  }, 
  "GOqIAiMnrcl22H6O1jnmKQ": {
    "user_rating": 5.0, 
    "user_location": "Brisbane, Australia", 
    "user_name": "Timothy K.", 
    "review_text": "Enjoyed a great dinner here. I had some of the best prawns i've ever tried.  Also had a great seafood pasta. Service is excellent too. Good value for money in this price range. I would recommend.", 
    "review_date": "2014-09-08"
  }, 
  "XQGtmO7WkkchOL6gu21M8A": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Petra K.", 
    "review_text": "Great place for peaceful atmosphere and good Italian food, very friendly and quick service. Old style elegant, placed in a hotel easy to get to by walking from the fishermans wharf.", 
    "review_date": "2014-10-09"
  }, 
  "Sg7PA3qI31MRBKwg6SWSjw": {
    "user_rating": 5.0, 
    "user_location": "Presidio, San Francisco, CA", 
    "user_name": "Rachel O.", 
    "review_text": "Great food, excellent service, luxurious atmosphere.  Reasonable corkage fee (18 per bottle).   My friends and I went here for post valentines day triple date.  All of us loved our food, we actually couldn't help sharing.  Not a single dish was disappointing, and I think we ordered 14 all together.  Our waitress was an opera singer and we asked her to sing for our table, it was the highlight of the evening.  Also, get the desserts with wine, it is delicious.  Lovely experience.", 
    "review_date": "2014-02-17"
  }, 
  "_xNDDFtqLpbV4x_UuBrgMQ": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Raquel T.", 
    "review_text": "Well where do I begin? I naively came to this place because I saw the hype about it on the food channel. Trust me on this one don't believe in everything you see and hear on TV because you end up looking like a gullible fool like I did. Sadly I came here today for my birthday and let me tell you it is not all that. Shit Olive Garden is better than this place. Let me first start off with the shitty service. The waiter comes and takes our order and as he's taking our order he gets a snappy attitude because my cousin is asking about the meat sauce. Then he doesn't check on us, doesn't refill our water, and then proceeds to take our appetizer and doesn't ask if we are done. Then the food is absolutely awful. We waited an hour for our food no joke and when we finally get it it's cold, bland, and just tasted disgusting. Then when they sing you Happy birthday and bring you the dessert you think it's free but they surprise you at the end when they charge it to the bill and your like wtf most restaurants give you a free desert on your birthday.  Well not this place. Lastly not only is the staff snobby and looks down on you in utter disdain but the clientele does the same thing. We walked in and immediately we got that uncomfortable vibe like we didn't belong there. Then the wtf are you doing here / disdained judgemental looks started throughout the whole night which made the experience even more unpleasant. I felt like I had gone back in time to the 50's when minorities are trying to get a meal at a diner but instead get passive aggressiveness and hostility from the staff and clientele. I smell prejudice.  I mean what did I expect when we were the only Latino family there and everyone else was middle class white baby boomers and their fucking parents. Disgusting!!!! Never coming here again. Shitty service, shitty food, and shitty clientele and way to over priced.", 
    "review_date": "2014-03-09"
  }, 
  "XJ9MF-fk1V9KsbZ7jWt0pA": {
    "user_rating": 5.0, 
    "user_location": "Westfield, IN", 
    "user_name": "Margaret T.", 
    "review_text": "Had a great time.  Service was friendly and attentive. Would go back.", 
    "review_date": "2014-06-16"
  }, 
  "8AB1Q_opZsnhxt1aLOvx5g": {
    "user_rating": 4.0, 
    "user_location": "Beaumont, TX", 
    "user_name": "Sheila M.", 
    "review_text": "The owner apologized for the message that was apparently meant for someone else. Again, the food was very good and we had good service.", 
    "review_date": "2014-12-04"
  }, 
  "OyetWwk8Gx46F36rirQ-Uw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn L.", 
    "review_text": "This place is mediocre. It has an old school setting and the entrance is a little odd. You would have to go through the second door next to it and walk through the restaurant to meet host. You'll see what I mean.. The service is a little disjointed and seemed like they had less staff. I had their wine, paso creek Cabernet which was really good. If you like dark, bold wine, I highly recommend that. Overall it was ok/decent.", 
    "review_date": "2014-12-29"
  }, 
  "jrRC8nWzcYUTyLf4GE6UPg": {
    "user_rating": 5.0, 
    "user_location": "UT, UT", 
    "user_name": "Andrew M.", 
    "review_text": "Truly the best Lasagna I've ever had and a really great atmosphere. This is the oldest Italian restaurant in America. Cool to be here and read the history of the 3 fires. Really great service and food. Also really great rating and quality olive oil. This place is great!", 
    "review_date": "2014-10-15"
  }, 
  "-shHTy1CEmSMPVSehdASaw": {
    "user_rating": 3.0, 
    "user_location": "Alameda County, CA", 
    "user_name": "Doctor G.", 
    "review_text": "Went to a large group dinner here recently.  This used to be the San Remo restaurant a long time ago.  We were taken to a back room which was perfect for the event.  Fixed price and choice of three entrees.  I was not a big fan of the chicken breast with tomato sauce and olives.  Salad was good.  Service was excellent, considering the size of the group.  I'll need to come back and try the restaurant instead of the banquet.    Flor D'Italia is located very close to Fisherman's Wharf despite not being that close to the water.  Certainly worth dining here if you're staying in the Fisherman's Wharf area.", 
    "review_date": "2013-10-29"
  }, 
  "OvteZk2gWKfIRAryq7T9KQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda B.", 
    "review_text": "Happy hour menu 1/2 off.", 
    "review_date": "2013-06-09"
  }, 
  "5HEbeSrj8CJxw1VGNXV4KA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jew M.", 
    "review_text": "This place is Great!  The Service was amazing, probably one of the best experiences I have had in the restaurant industry.  The food is delicious, with a lot of flavor!  I would def. recommend coming here for all occasions.  The people that left the bad reviews are completely crazy, and I would DEF. recommend coming here!", 
    "review_date": "2013-01-05"
  }, 
  "ZT7jXDWQe0qti8RaXezHLA": {
    "user_rating": 4.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Bob F.", 
    "review_text": "Had a group dinner of 30 in private room for business.  All the staff did a great job. Bartender even helped my guests beforehand by giving them excellent service with happy hour prices. Octavio our server and Lalo the manager made sure we all had a good time. Food was very good, atmosphere fun.  Enjoy. Highly recommend if near wharf, but don't want extreme touristy feel.", 
    "review_date": "2015-01-12"
  }, 
  "TG6i2mr4VUHZCmObD_WVPA": {
    "user_rating": 4.0, 
    "user_location": "Grantsville, UT", 
    "user_name": "Scott G.", 
    "review_text": "Our last night on a business trip to San Francisco, we decided to try this restaurant that we pass often. Throwback styling with white tablecloths and moniker stemware created a neat ambiance. Wood carving of a gent in a chef's coat was cool.  Service was good. Bread delivered quickly. Olive oil tasted freshly pressed. We ordered fresh oysters and pancetta wrapped prawns. Delicious. Careful of the Tabasco sauce on the oysters. Very strong   Entrees of fresh pasta lived up to the hype of the menu. Pesto was good.  Worth a visit if you want to try something in North Beach that is not Fisherman's Wharf kitschy.", 
    "review_date": "2014-03-07"
  }, 
  "fdJQGLf_ywbROElu7f04xg": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Karen O.", 
    "review_text": "I had great expectations of this restaurant since I had often dined at Fior D'Italia at the old location where Original Joe's is now. Plus, my parents held their engagement party at Fior D'Italia. From the moment I drove up and the moment I left, I was disappointed.  First of all, there was a sign that read Valet Parking, No valet in sight. I waited a few minutes and then decided to leave my car in front of the restaurant (with hazard lights on and the keys in my hands) and look for the valet. NOT A GOOD SIGN. The valet parker came out and finally parked my car.   I walked through the bar and was not impressed. Then I walked through the dining area and it dawned on me that I have seen more exciting dining rooms in assisted living facilities. My big mistake was thinking I'd just give it a chance.  My dinner order was simple and very Italian: A Caesar salad and lasagna. How can that be messed up? The salad was over dressed and not tasty. When they served the lasagna, I took one look and thought OMG! Grossly over cooked pasta with grayish looking meat. Absolutely no appealing presentation..slopped (in lack of a better phrase) on a boat plate.. Tasteless. Seriously?! This is not Italian food and those who enjoyed it must be from another planet.  Service was slow and not very professional (like the valet). The Maitre'd seemed totally oblivious to the diners. I had to ask for my check after not even eating half of my plate.   I was born in SF and this experience really upset me. I know they have changed owners. It is sad that people read about past glories of this restaurant, visit it and have to deal with poor service and even poorer food.", 
    "review_date": "2014-10-02"
  }, 
  "lBaoq2G8xXrSX_esMQXM-A": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Dianne M.", 
    "review_text": "Bar hopping on a Sunday late afternoon got a recommendation from a local pub of where to go for snacks and a great happy hour and boy where they right.  Their happy hour was half price on appetizers and drinks every day.  We tried the calamari, meatballs and the steak tips and I rate them in that order.  The fried calamari was barely breaded which meant the seafood needed to be top notch and cooked perfectly and it was, very tender and tasty.  The meatballs were moist and sitting in a hearty red sauce which paired perfectly with the sour dough bread we were given.  Not a drop of sauce was left on the plate.  The steak tips were OK but they wouldn't be something I would order again, the sauce was a bit sour for me.  But I will say we did finish them.  Can't wait to return on another one of our weekend bar strolls in North Beach.", 
    "review_date": "2013-03-27"
  }, 
  "ZjmHqQ_iugiF0GzDFLSkkg": {
    "user_rating": 5.0, 
    "user_location": "Elk Grove, CA", 
    "user_name": "A R.", 
    "review_text": "What a great neighborhood gem! Had the meatballs at the bar during happy hour, very good. Wife and I had dinner after in the dining room, mine was Bucatini, spicy good. She had the Saltimbocca very nice as well. Waiter was excellent, treated us like family. Overall experience was great! I would definitely return and recommend to my friends and family. Thank you guys!", 
    "review_date": "2013-03-01"
  }, 
  "dGtsHOFYxPyJL5qK8k49kg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken M.", 
    "review_text": "A San Francisco institution.  Fior D'Italia is steeped in history, but never forgets what is important.  Classic Italian Fare with a \"Cheers\" twist.  This is  great place for the neighborhood folks to congregate.  They have an unbeatable happy hour  from 4-7pm every day, with great bar food deals.  If you are hungry for more, there is an extensive italian menu to chose from. Service is friendly,  and bar specialty cocktails like\" the Trixie\" and the \"tiramisu Martini\" are not to be missed.  The Bar has good separation from the restaurant, and has an elegant, upscale feel, without being cold or impersonal.  We'll be back, again and again!!", 
    "review_date": "2014-05-26"
  }, 
  "vFYc4WydEzBxgqudfYmtog": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Padre C.", 
    "review_text": "Recently had dinner at the Fior D'Italia after a 50-year hiatus. Much has changed, of course, including the ownership. The food was very good, the service better. San Francisco has several Italian restaurants; a few are better and more expensive than the Fior D'Italia. Most are derivative. The five people in our party each had different entrees, and all enjoyed their meals. My rustic grandniece had rabbit and pronounced it excellent. Rabbit, for cry in' out loud! Poor wee critter.  A few Yelpers here said the staff was rude. Not my experience at all. I was greeted like an old friend. Everything was served promptly and courteously. On the not so wonderful side was the Wednesday jazz in the dining room. The music was enjoyable, but it made having a table conversation difficult. Go another day.", 
    "review_date": "2014-07-02"
  }, 
  "XSZPZO0BwGFAgb9JTK12-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria K.", 
    "review_text": "Great music!", 
    "review_date": "2015-01-20"
  }, 
  "3WgJQAk7MirwvHqSs-VPUQ": {
    "user_rating": 4.0, 
    "user_location": "Granite Bay, CA", 
    "user_name": "Sandra L.", 
    "review_text": "Happy Hour is beyond belief. Fabulous martini's &amp; great appetizers 50%. The bartender Gio, makes a very good, I mean a very good drink. We had a great time at this SF institution.", 
    "review_date": "2014-10-24"
  }, 
  "R6LxLsWWy4WUgvHOegy1SQ": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Mark S.", 
    "review_text": "Fior D'Italia, SF, Ca..3rd location in the past 4 years, now closer to Fisherman's Wharf than North Beach. With the lack of even fair Italian cuisine in Honolulu, we ordered the staples - Prosciutto and melon was B+, Caesar's salad B, lasagna C, linguini and clams A, panna cotta A, coffee B, wine list C (way over priced), ambience B+, service C- (wait staff never removed our dessert plates before giving us the check!)..", 
    "review_date": "2015-01-03"
  }, 
  "3gk1Zmv430gr6x5B7Wjohw": {
    "user_rating": 4.0, 
    "user_location": "Seaside, CA", 
    "user_name": "Erik C.", 
    "review_text": "First impressions are not everything.  Upon arrival we were greeted by the valet playing on his cell phone (a pet peeve of mine), I had to approach him to ask if he was indeed the valet for the restaurant. Things were not off to a great start, but changed quickly upon our entrance. The ambiance was elegant old school italian, the waiter was charming and knowledgable, and the food was great. I particularly enjoyed the antipasto appetizer, a special that included cantaloupe with prosciutto, and the tagliatelle bolognese (featuring perfectly al dente handmade pasta). In the end this felt like the classic sort of establishment that can never go out of style. I plan to return", 
    "review_date": "2014-09-28"
  }, 
  "UmIPv2IcGQyM6TbF3IlPQQ": {
    "user_rating": 5.0, 
    "user_location": "Beverly, MA", 
    "user_name": "Phillip B.", 
    "review_text": "I had an incredible experience. The entire staff as well as the guests were the most welcoming people I came into contact with during my short stay in San Francisco. The food was delicious as well as the wine. Quail with polenta, outstanding, as well as the pasta.  Phil from Boston, Grazie!", 
    "review_date": "2013-02-24"
  }, 
  "BX_HN7TaRrHB-fRqFiyfDg": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Kristy G.", 
    "review_text": "Excellent food, excellent service. True authentic Italian food. The best bread!!! Great prices, great house wine. What more could you want!!!", 
    "review_date": "2014-07-04"
  }, 
  "rZXJfFrhofjyFhas8JaaxQ": {
    "user_rating": 5.0, 
    "user_location": "Indianapolis, IN", 
    "user_name": "Bryn K.", 
    "review_text": "It has renovated and re-opened", 
    "review_date": "2013-01-06"
  }, 
  "C4HXzu1dG4iIvQ5QNZ_tJQ": {
    "user_rating": 1.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Divya M.", 
    "review_text": "I didn't like it! I didn't like the taste, though they were quite obliging to accept in making pastas and appetizers which we want.", 
    "review_date": "2015-01-30"
  }, 
  "zm7vxpzRUEB3hxDmDIUK4Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sam c.", 
    "review_text": "Great experience.  good hardworking crew working there and new owner. Try the veal parmigiana, still my favorite.", 
    "review_date": "2013-12-31"
  }, 
  "kppBguKirqfI2obSQ15d7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tom s.", 
    "review_text": "If I were able to give Fior 6 starts instead of 5 I'd so it!  We are a group of 8 and we've gone out to eat together in SF nearly every Friday night for the last 20 years.  Our experience last night at Fior was amazing.  We were greeted by Lalo, the manager, and seated in a private area of the main dining room.  The unhurried service was absolutely impeccable.  We ordered a Zinfandel, which upon tasting was really not to our liking, but we said it would be okay.  The server--without being asked--suggested he take it back and bring us a different wine altogether.  We hesitated but he insisted.  He pleasantly took the bottle away, and brought us a much nicer wine (only a few dollars more than the first).  The menu has many \"old style\" Italian pastas and entrees.  The side order of three kinds of mushrooms was out-of-this-world.  Everyone enjoyed his or her meal.  The pistachio ice cream and the panna cotta provided an outstanding finale to a thoroughly enjoyable evening.    I don't understand the bad reviews.  We enjoyed it so much we've made reservations for a return visit in four weeks.", 
    "review_date": "2013-02-09"
  }, 
  "L9ZmCfOzeMN1HshgJ49fzQ": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Marie N.", 
    "review_text": "Absolutely amazing dinner!  My boyfriend and I were looking to try a new restaurant and came across Fior F'Italia. Immediately felt a good vibe walking thru the door. The staff is so friendly and the food is phenomenal. From the wine to the app to the main course to the dessert and finally the after dinner cocktail. A tiramisu martini.  To. Die. For. I called my mom to tell her about this place and told me that's where my grandparents had their wedding reception 56 years ago!  That's where that good vibe came from! :)", 
    "review_date": "2013-08-15"
  }, 
  "nqKQczyvryGk0ioZnow2CA": {
    "user_rating": 5.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Jen B.", 
    "review_text": "Everything was great. We sat in the bar for 45 min before our ressie and had 2 great appetizers (ravioli with veal ragu and tomato bruschetta). Then when we sat down, we had cioppino and filet with a red wine reduction sauce and tiramisu. Everything we ate was fabulous, the service was impeccable (Octavio was one in a million!) and we have zero complaints, only raves. Highly highly recommend!", 
    "review_date": "2014-06-06"
  }, 
  "KSVXQY7qC32tIWGaXREkng": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Jason W.", 
    "review_text": "Our food was fantastic, prices were very reasonable for San Fran and they accommodated our group of 15 people within 10 minutes.  I had the Minestrone soup and the Veal Picatta and both were very good.  I look forward to going back again.", 
    "review_date": "2014-05-28"
  }, 
  "tUwDJr5nc1P-x4_H-1B4mg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kristina P.", 
    "review_text": "This place is amazing. The happy hour is every day with great food and drinks for reasonable prices. The staff is always welcoming and friendly. The ambiance is charming and warm. Gio is always in a great mood and recommends the best cocktails. If you're into Italian or maybe just a lush- come here first!", 
    "review_date": "2014-10-28"
  }, 
  "Ime4BTI6TY1WC37UO5OOFg": {
    "user_rating": 1.0, 
    "user_location": "Brick, NJ", 
    "user_name": "Gabby G.", 
    "review_text": "Service was good! The portions were ridiculous small for the price. Told the waiter he sent the owner over, an older guy came over and said that is the portion. I explained to him I'm in The restaurant business and it's ridiculous to serve two small pieces for that amount. Server told me they have multiple problems with this. Owner needs to retire he is out of touch.    -Don Alonzo (dined here one Jan 20 2014)", 
    "review_date": "2015-01-29"
  }, 
  "wKWUbNmLHa0XqTBCWcw6xw": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Mike G.", 
    "review_text": "I recommend happy hour.  1/2 off all drinks and bar food from 4-7pm everyday.   Unfortunately happy hour was the best part of the meal, our dinner was just ok, nothing spectacular.  I ordered the Linguini Con Vongole.  The sauce had way to much oil and not a lot of flavor.  I tried my girlfriends Chicken Marsala which they made special for her so extra star for the service.  The sauce was good but the chicken was overcooked and chewy.    The menus seem like something the Olive Garden would hand you.  They are one piece of paper front and back with some colorful design on them.  Very cheesy.  It is just weird for a restaurant that has been around as long as this place.  I expect a nice menu in a nice leather case or similar.    I'm sad to say, we will not be going back anytime soon.  Its unfortunate because this place used to be so good.", 
    "review_date": "2013-07-11"
  }, 
  "QZ57c705ZYoGe9wIKJLEUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura A.", 
    "review_text": "My husband and I love coming to Fior D'Italia. It's near our apt so we like coming here on lazy Sunday nights when we don't feel like cooking. It's all about the HAPPY HOUR! Every day from 4-7pm. The food menu is just OK. I feel like the portions are very small (making up for the small price) and I haven't found anything that is as delicous as the full-priced pastas. But it's all about the HALF OFF drinks! All beer, wine, and cocktails are half off. Including top shelf alcohol.  FOOD: They have many homemade pastas. My favorite is the pesto pasta. A nice al dente pasta with a very good pesto sauce.   DRINKS: Again, come here for happy hour to get half off drinks.  SERVICE: We love coming here and are always welcomed with open arms and often a hug from Gio (one of the bartenders/servers). The rest of the staff are always super nice and friendly too. I love that they are in nice black pants, white shirt, vests, aprons, etc. Very classy.  This is the oldest Italian restaurant in the city (though not the original location). I love the old school ambiance here.", 
    "review_date": "2013-11-06"
  }, 
  "bJ8H2x_b4FWjzKGoDxbgEA": {
    "user_rating": 5.0, 
    "user_location": "Manchester, IA", 
    "user_name": "Ruth V.", 
    "review_text": "On a bus trip to San Francisco.  Our tour guide suggested this wonderful place.  Bar food half price during Happy Hour which is 4:00 - 7:00.  Shared 8 items that were excellent.  Very friendly.  Excellent service.", 
    "review_date": "2014-06-06"
  }, 
  "AJ1uUvxNkDPtz0qHUWuPog": {
    "user_rating": 2.0, 
    "user_location": "Riverside, CA", 
    "user_name": "Patrick S.", 
    "review_text": "I thought this place would be more packed after appearing on TV, but San Franciscans aren't stupid. Our cab driver didn't even know where it was. On our way to this restaurant we passed a trattoria, and our cab driver assured us that they are the best italian in San Francisco, he was right.   . Bad service, enough said.  Pros: The frog legs are pretty good.", 
    "review_date": "2013-07-30"
  }
}