{
  "FmOWYHKbg8hv9zdE8uRjuQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Howard J.", 
    "review_text": "Great place, been here multiple times. I want to say the Flying Pig has a good staple of beers, drinks, and food. I recommend their Caprese sandwich, the steak sandwhich, or the pastrami reuben on rye(?). I've had several of these sandwiches, and you can't go wrong with them. Their soups as well, I enjoyed the wedding soup and spicy turkey chili. There is always great company here, the bartenders are very helpful and friendly. Two thumbs up, and youll most likely see me in there.", 
    "review_date": "2012-10-29"
  }, 
  "ZJMrk2BwAkN0Dtc73qtN8g": {
    "user_rating": 2.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Christian W.", 
    "review_text": "A few of the options I've had here on workday lunches were cringe-worthy, namely the salads.  The chicken waldorf and the asian-something salad were lame attempts.  At those prices, I felt trapped by the location in that they weren't trying hard because they don't have much competition.  I'm unlikely to ever go back.", 
    "review_date": "2015-01-05"
  }, 
  "5Z-3tcM07Pyc4mOF2Rjt6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "This definitely a hidden gem in a shitty area of the Mission, but don't the let the across the street construction dissauade you from paying the Flying Pig a visit.  They have reasonably priced and delicious sandwiches for sale.  So often the chicken, bacon, avocado sandwich gets messed up (don't even ask me how this happens), but Flying Pig got it right.  The free Wi-Fi was an added bonus and the generally calm vibe of the place made it a pleasant place to dine and work.  Also, I am pretty sure I spotted a million outlets.  The only negative might have been the overzealous positivity of our server.  This has less to do with the Flying Pig and more to do with my cold, cynical heart.", 
    "review_date": "2013-01-06"
  }, 
  "Y4UYb1fgs7bLbSp08amiBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "Great neighborhood sandwich/coffee/beer spot.   Great beers on tap (including Franziskaner) and a wide, eclectic lunch menu.  I had the steak/roast-beef with horseradish and the bread was toasted just right, and the flavor were perfect.   It's a little darker inside, but really cozy feel.", 
    "review_date": "2013-10-04"
  }, 
  "peM4n2DCXVyDpr2uLmDhmQ": {
    "user_rating": 5.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Eric R.", 
    "review_text": "I just started working at San Francisco Hyundai in the Mission, and the Flying Pig Bistro is just a couple of doors down from us. The place has great food and a super friendly team! Needless to say, it has quickly become my favorite place to go out to lunch, and I have even started to have business meetings there with vendors. They all love the food too!", 
    "review_date": "2012-09-13"
  }, 
  "B4M8P0jStAXcBAYgPZLLeA": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Matt P.", 
    "review_text": "Back again for another bomb salad. The people here are so nice and always seem to remember you. The bonus for me today was that they have 18 beers on tap. I said 18 beers on tap. So here I am, chilling in a coffee shop, already had my coffee, ate a bomb salad, quietly enjoying the music and occasionally watching the game, and suddenly becoming thirsty again. I guess all there is to do now, is decide which of the 18 beers I want to have. Did I just say 18 beers again? Maybe I'll try a couple, who knows...The one and only thing this place is missing is a medical dispensary. Well, no place is perfect, but this one at least exceeds my expectations, so I guess that deserves 5 stars or more.", 
    "review_date": "2013-05-09"
  }, 
  "7VP1ZYNPTHGmBjmPq-5hSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda K.", 
    "review_text": "Clean restaurant, casual feel. Friendly staff. Food came out in a timely manner and my bread and roasted veggies were certainly fresh.  Lots of gluten-free options though I don't have that dietary restriction so I don't know how good it was.  I would visit again.", 
    "review_date": "2013-08-07"
  }, 
  "utEaUV8yq0X2iqwqE0gbNw": {
    "user_rating": 5.0, 
    "user_location": "Oakland Hills, Oakland, CA", 
    "user_name": "Chris M.", 
    "review_text": "Wonderful and caring staff here. They seem sincere when they speak to you. The venue is nice for lunch. There's plenty of open space with multiple TVs! It's clean inside and the chairs are comfortable.   The food hear is eclectic for bistro standards and yummy (from my one visit). You can tell they take the time to craft their sandwiches with care, which just translates in to great taste and texture.   Flying pig bistro is one of my favorite places to eat in the mission.", 
    "review_date": "2013-05-16"
  }, 
  "3sCgp7Ft66i-3Y1tHKxEWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina F.", 
    "review_text": "We love the gluten free options here, but we also love the people. The owners are incredibly friendly and made us feel very welcome. We came here for all of the Giants world series games with our 2 month old and everyone was so nice. This is a favorite for sure!", 
    "review_date": "2013-04-11"
  }, 
  "z0VgpuZiF7BvMx_Suy6ZGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rikki J.", 
    "review_text": "And the delicious vegetable soup returns! Hooray!", 
    "review_date": "2014-05-19"
  }, 
  "tr6cJlPxp0TTazYp2yUqMA": {
    "user_rating": 5.0, 
    "user_location": "Fort Mill, SC", 
    "user_name": "Andrew C.", 
    "review_text": "Clearly labeled gluten free options. Staff was friendly and willing to look up ingredients as needed. Delicious gluten free food choices. I would definitely recommend this place.", 
    "review_date": "2013-06-22"
  }, 
  "MDIq7ImnTnZOldnAmdkMMw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Sarah R.", 
    "review_text": "Such a nice change from the overcrowded and uber-trendy coffee shops in the neighborhood.  The BBQ Flying Pig sandwich is delicious, as are the cabbage rolls and the apple pastries.  Prices are more than reasonable.  The owners are super hospitable.  The decor, eclectic and homey.  Lots of good-sized tables available, and outdoor seating gives the chance to work in some fresh air.    The only thing I might change is adding a little variety to the 80s music that always seems to be playing.", 
    "review_date": "2011-01-10"
  }, 
  "Ffc0lyXBgWiJqpZcE1DX8Q": {
    "user_rating": 1.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Super D.", 
    "review_text": "This place gets the Bosak straight up! Like Scarface says, you know what happens to pigs that don't fly straight..thats this horrible place. Bistro my azz! They should call this place the slow as molasses pig roast.  After my coworkers kept raving about how good this was, I was like ok fine I'll try it. There were 4 people that ordered before us, but the place wasn't very busy at all as the lunch rush was over. I ordered my food at 1:10, got the pesto chicken sandwich, and was with 3 other coworkers. Well it gets to be 1:46 and I'm like wtf did they have to go kill a chicken for this? My coworkers food finally came out, we all had to switch it to go, but mine still wasn't there. I had to go to the back and complain and was like \"it took you guys 40 minutes to make a sandwich\" and the person who seemed in charge seemed to care less and said I'm sorry but didn't try to offer me anything for the inconvenience...(money off, a free drink, etc...) Instead they just didn't seem to give a shit ... Food was mediocre at best...I've had better sandwiches elsewhere in the city for a quarter of the wait. I don't know about the rest of the working san Franciscans, but I don't have time to spend over 40 minutes waiting for a sandwich to be prepared. Yo screw this crappy place I hope they go out of business and crumble", 
    "review_date": "2014-03-04"
  }, 
  "IgeZ0pW2Mln6z_DXr-D2tA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "laura g.", 
    "review_text": "We stumbled across this little gem waiting to get the car smogged across the street. Cute place, great atmosphere with lots of comfy seating. There are TVs for all the sports games, but they don't take over the entire place. Plenty of reading material out, delicious food, and great beers on tap! We will for sure be coming back; there aren't many places where you have wifi and beers on tap to get a little work done.", 
    "review_date": "2013-09-05"
  }, 
  "Syt_iQqW_c9T2_lrvsddqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gwynnie p.", 
    "review_text": "I wouldn't rush back to Flying Pig but if you're in the hood and looking for a nice quiet, clean, comfortable place to have a morning meeting, ok coffee and ok pastries, a nice warm greeting and pleasant service, then by all means....this is your place.", 
    "review_date": "2012-10-16"
  }, 
  "a4r7b9qJI_1HwfVul-ns5A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leana L.", 
    "review_text": "What is this place? Bar? Cafe? Restaurant?  We ordered take-out from here after going on a long run through the city. I got the beet salad and my bf got a couple of their hotdogs (yes, he ordered two... but only had room for one). I had a bite of one and I'll admit, it was pretty good. They have some crazy combos that just pile on the toppings and it's all served in a hearty bun.  They also have a good selection of items that are gluten free!  Apparently they serve everything from coffee and breakfast, to beers and gluten free hotdogs!", 
    "review_date": "2014-08-02"
  }, 
  "CiOX5QwbQJSXc1yBooKDqg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francesc F.", 
    "review_text": "After waiting for 25 minutes I got an ok sandwich. Really slow service and mediocre food.  I won't be back anytime soon!", 
    "review_date": "2014-05-11"
  }, 
  "jxdGL90JR1b6UTvfxwW9TQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laurie H.", 
    "review_text": "The boy is taking a dog class at the SF SPCA, so on my trial run from BART to there, I spied (and Yelp'd) the Flying Pig as a good place to park myself and write the weekly newsletter I somehow committed myself to two years ago and alternatively love and regret.  Oh wait, this is about the Flying Pig...sorry.     I stopped in to look at the menu, then decided I'd do well to come back with my laptop, so I did.  Of course my indecision at what I was doing prompted conversation with the barkeep (I like to call her that cuz it seems so appropriate given the whole expanse of the bar here - whether she'd appreciate that or not, I can't say).  When I returned with my laptop she helped me figure out what I wanted to eat. Hint: pick up the menu because there's a couple more things on there than what's listed on the big board.  Like chips and guacamole.  I needed a small amount of sustenance to go with my beer and newsletter-writing and couldn't find anything on the board....but picked up the menu and voila!   Grabbed a great table close to the front window and went to work.  I will say the guac was definitely lacking.  Lots of chips....tiny bowl with basically smashed avocado.  I do kinda think she was trying to warn me by asking if I wanted to have salsa with it - \"it would be really good that way\" (I think back to her eyes....they were trying to tell me something). So bonus points for her....I think.  In the end, the 4 stars are for atmosphere and service....and potential.", 
    "review_date": "2013-04-11"
  }, 
  "pkwRRMy6k4alsiOTJLW7GA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Pam Y.", 
    "review_text": "Tried this place for lunch. Pretty low key chill sports bar/ restaurant. Their salad serving is huge! Can be shared with two people. I tried their chicken, bacon, avocado salad with vinagrette. It was so good. Then I also tried their Ruben sandwich on Gluten Free bread. I was set after that. It was so yummy, I decided to come back for dinner the same Sunday night. Unfortunately they decided to close earlier than 9pm (even their store sign says they should have been open til 9pm), so sadly, I had to get dinner elsewhere. The staff was very nice and friendly. I'd come back here again to try their other sandwiches and to maybe grab some drinks with friends.", 
    "review_date": "2014-09-28"
  }, 
  "wI795B7EQTjkSL1eiYpMhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen R.", 
    "review_text": "Gluten and dairy free usually means negotiating a series of compromises when it's time to go out with friends for a drink and a bite to eat. One or the other = usually easier. But to do something like watch a football game for a few hours with a group? Drinking and eating will probably happen and most sports bars don't have much in the way of options for me beyond side salads (which I have to pick the croutons out of).   FLYING PIG! Ciders and GF beers as well as wine! GF buns for the hot dogs! Other good stuff, too! Wifi, decent decaf, and enough TVs pointing at the right angles to make sure that everyone can see if they want. It's a good thing.", 
    "review_date": "2014-04-23"
  }, 
  "8VlKl97RxJPmhTyWzmnARg": {
    "user_rating": 5.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Betty S.", 
    "review_text": "This place is simply amazing. I have had a lot of caprese sandwiches in my day and this place still managed to surprised me.  Their caprese sandwich (~$10) is jam packed with fresh veggies between two slices of focaccia (side note: you get to pick you own bread). Even with it all, it doesn't feel like you are plowing through a garden. It is fresh, juicy, and so filing. I'm not even sure how I managed to finish one whole sandwich.   Quick facts: spacious, have beer, happy hour, and a tv!   Free WiFi?! I'll be back!", 
    "review_date": "2013-10-26"
  }, 
  "82HX9QMjvzwEuoW1_Udrqw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bryan D.", 
    "review_text": "Awesome restroom experience. I actually used my hands to activate the flusher instead of my foot. Nuff said. I would gladly use their facilities again. Oh and the breakfast is pretty good.", 
    "review_date": "2014-07-12"
  }, 
  "gB3Lo0iwf0iVStyvRb-yoA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Casey G.", 
    "review_text": "I don't think my first review really did this place justice, so hopefully I can get it across this time. The Flying Pig is so much more than a bistro. It's a local hub. For the first time I can say I know of a good restaurant to meet new people and make friends. It's a great place for locals to gather and talk about their community and develop camaraderie. The owners are there EVERY day and you couldn't tell based on their big smiles and warm demeanors. They ask you about you, they remember things you've told them about yourself, they want you to feel like part of the family. It's really a wonderful place.  And if all those warm fuzzy feelings aren't enough, the place has AMAZING food. Some of the best lattes I've ever had, fresh donuts every day, a huge variety of sandwiches, soups, CHILI DOGS and salads and they even have temporary items they switch out daily/weekly. A couple weeks ago they had a KILLER meatball sub and now they have awesome hummus sandwiches. They really add a lot of love to their foods.  Top it all off, this place is becoming the next big showcase spot. Comedy nights, trivia nights, MUSIC nights, if I could sleep at the Pig I would. I don't ever wanna miss a minute there. I've been eating at the Pig almost daily for a year now, and I only wish there were twice as many hours in the day.  I LOVE YOU FLYING PIG!!! Don't ever change!!!!", 
    "review_date": "2013-04-02"
  }, 
  "MSQpM8D1H44BM_MxD19A6w": {
    "user_rating": 5.0, 
    "user_location": "Moss Beach, CA", 
    "user_name": "Kim S.", 
    "review_text": "I had lunch at the flying Pig today with both my kids, and It was fantastic! I had the chicken, bacon, ranch sandwich with a side of macaroni salad. Both were amazing! I will be coming back for sure. The new owners were wonderful, very friendly and helpful. All around great place!", 
    "review_date": "2012-04-27"
  }, 
  "GfrwZWWhwZkqCZ5naHRzRA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kendra G.", 
    "review_text": "Love this place! I come here at least once a week and every time I get something different to eat. They have a great food selection as well as great beers on tap. Many gluten free options too!", 
    "review_date": "2014-04-10"
  }, 
  "yUMaPLEyecxEAnwz9yJKeQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Vlad K.", 
    "review_text": "Great place. nice people!!! Good food!", 
    "review_date": "2011-02-07"
  }, 
  "_Ldg0q8WRztljvZcv8bdTQ": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Alonzo T.", 
    "review_text": "Always great service. You can walk in and order or call in your order no problem. And they never get your order wrong. Keep up the good job guys", 
    "review_date": "2014-03-05"
  }, 
  "1XLiW-xgvoD8RgVBdKzn2w": {
    "user_rating": 4.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Sarah K.", 
    "review_text": "We only stopped in for a drink one rainy Saturday, but it seems like a great little local spot. They have a good selection of beer on tap, lots of tvs over the bar, and really fun beer glasses. Oh, and they give you pretzels to much on, which is always nice.", 
    "review_date": "2013-01-09"
  }, 
  "KuSfPEQmZJK71Umqkg3P5g": {
    "user_rating": 5.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Stephen B.", 
    "review_text": "self = \\s.s s  Flying Pig == Functional Programming  For a good time, call: (self self)", 
    "review_date": "2012-11-02"
  }, 
  "B9U5c19cY1oC8LnGvQamfQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Al B.", 
    "review_text": "I really wanted to like this place and I may give it another try again in the future, but I'm sorry to say that the Cobb salad here was disappointing. The greens were so unappetizing because they were old, wilted, and brown, which is really bad when that's the main ingredient in the dish. The chicken in the salad did not taste fresh at all. In fact, it reminded me of the packaged chicken with lots of salty preservatives that you get from costco or some other supermarket. You can tell when the grill marks look really fake. =/   I hope that this was a one off dish rather than the standard here. The cafe itself had a really nice neighborhood-like feel and the staff was nice.", 
    "review_date": "2014-07-31"
  }, 
  "WCTJ5fOxIUW6a04YCoDZ2w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick K.", 
    "review_text": "Really just had a coffee and veggie bagel there while waiting for my tires to get changed. The atmosphere was so relaxed that I wish I had had more time to just hang out. Nice staff and lot's of space to spread out. Mind you this was at 8am, but still....", 
    "review_date": "2013-05-13"
  }, 
  "yLjjOxJrDZaU8BWNiEyo0Q": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "James L.", 
    "review_text": "This joint is kind of divey but it gets major, major points for letting our group stay well past closing and for handling all of our orders with just one person on staff.", 
    "review_date": "2011-06-06"
  }, 
  "GI9JD957RDBKioy-AZJCKA": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Rob P.", 
    "review_text": "Very friendly staff. Good coffee. Decent food. Would recommend if in the area.", 
    "review_date": "2013-07-06"
  }, 
  "xUKN7-XHqlplkkFSJqVNtw": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Kelle K.", 
    "review_text": "So glad I found this place one morning while looking for parking in my new work neighborhood.  Great coffee shop with free wifi, plenty of seating and excellent customer service.  The new Owners are great, and super friendly Organic Coffee, Good Breakfast sandwiches, even better lunch sandwiches, and beers on tap. I haven't been in for happy hour yet, but it's on my to do list for sure.  Neighborhood delivery is an option although I haven't taken advantage of it yet; after all getting out of the office is usually a good thing.  I am certainly on my way to becoming a regular at the Flying Pig Bistro.", 
    "review_date": "2012-07-24"
  }, 
  "Cgoux2WyOJqQjA8_kW012g": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Molly Z.", 
    "review_text": "Super cheap beers. Great atmosphere. Server (in bib overalls) was so sweet- like so sweet. It would be safe to say we stayed because of her and came to love everything. Note. This is a dive bar. A classic dive bar. Now with that being said,  Try a hot dog. Do it. I had the\"bacon ranch cheddar dog\" and I am not mad about it. You can skip the apps- trust me. Just eat a dog.", 
    "review_date": "2015-02-01"
  }, 
  "rbhsO9o73pIPfIbgriDEfA": {
    "user_rating": 5.0, 
    "user_location": "Chico, CA", 
    "user_name": "Ralph D.", 
    "review_text": "I was in SF monthly and was referred to Flying Pig Bistro down the street for lunch. I became a regular customer. The menu is diverse, the food expertly prepared, but what makes FPB special are the warm smiles, great service, and reasonable prices. There are many wonderful dining experiences to be had in SF, and I recommend this one without reservation.", 
    "review_date": "2014-10-07"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Jamfecta.  Apple jam is good.  Cranberry jam is probably good.  Banana jam is probably not the best idea.  Combined they form an outstanding homemade jam topping on things like a warm whole wheat bagel. Loved every bite of this less than $3 breakfast brilliance.  You will likely want to sip something warm too. Like an exceptional Americano with sugar free vanilla syrup. Balance of caffeine and sweetness was perfect.  Parfait stopped the winning streak. There are unique toppings like marshmallows and Heath toffee pieces, stuck with a less adventurous banana on stock granola.  Whole milk yogurt only unfortunately.  Skipping the last one everything else continues the five star theme. Top notch service and free WiFi included.  Prince has yet to make his move. Flying Pig keeps getting better.", 
    "review_date": "2013-10-12"
  }, 
  "dqwf_rWy-5XjIcmATD8Yvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Créme d.", 
    "review_text": "Solid neighborhood spot! Good salads and sandwiches, and beer on tap! I hope they stick around because we love to have meetings here...", 
    "review_date": "2013-01-27"
  }, 
  "v-4ct_jyExcAm0EQKDI1mg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty H.", 
    "review_text": "The food is wonderful and i've been there several times plus the staff are friendly and helpful. Yesterday I took my 88 year old auntie and they patiently helped her make food choices and when she left her purse in the restroom they chased us down the street to return it. That's what I call service and a place I want to spend time and money.", 
    "review_date": "2014-06-12"
  }, 
  "16mnh1Q86b1KEAMaaGUdDg": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Jenna R.", 
    "review_text": "It was the biggest, most delish gluten-free sandwich I have ever had.  Gluten-free rosemary focaccia stuffed with about 1/2 lb of turkey, tomatoes, avocados, and havarti came with a side salad with one tiny GF crouton on top. Service was good, order at the counter and a couple of guys in a guest room sized kitchen put it together.", 
    "review_date": "2013-10-27"
  }, 
  "Ro7NX5kzLvD0XkgvJEoYCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Travis V.", 
    "review_text": "This place rocks my world!  I needed to order lunch for an studio of 55 people, many of which work heavy duty construction and all of which work 12+ hour days.  Needless to say we need a lot of food not only for lunch, but to save as the day goes on.  In terms of catering and parties, I know sandwiches are quick to go so I was worried about having enough food.  Ben and Will were so incredibly willing to work with me and my budget!  Not only that, they far exceeded our expectations, providing us with a bounty of sandwiches, salads and extras.  The customer service upon pickup was stellar!  They went as far as to label all of the boxes with detailed descriptions of the ingredients in clear handwriting, and made sure to be on time!  Most important, the food was outstanding, top quality ingredients like fresh vegetables, a variety of breads including dutch crunch and gluten free, homemade sauces, and their veggie sandwiches were so interesting and unique that non vegetarians made it their choice!  This place also has a great atmosphere inside as both a coffee shop, a hang out and a place to have a beer!  Thanks so much Ben, Will and the Flying Pig Bistro chefs and staff for making me the star of my office today!  Everyone stopped by my desk raving about the food.  Thumbs up!", 
    "review_date": "2013-10-10"
  }, 
  "EH2YsrQ9Fi3EuZE2JwOl0A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julian B.", 
    "review_text": "Just dropped by for lunch with my family, very nice indeed! Nice place to hang out with friendly and welcoming staff. Tasty and eclectic sandwiches. good smoothies and good stuff for the kids too. Made me wish I lived in the neighborhood. Will go back for sure.", 
    "review_date": "2012-10-20"
  }, 
  "Maasg7kkdVGa_Ft9V5xwfA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ross C.", 
    "review_text": "Awesome Service, Great food.", 
    "review_date": "2014-03-18"
  }, 
  "DVem5kBecfgzzWi9mXjepg": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Michael H.", 
    "review_text": "We found this place on yelp after watching a giants game..  My wife and I are both on a gluten free diet and this place offers a myriad of GF sandwiches and GF beers.  I had the Reuben and  the GF Omission IPA both of which were awesome-- exactly what I needed after a long hot day in the sun watching a ballgame!  My wife had the turkey avocado Havarti sandwich on toasted GF sourdough. It's uber casual but the bartender was knowledgable about our dietary needs and quick to make valuable suggestions.. Will definitely be back!", 
    "review_date": "2014-07-13"
  }, 
  "4jQv7HkpFu61VyeW6j4ncA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Allen S.", 
    "review_text": "FINALLY, a good corner cafe that shows sports, food, has good wifi, opens late hours and is actually nice to sit down... ugh, no more going to 16th and valencia to get work done, too many crazy people there.", 
    "review_date": "2012-05-19"
  }, 
  "i0C4bhHjTVaAMKvz6G7fOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole O.", 
    "review_text": "New Fusion beer on draft is great!", 
    "review_date": "2013-06-02"
  }, 
  "Ip_y53kyl8fIVCKANhHXTg": {
    "user_rating": 4.0, 
    "user_location": "Harlem, Manhattan, NY", 
    "user_name": "Doesnt M.", 
    "review_text": "tasty sandwiches", 
    "review_date": "2014-05-31"
  }, 
  "haXPT0CWdxPeNivqqY6kOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam T.", 
    "review_text": "New owners took over this place mid February.  Thank God!  This area was in dire need of a decent cup of coffee.  I could no longer stand walking three blocks to Valencia and wait another 20 minutes in line for hipster brew.    Also tired of the bullsh@# attitude, low quality, and high prices at Bay Blend.  The new kids at Flying Pig are genuinely nice folks.  But what's more important (to me at least) is that they brew a respectable cup of Joe for a reasonable price.  Another plus is that they have about 4-5 beers on tap.  Standard stuff; stella, sierra nev, etc.  They are promising a new menu.  Currently serving soups, salads, and sandos.  All relatively well priced.  The bottom line is, sometimes you want something else besides a burrito or taco in the Mission (I know there are other stuff, but what I'm saying is variety is welcomed).  Go figure right!  The set up is nice.  A lot of loungey chairs.  Very clean, low profile decor.  Unfortunately, I might catch myself taking longer breaks that necessary.     Best of luck to these kids.  Glad to see business folks that haven't been jaded and beat down by San Francisco bureaucracy (not yet at least).", 
    "review_date": "2012-02-28"
  }, 
  "Qs9QpNDADcay4Pyk_G7QjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Malou B.", 
    "review_text": "Richard brought me here for the first games this World Cup.  It did not disappoint, good selection on brews on tap.  Good spot to hang out...we still have a week of World Cup games.", 
    "review_date": "2014-06-26"
  }, 
  "EVwkwbMqLDRZuY7yGWgKxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan F.", 
    "review_text": "So awesome.  Free wifi, good beer on tap, not too busy, classic rock, tim hudson pitching a shutout on the TV (which is silent).  Place has a casual, welcoming vibe.  I am relaxed.  This place will be awesome until it (deservedly) gets overrun.", 
    "review_date": "2014-04-30"
  }, 
  "SjYund2wfZYp5M5VtuFtlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James W.", 
    "review_text": "This is a very laid back cafe in the weekend day time.  There were several people on their lap tops writing their great american novels with their lattes in hand. The decor is very simple with a large ceiling fan and tropical plants, making it feel like you are in Havana. The two ladies that work at the ordering counter were very pleasant.  Watch out for the extremely strong drip coffee! I had 2 cups and couldn't sleep that night.  For lunch I had the focaccia sausage egg sandwich which was very tasty and didn't feel heavy.  I also tried the turkey chili, and the spicyness was just right for me. Prices are very reasonable.", 
    "review_date": "2014-04-06"
  }, 
  "WNyN2NPRrXLZzCDD2GzaTg": {
    "user_rating": 1.0, 
    "user_location": "Haleiwa, HI", 
    "user_name": "Eli C.", 
    "review_text": "Overpriced and misleading. Ordered the breakfast stack but was charged 10.95, the price of the brunch stack I supposed. When my order came it seemed  I got the all American breakfast same price but less the cheese, salsa, and side of fruit. Did not make sense, nor cents. I guessed that because it was the weekend the breakfast stack on the menu board was not in effect and the brunch menu was the weekend rate at four dollars more. I ended up paying fourteen dollars and change for boring scrambled eggs, two pieces of warm sourdough bread (not toast), bland warmed up boiled potatoes, and a pile of soggy bacon,as I was not offered the option, but wanted sausage, and a bottle of soda. Very disappointed I left the pile of bacon and potatoes and hoped I wouldn't get sick. Bad experience bad recommendation by a business owner in the area. Maybe they were in cahoots.", 
    "review_date": "2014-09-07"
  }, 
  "vIWdHve3E_UelyhnIeuHLw": {
    "user_rating": 5.0, 
    "user_location": "Midtown East, Manhattan, NY", 
    "user_name": "Domingo M.", 
    "review_text": "I never write reviews. In fact, this is the first one just because I couldn't help myself. Lovely staff, best turkey sandwich ever. Try the Turkey swiss (no bacon) and you'll remember this post. Cool place, great value for the money.", 
    "review_date": "2013-11-23"
  }, 
  "coGZPoErPVgHTreR6BbVCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam Z.", 
    "review_text": "Been here twice, liked it both times. Breakfast burrito is great. Nice calm atmosphere, friendly service. Definitely plan to go back.", 
    "review_date": "2014-02-06"
  }, 
  "ZsHEFDMcT4dMBGL4PAndiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen N.", 
    "review_text": "Came here for the first time and had the BEST gluten free sandwich of my life.  Turkey on the GF focaccia with an apple-cranberry butter and loads of veggies... It was amazing.  My husband had a regular chicken bacon sandwich and loved it - the best of both worlds for us.  He also got a vanilla latte that he said was he most incredible he's had.  The cafe/bar atmosphere was super comfortable, down-to-earth, and relaxed.  Noticed lots of gluten free beers which will get us back here in a heartbeat, too, along with free wifi and lots of work spots.  Service was excellent - Dominique was a rockstar.  We will definitely be back soon and turn into regular customers for their gluten-free (and non-GF) options.  We just moved nearby and now have found our go-to sandy spot that doubles as a sports bar :)", 
    "review_date": "2014-03-30"
  }, 
  "fzQTdCKKf--h2w328mw1aw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay R. R.", 
    "review_text": "New Owner! New food! Great food! Great customer service... Sandwich I ate was on point. Meaning taste was yum! Preparation on meal, excellent! Will be back for sure during my lunch time...", 
    "review_date": "2013-05-21"
  }, 
  "YafzmKAp5qg0EUmtlfSN0Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony R.", 
    "review_text": "Dear Self, Sorry for subjecting you to terrible service and terrible breakfast.  -Anthony", 
    "review_date": "2014-02-15"
  }, 
  "ex6S3scaI1nAE1458PiMpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mario V.", 
    "review_text": "Awesome place for a brew and a delicious bite to eat. I have sampled just about everything. All good. Friendly family owned service!", 
    "review_date": "2012-08-08"
  }, 
  "eay3Xc0Mw_lG6a2n4Od7WA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew W.", 
    "review_text": "Went there for lunch. I ordered the chili dog and was unimpressed. I've had much better hotdogs for less. The sides were also only so-so.", 
    "review_date": "2014-12-19"
  }, 
  "frkxMUXg5xqGDPNZ8SaZjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Napoleon R.", 
    "review_text": "Don't let the name throw you.  It's basically a coffee shop with a sizable food menu and beer.    Pros:   The food is pretty good. It's close to my house. Convenient hours. Beer.  Cons: The name of the place. Waaay too many TVs.", 
    "review_date": "2012-07-20"
  }, 
  "JK3uepHZzNx3TNeKKR9JPQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "James D.", 
    "review_text": "pesto chicken options are so good here. friendly mellow vibe, but not too mellow that yr falling asleep. its kinda like chilling at yr friends place. great food options. highly recommended.", 
    "review_date": "2014-04-28"
  }, 
  "sb9HVra2QEpribLfWKDo1A": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Jessie C.", 
    "review_text": "This review is for the newly re-opened and re-vamped Flying Pig Bistro - it's great! The guys are amazingly nice - I locked my keys in my car and my phone was dead, so I wandered in here for help. They dialled AAA for me and sat me down with a (delicious! and complimentary!!) hot chocolate while I waited. What more could you ask for? I'll definitely be back :D", 
    "review_date": "2012-02-25"
  }, 
  "DuMNNCOQpN7u91q1Lynqcw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SKerstin V.", 
    "review_text": "Good concept, and this could be the perfect spot for a pork sammy dive.  Unfortunately though, service, ambiance, and food all miss the mark.   A few suggestions: - Have customers pay when they order at the counter so they don't have to wait for you to return to the register twice. - Work on dialing in the sandwiches (e.g. using high quality breads &amp; ingredients, having recommended toppings for each sandwich instead of leaving it up to the customer to decide whether lettuce belongs on a cubano). - Turn off the TVs.  Play music instead.", 
    "review_date": "2011-06-07"
  }, 
  "pEvhyxL7YAGrYsKB29VJvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "This is a pretty awesome local cafe -- food quality is several steps above what you'd expect, and the interior is roomy, well-furnished, and appealing.  The staff are great, too.  I particularly recommend the sandwiches -- there's a long list, but steak and horseradish is excellent.  Prices are maybe $1/item higher than I'd like, but the quality is there, so it's not at all unreasonable.  Would definitely return.", 
    "review_date": "2014-04-28"
  }, 
  "9RGhPEM9CP13ofZYixeC-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arjun K.", 
    "review_text": "Great breakfast burritos and a nice setup for the World Cup (2014). Great beer promotions with rotating 'on-tap' days from regional brewers and an expanded menu too!", 
    "review_date": "2014-05-31"
  }, 
  "sH2tQ0XXLDLcJeUv0yDYTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth M.", 
    "review_text": "I stopped by this place for a quick refreshing beverage after yoga. I was pleasantly surprised by the enchanting ambiance and would have stayed if time allowed.  I had an excellent iced, soy, chai, and will definitely be back to just sit back, relax, and soak up  the surroundings with my laptop.", 
    "review_date": "2011-03-16"
  }, 
  "Ss8rG44uGBs0L4lnGQGmHg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Rosangela B.", 
    "review_text": "I must give 5 statrs!!! the owners are so friendly, the food is delicious, music...the right volume. I ordered a cup of tea and the size was so perfect. Perfect for a date or business lunch. Very relaxing....", 
    "review_date": "2012-05-02"
  }, 
  "JIiKnRihgRRYYumGe3vB9Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark K.", 
    "review_text": "Ordered the taco salad with chicken and a grilled chicken sandwich. The chicken in both was like the processed stuff from a can or something. Im not picky but this is pretty inedible.", 
    "review_date": "2015-01-13"
  }, 
  "885qYsn6CKkG53mC_aXvJQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sabrina P.", 
    "review_text": "I was looking for a healthy lunch while my boyfriend was craving a cold brewski, so we decided to eat here on a whim since we were in the area, the place had pretty good reviews, and most importantly they had a combination of both of our desires.  The chalk board menu had a good selection of typical bistro food like sandwiches and salads. Their coffee and tea menu was impressive as well, and even offered almond milk as a dairy substitute for an additional $.50. I really liked that because I don't run into many coffee shops that have this option. I didn't order beer but I skimmed the wine and beer list they had on the bar and I probably would have ordered something if that was what I wanted.  I had the turkey, avocado and havarti cheese sandwich on a whole wheat roll with a side garden salad and it was really tasty and exactly what I was in the mood for. I wish I had known they put mayo in it beforehand (sometimes sandwiches come with it, sometimes they don't) and that was my mistake for not asking, but I just scraped it off with a knife and it was fine. The sandwich was big and was cut in half, so I ate one and saved the other for lunch the next day.   The bar area had 3 big tv's in full view, so no matter where you're sitting you'll be able to catch whatever game they have on at the moment. I can't really pinpoint the atmosphere of this bistro. To me I kind of got a mixture of old saloon to grandma's cottage in the woods because of the wooden bar shelves, wooden round tables, and wooden chairs with a weaved backing. However the walls had some modern looking paintings on canvas of naked women with hammers and Disney princesses.  Overall, my boyfriend and I both enjoyed our food. The bartender was extremely nice when she was helping us, and the place was quiet and cozy. Can't complain here!", 
    "review_date": "2014-06-22"
  }, 
  "0PGQWRDjFDhvnGkipBG_wQ": {
    "user_rating": 3.0, 
    "user_location": "Second Mesa, AZ", 
    "user_name": "Rich H.", 
    "review_text": "Came here for coffee while on the way to a biz meeting.  It's coffee, so not a big deal, right?    Giving this place 3 stars since I could order coffee without having to go through some approved language check like at Starbucks or Philz.", 
    "review_date": "2011-10-16"
  }, 
  "MRDRVpoHwTRzLJb3WITbQA": {
    "user_rating": 5.0, 
    "user_location": "Bakersfield, CA", 
    "user_name": "Christine D.", 
    "review_text": "This place has everything going for it! The new ownership has turned this place around. You can't beat the friendly people and delicious fresh food. Ben and Will, you two are the best! And Maria is always there with a smile, ready to make your drink and get you that beer! Whether you want smoothies, bagels, sandwiches, coffee, dessert, beer, salads, or gourmet hot dogs, The Flying Pig has it all! It's a cozy, quiet, comfortable place to sit and hang out, and with live music on weekends, it can be a great way to enjoy a night out with friends. Looking forward to my next time in the city so I can stop by The Flying Pig!", 
    "review_date": "2012-06-07"
  }, 
  "6er8GENQmTQzG8yoUhsVaA": {
    "user_rating": 1.0, 
    "user_location": "Carlsbad, San Diego, CA", 
    "user_name": "Lester P.", 
    "review_text": "Bad customer service experience for me.", 
    "review_date": "2013-10-09"
  }, 
  "ZvgUJqbrdfUFDXopdd-WRw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cory L.", 
    "review_text": "Friendly staff, comfortable chairs, and a good atmosphere. Have not tried the food.", 
    "review_date": "2012-08-05"
  }, 
  "eE5YrQvomDt84nlU0bJUOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie F.", 
    "review_text": "I come here regularly for the great homey atmosphere, good food, and friendly folk.  They've added a lot of new sandwiches recently and I'm especially enjoying the All-Italian \"Flying Pig.\" They have a Happy Hour from 4-7pm and a frequent sandwich buyer card.  Check em out. This is a welcome addition the food options in the upper Mission.", 
    "review_date": "2012-03-21"
  }, 
  "TG0ZX_xpTOFGKOOiGnDb_g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rich y.", 
    "review_text": "Great place to chill on a lazy Sunday. Good sandwich and smoothie. Super nice servers. They also have three big screens for game nights.", 
    "review_date": "2013-04-24"
  }, 
  "btvNDnUStJfOJ0LraNIrdg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Micah W.", 
    "review_text": "I work next door .. this place has a good selection of sandwiches , bagels and coffee... but the prices are 25% more then anywhere else . a breakfast bagel w just cheese is 5$ where you can get that at most other places for 3-4$ .... only go here when its the only thing open", 
    "review_date": "2014-01-19"
  }, 
  "yfjQwjUhjkq7LfX3DlqlVw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L W.", 
    "review_text": "Love this place.  Food is consistently great, and service is consistently super-friendly.  They do everything from breakfast to beers on tap to sports on tv.   It's the kind of place you can stop by to get something quick, or bring your computer and comfortably hang out for a while.", 
    "review_date": "2013-05-23"
  }, 
  "r3EtrJXxY3IhxO7xeZhANA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Courtney K.", 
    "review_text": "The Flying Pig is the best! Great combination of yummy food, lots of good study/work space, beer AND coffee, and just about the friendliest staff around :)", 
    "review_date": "2013-12-04"
  }, 
  "IkCBDVZ4o9fAGCSL7SuXJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Georgia A.", 
    "review_text": "I've only been here since they changed ownership - frankly, the bad reviews had scared me away.  But I'm glad I gave it a chance!  This is my third time here (I'm on the free wifi), and I've had a couple sandwiches and a cup of soup, as well as a smoothie and I think a latte.  I'm not a coffee connoisseur so I can't give a detailed review of that, but the smoothie tasted fresh, every sandwich I've had was delicious, and the clam chowder was amazing.  The guys running the place are really nice and I'd love to see this place stick around.  They even get an extra star for being a half a block away from my apartment.  Oh, and for sports fans - they have a giant TV and tasty things on tap.", 
    "review_date": "2012-04-14"
  }, 
  "QB2qaw0-c6oVj6gCvtjoGQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Home And Investment R.", 
    "review_text": "First time hear but i am already a fan! Very nicely decorated, good food, with a quite a few vegetarian and gluten free options. Also has 5 tvs for sports fans but they are on silent most of the time... i hope they do well and are here for a long time...", 
    "review_date": "2013-11-30"
  }, 
  "nSKVDuugO9ONUZFfnJ9lFg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "barry a.", 
    "review_text": "Hmm.  No more turkey chili or curry chicken salad.  Those were my favorites but alas things change.  It's kinda just your average sports bar kind of place with a so so menu of sandwiches and salads.", 
    "review_date": "2015-01-18"
  }, 
  "NObmoLQ9VoURlZoj0uAv5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophie B.", 
    "review_text": "Service was friendly, the food was delicious and there were tons of gluten free options.   I had the turkey &amp; Swiss sandwich on gluten-free focaccia. The bread was so good! It was amazing compared to most dry, tasteless gluten free breads and the bacon was out of this world. It tasted like it had been trimmed off a pig and baked the very same day. I also had a chocolate walnut brownie which was just as delicious.   I'm singing this pig's praises to all my friends &amp; will be coming back very soon :)", 
    "review_date": "2014-04-29"
  }, 
  "Z-4Ow2j7kRPyUMuxsebmvQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Klondike B.", 
    "review_text": "Good, but 4.5 stars? Tartine isn't even 4.5 stars. No evidence for this. For example, veggies and fruit were dry. 4.5 stars makes people come to SF just to try it. Don't see this happening.  Friendly service. Warm vibe. Generous coffee.", 
    "review_date": "2014-09-25"
  }, 
  "7IyZBsbOzUqkdulWTvieAg": {
    "user_rating": 5.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Ruobin W.", 
    "review_text": "Oh man, the sandwiches are great. Any of them, really. Pig lover's, steak and horseradish, even caprese. Each sandwich is delicious and really filling (they're huge). All the components of the food really work together. But, for 9 bucks a pop, I should hope so. The cafe/bar has a great ambiance and it's a perfect relaxed atmosphere for doing work. I definitely will come back.", 
    "review_date": "2014-03-31"
  }, 
  "y4HzZ-YTTBUTpIDlkHCC2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruben G.", 
    "review_text": "Had the BBQ Flying Chicken sandwich. Very tasty!  The chicken was very tender and sauce was just right.  Planning on stopping in again sometime soon.", 
    "review_date": "2011-03-25"
  }, 
  "BJAzr7WNnJ9n7Ly1ET5W4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ichor B.", 
    "review_text": "Really good food and coffee. I liked the bathroom because it is spacious and clean. Vibe inside is kind of sports pub-ish but not in a meathead kind of way. Chili is way spicy so watch out. Or maybe the cook that day was generous with the sauce. Service has always been great whenever I've been there, and owners are cool. This neighborhood needs a decent place like this, so let's support it!", 
    "review_date": "2014-01-04"
  }, 
  "7Q_eNRLuRhZk6HDAYmCLsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Run R.", 
    "review_text": "Super friendly, giant portions, comfy chairs. 100% happy, thanks!!!!", 
    "review_date": "2014-11-23"
  }, 
  "8amQ33Un844HOLZ8PoOxkw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ian Y.", 
    "review_text": "I was hoping for a nice pleasant brunch on Sunday. Researched on Yelp and came over here, expecting great food and great service. Turns out, I was wrong on both. The food was mediocre at best, and I had to wait more than 35 mins for a simple hotdog when the restaurant was half full. There was a single waiter and he would ignore all the bells from the kitchen (I was sitting right next to it), and kept on getting orders from people. I had an urge to get up and start serving myself. This was hardly the best experience I've had, especially given the restaurant has 4.5 stars. To the owner of the restaurant, wake up before you piss off more customers.", 
    "review_date": "2014-05-11"
  }, 
  "zL3t3LVmm_S--TVMfwRykA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shilps A.", 
    "review_text": "There are 3 different hours of operation listed, which is very confusing. Here on yelp it says open at 9am. On their website it says open at 7:30am. I trusted the website and walked over, but the gates were closed and the sign on the window said open at 8:30am.", 
    "review_date": "2014-02-28"
  }, 
  "2gcFiDuxzOY2cMKlVLfi1w": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Tom C.", 
    "review_text": "I discovered this place because I work right next door - and I feel like I won the jackpot. The only way this place could be better is if it was next to my house.  The turkey, avocado with havarti(sp?) cheese is awesome. the bread works well - and the sandwich over all is pretty big, they give you plenty for your money.  I had the tuna salad yesterday - I can't believe how much tuna there was, probably 5x as much as any other restaurant. how many salads do you know weigh 2 lbs?   Today I had the turkey swiss, a hot sammich- just awesome. this is my new home - glad it has a bar to boot!!!  And whats even more surprising is the pricing! very reasonable - especially for how much food you get. And they are as friendly as it gets.  you can't go wrong with this place....I can't wait for tomorrow.", 
    "review_date": "2014-05-07"
  }, 
  "twcfdQM7yhithvzGqmcUmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eriks S.", 
    "review_text": "This place literally saved my life! I had given up on life and was on my way to the golden gate bridge when I wandered in and ordered my last meal, the flying pig italian sub. It turned my life around. Some of the owners happened to be there serving and they are now my best friends. I told them my sob story and they took me in as a family member and took care of me. Now I hang out there every other day and live my life to the max! Thank God for this place!", 
    "review_date": "2012-11-01"
  }, 
  "CMt8NQE49EPSFOz3-aVT9w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura L.", 
    "review_text": "Wow, just experienced terrible customer service.  I ordered an egg sandwich on a gluten free bagel, and they were out.  So they offered to replace the bagel, but with bread for more money explaining that the bread is 3 x as expensive.  However, looking at their menu they charge the same fee (an extra $1 for both a bagel and for gluten free white bread and focaccia which they offered me is only $2 extra).    Really?  I've been a returning customer for over a year, maybe coming once a month.  Now I'm going to only go to Ike's or the Sandwich Place for my gluten free fix.", 
    "review_date": "2014-09-15"
  }, 
  "P2Ha3vRHN2S_gk5_KEbYFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noe F.", 
    "review_text": "Great place.  I get a White Mocha from there about twice a week on my way to work. They're great at what they do.  But what's even greater is their customer service and the environment.  Customer service is outstanding. Once they took an extraordinary long time for my drink so they gave me an extra stamp on my \"free drink\" card.  The place is very comfortable and has a great vibe.  Definitely come here to get your study on or grab a drink to go.", 
    "review_date": "2012-12-17"
  }, 
  "KWjolaLERcLygetwvecD9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin B.", 
    "review_text": "Great hide away for plugging in and chilling out.  WIFI is great (just a normal router password, no 'boingo'/'freespot'/log in through the web site shennanigans). Lots of outlets, and a variety of spaces from bench to table.  I came for a cup of coffee - but great beers on tap drew me away. Not overly busy, staff was very attentive, very helpful. There's a social contingent here too - live guitar on my visit, a nice variety from laptop dominated cafes.  Maybe the location (15th &amp; S. Van Ness) is a drawback, but if it keeps the crowds low I'll brave the walk. I'll be coming back for sure.", 
    "review_date": "2013-03-25"
  }, 
  "-aP7KmGwfXBudWkY3oTA3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tommy C.", 
    "review_text": "I have no overwhelming complaints about the Flying Pig; everything they do is pretty good. I like the selection of sandwiches and the beer on tap is pretty good, too. They host live music every so often which is nice and usually have a pretty good happy hour going on (half pints of expensive draft beers for $4). The pastries are good as well. The man working behind the counter was super friendly and offered me a free bag of chips for some reason. The location is a bit off and makes it a pain for me to get home but I can't control that. My biggest complaint is that they are only open until 11pm. Why not make it at least midnight? Check it out, I enjoyed the free music last night. No reason why I wouldn't come back.", 
    "review_date": "2013-01-27"
  }, 
  "I2YQX8DaUH5OJCeluWQW_w": {
    "user_rating": 2.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Anna M.", 
    "review_text": "For anyone who's excited about coming here for the gluten free stuff...I wouldn't bother. The pizza and sandwich were tasteless and just crappy. I was sad. Nice waiter though. Maybe other stuff is good.", 
    "review_date": "2014-11-17"
  }, 
  "ZwbH76rzPd9k-Jtz9BEcmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meow S.", 
    "review_text": "Great neighborhood joint!  The food is solid and there is a respectable selection of beer.  Great place to come for a variety of purposes including, but not limited to:  1) Watching a sports game one one of their many TVs 2) Enjoying some sort of live entertainment 3) Escaping the throngs of people at other bars in the Mission  Why it's not 5 stars: The beer selection could be a bit more diverse, the food could be a bit better (although it's pretty good), the service could be slightly faster, and they could really benefit from a full liquor license.", 
    "review_date": "2013-06-20"
  }, 
  "ms5cezvfYjEHadbvuHD63w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Min M.", 
    "review_text": "This is my new favorite place! Tons of GF options including GF beer - excellent food, and perfect ambiance for watching the game, working, or just haaaaangin' out!  The GF breakfast sandwich might be my favorite.    To top it off, the service is FANTASTIC!  The owners are super nice and work hard to make you feel remembered.  They even accommodated us when we wanted to watch specific games.  I have a 5 month old and they were completely welcoming and helpful in arranging tables and chairs so that we could all sit and put the baby carrier at our table.    I predict spending many many \"work from home\" days and \"game\" days here.", 
    "review_date": "2013-12-09"
  }, 
  "RfrE6jlr7eWypqm9J6Zxvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyce K.", 
    "review_text": "I was just saying to my bf the other day \"I wish I could just get a sandwich someplace\" because I can't eat wheat--so going to the Safeway sandwich counter (I know, but it's the closest to my work) is not an option for me. Lo and behold a little Yelp-search for restaurants nearby brought this one to light--and it's got GLUTEN FREE stuff! And not just one option, but lots. And not just those dinky gluten-free sandwiches you find more and more places now (don't get me wrong, I'm grateful even for that option), and not a disgusting, cardboard-bread tasting sandwich either; they have GLUTEN FREE focaccia (worth the $2 more; you can get regular GF bread for just $1 more, but I'm in love with the focaccia) and make a mean sandwich! I've gone twice and had the salami sandwich and today had the turkey and avocado with Havarti dill. I have been impressed both times. And my bf loves the mango chicken sandwich. AND I found out that they have gluten-free turkey chili as well as various soups of the day (of which there is usually at least one GF option). This place is awesome. Free wi-fi, too, and it looks like they show games on game days (four + TVs). The only drawback I've noticed so far is the difficulty parking, but they can't be held to blame for that. And it should be noted that they are incredibly easy to access via public transit, which is even cooler (off of 16th on South Van Ness--you can take the #22 or the #33 or walk from 16th Street BART. I highly recommend it!", 
    "review_date": "2013-10-23"
  }, 
  "M7a-eJMUJGYeMkOlLMniMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Princess P.", 
    "review_text": "pretty darn pleased that this place is here near my job.  The food is pretty yummy and they usually have all the ingredients.  I think the owners are a guy and gal-- they are very upbeat and really care that your there.    I usually get the chicken asian salad-- low-cal and great tasting.  mY other favorite is the turkey havarti cheese sammy!  i like cheese.  it has avocado too!  it has pretty good selection of beer.  ANd if I'm eating alone (boo!) I can zone out on one of the three TV's CNN or Sports-- GO GIANTS!    good people, good food, and great place!   An oasis in 16th street corridor. :-)", 
    "review_date": "2014-10-14"
  }, 
  "hUaThkxPLvdhXsuh0iBFmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cary F.", 
    "review_text": "I live in the neighborhood and had wandered into this place for a bagel once. Nothing special, just a strangely decorated cafe I noticed recently that it had closed and just reopened. I  took my chances and went to take a look. The two guys who took over really put some effort into refurbishing. There is now a bar with taps, comfortable seating and they took down all the weird \"Grandma's Attic\" decor and hung some cool artwork done by a local artist. Very warm and inviting.  The guys themselves are very friendly and attentive. The menu is limited for now since they're just getting started but I had some excellent minestrone soup and a pulled pork sandwich. Both were delicious. If you're in the neighborhood, I would definitely recommend swinging by.", 
    "review_date": "2012-02-07"
  }, 
  "1qpdjeNYXQCsTbUrFEkimg": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Corrie A.", 
    "review_text": "Pleasantly surprised. I was looking for a place to kill time and grab a bite before an event in the neighborhood and the Flying Pig Bistro provided that and more! I loved all the Gluten Free options, I had a hot sandwich on sliced GF bread and it was great. Lots of GF beer options too, the Omission IPA totally tastes like Sierra Nevada! It was a little empty since it was 8pm on a Saturday night, but the service was great and friendly and they let us take our time and hang out. I loved the layout of the place with a long bar but also a good amount of well spread out tables.   I have a business partner in this area, I'm taking them here for our next lunch meeting!", 
    "review_date": "2014-01-07"
  }, 
  "M19NwFwAXKRZzt8koF11hQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy C.", 
    "review_text": "(See pics)  It's a sandwich shop, not a bistro.  The space is like a local eatery.  The soup in the individual pot was good looking. However, I wondered if the lady added water in it after I asked if it's a thick soup. It was not heated totally and was very watery. It's very disappointing.  I also had the wrapped cabbage which was slightly better. The cap was also okay.  The place was extremely quiet and a better shop name / description and better quality of food would be needed to survive.", 
    "review_date": "2011-03-06"
  }, 
  "1W4FXKzPIiCG2JsDPFlzTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pat L.", 
    "review_text": "For good sandwiches, Flying Pig joins another relatively new place in this corner of the Mission, Bite Me (17th and S Van Ness), plus the longer established The Sandwich Place (16th and Mission St., between them and a block west), and Mr. Pickles (20th and S Van Ness.)  These are all very solid places that are increasing the neighborhood's already awesome variety.  (I'll avoid mentioning the much-hyped Ike's, because that's really part of the Castro.)    Flying Pig beats them all at offering an unexpectedly awesome sit down experience.  The Pig asks a slightly higher price, and so does The Sandwich Place, which may have the most interesting menu choices, but only for take out from a block that can get pretty gross. For a no frill sit down meal, with almost as interesting menus at a slightly better value, try the other 2.    The Pig is much more than a sandwich shop.  My temptation to hang out there was undeniable, because they have done such a nice job of making their place inviting.  They took over from previous owners and remodeled just recently.  The owner tells me they're \"trying to get away from the convenience store feel the space used to have.\"  I hope their successful effort brings a lot more people in.   On a Sunday afternoon, I only intended to step in for a minute to look around, grab some food and run, but I just had to sit and relax because they had a piano player making the place feel like an old time saloon.  That seems to be their concept, with the new wood bar, comfy seats, iron fixtures, antique lamps, and arch of plants framing the entrance.  There were only 3 of us in there to enjoy it (maybe everyone else was at the park), but each piano piece got applause.  There was a sports game on a big TV too.  Meanwhile, the gregarious owner got me into some conversation, and tempted me to try a lot more than I came in for.  I checked a menu full of good sandwich choices, hots and sausages, and chose a pyramid apricot ale, a turkey, avocado and havarti on whole grain, with a side of fruit salad.  It was so filling I had to take half home.   It makes me super happy to have a cafe with beers on tap and coffee, plus quick takeout meals, right across the street from my apartment.  There's happy hour prices, and my neighbors told me they have a breakfast menu too.  I live next to a collective type apartment with tons of people working and living there, and they are excited about this place. I'm with them in wanting it to succeed.  It's much better than the places that have tried that space before, and more relaxed and welcoming than many nearby.", 
    "review_date": "2012-04-30"
  }, 
  "5NCKuC2ESkDQIsy1gc-dlg": {
    "user_rating": 5.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Jess C.", 
    "review_text": "By far the best sammie spot to go to in the Mission. Potato salad is excellent. I tried the phili and my friend got the taco salad. A cool place to go and random wall art!  A+ on diversity and price.", 
    "review_date": "2014-07-25"
  }, 
  "N0oI0PL5ZmXMIi6cA5lxOA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "April M.", 
    "review_text": "This place rocks! We just moved to SF and this is our favorite place. The sandwiches and coffee are amazing.  We've had so many sandwiches we've already filled our free sandwich card up, and it's only been a few weeks.    We like to come here to relax in the afternoon (and for the amazing happy hour prices).  Will the owner is super friendly and accommodating.   Ignore the bad reviews because it's not the same restaurant it used to be. The new owners have recently taken over the place and transformed it to what it is now. We love it!  ps. they have table games and a Wii you can play too!  See you guys soon! Watson &amp; April", 
    "review_date": "2012-05-01"
  }, 
  "5PMiSCo8nXgf6VB1meCIGQ": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Alena W.", 
    "review_text": "Flying Pig has it all!  Breakfast, lunch, dinner, drinks, TVs, trivia night, live music, friendly owners and customers...whatever you're in the mood for, you can find it here!", 
    "review_date": "2014-10-13"
  }, 
  "mrG71dsQM2zye_KJXUY7ZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allysyn O.", 
    "review_text": "The Flying Pig is my go-to spot for brunch, and I even like to entertain clients there. The friendliness of the staff is unbeatable. While their coffees are just okay, their sandwiches, wraps, bagels, and giant salads make up for it. They even have gluten-free bread, among a wide varieties of other breads.   Also enjoyable is the atmosphere. The doors are always open keeping the inside sunny and fresh, just like their staff. There are comfy chairs and tables and plenty of electrical outlets to sit and do work. They will wait on you hand and foot. There is also a decent-sized bar there, too. I'm not a drinker so can't speak to the options, but I have friends that love to go sip on brew and catch a game on one of their many screens. They also have Trivia Tuesdays, open-mic nights, bands that play, and many other evening events. Its an all-around fun place to be in.", 
    "review_date": "2013-05-22"
  }, 
  "-KzeNuXL9uEeg65Yzsifsg": {
    "user_rating": 4.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Rachel M.", 
    "review_text": "I work down the street from Flying Pig, so co-workers and I find ourselves here several times/week. Their coffee is expensive, but they're just so freaking nice at 9am that I keep giving them all of my money. Also, the egg bagel with pepper jack is the most perfect breakfast ever on those mornings when you just can't deal.", 
    "review_date": "2014-11-03"
  }, 
  "n7_PO423m_Jkr8jzwAv4Vg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah P.", 
    "review_text": "It really is A-OK, as in \"I like it, I'll go back\", but in the land of Yelp 3 stars is a bummer and I would like to keep going to this place, so, 4 stars.  The foodi s good. Fresh generous salads and sandwiches, great for lunch to go.  The service...what can be said.  It's a little TGIFridays \"Hi, my name is..\"...but I'm on South Van Ness!!  Whaaaa? It's a little weird, but, hey, the food is good, so, just turn down the eagerness and the charm maybe?", 
    "review_date": "2012-08-27"
  }, 
  "G6VZlnHyeDX5BD6M1QauEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Prudhvi D.", 
    "review_text": "Their gluten free foccacia bread is delicious.  I like the chicken pesto sandwich here.", 
    "review_date": "2014-01-07"
  }, 
  "-XF9C3V1cCxn19j-Rlbglw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sidney L.", 
    "review_text": "Wow, this is the perfect cafe. Like perfect in every single way. The food here is great (hot dogs, salads, sandwiches, soups). The coffee here is great and is served in an actual mug. They have beer, wine, ciders, mimosas. The wireless here works well. There are a lot of TVs. There is artwork for purchase on the walls. The service is wonderful. It's like I died and went to coffee shop heaven.", 
    "review_date": "2013-12-23"
  }, 
  "TFpF_fqTf98w-cJ-Gpg9eQ": {
    "user_rating": 5.0, 
    "user_location": "Louisville, KY", 
    "user_name": "Carter G.", 
    "review_text": "A breath of fresh air in an otherwise gross, industrial part of town. Was down there car shopping and found this awesome cafe for breakfast. Great prices, great options, and they accept credit card without any stupid minimum fee. Very nice service as well. I'm a huge fan", 
    "review_date": "2011-04-06"
  }, 
  "F_AvKUOQgYoS-95uMXm4xw": {
    "user_rating": 5.0, 
    "user_location": "Evanston, IL", 
    "user_name": "Brain K.", 
    "review_text": "In from Chicago and followed yelp to this spot. Friggin' awesome pesto veggies sammy. Staff super friendly and chill atmosphere.  Check it out!", 
    "review_date": "2014-04-12"
  }, 
  "TgMvUp5NB6MVCS4GOUc7Og": {
    "user_rating": 5.0, 
    "user_location": "Aptos, CA", 
    "user_name": "Matthew S.", 
    "review_text": "My brother lives 4 blocks away and we noticed they were closed for a while.   It changed hands and the owners opened up for an informal weekend over super bowl weekend  I had minestrone soup, pulled pork sandwich and beer The guys working there had bright shiney faces. They are very attractive fellows. My brother and I are excited that they are in the neighborhood and hope to be regulars in our soon to be new neighborhood hang out  16 beers on tap Sports on tv Big tables for family hang sessions", 
    "review_date": "2012-02-06"
  }, 
  "anQgH5EbjxyUIVbAZLe14w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Devin N.", 
    "review_text": "I have giving this place two chances and they are out in my book. I went once when they had just opened and i wasn't very impressed but i was hopeful. i gave it a month and tried it again and it was awful.  First off the fans from the refrigerator or so loud you can't hear your self think let alone hear the auto tuned music they play.  My first sandwich (the flying pig) was super dry for a BBQ sandwich so i tried the starving pig. If you can manage to stomach this sandwich you will not look like your starving. there had to be an entire jar of mayo on my sandwich. It was so bad i couldn't eat it and had to walk out  with a whole sandwich sitting on my plate.   as for the coffee. I didn't need to try it a second time because it was so bad the first time i wouldn't drink it for free.   I really wish this place was great because it's so convenient but the truth is out. The Flying Pig has Crashed and burned in my neighborhood.", 
    "review_date": "2011-03-02"
  }, 
  "5GqtMUFZwn9oxeLBT22ViQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine D.", 
    "review_text": "First, this place has literally hired the nicest people in the city. I've now come three times, each time with a different person working, and they are just the most exceptionally friendly and helpful people. I would give them five stars for the service alone, but the food, coffee and general atmosphere is also awesome. It mixes cool breakfast/lunch spot, with unpretentious but cool beer selections and fun little events like tastings and trivia. Just moved to the neighborhood and definitely intend to make myself a regular here.", 
    "review_date": "2014-05-10"
  }, 
  "X1P7OrthhSkAmlUrI5J3tQ": {
    "user_rating": 5.0, 
    "user_location": "Loganville, GA", 
    "user_name": "Christina H.", 
    "review_text": "Great gluten free restaurant! Had multiple gf bread options not your regular plain Jane dry and gummy breads. Had a wonderful herb focaccia caprese sandwich . Highly recommend to anyone looking for a good gf place.", 
    "review_date": "2013-07-19"
  }, 
  "QxN7rHMSdFMh3YaBs-VZfg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Danielle M.", 
    "review_text": "The Flying Pig        As I walk up an unassuming block of South Van Ness, I am drawn towards a shop whose cheerful red awning ubiquitously reads \"bistro\" in plain white lettering from my west-bound vantage point. True to its form, the quiet shop has classic cafe-style chairs and table tops on either side of the door. The scent of coffee confirms that I have found a new local spot to sip my favorite beverage.      Only a few blocks between fashionable Valencia St and the high-brow coffee corners of the Soma district, this cozy shop serves as a reminder of what popularized the beverage in the first place. The interior is painted a buttery yellow, with a long bar with a classic and classy feel mirrored by ample seating in warm wood tones. With its unpretentious vibe and offer of free wifi, I feel unrestrained about relaxing into a few hours of work after I order my first cup of the day.          Being used to the hurry-up-and-order pace of most barristas, I am almost taken aback by the genuine friendliness I receive upon approaching the counter. My upbeat host guides me through a moderately-priced menu of food and drink, including beer specials on tap. I'm only ready for a cup of coffee and a biscotti, but their menu has me thinking about lunch. I select which roast I'd like (Sumatra) and settle in to a roomy chair. Neighborhood residents come and go, each greeted and sent off with enthusiasm.              I chat a bit more with Will, the barrista. I learn that he has recently become co-owner of this local spot. Along his business partner, Ben, both of these gents look forward to making improvements including hanging more art and expanding upon their menu, as well as generating buzz for the new ownership. They are clearly enjoy the endeavor they are undertaking, and every patron has a compliment to give towards the work they have already done.  Cheers, Will and Ben! Looking forward to another cup or a tasty sandwich real soon!", 
    "review_date": "2015-01-31"
  }, 
  "7L_D65aHIXK-JQfGYHN-fw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimo S.", 
    "review_text": "This is a very nice cafe/bar. The decor is similar to an old saloon but it's clean. The sandwiches and salad options are extensive, creative and delicious. Coffee is excellent too. This place is never crowded. Great weekend brunch place!", 
    "review_date": "2014-04-06"
  }, 
  "HsTEfv2QiJBI1VclnVsxnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon Z.", 
    "review_text": "I am not a regular here at the Flying Pig Bistro. In fact I hopefully won't be a regular just because I was only here due to a flat tire and service being performed at Larkin Brothers across the street. Don't get me wrong, this pig is a good pig.   I feel the need to review this place just to say that The Mission used to have more small, unhip but local businesses like Flying Pig Bistro and slowly they have been pushed out. I appreciate the earlier hours of opening, the thoughtful conversation effort and awkward eagerness by the cashier, the character of the decor and the prompt service. If I lived in the 3 block radius this would be my place, but I don't so I hope others give this flying pig a chance to perform. Because bagels and black tea in the morning are a must.", 
    "review_date": "2012-09-02"
  }, 
  "yRZK8qd300fDdMCG8AFU2g": {
    "user_rating": 5.0, 
    "user_location": "Brisbane, CA", 
    "user_name": "Shayshay M.", 
    "review_text": "Genuinely friendly...Id go back just based on that. I enjoyed the breakfast burrito!", 
    "review_date": "2014-02-06"
  }, 
  "RkGGZShDTV5m_lE6PWhm5Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney C.", 
    "review_text": "Great neighborhood spot to grab a lunch and hangout.  Very casual and easy going environment.  Lovely people.   I like the tuna sandwich.  The bread was great.", 
    "review_date": "2014-03-02"
  }, 
  "_0U8eYu96-wwI4uR26aj_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew B.", 
    "review_text": "This a great place to get some work done. It's clean, spacious, and they have free wifi and some neat artwork on the walls. A bit off the beaten Mission path, so it's not overrun with tourists or locals and the like. I went on a Saturday afternoon and had no trouble finding a spot. Plus they have Pilsner Urquell on tap!!", 
    "review_date": "2013-05-18"
  }, 
  "9iF51OjQ8ZAolJueVf9Yvg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie P.", 
    "review_text": "Attention celiacs! Not safe for you!   I had heard that Flying Pig Bistro had gf bread for sandwiches and breakfasts, but when I got there, they told me that there are no separate toasters, prep areas etc. When I asked why they advertise themselves as gluten free if they aren't safe for people that need to eat gluten free, the woman behind the counter shrugged and said \"I don't know, nobody seemed to have a problem with it before. People with celiacs eat our food and seem to be fine.\" Oh cool, so you tell them it's safe, they eat the food, go home and have a reaction a couple hours later. Cool. Also it's celiac, not celiacs. Just FYI.", 
    "review_date": "2014-02-02"
  }, 
  "NMNauN3TXZapniWfQ6rYFw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "This little cafe is quite a gem.  They have wifi, a million outlets, and it's relatively quiet (especially compared to Four Barrel who is completely the opposite).   Only tried the cobb salad and cornbread. Both were huge portions and decent. Only thing is I wish they had avocado in their cobbs!   The servers were also suuuuper attentive - always coming by to fill my water and such.  Will be coming back to try more of the menu because apparently they have great coffe (and they have stamp cards!)", 
    "review_date": "2013-02-14"
  }, 
  "I8coxSMgn3OpifesJmjKmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Viv R.", 
    "review_text": "Gluten free goodness abounds. I love this place. Omission lager - they not only ALWAYS have it but also the pale ale and IPA. Unheard of. They even carry the crappier Gluten Free beers as well. Tuesday night is a kick-ass and hilarious trivia night (hard too, fun!) and Wednesday night is a comedy night that's actually funny.  They have gluten free bread so I can order a sandwich without sounding like a freak (leave off the bread). AND their GF bread is actually good. Amazing things can happen.  Best of all it has the feeling of a neighborhood bar. This is totally my \"Cheers\" except without the unrealistic tv friendships. Yay.", 
    "review_date": "2013-10-15"
  }, 
  "EHKBleVl5jrxeS0cKrpRIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Unemployed D.", 
    "review_text": "Love this place!   The owners are friendly and talkative.  The decor is nice, cheery and clean.  They have wifi and television for sports.  I've only been for breakfast and coffee but the menu looks to be good to.  They have a nice variety of beer an on tap, along  with a good wine list. A great neighborhood place to hang out.  So glad they're here.", 
    "review_date": "2012-04-27"
  }, 
  "6EG0FJLJOdAYyM08gWlSWQ": {
    "user_rating": 1.0, 
    "user_location": "Bay Area", 
    "user_name": "Amy L.", 
    "review_text": "The food is mediocre at it's best. The owner is a dick or he need some. Be nice to the people who is HELPING YOU to work things out that you can't figure out yet too ignorant to listen!", 
    "review_date": "2014-11-15"
  }, 
  "kZbVbrvYlbMJa6Z-3FnOdg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carina M.", 
    "review_text": "Great soup!", 
    "review_date": "2013-11-26"
  }, 
  "Qar4dEMfoQODlITdowAGJw": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "J. S.", 
    "review_text": "CELIACS &amp; fellow FOLKS WITH GLUTEN INTOLERANCE, do NOT go here.  Food is reasonably tasty, but even though I talked for many minutes with my server I was gluten'd.  Now, they promise gluten-free food. I told her that I was not doing some diet-fad thing but that I needed food to be gf because otherwise I would suffer. I asked them to pay attention to separate surfaces and utensils, and she promised The Flying Pig would do so.  But they didn't. Whatever they did or did not do in the kitchen meant that my face, hands, and feet started tingling after eating; that I had nightmares and slept fitfully; that I woke up without sensation in my hands this morning; that I have a headache and neck pain; that am feeling down and low and have gastrointestinal issues.  I wouldn't suggest coming here even if you can eat normal food. If they don't care about my health and well-being after explicitly promising it to my face, I find it hard to believe they care about yours.", 
    "review_date": "2014-04-27"
  }, 
  "1cAwUqf5-gbROIz-fSi51w": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Molly C.", 
    "review_text": "The flying pig is great. Who can argue with coffee, great sandwiches and salads, an awesome tap list and a really kind staff? Super warm environment. Great place to catch up with a friend and also get some work done. Chill spot overall.", 
    "review_date": "2014-07-31"
  }, 
  "XRDPh10JR0bAQsCI2dmMaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James E.", 
    "review_text": "Had lunch here for the first time today w/ co-worker.  Really great experience.  Service was very friendly and they seemed to have an ample menu.  I can only comment on a single dining selection because we each had the same thing:  BBQ Flying Pig Sandwich  -- Generous Portion of BBQ Pork with Cabbage Sauteed in Bacon; all on a Sesame Roll.  Everything tasted great--probably a cross between Texas BBQ and Deep South BBQ with a sauteed cabbage twist.  Price is Mid $6 for a sandwich alone but that was enough food for me and I'm 6'2\" and 190lbs.  Am definitely recommending to other co-workers.  Cuban sandwich is next on the list....", 
    "review_date": "2011-02-16"
  }, 
  "NRrNQ5xHn_7Fu4ctlpKLbQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin S.", 
    "review_text": "The excellent Roast beef on rye will keep me coming back and the laid back mellow atmosphere makes this a great place to relax in the afternoon. Think of this as a sandwich shop, not a pub or bistro.   I will be back.", 
    "review_date": "2013-04-24"
  }, 
  "pNpoko0Z8fR9PowRPqlcBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryo A.", 
    "review_text": "My favorite local cafe for sandwich lunch since they have tons of gluten free options! The sandwiches themselves are tasty too and good portion. Very satisfying as it also comes with a side salad.   I also like that the staff is very friendly and helpful, trying to create a pleasant atmosphere.", 
    "review_date": "2014-02-04"
  }, 
  "MAbvtRQIJZAudR8nn6KEKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "El B.", 
    "review_text": "Pretty good sandwiches, pretty inexpensive, pretty relaxed, pretty nice staff.... And pretty great when you are waiting for Larkin Bros to finish with your car....", 
    "review_date": "2014-07-02"
  }, 
  "Unb4-Bd167m5iIBxuk_y4Q": {
    "user_rating": 5.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "Clayton C.", 
    "review_text": "They have great beers on tap and fresh ingredients that make anything you order taste great. I loved sitting at the bar/counter and watching Cfb bowl games while the cute brunette bartender served me up.", 
    "review_date": "2014-01-03"
  }, 
  "DOWugbrvszYvFz18FCt_Bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "james d.", 
    "review_text": "Aside from the preponderance of laptop loungers (often taking most of the single tables whilst ordering perhaps as much as a single drink), this place has quite good food and is staffed by some nice people.  I live nearby and frequently eat here - not once disappointed by their breakfasts or lunchtime offerings.  Great sandwiches and good selection of small sides - a little overpriced for the market, but the food is made with quality ingredients.  Most dishes are meats/cheese, few vegetarian options and slim pickings for vegans.  Their coffees are good (espresso, macchiato, etc.) and they have fresh-squeezed orange juice.  Round off with a good selection of draft and bottled beers, this is a solid go-to spot and I'm glad it's in the neighborhood.", 
    "review_date": "2014-03-04"
  }, 
  "xuEvchz7G_n-QCVWyHJONg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha G.", 
    "review_text": "Very nice and accommodating people.  A number of good gluten-free options for food.  And Wifi.  You can sit and get work done all day!", 
    "review_date": "2012-09-13"
  }, 
  "jG4wl1yybSug88HGEeAwtQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah G.", 
    "review_text": "I've been here a couple of times now.  Really good sandwiches and a nice place to grab a bite.  However, the first time I came here I ordered a sandwich and when asked if I wanted salad or potato salad on the side, I figured why not, I'd go for potato salad.  I was several bites into eating the potato salad when I noticed something that looked like bacon.  No way, I thought, that a sandwich place would put bacon in a side they have as an option for all of their sandwiches without any indication that it wasn't vegetarian anywhere on their menu.  The next time I came in I inquired about said potato salad and asked if they ever put bacon in there.  The person behind the counter said they sometimes did, and when I mentioned that they should probably mention that the potato salad isn't always vegetarian or that it sometimes contains bacon SOMEWHERE on their menu or tell the customer when they are ordering it, she told me that I should have checked and asked them if it was vegetarian when I ordered it.  What???  #1 - it was offered to me as a side option for my sandwich so how was I supposed to know to ask. #2 - I've gone to my fair share of sandwiches places, and I've never encountered a potato salad that wasn't vegetarian unless it says so somewhere in the description.  I understand that this place is called the Flying Pig, but for a place that is gluten-free and veggie conscious, not to mention that people don't eat pig for both vegetarian and religious reasons, they really should indicate somewhere that this might not be vegetarian, instead of relying on the customer to somehow infer this information magically.  So 3 stars for now, I really hope they read this and do something about it.", 
    "review_date": "2013-08-11"
  }, 
  "zkvOkgzqth2hpLY41mGdmA": {
    "user_rating": 5.0, 
    "user_location": "Bakersfield, CA", 
    "user_name": "Kate A.", 
    "review_text": "5+ stars! The new owners have done a great job with this place and they are very hospitable and friendly. The sandwiches are amazing and fresh, my favorite is the veggie. Very generous portions...the decor is relaxed and if you stop by at the right time you will get to hear some great live music from local bands. Give them a try!", 
    "review_date": "2012-08-14"
  }, 
  "vMpnc-E5EWrQXT6sT3-DuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaydee B.", 
    "review_text": "This place is a gluten free heaven.  They can serve all sandwiches on gluten free bread and the deli meats they use are gluten-free!  I tried the club sandwich and it was delicious!  A+", 
    "review_date": "2013-04-06"
  }, 
  "GTw35uJbhz2wZQ5FY62I3w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline D.", 
    "review_text": "I'm honestly surprised by the reviews left by other Yelpers because my experiences there have not been pleasant. I'm giving it 2 stars instead of 1 because my cubano sandwich was okay and not terrible. I've also got to give the new owners credit for making the interior more attractive than what it once was.  It should not take over half an hour for an order to be made when there are only four customers present (and two employees working!). All we ordered were sandwiches and soup but the staff claimed that receiving four orders at once was a lot for them to handle, which meant that we'd need to wait longer. Again, we were the only people in there.   Other friends have stopped in multiple times and have not been impressed with the food or coffee. If you just want a cup of tea and a sunny spot by the window where you can work, then sure, stop in. If you want to grab a quick and decent bite to eat, head somewhere else.", 
    "review_date": "2011-03-02"
  }, 
  "sqDzGQB17ke8xWgDrNqZgQ": {
    "user_rating": 1.0, 
    "user_location": "Tahoma, CA", 
    "user_name": "scott c.", 
    "review_text": "Don't go. Worst chili ever! don't subject your peeps to this one! I ordered the coney island chili cheese dog. It was topped with a mysterious paste that had no resemblance to chili. Absolutely disgusting.  They won't last long in our neighborhood!", 
    "review_date": "2012-11-17"
  }, 
  "JSZThmpzX6cRM2MXIP6wxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oliver B.", 
    "review_text": "Flying Pig Bistro is a great neighborhood place.  The staff has always been extremely welcoming even when we brought our baby boy to the World Series games, and the food is great and well priced.   The steak and horseradish sandwich is really good!", 
    "review_date": "2013-09-17"
  }, 
  "gE2HizPU6wFJAmeW2Ln0yg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Finn M.", 
    "review_text": "Awesome sandwiches and good beer selection. Brought a couple relatives here for a quick bite for the first time today and all three of us were very impressed.  Very friendly service, cool environment (TV's and guitars available for use), and the food was great. I recommend the pesto chicken one myself, but it sounds and looks like everything else is good as well.  I will be back again for sure,", 
    "review_date": "2012-09-09"
  }, 
  "87XABbNHzxFbEI_fzNKihg": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Taylor R.", 
    "review_text": "I was sent to the Flying Pig by coworkers and have been here twice. I'm a huge fan! The first day I came in I had lost a coworker and needed some comfort food. I went for the Chili Dog with potato salad, and a beer. They realized after I ordered that they were out of the helles lager I had ordered, and went out of their way to help me identify an alternative, and ended up settling on a more expensive beer (which they didn't charge me for). The chili dog was huge and delicious-- I think they make their own buns, and it was great. It definitely lifted my spirits.  Second time I wanted some brunch, and got the Breakfast Stack. They gave me both bacon and sausage, and piled it high with added jalapenos and avocado (upcharge there). I paired it with a hot apple cider, and it hit the spot!  If I lived in the Mission, this would also be my go-to bar-- super sweet vibe.", 
    "review_date": "2014-09-19"
  }
}