{
  "RfqauZ1r3btCbfsrhigldw": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Pamela C.", 
    "review_text": "I ate here a few months ago with my boyfriend. He asked me last night when we were coming back. I realized that I had wanted to post a review but life got in the way. We made a reservation on a Tuesday evening. The place was packed. We were promptly greeted and sat. Our server, Aldo was amazing and on point. He was knowledgeable about the food and made great recommendations.The support staff were also on point. The food runner dropped each dish with an description of the food. The bussers cleared with efficiency. Another server filled our empty wine glasses before we got a chance to realize we even needed a refill. I work in the industry and appreciate team work when I see it.  We ordered the blistered peppers, deviled eggs, crudo, lamb skewers and the duck. Every dish was presented well and yummy. We ordered a second deviled eggs before dessert because they were that good. The lamb skewers and crudo were my favorite. The eggs and duck were my boyfriend's favorite.   Yes the prices were a bit high but the quality of food, service, atmosphere and experience was worth it. I never ate at the old Fog City so I can't compare the two but I do recommend it to friends and customers that ask me of a great place to eat in the city. I will be back soon and can't wait to have those lamb skewers again. FYI: the blistered peppers added to the lamb skewers is delish!", 
    "review_date": "2014-02-06"
  }, 
  "oLkCENbfUHq5Y3_fCr5rrA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dania H.", 
    "review_text": "Wonderful service, food, drinks, dessert, and atmosphere!   Our waiter knew the menu like the back of his hand. He offered suggestions and was precise. He was patient with our group and didn't make us feel rushed while still maintaining a steady service pace.   The food. The food. I will definitely be returning and spending my hard earned money here. I mean they can just take it by the barrels. P.S. I really want to try the drink they have aging in that barrel in the bar area. Cheeseburger was delicious. I had a bite of the salmon dish also great. I might have that next time.   My drink had milk in it. It was citrusy and sweet and delicious. Waiter knew what he was talking about. I really wish I remembered his name. If you're reading this, thank you, thank you, thank you. I had a wonderful dining experience because of you.  The dessert. The pumpkin bread pudding with pumpkin spice ice cream and caramel bourbon sauce was orgasmic. It could have it's own review.   That night I slept well. Food coma survivor extraordinaire here.", 
    "review_date": "2014-12-21"
  }, 
  "gOBFkLsR6gfpJ378ND4ykA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Caroline Y.", 
    "review_text": "The food is just okay. In fact they brought me the wrong hamburger. Instead of offering to make another burger the server said they were still ironing out the kinks since the place reopened several weeks ago. I paid $14.00 for the hamburger and $6 for cold fries. Never again at Fog City.", 
    "review_date": "2013-11-07"
  }, 
  "56Y__3lMsc_i1bwc9ML92A": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "David S.", 
    "review_text": "Multiple special occasion had been spent here in past. College graduation, engagement, romantic dinners. This past Saturday has changed my view and loyalty. The remodel was nice by opening up the floor. We had a drink at the bar while we waited for our table. Once seated we asked for bread three times, ordered our appetizers and entrees. Bread came after a long wait. Water was poured for some and the pitcher was left empty. Food quality was over all good. In a city of vegans and vegetarians not one item off and on the menu existed. It was looked down upon when we asked for lemon to flavor the blan cauliflower. Food came to the table we did not order and billed us for. Vegetable sides came after entrées.  The menu should be labelled with small plates and big plates because the portions of some items are on the small side.", 
    "review_date": "2014-03-18"
  }, 
  "12q5Bup5oxkhZqAXPHkNJw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Lola Z.", 
    "review_text": "Enjoyed dinner here in a busy Sunday evening. Great service. Minimalist decor, dim lighting. Nice, yet casual, environment. Good sized bar and drinks. Dinner for two ran about $110-ordered 1 beer, 2 cocktails, a fig salad, hamachi crudo, deviled eggs &amp; lamb skewers. All were good-would definitely return!", 
    "review_date": "2013-09-29"
  }, 
  "8PB0zJe6oPmiIK1eOmk38A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "robert l.", 
    "review_text": "It was really loud.  The food was not as good as it used to be.  The ambiance was like a bar more than a restaurant.  Did I say it was loud?  I guess it was wishful thinking that the old Fog City Diner would remain unchanged, sad.  The food was $$$.  Nothing sticks in my head as particularly good for that price range, 2 out of 5 I would say.  The service was 3 out of 5.  I'm not going back.  The one thing I liked was the communal seating.  Had a good conversation with a stranger.  That was fun.", 
    "review_date": "2013-11-20"
  }, 
  "7gNtYzygF7dB8e7k1mWdjA": {
    "user_rating": 4.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Isabella B.", 
    "review_text": "I first dined at Fog City through a YEE held here last month. (<a href=\"http://www.yelp.com/biz/elite-event-hello-fog-tober-san-francisco?hrid=hB57NL0N339RN1D3PSn9BQ\">yelp.com/biz/elite-event…</a>) As I showed the No1DP the pictures and explained what I had that night, he saw how much fun I had at the event and wanted to experience the restaurant himself the next time he saw me. I came back here one month later with the No1DP and friend/fellow Yelper Aren A., who initially took me to the YEE here as his +1.  CONCEPT: Originally known as the Fog City Diner before dropping the \"diner\" label. Looking from previous pictures no decor from the original restaurant remain, save the views of the Embarcadero. What did remain were the core elements of what made this restaurant famous - small plates.   VENUE: Looks to be an upscale \"diner\" with the more overt diner decorations removed - hues of brown enumerate the area. There's a big central bar area with the booths circling the bar.  SERVICE: Excellent service. She warned us about the long prep time for the chicken and offered to replace my drink when the No1DP accidentally toppled over my Milk Punch.  COCKTAILS - Milk Punch, $11 (Bourbon, Brandy, Rum, Citrus &amp; Spices, Sugar, Clarified Milk). This was my cocktail throughout the night as I fell in love with it back at the YEE. I could not taste any hint of the alcohol as everything in this drink was mixed well. - Grandpa's Breakfast, $12 (Famous Grouse Scotch, Allspice Dram, Combier Kummel, Lemon, Honey, Whiskey Barrel Bitters). One of No1DP's drinks. He enjoyed his drink as the whiskey and ingredients went smoothly. I liked it because of the cup it was served in, which is more appropriate for coffee.  - Paper Chase, $11 (Junipero Gin, Cappelletti Apertivo, Dolin Dry, Raspberry). One of Aren's drinks, tasted \"too much like Robitussin\". We eventually told our waitress, who took it off the final bill.   PLATES - Local Oysters on the Half Shell, $3.50/oyster (Oak Barrel Aged Hot Sauce, Shallot Mignonette). Oysters were a bit on the small side. The hot sauce and mignonette went well with the brine.  - Deviled Eggs, $8 (Grain Mustard, Crispy Quinoa, Bacon). Fell in love with this at first bite at the YEE. The creamy egg serve as base for the crispy quinoa and bacon.  - Iacopi Farms Brussels Sprouts, $10 (Asian Pear, Ponzu, Togarashi). Didn't like the pears but the togarashi spices gave the sprouts a slight spicy kick. - Crab Cakes, $11 (Basil Aioli, Oven Charred Cherry). The actual crab cake was decent but the taste improved with the aioli, which didn't have too much basil. - Broccoli Di Cicco, $11 (Flame Grilled with Lemon, Garum, Fiordolio Olive Oil, Garlic Chips). Tasted a lot like broccoli but there was so much flavor into the garlic chips.  - Wood Oven Whole Chicken, $38 (Brentwood Corn, Bacon, Fingerling Potatoes, Kimchi Butter, Spiced Salt). This is actually a larger plate but we treated it as a small plate and final dish. You have to order this in advance as it takes at least 30 minutes cook time. The meat was tender and juicy all through the chicken - no dry spots on the breast. Rub was simple yet delicious. The corn and potatoes took some of the chicken juice and as a result went well with the chicken.  SWEETS - The \"B\" Bomb, $7 (Glazed French Cruller, Vanilla Frozen Custard, Egg Yolk Caramel). My dessert, as I still wanted some of the frozen custard. I realized it looked and tasted like a fancy donut with fancy ice cream. Though I liked my dessert it was a bit on the plain side. - Pumpkin Brioshe (sic) Bread Pudding, $8 (Bourbon Caramel Sauce, Pumpkin Spiced Ice Cream). Aren's dessert. A solid piece of bread pudding, though I didn't taste much pumpkin. - Panna Cotta Pudding Cake, $8 (Dark Chocolate, Milk Chocolate, Caramel, Candied Peanuts). No1DP's dessert, the chocolate smooth yet not too rich. Candied peanuts are made to be eaten with the dessert. I should've ordered this dessert instead.  FINAL BILL: ~$245.  I look forward to trying more small plates here. Note that the Milk Punch and the Frozen Custard are on the 7x7 Big Drink and Big Eat, respectively.", 
    "review_date": "2014-11-12"
  }, 
  "jC-LuL1IEU8TJp342DmWKw": {
    "user_rating": 5.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Ari R.", 
    "review_text": "It's rare when every dish you get at a restaurant is perfect. It happened here. From the rustic sourdough bread (oh my god) to the Brussels Sprouts to the amazing whole chicken.... everything perfect. The chicken is really a complete meal. It has these amazing vegetables that cook in the chicken's juices and really, this dish is a religious experience. The beer was cold, the crowd was cool and the host and waiter were so nice. I cannot wait to return!", 
    "review_date": "2014-04-03"
  }, 
  "Snio_QiJPDPrtrL6GXkb9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ray L.", 
    "review_text": "Good location. Food is tasty. A little pricey but I would come back.", 
    "review_date": "2014-01-21"
  }, 
  "sRkBYod0y2OjIHtpw4gSWA": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "G And G.", 
    "review_text": "Best place in town. We were going to see Avett Brothers in concert at America's Cup Pavilion and picked the closest place for a lite bite, we actually went in 3 times. Once to get directions to another restaurant, luckily for us it wasn't open. The second time to check out the place and went to look for other options, the 3rd time was to eat. We were starving! We were SO glad we came back to this place. We sat at the bar, talked with the bartender the whole time, he was so great, watching him work was so much fun and entertaining, learning all about mixing cocktails, chatting with us the whole time but working extremely hard and efficiently for the waiter staff. We had amazing fries and a fabulous classic burger. Had the opportunity to speak with Bruce, the chef/owner who is a down to earth, friendly guy who clearly takes pride in his restaurant and rightly so. We had a great time, learned about different types of food and drink, it was a great atmosphere, we'd definitely go back and sit at the bar. They have a community table that is on a first come basis along with the bar, reservations are definitely required for tables. Food was superb, thanks Bruce, see you again soon!!! G&amp;G", 
    "review_date": "2013-10-13"
  }, 
  "lMLPQoeBq77bYxFvvcgvZA": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Micki M.", 
    "review_text": "I've wanted to try this place for some time and had the perfect opportunity after a Yelp party on the Hornblower. When we arrived it was probably closer to 10 pm on a Saturday night, the place was semi full, we asked for a booth and the polite hostess seated us at the bar while we waited for a booth. We've always come across this place when there have been a long wait. Not this time!   We waited maybe ten minutes, I had enough time to order a drink before we were seated at a comfy booth looking out onto the street. I already had my drink in hand and our server took hubby's order of coffee when we seated. Coffee was good, I point this out, because, we've ordered coffee at other places and we can't keep track of the number of places who serve crappy coffee on the off hours! Fog City is everything I imagined, cool, vibrant, superb service! Great ambiance, great lighting,great people watching and great atmosphere! We probably should've felt under dressed, we were dressed in our SF attire, looking like total tourists(dressed to look the part for our Yelp party). We were dressed in SF hoodies, and sneakers, lol! Never felt out of place. Noticed that there were others who were dressed to the \"Nines\" but couldn't pay for their bills, lol! How many times does the place have to decline your credit card, people!! Yup, saw that you paid in cash after so many rejections.   We quickly glanced over the menu, ordered the cheeseburger and the Chinese chicken salad, we mentioned to our server that we will be sharing both and when our food came out, the cheeseburger was cut in half and cooked EXACTLY the way we specified! Cool! The cheeseburger was similar to an In n Out burger with a better quality of meat. Cut symmetrically, with everything intact with every delicious bite! I also ordered a Miyagi oyster shooter, for the helluvit! I was in San Diego the week before and had the same oyster and it solidifies my judgement that the oyster in SD was not what I expected! The Chinese chicken salad satisfied all your senses with different textures and tastebuds were on overload with so many different tastes!   I'm not sure, there was a need for a server here, they provide you with a carafe of water, the food had absolutely no complaints, it was everything I had imagined! I will definitely come back if the place wasn't so damn busy. That's a good thing! It's pricey, but damn good!", 
    "review_date": "2014-08-03"
  }, 
  "ydeU5IZFEvvu_1JHKbWo9w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shine W.", 
    "review_text": "Came here twice, and ate;  Smoked salmon Brussel sprouts Clams Burger  Trout Plain French fries French fries with furikake  The only good thing was plain French fries...  The rest sucked and sat in my stomach for hours it made me sick.  Definitely overpriced.  Terrible quality food for what they charge it's insulting.", 
    "review_date": "2014-01-11"
  }, 
  "34CVzDSZcln9rlOjY15ZdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coree W.", 
    "review_text": "I came here for dinner and really wasn't expecting much from this place after reading previous Yelp reviews. It by far exceeded my expectations! We had great cocktails, and reasonably-priced good wine. While all the food was good, the deviled eggs, brussels sprouts and whole roasted chicken were particularly awesome!!", 
    "review_date": "2013-12-23"
  }, 
  "i8H141eI886jh4kuiE6i1g": {
    "user_rating": 4.0, 
    "user_location": "Nicasio, CA", 
    "user_name": "Quigley Q.", 
    "review_text": "Great menu. I went there for lunch so that's all I can speak to. Falafel sand which was good but the fries and the Brussel sprouts were worth coming here alone. Great location and record. I would certainly return, especially with out of towers. Only con is the expense, but that really isn't a con as its not exactly a secret.", 
    "review_date": "2015-01-07"
  }, 
  "y_jl-bErj1mnb4KF04F74Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "Great food options and drinks - but very loud - you need to shout at people across the table if you go when it is busy.", 
    "review_date": "2014-03-29"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "We had a great time out at Fog City this past weekend with a group of friends who also really enjoyed their experience.  Reservations were tough to come by and the six of us were sat in a booth but it all worked out.  Our waitress was a little interesting but the food made up for everything.  We started with the deviled eggs (awesome taste and loved the little bacon on there), brussel sprouts (so money), fries ( so good as well) and kale and farro salad.  We shared a bunch of entrees among them was the swordfish, pork chop and ribs.  Each were really good and prepared perfectly,  For dessert we got the strawberry shortcake, french cruellers and custard and all were a perfect way to finish the meal.  This is a new Fog City but in a good way.  The food will impress.", 
    "review_date": "2014-04-21"
  }, 
  "QI-oVGhqLNp5yO3fyGC8hg": {
    "user_rating": 1.0, 
    "user_location": "Newark, CA", 
    "user_name": "Jane B.", 
    "review_text": "I eat out often in San Francisco and was anxious to try the new Fog City.  The new decor is gorgeous but the food was, well, pretty bad.  I had the chicken sandwich and my husband had the sesame chicken salad but we shared the two dishes.  Both were only OK.  The chicken in the salad was gristly and there were strips of plain skin in the salad.  The salad was over-dressed and was one of the worst chicken salads I've had.  The sandwich came with coleslaw so we asked if we could substitute fries.  Our waitress said yes but later charged us $3 for the fries which she didn't mention up front.  We had strawberry shortcake for dessert, thinking maybe that would redeem the meal, but the berries didn't taste fresh and the biscuits had a weird flavor.  So overall, a big disappointment.  We won't be back.", 
    "review_date": "2014-08-17"
  }, 
  "ZvEOY2p6v0ORu3z3h-6VlA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan M.", 
    "review_text": "Very good food. The lady at the entrance was rude. She asked us if we want to look at the menu before sitting down. Felt like she thought we couldn't afford the place :)", 
    "review_date": "2014-03-01"
  }, 
  "JIaACWmW5r2_1LULLjeP5Q": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Kevin E.", 
    "review_text": "What you would think might be a tourist trap is actually a really decent restaurant for lunch or dinner.   Located close to the tourist area of Embarcadero (near pier 39), the Fog City Diner has some really good food specialties (clam chowder) and classic cocktails.  While not \"on the water\", it's close by and makes walks along the waterfront very special.", 
    "review_date": "2014-11-06"
  }, 
  "KUXfzl-Sc1wn2nkX-Slyww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh Q.", 
    "review_text": "Came here for dinner and was pretty pleased with the whole experience.   For apps, the cauliflower, fries, and deviled eggs are excellent.  For main course, the wood oven clams and swordfish are great as well.  I had never tried swordfish before, so I thought I would give it a shot here.  I was a bit surprised at how the swordfish came out (on the meaty side), though I hear that is simply how the fish tastes - and overall the dish was otherwise excellent as well.  For dessert, I had the frozen custard + egg yolk caramel and a French culler.  The caramel is definitely worth a try.", 
    "review_date": "2014-07-11"
  }, 
  "kOn2L4zlv9KqxLUxtPBveQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geri K.", 
    "review_text": "I've eaten here at least six times in its new incarnation and could not be happier.  The food is simply outstanding, with impeccable, fresh-from-the-market ingredients and phenomenal flavors that explode on the palate.  The wood-fired broccoli is one of the best veg dishes I've ever eaten; I get it almost every time. But the artichokes, now in season, give it a run for the money. And the deviled eggs with crispy quinoa and bacon are divine, but I was also impressed with the dollops of ahi tuna tartare on bite-sized rice cakes.  All of the entrees have been delectable, from the savory whole deboned chicken to the delightful wild boar ribs to to spicy lamb skewers to just-caught fish specials.   I'm normally not a dessert person (I prefer a sweet cocktail such as the Fog City Milk Punch or the Wisconsin Fix, both remarkable) but the house-made custard with caramel sauce is out of this world.   Service is always excellent, but last night, Tobias took it to a new level. I felt like I was dining at a very attentive friend's house rather than a restaurant. Unparalleled service like that cannot be taught; it's innate in a person's heart.   Have I had a couple dishes I wasn't keen on? Sure, but other Yelpers have adored them. And nothing has sullied any visit enough to make me love this place less.  The incredible food, and the cocktails that are among the best in town, and the lovely service, and the fact that a manager always stops by, and the ambiance that's now chic and modern and fun, all add up to a winning experience for me every time.", 
    "review_date": "2014-05-30"
  }, 
  "hergQXcUDbw0LH2V5imeJQ": {
    "user_rating": 4.0, 
    "user_location": "Concord, MA", 
    "user_name": "Goodfinds P.", 
    "review_text": "Delicious food, excellent service.  It's just way overpriced.  The prices indicate to me that they are a little full of themselves.   While we could have left when we looked at the menu, we were too tired to get up and leave, and my husband would have been embarrassed (not me!) so we stayed.   The pork french dip was delicious, my summer tomato salad was delicious, my husband's chicken sandwich was delicious, my mom's soup was delicious, the price for lunch for five (no alcohol) was $145.   That is just crazy.   But, it was really good.  So, you have been warned!!!!", 
    "review_date": "2014-08-14"
  }, 
  "KT0MJsONmQbNYqXfYF2QKQ": {
    "user_rating": 3.0, 
    "user_location": "Kodak, TN", 
    "user_name": "Doug G.", 
    "review_text": "Way overpriced for the Quality of food.  Nice location.  service was ok... I will try somewhere different next time I am in that area of SF.", 
    "review_date": "2014-05-24"
  }, 
  "WSwA7mhnb8XmUC1_UpMQNQ": {
    "user_rating": 2.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Anonymou S.", 
    "review_text": "Good but not outstanding food and service at an outrageous price. Definitely a tourist trap for the Fisherman's Wharf crowd.", 
    "review_date": "2014-02-25"
  }, 
  "obC5UOkcegvjASnr4RKoxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley C.", 
    "review_text": "I gave this another try on a Friday night, and had arguably the best service I've ever had.  Wonderful guy, can't remember his name but he did say he was half-Mexican, half-Persian.  I think the first time I visited we got a trainee or something.  Will be back!", 
    "review_date": "2014-01-09"
  }, 
  "4zam0N_2wsqVaUAEXF8rXQ": {
    "user_rating": 2.0, 
    "user_location": "Danville, CA", 
    "user_name": "B H.", 
    "review_text": "Had a late lunch here yesterday with a group of four and we thought the whole experience, including the food was pretty uninspired and basic.", 
    "review_date": "2015-01-16"
  }, 
  "ia9WOAZ6eXMbNgr4wvmJ1g": {
    "user_rating": 2.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Josh B.", 
    "review_text": "Decent to good food but not kid friendly. No kids menu. My brother asked for chicken to be added to his salad and they refused. Minus one star for that. Hostess argued about putting a high chair at our table too but the waitress ignored it.", 
    "review_date": "2014-03-15"
  }, 
  "noMq6mZGhbI3krwL8qz1PA": {
    "user_rating": 5.0, 
    "user_location": "Boca Raton, FL", 
    "user_name": "Forrest H.", 
    "review_text": "excellent service and very solid food", 
    "review_date": "2015-01-26"
  }, 
  "DI7mg1oQHeUApMm-9Y-BGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "b s.", 
    "review_text": "Fog City diner is not a diner so if you want Mels, go somewhere else. We attempted it on a whim one night last week because it was late, i wanted fish, and it was close. I had been to the old one a few times and was just put off by something ...not sure what it was but hadn't been back in years.   First off, the space is lovely. It's open with a v shaped bar and a woodfire kitchen- GREAT for a foggy SF night. Our waiter was hilarious and took great care of us. He approached us and simply said 'hi. want to split a bottle of wine?\" clearly seeing what kind of gal I was. However, this night I order a drink instead.   And what a drink! 5 stars just for it. The kind of drink that you would finish in 30 seconds because it was so amazing. Make sure you order it- Fog City Milk Punch. Sounds totally gross, goes down so incredibly easy.   From there we got appetizers of oysters, fries, and broccoli, mains AND desserts. Everything was yummy- my partner loved the fries more than I did but i'm a steak fry kind of chick.  He got short ribs and I got the special of the day- wood-fired tuna. It sounded like it was going to be a mess but the olives, fish stock, beans....all came together with the fish.   I'm happy this place is by my house but my wallet is sad. It was a bit spendy for a \"quick bite\" after the gym but we did stay and eat our fill for two hours. I'll be back- next time for brunch.   A couple of notes- the table next to us ordered all veggie plates and they must have had 7 different types of non meat based dishes. A good bet for you cow savers. Our broccoli side dish was MASSIVE and I ate it warmed up in the oven for the next two meals.   Lastly, rumor has it they serve box lunch for noontimes. If you work around there, I would totally 100% check it out.", 
    "review_date": "2014-09-11"
  }, 
  "XtTe0SLLEXjonEsrLYr6OA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alfonzo J.", 
    "review_text": "Let's talk about chicken. If you're like me, you usually avoid ordering chicken at restaurants b/c there's nothing worse than dry chicken. Well, I don't know how Fog City does it, but they're chicken is mouth watering moist. On the reals, I was saying \"WOW\" during every bite, and the chicken even stayed moist during our last few bites.  So if you want to experience an amazing whole chicken that'll serve two, swing by Fog City. Additional details of my visit are below:  My GF and I sat at the bar where we were served by Matt, the bartender. Awesome dude who is very friendly and attentive. Here's what we ordered:  Deviled Eggs: They add a piece of bacon to the top and sprinkle the egg with toasted quinoa...MIND BLOWN  Halibut Crudo Appetizer: The watermelon is a nice touch and it's good, but I wouldn't say it's the best I've had.  Wood Oven Chicken: DAMN GOOD  Apple Pie Dessert: Delicious", 
    "review_date": "2013-10-07"
  }, 
  "XmEywucVDyUP9VJ4SXGjzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "Fog City is new and with a team of heavy hitters behind it.  It shows in the food, the service, and in how such a newly reopened place can function so smoothly.  First off, tables are pretty well spaced. However, the room gets quite loud as it fills as the ceiling is quite low.  But I tend to like a venue with energy and Fog City has that.  I also like a place where the waitstaff knows the menu.  Fog City has that as well.  My lovely young server was able to describe and discuss the menu in detail and to make suggestions.    I started with wood grilled tomato soup that was topped with basil and stracciatella. The cheese made all the difference and elevated a nice bowl of soup to something considerably better.    Roasted baby carrots came with a mole sauce and slivered almonds.  The mole sauce and almonds were wonderful.  The carrots were somewhat pallid.  I had thought that the roasting would concentrate the sweetness of the vegetable but these remained bland.  Nevertheless, this was a nice appetizer.  Half a planked trout came with fingerling potatoes, olives, and a grilled lemon.  This was the highlight of my meal.  The trout was perfectly prepared.  Not overcooked and not messed with.  Just fresh, lovely fish to sate my appetite. The only way this plate could have been improved would have been to provide a small bowl of the mole sauce from my carrots for me to dip the potatoes into.    Fog City is on track to become a new, landmark restaurant in San Francisco.", 
    "review_date": "2013-09-30"
  }, 
  "a3EtM6osbyISrZyNuo7JKQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ed h.", 
    "review_text": "Mediocre experience.  I was looking forward to the new Fog City, but cannot recommend it to friends.  Must agree with other reviewers, food was good, but service needed a lot of help.  Condescending and not much of a welcome at the door.  Sort of like a getting a tire change. The waiter  really had no time to come and check on us (and it was early in the eve), she was pretty busy chatting up this guy at the counter.  Overall disappointment, but will try again as brussel sprouts were the best.", 
    "review_date": "2014-02-06"
  }, 
  "uVzxkswQxGHrr7ZrX_ZMnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacqueline L.", 
    "review_text": "On a night out with a girlfriend, we were trying to find a place next to FiDi during Rush Hour. \"How about Fog City Diner?\" \"Ugh, seriously? Remember how bad the service was?\" \"Yea, but it got renovated remember?\" \"Uhhh? Did they renovate the staff?\" So then became our first time after the renovation of Fog City Diner.  I had made an appointment on Open Table and then had called them ahead of time to say we were early. They were able to seat us. Wow! This is a remarkably different place. Hustling for a Friday night, beautiful new interior design. I spotted dish ware from Haven, Always beautiful pieces of high quality and locally made.  The bar is open, The kitchen is an open concept. The management serves as well as the staff.  We started with the hand cut furikake fries with garlic aioli. Amazing, filling, addicting. The pickled gold shrimp with fennel, sweet onion, celery, cilantro avocado, and serrano chiles had you tasting all the flavors. Wonderfuly prepared. The roasted duck leg with roasted raddichio, delicate  squash, asian pear, and Manadori Balsamic over the side salad was delicious. I even had to stop the waitress and ask where the Balsamic was from. It's an aged Balsamic from Italy.  Service was continuous. They were great with service, after every entree to stay in touch with each customer.Communal tables. Bar. Then table tops.  The only place I found disappointing were the French Cruellers. I love French Food, but this one had no taste.  WIll be back again. Everything great, and I love the new Fog City. Just don't get the French Cruellers.", 
    "review_date": "2014-03-15"
  }, 
  "vn14QI6xmHWAbCSRmp5_3Q": {
    "user_rating": 1.0, 
    "user_location": "Danville, CA", 
    "user_name": "Sean W.", 
    "review_text": "This place is not like it used to be. The service is bad and the food is not any better.  Over priced and not very good. Not much more can be said.", 
    "review_date": "2014-04-27"
  }, 
  "Equi11nuKInRA0fem4DN4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay H.", 
    "review_text": "First time that the new fog city! Everything was absolutely exquisite with the exception of the rock music where dinner music (jazz) would've been appreciated! Will return again and again.", 
    "review_date": "2014-11-14"
  }, 
  "qJDHXse4y0rJOiV7rO8KOA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angeline V.", 
    "review_text": "Fog City...Oh Fog City.   I actually really used to like Fog City before the renovation. You know, when it was still a legitimate diner and serving up delicious truffle fries without adding on shit tons of Furikake seasoning. But then they went and renovated it and alright, alright it really is beautiful! It is a complete transformation and worthy of applause. The wood fire kitchen is my favorite part- it really sets the tone.   But here's what I didn't love- I had a reservation for two but was not seated until 15 minutes after the reservation in spite of there being MANY open tables. I ordered the burger and while I love a delicious bougie SF burger, I can still get down with regular burgers to the liking of In-N-Out, Roam, etc. NEVER AGAIN. This was the worst burger I've ever had and I am shocked that anyone who has had the burger liked it enough to give it a good review.  The bun was soggy. The lettuce was sparse. The meat didn't really taste like anything and was a thin patty. You pay $15 for a shitty burger that doesn't even come with fries. Man. I got through about 2 bites and called it quits.  The service was shotty. They didn't even come around enough for me to tell them the burger was unpleasant. When our server did come around, she looked already irritated. Also, it took 45 minutes for us to get our two orders of fries, a burger, and soup. It was a situation where every table around us seemed to be getting their food before us which I might be more understanding of if our food was outstanding but it just wasn't.   In the restaurant's defense (and the reason for the extra star or else it really would be a one star), they comped the burger off the bill and was apologetic about it. But I will not be back at Fog City.", 
    "review_date": "2014-09-21"
  }, 
  "keyjMjGU6p46Pu45YFKaxg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Micaela M.", 
    "review_text": "Dinner started out great with amazing apps!  Brussel sprouts and Deviled eggs... Got roasted Chicken was ok however prob could have cooked something better at home.  The part that pissed everyone off at the dinner table was the fact that the french fries were covered in Nori and fish food flakes... literally the stuff you used to feed to your pet goldfish... You decide for yourself...", 
    "review_date": "2013-12-10"
  }, 
  "JeS7ciQNAY6seqFVrhsIuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaina S.", 
    "review_text": "We had a really fun evening here -- it's loud &amp; boisterous, but you're actually better off that way because of the acoustics of the main dining room.   Cocktails are very well made.  The dishes we tried trended towards spicy and a little salty, and I wonder how consistent the seasoning will be, since one thing really needed salt and I don't remember any being on the table.    I notice a few Yelpers experience sub-par service -- i thought the service we got was very good though.     It's such a great location along the water; and I'm really glad they seem to have gotten the old Fog City groove back (before the re-launch, it had gotten really kind of sad.)   We'll definitely be back.", 
    "review_date": "2013-12-22"
  }, 
  "5MusOgK528q7uyGw0H9MVQ": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "tara c.", 
    "review_text": "Beautiful remodel! Huge bar that wraps around the restaurant. Great food with a varied menu. Kale salad ** brussel sprouts** burger** winners!!", 
    "review_date": "2014-01-14"
  }, 
  "SqSMWBHD2Lklf_8W5MftPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pilan C.", 
    "review_text": "Had a great dinner at Fog City last week with guests in town. We picked it because of the location, but the food was pretty great. The roast chicken was delicious (not quite Zuni Cafe-delicious, but really good), and even the cabbage in the skillet was good. The star of the night, however, was the roasted carrots with mole, which was unlike anything I've had before. It was so good we ordered a second plate of carrots. We also enjoyed the asparagus, deviled eggs, and brussels sprouts (which were some of the best ones I've had that didn't include bacon or pancetta). The cocktails were also pretty good, especially the barrel-aged Saboteur. Unfortunately, they lose a star because the service didn't quite live up to the food. Our waiter would disappear for long periods of time, and it took us an abnormally long time to get and pay our check. The food was a little bit on the pricey side too, but nothing too surprising considering we're in SF. It's a cool space with a good location, so I'm pretty sure I'll be back in the future, probably when I have more guests in town.", 
    "review_date": "2014-03-07"
  }, 
  "vCpqH5qbs36s7AQBu64yOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Quinn B.", 
    "review_text": "I don't like change, but I'm reconsidering my position based on my experience at Fog City.   This is brilliant reinvention. The space still feels special (in the way that the diner felt special in the 80s), but now it's polished, open, and sophisticated. It feels current without being precious. The staff are warm and welcoming in an authentic way. And the food is beyond delicious.   Those fries with the nori on top? Seriously? We loved them. (As did everyone else; we saw them on every table and at the bar.) I'd go back for the spicy pole beans any day of the week - amazing. A lady even grabbed my arm as I walked in and she walked out, and she whispered, \"lamb skewers\" in my ear. Didn't know her, but she was looking out for me. (That really happened.) And the plum sauce over the frozen custard was the perfect ending.   It's rare for a dining space of this size to exude a certain happiness from staff and patrons alike, but Fog City does. I'm happy it's happy.", 
    "review_date": "2013-10-01"
  }, 
  "KZazCSfV4oyRWcCukVBMPA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryant W.", 
    "review_text": "As a long time Fog City Diner patron I was excited to experience their new venture, I was both open minded but also aware of its past.  As we arrived the restaurant we were impressed by the new design and overall attention to detail. Much of the old experience is gone (minus a similar booth setup), but the new design is both crisp and tasteful.  Unfortunately however, anything good about the new concept stops at good design.  The Menu:  The menu is not at all reminiscent of the old class Fog City Diner. I get it, they wanted to drop the diner concept and move into something more upscale and sophisticated.  The new approach is \"small plates\" something that has gained popularity among restaurants over the past few years.  Personally, I'm not a fan of tapas style with this type of cuisine, but I understand it.   There are a few nice dishes on the menu ranging from a more simple butter lettuce salad to a more robust/hearty dish-- the chicken.  There's probably something for everyone on the menu, but I would have loved to see them keep a few or the original Fog City Diner dishes like their famous chicken paillard or their classic sourdough leek loaf. I think they could have pulled this off while still offering a fresh new innovative menu. It would have certainly kept all of its longtime patrons happy.   Our dishes all came out at the wrong time.  For example a cheesburger came out for one person (yes, I know it's intended to share, but not really practical to do so), but our chicken dish didn't come out for another 30 minutes.   All in all, the food was average but not up to Fog City Diner standards.  The Service:  To put it lightly, the service stunk. Our waiter was careless and often combative. We asked the status of our chicken dish that was over 30 minutes late and was told that plates come out as they are made. We then asked the manager separately and was once again given a lecture on how their dishes comes as their made, later to find out that the waiter never fired the dish.  Their problem was passed off as ours, a big no no in service- particularly as a \"new\" restaurant. After all the problems with the timing of our meal no one else even came over to apologize or explain.  It would not have been that difficult for the GM to stop by and provide an explanation and apology for the mishap (needless to say it ruined our experience).  I really wanted to like the new Fog City but I think the management should take note of the recent reviews (many 1 star from what I can see), and pay closer attention to what their customers want.  Secondly, I think there's a huge opportunity for them to improve their level of service. Patrons don't dine out to get schooled on how things work- just make great food and deliver good service. Recognize when things aren't going right, and make them right- it's not that difficult.  Lastly, they should seriously consider adding a few of the classic Fog City Diner items back on the menu.", 
    "review_date": "2013-10-18"
  }, 
  "rySp7MIdFZxUqtQd4NQjfA": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Katie P.", 
    "review_text": "I ordered the saigon dip which I found to be very tasty and regular iced tea which was so delicious that I had several glasses!", 
    "review_date": "2014-07-22"
  }, 
  "xLMRzWiStf2CfqXUQcTAKQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ron S.", 
    "review_text": "3 types of beets in a yummy sauce, really well garnished and tasty deviled eggs, and crisp/warm fries with bonito flakes. The only minor disappointment was the bonito flakes were not moving.  Check out this video:  <a href=\"/redir?url=http%3A%2F%2Fyoutu.be%2FjbuFRpNP9Zk&amp;s=8c0bd02229c4dd63e172dd36cec6e2a7030ccf7a06c4cd978638d0dfc089b0a6\" rel=\"nofollow\" target=\"_blank\">youtu.be/jbuFRpNP9Zk</a>.  That's what bonito flakes are supposed to do.  Great view of the bay. Good waterfront location.", 
    "review_date": "2014-05-08"
  }, 
  "fitXjNnwVB_HzqaBSrIGXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor W.", 
    "review_text": "Good spot near embarcadero for drinks and food. It feels upscale and modern but is also casual. Staff is friendly and seating is easy.   I recommend the pork sandwich with pho broth dipping sauce -- a clever take on the french dip. The bread is also excellent here to get on the side. It is served perfectly warm with warmed butter", 
    "review_date": "2014-06-21"
  }, 
  "ZImbLO2ElLmOyBgLefvANw": {
    "user_rating": 1.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Athena P.", 
    "review_text": "Definitely not the place it used to be. Inexperienced hostesses seating others before your reservation. Menu is blah! Because we were never seated we went to Gott's which is a much better choice! Definitely not a representation of the Bay Area like it used to be. What a shame!", 
    "review_date": "2013-10-11"
  }, 
  "bMwiNmSeYfTkzQ_eViDZDg": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Hannah C.", 
    "review_text": "Summary: convenient location across from Pier 23, warm modern interiors and excellent service almost make up for the mediocre food  Walking along the Embarcadero is one of my favorite date activities, and I've passed Fog City many a time. When a friend took me out for a belated birthday lunch, we decided to go here to cross it off my list. We shared the much-regaled Deviled Eggs: the crispy bacon bits were delightful, but it was still just a deviled egg at the end of the day.   I got the burger (had been craving a gourmet burger since NOT ordering it at NOPA a few days earlier) and asked for furikake fries, in place of the regular side. The melty American cheese was a major throwback to Mickey D days and childhood. Although the wood-fired grill in the back is quite impressive, my burger wasn't quite as smokey as I would have liked. I appreciated the generously thick patty, but I wish it had actually been smaller, since it made the lettuce, onion, and tomato toppings feel unproportional. Couldn't finish it all.  My friend got the smoked salmon dish. Although quite pricey (close to $20?) for 2 slices of rye bread with toppings, the smoked salmon was one of the best I've enjoyed. I hate overly salty smoked fish! But this smoked salmon was definitely not too salty, and it had a fresh flavor that almost tasted like sashimi. It was beautifully garnished with microgreens, dill fronds, and creamy avocado and plated against a dark contrast. I probably wouldn't pay that much for that little food myself, but I enjoyed a taste of her selection.  Overall, if I want somewhere to take a break while walking along the Embarcadero again, I might stop by to catch a game at the bar or a quick bite at the cute tables outside. But definitely not a destination meal in the future. Big shout-out to the wait staff who kept our glasses filled but never made us feel bothered or fawned over.", 
    "review_date": "2014-10-13"
  }, 
  "hR38WUHHvXH32mDo21vVpA": {
    "user_rating": 4.0, 
    "user_location": "Fairfax, CA", 
    "user_name": "Jeff S.", 
    "review_text": "We went down to Fog City because my old man knows one of the bartenders there who had previously worked at Picco in Larkspur. I don't generally need an excuse to go to a restaurant, but the promise of great cocktails is as good a reason as any.  We had a couple rounds at the bar since we arrived well before our reservation time. They have a great list of specialty cocktails, including the Goslings-based dark n' slush which was the hit of the group. We had the brussels sprouts and deviled eggs at the bar, and both were excellent. The brussels sprouts were a little bit seared on the outside and mixed with asian pear, which I didn't expect to like but it was awesome. The deviled eggs were sprinkled with crispy quinoa which was new and delightful. I love deviled eggs, and these were some of the best.  At the table, the 6 of us shared a few of the big plates. The chilled dill cucumber pickles were fresh and light, the fries were of course fantastic, and the wood oven whole chicken was very good. Light on the seasoning but cooked to perfection, only Zuni Cafe's chicken can rival Fog City.", 
    "review_date": "2013-11-27"
  }, 
  "xcYoof7zW_uxtNt5WR6d0Q": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "CS W.", 
    "review_text": "A SF landmark and worth a visit. Recent remodel and new menu is delicious with interesting fusion of flavors. Small plate lunch menu - esp. crab cakes were perfectly done and just enough.", 
    "review_date": "2014-07-21"
  }, 
  "iK0CPqlRoogwULySPkr1nw": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Alex G.", 
    "review_text": "While walking down the Embarcadero trying to meet up with another couple around 5pm, my girlfriend and I decided to stop in here for a quick drink and snack.  We were seated immediately and a waiter came for a drink order within minutes.  The decor was very modern and aesthetically pleasing.  Overall a nice vibe.  I must say, the house cocktails were AMAZING!  Innovative ingredients that do not seem at home in a glass come together to create something wondrous.  I would try them all in one sitting if I could.  The beer list had some that I had never heard of before.  One of the servers (who I am assuming is also the head chef from his demeanor) suggested the IPA.  Good suggestion!  I personally hate IPAs with a passion, but I found this one to be surprisingly tasty.  I believe that it was called the Denogginizer.  Even the non-alcoholic cocktails were spectacular.  The service was above average.  Our original waiter took over 10 minutes after the second half of our party sat down to take new drink orders, but the head chef who brought out the food and other drinks was very fast while still being extremely engaging and funny.  While watching him it looked like he brought the food out to every table and chatted with the patrons!  We did not eat much as we were headed down to the Ghirardelli factory, but I wanted a snack and settled on the Kale salad.  It had very soft leaves and fresh fruit, but I was not overly impressed and did not eat very much of the salad.  This had nothing to do with the quality or preparation of the food, but more with my specific cravings at the time.  The chef immediately noticed the unfinished salad and removed it from the table.  Disregarding my insistence that I was not dissatisfied with the salad or the restaurant, the chef removed the salad from the tab.  It was easy to see that he took pride in his work and did not want his customers to have a bad experience.    Overall, I highly recommend coming here for the drinks.  I am planning on stopping by every time that I am in SF.  It is a bit on the expensive side (as is most of the city), but worth every penny.", 
    "review_date": "2014-09-14"
  }, 
  "X9O3zjSjwvckR8Rayo2NqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cecilia D.", 
    "review_text": "I liked Fog City Diner and I like this updated \"Fog City\" The drinks are yummy and the food tasty. I like the remodel , the bar is spacious and has a great view. All the men working there are friendly and HANDSOME", 
    "review_date": "2014-08-21"
  }, 
  "YhgKBemOaY0hNtITK9t7MA": {
    "user_rating": 1.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Adrian S.", 
    "review_text": "Loved the old Fog City Diner.  It was very kid friendly and the kids loved it.   Why couldn't they just let it be?  As a family  walked into the new joint .. looked around... glimpsed a menu and quickly walked out again.  So sad.  Still the kids had fun in the near-bye fountains at Levis Plaza.", 
    "review_date": "2013-10-03"
  }, 
  "1MdLAfawu8HxT_dCahpMyg": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Tiara Q.", 
    "review_text": "We tried almost all the apps &amp; desserts: dungeoness crab special, Mac n cheese, cheeseburger, fries, Brussel sprouts, beets, bread pudding, doughnuts. Two items stood out as fantastic - specifically the crab and Brussel sprouts. Best I've ever had on both. The crab was served cleaned and halved, oven baked with chili butter. It was fresh (we were told it was alive 3 hours prior) and immaculately prepared. One order per 2 people for $30 - well worth it. Whatever the Brussels were prepared in was so flavorful and they were charred well. There was some kind of pear or Apple chunks mixed in which were unnecessary.  The Mac n cheese was great. The fries were meh as were the doughnuts. The beets were good but the goat cheese water that they sat in wasn't the best.  The service was decent but we had to ask several times for dishes to be cleared.  I had the Vodka fix which was delicious but tiny. The wines came with a healthy pour. I would eat here again and try other items.", 
    "review_date": "2014-12-03"
  }, 
  "PE7dvRNZGvbOQyVXCukQYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elise P.", 
    "review_text": "I LOVE this place! I first came here for dinner a month ago and was blown away. Had their Milk Punch drink and it was lemony and so good! The deviled eggs with sprinkles of bacon were a dream come true! The Veggies, especially the brussel sprouts, were just amazing. No one does veggies like these guys. The Chicken was truly mind-blowing. You must order the whole chicken!!! There was special salt you sprinkle on top that comes with it that I went crazy for. The frozen coffee granita with vanilla ice cream was a dream come true. Loved it so much I went back a 2nd time. A top new favorite.", 
    "review_date": "2014-04-05"
  }, 
  "ZlJtLWqVeQ5sTfIUr7FwIw": {
    "user_rating": 2.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Tom B.", 
    "review_text": "Food was quite good. Service was off for our table. Wine served with Ice in the glass.  Really? Scotch served instead of Bourbon. Not a kid friendly restaurant. We asked if they had a kids menu and they blurted out NO.  Can you make some pasta with butter?  NO. Restaurant remodel looks great, Now work on service and menu please. Please use the $500 dollars we dropped for dinner for 8 to improve the service.", 
    "review_date": "2014-05-18"
  }, 
  "0JfJYZT6vPKsXi5NaQSCeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew B.", 
    "review_text": "Was down at a reception @ Tcho (5 star choco) last night with GF and some foodies...all agreed: top notch food, service and the new decor is super.  Will be back soon for sure.", 
    "review_date": "2014-01-20"
  }, 
  "DNAxM8v3BaJuSOx6X2vibQ": {
    "user_rating": 3.0, 
    "user_location": "American Canyon, CA", 
    "user_name": "Virginia V.", 
    "review_text": "Food was ok....for the price umm not so much. Maybe Im spoiled because I live in the Napa Valley but I come to the City quite often and always find great food but was highly dissatisfied with my order.  Clams were good but they were nothing to rant and rave about...fries okay...oh the bread was good...Brussel sprouts yummy but needed something...oh yea oysters were the bomb, but you'd be an idiot to screw those up. My BF enjoyed the clams though if that helps.", 
    "review_date": "2014-10-17"
  }, 
  "thtQHcBilE8wwVQFbLp40w": {
    "user_rating": 3.0, 
    "user_location": "Arcadia, CA", 
    "user_name": "Patrick M.", 
    "review_text": "Great atmosphere Great people.  Food was VERY good but not great.  I WOULD go back because the place is cool,,,,  I might not plan a full dinner here.", 
    "review_date": "2014-05-01"
  }, 
  "IUBTHEaCm-1xcv1lT99eWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve B.", 
    "review_text": "I went on a double-date here on Friday, October 28 and had a wonderful experience. I had never actually been to the old Fog City Diner before so had nothing stuck in my mind to compare it to. It seems that a lot of the other reviewers are hung up on the old Fog City Diner and having a hard time accepting that it's a completely new restaurant which is a shame for them.  They layout of the restaurant is very open so even though it was a very busy Friday night with a packed bar as well it never felt crowded. They have comfortable booths and an open kitchen with a big wood-fire oven and the overall aesthetic of the restaurant is modern but warm. The one thing I didn't get about the decor was the weird spaceman by the bathroom, that seemed out of place to me but not a big deal.   The most important part of our experience was the delicious food and cocktails. We were pretty hungry on Friday evening and definitely made sure we got a solid sampling of their unique menu. Highlights that I recommend you don't miss out on on the food side for me were the deviled eggs, the pork cheeks plate and the clams dish.  We also went a little crazy on the desserts which might have been the best part of the meal. The home-cooked crullers, frozen custard, and Panna Cotta were all so delicious and the perfect exclamation mark on a well-rounded delicious meal.  One final thought, make sure you try the Fog City Milk Punch cocktail. I had no idea what to expect based on all of the ingredients (bourbon, rum, brandy, citrus, milk, etc..) but it a delicious sweet drink that also packed a good punch. Overall, the new Fog City hits it out of the park in all aspects and I can't wait to go back!", 
    "review_date": "2013-10-28"
  }, 
  "y3pgJ3fImo4F1pB_im_ncw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jimmy C.", 
    "review_text": "This place is a venture back to the not too distant SF past. Pre tech boom, pre dot-com bust/boom, back in the days when a policeman would grab a ruffian with a crookedly knotted skinny necktie and gutterly threaten, \"go back south of Market.\" Despite its remodel and appearance of a modern restaurant, its clientele has a definite old school SF vibe to it; this is good people watching when you get tired of looking at recent SF residents.  Like: Furikake fries. Don't you take my crumbs! Roasted baby carrots, cauliflower nuggets, and grilled asparagus; they do veggies well.  Dessert, frozen custard on cruller with a side of caramelly marshmallowy sauce.   Dislike: My entree was a rib dish that was taken off the menu a few days later. Edible, but overcooked and forgettable. I'm glad Fog City decided to forget it as well.  Hit or miss: Ahi tartare. The ahi was fresh and flavorful, but the rice cake was in-between chewy and crispy.  Go because you or your guests are conservative and a little old school, but still want to try a modern menu without going full do-you-know-who-harvested-this-oyster-locavore. Go because you want to see local newscasters on break. Go because it's not difficult to get a seat and it's a comfortable spot to enjoy the company of friends. If I could give 1/2 stars (Yelp, please!), it would be 3.5 stars.", 
    "review_date": "2014-04-30"
  }, 
  "lCSTCU07HcyHpGKbnQGUIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Holly M.", 
    "review_text": "Here's a couple of personal opinions of dishes I've tried at Fog City.  Grilled Local Calamari - Good. Nothing really wow-d me compared to other places Deviled Eggs- Great touch with the bacon. Bacon makes everything 10x better! Brussels Sprouts- YUM, I'm never usually a fan but this is delicious. Handcut Furikake Fries- My must get starter every time I dine. YUMMY  Smoked Salmon Sandwich- I ended up just picking the salmon off and leaving the greens and bread. OK Saigon Dip Sandwich-Sounds good on the menu, but just mediocre Fog City Burger and Fries- Good, your average burger Sesame Chicken Salad- Overall my favorite! Very flavorful and I'm not a big salad person. YUMMY. There was tons of flavor in every bite.  Will definitely dine there again soon.", 
    "review_date": "2014-10-06"
  }, 
  "grQfs3DN2CHgzphRXssgCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Antonio I.", 
    "review_text": "Great revamped menu and cocktail list. Menu was a bit too small for me for brunch/lunch but it tasted great, trendy and more importantly worth every penny.", 
    "review_date": "2014-02-20"
  }, 
  "LgpqJITXdSAfGq88R4YeKQ": {
    "user_rating": 4.0, 
    "user_location": "Agoura Hills, CA", 
    "user_name": "Greg W.", 
    "review_text": "WOW This place had some yummy food.  However the prices are high and the portions can get small depending on the dish.  Many are shareable/topas type items but they do have some good entree items.  The staff is nice and helpful. They can get packed so be aware at peak times.  Its a good location but you have to come around from the back side.", 
    "review_date": "2014-07-24"
  }, 
  "vbXmCVj1RZ4civT7nrcKyw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erik H.", 
    "review_text": "Returned recently as I had been telling a friend about the best Bourbon signature cocktail in the City, The Milk Punch.  It did not disappoint and my guest who fancies themselves as a bourbon expert was impressed with my choice.  We opened with the fries, cauliflower, and oysters.  For two people it was quite a bit but we will have to come back with more people and try the rest of the appetizer menu.    For entrees we went with the pork chop and octopus.  We barely ate half of each.  The octopus was probably the best I've had.  It wasn't tough and it was prepared over a bean based bed that quite tasty.  I had the other signature drink, The Mule, which was also quite tasty and came in a copper cup which kept it clean and cold tasting!  We cleared our palates with a frozen Affogato.  Definitely a great follow up to my first visit with lots of parking around.  We walked off our meal with a nice walk along the Embarcadero.", 
    "review_date": "2014-05-27"
  }, 
  "0hR3xOT9RezseuDj-VZ0aA": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "K C.", 
    "review_text": "Royal New Years Day DISAPPOINTMENT!  Sadly right from the walk in a totoal bummer.   We arrived at 5 looking to sit 7 and they said \"sure\" but they don't open until 5:30 (fine we'll wait)...oh no, sorry we have a reservation coming in at 7:15.   \"if you could eat and be out of here we'll seat you\"...hummm, ya that's how a reservation works people.   If you can feed us in an hour &amp; half we'll be out.  We ordered cocktails (the gal at the bar...SO RUDE, REALLY SWEET HEART? YOUR NOT AT SUR...TAKE A BREAK AND MANAGE MY MANHATTAN IN UNDER 15 MINUTES..NEVER ONCE ASKED IF WE WANTED ANOTHER, JOKE.)  and the children has sodas, sitting at a side table.   The man at the desk was HOUNDING THE KIDS to move because they had a 5:30 reservation coming...we told him they will move at 5:30 as we are sitting at that time too.   At 5:01 the front desk man to leave, they needed the table.   THE ENTIRE RESTAURANT WAS EMPTY!   We asked the kids to stand by the door until our we sat down...2 minutes later.   Mind you...that table didn't have a soul sitting there for 20 minutes.  THEY NEED TO CHILL.  The dinner menu was a train wreck...plates to share \"WHAT DOES THAT MEAN\". I believe when something is to \"Share\" it's large enough for 2-3 guests.   Not even close...it was a 20 minutes dissertation from the waitress about what is big enough for 2+ and what was really for one, HUH?,   Clearly, our table was ordering traditional: salads, burgers for the kids with fries, carrots.     The adults were battling over how much was enough for 4 people...MAJOR HEADACHE.    Turned out that the burger is a standard flat burger, no possible way it would feed more than one (cutting it into four doesn't make it feed more.  Make a huge burger and that would make sense)...no sides on any entree.     Then to cap it off, there was a a first wave of food then 30 minutes later another wave of food and then the final wave because the portions were just random.   All the portions were for one...other than the chicken.  The food was good and although it was way more work than it was worth it tasted very good.  I have to say the staff (NOT THE BAR STAFF...BUGGERS) was friendly and very nice, however, it really seemed disorganized and unprofessional.   SIDE NOTE: BRUSSEL SPROUTS...AMAZING!", 
    "review_date": "2014-01-02"
  }, 
  "Q0_r1PdCIXwopvdppGAoJA": {
    "user_rating": 5.0, 
    "user_location": "Elizabethtown, NC", 
    "user_name": "Darlene S.", 
    "review_text": "On January 06, 2015, we were in a party of five who had spent the day site seeing and having a great time. We ended the evening late at Frog City, San Francisco, CA. Everything was just great.   The atmosphere was so relaxed and so beautiful. There were a lot of people there and they all seemed to be enjoying the evening too.   The waiter was so nice, thoughtful and was very eager to please us. We thoroughly enjoyed our meal and I have to say we all were very impressed. Three of us had a hamburger and I have to say it was the best I have ever had!   Hopefully, we will be able to return there again when we are visiting in the area.", 
    "review_date": "2015-01-25"
  }, 
  "lBgPXxUwdzUz7YJkykeccA": {
    "user_rating": 2.0, 
    "user_location": "Walnut, CA", 
    "user_name": "Wayne K.", 
    "review_text": "Fog city memo:  Very impressive location and decoration.  But in the end it is a failure in quality and price.   Service is very professional but it is a disappointment because of the food.   I order the crispy cheddar biscuit bites. Very dry and to me seems like it is a day old.   The ribeye. Ah. Good beef should not need a strong sauce. So either the beef is of low quality or not well seasoned.  But in the end the sauce on the rib eye is very very salty.  If you eat the rib eye without the sauce it is much better and tastes fine.    Finally the dessert.  The B bomb. Was recommend by server which like said professional and also polite. The donut cruller was crispy and fluffy.  The custer ice cream creamy and sweet.  The caramel sauce perfect.    However in the end Im just disappointed my meal was still over $80 for 3 courses and I am a single diner.  Base on the customers all tourists with no insight.   They spend a great deal of money on the decor but should spend more time on the food.", 
    "review_date": "2014-05-14"
  }, 
  "cml12ZWtr4m8YejBjPE70A": {
    "user_rating": 3.0, 
    "user_location": "Virginia Beach, VA", 
    "user_name": "Noel B.", 
    "review_text": "Service was good and food was just OK. All the fun, cool vibe of the old Fog City Diner is gone though.", 
    "review_date": "2013-11-17"
  }, 
  "DKqE9GDvkji_0MOT6_NjJw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anon A.", 
    "review_text": "Too expensive   Super long wait.  Mediocre food.  Akward staff and bridge and tunnel clientele.  Cramped seating.  Not a super duper place.", 
    "review_date": "2014-03-30"
  }, 
  "eGs6GlsMG9hTRVnYyEk16Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica F.", 
    "review_text": "I work in the awkward space of Telegraph Hill, and new food options are hard to come by. Fog City is a place I've been meaning to try for a while, so I made a reservation for a work lunch. The food here is not bad and probably worthy of 4 stars, but the service and steep prices knock off one star for me.  The ambience is very trendy, with almost exclusively dim, natural lighting and dark wood textures. The water cups are encircled with \"Fog City\" around the base. It is quite loud in here for a more upscale restaurant, so maybe not the best place for a professional lunch.  I got the Smoked Salmon Smorrebrod ($17), which I still don't know how to pronounce. It's an open-face sandwich of smoked salmon, egg salad, avocado, peppers, and a generous garnish of herbs on top. Again, I do think the food here is quite tasty, and I really loved the sharp, spicy kick of the peppers. The ingredients are fresh and beautifully arranged. Both of our sandwiches came on casually-uniquely-shaped wooden slabs, because porcelain plates are for the mainstream.  The service here is quite slow and inattentive, except for the kind people refilling the water. I had to ask for the waiter multiple times to take our order and deal with the check. We were able to finish our meal in under an hour, so it wasn't entirely awful, but I did feel a bit hysterical constantly trying to flag someone down. It was pretty busy for lunch, so I would recommend making a reservation!", 
    "review_date": "2014-11-03"
  }, 
  "JhvfYiqOhQ52RUmlBrMe6A": {
    "user_rating": 5.0, 
    "user_location": "Coronado, CA", 
    "user_name": "Sheila K.", 
    "review_text": "Have to admit, avoided this place in the past; thought it was a tourist trap. The food is amazing (if you need proof, read my recent reviews of other places---I can be a tough critic). Loved our waiter, Tobias, and loved the tapas style!! Can't say enough about the quality of the food--EVERYTHING we tried was delicious! The vegan and the carnivore were satisfied! An impressive, albeit small, wine list---and up to date! Can't wait to become a regular! Top 5 in SF (from a serious foodie)!", 
    "review_date": "2013-12-28"
  }, 
  "Wgs8ozAIgULSaiGNQmCkzg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "meghan s.", 
    "review_text": "My gf's and I weren't sure what to expect but were pleasantly surprised. The wait staff was extremely attentive and made wonderful suggestions. The deviled eggs, fig salad, pole beans, chicken and apple crisp were all delicious. The menu doesn't dazzle when figuring out what to order. Its basically an American menu but the food had a pow to it when it was placed in front of us. I was really impressed how they jazzed up all American favorites.", 
    "review_date": "2013-10-03"
  }, 
  "Kr9sA9gKISX5i8WN4_nXcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "George M.", 
    "review_text": "It's totally different than what it used to be, but it's really nice and has a good vibe. Had their fog city burger and it was pretty tasty and we ordered a couple desserts and they were really good. They made really good moscow mules...and word is that their bar tenders are really good...Great location too!!", 
    "review_date": "2014-07-19"
  }, 
  "tcXbDFbFKrEA3Bks_zAm0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Piper W.", 
    "review_text": "I really liked this place. I like the cool fun vibe inside with the row of seats along a curved big window to the Embarcadero and a bar down the middle. Service was friendly and on par. I liked ordering several small courses with option to have a bigger meal if you wanted. We Tried the deviled eggs with crunchy quinoa and crispy bacon and those flavors and textures worked well- YUM! The Oysters were the best we've had in long while. Highly recommend! The made to order Doughnuts were pretty good. I got the chocolate ones and the chocolate was very good- none of that fake milk chocolate stuff. Oh and you can't go wrong with the frozen custard!", 
    "review_date": "2014-07-09"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Clear as day.  Food is delicious: Open-faced smoked salmon and egg salad sandwich with avocado and herbs. Brussels sprouts with pear cubes and ponzu coating. Loved both.  Prices are high: $16 for the sandwich was excessive. $7 for the sprouts reasonable. This was a business lunch happy to not be paying for.  Service was opportunistic: Didn't feel entirely welcomed and almost a burden when still deciding. Too bad as the iconic waterfront and open fire space was otherwise endearing.  It's a super clear three stars.", 
    "review_date": "2014-02-15"
  }, 
  "KkBCkxguivHRIjT1h55x2w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris H.", 
    "review_text": "$17 Chicken Noodle Soup.  Seriously it is a tourist trap sad the old place went away.", 
    "review_date": "2014-02-18"
  }, 
  "QlZRh-SbAf1Onj_tgBlmYg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexa N.", 
    "review_text": "Beautiful meal. We had the ribs and the whole chicken. The chicken was maybe the best chicken I've ever had in my life. Deboned. Moist and flavorful. Came with a side of lemon and spices to season it further.   I went back a week late to have the chicken again.  The remodel makes it much more modern while still being a SF classic. :)", 
    "review_date": "2014-08-17"
  }, 
  "tFAtaH_vfcGn447uVZdTDw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Cynthia C.", 
    "review_text": "Great burger here and love the wood fired oven! Unfortunately we happen to be here on Sunday afternoon so no wood fired Chicken. Have to go back! Our server was the best. Skip the wings, not worth $13. Didn't read the menu and thought the wings would be \"interesting\". Not so. For lunch can't go wrong with the burger and fries. Next time trying the hot brown:) nice decor too", 
    "review_date": "2013-12-15"
  }, 
  "GcYfUzBRH6RIDEyZjDWMhg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rin c.", 
    "review_text": "The new fog city is absolutely fantastic!  The only complaint i have is they measure their damn pours....seriously, if you charge me $17 for a drink-FREE POUR that shit.  Otherwise, the food is fantastic, we had the cauliflower nuggets, tuna, deviled eggs, the rib eye, and chicken and everything was delicious.  The chicken is probably the best ive ever had!!!   5 stars for cuisine and service 3 stars for overpriced and under poured drinks.", 
    "review_date": "2014-07-01"
  }, 
  "PB_ZE9viuWvFS6JJ-tcLSQ": {
    "user_rating": 5.0, 
    "user_location": "Neenah, WI", 
    "user_name": "Ryan S.", 
    "review_text": "Great experience!  The waiter was fantastic, the food all unique and flavorful.   Definitely recommend it.", 
    "review_date": "2014-11-06"
  }, 
  "RTbTGW5QVsYVRWrPFWe7KA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Aaron C.", 
    "review_text": "Saigon dip was phenomenal, very cool sandwich.", 
    "review_date": "2014-04-22"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "You had me at cheeseburger, Fog City. You had me at cheeseburger.  It's not often that I encounter a patty with homemade American cheese. It's just the right amount of melty on top of a thin yet flavorful piece of meat. A simple bun brings it all together. Give or take the pickles, they're good, I just like my burger with cheese.  There are plenty of other items on the menu to consider in case you're not into cheeseburgers. Deviled eggs, seasonal salad, fresh oysters. You've heard the term American (New), yes? Not to mention milk punch and a list of classic cocktails that well executed.  Did I mention that they serve custard? Really, really good custard. That's coming from a St. Louis gal, too. It's no Ted Drewes, but I don't think Fog City is trying to make concretes here. It's just rich delicious custard.  What's old is new in San Francisco, and Fog City is the perfect example of a classic diner that's taken their operation to the new level. I love it!  ***Note: I was invited to a special lunch with complimentary bites, but returned on my own a few weeks later for dinner. Yes, I liked it that much!***", 
    "review_date": "2014-07-31"
  }, 
  "e6OwRdPgmjx3R-HCgAN1-w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alfredo A.", 
    "review_text": "Used to go here when it was the old charming little diner.  Tried to go here before a show at the America's Cup Pavilion last Saturday.  Was turned away at the door.  Exchange was as follows:  Bouncer:  You guys have a reservation? Me:  No, we just want to grab a drink at the bar. Bouncer:  Bar is all full. Me:  It looks like there's plenty of standing room. Bouncer:  We don't do that here. Me:  Do what? Allow people to stand at a bar?  Bouncer:  Yeah.  Errr, WTF.  Okay.  So this bar operates entirely different than EVERY OTHER BAR IN THE WORLD.  Awesome.  Took my business to the Waiheke Island Yacht Club where we were graciously greeted and provided drinks at the bar that was STANDING ROOM ONLY at the time.  Way to make a (second) first impression Fog City.", 
    "review_date": "2013-10-15"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "We went for brunch with some friends in from out of town. This is a great spot for a classy last minute Sunday brunch when all the super cool spots are already booked or don't take reservations (I'm talking to you Foreign Cinema and Plow)  It is definitely pricy - one of my friends got the $17 chicken soup - CHICKEN SOUP for SEVENTEEN DOLLARS - WTF?!  He said it was good, but I dunno how good it could possibly have been.  I ordered the Hot brown sandwich, I have never had one, but have seen it in many travel shows about Kentucky and they are supposed to be fantastic. This was indeed a damn fine sammy, the bacon was super smokey and the sauce was like crack sauce.  Order it and thank me later.   We ordered  doughnuts as a starter (2 doughnuts to an order) and they were good, but I gotta say if I order doughnuts in a restaurant, they better come out piping hot (at the very least warm) out of the fryer - these were good, but room temp, so you can skip it, as tempting as they sound.    The views would have been amazing if there wasn't construction netting blocking the bay views.", 
    "review_date": "2014-02-09"
  }, 
  "dWe4qfWT_urGY8spxucAUg": {
    "user_rating": 3.0, 
    "user_location": "CORONA DL MAR, CA", 
    "user_name": "Adriana P.", 
    "review_text": "I was staying nearby and me, myself and I stopped by for lunch...decided to have it at the bar.  The bartender was very courteous and nice.  I ordered the Asian chicken salad and it was so bad, that I had to return it...and I have never done that...it was drenched on a bitter dressing and the chicken had been cut up with fat, bones and tendons so when I munched on these one too many times, I had to stop and send it back.  The good news is that the nice bartender immediately addressed the situation and took it back without a problem.  The manager promptly stopped by to check on me and the situation, which I appreciated.  I traded the salad for some deviled eggs and a couple of slices of their scrumptious bread ($3.00!) and that was a decent experience.  My take is that this place is pretty $$$ for the quality, although the place is pretty cool with a good location.", 
    "review_date": "2014-06-24"
  }, 
  "G-8BH0Zxu7zQebp3_3QqTA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Reed P.", 
    "review_text": "Not impressed. The only people daft enough to come here thinking they'll have a great experience are tourists. The food is overpriced and not very good and the drinks were anything but artisan. Even at lower prices I couldn't justify coming here given the taste of the food and the subpar drinks.  On top of all of this I came back later and sat outside to use my laptop real fast and they came out and told me outdoor seating was for customers only. There were 10 separate tables three of which were being sat in and they are telling me I should move because it's for clients only???  It's one thing to boot me out because they actually need the table, it's another to tell me to bug off because I didn't order a $15 sandwich.  Will not return and will recommend against.", 
    "review_date": "2014-02-27"
  }, 
  "NDW7SjtgMTzwuZSWpq7i7g": {
    "user_rating": 4.0, 
    "user_location": "Little Elm, TX", 
    "user_name": "Asma B.", 
    "review_text": "Good food, great service. We happened upon this place as we walked to our car. We were surprised by the price (we went in for lunch) but definitely a good place for dinner!", 
    "review_date": "2014-12-26"
  }, 
  "y_4Dq1MCwbsTOEgbaoMQXA": {
    "user_rating": 3.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Sherri C.", 
    "review_text": "I came to Fog City a couple of years ago, because the place looked cute, so we decided to try it for dinner... And the hanger steak here was amazing! The meat was so tender and juicy... perfectly flavored. The Clam chowder was OK, nothing special. All I keep remembering from this place is the hanger steak. Recently, I returned to Fog City in hopes of eating another hanger steak, but they took it off the menu... Why!?!? And the food this last time around was really mediocre and unmemorable... Therefore they get 3 stars overall.", 
    "review_date": "2014-02-28"
  }, 
  "1qkGK9cDxuoD_Og_68WI-A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ron S.", 
    "review_text": "I write this review as a professional in the food industry. This was one of the worst dining experiences in San Francisco I have ever had! First the noise was unbelievable even after being placed in one of their more quieter sections.  It took us a half hour to get someones attention and over half hour until we ate:  the five of us got our meals five to 10 minutes apart,  The bread served was so tough that we laughed while we tugged on it because it was not cut through. Three of the dishes were way over salted and one was totally unedible. Staff was also unprofessional in ways.", 
    "review_date": "2014-05-29"
  }, 
  "Dc1bruuyBZaHSthOaEM6PA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James T.", 
    "review_text": "Having been a regular saturday diner at the former restaurant, I was excited to try the newly re-opened restaurant.   Liked the new layout and decor (though honestly the restaurant could be any new SF place now, its lost its special charm).   Sat at the bar and was addressed by the hipster bartender as \"Cheif, Dude and Buddy\", had a burger for $14 (it came with a plate) and then realized i'd have to order a side (fries) for $6, so I had a $20 burger (it was good), a cocktail and so-so service.   Would I go back or again be the regular I used to be, well...no.  I would go back if I was in the mood but now Fog City is the same as every other precious new restaurant in SF...sadly", 
    "review_date": "2013-11-14"
  }, 
  "H4HPzkK0pCJ3vQqZccPrag": {
    "user_rating": 4.0, 
    "user_location": "Napa, CA", 
    "user_name": "Anne C.", 
    "review_text": "I went to the new and improved Fog City Saturday night and had a great time! They were busy and service subsequently was less attentive, but that's ok in my book.   We had the deviled eggs and the fries to start out with, so yummy! We shared the lobster. Ummm I think it was still moving when it came out? Antenae and everything left intact, but it was good!   The Milk Punch and the Monkey Fighter were amazing drinks. Definitely a must try!", 
    "review_date": "2014-02-16"
  }, 
  "9X_NhC9TKsPj1Yi41jRYAA": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "L D.", 
    "review_text": "This has to be one of my top 3 spots.  Best Brussle Srouts EVER.  I am not joking.  This is 90% of the reason I go out of my way to come here.  The other 10% is the ambiance and decor.  Simple, clean and comfortable yet slightly upscale.  This is a comfortable spot to bring out of town guests since it is not over crowded or funky.", 
    "review_date": "2014-06-05"
  }, 
  "OqDL7gioC9qLuY66HdtHJw": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Christin V.", 
    "review_text": "This was a fantastic experience!  Based on a recommendation we stopped here for the Grilled Spiced Lamb Skewers - which were phenomenal!  Also the Pickled Gulf Shrimp is almost as good.  We had fantastic service at the bar - due to Dustin (who l also learned is in charge of the awesome menu)  despite his lack of help behind the bar that night.  I was thoroughly impressed with the professionalism and food quality and will make sure to come back whenever I am in SF!", 
    "review_date": "2013-11-11"
  }, 
  "53glsY-cD-PrDdNmkJQSXA": {
    "user_rating": 3.0, 
    "user_location": "Napa, CA", 
    "user_name": "Tom M.", 
    "review_text": "I don't really remember much about this place before the re-design, it has been years, so I'm not going to compare it to what it use to be.  Came in for an early dinner, almost empty, we were greeted and sat immediately.  Overall I will say the service was very good.  Our waitress was nice, but she kept over compensating for everything and tried to tell us how to eat the dishes, which is usually pretty self-explanatory.  Order: Fried Artichokes Brocollini w/ Garlic Lamb Kebabs (2) People  The fried artichokes were presented nicely and very tasty with the aioli dipping sauce.  Nice seasoning and plenty of \"flesh\" to eat.  The whole thing wasn't edible but most was crispy enough to eat.  The Brocollini was delicious and actually was my favorite part.  The Lamb Kebabs were under-whelming and there really wasn't any care in presentation.  it reminds me of when I make tacos at home and just slice up a tomato, some onions and cilantro and have it all out to put together.  It was just a place with two kebabs and sliced onion and tomatoes, to me if you are going to charge $19-$22 or whatever it was, there should be something to it.  The dish was served with lettuce leaves and we were then told how to put everything in it and eat it.....  anyway.  Also, one of my biggest pet peeves was the time between the vegetable coming out and the entre, about 10-15 minutes.  I want to eat my veggie with my protein, not as a separate course.  Overall it was a nice night out, but honestly, I just don't see the value.  I am use to over-priced Napa, but at least with Napa the menu items are fairly unique, so if I'm dropping $12 on an app, $8 on a veggie and $20+ on an entre it's usually worth the money.  I won't go out of my way to go back, but I'm sure there are some items they do very well, some of the other stuff coming out looked tasty.", 
    "review_date": "2014-05-07"
  }, 
  "xsq_bpGYLoPpuzUTDbifDw": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Shane L.", 
    "review_text": "Not bad.  Had the calamari and a burger.  The former was pretty good while the latter was so-so.  The servers were nice and fairly prompt, although not quite as attentive as we would have liked, considering it was sparsely populated for most of our meal.", 
    "review_date": "2014-12-29"
  }, 
  "XQ-kvSPLSBPiivNpt9GyuQ": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Chaz C.", 
    "review_text": "Our party of four initially tried to get into Hillstone just down the street on a busy Saturday night but the wait was over an hour and a half.  We all joked that was the best thing to happen to us because Fog City was the only thing we could talk about for the next week. It was THAT good!  Friends asked what kind of place it was... I guess one would describe it as a contemporary upscale diner?  The place is super cute, equipped with a wood-fired over and large grill that serve as the centerpieces.  For starters we went with Hand-cut Furikake Fries with Garlic Aioli. The white sauce for dipping was heaven (not sure on name).  We also ordered four Chilled Local Oysters served with a barrel-aged hot sauce, shallots, mignonette and parsley. They were so good we ordered another round of 4. One of our guests said he'd just eat these all night. (see pic)  The Brussels Sprouts with Asian Pears (we originally ordered Broccoli, but they ended up bringing out these). The brussel sprouts were a nice surprise. Although we had these at Delfina the night before, the pears sent these over the top.  The Oven Roasted Baby Carrots was the other veggies we ordered. They were a touch on the sweet side and were served with a black garlic mole, almonds, and cotija cheese. The garlic mole sauce was super unique and a fresh approach.  The Fog City Burger was kind of lost in the shuffle with all of the food we got. House-made Bun, smoked tomato aioli, F.C. american cheese, tomato, onion bread &amp; butter pickles. One of us ordered it as well done but it came out medium rare. I was happy with that though. hehe Extremely tasty!  Their signature Wood Oven Chicken was absolutely beautiful. Accompanied by charred brentwood corn, crispy potatoes and spiced maldon salt, the chicken could easily serve two people. Soooooooo good! (see pic)  Saving the best for last was the Berkshire Pork Cheeks served on a bed of bacon braised romano beans, hatch chilies, broccoli, and soft polenta. That pork cheeks was some of the best pork I've ever had in my entire life - It was so succulent that you didn't even need a fork to separate it. Each bite deserved a fork-full of each component on the dish, not just the meat. The polenta and the red sauce (name?) was the clincher. Whenever I head back up to San Francisco, it's this dish that I'll be craving!  The only letdown of the evening was the Grilled Beef Tongue with Chanterelle mushrooms, roasted turnips, mustard greens, and bacon vinaigrette. It was best described as a salad with a few bits of beef tongue. Everyone at the table tried it, but no one went back to it.  You know you loved your meal when you can't stop talking about it... Fog city - we'll be back!", 
    "review_date": "2013-12-19"
  }, 
  "hWmOlKKyLWHVsYxVoRAgHg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marj P.", 
    "review_text": "Our waiter was excellent, along with crab cakes, and grilled calamari with deep fried zuchini blossoms and red pepper.  These three alone deserves 4 stars.  However, i'm knocking down a star because of the smaller than small oysters and the cocktail wasn't strong enough for my taste. We were there normal happy hour time, but I don't think they even offer happy hour specials.  Imagine my sticker shock when we got the bill.", 
    "review_date": "2014-07-06"
  }, 
  "REWjbYaUkmGw04lNZraeQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Austin W.", 
    "review_text": "I came here for lunch with a few coworkers and had one of the best fried chicken sandwich of my life. My understanding is that the menu is always changing so if the friend chicken sandwich is on the menu, don't hesitate and just order it. The chicken is tender, juicy, well-seasoned, and fried perfectly, not oily at all. The coleslaw that topped the sandwich is super refreshing and is a great contrast to the fried chicken. End to end, service was excellent. We were seated quickly, and also got our menus, drinks, entrees, and check quickly as well. I would definitely come back for a fancy-ish lunch if I'm in the area. If you can, try to sit at the bar so you can see the kitchen in action - they put on quite a show.", 
    "review_date": "2014-10-22"
  }, 
  "kZe2CUs-9OeIViFa6QC0wA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessie L.", 
    "review_text": "I just had one of the best roast chickens I've ever had! We ordered that to share between two people, along with grilled broccoli rabe, bread, an IPA, and a glass of rose. Everything was fantastic. Given how hot it was tonight, we sat at one of the outdoor tables and got to enjoy eating al fresca under the trees. It was a perfect meal with good service, amazing food, great company, and hot weather to boot!", 
    "review_date": "2014-05-13"
  }, 
  "XOjhAsXxs-ChFLecUdyPNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert G.", 
    "review_text": "Fog City has the one of the best burgers in town.  It is on the expensive side however.  Always good service.", 
    "review_date": "2014-10-15"
  }, 
  "9Mc3mZX_Q8c6H_KjH8DZOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aubrey O.", 
    "review_text": "This place is a solid 4.5 stars but with the new renovation, it's a must for locals and tourists.   We ordered the deviled eggs, oysters, furikake fries (!), and jalepeno cocktails. I would order all of it again. Seriously considering it right now as it isn't THAT far from my desk.  Sit at the bar (on the side with a view of the bay), order yourself a cocktail, extra sauce for your furikake fries, and ignore the tourists' kids.", 
    "review_date": "2014-05-13"
  }, 
  "TQ-wfwEOs8yzer9t4wlKlg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serdar Y.", 
    "review_text": "Nice for out-of-towners and locals with views of the bay. I wish the  menu items did not remain the same for long periods of time.  The open fire dishes are certainly worth the try.  Friendly service and warm ambiance.", 
    "review_date": "2014-03-28"
  }, 
  "XdM2sxztF7JX6DZ6Qk4r9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gary C.", 
    "review_text": "I recall the old Fog City Diner fondly. Big-pour martinis and comfort food. Some days called for exactly that. So, I met a buddy here to see what they've done with the place...and the menu.  The first thing I noticed was the space. It seems a lot more open, spacious. We got our booth and checked out the menu. The list of six snacks at the top of the page looked great so we ordered all of them:  Chilled Dill Cucumber Pickles F.C. Ranch Cauliflower Nuggets Vadouvan Curry Serrano Chile Lime Deviled Eggs Crispy Quinoa Bacon Hand-cut Furikake Fries Garlic Aioli  Duchilly Hazelnuts Spanish Paprika Brussels Sprouts Asian Pears Ponzu.  Each of them was terrific...especially with a martini in my left hand. There was no way we were going to finish all of this so we did some damage and ordered a couple of dishes: Grilled Spiced Lamb Skewers with Tomato, Red Onion, Lemon, Vadouvan Yogurt, and Butter Lettuce Cups, Wood Oven Whole Chicken with Charred Brentwood Corn, Crispy Potatoes, and Spiced Maldon Salt.  Both of these were really good as well. The chicken was superb...only one step below the Zuni chicken perhaps.  The service was fine. Ambiance fine. Food very good. All in all a great return for a SF institution. Highly recommended...and fun.", 
    "review_date": "2013-12-15"
  }, 
  "FTfr7IJurqo_Ika3NoZ-Kw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aren A.", 
    "review_text": "After the whole Yelp thingamajig, I found myself situated here again with my good friends Jim and Isabella. All I can say is that the second time around was definitely a homerun/touchdown/goal/flyingelbowdrop/whathaveyou­.  One of the finest meals I've had in a long time. Every plate was prepared incredibly well. Favorites had to be the whole, de-boned chicken and the Brussels sprouts.   I mean, the Yelp event had great food, but I really wasn't expecting this level of execution. I really do hope that my subsequent visits will be just as memorable, but as for now, Fog City is a nickel in my book.", 
    "review_date": "2014-11-17"
  }, 
  "GeqXRhY8XBLEDU15Tm1LNg": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Brian S.", 
    "review_text": "One of the best burgers I've ever had.  Also had the lamb skewers.  Pretty good but I will have to get the burger again.  Solid how you can make it a double.", 
    "review_date": "2014-08-04"
  }, 
  "x_bpi_SRk-UNQ6-gfNJqnA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sangita A.", 
    "review_text": "Best Chicken in the city! Cocktails refreshing too, everything else is OK.  Came here with Pia C. and Trisha M. as she was in town and we needed major catch up.  Food: +Milk Punch- refreshing cocktail that tastes nothing like milk -Warm Country Style bread- large portion but not that exciting, or warm + Brussel Spouts- large bowl of well-seasoned brussel sprouts; order again +Eggplant Babagounus- over ordered here but this was as standard, non-stand-out appetizer -Ahi Tuna Tartar- too salty!!! i like the bite-sized servings though +Crab Cakes- delicious; only 2 pieces though; would order again +Wood Oven Whole Chicken- takes 30 minutes to prep so brace yourself. soft tender and juicy with potatos in the juice -Panna Cotta Pudding Cake- fail; we didn't enjoy it as much as we liked  Service: Made reservations and it wasn't too busy on  Thursday evening around 6:30.   Ambiance: Very alive and chatty after work; great place to get away from the dying financial district and closer to the calm  -Hungry Hungry Pongy", 
    "review_date": "2015-01-20"
  }, 
  "Fd7sClkueyyzfgV1QCS-9w": {
    "user_rating": 4.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Martha V.", 
    "review_text": "This place is good. Had the Benedict and I have no complaints. The deviled eggs were delicious and one even came on the bloody Mary. It took them awhile to take our order even though the place was empty which of why I didn't give it 5 stars.", 
    "review_date": "2014-05-10"
  }, 
  "I-meqHrMad7Tkm4vXvjyyw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily G.", 
    "review_text": "Meh. The food is decent. They made a big fuss about having more than 4 credit cards on a 12 person bill. Not such a great finish to a fair dinner experience.", 
    "review_date": "2014-04-26"
  }, 
  "lVrNac8ldvymVo6K8yHeWA": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Jaime W.", 
    "review_text": "I'd say the newly renovated Fog City Diner is ascetically pleasing with great service BUT that comes at a high price.   The best dishes Fog City Diner offered were the selection of gourmet vegetable dishes. In particular the long stem broccoli and carrots. Those two dishes were lightly seasoned and had a dash of olive oil to make them flavorful as well as healthy.   Unfortunately while I was enjoying my vegetables, I realized I had to shout across the table to communicate with the rest of my party. At dinner time, be ready to project your voice. Also, I was curious what a $35 whole chicken would taste like. Must be at least seven times better than a $5 Costco chicken right?! Well...it was dry. I was surprised how expensive a dry chicken was.   Bottom line: Great vegetable dishes, loud inside, dry chicken, overpriced.", 
    "review_date": "2014-07-20"
  }, 
  "O4q8s3LBs4kjCcNJ9LkTLA": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Local G.", 
    "review_text": "Your own private quarters along the wharf! Solid wood door, subway tile, dim mood lighting, 2 handlebars for traction control all within large private restroom make this the best place to drop a deuce in the whole entire city!!!", 
    "review_date": "2014-11-08"
  }, 
  "xLE1FUeiLg7Map9EDgU9fw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin K.", 
    "review_text": "If a friend from out of town arrived seeking a restaurant recommendation, (the new) Fog City would not be on my list.     Two of us went there on Thursday, 24 October 2013, anticipating a wonderful experience based upon previously eating at the old Fog City Diner. We were met with a busy and noisy new environment. Within the first few moments, we ordered cocktails, one being a gin and tonic where two of the most popular gins in the world were not available - Bombay and Tanqueray.    Plowing on, we ordered wine and food.  The wine arrived soon - the drinks never arrived and we asked one to the managers to delete the drinks from the order.   Any sensitive restauranteur would have comped a desert or coffee - - - Fog City nothing.  One of the twists to the new restaurant, as specified on the menu, is plate sharing.  One problem: the proper utensils for the sharing of food (spoons, forks, etc.) were never provided prior to our asking.    Another issue was that for a tomato salad consisting of many delicious and small components, a spoon or cracker or baguette would have have been superior to incessant stabbing with a fork yielding minimal results.  The food was basically fine; however, while most restaurants provide some form of bread with which to soak up the sauces, not Fog City. No bread was ever provided.  After desert, the bill instantly appeared.  Guess what was on the bill? $25.50 of cocktails never received!  I called the waitress to inform her I was incensed to discover the cocktail charge and before I even got the words out of my mouth . . .  she knew far too quickly about the error in billing. Hmmm?   This comment of hers would lead a reasonable person to believe that perhaps alcohol-infused patrons might overlook careful scrutiny of their bill.  Thus, Fog City would be $25.50 richer and their patrons $25.50 poorer.  The only conclusion to be drawn is buyer beware.", 
    "review_date": "2013-10-24"
  }, 
  "S0Pji5ZPQwlolC7vlq1lug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kris L.", 
    "review_text": "I never got a chance to try Fog City Diner, but A &amp; I were downtown, for once, and decided to make a day of it.   We walked from the Ferry Building to the restaurant (now just Fog City), which was actually a good walk. All the outdoor tables were occupied, but only a few indoor tables were occupied.   A used to frequent Fog City Diner on an almost daily basis years ago and he was telling me how they really opened up and streamlined the layout when they remodeled. I never saw it before, but I am loving the new open layout.  FOOD * Warm old fashioned sugar dusted doughnuts - Warm, doughy o's of goodness! Simple, yet delicious. * Deviled eggs with bacon and crispy quinoa - There is a definite crispy crunchiness which you would think comes from the bacon, but it's actually the crispy quinoa. I don't know who thought of sprinkling that on the eggs, but whoever it was is absolutely brilliant! Now I want to make crispy quinoa and sprinkle it in everything too! * Furikake fries - I think I pretty much love Furikake anything, but these fries were truly delicious. I'd go here just to have these again. * Fog City Burger - The beef was cooked perfectly medium rare. They cut it in half for us and the burger wasn't falling apart. The cheese really added to the flavor and I loved their special sauce. It also comes with a side of fries. Yes, more fries!!! Not Furikake, but still very good.  We were way too full for dessert, but there were several things on the menu that we would definitely come back to try.  PRICE About $50. for two including tax/tip, no drinks.  (Please excuse any errors. This review was written on my phone.)", 
    "review_date": "2014-06-29"
  }, 
  "EVaW-GGDEbYrYhgGUmO0DQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Karen H.", 
    "review_text": "I like the look of this place after the remodel. Our server was friendly and the food was really good. Before the remodel, I tried the food once and it wasn't bad. Better than Mel's Drive In.....not sure if that is saying much.   The food now is up to my standards.   AHI TUNA TARTARE served on Sticky Rice Cakes with Asian Pear, Wasabi, Sesame, Soy, Shiso Leaf-small bites size pieces. Really yummy. Love the crunch the rice cakes give with the tuna. Different from your typical won ton chips with tuna.   DEVILED EGGS with Crispy Quinoa, Bacon-this was so good. The crispy quinoa gave it that extra crunch. You have to really like mustard though, because they put Dijon mustard on the bottom of the egg, before they fill it with the yolk filling.   BRUSSELS SPROUTS  with Asian Pears, Ponzu-very well-seasoned. The pears add a nice touch to this dish.   CAULIFLOWER NUGGETS with Vadouvan Curry, Serrano Chile, Lime-this wasn't bad, but too much curry flavor for my liking.   FLAME GRILLED GARLIC SHRIMP with Tomato-Rosemary Pan Sauce, Garlic Chips-you get 4 pieces. Cooked perfectly and great flavor. Each shrimp was a decent size. It had a bunch of spinach on the bottom of the dish. Love!  WOOD OVEN CLAMS with Green Garlic Tomato Broth, Grilled Portobello Mushrooms, Straus Butter-pretty big size. Super yummy. Make sure you add the HAND-CUT FURIKAKE FRIES with Bonito Flakes, Garlic Aioli-it was crispy and thy give alot. Super yummy!", 
    "review_date": "2014-04-25"
  }, 
  "zFCw8uszWpKY7qRlrI0KAw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Patricia B.", 
    "review_text": "March 25 had an exceptional serving of steam clams at the bar.  April 10 ordered octopus salad at it was so unsatisfactory.  There was no presentation to the dish it looked as if it was a rush-defrost and throw on some dressing and serve. Thought I should post a WARNING!", 
    "review_date": "2014-04-10"
  }, 
  "S9U7bJYrUGLspHYsnyHeQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim D.", 
    "review_text": "I've always enjoyed going to Fog City Diner.  The remodel is nice, although for those who knew the \"old\" Fog City, it's not an easy adjustment.  The roast chicken, their signature dish, was great.  Good portion of food for two.  I had the roasted brussel sprouts and an awesome salad. Great meal.  It was very loud, so, be ready, but wasn't a big issue.", 
    "review_date": "2014-04-14"
  }, 
  "FHe8iR0zF5zt3NSiFyAk7w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terry C.", 
    "review_text": "It's really 3.5 stars. Fog City surprised me! I had not been to the diner before so there's nothing for me to compare it to.  The decor is nice and the service was great.   We ordered the cauliflower nugget which was delicious and very addicting. The kale &amp; farro salad was just ok.. It was kinda bland.  We heard Fog City's chicken was comparable to the roasted chicken salad at zuni's so we had to try it. It was good. The chicken was juicy and very flavorful. The dish came with cabbage, onions and potatoes. I can't really compare it to zuni's because it's different. but it was definitely tasty. Although we were stuffed, we couldn't pass up on desserts when we saw the menu - frozen custard, homemade donuts.... HmMmmmMmmm yum.", 
    "review_date": "2014-05-05"
  }, 
  "-PoCbyNa4xc4yvReuj5pqw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Poppy C.", 
    "review_text": "I really want to like this place more. I feel very nostalgic towards it. But I just didn't have a great time. It's probably the fault of the obnoxious 60something year old man next to us on a <a href=\"/redir?url=http%3A%2F%2FMatch.com&amp;s=811cc30022d77156f869d2477f68d5823aaf9b46b799319ab032f2da80256579\" rel=\"nofollow\" target=\"_blank\">Match.com</a> first date, keep an eye out for his review I bet it's a doozy.  He ordered about 40 deviled eggs because as he proudly told his horrified date, he knew from his many former experiences here that one order wouldn't be enough. I'll return to this winner momentarily...  My dinner was fine to middling, nothing to rave on Yelp about. Crab cakes (fine), fries (big pool of oil in bottom of bowl), broccoli (way too much lemon) and lamb skewers (served with butter lettuce cups to make some kind of wrap). Nothing outstanding there and some dishes verging on the edge of not edible due to tasting yucky. HOWEVER, my \"I'm on a boat\" cocktail was very very palatable so well done thank you very much. The doughnut is FANTASTIC. Get it with frozen vanilla custard and don't touch that disgusting orange sludge sauce on the side.  Anyhow back to the awful man next to me on his date.  He told a not funny story in his bizarre fake deep radio announcer voice. I think it was about all the eggs not sitting well with him last time and then when his date suggested oysters (i think they were a tad pricey like almost deviled egg at urchin bistrot expensive) so he tried to sell her on the idea of them gettin ONE oyster each. When she said she was thinking a dozen he warned her multiple times he expected her to eat them all. I don't know how their date ended because we left but I do know that if I ever see this man again I will make sure to keep my distance, he loves eggs but they don't love him.", 
    "review_date": "2014-09-30"
  }, 
  "Te18TxvzfLomGE56N7s3Dw": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Dean W.", 
    "review_text": "I loved the old Fog City Diner.  It was one of my favorite places to eat partly because it was a diner, it felt like a staple of San Francisco and my mom and I would eat there after working out at the tennis club.  I was sad to see the place close down but was very excited to see that it reopened with the same name.  I had even higher hopes when I found out the group behind Bix and Zero Zero, two restaurants I particularly like were behind the reopening of this once great restaurant.  The restaurant kept the same facade, with windows wrapping around the restaurant however the inside is where they truly did a great job.  They made the restaurant completely open with a very comfortable, beautiful feel yet kept the booths which really gives you the old diner feel.  I really felt they did an exceptional job with that.  There is a bar right in the middle of the restaurant and an open kitchen that looks like something out of William and Sonoma.    We ordered a variety of things because it was plates to share and so we had the deviled eggs, furikake fries, clams, beef tongue and lamb.  The devil eggs were delicious; I usually don't like it and don't like eggs but they did a splendid job.  The furikake fries however weren't very good at all.  Too much oil in the fries and the fries were over fried along with not enough furikake and the mayo that came with it wasn't very good.  The furikake fries I had in Maui which had plenty of seasoning plus a great wasabi mayo was much better.  The clams didn't have any taste and the beef tongue had some vegetable in there that kind of ruined the dish.  I wasn't sure what it was but it wasn't very good.  The lamb was decent, came out in two long skewers and you ate like a lettuce wrap since they gave you lettuce, sauce and some condiments for it.  I really wanted the place to be much better but it wasn't as bad as my friend said it was (she said don't go, it's really not good).  I hope they improve the food because such a beautiful restaurant should have food to match its atmosphere.", 
    "review_date": "2014-03-10"
  }, 
  "QPRQcNaOb7Ooyx01zMlFjQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy K.", 
    "review_text": "Lunch food and service here are really good, but the noise level is off the charts.  Choose another place if you want to able to have a conversation.", 
    "review_date": "2014-03-14"
  }, 
  "4HUu0d1QsntSDK2nix4pqw": {
    "user_rating": 3.0, 
    "user_location": "Parker, CO", 
    "user_name": "Brandon C.", 
    "review_text": "Overpriced tapas, waiter told us to order 7-10 plates at 15-30 a piece really? Burger was good everything else was over seasoned. Wait staff is attentive. Heard this place used to be great not impressed.", 
    "review_date": "2014-01-07"
  }, 
  "aLVxgd8GUNBnzmXZbVECMQ": {
    "user_rating": 4.0, 
    "user_location": "Carmel Valley, CA", 
    "user_name": "Deborah E.", 
    "review_text": "Hadn't tried this place since they went through their \"makeover\" nor had any of my friends. I would definitely recommend it. We ordered mostly small plates and loved everything! The radicchio salad was possibly the best salad I've ever had. The service was excellent - I have a food allergy and the server alerted me to a problem I would never have suspected. And while this was date night, we both agreed we would come back to the bar, to watch a game, etc.", 
    "review_date": "2014-12-04"
  }, 
  "pJQNx6BsCyYGNNYlFdnfAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donna W.", 
    "review_text": "We came here for lunch a few times.  Wish they opened up a bit earlier.  We sat at the bar &amp; the bartender was very nice.  We tried several drinks, all of which we enjoyed.  The food was great.  We started with the Furikake Fries.  I enjoyed them but my husband didn't like the shaved Furikake on it.  It was just too fishy for him.   I had the open faced turkey (Fog City Hot Brown) which was nothing of what I expected and very delicious.  My husband had the Saigon Dip and he devoured it all.  Overall, we liked it and will be back.", 
    "review_date": "2014-02-22"
  }, 
  "Pxky6wU2mkrht4YWE1YhLg": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "TM O.", 
    "review_text": "We ordered the following: ahi tuna tartar,  furikake fries, Brussels sprouts, garden salad, whole chicken, wild boar ribs, oven baked clams, and heritage pork chop. We were a party of five and we were definitely stuffed!  Here's a review of the food:  The fries, oven baked clams, Brussels sprouts, and whole chicken were very tasty. The chicken, in particular, was very moist and tender, absolutely delicious!  The wild boar meat was good. It fell right off the bones beautifully but the flavor was very one dimensional and under seasoned.  As I was eating it, I kept wishing for something to balance the umami fat flavor. The slaw that came with it was okay with it bc it was on the sour side. It tasted like tajin's flavor chili salt that Mexicans eat with fruits.   The heritage pork chop itself was the \"worst\" dish for me because it was on the dry side, and the sauce/bed of red cabbage and Fuji Apple did not enhance the flavors. The combo did not meld well.  It was a flop IMO.  It was also really small.  This restaurant loves their balsamic vinegar because the salad dressing was mostly that. I love balsamic vinegar dressings normally, but this one was just not done well. Pass.   Here's one of the reasons why I didn't give them a higher review. The ahi tuna came out with a piece of hair in the crispy rice at the bottom. It was stuck in there, I tried to pull it out thinking maybe someone's hair just dropped on it but it was deeply rooted in the rice. I should have taken a picture but i didn't want to make a big deal. Sometimes, accidents happen, it's okay with me.  However, it's how it was handled that really bugged me.  I pointed the hair to a waiter, who was rightly apologetic. He took the plate away and probably told the waitress and manager. The manager then hesitatingly came over and slowly approached us like we were going to chew his ears out. (Except, we were all calm and smiling because we were still enjoying ourselves despite the hair.) He kept a good table distance away from us too when he \"apologized,\" it was as if we had cooties and he was afraid we'd give to it to him.  This is literally what he said, \"I heard there was an unfortunate incident regarding one of your dishes. My apologies. I will remove it from your tab.\" That was while he was swiftly backing away. It was the most insincere and abrupt apology I've ever received from a business owner/manager ever! He said his piece and scurried off. I'd call that a record drive by apology of 5 seconds.  To add to the unsatisfactory service, they took one of our plates with that hairy tartar and did not replace it. I had to ask for it after more food kept coming out because I guess our waitress didn't realize we were missing a plate. Not her fault since she didn't take the plate away. But still, someone should have noticed.   When the bill came, the ahi tuna tartar was still on the bill.... The waitress realized it before we said anything so good for her because I would have said something.   I probably would come back just for the chicken. Everything else I can probably find at another restaurant with ease. The service was pretty good until the \"unfortunate incident\" happened. It was the manager's handling of the problem that really killed the experience for me. I'm sure your experience won't be as bad as long as you avoid hairy foods.", 
    "review_date": "2014-04-21"
  }, 
  "WjEmMLDWoKZMXes-h_Hg4A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James D.", 
    "review_text": "The attitude here has been much more manageable at least during weekday lunch. Outside tables are nice.", 
    "review_date": "2014-08-27"
  }, 
  "CFtCdyGi319TOBaSG8x4qg": {
    "user_rating": 1.0, 
    "user_location": "Marin, CA", 
    "user_name": "Gregory C.", 
    "review_text": "Simply bad...almost Denny's like bad.   Hostess was clueless as they have no sense of customer's intentions...empty place but she refused to give us a better table when we kind of stood there waiting...then the table had stains on it that seemed odd since this was relatively a new place.  The window area was cold and damp and my friend felt she caught a cold sitting there.  The noise from just a few tables in the area later was so bouncy that I could hear their conversation better than ours...very annoying and poor design.  The food missed big time.  The Brussel sprouts were charred beyond to a point of acridness.  The Deviled eggs seemed to ordered by every table was just blah...with weird crunchy elements on top.  The Minestrone soup was a complete disaster as it tastes of dishwater and served in a crooked cup.  The trout looked so amateurish like a culinary student put it together.  The steak had this awful topping and glaze that ruined what might gave been a decent cut.  The chicken which was suppose to be the star of the menu was dry and tasteless.  Worst was the mustard green leaves that were so old they looked like something from the bottom of your refrigerator.  The fingerlings were like boiled potatoes and the whole thing at $34 was a complete waste.  The four of us sat there eating the bread which they charge $3 for and had to add toppings at extra costs to frozen custard that appeared on three desserts.  The server was nice and kind of knew we didn't enjoy our meal...she deserves better.  This cannot be Bruce Hill food as even his worst night can't be this bad!", 
    "review_date": "2014-02-19"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Bravo, Fog City.   It's a dingy diner no more! Your new self is sleek and contemporary; kudos on taking advantage of the smashing bay views. The brunch menu is short, but the choices are all standouts: belly busting chorizo hash, luscious crab benedict, fantastic maple glazed donuts!   I could go on, but what really cinched the deal are the uber fresh Marin Miyagi oysters. Have you ever had Oak Barrel aged hot sauce on these marvelous mollusks? pretentious? don't judge! well, if you do, then MORE for me!  A 3 hour brunch wouldn't be complete without tasty tipples. Go with any of the creatively named drinks like the Daredevil, Bad Moon Rising, an Inside Job or Grandpa's Breakfast. You won't be disappointed!  Sounds perfect? how about sidewalk seating while getting your tan on? ;-)  I'll stop here. I don't think you need anymore convincing.", 
    "review_date": "2014-11-10"
  }, 
  "dlp9xS7vCW23-p4ogwakUA": {
    "user_rating": 1.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Erica B.", 
    "review_text": "Do not! I repeat, DO NOT eat at this place!! Next time you decide to have lunch in SF, PLEASE avoid this place!! Not only are they ridiculously overpriced, but the only place close to me, but the burger had so much of whatever the hell the sauce was that I pacifically said I didn't want on! But the whole damn thing was just soggy as hell!! And top it off, I should have looked and that's my bad, the water I ordered wasn't even in the bag!! Again, just wanted to give you all a heads up! Ughhh!", 
    "review_date": "2015-01-24"
  }, 
  "eIa4QJXp5ZNmuFORnuPvDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ziyan C.", 
    "review_text": "I had a really nice dinner here with a group of Yelpers to learn food photography. Needless to say there were a lot of cameras &amp; selective questioning of the menu. The staff were really friendly about it.  I really like the knife: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#tafIJtYHoAhTvKyTIOEAnQ\">yelp.com/biz_photos/fog-…</a>  SERVICE: We had a very fun, knowledgeable server. My table adored her, though I thought she was a little overbearing. She was very conscious of the order in which food came out, some of us being vegetarian, etc.   COST: Total $38 or $46 a person (more if they got a drink) for 2 snacks, 7 plates, &amp; 2 desserts, shared.  MUST-HAVES: Cauliflower, brussels sprouts, crudo, shelling beans!  Dinner menu: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#0QTOE99Wn8u6TTUg_nkJQQ\">yelp.com/biz_photos/fog-…</a> ~~SNACKS ($6)~~ * Cauliflower nuggets - 4.5 stars (vadouvan curry, serrano chile, lime) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#ii_guoVH9KAMRUkNvVVtcA\">yelp.com/biz_photos/fog-…</a> One of the faves. Amazing flavors - they sous-vide it &amp; the flash deep-fry it. I thought the lime was a bit intense, but otherwise I loved the light, crisp breading.  * Brussels sprouts - 5 stars (asian pears ponzu) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#IVk69ZiA92zOSoLRk7so9w\">yelp.com/biz_photos/fog-…</a> This was one of my personal faves of the night. Great crisp, &amp; asian pears - such a surprisingly great pairing!  ~~PLATES TO SHARE~~ * Grilled mission fig salad - 4 stars (baby lettuces, point reyes blue, prosciutto, walnut gremolata. $14) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#WE2VnnutW8oghsa8C__pqA\">yelp.com/biz_photos/fog-…</a> I really liked the combo of flavors. If the walnuts were candied/toasted, that would've been the cherry on top. The blue cheese was sharp, I loved the salinity of the prosciutto, &amp; the figs were very soft/sweet.  * Spicy fire seared pole beans - 3.5 stars (cherry tomatoes, thai bird chilies, mint basil, garum &amp; toasted sesame seeds. $10) The table loved this. It had an intense spicy taste, but there was a lemon flavor that was a little much for me, &amp; I found the texture of the beans soggy/overcooked, not crisp as I like it.  * Wood grilled tomato soup - 3.5 stars (stracciatella, basil, olive oil. $6) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#tvjPiXX5eJ1iCNn46tMjxA\">yelp.com/biz_photos/fog-…</a> This was very simple &amp; small. It did have a thick texture &amp; was very fresh, smoky.  * Oven roasted shelling beans - 4 stars (w/ smoky tomato butter &amp; marjoram, garlic breadcrumbs. $13) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#Df3rpry9wms98E_pKf7sSw\">yelp.com/biz_photos/fog-…</a> A great heavy dish w/ lots of beans &amp; a variety of textures. It also had hints of southern flavors.  * King oyster mushrooms - 3 stars (red heart pimento-paprika stew, dill scented greek yogurt. $16) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#bj2QwezkR0D0EmWkEOYtPA\">yelp.com/biz_photos/fog-…</a> No one really liked this: two large mushrooms sitting in a tomato-like stew that was watery. Nothing too impressive, kind of bland.  * Kampachi crudo - 4.5 stars (pickled asian pear, ginger, jalapeno cucumbers, &amp; lemon olive oil. $16) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#-Bem0WViFB17B-iLSnw7Yg\">yelp.com/biz_photos/fog-…</a> I thought the ingredients were super fresh, &amp; everything had an intense crunch. Each individual bite-sized portion came together perfectly.  * Wood oven whole chicken - 4 stars (charred brentwood corn, crispy potatoes, &amp; spiced maldon salt. $29) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#87KJSxPzwAabpwyn3ry2Rw\">yelp.com/biz_photos/fog-…</a> The chicken was a big overhyped. It was juicy &amp; tender, but could've used more texture (some crisp on the skin) or more surprising flavors. The CORN - omg, that's where the dish was a real star! It was citrus-y, intense, juicy. Loved it!  ~~SWEETS~~ Menu: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#auZzqHrKVZG5HjQuuNhdoA\">yelp.com/biz_photos/fog-…</a> * Green chili apple pie - 4 stars (hatch chiles, pippin apples, crispy topping, frozen custard. $7) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#EOmhYkQIV_zrnXR9SZvQ5A\">yelp.com/biz_photos/fog-…</a> I thought the peppers weren't strong but the others at my table really liked it. The textures were great w/ the thin buttery outer crust, sweet apples, &amp; crumbles on top.   * Panna cotta pudding cake - 3.5 stars (dark chocolate, milk chocolate, caramel candied peanuts. $8) pic: <a href=\"http://www.yelp.com/biz_photos/fog-city-san-francisco-2?select=auZzqHrKVZG5HjQuuNhdoA#xp-Qo-abJhsANSRRecffSw\">yelp.com/biz_photos/fog-…</a> This had a little bit less of the milky flavor I like at panna cotta &amp; was more jello-like, jiggly. The cake at the bottom layer was super light &amp; fluffy, which I didn't think went well with the panna cotta layers. My table really liked this though.", 
    "review_date": "2013-12-06"
  }, 
  "phPiUMoU4JsA80hyw4iQmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elettra R.", 
    "review_text": "I came here without any expectations and was thoroughly surprised how nice our dinner turned out. It is a great local spot if you're in the mood to just wind down for a casual dinner.  I would go back for: Brussel Sprouts, Grilled Asparagus, Broccoli Di Cicco, Grilled Spanish Octopus Salad, and Wood Oven Whole Chicken.  I obsess over dessert as much as I do over dinner. Skip dessert.", 
    "review_date": "2014-05-05"
  }, 
  "_uRU_ktdOi_bjSOA-tcq2Q": {
    "user_rating": 4.0, 
    "user_location": "Sequim, WA", 
    "user_name": "Jane D.", 
    "review_text": "Really love this place. Sorry to say, it was MUCH BETTER BEFORE! The new rehabbed place is still good, still a great place &amp; I go as often as I can. Boo Hoo I miss the old one!", 
    "review_date": "2015-01-17"
  }, 
  "gi3VkcISbUpd0BQ68FerAQ": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "John S.", 
    "review_text": "For the price point, very, very happy.  I liked the old Fog City, but didn't think it was much to write home for, the new one DEFINITELY is worth writing home.    The roast chicken is hands down the best I've ever had.  I have a soft spot for milk punch as its a family New Year's tradition.  Fog City's version is wonderful and unlike any other I've had.  When the waiter set it down I thought it was a vesper martini; his response when I asked \"is this the milk punch\" was \"of course, we use clarified milk.\"  I had never heard of this but it works, and now I want to try and reverse engineer it!    In the near future I plan to try brunch.  My rating above is based on the 3 dinners I have had there since reopening.  Roast chicken steals the show for me, but the ribeye was also delicious and perfectly cooked.  Deviled eggs are great, French cruller is definitely worth the calories in all of its eggy citrusy goodness.", 
    "review_date": "2013-11-10"
  }, 
  "4ynWqCgExk56zfgmRmYRqA": {
    "user_rating": 5.0, 
    "user_location": "Orlando, FL", 
    "user_name": "Daniel M.", 
    "review_text": "This is a five ! I eat around the world and this is better than most, they have good service and good food when they are slammed. Prices are high , but worth it if you actually care about food.  Not for cheap, winey , or annoying  people . Did you wonder just now if you are one of those people , then you are .  Spend $100 and enjoy yourself.", 
    "review_date": "2014-01-16"
  }, 
  "jAiGoRmj3eAkeH_3KfudXg": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Mary T.", 
    "review_text": "We popped into Fog City after an afternoon at the Exploratorium. I'm not sure what the place looked like pre-remodel in its diner days, but I love the new decor. Sleek, simple, with clean lines, good natural light and lots of wood.  We sat at the bar ordering drinks and a snack. He went with a beer and I a play on a margarita with a chile.* Our bartender was a doll; I'm not really one for small talk, but we chatted with her easily while we were there. To eat, we ordered the Early Morning Tomatoes. The description was a little deceptive, we thought we'd be getting a flatbread, but it was more like a tomato salad with flatbread croutons. We loved the dish but agreed that more chevre would have improved it.  If the rest of Fog City's food is like the drinks and appetizer we had, it's worth a stop. I'd definitely make a stop in again if I was on the Embarcadero.  * The chile that comes with this drink may be small, but the manfriend ate it and it is hot. Have something to blunt the heat at the ready, it is h-o-t, hot.", 
    "review_date": "2013-12-03"
  }, 
  "OI-h0R6CoJtR5LK6zLrvww": {
    "user_rating": 5.0, 
    "user_location": "Forestville, CA", 
    "user_name": "Michael L.", 
    "review_text": "Amazing service and food. Great open kitchen and unique flavors. Try the Saigon dip. It is a zesty treat.", 
    "review_date": "2014-04-13"
  }, 
  "TCWDxGDYUC0NkUrq_Ka7pg": {
    "user_rating": 4.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Chris C.", 
    "review_text": "Doesn't look like much on the outside, but the interior is well designed yet maintains a casual, relaxed atmosphere.  They had great drink / brunch specials.  I enjoyed a few bloody mary's while my friend had the milk punch.  He said it was good but it was rather small.  The saigon dip is delicious and a must try.  The wood oven brown is also a hot plate of delicious that just makes you want to curl up on the couch and relax.  The service is good and the staff is friendly.  The bill was rather pricey for a brunch.", 
    "review_date": "2014-03-25"
  }, 
  "TLzwLBhPoO33w85VOXz97g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobu K.", 
    "review_text": "There was an ugly old frustrated unhappy waiter here ruined our dinner. 7 of us were having a family dinner went so bad, annoyed us. The waiter, about 65, full gray hair, 5'8\" high, 230lb stocky, big nose, dominator idiot, giving us a lecture of the menu, telling us what he likes or not. His mouth smelled so bad like rotten Tofu like, or I must say, 17 days old mackerel.  He was very rude to us. Such a self centered character that he thinks he is better than anybody, the kind. Who the hell cares for your opinion?  Just get me a food, Bitch!  Well, also, the most of food was underwhelming. We had the crab cakes, which were tasty but small. OK, they were on the menu as a 'small plate', but at $16 they were very disappointing.  My friend had the chicken salad which was $17--extortionate, considering it was brown chicken meat and lettuce with a minimal amount of all the other ingredients (Tory Farm Nectarines, Marinated Cabbage, Candied Peanuts). Personally, I find it BAFFLING how restaurants can charge such high prices for what is, essentially, 10 cents worth of lettuce and less chicken than you get in a single chicken tender from KFC. Ridiculous.  You pay $15 for a shitty burger that doesn't even come with fries. The bun was soggy. The lettuce was sparse. The meat didn't really taste like anything and was a thin patty. Man. I got through about 3 bites and called it quits.  Overall, 'meh' is a great word to describe Fog City. It's a shame, because it could be more upbeat, be much better value for money and have more personality/individuality. But being where it is (right near the Pier buildings and near a constant stream of tourist traffic) the owners probably don't think they need to bother making any extra effort.  I don't like the dominator waiter. I feel really sorry for him. What a Frustrated Ugly Old Fart!  Cherylynn N. For my review of: Fog City \"Well, I guess I know what to skip!\"  Yes, you should Skip Fog City!", 
    "review_date": "2015-01-12"
  }, 
  "TqJmcgvFJXUv3joEK8p-yg": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Jane M.", 
    "review_text": "What a great time on Saturday. First of all,service was 5 stars'!!! The hostess,our server,the manager all rocked   Our meal was awesome. !!the kale salad,shrimp and grits, incredible burger and the custard all were delicious   Will definitely be back! Highly recommend", 
    "review_date": "2013-11-24"
  }, 
  "KzroPmvVkyshPwRDgLBwEw": {
    "user_rating": 1.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "R P.", 
    "review_text": "I had a bad experience with the crowd in this restaurant.I raised the issue with the manager. One other thing - They charge for the bread which they serve with the entrees.", 
    "review_date": "2014-07-05"
  }, 
  "BgWaJDXga_iqOqxIYaxrrw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabrina M.", 
    "review_text": "Fog City I want to love you but...I've tried you 4 times and... Service: lacking and often rude servers. If you sit outside you have a good chance of being forgotten.  Food: Mediocre and way overpriced.  Parking: hit or miss. Can be a nightmare. Will ticket on Sundays  Chorizo Hash: $17 French toast $14 It's like eating room service food and paying for it.", 
    "review_date": "2014-08-23"
  }, 
  "L5INIE0xCZdFKZMcpyWLQw": {
    "user_rating": 4.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Frankie G.", 
    "review_text": "Creative, non-pretentious and absolutely delicious.   The Woodfired cooking shines through in every dish, from appetizers to desserts.   Go with a group and share the plates. Chef Bruce Hill and his team have a passion for offering creative, sustainable and delicious food.", 
    "review_date": "2014-12-10"
  }, 
  "HYeP6_BNSQYSB_oR-SqiLA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yella W.", 
    "review_text": "Missed the old decor.  Thought the brunch menu limited.  Expected lunch menu but  it wasn't available on a Saturday.  Hamburger overpriced for size, quality.  Thin, cooked medium, not rare.  Fries good without the fishy addition.", 
    "review_date": "2014-06-29"
  }, 
  "BIkivGwMblK3_r2N0pSE8A": {
    "user_rating": 4.0, 
    "user_location": "Silicon Valley, CA", 
    "user_name": "Lance W.", 
    "review_text": "My family had lunch here on a beautiful summer afternoon.  I have not been here since the remodel, the space is now beautiful and modern while retaining just a bit of the old diner.  My wife and son ordered cheeseburgers and they seemed to be happy with them.  I ordered the Saigon Dip and found it to be unique and delicious.  A cross between a French Dip and Banh Mi served with delicious Pho broth for dipping rather than Au Jus.  For dessert we shared an order of the chocolate crullers.  There was too much chocolate for me, I would have preferred a dusting of cinnamon &amp; sugar.  We'll likely come here again if we are in the neighborhood...", 
    "review_date": "2014-07-06"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "i came here on sunday w/ 5 friends and we shared a bunch of stuff.  the brussels sprouts, cauliflower fritters and deviled eggs were all great.  i also think the broccoli di ciccio and roasted carrots were yummy.  i shared the trout as well, and it was light and perfectly cooked.   the desserts were ok tho (apple pie, small bites and the pot de creme).  i probably could have done w/o them.", 
    "review_date": "2014-02-06"
  }, 
  "jgtHDLB5JSmwV5PX5ml_Tw": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Herman K.", 
    "review_text": "every thing is better than it was.", 
    "review_date": "2014-01-16"
  }, 
  "BsV1OSz6IYPzV-ekTqJIoA": {
    "user_rating": 3.0, 
    "user_location": "Playa Del Rey, Los Angeles, CA", 
    "user_name": "Ben N.", 
    "review_text": "Great food and service. The addition of the wood burning grills is fantastic. We had the grilled fig salad, grilled pole beans, beef tongue salad and the Swordfish. All were prepared perfectly. Figs were carmelized well, the pole beans had just enough spicy heat, the tongue was very tender and the swordfish simply grilled to let its own flavor standout. My only disappointment was the fact that we were fighting off fruit flies from our plates and drinks through the whole meal. Other than that it was a great experience.", 
    "review_date": "2013-11-05"
  }, 
  "OsHLf1WYFti775iMNgwSUg": {
    "user_rating": 5.0, 
    "user_location": "Walton, NY", 
    "user_name": "Cristina B.", 
    "review_text": "A local pointed us here - we were trying to get out of tourist hell down by the piers and a lovely gentleman walking his dog suggested it. So happy to find it! Service was superb, informed, fast, genuinely friendly and accommodating. The space itself is absolutely beautiful and unique. Cozy yet sleek.  Shared the paprika and bacon peanuts (addicting). I had the onion soup and kale salad, and husband had the burger - everything was fresh, well prepared and high quality. We also shared the delicious garlicky fries. I wish this place was closer to home, we'd go all the time! A highlight of this trip!", 
    "review_date": "2014-06-23"
  }, 
  "uqOizjedeV43lEiwJa5RNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah G.", 
    "review_text": "Under rated.  Lamb kebabs, burger, brussels, fries, kale salad...the dishes were not unique, but they were much tastier than any other spot serving the same concept.  My drinks were better than any other $12 cocktails I've had in awhile.   Loved that they added heaps of bar seating in the makeover.  Perhaps happiness came from sitting at the bar with simple expectations as opposed to formal table service.", 
    "review_date": "2014-02-14"
  }, 
  "KMKtLIaFzkJA3yHqqlG-Bw": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chula R.", 
    "review_text": "This was the worst dining experience of my life. Our party of four was verbally harassed by a completely intoxicated patron and management's response only added insult to injury. Not to mention that the food was sub par, at best. To be fair, we left before the entree (because the verbal abuse continued) so I can only speak for the several appetizers we tried but they did not impress. We were looking forward to having a celebratory dinner and seeing how the renovations have improved the restaurant but unfortunately, it was a total disappointment and a complete waste of money. We basically paid 200$ for some lousy appetizers, drinks, and to be treated horrifically. I at least expected the staff to be helpful and take action but they did just the opposite.  I will never return nor will I recommend this restaurant to anyone.", 
    "review_date": "2014-03-28"
  }, 
  "jhec3G37jetpori8IFnGAw": {
    "user_rating": 3.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Walter K.", 
    "review_text": "The food was good.  However, our dinning experience was adversely impacted by the long delay of food and reversed order of main course and much delayed soup due to computer entry error per the manager.  The manager was apologetic and did not charge us the soup at the end.  Unfortunately, my evening was not as fun as I had expected.", 
    "review_date": "2013-12-30"
  }, 
  "GIupQf3nYTPuHkMfEUEm5Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan M.", 
    "review_text": "One Star is for the renovations they did to the restaurant - it looks great now!  Nice seating and gorgeous bar!  Wood fire oven and overall a great layout!  Second Star is for the service.  While it wasn't \"amazing\" or anything, it was quite nice.  Everyone was very polite, came in a timely manner, and our water was refilled frequently!   As a server myself, I appreciate good service, and I definitely had it here.  Minus Three Stars for the food.  Honestly, it was not only not \"good\" but I think very very bland and tasteless.  I almost never say that about food!  Even the friend I was with had the EXACT same thing to say.  We had the Lamb (which wasn't too bad), the fries (\"eh\") and the Fog City Burger.  The burger had NO TASTE WHATSOEVER!  I couldn't believe it.... Then we traded it out for a Grilled Shrimp Entree, which was hard/rubbery and way over-salted.  Completely lost our taste for dessert and quite frankly, we just wanted to jet outta there!  It was nice they took the two items we didn't like off our bill, as would be expected, but I really wanted to pay for them and like them!  Ugh... wasn't very pleasant in that sense, but like I said, good service and decor, but really the point is to eat and with that it wasn't good.  The bread and Fog City Mule (drink) were great though!", 
    "review_date": "2014-04-22"
  }, 
  "ES8LX7rVlq3i5RCB30Tv2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miriam M.", 
    "review_text": "Used to enjoy this place back in it's \"Fog City Diner\" days, so decided to celebrate Hubby's 56th bday there.  Definitely NOT a diner anymore.  It never really was, but all that's gone now except some of the booths.  The food is upscale, beautiful, well-presented and amazing.  Service good, but perhaps a few more servers would suit the crowd better. I really appreciated the absolutely delicious fruit bowl I was able to request for dessert in deference to sugar issues.  Some of the best fruit I've ever had and they were kind enough to put a candle in Hubby's frozen custard. His Ribeye was a thing of well-marbled cholesterol-ridden beauty.  My big problem is the noise. Without the booths separating the patrons it's absolutely  impossible to have even a modicum of privacy or avoid the conversations of your neighbors. Not that I minded hearing about the new dog, but the marriage problems from the other side were a decided non-enhancement to the otherwise delicious meal.", 
    "review_date": "2014-04-01"
  }, 
  "ZTptQ-2dpmHjSt43g0JnzQ": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Shannon G.", 
    "review_text": "I went on a Sunday to try out the newest version of this restaurant. I really love the neighborhood, so I was really hoping for the best. Unfortunately their website has the wrong hours, so when I went there Sunday afternoon, I was told I had to wait two hours to get an actual meal. I pointed out the problem with the website (showing it to the manager with my phone) and I was assured they would get it fixed on Monday. That was a month ago and still no changes. I was told by the hostess that several people had come in with the same problem, wrong hours. Since I'd traveled a hour to get there, I decided to have a couple of snacks at the bar and try to fool myself into thinking it was a meal. The fries were really unremarkable and the second dish I don't even remember, though I do remember being underwhelmed. Definitely left with a bad taste in my mouth.  So take this as less of a message about if a regular meal would be good, and more of a warning to people going during weekends, the kitchen is closed in the afternoons. Also to the staff of the restaurant, PLEASE put the correct hours on your website.", 
    "review_date": "2013-11-20"
  }, 
  "6NpP6p_h8ueGRbtQ2qBd-w": {
    "user_rating": 5.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "D B.", 
    "review_text": "My friends had been telling me to come here since the remodel, etc.  I finally made it.  I never came here in its previous life, as I am not a 'diner' person.  No problem now - it doesn't feel like a diner at all; it feels like a comfortable, classy restaurant you can have a good business lunch at.  I loved the choice of materials on the interior, particularly in the bathrooms with the mix of tiles and woods.  We all ordered the 'chicken noodle' soup and it was hands down the best soup I have ever had in my life.  Nearly one of the best meals I have had.  And I don't like chicken.  The house made noodles, seared brussel sprouts, kale, and excellent broth were a winning combination served in my favorite Heath bowls.  My one complaint would be that it was actually too much food.  Classy, professional, unobtrusive service.  I will definitely be back again.", 
    "review_date": "2014-02-28"
  }, 
  "WcnnhT_FxKGop-W2mYnprQ": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "C E.", 
    "review_text": "Love this place!! The new look is exactly what this place needed while keeping some of the charm. Brunch is fun and the food is good.", 
    "review_date": "2014-04-13"
  }, 
  "lNFD3AhH-vqh893vbUpO0g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony N.", 
    "review_text": "The burger, a staple of any restaurant, left much to be desired.  The vegetable dishes and apps were OK.  The cheese crisps ended up being overpriced Chez-Its.  The only thing that saved Fog City from the being completely consumed by the storm were the service, atmosphere, and the cocktails.", 
    "review_date": "2014-05-08"
  }, 
  "ZSqMkleQk2l1_KRhSlYnfA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deb B.", 
    "review_text": "I have been here twice now, once with friends and once when I was a alone while my BF was away for a weekend.  I experienced booth service and bar service; the restaurant was busy both nights I was there.  I had a great service experience with my first server Diana ( i had to ask her name because I loved her so much)   I have to admit that both times I had the cheeseburger and fries.  Both are delicious.  I often complain about potato preparation here in California because I am from potato country- ND.  The burger is like a really amazing fast food style burger- thin patty, the perfect toppings and a soft bun.  Only cooked medium-rare, but it doesn't matter.  I you love thick burger's this is not for you.   Personally, I like the renovation, it is definitely different and I like seeing the whole restaurant while dining. I had eaten at the old Fog City and did enjoy the food but had a bad service experience, so for me this is much better. Thanks for making a burger and fries that I love! And the drink menu is tasty too.", 
    "review_date": "2014-03-13"
  }, 
  "snI32nf_QziTT1Tk9DgapA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole H.", 
    "review_text": "Amazing! can't believe I've lived here for 6 years and had never tried this place. Great food, great wine list, and amazing staff and service. Kampachi crudo was amazing and their cocktails are delightful. Don't skip this place!", 
    "review_date": "2013-12-29"
  }, 
  "XX5G1gpBLzv-oXJGlRvfoQ": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Maggie F.", 
    "review_text": "Amazing. I've been raving to anyone that will hear me out about this restaurant since I was here recently.   I've never been to the diner that was before the restaurant was remodeled, but I'm super glad it was revamped!  The food here is all family style, though some of the dishes might come out smaller than the others and some are a little more massive.  There was 6 of us for the evening and here's what we ordered:    Snacks:  - Hand-cut Furikake Fries Garlic Aioli - Brussels Sprouts Asian Pears Ponzu (This does come with fish flakes, those ones you find on takoyaki, so veggies beware)  Veggies: - King Oyster Mushrooms  Seafood:  - Kampachi Crudo (this was definitely on the smaller side) - Wood Oven Clams  Meats:  - Wood Oven Whole Chicken (we got 2 of these) - Berkshire Pork Cheeks  Everything was pretty delicious.  Highlights were definitely the meats.  The Pork Cheeks were super soft and just melts in your mouth delicious.  And the Whole Chicken!!! I couldn't rave more about them.  Its boneless and so juicy and tender, it puts any and all other roasted chicken you've had to SHAME!  If there's only 1 thing you would order here, FOR GODS SAKE ORDER THE CHICKEN!!! It is so good.  This place also has an amazing bar with a great range of whiskeys and cocktails.  But most importantly mocktails for the littlies or designated driver.   This place is also kid friendly and is large enough to easily accommodate for large groups.  Though make sure you book ahead.  This place gets very busy and would be hard to get seats without a booking.   Oh yeah and order the chicken!", 
    "review_date": "2014-01-16"
  }, 
  "dl8Zxx9BKUFErcA5usaoHw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia L.", 
    "review_text": "I went here for lunch and I didn't realize you needed a reservation. Regardless, we sat what they call a community table. It's basically one long table (like at the bar). I was okay with that. I ordered the burger. It was juicy and yummy and the bun was not soggy at all. My husband ordered the smoked salmon smorrebrod.  He really enjoyed it. We didn't care for the hand cut furikake fries. They were just all right. When we first placed our ordered, we ordered 4 dishes (burger, salmon, fries and their brussels sprouts).I was a bit disappointed that all our food came and by the time my burger, my brussel sprouts finally came. Keep in mind, there was a family a table over that orderd after us and they received their brussel sprouts before me. That was a bit let down for me. Will I go again? Probably not. It was okay. I can say I finally went after their remodel.", 
    "review_date": "2013-12-09"
  }, 
  "r9O55r3TFzm_Sjc-E5jK9Q": {
    "user_rating": 3.0, 
    "user_location": "Red Bluff, CA", 
    "user_name": "Michael P.", 
    "review_text": "Try their Mac n Cheese!", 
    "review_date": "2014-02-11"
  }, 
  "U4INQZOPSUaj8hMjLlZ3KA": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Michael U.", 
    "review_text": "Items Selected: Warm Old Fashioned Doughnuts - Sugar Dusted Aaron's Buttermilk Biscuits - Strawberry Compote Fog City Hot Brown - Roasted Heritage Turkey, Country Sourdough, Mornay Sauce, Nueskie's Bacon, Roma Tomato Brioche French Toast - Yerena Farm Strawberries, Maple Whipped Cream, Shaved Almonds  With the meeting adjourned for lunch and several hours of digestion aided by Moscone Center coffee now behind me it was up the Embarcadero that I again marched and this time traveling farther north than usual it was just past one o'clock when I sat down at Fog City, a gregarious middle-aged gentleman with a sweaty brow providing Michelin-quality service to myself as well as patrons both inside and out during a nearly 75-minute brunch.  Seemingly understaffed at the front-of-the-house while a team of five manned the open fire oven and stoves in the kitchen it was with one famous dish on my mind that I entered Fog City but featuring a recently renovated brunch menu promising several personal favorites my order instead unfolded in three parts, an opening duo of cinnamon-sugar brioche donuts a touch too bready while flaky golden biscuits varnished in sugar and butter proved exemplary.  Moving onward to the original object of my desire it was after a nearly thirty minute delay that Fog City's riff on the Louisville Hot Brown arrived and gussied up with artisan touches as only The Bay Area can do suffice it to say that it puts J. Graham's original to shame - a bubbling pot of creamy Mornay smothering tangy sourdough and smoked turkey with a crown of crisp bacon and lightly griddled tomatoes added straight from the pan.  Clearly unwilling to pass on dessert it was with a small menu of frozen custards, crullers, and shortcake that I was presented and although the later featured the strawberry finale I desired so did the brunch menu French Toast, a buttery trio of triangles so saturated with maple-infused custard that the interior was nearly liquid beneath a crunchy golden coat ready to be dressed in even more maple, whipped cream, and lightly reduced berries that made me wonder not only why more has not been said of this dish but why anyone would sell themselves short with the shortcake.", 
    "review_date": "2014-06-22"
  }, 
  "CjEIOODtdG2yloVWGmraOg": {
    "user_rating": 2.0, 
    "user_location": "Huntington Station, NY", 
    "user_name": "John M.", 
    "review_text": "Well...  I came here over 20 years ago and while I don't remember anything about the place, when I came across it a few years back, I had an awesome time. A perfect hamburger unique to how I ever had it and a bonus of a Stoli O with 7. Yum. So of course the next time I came to SF I was so looking forward to recreate. And then the big disappointment that it had closed down. Today by chance I drove by and to my delight, they're back!!  I couldn't wait for my perfect cheeseburger. DONT BE FOOLED BY THE NAME DINER.  This is by no means a diner. I say they revamped into a swanky hip chic loud restaurant. Really not a place my kids would like. In fact I found it hard to find anything other than a hamburger that I would order. I wasn't ready for duck at a \"diner\".   Well here's the sad fact. The burger, well, umm..I didn't enjoy it at all. I've had better at 5 guys or even sonic. Nothing special. I feel bad that a place I once revered is now nothing but a memory. Perhaps if I have a different mindset going in and want to not have a conversation with my company, I'll try it again. Just maybe but not likely. ,", 
    "review_date": "2014-12-09"
  }, 
  "7Aoc10uCOU9utZ0HV6gABA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pearl L.", 
    "review_text": "The wood oven chicken is mouth-wateringly delicious!  I would go back just for the chicken.  It arrives on a cast iron skillet, and the waiter very nicely cut it for us.  The meat was so tender, I think he just used a butter knife!  The skin on the outside was crisp and perfectly seasoned, and even the white meat was incredibly juicy and tender.  The dark meat was sooo rich, it came close to achieving the umami flavor usually only obtainable by red meat!  I also think Fog City in general is a pretty good deal for the portion size.  The whole roast chicken is only $34 compared to Zuni's $48.  The butter lettuce salad served 2 generously and could have served 3 or 4 adequately for around $10.  $7 for \"snacks,\" like the rich, slightly tangy deviled eggs or brussels sprouts seems totally fair to me since most are healthy sized and require thought and consistent preparation.  Finally, get the milk punch.  It's smooth, beautiful, spicy, and fascinatingly creamy in taste while crystal clear.", 
    "review_date": "2014-02-11"
  }, 
  "kUSYOi3eLzOfxhlwbE2UFg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leah A.", 
    "review_text": "Went to the newly reopened, but completely changed, now named Fog City but use to be Fog City Diner.  Have to say, I'm not impressed.  I was really excited to try Fog City but walked away wanting more.  Pro's - Remodel looks great!  Great décor, nice feel. - Wine list looks good, came for lunch so couldn't partake since I had to go back to work :(  Con's - Food-  there was nothing on the menu that I was super excited to try.  I have to say I wish they would have left a few of \"Fog City Diners\" best on the menu, like the mac n cheese, mmm.  Plus what we did order didn't wow any of us.  From the Saigon sandwhich to the filet of sole (with burnt brussel sprouts), we all left thinking eh it wasn't bad it just wasn't particularly good either. - Service was SLOW, I get it their busy but service was definitely lacking.  We had to remind our server several times for our drinks, condiments, etc.  Overall I think I would return for cocktails at the bar, maybe with an order of their fancy French fries but not for another meal.", 
    "review_date": "2013-11-26"
  }, 
  "ve79_AjkbLemDoZHL7AiVA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "B. S.", 
    "review_text": "We arrived early for our reservation, so we were able to enjoy incredibly-priced happy hour oysters!  The best I've ever had for just $1.50 a pop.  Also, a scrumptious Moscow Mule.  We ordered lots of I different plates.  The best were the short-rib tacos with kimchi, the beets with crème fraise, deviled eggs (works of art!), and the lamb satay.  The only disappointment were the orange-glazed crullers.  They were sort of burnt on the outside and doughy on the inside.  Worst donut I've had in my life.  Note to cook--your oil wasn't the right temperature.", 
    "review_date": "2014-11-29"
  }, 
  "ql-JNHMqpseFUbB6p-b-sg": {
    "user_rating": 5.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Ray C.", 
    "review_text": "Ahhhhhh Fog City...... Everything about you I should hate, but I don't! The wife and I had an amazing time! Great food, fresh new look, amazing cocktails! Whats not to like???", 
    "review_date": "2013-10-10"
  }, 
  "xcb2-yMQbrjkSnhrzdGssQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gary l.", 
    "review_text": "$17. hamburger review . . .  You would expect a patty larger than 1/4 lb. and gee, you might even expect it to be cooked the way you asked for it.  When the waiter asked how it was I said that it was overcooked. He explained that it was a burger that was \"a tribute\" to fast food burgers.  No apology.  This burger was a tribute to a turd.  I don't know about the rest of the menu but I would steer clear of this item.", 
    "review_date": "2014-04-21"
  }, 
  "JO3vGw-PuagZMXOzl84BmQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa M.", 
    "review_text": "I really wanted to love the new and improved fog city, I used to eat there growing up in SF! It looks beautiful and the menu seemed interesting, if not overpriced and a bit unfocused. My mom, brother and i shared a salad and for our main my mom and I asked to split a burger and my brother ordered pork cheeks. The burger (14$ and not a lot of meat!!) came on a piece of wood with no sides and with 4 toothpicks in it. Strange to begin with...but then we sat there with our burger in front of us for 15 minutes being polite before my brothers entree came! We complained to our waiter since our burger was cold at that point and he said, \"oh, you're meant to share\". Hmm ok. So you want me to slice a burger into thirds at the table and share it?! Weird. The manager gave us the same response too!! Since when is the customer wrong?? In the end the food was pretty good, but the strange \"share everything\" (thats not prepared to be shared!) and the bad attitude of the staff will keep us from coming back :(", 
    "review_date": "2013-10-11"
  }, 
  "PxkCVu2T4_g--oFKAyOmig": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Allie A.", 
    "review_text": "I loved the newly designed diner!   My husband and I thoroughly enjoyed our meal and entire experience.  We will definitely be back next time we are in town.", 
    "review_date": "2014-08-21"
  }, 
  "NOXtQrk0YqOt5QlYN3X2Rg": {
    "user_rating": 2.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Tim B.", 
    "review_text": "I visited Fog City on Sunday, October 13th, for the first time since the renovation. I had been to the original Fog City Diner (or, as  Phil Frank put it, the \"Fog City Dumpster\" :-D unfortunately, those \"Farley\" comics which used to hang prominently on the wall near the bathrooms are no longer there) a few times and absolutely loved the ambiance and the food. Unfortunately, I cannot say the same for the revamped Fog City. I admit that this review is in part jaded by my instinctual comparisons between Fog City and the Fog City Diner, but perhaps it will still help someone.   First, the ambiance. I'm old-fashioned and loved the Art Deco look that the original Fog City Diner had. I knew that the interior had been remodeled, but even still, I was disappointed to find how radically different it was. I would use the word \"trendy\" to describe the interior now...the look may age well and it may not, but it felt like any other \"modern upscale\" restaurant that I've set foot into. Again, I really liked the charm of the old Diner, so your experience may be different, but I found the new look to be bland, unoriginal, and unimpressive. Also, while this may have been in part because the place was fairly busy, I got the impression from the gentleman at the front desk that, as a single diner, I was tolerated rather than welcomed. At the same time, the waiter treated me very well. It's also worth noting that the place was very noisy, with people packed very close to one another...as a single diner who generally likes to concentrate on a good book while eating, I didn't like this, but this could be a positive point for some.  Now, to the meat of the matter...the food. I'm about one of the most predictable people you'll ever meet; if it's available, I'm ordering a plain cheeseburger and fries (and, if it's not available, I'm usually not eating at that restaurant). After placing my order, the food came surprisingly quickly. The fries were good for the most part...nice and crispy, and the seasoning was okay, although there was something in the topping that almost tasted fishy; I can't really put my finger on what it was. The burger, however, was a bit of a disappointment. I wouldn't say that it was bad, but for the price, I expected something more. I think the kitchen changed their source of beef; I was impressed by the burger at the old Fog City Diner, and I'll admit that that expectation may be part of the source of my disappointment. But, the beef was all but tasteless, and seemed to be swimming in the cheese.  Finally, I should say something about the price. The menu listed the burger at $14, which isn't unreasonable. However, I was surprised when I received the check and found that the fries were a separate menu entry, for $6! I had assumed that the fries came with the burger; that's my fault for not double-checking...but, what used to cost maybe $18 is now pushing $30, for what most would consider a fairly basic meal. Note that that price doesn't include a drink; I generally only drink water (teetotaler and I don't like soda). Given that, and that my food orders are generally less expensive than that of others, I think rating this restaurant a \"3\" on the Price Range is more than fair.  In conclusion, while the waiter did a great job, I was underwhelmed by the front desk, and while the food was not awful, I don't think it was a good value at that price. So, especially considering how many options there are in the immediate area, I regret to say that I don't think I'll be returning to the place that used to be my favorite spot to eat in San Francisco. I imagine that there are many who love the revamp, but I'd really like to see the return of the original Fog City Diner!", 
    "review_date": "2013-10-15"
  }, 
  "vH4ac_IkrPtVyBP-i0GTBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "melita s.", 
    "review_text": "Interesting decor; definitely a different feel from fog city diner (less warm, more sophisticated).  Service was solid, and the bartender was very accommodating of our requests to taste several of the wines on tap before making a selection.  Food was actually quite good, although on the pricey side.  I would recommend the fries and deviled eggs.  The fig salad and trout were both tasty, but I've had much better versions of both for considerably less.", 
    "review_date": "2013-10-23"
  }, 
  "Z-4Ow2j7kRPyUMuxsebmvQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Klondike B.", 
    "review_text": "Disagree with 3.5 stars. Been here twice.  Both times very good. The second time was more like 4.5 stars. Among other excellent dishes, we had the wood oven roasted chicken, prepared in an iron skillet. I'd say this was one of the best dishes in the city. Hope they keep that one on the menu. Loved the atmosphere, location, service. Good stuff all around.", 
    "review_date": "2014-05-03"
  }, 
  "OZE_X5_bUbEmFpiewqfi2Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jonathan c.", 
    "review_text": "missing landmark..    wanted to love the re-design so very much.  I tried.  must admit food is pretty good, and I'm sure they genuinely believed this iconic diner could be improved.  but it sadly lost it's soul.  prices went up, bathrooms got fancy,  history erased.  I'll cherish my memories of hungover brunch with my sweetheart, and washing it down with the best (no longer avail) chocolate malt money could buy.  RIP fog city DINER.", 
    "review_date": "2014-04-07"
  }, 
  "DhIw6ihlO7u_wvKMMNqvTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie M.", 
    "review_text": "good food and view yet with limited options", 
    "review_date": "2014-02-15"
  }, 
  "5movf4njIHTuBOl9zNX7Iw": {
    "user_rating": 2.0, 
    "user_location": "Newton, MA", 
    "user_name": "Jonathan W.", 
    "review_text": "Disappointing, after the charm of the old fancy diner.  I'm sure they're getting a lot more business now, but I suspect this will deteriorate before long.  Seemed like they tried to create something derivative of nearby Piperade or Park Tavern, but without good food, professional service, or unique ambiance.  If they fix the menu it could take a step up... lots of great concepts and ingredients, combined in the pathetic ways.  For example, the beef tongue meat itself was lovely, but being doused in bacon and balsamic, it was ruined.  Needs some class.", 
    "review_date": "2014-03-13"
  }, 
  "Fg7AGfgmEnBrbIglch9eaw": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Bob T.", 
    "review_text": "I hadn't been to Fog City in 25 years, then  heard recently that it had been remodeled.  Last night was surprisingly balmy so it occured to me it might be fun to meet a friend there to check it out.  Because of the weather, we took an outside table with the intention of going in to check out the new decor before we left.   The waitress and hostess were efficient and nice and we ordered the brussels sprouts, beets, deviled eggs and butter lettuce salad to split.  It was delivered by what appeared to be the manager - a 50ish guy who let me know with a well-practiced sneer that he wouldn't be bringing me the salt and pepper I requested.  Sure enough, he blew off my request for condiments and we got flavorless sprouts, beets, eggs and salad - needed some tabasco too - from an ungrateful \"mgr\" that will never again overcharge me (with wine, over $100) for mediocre food.  Tourists:  check out Tadich, Big Four, il Fornaio (around the corner) and/or any of about 100 (no kidding) tasty, fun and service-oriented restaurants within walking distance from this trap.", 
    "review_date": "2014-05-14"
  }, 
  "B56OgCiDdS7ilyl7afcJtw": {
    "user_rating": 5.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Heather G.", 
    "review_text": "I was a little worried about this place as when you get in they tell you that you probably want to share appetizers (sort of tapas).  I was with a large group and had already looked at the menu and knew I wanted the steak...(was sort of worried I would have to share that and I don't like sharing my dinner LOL).  We all started off with appetizers, cauliflower nuggets - AMAHHHZING... Quinoa deviled eggs - DELICIOUS... Grilled asparagus - eh.. It had UFOs (Unidentified Food Objects) on it so I wasn't a fan (and it didn't seem grilled) Cheddar bites - more like gourmet cheez its... But tasty.  Regular bread, nummy... So I did order my Rib Eye steak and to be honest, I don't usually like steak unless my hubby BBQ's it for me...  This steak was heaven, no joke delicious and cooked perfectly.  Argula and fingerling potatoes as sides, nom nom...  Hubby had the wild boar ribs and they were small but a big portion and super tasty!  People were asking left and right for tastes...  The chicken was super moist and oh so tasty...  I heard the pork chops weren't cooked good but when they came back they were better but just okay.  Beer and wine, great selection.  Dessert - nom nom nom...  At first I thought who is putting donuts on their dessert menu?  They were delicious as was the frozen custard with the strawberry topping.  If you are into Affogato or however it's spelled, you will like it here according to some tablemates...  Can't wait to go back and get another steak and cauliflower bites - Who wudda thunk I would enjoy a vegetable so much I would mention it more than once in a review?", 
    "review_date": "2014-05-30"
  }, 
  "mze2Sa7eFZbxU9zE2o-jBA": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kathleen A.", 
    "review_text": "It's not that the food isn't good. It's not that I miss so terribly the Diner of Fog City. It's that it's been more than six months since my last incident, and I regret the discrimination experienced at a restaurant at which I used to LOVE to dine.   Imane served my husband and me a delicious meal of Eggs Benny. However, our enjoyment was tarnished by the apparent racism in the initial seating, and for that reason, we will not be returning. Although first in line when the restaurant opened this morning, we were walked to table #28, the one right in front of the register with a poor view, foot traffic, and inevitable endless conversation by the staff that gather there. The restaurant was not remotely full (and wasn't when we finally left), but when we asked to be reseated to a similar table two chairs away, the gentleman who seated us said, \"I'll have to check. The host assigned this table specifically.\" As he walked away, a White couple who asked to be reseated out of the same section was immediately offered a booth, no one checking with the host first. We indeed received a new table (not a booth), and soon thereafter two Black women were relegated to the table we just vacated, suffering the same push back when asking to be reseated: \"I'll have to check.\" They were offered the booth by the door, a slightly better but by no means top choice location.  I hope that in the future, not only will the worst tables in the restaurant be reserved for final seating when Fog City actually is full, but also that there is more sensitivity to patterns of behavior such that they might be self-regulated. Diversity or anti-bias training perhaps?  I used to enjoy Fog City Diner every other weekend when I lived in San Francisco and never experienced such indignity. I hope service can return to those days ... although I won't be returning to find out.", 
    "review_date": "2013-11-02"
  }, 
  "ruYZyeZmcXZXmaQZpUXQ3w": {
    "user_rating": 2.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Paula G.", 
    "review_text": "Boooooooooooo. Burger was nearly as good as In N Out but 4x the price. Cocktails were good though, so I'll stick to boozing next time", 
    "review_date": "2014-01-17"
  }, 
  "2KJeI4NWyfSbTXnEGc0qiw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shimmerSF M.", 
    "review_text": "We were surprised by the lack of comfort food options.  We used to love coming here before the renovation, the previous menu and service were classic.", 
    "review_date": "2014-01-25"
  }, 
  "fZP1xM8h3ev2zeVAYHN3cg": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Aly H.", 
    "review_text": "Great service. Really delicious smoked salmon + kale salad. Issues: they charged us for bread and they were out of hamburgers... What diner runs out of hamburgers at 2 pm? I do like this place though!", 
    "review_date": "2013-12-28"
  }, 
  "9QITXadhXwFd08ZO1sNnJg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Julie S.", 
    "review_text": "I love the new Fog City.  The décor is beautiful and the food is great.  I highly recommend the Kampachi Crudo and the Berkshire Pork Cheeks.  The service was great except for the hostess, who was a bit surly.  We'll definitely be back soon!", 
    "review_date": "2014-01-23"
  }, 
  "iQhuapjBn0RlVc_1TAPZlg": {
    "user_rating": 1.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Janelle M.", 
    "review_text": "Our waiter could care less if he attended to us. We seemed to be a bother to him. My flounder was a small piece of fish the size of my hand, the few brussel sprouts sprinkled were too charred that they flaked like a burnt piece of paper and I was told that's how they come.  My husband's hamburger was oversalted and neither meal was worth the price.  I don't mind spending money for quality but it just wasn't there.", 
    "review_date": "2013-12-10"
  }, 
  "dfNos8n_vBmUS34OFgPrbQ": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Matt B.", 
    "review_text": "Great food, great people, and great atmosphere.  I am particularly in love with the Burger.  I've gone to this multiple times just for drinks, just for dinner, and for both.  The food really fits the setting and I'll continue to go here when I can.", 
    "review_date": "2013-12-01"
  }, 
  "wpEs0WjOpHL0ZdUnSg3F0Q": {
    "user_rating": 1.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Carlos S.", 
    "review_text": "What was once a favorite restaurant of my girlfriend and I has disappointed us. We use to make this our anniversary, birthdays and when in town restaurant. With the lack of charm that it use to have even beautiful inside feels kind of cold. The true disappointment of the night was the menu! Unfortunately nothing left of the original menu and lack luster of \"entries\" I don't think you can call $15 burger that looks like it came from Carl's Jr. a meal. Sadden by this what was a restaurant visited for more than 5+ years will not have our business again. Quick tip: If it's not broken don't fix it. Maybe it's a new owner and trying to follow in footsteps of other restaurants around but the sad part it's no longer original.", 
    "review_date": "2013-09-27"
  }, 
  "dcjrPcU-q7sxF0L_E1YqdA": {
    "user_rating": 4.0, 
    "user_location": "Twinsburg, OH", 
    "user_name": "Melissa L.", 
    "review_text": "Stumbled upon Fog City on our way to climb the stairs to Coit Tower (god help me).  Sat at the bar and ordered a Moscow Mule, which was very good.  Decent vibe and the menu looked good. Had we not just left Reds Java House (awesome burgers), we would have stayed for lunch. I obviously survived the stair climb to Coit Tower, if you were wondering.", 
    "review_date": "2014-03-18"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "Oh my, I can still remember when this place was called Mildred Pierce's way back when I was a poor assistant media planner in an ad agency near the Levi Plaza. I believe that was sometime after Pearl Harbor and before my last memory lapse. Then it became Battery Point for a minute and then changed identities again around the mid-80's to Fog City Diner. Believe it or not, it used to be a trendy place to go, although the retro-diner vibe became so commonplace and the menu so misbegotten with its festering Mexican and Asian small plate selections, that it finally sputtered into oblivion last year. I don't think I even made it over there in over a decade, and even in its new guise, I was hesitant to go until a food blogger raved about how good the food was.  Fog City? Really? Chef/owner Bruce Hill has indeed dropped the Diner part of the moniker and now it's simply Fog City. The place looks much more sleek and contemporary with dark wood accents but still with the windows facing the splintered traffic flows from Battery and the Embarcadero. The horseshoe bar is most inviting, but Jamie W. and I were here with another couple to see if Michael Bauer's enthusiasm was justified. I started with a refreshing cocktail, the $10 Daredevil, a tantalizing, old-school mix of Campari, ginger beer and lemon (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1yTKg0b&amp;s=06cd1c07f529594158d0c348094289c7800e4db42095ac98721982c384d84a59\" rel=\"nofollow\" target=\"_blank\">bit.ly/1yTKg0b</a>). We then shared a couple of no-risk options - the $7 Blistered Summer Peppers (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1AtUgjs&amp;s=4405686d55b5eb94a671d71115d39a425f96e7cce5b3e3fd76c917274f261200\" rel=\"nofollow\" target=\"_blank\">bit.ly/1AtUgjs</a>) and the $8 Deviled Eggs (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FXwKlf8&amp;s=8447a00f21712fb5d823c96413cdea5eab16a74a6323a98dcd2b61b57b726e3e\" rel=\"nofollow\" target=\"_blank\">bit.ly/XwKlf8</a>).  The peppers were mostly shishito and nicely roasted, while the quartet of egg halves were filled with yolks richly creamed with grain mustard and topped with crispy quinoa beads and a shard of bacon. Both starters gave a clear indication that the Fog was back, and it was full steam ahead. Entrees were all quite good, but two really stood out. Luckily I ordered the best one, the $35 Wood Oven Whole Chicken, which had me initially hesitant that the portion was too big. Alas, leftover chicken at home is fine by me, so I proceeded with the humongous, butterflied poultry that was laid before me in a piping-hot cast-iron skillet. It was in good company with whole fingerling potatoes, lightly smashed and heavily buttered, along with Brentwood corn on the cob, crisp bacon bits, kimchi butter, spiced salt and mixed greens (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1uQoX1X&amp;s=72aafd8ca4bcb7311f78f005ece85c8649e550dbac953baee9c6124ef4a6986a\" rel=\"nofollow\" target=\"_blank\">bit.ly/1uQoX1X</a>).  The chicken was moist and tender with the skin crisped and smoked to an ideal state. It's almost as good as the roast chicken at Zuni Cafe, and you don't have to wait quite as long. Second prize went to the $31 Oak Grilled Pork Chop, quite a hefty, juicy bone-in slice that sat on top of sweet corn polenta, spicy collard greens and farmers' market stone fruit chutney (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1rQRJKS&amp;s=defdd22b6ff845abdfa63a89a6c9f75659f685d7669e6e60627cdae027ecdbfa\" rel=\"nofollow\" target=\"_blank\">bit.ly/1rQRJKS</a>). Richly delicious. It was inevitable that the other two dishes paled by comparison. The $25 Wood Grilled Swordfish was tender, seasoned well and pleasing as it was nestled on top of a bed of roasted vegetables (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1pDqNzE&amp;s=9539d0a96ec4b805e81c6f731f1a73806fcd17c5b5f37cd72d32c0e95984cf2e\" rel=\"nofollow\" target=\"_blank\">bit.ly/1pDqNzE</a>), but overall it was a bit bland and vanilla in execution. The same could be said for the $19 Spice Roasted Wild Boar Ribs.  They were a bit arid-tasting with just a dry rub seasoning and rather lonely with only the pickled celery, jalapeño, carrot and honey slaw to keep them company (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1mfNF3J&amp;s=9ee90d9cd5a02acab59db100dbc684e3d1c5bf59ac59549df54ee733c4eb7799\" rel=\"nofollow\" target=\"_blank\">bit.ly/1mfNF3J</a>). All of us were moving gradually into belt-loosening mode, but we knew we had to try at least a couple of their desserts. First up was their signature $6 Fog City Frozen Custard made with Straus Dairy cream. Tahitian vanilla bean was the flavor of choice and it came on top of a glazed French cruller with a dark chocolate sauce for an extra $2. But the winner was the $8 Strawberry Shortcake, a creamed biscuit topped with seascape strawberries and brown sugar-infused whipped cream (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FVBlNzr&amp;s=d77eb04f3a38be336034881aa30a987d188231a30264891acf9e99f1a4736908\" rel=\"nofollow\" target=\"_blank\">bit.ly/VBlNzr</a>). OK we're done now. Full. The Fog has lifted back to its original state of culinary grace.  FOOD - 4 stars...back-to-basics American done up with flair with the whole chicken a major standout AMBIANCE - 4 stars...much more chic and relaxing than its previous iterations with roomy booths and scenic city scene views SERVICE - 3.5 stars...much more cordial than they were in the Diner days TOTAL - 4 stars...reinvented American bistro proves you can go home again", 
    "review_date": "2014-08-18"
  }, 
  "GvIyQN4UQUHxgBt6Ktdmnw": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Marquis K.", 
    "review_text": "I've been to Fog City Diner a bunch of times, and a few times just recently.  I don't think I've ever had a bad experience here, and now that it's remodeled and has a great new layout/floor plan, I love it even more.    This last time I went, everything was so good, and our waiter, Mario, was pretty awesome, so I told him I would make sure to give him a great review on Yelp... heh.  Mario was extremely friendly (without being over the top), and made great drink recommendations (take his advice!), and was really on top of making sure everything was great.    On top of that, I've never been disappointed with Fog City's Bloody Mary (aka, the Bloody Devil)... it's SO GOOD!  I think it's weird that when it comes to deviled eggs anywhere else, I pretty much skip over them, thinking \"Oh, old people food.\"  Yeah, not so much at Fog City... they're so ridiculously good, I literally ate 4 of them, as well as 2 more that topped the Bloody Devils I ordered.  I think I'm addicted now.  My only (mild) complaint is that I wish they had a slightly larger brunch selection, but I can't even be upset about their limited menu since everything I've had from it (and they change it semi-regularly, it seems) has been incredible.  So yeah... Fog City Diner is incredible, and if you can manage it, ask to be seated in Mario's section.  He'll make the experience even better.", 
    "review_date": "2015-01-09"
  }, 
  "gjfcfzrYZ0O1xINHtnQKiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "I must have passed this place a gazillion times and never gone in thinking that it was for special occasions.  Thus, I was glad to be surprised by the level of comfort provided by the food, staff and restaurant.  Although the oysters brightened my evening, the pork chop was the most tender and flavorful piece of meat that I've had in a long time.  Of course, I ended on a sweet note with their pumpkin brioche bread pudding with frozen custard.  Service was exceptional with their recommendations, friendliness and patience.  I'll be sure to come back more often.", 
    "review_date": "2014-11-09"
  }, 
  "F9Oe29UmuEeKTOxgDGCgEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth Q.", 
    "review_text": "Went for lunch in order to try out the new, improved Fog City.  Have been to the  previous Fog City Diner many times and always liked it.  It had a good vibe and still does.  Ordered a Something Vodka and a Hot Brown.  Both were delicious; however, what really got my attention was the waitress and the exquisite service.  It was top notch and beyond expectation.  Yeah, $18 for an open-faced turkey sandwich is rather over the top, but so are most things in SF.  Nevertheless,  an enjoyable experience and will be longing to go back!", 
    "review_date": "2014-02-20"
  }, 
  "5ceueggjlopnvTfUkz-RYw": {
    "user_rating": 3.0, 
    "user_location": "Rosemead, CA", 
    "user_name": "Bic T.", 
    "review_text": "Short version :Overall food was just Ok.. Service was great and decor of restaurant was upgraded nicely was a bar in the middle and open window all around which brighten up the earthly feel of the place . Some items on the menu I feel was on the pricer side maybe due to the tourist attraction nearby .  Location : 2 blocks away from exploratorium ..   My friend made RSVP for 11:30 right when they opened so the place was pretty empty, even for Saturday morning brunch. The table was ready and set up for three of us next to the window looking out to the street ..u may request for table looking out to the Pier but there not much to see other than the new construction site on the pier.  Food:  Hand-cut Furikake Fries, Garlic Aioli   Original with a Japanese twist .. With flakes of seaweeds and Bonita. Liked.  F O G  C I T Y  Burger: my friend ordered it.. She enjoyed it .. Nothing extraordinary, but good juicy Burger .  The Spaceman : an non- alcoholic drink with Pomegranate, Lime, Honey, Tonic.. It was a pretty and sizzling drink . But I thought it was a bit pricy 6$ for non alcohol drink.  Panorama Bread: come in 3 piece.. It sourdough bread .. crispy on the outside and soft inside but for a  hip and modern restaurant I would expect it to be complimentary instead of charging 3$ for each piece.  F O G  C I T Y  Hot Brown 18$  House Roasted Heritage Turkey, Pt Reyes Cheddar Mornay Sauce, Crisp Bacon, Roma Tomatoes, Openface on Sourdough Bread.. I just thought it was A -ok.. Didn't have too much flavoring.. Tomatoe was rather bland..And turkey was rather dry. Beacon was only piece I enjoyed of the whole dish .  Would ask them for some hot sauce to add a kick to it .   Service was 5 stars .. Friendly waitress and often come back to check on us . And we did not felt rushed even though we sat there for almost 2 hours .", 
    "review_date": "2014-02-16"
  }, 
  "TpR8-mCpSZMd6VUbqUfMXQ": {
    "user_rating": 4.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Nancy M.", 
    "review_text": "The wait service was very accommodating especially since our party of 7 also had 2 infants.  my dish (trout was delicious.  The swordfish was a bit dry,  Hamburgers were great. the short ribs were tender and delicious. And the lamb wraps were so so. For the most part it was a very positive experience.", 
    "review_date": "2014-11-12"
  }, 
  "3cqNRdls-hrj0V81ExaTTQ": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Mom N.", 
    "review_text": "We had a reservation on a Friday night at 7:30 PM!  It was too loud to carry on any sort of a reasonable conversation at our table.  Yes, the deviled eggs and chicken were good but the noise spoiled the festivities for our holiday party.", 
    "review_date": "2013-12-07"
  }, 
  "Bjz4TBIlyv6SBvYf5IOHBA": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Scott M.", 
    "review_text": "First of all, let me state for the record, although the location is the same and the name is similar, this is *NOT* the Fog City Diner.  The Fog City Diner is closed and gone.  This is a new restaurant called Fog City.  Accept the change.  If you want to go to Fog City Diner, get a time machine.  I'm very happy with the remodel of the space.  Yes, the old building was very cutting edge for its day, but it was really showing its age.  Plus the interior was very dark and not particularly inviting.  I remember people referring to getting a table on the Embarcadero side of the building as being in Siberia.  The new space is very open.  They took out the wall in the middle and opened up the Embarcadero side of the building with larger windows.  Once the America's cup structures are removed, that side of building will have a nice view of the bay.  I'd describe the decor as \"industrial chic.\"  Clean and modern but comfortable.  We've eaten here four times now and have enjoyed everything we've eaten.  Even though they have \"classic\" items on their menu such as french fries and deviled eggs, they are done with a slightly different flair.  Their fries are served with Furikake and the eggs with quinoa and bacon.  Not perhaps what you might expect, but most enjoyable.  The pickles are wonderful!  For entrees we've tried the burger, pork cheeks, chicken, lamb and ribeye.  All were excellent.  Big enough to share if you'd care to.  I will say, however, that the pork cheeks are exceptionally rich.  We had it on our first \"official\" visit when we went a bit overboard with our ordering and it was just a bit too much on top of three appetizers and two vegetable courses prior.  For dessert, we've tried the frozen custard, crullers and panna cotta pudding cake.  All were amazing, but the crullers are transcendent.  We found the service to be excellent.  All of the staff we've met so far have been very friendly and helpful.  I'm not a drinker, but according to the SO, the bar does a great job.  As an aside, the SO dropped by for lunch within the past week without a reservation and although there was a bit of a wait, was accommodated within a reasonable amount of time.  We'll be back.", 
    "review_date": "2013-10-23"
  }, 
  "jdB-eFhvYeJXiazB01AmqQ": {
    "user_rating": 3.0, 
    "user_location": "Hopkins, MN", 
    "user_name": "Terra S.", 
    "review_text": "I would recommend the broccli, very good  The customer service could be stepped up a notch", 
    "review_date": "2014-11-06"
  }, 
  "RJezea2OzJh_L7beCDtlQQ": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Traci M.", 
    "review_text": "Soft opening on September 20 was amazing! Dustin (from Picco fame) is a great choice as CEM (Chief Executive Mixologist).   Come see the beautiful bar, enjoy creative cocktails and extraordinary culinary creations.", 
    "review_date": "2013-09-20"
  }, 
  "Bi9pwJu-wpNU_darEkROaQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jacob J.", 
    "review_text": "The place looks wonderful and is located right next to a beautiful view on the pier of both bridges and the water. The service is absolutely phenomenal and the presentation of food looks great!  However, the recipe and taste of food didn't match the standards set by their location and aesthetics. The menu looked great, but as we got down to the food, there were too many inconsistencies. Sometimes it would be a little too dry, or too salty and saucy, or it felt like the chef forgot an ingredient. It was displeasing.   We still had a great time nonetheless. However, boring food is a 3 star to me. I would wish this place stepped it up, because its seabreeze location to one of the best spots of the pier and its proximity to the Coit Tower make it a great place to take a date out.", 
    "review_date": "2014-11-22"
  }, 
  "PRw12Yx-c-U5UsywjKS1oA": {
    "user_rating": 5.0, 
    "user_location": "Paso Robles, CA", 
    "user_name": "Kathleen S.", 
    "review_text": "I loved my visit to Fog City!   It was my first time there and we were greeted by a very friendly hostess arriving a bit before our reservation.  We sat at the bar for a cocktail and app to wait for our table, but were so comfortable at the bar we decided to stay there for our meal.  Great service, the food was great, loved sharing small plate dishes. A very cool place with a nice vibe - will definitely go there again.  See my complete review of the food with photos on my blogsite at <a href=\"/redir?url=http%3A%2F%2Fwww.delish-dish.com%2Fsteeped-in-history-fog-city-sf-gets-reinvented%2F&amp;s=c35637d4e4ba2995d4066851d778a947bfea1ba63458006983e24fb1f2334b4d\" rel=\"nofollow\" target=\"_blank\">delish-dish.com/steeped-…</a>!", 
    "review_date": "2014-09-24"
  }, 
  "3nPw1uhSLDDhq1YeLrMUxA": {
    "user_rating": 4.0, 
    "user_location": "Tiburon, CA", 
    "user_name": "Lorin S.", 
    "review_text": "Haven't been to Fog City for 15 years, so I was pleasantly surprised to go back and not only not recognize the place but love the new look and ambiance. Food coming out of the open kitchen looked and smelled fabulous. We only had the steak taco and the chicken salad but along with the atmosphere loved it!! Terrific bar tenders and actually the same warm entertaining feeling you get when you are at the sister restaurants Bungalow44 and Buckeye. Will definitely go back soon when in the city!", 
    "review_date": "2014-11-02"
  }, 
  "WzgTJg1cWYsFMCZKLHd8-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa L.", 
    "review_text": "Such an improvement from the previous Fog City Diner.   Great place to share plates.  We had the cauliflower, deviled eggs, roasted chicken and swordfish for 4 to share. Perfect portion. The chicken tasted like Thomas Keller's roasted chicken recipe.  The fish was a little dry, but was perfectly fine eaten with the white beans and cherry tomatoes.  The appetizers, just fabulous. They do charge for dessert if you bring in your own. I think it's $3 a person, or per dessert.    The service is a little slow, and a little forgetful.  But not a complete deal breaker.   Coming back for a date night.", 
    "review_date": "2014-01-04"
  }, 
  "u2InCKrEHxk3CPTO3ig9NA": {
    "user_rating": 3.0, 
    "user_location": "Hillsborough, CA", 
    "user_name": "Randall B.", 
    "review_text": "I hadn't eaten at The Fog City Diner for what had to have been 15+ years--way before a recent renovation in decor and menu. The food, in general, was good, fresh, and healthy, but what ruined the experience was the poor service.   After being seated, we didn't see our waiter for at least 10 minutes and our drinks for another 10 minutes. My wife and I both ordered the salmon which I thought was delicious but proved to be somewhat undercooked for her. When she told the waiter it was too raw for her, rather than offer to take it back to the kitchen and put it under the broiler for another 2-3 minutes, he questioned her taste and told her that this was how the restaurant prepares the dish.   Once he finally took it back to the kitchen for some further preparation, we didn't see him again for another 10 minutes by which time the salmon was cooked but cold, I had already finished my meal, and our mood had darkened.  What we hoped would be a nice dinner turned into a real disappointment.   The food at Fog City Diner was good and there were lots of attractive dishes to choose from. But our waiter seemed overtaxed with too many tables to service, and once there was a little problem, he became irritated and his attitude became really poor.    Maybe we'll try it again in 15 years.", 
    "review_date": "2014-08-03"
  }, 
  "RhUQ1Vz3-bDMLbIGlcyzfA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CJ G.", 
    "review_text": "The new Fog City is a reasonable re-take on Cindy Pawlcyn's venerable establishment, but doesn't yet offer enough to draw city dwellers to the waterfront.  Upon entering, diners are treated to a welcoming, open dining room.  Gone is the jarring chrome; accented with warm wood, the new sophisticated space helps assure diners that they are not in yet another Embarcadero tourist trap.  Having earned his chops at Stars, Aqua, Oritalia, and Waterfront Restaurant, Chef Bruce Hill offers a menu based on live fire cooking and fresh, local ingredients.   Deviled eggs ($6) with crispy quinoa and bacon are a great starter.  Served on a house-made bun with smoked tomato aioli, American cheese, tomato, onion, and bread and butter pickles, the Fog City burger ($14) is a contender for the top ten (OK, maybe 20) burgers in The City.  Served with charred Brentwood corn and crispy potatoes and topped with spiced Maldon salt, the whole wood oven roasted chicken ($24) was good, but not up to the level of Zuni Café.  The French fries ($6) with furikake seasoning and garlic aioli were undercooked and limp--a disappointing side note to an otherwise solid performance.  There is an ever-changing selection of 16 wines on tap, as well as an extensive list of wines by the bottle. With seven beers on tap and numerous other offerings by the bottle, the beer program features artisanal selections, from both local and national breweries.  Service was friendly and well-meaning, but a little off.  Courses were not well paced: entrées arrived before appetizers were finished, and servers were sometimes absent for extended periods.  With a little more innovation on the menu and some investment in staff training, the new Fog City could once again hope to draw City dwellers to the waterfront.", 
    "review_date": "2013-12-31"
  }, 
  "gekp2Z5I4vPGf2NeFnZX2A": {
    "user_rating": 4.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Maria-Elena T.", 
    "review_text": "The 4 of us got a nice comfy booth for 6 for our Sunday brunch. We started with the donuts which were hot sugary and delicious. The kale salad appetizer was a good combination of soft goat cheese, crunchy nuts and hearty kale. The dressing was light and perfect. The oysters were not very meaty but the flavors of the mignonette complemented them perfectly. We decided that the winning main course was the hot brown. And boy was it hot!!! Scolding hot! The $17 chicken soup was great but the roasted brussels sprouts took over the flavor. I would have called it Brussels sprout soup. Two of us got the burger and both loved it. The bun should have been warmed. They said the burger is served medium. But we both agreed it was medium rare. My friend likes it medium rare so that was perfect for him. Our waiter Adam had the patience of a saint.", 
    "review_date": "2014-02-09"
  }, 
  "NgKm99u4c7MH53EVCZhCtQ": {
    "user_rating": 3.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Lindsey A.", 
    "review_text": "I had the Saigon Dip, which was good but I not the best meal of all time. Easy location nice interiors but the prices are very high! A sandwich for $18 is a bit steep and it didn't come with any salad, garnish or fries only broth to dip the sandwich in, the plate looked a little empty. I feel that this place is a bit pricey and the food was just good/ok not mind blowing. There are so many places in the city to eat so I may never come back , or at least I wouldn't make a effert to come back... but if a friend wanted to go or I was starving in the area I would go in again.", 
    "review_date": "2014-11-09"
  }, 
  "M271Ac7UKVaQ9U5AOvc_9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicky L.", 
    "review_text": "Peace, love, brussels sprouts, rapini, ribs, roasted chicken, and ALL THE DESSERTS, especially the panna cotta pudding cake.  Add a side of furikake fries, and you're all set.  Cannot go wrong.  Especially when you're at a place that serves donuts and frozen custard for dessert, duh.", 
    "review_date": "2015-01-24"
  }, 
  "0t-O5--DOfS55A620fO_GA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea H.", 
    "review_text": "I'm pretty loyal to Fog City because it's only 2 blocks from my house :)  I sincerely  enjoy both dinners and happy hours here!    Atmosphere:  The vibe is great!  I've taken several out of town visitors here and they have certainly enjoyed their visit here as well.  The friendly bartenders and hostesses are always very sweet to me.  I've never had to wait long for a drink or to be seated.    Happy Hour:  from 4-6 on Monday - Friday a slight discount is offered on drinks.  I wish the discounts were greater on food and drink here during happy hour, but I get it-- with the wharf nearby and a constant flow of tourist traffic Fog City probably doesn't NEED to offer happy hour.  Drinks:  The handcrafted cocktail menu has something for everyone and the wine list has great options as well.    Food:  The small plate menu changes with the seasons, which helps to keep the menu fresh for frequent visitors like me! There are some great snack options like paprika peanuts, farm beets, deviled eggs, and calamari.  The dinner menu has great options too.  My favorite dinners have been the burger and the short ribs.  Brunch options are available on Saturday and Sunday beginning at 11:30 a.m.  I hope to be back soon to try brunch!", 
    "review_date": "2014-09-03"
  }, 
  "sFuzusspts5lJGREsmAl0w": {
    "user_rating": 2.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Audrey N.", 
    "review_text": "So disappointing. I was really excited to try the new menu. Space is beautifully updated. I was expecting the same of the menu.  I've been there twice hoping the last visit would be better than first one. I had the Saigon dip and the much raved about salmon smorrebrod as well as the furikake fries. All were disappointing. Best items in my meal - Brussels sprouts with Asian pear and panama cotta pudding cake.", 
    "review_date": "2013-11-13"
  }, 
  "ZNX66SIyH8Fq1E1udWT9XA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Kristina D.", 
    "review_text": "The Hot Brown is the best thing I have eaten in my entire life. That is all.", 
    "review_date": "2013-12-17"
  }, 
  "g0QiXdDjT7gtEzsV5VEqaA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Casey W.", 
    "review_text": "We were hungry on our walk to Fishermans Wharf and came across this place. The service was great and the food was tasty. We had the Saigon Dip and the Aioli Burger. Both were super tasty. It was way to warm inside, but it was a nice day so we were able to enjoy sitting outside.", 
    "review_date": "2014-08-15"
  }, 
  "e_pKXqrLvCeFgrU2vc_O_A": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kathy M.", 
    "review_text": "Nice setting, good food but definitely don't let the waiter order for you!!! There were 5 of us and we were served way too much food including 5 crab cakes @ $8 each so 1 of 4 starters was $40. Then 2 salads, 2 vegetables and 2 entrees. It was also strange that he served a 3rd bottle of wine while the 4 of us drinking still had glasses half full. We inquired why he opened a third bottle when we didn't request it and it was taken away. All in all, I would return as the food was tasty however it was an unpleasant feeling to have trusted the waiter and left feeling his objective was perhaps not in our best interest...", 
    "review_date": "2014-12-16"
  }, 
  "0mpTe93g-ENH4mXvkev-jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diane K.", 
    "review_text": "Had to visit this former classic which is just steps from my home. Looks like it will be a winner! Friendly welcome by Tyler and crew. Great, attentive service. Nice decor -- a good-looking redo. The restaurant was packed when we arrived and seemed to be uber-noisy. As the evening progressed, things quieted down, but maybe something could be done to offer some sound buffering. Food was tremendous. Had the deviled eggs (great), the Halibut crudo (nice), the Furikake fries with aioli (ordered a second one, since they were so good), the hamburger (had to -- that was a favorite at the old Fog City Diner -- this one is different, and good), the roast chicken (great), the fig salad (wonderful), and for dessert the French crullers (very good), and the custard with egg caramel sauce (liked the unusual sauce -- didn't taste the custard). I'll be back to try some of the other small plates, that's for sure.", 
    "review_date": "2013-09-25"
  }, 
  "QzPaoBVAshV-aodtcd1A4g": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "melissa n.", 
    "review_text": "We live in the neighborhood and were very anxious to check out the Fog City revamp.  Had a visit on Halloween night and we were not disappointed. I love the redesigned layout of the space. Its cozy and inviting. Love the smell of the wood fired oven as you walk in the door. Everything is open including the kitchen. And its nice to see the city moving by out the large windows.  They have several wines by the glass available on tap. The prices are nice range of \"something for everyone\" in style and price. I didn't have a cocktail, but the list looked pretty inviting.  We ordered the butter lettuce salad with a smoky green goddess dressing. Plenty for two of us to share. It was a very tasty salad. I'd like to put it up against the green goddess salad at Wayfare Tavern. Not sure who would win that fight.  Shared some brussels sprouts with asian pear and ponzu that had been fired in the wood oven. Must confess they didn't last very long. Can't wait to have them again soon.  For the main course we shared the pork cheeks with romano beans and polenta. Pork cheeks were fork tender and just crispy on the edges with a delicate sauce that didn't overpower a thing. Pure heaven in this dish. Creamy crispy fresh and plenty for two to share.  I had read amazing things about the dessert so we ordered the crullers and the frozen custard with egg yolk caramel. I was transported back to college days of a shop that served hot doughnuts to hungry students in the midwest. Only Fog City's had the most lovely orange scented glaze. Fresh, hot and light yet crispy.   The frozen custard was delivered as  scoop in a dish, with a tiny pitcher of caramel on the side. Their salty rich creamy caramel paired with rich frozen custard is pretty hard to beat. Even better when you dip your cruller into each item.  The service was very warm and inviting. I can't wait to go back for another visit. We officially have a new neighborhood favorite!", 
    "review_date": "2013-11-01"
  }, 
  "uu8bm14q7wO4BTeeoZKgdg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Nikki S.", 
    "review_text": "Cocktails and open face sandwiches near Fisherman's Wharf. #sanfrancisco #restaurantreview  Recommend oysters, which come prepared with a cocktail sauce and herbs, and the salmon sandwich with avocado, egg salad and dill. Sandwiches come open face and in pairs. Get two types and split. Fries have seaweed and sesame seed and are perfectly crispy.   Service was subpar, which is why this gets knocked down a half star. 3.5 star rating.", 
    "review_date": "2014-04-11"
  }, 
  "FFLoCgg7ljYV5fkfhpCNMg": {
    "user_rating": 3.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Craig G.", 
    "review_text": "Lovely restaurant. Great decor, wonderful service, delicious thoughtful menu. Then I noticed \"4% SF offset\" added to the bill. I asked the manager. Apparently that is a surcharge added due to the cost of business for being in San Francisco. I have NEVER seen anything like that. If you can't run your restaurant in an area, then don't. It was rude. It was like being charged cover. It would be better to hide that cost within the price of food.", 
    "review_date": "2014-07-12"
  }, 
  "_OWteEa1PTAb2p_tp4Op9Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simcha K.", 
    "review_text": "My hunt for a great SF burger continues, because this was not it. They brag about the unique way it's prepared -thin- but it seems that thin means flavorless. Not that different from in-n-out, except for how the meat was raised, and though that's important to me, the flavor is also paramount.", 
    "review_date": "2014-04-07"
  }, 
  "KqXtP34tqVH53FVVuzcPcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophia H.", 
    "review_text": "I and my friend randomly walked by and decided to give this place a try! The experience turned out surprisingly great! We ordered Cauliflower nuggets, furikake fries ( 5 stars for this fries!!), and Berkshire pork cheeks. These food portions were enough to feed two persons. I was very happy with the pork cheeks with mushrooms. Very tender and very well cooked. Really good service there as well. I will definitely wanna go back. It's a perfect spot for a dinner date.", 
    "review_date": "2013-12-04"
  }, 
  "qLZnWeAlykOzTF__vvrbbQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle W.", 
    "review_text": "I feel it was just another Joes of Westlakes. An older crowd, Food was meh.  Def on the expensive side.", 
    "review_date": "2014-01-10"
  }, 
  "dEN7NVBaBIOAWQMsXwyEiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle G.", 
    "review_text": "Again, I love  this place.  Around the corner.  Ordered the whole chicken dish, so much food, needed to bring home.  Fries are ridiculous, along with curry cauliflower. As far as drinks...we love the Fog City mule with Bitter Girl Bitters (ask for it)   I like to compare it with High West Distillerys  Mule in Park City, we spend a lot of time there..I like Fog City's  the best now.", 
    "review_date": "2014-05-31"
  }, 
  "DUnOMxkxsSv-WetQDRn0OA": {
    "user_rating": 2.0, 
    "user_location": "Rancho Cordova, CA", 
    "user_name": "Kayleigh U.", 
    "review_text": "You know, before the renovation, I loved everything about this diner. It was nice, well designed setup, had a very lovely interior, amazing food.... Not to mention, I always sat in the booth that was featured in my favorite movie \"So I Married an Axe Murderer\" featuring Mike Myers; this EASILY was my favorite diner in all San Francisco. But I have to say this last time after the remodeling/re-opening.... It went downhill. I felt like everything tasted the same: like it was drenched in the same vat of uncomplimentary spices... I know they have to compete with other trendy businesses... But they couldn't keep ONE thing from the previous menu?? Not even the seafood salad?? And I have to say... The lamb kabobs: don't waste your time with these. They're not authentic. They don't really taste that great at all....  I do have to say I liked the Brussel sprouts... And the deviled eggs were... Alright. Not epic.  Now. Another thing: WE WERE SNUBBED. BY THE FREAKING MAÎTRE DE. And our waitress wasn't gonna win the Miss Congeniality title anytime soon.  I'm sorry to say that, unless they lower the prices on the sub-par food (or create a better menu!), the staff check their attitudes, and they bring back a hint of the old place, we won't be going back any time soon.   I hope this review helps someone out.  :)", 
    "review_date": "2014-03-03"
  }, 
  "y091U7mHl54NhreZmoCE-A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J W.", 
    "review_text": "My husband and I had previously had many delicious meals at the old Fog City Diner during its heyday and had many wonderful memories of its warm and inviting interior and service during that time. So, we were really looking forward to having brunch at the recently reopened Fog City. Our interpretation of brunch is that there are lunch dishes along with several egg dishes on the menu. However, this was not the case. There was one egg dish (eggs benny). Having had many great burgers at the original diner, my husband thought that he couldn't go wrong by ordering the Fog City Cheese Burger. It was nothing like the juicy thick burgers that good SF restaurants serve. The patty was about ¼\" thick with the rest of the bun being taken up with onions and chopped lettuce. Definitely not worth $14, especially when you can go to The Burritt Tavern and get a great burger for a bit less. I had a dish called the Fog City Hot Brown (turkey, Mornay sauce, tomatoes on rye) for $16. It wasn't horrible, but it was very boring, with the sauce overpowering any other taste. A strip of bacon was put on top even though it wasn't on the menu, maybe to try to add taste. Anyway, there's not much positive that I can say about the food or the ambience of the new Fog City.", 
    "review_date": "2013-11-06"
  }, 
  "TpZN51jtAZTu7BjYxTfpjA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Kari T.", 
    "review_text": "Newly renovated, this place doesn't really look or taste like a diner anymore. A streamline bar runs down the center. It has gorgeous windows that overlook the Embarcadero. Their plates are fantastic for sharing. We enjoyed the deviled eggs as an appetizer and they really are amazing just as everyone on yelp said. I really enjoyed the crispy bacon and quinoa mixed in with the soft egg. Don't let the word fried deter you from the yummy mini artichokes. They are excellently cooked and the garlic aioli dip is yummy. We shared the special fish of the day which was a wonderful swordfish. It was more than enough food for the two of us.    Make sure to save room for a dish of their very yummy Fog City Custard. Its creamier than ice cream but more flavorful than frozen yogurt.", 
    "review_date": "2014-05-19"
  }, 
  "QRXprpL3ZYqYWOce3HiX4A": {
    "user_rating": 5.0, 
    "user_location": "Portland, TX", 
    "user_name": "Leif E.", 
    "review_text": "This is my absolutely favorite place to eat in the Bay Area. I LOVE THIS PLACE!!!! Friendly staff and great food! Well priced! The catch of the day is always well prepared and changes regularly to keep things interesting!", 
    "review_date": "2014-04-07"
  }, 
  "TjUUhGaci0Ye9vWoviFJ5Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shelly S.", 
    "review_text": "Went there last night for their Grand Opening. The overall décor and makeover is lovely! The design of the new location gives it a fresh and crisp look. The chairs were comfortable and the lighting was just right. I was a little disappointed by the menu since I called to make a reservation and asked how the menu has changed and was told that the chef has changed and that the food is more refined but that some of the elements from the previous restaurant were kept. We were a table of 3 and all of us felt that the menu was lacking those comforting elements it used to have in the past. Since we had a fish allergy in our table the menu was very limited and we all felt that it was hard to choose.  I must say that the items we did choose were all well prepared. We started off with the pickles which reminded me of my grandma's pickles. They were great however the portion was a little too small. We then had the Fries. The aioli that came with the fries was wonderful. We also ordered the girl tomato salad which was wonderful. I think that out of everything we ordered I enjoyed this dish the most. The tapenade dressing was salty and creamy at the right texture. There was just enough of it in the salad.  We also ordered a side of bread and the bread was hot and really hard to cut in portions. We ended up having to tear it apart with our hands since we couldn't slice it appropriately. All three of us had the hamburger prepared to different degrees of doneness. The one thing which is hard to do is share a hamburger so I would think it's not a sharable item and would not present it as such. The homemade bun, although good in flavor was too thin and the aioli on the bottom made it soggy and impossible to eat as a hamburger. I had to use a knife and fork to dismantle my burger... The burger flavor was really good and the pickles that went with it gave it a sweeter flavor which was interesting. We were excited about the desserts and ordered the frozen custard, the curled donuts and the pana cotta chocolate caramel cake. The frozen custard had a great texture but we did not care so much for the dark chocolate sauce that came with it. It had a processed flavor to it. The chocolate sauce did help the donuts a lot. I like the presentation of the donuts and thought it was a nice way to present something so simple. The donuts themselves were nice and fluffy but a sauce on the side to accompany it would really help. (we used the sauce that came with the custard) The highlight of the desserts was by far the pana cotta chocolate caramel cake. The mixture of flavors, the saltiness of the cake and the caramel were so complimentary to one another. Overall an ok experience. Good food execution. A few comments on the side:  We found that the menu was vague in description. 2 of the 3 people in our group are restaurant people (work in kitchens) and the descriptions were so hard to understand that we had to ask a lot of questions. Unfortunately, our waiter tried unsuccessfully to answer those questions for us but had a really hard time describing them in any other way.  With regards to the dessert menu we found that the frozen custard was not clear on how it really worked out and how it was presented.  The curly donuts also had a weird description for them and that was not something we were clear about either. The pana cotta also had these key words but it wasn't clear how a cake and pana cotta were combined into a dessert together. The waiter did manage to describe this dish in a good manner. We all know that yesterday was opening night. We are giving this feedback in the hope that some of our comments will be heard and hopefully dealt with so that we can continue coming to this establishment many more times in the future. The restaurant does have tremendous potential and we will definitely give it another shot in a few months.", 
    "review_date": "2013-09-24"
  }, 
  "vBxiTBwtVBRAGGRmJZccCA": {
    "user_rating": 2.0, 
    "user_location": "Alexandria, VA", 
    "user_name": "Tara I.", 
    "review_text": "I went there for dinner last night and the food was just ok, the service was less than ok, and the prices were quite high for what you get. I will say their cocktails were amazing, but that is the only thing I would recommend here.   We paid $3 for some bread (seriously??) because we were starving. We also ordered some fries before our entrees, and they were cooked in some sort of fish oil that made them taste VERY fishy. That was kind of an unpleasant surprise.   Instead of just refilling our water, our server reminded us there is a drought in California and asked if we thought we would drink all our water if he refilled them. Again... Seriously?  We told him he didn't have to refill them, but then he never came back to offer us another drink.  I just think that you can find better food, service, and prices at many other restaurants in the city. Try Cotogna instead of this-- you will be much happier.", 
    "review_date": "2014-01-18"
  }, 
  "w365A5I8BMBjjlf5qFrKTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gary J.", 
    "review_text": "great new place .. so much better than the old diner. Bright new feel, bartender was great! recommended special drinks and wine to pair with the tasting menu.  great service, even picked up on the impress the date, vibe", 
    "review_date": "2013-12-13"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "The \"bloody devil\" is their take on the bloody Mary, garnished with one of their amazing deviled eggs. Loved it. The banana bread french toast is ridiculously delicious. The dungeness crab benedict and the chorizo hash were both great, though perhaps a tad underseasoned (better than being too salty, I'll admit). The maple glazed donuts were outstanding. Great service, nice ambiance...except for that random robot art by the restrooms.", 
    "review_date": "2014-12-28"
  }, 
  "oygf5Gqc1MY2crhNPVBaZw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jessica E.", 
    "review_text": "Everything was so delicious. Mac and cheese is a must, had the whole chicken, oh my lanta was it good! Amaizing service, warm ambiance. Defiantly will be coming here again", 
    "review_date": "2014-12-30"
  }, 
  "X46RumEcunbgY_j6Rq1FfA": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Alanna D.", 
    "review_text": "Oh boy where do I start?? There are so many things to say about this \"San Francisco institution\". From the service to the food to the check, what a taxing and tacky experience.   The hostess apparently didn't appreciate me asking for a booth when we arrived at the EMPTY restaurant on Sunday, July 27th at 5pm. When I requested to sit at booth she responded \"is there anything else you're going to ask me for?\"  The waitstaff was slow, unapologetic for the cold soup, and dirty spoon, and not once did we get the impression that we were guests.   Horrible experience, way overpriced for the bland and cold food. We will never be back and we deliver a warning to those who look forward to going - this place is a disgrace. Don't waste your time or money", 
    "review_date": "2014-07-28"
  }, 
  "bl2JJL3Yxc5OVdHSJeoohA": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Whaledriving W.", 
    "review_text": "This is only the 23rd rating of five stars that I've given to an American restaurant, but it is most assuredly worth it.  (The original Fog City Diner was the fourth restaurant that I've rated with five stars).   While my wife and I loved going to the original Fog City Diner, I was a bit skeptical of the new (updated) restaurant.  I was not disappointed!  The food is absolutely magnificent, superlative, and does not merit any criticism of the menu items I've tried thus far.  Every patron that I've seen in the restaurant enjoyed the food and themselves immensely.  The wines, beer and cocktails were excellent: if you are not a oenophile,  I highly recommend asking your server to suggest or recommend a wine to be paired with your entree.  Their wines are excellent and unlike most restaurants, where getting wine by the glass most often has little to recommend, this is one place where I would heartily recommend ordering wine by the glass if you so choose.  The service was excellent and so was the staff, who I found to be genuinely very personable -- and not just to earn a large gratuity.  They have all been delightfully helpful, gracious, delightfully patient (the restaurant was packed; there was a long wait for a table, people were hungry and the time between ordering and being served was, as you might expect, proportional for the number of people seated, yet both our server and host stopped by the table to see if we could be served in any way as we sat waiting).  I've always brought my closest friends, associates, and professional colleagues here without the slightest hesitation (despite language challenges of many of my foreign colleagues).    Every item on the menu is well-worth trying.  For those who are new to the restaurant, I highly recommend asking the host or your server to make a recommendation for your lunch or dinner, and -- by all means -- ask for their recommendation of a wine to pair with your entree.  There has only been one person who did not know which wine he'd recommend and asked another server to suggest a wine for me: I deeply appreciated their honesty and candor.  (I travel an average of 318 days a year to 79 different countries, and dine out approximately 350 days a year.  I enjoy passing my impressions of restaurants' food, wines, service, and value to my friends.  Fog City is one of my favorite restaurants, and one that I love bringing family, friends, visitors, and professional colleagues here, for the food is that good.)  Last of all: a patron, in a review, made comment about being treated poorly on the basis of race.  I wouldn't tolerate this for a New York second, personally or professionally.  In the 26 years I've been a guest at Fog City Diner, to include the new Fog City restaurant, I have never seen even the slightest suggestion of racism on the part of any restaurant employee.  (As I have been employed by airlines, I would never tolerate such treatment even if I observed it in dealings of the staff with other customers and would never risk bring a professional colleague to this restaurant if I ever had a question or concern about racism.)  After reading the one negative review which cited racism in their experience, having patronized this restaurant an average of perhaps twice monthly over the better part of 25 years, I've never experienced, observed, or been told of such an allegation -- and question why the individuals involved didn't seek out the manager or owner, if they felt so strongly about their alleged treatment to include an allegation of racism in a review.", 
    "review_date": "2013-11-20"
  }, 
  "M8o7d4Zqeev3PGSHZeu8zA": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "j s.", 
    "review_text": "One of the WORST dining experiences I've ever had---and I used to manage a restaurant in The City. Situation: my son's 11th birthday. Party of 5. We had a reservation: waited 20 minutes for a table. Service: waited over an hour for the food after we had purposely pre-ordered the chicken while waiting for our table because we were told it would take 35 minutes. Waitress was snotty and condescending, telling us how the chef recommends we order each dish (yes I get that the steak should be cooked med-rare but let's not have an argument with my boyfriend about ordering it med-well.) Food: mediocre at best. Chicken was dry. $39 steak was ok but 1/3 fat. Everything was bland. Nothing special here. Management: once we complained about our food taking so long the manager was barely concerned and seemed to hover around our table afterward hoping we would leave. We were completely rushed through our meal and suddenly had 3 bussers constantly trying to clear plates. My son's desert wasn't even comped! Bottom line: I'm a disgruntled native San Franciscan that is continuously disappointed in what this town has become. Fog City Diner used to be a place where you could have a good meal with your family. There are hardly any places like that anymore. But that's another tangent. Warning on this douchey restaurant. Spend your money somewhere else.", 
    "review_date": "2014-08-18"
  }, 
  "4RAXTHLtE0L2wwVVBJ2Iyw": {
    "user_rating": 2.0, 
    "user_location": "Montara, CA", 
    "user_name": "Kevin S.", 
    "review_text": "I have been meaning to try out the newly opened diner as it's near where I work and I'm always looking for new lunch spots. I sat at the bar as lunch was going to be a quick affair today. Bar hostess was very pleasant and the decor very tastefully contemporary. OK, to the menu, sorta weird mix of stuff but I plump for the standard diner fair of a burger. First off I do not get asked how I would like my burger cooked, not a problem I guess. Then I get asked if I want fries, OK I guess you get a choice of fries or salad? Up comes my burger, pattie looks a little small and it's VERY rare, I don't mind that but many don't and would have had to send it back. Tastes OK but how hard is it to f*ck a burger up? I finish my meal and ask for the check, are you kidding me! The burger was $14, but wait the fries were an extra $6!!! Tax and tip see me coughing up $26.40 for a very average burger and fires. WAY OVER PRICED!  I will not be returning unless someone else is buying.", 
    "review_date": "2013-11-25"
  }, 
  "5yFZe3tCCjLJhcWNg32Dng": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirley L.", 
    "review_text": "I loved the old Fog City Diner. But the new and improved version is quite acceptable! No more Mac and Cheese on the menu, but the new menu is fantastic. Had the grilled fig salad, and it was exceptional. The bacon and quinoa devil eggs were so good, that I could have eaten them the whole night. I ordered the lamb skewers and my husband had the steak. Both were absolutely delicious. We were very pleased with our meal and would recommend it highly to anyone.", 
    "review_date": "2013-10-19"
  }, 
  "MnGIHcYOFI1NMIc0OHCYfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary H.", 
    "review_text": "Enjoyed a perfect brunch at Fog City today.  I had the Albacore Tuna Salad  ($17) with Butter Lettuce, Grilled Pole Beans, Early Girl Tomatoes, Black Garlic Miso Vinaigrette and crispy little Onions.  It was a perfect blend of flavors and, paired with the barrel Pinot Noir, made for a great meal.  My partner had the Smoked Salmon Smørrebrød and a barrel red blend with which he was equally enamored.  Service and ambiance were both without complaint.", 
    "review_date": "2013-11-24"
  }, 
  "fDv4S41fLwO9_xPNm53e1A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Burton K.", 
    "review_text": "A great remodel of the venue and a great new menu. The beef tongue was wonderful - something you don't see except in burritos in SF. The chile apple pie was also extraordinary. This is an excellent reinvention of what had been tourist fodder for the last 10 years.", 
    "review_date": "2013-09-25"
  }, 
  "srj-v0WSYa-1gpmffbeypg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yvette F.", 
    "review_text": "My partner &amp; I came here twice for dinner, the last time being this evening.  What a beautiful job they did remodeling the rather tired diner!  We were seated both times at the bar with soft light from below illuminating it.  The bar is located in the middle of the restaurant, with one side facing the open kitchen.  What an exciting sight to behold when all the kitchen staff is working furiously, yet in harmony, when the restaurant was packed, as it was 2 Fridays ago.  It wasn't quite as busy tonight but it's still nice to see folks seemingly enjoying their work and the easy banter they were having.    But, really, the food is THE lure.  So far, we've tried about  1/2 of their dishes between the 2 visits.  My personal highlights are: the clams, just a mélange of flavors with broth that almost made me weep when I accidentally dripped some on the counter; the grilled beef tongue, chunky pieces of such tender meat with great accompaniment of mushroom and greens and; roasted duck leg, with meat completely falling off the bones, and plums &amp; arugula cutting through the fattiness of the dish.  The dishes that I probably will not order again are: the kampachi crudo, just too subtle of a dish to stand a chance on this menu: grilled spiced lamb skewer, just not special enough to stand out from what I could get in a Middle Eastern eatery for far less cost.  We live close by and have eaten often at the diner version over the years.  The last few times have been a shadow of their Glory years and I am happy that this new version is here to reclaim their reputation.", 
    "review_date": "2013-10-29"
  }, 
  "0Vng_7e5dYu994O_vl2sIQ": {
    "user_rating": 4.0, 
    "user_location": "Furlong, PA", 
    "user_name": "Douglas W.", 
    "review_text": "Really great redux of a San Francisco classics IMHO.  The drinks were a great start, and the apps were wonderful.  We started with the Fries and Calamari, both super delicious.  Then on to the chicken ( a must and definitely shareable) and ribs.  All of the flavors and sides completed each other so very well.   Not sure why anyone would give this place a bad review. Service was on point and the energy of the place is great too.   We would definitely return.", 
    "review_date": "2014-08-30"
  }, 
  "EAE76VAose-LQTmbr0Cu0A": {
    "user_rating": 3.0, 
    "user_location": "Aiea, HI", 
    "user_name": "Michelle A.", 
    "review_text": "The reason I gave a three is because the food is overpriced. That being said what I had was good overall.   I had the dog city burger which was very yummy, the fries which were ok, and the strawberry shortcake which was good but would try something else next time.   The workers were very nice and attentive and the ambiance is pleasing.", 
    "review_date": "2014-06-21"
  }, 
  "Bp6kCG0W9BV2oa2XhumKkA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Anthony B.", 
    "review_text": "We stumbled across this little gem while tourist walking the Embarcadero on our way to the UW vs BYU Fight Hunger Bowl at ATT.   I found it on yelp as a good spot for brunch near our Fisherman's Wharf hotel. (Aren't we trendy). I decided we need good cocktails at brunch obviously.   First off this place is gorgeous. I mean stunningly pretty. Open kitchen, low booths, huge windows. We got stuffed in the back(Hungover, Hungry, guys in sports apparel don't deserve to sit where decent members of society can see them) and still had a nice view.  We popped in around 11 for some brunch. Dressed head to toe in Husky Gear, hungover, we looked slightly out of place. The wait staff didn't bat an eye, we were kindly addressed, seated, and served. Our waitress even put up with our lame attempts to flirt and be funny with a smile and occasional laugh. Service was excellent, she even let our most hungover patron order a grilled cheese off of the kids menu.  The cocktails were superb, I had the \"Inside Job\", a little rye for spice, ginger for the stomach, and lemon to wake you up. The Furikake Fries were mind blowing the fries were perfectly cooked the aioli was spot on and the furikake was a genius addition. I had the \"Hot brown\" as my entree. Everything was delicious but the dish lacked cohesiveness which I would blame on the composition. Nothing crumbling the bacon wouldn't fix.  I'll be back for the fries and cocktails without a doubt.", 
    "review_date": "2014-01-22"
  }, 
  "XIbwfLm5PtXnhgu3Q0zE-w": {
    "user_rating": 3.0, 
    "user_location": "Northern California, CA", 
    "user_name": "Ryan M.", 
    "review_text": "Decent place to visit when you are around the Pier and fancy yourself a drink.  They do have some good appetizer options but for me the prices are definitely higher than what they should be.  If they tempered their prices a little bit I might bump it into the 4 star range but the decent service compared with the overrated prices dropped it down a peg for me. It's a nice place and one I would go back to once in a blue moon but not something I would crave and visit on a consistent basis.", 
    "review_date": "2014-10-13"
  }, 
  "ByjLWqN_86o01bapf0etWQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andi S.", 
    "review_text": "Really disappointing. What ISN'T wrong with this place?  I really expected a lot better from this well-known restaurant group reopening such an iconic San Francisco restaurant. Sadly, it seems someone there must think their fine reputation puts them above basic customer service.  Had New Years Day late lunch here today and, ok, it was New Years Day, so maybe management didn't staff for a HOLIDAY (?!) or somebody didn't show up for their shift...but the restaurant wasn't particularly busy, maybe half full, so why such a mess?  The service was a completed disaster - like I said, maybe they were understaffed or hung-over and movin' slow. Once we were seated, it took ten minutes for someone to come by and offer us water. We could see there were only two or three servers working the floor so decided what we wanted quickly and ordered from the server when she brought our water since it was clear we might not see her again for awhile.  I ordered the burger and asked for it medium-well, the server paused for a moment and answered \"We can cook it medium OR well.\" **Um, really?** You can't cook a burger the way your guest prefers it? For a $14 burger (sans fries, which are another $7!!) you'd think they could cook it to order. Apparently not.  We ordered a kale salad that never arrived, so when the server brought the check I reminded her that and asked if it had been removed from the check. She responded yes, and that it was her fault, \"I just didn't key it in.\" OMG.  It took 20 minutes for our iced teas to arrive and forty minutes for our food to come. About 10 minutes after we got our food (delivered by a different server, which made me think there is some sort of a service gap in doing it this way) our original server came by to ask if everything was ok. The water carafe on our table was empty, so I asked if we could have more water. She said yes, \"In a minute.\" Wha??   I watched a group of guys sitting adjacent to us as their food came sporadically and having some issue with not getting what they ordered. )-:  Food was pretty good (and came to our table hot!)  but COMPLETELY overshadowed by the totally frustrating service and steep prices.   So many great restaurants in SF, spend your precious time and money at those, not here.", 
    "review_date": "2014-01-01"
  }, 
  "Yka_J40u_Bl7IW0R0Y3D_Q": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "David B.", 
    "review_text": "When we find a place that's casual yet provides a superb dining experience; accommodates the kids without sacrificing anything from the adult experience, it goes \"on the tour\". The Fog City Diner is on the tour.", 
    "review_date": "2014-12-22"
  }, 
  "RRifrriRW8HB5wz3yoBKpw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Hana A.", 
    "review_text": "It is way way way expensive for a quick lunch, but the food was delicious.  I got an open faced salmon sandwich and my friend got a burger.  Garlic fries were AMAZING and food was yummy, not sure if it was $50 yummy, but it was yummy none the less.", 
    "review_date": "2014-09-14"
  }, 
  "mzaRUvxcAWjPt-EDT6FwPQ": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Jenee B.", 
    "review_text": "I went in the afternoon in a friday and it was devine! I had the grilled kale salad on the small plate portion of the menu. Definitely more of a medium salad it was nice and light the almonds were a nice ending note highly suggest!", 
    "review_date": "2014-06-13"
  }, 
  "v3sM7qB9iIn5u3l40dQ_Sw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rita G.", 
    "review_text": "Bravo! Deviled eggs! Chicken! Service! Decor! LOVE IT!!!", 
    "review_date": "2014-04-20"
  }, 
  "jp8zjspsEicyXWEa9gPzYQ": {
    "user_rating": 2.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Hayley M.", 
    "review_text": "We came here for lunch today. Overall the place has a nice atmosphere. You know, 'nice', as in 'not really worthy of any other adjective nice'.   The kitchen is open, so you can see the chefs at work, but there's not the sizzle that you get in other open kitchens. There doesn't seem to be much energy about the place at all. Service wasn't slow, exactly. There just wasn't any gusto, you know?  Most of the food was underwhelming. I had the crab cakes, which were tasty but small. OK, they were on the menu as a 'small plate', but at $16 they were disappointing. My fiance had the chicken salad which was $17--extortionate, considering it was brown chicken meat and lettuce with a minimal amount of all the other ingredients (Tory Farm Nectarines, Marinated Cabbage, Candied Peanuts). Personally, I find it BAFFLING how restaurants can charge such high prices for what is, essentially, 10 cents worth of lettuce and less chicken than you get in a single chicken tender from KFC. Ridiculous.  Overall, 'meh' is a great word to describe Fog City. It's a shame, because it could be more upbeat, be  much better value for money and have more personality/individuality. But being where it is (right near the Pier buildings and near a constant stream of tourist traffic) the owners probably don't think they need to bother making any extra effort.", 
    "review_date": "2014-09-29"
  }, 
  "ohy_E0yQSfD6cslBuQLRLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy M.", 
    "review_text": "Really good food and nice ambiance.  Service was pleasant and the waiter was attentive but I can't stand when they take away someones dish while everyone else is still eating so I can't give them a 5.", 
    "review_date": "2015-01-22"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "The food is better than the original fog city diner but its pretty expensive.  I live across the street and I won't be back.  pwned", 
    "review_date": "2014-03-23"
  }, 
  "T8zZZK_ZEbjkV98J0m9qzw": {
    "user_rating": 5.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Alexandra C.", 
    "review_text": "Love the new Fog City; open space, modern yet comfy, upscale and reasonably priced!  Came for lunch today and since we had no reservation, we sat at the bar.  Nice, not crammed in and still able to have a nice conversation with my husband without interference or noise.    We ordered the burger, fries and brussel sprouts.  Service was excellent but the food was over the top delish!  Burger was cooked to perfection and was melt in your mouth juicy.  Fries with that aioli were amazing and I can't say enough about the sprouts in ponzu.  I have never enjoyed sprouts without bacon but I cleaned the bowl on those they were that good!      We don't get to the city often, but I'm dreaming of the next time just so we can dine here!", 
    "review_date": "2013-12-17"
  }, 
  "Sj7HxTlCJB0UF4vdTQdAUA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay G.", 
    "review_text": "I've been there pre-renovation and post-renovation, and I can definitely say that they've done a great job with the new place. I had the kale salad and added chicken to it, which was both filling and healthy. My friends had the crab cake, which was somewhat mediocre.   I had the tequila old fashioned and thought it was interesting, but would rather have the whisky version.   Service was very good and the only reason it gets 4 stars is due to the price point. It's a little overpriced, but somewhat understandable for the Embarcadero / financial district.", 
    "review_date": "2015-01-05"
  }, 
  "BSw9btlZIxMNsc9VB52GnA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian S.", 
    "review_text": "Ordered a burger and received what looked like a burger from the frozen section of a discount grocery store. The bar was cluttered with used plates despite less than a quarter being occupied (this should have been the hint to go elsewhere). It's not that the food and drinks were bad, but in this city you need to bring your \"A\" game if you want a good rating.", 
    "review_date": "2014-05-10"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "7x7 100 Best Things To Eat in SF Before You Die 2014  #60 Frozen Custard with Egg Yolk Caramel   A very unique twist on caramel, frothy while thick in consistency. It was a harmonious pairing with the vanilla custard!   As for the custard, the texture was smooth and creamy. The vanilla flavor was definitely present but not overwhelming  We also tried the chocolate version which was good but didn't mesh as well with the caramel. They also had donuts that night in two different flavors so we ordered one of each. Can't recall the flavors but remember thinking that the donut was solid but nothing outstanding  Overall Thoughts  Vanilla Frozen Custard + Caramel = Brilliant", 
    "review_date": "2014-11-29"
  }, 
  "1wI3WRmx5IMOmxVx8k1Wrg": {
    "user_rating": 5.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Sam W.", 
    "review_text": "Fog City - formerly Fog City Diner - has been my go to place for lunch and dinner for many years. It's the type of place that you can just walk into without (for the most part) a reservation and have a great dining experience.   While I like the old Fog City a lot better, I'm glad they didn't scrap this place entirely as it's in such a great location and has always been consistent with the food quality. The old menu was a lot more extensive but I can appreciate with what they are trying to do with this revamped version. My only complaint is that while the old Fog City diner was unique and a hangout for SF elites, the new Fog city is very trendy and hipsterish and I can name at least 10 restaurants in the city just like it.   That being said, the bar is absolutely beautiful. The drinks are superb and the food, while simple, is certainty not pedestrian. Last time I had a beet salad and fried artichokes. I've also tried a very delicious kale salad, hamachi, the made to order doughnuts and a pudding dessert. They also have great ice cream. The menu changes pretty regularly, which I love. The bread and butter is also a very welcoming side of warm goodness. The service is spot on and the space is stunning with obvious attention to detail. Just go have a drink there and you'll see what I mean. All in all, a well rounded restaurant, albeit a bit too trendy, but worth trying at least once.", 
    "review_date": "2014-08-07"
  }, 
  "AGraTma9eEgsiJFDIy6tbg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maile N.", 
    "review_text": "It was a Monday night and we were in the area so we stopped by for a light dinner of kale salad (fresh, solid) and hamburger (not the best I've had but not bad).  The prices are a little high as compared to the quality of other SF restaurants.  The location is good and easy to get to by the Muni F line.  Service was friendly and attentive enough.", 
    "review_date": "2014-12-05"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "So how do you know when you've had a great lunch? Answer: when you're still nibbling on the leftovers at dinner.  Case in point: my recent lunch at Fog City in SF. If you seeking a cool, unpretentious spot to power-lunch, look no further than this restaurant (which is conveniently located along the intersection of the Embarcadero and Levi Plaza). Added bonus: there's plenty of street parking + nearby parking lots!  My friends and I went to town with the lunch menu. The three of us split their famous deviled eggs (topped with crusted quinoa and bacon), as well as their new cherry tomato salad (which comes with lettuce, bacon, crumbled blue cheese/dressing). Once we finished devouring our small plates, we graduated to our main course. One of my friends got the burger (which is like a gourmet version of an In n Out burger) coupled with some crispy fries. My other friend went the more healthy route and ordered the kale salad with nuts, Spring veggies, watermelon radish, Persian cucumbers, and citrus vinaigrette. I, on the other hand, opted for the Saigon Dip (a Vietnamese inspired sandwich made with shaved roasted pork, spicy pickled vegetables, chili aioli, and cilantro). And to top it all off, the sandwich came with a large Pho dipping broth. It was as if a Vietnamese Banh mi and a French Dip came together and had a delicious love child. So good! I'm still flossing the roasted pork from my teeth.  For dessert, we split the house-made Frozen Custard. Admittedly, I don't have the biggest sweet tooth in the world. But this heavenly dish could easily convert me in to a custard believer.  This is my second visit to Fog City, and I'm just as satisfied with my meal as I was the first time. I love going to a restaurant that serves up classic favorites, but also continues to surprise you with new hits.   Keep up the great work, Fog City. I continue to be one of your biggest fans!", 
    "review_date": "2014-07-14"
  }, 
  "k0KEG3vrLkbK26PSiGb33A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Debra H.", 
    "review_text": "I Remember the old Fog City Diner. You could go there for a basic, delicious American \"Traditional\" meal. Looked forward to the new Fog City (not Diner). This is true, not a diner and nothing about it is American \"Traditional\", whatever that is. Interesting main ingredients, but what they do to them is a little stretch, over the top, and doesn't seem to work.", 
    "review_date": "2014-02-01"
  }, 
  "KIYedTBi8L71-0vo_NNmBA": {
    "user_rating": 2.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Jordan S.", 
    "review_text": "I've been here several times since the remodel, and each time it has been fine.  After tonight, though, I won't be going back.   Food: No complaints.  Service: Abysmal. Our waitress was an air-headed imbecile; she took our order, and then we didn't see her again until she decided that she needed to explain how to use the lemon garnish 45 minutes later. My wife had to ask the busboy for an iced tea refill after her glass remained empty for fifteen minutes. On that note, we tipped the busboys directly instead of the waitress, because they did her job for her; they delivered our food, brought us our refills, and cleared our table.  The icing on top: my friend explained the lacking quality of service to the manager as we were leaving, and he had the nerve to follow us out of the restaurant to accost us because of it. He insisted that he had personally delivered our food (he did not, it was the busboy), and he was adamant that he had come by three times to see how we were doing (he came by once.)  All we wanted to do was make him aware of a genuinely awful waitress; we would have still been back so long as we weren't seated in her section.  Instead, we will never be returning.   I have no tolerance for ignorant, rude, childish managers or incompetent waitstaff.  Props to the busboys though.", 
    "review_date": "2014-08-23"
  }, 
  "rOG1gDTZfsA6DL1OcAUfQA": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "John H.", 
    "review_text": "The fries were cooked to have just the right amount of crisp to them but the taste of the cooking oil was just a touch to strong and noticeable.   The butter salad had fresh, flavorful greens and the smokey avocado dressing was a nice compliment. However, the salad just lacked that extra kick or special something.  For the entree I had the burger. I would not order it again. It was a little too wet with all the sauce and extras and the combination of a strangely sweet sauce and the bite from the pickles really didn't work well here. Keep it simple, put more focus on making the meat and bun taste is good as they can.  The ambiance was pretty good, the place was constructed with nice materials, like the rusted metal exterior, to make for a fresh look.   The server was friendly enough and did a good job checking in but could have been around a little more frequently, the kitchen was especially slow tonight and took about 2-3x as long to deliver our entrees as expected (for a couple other guests as well) but we didn't really hear anything about it from the waiter until after we had already been waiting for a good while.   Overall this restaurant has potential, it just needs to sharpen up the staff and refine their dishes a bit more.", 
    "review_date": "2014-03-09"
  }, 
  "38a_iS_B393A3f0ia6KYSQ": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "James A.", 
    "review_text": "Awesome Christmas Eve dinner...Perry, our amazing waiter, took control of the meal. Delivered food, wine and prose with bravado. Frankly, best way to start a holiday!", 
    "review_date": "2014-12-24"
  }, 
  "LUnGfMkiEX5Wu8EF-ldBoQ": {
    "user_rating": 5.0, 
    "user_location": "Wilmington, DE", 
    "user_name": "Trish W.", 
    "review_text": "Great service, the broccoli and corn small plates were delicious! Everything is family style so it's great for sharing.", 
    "review_date": "2014-08-31"
  }
}