{
  "qhU3vc-GkGpHqY-mXVfIdw": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Stephen W.", 
    "review_text": "They broke the mold.   Every other Thursday family style lunch is a bay area treasure.   I seem to remember they only close 4 hours a day.   Thank you to all of the owners and long term employees. You are a cut above the rest!!", 
    "review_date": "2011-06-14"
  }, 
  "yR_Eyjp58p-bAwORI-B3Jg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle O.", 
    "review_text": "Apparently this is the place to go for some quality alcohol.  I wouldn't know, as I don't drink.  This bar is one of my exes favorite places to go with his \"buddies\".  He probably brings his new girlfriend here now and they can both get pissy drunk when they've managed to dump off their respective kids on some unsuspecting family member. Must be nice to be irresponsible.", 
    "review_date": "2012-08-16"
  }, 
  "ZJMrk2BwAkN0Dtc73qtN8g": {
    "user_rating": 4.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Christian W.", 
    "review_text": "Leo, an older man taught me liars dice here, and bought my group of 5 a round of drinks because I beat him.  He reminded me of the kind of sleazy uncle by marraige.  But he was harmless enough. We kept playing with him, to trade rounds and even the score a bit.  We had a great time.  Its a Classic Hangout where you get experiences like that, which don't happen on Union St or Valencia St.  Everyone mentions how you can see yuppies to Garbage men in here.    They serve Fernet like they probably have been since the 40's.  The patrons run the gamut of age.  Some come to catch up with old family friends, some seem to come to find some new company, while others come to drown their tears and piss off the bar tender.  The pool tables seem to be reserved for la familia, I always get a strange vibe when I walk back there, but that just adds to the charm.  Not sure if they have a real happy hour, but its such a great place to kick off the night, come between 7 and 9, get out before you say something stupid.", 
    "review_date": "2008-06-19"
  }, 
  "HYQoxBC1y1DGPq6pGP09Tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "This is one of the oldest bar in North Beach. Built in 1942, this bar is a favorite hangout for the old-school and newer generation Italians. The bar has 15 beers on tap with family-members bartending &amp; serving, cool music, a pair of billiard tables and entertaining locals with a ton of priceless and nostalgic stories of North Beach of the yester-years. Where North Beach once was the epicenter for the Italians. I love to hear stories of old North Beach. But unfortunately, North Beach is beginning to be an area for the younger generation who could care less about the past and care about getting drunk immediately.  With the bar's pair of of billiard tables, every Mondays and Wednesdays the bar has a pool tournament. One of my co-worker's best friend, who is also a regular Gino and Carlos patron, is one of 64 players involve in the tournament. I was there earlier tonight and she was one of eight remaining hustlers. Yes, she is that good. The entrance fee is $25.00 and the grand prize is a pair of airplane tickets to Las Vegas with hotel and car rental included. That's is not bad for $25.00 for the entrance fee, but you have to be a really good pool-shark.   While she was playing, at the bar I ordered a Sea Breeze. For $4.00 the cocktail comprised with parts cranberry juice, grapefruit juice and vodka. Frank, one of the family members and bartender, used Ketel-one Vodka for my cocktail and he didn't skimp on the higher-end vodka either. One sip of the potent cocktail has changed my mood completely. I was sipping on my cocktail and sadly saw my co-worker's friend lost and being eliminated from the tournament. Maybe I jinxed her. I hope not. \" Hey, I'm just being my Joe Cool-self and chatting to and listening with the regulars!\"   Other the priceless stories of the neighborhood, I was told that the bar has great lunch specials on Thursdays. With a slice of Prime-rib or Petrale sole with sides of salad and pasta and a glass of wine for $20.00. If I comeback during the midday, I might try that one day. I hear stories about famous personalities dominating North Beach. I hope one day that the newer generation will hear stories from Joe Cool.", 
    "review_date": "2010-03-03"
  }, 
  "N02U8Ubt3YaGFm03CdKqyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "My favorite bar in the city! Being a San Francisco native this bar has a special place in my heart.  I love the atmosphere and the fact that every generation can gather here and have a good time.  Ron Minolli and Frankie are the best bartenders!!!", 
    "review_date": "2012-03-03"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "This place is awesome.  Such a divey bar but in the best possible way.  It seemed like everyone here had been coming for years and they each had their stop at the bar.  Nothing fancy about this place but that's part of the overall charm.", 
    "review_date": "2014-04-06"
  }, 
  "qVCGzJCDnjwut1dnHef2Og": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Rew C.", 
    "review_text": "I love this place - serious old school classic joint. I've gotten drunk here with Bobby McCambridge and Ed Moose - different times.", 
    "review_date": "2010-12-28"
  }, 
  "pDfL8xt8F8ls0-kQIG_ADg": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Earl G.", 
    "review_text": "\"You talkin' to me?\"  Make sure you bring cash and a little attitude to this Italian neighborhood bar because they frown on the plastic and fufu drinks.   This is a man's man bar and a dive by no means. Most of these guys look like they do alright in their slicked back hair, black slacks, black sweater, and blinged out gold chain.   They have some flatscreens to watch the game but the entertainment is mostly centered around the two pool tables in the back.  The older crowd of Soprano-ish regulars was on one pool table while me and the boys owned the other table for most of the night.   Some sweet caroline playing on the jukebox with a little Sinatra make playing pool with the Goodfellas tolerable.", 
    "review_date": "2009-11-12"
  }, 
  "dWWUICdw7RgpsoYG8uVMGw": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Mollie M.", 
    "review_text": "What can you say about Gino and Carlo's except... favaloso!  I love this place for it's fun atmosphere.. it's no mess'in around bartenders.. and the locals that make it the most colorful place in North Beach.   Frank and Sil.. love you guys!!!", 
    "review_date": "2007-10-19"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "After almost a year in North Beach, it took a while for me to venture into Gino and Carlo's. I usually end up at Columbus Cafe and then Golden Boy, so G &amp; C's just never got a chance. I have to say, its quite a refreshing mid-week change from the louder establishments in the area. The music (jukebox) ranges from the Stones to Johnny Cash, among many other classics that you just don't hear much these days in most SF bars. The pool competition is pretty heated which is fun to watch even if you aren't playing. I like the 20 or so lockers where the regulars store their sticks, very nice touch. Oh, and there is beer here, so thats always a plus...", 
    "review_date": "2006-08-04"
  }, 
  "iIXc_5WtuM0hRqepPqeKCQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Danielle H.", 
    "review_text": "This place was ok the first time we went, but it gets better every time!  Our last visit definitely hooked all of us.  We went in early, right after dinner, since we had to catch BART.  We chopped it up with the owner who gave us free shots for being \"good patrons.\"  It's definitely a fun place to go with lots of other options around like Grant and Green or Columbus Cafe.  A return visit is definitely on the list.", 
    "review_date": "2008-02-23"
  }, 
  "J7fmfD8q5v64eAmHE4dI6w": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Angie C.", 
    "review_text": "Don't ever go here on St. Patrick's Day.  What a nightmare.  Let me give you a snapshot:  ANGIE C.:  (struggles to get within 10 feet of the bar.  Finally gets so there's only one row of persons between- this takes  approx 10 min)  Excuuuuse me bartender???  BARTENDER:  (no response)  ANGIE C.:  (look of longing for beer on face)  BARTENDER: (no response)  GUY AT THE BAR IN FRONT OF ANGIE: Would you like me to order for you, since I'm closer?   ANGIE C.:  Oh, thank you so much!  That's sooooo nice of you.    GUY AT THE BAR IN FRONT OF ANGIE:  What would you like?  ANGIE C.:  Ten beers.  GUY AT THE BAR IN FRONT OF ANGIE: (look of confusion)  Ten?  ANGIE C.:  I'm thirsty.  (smiles) (pause)  Seriously, I know I'll never get another round at this bar again, and I'm buying for a few people.  GUY AT THE BAR IN FRONT OF ANGIE: I totally understand. Ok.  What kind?  ANGIE C.:  Bottles of Bud.  GUY AT THE BAR IN FRONT OF ANGIE:  Bartender!?!?!  BARTENDER:  (no response)    fifteen to twenty minutes pass where this guy is trying to get the bartender's attention.  Really trying because he wants to get back to his conversation with a really pretty girl.  Then finally...  BARTENDER:  (gives look of \"what the heck do you want?\")  GUY AT THE BAR IN FRONT OF ANGIE:  10 bottles of bud  BARTENDER:  We don't have any.  ANGIE C.:  (peeks her head in)  Well, bottles of anything will do.  BARTENDER:  We have no bottles.  ANGIE C.:  Well, I'll take whatever you have.  What's on special?  BARTENDER:  (Looks confused.  Almost like she doesn't know if they sell beer at all.  Then finally walks away, presumably to the tap.)  five minutes later, the bartender brings back 3 beers.  I pass them assembly line style to my friends.  Five minutes later, the bartender brings the rest.    People give me dirty looks for trying to hand my friends drinks.  What was that about?  Then, i start getting pushed.  Almost spill my beer on myself and three other people.  I make my way back to a corner of the bar.  Drink my one beer and donate my others to the new arrivals to our friend group.  I'm done.    Try to leave, and it's like a fight to get out of the place.  ps- as I was leaving, I saw a bartender hand someone a bottle of fresh beer.  grrr.  TOTAL TIME TO GET ONE BEER FOR MYSELF:  30-45 minutes. WAS IT WORTH IT:  No.  Gino and Carlo, you may be a great place, but I won't be returning for St. Patty's Day.", 
    "review_date": "2007-03-30"
  }, 
  "ZObHXI05ILUFpDo_m7DjzQ": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Andrew D.", 
    "review_text": "At this point things get blurry....  The 3rd stop on the Yelp Elite Drink &amp; Hunt brought us here. Where I distinctly remember drinking numerous triple rocks due the fact they were really cheap. Thank you to our tender for being patient with us, and for the yelper hook up. Nice joint, very bright and lively, there were tons of people about, most likely due to the games being televised. we pulled up a chair and indulged in our surrounding.  I think this was about the time when our team began to flounder. We might have become complacent from too many beers. Or maybe it was the wafting smell of Golden boy pizza next door. What ever it was, we had to step it up and decode our next clue.", 
    "review_date": "2011-12-12"
  }, 
  "vTbQZNz8FH4jcrni7Vkl1Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oleg H.", 
    "review_text": "\"Heey - you couldnt get in trouble he-re if you tried (ah?)\"  Last time i was here, on the board it was written \"thank you for 45 years of service Frank (? not sure if im remembering the name right)\" but if a guy working at bar for 45 years is not a testimony to quality - i just dont know what it is. This place is a solid North Beach establishment, some would call it a dive i call it Gino and Carlo ah?", 
    "review_date": "2010-10-13"
  }, 
  "73ioC47BXL9R_qqUSo4YtQ": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Stina T.", 
    "review_text": "We planned a bar crawl / scavenger hunt through North Beach last weekend (just slightly obnoxious for the innocent bystanders). Gino and Carlo's was our starting off point, and let me just say, this is my new favorite bar. This place is the perfect blend of great people, a historic North Beach setting and cheap drinks. Frank was the coolest bartender. So friendly, helpful and a great sport. Even the regulars were happy to help us in our quest. (Go check out the grate on the street just outside the door and to your right). Before we left, Frank made a point to thank me for bringing in such a big crowd early in the day.  I highly recommend this bar.", 
    "review_date": "2008-09-23"
  }, 
  "_MON_UgnHo6aBTskVn4rwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SFnativeGal ..", 
    "review_text": "Gino &amp; Carlo is one of the last true Old San Francisco hangouts in the city.  A neighborhood 'Cheers' where everyone might not know your name when you come in, but they may very well know it by the time you leave.  Strong drinks made well and reasonably priced.  Sports always on the televisions while the jukebox blares.  The bartenders are friendly and overflowing with great stories about the neighborhood, hang out long enough and you'll eventually get  introduced to the all regulars and hear their stories too.  A note to 'Girls Night Out' ladies:  This place is fun to visit, but stay near the bar.  If you get too settled at a table you can get trapped by hovering and persistent romeos of the sloshed variety.", 
    "review_date": "2010-07-15"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "This is totally the bar where Karen K and I will drink well vodka, chain smoke, and shoot dice on the bar (for \"pin money\") when we're well into our late 50's, sporting matching Large Marge hairdos, and looking for a girl's night (or day) out. We totally saw our future here on a recent Friday night. And it was AWESOME.   The old-timers really do shoot dice at the bar and Large Marge was there with a gaggle of her girlfriends (one of whom asked me why girls my age have such BIG feet these days and promised to match me up with her son, who is a \"real catch\"). There were all kinds of toothless crusty old men and older ladies with aqua net 'do's. They looked utterly shocked when about 25 20-and-30-somethings bombarded their time-warped watering hole.  Drinks were strong and cheap and the pool tables were hopping. Super low-key on a recent Friday night when every other bar in the area was overflowing with obnoxious drunks. Hell yes, I say. Hell. Yes.", 
    "review_date": "2008-05-29"
  }, 
  "bzapbb28xMO0NE9oRK27gg": {
    "user_rating": 5.0, 
    "user_location": "Chandler, AZ", 
    "user_name": "Kevin C.", 
    "review_text": "Awesome spot for a cocktail or three when passing through North Beach. Don't forget to have a slice next door at Golden Boy. In fact bring it with you to G&amp;C and wash it down with a brewski or cocktail as you watch college football. Friendly staff, friendly customers.", 
    "review_date": "2014-12-20"
  }, 
  "b8EnjL9DwA6rNDQ9yoIwWg": {
    "user_rating": 3.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Binh D.", 
    "review_text": "Pros: No cover, pool tables, TVs and diverse crowd (old, young, hot, not so hot).  Cons: Small and can get crowded.", 
    "review_date": "2011-05-31"
  }, 
  "0mvmhuKngfBClglporQK9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex P.", 
    "review_text": "im a fan before noon...when i can play pool on those gorgeous tables without having gli fking italiani breathing down my neck...and constantly kicking my ass :)", 
    "review_date": "2009-11-21"
  }, 
  "etKKH6F0D9BJan-UPQgQaA": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Anthony L.", 
    "review_text": "Every time my buddies and i come to the city, we always make sure we make a stop at gino &amp; carlo. The place isn't that big but for some reason it is always fun as hell. Every bartender i've ordered off of has been real polite and chill. They're the sort of bartenders that deserve good tips for their hard work. The crowd is cool too, always a mixture of young &amp; old. The prices are also very good, especially their jager shots haha. I highly recommend this place if you're looking for a good time, whether it's for just a quick drink or a long night of drinking.", 
    "review_date": "2010-03-19"
  }, 
  "yeVWC11fmgb0Ev-Jy014-Q": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "FLICK R.", 
    "review_text": "A great place I like to visit on a Sunday morning. Watch the beach awaken while I drink bloody marys and read the paper.", 
    "review_date": "2011-08-01"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 6:37pm/56°F cloudy  Purpose: This is my go to bar to be quiet and watch local sports on TV. BTW this is a bar were the local off duty SFPD officers hangout before heading home. Another reason why I come by to chat and laugh a little.  Ambiance: Neighborhood divey bar were there are plenty of kith around. You don't need to dress all flashy showing up in style and wearing you best clothing from the closet. Here it's all about who you know and how you carry yourself. Don't expect hipsters or gadget geeks to be around here. What it is about mostly 50+ crowd locals with kids in college or started their own family, plenty of time on hand. There's really not much to say just your standard bar with jukebox,pool tables,flat screens everyone sitting at counter talking to Frankie sometimes he can bust out a joke from within. It's probably onevbofvthe quietest bar due to it's client lifestyle.   Staff: I always deal with Frankie so I can't say much only that he can get in your face if there are political issues arises.   Cleanliness: It's a divey place that has it's time since the 1940's so don't expect neon color lights or any high tech gadgets around, if you do, turn around and leave.  Eats/Drinks: I get numerous assorted drinks price range from $3.75-$6.50. My favorite cassidy mist is always my drink of choice made with maker's mark. Pizza I just grab from next door GB pizza and bring it over. Apps are serve in sizes of medium only, may order two and combine it.  Products: Full bar and finger food apps.   Punch Lines: North beach,old timers,divey,quiet/average,pool tables,jukebox,ATM,TV,street parking,many different ethnic around,no hipster appeal.  Tradeoffs: You come here for good laughs and to relax from a full day of hard work, leave the past behind you.  Final Thoughts: Cheapest place in NB neighborhood to get a drink and share some good times with old buddy's. You better be a local or else hard stares and slight pulse will be encounter. Italian nostalgia places and feel is getting less and less these days, this place stays in place through out the times and it shows, stop by find out for yourself.", 
    "review_date": "2014-04-03"
  }, 
  "jveIBHpWOfZFv24luiDjPA": {
    "user_rating": 5.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "David R.", 
    "review_text": "Played pool and got drunk, what else can you want from a bar in the North Beach area. The place was packed with what looked like locals, the staff was friendly and I will be back.", 
    "review_date": "2014-06-18"
  }, 
  "ZHKTYA-ZNVLwH5wTFBCiYQ": {
    "user_rating": 1.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Jason M.", 
    "review_text": "I contacted the bar 3 weeks in adcanced and asked them if we could have a bar pub crawl going through their bar. They responded in the positive and said they would have special drinks for us. Turns out we get there and there is one old poor women working for the entire bar. Despite  me warning of our group of 30 there was just one women for the 30 of us and the 20 regular customers. Then some older guy not part of our group spills on the pool table and some drunk patron of theirs thinks it is our group and tries to start a fight with the group of 30 of us. Anyway we brought the fight back down to earth to not cause a scene and defused it. But still this place has a lot of nerve to leave their only bartender with no help and to put up with a ridiculous local crowd of older creepy pedipfile guys when a group of young 20 somethings have their cash out ready to pay. Please head to Amanti, that bar is way more worth it!", 
    "review_date": "2013-03-23"
  }, 
  "v7tuX0m6ajhxjlXX_LeKyA": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Bobby M.", 
    "review_text": "The BEST BAR in NORTH BEACH hands down !  GREAT for Pre-or Post Nights out on the town ... \"Short Glass-Long Pour\"   always going to get your money's worth !", 
    "review_date": "2011-05-30"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "Came here for last call and the place was pretty chill. Lots of room to sit and talk and the bartenders were cool even though I only had a $100 bill. Came in here after eating pizza at golden boys. Can't remember much, but I remembered liking it", 
    "review_date": "2012-03-24"
  }, 
  "H4mtLg7PyTRzYHS9cYzeEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Farrah S.", 
    "review_text": "ok ok so this is a bit of an out of the norm guilty pleasure...i love coming here with a friend to shoot a little pool and talk to random locals whove been coming here for decades...the juke box is full of great music and usually already has credits on it. Good conversations, great pool games.", 
    "review_date": "2010-06-23"
  }, 
  "TULdRtcBfpfmBppHOCVCEQ": {
    "user_rating": 5.0, 
    "user_location": "Woolrich, PA", 
    "user_name": "Summer K.", 
    "review_text": "We stumbled upon this place, via Yelp, looking for a great dive bar open in the am hours while vacationing in San Francisco.  We didn't want some place touristy, we wanted to feel like we were at our favorite dive bars at \"home\".   This fit the bill.  Cranky, yet lovable, barkeep and colorful regulars, including a uniform cop walking his beat.  Perfect!    We enjoyed a beer (I'm ashamed to say I forget just what beer, but we like hoppy beers and I remember not being disappointed w/whatever draught I drank) and lively conversations.  Fellow patrons were also great at telling us where to drink/eat next.    This wil be a must stop for us anytime we're in San Francisco!", 
    "review_date": "2012-01-16"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "pluses: Giant neon sign. A north beach bar isn't worth mentioning if it doesn't know how to rock some neon out front. Friendly regulars. Older neighborhood folks, people who just want to shoot some pool. None of the stuff you and I hate about north beach. Pool tables. Great place if you just want to shoot some pool. A six dollar knob creek special. I'm not sure if they do this every night or not.  minuses: none to speak of.", 
    "review_date": "2008-06-02"
  }, 
  "KZ62cV1KShCbvbO8ariQVg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Steve T.", 
    "review_text": "Definitely a North Beach neighborhood  haunt...my kind of bar! Grab a slice or two of the incredible pizza next door (Golden Boy) and grab a cue stick! Love it!", 
    "review_date": "2013-10-29"
  }, 
  "sSFgjECKS4NIw-e_Vx9UuA": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Castro G.", 
    "review_text": "My friend Danielle and I loved Gino &amp; Carlo!  The crowd was quirky but very friendly, the cocktails were a nice pour, the bar tenders were all very out-going -- especially Sheri (of whom we are a big fan).  Can't wait to go back (watching the cute guys line up for Pizza at Golden Boys next door is always an attraction, too).", 
    "review_date": "2012-07-06"
  }, 
  "i-r6ZtPubJPg9oBd7GtuIw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Becky S.", 
    "review_text": "Divey, heavy on the pour, pool tables = My Happy Place.", 
    "review_date": "2013-10-15"
  }, 
  "vbE27jE7meIR4xsDX0Hhsg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jack M.", 
    "review_text": "This is the greatest bar in the greatest neighborhood in the world.Thus,it is the greatest bar in the world.", 
    "review_date": "2008-03-23"
  }, 
  "CRLA264qZO-IxB2gQOnJmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Athena S.", 
    "review_text": "Been coming to this place for years every so often (meaning every few months not every few days!)  I swear since the late 90's, it has not changed one bit! Old timers chill in the background playing their card games or shesh-besh (google it)  and years later, they're still making comments about your ass in italian (that is, if you have a nice one!!) Knock yourselves out 'if it makes you happy, it can't be that bad'  (Sheryl crow)   Locals galore, some who are actually native, imagine that. Oh and few tourists, thus the cocktails under $9 Gotta love it", 
    "review_date": "2011-06-20"
  }, 
  "cMoQqT_j_FD1gO6EEZzOIg": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mitch E.", 
    "review_text": "I was not in Gino &amp; Carlo's long. However the 25 minutes in there warrant a review.  Thank god there is a place which actually keeps the store hours that they post. 2 a.m. is actually 2 a.m. here.   Sat down, got some drinks at the bar and went to town quick. Basic bar. Pool table and flat screens. Seems like a good spot to watch a sporting event.   The prices are great and the people behind the bar are friendly. Its a good spot, nothing special but a solid place to grab a drink or two.   As they started to ask people to leave, I was able to chug a friend's beer (Not everyone can keep up) and went on my way at 2 o'clock. The way it should be.   Thanks for staying open, as advertised!", 
    "review_date": "2014-03-05"
  }, 
  "l26TgP9ox03XRLDuG-9wvA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annalise F.", 
    "review_text": "When \"Spare the Air Day\" robbed us of our bonfire plans at Ocean Beach, we made boozing plans in North Beach instead. (We wanted to stick with the overall \"beach\" theme.) I'd never been out in North Beach before, other than dinner, and was excited to paint the town!  As a natural \"lister\" I can tell you that I'm aware of a number of fabulous places in the NB bar scene- and Gino &amp; Carlo was definitely not on that list! My boyfriend insisted we go here, as its one of his favorite dive bars. (Don't get me wrong- I dig dives!)  The atmosphere was fun- a nice mix of folks, and the bartenders are incredibly friendly (or so I was told, since a girlfriend of mine left with a #).   HOWEVER, did you really just charge me $6 for a vodka tonic that comes in the glass the size of a my pinky?!?!? I swear to you, this was the SMALLEST vodka tonic I'd ever received for the price. Especially since girlfriend got hers for free! Come on! I'm cute too! Is it because I'm obviously with this dude next to me that mine is more expensive? Are you charging me for her drink essentially? NOT COOL! (I'm just complaining to complain at this point.)  It was a fun place to go, but I think I'll leave it as \"his place\" and find my own little niche in North Beach. :)", 
    "review_date": "2011-07-05"
  }, 
  "CLKGEdkqwQT6oVJG_deC7g": {
    "user_rating": 5.0, 
    "user_location": "West Oakland, Oakland, CA", 
    "user_name": "Carlo M.", 
    "review_text": "i liked this place cuz it had my name on the outside!!  the place is cool though.. the bartender was hella cool.. it was a sunday nite and we had a great dinner at Franchino' and then we ended up at Gino+Carlo's..  after having drinks and shots, the bartender hookd up 4 shots of jaeger.. love it..", 
    "review_date": "2008-11-20"
  }, 
  "Bljat_wCuU71TkY6CalKlg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Tini P.", 
    "review_text": "Holy hell this place rocks.  Just stumbled in to play some pool and it was hard to get me out.  I felt like I've traveled back in time in another place and I love it.  I think it might have been cash only, but they had an atm inside.", 
    "review_date": "2009-01-10"
  }, 
  "F9tOE0d09SLkCIZwt8I-0g": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Patrick N.", 
    "review_text": "This is another one of the \"well, there are two neighborhoods in North Beach, the weekday neighborhood, and the weekend one.\" I'm sure the regulars don't know what the make of the Marina types, other than they want to kick their ass in pool.  If you're younger, this is one of the places along the pub crawl here that ends at the Savoy. If you aren't, you tend to sip your drink and watch the crowds walk in and out.  The place has been around since 1942, and sometimes smells like it too. But any place that has a sign in the back with a Frank Sinatra autograph is okay by me.", 
    "review_date": "2009-12-28"
  }, 
  "8DqQqPnWLMllH2Dd0bETtQ": {
    "user_rating": 2.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Chris T.", 
    "review_text": "Hole #2 For my friend's birthday night.    <a href=\"http://www.yelp.com/list/lillians-birthday-crawl-san-francisco\">yelp.com/list/lillians-b…</a>  Still relatively, early in the night, but it was crazy crowded already here.  Kinda had to push your way to the bar in order to get some drinks, still we all grabbed a beer and drank with the birthday girl and moved on.  I'll be back sometime and maybe come on a slow day and give their food a try...", 
    "review_date": "2009-08-15"
  }, 
  "NgGnpTgk1ZeyzMhEj3rhIQ": {
    "user_rating": 4.0, 
    "user_location": "Youngstown, OH", 
    "user_name": "Sonny B.", 
    "review_text": "Solid no nonsense bar with good prices .... apparently its trendy now to call any bar thats in an old building '' a dive bar '' ... this is not a dive bar ..... North Beach is not ''divey '' at all.... its either tourists or people that can afford to live in San Francisco - so the '' dive '' thing is a misnomer .... its an old building - no frills - solid bar with no pretense . Beer prices were the most reasonable we found in the very touristy North Beach area . Liked this place .", 
    "review_date": "2014-09-27"
  }, 
  "lAx_s9SNrW40W7sdN3T6PA": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Andrew V.", 
    "review_text": "It's not the fanciest bar in San Francisco. However, drinks are reasonable, there's great people watching and the bar tenders are cool. Oh, and more importantly, they don't take 10 minutes to make a drink! I'd recommend it as a good local bar to North Beach.", 
    "review_date": "2014-06-03"
  }, 
  "Ojxyc-LJBTJuV4r_IHDGoQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "RAY S.", 
    "review_text": "G &amp; C's is one of the best \"joints\" I've ever been in, and I've been in 'em in over 30 states ! Now granted, I'm an S.F. native and I know the owners and \"Joe Buck\", bartender extraordinaire, but when you come into a \"real\" San Francisco bar, please leave the prissy attitude at home, will 'ya?! It ruins the drinking experience ! This is not a place for hipsters, it's a place for people who like other down-to-earth people who can talk to anybody regardless of income or vehicle ownership. There's a very simple rule at G &amp; C's: be a lady or a gentleman and you'll be treated with the greatest of respect and service. Loosen up, get over yourself, have a couple of cocktails and get some personality. For those of you who understand this, you've made a good decision seeing the great people at G &amp; C's !", 
    "review_date": "2009-11-07"
  }, 
  "JFRdv_Q9-f8I7Q1pbnwVCg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah T.", 
    "review_text": "Cheap pool and cheap drinks! This place is great for locals to get that Little Italy experience now rare in most of North Beach.  There are always interesting people there and a line of people playing pool.  But if you wait it out it's worth your time and the $3.50 for high balls. Sweeeet!", 
    "review_date": "2006-06-13"
  }, 
  "BAXXcq0aWSVndsjnQ5dyBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melinda R.", 
    "review_text": "The lights aren't too dim so you can actually see the interesting local you're chatting with at this unassuming bar.  Leave your heels and snooty attitude at home, as they won't get you any attention here.  The crowd can be a bit on the tough side, but it's all an act.  ;-)  Great place to sit back and watch some old Italian guys arguing at the bar or even get into it with them!   I have a great time everytime I go to G&amp;C!", 
    "review_date": "2005-11-23"
  }, 
  "cie1b9elyL3Xd-aXLvi6DA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonny Bobby G.", 
    "review_text": "i walk by this place every morning on my way to work and i kid you not, its already open with people sitting at the bar. while i admit this isn't the type of place that would be my first choice to hang out (that and an underlying fear of crossing an italian mafiaoso), i tried it out today for the thursday lunch special. $15 and you get an all you can eat experience of salad, pasta and whatever main dish they got going on. the food was decent. the ambiance... obviously the whole point of going. with family style dining and people from all walks of life, this place was an experience.   example. we sat beside these old school italian businessman who were obviously well off.  two seconds later, an old guy (clearly wasted) walked passed out table, vomitted mid-stride, and continued walking to the bathroom. 10 minutes later he was back at the bar. awesome.  while its a little rough around the edges, i guess thats the charm. AND its been open forever. can't wait until the next thursday lunch experience!", 
    "review_date": "2008-03-20"
  }, 
  "-34NV3A5a5gcL-s8UH4KbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie T.", 
    "review_text": "I was only there for 20 mins, but the bartender and staff were super friendly. There was baseball on the TVs (which automatically gets them to a 4). I had enough to drink at that point so sipped quietly on my diet coke, which the bartender continued to refill everytime I was low. Really nice group of people. :)", 
    "review_date": "2007-06-14"
  }, 
  "B1L60uYOxaSUg0xwokPV1w": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Krista C.", 
    "review_text": "I admit I might've just gotten unlucky, but I really couldn't stand to stay here for very long. A friend and I were attending an organized bar crawl which distributed drink tickets for discounted drinks. I sat at the bar for ages waiting on a bar tender who seemed to be deliberately ignoring me. When I finally got his attention, I asked what I would be able to use the drink ticket with. He immediately turned away from me and went to serve another customer, even though I had seen him serving other customers with drink tickets as well. I'll admit, it was a busy night, but be straight up ignored in that way when he was willingly serving other customers? Makes it hard for me to give him the benefit of the doubt. Would be willing to give this place another chance, but my first impression definitely left me feeling disgruntled.", 
    "review_date": "2014-12-10"
  }, 
  "-B-QEUESGWHPE_889WJaeg": {
    "user_rating": 3.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Mark F.", 
    "review_text": "On a recommendation for a truly locals hangout on a Tuesday night, I entered Gino &amp; Carlos. Pool tables in the back and a half filled bar, I ordered a beer from the decent, but not great selection. Looking at the other patrons, mostly older and drunker, I choose poorly. Booze is the mothers milk here. Strong drinks all around! The crowd was friendly and some regulars even bought me a drink. Where does that happen any more?  Apparently there's a serious pool league here and food although I can't comment about either. It's nothing out of the ordinary but the people are extraordinary.", 
    "review_date": "2010-02-03"
  }, 
  "wYS8Zv5sMBWmchDg92Bq2g": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Saralina B.", 
    "review_text": "A North Beach trademark, this Sicilian Pub is maybe my favorite bar in the city. Being almost 100% Sicilian myself maybe has a little to do with is, but anyone can enjoy a good Italian setting. So authentic and fun. This place has great Sicilian decorations, tables to chill at, a juke box to get it crackin', a long bar, great attentive bartenders who don't only pay attention to us purrty ladies btw and pool tables to show off yo skeeels.   The owner, Frank Colla really held onto the old North Beach feelin'. A couple famous regulars pop in from time to time too. :)   Note: Cash bar. ATM it before you come!", 
    "review_date": "2010-06-10"
  }, 
  "L3mmNtzxkBBBvB5yAbqL2w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Larry A.", 
    "review_text": "I used to come here a lot before I got married.  I miss this place.  I need to go back.  Best jukebox in the city, save for Toronado and 540.", 
    "review_date": "2007-06-21"
  }, 
  "HOm81YGjs62DjVp69y5TUA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angel L.", 
    "review_text": "This place is a great neighborhood bar in North Beach.  Frank Jr. and Sergio are two of the best bartenders in the City.  They always know what you want.  It's a great place to catch-up with the locals and hear stories about past experiences.  They offer up a nice Italian dinner once per month.  All you can eat and drink for a nominal price.  My favorite feature is that the best pool players in San Francisco come there to sport their best shots.", 
    "review_date": "2011-10-05"
  }, 
  "tdxR42PJOMwI4GQEbrvrsw": {
    "user_rating": 5.0, 
    "user_location": "Corona, CA", 
    "user_name": "Tammy D.", 
    "review_text": "My favorite bar in SF!  I am drawn to this place time and time again, year after year!   A local brought me here years ago and I return every time I am in town.  Nothing fancy about this place which is great if you just want a few \"pops\" and to play some music on the jukebox.     It's really a locals spot but they welcome everyone, come as you are.  It's a diverse crowd, old, young, hip, un-hip.  Not a tourist trap and CASH ONLY PLEASE.", 
    "review_date": "2008-10-13"
  }, 
  "sYMKftQFGWl5hqnpQDJCMA": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Ann M.", 
    "review_text": "okay, i'll admit that i like older men and this place has older guys...some older than i would like..and not cute, but it's a hit or a miss. what i like the most are the bartenders and the pool tables.  hardly a wait for the tables and most of the patrons are respectful.  the bartenders are nice and don't keep me waiting. ever.  when i'm tired of the teens at grant and greens and savoy, i pop into ginos.", 
    "review_date": "2008-11-18"
  }, 
  "Le0qh1Ell3xQACosmNVmsg": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Jimmy W.", 
    "review_text": "I love this bar have been going for years. They know how to treat their customers, all of the bartenders are very sociable and know their craft. If your a regular your treated like family.", 
    "review_date": "2012-09-18"
  }, 
  "6KpxOoUnQyYGTd3Fuwk_lA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paige W.", 
    "review_text": "Lots of older OGs of the neighborhood hang out here.   Carol Doda, even!  It's loud and kind of hard to order a drink.  Pool in the back.", 
    "review_date": "2014-07-05"
  }, 
  "7EPQ1vNZ0DVwerL952wSOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bowie L.", 
    "review_text": "Gino and Carlos is the definition of the perfect dive bar. People who expect to come in during a holiday and get excellent service (See below) from any bar, have clearly never been out drinking in a major city before. Gnc's is the perfect place to sit, drink, play some dice or pool all while listen to great music with fellow drinking enthusiast. Its a place for regulars but open to visitors, just leave your marina attitude outside.", 
    "review_date": "2007-05-26"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "friday nights are quite packed at gino &amp; carlo...sardine can of people at entrance...bar stools all taken...planted and intensely viewing the few screens above...stuck and viewing whimsical painting of the lounge near entrance...squeeze to the bar for a drink...attentive bartender and quick to service...$five guinness proper pour....just a drink and solute to san francisco...", 
    "review_date": "2013-06-25"
  }, 
  "F4dfPBVncAEDnfy-4yCCrQ": {
    "user_rating": 4.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Laurent D.", 
    "review_text": "Really nice neighborhood place that felt very comfortable. Good food. I just wished they processed credit card!!!", 
    "review_date": "2013-10-15"
  }, 
  "1W3L6SnbK7EXg1wIRBucBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "Classic San Francisco.   Not the cleanest place. Not the roomiest place. But classic.   The barman was cool, easygoing, friendly but not ass-kissing, smooth.   Three pool tables in the back and looks like they have an ongoing annual billiards tournament.  They had Spaten on tap last night, don't know if they always do or if it was just for Oktoberfest.   The bar is cash-only but they have an ATM machine right there.  Definitely going back there.", 
    "review_date": "2009-10-01"
  }, 
  "ydQ8SD98-6XJ42-x52H8gg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ric S.", 
    "review_text": "Neighborhood bar in a great neighborhood.  Gets a good crowd, solid drinks, clean/cool decor, excellent service.", 
    "review_date": "2013-03-07"
  }, 
  "WlWgl1aWl-8wGZYUncV-2A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "La C.", 
    "review_text": "Really cool spot, definitely an old school type bar not lounge.  Great drink specials, $2 for bud drafts and a number of tvs to catch the Giants game.  Oh and nice touch with the free pizza from next door.  Friendly regulars and pool tables in the back round out your bar experience.", 
    "review_date": "2012-10-29"
  }, 
  "vWpe19iYR30nE8JvBtjwKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yelper A.", 
    "review_text": "It's either going fishing with my set of Irish friend's or going to this bar to visit with them from time to time- and if you want to hear some real stories - you come here and pony up your pool game and sit in the middle...\n  The wives sit in the front and the husband's place bets in the back.  My favorite part  is the house cook Mike Gallagher, a San Francisco party legendary, who will take you in the kitchen and make you help him whip up all sorts of dishes, but only after a shot of whiskey or brandy - your choice though.", 
    "review_date": "2006-03-16"
  }, 
  "KyGkyqSPuJW-Sq7OXPVu2w": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Brian B.", 
    "review_text": "This is cool bar! I like how it's next to Golden Boy. I went here on Friday and got a couple beers. The bartender is nice. I also brought a gino and carlo shirt. I always come here if i'm out in north beach. good bar! has a lot of history also .", 
    "review_date": "2012-02-26"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Hahhahaha this place reminds me of dive bars San Diego because it's ridiculously cheap.  I came with friends who were here on a bar crawl.  They had bought wristbands to get discounts at participating bars... which turned out to be completely pointless here because G &amp; C's drinks are already ridiculously cheap.  As usual, I was overdressed and looked absolutely out of place.  But the bartender was wonderful and hilarious, so I didn't feel too uncomfortable.  I like being able to order stupid girly drinks at dive bars and not get ridiculed ;)", 
    "review_date": "2012-11-21"
  }, 
  "eFAeAaUFs5iPDRO-EtiR9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben V.", 
    "review_text": "Some nights, or mornings for that matter, I just want to hang out with a bunch of old guys and throw back a few.  The G &amp; C has to be one of the best bitter old man bars in the city.  And most of the bitter old men here actually turn out to be friendly!  It's a great place to get into a heated discussion over a few beers, tap into the treasure trove of stories from blue or white collar guys who've lived lives straight out of novels or rub elbows with septugenarians who are charming walking cliches. But really the best thing about the G &amp; C is that it's a full on San Francisco experience not trying to be a \"San Francisco Experience\" at all.", 
    "review_date": "2006-04-25"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "talk about a piece of SF history! this little italian bar still has a few old italian mobster guys sitting at the bar.(not kidding) small, friendly and laid-back place. when i go, i always expect joe pesci to walk in with a gun and start shooting up the place.", 
    "review_date": "2005-04-25"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "I wanted my 300th review to be special, to be a reflection of me.  I wanted it to say; Classy yet down to earth                                 Fun yet grounded                                 Smart yet sexy                                 Creative yet logical                                 Humble yet confident                                 Alcoholic yet functioning  So, what place says all of that? Well, nowhere I can think of so I picked a bar that opens at 6AM instead.  Now, I am not one to go on 6AM drinking sprees, so it is important to note that this is the only bar in the city that I have ever chosen to partake in a 6AM drink.   Oh, I love this place. It has been around as long as I have twofold. It has pool tables, good music, all of the North Beach regulars, food, sports leagues, strong drinks, great bloody marys (for the 6AM visits) and character.  This bit of conversation, as told by AD Winans, between himself and Charles Bukowski (Hank to his friends) seems just like the sort of conversations that have been going on here for years and will likely continue for years to come. This is why I love this bar;  \"Hank and I entered Gino and Carlo's bar, where we found Cheap Charlie lying on the floor in a drunken stupor.  Cheap Charlie had gotten his name because of his mooching free drinks at North Beach bars.  Hank and I looked at Aldino, who was leaning over the body of Cheap Charlie and pouring whiskey through a funnel down Cheap Charlie's throat, as the patrons cheered  on the action.           \"Are all the poets in this area crazy?\"   Hank asked. \"Not all of them,\" I said.\"", 
    "review_date": "2007-04-05"
  }, 
  "hSD2Lu8Z_62klnMDND5sSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "Cocktail lounge...more like little dive bar...  This is one of my favorite bars in North Beach.  Amazing too because isn't normally my kind of place.  It's small, there's a pool table (although I don't play), they have Frank and Dean and the juke box, a huge autographed Sinatra poster in the back (which I would try to pilfer if it weren't for the fact that it's nailed to wall - I mean so I'm told!!) and the people you meet here are let's just say...friends of ours...no no, very interesting.  Not pretentious at all.  Only thing is that drinks aren't that cheap considering, but they're about average.  Just a great place to bring some friends and hang out after work.   P.S.  Shshh...they also let you bring in pizza from Golden Boy next door which coincidentally is my fav. pizza in the city!!", 
    "review_date": "2007-06-22"
  }, 
  "Ds9jpl7cz0DEAjo-jbHuKQ": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "GL K.", 
    "review_text": "I love this bar. I drop in every time I'm in town (which, regrettably, is about once every 3 or 4 years).  As noted elsewhere, the jukebox is outstanding, the bartenders are at times gruff, and the stories and conversation swirling around you will make you laugh out loud if you aren't careful (but don't, because eavesdropping is, of course, impolite!) The only problem w/Gino and Carlo's is that it takes a while to be accepted by the regulars, and you have to reestablish this connection every time if you're an out-of-towner like me.  It helps immensely if you bring female companionship with you.  The boys have no problem striking up a conversation with a good-looking woman!  North Beach is wonderful in general, and G&amp;C stands out in North Beach.", 
    "review_date": "2007-12-06"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "It's a classic North Beach bar.  Plain and simple.  Two pool tables, televisions with the game on and booze.  What is not to like?", 
    "review_date": "2010-09-10"
  }, 
  "N9FST4pCuLOgUu9GMixZ7w": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ashley M.", 
    "review_text": "So perhaps I'm being a little too harsh on Gino &amp; Carlo, as I DID stop in for the first time during the North Beach Festival, during which the bar was, I'm sure, much more crowded than it usually is at 1pm on a Saturday. That said, nothing about the bar impressed me.   After waiting kind of a long time at the bar's designated ordering spot, I was greeted by a relatively unfriendly bartender. The beer menu said they had Fat Tire on tap. So I ordered one. Oh, nope, turns out they changed out some of their regular beers for the Festival. So no Fat Tire. Hmm. I saw a bottle of Stoli Blueberry, so I ordered a Stoli Blueberry and Tonic. Turns out they were out of Stoli Blueberry. I ordered my friend a Stoli Raspberry and Cranberry. But they were out of Stoli Raspberry. I ended up with a straight vodka tonic; he had a vodka cranberry. Each drink was $6 and came in a pathetically small clear PLASTIC cup. Apparently they didn't feel like washing actual glasses for the festival. Or maybe we just didn't warrant actual glass, as I did see some real glasses on the bar.  The drinks were fine, but for the price, I felt they were too small by a half and mine certainly wasn't strong enough. I understand that this is most likely a bar where people come to chill out and many customers are regulars (and probably a lot older than me), and that the festival causes an influx of non-regulars, but shit. Come on.   Also, my friend was not impressed with what he saw on their internet jukebox, and a bar with bad music is...well, it's just not where I want to spend my money.   I will probably go back eventually, more because I want to go to a couple other bars in the area and because I think Gino &amp; Carlo's sign warrants a second visit, but if next time my experience isn't exponentially better than the first, this bar will definitely be on my \"pass\" list. The rundown wooden interior was half-awesome and half-trashy, and I guess I need another experience at this place to make a final judgment.", 
    "review_date": "2009-06-14"
  }, 
  "rX_pEbKP_TvyHp4258lrnQ": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Julie C.", 
    "review_text": "Referred here by an older couple we met at dinner, the husband said that if we wanted to have fun then go to Gino &amp; Carlo. Man, was he right!  Off-duty cops, neighborhood Italians, and other local characters made our night. Thinking it will be our yearly anniversary tradition.", 
    "review_date": "2014-10-27"
  }, 
  "Xz0ZWaCAwX6p6mwLKQOJzg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steph W.", 
    "review_text": "This is one of my favorite bars in the city due to it's friendly atmosphere and people. It's always a great time to come here and the weekends are especially fun. The location is the best of any bar in the city, and nothing beats a night here in North Beach.", 
    "review_date": "2011-03-12"
  }, 
  "oYgI-4jEZzuz8hCYKXaHTw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "R C.", 
    "review_text": "Came in to grab a drink before dinner nearby bc it didn't sound super loud. Low key locals bar. Seemed like an older crowd but everyone was friendly. Legit prices and drinks. From San Diego, I would return if it was nearby.", 
    "review_date": "2014-12-12"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "EDITed: December 2007/January 2008  Bartenders are awesome!  A pint or ten of Blue Moon on-tap with an orange slice is why I keep coming back over and over and over again :-)!                    ----------- + ------------- +  ----------- + ----------  May 11, 2007 @ 7:35pm: Fernet shots continued.  After the first one at Amante, Jenny and I headed to Gino and Carlo for our second shot.  Yum.  I love fernet especially with a coke chaser :-)!  Older and local crowd -- very nice people.  It's a fun hangout bar, the music from the jukebox is nice and the bartenders are friendly and funny.   I may come back...  Fernet count at Gino &amp; Carlo = 1", 
    "review_date": "2007-05-12"
  }, 
  "v55YGjXQxe5XISsjue9IMA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dennis C.", 
    "review_text": "Gino and Carlo, a North Beach staple since long before most of us were bar hopping, is one of those great local hangouts that you find less and less in The City.    Good drinks, great bartenders, including three generations of Rossi Family-  Frank, Marco, and Frankie- plus, Frank Colla, Joe Asaro, Sil, and that Irishman Shamus Coyle = great staff! Strong hi-balls!  I just posted a podcast about the bar, \"The Attitude Adjustment Hour\".  To hear some great stories about G &amp; C, please give a listen at <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FbSOhbT&amp;s=30906d47a260129ad40a6854ef072eae5e94508ac7d3e3c318773e474a5f4dbc\" rel=\"nofollow\" target=\"_blank\">bit.ly/bSOhbT</a>", 
    "review_date": "2010-02-16"
  }, 
  "35KhmbouS8gY-eIADqoEgg": {
    "user_rating": 5.0, 
    "user_location": "Keller, TX", 
    "user_name": "Scott W.", 
    "review_text": "It is what it is...stiff drinks and low prices.  Bartenders that don't get on your nerves.", 
    "review_date": "2014-11-11"
  }, 
  "UqkrP5O2ToeXRcYbp7okIA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Cassandra E.", 
    "review_text": "SO funny-- Just as I'm about to mention-- the night was getting a little fuzzy, I look down and see Andrew D's review of G &amp; C's, \" At this point things get blurry....\"  So apparently this is the spot to go, after you've already been to happy hour and dinner! It's a little hole-in-the-wall, dive bar in North Beach with two pool tables and a jukebox! The pool tables and cheap drinks are the highlights of the place. ;-)", 
    "review_date": "2012-04-16"
  }, 
  "TS2j_gt5qugbmQ1R_fq6TA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim B.", 
    "review_text": "If you grew up here, chances are your parents or even grandparents went on a date here. Great old school spot. Bartenders always friendly. I have never gone here and NOT had one of the somewhat drunken locals chat me up about the city. Great spot!", 
    "review_date": "2011-12-23"
  }, 
  "OO7v2zxAQbkj432uve08ow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex F.", 
    "review_text": "I have to say that this place is just right for saturday night. There's two pool tables which are usually busy. Bartenders are pretty attentive. The crowd ranges from 4's to 8's and this is just talking about a relative sampling that i took whenever i came here. Right next to Golden Boy pizza which of course is an attraction in and of itself. Go check it out you've got nothin to lose.", 
    "review_date": "2010-09-15"
  }, 
  "UXhbhFamqWvZB7rEFJgR-Q": {
    "user_rating": 4.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Matt H.", 
    "review_text": "Love this place!!!  I come in with friends who are locals and the barkeeps treat me like I'm family!  What a great spot to meet, have a few drinks and unwind at the end of a day!!", 
    "review_date": "2013-01-29"
  }, 
  "Rnfozp5HL7OTR6rbaDg64Q": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Alvin Y.", 
    "review_text": "No fuss  no muss. Friendly local bar with cheap strong drinks.  Grab a drink here while you wait for Golden Boy Pizza next door.", 
    "review_date": "2013-10-23"
  }, 
  "MQN3EkuSS3c46jgdCflN_Q": {
    "user_rating": 2.0, 
    "user_location": "Novato, CA", 
    "user_name": "Hamburger Yelper O.", 
    "review_text": "I was searching for Courtney Cox and the line for the Cougartown auditions in this place...very snoody, unwelcoming atmosphere.  I credit it 2 stars for providing great beer on tap.", 
    "review_date": "2011-05-28"
  }, 
  "T4E1PMvIF78PKVMXnYcuRw": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Greta R.", 
    "review_text": "There is just something about this place that always draws us back when we are in North Beach.  We always stop by here for a beer when in the area.  Friendly owners/managers.  Lot's Giant's fan stuff in the bar.  It was a favorite of Herb Caan, and the walls are covered with write ups from him.  I'm also a native of Pittsburgh PA and this is the only place I know of in SF that serves Rolling Rock on tap.", 
    "review_date": "2013-04-13"
  }, 
  "gTxigDuZ9BIKmkRsjQ5vMA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Georgio N.", 
    "review_text": "This is the most classic neigborhood bar in North Beach.  If you go there on a weekday afternoon or evening, you will feel as though you were suddenly thrust into an episode of the Soprano's.  And that's the beauty of it.  Molto Bene Gino.  One Jack and Coke please.  Grazi.", 
    "review_date": "2009-03-21"
  }, 
  "_hZnHWlabEMjg58YQpQWHQ": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Ashley s.", 
    "review_text": "Not too bad of a place. The bar staff is friendly and attentive, drinks were perfectly strong, atmosphere was pretty good. There are pool tables located at the back.... Not the best bar in northbeach, but is quieter and has more of a dive feel, if you like that sorta thing.", 
    "review_date": "2009-07-07"
  }, 
  "HxlfP9lbzmaWQf2X2bDOLA": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Kate R.", 
    "review_text": "My dad's uncle used to own this pub way back when. It's not owned by my family any more but I had to go and check it out. I felt like I was home once I stepped over the threshold.  I immediately got a great vibe from this place. The drinks were nice and stiff and music was always playing. I'm planning on going back again.", 
    "review_date": "2010-07-07"
  }, 
  "BdcNkjxcse8y48YISk6low": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael D.", 
    "review_text": "Many good soliders remember the Battle of Jasper St.  Some remember it as spectators to the intense test of wills that took place in that alley, while others only remember it in flashes, half-blacked out.  But the one thing that's remembered in vivid detail by all is that the battle began at one place: Gino &amp; Carlo's.", 
    "review_date": "2011-12-16"
  }, 
  "J7ka23aCUNK-v_yLB4AL1Q": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Justin C.", 
    "review_text": "Probably one of the best stop along Tony C.'s epic pub crawl. Holy Peroni this place was happening. A lot of people all having a ball. The bartenders kept the libations flowing and everyone happy.  A whole lot of Peroni was served to me and I thoroughly enjoyed every single one of the cold Italian brews.  I like to think either Gino or Carlo was serving me but even if they weren't, their namesake was done justice by all their staff.   I will return.", 
    "review_date": "2011-11-09"
  }, 
  "hFvLaKDNHMxHze13Hd-FZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misha F.", 
    "review_text": "Who DOESN'T love FREE, BLUE COTTON CANDY?!  Just one of the perks for using this place's bathrooms...which were tiny and gross.  Bar is small, but miraculously fits two pool tables.  Didn't have a drink here, so I can't speak to the bar tending skills.", 
    "review_date": "2009-03-18"
  }, 
  "3uhNmu9HtIcpUj4F1wnwog": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Karey G.", 
    "review_text": "I love this bar.  The music on the Juke Box is always excellent.  This is a dive bar of the best caliber.  It is usually packed, half old school bar flies, half young partiers of the North Beach type.  The drinks are poured right, and the owners are fantastic (they are usually bartending).  Seriously, you want to know what true North Beach used to be, step in to Gino's for a bit.  It is small, it is dark, it is old.  But if you want a great, old-school dive bar atmosphere, this is the place to go.", 
    "review_date": "2009-10-07"
  }, 
  "WJIEdPeGjP35RScfyRr01w": {
    "user_rating": 3.0, 
    "user_location": "Bellingham, WA", 
    "user_name": "Morgan M.", 
    "review_text": "Fun place wth a pool table in the back, what more could you ask for? Well I could ask for an older man in his mid 40's to not hit on me...apart from that great place for drinks. Definitely an old school vibe to the joint.   Even with a full bar, the bartenders know if you're looking for a drink and are super good on getting you set up.", 
    "review_date": "2009-10-15"
  }, 
  "38zhUVIh6t_-mpcmbWYmiw": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Andrew L.", 
    "review_text": "Fuh-Gedd-a-bout-it. It just don't get more authentic than this place. If you wanna see ten guys named Tony hangin' out shootin' some pool for twenty a rack, this is the place.", 
    "review_date": "2006-06-02"
  }, 
  "ubmbxYDfthzthk3RpjkvlA": {
    "user_rating": 4.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Josie A.", 
    "review_text": "One of my fav places to get my drank on in the city.    It's in North Beach and it is kinda divey, but the drinks are cheap, the crowd is trolly, there are pool tables, and it's next door to Golden Boy so you can get your pizza on, too!  No brainer!", 
    "review_date": "2013-04-23"
  }, 
  "Ou0bxVnxl9m-7aK9GC6EAA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jimmy J.", 
    "review_text": "Where else in The City might one witness Gregory Corso instructing Billy Burroughs, Jr. that it was about time that he got his act together?  (For those who might not fully appreciate it, that's tantamount to having Malcolm Lowry tell you that it's about time that you got your act together.)  I didn't witness it personally, of course, but that did happen here.  (Afterword: Billy Burroughs never did get his act together.)", 
    "review_date": "2009-12-14"
  }, 
  "RmRwmNqsuLx1zCu8LxbAjg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tanner r.", 
    "review_text": "didnt go here for any reason but to play pool....  talk about douchebags galore!!  bartender was cool. drinks average..   but the \"old\" guys playing pool made my night.", 
    "review_date": "2008-02-07"
  }, 
  "qM860LaOe0n0CpBEPQKycQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nicklaus M.", 
    "review_text": "just another bar, not to crowded which is the up side... some 90 year old italian dude started to talk shit to me and ended every sentence with\" i just kiddin, jusss kiddin chinese guy!!!\"  im japanese... but not that it really was worth the argument.... later that night some chick sitting on the front steps got into a fight with a guy at the bar... pretty entertaining... 2 stars was for because its located next door to golden boy pizza!!! oh yeah... cash only suckas!!!", 
    "review_date": "2009-12-01"
  }, 
  "A2mx9xsHoIDNnd81_lxiFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Javi V.", 
    "review_text": "The bar where all those Italian gangsters that you see in the movies hang out. A friendly bunch of locals mixed with the new faces like me that want to play some pool and grab a beer. Cheers!  By the way, I love 2 photos in the wall:  - \"The Sopranos\" Of course. - And a scary \"Muhammad Ali\" taming the bear.", 
    "review_date": "2009-05-04"
  }, 
  "zuQfQeCriglWTzpfHAlYQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi C.", 
    "review_text": "What can you say about Gino's?  It's just the best bar to hang out, be yourself, watch some interesting characters, grab probably the cheapest drinks in town, play a game, watch a game...  Frank is not only adorable, but is a great bartender.  I've been coming here for many years and it never gets old.    A true mix of all types... but mostly old-school North Beachers who, like me, have spent many a memorable evening here. You'll probably run into Carol Doda on a bar stool with five old guys around her... there might be a guy in the corner with a fedora on - straight outta the God Father... a couple of hipsters in another corner eating some Golden Boy... some passionate pool-players - a whole bunch of random people that don't really look like they would party together.  It's an eclectic mix of personalities but that is part of what makes it great.  A true dive, but the best of the best!  What it isn't: pretentious, a place to see and be seen and there is nothing Marina about it.", 
    "review_date": "2014-03-11"
  }, 
  "LtVyiNyp26ikDf-aJULqzQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "David S.", 
    "review_text": "I was welcomed by all and drank a lot of tequila.  This is not a tequila kinda place, especially for a gay (me).  BUT my friend lives in this hood, and we had dinner up the street...so voila....we came.  We played pool, talked to crazy locals who have lived here since 1935, and enjoyed Carlo's easy on the wallet prices.", 
    "review_date": "2007-07-10"
  }, 
  "naMiJotCz8RUL2dGSOYNrg": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Rachel P.", 
    "review_text": "I'm a dive bar kinda girl and this place totally made me happy.  It had everything, a good jukebox, regulars, a few local crazies, history all over the wall, pool tables, and great bartenders with a heavy pour.  You could actually talk to folks and we met so many great people there. We had planned to bar hop but found a home away from home.", 
    "review_date": "2011-08-30"
  }, 
  "yO_2xJ7FUUdOpD8iR140dg": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Will T.", 
    "review_text": "Gino and Carlo's is a laid back North Beach institution. I love it! You feel more Italian just by walking in.", 
    "review_date": "2014-09-11"
  }, 
  "-y1Ah0CnZgPhMAf0qAFrXg": {
    "user_rating": 5.0, 
    "user_location": "Clovis, CA", 
    "user_name": "John L.", 
    "review_text": "This is the neighborhood, Native of the North Beach. Many shared memories with friends and families. Party and enjoy good times. Great place to social for the sports, hang out have a slice of pizza from next door. Listen to the tempo of the night. Its a great place to feel like your in.", 
    "review_date": "2011-07-09"
  }, 
  "HXg2CJgKwdYUvjb9pZ5eOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary B.", 
    "review_text": "My favorite place to be stranded on a rainy afternoon in North Beach.  Drinks are strong and cheap and it's mostly a local crowd.", 
    "review_date": "2005-05-24"
  }, 
  "z5VGf197EBrPyqKYtlmP1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Der Maibaum L.", 
    "review_text": "This place is for sure a San Francisco Treat!!! I came here with my buddy Douglas to have a afternoon Happy Hour Cocktail and we were greeted by Dick the bartender, who was ever so entertaining....he sang to use along with the jukebox. Which by the is very classy. Dick had also invited us to his show, he was performing with Carol Doda. How cool was that....!!  I just love the vibe....you got the old timers and the wise guys playing pool and having a brew on mid afternoon. Also its a great place to hear stories of San Francisco and what was going on back in the days at Gino &amp; Carlo Cocktail Lounge.....Its Historical!", 
    "review_date": "2007-03-29"
  }, 
  "V_b--iGfFWQF6ntuS7Ey0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve M.", 
    "review_text": "Simply the best!", 
    "review_date": "2013-06-25"
  }, 
  "5_gbaJzM9w_oAvLf7ARBWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick T.", 
    "review_text": "Like walking into the North Beach, Italian version of Cheers,. We were probably the only people the bartender didn't know by name, and the only ones in their under 50.   Everyone in there was just having the best time, joking with the bartender, playing dice at the bar. It really felt like there was a community that was based around it, and although we weren't part of that community, I am glad I was able to witness it first hand.   Downsides: All their pool cues were 21oz, and the mixed drink glasses were a little small.", 
    "review_date": "2014-08-03"
  }, 
  "ccQvyiUeqsXhweY2hHrHAw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Adam Z.", 
    "review_text": "Old school, SF. As the signed poster in back says:   \"To all my friends at Gino and Carlo's,   All the best,   Frank Sinatra\"  Also, the pool players here are gods.", 
    "review_date": "2009-11-19"
  }, 
  "-Ol68iR6TncLIj4as8_Vcg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hanan H.", 
    "review_text": "Do you like old man dive bars with cheap drinks, next door to a pizza joint? If not, then you suck. No no, i jest. But Gino and Carlo is super chill and fun laid back dive to end the night. There are literally old men, playing cards. This is the place to embarras yourself and no one will care.", 
    "review_date": "2009-07-27"
  }, 
  "l0PYkotRgNgz4ZqAjGFzPg": {
    "user_rating": 3.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Rachelle T.", 
    "review_text": "This is our \"waiting bar\" for Sotto Mare. $3 for a Bud Light isn't too shabby for North Beach. This is a dive bar with plenty of TVs and seating. They advertise food on certain days but I personally try to stay away from food at places like this.", 
    "review_date": "2012-07-08"
  }, 
  "ujTwruINsgwvzW9YgGdx2A": {
    "user_rating": 1.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Jeff T.", 
    "review_text": "Was part of the pub crawl that was offering $2.50 drink specials. Asked if Spaten was included and was immediately poured a 12 oz Spaten and charged $5. It's clear he heard me and that I didn't order yet. Bartender didn't even asked if I wanted it.  Obviously caters to regulars and could care less if you're not one.", 
    "review_date": "2013-04-15"
  }, 
  "POgjT5AOs_9xLqS1EFnAYA": {
    "user_rating": 1.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Shari F.", 
    "review_text": "This place stinks, and not just because it smells bad inside!  It's full of old geezers who think they're part of Tony Soprano's gang and like to hit on any younger (under 60) woman who walks into the place.  The drinks are weak, and the bartenders ignore you unless you're a regular.   There are plenty of other great places around North Beach to give you that old school vibe, without being creeped out and hit on by ugly old men, or cute married men (trust someone who knows - ANY good looking guy in there who hits on you is married).   If you want to pretend you're all mobbed up and talk about puttin hit's out on your enemies and f*&amp;^ing broads on your boat - this is the place for you. If you're looking for anything else, there's waaaay better places to hang than here!", 
    "review_date": "2009-10-27"
  }
}