{
  "nbCHvdy3KCi7t-i4xlNn8Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Millie A.", 
    "review_text": "Thank you Grumpy's for your fight to remove Off the Grid from our lunch-less neighborhood.  Thanks to you my options have whittled back down to approx 1 subway, 1 sandwich spot and 2 cafes.  such a plethora of options, it's fantastic!  You guys are assholes.  p.s. I haven't eaten at your restaurant in 2 years due to the poor quality of your burgers and limp frozen french fries.  Double disappointment.", 
    "review_date": "2012-06-14"
  }, 
  "SUq3r0GXuAO-je66Dj03KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenny W.", 
    "review_text": "I can't believe I haven't written a review about the best after work bar in the city (or at least in Multi-media gulch).  Grumpy's is a great place to wind down after work during happy hour. They have HH specials all week. It's also a great place to eat. From their appetizers to their burgers and salads, their food is delicious. Just note, that you cannot get a salad after about 5:00 pm. But why would you when their burgers and fries are amazing. I've heard their turkey burger is one of the best in town. I have never eaten it myself, but I trust the folks I've heard this from.  Drinks are their specialty. But not in terms of fru-fru drinks like Mojitos, but real drinks like Vodka &amp; Soda, Jack and Coke, etc. From Monday - Wednesday (I think), you can get a shot and a draft for $7. They have a list of liquors that you can get for the shot.  Friday's special is usually 24 oz Tecate beers for something like $3! That's just plain crazy!  But the most amazing this is they just started carrying Miller High Life! The Champagne of Beers!   If you work (or live) in the neighborhood, you should wander over to Grumpy's for a drink or two. The place is nice, the bartenders are great and the regulars are a colorful bunch. Sit at the bar and an interesting conversation is minutes away.  Cheers!", 
    "review_date": "2010-03-12"
  }, 
  "XpmEAF_BONORa64-17Moxg": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Allison G.", 
    "review_text": "Pretty great spot for a hangover cure.  This is a wonderful place for a vegetarian because you can make any of their specialty burgers into a veggie burger (or grilled chicken, or a turkey burger...).   I most clearly remember the Greek- with avocado, cucumber and feta- but I don't like the mushiness of the avo (more like guacamole).  I'm leaning towards the regular, no-fuss veggie, with good ol' mustard and catchup these days.  It's very good!  Also, there is something to be said about their \"side\" salad, which I normally get instead of fries.  It's a huge pile of greenery, with all sorts of beans, veggies and hard boiled eggs on top.  Get the balsamic dressing-- it is tangy and a little sweet and PERFECT.  One odd thing I notice about this pub is that no one ever knows how to make a black velvet.  Hm...", 
    "review_date": "2008-01-28"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "i bumped into this hidden little bar one day and boy is it hidden. its right near all the TV stations and always has just enough people not to feel empty. great beer selection.", 
    "review_date": "2005-04-25"
  }, 
  "M6vv_thbXnji_EF_Gq1P2Q": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Gail N.", 
    "review_text": "Alright. It's not just the beer.  But their food is excellent!  Cafe Sprout Turkey Burger (for only about $10) = the best turkey burger I've ever had!!! Topped with sprouts, avocado, and monterey jack cheese. It comes with a side of fries, potato salad, or mixed greens. Even the side salad is great! -- Fresh greens topped with garbanzo beans, kidney beans, and olives (the balsalmic dressing is great!)  I don't know where they source their burger meats from...but man is it juicy!  And those $1 garlic fries during Happy Hour (Tuesdays) are delicious!  Great food at a great price + friendly, smiley service + large selection of beers = 5 stars.   So happy this place is just a block from work!", 
    "review_date": "2010-03-19"
  }, 
  "-RF8CPXzDESEwNuPZ4QHhQ": {
    "user_rating": 5.0, 
    "user_location": "Davis, CA", 
    "user_name": "Aleks P.", 
    "review_text": "Love this place!  You have to check it out yourself.  Burgers are delicious.  Bartenders are friendly.", 
    "review_date": "2014-09-04"
  }, 
  "FocjwNt9GbOSln9iFCFwtQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yee-Shing W.", 
    "review_text": "Love this place! Great burgers, yummy fries and awesome service.   They have about 10-12 different types of burgers and I think all are $9.95. Forget being healthy and forgo the turkey, veggie, and chicken option...stick with the beef patty! At least try it once! It's juicy, flavorful and substantial.   I hear the happy hour is good too. You won't leave grumpy! ;P", 
    "review_date": "2010-09-17"
  }, 
  "8vOYRdOpxEcxK17DA4-6eQ": {
    "user_rating": 5.0, 
    "user_location": "Newark, DE", 
    "user_name": "Marc C.", 
    "review_text": "Loved this place. Small bar with a great craft beer selection.  Spoke to Kevin (I think he was the owner), who was tending bar.  Very cool dude that is one reason I'd go back to SF for another vacation. Place has great atmosphere.  Mostly locals were there.  I could have stayed for hours.....it's that kind of place.", 
    "review_date": "2014-09-28"
  }, 
  "DyiSA0yxVGN8zSRaYHoyMA": {
    "user_rating": 5.0, 
    "user_location": "Singapore, Singapore", 
    "user_name": "Joseph T.", 
    "review_text": "The macaroni and cheese here is to die for. I have been to Grumpy's a dozen times or more, and would kill for their mac and cheese recipe. You can substitute anything off the sides for it, and I highly encourage you do.  The burgers are awesome; fat and juicy. The fried chicken, lamb and trout items at the bottom of the menu are worth exploring, and reasonably priced. I had the grilled trout today, it took forever to come out, but it was good. Not sure if the bar girl took it off the bill because it was so late, or it was late because it never made it on the bill, but either way, it was free. Luckily they had some Fat Tire and Anchor Steam on tap, to while away the time waiting.  Overall, a great place, well worth the trek to get there. Just for that rich mac and cheese...", 
    "review_date": "2007-12-07"
  }, 
  "1U2UScZKrZKKfwX9phTENA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keith J.", 
    "review_text": "It's been a great day.  It's been a shitty day.  It doesn't matter, if is a day that requires a scrumptious, delicious, salivating burger with tasty onion rings and a cold beer....this is the place to hit.  Based in the 'ad ghetto' of the city, this pub is an animal to deal with on a Friday evening as all the local ad agencies flock here.  But if you can elbow your way to the bar and belly up, you're in for a treat.  If you have read my reviews, I love places that are simple, have attentive staff, genuine + low-key patrons  and well cooked food.  I got the baja burger on this particular trip, but I'll be back to destroy each and every burger on their list.  See you there.", 
    "review_date": "2012-03-18"
  }, 
  "O2WfOgwdSxIl-4UkqY88dA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna S.", 
    "review_text": "This place has the best turkey burger in town! Around my office, Friday is known as Grumpy's Turkey Burger Day!", 
    "review_date": "2006-03-15"
  }, 
  "4IjzfbO7XKFNWWVufHNhww": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalie N.", 
    "review_text": "I'm a Grumpy's convert. Great local happy hour that includes $3 Tecate tall cans on Fridays. Yummy all beef hotdogs with cheese and onions. Incredibly crowded during weekday lunch unless you get there at 11:45 or earlier. Good crowd overall and friendly bartenders.", 
    "review_date": "2010-06-23"
  }, 
  "f_Gs3jGb32G5p-9EO4UYAw": {
    "user_rating": 4.0, 
    "user_location": "Folsom, CA", 
    "user_name": "Alan B.", 
    "review_text": "If you can handle the cacaphony of noise that's continually at maximum volume when the place is full, this is an awesome place to go with a friend or two.  I've been here twice strictly for the food (I don't drink) - both in the early evening during the week.  The first time I had a killer burger, the last time it was a chili dog.    Now neither of those is very healthy for someone who is really needing to eat only health-type foods.  Yet Every once in a while I just want to chow down, and both times, Grumpy's has hit a home run on that count.  Simply extraordinary food.    Now if there were just a way to get the volume down 6 notches from all the people talking...", 
    "review_date": "2010-07-04"
  }, 
  "hzJpuehCf7OR_UwEB9O5xw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica W.", 
    "review_text": "I left Grumpy's a little grumpy.  Their burgers are mouthwatering.  I usually order the Baja and it never disappoints.  Their fries are good as well.. not the best out there but I like them.  Their service though leaves something to be desired.  I've always gone when it was super packed so I figure their service suffered due to the overwhelming amount of people.  But when I went today, there were only a couple other tables and it was still difficult to get our waitress to make an appearance at our table.  We eventually had to hail down the busboy to get us refills and to-go boxes.  And on that note, they charge for refills.  I don't know a lot of restaurants that still charge for refills so I'm not a huge fan of those places that nickle and dime their customers.  Burgers are on the pricier side but like I mentioned at the beginning, they are mouthwatering so I would definitely still order their burgers.. but maybe just to-go.", 
    "review_date": "2009-10-07"
  }, 
  "-gJJzPghhC_gwHT-D8wlKQ": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "C D.", 
    "review_text": "This place was pretty good I think I had a mushroom burger, It was good but not cheap. Ambiance is great, seems like there's a heavy lunch crowd, maybe get there early if you can't take a long lunch. Seems like a more fantastic location for drinks after work.  It's a bit far for lunch from work for me, but I met a friend here on the day I went. I probably wouldn't come back unless I was meeting friends.", 
    "review_date": "2011-01-03"
  }, 
  "06d53g0Qttz1MlgP6VUYCg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jessica B.", 
    "review_text": "I came here last week for a quick bite to eat and loved it! The food is delicious and the bartender we had was very polite. Would definitely come here again! Also love the small cuteness of the place!", 
    "review_date": "2013-08-19"
  }, 
  "a4Og4FjZAdjwxNhb1bp1xw": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "naps v.", 
    "review_text": "This is the best pub ever... I love the bartender guy that works there, he's super cool and super nice.  Most bar tenders are usually rude when it's busy, not here!  I love their fries with bacon, egg and cheese on top!", 
    "review_date": "2013-06-07"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "Total ad bar as proven by the many namesakes on the walls but every good ad bar has an equally good hangover menu because ad people, well they drink.  For a hangover, there can be fewer better things than the super burger. Juicy burger done the way you like it topped with cheddar cheese, bacon, and a fried egg. Some call it breakfast, I call it recovery. For less woozy days, explore their many other burgers. I like the Popeye - sautéed spinach and feta cheese. Decent pub food overall. They have decent fish and chips here although the wait for that during lunch was really long. Speaking of waits, forget about getting a table during happy hour as Grumpy's will be packed with folks enjoying post-work happy hour specials like a beer and a shot for $7 Mon-Wed.  Decent pub with equally good pub grub that is worth a stop in if you're looking for a watering hole in the neighborhood. Just be warned that it does get very crowded on weeknights.", 
    "review_date": "2014-02-27"
  }, 
  "W7DI4hNfWCw1ymJh98plhA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Chanel C.", 
    "review_text": "Really cool dive that can get a little crowded. There are lots of tables, but you have to suck your gut in and squeeze through the crowd to get to one. The restrooms are clean...surprising for a dive bar.  Beer selection is super weak, but they have a full bar to make up for it. Fun place to get drunk and watch a game. I didn't try the food, but it looks like they have a breakfast menu. A bar that opens for breakfast? I love it already.", 
    "review_date": "2013-07-30"
  }, 
  "cTrlhfni7C3xFlyIL3x1bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luba P.", 
    "review_text": "Came here last week on a very rare, hot day in the city. The outdoor seating was perfectly shaded and I was lucky enough to snag a table. It was lunch hour and really busy so the service was spotty but the great food and family-run business feel made up for it. In an area surrounded by high end restaurants and overpriced menus its great to have this place as an option.   I had the BBQ bacon cheeseburger and it was REALLY good. Hopefully next time I come back I'll be as impressed with the services as I was with the food.", 
    "review_date": "2012-04-25"
  }, 
  "0CqAmHUSWPEQdrnCbDiaVA": {
    "user_rating": 4.0, 
    "user_location": "Marina del Rey, CA", 
    "user_name": "Brian B.", 
    "review_text": "I was very pleasantly surprised by my visit to Grumpy's!  We were starving, after eating a gross 2 bites of breakfast at 11am, and made our way into Grumpy's around 5pm.  I ordered us some onion rings to get the hunger edge off, and they were cooked perfectly and very tasty.  Next, we both ordered some burgers.  I'm not gonna lie, I had low expectations for this random pub that was a little bit grungy all by itself on a random street in SF.  The burger, though, was AWESOME.  It was perfectly cooked, very tasty, and hit the spot nicely.  ANNNND...I'm about 90% sure that it was NOT just because we were starving.  I had the western burger, and BBQ sauce on it was great, particularly in combination with the bacon, cheddar, and onions.  Very good show, Grumpy's...  My friend had the California Burger (I think), which was decidedly less epic, but still cooked to perfection, juicy, and tasty...  The fries were pretty good, and the bar staff were super friendly, both in taking orders, answering questions about the menu, and in answering our questions about the cable cars and other touristy things.  Well done, Grumpy's.  You exceeded my expectations, and I thank you for that...", 
    "review_date": "2011-07-08"
  }, 
  "efoyeP8akhgtwJm-hI_hsA": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Mike W.", 
    "review_text": "BREAKFAST !! - if you dare :-) seriously, they serve up a great breakfast (bacon galore) even if you don't have a hangover, you should try it out", 
    "review_date": "2013-06-28"
  }, 
  "EMXuxsOgR1jp8FctD3limQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh A.", 
    "review_text": "I would give it 5 stars but it would detract from my yelp legitimacy. Great for happy hour--just out of reach of the financial district so not a lot of suits (not that there's anything wrong with that). Great ambiance and crowd--great staff--simple...the way a bar should be.", 
    "review_date": "2011-01-04"
  }, 
  "5BdMZJKYHopQ1ijvTRqnbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy L.", 
    "review_text": "The burger was slightly bigger than average.  The service was extremely fast, but then again I was the only 1 at the place.  I definitely want to return for happy hour, and they have a $4 margarita special on Thursdays from 4pm til closing.  Too bad I had lunch at 2:30 and still had work to return to.  I like their thinly cut fries and they had a large selection of alcohol, but I had to settle for a bottled root beer instead.  They have a good selection of rock music playing too, and their trap door which was right by my table was a nice touch.", 
    "review_date": "2008-04-24"
  }, 
  "eo0tmepvnDLQfpY2O78o_A": {
    "user_rating": 5.0, 
    "user_location": "Chico, CA", 
    "user_name": "Sam P.", 
    "review_text": "One of the best \"scecret spots\" in the City and even though its in the Financial, you'll see guys in suits sitting next to bike messengers and such.  They got Fat Tire, Fernet, decent whiskey and good burgers-what more could you ask for?  Order your fries \"Patrick Style\" if you want 'em crunchy!", 
    "review_date": "2007-10-18"
  }, 
  "HgHQKADOWOsBPsNv4PpLqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "keith t.", 
    "review_text": "Good drinks.  Good prices.  Good place to unwind at the end of the day or grab a really good burger and fries.  I work in the area and have been coming here off and on for the past couple of years.  I usually go in for a quick pint or two in the evening.   I have noticed the  food has been getting really really  good in the recent few months. Before the quality of the food was just okay.  But now-whatever these guys are doing in the kitchen is working.  Everything seems to cooked to the right temperature, juicier and plain just more fresh.    Try the Super...hands down one of the best burgers in San Francisco.", 
    "review_date": "2010-04-12"
  }, 
  "SQ9ermj-wUcEc9lCojEiOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty D.", 
    "review_text": "This place has the best burgers. The service was a bit slow because of the lunch hour rush, so get there early if you want to be served quickly.  Great place also for after work drinks.", 
    "review_date": "2006-10-03"
  }, 
  "VS2UhdMT4zFx4c_wUClDzg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren W.", 
    "review_text": "This place is small and gets packed quick. Good happy hour. We were there on a Friday and can't beat the $3 Tecates.   I have been here for burgers and fries and it sooooo delicious.   Looking forward to another happy hour here, although I will have to arrive early to get a good seat.", 
    "review_date": "2011-03-18"
  }, 
  "GTmTZsReNNLRpp77C06iQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "Super busy bar during after work/happy hour time, but service was amazing. Bartenders were very attentive, even though the place was packed and spilling outside. Food was delicious and affordable too.", 
    "review_date": "2015-01-12"
  }, 
  "KfEgttGxJOtUgq2baEt0QQ": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Becky U.", 
    "review_text": "This is a small local American Pub with friendly staff members, great food and a full bar.  There is seating available outside, and heat lamps when cold.  When you first walk it, especially during lunch (11:30-1:30) it can get pretty loud and crowded.  Especially during a SF Giants day game.  Those days, I would just call in my order which will take 10-15 minutes.  Which really means 20-25 minutes. LOL.   I come here for lunch, lunch meetings, etc.. because its across the street from where I work.  I recommend trying their fish n chips.  It never seems to fail my hunger.   You also have the option to cook your burger meat to order, I like it medium rare, bacon cheese burger is good.  Also, they have a good menu for breakfast as well, in this case I suggest ordering the corn beef hash with egg.  YUM! I am curious how their happy hour is because the pricing seems fair.  This is probably the place to be in this area during St. Patrick's day or during our local SF Giants Game Day.   This is always a convenient stop for me during a busy work day.", 
    "review_date": "2011-07-07"
  }, 
  "Jo-YXrLSHok2c_eHvEFyZQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Shaun R.", 
    "review_text": "I had a great lunch at Grumpy's today.  I was looking for a perfectly poured pint of Guiness and something good to eat.  Grumpy's delivered with an excellent turkey pastrami reuben.  The house salad instead of fries was great, too (lots of good stuff, not iceberg lettuce with a tomato wedge).  And, the service was great, with a friendly staff.  I'll be back.", 
    "review_date": "2008-10-22"
  }, 
  "kitAOxUSgFGhR3JLPrDCvg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lester L.", 
    "review_text": "One of the better places for lunch in the neighborhood. Good burgers and salads. Once upon a time, I was pleasantly surprised by their fried chicken too. Their Guinness is a hit or miss though, a few times it was sour! Blech.", 
    "review_date": "2007-12-18"
  }, 
  "BrETNZLefIOtiqcNX2pdrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan K.", 
    "review_text": "Media, Agency, Digital worlds collide with drinks and food. They close early on weekdays but have beer + shot specials.", 
    "review_date": "2013-10-11"
  }, 
  "1iEcnM2SMRms5xEkU8mavg": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Vivi F.", 
    "review_text": "I work around the area and once in a while when we get tired of other stuff around we go to Grumpy's.  The burgers are very decent and I've found both the fries and salad that come as side dishes really good.  The only complaint I have about this place is that they are slow. I mean, like sitting down and waiting about 20 minutes to get someone to bring you water and take your order. The wait staff always looks like they are in a frenzy but then when they do come over, they don't bother to apologize for the wait.  And speaking of wait, the place gets packed at lunch time and you can wait up to a half hour to get a table. They also like to do the \"do you mind sitting at another table so a bigger party can take this table\" B.S. and I can't stand that. The other day I saw them doing it to people who had their drinks already. Pathetic.   So if you're going for a super early or super late lunch it may be a good experience. If you're going between 11:30 and 1:30 have a snack before heading out.", 
    "review_date": "2008-01-09"
  }, 
  "1g_ajkmxzivqpY8E9s9sgQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Erich V.", 
    "review_text": "Everyone says you should try the burgers and it's true, you should.", 
    "review_date": "2012-06-21"
  }, 
  "ow7QOpOgeKpYNugrzLLk8A": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "Shell I.", 
    "review_text": "This review is for lunch only.  I havent tried it for drinks...yet. Walking in you see that it's not a very big restaurant but feels more homey than bigger pubs. We noticed that the ceiling had lots of dollar bills pinned to it. We were told that it has to do with happy hour held long ago.  Our server was friendly. I ordered the tuna melt, mac n cheese and fries. The mac is your typical pub mac and cheese. Runny cheese sauce poured on top of elbow macaroni with a sprinkle of black pepper. Tuna melt was better than average. Layered with caramelized red onions and cheese. Tuna is browned on one side which adds dimension to the taste as opposed to your typical tuna heated on bread with cheese. Fries were typical too. Kinda soggy.  The tuna melt was the winner and will bring me back.  If you're looking for a more cozy pub, check this place out.", 
    "review_date": "2012-07-26"
  }, 
  "vWpe19iYR30nE8JvBtjwKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yelper A.", 
    "review_text": "Why would anyone name this bar Grumpy's?  Nothing grumpy about it!  Although a little dangerous on the Friday happy hour scene....that wouldn't make anyone 'grumpy' per se...\n  Cute little hideaway near work and best turkey burger I have ever tasted!", 
    "review_date": "2006-03-31"
  }, 
  "Z6cvyZxAIh-WpsQ2I32i5w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah S.", 
    "review_text": "Ugh. So torn.   Service: 1 star Food: 4 stars  What's a gal to do? Honestly, I don't think I've ever come here where there wasn't an absurd situation with the service. Like, forgetting to put bacon on my bacon cheeseburger. Or not bringing out the second round of beers we all ordered. Or forgetting my side of ranch (EVERY time!) Or just not coming to take our order...period.  But......the burgers! Ah, they can put a smile on anyone's face. Even the faces of those who have been snubbed by rude servers who claim you can't split a bill 2 ways.  So fine, 4 stars.   Tip: Get the turkey burger Baja style (comes with avocado, cheese, bacon, and salsa). For some reason I prefer the turkey burger here!", 
    "review_date": "2010-02-24"
  }, 
  "jy-YyFaGgbzuoJe6nMBDYw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Adrienne G.", 
    "review_text": "I like the Turkey burgers and the pitchers of beer.", 
    "review_date": "2008-01-17"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "This is just a pub!  Ok three stars for effort.  We had a customer meeting and we were about two hours early, so the Sales guy had to bring his engineer (ME) and our boss here.  Perhaps my East Coast boss was impressed, I was NOT.  Enough of having these geeks or biz people from boring USA cities to tell us where to go .. this was ... OH LAWD!  Coooooooooooold at nooon, we waited forever for our FATTY BURGER!  Point?   I don't know.. I should shut up!   Not everyone are expat kids who know the worldly thangs.  Oh well, ignorance is abundant in AMERICA!", 
    "review_date": "2008-12-22"
  }, 
  "OxfZD8hXKwy6n73QFRBoeg": {
    "user_rating": 5.0, 
    "user_location": "Downtown Oakland, Oakland, CA", 
    "user_name": "Stephanie L.", 
    "review_text": "Awesome food. Dive bar atmosphere. Great bartender/ wait staff. Bartender accidentally dropped a burger and gave it to us on the house. The replacement came out quick. He was extremely apologetic. I ordered a Baja Burger complete with avocado, bacon, \"jack,\" and fresh salsa. It was delicious! One of the better burgers I've ever had. Very fresh ingredients. The people I came with got other burgers and loved them too! The onion rings and potato salad were excellent as well! I highly recommend it.", 
    "review_date": "2013-08-02"
  }, 
  "6MaQYVeeS2kjXFIcNpdYBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John B.", 
    "review_text": "Had a great turkey burger here for lunch the other day.  Service was quick, especially since they were pretty busy due to the baseball game.  Anyway, I'll be back for the PBR and a shot of whiskey special.", 
    "review_date": "2012-10-18"
  }, 
  "vvfmy5F2AZVkO3XThVqQGA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "matt l.", 
    "review_text": "Awesome burgers for sure, any place that will add a fried egg to a bacon cheese burger is ok with me. Just don't try to move too fast for a few hours after eatiing one.   Try it out on a Thursday evening for 4$ pint glass Margaritas.", 
    "review_date": "2006-08-08"
  }, 
  "WJgvuMABGNSFhioQXvaFxw": {
    "user_rating": 5.0, 
    "user_location": "Guerneville, CA", 
    "user_name": "Shawn B.", 
    "review_text": "Love Grumpys! It's my go to place after work. The bartenders are great, they make you feel right at home. Foods great, you can hang out in the street &amp; drink beer while chatting with the locals. I highly recommend it!", 
    "review_date": "2014-08-11"
  }, 
  "B33KEetBrqpnJbQZetY3sQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beau G.", 
    "review_text": "Back in the dot-com boom (version 1.0) I worked across the street from Grumpy's in the two story brick warehouse.  It was great.  We used to call Grumpy's our satellite office because so many people would relocate there for \"heavy thinking\" during the day.   I had Grumps on speed dial in my office so I could order up a hot dog for lunch (though they changed suppliers on those and the quality went rapidly downhill for no reason).   I remember when we'd throw massive parties in our company and people would shout down to the people drinking at Grumpy's that we had free booze, and yeah, we did.  I had never drunk to excess (I was a deprived child) before my nights at Grumpy's, but that bar put me down a path to a more interesting life.  Those were good times.  They didn't last.  They never do.", 
    "review_date": "2006-10-18"
  }, 
  "1IJQuwcmtWbMZKDvZD_rdw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "erick m.", 
    "review_text": "yeah theres a garbage can in the front of the place. yeah you get bad service if you ask stupid ass questions like splitting bills or my hamburger isnt 'garnished right', or the funniest one, 'im not comfortable in my table. can i take that table for 4'? its a busy ass PUB you asses. what do you expect?  but like it or not, this place has one of the best burgers in the financial district. thats why its always busy. ive never recieved bad service here, never had bugs on my salad,  or had anyone of these good, down to earth people 'roll' their eyes at me. maybe its cause i dont act like a trust fund baby and expects them to wipe my mouth for me.", 
    "review_date": "2008-08-04"
  }, 
  "3IBoCe--upk24sxjM-xcxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John R.", 
    "review_text": "If I had to choose a last meal, it would have to be a hamburger.  Interesting way to start off the review, I know, because now it's probably automatically assumed I have named Grumpy's as my favorite hamburger of all time...anyone reading my reviews must know I love hamburgers...  Well they do make a great burger.  I never go crazy with the specialty burgers here.  I've been about 4 times or so.  I just love the basic cheeseburger and having a beer.  It's just solid.  It's a fun little pub near the Embarcadero with a cool staff, atmosphere and a solid burger.  Not sure I can drag the review out much more than that.  So is it my favorite burger of all time forever and ever? I know everyone is wondering. K, good talk.", 
    "review_date": "2011-11-06"
  }, 
  "7S6geHhDFDexPPl611n9jQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian S.", 
    "review_text": "SF's hidden gem. Best burgers in town. Meat melts in your mouth. If you are trying to watch your girlish figure, the side salad is huge and tasty. I would recommend the Super burger. Fried egg, bacon..... heaven.", 
    "review_date": "2013-03-01"
  }, 
  "fGkpW1GpmRUQ4E3vEJTn8w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara H.", 
    "review_text": "I first discovered Grumpy's several years ago when a friend and I were wandering around town on a Friday afternoon and happened by it and decided to go in for a beer.  Fast forward to bartime: we're still sitting at the bar with our new buddy, Jimmy, the bartender.    While Grumpy's didn't exactly become a regular haunt, I do still enjoy going there.  The food is good as well as the beer selection, and the bartenders are friendly.  I went for lunch the other day and found that the table service wasn't great, but you can order food at the bar and I've had good service when I've done that.  If you work in the FiDi or Embarcadero area, Grumpy's is a great place to go for a beer after work.", 
    "review_date": "2008-01-06"
  }, 
  "e4GGA7zthQuR0OVpV8EpLg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Misha N.", 
    "review_text": "I work next-door to this place and love coming here with coworkers and friends on occasion.  Great drinks, great food, great staff. I rate things relative to my expectations and this place exceeds my expectations in terms of food quality and other things overall, so I give Grumpy's a 5/5.", 
    "review_date": "2012-10-28"
  }, 
  "EU2V6NOtkDkMtbIJEeEjzw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Christina S.", 
    "review_text": "Great neighborhood feel - even in this non-neighborhood part of town.  Surprisingly good food - burgers are great, as are salads.  Wine is terrible, but then who goes to a pub to have good wine?  Great cheap beer on tap and bottles - every seems to know everyone else's name.  A great place for lunch or happy hour - no pretense and a good place for groups of friends.", 
    "review_date": "2006-02-26"
  }, 
  "qdXv5FlK9QQiqkr1Cb3LxA": {
    "user_rating": 5.0, 
    "user_location": "Hong Kong", 
    "user_name": "Patrick T.", 
    "review_text": "Great burgers!  For the price I rather eat here than bistro burger anyday.  My personal favorite is the baja burger medium rare.    nice piece of meat with bacon cheese and salsa over the top.  Choice of potato salad, green salad or fries.  Fries are always packed in the container when you arrive to they retain freshness.  Drinks are cheap and strong.  Definitley a great burger joint.", 
    "review_date": "2008-01-10"
  }, 
  "LEho8AFSA-H6M9SekKxb_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maggie L.", 
    "review_text": "Their burgers are soooo dammmnnn goooood!  Everytime, the burger patty is cooked perfectly.  It's never burnt, never too bloody, and always juicy.  The burger and fries portions are huge!  I only eat at this place when I know I can be in a food coma for the rest of the afternoon at work.  They do tend to take a little longer prepping your food.  I've done a few sit downs there, and it'll take a good 20 minutes for your burger to come out.  They do take phone orders, so I recommend that route if you're in a hurry.", 
    "review_date": "2009-04-24"
  }, 
  "cCPjASKs5YpMB4BmN2oSZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike H.", 
    "review_text": "The two guys sitting at the bar next to me have been coming to Grumpy's for years, and were quick to offer tips on good apps there: skins and onion rings. However, I was there solely to try the bacon cheeseburger. Fortunately, they acknowledged the burger section as the best part of Grumpy's menu. Keep in mind that we're talking pub food; fanciness isn't expected, but rather good quality for a good price.   You can't help but like a bar full of local media/advertising people who want to talk about anything but work. Personal pinions spill out after being sewn in by a long day of objective or targeted speech. Grumpy's is a straightforward local pub that will continue to be popular for years. And while my fun experience there made me want to like the burger a lot, I can't say it's one of my favorites from this burger quest over the past nine months.  The sesame bun was average and the patty itself was cooked medium rare, not medium as ordered. That's ok, because the bacon was present in every bite, and the juice from the patty and toppings filtered down to my fries, just as I'd hoped. The fries themselves were decent, roughly on par the burger.   Overall, Grumpy's should never disappoint, especially if you get a burger there. Go there for a beer and stay for a couple more. Order one of their specialty burgers if you're looking to be wowed, and consider the sauteed mushrooms, which seemed to be a popular topping.", 
    "review_date": "2012-04-20"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Good for drinks after work. Decent burgers at lunch, ok fries. I liked the variety of options for the burgers as well...", 
    "review_date": "2005-12-04"
  }, 
  "beYxtgReTb09Dsg-4mH4SA": {
    "user_rating": 5.0, 
    "user_location": "Orangevale, CA", 
    "user_name": "Aimee W.", 
    "review_text": "Amazing burgers, wonderful staff, good pricing for such large portions!", 
    "review_date": "2015-01-19"
  }, 
  "gApyjyiWkbCCsoA-XBWe8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stella E.", 
    "review_text": "Went there with my ex qiwi boyfriend for their happy hours. Have you tried their burger and fries yet? They were absolutely delicious. It was crowded...so we had to stand the whole time...after drinking 3 tecates..it is no big deal.", 
    "review_date": "2011-04-28"
  }, 
  "J0G7SAItOT4opuLSK2-tmw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody L.", 
    "review_text": "The food is good, but like their name foreshadows, the employees are majorly grumpy. This was some of the worst service I've received, from the waitress throwing down napkins and utensils on our table to her unprofessional behavior during the payment process (Oh, wait, you guys paid $100? *Removes some of the change she gave to us).", 
    "review_date": "2012-04-28"
  }, 
  "y3b74lGLewd-591KO4uYeg": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Chris Y.", 
    "review_text": "Used to eat here for lunch when I worked in the financial district. I would always build my burger and have a side of garlic fries. This place is very loud, but if you can stand the noise, it offers good food, friendly service, and makes you want to keep coming back.", 
    "review_date": "2010-08-28"
  }, 
  "Se0Eik7nVMVUh95mM1sSVA": {
    "user_rating": 4.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Yi-Bing Z.", 
    "review_text": "Love love love their burgers! I've had the Greek and the Baja burgers. Portions are huge for a girl, you could share of course! If it is your first time visit, make sure take a dollar bill and stick it to the ceiling for good luck! They also have weekday happy hours. The restaurant gets busy between 11:30 - 1:30 for lunch people.", 
    "review_date": "2009-02-16"
  }, 
  "DQQHR9lLcLuHVCfrHvKioQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda L.", 
    "review_text": "Grumpy Burgers are good. Grumpy Fries are good. I swear all of their food is Sysco, but somehow they make it all tasty. Perhaps they fry their food in Bacon grease, I hear that makes anything taste good.   Minus one star for the crowd at lunch. Not Grumpy's fault, but still irritating to wait too long or loose a table over an office crowd.", 
    "review_date": "2007-09-27"
  }, 
  "EUDuSd11Fhxm6ioLgvxFEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert R.", 
    "review_text": "This is a killer little bar that i only heard of by accident.  The booze flows like water and the afterwork crowd is nice and rambunctious...  just the way i like it.  Also, great choice of finger foods for when you are \"having dinner\" before a night out...  yeah, they are all fried (well and burgers), but what else do you want while you are pounding a few pints?", 
    "review_date": "2006-06-06"
  }, 
  "iRgghRapQ-tdw4NndgfHjw": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Karen C.", 
    "review_text": "I LOVE Grumpy's!  Total hole in the wall but great burgers.  My favorite is the Baja Burger!!  My son loves the Western. The place gets VERY busy at lunchtime so get there early.  They cook everything to order so it does take a while.", 
    "review_date": "2008-07-31"
  }, 
  "dhuWV1YmyMhjCTS4bh1uoA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Gladys C.", 
    "review_text": "YUM! Great burgers - tons of choices. Their garden salad comes with chick peas, beans and egg! So good. The fries are also good and my co-worker swears their breakfast sandwiches are a must! Good service but prices are on the higher-end ($8-9/burger).", 
    "review_date": "2006-06-21"
  }, 
  "ob0N8eC4293FUWljILXW-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mikey B W.", 
    "review_text": "I like goin to this place when i wanna get out of the hustle and bustle of fidi, and enjoy some lunch with a companion outside. today in particular i knew i couldn't linger, so it was bam bam order food bam pay and conversation in between. so service was quick, and the burger was delish, though most impressive was their side green salad, which was actually a great big green salad with LOTS of lettuce and things.   i will def go to grumpy's again for their out-of-the-way location, outdoor seating and good food.", 
    "review_date": "2009-08-10"
  }, 
  "ehj5QpeDuXqbk17a9SvUNw": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Eamonn S.", 
    "review_text": "Take out was fantastic. Tuna Melts fries and salad. And not a long wait even when crowded with a helpful bar staff.", 
    "review_date": "2009-07-09"
  }, 
  "vFpv-V1AY9qC2WnMrAn1pg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Linda L.", 
    "review_text": "Came here with my co-workers for work and it was packed at 1pm on a Friday afternoon. We thought we would beat the crowd but every table was filled. Almost everyone ordered the Super burger in my party and it looked amazing with the egg on top! I actually ordered the chicken curry salad sandwich because I was trying to be good with eating healthy but failed since I ordered onion rings. The sandwich was amazing but I'm giving this place only three stars because the service isn't awesome and it will always be crowded. I'll come here during their non busy hours for sure though.", 
    "review_date": "2013-09-08"
  }, 
  "ox74hiLubQtUY0U9jjr3cQ": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Matthew K.", 
    "review_text": "Great food, great atmosphere, great staff.  The people who run Grumpy's are smart. They picked a prime location in-between two large television stations in San Francisco -- they know the secret of the TV people...we like to eat good food.  This place definitely has good food. Great food, in fact. A relaxed, comfortable atmosphere meshes with a cheerful and friendly staff.  They get busy around lunchtime, but you can always call in your order to go. Great stop for a drink after work.  Try the burgers once, then come back and try any dish that comes with mac and cheese. Yum.", 
    "review_date": "2011-09-08"
  }, 
  "unJsPznjZ5DUXqJgoPvmkg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael A.", 
    "review_text": "I take that back. Burgers are pretty tasty, but if it's not lunch time, forget it. They close the kitchen early and send the guy home. And waiting for a drink while the bartender cleans tables and plays dice... SUCKS!", 
    "review_date": "2006-07-26"
  }, 
  "3HHLpfU7q4HoREEOXtt7pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "I came to Grumpy's with some of my coworkers for a welcome lunch and had a great time! This was the first time I had ever been there.  Grumpy's is a casual spot for lunch to grab some beers and burgers. It's great for groups, even though the place is small, and it seemed like it was a popular place with tons of regulars.  After looking at the menu, we pretty much all ordered burgers and fries. From a basic cheeseburger to one of their specialty burgers, everyone was very happy with the food. I ordered a regular cheeseburger and it was cooked to my liking and it was pretty tasty. The fries were good but I wish they gave you more!   Service was great - our server was very attentive and always made sure our glasses were refilled. Food came out in a timely manner and they really do their best to get food and drinks out since it is busy and on the smaller side.  I'd definitely recommend Grumpy's for lunch, just get there earlier so that you won't have to wait. It also seems like a good spot to catch a game or go to HH!", 
    "review_date": "2012-03-12"
  }, 
  "QUw6VXBnl3h7WaTPfMfXLg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jessie h.", 
    "review_text": "only at there for lunch - i'm new to the neighborhood.  my salad was surprisingly good, very tasty grilled chicken.   the waitress was quite the space cadett...  excited to go back and try a cheeseburger!  and maybe a beer for post work hours...", 
    "review_date": "2009-06-24"
  }, 
  "CkPCj_p-fFr5EqzvvOYnaQ": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Andy V.", 
    "review_text": "Great burgers and friendly service. This was a good spot for lunch only a block away from the crowds on the Embarcadero.", 
    "review_date": "2015-01-01"
  }, 
  "6zjoJQiv9m5ww99PhKTqFw": {
    "user_rating": 4.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "Jun W.", 
    "review_text": "Surprisingly great burgers here. The burgers are huge and the fixings on them make it even more delicious. It'll definitely fill you up. The fries are ok, but I prefer the onion rings. It has the light batter that I like.", 
    "review_date": "2011-04-24"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "It's Friday and I AM GRUMPY.  Grumpy that all the FB posts lately and all this weekend will be about EDC in Vegas. That or people thinking that they're sportscasters for the night.  Grumpy that everyone and their mama, baby's mama, baby's daddy are at EDC (I don't even like raves) right now as I type.  Grumpy that everyone has an excuse to act a drunken hot mess at EDC and I'm sober.  Grumpy that everyone has an excuse to whore out at EDC as I sit here in my granny panties.  Yah SO I'm just a grumpy jealous beezie today but thankfully not as grumpy as Kim Kardashian and Kanye's daughter will be in 16 years...  Who da eff names their kid \"North\"? North West? WTF!  Oh yah, btw the buffalo wings at Grumpy's are kick ass and they have real dollar bills stuck to the ceiling: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F16m0v9n&amp;s=15be293b9704dc08aaadfaa66d90921c01d4376f6bf1878abbef60ef97c16179\" rel=\"nofollow\" target=\"_blank\">bit.ly/16m0v9n</a>! Holla!  OTHER NOTES: *Older FiDi crowd w/ no eyecandy. *Divey pub with a full menu ($3.95-$10.95); from breakfast foods (served till 11 am) to salads, sammies, signature burgers, fried chicken and chili. *HH is Monday - Friday, 5 pm - 7 pm --Snapshot of online HH menu: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F12REr8w&amp;s=1655ea3f2a80d63ebbcd3a827a498c1b48b3e2aac5d760f9a39707335b02cac7\" rel=\"nofollow\" target=\"_blank\">bit.ly/12REr8w</a> --$1 Garlic fries on Monday - Wednesday *No waiter service. Place your food order at the bar. *Buffalo Wings ($5.95) were some of the best I've had: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F183kxtt&amp;s=89b8e584f501ba82bf8a883f1a3dc05f20cce2fa5d76b46bb07fdfd26cb0a3cb\" rel=\"nofollow\" target=\"_blank\">bit.ly/183kxtt</a>! Their crisp and juicy and the sauce is indescribably tangy and spicy with a touch of smoky sweetness. *Decent drinks. Stiff Hendrick's Tonic was $8. *Very clean restrooms w/ Dyson hands-free dryers. *Odd operating hours. Closes at 10 pm AND they're closed on the weekends. WTF? *Be VERY careful as you're crossing the streets in the surrounding area; there are no stop signs and cars drive by really fast.  *Very easy street parking.", 
    "review_date": "2013-06-21"
  }, 
  "Nd9VeCv885fxyHMMhRM2tg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolina S.", 
    "review_text": "Just awful. We grabbed it to go through our office and I had to throw away my \"Greek\" salad. I say \"Greek\" because the salad was sloppy and didn't have the standard dressing for this style of salad. Also, we had called the order ahead of time and asked them to label all of the orders, which they did not.   Half of us (there were 6 of us) ended up throwing half of our orders out and to be honest after the awful customer service we had, I wouldn't try them again. Perhaps their drinks are better, but to be blunt, why bother going in when they're not even inviting?", 
    "review_date": "2013-09-27"
  }, 
  "b4ZseJGymqcUwRB5UN6oDw": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Joey B.", 
    "review_text": "The only thing going for the place is its beer selection.  Even that was tempered by the fact that they had their Guinness running off CO2 instead of nitrous.  The mac &amp; cheese tasted like velveeta.  Just a big disappointment for me.", 
    "review_date": "2007-12-13"
  }, 
  "HOOuGraQ1cZOVbCDWBbk6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kwixxy S.", 
    "review_text": "love love. great burgers and great monday-wed drink deals. also, doesn't hurt that its right by work! giving 4 stars because its not the cleanest place in the world...", 
    "review_date": "2009-06-07"
  }, 
  "asL1d04xS3y8YQtU5ota-g": {
    "user_rating": 4.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Doug T.", 
    "review_text": "Staying around North Beach and Chinatown we've exhausted the normal touristy foodie places to eat. I was looking for something different and a local spot. So I found Grumpy's on Yelp. His place is in no man's land. Nothing around but business complexes. This is a local hangout and a true blue dive bar.   We got here about 11:30 and the place is empty. We got our choice table. At about 12:15 then all the local came pouring in. Very relaxing but tight seating.   I had the Chili Cheese Burger and fries. I read they had really good burgers here. Anyways, it's served open faced. Chili was homemade and was okay. Burger was just okay. Not a great meal. I guess I just didn't pick the right burger.   My daughter had the Manhattan Melt with ham, turkey, lettuce, tomato, cheese on a grilled sour dough bread. Outstanding. Really good. They give you four huge piece. She got the potato salad on the side with this. Really good. Outstanding. Had a little kick to it. Yum yum good.   My son had the meatloaf plate. Meatloaf was out of this world. Drop dead meatloaf. So good. Unbelievable. The homemade Mac &amp; Cheese was okay. A little salty. The vegetables were so good and sweet. Outstanding dish.   My wife had the chicken Cesar salad. She really like it a lot. Very good  Anyways, service was very good. Water cups were filled in a regular basis. I accidentally spilled my water cup (can you say clumsy) and we had two waitresses cleaning it up right away. That's what I call good service.   So if your looking for a local spot away from all the touristy places. Somewhere out of the way but not that bad of an area then this is the place for you. Just be careful of what you order. Read the Yelp reviews first then order. Enjoy.", 
    "review_date": "2014-07-21"
  }, 
  "HL_FHh3CJxT2szBqsF7v_A": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Scott K.", 
    "review_text": "As others have said... the best burger I have found in the FiDi. Worth the walk. Juicy, delicious... my lunch destination any time my coworkers and I are feeling a burger... Haven't tried anything else here, and not sure why I would...", 
    "review_date": "2011-06-28"
  }, 
  "BwTPj8XS_iqdSTLPBVMs1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie Anne N.", 
    "review_text": "Best dive burgers! Just get a regular cheeseburger and a pint of beer. You will not regret it!", 
    "review_date": "2013-03-19"
  }, 
  "yfq4INlwaC8dyX6tpwSqrw": {
    "user_rating": 4.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Dee H.", 
    "review_text": "Small spot with strong drinks!!  Indoor and outdoor seating (about 5 small tables inside), with a game always on.  They serve food to order as well.  Good place for a much needed strong drink after work.", 
    "review_date": "2011-09-27"
  }, 
  "kkAFJLviQ_dp1nChCvi3-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ricquel N.", 
    "review_text": "good ole Grumps! Hasn't done me too wrong as of yet- so I've gone to this place more times than i can count in the last 5 years- Breakfast: great. Lunch: yummy. Dinner: never been! This is a during the workday food/drink place- after hour drink specials... small place, nice peeps...they have awesome bacon!", 
    "review_date": "2007-01-19"
  }, 
  "96Wt_rBkOS1RUtB_7n1WaA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "Just started school close by and brought a large crew over because I heard Grumpy's was good, but it was closed when we arrived at 9pm on a Tuesday. Not even a sign up. Am I missing something?", 
    "review_date": "2012-09-11"
  }, 
  "2ZCASyHp7_Y85DMb2-5ExA": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ruben P.", 
    "review_text": "Grumpy's is literally a block away from my work and when I don't feel like walking far, I end up picking up a burger or breakfast food based solely on convenience of their location.  The food is good, but is a bit overpriced.  Their prices have gone up quite a bit since I first stopped by and its odd because I've only been at my current job for about a year.  I can't really say that its great or awful.  It's a cool little hole in the wall spot and every time I've been there the service has been pretty good.  I have yet to go for Happy Hour, but I hear its good.  Maybe if I go for Happy Hour they'll get bumped up a star.  As for now, its decent food for the location, but I would never go out of my way to eat there.", 
    "review_date": "2008-07-20"
  }, 
  "NO36epYec7wWtzrgkPRnzw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynsf Z.", 
    "review_text": "Food- not bad. Location- close to work. Service-- terrible.   If you're on a 1-hr lunch, this is NOT the place for you!   I've been here lots of times because its close to my office, but today was the last time.  If you're not spending 20 minutes waiting for a seat, you're waiting 20 mintues for someone to take your order... now that lunch is half way over, its gonna be another 15-20 for your food to come out.   Yikes. At least if the average-at best food, added great service to a $30+ lunch for 2 bill, i might consider my return. :(", 
    "review_date": "2012-02-03"
  }, 
  "tERIXYhKVFn91F23z_w2bQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michael B.", 
    "review_text": "Ate here today with my co-worker, and was pleasantly surprised.  Sat down at the bar because I enjoy bar seating during lunch, and ordered up a couple of burgers. We actually both got the Super, and ordered it \"medium\". I've got to say, i was AMAZED with the the fact my burger came out medium! not medium well, not well, not burnt...MEDIUM! enjoyed it thuroughly, the bartender was quick on the soda refills wihtout even asking.  My only gripe would be that the garlic fries aren't worth the extra $1.50.  They weren't bad, but it was more of a garlic oil than minced garlic and I prefer the minced.", 
    "review_date": "2014-09-09"
  }, 
  "yiZzbX1oUdsDhXfpL9p47g": {
    "user_rating": 5.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Susie J.", 
    "review_text": "Was in San Francisco with my sister for lunch. She couldn't find restaurant she had searched and we were using yelp for fish and chips close by.  Best fish and chips and macaroni and cheese I've tasted in awhile.  Best ginger ale too.  It was unusually hot in the city and it was nice to be in the cool pub.  Our server , Monica was so good as I like to try new places and ask lots of questions while I place my order.  I had leftovers for my long train ride home    Bonus is their bulldog mascot that looks like my Bentley 's Grandpa", 
    "review_date": "2014-05-02"
  }, 
  "AbC_IcLriK_cxl5OWO88dA": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Lisa M.", 
    "review_text": "So I've just been here once so far but I know I'll be going back Its apparently the hangout spot for the ad agency crew on lunch. The burgers are really fantastic--all three that my table had were perfectly cooked and they offer really original toppings along with your standard favorites. They also have a good beer selection on tap. My one complaint was that it gets super crowded--including the outside seating which is a lovely treat actually--so you may have to wait for a table and the service can be a touch slow. But worth the wait. Or just make sure you go when you have at least an hour to sit and sip a beer while casually munching and talking.", 
    "review_date": "2012-01-27"
  }, 
  "_q_MC7ebjDOCpX5Ec7TXEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lulu C.", 
    "review_text": "My first visit to Grumpy's was certainly a good one..I came on a lunch date and the conversation was good, but the food was even better! I ordered the tuna melt and my oh my...was it delicious!  My date said that the burgers there are always awesome, so i might have to try one of those next time...there's a nice bar inside, beers on tap, and small cozy sitting area right outside on the sidewalk. Perfect for a nice sunny day.   I would definitely come back to, as a matter of fact..i'm craving one of those tuna melts right now!", 
    "review_date": "2008-10-01"
  }, 
  "BRh5hZvTU-xYXux5WnjBMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "This is a great place right near my office.  Looking for a good Happy Hour spot, this is perfect.  Specials on Tecate tall boys and the food is decent for a bar.  I'd not make this a destination, but the quality for convenience is worth the four stars.    I also dig that there's outdoor seating.  It's usually too cold, but if you want a smoke with your drink, it's pretty ideal!", 
    "review_date": "2012-01-11"
  }, 
  "EEBcB3Sm8LDASwBeu8UKsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave H.", 
    "review_text": "Their Super Burger might be the best burger I've ever had in a restaurant.  I asked for it medium rare, and it was a perfect pink all throughout.  Topped with delicous bacon and a fried egg (along with all the expected fixins), this was one of those lunches that had me grinning from the first bite until the last.", 
    "review_date": "2011-04-21"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "I've been to Grumpy's multiple times over the years and I enjoy it as it has good food, a good beer selection and it's kinda out in the middle of nowhere.  However, I went with my friend this past week and the service was really poor.  We got there relatively early and got our pick of where to sit since no one was there but we didn't get our meals until people that sat down next to us and arrived 20 minutes later than we did.  There was no apology or you know what we'll take care of your drinks.  And it wasn't like we ordered something difficult either.  So be careful next time you head to Grumpy's as you might have the same experience that I did.", 
    "review_date": "2009-07-01"
  }, 
  "bTFZ-cepM91pdS2PFpvJiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody T.", 
    "review_text": "Fun place near work - if you're at William Sonoma or Levi's plaza.  Bit of a gem for the area to be honest.  Chill atmosphere, food is moderately priced and they give you good portions.  The ONION RINGS ARE DELISH!!! What a pleasant surprise.  I was happy with the greek salad as well.. want to come for a beer and some onions rings after work sometime instead of just for lunch.  Probably not worth driving all the way down Battery to go to this place, but PERFECT for the work area since it's skimp on choices.. :)  Convenient outdoor seating even though the indoors is a fun atmosphere. I'm a fan indeed! :)", 
    "review_date": "2010-07-31"
  }, 
  "kdvOpupU89Nk2uFbIvQZzg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John P.", 
    "review_text": "If you are in the financial, and need a spot for a pint that isn't crawling with DB's... go here. It is worth the walk, and the place is filled with a ton of people who work for the local news channels. They are friendly, and kind of like pirates in some weird way. It's off the beaten path, and has a sense of atmosphere. I recommend the Baja burger daily drink special. Only downside is they are not open on weekends, and you kind feel like you are far away when you get drunk enough to rally.", 
    "review_date": "2013-05-25"
  }, 
  "SapOcLmnu_E3WpCb0lYiKg": {
    "user_rating": 4.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Mariah M.", 
    "review_text": "You could argue that Grumpy's is a three-star kind of joint, and I wouldn't fight you.  But for me, Grumpy's is easily four stars, for a number of reasons.  I've had many a wonderful, after-work happy hour here.  They have Stella on tap when I'm feeling light, Guinness on tap when I'm feeling dark.  It's not too loud to carry on a conversation with your friend or party, unlike Old Ship down the street.  When I've chanced to eat the food, it is very tasty.  For me, Grumpy's is the old standby - the comfy pair of pajamas that you want to put on at the end of a long day.  Ain't nothing wrong with that.", 
    "review_date": "2009-01-21"
  }, 
  "-0mCB5ap8xjsL9VuTv8E7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Holly M.", 
    "review_text": "Grumpy's is an awesome lil bar with good drinks and delicious food. I'll often come here on my lunch break or right after work, and while they aren't open on weekends (sadness) they make me happy. Prices are fair, considering how great the food is. I usually get a cheeseburger because it's damn good.", 
    "review_date": "2014-07-25"
  }, 
  "44MbaaY9wYXK4uBKwqKIaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "Great food for a pub.  Loved the beer selection.  Service was good.  I got the Philly.  Only odd point was that the seem not to give many fries, but the portion was great anyway.", 
    "review_date": "2014-05-16"
  }, 
  "yW5ajGtDmMAujfld63J-eQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany L.", 
    "review_text": "this is the closest and most affordable restaurant thats close to my work.  its a small pub and always rather busy.  if you like  smaller crowd go around 11:30 or past 1.  they have a wide variety of burgers, fried deliciousness, sandwiches and beers.  they have speciality burgers and you can get beef, turkey or veggie so thats a good option.  so even though its got a lot of fried fatty deliciousness foods, you can still opt for a healthier option (although im not 100% sure why you would).  try the burger with the fried egg on top, its to die for.  anyway i probably go here twice a week for lunch at least so of course i think its above par.  or im that lazy...", 
    "review_date": "2007-08-14"
  }, 
  "1m4Hmm7IbgGjVupM7CQSMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki M.", 
    "review_text": "Of course we like to think that grumpys came around soley for the purpose of the ad execs to get wasted after work but it's got something for everyone. Drinks are cheap, burgers are tastey, bartenders are friendly but often get overwhelmed. This bar is located right off battery in the ad ghetto, so rival agencies meet up and mingle, The wall is adorned with signs from the nearby agencies so it really feels like \"our local hangout.\" not a great place for wine but the beer selection is good.", 
    "review_date": "2006-01-21"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "Another place I used to go to when I worked nearby. I loved the grumpy's. Really good breakfast! Really good Burgers! Club Sammys, Onion Rings, and Alcohol! haha. The staff was really friendly, we hung out and talked to them alot. I think the 2 guys are gone now :0( Well I left my dollar bill on the ceiling of Grumpys, when you go find it! It has my name on it :0)", 
    "review_date": "2010-02-25"
  }, 
  "9jLpJeKHWAjFTf_1rdyDMg": {
    "user_rating": 4.0, 
    "user_location": "Memphis, TN", 
    "user_name": "J K.", 
    "review_text": "I went for a turkey burger(I'm trying to eat healthier) and the bartender said they were good but their hamburgers were really good, so I ordered a bacon cheeseburger and onion rings. Really good burger, onion rings were ok. I went back on my next trip to the city and got the turkey  burger and garlic fries. Tasty and juicy burger, garlic fries really good also. They have a few good beers on tap, several bottled beer and a full bar. They close at 10, so not a late night bar. It is a great place for a burger and a few beers.", 
    "review_date": "2012-06-28"
  }, 
  "yFn5TDFWfR6ERPzsMrGqJg": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Dela A.", 
    "review_text": "I've been to this place a few times and every time, I'm always pleased with the fact that the staff has your phone order ready when they say it will be ready and its always right.  There have been a few times I've given them a ton of names and details for other people and they do a good job in having it right.  Usually I get  salad with grilled salmon.  It's pretty basic with a vinaigrette and makes me wonder why in the hell I don't make it at home considering it's so simple.  But considering the salad is less than $10 and it's a decent size, it's good for when you didn't plan in advance.  I'm not a drinker but I did make an observation the last time I was there which was about 2 weeks ago.  They have Jegermeister on tap. lol  Pretty interesting, I'd say,", 
    "review_date": "2012-07-27"
  }, 
  "KofmcukQnRz9mjKOS0u66g": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Rose H.", 
    "review_text": "Went there on Thursday night- awesome food.  Great service at the bar, and good beer selection  Dropped down the rating as they are only open Monday-Friday... if they were open on weekends, easily 5 stars", 
    "review_date": "2010-07-20"
  }, 
  "cECtnYdL6BNfgeGLWOBpOw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Beth V.", 
    "review_text": "Burgers and salads?  Why?  If any of you engage in this mockery of American culture, please explain your reasons to me.  I'm only taking off a star for the service.  Otherwise, the bacon cheeseburger with mushrooms has been known as a highlight of many a dark day at work.", 
    "review_date": "2006-01-02"
  }, 
  "KV3fdVjRa3JwOEW1LLXFdw": {
    "user_rating": 2.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Winnie H.", 
    "review_text": "Such a loud place you can't even hear what your friends are telling you.  We had to constantly yelled at each other to keep the conversation going.  Burger was alright.  Nothing special.  French fries was so soggy and oily that I only had one.  And you can totally smell the oil from the fryer.  I definitely won't return.", 
    "review_date": "2011-10-09"
  }, 
  "0-1Mut3NrwRQy7SPcbEJHQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Justin L.", 
    "review_text": "This place rules over other Financial District places with an iron fist. They put pulled pork on a bun WITH coleslaw. Together on the same sandwich!  And let's settle something about Macaroni and Cheese. When you crave Mac and Cheese, what do you crave? Some fancy ass stuff with stuffed alfalfa sprigs and wine reduction glaze or do you crave that stuff in the blue box that momma used to make?  Get over yourselves San Francisco, and quit hating on Grumpy's Mac and Cheese. That shit is good. And if you're too good for it, then guess what, you're probably the kind of person who has an asymmetrical haircut,  listens to Fergie, and is excited about the Sex and the City movie, and you are therefore booooooring. Ironic, considering old school Mac and Cheese is so boring it's amazing.", 
    "review_date": "2007-12-14"
  }, 
  "2Qux0DdkrA9ZL-XEu4n6mQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karl N.", 
    "review_text": "Great Burgers.....great drinks.....great atmosphere. I spend at least one day a week here getting wrecked. If you want to eat lunch...arrive no later than 11am....Or...wait until after 1:30. Too many suits.", 
    "review_date": "2008-03-03"
  }, 
  "6lw7nIa8aF7bJ60oRawEBQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Scott T.", 
    "review_text": "Great place to go for lunch break. Cool pub, plus good burgers.", 
    "review_date": "2007-06-20"
  }, 
  "KgDOK0iFpD2mQsKkpvrALg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris T.", 
    "review_text": "The designated burger joint for \"Advertising Row\".  Hawaiin shirt adorning creatives, cracked out account executives, and party hardy media teams all gather into Grumpy's for beers and one of the best burgers in the hood.  You literally rub elbows with some interesting people here.  Cramped tables add to the intimate setting.  Lots of dollar bills are strangely stuck to the ceiling... perhaps some creative briefs too!    Get the turkey burger.  Just get it.  It's worth the 30 min prep time!  Your conference call to NY and Redmond can wait.  Filling your belly with a ketchup smothered turkey burger with fries is more rewarding than budgeting $50 mill worth of billings.", 
    "review_date": "2007-01-05"
  }, 
  "D3zzBdZDs4qH3sChk3k9_Q": {
    "user_rating": 4.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Sheena C.", 
    "review_text": "GRUMPY'S!!! This place is great! Best dive bar around for sure. They have good happy hours and considering it's a darker, noisy dive bar, it's clean, the staff is friendly and they have a huge selection of food - and it's really good at that! It's one of our favorite lunchtime spots and we'll definitely be back.", 
    "review_date": "2014-05-25"
  }, 
  "I-YFZfhjHOF5LkjvGBrerQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "King O.", 
    "review_text": "First off the service is slow as hell, forget going at lunch the place is packed and you won't get in. The beer and turkey burger is good. The place is small so you often end up sitting too close to strangers. Did I mention how slow the service is? yeah slow. Oh and it's loud, but there is a fun ambiance to it, would be so much better if they expanded.", 
    "review_date": "2010-03-05"
  }, 
  "hQ8To_s10kfhi2rc4js5cg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jack p.", 
    "review_text": "Dear Cook at Grumpy's: Screw you for doing such a piss poor job of making my garlic fries.", 
    "review_date": "2009-12-28"
  }, 
  "bN-QNxRGzx6VeWOgcCnekQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kyle T.", 
    "review_text": "So, one of my business partners and I landed a contract that was about two blocks from this joint and remarkably, there just isn't that many \"go-to's\" for lunch in that area (Green Street and Embarcadero) The Ferry Building got old, Piperade was just a bit too \"la-dee-da\" for a quick lunch. Between this, Old Ship and RJ's Market (which is pretty good) we found ourselves polarized by the convenience of Grumpys. So that said, my ramble below pertains only to lunch experiences.  So, once you get your head and belly into a \"sandwiches, burgers and salads\" type of mindset, the place delivers. To date, I've stayed on the middle-of-the-road path with the menu (classic cheeseburgers with fries or a side salad, grilled chix sandwiches, tuna melts,  cobb salads, beet salads, etc.) and ALL of that grub was prepped and served up really well. Proteins were fired to perfection at the right temps, fries were crisp and soft on the inside with great seasoning, salads were big and put together with a mix of toppings and textures to make even something so basic, still delish. You actually catch yourself thinking, \"wow, the food here is pretty damn good.\"  AND...mind you, I haven't even tried any of the Signature Burgers (15+ gourmet burger types from the Baja to the Popeye), the chicken parm, the turkey plate, other fancier salads or any of the bar-food apps. SO, I can only imagine this place gets better and better. The bartender was talking me into the chili-cheese fries, which are supposed to be damned good, but I was already two beers down and needed to head out for a meeting.  Which brings me to booze, staff and ambiance. Booze: great beers on tap and affordable hard liquor bevvies and happy hour specials. Great place for liquid lunches - ding ding ding.  Staff: Welcoming and friendly, just as we all like. In the mad rush, they can get a bit busy so sometimes it can feel a little slow (in the kitchen or front of house) but they keep up for the most part and do it with coolness, kindness and smiles. Ambiance: Hell, it's a pub/barfood joint. If you're looking for tablecloths and a sommelier then you might keep on steppin'. BUT, if a pile of kegs in the corner, a bunch of tables crammed edge to edge, Sportscenter on on the TVs, Foo Fighters (yes Dave Grohl gets loud when they come on in there for some reason) rockin' in the background and great food at a great price...go get you some Grumpys.   And, if you figure out what the hell the bulldog with the fern leaf logo is all about, you win free Grumpys for life. Just kidding. I just want to know what the backstory is on that.   Cheers.", 
    "review_date": "2011-07-23"
  }, 
  "F2_vU0hLpKMYhZG8X0Fztw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Queenie C.", 
    "review_text": "I LOVE GRUMPY'S! I have many fond memories of drinking beers and eating delicious greasy pub food. Grumpy's fries are the BEST. They started serving different fries for a while after management changed but I think the change was short-lived. My favorite meal here is the tuna melt with fries and a pint of Bass, or two. ::drool::", 
    "review_date": "2009-04-07"
  }, 
  "8SqBkk4ol6Z9OpM1jqnLaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nico W.", 
    "review_text": "I try...REALLY hard not to make fun of other people's reviews...OK I don't try hard...actually I don't try at all...but I don't think I've read a bigger collection of wussbag reviews than for this place.  First of all, to the people who think prices here are expensive need to loosen up a bit on their money purses.  It's in San Francisco; you go to a place that hugs the North Beach - Financial district border, what do you expect?  Seriously, you frugal fairies, bony bastards, parsimonious pieces of shit...how many items do you see here over $10  Second of all, waiters wait and bartender are bartend.  Do I see Dr. Phil or Silvia Browne in here? No!  They can't read your mind nor predict your thinking and thank God, cuz no one really wants to know what the hell goes on inside that stupid little head of yours.  If you received the wrong order or if your order took longer, ASK (politely) and they - like any good barstaff - will get it right.  It's OK to ask the bartender how much longer your food will take or send your food back for the right order.  They thrive on word of mouth and much rather you leave happy than you leave unsatisfied...DUH...Stop sitting there pissed off and arguing with the world with your eyes and posture, no one likes that shit you wuss.    My friend and I came here on a Wednesday night and imbibed in that night's specials - $7 shot and beer, $1 garlic fries...oh garsh, almost broke my piggy bank!!  We got fish and chips and a burger.  The large portions helped pad the stomach for the beers we ordered.  The bartender was overworked - he ran the bar and restaurant orders by himself and didn't shower us with attention - boohoo.  Each step of the way I needed to ask for attention - \"I'd like to order drinks please,\" \"Can we order food?\" \"We'll take the check now\"...how difficult was that??!?!?  He was nice about it, told some jokes, interacted with us and harassed us to come back and visit.  The bill?  A mind blowing $24...  An interesting mix of crowd (at least when we went) - financial district people, loud bridge and tunnel dudes, a softball team and a group of three chicks that could make Stevie Wonder cry.  It's a homey place - felt (and looked) a bit like Paddy's Pub from It's Always Sunny In Philadelphia.  I like the vibe here, I definitely felt at ease here and would come back for happy hour.  Signs on the walls, dollar bills pinned to the ceiling and funny lookin' chicks create a homey vibe with a tinge of amusement.  The Jaeger keg however, reminds you it's still a legit drinking establishment.", 
    "review_date": "2009-08-20"
  }, 
  "-PoCbyNa4xc4yvReuj5pqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Poppy C.", 
    "review_text": "Food: Happy Hour Garlic Fries $1.00, zucchini sticks with fries and a bacon burger with potato salad (the bartender asked me if I wanted fries with that, hope he was joking...)  Drinks: Happy Hour $7.00 beer and a shot.  Food and drinks get a solid 4 stars, service gets 3, bathroom gets 3, awesome name and non douchey crowd gets 5 stars.", 
    "review_date": "2010-02-25"
  }, 
  "BvRgHbtpDbmP0pCOJ-fbjg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roddster V.", 
    "review_text": "Hands down, the best burgers in the financial district area", 
    "review_date": "2008-03-14"
  }, 
  "5c0kFVG6-Q0TwBT2yd1U9A": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Hanley B.", 
    "review_text": "My friend(s) and I usually do a liquid lunch once a week or so and we decided to try Grumpy's Pub today.  It was a little bit of a trek but well worth it.  Our standard is basically the Royal Exchange which is pretty good with a solid beer selection and decent food.  In my mind RE is three stars, which is average, so my review will be in comparison to that.  The beer selection at Grumpy's was not as expansive as RE's but they definitely had a good selection (Anchor, Lagunitas IPA, Dos Equis, Hef, etc.) so for me Grumpy's held par.  The place is much smaller and had quite the lunch rush, but we still were able to walk right in at 1 pm on Friday and get seated. Our order was taken promptly enoug and our beers came out ahead of our meal.  I got a burger, medium rare, and my friend got a \"Manhattan\" which was kind of like a club sandwich.  He reported that it was good. My burger was also very good. Perfectly sized in that I could have eaten more but didn't need to.  The cheese was quality aged chedder and the bacon was perfectly cooked.  The fries were also good (I would have wanted more on the plate, but didn't NEED more).  The burger and sandwich were about $10/each.  Beers were $5/pint.  I was able to get my meal, two beers and out in about an hour which is the perfect time.  The place is kind of loud but it was busy and not to the point we were annoyed.  Grumpy's is a little out of the way, but worth the walk on a nice day. It's about 10 minutes from the Financial District.  If I was in between RE and Grumpy's, I would probably choose Grumpy's 80% of the time. Definitely worth a stop as they have many other choices on the menu, all of which looked good.", 
    "review_date": "2011-05-13"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "Not sure what that one Yelper was smoking, but this place is NOT a dive by any standard. The damn barstaff wear button down shirts and there is a lot of light, corporate logos on the (clean) walls, and a kitchen that serves more than just burgers. Since we were in the area and it's the only bar we saw we popped in for a couple rounds, which were priced well and strong enough. The first bartender did not have a button down shirt and he was friendly and offered good advice on booze when they ran out of what we had the first round. I'd go back if I was over that way.", 
    "review_date": "2009-11-20"
  }, 
  "xyNdK7m0i1Y4pb4gJicA6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clar L.", 
    "review_text": "Great American food, hearty portions, and good selection of beer. Nice servers and cute bartenders, friendly vibe all around. Depending on which you order, food can run a little steep. Service can be agonizingly slow, especially during lunch. Fills up real fast. But worth the wait.", 
    "review_date": "2007-01-13"
  }, 
  "jpMJ8RifYA9iv6_K7WWa8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "slapaham s.", 
    "review_text": "ask Kevin the bartender if you can see the prisoners chained up in the cellar....it's cool!  UPDATE: Kevin is gone but Josh my man, you are a honorable replacement.   they serve burgers here?", 
    "review_date": "2006-09-08"
  }, 
  "hpffQUMlFzNVFddmmx1RUQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Eric M.", 
    "review_text": "Grumpy's has absolutely everything you could ask for in an after-work watering hole: good food (their new addition of buffalo chicken strips was a stellar idea), happy hour specials, televisions playing sports, weirdo employees from Second Life, the occasional hot cougar, and a friendly bar staff that will remember you if you're there enough.  The relative lack of traffic on Vallejo Street is nice because on crowded, sunny days the clientele can spill out into the street. The jalapeno poppers and the baja burger are highly recommended.   Go there for lunch or go there for happy hour. Hell, you can even go there for breakfast because the bloody mary is pretty legit too.", 
    "review_date": "2010-04-15"
  }, 
  "nlOxarS20luHkAloH5YyzA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Vanessa G.", 
    "review_text": "Killer man!  This place totally rocks.  So many choices of burgers and beers.  And it's off the beaten path of the financial district, so it's not totally busy during the week.  I guess it can get a little busy during lunch, but it's lunch time, so expect it.  Duh!  Nevertheless, mmm, makes me want a burger right now.", 
    "review_date": "2006-06-06"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "DELICIOUS.  Oh man, this place is good.  I went with a friend of mine for lunch, and I ordered just the cheeseburger w/fries, and it was perfectly cooked, and very savory.  I also liked the vibe of this place during the work week -- a relaxing, yet upbeat place to grab a bite for lunch.  You can also see the Bay Bridge when you're walking in and the location is very convenient.  Dug it!", 
    "review_date": "2011-04-28"
  }, 
  "HPJY5cQ7Za6Hi07eB3gvZA": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Bernadette M.", 
    "review_text": "Paper money pinned to ceiling, small and intimate restaurant and bar and good service. A girlfriend and I came here before a holiday gathering and everything was pretty good. There were specials, beer on tap and a decent amount of liquor to choose from. A cool spot tucked away from the rush of The Embarcadero.", 
    "review_date": "2014-12-14"
  }, 
  "t7wdIt-oG2M2VxD-a1miPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregoire V.", 
    "review_text": "Favorite burgers in town, if it's your first time, try the Baja or better : the super The others are good too but these two are the best. They accept to split the burgers in half as well which is great if your stomach is small :)", 
    "review_date": "2014-02-28"
  }, 
  "zTE8KUu2ukFQZ67fZypLtA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christy I.", 
    "review_text": "i live a few blocks away from this place.  for the longest time i had no idea there was a restaurant/pub right there because it's located in the no-man's land between the FiDi and the touristy fisherman's wharf area.  surprise... when i walked by one time in the evening to see that there was a bit of a crowd hanging outside this place.  seems like there's a bit of a hidden gem that only the locals knew about?  I finally get a chance to go to grumpy's the other day for happy hour and dinner and as expected, there's a crowd standing outside, each man with a glass of beer in hand.  inside was a little crowded but my friends and i were able to get a table.  we sit for a while, and realize that we're supposed to order our food at the bar.  (is that right, folks?  geez, i hope that's true.  if it's not, then i wonder how long it would have taken before an waiter served us.)  for the record, at least in my experience, you're supposed to order your food at the bar.    i ordered a lagunitas IPA and a reuben burger.  the bartender was a really nice and friendly guy but forgot to ask me how i liked my burger done.  at least the food came out fast, and it was delish.    grumpy's has a pretty decent selection of beer on tap (lagunitas IPA, anchor steam, anchor porter, guiness, stella, widmer, trumer, sierra nevada, spaten lager, fat tire... ) and happy hour is $4, which is OK.  They also have other happy hour specials, such as $4 margarita thursdays.    my friends have tried and liked the baja burger and the california burger.  i hear the fish and chips are alright but you can get better elsewhere.   the crowd looks like there were quite a few regulars, most likely the after-work crowd from the neighboring offices and the bartenders seem really friendly and cool.  the quality of service doesn't seem to be their forte but sometimes i'm ok with that, as long as they're not straight up rude.  i could see myself being a regular here... maybe.  it's alright.", 
    "review_date": "2009-05-29"
  }, 
  "oW2bCSJ5bIHyRnoZvkHwDg": {
    "user_rating": 3.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "Uncle Fishbits Aeneas X.", 
    "review_text": "Have a business lunch where no one is really interested in eating lunch but everyone talks about lunch and then pass around a couple menus and you pick one together that is totally arbitrary but will deliver some overpriced food you can expense?  This is one of those places.  Just fine.  does the job.", 
    "review_date": "2008-11-02"
  }, 
  "pRZw2ZXFEWiC_mkCX7JaBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monica R.", 
    "review_text": "Really decent bar food in a dive-y, but not too dive-y, bar filled with locals.  Kevin the bartender is super adorable!", 
    "review_date": "2013-07-02"
  }, 
  "wPu-IJdZMEbFVEFSXflIAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy F.", 
    "review_text": "Best turkey burger ever.  Go early and go hungry!  I crave their burgers in the morning and always relish eating the Western. Mmm!  So good.  For a burger, usually runs you about $12 a person.", 
    "review_date": "2007-12-05"
  }, 
  "RLWwM7aInJxNoOPKuvAevA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "I'm the type of guy that thinks the quality of service is just as important as the quality/taste of the food. I came in for lunch today with my buddy and the place was packed. And for is busy as it was i didn't expect the service to be so good. A+ for service!! I had the cheeseburger and the garlic fries. Fries were good but a bit on the soggy side.  As for the burger, it was a good burger...nothing great but good. I was checking out other customers plates and they looked pretty tasty. I'll go for something different next time.", 
    "review_date": "2015-01-22"
  }, 
  "7e4CioqxGMByqh0lJP5FZg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael G.", 
    "review_text": "Good burgers - actually, really good burgers. Service is spotty but friendly when you get their attention.", 
    "review_date": "2012-11-01"
  }, 
  "f9GMVuLrrm6ggcIvlhXbdA": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Mason M.", 
    "review_text": "Like dive bars. Like to find places where there're no tourists even though I'm  one. This fit perfectly. Great western burger, great atmosphere, great bartender who warned me that jalapeño poppers and a burger may be too much food. (He was right). Upgraded to garlic fires - well worth it. The bartender was the best. Will definitely relax a night here when I'm back in town.", 
    "review_date": "2014-11-13"
  }, 
  "_E8fCCrB9T4wZnX8CsS75A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dorris W.", 
    "review_text": "This place is near my work so I come here a lot of happy hour. I come here usually for the $5 draft beer and $1 garlic fries...$1 GARLIC FRIES! really good, but super greasy!   it says you have to spend over $20 to pay with card, but the bartender doesn't care so you can use your card for a lesser amount.", 
    "review_date": "2010-09-18"
  }, 
  "iZXxYbfjkFn4Ffu40bEHcQ": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Esther A.", 
    "review_text": "Like most places in the Levi's Plaza area - this is not a weekend spot. Nor is this a spot that you go to past 8 on a weekday. It is solely for business hours and work happy hours. That being said - this is a great bar to come for a drink with coworkers after 5. They also have great take out for lunch - great burgers and fries along with your typical fried bar fare. It's a little pricey for what you get, but hey - its Levi's Plaza - not too many other options around.", 
    "review_date": "2009-08-15"
  }, 
  "_VGIPT2dDMJvAsRjjQcD-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pauline L.", 
    "review_text": "The burgers here are outrageous...outrageously juicy!!...The juices were dripping off of the burgers to the point where I can't tell which is the grease or the au jus...My friends swear to this place...the fries were first rate.  Also try out their many choices of booze...I favor the light Anchor steam...(friends call me a wuss for going \"light\", but I gotta watch the calories!!!)  Also try out their breakfast grub...they make a mean mushroom/veggie omelette...I don't happen to like their potato hash..they were chunks of potatoes with no flavoring. Kinda bland.  The toast they offer is usually saturated with buttery goodness, so watch out!  Parking is a pain here, there's tons of meters, and lots of overpriced lots...Best bet on a weekday, just take Muni and walk along the Embarcadero.", 
    "review_date": "2007-04-13"
  }, 
  "Byn9gsZ2kS_yOnsfUQiYzw": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Kevin E.", 
    "review_text": "There's nothing fancy about this place and that is part of what makes it such a find. Since we moved our office to the neighborhood last year I'm eating at Grumpy's a whole lot more often than I should! The burgers are off the chart and the bar is second to none. It is your dream of what a cool, low-key neighborhood pub is supposed to be.", 
    "review_date": "2010-03-25"
  }, 
  "AmHsNg3SolCitjrRAcYYaQ": {
    "user_rating": 3.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Judith S.", 
    "review_text": "I haven't been here yet but word is that it's \"Dirty Jobs\" host Mike Rowe's favorite bar in the city.  I'll check it out just to have the chance to run into him!", 
    "review_date": "2009-12-11"
  }, 
  "p9OUxMKlyRkOueYAeHuXig": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Learnee L.", 
    "review_text": "lunch with co workers after watching d Giants parade. the crowd hasn't arrived so we got good seats.  we ordered burgers and drinks.  I got mushroom Brie burger with fries= good. burger was cooked perfect.  service... slow. d servers and the kitchen were backed up with pick up orders that they kept  their seated customer waiting for at least 30 mins. I think a good restaurant management should plan to make sure that this doesn't happen.", 
    "review_date": "2010-11-12"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Thank you Grumpy's, for satiating my bleu cheese burger craving at lunch today.  Next time, though, when I ask for it \"medium well\", can you make sure it's not pink in the middle?  Kthxbye!  (PS. They seem to have a pretty nice happy hour going on here....$4 margaritas till closing?  Mmmmmmm!!)", 
    "review_date": "2008-05-07"
  }, 
  "3rBR1WbqpYm4c4FrnDlOKA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deb C.", 
    "review_text": "Hidden area of the Financial District - The BEST burgers I've ever had. My favorite is the \"California\" which includes Monterey jack cheese, bacon, ortega chile &amp; sour cream. It comes with either french fries, potato salad or mixed green salad. The mixed salad is fresh and comes in a big portion and the fries are crispy and so GOOD! Also, this is a cool place to go for happy hour. Not too much of a selection but they have good appetizers &amp; beer.  Only open M-F from 8am - 10pm but sometimes they close early if it's slow.", 
    "review_date": "2007-04-27"
  }, 
  "6NKZzw6lwdAji-Sc2l9w4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick W.", 
    "review_text": "Local pub local to my office near Levis Plaza on Battery.  Great location, quiet street setting. They have very good service, even when it's packed, great burgers, a wide selection of beers and just all around fun place to hang during lunch or after work.", 
    "review_date": "2011-09-12"
  }, 
  "DLrptiHwqa0JLYFJsp4vzg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David R.", 
    "review_text": "Any burger that requires three napkins to finish is a good burger in my book... then there's that whole idea of Guiness with lunch. Now I need a nap. When I'm done with that, I'll be back for some buffalo wings.. ..", 
    "review_date": "2006-03-31"
  }, 
  "AlBoilRiKVTW9B0qr6wt6w": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Rich N.", 
    "review_text": "Tasty burger and a decent beer selection (including one British ale, always a good sign as an ex-pat!).  One star knocked off for a soggy burger bun.", 
    "review_date": "2012-04-27"
  }, 
  "ZeYj7JqE_4gcXQEyaEalQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael G.", 
    "review_text": "My hat is off at Grumpy's! This place is legit, great food, oh my god, great food. The burger here is damn good. If this is your first visit go Burger or Cheeseburger medium rare and dont even look back. The juice coming out of their burgers is exactly the way a burger should be, juicy! The meat to bun ratio favors the meat, a huge plus. Great fries, free refills on your sodas when your just trying for business in the front, but god forbid you ruffle the party in the back for a drink special Monday - Friday like a $7 beer and a Jameson shot, which kick starts my mullet. The food menu is great pub food, burgers, grilled sandwiches, god if you like BLT's, who doesnt, its awesome. They have TV's on the wall for you viewing pleasure and a fun comfortable atmosphere. May I recommend you get here before 11:45AM, as any financial district favorite goes, this one is BUTT SLAMMED for M-F lunch. Dont be afraid to call in your order and take this set up back to your desk, leave the leftover Lasagna at home!", 
    "review_date": "2008-12-31"
  }, 
  "XDgKe98qTvxuHNuwUVLwNA": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Ron S.", 
    "review_text": "This was my first visit to Grumpy's and I do believe I will be a patron of this establishment once more because I liked it and the food was good.  I tried their Turkey Pastrami Ruben with a side of shoestring fries (to which I am told is not the normal fry type, steak fry is the normal selection).  The bread was well toasted, but the kraut and pastrami 'juice' made it a little soggy.  The turkey pastrami and kraut were very good and I will be having that sandwich again.  The atmosphere is fitting as a pub, with mystery dollars tacked to the ceiling.  Some of the dollars are intricately placed and folded causing me to wonder how the dollars are placed there along with the obvious why.", 
    "review_date": "2008-09-22"
  }, 
  "yOSlEtwWOW_gklOWmUOsNQ": {
    "user_rating": 2.0, 
    "user_location": "Fowler, OH", 
    "user_name": "Ryan S.", 
    "review_text": "Was disappointed to learn that the prices and specials advertised on their website are very outdated (writing this review a month later so they had time to update it - hasn't happened yet). No more $4 drafts/margaritas at happy hour... how about $8 for a can of PBR and a shot? To be fair, those prices seemed a little too good to be true for this area.  Food-wise, the burgers were amazing, but the garlic fries were icky. Wet and creamy instead of crisp and aromatic.   Overall, if you're looking for an affordable dive, I don't think this place qualifies. But if you are in the mood for a tasty burger, definitely check it out.", 
    "review_date": "2014-02-21"
  }, 
  "6Dc89_MPk-FBhiImUOkSPQ": {
    "user_rating": 2.0, 
    "user_location": "Portland, OR", 
    "user_name": "Sabina U.", 
    "review_text": "After my last visit, I don't think I'll be going back. I went in to order some food to go. I knew what I wanted, but it was extremely difficult to get the bartender's attention. When he finally asked and I said I wanted to order food, he stopped me and said, \"then hold on\" and proceeded to serve customers behind me. Didn't offer me a menu or an excuse. Even the customers behind me said, \"but the young lady was in front!\" The bartender said, \"that's fine\" and proceeded to take their orders first. I ordered fish &amp; chips and got a non-itemized bill for $11.91 (menu price is $7.95). Even with taxes, that seems excessive, but at that point, I just wanted to be out of there, so I didn't argue, just paid and left.  Also, don't even bother deciding on a salad. The menu lists 12 salads, but every time I tried to order a salad other than Caesar or Chef's, I was told they don't have it.", 
    "review_date": "2013-03-27"
  }, 
  "cmK5ubZx4jmyJYhdK2qw2A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Inome C.", 
    "review_text": "its small &amp; its a bit out of the way but the bartenders kick ass as does the bar food!", 
    "review_date": "2007-03-29"
  }, 
  "QtuP5qUpJ0JX_O8A_64k0g": {
    "user_rating": 4.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Hye-Min O.", 
    "review_text": "Awesome hole in the wall pub!  Randomly stumbled upon this place on yelp and decided to come here for dinner, after discovering Sushirrito closed after lunch.. It was packed, but we were quickly seated.   There was only one person working taking care of drinks at the bar, taking orders, and bringing out food, and he still came by promptly to bring us all ice water and take our orders. Our food came out relatively quickly too. Service was superb!  The food was delicious too. I got the cheeseburger with the fried egg and it was cooked perfectly. Definitely hit the spot after a long day of roaming SF.  The interior is pretty small and very dark - a typical pub-like feel. There are a bunch of bills stuck on the ceiling and the tables are in a tight arrangement. Felt a little dingy, but what pub doesn't?  All in all, great find and not to mention it's a short walking distance from the pier! Took a nice stroll afterwards to walk off our meal and got to see the gorgeous bay bridge in all its lit up glory. Definitely should give this place a try!", 
    "review_date": "2014-01-09"
  }, 
  "yBByHjBmvXVWOJVR5HWjcg": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Stef S.", 
    "review_text": "Not that I'd expect anything different from a pub/grungy bar... but holy cow were those burgers greasy! Were they good? Yes! But after finishing off an entire western bacon cheeseburger and onion rings (I was hungry...), I've been full for the last 12 hours. No joke. It's a heart attack on a plate. Specialty burgers are $10.50 + extra if you want onion rings.   The services leaves much to be wanted. The tables are gross. The place is a bit of a hole in the wall, but the place seemed busy and popular so the crowds can't be wrong, right?  The food is good, but i wouldn't call it the best bar food i've ever had. The onion rings were again good but not great. i'd come back again if a friend wanted to go but I wouldn't come back on my own. Given the ambience and the sopping wet hamburger bun (From absorbing all that grease! I am telling you!), I deduct another star from what I would call a fun but mediocre place for food.", 
    "review_date": "2012-05-17"
  }, 
  "TOj5yZZEwS3J3fLgo3V3yQ": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kelly G.", 
    "review_text": "This place is alright with me. I met some friends there. they said it was their version of Cheers. And everyone did know their names.  They were celebrating one of their co-workers last day or something. They cracked me up with the story of how she didn't even order a drink and left. I ****finally**** got one of the best margaritas I've ever had. But apparently, it was too late to order any additional food. So I picked at cold french fries and rubber band calamari that was left on the group plates. They said the burgers were good there. I'll never know.   The restroom was slightly scary. There was enough tissue and soap and towels. But the logistics were scary. Does this door lock? Does it stay locked?   All in all, it was a fair experience. I was not spending the night there. I was just grabbing a quick drink after work. So it's alright with me for that...", 
    "review_date": "2009-05-12"
  }, 
  "kZOiwf44brbn-2CtOktBEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Q L.", 
    "review_text": "Friend : dude she's not your type. She has really short hair and sorta ehhhh looking. Me : I know but she's different and somewhat cute. It's not the jameson talking either. It's the inner beauty we should be looking for right? We all get the old bro. Friend: shut up, drink some more and stick with your cougars  I usually dont go to bars like this. the crowd is generally older, loud, divey and small. But check this out, they were showing some old school break dancing moves on the flat screen and sometimes a cult movie is on. dollar bills on the ceiling? what the heck? kevin the bartender is extremely friendly and remembers multiple drinks with changes on the fly. it does get really busy and most of the time its either and one or two man show. burgers are juicy and cooked like the way you want them at home. and can i custom order crazy stuff? how about garlic onion rings, and garlic fries with bacon! dayam....... imma be buzzed and my breath smell? no clubbing fo rme tonight. this place might look a little weird but has great character. and thats what all \"i\" should be looking for.", 
    "review_date": "2013-02-03"
  }, 
  "oZHcTvwGnhMqH7ZSNUEtSw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David G.", 
    "review_text": "I will probably never give out 5 stars, kinda like Michelin being so stingy with the 3 star rating. I just feel like five stars is kinda unattainable, you would have to have a world class chef and a bartender serving only you. That said, the fact that Grumpy's, with the grill guy chefs and emo bartenders, earns four stars is saying something. I work at a construction site right around the corner and my food is usually ready at 12 which is a plus because I get a half hour for lunch. I always order the Super cause, well, it's super. Fried egg and bacon on a burger? MMMMmmmmm!  Good atmosphere for afternoon drinking too. We took over the bar with 10 plumbers one day before Christmas, it was great times.", 
    "review_date": "2007-03-25"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "I run by this place all the time and always want to stop and check it out.  I went yesterday after work and had a great experience.  $6 for a pint of Anchor and shot of Jameson!  I hear the food is great and they have plenty of flat screens showing sports.  Outdoor seating to boot.  Next time I go running, I'm bringing some cash.", 
    "review_date": "2008-08-28"
  }, 
  "my36mJlxoSwNoA_rgLkLAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marie P.", 
    "review_text": "I like this quaint little pub! Perfect spot to grab a beer, drinks fries and fun! I like coming here with the co-workers to share great conversation. They have happy hour specials!", 
    "review_date": "2011-07-18"
  }, 
  "92z73FpgQ3lAZY0nrHP1qg": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Jason G.", 
    "review_text": "Too many chances...  Food is overpriced at this wanna-be pub.  Wishing it was in a busier London district rather than a San Francisco outskirt, Grumpy's Pub is the kind of place you can go pay DOUBLE DIGITS for a burger and still feel like you could have just eaten the cow on the farm and saved a bit of cash.    Food is horrible here.  WORST!!!  Service is awful.  One time I ordered a  Rueben without the Turkey, and they took out EVERYTHING.  Thanks Grumpy's for the two slices of stale rye and the luke warm red meat.  Can I at least get some sauerkraut, cheese, and if it's not too much trouble, some MUSTARD???  \"Not enough mustard\" has more than one meaning here, believe me.  How's about some breakfast?  Not after 11:30?  Have you ever been to an English Pub?  It doesn't matter what time it is, they make eggs all day!  Plus, if someone wants an egg sandwich at 3 in the afternoon, don't say you can't do it because you're too busy.  If you are too busy to make two eggs on bread with cheese, then you must not be able to handle ANY OTHER ORDERS!!!  Get your $#!T together or close down shop so something better can move in.   Bah I SAY!!  BAH!!!!", 
    "review_date": "2011-04-08"
  }, 
  "syeYjOT3nGDBvafefgFsZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian V.", 
    "review_text": "Grumpy's serves as the meeting place for the non-suited maritime industry at my work.  Usually after a Board meeting, much like agendized issues, there will be a split between the pilots and industry; the industry head to table-clothed diners such as Tadich Grill and Piperade while the pilots head to Grumpy's.  Coming here, I now know why.  Placing the batsignal to prison fodder Hueyn/Mindy, we arrived to a packed bar.  Grumpy's is a very small area and on the initial scan, this place reminded me of the mythical Tortuga.  At the bar, you see full-blossomed strumpets laughing at every joke of their consorts, vying for attention and hopefully, another drink, slyly letting their robust chest touch said man's arm from time to time.  Ahhh..the power of female wiles.  Basically, for you Davis alumni, this is Cantinas del Cabo in the daytime.  The manager was very gracious despite the crowd and rush of orders, ushered us to our table in a timely fashion.  I ordered the Baja burger while Mindy ordered the Western burger.  Our waitress was brisk and curt, understandable with the lack of manpower here, and could not engage in banter.  My gripe with this place is that the food took forever which seems to be a reoccurring theme among it's clients.  The problem with this is two fold: 1.  one gets extremely hungry 2.  most importantly, if your company is with somebody similar to Huyen/Mindy and his stories of getting turned out in prison become trite and downright sick, the conversation becomes rather stale and there is only so many people you can text or pretend to check time.  jk jk  The burgers finally came out and by that time, I was too famished to really enjoy the burger.  This burger, similar to the Old Ship, is more of a bar burger.  There is nothing gourmet about it.  It drips grease and the bun becomes soaked quickly.  I prefer my buns toasted. The patty was large but devoid of any robust flavour.  I found the picca de gallo to be underwhelming...the salsa wasn't distinct.  There was a minimal amount of seasoning...again..this is just your salt and peppered'd hamburger patty.  This is not your 7x7 Top Burgers that cost $15-20.  The fries were your traditional American salted fries..soggy but with ketchup and ranch, the perfect complement to a meal.  The bacon was thick and bountiful and the bottom line was that it was food for the soul, good to coat the lining of your stomach for an impending le twist adventure.  You will come to Grumpy's leaving without its namesake emotion.  The burgers are old fashioned and simple and takes me to a childhood when I did not know of finer things in life such as brie, fried egg, goat cheese condiments.  Sometimes it is better that one does not know.  They also have a $7 special during happy hour consisting of a shot of jamison and a brewski.  Drinks to the most delectable cutlet at the bar...wadDUUP.", 
    "review_date": "2011-03-18"
  }, 
  "m3PY8eFg_kMe9nbEJrpWWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary H.", 
    "review_text": "We frequent this neighborhood spot for happy hour.  They have great appetizers and good beer.  What more could you ask for?  oh yeah, good prices and happy, buzzed friends all around.  Breakfast: try their egg &amp; cheese sandwich....the last time I had it it comes with country potatoes and is only $3.50!  For lunch I like their turkey burgers...YUM!", 
    "review_date": "2007-01-18"
  }, 
  "77K9EhqsZrnqmsNKKwqkrg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich G.", 
    "review_text": "I've walked past this pub a number of times on my way to the new Exploratorium. I happened to be hungry this past week and decided to stop by to grab a burger. The other reviews do not lie. The burger with a fried egg and bacon was one of the tastiest burgers I've ever had. I asked for medium rare, and it came out exactly as ordered. The beef patty was seasoned perfectly as well, you can still taste the meat. I have plans to come back to try their other Signature burgers at $12 a burger.   Side note, the fries it came with were also very crispy. I opted for the garlic fries, and they definitely have a kick.", 
    "review_date": "2013-12-10"
  }, 
  "qUJmdUBUXEy7_73Ie_CWrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sydney L.", 
    "review_text": "great burger.", 
    "review_date": "2008-01-28"
  }, 
  "3lWC0riFiQmnchl1BYZYKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott G.", 
    "review_text": "My review is for their lunch, I have not had the opportunity to check out their Happy Hour yet.  I came in on a friday just after noon and was immediately able to sit down.  Service was really quick and the servers were very friendly.   I got the French Burger with a side of garlic fries.  $10.50 seems a lot for a burger but I was surprised on how big this burger was.  I will definietly be making two meals out of it.  When I got the bill, there was a $1.50 difference between the check and the subtotal so I asked the waiter and he explained that the Garlic Fries are extra so be forewarned when the waiter is going through the available sides for the burgers that Garlic Fries and Onion Rings are an additional charge.  I would recommend adding that line underneath the available sides so they don't get anyone upset in the future over hidden charges.  But overall, it was a great meal.  If the prices were a little cheaper I would have given it 5 stars but hey, this is San Francisco, and the place seems to be pretty popular.  I just wish it were open during the weekends.", 
    "review_date": "2011-10-28"
  }, 
  "qthtyjV-1dHIApNHtWB40A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine S.", 
    "review_text": "I work right around the corner from Grumpy's and never even knew it existed! This place is a total dive, but somehow draws the pretentious crowds of the nearby advertising agencies, which I will have to admit, I am part of. I am excited to go back to Grumpy's for an after work beer with the co-workers or another lunch.  The place was packed, but somehow we got the last table for the six of us and didn't have to wait at all. All of the guys ordered hamburgers and my female co-worker and I both ordered salads...go figure. The hamburgers looked delicious as long as you don't get it well done or as it states on the wall, \"like shoe leather.\" I got the Summer salad, which was really good and had chicken, feta, mango, avocado, tomatoes &amp; garbanzo beans on it. You can order each of the hamburgers replaced with chicken if desired or you can choose any of the many other sandwiches on the menu. They also have various types of appetizers, fried chicken, and macaroni &amp; cheese on the menu that sound great!  The service was pretty good, not great and the wait staff was friendly enough. I will definitely make the short trip back to Gumpy's soon...maybe even tomorrow!", 
    "review_date": "2007-11-08"
  }, 
  "ghRwENzjazf5b94m5ga5NQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth G.", 
    "review_text": "They have a cool bartender called Mary.  She serves the best pint of Boddington's around!  Greasy bar food + shots of Fernet on special = a perfect Friday Happy Hour.", 
    "review_date": "2006-03-25"
  }, 
  "OphDzZtaiDs5grWP-Enjpg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curran H.", 
    "review_text": "When I call in a lunch order of 5 burgers,   and you tell me that they'll be ready in 20 minutes,   and I arrive in 20 minutes,   and you tell me that it'll just be 5 more minutes,  and the 5 minutes turns into 20 minutes,  and then you finally produce my order,   and then when I get back to the office I discover that 3 of the burgers were made wrong --  -- don't expect more than 3 stars.", 
    "review_date": "2009-04-03"
  }, 
  "wvz6uXRByI_TQ2YgYGAllQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Pika C.", 
    "review_text": "The food is decent. Good for drinks during and after work. Nice because it is close to work. The service is excellent, though! You should also ask them to make the publicis lion roar! Burgers are a little pricey for just burgers, but they are pretty yummy.", 
    "review_date": "2006-06-08"
  }, 
  "PvBmRN4suldo06Kcz2-vcw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin L.", 
    "review_text": "burgers ok, chicken burger always over done.  and their coke is always watered down and just doesn't work.  never fixed.", 
    "review_date": "2008-03-27"
  }, 
  "YSDhmkxZ84eIzaG-5Z6jBg": {
    "user_rating": 4.0, 
    "user_location": "Alexandria, VA", 
    "user_name": "Sabine S.", 
    "review_text": "Can't tell you how many times I went here for lunch during work, then got wasted on bloody marys. Love the burgers (any can be made into a turkey burger) and love the drinks. Can be hard to find a table, but if you're in the area, well-worth the wait. Stay away from the Jaeger though...", 
    "review_date": "2008-02-10"
  }, 
  "F6bOroEwVX0t2Z0jvH4miA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghana A.", 
    "review_text": "Even with the wait and lack of tables, Grumpy's food has me salivating long before the lunch hour.  Their burgers are what burgers should be: thick, juicy, and full of flavor.  The burgers also come in many different styles - Popeye (with spinach and feta); Mushroom-Brie; etc.  Their onion rings are amazing, fresh, crunchy, and full of flavor.  Lots of good beer on tap (Fat Tire, Guiness, etc.) and they do serve other items if you aren't feeling burgers that day - fish; patty melts; chicken tenders and the like.  The only \"grr\" about the place is the wait, but with the food served, it is no wonder.  Key point to Grumpy's if you have a big group - send someone over ahead of time to hold a table, calling doesn't help.", 
    "review_date": "2007-11-07"
  }, 
  "r11Z9_0HZulh9JRqI6WKWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matt s.", 
    "review_text": "Grumpy's is a kick-ass hole in the wall sorta pub.  They've got about 6-8 beers on tap and a nice selection of liquor.  The burgers and fries are solid drunk bar food and go well with a pint or 12- just keep in mind, it's a pub, not whatever gourmet place some people seem to exclusively eat at.  They have booze, the prices are reasonable, happy hours are entertaining (Thursday $4 margaritas, M-W is beer and a shot, F is $3 tall boy tecates) and the bartenders are superfriendly.  Well, at least they are to me because I have fun with them.  Sean, Mary and Kevin rule- mostly at destroying my liver with love.  There's usually a decent crowd in the mid-afternoon and it stays pretty busy until about 8 or 9, when most of the passersby head off to north beach since most everything else in the area shuts down by 10.  The crowd is mostly younger, but still an interesting mix of people.  It's almost undoubtedly the most laid-back, unassuming place to grab a drink.    If you want a place to chill after a lame day at work, this is it.  All the Paddy's/Cheers references are spot-on.", 
    "review_date": "2009-11-09"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "My memory is better than I thought. I went to Grumpy's for the first time a few years back and remembered it as having a good burger. But this was before yelp, so I never had any place to record those thoughts for the world to see (and for me to use as a reference point years down the road). So I wasn't sure.  After returning for a second time, I can yelp with complete confidence it is indeed a great spot. Plenty of beef-turkey-chicken options, super friendly/quick service, and fries or a salad on the side. My turkey burger was delicious, no wheat bun, but I appreciated being offered wheat toast instead (yes!), and the side salad was bigger than expected. Everything felt very reasonable for $9.  Only the lack of a distinctive bonus - house veggie burger, grilled onions, etc - prevents a clean sweep of stars. But it's a solid four, and one of the better financial district burger spots.", 
    "review_date": "2009-11-11"
  }, 
  "1yeS87Cj8DhbLXSLYxzIzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paula H.", 
    "review_text": "You've gotta order one of the burgers here. It's a BURGER place, first and foremost. I went with friends and wasn't really in the mood for one, but it seemed like the right thing to do. Turns out, it was a fabulous burger. Cheese and pesto. We sat outside on a lovely autumn day. Good thing we did, because later when I went inside to use the rest room, I found myself blasted by the volume of the TV and other diners. This Friday lunchtime crowd was very noisy.", 
    "review_date": "2010-10-03"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Finally made it here and it's Margarita night!  $4 for tall margaritas from 4pm till close!  Let me just say that they are generous on the tequila :)  So that's definitely a great start and hubby was happy with the many drafts available.  We got in slightly after 7pm and were still able to order food.    Hubby got the Fat Tire and I got the margarita, after all, how can anyone turn down a $4 tall margarita?  One sip and my first reaction was \"wow, they are generous on alcohol!\" and hubby took a sip and agreed.  I think I'll be returning on Thursdays just for this.  Now food, I remember reading about their burger and one of the bartenders confirmed it.  Hubby got the mushroom brie burger with fries and I decided with the fried chicken with mashed potatoes w/ gravy and some veggies.  The burger was cooked to order, medium rare and the brie was a great combination.  The fries were perfectly crispy, great when hot but still good when it cooled down.  My fried chicken - there were 3 pieces - one each of the wing, thigh and breast.  It was very crispy but pretty tasty.  I only had the wing and thigh since I'm not a white meat person.  Hubby had it and said it was a bit dry.  However, the mashed potato was SO GOOD - it was lumpy so you can taste the real potato and the gravy was good.  The bartenders, Sean and Kevin, were both friendly.  Sean also made a spice pear martini for me - some special and it was tasty.  Again, generous on alcohol.  The regular patrons were very friendly.  We struck up a good conversation with a few and perhaps we'll run into them again.  A great neighborhood gem.  If there's a fault, it would be that they close early around 9pm...", 
    "review_date": "2008-11-13"
  }, 
  "kzkAXy9mJS6gMljzC4xGXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gary T.", 
    "review_text": "If you want great burgers that are really filling and not overpriced, then this is the place. Their signature sandwiches are really good too. Word of caution; it gets really busy during lunchtime and try to ignore the sides and focus on the burger/sandwich itself or you'll find yourself full in no time.", 
    "review_date": "2008-07-15"
  }, 
  "_sDR1ZfOQuaauOFUSlveDQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rocky S.", 
    "review_text": "Damn good burgers and the fries were just as good. There are only a few places that can cook a burger to order and this is one of them.", 
    "review_date": "2011-01-03"
  }, 
  "TAZ2UvEzXXbieQMCWn8qhw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Luke S.", 
    "review_text": "I've crashed some private parties here and had the time of my life goodtimes.   Totally time of my life and memorable. I gotta say they have one of the best happy hours here too. Every happy hour is like a huge party.  This place is soo conveniently located too.  The burgers are really good and huuuuuge. I danced on a table here once and no I didn't fall, skills.", 
    "review_date": "2014-08-05"
  }, 
  "JSPE5bMOg6rAKvKVEdfIXw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alita M.", 
    "review_text": "I order to go all the time for work lunch, but last night's service was a little ridiculous. The owner was hosting a private party with 7 people in the back of the restaurant and had the only server and bus boy completely focused on him and his group. That left the poor bartender, who was super nice and was doing his best to get us square away, to serve our party of 6 plus the few other couples that wandered in. We weren't more than 5 feet from the bar, but it meant that every time we wanted to order a drink or order  appetizers that we had to go up to the bar and put in the order. After the first 30 minutes, the bartender then came out and took our dinner order (to be honest, it was when he realized that no one else was going to do it who should have been taking care of us and took it upon himself to fix it).   When I have to watch someone polish wine glasses and set a table with candles and a white table cloth while waiting 15 minutes for someone to come over and ask if we want a drink  - there's something wrong. Oh and did I mention that we even started to bus our own table? Meanwhile, there were custom made plates of off-menu items being rolled out to his private party.  I hope that the owner reads this - and DO NOT take it out on your bartender, not his fault and he was flawless with us. Close down your place if you're hosting a private dinner party or go take them out to somewhere else where it doesn't disrupt your business.", 
    "review_date": "2012-07-11"
  }, 
  "IxKVvGmFIEz77YYL-5_YxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N S.", 
    "review_text": "I've been working two blocks away for almost a year and only today did I try Grumpy's. What the hell have I been doing all this time?  I had lunch here with a coworker at around 12:45 on Tuesday and it was pretty busy. There are quite a few tables for a small place and a few tables outside. The street is pretty quiet, but noisy enough to enjoy the bustle of outdoor seating.   They serve the typical pub grub bites, but they focus on burgers. They probably have over ten combinations to choose from and give you the option of beef, turkey, or veggie patty. I ordered the Cafe Style Burger with avocado and sprouts with a side salad. I was surprised to see they served a legit side salad with carrots, tomatoes, cucumber, kidney beans, garbanzo beans, black olives, and wait for it...a slice of hard boiled egg. That side salad could have been a meal on its own. Other than salad, you could choose fries, onion rings, or if you're like the lady who sat next to me, mozzarella sticks with your sandwich. All of this food for under $10. It's a pretty good deal. The ingredients could have been a bit fresher, but other than that, no complaints.   They also have a really decent selection of draft beers. No Budweiser or Coors Light here, at least not on tap. They serve Mirror Pond, Stella, Anchor Steam, Firestone, Dos Equis, Hefeweizen, and some others for only $5. They have Guinness and Boddington's for $6.", 
    "review_date": "2011-07-19"
  }, 
  "2obAyPuH-G3Dn3EUdQnQlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dean E.", 
    "review_text": "drinks always seem cheap. and stiff.", 
    "review_date": "2005-02-23"
  }, 
  "UC0DrrNqqzgdiclxazjesg": {
    "user_rating": 4.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Andrew S.", 
    "review_text": "Walked by a bunch of times so had to give it a try. Packed at lunch time, close enough from the fin district to make the walk. Burger was good, not amazing... Same with the fried chicken. Beers on tap rock, loved the boddingtons-like red hen. What makes the place special is the cool bar atmosphere, loaded with people, fun hang out, good for afternoon sports.", 
    "review_date": "2013-10-04"
  }, 
  "0DAJCCZcwsftU0gX5C0P7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shaun l.", 
    "review_text": "Grumpy's is an interesting mix of an English pub, Fidi / Ad agency lunch spot.  The small, bustling little brick building delivers some tasty burgers, fried chicken, and generous portions of the greens (definitely a plus).    Full bar, and plenty of beers to choose from, so don't be shy... treat yourself to some alcoholic refreshments.  Speaking of shy, you'll probably need to be aggressive about flagging someone to take your order.  And don't come here if you're in a rush either.  Love the name of this place too.", 
    "review_date": "2007-01-26"
  }, 
  "fB8AWUP4lYhHTz70aWbwlw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B R.", 
    "review_text": "Good Grub, great sandwiches, outdoor seating (but limited).  Casual environment but not a dive bar.  Good experience everytime I'm there.  Would warrant one more star if the service was faster than slooow.", 
    "review_date": "2008-03-14"
  }, 
  "u2llfHvzBvfjvRxKm3wyeg": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mark S.", 
    "review_text": "I write my reviews, usually, when I want to gripe - not often enough to pay a compliment - and this is no exception.  Been eating at Grumpy's once a month or so for a few years - usually take out for a working lunch. I'll call in the order about 11:30 for a noon pickup - usually it's only a five minute wait when I go to pick it up.   Not this time.  Apparently they screwed up, and made the tuna sandwich I ordered, but forgot the hamburger. Shit happens. But I say apparently because they never told me anything about a delay. Five minutes....ten minutes...finally I grab someone to find out what's going on. They tell me the burger is being made.  It's 12:20, more than 40 minutes after placing the order that I get my food. And worse than all that - they were rude about the whole thing!! As they finally gave me my food - still no explanation, the waitress gives a bland \"sorry for the wait, hey can I give you a chili or a soup or something\". As I'm about to walk out the door with the overdue order.  I told her, \"I just want to get out to my meeting, the time for a gesture like that would have been ten minutes ago while I was standing there like an idiot\" and she got all snippy with me.  Time to find a new burger joint", 
    "review_date": "2008-02-22"
  }, 
  "RWUKFRBQxwsgKMFVa3m3Dw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily L.", 
    "review_text": "Went here for a quick bite before going to the exploratorium for the day. I had a Baja burger with garlic fries. The burger was decent and their regular fries were nice and crispy. But the garlic fries are not worth it... it's just regular fries with a teaspoon of garlic paste on top. The paste made the fries a bit soggy... and it wasn't even tossed with the fries, just placed on top of them...", 
    "review_date": "2014-01-20"
  }, 
  "Vp6rrcLo9MrubLNAJ4rOPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "adrian b.", 
    "review_text": "I'm a little upset knowing this business was partly responsible for keeping Off the Grid away from the area (Vallejo and Front). But I can understand why they'd do it.  However, I've come here a few times anyway. Once, I asked the bartender for some drink... let's say it was a Lagunitas. He didn't have it or there was some problem with the carbonation. So I asked for a... let's say Racer 5. There's no way I can remember exactly what beer I asked for. Same problem.  So he gave me a free beer. And for that reason, I will forever be loyal to Grumpy's. Thank you, cool bartender. You were also very fast and hard-working, virtues I admire.", 
    "review_date": "2013-08-18"
  }, 
  "wcwH3HDVkIi9J90XzCZJkQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddy N.", 
    "review_text": "Solid bar food, good drink selection. Cheap drinks, moderate food prices. Friendly staff. Would definitely go again.  And you might run into the occasional ABC, CBS, NBC TV/ News people there.  Celebrity siting so far- Mike Roe from Dirty Jobs and Jaime Heyiman (sp) from Myth Busters 3 1/2 stars.", 
    "review_date": "2007-11-15"
  }, 
  "ZOzNbglhE2ohPg0tQkvWlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin N.", 
    "review_text": "This place rocks....okay so I've only been once, but in that one time I ended up shot gunning beers with the bar tender, closing down the bar (after kicking a shaddy character out), and sticking around to play my first ever round of dice for horrible tequila shots (poor greg.....).   This is one of my top ten favorite bars! Locals only, yet somehow they let me hang.", 
    "review_date": "2006-05-29"
  }, 
  "FysXnUshJOvFkCl5nz_tKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony P.", 
    "review_text": "Best damn burger in the Financial Dist if not the city! Just ate there again today with 3 other compadres. The freakin burger was perfect. Soft warm bun...nicely melted gooey cheddar, and they even have Grey Poupon (best mustard) the rest is yellow/brownish crappola. Diet Coke was mixed to perfection. All in all great lunch. Even had a side show of a couple trying to have a meaningful conversation. This place is LOUD. Perfect for eating and certainly not reading some lame ass book at the bar while scarfing down a Mushroom burger. At least it wasn't a Starbuckian with a lap top.", 
    "review_date": "2010-01-29"
  }, 
  "G8o1w7m4Vn_VxJaHC4-7hg": {
    "user_rating": 5.0, 
    "user_location": "Norwalk, CA", 
    "user_name": "Jessica W.", 
    "review_text": "Came in with my boyfriend for lunch and we weren't sure what to expect. We aren't from here and had been walking at the Exploratorium all day so we were starving. Rather than eating at the exploratorium we searched for a place nearby and found Grumpy's.   We walked in and were greeted and took a seat. They have a decent sized bar and a good amount of tables inside. We ordered off of their $5 draft menu- good deal, and each got a burger. The initially brought us both the same type of burger even though we ordered different but they handled it well and took one back and brought out the correct one,   The burgers were AHHHMAZING. The patties were thick and juicy, and the toppings we got were yummy. I got my burger with onion rings instead of fries and they were the best onion rings I've ever had. The fries were crispy and delicious too. If we were in town again we would definitely come by again. This place is totally a dive bar but they put out some good food. Must try!", 
    "review_date": "2013-06-28"
  }, 
  "qI1o7LA-Fegcs5xpxRvTaQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina A.", 
    "review_text": "I might be making a mistake in getting my food to go from here. Even when i called ahead, showed up after they said it would be ready, i still waited.  The point of take out is you don't have time to sit and eat. Any how the burgers are decent, I like the brie mushroom, and they get points for many different flavors, toppings.", 
    "review_date": "2008-01-09"
  }, 
  "hq36rzGMbnoK17ZZc7zIvQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison B.", 
    "review_text": "When I worked near Levi Plaza, I always kicked off my weekend with happy hour at Grumpy's. Great prices - $3 Tecate was always a popular choice. Their food is excellent as well. Try the veggie burger, you won't be disappointed. Grumpy's can get pretty packed around 5, but it usually clears out by 7:30 or so.", 
    "review_date": "2011-04-01"
  }, 
  "M271Ac7UKVaQ9U5AOvc_9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicky L.", 
    "review_text": "I'm slowly beginning to infiltrate my circle of friends: they're starting to use Yelp more and more and discovering just how awesome it is.  Case in point: Happy Hour suggestions around Financial District/the Embarcadero brought up Grumpy's.  I never even knew this place existed, and I would've easily passed it over since it's really nonchalant and the entryway is small and it sits in the middle of warehouses and office buildings on Vallejo.  Parking there after 6 PM is super easy, and the place wasn't busy at all.  Chicken strips and fries were delish (as opposed to the T.I. Bar &amp; Grill, ew), and even though I'm not a beer fan, theirs didn't make me gag as much as it usually does.  Really super chill, laid-back place (although the other groups in there at the time were REALLY loud so it was kind of hard to have a conversation).  Overall an excellent place to rewind after work.  Too bad it's not closer to the main part of the Financial District - but then again, maybe it's good that it's NOT closer because then it'd be WAY packed and I'd be sad because I'd have to wait for my food.", 
    "review_date": "2010-01-17"
  }, 
  "L45t1jlp0aR2wY3_reiqDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay S.", 
    "review_text": "Two words: Sean and Kevin. These are hands down my two favorite bartenders in the city. Even my boyfriend loves them. Go meet them. You will thank me. Pitchers are the best value, burgers are fantastic. and there is dice behind the bar. Doesn't get much better than that. Now if they were only open for brunch...", 
    "review_date": "2010-07-20"
  }, 
  "aEKUC4oQg2CokbwyW_CXSg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah R.", 
    "review_text": "totally reliable if you're in the hood and looking for pub food. good grilled cheese and tuna melt. love the tuna burger popeye style - feta and spinach - yum! if you're hungover at work and need a bit of grease hit it up.", 
    "review_date": "2006-10-21"
  }, 
  "ndic8ChsAW6zqtBjpHFqvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "OK I went there again and now there are four reasons i like Grumpy's. One, the food is good. Two, the service is awesome. Three, the price is right. Four, the turkey burger is tasty. You have to check this place out. It lacks pretension and feels like home; a good home ;).", 
    "review_date": "2006-03-02"
  }, 
  "3WFYabnCc8OXJwupgC8WuA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Meg M.", 
    "review_text": "Love the burgers here. It's a fun, little place.", 
    "review_date": "2013-02-11"
  }, 
  "v9GJDjFkS0IvCw83k-D1xQ": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Alex R.", 
    "review_text": "This place is attached to my work is both really cool and sad at the same time.  Its really cool because this place is really good. The burgers are always juicy. Last time I was here I tried the Super. After seeing my friends enjoy their burgers with a fried egg on it at the New Zealander I decided to go with the Super at Grumpy's because it comes with a fried egg, cheddar cheese, and my favorite condiment...bacon.  The burger was perfectly cooked and juicy as usual. The egg added an extra richness to the burger...it has a soft yoke so it ran everywhere. The bacon added a crispy crunch and bacon flavor.  The fries are pretty good too. Crisp but not over cooked.   The bartenders and wait staff have always been friendly and they do have some good beers on Tap, Anchor Steam yum.  The sad part is I don't get here enough.", 
    "review_date": "2009-02-11"
  }, 
  "vpDL3b-E_SSCCmRjDn9pMQ": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Emmy G.", 
    "review_text": "the pub obviously wasn't named for the demeanor of the staff.  the servers and bartenders were sweet, smiling, and good natured.  but the 4 stars is for the speed with which our HUGE lunches were served, the diverse burger menu, and the bang for your lunch buck.  like they understand that you only have 1 hour for lunch, and half of that is taken up by transit to and from the office.  the staff was quick, the burgers filling, and the taste: sensational.  i wouldn't recommend the onion rings, but the side salads are enormous and the toppings on the burgers took up half the plates!  not to mention that you could have your burger in beef, turkey, chicken, or tofu!!!  i would recommend the turkey burger: it wasn't dry like most turkey burgers, and perfectly seasoned.  i can't wait to go back and try one of everything.  thank goddess for a new lunch destination in the northern embarcadero waterfront!  oh, but you will leave smelling like a giant french fry.  consider yourself warned.", 
    "review_date": "2007-11-14"
  }, 
  "-rvWoBbXarvmL64kfaymQQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel E.", 
    "review_text": "Excellent beer selection in bottles and draft.  Burgers are very good.    Went for the first time with a small group from work (there were five of us).  We got here at about 5:45 and most tables were available but the bar was full - if the weather had not been decent I think people at tables outside would have been in and the seating woukd have been tighter.  Within half an hour the place was PACKED.    You need to know how to operate.  Grab a table first, decide what you want, go to the bar and order your food and drink.  Carry your drinks to the table yourself and repeat as necessary until you are ready to close out then go to the bar to pay.  They bring the food to you and will fetch and carry condiments, et cetera.    One of our number wanted salad and the menu shows several.  Salad was not to be had.  We did not investigate whether this was a normal circumstance or a fluke but I would not get a salad here, the burger was just too good.  Everyone liked what they had.  All burgersnwere ordered medium and they came out exactly right, not too bloody and not too much grease dripping on the plate.    We had a regular burger, a russian burger, a cheeseburger, another burger that came with avocado, and a grilled cheese sandwich.  Fries were good, thicker cut (not steak fries but not skinny fries that are so popular).  The American eatwr among us was very please that American cheese was available for the grilled cheese.  Next time we are wondering where to go for a divey experience but not completely gross, we'll come here.", 
    "review_date": "2011-06-11"
  }, 
  "92X37S-hY1cYhl4IgedpMA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "jamie z.", 
    "review_text": "This is a nice off the beaten path pub, that is relatively cheap, close to work, has out door patio, and excellent food. . .   its simple, they serve good food, they have beer and top chef, its a good little place to sit out and enjoy the weather with out the mobs of financial district over flow you get at lunchtime...  ill keep this one just that simple folks.. oh and someone noted that this is one of the better burgers around, and they are right on...", 
    "review_date": "2007-08-21"
  }, 
  "EAUrXj9VgqYvGuPYEVYOJw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen N.", 
    "review_text": "You can definitely come here and get something a bit on the lighter side. I had the 'summer salad' - with mango, avocado, feta, chicken, onions and garbanzos. Sooo delish.   On top of that, a great crowd to experience the World Cup game with!", 
    "review_date": "2010-07-07"
  }, 
  "PlBEWKn8-ChFeiH1oUYFmQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "James C.", 
    "review_text": "Haven't been here after hours to enjoy the beers yet but the lunches are damn good. Tons of items to choose from including a Shrimp Po'boy that's really good. I no longer have to wish that McDonald's will one day start selling the shrimp filet like they have in Japan.", 
    "review_date": "2006-07-13"
  }, 
  "QvUGS_jz_tbmD7YSjxMc6A": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Jamie L.", 
    "review_text": "Good service, nice ambience, and great drinks! It wasn't that crowded on a Monday night, which I don't mind at all. It's a nice place to chill with the game on and alternative music playing. I was there for the happy hour which had only drinks, no food despite the website.", 
    "review_date": "2014-01-01"
  }, 
  "zpnd-D0-ahcfrYYLvt04oA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ellyk E.", 
    "review_text": "A little tight at lunch time, but the friendly staff makes you comfortable regardless of how close your neighbor is.  The turkey burger is wonderful, but bring a breath mint for after lunch.", 
    "review_date": "2005-07-25"
  }, 
  "epIp3mfCqrtGGsKAcbsdBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anny P.", 
    "review_text": "I work nearby and even hosted a happy hour here for colleagues. Friendly service, busy and happy atmosphere and great specials ;-)", 
    "review_date": "2010-07-01"
  }, 
  "TMt47-ghHgy7hVSgvGXhQA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "blue r.", 
    "review_text": "Wow, I have a feeling I'm not in Kansas any more. Or am I? I used to come here back in 2005 and had nothing but great service and good vibes. I met old coworkers from that era tonight and suddenly, I'm in the movie \"Deliverance\". \"drop them britches, come on now...\"   Seriously. The bartender had a buddy that continued to call me every variation of f@9 over the course of an hour. I placated the guy offering to buy him drinks until he combusted into a rage of anti-f@9ness and the bartenders (both male and female) told me to take a free drink and leave. Ultimately the bartender asked me \"who am I\" to be there, \"we don't know you\" and laid down the law for me. I had no right to be there cause his fraternity buddy felt that he should reconcile my \"gayness\" with the sword of the lord.  Funny, my wife watched in horror at the table on the side. Nice work Grumpy's employees! If I ever thought of being g@y, you taught me otherwise!", 
    "review_date": "2009-03-28"
  }, 
  "wkv0w6P9IgXLCpL6y0MFOg": {
    "user_rating": 5.0, 
    "user_location": "Albuquerque, NM", 
    "user_name": "Maya B.", 
    "review_text": "I've admittedly become somewhat obsessed with Grumpy's. I work right across the street making it super easy to phone in an order and hop over to pick it up. Their pub grub is pitch perfect. Grumpy's burgers, sandwiches and appetizers are on point. The ingredients are fresh and prepared right. They have great drink specials and they atmosphere is cozy and welcoming. The staff is friendly and the prices are low. Doesn't get much better than that. I love it.", 
    "review_date": "2010-01-17"
  }, 
  "0FicklFFAcnBs03gF1ZnhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitt G.", 
    "review_text": "It is a good after work place.... no boohaahaas.... nice &amp; friendly bartenders...  Mostly filled with ppl from abc &amp; nearby offices which makes it better for me to be around since I dont see my own kind.   It is my kinda place &amp; would definitely recommend it for my friends.", 
    "review_date": "2010-04-12"
  }, 
  "Xk8z-5q-FnGfLrofwq5jWg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin T.", 
    "review_text": "This is a bar.  A bar with food.  No frills.  Working just around the corner...you can say that I've been here quite a bit.  They have a full bar and the usual suspects for beers on tap.  Their food is above average for a bar.    If you're going for lunch, beware that on Friday's it will be packed and it may take awhile.  They do claim they serve breakfast, but I showed up at 9ish and their kitchen wasn't open yet, so it may be hit or miss.    I've only gone to this place during the weekdays, with everything around it being offices, not sure what the scene is like during weekends.", 
    "review_date": "2012-03-25"
  }, 
  "O8i10nA3Dh1bfqF1IWWvrA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gnat c.", 
    "review_text": "Looking for a great burger and fries? Grumpy's is the place. Four stars if the service wasn't horrible. \n  My diet coke conundrum continues...poor fountain diet coke. don't. do. it. Peraps it's best to stick with a beer..many from which to choose. \n  Grumpy's is a bit crowded at lunch, but this spot is perfect if you are hungover and need some salt and grease.\n  The service is incredibly slow. I waited for one hour and 10 minutes for food today. This is quite UNacceptable as I only have an hour for lunch. The waiter dood was stellar, but it would have been nice for him to inform us what the hold up was. Only after inquiring about our food did he mention the to-go orders were being processed first. Oh, and the three tables that arrived after us but served first was a let down. \n  No. fun.", 
    "review_date": "2006-01-09"
  }, 
  "LIEQubFyKBjLwriPRPv9fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich M.", 
    "review_text": "Grumpy burger! And a beer! My favorite burger place in that part of town. Don't be fooled by the pub-like appearance. (wait, it IS a pub). The burgers are great. Absolutely tasty. And the fries are good as well. Why 4 stars? Everything I've tried besides the burgers has been pretty much ho-hum. So, if you like a pub-like choice of beer and a really good burger, and, by the way, outside seating on a sunny day. This is the place.", 
    "review_date": "2009-08-30"
  }, 
  "44IpM6ma8qY0i7MTEStH5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "victor s.", 
    "review_text": "Best burgers in town cooked perfectly and the meat is what ground beef should taste like.  I'm not sure if you have had fresh ground beef, but it will have a hint of sweetness to it and melt in your mouth.  The Boddingtons is my favorite beer to wash down the burger with the fries or salad or onion rings or baked potato skins.  The prime rib sandwich is also something to try the next time you are there.", 
    "review_date": "2007-07-23"
  }, 
  "gjZp61JZaqcLrKjEDVSPIQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T-Bone L.", 
    "review_text": "Good burgers and large salads.  They can be too busy on Fridays at lunch time.", 
    "review_date": "2005-04-13"
  }, 
  "QxicE6c4zNxYYJh_aeywlA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "Why art thou open for breakfast?   Hash from a can, day old ice tea, menu says potatoes but they didn't come. Sourdough toast became wonder bread. Found old macaroni on my eggs. Weird. So again..... why art thy open for breakfast?", 
    "review_date": "2012-04-10"
  }, 
  "Dp9vtkpgNti0BuG3202PGQ": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Cyn D.", 
    "review_text": "i was organizing a co-worker's goodbye party and searching for a place with outdoor searching.  I called Grumpy's to ask if they had enough outdoor seating for 20+ people, and they said \"Definitely! Come on by!\"  When we arrived, there were two tiny tables (prob enough seating for 7-8 ppl, max) outside in front, and both were already taken. Sad face.    I also didn't discern anything particularly unique or outstanding about this bar....food &amp; drinks were average in quality and taste, and the decor was pretty standard. In sum: meh.", 
    "review_date": "2008-09-04"
  }, 
  "gNzC6OJIdRlSkEQIZuP8QQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "wendy q.", 
    "review_text": "Aside from always being able to count on Grumpy's for a quality burger, this place has got to go down (along with Old Ship Saloon a few blocks away) in the books and its role in the history of San Francisco's budding advertising industry. Evidenced by placards like publicis and cutwater that are part of its decor, this restaurant is tucked away between the embarcadero and financial district and is always a good place for a solid burger for lunch and a cold frosted beer after work (or lunch!)", 
    "review_date": "2013-03-08"
  }, 
  "vZ5yebmRxe4H4_mb6164gw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily R.", 
    "review_text": "Bad Service. Came in with over a dozen people after a professional mixer &amp; all bought food/drinks. We sat outside &amp; noticed a few glass/plates left over from the previous group. Went inside to ask the bartender if he could have someone come out &amp; buss the table, his response: \"This is just a bar, move a few glasses over yourself.\" I was little dumbfounded by that response, most bars have employees who buss tables not customers who clean up after other customers. What's unfortunate is that he spoiled my experience there, the bartender who previously made me a drink was very friendly. I won't be returning or recommending this bar.", 
    "review_date": "2013-06-17"
  }, 
  "uSCYNal_CJDPGBYUAenyoA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke M.", 
    "review_text": "If this was the kind of place with friendly people, and they could make a decent Hamburger, and you could get a no fuss beer at 4PM for $5 bucks including tip, it would have a nice neighborhood bar charm. But it's not, they can't, and you will need to shell out at least 40% more than that. Very limited reasons to come here. Pressed to think of one, I'd say if you're looking for the lower standards and banality of a trip down I-5 without the hassle of leaving the city, may be your kind of place.", 
    "review_date": "2014-12-12"
  }, 
  "t1UZNFVtkDAYi1YGwzhJKg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "James M.", 
    "review_text": "If my stomach could speak, it would say one word about these burgers...'AWESOME!'  I love this place! I usually check this place out for lunch about 3 times a month if not more.  The burger patties are actually quarter pounders when they are cooked not before they grill them.  The meat is cooked to your liking and is always juicy and tender.  My favorite burger is the bacon cheeseburger. Standard, however you will never be disappointed.  Another bonus, is the steak fries and onion rings are cooked to perfection.  They are never overcooked or soggy like some other places.  This place definitely gets a two thumbs up with a fork and spoon ready to eat rating.  Downside, this place is a pub and rather small so if you are in a big group try to get there early before the lunch rush.", 
    "review_date": "2009-02-11"
  }, 
  "rCABzIrH4JtqqAqBOsMtFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chadwick M.", 
    "review_text": "I work only 3 blocks away, so we end up ordering lunch from \"Ye olde standby\" frequently. There are many options or \"styles\" of burgers, which keeps things interesting if you're eating here every other week. Also, their salads are always fresh and delicious. Although recently, they've been skimping on the dressing, big time. Seriously, less than half a plastic cup of vinaigrette for my whole salad?  \"Who is responsible for this, Jorge?!?\"  The service is efficient and friendly. The pub-like interior is a authentic mix of brick, dollars stuck to the ceiling, and old (and current) ad agency logos and signs, which is appropriate, considering the neighborhood.  Additionally, it's a fun place to hang out with friends after work. If it's nice out, grab a seat at a sidewalk table. Or sit inside and watch some senior citizens play baseball on TV.... Oh! Those ARE the Giants. Just kidding Giants, I love you guys.", 
    "review_date": "2007-09-05"
  }, 
  "oJ6bb4wnKCNT8v4U53FzFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katelin H.", 
    "review_text": "Don't be surprised if a Yardbird or even Paul McCartney himself saddles up next to you at the bar. Not only does Grumpy's serve up what I'm inclined to name the BEST BURGER IN SAN FRANCISCO, but it's also the closest I've come to finding the perfect English Pub. \n  Its brick walls, Brit charm and sweet ass mascot (Grumpy the Bulldog) make this tucked away restaurant feel like your boggy home away from home. Wide selection of beer, wine and spirits - including Jager on tap. And as if the booze alone isn't enticing enough, their menu will find a place in your little limey heart. Burgers prepared a dozen ways (try the Western style veggie burger with bacon!), salads to cure your scurvy, and soups to warm your soul. \n  Parking won't kill you (bring quarters!) and you're bound to see a few interesting characters eating solo at the bar. Don't forget to check out the ceiling... you never know what just might fall into your lap...", 
    "review_date": "2006-01-05"
  }, 
  "RGrlRPQKVMeALP_Pj8MrMA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Andrea G.", 
    "review_text": "i love hole in the walls!  I had a yummy burger and they had great selection of their specialty burgers. i love it.  call me boring but i still just go for mushroom and swiss burgers :DD  next time ill sit out doors... i love outdoor seating!!!", 
    "review_date": "2008-05-24"
  }, 
  "z-hwsFeY66kqMVTMCp9w-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan L.", 
    "review_text": "Ahh Grumpy's...how I enjoy your burger. Why must people always occupy your space when I desire sustenance from your kitchen? I will have to come back another day and taste that savory burger even though I must shed more money that I would like.", 
    "review_date": "2009-07-22"
  }, 
  "RbHAajSUNYKtX3IC6wzFGQ": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Aaron M.", 
    "review_text": "How can you not love a classic Barbary Coast style pub?  Ok, so you're not going to be robbed or get into a fight at lunchtime, but there is still a trap-door in the floor where you can imagine old drunkards being drugged and sent off to sea for an involuntary trip to Shanghai.  Sadly I think they now use the trapdoor for transporting veggie burgers.  If only the Sidney Ducks knew what became of their stomping grounds...  Honestly I have nothing unique to contribute about this place that hasn't already been written: I just wanted my name to appear next to the Grumpy moniker.  That and to profess my love for my Friday lunch haunt, which satisfies a fix for what I think is the best turkey burger in the city.    The burger's come in a multitude of options, but almost always I go with the \"Popeye\" which features spinach and feta - I am'z what I am'z cause I eats my spinach.  The fries are perfect (but they don't travel well so dine-in).  If you don't want fries you can go the side-salad route, knowing that Grumpy's serves up a far better side-salad than you deserve to get in a bar.  Seriously, who goes to a pub for a salad?    Everything I've had at Grumpy's rates well.  Salads too.  I have a friend who is eating his way down the menu and it never ceases to surprise us how each offering is seemingly better than expected.  Grumpy's is just very good.  It is also busy and loud.  There is some outside seating but I'm always cold so that's not the best option if your cold-blooded too.  Go, have a pint, have some fries and try not to end up on a ship out to sea.  Although I hear Shanghai is lovely this time of year.  Check out the menu at: <a href=\"/redir?url=http%3A%2F%2Fgrumpys.citysearch.com%2F&amp;s=a582b22ae7dacee9966b3cfac2590cdc7864084dea17de544ebfed8a0f5a9a0b\" rel=\"nofollow\" target=\"_blank\">grumpys.citysearch.com</a>", 
    "review_date": "2007-04-23"
  }, 
  "DjNb1nsTKIsIf75n994DAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeffrey R.", 
    "review_text": "Really, Truly, Actually, a Very Good Hamburger.  Plain and Simple.  Good Hamburger.", 
    "review_date": "2006-04-05"
  }, 
  "9xyeYXwrhS8OdnvoM0mDjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff S.", 
    "review_text": "Fair to say Grumpy's serves the best burger in the financial district.  No knock on Burger Bistro or Gotts-something - that fancy nancy place at the Ferry Bldg, but they've been trumped.  A burger order comes w/ either fries or potato/mixed salad.  Ordered the Cafe burger, the one w/ avocado.  About a half pound patty cooked just right.  Damn it was delicious.  All the burgers are $10-12...definitely worth it for the pound of food you get.  The location is quite nice since it's kind of segregated from the more densely populated areas, so there's not much of a wait for your food...usually 5-7 minutes.", 
    "review_date": "2011-02-09"
  }, 
  "GXQobSAaAxRap5g1cif6Jg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Z Z.", 
    "review_text": "The perfect after work (or during work) bar.    The bartenders are adorable and there's great beer on tap, stiff drinks, and solid bar snacks.  The clientele, a quirky mix of advertising creatives and other random individuals, make it even better.  Plus, there's nothing like sitting outside on a nice day and soaking in the sunshine, booze and lively conversation.", 
    "review_date": "2010-06-13"
  }, 
  "ng7FuYH6Byo2MfJcymW9oQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beth C.", 
    "review_text": "I went here for lunch today and ordered the salmon. It was raw in the middle and was missing the veggies it was supposed to come with, so I sent it back.  The exact same piece of salmon came back out, charred black. I also got veggies this time but they were mushy. I was starving so I ate them anyway, but I sent the salmon back again. They cooked a fresh piece of salmon for the third attempt, but this too came out raw in the middle. Come on, now. Salmon, like most fish, cooks quickly. I was too tired to try again, and it had been over an hour, so the waitress just took it off my bill. That was nice of her, but I won't be going back.", 
    "review_date": "2008-01-17"
  }, 
  "KgEI0pJ10070F72hmJjZVw": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Jenny R.", 
    "review_text": "Best bar and grill in the Financial District for sure. The tuna melt is delicious. So are the onion rings. If you want a healthier side, the salad is also really good...they use fresh ingredients and spice it up with garbanzo beans. They always give me extra pickles...I don't even have to ask! It's like the waitresses read my mind or something! Anyway, the service is great, too. Even if it's super crowded, you can get in and out within an hour. I still haven't made it over there for happy hour, only because it's a bit of a hike from BART, but look forward to trying it soon!", 
    "review_date": "2011-03-03"
  }, 
  "L-q_mELxM0hwzIZ0ebiX8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney C.", 
    "review_text": "Love Grumpy's. Turkey Pastrami on Rye is awesome.  Whole burger variety menu is nice.  Staff is friendly and has always been accommodating with large groups and/or baby.", 
    "review_date": "2010-01-18"
  }, 
  "ifbxnJKHhXMWxzXAkTxdEQ": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Brandi C.", 
    "review_text": "My fiance and I stumbled on Grumpy's when we were visiting the city last week. We read the yelp reviews and were very excited to try their burgers. Let me tell you, they did not disappoint! The burgers were well cooked and the ingredients were fresh. I got the salad with my burger and this was no iceburg lettuce and ranch. The salad was packed full of yummy things including eggs, kidney beans and cucumbers!  The burgers were good and the beer was cold... Stop in and try it!", 
    "review_date": "2012-06-21"
  }, 
  "CqvkW-20AAtYG1vaklCZhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arvey S.", 
    "review_text": "Well, I'm old school at this place, been going here since 1982, in fact before it was named Grumpy's.  For the old timers, they'll remember it as McGovern's.  This place is a classic and since I've been going there, the place has seen the rise of the TV stations grow around it (KPIX, KGO &amp; KNTV), to the sprouting of numerous radio stations and of course the arrival and demise of various ad agencies around it.  Then it's seen the ol' 480 freeway demolished after the quake of '89 and following that the dot com boom and the ensuing bust and here we go again, another rally with the hi-tech industry, hence Web 2.0.  That's a brief history surrounding Grumpy's, now you're up to speed.  But what's consistent about Grumpy's (I'm not a lunch crowd type there, but a frequent after-work crowd...huge dif), is how their bartenders (several over the years) somehow always attain a true and sincere measure of grumpiness.  After they've been working there awhile, they all turn out like Jack Nicholson in the Shining, \"all work and no play makes Jack a dull boy.\"  In the end, it is a neighborhood bar that happens to be in the Barbary Coast business section at the edge of the stuffy Financial District at the foot of Telegraph Hill.  There aren't too many suits, but they're welcome anyway for a drink or so.  Meanwhile, whole tribes from several neighboring companies come to unwind after work, wax poetic about their day's toils and even mingle with members of the other tribes.  It is a friendly bar, not because of the bartenders, but because of the patrons.  So if you come, brace yourself for an unfriendly service, but be entertained by the shenanigans of the natives...most likely to be seen after 5 pm.  Update as of December 2008.  They have a cool new bartender, Sean.  So, Sean, we're waiting for the day your turn ahem, Grumpy.", 
    "review_date": "2007-11-05"
  }, 
  "tml-uIQirNz6YGwbO71sGA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Adam B.", 
    "review_text": "Oh my God that was a tasty meal. I had  the chicken basil sandwich. Best one I have had in years. The chicken was juicy, not dry like lots of palces I go to. I work over at the Piers,a nd I mentioned it for lunch. SO I got food to go, and everybody is praising this place in my office. I will be going back, next time with friends for drinks and dinner.", 
    "review_date": "2008-06-13"
  }, 
  "H2FahZmg6BKHOFaLnUXgsQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David Z.", 
    "review_text": "DISCLAIMER: I'm rating Grumpy's as a vegetarian. The atmosphere was great and the rest of the my party enjoyed their dishes.  I had the veggie burger. It was one of the worst I've had. Almost definitely frozen, thin patty, disappointing bun. Left me hungry and underwhelmed. Besides the veggie burger, I can't even remember any other non-meat options.   Please add veg dishes!!", 
    "review_date": "2014-11-24"
  }, 
  "bUoYRrYBZWhBsVgkwqQnXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin H.", 
    "review_text": "Ahh The Grumps. This place has become a staple for those of us that work in the area. I have been known to frequent Grumpys as many as 4 times in one day. They have great burgers especially because you can have any version with your choice of turkey, veggie, chicken, or beef. Staff is cool and they great happy hour specials. A very respectful crowd except yo get your occasional ad douche. Some of them even get their pictures on the wall.", 
    "review_date": "2010-04-15"
  }, 
  "cR5ZY_fa3ciB4etcm6IPbA": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Rommel N.", 
    "review_text": "Yet another place I settle for to get lunch. They have pretty good burgers, and the Southern Fried Chicken is not that bad. Obviously I don't expect much from a pub, but a life saver when you don't know what you want for lunch.  This place is definitely popping after work, though.", 
    "review_date": "2008-04-26"
  }, 
  "WmfvEE9bXozI8slUtJkCNA": {
    "user_rating": 5.0, 
    "user_location": "Bloomington, IL", 
    "user_name": "Jessica S.", 
    "review_text": "Yes. You should go. Order the following... don't even look at the rest of the menu. Turkey Burger is the best I have ever had... so much flavor.  And I love cows, I mean I avoid turkey burgers on general principle but wow... order it.  And get it Baja style... and of course for beer... i love a good beer menu too... of course a Hefeweizen for Jessica :-)  It's a small place so you might have to share a table or at the very least sit close enough to make new friends.  There are a few tables outside though.  Love it! Go!", 
    "review_date": "2010-06-27"
  }, 
  "tcqi5sCJdmD-fVVuqUkJtQ": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Melissa C.", 
    "review_text": "Great burgers and good service. This place is a casual place to grab a beer and munch on some good pub food. I had the cafe style angus burger with garlic fries and I wasn't disappointed. The burger was big and juicy and the fries had mounds of garlic on them. I LOVE garlic so this was a big plus in my book. The bar has a good selection of beers on tap too. I recommend this place for a fun, casual get together with friends while in the city.", 
    "review_date": "2010-04-29"
  }, 
  "q6edB0RvhEz5z8bWqNYcyA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle Y.", 
    "review_text": "Grumpy's is my version of Cheers. You won't find a better place to get a drink and pub food at after 10 hours of working in an ad agency where your co-workers back stab you, your clients put your work down, and it's been the day from hell.  The bartenders, Mary and Sean, treat you like family. And the strangers at the bar become fast friends. Come by for a drink sometime!", 
    "review_date": "2009-01-03"
  }, 
  "POxbvBd34HTMO-UZ8jEbbA": {
    "user_rating": 1.0, 
    "user_location": "Kansas City, MO", 
    "user_name": "Adam B.", 
    "review_text": "Let me describe my experience...its long...but its valuable and embelished only where necessary....  Two co-workers and I walked down to Grumpy's over a Friday lunch break to grab a burger and a beer.  We had heard that their burgers were awesome, and wanted to give it a shot since it was in walking distance from our office.  We assumed we could get in &amp; out of there in an hour to an hour and 15 minutes, but man were we wrong!  We were seated and given abundant time to review the menu before our waiter finally came over to take our orders.  I ordered a western burger, while my two buddies ordered the same burger...only one with no mayo and fries....the other as-is with potato salad.  We also got a beer-a-piece.  About 30 minutes and a pint later, it dawns on us that 1) our food has not arrived, and 2) the two tables that were seated 10 minutes after us were at least 8 bites into their lunches.  After one friend mutters the token, \"What...are they killin' the cow back there?\" the bus boy comes by to ask us if we need a refresher on our brewskies.  We collectively agreed, \"We've got no food to cram in our mouths, so bring us another round, bus boy!\"  (side note: our waiter was not seen for these 30 minutes)  Just as the bus boy brings us our 2 beers (side note: we ordered 3!!), we noticed our waiter crawled out of the black hole he fell in and was bringing out our food.  (side note: 40 minutes had passed from the time we ordered)  The orders were screwed up...everything had mayo on it and one guy got the other's potato salad...it was a mess.  Once the mayo mistake was brought to the attention of the our re-established waiter, he opted to go back to the kitchen and bring out a plain bun to my buddy and had him take care of it himself.  Nice work.  After all of this, we were pretty torqued, but were happy with the results of the burgers.  They were tasty.  (side note: 1 hr. and 15 min. had passed from ordering to finishing the food)  Since our waiter was paying no attention to us, we had to flag him down like a airport runway worker just to get our check.  Then...surprise!! ...he brought us the wrong bill.  For 3 guys consuming 3 burgers and 5 beers, he was charging us $115.  Our calm, happy-go-Friday demeanors were slipping to the dark side.  I called to him from two tables away saying, \"This is not our check.\"  He went back, brought us a check for around $50-something and said, \"Thanks for coming in today guys!!\"  Our pleasure.  We promptly paid with cash, and left him a $5 tip.  (side note: we are not cheap restaurant guests, we just tip appropriately)  We begin walking down the sidewalk, back to our office after an hour and  1/2 lunch when we hear, \"Hey guys!! Was something wrong??\"  Our waiter, rigid and red-faced was chasing us down the sidewalk in search of an explanation.  Without missing a beat, we listed off all of the 7 or 8 GLARING errors that were made.  Waiter says, \"Well, OK, I just wanted to know because I've been having problems with the kitchen all day.\"  Other niceties were exchanged and I ended by saying, \"But my burger was good.\"    When I was a waiter, I would blame stuff on the kitchen too in order to save a tip, but this was b.s. because the dude was not even around for 90% of our lunch.  There is no way it was the kitchen's fault.  The bus boy gave us better service than he did, and he even screwed up by bringing two beers for three people.  Horrible, horrible experience.  But the burger was good.  There is no way I, or my two buddies, will be going back.", 
    "review_date": "2009-03-06"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "Fun place to meet up for a few cold ones after work on a weekday.  The food is almost all fried.  This is good, because if I start hitting the sauce at 6pm, I'm going to need something to soak it up. Like fried cheese.  If you have enough to drink here I suggest that you walk up the hill to crowbar for some really cheap drink and then cheap domestics at Showgirls.  When happy hour is 7 hours long... endless possibilities.", 
    "review_date": "2006-03-24"
  }, 
  "pZAktka6VfcXmUf4lWlBJQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn G.", 
    "review_text": "I'm going to miss being less than two blocks away from this place. The burgers and salads are pretty tasty, and the beer is cheap. What else do you need from a lunch and after work happy hour joint? I mean, really?", 
    "review_date": "2007-01-20"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "Stopped in last night with a co-worker to grab a burger on our dinner break...the burgers were really tasty and cooked exactly as ordered.  Fries were hot and crispy (surprisingly a lot of restaurants can't get their fries this way!) and the staff extremely helpful and not grumpy at all. I'll definitely be back, hopefully next time after work so I can sample some of the fine beers that they have on tap.", 
    "review_date": "2006-09-12"
  }, 
  "n4fPKtWk7MQVYL1rC6z9dw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "If Grumpies succeeds in their fight to remove the Off the Grid food trucks from Front and Vallejo I will ensure I never patronize them again. And I will spread the word. Lunch options in the area are scant enough as it is. It makes no sense.", 
    "review_date": "2012-06-04"
  }, 
  "8Ces6YdT6j7BYycnZLrSng": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luis C.", 
    "review_text": "Grumpy's is overrated in terms of the food. But a great place for drinks with friends and to let loose.  A group of 8 from the office went to try this place on recommendation of a very outspoken female co-worker. We sat inside, occupying 2 tables. We ordered 6 different burgers + one chicken, and one sandwich suggested by the waiter (I think it was ham &amp; cheese, but I don't remember) for one of the girls (all ~$8, w/choice of: fries, potato or green salad). It took a while to get our order, after several rounds of beers &amp; sodas.  To make the story short, I'm the only one who finished my burger (I was hoongry!!). Everyone in the group agreed that it wasn't very good. They gave me a weird look because my plate was clean - and I had to keep explaining that I was hungry. The co-worker lost all credibility on choosing our next lunch spot, but her knowledge about places in which to get drunk remains unmatched (she knows the bartenders by name).  Tip for inexperienced office workers (thought it was needed, after reading some reviews): Whenever we go to lunch in a group we pool our cash together to pay the bill and tip, or one person picks up the tab and we divide it later. We don't ask for separate bills in crowded and busy places like this one. Hope this helps!", 
    "review_date": "2008-09-12"
  }, 
  "WQ8XspqfeK9eZ1_sVFojeQ": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Steve L.", 
    "review_text": "A classic western pub of brick and glass. This is a square room smelling of beer - nothing wrong with that. There are beers for every taste, including old-school PBR and Olympia in bottles. I would have been really fired up to see Oly in a can, as it was  the first beer I ever had.   Sadly, I had to settle for iced tea, as I was at lunch with co-workers. The food was pretty good and the portions large. I had a \"Manhattan Melt\" - ham, turkey and Swiss. It was really just a club sandwich, but still tasty. And it was served with a savory, heaping helping of potato salad.", 
    "review_date": "2014-01-19"
  }, 
  "PrYgTaYYCTQoAsWe_TmSDA": {
    "user_rating": 3.0, 
    "user_location": "Englewood, CO", 
    "user_name": "Mark H.", 
    "review_text": "Good food, cheap prices, and beers on tap. Dingy little hole in the wall bar, but a good spot to grab breakfast/lunch/dinner when in the financial district. Friendly service brings me back every time.", 
    "review_date": "2013-03-26"
  }, 
  "nAbwXrHgJx5BshmOcCRCZQ": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Rayna A.", 
    "review_text": "The burger was bang'n and the fries were perfectly greased, salted, and crisped.  I would totally give this place 5 stars if they would just speed it up a bit.    $5 IPA not bad for the neighborhood - I'd go back! When a large group arrives after me and a friend, and then we get served after the group, it bothers me =(.  Other than the long wait (to eat, not sit or have our order taken), I have no complaints.", 
    "review_date": "2010-12-15"
  }, 
  "GFGRHcL4GYe0fRwWx7tazg": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Linda N.", 
    "review_text": "Went here weekly on Wednesdays after work to grab a beer and their $1 garlic fries!!!!!!!!!! I was three months from turning 21 but they never checked my id. Maybe I looked older with the people I was with.  It's a bit small but it sufficed. I noticed the people who came in were like me: just getting off of work and needed to relax with some booze. All the times I've been here, they always had a cute bartender that I stared at. haha. The last day I came in here, I was pretty drunk I wanted to get it off my chest so I told him he was cute. haha he thanked me and walked away.   ANYWAYS, this place has affordable appetizers and beers. It was my first bar too!", 
    "review_date": "2011-11-27"
  }, 
  "JUBRQxn471VP2X_SbxlpGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "Had lunch with a friend here.  Great service, good food (I had a chicken salad), and a decent beer selection.  It's a nice, laid-back place I'll definitely visit again.", 
    "review_date": "2010-07-28"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "Went here to watch the final game between the Heat &amp; Spurs with a co-worker. The crowd seemed pretty chill and liked the atmosphere but it was hard to get around with so many people.   They charge a fair price for their draft beers and their menu offers a good variety of food. I decided to get Lagunitas IPA on draft + a cheeseburger with fries.  The beer was cold and refreshing with the burger. The burger itself was seasoned adequately and hit the spot. While it wasn't anything out of the norm it was done well and I had no complaints.   Overall Thoughts  A good place to grab a bite and drinks with friends", 
    "review_date": "2013-06-21"
  }, 
  "d-RjV9FuCU5nqyji_KTMJQ": {
    "user_rating": 2.0, 
    "user_location": "Cotati, CA", 
    "user_name": "Doug S.", 
    "review_text": "It's a so-so place that is convenient to some of the dot coms in the area.  Food is alright, but service is crazy slow.  Took 45 minutes to get a cheeseburger at 11am.  And the place wasn't very crowded.  Burger was cooked to order, garnish alright, french fries were factory-bagged \"natural cut\" fries that are supposed to taste like potato but don't.    They seem to have a nice beer selection, so I'll try again at happy hour and see how they do.", 
    "review_date": "2008-07-25"
  }, 
  "gXiHgk78lmiAzIfjz1QBRA": {
    "user_rating": 1.0, 
    "user_location": "Alamo, CA", 
    "user_name": "Kiki M.", 
    "review_text": "Went there for the first time today after finding it on yelp, left after ordering and waiting 45 minutes for food which never came. Very disappointed. It is also very, very loud.", 
    "review_date": "2012-09-19"
  }, 
  "NFU-bQYhVh2hHud49BNryQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen T.", 
    "review_text": "good spot for a burger and beer in the financial district.  for a bar, they have a solid variety of foods on the menu and interesting burger specials.  i tried the mushroom brie and it totally filled my burger fix for the week.", 
    "review_date": "2010-12-30"
  }, 
  "tLj-1t4y56oijKrDn-cVOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katy A.", 
    "review_text": "Where is the best place to listen to the bartenders iTunes play list while sippin' on Spatan? Grumpy's! Probably my favorite place just outside of the downtown area because of the no-nonsense bartending. I once tried to order a fancy shot for my friend and was looked at sideways...can't say I minded at all...I was given a whiskey shot instead and was pleasantly surprised by the bartenders choice for me. Prices are on point - perfect for a impromptu happy hour after a long day at work. Plus - for first timers - if you can stick a dollar to the ceiling - you get a free drink on the house.", 
    "review_date": "2008-08-19"
  }, 
  "viUYXvEal7n8HpfDrw0n0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave S.", 
    "review_text": "eh-hem!  can you please put the Frank Black CD on again? then and only then will I buy one of your sweet juicy blue cheese hamburgers for $10.", 
    "review_date": "2007-03-21"
  }, 
  "uw8pPQNYvOp6EjBQFCM5Fw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy D.", 
    "review_text": "Food's OK, but the service blows (at lunch time). Not bad for drinks after work, bartender's a good guy.", 
    "review_date": "2005-10-22"
  }, 
  "TiPH2ZwSX53uK7IvFSHVYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily P.", 
    "review_text": "Fries, burger, onion rings, beer, and nice service. This is a hidden gem in that area if you are meeting friends after work, waiting to meet up to go to the exploratorium, or just are in the area.  They do a good job with the bar food and having reasonable priced drinks. I don't know what expectations people have going to this place, but I assumed it would be a fake dive bar that would be overpriced due to the area and I was pleasantly surprised by how relaxed the atmosphere was.", 
    "review_date": "2014-01-05"
  }, 
  "iJlfcUQx5ik28FltcnMY8Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack B.", 
    "review_text": "Attended a private party with about 50 people. Booze was great. But the food? Hamburgers were OK, but Grumpy's put out about 10 at a time for 50 people? Then nothing. Then some fried chicken. Each platter lasted about 5 minutes or LESS. Then nothing was put out. Steamed vegetables? Some deal. Everything put out separately, then 15 minutes until the next thing. Fried chicken was OK if you don't mind ice cold in the center. This was precooked, then thrown into hot oil. Hot on the outside, but cold on the inside. One poor bartender had to work the whole room of 50 people, including serviing booze, putting out the little food they had, and clean up tables. One guy cooking in back. 2 of staff for the whole party of 50 people That's it. No bus boys, no waiters, no service. I'll bet they save a ton of money on labor and food supplies.", 
    "review_date": "2014-06-03"
  }, 
  "w_PwQkSBruPIOSbkHKRtDw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kan P.", 
    "review_text": "For a hole in the wall the food is quite expensive! The waiters are pretty rude. We were waiting to get served for at least 20 minutes and the manager asked a waitress to serve us and she gave us a dirty look and flat out said, \"no,\"  probably because we were minorities. Overall the food is OK but not worth the price, the place is too loud, and the service sucks. Never will I come here again. I guess I know why it's called Grumpy's!", 
    "review_date": "2008-06-24"
  }
}