{
  "8ymlt8ygqjoV18IXVIcT8A": {
    "user_rating": 2.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Tramy V.", 
    "review_text": "We made reservations on a Saturday night.  I was soo excited to try this place after hearing all the hype! The restaurant was pretty empty when we arrived.  However, I couldn't believe how slow the service was! We got the AYCE shabu with beef and chicken.  The beef was nice and thinly cut, as we saw someone standing there cutting the beef with the nifty machine! However, the quality of the meat was okay.  It was not as marbled as other places.  The chicken just tasted normal, like pieces of boiled chicken.  It was cool that they give you three different sauces to dip everything in.  The vegetables were okay, but lacked some variety.  It is pretty cool how each person gets their own pot, although I feel like I have to yell across to talk to my friends.  Overall, everything was okay until I had to keep on flagging down the waiters.  Service is super bad here.  It's all you can eat, but if you can't find your waiters and get more food, what's the point of that?!?! :P", 
    "review_date": "2010-03-02"
  }, 
  "xIpbYrn8IGcNZz0Tj4XFIg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Chan T.", 
    "review_text": "had my bday party here 2 years in a row.... steve the mgr accomodated me and 35 friends.... yes a party of 36 with less than 5 hours notice... can't get any crazier and rowdier than this.... all my friends had a great time, the food was nice and fresh... and oh how i love the beef, perfectly sliced so thin to cook in 30 seconds or less.... we all did ayce and aycead.... boy was that bill huge... but in the end we all had fun and left full...", 
    "review_date": "2010-04-11"
  }, 
  "TUVaya-VY5WmKHIsv0sx0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha S.", 
    "review_text": "I live around the corner from here and am kicking myself for not coming here sooner. I went with a friend before a movie on a Tuesday around 6pm and it was empty, easy to get a table. Service was super quick and attentive. It was our first time experiencing Shabu and our waitress was happy to explain how everything worked. Each person got their own pot to boil their meat, veggies, etc. I had chicken and my Friend had beef and we shared pot stickers. it was SO much to eat, we could never have done all you can eat!. The meat was fresh and healthy. They even have a freezer with the mean showcased as you walk in so that you know it is of quality. The meal is super healthy and filling. You order a meat dish, or combo of meats, then on the side you get noodles, veggies, cabbage, tofu, etc to add to the stew pot. You will not leave hungry of feeling greasy. Thus having some sake or beer with your meal doesn't make you feel guilty. I would think this would be a great place for groups. they have long banquet tables that can accommodate up to 20 people where each person can still have their own cooking pot.   If you are looking for a good, healthy, filling meal on a cold day, or a place to take a group, I would recommend happy Shabu Shabu. I can't wait to go back. However, next time I'll pass on the chicken, it just tasted like boring boiled chicken even with all the dipping sauces. The beef is definitely the way to go.", 
    "review_date": "2009-05-07"
  }, 
  "r4m3F6H2AFC6f3Vtb1xzLg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie K.", 
    "review_text": "3.5  stars  This place lives up to its name on a Friday night. Reasons to celebrate causes many to drink with friends and even neighboring tables. Price point is similar to other shabu joints and service is good.  I prefer their meat to Kufu-ya on Geary. I like to mix the hot and ponzu sauce together.....would prefer them to have fresher condiments (finer minced garlic, get rid of the ill tasting chilli oil, and put some spicy daikon out).  Great alternative to Mum's or Shabuzen and can accommodate large parties.", 
    "review_date": "2008-10-29"
  }, 
  "ul7BUIe1U7JnrX13C01JWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy Y.", 
    "review_text": "Shabu Shabu AYCE!!   Came here on a Friday night and made reservations. If one person gets AYCE then everyone else has to, but it's not that expensive and in my eyes well worth it. Broth for the soup was good and there's even an option to have the spicy portion on the side.  Meat is fresh and plentiful. They always fill up your plate when they notice it's empty. Service is excellent! The owner comes around and chats and even drinks shots with you. I'd definetly come here again!", 
    "review_date": "2012-04-19"
  }, 
  "3fExHy4rllL9wPFlDxrN4Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Norman N.", 
    "review_text": "I've been here multiple times, and you can always count on Happy Shabu Shabu to be consistent.  Although, I guess that isn't too hard when the restaurant doesn't have to cook any of your food!  I keep coming back to this place for the great all-you-can-eat  (and all-you-can-drink for $12 more) deal.  It's the perfect way to start off a fun, alcohol-fueled night.   I'm taking one star away because of the seating  - the tables are separated by an aisle that the employees use to control your fire and to serve you, which makes it difficult for you to talk to the person/people across from you.", 
    "review_date": "2010-06-28"
  }, 
  "guQk2FYdm_4lU56JPnCIcw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nastia R.", 
    "review_text": "We went there as a party of 11 people. In contradictory to one of the reviewers mentioned, half of our party had \"all you can eat/drink\" and some had just one plater, the place didn't make us all select the same.  Food was great, drinks kept coming, service was five stars! we even got some extra shots :) My only complain can be that I ate waaaaaayyyy too much :) But this one on me ;) So next time I will order 1 plate for me :))   This place made me fell in love with Shabu, and I will definitely  come back!", 
    "review_date": "2010-10-10"
  }, 
  "_KKFgmyaYrW3EdhAjTfQKQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SLO C.", 
    "review_text": "Happy Shabu Shabu cant touch Shabu Shabu House in LA! without a doubt! the rad thing about this joint is that its food is up to par and the atmosphere. the not so rad thing about this joint is that the service sucks. i waited 2 hrs to get seated and served for a party of 6! lame. if you want all you can eat and all you can drink this place is for you.", 
    "review_date": "2009-09-09"
  }, 
  "XnLOt51lFAi24wU8DppuSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dixiee N.", 
    "review_text": "Always good times with here crew that runs place, Ken and Lamb. This shabu place is cheaper than most and just as good. AYCE for $23 and AYCE + all you can drink for $35 when most places charge $35 for JUST AYCE. How can you go wrong?", 
    "review_date": "2013-10-04"
  }, 
  "GyYInrWOVwPEqECKOC9T3g": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Krystal C.", 
    "review_text": "Came here for my bday with a party of 8.  The staff here are really nice but all their super strict rules are pretty annoying.  I understand all AYCE shabu places are like this but it doesn't make it less annoying.  The one nice thing about this compared to competitors is they allow some people in the party to choose all you can drink and some not where as Shabu House foreces you to do all or none.  They are very strict on the 2 hour limit and that starts as soon as you order food or drink- so if your party doesnt come on time and someone wants a drink while they wait- tick tock.... However, being a beast who inhales food, I would say that 2 hours is more than enough time for me as I was stuffed to death by 1 hour and 15 min- granted I didn't really chew but inhaled all I could inhale :)  The food here is very good and they are pretty generous and attentive in refilling our plates as we get low.  What I don't like about the restaurant is the way the tables are set.  For big parties, if you have 8 people, you sit in a table section where you can each have your own pot.  However, the tables are really far away from each other leaving a huge gap in the middle for waiters to walk between to turn on and off the pot.  So you will have to shout far and loud to talk to your friends or limited to only talking to people who are directly next to you.  If you have over 8 ppl in your party, they'll seat you in the same place and some people will have to share pots.  Lastly, they have a spicy sauce you can add to your broth to give it a little kick, but they dont have that out so you'll have to ask for chili pepper sauce.", 
    "review_date": "2012-03-30"
  }, 
  "tfg1Nhwx94Y4GdQHLVawbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed L.", 
    "review_text": "If you're just looking for a rambunctious Shabu Shabu experience full of food and booze, hit up Mum's. if not, this is a good place to do all you can eat hot pot in a civilized manner. Each person has their own pot which is a great benefit especially for those  who don't like to share pots. You get full control over your broth flavors and limit saliva contributions from your party. Food quality is good but limited like the other places, just beef, chicken and veggies. Service is really slow with one person running the place although it is not a large restaurant by any means. If Shabu House is too far of a drive, this location in Pac Heights may be a good alternative.", 
    "review_date": "2011-08-31"
  }, 
  "f81Y2EzuRqefayCrL1Ra3Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Winé C.", 
    "review_text": "I think Happy Shabu Shabu is almost there but not quite it.  Their meat is fresh and marbled really well but I think for the price that you pay for AYCE (~$25/person), their selection is small and their broth is lacking in flavor.  The three sauces that you get definitely make up for its flavor issues but it's not anywhere I dream about going or really think about...  All in all, I wouldn't reject it if my friend wanted to come here for their birthdays but I wouldn't be enthralled either.", 
    "review_date": "2014-01-07"
  }, 
  "kLLXE4ziLtVIyyYfqUL2kw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina D.", 
    "review_text": ":( We used to love this place.  I've eaten at most of the Shabu joints in San Francisco.  Despite the awkward seating arrangements (you can only sit 4 in row all facing the same way, or 2 in a row, separated from the rest of your party), we used to prefer Happy.  They offered minced garlic and green onions to add to your hotpot, as well as a spicy miso paste.  The all-you-can eat is more expensive than Cafe Mum, but the quality of the meat seemed a little higher and the vegetable plate was fresher and more extensive.  I do remember being a bit annoyed last time we went because nobody in your party can have the all-you-can-eat option if anyone is ordering seafood. Tonight's experience means I will never go back.  Upon sitting down, we were told again - no all-you-eat option, as someone is ordering the seafood.  Oh well.   Let's start with a beer and a glass of white wine.  Nope, all out of white wine!  In addition, they were also out of the miso paste - and rice!  I mean really?  You are out of rice?  the staple of EVERY meal on the menu?  The meat quality was still ok, but if you have to buy it by the plate it is EXPENSIVE and the seafood was frozen solid. I guess we will go back to Shabusen (not all you can eat, but good quality).", 
    "review_date": "2012-06-14"
  }, 
  "jNpquKQ-lZNzj2HXd_4PKw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Andy V.", 
    "review_text": "I feel like with shabu shabu places, since you basically cook your own stuff, the food is pretty standard.  It's all about the experience.  I wouldn't say my experience here was horrible, but it was not enjoyable to say the least.  I had a large group, and there was another large group too.  Right when we got in, we saw that one of our large groups had to sit outside.  It was windy and cold that day.  Thankfully, it was the other group that got the 'cold treatment' and we were say inside.  They looked pretty pissed though, can't imagine what their yelp review might look like.  Then came dinner.  Naturally, with big parties, some people come late, but for the most part, a lot of my group was there.  However, that didn't stop the manager from constantly pestering us.  The odd thing though was the he wasn't flat out saying things to us, it was very passive aggressive.  Like if he wanted us to wrap up, he would tell us that there's a group coming in an hour.  So it's like he was implying we should hurry, but not flat out telling us.  He was also kind of rude about it.  Be careful having large parties here too.  It's a pretty small place, so if you have a large group, you'll no doubt have some awkward seating arrangements.  Luckily, by the end of dinner, I was a little buzzed, so I didn't care about any of that.  This place isn't the worst, but it could certainly do better.  I looked at the other yelp reviews, and I'm not the only person complaining about the tacky service that was received.", 
    "review_date": "2010-06-02"
  }, 
  "_focy66G85KXrIHmhfXGMg": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "LeAnne N.", 
    "review_text": "Food: beef quality was terrible. Sauces were basic. Overall, not impressive shabu shabu place, even for the average prices.  Ambience: This place is not good for groups of 4. You have to be seated in 1 row, or if you want to be across from each other, you'll be about 6 feet away from your friends because of a gap between tables. This is terrible for conversation.  Restaurant policy: ridiculous. We had 4 ppl total. 3 of us wanted all you can eat, and 1 person was a vegetarian. They refused to let her order vegetarian only dish and insisted she pay for the all you can eat meat price because all 4 of us had to do it. The restaurant was almost empty, so its not like you couldn't figure out if we were trying to cheat them of $10. So we asked them to split the bill (we were sitting 6 ft away from each other after all)... 2 would do ala carte so the other 2 can do all you can eat. They refused. So we all did ala carte. They lost an automatic $30 in revenue by not letting 3 of us upgrade. And it turns out that no one wanted more than 1 plate of meat anyways, because the quality was so terrible. What we should have done was walked out from the onset.   Will never go here again, and would never recommend this place. For the food, ambience and service, I'd recommend shabu house or anywhere besides here. Btw, most shabu shabu places offer all you can drink/eat options.", 
    "review_date": "2012-07-19"
  }, 
  "P9F8WA_BPbRymwawWwYM-Q": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Noah Z.", 
    "review_text": "It's really $35 for all you can eat AND drink. The food and drink is good. If you need more of a reason to try this place, consider kicking yourself in the shabu shabu", 
    "review_date": "2010-03-17"
  }, 
  "Sz6JeWg0AaiT__VQjwvYEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Y L.", 
    "review_text": "Yummy shabu on a cold New Year's Eve night.", 
    "review_date": "2015-01-06"
  }, 
  "gKQbQckZ8tIHUd4ghza66g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mark f.", 
    "review_text": "Great Food, Great Service, and alot of fun!  I visited last night with 3 friends.  We did have a table for 4, which is actualy two tables facing each other with a gap in between to allow the waitress easy access to control the stoves and to serve.  The distance from table mates did make conversation a little difficut, but not impossible as others have mentioned.  You just have to speak a little louder!  We all had the all-you-can-eat and drink dinner, for $35 each.  Very well worth it!  The waitress (Lynn) could not have been friendlier.  Sensing we were not experienced Shabu Shabu'ers, she explained everything with a very cheerful smile.  The food was great!  Veggies were farm stand fresh, and the chicken and beef both very tasty and fresh!  Very little fat in the beef, and none in the skinless chicken breast pieces/  Others have mentioned that the broth consisted of boiling water.  That was not the case last night, the broth was miso soup, and had a nice flavor.  Our waitress helped us season the broth with chili peppers, some kind of pepper spice, onions and garlic.  I kind of wanted to eat the broth, but didn't.  Our waitress was very attentive, always ready to bring more beer, meat and veggies.  She also brought us both hot and cold sake, but none of us are really sake drinkers.  Towards the end of the evening, when the place was clearing out, our waitress spent some time talking, laughing and sharing drinks with us.  It was a wonderful adventure, and we will certainly return!", 
    "review_date": "2009-01-25"
  }, 
  "3jyJ7VIRuKiZDr6WwAvovg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Courtney Y.", 
    "review_text": "So I've been here twice and both times we opted for the $35 all you can eat all you can drink. TOTALLY WORTH IT!! The first time we went for my friends birthday. By the end of the night he was pretty much chanting ONLY MEAT! ( I guess he didn't want to eat his veggies) and the dude drank so much he lost the birthday present I gave him. I was not happy about that. But was happy with the food. SOO YUMMIE. You can just pick up the beef with your chop sticks and swirl it in the hot water and the meat cooks in like a min. The veggies are good too and of course the fresh noodles. If you want more of whatever: veggies, tofu, noodles, or meal they'll bring it out to you on a small plate. Which is nice and it makes you feel less wasteful. By the end of the night I promise that you'll make friends with whoever else is in the restaurant. It never fails.   The only bad thing is that you have to make reservations. Both times I was there they turned people away.  Even if the place looks empty the tables are probably reserved.", 
    "review_date": "2008-04-15"
  }, 
  "9TU1CISaeQWVZuL2hMQSUg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex M.", 
    "review_text": "Was tempted to eat some meat so i decided to try this place since the All you can eat Shabu was $23 per person. Went with a group of 2 around 5:30pm and it was dead empty. I believe i saw the owner sitting outside before i walked in so i thought to myself... probably no business at this time. As i walked in i saw a television and lots of empty tables! Yeah for empty tables! Only took me 1 minute to figure out where to sit, since there's so much to choose from. Sat down ordered and chilled to the korean background music, while watching the NBA on tv.   As most all you can eat place can't really have a group with all you can eat, and non all you can eat, unless separated. Service was 100% since we were the only ones there. Each person has their own pot to cook their food in and 3 different type of sauce. Along with a dish of veggies and noodles. Only had to type of meat, Chicken and Beef, so i decided to try some chicken.   I was hoping for some rice, since the last shabu i had a few years back served rice, but apparently i didn't get any. The first 2 plates of beef was really good, since it was thinly sliced. After the 3rd plate, i felt that the meat started to taste a bit flavorless or maybe unfresh? All i can say is it didn't have the same feeling as the first 2 dish i ate earlier.   I ate about 4 plates of beef, and was looking at the owner and the waitress. Based on their expression of their face, it almost looked as if their saying....\"How can that little guy eat so much?\" Since i finished the first 2 plates in about 20 mins or so. I believed i was there eating for about almost 1 1/2 hours.  Overall i would say the service for today was 90% good~! since the waitress occasionally kept coming and asking if we needed anything; considering there was no one in there but us. I was sad cause i didn't get any rice! xD  Also my soup changed color after the 3rd plate, probably thats why my beef tasted crappy. Needed new Soup!...  It would be better if they had more variety of meat to choose from, like Sheep! that would make me coming back for more!, but nope. I thought it was funny how a random person came in asking if they can use the bathroom, but was refused since it was \"customers only\" and that guy just took a piss outside the trashcan or something.", 
    "review_date": "2011-03-15"
  }, 
  "F262q88zc7zsdEeNCzcA0A": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Siobhan F.", 
    "review_text": "I was so excited when I stumbled upon this place. My boyfriend and I were in the city to see Yeasayer at the Fillmore and planned on eating dinner in sf. We had no clue where to go, and figured we'd find a place while on our way to the venue. We walked by happy shabu shabu and were excited to find a shabu shabu place when we didn't know what to expect. The quality of the meat is nothing compared to shabuway in mt. view, but thats because they use kobe instead of a regular cut. I was really excited by all their sauces and their miso broth to cook the food in. Also their vegetable plate seemed a lot more complete than what I'm used to (Bok-choy, cabbage, tofu, enoki, shitake, carrot, scallion, udon, yam noodle). So although the meat wasn't the greatest the sauces and veggies were superb! I'd probably eat here again if I was near the Flllmore for the show.", 
    "review_date": "2010-04-18"
  }, 
  "-Hxvjz-t5ttsuH6H1osA4A": {
    "user_rating": 2.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Susanna W.", 
    "review_text": "IH's choice for bday dinner locale.  AMBIANCE: Not the most happenin' spot on a Saturday night during prime dinner time (7:30pm).  The few patrons who were there were quiet pairs of friends who quickly ate and left.  We were the largest and loudest group there (13p).  The seating plan is quite odd-- diners sit facing other groups with a aisle in between (I guess its meant for the staff to walk in between and deliver items/turn on the burners?).  Awkwardddd.  This also meant that our large group was squished into a space meant for two parties of 4, with a huge dividing aisle between us.  SERVICE: The servers (one was the owner?) were nice enough, but practically impossible to flag down.  They also have the strictest rules/ordering policies that I've ever encountered at a shabu shabu/AYCE restaurant.  If you want AYCE, your entire party must order it, no exceptions.  The staff said that if half our party (seated across the aisle) wanted AYCD, that was possible, but if the other half opted out they would not be able to order ANY drinks.  Did they expect us to sneakily chuck drinks across that massive canyon of an aisle!?  FOOD: We sampled AYCE beef/chicken/veggies.  Standard ponzu and sesame dipping sauces, along with a spicy chili sauce.  The meats were quite tough, despite a large amount of fattiness in the beef.  The chicken was horrible-- sooooo dry/tough.  The selection of veggies for the AYCE vegetarian option looked nice, but came with the same price tag as for the meat AYCE, which seemed unfairly hefty.   OVERALL: 2 stars sums it up-- Meh. I've experienced better.  Would much rather dine at Shabu House or even Mum's.  Will not be returning.", 
    "review_date": "2012-10-24"
  }, 
  "bXjywxQEN-TPs99IG2s6EA": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Coco R.", 
    "review_text": "This place is right in my neck of the woods....  too bad it sux.  Overpriced yuckage.  I won't come back unless I'm desperate, since it is right down stairs.    Choriya on Clement is much, much better all around.", 
    "review_date": "2007-05-23"
  }, 
  "jCcJC5v4D88u7F45zdgWdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasmin T.", 
    "review_text": "If you are a germaphobe, this is the perfect place. You get your own pot :)   Sauce was ok though. They do not refill the broth so when you get down to the end, it's super salty. Meat was good. They cut it right when you order.   Either by order or all you can eat.", 
    "review_date": "2014-10-28"
  }, 
  "JITevzyEgskIJc6sgOyEgw": {
    "user_rating": 4.0, 
    "user_location": "Nashville, TN", 
    "user_name": "Kristin Marie S.", 
    "review_text": "I sold back some clothes so I could go eat here.  In terms of shabu shabu I think it's great.  It's pricey but I found most shabu places are.  The interior is immaculate but the place tends to cater towards large groups.  Either way, I was able to go in as a two some and get a corner table that fit us both.  The beef was so yummy I asked for a second half order.  The chef even agreed to charge me half since they don't have half orders on the menu.  I'd say the all you can shabu and sake is probably worth it.  Alone I could drink about $40 worth of sake, the cheap stuff too, so I'm already ahead of the game by $5.  I do recommend not getting just chicken, maybe its because I love beef but it takes longer to cook and isn't as tender.  Oh and I don't think the broth is really broth.  They really need to offer miso, spicy or regular.  That makes the shabu!!", 
    "review_date": "2009-07-29"
  }, 
  "S1W-_Ghqr3eVaytqQSfz5g": {
    "user_rating": 2.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Moses W.", 
    "review_text": "Caution! Although as posted Birthdays are free, don't confuse this for a good meal to eat before a night of heavy drinking and debauchery. After spending $40  here and eating as much glorified soup (because that's all this really is) as capacity allows, You'll be hungry 2 hours later upon the majority of the broth leaving your body. This food also doesn't safeguard your stomach much from alcohol consumption though you think it would since you feel full as we've all experienced  with pizza. Over All service was great, Beer was forthcoming but despite that it is once again really just bowls of soup - meat being boiled in a not exactly flavorful broth. Ok date place but bday parties should seek out a hearty meal.", 
    "review_date": "2009-02-23"
  }, 
  "vRziAXWI72nOFWNml4ldMA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hyung L.", 
    "review_text": "Went here with like 30 people for a 30th birthday. We sat outside in the front that was partitioned off with a gate but it was right along side the sidewalk so it was kinda weird since passerby's would stare while we were eating. But that didn't matter. All you can eat AND ALL YOU CAN DRINK. We drank sake and beer to our hearts content. 30 people and my friend's 30th birthday and about 10 hot pots goin you can imagine it was a good thing we were outside cuz it would been steaming inside.   The food itself was really good. The meat was fresh and the veges were as well. We were loud and rowdy bunch and the owner Steve put up with our antics and was totally cool with our group.  We're already talking about going back but in a smaller group.", 
    "review_date": "2009-08-31"
  }, 
  "nvdmAIrhRCu5n2ro-uEyhg": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Stephfon B.", 
    "review_text": "Last night was the best night of my life. From the moment I walked in I was entranced. Your smell, your taste, the way you filled me up. You came right on time and filled me up just right. You were like a feast for all of my senses...Last night i got drunk on you and I am still hungover. Happy Shabu Shabu. I love you ! I really and truly do ;^)", 
    "review_date": "2009-10-16"
  }, 
  "A0Y4dUb2LOM6n0kewefUXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jens S.", 
    "review_text": "Wow, I bow in reverence to this fine take on the hedonistic ritual of the Shabu-Shabu.  Great little selection on the served platter of meat, veg, and seafood.  The scallops were huuuge!  I liked the Korean twist on the sauces and broth.  BYOB d(-_-)b  I'd recommend friendly groupings of 4 or 8 to allow for facing off in 2 opposing rows (reservation recommended for weekends).  I'll def be back!", 
    "review_date": "2006-11-20"
  }, 
  "KAU0uc4Ff_RNfJ_3_BKgug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan T.", 
    "review_text": "I've been to this shabu shabu establishment countless times, since the opening of the restaurant. The food has consistently stayed fresh and my experience has been consistently pleasant here.   The food:  I normally order either the beef entree shabu shabu or the beef all you can eat shabu shabu. First of all, the ingredients are very fresh (from what my amateur palate can tell) including the vegetables (bok choy, spinach, napa cabbage, shitake mushrooms, carrots, tofu) and angus beef (well-marbled, not too lean (which becomes even leaner if u boil it!), but not too fatty either). I've been to Cafe Mum's before and I felt that happy happy's quality of beef was higher. In terms of the entree portions, I think it may be on the light side, especially for those coming in very hungry. Because of this fact, when i come here hungry, i prefer to opt for the all you can eat. I think the all you can eat option is a good value (~25) especially since the combined price of a beef entree + extra plate of beef comes out to the same price!   The service:  There isn't too much to say under this category since shabu shabu is more of a self-service affair. Sometimes i felt the service was understaffed, though i would wholely understand from their point of view why they wouldn't staff many more waitresses for a self-service cuisine. Despite being understaffed, however, when I did ask for something, the waitress/waiter got it to me promptly. I guess one gripe that i have with the staff is that they come over to your stove often to adjust the heat setting. Sounds great, but there were times where i wanted the water boiling more and would adjust it myself manually and the waitress would then come over and readjust it! Annoying haha.   The setting:  First of all, i greatly appreciate the fact that happy shabu shabu provides every customer with their OWN pot (as opposed to cafe mum's). It makes the dining experience much less stressful when you don't have to fight for the pot. Despite that first positive, however, i really wish this place arranged the counters in a better way. It is designed where every pair of counter space is divided in the center by a walkway so that the waitress can come over and adjust the heat of your pot. The problem is, though, that if you have a companion sitting across from you, they are pretty far from you, making it seem like you have to yell to talk to them. In other words, if you want to be able to feel like you're sitting close or next to your friends, you would have to have them sit adjacent to you on your left or right side. There can be no decent face to face arrangement in this restaurant.   Overall, i always have a satisfying dining experience here. The food is really good and i think the best shabu shabu ive had in the city so far. The service is lacking at times, but it's forgiveable (they are not rude or stuck-up or anything like that). I recommend this restaurant =).", 
    "review_date": "2009-11-05"
  }, 
  "mPOm-t-ugkcjpbZVTw0UGg": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "R M.", 
    "review_text": "Good shabu place, but not fantastic. Ingredients were ok, but I have been to a number of shabu places in japan and this place can't compete.  I did agree with one of the other yelpers about the layout. It would be way better if people could face eachother to talk. I would have rather been looking at my girlfriend than the other party on the other side of the room. Also, the communal pot is a more fun way to go. The one last suggestion is to turn the broth into a soup afterwards. They often do this in japan and Orbison one of the best parts of the meal.   All in all, decent food, and I would go back until I find a better one.", 
    "review_date": "2010-01-03"
  }, 
  "OeWgkeEytk5DSfO0nLB89g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tomomi K.", 
    "review_text": "2 stars unfortunately...  Their Shabu Shabu is not authentic at all. First off, the authentic Shabu Shabu broth should be clear and seaweed based, but theirs is miso based. We never have Miso based broth for Shabu Shabu in Japan. And their sesame sauce is too watery and has no flavor.  If you are not looking for the authentic Shabu Shabu, this place might work to you, but it is not for me.", 
    "review_date": "2013-07-08"
  }, 
  "YokdbgV1rurLp3wG0tUgAg": {
    "user_rating": 3.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Alexis L.", 
    "review_text": "4 stars for prices (get the all you can eat and drink for about $26)  3 stars for service (we wondered several times if the server had forgotten about us)  1 star for ambiance. This place was a frat/douche magnet. The adjacent table was a huge party of 30-something drunky, golf-playing, bro-bro, douches who ruined the ambiance for everyone in the restaurant. Management didn't seem to be bothered by these people's public drunkenness and obnoxiousness. In fact, they took part in the debauchery.   But the shabu was fresh and cheap. Maybe you get what you pay for? Just don't expect a nice date night out of this place.", 
    "review_date": "2012-09-30"
  }, 
  "fXKRTax3LU5mLat_-Z13zQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L C.", 
    "review_text": "i came here for my birthday so we had a large group and sat outside. there are flies there but it was tolerable because they have a bug zapper and heater. the food was good. =]", 
    "review_date": "2009-07-29"
  }, 
  "5fpCfqVq1Nm2YafJ3VHU8g": {
    "user_rating": 5.0, 
    "user_location": "West Palm Beach, FL", 
    "user_name": "Marc L.", 
    "review_text": "Delicious, simple food, good service, so much fun to go w/ friends. The seating arrangements are a bit awkward for parties of three but it's still nice.", 
    "review_date": "2010-11-23"
  }, 
  "Dk5EPbo1T7F6YA-S2_ZOiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jessica b.", 
    "review_text": "If I could bathe in shabu shabu, I would.  I've been here numerous times and had a great time each and every time.  The service is kind of funny, its usually a bunch of teenage girls that try to rush you in and out, but I kind of like them. They just want to go in the back and check their phones.  Its super cheap for what you get, I always leave thinking I ate too much, but in reality I just ate a huge plate of veggies.  They give you a wide array of stuff to choose from and the experience is just fun no matter what you get.  I've had both the veggie platter and the beef.  Both very good.  But the star is the sauces they give you.  I'd like to plan a party here at some point, think it would be a good birthday place or pre-party venue.", 
    "review_date": "2010-12-19"
  }, 
  "muXmjGeUVRphngjtO37IHw": {
    "user_rating": 1.0, 
    "user_location": "Watsonville, CA", 
    "user_name": "Michele K.", 
    "review_text": "(UN) Happy Shabu Shabu.....Since I can't give zero stars it gets a one. So, if making reservations only to have your table given away 30 minutes before your reservation time is your thing then this is the place for you!  We made reservations for a party of 8 at 8:30.  We drove up from Santa Cruz for my birthday dinner.  We got to the restaurant at 8:25 only to be told our table had been given away at 8:00!!  The manager told us that he called us to confirm the reservation and since we didn't get the call he gave our table away!  These reservations were made by my husband weeks in advance.  I also emailed them and my sister called 2 days prior.  The manager even said \"you're the birthday party-right?\" So he knew that we were coming.  Thank you for making my birthday dinner very UNhappy!!", 
    "review_date": "2011-03-17"
  }, 
  "4hkDcOpUbpkvkKOIcMkS1A": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "Julia P.", 
    "review_text": "My boyfriend and I were really excited about eating at a Shabu Shabu restaurant because they have nothing like this in Austin and while the food was good, there are a lot of other areas that need attention.  My boyfriend had ordered the \"all you can eat\" beef shabu shabu and they told him he could only order it if I ordered it too.  I wasn't too hungry, but I knew he wanted it so I was pretty much forced to order this as well.  I thought this move made them look really cheap and I bet this hurts them more than it helps.  Although the miso broth was a tad salty, everything tasted delicious overall.  There is one thing I have to mention that I found really weird though.  Growing up, I'm use to eating my shabu shabu with a raw egg, but when we asked for some, we were told that they didn't have eggs?  I thought that was strange.  Also, they sat us right by the door and they left the door open because a lot of people were in the establishment, so we had cold air blowing on us the entire time.  Not exactly what I would call A+ service.  While the food was good, I would probably try to go somewhere else next time I'm craving Shabu Shabu in San Francisco.", 
    "review_date": "2011-04-17"
  }, 
  "m2h-3Hscogycjf68nbABvg": {
    "user_rating": 1.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Joseph L.", 
    "review_text": "This is the seriously the WORST Shabu Shabu ever!!!  The restaurant caught my attention because of the ad of \"ALL YOU CAN EAT Shabu Shabu.\"  But when we found out if one of our friends wants to get the \"ALL YOU CAN EAT\", the rest of the party members need to get the \"ALL YOU CAN EAT\", we were kind of disappointed. The funny part is the waitress kept telling us that we cannot sit separately! Since only two of our friends wanted to order \"all you can eat\", it made the rest of us (other 6 people) are required to order the \"all you can eat.\" The waitress were kind of annoying, especially the attitude were bad.   Luckily for them, we were all tired and starving; we still decided to \"corporate\" with their rule....   The foods were decent, but the sauces are insanely bad!! Let me address it again!! ALL three sauces for the Shabu Shabu are really bad!! The sesame sauces are extremely water-downed, the chili sauces are very salty, the soy sauces are at least eatable...seriously, these are the sauces for people who don't know/ never had Shabu Shabu!", 
    "review_date": "2011-09-25"
  }, 
  "6XCZoufB_S-sY6vsxMGd8Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jason g.", 
    "review_text": "Came here last night after an event at Yoshi's.  I really appreciate the individual pots.  There are a lot of better Shabu places in the city.  Mums and even this place on 34th and Geary called Ku Fuya.  I personally don't like Shabu house on Geary but there seems to be a great buzz over that place.  I still can't figure out why???  I like their home made hot sauce.  I think they make it fresh here.  You know what the bad thing about Shabu Shabu is?  There are just so many of them to compare them to.  If you have a choice and trust me, in San Francisco, you have a lot of choices, this restaurant is not going to pop out at you.", 
    "review_date": "2008-10-17"
  }, 
  "PtTZf3VF_JwSKf-rkhuvRA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Adrienne C.", 
    "review_text": "This is prob my go-to all-you-can-eat/drink shabu shabu place when I don't feel like driving to Shabu House in the Richmond. It's nice and clean, meat is decent quality, and hey - I get my own bottle of sake! The only dings are that I wish they gave all-you-can-eat noodles with the veggies (bc really, noodles are not that expensive) and the seating is really weird - bc everyone gets their own pot, if you come with a party of 3+ you'll either be yelling at each other across two sets of tables or seated along a long table. Also, they charge you a couple dollars if you don't finish your food.", 
    "review_date": "2009-04-12"
  }, 
  "PFxDw_dWjzhykkFg6nFLlg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J B.", 
    "review_text": "Ughhhh!!! (sigh)  the food is good, the service is great. BUT one night, i took my friend out there to have some good time. it was closing already, but the waitress asked us to take our time. right when she said it, a man came over (who i think was the owner) and rudely said \"we are closing now, i'm giving you 2 minutes to leave\"!!! i felt like i wanna flip the table over! the waitress was soooo embarrassed by what the guy said, she apologized and smiled and looked down the whole time. it was not \"happy\" shabu shabu for me! boo you!", 
    "review_date": "2011-01-22"
  }, 
  "P-CRYltpvp4aABRctIZWtg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Zack W.", 
    "review_text": "For the bay area, I was greatly disappointed by this common culinary practice found commonly in southern California (excluding Asian-culture deprived San Diego) and smaller cities like Portland.  I have attempted to dine here twice with friends unsuccessfully because it closed before 9:30 PM on Sunday and not opened during lunch. Finally I've made it here but with great disappointment.  First of, it's a trap. It's Cantonese people operating an Japanese style restaurant without the grace and substance to back it up. But they did overcharge wholeheartedly.  It's like going to kindergarten here, an entry level service. It offered individual big pot \"in\" the counter top. Nothing communal here. One had to get a portable stove to use on the dining table.  The menu was so limited with chicken and beef as meat choice, some tofu, vegetables, and noodles. It's much cheaper to get the combo for $15, than ordering individual items. The quantity was anemic by $15.  There was a choice for all-you-can-eat: $22 (just beef and chicken) or $30 for meats and seafood. Too much for this simple restaurant.  There was no alternate choice for broth or sauce. The only pluses are clean and fresh foods. Service was so-so.  So diners, it's too simplistic for a hot pot experience. Go a small distance and you may find much better choices, like on Geary, or near SF Airport, or in Richmond.", 
    "review_date": "2011-07-08"
  }, 
  "DRPMOcCHjtEjlfLyulvMNw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valerie N.", 
    "review_text": "As many yelpers have said, it's a 2 Starr overall.   Came here on a Wednesday night with 3 friends. This place was so dead and it was literally the 4 of us.   Yes, it's nice that you get your own pot so you can do whatever you want. However the beef was horrible.. Beef tasted like cardboard.. Bubble gum.. It was really really disappointing!", 
    "review_date": "2013-12-11"
  }, 
  "swjufuHxKjn1tCnZuyxkYQ": {
    "user_rating": 3.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "The interior layout of the restaurant is a bit odd. The tables are long and rectangular with space in-between for the server to adjust heat as needed. (Each setting includes it's own individual cooking station.) If you go with a group of people your options are to either sit side-by-side in a row or sit across from one another and yell back and forth over the ~7 foot space. If you choose the former option (side-by-side) then you may find yourself directly facing another party at the opposite table which is a little awkward.  The food is average. Ingredients seemed relatively fresh, however I found the soup base to be slightly bland. While the food wasn't necessarily offensive, it wasn't exciting nor authentic.", 
    "review_date": "2009-04-27"
  }, 
  "gGi67233NwosdE4J1FNb_A": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "David T.", 
    "review_text": "Was an awesome meal, and the deal can't be beat.  For those complaining about the broth being \"water\" - that's why they give you about 5 different seasonings on the table - to build your own broth.  Start with those, and then add the vegetables to build an even richer broth.  As you cook the meat the broth will become richer and richer.", 
    "review_date": "2008-10-05"
  }, 
  "7banvXk1-gJyrU3nbzJN8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara M.", 
    "review_text": "I love this place!  I bring friends here all the time.  The key is to order the Kobe Beef shabu, which is about $17 for a platter (each platter comes with the meat, veggies, dipping sauces and your own pot).  The difference between the Kobe and the regular meat is HUGE, and I don't know why they don't advertise the kobe!  I stay away on weekends because the all you can drink crowd is obnoxious, but on a regular weekend night, you shouldn't have a problem getting a seat and enjoying a yummy meal.", 
    "review_date": "2010-11-08"
  }, 
  "7S6geHhDFDexPPl611n9jQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian S.", 
    "review_text": "Affordable all you can eat and friendly service. The shabu is not the best quality but if you are in for a quick shabu fix, this place will do it for you.", 
    "review_date": "2013-02-07"
  }, 
  "Xjxrab7B42JhXAq4oiJd4A": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Angie K.", 
    "review_text": "I like this place. I'd rather go elsewhere, but they do have AYCE/drink with decent service.  The people here are friendly and very tolerant of the many drunken people that pass through this establishment. Service is great. I've actually had shots with the manager before!  The food quality is decent. Not melt-in-your-mouth as it is at Shabu Shabu House in Little Tokyo (Los Angeles), but hey, you get what you pay for.  The one thing I really don't like about this place is that everyone gets his/her own pot. Some people love that about this place, but I've usually gone with a party of 6-8, so it can get really awkward when you're shouting across the room just to 'talk' to someone.  Recommended, but there are better places. Also, parking is a pain in that area, which also discourages me from going. Don't park in the Safeway lot because you WILL get towed.", 
    "review_date": "2010-12-23"
  }, 
  "iYXGmvMXSACfcUKtSFR19Q": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Leeann M.", 
    "review_text": "I think the atmosphere was better than the food. Great service, great time. The food wasn't bad, I'm just not a big meat eater and the main courses are mostly meat.   It was an interesting experience to cook our own food.  Glad I went but I'm not sure if I'd go back.", 
    "review_date": "2011-03-14"
  }, 
  "vqZCDJ8RpOU6nPJhUWi2jw": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Derek J.", 
    "review_text": "This was the first Shabu place I've ever eaten at, and the food was excellent. The broth had good flavor and the sauces, though a little thin, were tasty. Had a FULL stomach and a big Tsingtao for about 20 bucks. You can't beat that in San Fran!", 
    "review_date": "2014-07-07"
  }, 
  "aogitBr6Agn05REca5LArA": {
    "user_rating": 5.0, 
    "user_location": "Laguna Beach, CA", 
    "user_name": "Monique W.", 
    "review_text": "This is one of my favorite places to eat in the city.  We're practically there every weekend! As a huge shabu shabu fan, I have to say this place is 5 stars! The beef is very fresh and they give you the perfect amount of veggies.  My favorite part about this place is that they give you an extra dipping sauce that's so yummy.  The service here is beyond excellent.  The waitresses come and scoop out the junk in your hot pot for you, and they sometimes assemble your dipping sauce for you.  And, the price is reasonable.  There's nothing bad I can say about Happy Shabu Shabu.  We absolutely love it!", 
    "review_date": "2006-11-17"
  }, 
  "a3nmcUKCrqYXxwS-XwYCSQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Minnie H.", 
    "review_text": "Shabu? I had no clue what it was till my friend told me I should eat here for dinner and to come with an empty stomach. So basically it's like a personal hot pot in front of me. We ordered all you can eat deal which includes beef and chicken. I only order beef that night. It was thinly sliced, right in front of me. They also give you a dish of noodles and veggies to throw into your miso broth. you also get 3 different types of dipping sauce to choose from. Everything was very tasty and fresh. Service was very good and attentive and made sure I was enjoying my meal and boy I was. I ended up eating 2 plates of veggies/noodles and 3 plates of beef. When you are just starving and want a meal to fill you up this is the place to come to. A little pricey but think about it you're paying for good quality food. I will definitely be coming back.", 
    "review_date": "2010-09-01"
  }, 
  "Z9pfNGaep9G3N8jEKtUrnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian X.", 
    "review_text": "If you've never been to a Shabu Shabu before, you should definitely Google around to find out how exactly you're supposed to eat this stuff.  I introduced my friend Peter to his first Shabu Shabu experience here, and he kept trying all sorts of things.  After throwing all his vegetables in the pot at once, he poured all his dipping sauces in.  Then he concluded that leaving the meat in the water for a long duration would infuse the soup with flavor -- ruining his meat.  Sigh. Why do the pretty ones always have to be so dumb?", 
    "review_date": "2007-03-16"
  }, 
  "cyP2lSmvg992LxoqfO6ZeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Prescott T.", 
    "review_text": "Great place to stuff your mouth and tummy! Unlimited plates of thin slice beef, pork, or chicken. Very good service. Well worth the money!", 
    "review_date": "2009-01-21"
  }, 
  "frGQmQWy2iwGZcOLlfsAVg": {
    "user_rating": 5.0, 
    "user_location": "Encinitas, CA", 
    "user_name": "Annika D.", 
    "review_text": "Please visit Jon to experience a warm welcome and warm broth for an amazing Shabu Shabu experience. This restaurant was great for service and style. The beef is incredible. Highly recommend this restaurant.", 
    "review_date": "2009-06-29"
  }, 
  "jLzs0c0paLBQgIlu6aVUOg": {
    "user_rating": 4.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "April M.", 
    "review_text": "we had the all you-can-eat with drinks for about 35 a person.  between 3 girls we had 6 plates of meat and 4 plates of veggies.   the customer services was awesome, always brought what we need right of way.  everything was very fresh.  def will go back again!!", 
    "review_date": "2010-05-03"
  }, 
  "6ZR7HuUpHk_NQNs0dT0oLg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Beverly T.", 
    "review_text": "I guess they're trying to compete with Shabu House cause now they offer their broth with flavor! And you can get it spicy!  BUUUUT now they don't give you dumplings with your all you can eat! I felt so cheated when my plate came out, dumplingless.", 
    "review_date": "2009-03-09"
  }, 
  "4gn0ouyN9CwzuYoiGLXMPQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Aaron W.", 
    "review_text": "This place is great and is surprisingly big to accommodate larger parties. I'm not a fan of the all you can eat and drink.... why? Well, unlike most people I like to get drunk, esp. since you order all you can drink... right? I mean why else would someone order all you can drink..... to get ripped... anyhoo, I ate to much and as a result, the food outweighed the drinks = \\ This shouldn't take away from the great food and atmosphere you can only get from a Shabu restaurant. The kobe beef is a must, along with the spicy ponzu! Plus you can't help but love the old Japanese man that always smiles and slices your meat for you! The staff is friendly and when coming from out-of-town, they are pretty handy with directions (as I'm not). I would say this is a good place to start if you are new to the Shabu scene.", 
    "review_date": "2010-08-26"
  }, 
  "Edl8CH1HduzkJwEV4rhOPA": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Jamie Lou I.", 
    "review_text": "This would be a five star review if not for the busted burner I got stuck with.  Otherwise, $35 all you can eat and drink WINS.", 
    "review_date": "2010-12-06"
  }, 
  "oKiEiIp4bcfMBOAoGMFJrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ivy P.", 
    "review_text": "Come here to be stuffed with pretty good shabu meat! You get your own pot of miso soup and generous portions of both veggies and meat. I got an order of beef and the meat plate was huge comparatively. And the beef was REALLY nice compared to some places which have really thick meat or meat with a grainy texture. An order of beef also came with good amounts of cabbage, bok choy, mushrooms,tofu, and two types of noodles. There are also three types of dipping sauces but I usually don't use any  sauce.  If you are still hungry, you can easily upgrade to ALL YOU CAN EAT for $22.95, just $6 more, and ask for more of whatever you need. Some all you can eat places get stingy and give small refills but not here! We had to ask for smaller refillls since we were getting stuffed! Great service. The owner was our waiter and super polite and attentive.   I love the shabu shabu in Korea and have been looking for a place in SF that has Korean style shabu shabu. Most places have been more Japanese style which is okay but just not as satisfying. This place has good meat but the soup and sauces were just okay.  This place is still pretty good and we will keep coming back! (Out of the like 6 shabu places we've tried, the only other place we go back to is G Cube.)", 
    "review_date": "2013-01-03"
  }, 
  "kUeMRDlXAnqAugNzGLxV-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cody M.", 
    "review_text": "I discovered this place last week and have already eaten there twice.  Good healthy food at a great price. $5 for a large beer.  What else can you ask for.", 
    "review_date": "2010-09-24"
  }, 
  "dg6ueU_YY07oLog-z0AOUA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven B.", 
    "review_text": "A San Francisco favorite on cold, foggy summer nights.", 
    "review_date": "2013-10-13"
  }, 
  "hvjhcPOG8zuqqLOohDKBmA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becky Q.", 
    "review_text": "My boyfriend and I walked in and the whole place supposedly had reservations, so we ended up sitting at the bar counter where each seat has its own outdated coil electric stove top.    When we came in, we overheard one of the waiters talking to the owner that was sitting nearby rating my looks on how I have a cat face in Cantonese as that is my boyfriend and I's native language. I was more shocked that this establishment came to be the type to talk crap about their customers rather than what they said about my looks alone.     My boyfriend and I did the all you can eat which consist of beef, chicken, and vegetables for roughly 23 dollars a person. The vegetables consist of napa, baby bok-choy, a carrot, a chive, some mein/vermicelli, three small cube tofu, and enoki mushrooms.    The quality of our meat was poor, I was sick of it by the end of the night. The sauce they offered for dipping was delicious. It came in a peanut sauce, beef satay sauce, and vinegar-soy sauce. There is only one soup base which was a basic chicken broth.   An old employee was slicing our beef on the machine in front of us and was very helpful although he did not speak English.Our crap-talking waiter on the other hand offered crappy service and was hanging out in the kitchen most of the time and seemed annoyed whenever we asked him for more tea, more vegetables, or to simply raise or lower our heat.  When we spoke Cantonese to him, he had the huh expression on his face as he realized that he was BUSTED!    OVERALL EXPERIENCE: Super low-quality meat, bad service that talks crap, nice ambiance, soup base might as well have been the original shabu shabu, water.    I have been to a number of shabu shabu's and this would be the worst one of all.", 
    "review_date": "2011-09-08"
  }, 
  "vD65y5E3Az3bFc6UW4G1eA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie G.", 
    "review_text": "I kinda love this place.  As I am new to the whole world of shabu shabu, my SF network is convinced this was the best of the best when it came to all you can drink and eat that was closest to our neck of the woods.  We were here on two separate occasions, so this will be a merging of those reviews.  The large group dinner: We had a huge group of 20 or so.  Most of us did all you can drink and eat.  When its a large group, the table/burners are placed a bit far so it is hard to talk to the people across the way.  If doing the all you can drink, drinks are plentiful.  The owner comes around with this horrible, and possible illegal beverage he pours shots of.  Quite terrible, and definitely don't drink it.  It wasn't crowded for a Friday night, and it runs about $38 per person.  Not bad for a night of good food and drinking.   The small girls dinner:  About 6 of us.  So we were able to just be at two bar areas.  Again.. the gap in the center of the tables does make it a challenge to hear each other, and less intimate but we made it work.  No drinking this time around, but good food and company made it an enjoyable experience  The food:  The broth is a miso based broth, which was tasty.  They have three dipping sauces to suit your palate.  There is a variety of vegetables which is nice with two kinds of mushrooms.  The meat was sliced thin and tasty and the chicken was ok.  I preferred the beef over the chicken, but that is just my own personal choice.  They also offer up two kinda of noodles to throw in the pot, which my girlfriend was all about.    The service:  The owner was entertaining and definitely wanted to make it a rowdy place.  But all in all, the servers were attentive and offering often if we wanted more protein and vegetables.  They also responded well to our specific demands on the type of veggies we wanted instead of bringing the variety plate.  All in all.  This is a good place for a crowd.  You know going into it how much each person will spend, and you can literally simmer here for a couple hours eating slowly since the food is cooking and drinking.  But watch out. Those sake bombs creep up on you :)", 
    "review_date": "2011-09-05"
  }, 
  "edOcRaWzbMvCKztQQJe_4A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen P.", 
    "review_text": "Nice cozy place. Serivce is good. I would recommend beef hotpot, it is better compare to chicken hotpot. However it's not the best in town.", 
    "review_date": "2015-01-11"
  }, 
  "0ajweLSi0Zz8tYQGAVdJiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kitty C.", 
    "review_text": "I'm obliged to follow suit of the Happy Yelping Yelpers below and give my props to STEVE. Go to this place. Eat, drink &amp; be merry with this jovial human being. He will provide you with entertainment &amp; libations up the wazzzz. Talk about Customer Service!", 
    "review_date": "2010-08-17"
  }, 
  "CIyICwrEeEVCuuBUmaSdOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "HY L.", 
    "review_text": "All You Can Eat $22.95 Beef, Chicken and Vegetables(for entire party only)  All You Can Eat &amp; Drink $34.95 Beef, Chicken and Vegetables Beer , House Sake and Soda", 
    "review_date": "2011-09-07"
  }, 
  "IXpspuR_OCbgyYV06lnMqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mollie M.", 
    "review_text": "Happy Shabu Shabu might just be my all time favorite place to eat in my neighborhood (and maybe in San Francisco).  I live right above, and my boyfriend and I have been known to frequent there more than once a week at times.  I've tried other shabu shabu places in the city, but this is by far the best.  Everything (and I mean everything) is incredibly fresh, the staff is attentive and friendly and the place has a fun atmosphere.  Unlike other places I have been, there's no other choice of what to eat besides shabu shabu (beef, chicken, or seafood I think... although I have only tried the beef), which makes ordering easy and quick, especially if you are hungry.  The all you can eat special is also awesome and a great deal, my boyfriend and I ploughed through a pitcher of beer, two sakes, and about 3 plates of meat each... well worth it.  Usually we just go for one order each and some hot sake and it's more than enough food.    The other thing I think is awesome is their three sauces to dip your meat in: ponzu, spicy, and sesame.  So good.  I would go here every day if I could.", 
    "review_date": "2009-05-11"
  }, 
  "tf6qwu65_2byTdSewOFBIg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priscilla L.", 
    "review_text": "So I came here with a friend last week, we got there about 9pm. So we sit down and look at the menu and as we are looking the waitress says \"you know we close at 10, is that gonna be enough time for you?\" Kinda rude to already be telling us 'you have exactly one hour to eat and leave' so we said yeah no problem. Problem here is she proceeded to say this every time she came back to check on us, RUDE. After deciding what we wanted to eat my friend orders the all you can eat and drink and I TRIED to order just the one portioned beef selection....our waitress straight up told me I had to order the all you can eat and drink if my friend ordered it. Obviously this place is worried about you sharing even a bite of there food. Im sorry but that is RIDICULOUS. How are you just gonna tell a CUSTOMER they have to order something. We were just there for a quick bite so understandably I wasn't trying to spend close to $40 on food. Aside from the rude service the food was excellent. Definitely go for the food and do your best to ignore the pushy waitresses.", 
    "review_date": "2011-09-23"
  }, 
  "fU7WxVPi3Or_Y2pkxfttLA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leigh G.", 
    "review_text": "On my way to a flick at the JCL, stopped here on Fillmore across from Yoshi's and 1300, both gourmet boîtes which this is not.  I was looking for something homey. Last time I did shabu-shabu was in New York some 30 years ago. Loved it then, or maybe just delighted by the novelty. The fish and seafood here was freezer-burned and stiff before dipping in bland miso broth. Sauces included a sesame dressing (not bad on the noodles, but nothing to write home about,) plain soy sauce, and a hotter soy heavy on the Tabasco, with sesame seed floaters. There were jars of diced scallion and celery, and minced garlic - which the broth badly needed.  Soba and bean thread noodles, one slice of carrot, one shiitake mushroom, one scallion spear, some bok choy and Chinese cabbage, and several cubes of tofu rounded out the dish. These items were to be placed in a dish smaller than the sauce bowls. Ginger would have lent a bit of flavor. As it was, the best- tasting part of the meal was the rice green tea. The hip-hop music provided the \"homies.\" I give it 3 stars because the waitress was very sweet and attentive.", 
    "review_date": "2013-12-19"
  }, 
  "QsMLT06-s4vltVIz8DgpMw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Andrew E.", 
    "review_text": "Our group of 6 went in on a Saturday night at 7:30. The place wasn't too crowded, so if you wanted to do a walk-in, I'm sure it wouldn't be a huge issue.   We elected to go with the AYCE and AYCD option. The quality of the beef was excellent. It didn't change regardless of how many servings we had. Pork and chicken seemed to be of great quality too; although I'm not really a fan of chicken at shabu in general.   What else can I say? The broth was delicious, and the vegetables were fresh.   FYI, if you get the all you can drink option, there is a 2-hour time limit.   Would definitely go again!", 
    "review_date": "2015-01-10"
  }, 
  "PKPt-PE4BMQ0ZHuGnXulAQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher L.", 
    "review_text": "Came here the other night for a friends birthday. The broth was tasteless. All the sauces were watered down. The owner was pretty annoying.", 
    "review_date": "2011-01-17"
  }, 
  "uTSGqJGFwngSLTSckILesw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kandace K.", 
    "review_text": "Happy Shabu Shabu was my second shabu experience and definitely awesome!! They have a lot of choices on the menu including seafood, so you aren't just stuck with beef, beef and more beef. All you can eat and drink is $35.   All of the chairs have a pot for your shabu, so you aren't sharing one pot for 4 or 5 people which I think is awesome!!   The staff is super friendly and all of the veggies are very fresh. There are a lot of bells and whistles on the table so you can spice up your shabu however you like.   It's a great spot that I'm sure I'll visit many more times.", 
    "review_date": "2010-07-18"
  }, 
  "w77iTT57YxYiadvBXIFe5A": {
    "user_rating": 4.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Janice's A.", 
    "review_text": "My theory:  Whoever doesn't like shabu shabu is clearly someone that does not know how to enjoy food.    the food was awesome!  We had a huuge group but the owners were totally accomodating.  There's an option here where you can have all you can eat food and all you can drink liquor.  hee hee hee...you know the rest.  Well, I didn't pick that option, but with a menu choice like that I bet you can ensure a fun night of food and fun with your gang.", 
    "review_date": "2008-09-17"
  }, 
  "6ukaJ8F5c0hMvEgD8us8Uw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace Y.", 
    "review_text": "Came here last Saturday. This place gets 3.5 stars for the food and 1.5 stars for the owner being freaking awesome and the experience we had. My friends and I did the all you can eat/drink for $35/person. So worth it considering 2 of my friends passed out at the bar we went to after this place aka got our moneys worth!   Food: Okay pretty typical shabu shabu. The meats are thinly cut and seem pretty high quality. The beef and lamb were solid. Chicken is meh. I don't normally do chicken at shabu shabu places but someone in our group decided to get it. They also bring out 3 dipping sauces: ginger, spicy, and mustard. The mustard sauce was a little suspect, because I expected it to taste like the mustard dipping sauce from Benihana's. The broth was delicious after the lamb hit the hot water. The waitresses and owner are super accommodating and you will definitely get full from this place.   Experience: We had a group of 7 and they didn't have suitable seating for us to sit together inside so they set up the benches outside and cranked on the heat lamps. It was perfect for a summer night in SF (hence the heat lamps because it's never THAT NICE in SF). My friends and I were loud and obnoxious and outside seating was perfect. There's not a whole lot around there so we didn't bother anyone and no one bothered us. The owner drank shots with us and even poured us \"special\" drinks - the holy water and the hell? (eh forgot the name of the second shot, hence all you can drink) Holy water was essentially flavored soju and the hell shot was 129 proof (can't really remember...) of nasty rubbing alcohol.   To sum up the night, it was a shit show and we only paid $45 ($35 + generous tip) to be completely filled to the rim with delicious shabu shabu and more sake + beer than we could have ever needed or wanted. Good times, will definitely be back here with friends again.", 
    "review_date": "2010-06-02"
  }, 
  "uetYbt4WiCGrZWvH36zYlQ": {
    "user_rating": 5.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "HK W.", 
    "review_text": "Happy Shabu Shabu is the place to go for shabu-lovers! Don't know what shabu is? It's sort of like Chinese hotpots but instead of sharing a hotpot to cook your food, each diner gets their individual pot.   I was brought in here on a business meeting and it has now turned into a weekly stop for me to fill that shabu craving! You start off with a plate of sliced beef and a plate of veggies, the pot gets heated up once your seated and is filled with ginseng and various little bubs for taste. Rice and extra noodle plates are on the house while beef is an extra charge for your 2nd plate and thereafter.  Definitely a must-go!", 
    "review_date": "2006-05-05"
  }, 
  "T4GxXDhoXVgh5OCoR9Nebg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine C.", 
    "review_text": "Two of my friends and I showed up on Friday night without reservations, and we were able to get seats at the counter. When asked if we could sit at a table in the main dining area, we were told all tables were reserved. However, the main dining room was never full, even when we left at 10pm...  But on to the important part... The FOOD. My friends and I all got beef and chicken plates ($14.99/plate), and I ordered an extra plate of fishballs on the side ($8 for 6 balls). There was a decent amount of meat, although the veggies and noodles that came  as sides were smaller portioned than I expected (i.e. ONE shitake mushroom, two bites of noodles). The broth was ok-- basically diluted miso soup. The three dipping sauces were also lackluster, so I opted to eat everything \"natural\", aka without sauce.   Service was friendly, but not overly aggressive. When I sat down, the waitress immediately brought me a much needed cup of hot tea.   Overall, nothing particularly special about this place. Not terrible, not amazing, and you could do a lot better if you headed a few miles outside Japantown to the Richmond.", 
    "review_date": "2011-05-30"
  }, 
  "ACUVZ4SiN0gni7dzVDm9EQ": {
    "user_rating": 3.0, 
    "user_location": "Denver, CO", 
    "user_name": "Tiffany N.", 
    "review_text": "Happy Shabu Shabu is a pretty basic/traditional shabu place. They've got standard offerings of beef, chicken, veggie, or seafood with no frills. However, they do give everyone your own pot for cooking which is nice. And the broth they use is pretty tasty, too. Considering that, and that it's right around the corner from my house I will likely be back.  The other nice thing is that you can get noodles and vegetable accompaniments or just all of one. And they have an all you can eat special for just over $20. I personally can't eat more than the regular serving size they give you in just one order, but if you having a particularly hungry day this is a nice option.", 
    "review_date": "2010-05-16"
  }, 
  "qR33aCiEU2hbq5fBC-dFOw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan H.", 
    "review_text": "This place was pretty cheap for the all-you-can eat option.  It was also pretty damn tastey.  There were some problems though.  Let me put it in context:  It was a stormy, rainy night, and we had a party of 12.  To suit our size, they put us outside.  This was fine, but the heating units appear to have been on a timer.  They turned themselves off every 20-30 minutes, at which point we'd have to request that they turn it back on.  With that said, the manager seemed to be the biggest penny pincher I have ever seen.  He wouldn't let us have more than 4 grills for 12 ppl, even though one of us was a vegetarian, and one of us was eating seafood.  His reason?  He didn't want to waste the propane.    When it came to the all-you-can-eat AND drink option,  the restaurant has some stupid rule that if any one person is doing all you can drink, everyone has to do all your can drink.  To re-phrase, you can't have some doing all you can drink, and others doing a-la-carte.  He was afraid that we would be sharing drinks, I guess, but come on.  We're adults.  Likewise, the all-you-can-eat people have to have a separate burner from those not doing all-you-can-eat.  Oh, and apparently sodas were not part of the-all-you-can-drink deal.  I suggest that if the manager is reading, he consider investing in a fountain soda machine.  When it came time to leave, we respectfully requested that we be allowed to split the bill several ways.  To answer our request, the manager sent out a calculator, a pen and paper, and told us to divey it up, but only 6 ways max.  If you're already allowing us to split 6 ways, why not 12 ways?  Dumb.  The one bright spot of this night was Serena, our server.  She was awesome, hands down!  Many thanks to her for putting up with us.", 
    "review_date": "2010-01-30"
  }, 
  "kp1SDNjwwBPFmdF1kadRmw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sherry L.", 
    "review_text": "Not bad, but I prefer Nabe in the Inner Sunset. The broth is kind of bland, but you get plenty of veggies and meat, for $15 (if you get the beef shabu). They're pretty prompt with service and come fill up your tea often. They give you 3 sauces to dip your food in. My favorite is the spicy sauce. The ponzu is pretty good too.", 
    "review_date": "2013-07-26"
  }, 
  "ZJcLjHFCfkMbbDwBB2Q70Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David B.", 
    "review_text": "More like 2.5 stars really. I don't have any big complaints about this place. The service, prices, and environment were decent.  The food was just ... eh.  It would have been 3-4 stars if the food had pushed my buttons a bit more.  The broth was very plain and it felt like I was basically cooking in plain boiling water.  Sure there are sauces there but I'm a fan of shabu places that I can get some extra kick or flavor by just cooking in the pot.  I had to dump about half of the garlic and green onion self serve containers PLUS about a half plate of beef  just to get a little flavor in there.  I also ended up dumping some ponzu and hot sauce directly into the soup for the same reason.  The meat was a bit fatty at times ( I had about 4 plates worth ) and the chicken was as bland as can be since they were basically 1/4 inch slices of unmarinated chicken breast.   The veggie, noodle, tofu and mushroom selection was fine. But again, I wish the broth just had more kick to it as eating loads and loads of ponzu sauce flavored food gets old.  And this is from a huge ponzu fan.  It is VERY nice to get your own pot though. And the place itself was very clean and well organized.  So that's a definite plus.  Overall, decent but has plenty of room to improve for sure.  Maybe I'll come back if I hear of some changes later on.", 
    "review_date": "2009-01-04"
  }, 
  "iI5hC_uNUBGkkvtWrBIaZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joey S.", 
    "review_text": "Steve! Thanks for the holy water, fire water, and funky water!  How can you have a better shabu shabu experience than a place with a pot for each person?!?!?", 
    "review_date": "2010-07-24"
  }, 
  "5d-LvAXw5HDA8-eE6MhPRw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erica S.", 
    "review_text": "I went here tonight with a fried thinking it was a sushi place (why? i have no idea)  We walked in, and it became clear that I was mistaken, but how do you leave a place when you are the only ones there? So, we sat down and tried to figure out from the menu what we had gotten ourselves in.  We ordered (vegetarian for me, chicken for her). I was amazed when the big plate of veggies came out! She showed us what to do, and in just a few min we had yummy boiled vegetables with delicious sauces... What more could you ask for?  I can't wait to go back!", 
    "review_date": "2008-09-21"
  }, 
  "_pIG1_s6Bzymn1zeyLjBHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace K.", 
    "review_text": "Have you ever cheated on your lover?  I haven't.  But now I have a good idea of what it might feel like.  Last night, after placing a call to Shabu House at 9:30, the waitress informed me that their kitchen closes at 9:30, it's too late to come.  Alright - but what to do now?  I had a massive craving for Shabu House.  Then the idea occurred to me.  Desperate times call for desperate measures  -- I'd have to try another.  Enter:  Happy Shabu Shabu. Now, I have heard of this place, and I had read some of the reviews some time ago - and while my brain found it impossible to process the possibility that anything on the planet might be better than Shabu House, a closed kitchen doesn't help me at all, so off to Happy Shabu we headed.  Now, there is no doubt that Rob and I can eat.  We were hungry, and ready to battle the beef, so to speak.  I felt guilty, though I really shouldn't - but that wasn't going to stop me from eating.  Here is what we noted:  1.  Seating is really strange.  I read that it was strange, and indeed, it was strange. 2.  Service is very friendly - - young servers, and all helpful, but service, compared to Shabu House, was slower.   It took a significant amount of time to even begin the meal.  That said, each additional plate of meat came at the speed of light. 3.  Soup:  they, like my SH, have a \"miso-soup\" but there was NO comparison.  NONE.  We spent the majority of our time \"fixing\" the soup with what condiments they had - - but never really succeeded. 4.  Sauces:  Ponzu sauce was OK, sesame sauce was lesser, but they served a spicy sauce - which was quite good.  However, they do not have the radishes.... ponzu w/ no radish??? 5.  All-you-can-eat option is FIRST - CHEAPER... by some 7 dollars per person, and second - consists of beef and chicken, instead of beef and lamb.  The chicken was a nice addition but by half a plate, I didn't want anymore - and stuck to beef only. 6.  Speaking of beef - -  it's not American Kobe like Shabu House - and you can tell.  It really wasn't bad, and much better than Shabu-Sen's regular beef, but it wasn't comparable to that of Shabu House.   7.  Veggies:  no spinach, tons of Napa Cabbage, two kinds of noodles (glass and fresh) and mushrooms, etc.  I love spinach, ding.  The noodles were a good addition compared to Shabu House's udon noodles, but I am not there for the noodles. 8.  They are opened later.  This is always a plus!  For $7 less per person, all of the above makes it a reasonable place to go to dinner when craving Shabu. But - and this is a BIG BUT - their atmosphere completely ruined it for me.  Twenty plus year old, rather vulgar and so extremely LOUD people stood around, pushing each other, swearing, and general creating chaos in the middle of the restaurant, in their drunken stupor.  I am all for having fun, but to ruin other diners' experience to this extent was inexcusable.  They seemed to know the staff there, and while I understand some exceptions - - if you want your other patrons to come, you have to get a grip on your customers.  I understand the appeal of this place to the younger crowd.  It's cheaper and you can get just as full.  But due to it being a younger crowd - their selection of higher-end sake was non-existent, and most opted for the all you can drink w/ hot sake or beer pitchers.    If you like beer or hot sake, and you don't mind a ton of havoc around you while eating, then Happy Shabu might be more up your alley compared to Shabu House, for considerably less amount of money.  If having some sense of calmness around you while eating matters at all to you -  you can trust me on this:  you won't like it here.  All in all, I would not be inclined to return to this place except if absolutely necessary.  I would have given this place a 3.5, but am taking it down to a 2.5 (rounded up to 3) due to the atmosphere in this place.  See? Cheating is NEVER worthwhile!", 
    "review_date": "2009-01-30"
  }, 
  "jzODNU5ZSdBf2sil4G5eAw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yue Z.", 
    "review_text": "Not a fan of this place at all. Having eaten at shabuway, mum's etc, I was truly disappointed in the quality of meat at this location. In addition, for some reason their pots, even when turned to the highest, is very slow to cook. They were not very fast with service as well, hesitating and taking their time when we asked for more plates of meat. Their veggie plate was mostly cabbage and really not much of anything else.   The staff also stands around either looking annoyed or chatting with each other loudly in canto.   Will not be back.", 
    "review_date": "2011-08-03"
  }, 
  "bCdZCR3VmGz5fqiQpLiI2g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "erik l.", 
    "review_text": "Note - this review is about the refusal to honor the \"free birthday meal\" and the company's refusal to correct its billing.  This restaurant advertises a \"Birthday Free Beef or Chicken Shabu - Party of 6 and more (Must present ID)\" per the company website. My girlfriend held her birthday party at this establishment last night (2/24/11) with a party of 7 and had mentioned when making the reservation that this was for her birthday. At the end of the night when we received the bill, the restaurant had not honored the free meal as advertised both on the website and menu. When we asked them to honor the free meal, the individual in charge of the restaurant told us that they could not reprint the bill and that we would have to pay for the meal. We argued about this for 5-10 minutes with the restaurant representative raising his voice, being short and holding the restaurant's position that a bill cannot be reprinted and that we would therefore have to pay the inaccurate amount on the bill. I guess as not to make a scene, we relented and paid the inaccurate amount.  The restaurant attempted to offer consolation by saying we could get the free meal the next time around and proceeded to hand us a 10% off coupon valid for the next 30 days. Clearly not the same as the $14.95 value of a meal. Obviously, there is no reason to even believe they'd honor a coupon if they don't honor their menu advertisement.  On a side note, the waitress who works at this establishment is really nice - but she is literally asked to do 99% of the work here. The guy who talked down to us and refused to honor the deal literally watched soap operas on his laptop at the bar the entire duration of our stay, while the other guy who slices the meat does only that (this must occupy 5 minutes every hour on average). Meanwhile, the overall service is strained (it's hard to order drinks, get water/tea, etc.) while 2 of the 3 people in sight are standing around refusing eye contact or assistance.   There are other shabu shabu establishments that are just as good if not better in terms of food. You don't need to waste your time/effort here.", 
    "review_date": "2011-03-01"
  }, 
  "tBj0MAEYrFnl1Lvas-mfrg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin D.", 
    "review_text": "Happy Shabu Shabu didn't make me very happy. I'm going to list everything that made me displeased with this inappropriately named restaurant.  1) Service was awful - we asked for rice and water at least 3 times, while waiting for more than 10 minutes to finally get them. 2) They were unaccommodating - a few of us wanted to get the all you can eat, but if even one person gets all you can eat, everyone in our party has to, also. After finding this out, we tried to split our party up, but they still wouldn't let us. Rude. 3) The food was OK. I've had way better at other Shabu restaurants in the city.   4) They tried kicking us out as we were getting the bill.   Simply put, don't go here. Parking is impossible to find anyway.", 
    "review_date": "2011-07-19"
  }, 
  "BnEjkNIqA1SocRx9AgKbWA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Monique C.", 
    "review_text": "I would definitely come back here.  The service was great and the food was delicious.  I really liked having my own pot.  I ordered the all you can eat menu and had 4 plates of beef!  I also loved the sesame sauce to dip the meats in.", 
    "review_date": "2008-06-17"
  }, 
  "38HgIu6SObZ_q4XyCY5qDQ": {
    "user_rating": 5.0, 
    "user_location": "Orange, CA", 
    "user_name": "J J.", 
    "review_text": "I only come here for the all you can eat/all you can drink special... usually for a birthday or some other random occasion. It is hands down, a fabulous time. All you can eat plates of meat and veggies, and all you can drink sake and beer. What?? There is no way this can ever go wrong. We always get reservations a week or so ahead of time, and have never had a problem getting seated right away. We usually leave really really intoxicated and full and happy.   Secret tip - if you're with a huge group and you're all doing all you can eat, get everyone in your party to bring cash (and include a big tip) and collect it before you start eating. After two hours of all you can drink sake and beer, trying to do that crap sucks. Take it from a Happy Shabu Shabu pro.", 
    "review_date": "2011-01-24"
  }, 
  "HAv257_IVJnQT0ZIL8Nn-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg G.", 
    "review_text": "So i went here the other night with some friends. It is different than the other places I have have been too. We got our own personal pots, but instead of a bar for each of us to sit at, it sort of felt like a desk. We were isolated from each other two. 4 Pots, in 2x2 formation. The place was cool though. They gave you plane miso and let you spice it with whatever you wanted. They have an awesome spicy sauce that is not overpowering and very tangy. The meet selection included beef and chicken. For all you can eat, I recommend going all beef. Chicken just seems too risky for such things. And besides boiled chicken is meh. The place was pretty good with service too. But because of the setup of the place it seemed sort of clunky at times. For instance my friend had to wait about 10 minutes before a plate refill since he was stuck behind a rather large group sort of blocking us in.  Overall not a bad place but since I had just found Shabuhouse it wouldn't be fair to rank this place the same as them. Also btw, don't even think about parking at the Safeway across the street. The sign says 1.5 hours, and it really mean 1 hour. We had to go to the towing yard right after dinner.", 
    "review_date": "2008-12-16"
  }, 
  "7GYVakMOomhL7C9l5XaUtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J Z.", 
    "review_text": "This place is great! Excellent service (loved our waitress Serena was so attentive and sweet), delicious food. I always get the all you and eat and drink, its so worth it! I mean come on a shot at the club is the same price as their all you can drink sake which comes hot OR cold. The meat is super fresh and I love geting seafood because the fishballs they serve are sooo good. I also like the seating set up, especially outside because not only do they have heat lamps, it'll keep you from smelling like food the rest of the night.  Also, all the celebrities come here for some reason, you get to see them if you come here often enough.", 
    "review_date": "2009-10-29"
  }, 
  "zPVd90RyrqI4Oew3673amw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin D.", 
    "review_text": "Don't go here for the food, but if you want to get your drink on then give it a try.", 
    "review_date": "2009-11-21"
  }, 
  "m6MQjiC2b7vaQkwCxpAKYg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vishal P.", 
    "review_text": "All you can eat and drink is a good deal, but they should offer more of a selection of meats.", 
    "review_date": "2011-02-26"
  }, 
  "EQ-fPVMNGhwZOdB8PJ25ug": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bobby B.", 
    "review_text": "returned to this place a few weeks later with friends.   the staff (there weren't many) couldn't be RUDER and less accommodating to customers. never experienced anything like that and will NEVER go back. ... terrible", 
    "review_date": "2011-11-09"
  }, 
  "S34qI4Jvdn-Nn5rfuKzgYw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jiajia C.", 
    "review_text": "Continuing on with the theme of over consumption, we arrived at Happy Shabu Shabu for the ALL YOU CAN EAT AND DRINK fiesta.   The place is clean, the food is fresh, and really, all you can eat and drink for 2 hours (meaning that you must finish ordering in 2 hours but can sit and eat for as long as you like). Our waitress was as cheerful and feisty as anyone would like to see at an ALL YOU CAN EAT/DRINK restaurant--- she'll call you a wuss for not finishing your pitcher of beer (some people need that kind of encouragement, you know).   The scary truth: I was able to finish 2 and 2/3 plates of beef, 1 plate of veggies and tofu, 2 small bottles of cold sake, and 1 glass of beer.   The scarier truth: I thought about going back the next night.", 
    "review_date": "2009-10-06"
  }, 
  "XDQCUG6dB_NntrZNsn5Frw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Su K.", 
    "review_text": "\"Meh\" just about sums this place up for me.  Pros: Fresh ingredients, good quality meat, prompt service (this could be bad, a bit overbearing . . . I felt like I was being watched all the time), kind staff who warned us that our car would get towed away if we parked in the Safeway parking lot. We were very grateful for this. We moved our car to avoid having it towed.  Cons:  1) Table set-up: This place is not good for a group. Everyone has to be seated on a row as if you're sitting at a bar and you can't really face each other. Four of us were facing the same wall, talking loudly in a desperate attempt to have a conversation.   2) Individual Shabu Shabu pot: This defeats the purpose of Shabu Shabu. It's supposed to be communal meal, shared with friends and family. The sharing aspect is totally ignored.  3) Miso broth: I expect Shabu Shabu to be prepared with dashi (usually seaweed based) broth. That's the traditional way. Miso broth is a little strange . This was a dead giveaway that the owner of this place is most likely not Japanese. It tasted fine, and actually some of my dining companions thought it was very flavorful. I didn't care for it.  This place was disappointing. I will not be back!", 
    "review_date": "2009-10-15"
  }, 
  "ibvH1Y7Rh_tstiWgH0OFTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica S.", 
    "review_text": "Their sauces are good, and their broth base is really good, too! I just wish they gave more mushrooms in the veggie dish but all in all, this place is clean, nice layout, and delicious!  Can't wait to come back...", 
    "review_date": "2009-08-10"
  }, 
  "TmfYoFVydVLLtGeY7yHMig": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "Ken C.", 
    "review_text": "I like this place.  The price is decent. The food is good. And the service is great. We had Serena as our server. I heard she is not working there anymore. =( She was very attentive, fun and easy going.   I will come back to this place.   PS. If they can add like ramen noodles and eggs into the menu, that would be awesome.", 
    "review_date": "2010-03-07"
  }, 
  "Rm53TvM9sAHrsHVP3d5TtA": {
    "user_rating": 1.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "An J.", 
    "review_text": "If I could give this place negative stars, I would.  The Shabu is ok, and conveniently located so I have been going frequently over the last 3 years with a good friend of mine that also lives in the neighborhood.  HOWEVER I will not be giving them a penny of my money ever again.  The owner of this restaurant is one of the rudest men I have ever met in my entire life.  I am a vegetarian so I always get just the veggie platter while she (a meat LOVER of epic proportions) always gets the AYCE [all you can eat] of meat.  They have never given us any problems, never said a word to us, until we went in the the day before yesterday and the incredibly rude owner talked to us like we were some lowly asians not worthy of eating at his \"fine\" establishment.  He told us if one person got ACYE, everyone in the party has to get AYCE with no exceptions and that it has been his policy for the last at least 2 years.  When we told him how frequently we come and how we were never made aware of that rule before, he wouldn't believe us and aggressively asked for names of his staff who had done it so he could deal with them (we obv. didn't say anything, so, no worries!).  He was incredibly condescending when he told us that both of us had to get AYCE and that he couldn't care less that I was vegetarian or that fact I could barely finish the vegetarian platter let alone do justice to an AYCE because he is there for the money period and forcing AYCE is the way he does it.  Honestly, if he had been nice, hell if he had just been NOT an a-hole, I would have gotten the AYCE.  If you are vegetarian and don't want to pay ridiculous amounts of money for your dinner when you eat with your meat loving friends, there are plenty of other GREAT shabu places in the city with management who are kind and good hearted that I can recommend to you.  Just send me a message! :)", 
    "review_date": "2012-05-06"
  }, 
  "ee7CYx19I9JaluVgkGAGGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serene L.", 
    "review_text": "This is the kind of thing my dad hates -- \"What? I have to make my own stew? I could do this better at home!\"  What makes this place great is the excellent kobe beef , wonderfully fresh and tasty vegetables, and how goddam fantastically clean it is. SO CLEAN! The staff are great, all very friendly japanese girls who are quick to fill up your tea, and clean out your beef sludge.  We consider this place for \"special occasions\" because of how pricey it is, but damn it's worth it every time. (Delicious ice cream/watermelon tapioca dessert, TASTY!)", 
    "review_date": "2007-07-14"
  }, 
  "5pBi1CSpm9467jh7PSBDkA": {
    "user_rating": 4.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Mary R.", 
    "review_text": "This was my first experience with the Korean style shabu-shabu.  However I've done the Japanese (traditional style) several times before.  I do enjoy the nice changes they've made.  The different sauces are awesome and the one she'll mix for you (with lots of garlic!) is amazing.  It's a nice change to the subtle tastes of the oldschool way.  Yes having your own pot is nice and I did like it because when you do tranditional shabu-shabu someone eventually becomes the cook for everyone else.    HOWEVER!!  I do like the closeness you get from sharing pots.  I missed it a little at this location.  Everything is so segregated, it was my friends birthday and there was about 10 of us and we were all so separated.  Had to yell to talk to some of the girls across the tables from us.  I like the group pot in old shabu-shabu because it creates a familyish mealtime vibe which this experience lacks.  The food was awesome, the waitresses very helpful and fast, everything was fresh and clean.  Great experience overall.  Note: It's BYOB.", 
    "review_date": "2007-01-21"
  }, 
  "Rhwi_JFSjwek9zJMsXq86Q": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Martin L.", 
    "review_text": "The only two things you ask for from a restaurant like this are the fresh beef and good dipping sauce. They got both. With a selection of 3 dipping sauces, they really can't go wrong.   One star was for the friendly service. Nice.", 
    "review_date": "2006-12-17"
  }, 
  "RmxvvwZpjTwO0fvDj9ak3Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle B.", 
    "review_text": "I have been here a few times and have had different experiences each time.  This last time compelled me to write a review.   SERVICE: We showed up at 6:30 and the restaurant was pretty empty.  We asked for a table for two (no reservations) and she said we can sit at the counter.  I asked if we could sit a table and she said, \"No, they are taken.\"  However, when another couple came in not too long after us with no reservations, they were seated AT A TABLE!  Hmmm.  When I looked at who the waitress was choosing to sit at a table vs. the counter, I felt she was deciding based on race.    Service was also based on race as the guys next to us were getting waited on hand and foot and we had to keep asking for more of this and that.  I have never experienced this before and was quite disappointed this time.  Service is a hit or miss depending on the day and the waitress.    The best part was when three people came in and stated, \"We have reservations for three at 7:00.\"  The waitress had the nerve to look at me and my boyfriend who were sitting at the counter to see if we were almost done and she did it rudely too.  The things you notice while sitting at the bar.   FOOD: I always order the all you can eat.  This time I ordered all you can eat with just chicken and my boyfriend ordered chicken and beef.  However, she made us share a chicken plate and kept bringing us more.  I think there should be a price difference if you are only eating one kind of protein vs. two.  But that silly rule of \"if one person is getting all you an eat, everyone has to.\"  They have this fear of food sharing! Oh my!  I like the three different sauces they give you and the vegetable platter is plentiful but they over do it on the cabbage.  TV:  I never really paid attention but they had the TV on a gruesome, bloody zombie movie.  Not good for those who have a weak stomach.", 
    "review_date": "2011-08-07"
  }, 
  "Mh3nZA2Rpn8TfFyoVxn9Vg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "AXEL A.", 
    "review_text": "The all you can eat is so so nice! Only problem was they had to roll me out. Great meat and service. loved the spicy dipping sauce. I did not like that tables are separated if you are more than 2 people.", 
    "review_date": "2011-09-12"
  }, 
  "2TN-jjYg98_cPNft8OJHCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine P.", 
    "review_text": "I give them 4 stars alone for the All you can eat and drink choice for $35. Not bad - however, I'm not a big fan of shabu shabu.  We were invited here for my cousin-in-law's birthday so I didn't do the choosing but thought it was a fun place to celebrate an event.  There was about 20 of us and we had tons of fun.   By the end of the night, the birthday girl was feeling the after effects of the sake and beer she enjoyed from the \"all you can drink choice.    I may have to take my brother's here next time we're celebrating or just for fun!", 
    "review_date": "2009-08-16"
  }, 
  "ZGT9H35Edi4y8rHYSqSKfg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimmy N.", 
    "review_text": "Affordable Shabu spot in the Jtown. Definitely good for big parties and if you're looking to get you drink on.  Entertaining owner, as well. Always getting in the middle of the parties like he was part of the group. Love it. Bring on the rubbing alcohol! Ha, if you're here often, you'll know what I'm talking about.  Broth and meat quality is not up to par with some of the others but it is less crowded, more roomy, and the freedom to get rowdier than the other spots.  Party Shabu.", 
    "review_date": "2011-09-04"
  }, 
  "KI7gPbRvdngGcgq3-RD7Gw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kendra W.", 
    "review_text": "Happy fooding, unhappy service!!  We were meeting my friend's new beau so hoping to get to know him over a few (or many) sake bombs -- but the seating arrangement made it impossible.  Not sure why anyone would consider building it that way, but our table of six basically had 3 of us facing the other 3 -- but about 10 feet apart!  The silver lining is that we had 4 pots between the 6 of us so non-spicy eaters had no problem.  Food was decent -- the AYCE ($23, with AYCD $35) provided ample quality beef, mushrooms, cabbage, tofu, and two types of noodles.  Happy Shabu is a few bucks cheaper than Mum's, which is great -- and the quality of food does not suffer as a result...but it's really the only reason it still has 3 stars...  The service is DEPLORABLE.  Our server was not mean -- but he was one of the slowest and dullest people I've met to date.  I pitied the guy. He carried plates ONE at at time, and obviously had no sense of adaptation/flexibility.  Since 6 of us ordered AYCE, he went ahead and brought out 6 plates of beef, 6 plates of veggies, 18 sauces (even though there was no space on the table) but somehow gave us zero napkins.  We spent half the dinner trying to get more beer, sake, and food.  Not sure if his dragonball hair cut cut off his vision, but he always seemed to forget us.  After 2 hours -- they actually cut off our alcohol.  It make sense and is pretty fair, BUT I'd clearly state it on the menu if such was the policy.   Sadly, I'll probably come back again as shabu is one of our favorite night out activities and options are limited here in SF --- but happy shabu, you got some work to do...", 
    "review_date": "2012-02-13"
  }, 
  "OJ8vx4pJFSZ34orEOo-txA": {
    "user_rating": 4.0, 
    "user_location": "Lincoln, NE", 
    "user_name": "Jerad D.", 
    "review_text": "I have to say I am a fan of hot pot restaurants. Some people think it is lame that you cook your own food, but if you don't suck, you think it is fun.  I got the beef (there are not really very many options on the menu) and was very happy.  The meat was excellent, the veggies were so-so, and the sake was plentiful.  When we got there, there was like 1 person in the entire place, and the host asked if we had reservations (we didn't) and we thought he was joking, but by the time we were finished, the entire place was full!  I would recommended making a reservation if you go late, or like us, show up early if you want to guarantee a seat.", 
    "review_date": "2009-06-20"
  }, 
  "M3F4a8F-FYmwZbHPUSvt4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yolanda L.", 
    "review_text": "This place ain't bad...the meat was fresh, good assortment of veggies, &amp; attentive service. only con: the weird setup of tables. We had a group of 6 ppl and we all sat in one table side by side sorta thing (like a picnic table) so it was really hard to talk amongst each other. I think the next time we go, we gotta bring like 12 ppl ..that way, we take up the entire 2 tables of 6 &amp; we can all chat w/each other.  loved the all u can eat &amp; drink but be aware...it's something like if 2 ppl at ur table decide on all u can eat &amp; DRINK--then EVERYONE at the table must order that. given that some ppl at my table dont drink...i was the only one to order the all u can eat &amp; drink (everyone else just did the regular all u can eat) &amp; i shared my sake &amp; beer pitcher w/the other folks at table (just do it w/o waitresses seeing--duh!)", 
    "review_date": "2008-12-26"
  }, 
  "NUKJzFCVulazp4YuGoqBOw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "The Black Cat C.", 
    "review_text": "I love hot pot, but this isn't what I expected to be. I didn't like the food (meat) just got out of the freezer. I think I rather eat at a regular chinese hot pot. I gave it 3 stars for the atmosphere and most of all, my kids loved it! They enjoy to have their own cooking space. As long as they are happy, I'm happy!... but I will not return. :)", 
    "review_date": "2008-05-26"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "Funny, I'm not a huge Shabu Shabu fan but I managed ending up eating at 2 in 1 month. This place was ok, my only complaint they need a bell to get the waitress over faster so I can eat more. Food seemed fresh, and I dind't get sick from eating with the raw chicken chopsticks by accident, bonus points ha! gross!", 
    "review_date": "2011-09-18"
  }, 
  "YXRbcWEAULrYPTkJBOhbVw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Nilo P.", 
    "review_text": "Went her last night for the first time with a couple of friends. It's a bit hidden, so you have to know to look for it. We actually made reservations, but there was no need to. Place was kind of empty. The staff was really friendly and the decor was nice, clean, &amp; modern. Different from past experiences I've had at other shabu shabu spots. We had the beef &amp; seafood dishes between 3 people and that was plenty. Everything was tasty and easy to cook. There weren't a lot of options as for sides, like the other spots I've been too. It felt a bit Americanized, so perhaps they figure keep it simple for us dumb white Americans, lol. I'd definitely go back with a small group. It could be lots of fun. Unfortunately no desserts here, so either fill up, or plan on going somewhere else after if you have a sweet tooth.", 
    "review_date": "2010-03-04"
  }, 
  "32Y8ZSJ11chiJJuraiVB_Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Gina L.", 
    "review_text": "I'm not sure how reliable my review is, since I was pretty shmammered through my entire meal.  I didn't pay the bill, but apparently it's like $35/person for all you can eat AND all you can drink sake?  Came with a group of five... sat at a long table.  Wish we were sat at an actual table so that conversation would've been easier, but oh well.  The meat was good quality (it wasn't any premium kobe beef, but hey, it's all you can eat!), from what I remember, and they weren't stingy with the side dishes of noodles, veggies, etc.  Loved the spicy dipping sauce.  Sake kept flowing... meat kept coming as long as we asked...  Someone came out near the end of our meal with some kind of 130-proof Japanese or Korean whiskey.  I passed.  It smelled like pure gasoline, but that was very nice of him to offer that for free to our group.  Anyways, fun place for a group, and there's karaoke right across the street if you wish to continue your drinking shenanigans afterwards!", 
    "review_date": "2012-03-26"
  }, 
  "PJGD7zKksRjePnAIppFoiQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Le T.", 
    "review_text": "Bland Bland Bland Bland broth. Everytime I've come here, I dump half of my ponzu and sesame sauce into the broth to get any kind of flavor. The meat is standard quality, nothing spectacular. Sometimes the owner is around, and he gives us free shots (yay!) , but sometimes he hangs around too long making dinner kind of awkward (boo).", 
    "review_date": "2012-04-06"
  }, 
  "9Axumg_V_EGsoVv369kvRQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Thomas B.", 
    "review_text": "Um, did shots of fire water with the owner.  Don't remember much except I sang Heal the World at a karaoke bar afterwards.  So obviously I got rewarded by the All You Can Eat All You Can Drink arrangement.  Oh, and the beef (that you cook yourself) was delectable.", 
    "review_date": "2011-02-21"
  }, 
  "KmqivnDXe3mVjBtp9ZxkOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley H.", 
    "review_text": "we went on friday night and there were only two people in there. we had gone on a different Friday and they were completely full. so we tried to make reservations but they said they only make reservations for groups of 3 or more.   was very impressed with this place. i liked that i got my own pot as my bf hates onions and i was able to have as many as my heart  desired. we got the all you can eat and drink. i liked that they gave us a pitcher of beer so we did not have to worry about asking for refills. they were also very timely with the sake too. i wasn't very impressed with the selection of veggies and noodles. i barely ate it. i think it would have been easier to eat if the bowls were a little larger to accommodate both meat and noodles/ veggies. the sauces that they had were pretty good. i even enjoyed the spicy sauce because it was not as spicey as i thought it was.", 
    "review_date": "2011-09-26"
  }, 
  "OCcHlcwqFtHcKFo5t4UBYA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "Are people really complaining about this place having bland sauce, broth, and not liking the idea of having their own pot? Who cares. I am so glad this place is cheap where I can have unlimited meat and beer for the all low price of 22.95 (a little more if you do the sake and beer unlimited deal). The broth was hot, the waitress knew when to come over to refill my meat (I had three plates all to myself!). I tell you, it's better than any other shabu place I've been to. I'm also not picky. As long as someone just replenishes my all you can eat food, I'm fine. This place is amazing!", 
    "review_date": "2011-05-28"
  }, 
  "__05rytNjsye9MBhqB0DMA": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Marck N.", 
    "review_text": "In all fairness to the reviews, the place is really worth it, if you get the all you can eat and drink.  I went with a large group, 18 people, and the wait staff was very attentive to us. They kept on asking if we wanted a refill on the meats, veggies, and liquor.  I don't know if there is a time limit on the all you can eat, but they kept on refilling our plates, bottles, and pitchers.  We must have worked them overtime because the girls were all over the place.  And after awhile, so were we.   Taste wise the food was good, but after several plates and drinks of liquor everything tasted good. I can see why they call this place Happy Shabu Shabu, because everyone in my group left all Happy.  Full, Drunk and Happy.", 
    "review_date": "2008-09-09"
  }, 
  "3ureXPBb2cVbkNgM9oW5xA": {
    "user_rating": 1.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Jennifer T.", 
    "review_text": "Eh...   Happy Shabu Shabu did not make me happy.  Service wasn't bad, but definitely not great. Beef was alright.. veggies alright....  but......  they didn't have the grated daikon for dipping sauce!  Um... Grated daikon is a must with shabu sauce. Meh.   Also.....  rice was super hard.  Undercooked or they did not add enough water.  I mentioned it to the waitress and she did not do anything nor did any management come out to resolve the issue. Gross.  Come on, people... don't mess up the rice and SERVE it.  Making people pay for crappy rice does not make them happy.   Definitely somewhere I would never go back to next time I have a Shabu craving..", 
    "review_date": "2011-03-20"
  }, 
  "0qYv333UH9rEQmvEBlZiVg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "MIchael H.", 
    "review_text": "The meat was delicious. However, the layout is hard for a party of four to have a conversation. The two people on the end basically just ate dinner. We had no problem with the all-you-can-eat being replenished often. The noodles were excellent, as well as the vegetables. The Napa cabbage was fresh and tasty. The meat ranged from very lean to moderately fatty.", 
    "review_date": "2013-05-27"
  }, 
  "L-U6TOUaLfrrhUHM2hGdDg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Devin B.", 
    "review_text": "If you want good hot pot there are so many better places with much better service.   They just aren't very nice. The food was okay, if you want to eat here the best way to do it is the all you can eat and drink, just make sure everyone you're going with gets it or they'll be weird about it.   Otherwise I wouldn't recommend it.", 
    "review_date": "2012-04-06"
  }, 
  "GCRQ4ZfoDsBSmlJ8q85pCg": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Peter W.", 
    "review_text": "It's been awhile since I've been to Happy Shabu Shabu, well I went there tonight with some friends after work for their All You Can Eat Goodness.  It's pretty hard to mess up Shabu Shabu, it really depends on the service.  The service was great! We met Steve the Manager and it was a really cool guy.  He let us try his special spice mix the \"Steve 22\" and it really gave a good kick to the broth.  Also the waitress was very attentive and very nice.    It was the perfect end to a long day at work... The food and service alone get 4 stars, but the extra star goes to Steve and his staff.  Thanks!", 
    "review_date": "2010-03-15"
  }, 
  "qQa9J0fXA6E-3JSFNsF7TA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "O'Shea J.", 
    "review_text": "They are ok, I live closeby so it makes a good, closer alternative to my favorite spot in San Mateo.  IIRC, they don't use Kobe like the San Mateo spot but some other high grade beef.  I like Kobe just a little better.  Their portions are little smaller and cost more.  I'm a beef guy and they need to add an all beef plate to their menu.  The place is usually dead when I go there, and they're shady with the AC so it's always frigid.  Bring a jacket.  Also, last time I went they didn't have an alcohol license yet but you are welcome to hit up the Safeway across the street and bring your own Schlitz malt liquor.", 
    "review_date": "2007-07-02"
  }, 
  "08jfo0j-qbcs5yKefByVKQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "Although my Han-centric views have deemed shabu shabu as an off-putting translation of the Mongolian/Chinese hot pot, on a cold San Francisco evening even I will cave to the whims of boiled water and a single piece of kombu, awaiting plates of meat plus veggies.  Happy Shabu Shabu pretty much met my expectations of reasonable shabu shabu. It didn't convert me but it didn't disappoint, and was overall a nice experience. Quality of ingredients was pretty decent, everything looked pretty and of the appropriate shade of color. Not marbled meat, but good enough for a $15 one-person shabu shabu pot and plenty. Not enough? There's an abundance of mi-fun noodles and what I guess is supposed to be be udon. That would be my major complaint--the udon. Next to the large stick of carrot (really? bleh), my two least favorite ingredients on the list. Tofu and meat would be the top, but be warned--only two cubes of 1in. x 1in. tofu. Sad. I do want to come back to take advantage of their all-you-can-eat offering, including the all-you-can-drink sake and beer (uh, sake bombs plus pounds of beef? You're on!), about $40 I would guess with tax and tip. That sounds like quite the deal, and is cheaper than another shabu shabu place bookmarked on my list (Cafe Mum's), although Mum's is rated higher (have faith in your fellow Yelpers!)... Definitely time for a comparison. What made the experience memorable despite average food, average sauces and average service, was the combination of steam, two large bottles of Sapporo, cheering with friends who were just getting to know you and were afraid to know any more after realizing hot sake is your equivalent of Dr Hyde's little experiment, and knowing everyone passing by was freezing their tail off. Overall: not experienced enough in shabu shabu to deem this great, but would be back when considering shabu shabu as a destination.", 
    "review_date": "2008-08-01"
  }, 
  "0_1ZgnJJ2Vdwu0PPX3kH7Q": {
    "user_rating": 4.0, 
    "user_location": "Bay Area", 
    "user_name": "Clem D.", 
    "review_text": "I have been having cravings since I went here two weekends ago; now I know why people go for the buffet option.  Good service, yummy and generous!", 
    "review_date": "2009-09-29"
  }, 
  "gm0V0GmBBlUlTqoZHsjWqw": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Jessica C.", 
    "review_text": "I was craving shabu shabu (again) and my friend insisted that we come here because he claimed it was the best of the best.  We arrived really late on a Friday night, around 9:30pm and we were seated within five minutes.  My friend and I got a pot to ourselves, which was a first.  I'm accustomed to sharing pots.  The broth is flavored but with chicken stock, I think.  We opted for all-you-can-eat shabu, which included: -Beef -Chicken -Napa cabbage -Baby bok choy -Enoki Musroom -Two types of noodles: clear and a thin udon-like one  The beef came out nicely - it was lean and fresh.  All of the veggies were fresh and tasty.  They also customized your veggie platter upon request as well (ie. if you only want mushrooms, you can order it that way). Sadly, I was only able to polish off three plates of beef and two plates of veggies.  Quite impressively my friend hit an astounding 11 plates of beef but I think he was suffering after.  The service is quick and attentive.  The servers come around frequently to refill your plates and check on everything.  Cost per person is only $22.95 without the alcohol.  I don't know if I would say this is THE shabu place to go to but definitely good and worth checking out.", 
    "review_date": "2009-04-05"
  }, 
  "cGGjN-s3JSA-TOhQiFOEyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cin T.", 
    "review_text": "After a 6 month hiatus, I finally came back to Happy Shabu Shabu on my Bday. It was everything I expected!!!  Food - Very comparable to Shabu House on Geary but less expensive.  Beef was thinly slice and fresh.  Broth was miso based.  3 different types of dipping sauce to choose from.  The noodles and veggie dish were also very good.  Noodles were nice and chewy.    $22.95 for all you can eat (chicken and beef) compared to $27.05 at Shabu House on Geary.   Will be back on a cold hungry day...", 
    "review_date": "2010-08-22"
  }, 
  "uvQCNhVsmgt1xU6HVKx9cA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rouz E.", 
    "review_text": "Wow, there is nothing happy about this place. Food was ok, but oh my god the service/staff was T.E.R.R.I.B.L.E. It was no wonder there was only 2 other people in the entire restaurant on a Friday night!  There were 4 of us going to eat/drink here on a Fri night. Two of us ordered the all you can eat and drink special. Then one of my friends said I will order my own bottle of sake because I already ate. The waiter literally looked at me like I had just landed into his restaurant with a U.F.O. He said, he must sit by himself at the bar across to the restaurant if he wanted to do that. Hew would not even allow my friend to sit at the table across from us saying that he could not seat at a 4-top table. EVEN THOUGH THE RESTAURANT WAS EMPTY. He basically told my friend he must go sit at the bar if he wants to order anything unless he orders the \"all you can eat/drink special\". So my friend declined and was forced to watch us all eat and drink for an hour.  Now I must mention that during the entire course of our meal, the 2 straight-faced Japanese punk-rocker waiters were standing 10 feet from our table staring at our every move. Ensuring there is no sharing going on. They would literally stare at me ever time I would touch my cup or plate. We were trying to make the best of the situation and just laugh about it, but these guys literally persisted to watch over our shoulders the entire time. By this point there was no one else in the restaurant (approximately 10pm). So you can imagine how uncomfortable this can make you feel.  If there is a \"happy\" shabu shabu out there, this is not the one. This place should be called \"Retarded Shabu Shabu\", for how stupid these idiots were. They actually told us during our meal that people have been complaining on Yelp about them. HAHA that should've been a red flag right when we ordered.  Anyways, like I said. The food was O.K. But I'm sure there are a million other shabu's to go to that will not require getting the stink-eye during your entire meal.  **NOTE TO OWNER, get some new staff to actually smile at you and make you feel at home when patrons come to your restaurant. This city has way too many options for people to deal with that. Just some advice on p[possibly turning your restaurant around from crickets chirping in there on a Friday night.", 
    "review_date": "2012-04-09"
  }, 
  "Hqj0I26GCqGS42f5WjrJIA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carmen L.", 
    "review_text": "Food quality: Have not tried yet.  Food portion: Have not tried yet.  Cleanliness: Average I guess. A lot of the tables were dirty because they were too lazy to clean them. &amp; When they cleaned our table for us to be seated, they just collected the dishware &amp; did a quick wipe, leaving the table wet with a mixture of water &amp; what seemed to be soy sauce.  Atmosphere: Loud (people drunk from sake) &amp; dim.  Service: Extremely poor; no greetings, no smiles. Waited about 5 minutes to be seated when the place was almost empty. Went in as a party of 6, 3 of us wanted the Beef Shabu only &amp; the other 3 wanted the AYCE. They told us we can't do that because they don't want us to share so we asked if the other 3 can sit somewhere else so that we don't have contact with each other &amp; they still say no even though there were a whole bunch of empty tables. Ridiculous.", 
    "review_date": "2012-08-07"
  }, 
  "xGDcXcscWQl_X0R3f1LIzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken C.", 
    "review_text": "Great experience at Happy Shabu Shabu. The service is not the most professional but very casual and friendly. We walked in on a Monday and were seated immediately. I was told by the waiter that weekdays are slow enough to walk in for a table but you should definitely get a reservation if you're coming in on the weekend.   I was a little intrigued by the individual hot pots because I'm used to sharing a single pot, but it's definitely handy to have your own pot. We did the \"all you can eat\" meal and was very satisified with the quality and quantity of food. Our waiter was very quick to bring out more veggies/meat when we were running low. They also have a vegetarian option for the vegetarians out there.   Overall it was a fun experience and we were extremely satisified (aka stuffed). I recommend Happy Shabu Shabu if you're in the area and craving Shabu Shabu. I will definitely be back here soon!", 
    "review_date": "2014-08-13"
  }, 
  "_YaBpCHDCx3vNjluUViHMQ": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Marina C.", 
    "review_text": "The experience and being able to cook what you want when you want is so much fun!!   I went on a date here and we did the unlimited eat and drink special. The steak is by far the best part of this place, and steer clear of the chicken, idk what the rules on cook time are for that.    The sauces are delicious,  especially the clear broth looking one..yummyyyyy.  Saki was hot and beers were cold.   Downside is the wait time (40 mins), because it's a small space :/", 
    "review_date": "2014-01-22"
  }, 
  "dTdltcr2EC5oMZ1rs795PA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason J.", 
    "review_text": "all you can eat, all you can drink for $35?  it's pretty much a steal if you're with a group of guys who are prepared to feast and drink to your hearts content.  for groups of people, it's a little awkward b/c the seating is fairly spread apart.  but if you're loud, you wouldnt have a problem of talking over the spread out seating.  the pluses are that the ventilation is fairly adequate, and the service is very friendly and quick.  the meat is decent, and the sake is pretty low quality, but it will definitely get you drunk.  overall, it's a good place to come with a group of buddies and have loads of meat and drinks.", 
    "review_date": "2008-10-05"
  }, 
  "VXr8WfkHKUmNblmO5FNUxg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana C.", 
    "review_text": "This place is FANTASTIC!  The ingredients are fresh and delicious, and they even let me and my friends in after hours for a nice private late-night dinner.  It was so awesome.  Kevin is the best!!!  Thank you Kevin!!  The beef is by far what you should get.  And the watermelon dessert was  SO GOOD!", 
    "review_date": "2007-10-26"
  }, 
  "ccvyDF_778McUn4h02A9cg": {
    "user_rating": 4.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Arial C.", 
    "review_text": "It's not authentic Japanese shabu shabu, but it's even better than that, the beef and vegetable here are fresh! I come here with my friend every week~", 
    "review_date": "2013-10-09"
  }, 
  "lUy6Lr9DoG_aHiicElbz9w": {
    "user_rating": 1.0, 
    "user_location": "Union City, CA", 
    "user_name": "Karissa B.", 
    "review_text": "I came here for my birthday dinner and they charged me for my bday..after their promotional on their website said birthday free..also they messed up my reservation...I asked for ten seats they only had 7..My friends had to stand..also horrible customer service they only served us twice for all you can eat.not worth coming here..the older man that was supposedly the manager said he had to charge me no questions asked...bad promotions and fooled me and my friends", 
    "review_date": "2011-11-05"
  }, 
  "S95OlabrAu7ZM3RcmvVIoQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jorn O.", 
    "review_text": "It is a good place to eat shabu shabu. The place is nice and clean. Servers are nice. However, i am just giving them 4 stars because the quality of the vegetables are not as fresh as it used to be.  It was sad when the first owner sold the place. however, the new owner seems to try to do their best to maintain the quality.  I'll still keep coming back here.  This is my daughter's favorite shabu2 place. She loves to cook. I've been eating here almost once a month for 1.5 years.  It sooooooooooo goooooooooooooodddddddddd", 
    "review_date": "2009-03-04"
  }, 
  "-DmpYICjBii640Zny46cLQ": {
    "user_rating": 1.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Kimba V.", 
    "review_text": "My friend told me beforehand that she was going to celebrate her bday here.  I told her that I was just gonna meet her towards the end of the dinner cause I read from other yelp reviews that all people of the party are required to buy the all you can eat special. I wasn't about to spend that much money, so I just met my friends at the restaurant towards the end of dinner to prevent the hassle.  We were gonna go out afterwards anyway.  So I get there, grab a chair, and sit with the group.  The bday girl gives me a sip of her beer..no big deal.  10 minutes later, the owner comes up to me and asks me if I'm eating or drinking.  I said, \"no I'm not, but I might order a drink later.\"  He has the nerve to tell me that he saw me take a sip from my friends cup and that I had to pay $35 like everyone else.  I pretty much tell him, \"no I'm not paying.  I'm not drinking with them.  I will buy my own drink at regular price if thats the case.\"  He gives up and says, \"I'll pretend I didn't see you drink anything.\"  Later, my friends are offering me shots of sake and the owner looks at me and then over to them and shakes his head \"no\". 30 minutes later, the owner leaves our area and I'm just walking around our table, sitting, standing, talking to different people.  They were continuing to take shots while I just sat around and mingled.  As they are taking shots, my friend points to the owner standing at a distance from behind me.  I turn around and he was giving me the stink eye, shaking his head, and motioning his hand to the door to let me know that he wanted me to get out.  I turn around to him and I tell him firmly, \"I AM NOT DRINKING. CALM DOWN!\"    I don't understand the purpose as to why he felt the need to hassle me.  I know I didn't order any food or drink, which may have annoyed him.  BUT COME ON!!!  We had a party of over 10 people who all paid $35 each.  He was making his money for the night.  RIDICULOUS.  And what was even more frustrating was that they didn't even give the bday girl her \"free meal\".  According to the website, the bday person gets a free dinner if they bring a party of 6 people or more.  The bday girl's bday was at midnight and it was already 10pm.  2 freaking hours away and they weren't even the least bit flexible.    Based on service and hospitality alone, I will NEVER step foot inside this establishment again nor will I recommend any of my friends to come here.  You will get better service and better shabu at Shabu House in the Richmond.  I've never had anything like that happen to me at any restaurant.  I can't believe that they are even still in business with bullshit policy like that.  I can understand getting shitty service from a server, but if the owner is a dick, then what does that tell you on what kind of business he is running?  THIS PLACE SUCKS and it doesn't deserve any business with service like that.  RUDE. RUDE. RUDE.", 
    "review_date": "2011-10-23"
  }, 
  "3uJootQ876cXOb4Q2H39IQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Dee C.", 
    "review_text": "As a lover of shabu shabu, my relationship with Happy Shabu Shabu began with built-in biases.  This is a great place for shabu shabu with a slightly Korean twist.  For one thing, they offer kimchi (although they might have ended this tradition) as a banchan.  In addition to ponzu (soy sauce offset by tart citrus, often yuzu) and goma (sesame seed), they provide a fiery third dipping sauce.  The latter is made from spicy red chili paste and is a building block for many Korean dishes.  The beef is not Kobe, so let us get that out of the way.  It is cut ever so slightly thicker and most importantly, lacks the marbling.  On the positive side, it is less fatty.  I feel healthy when I eat it.  (Incidentally, that is why I love shabu shabu in general.)  The vegetarian platter that accompanies the meat comprises of the usual suspects:  napa cabbage, a few shiitake mushrooms, some enoki, cubes of tofu, and udon noodles.  In the broth floats ginseng root, which is another Korean variation.  The service is delightful.  Once upon a time, there was a Korean waitress who was simply the most adorable lady, but on my last visit, I was sad to hear that she was going to return to Korea.  Finally, the arrangement of the tables and chairs will take some getting used to.  It is unquestionably one of the most unique and awkward (especially for large parties) set-ups I have ever seen and taken part in.  I will try to describe it, but this is a case when a picture is optimal.  All of the tables and chairs are in rows, so that you cannot converse at a normal voice level with anyone other than the person sitting next to you.  To anyone else in your party, you will have to holler across the rows.  It gets weird.", 
    "review_date": "2008-12-16"
  }, 
  "hBKIfDc6WfgT2Chh8QqUaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G G.", 
    "review_text": "Pretty good, bring your own booze, do your own cooking", 
    "review_date": "2007-04-14"
  }, 
  "Vk_HNTRnjXQCvgykBVxeyQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ngoc N.", 
    "review_text": "ayce and drink sake and beer, sounds like a good time right?  It sure is, but just be warned, all you can drink is dangerous. Steven, the manager there is a real cool guy, jokes around with you, remembers certain customers and their drinking habits. But when he unleashes the secret mind eraser fire water, be forewarned, you will lose all recollection of anything that transpired over the course of this meal.  All that aside, food is pretty average, dipping sauces just ok. This place is perfect just to get hammered on the cheap and have a filling/decently satisfying meal. 3.5 stars, but I'll round up just from all the memories (or lack of) and stories that come out of this place.", 
    "review_date": "2011-03-24"
  }, 
  "qACeo5PPVyPJHWUf5L2Ewg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "King L.", 
    "review_text": "For the record I ate here maybe a year ago and it was OK.  I tried to go there last night with a friend a 2 small children about 6 and 7 years old.  I ordered 2 All you can eat adults and 2 kids meals.  The terrible waiter said if 1 person eats all you can eat then everyone has to eat all you can eat.  I said these are 2 kids are you serious?  He said yup that is the rule.  WOW the concept of customer first has gone out the window with this place.  Looking at a few other reviews by my friends I am not alone with the TERRIBLE service in the place.  I'm glad I didn't eat there.  You would think that at 7:30pm on a Sunday with 3 customers they would have wanted some business.....", 
    "review_date": "2012-07-19"
  }, 
  "lzKkZs1pJUpY8_7IU13_Ig": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacey F.", 
    "review_text": "The staff was friendly and pretty hands-off, the price (~$13 for a regular pot more than enough for one person) is reasonable, never too crowded thus this place is perfect if you want a relaxed and laid back atmosphere.  The ingredients are fresh and of good variety.", 
    "review_date": "2014-10-31"
  }, 
  "Ce9PlB0lqKri4diijzc7WA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kaitlyn C.", 
    "review_text": "Rated no.1 for their sanitation guidelines Rated no.1 for making sure your beef plate is always filled. Quality of food is above average shabu places I've dined at. My hunnie ate so much- he looked like a preggo- and that makes me a happy camper- for that- you get all 5 stars :)", 
    "review_date": "2008-07-22"
  }, 
  "jR2mMjKjwroZkPA70btlYw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin S.", 
    "review_text": "I went here for my b-day dinner and I really enjoyed myself.  The food was fresh and simple and I really enjoyed the hot pot cooking experience.  The way some of the dining stations are set up actually accommodate slightly large groups nicely, there were 13 of us and it worked out well.  Half of us sat on one side and half on the other side, so it wasn't easy to chat with the people on the opposite side of the station, but it works out anyway!  I feel bad because I don't remember the name of the girl who served us but she was extremely friendly and attentive!  Oh and they took $14 or $15 dollars off my meal because it was my birthday and we were in a group of 6+.", 
    "review_date": "2009-07-05"
  }, 
  "817ErNQeMjw-jfgVLZH6MQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel C.", 
    "review_text": "Hangover buster? Sickness remedy? So I'm no Shabu aficionado but this place isn't half bad. My girlfriend has been talking up Shabu Shabu for months. So I gave in and I kind of think its a sort of super Pho. Regardless, the quantity and quality of the beef and veggies were sufficient. The sauces were lacking. The two of us each got the all you can eat (which there was no need for). The service was a bit laggy, and there weren't many folk in the place. At the end of the meal I had a full belly and a vat of hot tasty broth in front of me. Long story short, we were feeling shitty and this was some feeling good food. I'll be back, order less exccesively, and the world will be at peace.", 
    "review_date": "2011-10-31"
  }, 
  "c8NiksyAjCWqI3EzjU-2uw": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Peter C.", 
    "review_text": "The beef was great. For sure I will go there again but there are two thing I don't like there. They need a bigger place cuz is kinda small and the is too cold in there. Even with these two reason I will still go back to eat here. Cuz there beef is really good.", 
    "review_date": "2008-07-19"
  }, 
  "y27w9lGFEQEMrOeLZ5bB_Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "carmen n.", 
    "review_text": "happy shabu shabu....  left my tummy UNHAPPY... that is all.  PS- try not to shaBU BU in your pants after eating. hotel miyako has nice clean bathroom at jtown.", 
    "review_date": "2008-01-18"
  }, 
  "HdaLqZjroe6IMPci055BDA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Helen V.", 
    "review_text": "I came here for a friend's birthday which was a nice treat.  A nicer treat was us not having to pay for her dinner because it was free!  =]] Yay to the birthday promotion!  We all got different sorts of meat and from what I heard the beef plate was the best.  The chicken was too dry and the seafood platter was bland.  I loved that our meal came with a HUGE plate of veggies!  Honestly, that's my favorite part...shabu-ing the veggies!  So good.  I almost ordered extra veggies but the waiter told me to hold off on it until my plate came.  Thanks!  The service was really good.  The waiter was very helpful when I called to make reservations, promising to \"take care of us\".  And he did!  We arrived and our table was ready for us.  After dinner, they even served us the cake we brought without a cake cutting fee.  Will definitely be back!", 
    "review_date": "2009-08-22"
  }, 
  "auud1coxLGOIlPQ2PTZItg": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Trisha C.", 
    "review_text": "Fresh food, great service. Beef + beef + beef, a little bit of veggies.. LOL sounds like my kinda meal. Tired and sleepy the SO and I manage to still polish off 4 + plates each. you would think the food looks really light and not so filling, but think again..... you will feel lazy as a rock once you are done.   Not anything out of the ordinary,  but still good and not as expensive as I expected it to be.", 
    "review_date": "2009-05-15"
  }, 
  "EKdyI4jpUF29YtPkKiCtcg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jennifer S.", 
    "review_text": "my next 2 reviews: a NEW FROYO PLACE IN THE MARINA &amp; a japanese izakaya, again, IN THE MARINA...  ***  i usually don't like the whole \"all you can eat\" deals. sure, its well worth every penny but most of the time the food quality just sucks... ever since i was a kid, i don't really remember going to a whole lot of buffets ...  it's all about the quality people!!! i think i started going to buffets more often during college ... but happy shabu shabu? i'm FOR IT.  manna (a all you can eat poor quality korean restaurant in LA which everyone seems to love...http://www.yelp.com/user_details_review_­search?userid=EKdyI4jpUF29YtPkKiCtcg&amp;q=manna&amp;fsid=­ikrOOMmXSR0OEMhoDE-bRg) &amp; todai .. YUCK!  you won't believe in what i ate prior to happy shabu shabu ... for breakfast, i had a bowl of unagi don (yes, i prepared it myself!) with spam &amp; eggs, bowl of cereal, mango smoothie (yes, i made it myself!) then went to the giants game (box seats baby! woohoo! BUT IT WAS SUCHA LAME ASS GAME.. 9-1? wth?) and ate endless nachos, 10 chicken wings, cheese and crackers, fries and fishchips (shoot, you're in the suite, of course you'll end up stuffin yourself!) for lunch, and 2 hours after the game, i came here and lo and behold stuffed my fat face with 7 1/2 plates worth of shabu shabu meat...)  $23.95 for all you can eat shabu shabu (veggies, chicken &amp; beef) ... we all know the works ... all includes carrot, mushroom, lettuce, etc etc) but this place also gives you 3 lil potstickers.. MMM. it was GOOD...   OR  you can pay $35 for all you can eat shabu shabu and drinks (alcohol) silly... i came here with over 20 people, almost 1/2 of the people from LA ... it's always times like this when i often wonder why i left LA ... hanging out with my LA guy friends, the memories are priceless .. good times, good times!  you won't believe! i ate 7 1/2 plates worth of shabu shabu plates worth of beef ... and here i am writing still stuffed and am craving it every second !!! (take a peek of my foto!)  the quality of the meat was actually really good, no cheapies, but their chicken was so-so... overall, the food was great, delicious and fresh...  i really like the fact how you get your own lil seating with 3 different types of sauces...  opened for dinner only!", 
    "review_date": "2008-04-27"
  }, 
  "dviPtjXu-AzbefzWExaxGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan L.", 
    "review_text": "Happy Shabu Shabu is my first choice for shabu shabu in SF and happens to have the lowest all-you-can-eat/drink prices that I've seen in the city.  I've been here with friends from Japan, so it's been Shabu-Expert Approved (level of expertise determined by yours truly).  The seating is arranged in rows facing each other across an aisle that servers can walk through easily without having to reach over your head to put down a plate of food.  This makes for an awkward layout, but after experiencing the cramped all-you-can-eat madness at other places, it's a welcome change.  There are long picnic tables out front to accommodate larger groups.  In addition to unlimited plates of meat, they provide large platters of veggies and noodles (my favorite are the white noodles... I think they're yam noodles?).  Each person gets their own pot and 3 different dipping sauces. The spicy sauce is the crowd favorite but I prefer the sesame. Service tends to be pretty good, and the owner comes out and interacts a lot with the customers.  There's a giant Safeway lot across the street but you do run the risk of getting towed.  One con is that I have had trouble in the past contacting the restaurant. There was one weekday night when I called literally 8-10 times and never got an answer.", 
    "review_date": "2010-04-02"
  }, 
  "C_mRoBu87_J7QWQGPcYaGQ": {
    "user_rating": 3.0, 
    "user_location": "Montara, CA", 
    "user_name": "D W.", 
    "review_text": "This is a decent choice for shabu shabu. Food is good, service is good. Nothing outstanding but decent all the way around.", 
    "review_date": "2013-09-20"
  }, 
  "H7s0wAZUKc0V1nahMABPPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom Y.", 
    "review_text": "My first thought was \"are they going to put some broth or base ingredients in the water?\"  But after some careful thought, I realized they don't want mask the natural flavors of the meats and veggies by using unnecessary spices.  Is this a fact?  Can I substantiate this claim?  Nope.  But it sounds good and makes sense right? :D  Each person gets their own hot pot.  You don't have to reach over other people or put your meat in the pot only to have one of your friends swipe it as soon as it is cooked.    All You Can Eat $22.95 Beef, Chicken and Vegetables.  Dumplings were included.  Fantastic deal.  But no lamb and the chicken was just okay...  The beef, however, was fresh and very tender.    I'm gonna tell my friends about this place!", 
    "review_date": "2008-05-01"
  }, 
  "IGkZa0eanufzVv9FR7kSUg": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Vivian C.", 
    "review_text": "Of Mums, Happy, and Shabusen as the three main contenders for shabu shabu in the Japantown area, Happy is the most affordable of them all. They have an all you can eat option, but The AYCE price is actually about the same as Mums, so for that option we'd probably opt for Mums over Happy. Instead, we come to Happy for the single servings for health reasons. Happy can't really decide whether it's Chinese, Korean, or Japanese, so you kind of get a mix of all three in terms of music genre being played, TV show airing, and type of sauce. I'd say that of the three, Happy has my least favorite sesame sauce, but it does have the option of a hot sauce...(thinking that's less of the Japanese and more of the fusion).  You get your own pot and the service is minimal, but it's nice when you don't want to do dishes that night or fried foods--just drop by Happy Shabu and boil'er-up! :)", 
    "review_date": "2013-06-23"
  }, 
  "Dj77pkw_EZJvR-F4RIf_BQ": {
    "user_rating": 3.0, 
    "user_location": "Reno, NV", 
    "user_name": "Jen W.", 
    "review_text": "all you can eat and drink for $34.95.    imagine what sort of crowd that brings in to this restaurant?  ...EXTREMELY obnoxious college freshmen who don't know how to hold their alcohol.    the set up is already awkward...every person has their own broth so you're pretty much sitting side by side with your entire party.  if you have more than 2 people, you'll have to sit at two different tables facing each other.  they're pretty far...so you'll have to yell to be able to speak to the other people in your party.    so the party of 8 college freshmen next to us...were yelling and screaming... DRUNK...about their sex lives and other things i just don't want to hear about.  i'm sure the rest of the block heard their conversation also.  anyhoo, can't really take away from a restaurant's overall review because of their customers...so onto the pertinent stuff eh?  the broth was probably the worst broth i've ever had at a shabu shabu restaurant.  you don't have a choice...and whatever they did serve is not even traditional.  there was no seaweed...and the broth wasn't clear.  maybe it was chicken broth or something?    the meat was ok...we asked the server if they had kobe beef and she had no idea what we were talking about.  so we just ordered the regular beef.  haha.  it had a good marble...and the portion size was decent.    the sauces were way off...the sesame one was super grainy...the regular ponzu sauce tasted strange...like it was fermented or something.  the spicy sauce was probably the best one out of the 3.    the plate of veggies and noodles were plentiful...probably the highlight of the meal.  i was stoked to see 2 different types of noodles.  the service was mediocre...in the beginning, i think they were super stressed.  they forgot our drinks...the people at the table in front of us were basically doing jumping jacks to get the server's attention.  and i had to hear another server rant about how she is not japanese.  argh.  so all in all...the food and service were just ok...the ambiance is absolutely ridiculous...but it's local...so 3 stars is about right.", 
    "review_date": "2010-12-19"
  }, 
  "iOpvXcAv2EyUV-E_rO_PFg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ming Y.", 
    "review_text": "I was going to start off saying that this place was horrible.  But then I collected myself and decided not to totally trash this place.  But all in all, this place wasn't good.  I didn't leave Happy!  We were the only ones in the place the whole time.  I guess it was early - 6pm and we thought we could do the early bird special, all you can eat, before 6:30pm.  The happy hour is 15% off anything...so not much of a special really.    The hostess/waitress was really nice but it just seemed like they were hurting for business.  The sesame sauce was bland, the spicy chili sauce and ponzu weren't bad but the condiments looked old and dried up.  We got the chicken and beef special.  The beef was decently fresh but was the fatiest cut I'd ever seen.  And the chicken looked and tasted old.  I left most of it.  The good thing about the veggies was that they offer bok choy in addition to the standard napa cabbage that you get at most places.  The space is pretty cool though.   It looked like a good place to invite a big group since they have big long tables and each person gets their own burner which is a huge plus.  I don't think I'll go back there - everything just tasted old.  I'd rather stick to Shabu-sen in j-town.  I wish I hadn't gotten so turned off by the place, I might have had a better appetite for the yogurt place just down the street.", 
    "review_date": "2008-07-09"
  }, 
  "ChKHMb5xCCjO99vac3MhnQ": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Scott Y.", 
    "review_text": "We found this place on a guy's nite out when we just wanted to DRINK, EAT, and DRINK some more.  Happy Shabu Shabu delivered.  The meat is fresh, the service is pleasant, and the staff is great.  Stephen is always there and a very nice man.  If you are drinking, he will go around and drink with you (occasionally) (don't test him b/c he just may make you some HOLY WATER which will make you scream \"HOLY SH!T\" :).  His server, Serena, is great too and has a great attitude.  Don't let the petite girl fool you.  This girl can drink and can boat race with the best of them.  Beer only please.  I liked this place so much that my wife and I decided to have our rehearsal dinner here and rented out the whole restaurant.  Everyone had a blast, and Stephen was super accomodating in helping us make sure the evening went smoothly and everyone got to eat what they wanted.  He even went out of his way to help us create a special menu.    In summary, Happy Shabu Shabu t is a great venue for social gatherings and I truly appreciate the quality of service here.", 
    "review_date": "2010-02-19"
  }, 
  "gfHSZbKC2bjb4CtXpafAKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda Y.", 
    "review_text": "great stuff.. my very first having shabu shabu..beef was great.. the sauces they had were good.. prices were ok for the amount of food I had.. and the place wasn't crowded, although it's not a big place.. only drawback is the seating.. they seat you next to each other with your own hotpot.. then if you have more ppl, they sit across from you on another table.. there is a walkway inbetween for the waitresses.. overall, I would totally come back!", 
    "review_date": "2009-02-21"
  }, 
  "a7x7C5FvlRYcO2EhhY0jsA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eugene L.", 
    "review_text": "Pretty poor quality meat.  Too lean and tastes freezer burned/grainy.  Sesame sauce is bland and watery, ponzu tastes like they try to do it homemade and put too much sake in it, and the spicy sauce is way overpowering.  I suppose it'll suffice if you're just concerned about stuffing your face with the all-you-can-eat option, but Kufuya down Geary is a better option for that IMO.  If you want GOOD shabu shabu go to Shabuway in San Mateo/Mtn View.  They are Japanese and use wagyu, the sauces are great and balanced, and the quality is consistently excellent.  For literally a couple bucks more you can have 2 large plates of superior beef!  (Get the \"premium\" [dinner only] - it's worth it)", 
    "review_date": "2010-05-28"
  }, 
  "QMkbjQtasAn4ZLaDb6ZNTw": {
    "user_rating": 4.0, 
    "user_location": "Williamsburg, NY", 
    "user_name": "Eric C.", 
    "review_text": "Happy Shabu beats out Mum's and Shabu Sen for the best Shabu Shabu in J-Town (Despite that the location is closer to Western Addition, at Eddy and Fillmore). For essentially the same price, the quality of meat as well as the thickness is much better than Shabu Sen or Mum's. In addition, the vegetables and noodles (2 kinds) that accompany your meat selection are a lot more generous and varied. It's nice to know that you're getting some good veggies in your diet when you're pounding a giant plate of beef. In addition to the standard miso and ponzu sauce, they also give you a spicy korean sauce. Finally, for dessert, you also get a complimentary mochi ice cream. The only draw back is that the spacing and seating is uncomfortable. The tables allow very little space for your legs to duck under, and if you have over a party of two, you're either all sitting in a long row or face to face but with a giant space between your tables, making conversation difficult.", 
    "review_date": "2007-05-22"
  }, 
  "tBYIXjYx_3hnbq3cIqH02g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lyly P.", 
    "review_text": "I was really bummed.  I knew that it was a long shot, but it was hoping it would be different.  The place was empty when we entered.  That should of been a sign, but what could we do?  The meat was just okay, but everything else was well \"bleh\".  The sauces were watered down, and they didn't have udon!  Just an okay experience.  The place was clean, but the layout was a bit odd.  You kind up staring at the other guests at the opposite table so somewhat odd.  This place was not horrible, but there are better places in the city to have shabu shabu.", 
    "review_date": "2010-05-09"
  }, 
  "5jq_1AngK0Q4eJqk-dS0Kg": {
    "user_rating": 5.0, 
    "user_location": "Pacific Grove, CA", 
    "user_name": "Allison M.", 
    "review_text": "My first experience with Shabu... oh my! I wasn't sure what to expect of this random place in Japantown, but I had the time of my life.  We did the All-You-Can-Eat and Drink for $32 per person. Such a deal! You get a huge platter of veggies and beef or chicken and your own boiling pot! You get three great sauces to dip your food it too! Beyond the food, which is obviously not 4 star, but still good, the all you can drink is the real star of this show! It is all you can drink beer and sake. Dangerous! We were only there 2 hours but we all left quite sloppy! The manager, Steven, was hilarious and made our trip there extra special! Watch out for his \"Fire Water\"", 
    "review_date": "2010-07-08"
  }, 
  "UtzOKXhjjvP5iPyn4VSK2w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin W.", 
    "review_text": "Came back here last night with a party of six people. One person in our party is vegetarian. The waiter agreed to allow five of us to pay all-you-can-eat and allow our vegetarian friend to pay for just a single vegetable shabu shabu.  When we brought this up to the manager he disagreed with the manager and then spoke to us disrespectfully. It would have been fine if the manager told us we could not do it in a polite manner but his exact words were:  \"Sorry I am the manager. I make the rules. He's just a waiter. If he wants to pay the difference you guys can do it.\"  WOW. We were stunned to say the least. Keep in mind this is an establishment that one person in party frequented numerous times a month....and this is how we are spoken to?  We were planning on buying lots of alcohol as well and they were going to nitpick with us over a $10 difference?  Ridiculous. It's not about the money, it's about how you treat customers.  Avoid this place. The manager is terrible and needs to learn respect.", 
    "review_date": "2012-09-15"
  }, 
  "0HwJtI06DB1ZPvQRNyCx1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maleenee B.", 
    "review_text": "This place is great if you have a group of people and are looking for a fun dinner. I came with a group of 12 and the service was quick, attentive. Food, beer, and sake were never low (and we were continuously depleting all of them).   I got the vegetarian all-you-can-eat/drink (2 hour max) and was really happy with the variety of food. There were glass noodles, flour(?) noodles, enoki and shiitake mushrooms, 2 types of squash, broccoli, bok choy, fried and raw tofu, and faux ham and shrimp. The beer and sake were good too, although I don't know what brand.   There were 3 dipping sauces, although i still found the food to be not as flavorful as I would have thought. But maybe I was doing it wrong.   I thought the all-you-can eat was only worth it because of the unlimited beer and sake. I could not even finish a full plate of the veggies/noodles/veggie meats so for the food only it would have been a waste.   Great for groups and celebrations. Only get the all-you-can-eat and drink if you plan to drink.", 
    "review_date": "2014-09-28"
  }, 
  "shkSqT17XGkSc64frKFCbw": {
    "user_rating": 1.0, 
    "user_location": "Western Addition/NOPA, San Francisco, CA", 
    "user_name": "Dave Y.", 
    "review_text": "Don't go here. Unless you're doing an investigative news report on worst customer experiences ever or hostile work environments.", 
    "review_date": "2012-09-29"
  }, 
  "CXLyd1ENz6bGg6JRtkdpTg": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Hope O.", 
    "review_text": "This place gets a solid three stars, because it doesn't have to be authentic to be good.  Most shabu shabu places get away with charging a lot of money for hot pot, and this place isn't too bad in that regard.  The choices on the menu are lacking, but all I wanted to satisfy my deep craving of shabu shabu was a side of good beef.  They delivered.  I had to really doctor up the broth to my liking, which bummed me out, but the vegetables were okay.  I was hoping for more mushrooms, but they literally only give you one.   The ambience was lackluster, as I had a trashy episode of Jersey Shore on the wall to taunt me in between bites.  Regardless, if you want an amazing shabu shabu experience, I'd recommend another place.  If you just want to satisfy the craving and save a few bucks, this place is perfectly adequate.", 
    "review_date": "2011-12-16"
  }, 
  "kCMw6ZtC9weRMUjSqs-P9A": {
    "user_rating": 4.0, 
    "user_location": "Foster City, CA", 
    "user_name": "B A.", 
    "review_text": "Been to this shabu place a few times. I would say its a new and still relatively unknown place compared to Mums or Shabu House.  But this little place is great.  The beef is freshly sliced and not frozen like some other places.   22.95 for all you can eat is a bargain. They have recently added miso and spicy miso to their menu of broths ( it was plain hot water before).  Great selection of veggies and you get your own pot! Just kinda wonder what happened to the dumplings they used to give out.  Dipping sauces are fairly good.  You get 3, sesame, hot/spicy, and ponzu.  I only use the hot/spicy and ponzu as the sesame is pretty bland.        One gripe..the seating is not that great.  Since you get your own pot, you lose the intimacy if you go with your friends.  You have to face strangers while you eat and even eating with just 3 people is pretty difficult.      All in all..the food is really good.  Service could be a little improved on since there were only 2 waitresses running around serving the entire place.     There is also all you can eat and drink for 34.95 but not really worth it unless you have a huge belly for booze and food.  for 12 bux more..you have to drink  at least 2 of the large beers to break even.   Will be back!....", 
    "review_date": "2008-12-01"
  }, 
  "kUXozMM-hvcSW87bM21RMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patra B.", 
    "review_text": "I just stuffed myself with all you can eat shabu shabu!   I've been here a few times with friends, and we always have to roll out of the restaurant after dinner. For $22.95, you can get all you can eat shabu shabu. And we definitely eat all we can eat.   I always get the beef now. I tried the chicken once, but boiled chicken just doesn't taste that great. They used to just have plain hot water to cook your food, but now they have miso and spicy miso broth. I like their ponzu and spicy dipping sauces. The sesame sauce just doesn't seem to have that much flavor to it.   The only thing I don't like is their table setup. There are rows of 2 or 5. And the rows face each other. So if you have a party of 5 and there's another party of 5, your party would be in one row staring at the other party. Kind of weird to be staring at strangers when you're eating dinner. And you can't talk to your own people unless you yell down the row.   I still haven't tried their $34.95 all you can eat &amp; drink dinner. I think I'd rather not barf up all that meat I just consumed.", 
    "review_date": "2008-11-28"
  }, 
  "6CqjM5LYyumiaNnGU4M6dg": {
    "user_rating": 4.0, 
    "user_location": "Culver City, CA", 
    "user_name": "Clayton L.", 
    "review_text": "John is the shit. He is awesome.  Other than that food was excellent! Fresh beef.   Unlimited refills on meats,veggies, saki, and fun!!!!!  Awesome.  Btw I'm drunk now.", 
    "review_date": "2009-03-06"
  }, 
  "x4dMlJWPH-iaNqdDoRwmqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Judy L.", 
    "review_text": "If you decide to go to Happy Shabu Shabu, be ready to be selfish. You get your own hot pot! Therefore, I'd suggest to bring even numbers of friends and sit across from each other (unless you like to sit next to one another in a row). I was extremely impressed with the cleanliness of the place!  Skip the chicken/beef combo and just get the beef. Each person gets 3 dipping sauces (sesame, soy sauce, and hot sauce), veggies and rice.", 
    "review_date": "2006-08-19"
  }, 
  "PtNR9MglVVVYsj4XrqTZqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daisy F.", 
    "review_text": "This review is long overdue. \"Happy Shabu Shabu\" is my favorite place...  I've been going here for the past 3 years.  Before I moved to San Francisco, I didn't even know what Shabu Shabu WAS, now I can't imagine my life without it....  I still remember the first time I wandered into \"Happy Shabu Shabu\". I didn't know how or what I was supposed to do with the pile of food and bubbling cauldron placed in front of me. I remember dropping a piece of meat into the water and staring at it. I wasn't sure how long it should cook or what order I was supposed to cook this stuff. I was perplexed and intrigued. I just remember leaving the experience feeling like I had discovered something amazing and knowing that I needed to return   I've been to many Shabu Shabu places in the city since then and this one beats them all.  I will explain why...  1. THE PRICE. $11.99 for the veggie shabu shabu and $14.99 for the beef. The portions are huge! There are noodles, vegetables (Cabbage, carrots, broccoli, cauliflower, spring onions, tofu, bok choy, mushrooms..etc) I always leave feeling completely full and happy. I've had shabu shabu that cost more money and I still felt hungry at the end. This is the best deal you're going to find in the city.   2. THE SAUCES! I've noticed most Shabu Shabu places have 2 sauces. A ponzu and a sesame. Happy Shabu Shabu takes it to the next level with 3 sauces. That third sauce is what does it. It's a mildly spicy and tasty chili sauce mix. It goes really well with the Sesame/peanut sauces. The blend of those 2 sauces working together kicks the whole experience to the next level.   3. INDIVIDUAL POTS. You have a warm bubbling pot all to yourself. I've done the group Shabu Shabu thing at other places and I didn't enjoy fishing around in the pot searching for my veggies amidst other people's cooking foods. It was stressful and annoying. I like having my own pot and cooking at my own pace. I feel relaxed when I'm there and I know I can just take my time.  4. STAFF - They're all warm, friendly and efficient. When I come in, they already know my order and they're sliding the tray with everything I need in front of me. The sauces all lined up, the little bowl, the utensils and chopsticks. Little jar of garlic and chives. The pot begins to boil and before I know it I'm happy. If I could eat here, every night. I would! It's really THAT good.   That being said, the seating arrangement is a bit awkward for groups of four. You sit across from each other with a big divide in-between you. This space allows the server to adjust your pot temperature and refill the miso broth. Unfortunately as a result, You have to speak loudly to hear each other. If you have a big group, they can accommodate you. Just make sure you call in a reservation in advance. I usually sit at the bar. It's easiest for 2 people.", 
    "review_date": "2013-10-28"
  }, 
  "MpiVWeCeMiIxf7oOtHmP7g": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Katrina V.", 
    "review_text": "2.5 stars  It's not often that a person from the south bay can say something like this in relation to SF, but: there is a place like this in San Jose, and it's better.  Shaburi Shabu Shabu in Japantown SJ is better....fyi!  About $15 per person for standard beef shabu shabu that comes with veggies.  Good portion size, no complaints there.  However, the dipping sauces here are really lacking.  There was a peanut sauce that tasted like liquefied peanuts...literally inedible.  There was something that was basically diluted sirracha.  Tasty, but no points for originality.  The final sauce tasted like soy sauce and mirin/sake.  Boooring.  When I have shabu shabu, a good dipping sauce is KEY.  Something like yuzu soy sauce or a tasty hot sauce or a peanut sauce that doesn't taste like circus peanuts.  There is a cool option of all you can eat + drink (meaning sake and beer!) that is kinda intriguing..mostly for the all you can drink part.  Also, there were people at a table near us who were getting ready to leave and someone who works here wouldn't stop talking to them!  It was obvious the guy was bothering them, and as soon as he had to leave for a minute to check up on some work stuff, they got the hell outta there fast.  For the price, I don't think I'd' come back unless I were checking out all you can drink.  I'll stick to my south bay shabu shabu, thanks!", 
    "review_date": "2011-03-20"
  }, 
  "6Mi5woaSUh6gGcLnzLYNfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan C.", 
    "review_text": "Not a bad shabu place at all.  FOR THE PRICE, EXACTLY WHAT YOU EXPECT.  I did the all you can eat here, and it was good.  The BEEF however was not as marbled other places I've been.  But having said that, it allows me to eat more meat cause it's not as greasy.  If you come here you have to try the soup base with the in house special spicy sauce.  The owner makes it himself and each batch takes a couple of weeks to make.  Pretty damn good.  Very Chinese kind of spicy aroma.", 
    "review_date": "2010-06-23"
  }, 
  "Vgh-CjwAl4tFleP39OdzaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "linda t.", 
    "review_text": "Good price (for just the beef shabu $14.95) for the AYCE $22 &amp; the quality of the food was decent -- the veggies I got were super fresh &amp; the beef was good. You get your own individual pot which is nice (vs other shabu places where there's a community pot). I guess this is better for folks who are vegetarian/etc so they don't need to share their pots/soup/etc.   Service was good at first, but the place gets packed pretty quickly and the staff was stretched thin trying to cover all the tables. I'd recommend going earlier to avoid the rush :)", 
    "review_date": "2012-05-17"
  }, 
  "UX6XnH7LtAb7mdUi4kWg2A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "Happy Shabu Shabu was not crowded at all for my first visit on a Tuesday night. We sat right down in a row with an electric stove burner in front of each of us, and I temporarily got over my hangup of sitting across from an empty space. We ordered some sake (natch), two veggie plates, and one beef plate. If they had offered veggie appetizers, rolls, or other such option more substantial than soup, I would have ordered that in addition.   I'm glad they didn't; two plates piled high with fresh tofu, cabbage, mushrooms, bok choy, carrots, and \"veggie ham\" (not listed on the menu) arrived, hot on the heels of a plate full o' raw beef (gag), three pots of hot, mysterious broth (miso?), and three sauces for each of us (sesame, spicy, and something sweet with which you were supposed to accompany green onions).  I tried to stagger the food dropped into the pot to cook appropriately, but to no avail: Everything was mega-cooked before the server returned to turn off the burners. But even then it was delicious. However, charging $12 for a veggie plate that probably cost $2.50 to assemble when I have to cook and season it myself is a little outrageous, especially when they don't stock any to-go containers (what restaurant does that?!).   UPON MY RETURN: I'll bring plenty of money, an extra-empty tummy, and my own Tupperware.", 
    "review_date": "2010-09-01"
  }, 
  "WiuXmGs_28M9qf5JZt3gJw": {
    "user_rating": 4.0, 
    "user_location": "Bayview-Hunters Point, San Francisco, CA", 
    "user_name": "Shaye R.", 
    "review_text": "food was good but kinda pricey.", 
    "review_date": "2014-11-13"
  }, 
  "TMLVzNYs-zwwREudyvI08A": {
    "user_rating": 3.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Matthew R.", 
    "review_text": "This place is pretty good.  The food looked and tasted very fresh.  I had the \"God Fearing, Tax Paying Good American\" plate (steak, and lots of it).  The staff was super nice and attentive.  And how cool is it that you get your own pot and cooking utensils? Very cool I tell you. You never know which of your closest friends might have a case of the cooties.  The only thing keeping this place from being 4 stars is the fact that they didn't have a liquor license. I'm sorry, but I really like to have some drinky drinky with my shabu shabu.", 
    "review_date": "2006-11-29"
  }, 
  "Oesvxmmtg7YyTH2ma8pmmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kendrick D.", 
    "review_text": "This place is great. Better than Mums in my opinion. All you can eat and drink is less than Mums at $35. You get 3 sauces to dip and your own plate of meat. If you do alcohol, each person gets their own sake. Real cool for a group or even a night out with someone special.", 
    "review_date": "2009-01-25"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "This place has the best service for an all you can eat and drink Shabu place in the city.  I've been to pretty much all of them and this one by far destorys everyone else.  Shabu house has too many sake bottles shoved up their asses so they have a hard time serving you.  We went with a party of 20 people and in the end everyone was completely trashed.  But the people stil kept bringing alcohol and food with no hesitation.  The Shabu was pretty good.  The meats are good.  I really liked the chicken.  They just need better broth.  I am definitely going back.", 
    "review_date": "2008-12-15"
  }, 
  "AtmjvEIEcuTFv8Ucdmo6UQ": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ella B.", 
    "review_text": "Food was ok. The beef was very good  the service is not good at this place.... Just mediocre... And the place is not even busy...", 
    "review_date": "2014-12-01"
  }, 
  "CAQv3QQHUasQNtN-HEldAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony L.", 
    "review_text": "I came here the other night with some friends that usually get drunk at this bar, but decided to get out for a change cause it was one of the regulars birthday's, and since birthday's only come once a year, I guess it was reason to celebrate, and hot pot fit the bill, cause who doesn't want some warm food with good company on a day like your birthday?  One of the things that separates this hot pot restaurant from the rest is the table space. Each place setting has its own hot pot station, so you can cook and eat your own food without having others double dip their chopsticks into your pot. The all you can eat here isn't bad either, why get one plate of razor thin beef when you can get three?  And I wouldn't go for the chicken either. Stick to the beef, and ask for the lamb if any's available. And have a blast with the dipping sauces--soy, spicy, and peanut. They're fun to mix and match.", 
    "review_date": "2011-01-03"
  }, 
  "UzT83K14kPyEpA7jQbL_GA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Michael L.", 
    "review_text": "I had an awesome time here, the all you can eat and drink special cant be beat. I'll definitely be back here for another round", 
    "review_date": "2008-10-06"
  }, 
  "H8q4N1DNgogAxo3T22x1bw": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "VOSS V.", 
    "review_text": "Me &amp; friends went there saturday.  Service is good.  Most of us ordered beef shabu, and one order of beef and chicken.  Beef taste better tho.   Sesame dipping sauce is not as good as Shabu way They charged us 20% tips on our bill eventho we were only party of 5.   I still like Shabuway better.", 
    "review_date": "2008-03-16"
  }, 
  "0EAP2Ixw6DWXWkxpWcafWw": {
    "user_rating": 3.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Martina M.", 
    "review_text": "This was my first experience with 'shabu shabu' cuisine. The food was fresh, the restaurant was clean. I'm not sure that I'm all that into shabu shabu to be honest. The waitress didn't really instruct us on how to eat the meal, which honestly needs some directions. It would also be cool if you could control the temperature of your pot. Not a bad deal though, you get a ton of food for the money.", 
    "review_date": "2011-11-01"
  }, 
  "AHLGwiyzX4CY_9Y46IpPYQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CW L.", 
    "review_text": "I would NEVER go to this restaurant again!  Rude service,bad foods(I think the shrimps are the frozen shrimps from Costco).The manager is the rudest person I've  ever met,and this is the worst dining experience I've ever had.By the way,they should change the name to \"Unhappy Shaby Shabu\".", 
    "review_date": "2011-06-16"
  }, 
  "ftqKNw6BbcEqT6eQCDzupg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H. D.", 
    "review_text": "Compared to Shabu Shabu on Geary, this place is just ok. Food is about the same quality as most shabu places but they only had one choice of soup. Maybe it was the really bad company I had that ruined this particular shabu experience (I was with a group of accountants i didn't really know, and apparently the only one who chose an occupation based on my passion for it and not for money).   The crowd gets really Asian and rowdy on late nights, which is fine, but I like to dine where I don't feel like I'm in a Young and Dangerous (Goo wak jai) movie. Chinese peeps, you know what I'm talking about.   Service is fast and efficient though, so plus for that. Overall, nothing really stands out about this place. Oh, and the way they set up the tables seems kind of odd when you're eating inside with a big group. Everyone is either too close together (if you're at the counters), or too far apart (when you're at the tables).   P.S. The bathroom was pretty funky....=/", 
    "review_date": "2010-01-04"
  }, 
  "5XO4iBD2JlZIoym9fDMV6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin B.", 
    "review_text": "First time stop in here. Didnt wait as they had table tops available with your very own pot. Ordered the beef, comes with vegis and noodles.  The sauces are ok, but not my favorite. and the tofu and vegis are just enough to satisfy the palet. The beef I ordered was a very good amount, and the cuts were very nice and thin. good quality beef considering it was not kobe.   Service was good, TV screens to watch football, and decent atmosphere.   nice!", 
    "review_date": "2014-11-10"
  }, 
  "0UAkDCb7L3M5VAWwKFaD2w": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Nick H.", 
    "review_text": "Definitely the best in quality when it comes to shabu shabu in the city.  This place is clean.  Clean enough to eat off the table.  The service is very good here, very courteous, very polite.  They even come by and scoop the cooked blood that sits on top of the water.  The beef here is very good quality, very fresh and perfectly marbled.  Even though I prefer a little more fat.  However, I would say that for most people it would be perfect.  The down side is that they need to start serving Asahi.  Everyone serves Sapporo.  Why?  Asahi is much much better.", 
    "review_date": "2007-09-12"
  }, 
  "tOLSima4VTPxKuB7j88L8g": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Steve C.", 
    "review_text": "This place has the rudest customer service I have ever experienced.  We came here for a birthday party w/6 people.  We had a reservation (more on this later).  Upon arrival, the place was completely empty.  We were promptly seated at two \"counters\" that faced each other.  Soon after, we were told, rudely, that we had to move to another table.  No reason was given, but we didn't mind as we hadn't started eating, so whatever, we moved.  The waitress gave us no help in moving, didn't even pick up our water cups for us.  We had to do it ourselves.  But onwards.   Before taking our order, our waitress, a younger looking Asian girl that looked and talked like a rececnt immigrant, bluntly informed us that we would have to vacate our table and finish eating in exactly one hour because the restaurant had another reservation for the table (nevermind that we too, had a reservation and that the place was completely empty during the entire time we were there).  I was rather dumbfounded by this \"request\", but since we had to meet some other friends at a bar in about an hour, I didn't protest too much and just said \"fine\".  Our food was served promptly, and the food itself was ok (it's pretty hard to mess up boiling water, uncooked meat and vegetables).  When we finished with our food, the waitress came back, and rudely told us (and I quote) \"It's been one hour, you guys need to leave now.  Can I bring check?\".  At this point I was getting a little irritated, but because everyone was basically done and it was time for us to get on with our evening, I said (rather irritated), \"yes, fine.\"  Upon getting the check we noticed that one of our meals (for the birthday person) hadn't been comp'd (as their website promises for parties of \"6 AND More\").  I brought this up with our waitress, and she rudely responded, \"you need seven people for that\".  I said, \"No, on your website it says 6 AND More...\" and then pulled out my Iphone and their website to prove my point.  Her response, in broken English and a blank stare was, \"Yes.  7 people.\"  This was the last straw, so I demanded to speak with her manager, as the last time I checked \"AND\" is an INCLUSIVE word, which meant 6 people was all that was required to qualify for hte deal.  The waitress went back and upon return, told us that she had taken care of the free birthday meal.  However, upon further review of the bill, I now noticed that they tacked on an 18% Gratuity charge.  So yeah, the birthday person's meal was free, but now I had to pay an additional 18% gratuity for a place with piss poor service that didn't deserve a tip!  I complained again, only to get dumb stares in return from our waitress so I finally just gave up and paid the 18% gratuity since we were now running late and I didn't want to stick around and argue with these people for the rest of the night.  I slapped down my credit card, she took it back, charged it and returned it.  I signed my name and gave them NO additional tip, then started flipping the receipt over (as I usually do).  As soon as I did that, the waitress grabs the receipt from my hand, flips it over again while I'm still sitting at the table, notices that I gave them no additional tip, YANKS the receipt from me, and gives me an evil look, then storms away. No thank you for your business, have a good night, nothing.  Just up and left.  This place is far from being Happy.  And I certainly was NOT Happy. NEVER coming to this place again.  The staff are Shabu Shabu Nazis.", 
    "review_date": "2010-11-22"
  }, 
  "T6zcfyO8eR2Py9V_bK_K4w": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Thuy N.", 
    "review_text": "My company had a dinner/birthday celebration here last night.  At first walking in, the place is empty @ 8 pm.  But we were a party of 20+, so we literally occupied half of the restaurant.    Like most reviewers stated, the layout is very awkward and not much conversation will be made.  But if you get the all you can eat/drink option, loads of sake and beer later, you will definitely be shouting across the room.  I really dig the fact that the beef was freshly sliced on a deli slicer every 10 minutes!  The beef had no marbling,some fat, and was thin enough to ensure quick cooking time.  But the freshness...wow.  One of the servers working is super pushy into getting everyone to drink!!!  I was DD and I had shot of sake and glass of beer, but noooooo I was forced to drink......boo there for no respect for responsibility!    Oh yeah, the spicy sauce they got is SOOOOOOO good!  However, the broth is instant, there's a bucket where they take a scoop of broth paste and just add hot water, mix it, and then pour it back into our hot pots.  Left a super nasty MSG aftereffect...but then again, the rest of the folks were too drunk to notice.  Overall, fun, price is right, and a lot of happy people went home drunk (or continued drinking).", 
    "review_date": "2008-12-24"
  }, 
  "JjtQ1txoSd69pSwUPsWxcA": {
    "user_rating": 3.0, 
    "user_location": "Santa Fe, NM", 
    "user_name": "Kat C.", 
    "review_text": "We came to happy shabu shabu for an engagement party and there was at least 15 of us. The restaurant was clean, the waitress nice, and since there didn't seem to be anyone else in the restaurant is was easy to seat us next to each other at the little cooking stations.  I'd never yet tried the shabu experience and I was left feeling underwhelmed. The chicken didn't seem as fresh as the beef combo, and despite the fact we were cooking the food ourselves, the meal overall was pretty bland. I did dump all sorts of seasoning and sauces on my meat and veggies, and still felt that it tasted like sopping wet tastless food. I also do not think they provide enough noodles.  My boyfriend was glad that we didn't get the all you can eat, because although he was still hungry after eating everything, he wasn't sure if he would have enjoyed more blandness. I think shabu is pure novelty, and that's what you pay for. If you want something tasty, perhaps try something else.", 
    "review_date": "2008-07-11"
  }, 
  "bGrNXi8Uu-AZdjrXkpB4Zg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Julie M.", 
    "review_text": "Have to give this place only 4 stars. Sorry. I am a shabu shabu lover myself but if I dine at a shabu spot please don't put a stop sign in front of me. Pull it out and give me more stuff to shabu in. This place only had 4 options...2 Veg and 2 Meat eater! What is up with that. Granted its the only shabu place I know around here in the Bay. Go here if you never shabu before which is basically hot pot but you are hot potting solo. They have some cute decorations around the restaurant which made me want to steal one of those cute little dolls. This is a very hidden spot btw. Parking is alright. Sometimes the bum scare me but yeah this is Fillmore. If you are want to hot pot but don't want to share your broth with others, then come here. Enjoy! Get your sweat on and come out smelling oh so wonderful with a nice stean face.", 
    "review_date": "2006-07-10"
  }, 
  "FG_cmTqI_8CiM_nqGz4lsw": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Nicole D.", 
    "review_text": "Terrible food, disgusting and immature clientele that treat this place as a frat house, and an owner who doesn't care about noise levels to his surrounding neighbors because the only business he gets are from 21 year olds on a Saturday night.", 
    "review_date": "2012-05-12"
  }, 
  "xhmZx6LhFdyBbuytKp5MOA": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jtina K.", 
    "review_text": "Bad service. Horrible meat quality. Angry owner. No one wants to be treated with no respect. You don't deserve a tip but you already added it into my bill. Never coming here again.", 
    "review_date": "2014-03-26"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "I was all set and ready to give this place 4 stars but man, this effing horrible service here is a travesty against mankind itself.  I'm undergoing some health issues at the moment that involve blood loss and i've been advised to eat a huge fat steak to make up for the iron and blood loss... so somehow, i ended up here ordering all you can eat beef.  and to top it off, i have to constantly keep eating red meat and salty foods to keep my blood pressure up.   1) the dipping sauces here get salty after awhile. don't mess with that yellow one, its gross. it tastes like burnt peanuts. 2) dont bother trying to get a refill of water or tea, or a second platter of anything when you ordered all you can eat.  3) if you're asian, good luck getting any service. they waitresses seem to LOVE big groups of white people. the entire restaurant was full of asian customers and 1 group of white people. WHO GOT ALL THE ATTENTION? WHO GOT ALL THE SERVICE?? WHOSE BEERS AND SAKES WERE FLOWING ALL NIGHT LONG? WHOSE TABLE WAS NEVER EMPTY OF BEEF, ENOKI MUSHROOMS AND ALL THAT GOODNESS!? shit.. i probably could have bled to death and passed out before they even take my fucking order.  On top of all that bullshit, my friend ordered the vegetarian platter and guess what! it took 45 minutes with CONSTANT NAGGING for it to arrive. There was our table of 6, a table of 3 behind us, and a large group of about 10 so the restaurant was not packed. WHERE THE FUCK WERE HIS VEGETABLES? WHAT THE FUCK WERE YOU GUYS DOING, GROWING THEM IN A BACKYARD?!  In a group of six people, 3 people had to continuously nag, one by one, and ask them for water, for tea, for beef.  I'd ask, nothing. My friend would ask, nothing. My other friend would ask, nothing. I'm glad i left you a shitty ass tip, you didn't even fucking deserve one. You know what else? i fucking worked in the restaurant industry for YEARS. I know your ass wasn't doing SHIET.  I dont know what the fuck the other yelpers are talking about, aint no waitress comin by our tables to strain fat from our pots, and we didn't get ANY dessert yet they brought it out to the other tables. The fuck is that bullshit?  I held back on my anger and bitchiness to unleash it all on this review. So guess what Happy Shabu Shabu? You may TASTE better than Cafe Mums, but at least at Cafe Mums they get me fed, and serve my hungry ass up with a quickness and a smile even if it's a half-assed one so...  fuck you.", 
    "review_date": "2008-01-19"
  }, 
  "CpTcmQAdYuYo9Y5Ck18dow": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vinkin Ken T.", 
    "review_text": "I've never been to a Shabu place where they give you individual hot pots. I loved that! The lay out is a bit weird though. If you're a party of two, you sit next to each other rather than across from each other and what you see across from you, is another party of 2. So if you look straight ahead, you see someone you don't know eating. Since it's not good to stare, you kinda have to look elsewhere. We came right at 6pm on a Sunday night and the place was full. They recently had a Groupon deal which is why. Waited about 15mins for a table. Once sat down, took about 10 mins for the food to arrive after ordering. They only had 2 waitstaff so getting the bill took a while. Food was good, lots of portion, we were full. You only get 1 broth, no choices.", 
    "review_date": "2014-11-27"
  }, 
  "88DldWGeWUKZwaDit-1hrQ": {
    "user_rating": 4.0, 
    "user_location": "Broderick, CA", 
    "user_name": "Christina T.", 
    "review_text": "This place is great. Went there is weekend and got the all you can eat great price. I dont drink so i didnt get the one with the all you can eat and drink but both are a great deal. I'd come back again next time i'm in the city, and the owner is great.  ohh yeah the lady that lives upstairs is a little crazy!!", 
    "review_date": "2009-02-09"
  }, 
  "dSj_Q7vt6h9V4Oc7r4SS0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny K.", 
    "review_text": "This is Korean style shabu shabu (i didn't know until a friend told me). I always thought shabu shabu was japanese. Anyways, this place is really clean and all their ingredients are very fresh. They also give u 3 different types of sauces. The tastiest one is the Korean spicy sauce.  Also this is best hot pot i tried. The service gives you a little somthing extra -a ginseng root in all the pots.   They have several different shabus on the menu - one w/ beef, one w/chicken, one w/vegetarian style, one w/beef or chicken &amp; seafood,  or one w/seafood (a plus since they give you a lot of seafood) for several dollars more.  Also they give a complimentary dessert at the end. This is a cool place to just chill!!", 
    "review_date": "2007-11-06"
  }, 
  "L2j8Ci1d30tDU4-kbeOr4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie T.", 
    "review_text": "Came as a party of 30 people and basically overtook the entire restaurant. It was a friend's birthday celebration so we did All you can Eat and Drink Shabu Shabu. While the tables don't run well for intimate group conversation, it was still really fun to do sake bombs and dine with a friend to share the shabu pot with.   Their sauces aren't as great as I've had elsewhere but it was still good beef. The owner warmed up to the party near the end and came around pouring bai jiu shots for some people because some of us started talking to him in Chinese. Great place for another happy birthday bash!", 
    "review_date": "2010-11-15"
  }, 
  "C-bdGe-Cuzl9j04KPhQxAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "Went here on a Friday night primetime.  Quickly seated but it was packed with loud bday party revelers, couples and whatnot.  I'd been here a few times awhile back and thought it to be good, not great.  Happy Shabu seems to have new ownership in place because the menu is different (now has all you can eat/drink options) and the quantity of food in regular orders is larger.  I was tempted to get all you can eat but chose the standard beef and it was more than enough.  Lots of noodles and veggies like shitake mushrooms, enoki mushrooms, bok choy.  Sauces included a spicy gochu jang-heavy one that was tasty. I would've liked to have seen flavored broth options.  Cold house sake also quite good.  If you haven't been to Happy Shabu, it's worth another trip to see what is new.", 
    "review_date": "2010-05-09"
  }, 
  "XQU46gFfVmgSjTOTvc5Jew": {
    "user_rating": 4.0, 
    "user_location": "Sherman Oaks, Los Angeles, CA", 
    "user_name": "Angela A.", 
    "review_text": "$22.95 All you can eat shabu shabu - mmm OK..... $34.95 All you can eat AND drink?! Now we talking! Other than that, this place is your typical shabu joint except its fancied up by the zen-like decor and three dipping sauces - ponzu, sesame, and spicey.", 
    "review_date": "2010-09-10"
  }, 
  "w4ZBwrYODc__W4-Lx0p5kQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bomin K.", 
    "review_text": "As we were in search of a late dinner place in the hood, the sudden chilly wind made it clear that we would want some hot soup action over fried chicken at 1300.   The restaurant wasn't too crowded and we decided to sit at the bar as you'd still had to sit side by side at the tables which is kinda a lil odd.   Menu includes al la carte or all you can eat beef, pork or seafood. We ordered 2x beef option. It came with ample veggies, tofu, noodles. Price was reasonable  $16.99 per order. I liked the way they freshly cut the beef just before serving.   They only had the miso as the soup base. (No spicy miso!) it was pretty okay and portions are quite big.   Nothing great but reasonably priced with good ingredients. They should improve the taste of the soup and it will make a difference. Ah also please serve the draft beer cold!   The greatest perk was the yelp deal $25 for $35. With this offer, 2x beef &amp; two Sapporo pint came to $9.68 before tip. Pretty good deal, aye?   Oh also don't forget to check in for the free dumplings to dunk into your shabu shabu!", 
    "review_date": "2014-10-09"
  }, 
  "7oqtGgi7G8WrWVRnfflFGw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah H.", 
    "review_text": "Made a reservation for 3 people and requested that we each have our own pots. They said okay don't worry, you will have your own pots.  Get to the restaurant, and of course, we are sharing pots. I guess making a reservation doesn't really matter. Then I asked him if we can just sit at the tables then so we can just have own pots, and he says no, those are for parties or reservations. I remind him I made a reservation, and he just says no. You're at the counter. Tired of this man's attitude already, I just sat at the counter.  Got the all you can eat option, and that was worth the frustration that the manager caused. Unfortunately, my pot was not boiling the entire time, making me sit and wait for my meat to cook for a much longer time. Asked our waiter to turn it up a bit, then 2 minutes later the manager would come and turn it down. I gave up.  If you sit at the counter, good luck finding room to fit your plates of food. I was so cramped, and my shoulder was aching due to the fact that the pot is extremely far away when you share.  The manager is rude, and doesn't talk to people very nicely, nor does he answer questions you may have.  Next time, I'd rather pay the extra bucks and go to my favorite Shabusen. At least they have amazing service and are some of the nicest people.", 
    "review_date": "2012-09-17"
  }, 
  "0PdFzYFvwdqh7jKqcnroSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "em T.", 
    "review_text": "I've have been here quite a few times. Now i heard they are having all you can eat and drink for a flat price which is good. This place is one of the cleanest restaurants i ever been too. I am not lying!!! The waitress are friendly and taught me how to use the ingredient's to put into my sauces the first time i was there. They scoop the oil from the beef off my pot. Oh... what i love the best is you get your own pot. You don't have to share, just in case any of your friends are sick. I been to other shabu but i like this one by far. Clean!!! Friendly!!!  &amp; Yummy!!! what more can you ask for.", 
    "review_date": "2007-11-09"
  }, 
  "nQL08lhKEGPOA8da4wVP-Q": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dawud H.", 
    "review_text": "Nothing to rave about.  Only one staff member has what it takes to keep the patrons happy, the guy with the black fingernail polish.  The other fella was stoic, drab, did not smile, maybe he is the numbers man.  Anyway the rice was gummy, it was the worst. The place got crowded and staff got slammed, so I understand the lack of attentiveness, to a crazy shabu crowd, they have to keep things movin'.  I won't be back, just not the place to shabu.  Do not bring your date here, fortunately I dined alone, I would have been ticked off otherwise..  Save your money.", 
    "review_date": "2012-02-11"
  }, 
  "4wDZAs9a30snc4ufjLbUBQ": {
    "user_rating": 5.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "E.Mo. ..", 
    "review_text": "Shabu shabu was a new experience for me. Luckily, I came here on the opening weekend, so the free sake was flowing' like wine. Food here is fantastic. Very very fresh vegetable, aged beef, cooked to order by you...in your own hot pot. Not familiar with hot pots? It's a big stovetop-heated broth into which you throw ingredients from your (HUGE) plates, and cook each item as long as you want. The variety of dipping sauces, and the broth are excellent compliments to how fresh the food is. If you're not normally one for adventurous dining, I'd say try this place first. You shan't be disappointed.", 
    "review_date": "2006-06-06"
  }, 
  "0IYQrdPM9NPJsRThHfpdEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lin L.", 
    "review_text": "I came here on a Thursday night with my boyfriend and had a great time!   We were seated promptly, AND served just as fast. Our waitress was Serena! She's such a doll and totally down to have drinks with you! Service was fast and very efficient.   my boyfriend and I chose all you can eat meal. Not only was the meat nice and thin and very delicious--  but the veggie plate (which included 2 kinds of noodles) were very fresh and tasty as well.   As for the sauces, I'm not a big fan of peanut sauce or chili sauce in general so I really rate the sauce by the ponzu-- and dear God the ponzu sauce was...... YUM!!! I like to add extra garlic and onions :)  Anyway, totally give place a shot. Great food and great service at very nice prices!", 
    "review_date": "2009-09-12"
  }, 
  "Le74zCxIjVCaA7z_lxofiw": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Marris E.", 
    "review_text": "Every single time I go to this place, I always have a good time.    The portions are not that great, but the ambiance and the whole \"hands-on\" technique of preparing your food just the way you like it makes up for that.    One can not say that the food tastes terrible here.  You are in control of how your food comes out!  Ok, I am exaggerating a little bit... but you get the message.   My recommendations?  Get a small lunch beef plate with a side of lobster balls.", 
    "review_date": "2007-06-28"
  }, 
  "bW2LMBS-D-qAgXfpeof3UQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina S.", 
    "review_text": "From what I remember, the food was very fresh.  I can't really give this a serious rating because I don't really remember what I ate!  haha  I had the all-you-can eat and DRINK with happy hour before.  John, the waiter, didn't help either when he started drinking with us!  I just remembered the beef was really good!  I didn't like the set up because you're so far away from the other people across the way.  You can't talk to anyone on the other side cuz it seems so far away!  But I did enjoy having my own pot and didnt have to share!  haha", 
    "review_date": "2009-05-22"
  }, 
  "WuZBdj8tjjn_QYr5ce2bew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura S.", 
    "review_text": "Kind of a peculiar seating arrangement because each person gets his/her own pot to cook in so the seating is really spaced out. If you go with a larger party be prepared to     sit about two yards away from the people you're facing and talk loudly!   We got the all you can eat/drink option and they were very generous with the food. They had great dipping sauces that they provide, which at other restaurants you have to order separately for an additional cost.   They never let our drinks run low and brought as many pitchers as our party of 8 needed (or didn't need!)  I would definitely go again but make sure it was with a group of friends I already know well. The environment is not conducive to getting to know more than one or two people at a time but for a date or small group it could be really fun and interactive.", 
    "review_date": "2013-03-04"
  }, 
  "tQRRbKWyDwSHo5typ2jKAw": {
    "user_rating": 1.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Jaclyn M.", 
    "review_text": "I can't imagine why this place has received all of the good reviews it has.  There is a reason why when you walk past it on a Friday or Saturday night that it's empty...  The food was mediocre and even though we were only one of two couples in the restaurant, service was slow.  The meat was definitely sub-par as well.  I've been to many shabu-shabu places before but this has to be the worst.  If you're looking for quality food, try elsewhere...", 
    "review_date": "2007-11-07"
  }, 
  "jhPAC7UyPiRFNPlNQYMMXg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kazu O.", 
    "review_text": "Very cheap, low-quality cuts of meat. Marbling is practically non-existent.  Also, this is the first shabu shabu place that I've had in my entire life that mixes their gomadare (sesame sauce) with water to save some $. What the hell. It was super watery and had no flavor. I asked for more gomadare, and they brought back yet another watered-down batch, albeit just slightly less watery... the waitress said, \"We gave you a lot, just for you.\" Umm... can you just give me one that isn't f'ing watered down?  Definitely the worst shabu shabu I've had around here.", 
    "review_date": "2013-06-30"
  }, 
  "PPiYZDUh_gFDIuq9b3r1cQ": {
    "user_rating": 3.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "K K.", 
    "review_text": "Not too bad. The seating arrangements were the first things I noticed because they're so weird! The tables are like two-seater school desks facing another desk with a huge gap in the middle. I came when the place just opened so it was empty, but I can't imagine how awkward it would be if it were full.   The food is ok. Broth is bland as hell. It's kind of nice you get your own pot but it doesn't help flavor the broth. The meat is whatever.   The upside to the place is that you can share the plates so it kinda makes it a nice, cheap place to eat if you're looking for something filling, but not too filling... with one other person. Not a place for groups with more than 2 people.", 
    "review_date": "2013-09-15"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "\"Happy\" Shabu Shabu? Errr, I think NOT!  Unless it's Espetus or The Buffet @ The Wynn, I really don't care for All-You-Can Eat establishments because they tend to be filled with low quality food soaked in fat and laced with enough salt to give me instant heart palpitations. However, this is the quite opposite of HSS, the food is just completely TASTELESS which to me is just as bad.  On Sunday, December 26th, my friends and I (party of 3) came to HSS at 6:30 PM and were promptly seated without reservations. In an effort to shorten my novel of reviews, I'll just give a quick summary:  P R O S: *AFFORDABLE FOR THE PRICE SENSITIVE CONSUMERS. AYCE for $22.95 (Beef, Chicken and Veggies) and AYCE&amp;D (Beer, House Sake, and Soda) for $34.95.  *FRESH WELL-MARBLED BEEF. Tender but NOT high-grade quality \"melt-in-your-mouth\" tender.  *INDIVIDUAL COOKING POTS  C O N S: *TASTELESS BROTH. The broth was SO watered down that it tasted like water with brown/yellow food coloring.  *BLAND SAUCES -Ponzu: Watered down flavorless colored water -Sesame: Watered down flavorless paste -Chili: Chunky and so salty that it masked the spiciness of the chilies  *ROCK HARD CLUMP OF FROZEN DUMPLINGS from your local Asian market.  *AWKWARD &amp; STRATIGICALLY ILLOGICAL SEATING ARRANGEMENTS.  Individual burners are adjacent to each. If you go with a party of 2, 3 or 4 you will be seated in a straight line and if you want to even have a conversation, you will have to turn and YELL to your left or right which makes it impossible for person #1 to talk to #3 or #4 and vice versa.   Imagine that with a bunch of rowdy drunktards doing the AYCE&amp;D. Yah, no thanks!  *BAD SERVICE. I had to ask 3-4 TIMES for water and rice when there were only 2 tables (party of 3) there. Enough said.  If you're looking for flavorful and high-quality AYCE &amp; AYCE&amp;D Shabu Shabu with far superior service, shell out a couple more dollars ($7 more for AYCE and $5 more for AYCE&amp;D) and go to Shabu House on Geary/15th instead...it will be WELL WORTH IT!!!", 
    "review_date": "2011-01-05"
  }, 
  "eZNhFI6m07dvu1zfLfJc-g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy N.", 
    "review_text": "The meat is good. The sauce, not too much.  If you have a big group, there's a bunch of chairs placed around the tables where certain people might have a bad angle of the pot. Seating is not as comfortable if you have long legs because your knees will be against the side of the table and there is no leg room.  Staffs are cool, alcohol is cool too. HAH!", 
    "review_date": "2012-11-05"
  }, 
  "QjNjVF-ZdWr-P4zUzXwpVA": {
    "user_rating": 4.0, 
    "user_location": "Augusta, GA", 
    "user_name": "Jessica K.", 
    "review_text": "Mmmmm...so yummy. We walked in on a Sunday before  a Sundance flick and were nicely surprised by how smooth the whole dinner went. The hostess is also the server-it's that small. Maybe 6 or 7 long tables and everyone gets their own pot. Mmmmm...food. They have an unlimited menu and a veggie, seafood, combo, and beef. I got the beef and my friend got the seafood/beef combo and so much food came back out!!  They have 3 sauces you can dip it into. Spicy, sesame, and soy I think...and on top of that, fresh green onion and garlic and chili oil. I should have gotten the unlimited-I could have gone eating forever!! Fresh mushrooms and vegetables and thinly sliced kobe beef. Yummy! Overall, the dining experience was phenomenal and the server was so sweet and attentive. I'll be back again.  DEEEELICIOUS!!", 
    "review_date": "2008-06-08"
  }, 
  "0GHsxjCk-Ynzx4Ihj8tjPQ": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Debbie C.", 
    "review_text": "This place was okay.  I had heard this place was BYOB but I realized it is NOT when my friends and I arrived with a couple of bottles of wine. The layout is not ideal for groups but the hot pot is pretty good. In terms of service, our waitress was polite but didn't speak English well.", 
    "review_date": "2007-09-14"
  }, 
  "5Ap91V6vM4wgxgJeCu68-Q": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Joanne T.", 
    "review_text": "So yes, the service is slow, but the quality of the meat is fantastic - and they slice it thin right in front of you! The veggies are great - good variety. The noodles are FRESH. There are 3 different dipping sauces, in addition to garnishes like fresh garlic, chopped scallions, etc. And my favorite part - each person gets an individual hot pot!", 
    "review_date": "2008-04-14"
  }, 
  "M19NwFwAXKRZzt8koF11hQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy C.", 
    "review_text": "I always joke about having shabu shabu, that you can't really complain about the cooking, because they don't have chefs or a kitchen, fridge is all they have.  This Korean shabu shabu is basic, simple, but the beef quality is pretty good. I had the chicken and beef combo for 14.95, not a lot of meat but they put a lot of veggies and rice that will fill you up. Not a lot of choices if you are looking for specific types of seafood or beef.  Service was pretty good but a bit slow so plan on spending an hour or two to enjoy.", 
    "review_date": "2008-05-11"
  }, 
  "KOmZ7cT-n9HwdwnPeY6-qw": {
    "user_rating": 4.0, 
    "user_location": "Cerritos, CA", 
    "user_name": "Mike L.", 
    "review_text": "I went here with a good sized group of 20 or so people who were all starving due to a day of intense dragon boat racing.  My first impression was already negative because we had vegetarians in our group who could obviously not eat the AYCE meat and the owner was strict about them not sitting at our table.  This forced 2 of our group members to sit at their own table isolated from others.  Understandable I guess but when we are here with 20+ people I don't think having 2 people in your group sitting with you will be a big deal.  You are already making $1000+ from our group but you're penny pinching.  After we got through that ordeal things picked up and the rest of the night was enjoyable.  I ordered the AYCE and all you can drink (sake and beer) and was pleased.  I'm not sure if the meat quality was good or if I was just starving but I have no complaints there.  Everyone had a good time eating, drinking, and socializing - at one point the same strict owner even came out and started giving us free drinks and even drinking with us.  One of my friends even engaged in a drinking contest with the owner with \"fire water.\"  When we left, the waitress even partook in a chugging contest with some of us.  I would definitely say that this is a fun place to take a big casual group and probably even more fun if you can persuade the owner to start drinking with you.  I hope to come back again next year during my annual trip to San Francisco!", 
    "review_date": "2009-10-02"
  }, 
  "JnGjZVSlfCkKHErvO5ts4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marti L.", 
    "review_text": "$22.95 - all you can eat beef, chicken and vegetables $34.95 - all you can eat beef, chicken and vegetables + all you can drink beer, sake and soda --  The only other shabu place I've been is Mums, and I must say, I prefer Happy Shabu Shabu much more.   Even though Happy Shabu Shabu is smaller, in comparison to Mums: 1) it is less crowded 2) has better and faster service  What I love most is the plentiful pots they have. Never have to share with more than one other person! During our dinner last week, our waitress was super energetic and attentive. Even the owner was friendly. He kept insisting that we get more plates of meat even though we were clearly too stuffed to eat anymore.  The food itself is not bad. There's really not much to expect from shabu shabu. After a while, everything tastes the same. I do like their thinly sliced beef and the variety of vegetables and noodles, plus the 3 different dipping sauces.   I'm always HAPPY to SHABU SHABU here. =P", 
    "review_date": "2009-11-25"
  }, 
  "GuMkSUhINdQlOvZy0MmSTw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen N.", 
    "review_text": "Just went here for a dinner with my girlfriends and I had a good time.  It was a great deal because the food was yummy and the bill was friendly on my wallet.  The broth was a bit bland but after awhile, the garlic and meat flavors permeated the broth quite nicely.  The only thing that was a bit annoying about the experience is the layout of the tables.  Depending on the party size, it could split the people by a big distance because the \"tables\" (they're more like counters with drawers on the inside to store various things like napkins) are about three to four feet apart.  It's a casual place so speaking a bit louder probably wouldn't ruin the ambience.  I'll probably return here because it's a great deal.", 
    "review_date": "2010-09-04"
  }, 
  "lXKjU1d7uy4aG0c5dNTATw": {
    "user_rating": 2.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Mika D.", 
    "review_text": "Remind me not to come back here again. I wasn't really too keen with the quality of the meat nor did I like the watered down dipping sauces. I've had better shabu shabu elsewhere. The service was non-existent. The rice was undercooked. Meh.", 
    "review_date": "2011-04-03"
  }, 
  "3SAAn35I_-kj6a7nqqBAmw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura f.", 
    "review_text": "I thought that the all you can eat for 22.95 was a good price. The beef was yummy and i loved the fact that you had 3 dipping sauces to choose from. the spicy really gave it a kick!  we were there for more than an hour and the plates of beef kept coming. service was good and i really did enjoy myself - its a good option when you don't want to venture to japantown and pay more.   also its pretty cool that you sit with your own individual pot instead of having to share and fight people for your beef/veggies/noodles.", 
    "review_date": "2011-05-25"
  }, 
  "xAosfFk2ubkUuXu-PeX-vQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maddy F.", 
    "review_text": "This was my first time trying shabu shabu, and it was a great meal for a cold day.  You get a lot of food and the dipping sauces were yummy.  The service wasn't super friendly/efficient.. just ok.", 
    "review_date": "2010-12-19"
  }, 
  "s_bwB79YSbfJWcqXCUTqBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "christopher a.", 
    "review_text": "I dont know why I eat here instead of Shabu-Sen. Sometimes maybe I'd rather be on fillmore st enjoying the weirdness of it.  Basically equivalent quality.", 
    "review_date": "2009-04-15"
  }, 
  "JGufZUDWaFEoQjnoIAxX-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kehaulani K.", 
    "review_text": "Staff is super friendly and attentive. Meat quality is so-so. Not kobe! Being that this is a korean shabu they offer three sauces instead of the usual two. I like the gingery one the best. If you order alcohol separate and do not get the all you can eat/drink it is very pricey for your normal bottle of sake. My friend tells me if you go during the weekday before 6pm you get a discount on your meal, so that's a plus. Again I would lean toward Mum's instead. The only advantage is you do get your very own hot pot rather than sharing it with someone else.", 
    "review_date": "2008-09-17"
  }, 
  "n4Xrwlwh2gj6qgUDAcDZCA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jodie C.", 
    "review_text": "I LOVED this place.  I have been to a couple of other shabu shabu restaurants, but this one definitely takes the cake.  Why?  Because you get your own hot plate, with your own boiling pot and your own cooking utensils and your own dipping sauces.    I love my husband to death, but sometimes I don't want to share.   He ordered the seafood and steak shabu and i got the chicken shabu and we shared that.  The food was MUCH!  Aside from the meat, we got scallops, fish, shrimp, squid, two types of noodles and tons of veggies.    We ate for an hour and we were stuffed!  Good eats, very clean, attentive staff and a fun experience.", 
    "review_date": "2006-08-08"
  }, 
  "rUogQgFEhid8om3oDomeKg": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Nicholas N.", 
    "review_text": "This was the first time I've ever had Shabu Shabu so I have no basis for comparison.  Keep that in mind.  Ladyhawk and I went here just after moving in to our place because we still hadn't (haven't actually) bought groceries and we were starving.    Awesome thing number 1 = Everyone gets there own hot plate and broth.  Totally radical.  Awesome thing number 2 = The beef/chicken shabu shabu was delicious.  The meat was tender and the dipping sauces were very tasty.  My favorite was the spicy dipping sauce, but the sesame was also very good.  Awesome thing number 3 = They played a killer soundtrack of background music.  I really can't describe it and I'd never heard it before, but it was totally fresh.  All in all, I suspect this place is just average as a shabu shabu joint, but since I have no comparison, I give it 4 stars.  I liked it and the food was tasty.", 
    "review_date": "2010-05-05"
  }, 
  "eu19K9KfnvvubzWuv4l6Wg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lauren F.", 
    "review_text": "First of all...our service was perfect.  All this huhah about bad service.  Its shabu shabu.  You cook your OWN food.  They brought us our food to cook quickly.  They even skimmed the water to remove the stuff off the top.  The rest...was up to us.   Swishing the beef to cook it quickly.  Dropping the lobster balls into the water to let em cook for 5 minutes.  It was all up to us.  Didn't even know lobsters had balls didja?    The entrees are basic.  If you go with more than one person, i suggest share with your sweetie.  Share two dishes....we had one chicken/beef and one seafood.  Glorious way to get a bit of everything.  We had a large hot sake too.  Seriously...they let you sauce it up with with choices of dip, and give you a frickin salad bar full of veggies.  Thumbs up to shabu shabu!", 
    "review_date": "2008-03-09"
  }, 
  "8mlKio94vJIFp5mR-lR5Bg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sweet P.", 
    "review_text": "Nothing special about this place.  The food is average.  I can make this at home.  I doubt I will ever go back to this place.", 
    "review_date": "2007-04-18"
  }, 
  "t-JbFC1Oxg5Eqxuek8H_0Q": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Tiffany M.", 
    "review_text": "$35 for all you can eat/drink special. EH. The think sliced beef and veggies were not that impressive.  The drinks was nice, but that night I wasn't really feeling it. Its just hard to refuse service, especially if you came from the East Bay for a friends birthday.", 
    "review_date": "2011-10-24"
  }, 
  "WM-yXO56qcnJUcPPNRIDVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis P.", 
    "review_text": "Yoooo I have no complaints. No frill no bs you walk in and leave happy w a mega grown food baby.  +you get your own pot +better price than any other shabu places +MUCH food  +not crowded  -sauces aren't the best, yes it's watered down but I can deal w that. If you can't... You're gonna miss out on all the awesome things this laid back shabu place has to offer.  I was craving shabu on the way home and it was totally chill to just walk in and sit by myself and have a giant feast at the bar with my very own pot.  Much kudos. Such satisfy.", 
    "review_date": "2014-02-02"
  }, 
  "uo-6DBzvLzL-DDxvF0zYSQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bert C.", 
    "review_text": "Un-happy Shabu Shabu. Maybe the economy is tough right now. That's still no excuse to lie to your customers, serve sub-par meat, or water down your sauce.  1) Their menu says clearly: birthdays free for parties of 4 or more. We tell them it's my birthday at the beginning of the meal, at the end of the meal they card me to confirm, then when the check comes out they say, \"Sorry we changed that to parties of 6 or more\". I didn't even get the overpriced All-you-can-eat.   It's not about the money, it's the principle. Don't advertise and sell something to your customers, then change it up at the end of the meal. It says something about the place. What else are they skimping on?  2) The quality of the food is mediocre at best. The sesame sauce is strangely bitter, not sweet enough, and very watered down. The ponzu sauce is passable. The meat is sliced too thin and not very marbled so it ends up tough and tasteless. The vegetables are fine. Garlic is chopped up in huge chunks that are way too big.  I'm a shabu-shabu aficionado. It's my favorite food in the world. I'd give this place a 4 out of 10.", 
    "review_date": "2010-03-11"
  }, 
  "r8YrTMjERM32vGUHfAw6Zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy L.", 
    "review_text": "The owner is super nice", 
    "review_date": "2011-11-29"
  }, 
  "SNAjkVZK-J7FzQMDfNLD6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janny S.", 
    "review_text": "I love how the Shabu tables are set up.  They're so efficient and easy for the waiters to get in and out to refill our meat plates.  I came here on one of my friend's birthday.  They were able to seat 35 people!  It was a lot of fun because we got the all you can eat deal for 30 bucks a pop.  Some people got all you can eat and drink for $45.  I think its a good deal.  They were quick to refill our meat every time we chanted \"MORE MEAT, MORE MEAT\".  I love that they provided 3 kinds of dipping sauce so I don't get bored of eating the same meat.  Yum. Meat.", 
    "review_date": "2010-04-17"
  }, 
  "pauOTA3dvD944S6IhDAiBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael C.", 
    "review_text": "I've eaten here several times before and I always come away satisfied. Shabu Shabu is always fresh and good for you and you really can manage how your broth and food comes out. With that said there's not a lot that has to be done except provide a good amount of food for a good price for the customer, which I think this place does.  I like the decor of the place and I think there's a nice spacing to the place if you come here on a date and just want to talk to the person next to you. But if you have a party of 4 or larger it becomes weird if you don't have one of the two middle long tables.   My one concern is, why on earth does the men's bathroom have a mirror that is positioned only around your groinal region?!?", 
    "review_date": "2010-05-07"
  }, 
  "bAnzGRGuXxtiL-RTsb98pQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael K.", 
    "review_text": "It looks pretty cute, neat and all. Every person eats here get your own individual pot. However, the service is extremely slow. It's a family-owned restaurant. All they got like 4 people working here(?). I felt sorry for the lady who ended up doing all the work at the front end. Then, there was a guy helping her but he didn't speak English. We didn't have a good experience here. First, the service was so slow we had to get the food from the counter ourselves. Second, if you don't have enough people to serve all the available pots, then you should make shabu-shabu a group sharing experience. A big group can share 1 pot? Maybe Korean has its own style. I have no idea. But it's a waste of space. I didn't quite enjoy it. I think everybody comes to shabu shabu is to have fun with a group of friends. I felt separated by the seating.", 
    "review_date": "2008-02-27"
  }, 
  "QaMPU1xJQaWp5TuxoUE4og": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin M.", 
    "review_text": "do you like beef? do you like vegetables? do you like throwing a bunch of stuff in a bowl and then covering it in tasty sauces?   If you have answered yes to one or more of these, then happy shabu shabu will blow your freaking head off. Its really expensive, and most of the time there are some really lame tools there, but the sweet taste of beef makes it all worth it.   located in hilarious japan town", 
    "review_date": "2008-04-18"
  }, 
  "OlElQy5Cpe076eenlqEsbA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michelle N.", 
    "review_text": "I had better...  I like the fact that this place gives a stove or pot to each person. Places I've been to only gives one per table. For $15-25 depending on what type of protein you want is kindof expensive. There's definitely plAces that you can pay that much for all you can eat.  Soup was ok.. Only one type which was pretty lame. We ordered a side of dumplings and I didn't really like it. Definitely not the typical Chinese restaurant dumpling so be aware!! Overall, I would come again, but if someone else reallllly wanted to eat there.   Service was good. Just food wise isn't my taste.", 
    "review_date": "2012-11-03"
  }, 
  "RBcEDB9DZ2OHMs8WFeS_Vw": {
    "user_rating": 1.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Sean E.", 
    "review_text": "WORST SERVICE EVER.  The food is decent, but service is key to me.  If you have friends that dont drink, this is not the place for you.  They force you ALL to get the All you can eat and drink even if some if your party dont drink.  I walked out.  See ya later.", 
    "review_date": "2011-05-29"
  }, 
  "g6MXRfTylqxlhXzaN3X9BQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassondra G.", 
    "review_text": "The service here is HORRIBLE. The waitress is super rude and didn't even seat us when my friend and I came , so we sat ourselves . Next when we were at the table , the server didn't bring us any menus or water . Waited for like 15 mins and then she finally notices us. Funny thing is, it wasn't even busy! Next while waiting for our food she totally forgets our order and on top of that forgets to bring out my friends soup... And it doesn't stop there , we wanted rice and tried flagging her down numerous times .. But it was so hard to get ahold of her I just has to walk up to her and ask. Last but not least, she never checked up on us, never refilled our soup or gave us napkins. Idk if it was because she coincidently just never noticed us or was just ignoring us on purpose. Besides the abysmal service , food was okay .   Very limited options. Only one broth to choose from which is the miso , small variety of veggies , more on the pricey side .. No ice cream.. Eh I just wouldn't come back here again. Not only was it nothing special but the service was just horrible.", 
    "review_date": "2014-11-11"
  }, 
  "uN0c4yh-biPeL15L-kvuKg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasmine F.", 
    "review_text": "Say, 3.5 stars. I was pretty happy with happy shabu shabu...happy, happy, if you will. There are a couple of negative things that bring the score down: for one, the cold (literally...BRRR!) and sterile atmosphere. And while we're on the topic of sterile, how about the overwhelming odor of lysol that was eminating from the bathroom that they decided to scrub down 2/3 of the way through our meal. The bathroom was already pretty damn sparkly before that. I also encountered an odd, unplacable odor when I first entered.  Ah, well. The people that work there are EXTREMELY nice and attentive. It's BYOB--which I don't necessarily prefer, but it was nice to save some money on a night out for once--and they even provided an ice bucket for the bottle of champagne I brought (WARNING: there are no bottle openers or corkscrews of any kind at the establishment). Also, you don't have to hide your booze as you do at some other BYO estabs. I dig the individual hot pots, and the veggies, dips, and broth flavorings (fresh chopped garlic &amp; onions + miso) were spot on. The beef was nothing special--it was still slightly frozen when they brought it out and wasn't as high in quality as Mum's--but it tasted just fine when cooked. Overall, I prefer Mum's and the $35 all you can eat and drink special, but happy shabu shabu got the job done during Mum's remodling closure.", 
    "review_date": "2007-01-29"
  }, 
  "1Ky883b87muXYlzlBpepgg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy T.", 
    "review_text": "I loveeeee this place. All-you-can-eat shabu for $23!! I think I'm in loveee.  -The beef is awesome. The meat on your plate is nice and folded. It makes it super easy to pick up with your chopsticks.  -I love the brown sauce. -All the servers there are great. But that one night, a waitress kept forgetting some of our stuff (ie: soda, more meat, tea etc). Not a biggie though. She was really nice.   Bottom line is that I will come back for more shabu!", 
    "review_date": "2010-03-30"
  }, 
  "40zXoQtXLOW2u51_AgFCng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C S.", 
    "review_text": "We were craving Shabu Shabu Sunday night around 8pm and drove out to Shabu House, but they had a 1.5 hour wait for a party of four. We were starving and couldn't wait so we phone Happy Shabu Shabu to see if there was a wait for a party of four (which there wasn't). When we arrived, the waitress had already set up our table for us.  I received a copious amount of tea and food with the beef plate (about $15). Tons of delicious veggies and noodles, three dipping sauces, and beef with delicious miso broth. We had to ask for the rice, which was about average.  Excellent service and friendly staff!! Lots of food for the price. Although it's no Shabu House, it's a great alternative to avoid a long line.", 
    "review_date": "2011-06-20"
  }, 
  "wLmC5ODK1dqFhmj1gD-tTQ": {
    "user_rating": 3.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Sarah P.", 
    "review_text": "My boyfriend and I were mesmerized by the ALL YOU CAN EAT option here when we were in SF and had to stop by for dinner.  It's about $22 per person for the all you can eat food only but if you want the drink &amp; food combo then it's about $34!  You get a choice of either beef or chicken for the AYCE and another plate full of noodles and veggies like napa cabbage, bok choy, carrots, and tofu.   However, the sauces were a little lame, the peanut sauce was watered down and the ponzu sauce tasted too much like alcohol, like they mixed it with too much sake. So i created my own by mixing the watered down peanut sauce and the spicy sauce, which was good by the way!  I would have given this place perhaps 2 stars but because of the AYCE option, I opted for the 3. Although the service was good when it was given, it was hard to get the attention of the worker since he seemed to be always hiding in the back coming out occasionally to greet new customers or fill water for another large table.   In the end, my boyfriend and I both had three plates of beef each so I would say we both got our money's worth, haha!  **You get your own hot pot, that's a plus!", 
    "review_date": "2012-09-04"
  }, 
  "tGkfSO_bRpXsSI1JYv1wQQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy T.", 
    "review_text": "Outside of Japan, I have only been to one other shabu shabu restaurant and it was ok. The other night I decided that shabu shabu (and all you can drink) sounded like a great idea and some Yelp results gave me Happy Shabu Shabu.  The fun started out with wandering around the Fillmore area in chilling winds trying to find where the hell this restaurant was. Google Maps showed it IN the Safeway mall. This is a lie. It is ON Fillmore, across the street from the Safeway mall.  When we got there at 9pm on a Saturday evening, it was surprisingly empty. There were maybe 4-5 other customers and another set of 2 walked in behind us. We were seated and the 2 girls behind us got seated.. across from us. At first I was wary because the table had a 1 ft gap between us and the girls and I thought I'd be annoyed at having to listen to them, but I couldn't hear them at all. Good for me, but I can see how a party of 4 would complain about that seating arrangement, as I read in other reviews.  Service was really attentive - our veggie and beef plates came soon after we ordered. Sapporo came in a pitcher and each of us got our own sake. The waitress was quick to come back when our plates/cups/soup looked low and even though we had finished eating and were finishing up a second pitcher, we didn't feel rushed by the staff to leave :)  The beef itself is fine. it's not kobe beef, it's not awful fatty, either. You can ask the waitress to customize your veggie/noodle platter to your liking. The soup looked like miso, but wasn't.  Curiosity: after the first pitcher of beer and sake I wandered to the restroom. While washing my hands, I noticed they had two mirrors - one at eye level for normal sized people like you and me, and one at crotch level. I'm going to assume this isn't a crotch mirror - instead, I'll think that it is a mirror for handicapped (or small Asian) people. All-you-can-drink makes you think a lot about stuff like that.  Tip: put loads of garlic and green onion in your soup in the beginning to start making it flavorful!", 
    "review_date": "2009-04-28"
  }, 
  "b_gVqX6Wi7HwsRT8aCzcQw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "farah b.", 
    "review_text": "Went here sat night for a friends bday! We had about 22 people-the place fit us all- 3 sauces beef and chicken all u can eat with tons of veggies!!!!!!yummy Sake all the time-the manager was amazing kept my booze coming all night :) Super friendly well staffed-clean Sapporo on tap for all you can drink-seriously it doesnt get better then that", 
    "review_date": "2011-04-18"
  }, 
  "UyhnjAlyMXtbR-qB5kkhlQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean Y.", 
    "review_text": "One-line summary: There are better shabu shabu places in SF. My bf and I prefer Shabu House in the Richmond, although it's less conveniently located.   Minuses * We came with a group of 14 people. One of my friends made a reservation a day in advance. The morning of our reservation, we were told our reservation would have to be pushed back. When we arrived for our late dinner, we still had to wait for over 45 minutes, because a group of loud, drunk Asians were taking their sweet time paying and TAKING PICTURES. They weren't even eating at this point, so the staff really should have politely asked them to clear out rather than keeping us waiting for so long.  * Bad layout. The two people on the innermost ends of the table sat facing large pillars and couldn't see across to the other side without leaning sideways. Awkward!  * The broth wasn't very flavorful. We threw in a lot of hot sauce and chili peppers to give it a boost. The refills diluted the broth even more.  * Two people to a pot. Not a great arrangement if anybody in the group has dietary restrictions.  Pluses * Our waitress was great. She was funny and quick and remained a couple of steps ahead of us by proactively asking if we wanted more plates of meat or vegetables. * The owner (I think) came out halfway through our meal. He seemed drunk and stood between our two tables, babbling and pouring us strong Chinese liquor for free. Quite entertaining.  Other Notes  * Restaurant enforces a fairly standard policy of not allowing only part of the group to order all-you-can-eat, although they were flexible about allowing half the group to order all-you-can-drink. Unfortunately, we had to fight pretty hard for the single vegetarian in the group to pay the vegetarian shabu shabu price. She had to vehemently swear she wouldn't eat any of the meat. Shabu shabu places I've been to with better service are usually generous about giving discounts to vegetarians, especially when only one person in the group claims to be one. * The selection of meats, vegetables, and dipping sauces is pretty standard.", 
    "review_date": "2010-08-03"
  }, 
  "UrcANjPnEtG4G2R6Q3751g": {
    "user_rating": 3.0, 
    "user_location": "Larkspur, CA", 
    "user_name": "Lonnie T.", 
    "review_text": "All you can eat and drink with your friends, birthday person free, yes however they only limit 2 bottles of sake at a time!? seriously thats damn lame, I told the waiter well then you'll be visitng me often, yet on my birthday I didnt really get enough sake bombs. Plus they took away my food before I had a chance to eat it.  I had to constantly nag them to fill up my sake bottle.  Chicken shabu was too bland, steak was allright, its good, only one I would order again. Need to go extremely early to really take advantage of that all you can drink and demand more bottles and pitchers or they're not going to be any good.", 
    "review_date": "2012-07-25"
  }, 
  "f_m10EDr38lMqprr7szNZw": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Myra G.", 
    "review_text": "I am a fan of Shabu Shabu and had only been to one other restaurant.  My friends and I came to this place because it was my friend's bday.    Free birthday dinner, all you can eat AND drink! The food is great! A good assortment of veggies &amp; the beef was prepared nicely.  I wouldn't recommend the chicken, not a favorite.  The employees are attentive, they'll even drink with you and of course encourage you to drink more...why not, all you can drink!  Overall, a great way to start the night off with some friends, good food, &amp; many, many sake bombs!", 
    "review_date": "2009-05-31"
  }, 
  "N2d-MaYCz1xDSa94NHt4cg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Stephanie H.", 
    "review_text": "Eat, drink, and be merry! Probably the line this shabu house was founded on! After a long day of touring San Francisco, we were hungry and cold (went up around New Years).  Thanks to Yelp!, we were able to satisfy our tummies with a warm meal of shabu shabu.    We got one order of the ayce and one regular order of beef shabu which was enough to fill me up.  But really, all you can eat AND drink?  So-Cal definitely needs a shabu house like this!", 
    "review_date": "2010-08-24"
  }, 
  "PdSHsYra31zH3fAcE-XAUQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly L.", 
    "review_text": "I like how previous reviews think of this place as a Japanese or Korean place, but it's clearly Chinese.  Although it's situated in Japantown across the street from several Korean bars, it's obviously owned and operated by a Chinese family.  They age their beef for 23 days and it's very soft and tender, but it's for hotpot so it doesn't really matter....it's gonna be dumped in boiling hot water anyways.  The waitress was pretty hot though and if I go there again, it'll be because of her and not the food.", 
    "review_date": "2007-08-08"
  }, 
  "8p-kv82J5uP3583thTPa4Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "I gave this restraunt 4 stars because it had great service, all staff was very attentive. 2 waitresses plus the owner came out to replace my meat tray every once in a while. If you didn't know this is all you can eat shabu shabu for 22 bucks, or 35 for all you can drink too.   The 3 stars for the food which the beef has a leaner quality compared to that of mum's which means that its less fatty/less marbled. Meat is still good by all means, and the facilities look much better and are much cleaner.", 
    "review_date": "2008-02-17"
  }, 
  "inz8izVu0oSGeJJdY32zYA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina L.", 
    "review_text": "Eh. . . really not so great.  Yes, the meat was fresh, but the pot was plain old hot water, not broth of any kind.  Plus, the sauces were mediocre.  In fact, only the hot sauce was worthy of my mouth, tongue, and stomach.  The sesame peanut sauce was not peanuty enough.  The ponzu sauce was blah!  What I really disliked, however, was the way they're set up.  Each person gets their own pot, so it's not as intimate as it is as at a lot of other places.  Also, if you have a party of 4 and sit at the table, there's a 2 foot gap between your tables.  I guess if you are germaphobic this place might be good.  But, shabu shabu is about sharing or so I thought!", 
    "review_date": "2008-10-25"
  }, 
  "qUJmdUBUXEy7_73Ie_CWrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sydney L.", 
    "review_text": "the beef shabu shabu is thinly sliced and taste great!  the only thing is, since everyone has their own pot, you sit further away from your friends and it's not as easy to talk.    Extremely yummy noodle served with your order of meat.", 
    "review_date": "2008-04-28"
  }, 
  "gk5BjGoT--YRci9ZJ_WElQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eileen L.", 
    "review_text": "I just came here yesterday and I love this place !! This place is kind of hidden because the trees are blocking the sign .. you don't really notice the exsistence of this place . I thought it was a cafe at first lol I was suprised that it was a shabu shabu .  All-you-can-eat for about $22 which is pretty affordable and your money's worth if you ask me . The beef was good . Didn't really like the chicken though .. because it was chicken breast . The noodles and rice were pretty good as well . They give you a side of kimchee as well . The dipping sauces were really good esp. the red one . This place is pretty clean too and the coolest thing is that everyone gets their own pot !! The dessert was just perfect to top it all off . Not too sweet but just enough to hit the spot . It was fresh watermelon and honeydew juice with tapioca . The service was just amazing .. very friendly people . They  stop by every now and then to remove the stuff on top of the boiling water and to ask if you need more beef , dipping sauces , etc. The owner or whoever it was even asked us at the end of our meal if there was anything they can improve on . We told him we didn't like the chicken and he put in consideration of using black meat instead of using white meat meaning meat from the thigh and other parts of the chicken instead of chicken breast . They close at 10 but we stayed until 10:30ish which was when they were cleaning up and everything . They didn't try to rush us to finish or pay the bill . Their service was still just as good as it was at first . I give them props for that because usually people make you pay and leave . This is now my favorite shabu shabu joint and I must admit this place really suprised me .. it was more than I expected . I'm definitely coming back again !", 
    "review_date": "2008-03-23"
  }, 
  "TSs6cGV6N1EAWb5ovnKLPg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike N.", 
    "review_text": "not-so-happy shady shady is more like it!  stay with me, i promise you this won't be JUST an angry rant on the horrible and unprofessional customer service here. before coming in here last night, i called to make a reservation for two. they said they only accomodated reservations for parties of 3 or more. okay, understandable.  so thinking that it'd be busy (and because i wanted to be a gentleman and not have my date to wait outside in the cold in the case that it WAS busy),  i made the reservation anyways, saying that i would get another person to make it a party of 3.  we showed up for the reservation and to my surprise NO ONE was there. well, i lied. chad michael murray and paris hilton were there with the rest of the cast of the house of wax on the television and jimminy cricket fully orchestrating out-dated k-pop music with his family of crickets. other than them, we were the ONLY customers there.  because i didn't want to make things awkward, i pretended to just be a walk-in customer, and not the intended reservation for 3. the layout is kind of weird. think of the set of iron chef or master chef or any of those cooking competition shows. yeah, the tables were side by side hot pot stations. it felt like i was entering an arena to compete for the next iron or master chef. there were a couple of tables, so naturally i asked the server if we could sit at a table. he looked at me with a blank expression and told me they were for parties of 8 or more. i persitted and asked politely, because you know, they were SO JAM PACKED BUSY... still, no go. we were ushed to THE BAR. THE. BAR. i let it go, and we sat at the bar.  i ordered the all you can eat ($24/person) and a large sake and sapporo. the sake and beer, you really can't mess that up. the food itself, decent. all you can eat comes with beef, chicken, and veggies. the three sauce combo was good; consisted of a paenut based suace, a hot sauce, and a soy/teriyaki sauce. ready for THE RINGER?!? here we go...  ten minutes into sitting down, TWO GIRLS walk in. they asked to sit at a table. you remember the tables for parties of 8 or more i mentioned? yeah those. were they, too, ushered to THE BAR? nooooo, THEY WERE SEATED! oooooh, child. boy was lucky i was on a date, otherwise all hell was going to break loose.  besides the awkward layout and the fact that we were ushered to THE BAR instead of being seated at a table because we were gay guys on a date and not girls and the fact that i was LIED to, the food was alright.  thank God for my patience and undrestanding for not blowing up in front of my date and ruining the rest of the night.  shout out to the server in th red sweater last night with the poor k-pop harcut, because of YOU, i am NOT coming back. nor should ANYONE ELSE.", 
    "review_date": "2011-12-20"
  }, 
  "AM8mCaiKtiZnM2N2qGexpw": {
    "user_rating": 3.0, 
    "user_location": "Havre de Grace, MD", 
    "user_name": "Connor J.", 
    "review_text": "Not great but not awful. Went in with 8 people and though they had a party coming that would force us to move before the 2 hours was up they accommodated nicely with extra beer and sake. Recommended if you're in the area but I wouldn't seek it out", 
    "review_date": "2014-03-05"
  }, 
  "lii0UYXJf_44hJbHtALM3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily H.", 
    "review_text": "I can definitely see where the reviews are going with service, no matter how busy it is they only have one poor guy running around. But honestly, you should lower your expectations for service at asian restaurants. Pho? Sucks. Real Chinese food? Sucks.  What matters is that the food is good.  The food is great and $26 for all you can eat is a deal. Beef is good quality, cut to order and the vegetables are always fresh.The sauces are more watery but the miso soup you cook in is strong  already so I actually think a hotpot style sauce would be too much.", 
    "review_date": "2014-11-10"
  }, 
  "OvEH3jzoSeVv5DxcmP65fg": {
    "user_rating": 2.0, 
    "user_location": "San Gabriel, CA", 
    "user_name": "Daniel F.", 
    "review_text": "Positives:  - Very high-quality beef, at least for the price.  Good marbling. - Happy hour pricing.  It's a decent place to get loaded with a large group of people. - A good dining spot after concerts at the Fillmore.  Negatives:  - The dipping sauces are awful.  They taste Korean; this isn't shabu shabu. - The seating format is terrible.  Individual burners make conversation impossible. - Attracts \"I'm having my first beer!\" clientele.  Avoid, unless you don't have a better alternative.", 
    "review_date": "2010-11-24"
  }, 
  "6E3qqbyqn7C2sFm_7qa4Gg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen N.", 
    "review_text": "I'm writing this review as I wait for waiter to get me water. This is my third time asking.  We have a party of 16... And all ordered AYCE to make it easy. With that option, you are NOT allowed to order beer on the side unless you wanted to make it AYCD also. What a shady scam! We also checked in on Yelp and asked for our free dumplings, but were told that it cannot be redeemed tonight? What. The. Hell. It didn't say that on the check-in deal just like how it didn't say you couldn't order one glass of beer on the side if you get AYCE. Btw, where is my water?   Food: The broth was bland -- tasted like watered down miso soup. You are basically boiling your food in water and an ishhh ton of MSG. Pork tasted as if it was chopped from a 78 year old dead pig no one remembered to bathe the first 77 years of its life. The scallop wannabe lookalike chicken tasted disgustingly bad like rotten eggs. The only decent thing about this place was their three sauces to dip your smelly food in.  Last, but not least... Where is my water?", 
    "review_date": "2014-12-06"
  }, 
  "g94lYUt_-OVpVTPumC8g9A": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Victoria L.", 
    "review_text": "rude much?  I'm not sure how they even stay in business with service like that.   We came in on a Friday, they sat us at the counter. My bf sat to my right rather than my left, the waitress RUDELY told him to sit on the other side. Geesus lady, you could have asked politely. I was about to walk out then, but my bf was nice about it and moved to the other side.   When she took our order, she was extremely impatient as well. As if our ordering offended her.    While the food tasted okay, I've had better elsewhere, their service for this place is a -10.  Never coming back.", 
    "review_date": "2014-07-14"
  }, 
  "q_cYc9EJN1fzV7zwzc6MkA": {
    "user_rating": 1.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Analisa S.", 
    "review_text": "We've been going here for years. With groups of 10-20 people. We've brought a lot of business to this place and last night was our last time there. Sometime during our loyal years, they instituted a rule that if one person orders all you can eat, then everyone has to. We've adhered to this policy over the years and have remained loyal customers, despite their lack of trust for us. There were only four of us this time, the four people who have brought them a majority of their business through the years. For once, my friend only wanted a vegetarian meal, my husband and her boyfriend wanted all you can eat. We were at the table which was split two and two across from each other, so it would have been obvious if she was snagging pieces. I offered to even just order a beef plate (instead of all you can eat) and sit on the side with her. The tables are considered two separate tables, but the management is so obtuse, we were brought with the excuse they couldn't do that since the order was already put in.  We changed the order, instead of having 3 all you can eat/drinks and a vegetarian, everyone each had a plate and one drink.  Happy Shabu Shabu is going to fail as a business. In a city with great food and better Shabu Shabu places, they just lost an entire large group of people who brought in so many businesses during the years. Business that would come even when their restaurant was empty. We spread the word and had our friends go (even without us) and we are just as easily going to spread the world telling everyone to go elsewhere. Maybe next time the owners give a business a shot, they'll learn to be more customer focused. Especially to those who have showed so much loyalty.", 
    "review_date": "2011-11-05"
  }, 
  "uXR9RFAuCw2uFz04bvgsMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura A.", 
    "review_text": "Good shabu shabu, even if the staff is a little surly.", 
    "review_date": "2012-02-22"
  }, 
  "p2dPm6VUj-zKm_GHXEyB0A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cid T.", 
    "review_text": "I made reservations for a group of 7.  When we got there, we had to wait a long time for 2 customers to clear a table so our group to sit together (you can't move tables around in a shabu shbau place as easily as your typical joint). Also, mind you, the place was more than half empty and the restaurant could have seated them elsewhere. Poor planning.  With that said, the waitress was super nice and food was really good. She helped us mix our sauces and was attentive to the temperature and cleanliness of our pots.    This is a BYOB place but I think they are about to acquire a liquor license. Prices are reasonable, in the $13 range or so. It was a little strange that we were the only ones there on a Sat night, but I would go again.", 
    "review_date": "2007-04-14"
  }, 
  "SjX_4tpusPeZd_5a7txkXQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chanel L.", 
    "review_text": "Been to many shabu houses and *Meh. I've experienced better*.  My friends and I were seated in the back corner and the seating arrangement was a bit weird.  I was facing another table of two and I felt like I was sharing a table with them.  AKWARD!  The soup base is what makes a hot pot restaurant successful.  I love spicy soup base and the soup base here was bland. The owner walked around and asked if everyone was okay and if there was anything he can do; that can make our dining experience *even better*.  Def a great way to network and get peoples opinion, this was actually when Happy Shabu Shabu first opened.    I told him the soup is not spicy enough and if he can make it spicier.  He came back with his own mix of sauce called \"mah lat\" and put it in my soup.  This def spiced up my meal. :)   Nothing really stood out for me to come back and since I checked out this place when it first opened, I wouldn't mind giving this place a second chance.  I will be back to TRY again some day and hopefully bump up the stars on yelp.", 
    "review_date": "2010-07-10"
  }, 
  "Gq0MP4dn2uu7ucEHZpWwxQ": {
    "user_rating": 2.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "We came here for my friends birthday.....  I would have to say there are MANY other shabu places that serve better food, and have way better service!   First of all, if any of your party gets the all you can eat&amp;drink combo, you will have to either choose to not drink at ALL or get the all you can eat&amp;drink combo as well.  I'm not a big drinker, so I wanted to get the large beer with all you can eat food, but unfortunately since some of my party was getting unlimited drinks, I had to either choose to do the same or nothing at all! So I ended up not drinking at all.    Second of all, We had a a lot of left over food! They would'nt provide us a box to take the left overs simply because it was all you can eat.. Therefore, a LARGE plate of food was just put to waste, and thrown away.  Horrible!!!!!!!!", 
    "review_date": "2010-09-16"
  }, 
  "4tMVO9I0esafnY7tj6bpbQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nadine M.", 
    "review_text": "If \"half star\" rating was possible, I would have given this place a two and a half star.  That's because they didn't have ANY high chair for my 20 months old little boy.  This is certainly the first restaurant I've been to, that doesn't carry any high chair (they said that's because the one, and ONLY they had, broke down just a few days ago.  Hmm...)   I would have left the place under this condition, but we had to give this place a shot since other family members were there for a \"family dinner\".  We opted for the \"all you can eat\" choice on the menu  (+): - You have your own cooking pot right in front of you - convenient, practical and personalized. - Beef is good and tasty. - Good variety of vegetables, and noodles on the vegetarian platter - Service is attentive and friendly.  (-): - The sauces are pretty simple, and the peanut sauce tasted quite bland. - After a couple of bites of the chicken, we just  stuck to the beef.  The chicken is really dry and tasteless. - No high chair: Having to eat Shabu with a toddler sitting on your lap makes the whole experience much less enjoyable.", 
    "review_date": "2009-08-19"
  }, 
  "NALHOp0E1RcJSeeklLHacA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Callie O.", 
    "review_text": "Fun for a large group and these people will entertain you. During a birthday our waiter managed to being over fire water to the table (I think he had a little too much himself that night).  Had a lot of fun so the atmosphere is great, however I am not a big fan of filing meat - so for me the food is what is a 3 star experience!", 
    "review_date": "2012-12-18"
  }, 
  "EMJjHTT5e27qCEZC_MKmlw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff P.", 
    "review_text": "I have to laugh as drunken memories of cooking my own food at Happy Shabu Shabu. What interactive fun, and saki bombs go perfectly with endless plates of beef. I would come here every weekend before we go out at night and the food got better with time. Great service, say what up to Jeff for me if you go. Can be a family place as well, All-you-can-eat plates are clutch, and they make it so you almost have to get it because 1 plate alone is 65% of the price. Fresh and Fun.", 
    "review_date": "2009-11-16"
  }, 
  "DV1g380u_FvG6TGRwfhYBg": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Liz M.", 
    "review_text": "I went to Shabu Shabu last night for a friend's birthday party and was disappointed.  The shabu concept is fun, but my experience w/ one of the servers (manager?) at this place ruined the experience for me.   There were nine people in our party - everyone except me and my boyfriend ordered the all you can eat/drink.  After explaining to the waiter (manager?) that we didn't want the all you can eat/drink, he essentially accused of having the intent of ordering the normal meal and then drinking the alcohol of our friends \"on the side.\"  And this was after my boyfriend tried to order his own alcoholic beverage, and was informed that the only way he would be served alcohol is if he ordered the all you can eat/drink.    the food was nothing special.  when the bill came, we asked the waiter to split the bill between all of the people evenly.  Somehow I received a bill that was more than other people's bills (90 bucks!) (and I did not get the all you can eat/drink).  Because it was a friend's birthday, others gave me cash to make up the difference between what I should have paid and what I was charged, and someone else was already in some sort of dispute w/ the manager, I let it go.  Although thinking of it today, I think that it is possible that he charged the party as though my boyfriend and I got the all you can eat, when we did not.  I don't know that for sure though.  I would never go back again.  In addition to the food being nothing special, I felt uncomfortable and unwelcome the whole time.  Also, I wouldn't recommend going here for a group event, because the design and placement of the cooking tables do not allow you to sit close enough to those you are facing to carry on a conversation (without yelling).  Our party was essentially split into two groups, and the birthday person couldn't talk to half of her party.  Bad experience overall.", 
    "review_date": "2010-05-30"
  }, 
  "2EZLYcTrqPC2r3XA1_MWeg": {
    "user_rating": 3.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Cindy A.", 
    "review_text": "It was okay.   I've had better shabu but the beef at this place was nice and fresh.  The tables/shabu pots are arranged pretty far apart so to avoid shouting across the table, we all sat side by side.  I also didn't like it when they shut my pot off kinda early.  I was still cooking stuff.  The food was good though and that 's most important.", 
    "review_date": "2008-08-04"
  }, 
  "CAveDmi9tYg3Gbs9VVnm2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kylie L.", 
    "review_text": "Sarah L. told me something about shabu shabu meaning \"swish swish.\" For beef or whatever, you're not suppose to dump everything into the pot, but swish it while holding your chopstick for a few seconds.  I felt like family coming in here, I think it's a family owned business...not sure. Workers greeted us &amp; they were also nice &amp; attentive.  I'VE ALWAYS WANTED TO COME HERE!!!!!!!!!!! I've walked by once (it wasn't open yet, open at 5pm?) after seeing it on yelp, I never knew where it was located until I went to go sing K, which was across the street.  Today Sarah L., the fam &amp; I went for my popo's birthday. Popo never likes to go to restaurants for her bday, but I guess someone convinced her. I remember wanting to come on my birthday or some other event last year, but I didn't, I don't remember why. I kept this bookmarked since the beginning of the year. I saw pictures on yelp that celebs came here to eat, I wanted to come even more. I found yesterday we were coming here, I was SO EXCITED, couldn't contain my happiness. I have never gone to a restaurant to hot pot with family before, wait...I have, BUT that was years ago.  When you first walk in, there is a bar and to the left of the bar are tables with individual hot pots. Tables had rows of 4? but we sat on the side, so there were rows of 2 &amp; they faced each other.  Pros or con: Seats are in rows/bar/diner-like fashion. I'm all for only having to talk to 2 people (whoever is on my right &amp; left side), because of my anti-social tendencies. In the beginning I was hesitant not sharing a pot, but I ended up liking it. Didn't fight for food, made my VERY OWN soup.  My fav items were the fish ball things with fish eggs (10minutes to cook), thinly sliced beef (the kind you would shabu shabu), mushrooms, squid &amp; mussels were good too. Beef was so red &amp; fresh, it really did look marbled, like this <a href=\"http://www.yelp.com/biz_photos/2Tghf3Jcnr69rWdgljqonQ?select=PEyHADp3nH0pXjTCnI3KjQ\">yelp.com/biz_photos/2Tgh…</a>  Shrimp didn't have shell on the body, just the head, so the heads fell off when you boiled it too long? Suck the shrimp head, yummm <a href=\"http://www.yelp.com/biz_photos/2Tghf3Jcnr69rWdgljqonQ?select=v5N30emxPlwKE8EzWRJalg\">yelp.com/biz_photos/2Tgh…</a>  Cousin only ate beef, his soup was so good, tasted like beef stew.  Sauces were good too, the soy sauce looking one with green onions was probably my fave. Chili on the table if you want it spicy, I can't eat spicy so I couldn't use it.  If you bring kids, make sure you keep an eye on them. I can imagine kids wanting to put stuff in the pot &amp; burning themselves OR asking if their food is ready yet.  Drinking all the hot pot soup always makes me want to pee A LOT, make sure you're always near a toilet after you eat. The restroom was nice, clean &amp; smelled nice. Any restroom like that gets an extra star.  After shabu shabu-ing, with the right people &amp; places to go, it was the perfect Saturday. It felt like I was on summer break, didn't worry about the midterms next week. This should have been my 200th review, owell.", 
    "review_date": "2009-10-18"
  }, 
  "OTWeSSO-ZEx1oVnYEYppyg": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Thomas L.", 
    "review_text": "straight up, the food was ok (since i am from LA and you barely get horrible shabu's there), but why 1 star? because the owner does horrible customer service. doesn't even know how to treat customers right, and maybe thats why he's up north because he knows he's shabu won't survive if he opens it in LA, lol", 
    "review_date": "2011-08-28"
  }, 
  "fndYlWBXCGu1vL5y8-kr4Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tabatha Y.", 
    "review_text": "Lame.  I made a reservation for 8 over a month ago for my friend's bachelorette party.  They call me the night before to confirm.  I call back the next morning and am told that they gave our table away to another guy because I didn't answer when the restaurant called me the night before.  Huh?  What kind of procedure is this?  They offered to seat us at the bar...8 people...all in one row.  Wow, how accommodating right?    So, thinking about celebrating an occasion with a large group and want to book somewhere in advance?  Don't call this place.  They will kindly take your reservation and then not honor it...f-ing up your plans.   Thanks a lot.  You should take the Happy out of your name and rename yourself Unreliable and Rude Shabu Shabu.  A-holes.", 
    "review_date": "2010-03-19"
  }, 
  "VjUuaL2A0QwrRZ8hDdFf7Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josie M.", 
    "review_text": "yes, i know that all those little bottles are for seasoning the broth, but i didn't pay good money to cook absolutely everything!  i should at least have a base to start with! (see review for shabu house)  the seating is awkward - not recommended for large groups.  i thought the food was ok, but 2 of my friends got tummy aches!", 
    "review_date": "2008-10-14"
  }, 
  "VGqczSrHQY5FAGhuPc8EXg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Eric K.", 
    "review_text": "Not really impressed by the food. The beef's not so fresh, the soup base's just water.  The staff are friendly and attentive. But that's just about it for this restaurant.", 
    "review_date": "2008-09-21"
  }, 
  "6XbiHmXB3oxBQIztMRMB7Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Pikachu P.", 
    "review_text": "We went here long time ago. Their shabu-shabu was pretty good too but we don't really come back here since shabuway is in town now.", 
    "review_date": "2012-11-24"
  }, 
  "7i2JyM5gVZnXtsgb7zCdtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simon S.", 
    "review_text": "Finally! I get to Shabu.   First of all, this place is small. A max capacity of maybe 30 customers.   Second, the seating is weird. We sat at a table for 4 that had a walk way inbetween. To converse we had to yell across the table. This is mainly due to the individual hot pots.   We ordered the All you can eat and drink option. Unlimited Beef or chicken, Asahi, Sapporo, and hot Sake.   The soup base, well, I don't really recall what the ingredients were. But, I saw the waiter dump some yellowish base into the water. You can add your own green onions and/or garlic.   The beef was well marbled and looked in good quality. Much better than the beef I got at Little Sheep. I did not order any chicken, but why? I eat chicken everyday. They also include a vegetable and noodle plate which consisted of cabbage, mushroom, and glass noodles. Dip with the 3 sauces if you like.   The beer and sake really filled me up and gave me a good buzz. Perfect because we were planning to head over to the Sens club venue after. I love going to a club smelling like beef. mmmm. The girls dig it. ;p   The servers were not as attentive as we would have liked. Our beer glasses were constantly empty. Maybe if they hired more than 2 servers?   Now I need to try Shabu house, but they are always packed to max capacity. Someday... :(  Price:39.99 pp", 
    "review_date": "2009-02-04"
  }, 
  "3PtaX4yUBsZs8sQs_fH1CQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica M.", 
    "review_text": "Good shabu Shabu.  Would repeat.  Great price - large portions.  GREAT sauce (recommend mixing them for different flavors)", 
    "review_date": "2009-12-22"
  }, 
  "tvjL4BErlkBNsSyLjkEzFg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew P.", 
    "review_text": "Despite the 3-star review, I really did enjoy eating here.  There was no wait, the place was clean, and it wasn't crammed in with stools and chairs like most shabu shabu houses.  A word about the service, there were two servers - one was friendly, efficient, and eager, while the other was... not.  But the good thing about shabu shabu is that the service has less impact on the quality of your meal.  If you see other reviews that comment on the service, just consider that I had one that acted as though she owned the place (in a good way), while the other acted like her mom owned the place (i.e. she was forced to work and couldn't care less).  It's good to know that when I want shabu shabu but don't have time to wait at other places like Shabu House, that there's always an option.  It's like if you really, really want Zachary's Pizza, but decide that that line is too long, so you go to the Round Table across the street.  Sometimes that's OK (and sometimes it's not).  PROS: - No wait, plenty of seating - Clean, great vegetables (and noodles are included)  CONS: - Dipping sauces weren't the best - Broth wasn't flavorful", 
    "review_date": "2009-08-30"
  }, 
  "jblrwi7sij21ZV8mUNHRSw": {
    "user_rating": 3.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Ryan D.", 
    "review_text": "For all you all-you-can-eat &amp; all-you-can-drink shabu shabu lovers, I heard that this place is better than my all-time fave, Cafe Mums.  So, I gave in to the hype and finally tried it on Tuesday.  It was pretty good, but I can't say that this is better w/ a straight face.    I don't think you can truly compare Happy with Cafe Mums.  Happy has more of a Korean influence, where Mums tends to be traditional Japanese.  Both of them have the same all-you-can-eat &amp; all-you-can drink deal for similar prices.  However, Happy does have alternatives to the beef of chicken or seafood.  Their dipping sauces are also a little bit different than the ponzu and peanut-based sauce at Mums, but they also have a spicy &amp; sour 3rd dipping sauce.  Last but least, we had a Korean dessert of pureed watermelon, which was actually a little too green.  I prefer the selection of ice creams at Mums, especially the Green Tea.    Feel free to try it for yourself, but most of the Mums faithful will probably agree w/ me.  Enjoy!", 
    "review_date": "2008-01-18"
  }, 
  "0ximOW5EKh12QqTPfAYXJQ": {
    "user_rating": 4.0, 
    "user_location": "West Covina, CA", 
    "user_name": "Gloria C.", 
    "review_text": "Don't come here for the AYCE, come here for the AYCDRANK!!  The couple times I've come here, it's always been a good time.  The seats are sort of far from each other so with a group of 8, you may have to sit 4 and 4 with bar seating facing each other. You get your own pot, service is mediocre but they let you run free with you AYCE/D.  You can get out of your seat, mingle with your friends, be as obnoxious as you want and they won't kick you out.  It's shabu-tastic!  Also, the owner seems to love groups who come to his restaurant for drunken celebration and warning, he will try to drink with you!  He will offer you what my friends and I call \"fire water.\" It comes in a unlabeled glass bottle and is a clear liquid that smells like rubbing alcohol. It is very strong, burns anything it touches and may actually kill you if you drink enough of it.  Ok, I made the last part up.   But I have had friends take shots of this fire water with the owner and end up really sick in the bathroom and outside the restaurant. Boo. Honestly, the food and service both are not great. They never refill your soup if you ask, and take forever to bring out more meat, but they will provide plenty of sake.", 
    "review_date": "2012-04-15"
  }, 
  "fTV_ERFkyHXRNRG3fnsBiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn N.", 
    "review_text": "I love this place! I went here for the first time last week with a friend and it was perfect. We each got the $23.95 AYCE Beef, Chicken and Veggies. I think it was like $34.95 with the alcohol and soda. The beef was bomb. My friend had a total of 3 plates of it and I only had one. I didn't like the peanut sauce, but the other 2 were BOMB so I could overlook that! Besides, I'm not a peanut sauce fan.  I'm looking for others to dine with me. Looking forward to visiting this place again!", 
    "review_date": "2013-02-02"
  }, 
  "vll5y3X-Jxk4aNYyYFS8xA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex H.", 
    "review_text": "Came here the evening of Valentines day with a party of 4. The venue was a lot smaller then anticipated but we were seated right away even when our entire party wasn't present yet, and my original reservation was for only 2. (You would think all restaurants would be packed for Valentines day evening, but not Happy Shabu Shabu).   Every person gets their own boiling pot, but the seating arrangement was quite disappointing. Our party of 4 had to sit in one row facing another party of strangers. The only people that could really converse are the two sitting in the middle of the table, but good luck trying to talk to the person at the far end.   I believe their popular option is the \"all you can eat all you can drink\" for $34.99. One member of our party did get this and they were quite consistent in bringing him more plates of meat and refilling his beer. They also have a \"all you can eat\" option for those less alcoholics in mind.  I decided to get the half beef half chicken option for $14.99. They bring you a plate of meat and a plate of vegetables. I kept forgetting the water is boiling hot and trying to stick burning hot vegetables in my mouth wasn't the smartest idea. In my opinion, the beef tasted way better than the chicken, even when I usually prefer chicken in other scenarios. After being cooked, the chicken tasted very hard and dry. The beef was softer and carried a bit more flavor. The sauces provided where not the greatest, especially the peanut butter flavored one.  In conclusion, this place is great if you want to eat as much and/or drink as much as you want for a set price, but don't care too much to converse with your party because you will not be facing them. It seemed to work out great for the people who just sat there and ate and drink without talking to their dates! The prices are a little higher compared to other Shabu restaurants in the city, so choose wisely before settling.", 
    "review_date": "2009-02-20"
  }, 
  "0mOb1_pmBlV1a85lfkqCCg": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Philip M.", 
    "review_text": "Come to this place for the all you can eat and drink only if you have nothing to do the next day because you will be hurting. They don't slow play you at all with the beers and if you strike up a conversation with your server they will give you all the fire water you want. Sauces could be more flavorful but overall the food is good.  I have read reviews complaining about the service. These servers have personality and take it just as good as they give it. They are having fun and some of the up tight patrons need to loosen up and have a good time with them. If you are going to place that is all you can eat and drink what are you expecting service wise? This is a place to have fun not show how pretentious you are.", 
    "review_date": "2012-10-13"
  }, 
  "ZNfxtYQRvOc4pErDSEF8Vw": {
    "user_rating": 3.0, 
    "user_location": "Hoboken, NJ", 
    "user_name": "Michael C.", 
    "review_text": "Me and Shabu Shabu were made for each other.  This was my first experience with shabu shabu, and holy cow is that a lot of food.  I'm a big eater but that was ridiculous.  It was $35 for AYCE and DRINK (beer and sake).  Like some others on here said, the broth isn't special and you have throw most of your \"fix-ins\" to get any flavor out of it, but the meat and the vegetables are fresh.  The service was pretty good (though it was mostly empty that night) and they didn't mind when I asked for the next plate to be all of a specific vegetable, or all chicken, or all beef (it was a long night).   I probably wouldn't come back here, but I'm definitely checking out the next shabu shabu place I can find.", 
    "review_date": "2012-05-30"
  }, 
  "5KtOX6QV5Wxcd2onINvzxw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine O.", 
    "review_text": "We went here for the fiance's birthday dinner.  It started as a party of 12 and ended up a party of 6.  They set up a table at the back of the restaurant for us - we sat 3 and 3.  Just a note for large parties, there's usually an uneven number of seats on each side.  It was great though - we could still hear each other talk across the cooktop tables.    I like the fact that they put spices in your cooking pot.  You can get your meal cooked as mild or spicy as you'd like.  The food is cheap - $15 for beef or chicken, $25 for seafood, and they have all you can eat and drink for $35.  Can't beat that!  I ordered the beef and chicken, it was plenty of food for me.  You get a healthy serving of beef and chicken, a plate full of veggies, tofu and two kinds of noodles, three dipping sauces (the spicy one was the best) and rice (I finished two bowls.)  A note on the owner/manager/guy that was there - we'd like to call him \"Stan\" because he reminded us of our friend.  He was awesome!  He's who I talked to when I called to make the reservation.  He was really easy to work with and told me I could bring a cake in and they would serve it.  When I got there, he moved us to the back table because there was only six of us.  He gave my fiance a free beer and took shots of sake with us.  Talk about hospitality!  He let me go in the back to get the cake and convinced me to put 30 plus candles on the cake and helped me light them, and then helped me serve it to our guests.  I appreciate the extra mile of service and can't wait to go back to hang out with \"Stan.\"  Overall a great experience.  We were full afterwards.", 
    "review_date": "2009-04-22"
  }, 
  "LnZUtFx6qTWs8NV6lAARxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "Hands down! This is my new favorite! The food is here is so super fresh and of such high quality. The service is very warm and welcoming. I must warn you though, the rule is that each person must order for themselves here. No sharing! (Hence, the removal of a star.) The portions are GINORMOUS and both my friend and I couldn't finish. It was a great meal!", 
    "review_date": "2006-09-11"
  }, 
  "p6nBKyT9Y_pFJ1WxVEowwA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Andrew Y.", 
    "review_text": "Recipe for disaster...but a good disaster. One part AYCE, one part AYCD. $35, 2 hours. If at all you are able, control yourself. To be honest, I had no idea this was going to be AYCD so when I found out...the game was on. If you were like me, you began 'shooting' the carafe of warm sake. May not want to do this right away. And if you're really good, the strong stuff might come out. Don't do more than 3...unless you think you might be strong enough to stand in front of a bus. All the staff was nice for our group of 14.", 
    "review_date": "2011-07-26"
  }, 
  "zk7fXC5RFGiBMCnym6ihng": {
    "user_rating": 5.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Charlie A.", 
    "review_text": "This is my 3rd time coming to this place.. and every time its been thaaaaa bommmmmmb!! $35 all you can eat and drink. That just means alllllll youu cannn parrrrrty!!! All three times were for birthday parties.. They are really good with accommodating big parties.. Service was great, food and drinks just kept coming and coming. Sighhh..! That was a sigh of pure satisfaction. Full to the brim.", 
    "review_date": "2010-08-23"
  }, 
  "VMakUjCziVNgLdsmoTj9-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly J.", 
    "review_text": "I thoroughly enjoyed my experience here on Friday night. We had a group of 5 partaking in the \"all you can eat &amp; drink\" bonanza, and it was out of control. I am a person who really enjoys having control of my meal, so obviously my self-contained boiling pot of broth was a TREAT to manage as I cooked up various meats &amp; veggies. I also am obsessed with sauces, so imagine the joy of having 3 varieties that you can also spruce up with onions &amp; garlic at your leisure. Basically, it's a control freak's dream. Add in the luxury of unlimited sake bombs throughout the duration of your meal, and what's not to like?  The only reasons I couldn't go 5 stars is that if you have a group, you have to sit kinda far from each other and shout across a mini-canyon to make yourselves heard. Also, the manager roams around with \"fire water\" shots that make you feel like you MAY die after you take it. It's probably like, windex or something. But hey, free alcohol and a festive atmosphere, so who's complaining.", 
    "review_date": "2011-09-26"
  }, 
  "pKqIk1NpORfU6tEDW9S2xQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "hugh l.", 
    "review_text": "Ok, so i went here yesterday for the first time in about 4 yrs.  Everything is so much more lively now.  I remember when i was here before it was dull boring but now its rocking.  I loved their music, perfect for eating like crazy and drinking like crazy.  lol.  All you can eat meat is only like 22 bucks, and all you can eat and drink is like 34 bucks,  so its reasonable.  I chose the all you can eat and drink cuz i drink more than that 12 dollar difference, haha.  The meat was tasty with 3 diff choice of sauces.  I picked the spicy soup base which was also very good.  I loved how each person gets their own pot which makes it personalized.  Oh yea and watch out for the hot waitress, she may come and drink with you. But be careful, you may get really buzzed. lol", 
    "review_date": "2009-01-01"
  }, 
  "ey4L4an9m1pEi0NK8Ybepg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "George L.", 
    "review_text": "I love this place.  All you can eat beef!    The staff is very attentive and helpful, giving us tips on what to put in our broth and kept the plates coming.    As others have mentioned, their seating arrangement is not ideal for socializing, but I tend to focus on cramming the sliced beef into my mouth so it's not much of an issue for me :)", 
    "review_date": "2009-01-27"
  }, 
  "8JC0TnD1YQMTMyAOuDM56Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren K.", 
    "review_text": "We only came here because of a groupon and the fact that i LOVE shabu. There's no option for broths so by default you get a miso broth. Sad that there's no lamb but we ordered 2 beef shabu and a side of pork (which is one whole plate for $10). The beef has nice marbling and they give you a large amount.  Sad that there's no bowl of rice included and that the sesame sauce sucks. It tastes like bottled runny sesame instead of thick cold fresher tasting sesame sauce. I don't think AYCE is worth it here and there are plenty of better quality places with more of a selection in the city but for what we got and paid, it was good.  They should probably hire one more waiter to help bus tables/take orders. We watched one party come and go just because they were trying to order the the waiter was way too busy.", 
    "review_date": "2015-01-06"
  }, 
  "9ahCDfcVHndH0ZTF2kMKAw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin R.", 
    "review_text": "(Un) Happy Shabu Shabu is terrible! My boyfriend and I usually go to Shabu House on Geary, but decided to try a new place.  Ugh!  When we first walked in, it smelled like a toilet.  My boyfriend made the mistake of ordering the chicken.  It took him forever to cook it. I had the beef, which was frozen. I would rather have plain water than the miso broth.  It was totally bland.  I gave 1-star because our waitress was really awesome.    Great service, terrible food. Will never come back again!", 
    "review_date": "2010-08-03"
  }, 
  "P0sx_XYaCj2DWhRdf25yzQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren S.", 
    "review_text": "Here's the thing, if I were rating the food it would be more like a two.  The broth is flavorless and the meat gets overcooked too quickly (okay maybe thats my fault).  I liked the unlimited vegetables a lot - good variety and we fought over the mushrooms -- but eh, maybe shabu shabu is just not my thing. Or I'll try it somewhere better.  Buttttttt I still say go to SHABU SHABU WITH LOTS OF PEOPLE!. I went with a group of like thirty and we were drunk and disorderly but nobody gave us a hard time, just kept giving us beer and sake. It was a little cold outside but where else could they seat us all? Owner gave us shots of firewater woohoooo  So yeah, don't go for the food but if you and friends want to just pregame for a couple of hours or have a chill (but drunken night) this is a great option. Be sure to bring a camera!!!  Note 1: If you have enough to drink, Fillmore karaoke is right across the street . . . you know you feel the beat.  Note 2: be careful! i have a giant cut on my wrist where I hit my hand against the hot shabu pot!", 
    "review_date": "2010-07-18"
  }, 
  "MSkN2ieSx3uu6WH728KriA": {
    "user_rating": 5.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Nicole S.", 
    "review_text": "My FAVORITE place in the Fillmore!  All you can eat and drink for under $40?  ARE YOU SERIOUS?  The service is GREAT, too... very attentive and they don't hold back on giving you sake or beef refills.  YUM YUM!!!", 
    "review_date": "2008-10-24"
  }, 
  "bmlyCwIIi32-MlL7mBbbNA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "me:      \"shabu shabu!!!\".........              \"hey... hey!!  SHABU SHABU!!!!!\"...........              \"HEY!!!! Over here!!!\"  waves chopsticks around  sister:   \"WHAT???\"  me:       \"I said SHAAAABU SHAAAAABU!!!\"  sister:  \"Yeah I heard you the first time\"  me:       \"whaaat?\"  sister:   \"I SAID I HEAAARRRDDD YOUUUU the FIRRRST TTTTIME!\"  me:       \"Yeah I heard you too....now SHAAAABUUU SHABBBUUUUUU\"  sister:   \"Why do I eat with you?\"  me:       \"whhaaaaat?\"  Davids bottom line-  The seats are like 6 feet away from each other.  Kinda nice to have your own pot but they should have the optional shared tables so a party of 4 isnt seperated by what feels like a huge crevasse.  I had to walk all the way around the long table to pour my brother in law soju shots.  It was like mini work outs built into my meal... and my boss says im no good at multitasking.  hmmph.  I still annoy the crap out of everyone when I shabu shabu my meat.", 
    "review_date": "2009-01-20"
  }
}