{
  "8k3aO-mPeyhbR5HUucA5aA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Victor G.", 
    "review_text": "i've had many long conversations with the bartender here. very friendly.  business must have been slow.   i've only seen normal people here.", 
    "review_date": "2008-01-27"
  }, 
  "2obAyPuH-G3Dn3EUdQnQlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dean E.", 
    "review_text": "stumbled in there with a co-worker one night on our way to northstar and had the time of our lives playing pool with total strangers. the place is a refreshing local hangout in the heart of north beach.", 
    "review_date": "2005-03-15"
  }, 
  "v3ial-ln4kh1RgM7BQxXoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew N.", 
    "review_text": "Took a hiatus from Yelp, but I had to come back to review this place...  After recently turning single and moving into my own place in North Beach, Hawaii West has practically become my second home, I'm here probably at least 3 times a week. I love the owners, the bartenders, the jukebox with totally random tracks, the regulars and the weirdos...... It's hella divy, i fucking love it! No pressure no nothing, you just fucking drink, have some good food, and have a great time.", 
    "review_date": "2007-08-20"
  }, 
  "BIdFgt_4owlS1VUcTuZ4fA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ruthie V.", 
    "review_text": "We always park in the garage next door and this is the first time we stopped in because I needed to use the ladies room and bf needed a cold beer.  What a great dive -- tiki decor and the ladies room was painted reddish orange, divey yet clean.  Okay I thought, this is my kind of place!  Then the lights went out and I was in total darkness.  I didn't know the lightswithch had a timer on it!  So I felt my way back around the wall to the switch, turned it back on and washed my hands.  Meg, the bartender was as bubbly as any they come!  Nice atmosphere and we could tell that the place was full of regulars.  When we went back to pick up our car, the joint was hopping with LOTS of people making a lot of noise and having a damn good time!", 
    "review_date": "2009-06-14"
  }, 
  "0ltmHwUQuQde4me8DII0sw": {
    "user_rating": 2.0, 
    "user_location": "Napa, CA", 
    "user_name": "Kenny R.", 
    "review_text": "I walked in here at one point and asked for a Mai Tai... like the ones Sonia used to make - They were strong and she would drink them as fast as she could make them (and actually had pre-made pitchers on busier nights).  The barkeep last Saturday stared in bewilderment.  \"Uhhh, I think I can make one of those.\"  I thought I had walked into the wrong bar.  I stumbled backwards.  \"I'm sorry.  I must have made a...  I thought I was in Ha...  Where am I?\"  I looked around me.  The fake palm tree wrapped in festive lights was gone.  KMEL filled the air with flaccidity.  I was in the right place, but at the wrong time.  I tried to rescue a few on my way out, but I could only rescue myself.", 
    "review_date": "2009-02-27"
  }, 
  "c-99TEUKLTCmJ0mNFijDkw": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Joe F.", 
    "review_text": "Staff is extremely friendly, drinks are reasonably priced, atmosphere is welcoming. (We asked for sugar-free Red Bull and they didn't have any, so without us asking, they went down the street to get some.) We actually stopped back in here after dinner.", 
    "review_date": "2013-12-22"
  }, 
  "XHuNSjrPA3Vyi7n4iVhZaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "One of the best places in town in which to drink  your dinner &amp; watch the I Love NY marathon with a very sweet, witty, hot bartendress (not the mean one referred to in previous reviews, apparently she is gone). There aren't many reasons that I head to this part of town, but this is an excellent one.   More of a dive bar with a tiki theme, if you walk in expecting Tradr Sam's type of cheesiness &amp; shit like Scorpion bowls, you will be very dissapointed. However, if you want to play Liar's Dice with a bunch of young Chinese guys who can barely speak a word of English, this is your jam!", 
    "review_date": "2007-04-16"
  }, 
  "QcPN-Dee_dU2IWno-f2oYA": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Lindsay T.", 
    "review_text": "A dive bar with nudie photo hunt.  it's right next to a parking garage so it's not a bad place to stop in before heading to north beach.", 
    "review_date": "2006-10-22"
  }, 
  "jy_RGAeAvNeCv5BxZsUWFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom R.", 
    "review_text": "This is a nice little Dive bar, sort of a retreat from all the pricey tourist rip off joints in North Beach. We went in at about 8:00 Pm on Halloween and took over the joint with about 30 people. The staff was very friendly.", 
    "review_date": "2008-11-02"
  }, 
  "cHdSQISeMpp8HlCWgNb1QQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bianca C.", 
    "review_text": "Hmm, I really didn't like this place. I would give it one star, but the staff was very friendly, plus there's a free pool table to use. It was really quiet for a Saturday night - music only played from the jukebox, so had to pay for it. Don't know if my friends and I were just there on an off night. The drinks were rather weak and tasted either watery or too sweet. Probably won't be back here.", 
    "review_date": "2014-05-11"
  }, 
  "duymKKwUruH8GwbvcaFd0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene X.", 
    "review_text": "OK so this is a nice divey bar - lots of non-tourists and non bridge and tunnel folks so if you wanna just get your drink on, play some pool or generally not be disturbed from drinking, this is a solid place for you.  My friend Andy, another native loved this place and I finally checked it out with another local who has also adopted it as her own.  A great getaway if you are serious about drinking!", 
    "review_date": "2008-06-16"
  }, 
  "8nqcdY9b-zolA3DgfeHSxw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dick S.", 
    "review_text": "I love this bar.  The decor is fun, the crowd seems pretty friendly, and Sunny is awesome.  I do not think I have gone to North Beach without stopping in for a drink here, at least not since I found out about it.    They have pool, and a jukebox, and depending on the day, smoking seems ok in be bar sometimes.  Also, the grass tulip hut roof over the bar is awesome.", 
    "review_date": "2013-06-16"
  }, 
  "9MspVJYx4f3t9FhbulXOJA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Yuichi K.", 
    "review_text": "This place I feel is quite a good place to hang. The bartender Young is cool too which helps ;) I usually go there on Wed and Sat and have had a good experience so far. Thanks Young!", 
    "review_date": "2010-01-09"
  }, 
  "OQBeD6RvLNjfgB64MBI1IQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly O.", 
    "review_text": "COCKTAILS: DON'T!  This place used to pack a little more \"Hawaii\" into their dive, but if there has to be one place camped out on the absolute bottom of the Bay Area Tiki Temple Destinations roster Hawaii West is the pits -- which is not necessarily a bad thing, just a disappointment.  Remnants of a waterfall wall fixture looms large across from the thatched roof bar, the lagoon now dominated by billiards. You'll find a couple of tikis outside and perhaps a Ku or two hidden on premises. For tiki diehards this place is skip-able. Do yourself a favor and opt for ANY of the other Tiki Temples nearby unless, that is, you're craving beer, billiards, and liar's dice.", 
    "review_date": "2013-03-12"
  }, 
  "iw_6JAAw9FAIv2YkbLcMFA": {
    "user_rating": 4.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Dan Y.", 
    "review_text": "Five minutes in this joint and you'll be thinking of Tom Waits singing \"Warm Beer and Cold Women\". This is a true dive, a bar that belongs in a completely different neighborhood, maybe in another area code. A strange clientele, a collection of folks that probably don't fit in anywhere else. Stop in sometime you might enjoy it. Just go easy on the suds because trust me you do NOT want to use the john in this place. I ventured in there tonight and got an eyeful of fresh burrito soup, ala carte.  Yum.", 
    "review_date": "2009-04-25"
  }, 
  "I72ANFZeDn1s3nU2LKsQbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimmy D.", 
    "review_text": "I stopped in here last night (Wed.) for a couple beers on a friend's advise. My usual spot was about the same, the usual, so I decided to take a trip to Hawaii, without all the TSA hassels of removing shoes, liquids etc.    I arrived alone and was greeted warmly by a very attractive Asian bartender. I suppose that in itself isn't really much of a review to write about, but she was also friendly ! Bonus ! Having a look at their beer on tap I noticed Sam Adams, second bonus, because that is just delicious goodness !    So ok, cold beer now in hand, I'm watching the bartender play the game 24 with dice. I had never played before, but one of the regulars took me under their wing, and also taught me liars dice as well. Third bonus! He then proceeded to notify me that she is a 'formidable opponent' and with great caution, warned me of her skill. I appreciated the heads-up, but throwing caution to the wind, I decided to give it a try. I thought maybe a bit of beginnners luck may be on my side, but it was not to be. Not a real loss though, as it was all in fun, and I was promised a chance to even the score next time.    All in all, I personally had a great time ! The beer was cold, I learned a few new games, and all with wonderful conversation. Regular people in a nice atmosphere, and I don't have a suitcase of dirty clothes to wash from my trip. I walked in alone, but quickly felt like a regular. 3star bar, 1 more for Sam Adams on tap, and a star for the very lovely bartender who made me feel like a regular ! Thank you", 
    "review_date": "2013-12-04"
  }, 
  "OvteZk2gWKfIRAryq7T9KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda B.", 
    "review_text": "Dranky drank time  Happy birthday to the bartender RO RO!  Check out the drink special during happy hour $1 off drinks  Yummy special dranky drank! Thanks to my favorite bartender Ro Ro love you lots!!  My favorite dive bar when I'm in the city.. Chillaxing w/ the best bartender ever, shooting pool &amp; jamming on the juke box.  \"I love this bar.\" Very chill atmosphere and great to start your night out but always find myself having my last call @ Hawaii West!! :)", 
    "review_date": "2013-03-04"
  }, 
  "pDfL8xt8F8ls0-kQIG_ADg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Earl G.", 
    "review_text": "Some call it a dive but I don't think so. It's to nice inside to be a dive.  You get a real feeling of SF captured in this neighborhood bar. Everyone just gets along regardless of age, race, or color. You have the old drunk Chinese guys yelling at the Chicago Bulls for not putting away the Celtics in their 3OT playoff victory. You have the blue collar racially diverse city workers playing pool. You know they came here strait after work because they stink like no other. And you get the random people that kinda stumble in away from the touristy areas of North Beach. The vibe is relaxed and mellow, must be from the Hawaiian decorations.  Plus nothing says a guys happy hour than the bartender playing some Beyonce - Naughty girl on the jukebox.   Jigga", 
    "review_date": "2009-05-02"
  }, 
  "D9mgcl6MFE3vRKTVadFFdQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Britney C.", 
    "review_text": "Total dive bar. You will get your fair share of \"unique\" people at this place. Don't expect the suited up FiDi's to be here! I had a very interesting conversation with one of the patrons about Ralph Nader, the Green Party and Communism. Okay....  This place is NEVER packed for the 2-3 times I went. And those were on weekends.", 
    "review_date": "2008-09-16"
  }, 
  "zhMY628j23fJJzbzHhfOcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed B.", 
    "review_text": "Very mellow and nice, maybe too mellow.  Nice lady bartenders and scant regulars.  I like the broke ass (once nice?) decor.  You are in the middle of a fading era.", 
    "review_date": "2007-11-17"
  }, 
  "piqd968yUGHQDL1ei6gj2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sasha P.", 
    "review_text": "evilness lurks in the shadows of this unforsaken place. cowboys hats are ridden, pool sticks abused,and shot glasses are always full. times are tough in the south pacific when it comes to \"tiny bubbles\" trying to  find their way to paradise.  its a loveboat reality show rerun daily....but please dont forget your passport - San Francisco's finest are across the street -! ....... Uglyville here I come!", 
    "review_date": "2005-07-08"
  }, 
  "XnbGrJNw0wglmqXekW138Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn B.", 
    "review_text": "now i like dive bars, but this one was not for me.  it was smoky when we walked in, and kind of dead for a thursday night.  there was a weird fishtank in the back.  my friend was harrassed by a drunk guy so we left after a drink.  i dont think i will be back!", 
    "review_date": "2007-08-05"
  }, 
  "8d6Mdzh_GWk9gZTqrsGJrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "Great dive! Bartender was cool, beers were cheap, company was awesome, a music machine on the wall and a tiki room feel. What more can you ask for in north beach and a dive bar?   I am not sure that this place would hold him well in the next big earth quake, (you can totally see the cracks and holes in a lot of the support beams)- I really hope it doesn't fall down because this place is dive bar love.", 
    "review_date": "2007-05-04"
  }, 
  "Licx63IGtNDPvhMIBqmOww": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Uland W.", 
    "review_text": "Celebrating the return of long time college friend coming back from the U.S. Army. Randomly ran into this place after parking in Chinatown heading to the infamous Broadway St. At first it was 1 drink which turned out to be an all night party at Hawaii West.   Very quaint place, small and where local dwellers comes into this place for a game of pool and chit chat; away from the crowded bars of Broadway.  Struck up a conversation with the bartender and the \"semi-owner\" of the bar. After a few challenges a game of 8 ball with the bartender and owner was afoot, shots were to be had that night; Jameson $7 a shot! The drink of Champs!! 2 games out of 3. Not bad!  After reading other reviews, this place can have the stigma of tomfoolery. The owner morals on paying up on lost games is shoddy. Beware of her, previous reviews are right. FYI she's Korean! Don't group her with the lovable Cantonese folks! I tried to spread her some knowledge about her actions, but she solid about her beliefs!  The veteran and I were here to have fun despite the demeanor of the owner. The crowd that night was great and we had a blast. This place has a jukebox, that requires some funds throughout the night. Unfortunately this place doesn't offer free entertainment after a prolong jukebox silence like some bars do.   Here's my shout out to the bartender that night. Many apologizes I had your name solid last week, but after a few days your name eludes me at this critical moment of Yelp-Ness!", 
    "review_date": "2011-10-25"
  }, 
  "Y7SBCiXjIqMK39S8v0Oehg": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Casey D.", 
    "review_text": "Decent dive bar we stumbled across while wandering around Telegraph Hill in search of beer. If I lived in the area, I would definitely go back again and again. Friendly bartenders, Fat Tire on tap and pool. What more could I ask for?", 
    "review_date": "2010-09-01"
  }, 
  "5DgFmyjW6hkBtXtTMKl4tA": {
    "user_rating": 4.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Lori K.", 
    "review_text": "This is a pretty darn cool dive bar! I met up with the SF Yelpers here on one of their pub crawls. This dive bar is PERFECT with it's beachy Hawaiian theme it fits in perfectly in North Beach! I mean seriously... where else would you put this bar?   The bartender who was flying solo did a fabulous job in getting all the Yelpers their drinks. She was friendly and served up our drinks with a smile! The musical selections on the jukebox were top notch. There was a lonesome pool table begging for some play.   The beers on tap included Stella, Heffenweizen, Pabst Blue Ribbon, Miller Light, Anchor Steam, Sierra Nevada, Kona, Longboard Lager &amp; Red Hook but what caught my eye was the 4-7pm Happy Hour deal which at first I read as $1 drafts but then Will H. was gracious enough to point out that I had missed the operative word \"off\".... Ok so it's not a $1 Draft Beer Happy Hour...but who cares the beer is cheap here to begin with so it's a $2-3 Draft Beer Happy Hour... Same difference....I loved this place!", 
    "review_date": "2007-04-30"
  }, 
  "WPBrjBbk76ZtZQ8QpG09cQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Henry L.", 
    "review_text": "DIVE bar right across the POLICE STATION  I used to live right up the street from this place, and for the first month or so I didn't want to go into this place because it was right next to the police station--for some reason I always imagined this to be a police/biker-gang kinda spot. But after I went in a few times, I realized this is actually the Chillest place on earth--there is a wide variety of clientele, and everyone is just there to chill out, or play in the billiards league, or turn on the jukebox.  The bartender is also extremely friendly, with an interesting personality. The owners are also locals who own a couple of other bars in the area, so every 30 minutes or so people would walk in and say hi to the owner, chitchat, get a drink, have a couple of laughs, and continue on their way.  Definitely the neighborhood dive bar.", 
    "review_date": "2014-04-10"
  }, 
  "IDVX4Is4CanREchBmpFXoA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jim L.", 
    "review_text": "This is a nice little barfly dump thats a good alternative to all the usual hokey, obnoxious North Beach hangouts.  Its pretty cheesy inside, replete with fake palm trees, a few tikis and the best part: one of those plastic menu boards with crooked little clip on letters spelling out \"hot dog...$2, turkey sandwich...$3\", etc.", 
    "review_date": "2006-03-17"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "The bartender quite literally scared me at first, and I dont scare easily! She has dagger eyes that can kill if you order a drink with more that 3 ingredients.   Luckily for her....or, um, me.....or her.....wait......... luckily for both of us, I am not a fruity drink kind of gal, so after the first run in, and seeing her yell at everyone else in the bar she would not make anymore Hurricane Leahs, we switched to shots and beers...  I mean, not just me and my friends, but me, my friends AND the bartender.....after she got a few down she was singing and dancing and had retired the dagger eyes for the evening. In fact, we got special bartender hugs on the sidewalk on the way out by the end of the evening.  Decent little tiki bar with little to no clientelle. Make sure you bring some extra dinero to buy the tender a few shots. It makes for a fun evening!", 
    "review_date": "2006-12-29"
  }, 
  "earHe_Zs8X7LsabQXj1xpw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurie A.", 
    "review_text": "My friends and I stop at this dive-y little bar from time to time , mostly as a \"rest stop\" on our way to NB. Only ever ordered a beer there....and even that sometimes confuses them. So last  Friday,  one of my friends decided to celebrate his b-day by ordering a Mai-Tai. Hawaii=Mai Tai, right? Well the bartender said they don't serve Mai-Tai's.  My other friend pointed out that the sign behind the bar read: Happy Hour Special:  Mai Tai. That didn't matter- the bartender still insisted they didn't make Mai-Tai's. Another bartender came over  to see why my friend was getting upset, then interjected \"why can't you just order a beer\"?  Finally after my friend insisted over and over that the sign says you make them, I want  one.....well, he never actually got one. It was more like a strong shot of rum and more rum I think. That's not really a review of the place, but I think its a pretty funny story. Maybe you had to be there...", 
    "review_date": "2006-07-10"
  }, 
  "ee2ALG_x2ZC20uwF4D6n4Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike T.", 
    "review_text": "I hadn't been to the Chinatown/North Beach area in a while. After getting a feel for being in Chinatown again, I crossed Broadway, and headed for Hawaii West. Having been away from this place for years, I noticed some improvements. The flat screen TVs at eye level are a very big plus. It made being in a dive bar enjoyable, because the baseball game that was on, seemed intimate. There were a few degenerate customers, but nothing that I couldn't handle.  The bartender served up my cocktails with a smile, but it would have been great if she opened up a little more. She has a body to die for, and makes eye glasses look very cute.   This review gets 4 stars for being a comfortable dive bar, and Evelyn was not there at the time. I hope she is not there, the next time I stop by.", 
    "review_date": "2007-08-03"
  }, 
  "tx407EtvKoXXEZqYQFQVJA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff M.", 
    "review_text": "So let me get this straight.  A bar in one of the densest bar areas in the Bay Area, in the same city as Trad'r Sam and Trader Vic's, claims to be a tiki bar but won't make a Mai Tai, Scorpion Bowl, or Blue Hawaiian, serves disgustingly warm beer from all the taps, and has the most intensely urine-scented bathroom I've ever encountered outside of Golden Gate Park?  I think I'll pass.  The only reason we made it more than ten minutes in that shithole is their $20 credit card minimum (which- and I'll share this just because it's such a craphole- is a violation of the merchant agreement).", 
    "review_date": "2007-12-11"
  }, 
  "yq3_KW7O5iGhHX31zJhqFw": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Stephanie D.", 
    "review_text": "The 5 stars are for everyone who has pleasantly and not so pleasantly YELP'd Hawaii West.  My Grandma Ruby (Uncle Nolan's mom) who was the true trekker of this establishment  (from 1970-1993) would get a kick out of all the comments.  Thank you to those who have stopped in and those who have stayed so long to become regulars.  I know Uncle Nolan takes great pleasure in knowing that Grandma Ruby's bar is still even opened.  I'm also glad too....Ahhhh the memories!!  Wish you guys could have gotten to meet her.  Thanks everyone!!!", 
    "review_date": "2009-01-16"
  }, 
  "6XCZoufB_S-sY6vsxMGd8Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jason g.", 
    "review_text": "This is a cool joint.  Hung out with the owner, Nolan and the bartender, Olga last night with a bunch of my friends and employees.  Yes........Olga from Underdogs now works here on Thursday, Saturdays, and Sundays.  The owner is a cool guy and pretty fun to hang out with.    They do take credit cards here but they can't run it twice.  The reason why i know this is because when I came back again that night they wouldn't take it.  Weird.  Owner bought us a few rounds for us but the price is a little high here for a dive bar.  Either that, Olga don't want me to come back here anymore.....hahahhha.  Hawaiian bar with no pineapple juice? Can't run the credit card twice?  They have a kitchen but they don't serve food?  I'm a little perplexed about that.  They have a pool table here which is kinda cool, but these guys are sharks here.  I haven't seen sharks like this since the days of the Great Entertainer.  I think the losers had to do 25 push ups.  Pretty funny to see a bunch of grown ups doing push ups.    Hawaii West (1st time) 110 dollars Yuet Lee                           115 dollars Hawaii West (2nd time)170 dollars Mr Bings                             80 dollars  Hanging out with friends and employees.................465 dollars............thought I was going to say priceless huh?.  That would be too much of a cliche,  but it was great to hang out with the people that gets you were you are at today.", 
    "review_date": "2008-10-10"
  }, 
  "CvrazcyNK-pvcc8eTvlP5g": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Jon D.", 
    "review_text": "Stumbled upon this place because my sister and cousins had to use the bathroom and it was right next to the parking garage where we parked.  It was not very crowed on a Saturday night, which was fine by me since it meant that I could get my drinks faster.  This place is pretty chill, I'd probably stop by again next time I'm in North Beach.", 
    "review_date": "2008-11-23"
  }, 
  "941S32IplLFmgMMFtB5S0w": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Dana-Maria D.", 
    "review_text": "Somewhat tiki-esque bar in North Beach with a colorful clientele.", 
    "review_date": "2004-12-16"
  }, 
  "ekaQsTZ_PlxR88xtHgZtcA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ravena F.", 
    "review_text": "When you find yourself stuck in North Beach, thoroughly sufficating in the mass of plether, perfume, &amp; dye jobs, THIS is your escape.  Too bad the \"waterfall\" (water sliding down the wall into a faded blue trough) sprung a leak and had to be walled over.  At least there's still Ms.Pacman, a decent jukebox, strange decor and easily befriended bartenders.", 
    "review_date": "2007-01-07"
  }, 
  "cUnvmWGohwnZgZtltVmblA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valeria R.", 
    "review_text": "This past Saturday I was in the blazing sun most of the day, slaving away at a school fundraiser. After all that good-deed-doing, I felt I was entitled to a little \"reward\", and what better reward than some tasty adult beverages?  I dragged my tired, overheated ass to the nearest bar, which happened to be Hawaii West. I hadn't been in a couple of years...back when it was dirtier and divier (and I mean that in a good way) and under different ownership. It's a little spruced-up now, but still has a great downscale, neighborhoody feeling.  I lucked out that one of the friendly regulars was there. He took me under his wing and made me feel right at home. He and the adorable little bartendress kept me in stitches with their antics.  After a few cold beers, I forgot all about the day's stresses. Eventually, it was time to \"break the seal\". I found my way to the bathroom, only to discover the toilet clogged and the floor semi-flooded. I went into Mommy Mode and whipped the place into shape, unclogging the toilet and cleaning up the messy floor.  When my new drinking buddy saw me come out, he pointing in another direction and announced: \"Um, that's the wrong bathroom. We use THAT one over there!\"  Yay me...I left Hawaii West in better condition than when I got there.", 
    "review_date": "2009-05-19"
  }, 
  "LnZUtFx6qTWs8NV6lAARxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "This is 'divey' bliss! The bar is usually never crowded and drinks are poured with a heavy hand. Plus, cocktails come with neon bendy straws! The place also has a jukebox where you get 3 songs/dollar.", 
    "review_date": "2007-09-12"
  }, 
  "hsN77nulIwEO6GOWGan60A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maurice R.", 
    "review_text": "I came here for the first time last night, and I fell in love. None of the bridge &amp; tunnel crowd that can be found in the bars further down Broadway. None of the loud, thumping music that drowns out conversation. None of the fake hipster poseurs standing around and trying to look cool for the sake of looking cool. This place is what a great dive bar should be: unpretentious, cozy, and regular patrons that will chat with you and make you feel welcome.  The Asian lady of the house is Sonia, and she is fantastic. Bawdy jokes, strong drinks and good company are her forte. And if you're hungry, she'll flip you a burger in the small kitchen behind the bar, too. Trust me, she will take good care of you.  The pool table makes for great ambiance, and there's always someone willing to play. Keep the hits coming on the digital jukebox, and you won't be disappointed. You may even get a free drink from the owner who sits near the edge, or the blond French guy named Fabrice.", 
    "review_date": "2010-05-22"
  }, 
  "0M6iVk5VtlS9wk45FfPvZw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jake H.", 
    "review_text": "Very 'earthy', no apologies type of bar. They had tecate on tap... Little more expensive than you'd think. Was already drunk when I went in, which probably made me seem like a regular. Gorgeous...gorgeous bartender with dimples and energy.  I sat down and she said, \"Don't just sit there so cute and sad\" -which I didn't know how to respond to, except to order a shot of Jameson.", 
    "review_date": "2009-10-11"
  }, 
  "PlRQBvaBCEkZeetp9QUNXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie N.", 
    "review_text": "I walked in here one day with a friend (both of us fairly new to living in NB) back in October to shoot some pool and have some beers. We ended up staying the entire night, and the rest is history- - This is now my favorite place to hide away from the crazy drunken shit-show that is North Beach.", 
    "review_date": "2011-03-22"
  }, 
  "J0G7SAItOT4opuLSK2-tmw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody L.", 
    "review_text": "So normally I'd give this place 3, 4 stars caus it's a decent place that's open late and has a pool table. However, the last time I was there, the bartender/lady who owns the place completely ripped my friend off because she thought we were all drunk (she said this in front of us to her younger bartender-apprentice). Normally when we've been here, a white russian only costs about 6-7$. This time she charged him $20 for 1 white russian, and 1 midori sour. I watched the bartender lady's apprentice (her younger relative??) make the midori sour and it was mostly sweet and sour and midori mix, and no vodka. UM. Mixed drinks will never cost that much, especially at a divebar in a corner of North Beach/Chinatown. My friend didn't care that he was being ripped off caus he was planning on spending all the cash he had on alcohol anyways, so he threw down $3 for tip. Other female friend returned it to him and was like, you already paid enough. Old bartender lady got angry and verbally expressed how my friend should let him do whatever he wants.   Later my guy friend asked what he could get for $7 and the old bartender lady was like.. \"only a shot of soju.\" um.. even if i was blacked out, i would know that a shot of soju should only cost $3, MAX. Female friend starts an argument with old bartender lady, and younger bartender-apprentice out of fear/guilt pours us another soju shot and declares it \"on the house.\"  This place is nice, but the old lady owner/bartender gets really sketchy if she thinks you are drunk. never again.", 
    "review_date": "2011-08-15"
  }, 
  "P7_vx8jtm7tNz38N1H1NWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C Bob R.", 
    "review_text": "A dump situated right next to Central Police Station, with zero beers on tap, sometimes with PBR cans sometimes not, with a bathroom that makes the Transbay Terminal look like the Hilton and a rotating cast of barkeeps with rotating levels of competency?  My new favorite bar in North Beach!  I  like it cos the B&amp;T toolbags stay away, cos if you spill your beer they'll give you another, cos you can get breakfast!! here in the AM. Good energy. Mahalo, HW!", 
    "review_date": "2008-12-14"
  }, 
  "oGD6YXB0CS1wgFltfsz2NQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven Y.", 
    "review_text": "This place is extremely slummy. The owner/bartender drinks on the job and lets people smoke inside. I was fearful to try any of the cocktails and stuck to their mediocre beer selection. They also posted up their health department score card, it initially says 75, but was then written over to say 88. I'm not sure who did that, but it speaks volumes about the place. I wonder how this place manages to break so many laws and get away with it when it's right across the street from a police station.", 
    "review_date": "2012-06-16"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "right across the from the police station... small strange bar. has a nice laid back feel to it... except i had to wonder how many of the guys in there were cops?", 
    "review_date": "2005-05-22"
  }, 
  "K4ucE5Z71bh69X7WAHhvmg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Sagruilla P.", 
    "review_text": "Walked in with sis, hubby, and dad, and stumbled out a couple/few (?)hours later not knowing what happened. The bartender/owner (?) drank with us, topped off our drinks when she made too much, and told us stories so funny that we were crying. She was really part of our party, and she even was in a couple of photos we took! It's a great little place off the beaten path, between Chinatown and North Beach.", 
    "review_date": "2007-07-11"
  }, 
  "YEujUjiiPAVBHaYXMWFDbg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "thomas b.", 
    "review_text": "Cool hidden divey spot I consider to be my secret oasis. My last visits to the bar have led me to believe changes, bad changes, have occured. I think the bar Is under new ownership. the previous owner was a well known and very much loved friendly funny hawaiian dude. As a  sweet chill guy  poppin in to chat and converse with peeps  he created a great circle of good people.  The new  owner is a just destroying everything sacred about the bar. She is hustling bitter drunk Who seems to have fired these amazing bartenders and taken all the shifts for  herself.  good luck.     West's leading bartender- Meg, is the hidden gem of bartenders in San Francisco. I've been to bars all over the country, and I've never felt so content with the idea of spending so much money and the majority of my time in a dive bar.   Meg has a sincere genuine kindness for people combined with a wicked sense of humor.   I heard that Meg no longer works there. If the news is true,my final review on the place is that it's not worth your time or money to visit.", 
    "review_date": "2009-12-04"
  }, 
  "G8RpowvR9LodKj4_BCPMaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "Wait-- where's decorations? Where's the tiki? The Koi pond, the waterfall? Where did it go?  At least for the moment, Hawaii West has been laid bare, but they didn't change what makes this place a great bar. Not a dive bar, mind you... no, the bartender is attentive and welcoming. The patrons aren't fixated on their drinks, and will share their enthusiasm for Utah's basketball team with you. The jukebox still has a great collection of tunes, and on a Wednesday night, the place is far from crowded. The rattle-thunk of Liar's Dice and 24 still can be heard across the bar.  Hawaii themed or not, this is still a good neighborhood bar.  Lucky for me, they still serve Kona beer.", 
    "review_date": "2008-05-08"
  }, 
  "nzjKqK_BjQpAmCqvWkUbsA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ahnui Y.", 
    "review_text": "This bar has the lowest douch bag: normal person ratio in North Beach.", 
    "review_date": "2007-07-23"
  }, 
  "Zhmo-DSRXmBdSBg4vXeKFg": {
    "user_rating": 1.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Andy B.", 
    "review_text": "\"The\" Hawaii West exists only in the minds of a lucky few... I, being one of them, hold on to as little of this place as I can. This is not a bar, it's a ride to the dark side. Northbeach has a certain energy that only we natives and true oldschool locals understand... This energy began pooling a decade ago into several bars, coffeeshops, restaurants, and bookstores, all of which are, and always have been famous. Well, \"The\" Hawaii West remains unkown to most, feared by the rest, and INFAMOUS in the minds of the lucky few... And sorry to say, Nolan, will never be the same without Sonia.", 
    "review_date": "2008-09-20"
  }, 
  "Q_8qAEFkzrzTVAJhLsxmBg": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Kristin F.", 
    "review_text": "So I had never actually set foot in here before last night, when I was in between errands and had somewhere to be and wanted to charge my phone and work a bit but didn't have enough time to go home. A team called the Giants were playing last night and all the bars were packed to the brim and then around the side of the building. Soooo... when I walked past 10-20 packed bars in North Beach,   I walked into Hawaii West and was greeted by a friendly lady who showed me where to charge my iPhone that dies all the time and is super flaky. She brought me a beer and I settled in while I watched the game (it was sad) and did some work on my charging phone. I finished the beer and felt it was time well spent... cozy little divey environment and friendly service. I like it! The TVs are pretty small though... maybe I will try and get a prescription for glasses before my insurance runs out from the 9-5 I resigned from.", 
    "review_date": "2010-10-22"
  }, 
  "l0PYkotRgNgz4ZqAjGFzPg": {
    "user_rating": 1.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Rachelle T.", 
    "review_text": "I'm down for a good dive bar, but Hawaii West takes it to another level. My first time here was several years ago and at the time it was an ok, Hawaiian decorated divey bar. I recently returned and I felt like I was going into an illegal bar scene. As soon as I opened the door, a few people scatted and put things \"away\" as a huge stench of smoke hit me in the face. People almost gave us the stink eye for interrupting their undisclosed \"private\" party. The bartenders were clearly sloppy drunk, chatting or shall I say slurring, it up with us.  I looked around and it probably hasn't been cleaned since the last time I was there, so I decided to play it safe with a bottled beer and downed it as soon as possible to get the heck out of there. There are too many other options in the area to patronize than to try this place again.", 
    "review_date": "2012-04-12"
  }, 
  "x1Ac25DmXXrQHOyNuspLiA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael H.", 
    "review_text": "The only reason why I stopped into this place was because I had a friend that was bartending here, but she doesn't work here anymore, so I'm ready to talk some sh*t. The front of bar reminds you of  those really tacky Japanese karaoke bars. The kind where non-asians are not supposed to frequent because the sign in front is written entierely in Japanese. Once you step inside of this Faux-Hawaiian oasis, your first thought is, in a city where bars and restaurants struggle to maintain their independent aura due to intense competition and fear of bankruptcy, how does this place stay in business. Aside from two fake plants, there is absolutely nothing special about this bar. It has four walls, a jukebox. Another crappy bonus about this venue is that the North Beach police station is located directly across the street. Great, that's exactly what I need to see after I've drank half a bottle of Jameson's (yes, by myself....are you judging me?), an entire squadron of cops! The best way to describe this place is that it is a sh*ttty version of the bamboo hut. There's no tiki-decor, no live music, no special island cocktails....just old men that are bitter about the hand that life has dealt them, so their only way to fight back is to suck down double gin &amp; tonics every 15 minutes, while promptly giving you the best version of their \"stink eye\" because you are trespassing on their neighborhood bar. Attention \"grumpy old men,\" you can have your crappy bar. If I ever step foot in this place again, you have permission to beat me until I'm unconscious.", 
    "review_date": "2008-06-17"
  }, 
  "a2wL432MCURrkqWbgoDVrg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Spring L.", 
    "review_text": "After a bottomless mimosa/margarita brunch at Don Pisto's, I drunkenly stumbled into this bar expecting tiki huts and mai tais. Those I did not find but instead I accidentally happened upon a private birthday fiesta.  The birthday boy invited us to help ourselves to the trays of home cooked food they had meticulously set out on the back table. I had no shame as I drunkenly started the food line by peeling back tray covers and piling steaming scoops of carnitas and rice onto my plate for my second brunch of the day.  Before I left, I wished Carlos a happy 31st birthday as if he was a dear old friend that I'd known for years. I also waved a loud and enthusiastic goodbye to the asian lady bartender behind the counter.  That evening, I woke up confused and still full from my double brunch. Then it all sank in... I had just crashed a birthday party.", 
    "review_date": "2012-03-26"
  }, 
  "RTiC5SVjEvv_vg0QNS83kg": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Bryan Y.", 
    "review_text": "one of the best places to hang out if you're looking for one of those hidden gem type of places. one of the better priced watering holes in north beach.", 
    "review_date": "2007-10-04"
  }, 
  "hyqt0tzmzK961rE2VFij0w": {
    "user_rating": 1.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Aiman Z.", 
    "review_text": "This place is awful. I needed to use the restroom, so I asked them if it was ok for me to use their restroom even though I was not going to purchase anything from them. They said it was fine and after I used the restroom they told me I had to buy something. This was honestly ridiculous, they should of told me that from the beginning. I ended up buying a cup of oj and my drink spilled from me. I asked if they can refill my cup, as I was holding the cup with my hand full of oj, and they refused. Horrible customer service and lack of communication is the least I can say about this place. Warning do not be sorry like I was after coming here.", 
    "review_date": "2014-01-04"
  }, 
  "b1KM8TKJ8gK-RVdw4fMaag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lord E.", 
    "review_text": "SONIA is BACK BABY!!!!     And so is Egan.   17 years of coming here and missed a few in between.  It's revitalized and never been better.     The weirdness is back and its the best bar to take over with your pal's.   Dont tell anyone.    Drinkalikahell!!!!!    -Egan", 
    "review_date": "2009-10-21"
  }
}