{
  "_don8EWxNsvRdjDJqWbw0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine E.", 
    "review_text": "Besides the thug getting arrested outside for carrying a fake gun and pretending to shoot people, this place was legit!  Mike is the best bartender! He fed me olives and made us some great drinks. Very friendly service and laid back vibe. Can't wait to go back !", 
    "review_date": "2014-10-13"
  }, 
  "Mp6pk7ctXyx9XOOhlVkmtQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Erica C.", 
    "review_text": "This is definitely the sexiest, most sophisticated venue in SF.  I had to write a review because again &amp; again I am so impressed! Expect to find: 1. Romantic, glamorous decor 2. High end liquor selection. You get what you pay for when it comes to... Well everything! Haha but know that this is not a dive bar. Everything is top quality and hand crafted.  3. Superior ((VOID)) sound system ** the best in SF hands down- be sure to stand in the middle of the main room at least once before you leave. Trust me, it's incredible to feel the music as well as hear it :) 4. Polished service and staff- very helpful and attentive  6. Gentlemen and ladies; San Francisco's elite 7. Dress nice, dress up, you'll be under a chandelier or two 8. Music really sets the tone- deep, sexy soulful, house music. I've seen an amazing artist selection there since it's opening- Miguel Migs, Fred Everything, Doc Martin, Mark Farina, Colette and Dj Heather  9.Mesmerizing theatrical performers- passionate and unforgettable. And my goodness their costumes are breathtaking - nothing I've ever seen before. Whoever is their designer/ stylist is a true artist and I'd love to meet them! May I please borrow a costume?? 10. Great vibes- everyone's happy &amp; everyone's polite", 
    "review_date": "2015-01-23"
  }, 
  "r3UmPWmn_e62xJpEngrAxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Selina W.", 
    "review_text": "One of the better more hip lounges/bars/clubs around Financial District/Soma.  Good crowd - diverse, space is dark, luxurious..has that old time British feel. Very sexy and has a more sophisticated ambiance to it. I like I like.   It does get crowded, but there are bunch of seating, loungey type of areas!  The only minor \" downsides \" - music can be a little bit off and the bartenders are so busy that it does take a little long to get your drink on ;)", 
    "review_date": "2014-09-20"
  }, 
  "IwUoxDPrMR889f2lrbkwOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristin L.", 
    "review_text": "Came here last night for drinks. The bartender was great, super friendly and helpful and the drinks were great. Interior has a cool look and the space is pretty big. I would definitely come back.", 
    "review_date": "2014-07-23"
  }, 
  "cUO6HnyplqVfsUhxp84JsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha S.", 
    "review_text": "Great place, definitely a great addition to San Francisco.", 
    "review_date": "2014-08-11"
  }, 
  "j5ykkiswkUcEbx2oscsrJw": {
    "user_rating": 1.0, 
    "user_location": "Concord, CA", 
    "user_name": "Anu J.", 
    "review_text": "Service here was horrible.  I was put on the guest list and was told that I would not have to pay.  Then when I was at the door they claimed that people on the guest list did have to pay (even though my other friends got in for free). They also told me the cover would be $10 at the door and the cashier charged me $15!  In addition every drink I had was watered down and the music was horrible.  I will never go back.", 
    "review_date": "2014-11-30"
  }, 
  "nuIWZSQa8W1E-VLKUJlnQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "m K.", 
    "review_text": "How did I end up here? I don't know but I like it!! Busy fun crowd on Saturdays and good bar service. I'll be back for a little more of a casual night.", 
    "review_date": "2014-08-30"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "If only.  Amazing sound system: <a href=\"/redir?url=http%3A%2F%2Fsosh.com%2Fsan-francisco%2Fhawthorn%2Fhawthorn-hidden-lounge-with-one-of-a-kind-sound-system%2Fa%2F6SpL%2F&amp;s=50aa18b7a61618e69e4f722d0c9f0fa31d9f4ca90e962c17679cd78ea247d41c\" rel=\"nofollow\" target=\"_blank\">sosh.com/san-francisco/h…</a>  Perfectly situation dance floor.  Beautifully designed space.  Friendly staff and bartenders.  Reasonably priced drinks: $8 for a vodka soda.  Excellent talent like DJ Colette: <a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DkQuyVq4RPg0&amp;s=a4d92f7e609fca0b969f848feabb6d622366b91f225be718f032f3dc53aa8749\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=kQuy…</a>  If only there was less of a bottle service crowd.  Then there would be five stars.", 
    "review_date": "2014-12-13"
  }, 
  "H840yF2SW_zqaZ_FmOOUYQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Suzzie B.", 
    "review_text": "4.5 stars. (no in and outs)   If Hawthorn  was a woman, it would be like Angelina Jolie! Sexy, sultry and sophisticated. You can't quite tell from the outside that it's a club minus the super long line of good looking people. I loved the bouncer's outfit, super retro. The club downstairs and all I can say is that it is HOT!    I liked the dance floor and ambiance a lot. There is a second bar if you walk all the way to the right of the club. Btw, the bartenders were awesome! Super nice and not snotty at all. Speakeasy/ Vegas/ New York feel with a good looking mid 20s-30s crowd but without the snootiness. I hate snooty vibes so I like this place, everyone from staff to the attendees were relatively chilled at least on Friday night.... I was having dinner close by on Saturday and was going to stop by to see my sister but ran out of time since we had to be at Harper and Rye for a birthday party. From first glance, I think the Saturday looked a little younger and a little more snooty... but not for the right reasons. :(  Anyways, Our host, Janelle??? was amazing!! She deserves 2 stars alone!!! She was friendly, helpful and just all around fun! She added to our experience and made the birthday boy very happy!!! Both tables had an amazing time and I would definitely come back again.  Props to the servers who cleaned up the dirty cups quickly!    (I overheard there is a cover from someone but I am not sure how much.)", 
    "review_date": "2014-07-21"
  }, 
  "OOQmg-zRIQCTwvIqLasc2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jasmin t.", 
    "review_text": "Clean, new, nice music, what's not to love.  Returned for my 2nd time in 2 weeks. Great drinks and it's empty, what's not to love. Empty = no wait!!!!! Yeah!", 
    "review_date": "2014-07-24"
  }, 
  "Y6YiC2R26d0FH5UGdwzOrg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lindsay k.", 
    "review_text": "My friends and I booked a last minute table with bottle service here for New Years Eve (and so this review is limited only to that one experience, as I don't typically frequent places such as this).   The venue itself is well-designed and has a great lounge-y vibe, lots of bathroom stalls, and two different rooms, each with their own bar and music - either EDM (Mark Farina is the man) or the Top 40/Hip-Hop DJ in the back - so you have a place to hang depending on what mood you're in.  I was especially pleased with the service we received by the bartenders, our cocktail waitress and the other staff! They were constantly checking on us, getting us what we needed, bussing our table, cleaning up the messes we made when we dropped our drinks (!!), etc.   The DJ in the back room where our table was was not aware of the time (for the countdown to midnight) and played a 6-0 countdown once we showed him our phones that read 12:00am. So that was kind of a bust. Also one of the bussers kept taking away my friend's shot glasses that she wasn't finished with (or so she claims).   All in all, the high-quality service and exceeding of my expectations for last-minute plans warrants a 5-star review! Thanks for a great NYE 2015.", 
    "review_date": "2015-01-02"
  }, 
  "xowlcdPSNY74u1tcvazCyA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Mike D.", 
    "review_text": "This place is ballin. Don't come here, you will make it uncool over time. Just kidding.", 
    "review_date": "2014-07-29"
  }, 
  "UVO0vrdc8Jfm00p7ixuf7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nolan V.", 
    "review_text": "WELL. All the drinks that my entire group ordered was watered down or the shots were small. Brought my group of ~12 there. IF the drinks were better, I'm all for giving more stars! Maybe it was just the bartender we had. Who knows.  Beautiful dim lit venue.  I would go back if I was in Union Sq area. Can hop in for a romantic night with my sweetie.   Bathrooms all the way in the back.  The cage on the dancefloor is fun for pictures!", 
    "review_date": "2014-10-08"
  }, 
  "evBgHn0yiLMAVMoaCy6W9g": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Ray R.", 
    "review_text": "I went there for the first this this weekend. i liked it.The staff was freindly and helpful. The sound system was on point. Great DJ and a plently of space to dance and get a drink.", 
    "review_date": "2014-08-11"
  }, 
  "-TP1eTVeob4X0eeUvqp9ag": {
    "user_rating": 2.0, 
    "user_location": "Upper East Side, Manhattan, NY", 
    "user_name": "Melissa F.", 
    "review_text": "if you like 'clubs' (in which case, we can't be friends), shitty music, scantily clad/tasteless patrons, and/or reserved tables for 'bottle purchasers', then this is your spot! otherwise, this place is pretty much the worst, and should not be a top hit when yelping 'cocktails'. peaced out of here real fast.  *Edit*- I was contacted by the manager, who informed me that this place is much different during the week. I will have to give it another go next time I'm in town. Stay tuned!", 
    "review_date": "2014-12-14"
  }, 
  "eKj7T9JZKsZuro0hUQ2rEg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hao T.", 
    "review_text": "On a dead night my two other guy friends got turned away and they just opened.  Bouncer said they wanted a even ratio of guys to girls.  But it's a dead holiday weekend and its guys that usually spend the money!  Not a smart move. Way to start your opening weekend.", 
    "review_date": "2014-07-05"
  }, 
  "Fe34pr8tYHGzEEs-fupdLw": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Sara S.", 
    "review_text": "Beautiful place! Great service. LOVED the state of the art sound system. Very classy, upscale place with reasonable prices. And I so loved the dancers. Will definitely go back to again!", 
    "review_date": "2014-12-07"
  }, 
  "voWlHDXittlvAmeiLlTzFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M M.", 
    "review_text": "Great new spot! Elegant and sexy cool vibe. Great bartenders, not too crowded, and clean/huge bathrooms.", 
    "review_date": "2014-08-30"
  }, 
  "ibvH1Y7Rh_tstiWgH0OFTA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica S.", 
    "review_text": "Been here a few times now and have decided that it's the perfect complement to downtown San Francisco. A bar, a lounge, a club...all into one with spacious rooms and elegant details.  The mixologista drinks are outstanding and reminiscent of Bourbon &amp; Branch and other speakeasy/artisan crafted cocktails.  $5 Cover on Weeknights and $10 Cover on Weekends starting 10PM or later!", 
    "review_date": "2014-09-05"
  }, 
  "tSBnnuodKgoXtM0lK9He6Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ramiro G.", 
    "review_text": "Great new lounge. Sexy decor and great drinks. A great place to go to afterwork and late at night.", 
    "review_date": "2014-07-07"
  }, 
  "U8xZnVaSyRDaoRJI0opgGg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "K O.", 
    "review_text": "perfect drinks. perfect ambience. perfect conversations. will go back again, again, and again.", 
    "review_date": "2014-08-21"
  }, 
  "htB7ndigLzcMgxXXxwyCUA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda L.", 
    "review_text": "New lounge in the middle of Fidi. I love the location, the speakeasy meets modern day lounge feel and the quality of drinks. However, having to pay  $10 cover for a lounge when there are so many other places in SF was a drawback. No food but they do give you popcorn with truffle oil which is always a plus!", 
    "review_date": "2014-08-04"
  }, 
  "JwlHgkZuXS6rNE9Za2IVMA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin M.", 
    "review_text": "Hawthorn. A huge contrast from its stuffy themeless predecessor Lot46. Hawthorn is dressed in vintage classic city decor of gold and dark brown hues... bringing out a little bit of Gatsby in the trendy and ever-changing SF. With the perfect setting for a firm classic cocktail, Hawthorn easily becomes on the top of my list for a good weekday wind down with their charismatic staff and easy going bartenders.  I'm in my thirties so I prefer a drink for sipping as I mingle with friends old and new.  Coming here solo wouldn't be a bad idea if you seem to be lost without an agenda on any given day with such an engaging crowd.  Don't be fooled by the relaxing environment I'm painting here... Hawthorn comes to life deep in the night with one of the best sound systems in the city. From what I hear they invested heavily into a pulsating nightlife experience. While your heart bumps along to the rhythm of the bass manipulated by the DJ it doesn't feel anything like the usual grimy club.   Come have a drink early in the evening with friends or come later in the evening on the weekends to get your groove on with a good looking crowd... either way it'll be a good night.  For that. 5 stars.", 
    "review_date": "2014-09-06"
  }, 
  "ifNSh6javeYLQBhlRyLi-g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle F.", 
    "review_text": "Sober as a bird... I got thrown out after a guy thew up on me because I was \"too drunk\" while the guy that threw up on me stayed.  When trying to reason with the bouncer he said \"good luck getting in here ever again.\" My response: \"didn't plan on it\"", 
    "review_date": "2015-01-24"
  }, 
  "UE-rXhA8njNnADFkDA3EuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Inigo M.", 
    "review_text": "Good place to dance (two rooms, one hiphop, the other house).", 
    "review_date": "2015-01-26"
  }, 
  "FXou2ExcuCiSNGDA5PFWWw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John S.", 
    "review_text": "I came in here recently on a Saturday night. I had an OK experience and will list out my pros and cons below, but for me the cons outweigh the pros and I won't be back.  PROS  - Great sound system  - Bartenders put out cups and pitchers of water - this was very much appreciated   CONS  - Poor ventilation on main dance floor. There were two dance floors, one main one in the front, and a smaller one in the back. I don't think the air was flowing over the main floor because it was sauna-hot. The rest of the bar was fine though.  - Mediocre music. The main floor DJ was playing some kind of loungy, slow-tempo beats that weren't really good for dancing. I know this place is called Hawthorn LOUNGE, but there's a dance floor and cover that make it more like a club. Sadly, not the music though.  - $20 inflexible cover, despite the fact that I (male) came in with three girls. I can tell you, from personal experience, that many other clubs in the city will waive the cover or give a discount when you come in with more girls than guys. Here, the cashier seemed offended that I would even ask.   - $3 coat check. This is greedy. When you charge a high cover, I think it's unreasonable to charge for coat check. Coat check is to make the customers life easier by not having to worry about their coats/bags while they dance. Making matters worse, the coat check was full when I arrived ~11 PM. Obviously, this means enough people were willing to pay $3 for coat check, but once you've shelled out $20 to get in, it doesn't make sense to not pay $3 for the piece of mind that your stuff will be safe. But like I said, I still think its greedy to try to capitalize on this.", 
    "review_date": "2014-12-23"
  }, 
  "nMcj8Ey_HXo0d_rmLUxHrA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony K.", 
    "review_text": "Congratulations! This is a great addition to SF lounge scene. I enjoyed the different areas and decor... I think this will be the new spot for those that enjoy happy hour or a night out... with elegant surroundings and cool music. Hawthorne has that 'Speakeasy' feel to it so try one of the hand-crafted drinks for the full experience.", 
    "review_date": "2014-07-03"
  }, 
  "KheemzNvPqrxDtOqdrOQ5g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith M.", 
    "review_text": "Now that I've been inside and seen what all the fuss is about I totally get it! What a great addition to the city night life scene. A really unique space, small and cozy but makes it feel more intimate and exciting. Perfect for a girls night out dancing, great music and vibe. The owners are lovely people, super fun!   ...still not a fan on the head bouncer though ;)  Can't wait to go back!", 
    "review_date": "2014-10-02"
  }, 
  "M9FHUPMUcnH82P-qUYCZLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily L.", 
    "review_text": "SEXXXXXXY Cocktails! LOVINNN the MUSIC  Dinner across the street at Hakkasan, then drinks at HAWTHORN is the Perfect San Francisco Treat!  Friends of mine and I was dining at Hakkasan when the A.General Manager suggested us head over across the street for Drinks after our dinner party ended. I mean, it's San Francisco. We definitely had choices but no cab needed, WE WALKED to our next destination..... Enter HAWTHORN.   No Cover Charge, not sure if it was just the night or us, a bunch of HAWT ladies (get it?!)   Here's what we ordered and I sorry if I butchered the names but I thought some of them waas down right clever:  NipSlip. (taste like Horchata with Cinnamon Bourdon). That drink was Amazing. I wish I had one right about now, lol.  Outer Sunset (I forgot what was in it, but it stuck with me) Amaretto Soiree (brings you back to the 90's)  We couldn't help but notice the DJ set up. It was like a Vegas style but more personalable. We danced till our feet hurt, then drank some more. Friendly bartenders and we met the Owners that evening.   I highly recommend HAWTHORN to anyone looking for the hottest lounge in the SF. If I lived closer to downtown, that's be our Happy Hour Spot!  GOOD LUCK and we will be back!! 5 Stars!! 5 Stars!! 5 Stars!!", 
    "review_date": "2014-07-13"
  }, 
  "NDhqGhklny_7VlUu3A-SOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mathieu F.", 
    "review_text": "Nice atmosphere", 
    "review_date": "2014-08-29"
  }, 
  "K-opDtaZ_yF4UBWDJXDa-Q": {
    "user_rating": 5.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Charles A.", 
    "review_text": "I have only Been there once and the place is super sexy, nice, great music, friendly people, ambience is very cool, hip, modern, cool place to come by your self or with a date or with friends and just chill!", 
    "review_date": "2014-11-17"
  }, 
  "TA5f9rpPGllhrjhIor8jNA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Karen Z.", 
    "review_text": "It's true, this place IS sexy. It's like a hot upscale Vegas club: gold-and-black snakeskin stools, gold pleather banquettes, low lighting, cool glass tables, candles, mirrors... I LOVED it!!  The drinks were great, too! I had two June and Tonics...awesome. Garnished with actual juniper berries. Very cool.  Can't wait to go back. The music was on point, too. 90's throwbacks, but remixed in a hot, modern way. We were definitely feeling it.  A new SF far for sure.  Close to Montgomery BART.", 
    "review_date": "2014-07-16"
  }, 
  "n_uBuauqzcx45z_RV5ZOfg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cam K.", 
    "review_text": "Went here last Saturday night and had a great time despite it being a bit overcrowded inside and having a long line + 20$ cover to get in. It was crackin tho, so you cant blame a place for doing well.   Great music + Well made drinks = Having too much fun and leaving my jacket in the coat check  Came back that Monday (bc they're closed Sundays) and talked to one of the managing partners, a nice guy named Chadwick. He initially couldn't find the Jacket on site bc he said that after every night they clear out the coat check (a bit weird), but he would talk to his employees and get back to me the next day.   Thinking that an employee made off with my jacket, I started to worry, but after a follow up email with Chadwick, he said he found it and held it for me for the next day. Theories aside, I got my stuff back and its all g.   Overall, a small blemish on a fun night. Will come back again.", 
    "review_date": "2014-11-20"
  }, 
  "qMZ_perKQ8uzwlWsJ78BCA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allan G.", 
    "review_text": "Unique, sexy. From the moment you walk in you feel as if you are among san francisco's elite", 
    "review_date": "2014-07-08"
  }, 
  "8lcvGjCDFOUl_puPQRtRSA": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jasmin P.", 
    "review_text": "First of all, the space is okay, the music was great (since I saw my favorite underrated DJ), but the service is HORRIBLE. If you are looking for a place where the service will literally put their hands on you and the security will do nothing about it, yup this is the place! The only reason why I made a yelp account is to RATE THIS PLACE, and I couldn't help it since I keep being reminded from the newsletters they send me all the time.  Now, this review is from the first and last time I will ever visit, 12/13/14. I was with a few friends to see Myndset that night, who is an amazing DJ. Throughout the night I had complications with the same blonde female bartender, who was completely drugged out of her mind. *After writing this review I noticed other people have had problems with a blonde female bartender as well.*  First encounter: I was taking $10 tequila shots (in case people are just curious of the pricing) with my friends. I went to pick up my lime and as I was reaching for it a blonde female bartender just snatched the limes from beneath me and threw it away. When I looked at her she turned around. So I said, \"Excuse me\" multiple times, but she completely ignored me. Eventually, I got my own limes, no worries right?  Second Encounter: Myndset finally came on and I was so excited. There were two girls in the front and I put my arm around them and said \"OMG aren't you excited for Myndset!\" I get completely PALMED in the FACE, and I almost fell backwards, but caught my balance and just took 7 feet worth of steps back. And guess who it was, the bartender from before. Now, I am not going to fight a random girl and get kicked out, when my favorite DJ just came on. So, I stared at her, waiting for an apology, in complete rage. Her friend looked at me and told her \"Come on.\" and they moved off the dance floor. Of course, I get no apology and since her friend didn't allow her on the dance floor, she decided to keep trying to harass the DJ and his friends behind the turntables. Yes, she was going up to all his friends and making out with them. She was so sloppy drunk and out of control a security guard had to pick her up, as she was kicking her feet like a child, and set her down on a seat away from the crowd. There, she was rubbing her face, legs, and hair, like she was on Ecstasy or something. I don't care if someone is on Ecstasy, not my problem, but why would an EMPLOYEE be that gone, at the place she works at?  At one point, I told the guard that she palmed me in the face and he told me that I shouldn't worry about it. Well isn't that nice.  When this place was closing, she was sitting on the bar, as her fellow coworkers were cleaning up. So is she still on the clock or just being annoying? Or both?  Anyway, if this establishment is going to employ somebody like this, and allow a woman to be that out of control... Wow. No thank you. From all the other reviews it seems like this is a \"classy\" place. There was nothing classy about my experience at Hawthorn Lounge.", 
    "review_date": "2015-01-12"
  }, 
  "oB1Ol_i9ooZwvQShyIxyrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimie L.", 
    "review_text": "This place definitely oozes sexiness. We hung out in the back room until we got kicked out for a private party. I wasn't too keen on the music they were playing in the main room.. it was more like lounging/ house? music, than music that made me want to dance. But, depends on what your tastes are.  (The private party in the back that had better music.) No cover charge for us, but had to have a table to actually sit down. Crowd was mostly Asians, 20s-30s. If you're looking for a hot, new place to come, check this place out.", 
    "review_date": "2014-08-04"
  }, 
  "l19mCpFoecDahVV6jOlCYA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Anthony P.", 
    "review_text": "I luv this place. I gotta say it flipped 180 from the Lot 46 it used to be. It looks hella better and the staff are amazing and super friendly. Our bartender was on point with the drinks especially that blue peruvian. I can't wait to go back and bring people. Also gotta hand it to my barber who introduced me to this place. I can't wait to go back.", 
    "review_date": "2014-08-24"
  }, 
  "MmltA0DVXyvVQKFzoOXeFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer A.", 
    "review_text": "Came here last night, and I loveeeee this place! Was out with a girlfriend, but I highly recommend Hawthorn for a date on an off night. Dimly lit, industrial, sexy feel. Comfortable, velvety seating. There's a cage on what I imagine is the dance floor when it's a Fri/Sat night, which I will come back for. DJ was playing some good tunes. I'm surprised there wasn't a bigger after work crowd.   Going off of the receipt, our bartender was Christina. She was very attentive considering she was the only bartender on duty, big props to her. And her drinks? VERY good. We wanted to get a taste of all that we could handle on their eclectic menu. We had the June and Tonic (very refreshing), Blue Peruvian, #Nipslip, aaaaaaaand I completely forgot what my friend had, it was one their sours. Needless to say, they were all amazing, especially the #Nipslip... it has horchata in it, what?!  I assume their management team was working the floor, making sure everyone was doing okay. Nice guys serving up FREE TRUFFLE POPCORN. How could you not love this place?  Thumbs up to this place, I'll def be back.", 
    "review_date": "2014-08-14"
  }, 
  "WfvpjKTyCbbxCrd2-N82Vw": {
    "user_rating": 5.0, 
    "user_location": "Ripon, CA", 
    "user_name": "Amy S.", 
    "review_text": "The owners have outdone themselves! Their love for music pours out from a state-of-the-art sound system, with bass beats that rock your body to its core while highs cut through the crowd like glass. To all my house music soldiers, Hawthorn is a must!", 
    "review_date": "2014-08-22"
  }, 
  "j0hSAp1Ww6yQtpx-MQgtXA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Sasha V.", 
    "review_text": "I hosted a holiday party here and cannot recommend Hawthorn highly enough. The management staff was super easy to work with, very accommodating, friendly and responsive. They went above and beyond my expectations. All my guests loved discovering this new venue!  Spacious, classy, good drinks. A great venue for happy hour and Definitely private events.", 
    "review_date": "2014-12-20"
  }, 
  "G9B6G4Vc3r6g18Kmyr4Qqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nate m.", 
    "review_text": "New lounge &amp; bar venue in San Francisco. Featuring a crafty cocktail menu designed by SF bar chef Ethan Terry (Alembic &amp; 15 Romolo). The space also offers a world-class VOID sound system and will feature DJ's to provide your after-work soundtrack. The venue is located just a few blocks from Union Square (46 Geary street between Grant and Kearny), and is also easily accessible via Bart. Great spot for after work drinks, and nightlife.   Drinks: Try the #NipSlip (Dark Rum, Stroh 80, and housemade Orgeat-Horchata) or the \"Outer Sunset\" (Mezcal, fresh grapefruit juice, and housemade Campari-Grenadine).", 
    "review_date": "2014-07-01"
  }, 
  "R93-o8qEzQI0fbB2SH-rgg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Lois R.", 
    "review_text": "I came here last weekend for a quick drink with one of my girlfriends. It's always so nice to visit SF, and I was glad to be around great atmosphere, great cocktails &amp; nice loungy music. I enjoyed everything about this place, it's a jem, and it is much needed in this area! So glad this place exists! The pretty blonde bartender lady, Her name was Kat - She was fantastic! She greeted my friend &amp; I very warmly and made sure hat we were taken care of. Her service was beyond attentive and I'm so happy that she was our bartender because she made the one of the best Hendrick Dirty Martini's. She was very welcoming and even if she was busy, she still made sure that we had cocktails in our hands. S  As far as everything else, the ambiance, the cocktails, the DJ's -- and the kick ass Bartender, Kat - I have to say this place is a great addition to the neighborhood. I'm coming back as soon as I get back in town!", 
    "review_date": "2015-01-26"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 3.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "My friends and I went here on 11-1-14 8:45pm'sh.  Doorman was cool to allow us in without cover charge.  The interior is presentable and my friend and I bought 4 whiskey sours ($8 each, decent price).  We sat on this couch for awhile (near the cage where one dj played house music), but then this one staff member told us it was for bottle service, alright we went to sit at another couch near the bar, another worker told us was also for bottle service, and then sat at another couch where this dj played hip hop music, again, security guard said can't sit there.  We can't put our drinks on those tables, can't stand near the women's bathroom.  Actually there's no place to sit unless one has bottle service. It's alright, if it weren't for my friends, I probably wouldn't go there.", 
    "review_date": "2014-11-02"
  }, 
  "APvZBQxa_3XFaYPCaJ2n1Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom M.", 
    "review_text": "Nice venue, classy look and feel, but it is let down by very slow service. Server and bar-staff are friendly and trying their best, but there is no denying you will wait a long time for your drink, even a simple bottle of beer. This kinda ruins the evening. However, service directly at the bar was much better, and the venue is new so it may be a case of staff training or the tuning the service workflow they have in place. May be could use a Gordon Ramsey style overseer on the floor to keep things running smoothly! Great potential.", 
    "review_date": "2014-07-12"
  }, 
  "H-YTBSrVuDH4m_sF0wt2IA": {
    "user_rating": 3.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Heidi B.", 
    "review_text": "Stopped in on a Thursday night and was pleasantly surprised.   The place was pretty empty, but the ambiance and music was perfect.    Ordered a Malibu and Sprite, and that was a no go (out of Malibu).  They also happened to be out of a few other liquors as well that had been requested.    We sat in one of the booths that was rather comfy and waited probably 15 minutes thinking a waitress would come take our order.  NO waitresses.  Kind of odd, but no worries.    Had a few drinks and enjoyed the music.  The cover charge to get in was $5.00. I guess not too shabby for a Thursday night.    I know this spot is pretty new, and I'm sure will pick up before too long, but not a good thing to run out of standard liquors.     I may give this place another shot next time I'm in town.", 
    "review_date": "2014-09-13"
  }, 
  "zDYghfGu7Ci6ZykooBXolg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon S.", 
    "review_text": "PROS: - Super friendly staff. The owners were extremely hospitable and welcoming even though they had many people trying to get their attention. - The venue itself is very unique and posh. You feel fancy when you hang out there - especially before it gets crowded. Take time to appreciate the artwork and furniture. - Bottle service is executed very well here. The servers pay A LOT of attention to the groups making sure we have a good time and get our money's worth. - Beautiful dancers and good music on the weekends. You really can't go wrong if you are looking to have a good time in a venue that is unlike most others.  CONS: - I honestly don't have any! (which is rare for me)", 
    "review_date": "2014-12-23"
  }, 
  "LIbcLDF-eYLaSA-jkxm6ZQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jamie s.", 
    "review_text": "As a new lounge in SF, I HIGHLY recommend Hawthorn.  Its upscale vibes (without been \"snooty\"), good vibe music (which just exudes sexiness), and hands-on owners (a must in any business to keep it thriving) keep me coming back for more.  Upscale and classy go-go dancers are out in sensual force on Friday and Saturday nights and add to the ambiance to make Hawthorn even more of a way to add flavor to your weekend delight!  I attended a private party in the back room after its opening this Summer and thought it a perfect venue to hold a small corp. party or gathering of friends to celebrate, whatever the occasion! What a find in the heart of SF!!!", 
    "review_date": "2014-11-17"
  }, 
  "n16f3NnD4JkkqQHXxz7MLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam H.", 
    "review_text": "Awesome sound system, big dance floor, reasonably priced drinks, deep house, and good decor. Solid place for a fun night of dancing and drinking.", 
    "review_date": "2014-09-10"
  }, 
  "y7oeeuOub0p-ih5Olbct2A": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tania D.", 
    "review_text": "I REALLY want to give this place five stars but the music was beyond boring for a Saturday night (in the main room)!!  Came here for a friend's birthday and we got bottle service. Walking in was a breeze, got seated at our table right away (near the dance floor), great layout, clean, cool decor and ambiance, didn't have to wait long for a drink (at the bar) and the drinks were not overpriced like other clubs.  Now the music (in the main room): the DJ only played deep underground house music w/ zero vocals. I do enjoy electronic music but tracks that I could actually dance to - hence why I came to a club rather than a bar. I would imagine that an empty dance floor is a good indication to play a different genre of music but the DJ didn't seem to pick up on that. For a club that is in/near Union Square and attracts tourists, I would definitely recommend booking DJs that cater to different types of people.", 
    "review_date": "2014-10-27"
  }, 
  "yWl9Y7hu7Yafo00A3F15tA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Christy M.", 
    "review_text": "On a recent outing, one of my dearest friends navigated a trio of us to the Hawthorn Lounge on Geary just a stones throw from Market Street. The entrance is subtle, like an old-timey speakeasy since, at the time of this review, there is no obvious signage for the lounge. There are two comely gents at the doorway though to steer you in the right direction, and the way in, is all the way down. The joint is cozy; rich in dark tones and curious embellishments, i.e. cage contraption just off the dance floor. We got a quick but thorough tour from Chad, a delightful host and Hawthorn partner. I got the impression all the meticulous care in the details, such as the exclusive sound system, Void, is all in place to make sure the ambiance is top-notch and distinctive from any other lounge in the area.", 
    "review_date": "2015-01-11"
  }, 
  "y_jl-bErj1mnb4KF04F74Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "Basic bar ingredients they were out of ... odd. Good service by bartender and door guy. We were there on a Saturday at 9 pm - things hadn't gotten started  yet. Sounds like an 'after work' place from what the bartender told us.", 
    "review_date": "2014-09-14"
  }, 
  "PrYC9aORyWwe1vBKZ4XuKg": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Zak S.", 
    "review_text": "Came here for a family members birthday. It was nice without being overly swanky. The bartenders were kind and made good drinks. Wouldn't mind coming back again. ($10 cover on Friday night)", 
    "review_date": "2014-12-02"
  }, 
  "2D1VP1Mr6xzBWlkvwNjc7w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Austin B.", 
    "review_text": "Went here Saturday when it was pretty quiet.   The blonde female bartender claimed there was a $20 minimum, but there were NO signs stating this.  Then the bartender then gave me the wrong credit card, and two other people the wrong cards. So now I have to cancel my card and wait 5 days for a new one.  Very unsatisfied with her service and unprofessional attitude.", 
    "review_date": "2014-09-07"
  }, 
  "5FjyN4m5XqMlrSVLtvUniA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian K.", 
    "review_text": "Highly recommend checking out Hawthorn on 46 Geary St. in SF. The establishment is classy, sophisticated, it's rich in decor and esthetically pleasing to the eye. Great staff, incredible music and the location is spectacular, in union square. What I love about it most is that it has a very unique speakeasy type ambiance. Well done HAWTHORN, looking forward to seeing you on a regular basis. My rating is 5 stars only because they will not allow more... I would give it 10 if it was available.", 
    "review_date": "2014-07-02"
  }, 
  "gytFjzBw-z5LZD-6JSMChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy R.", 
    "review_text": "Awesome new redesign of a great space. . Sleek seating and a really cool staff. Located close to public transpo and waking distance to other sf goodies.", 
    "review_date": "2014-07-18"
  }, 
  "lGNr8HxAbHfdHQr5Zs5GGA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura g.", 
    "review_text": "Overly sweet cocktails and overly loud music on a Tuesday night. Staff was nice but the venue is trying way too hard.", 
    "review_date": "2014-10-22"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "Very cool spot! Very upscale feel without upscale prices-I got a well made cocktail for twelve bucks and enjoyed the ambiance. Can be tricky to find a seat when there are reserved booths. Nice back area for corporate events.   Was crowded on a Thursday at 7 so I can't imagine what it's like on Friday/Saturday. Nice addition to Union Square mix. Will be back!", 
    "review_date": "2014-11-20"
  }, 
  "71IYrODaVPnVTAMcoQwelQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jonathan P.", 
    "review_text": "This place is awesome! Apparently a new club around the financial district. It's a nice venue inside with 2 rooms, one EDM and the other hip hop. The hip hop room was amazing, they play awesome song after awesome song, mix of new music and old school hip hop (Tupac, Nate Dogg, etc). I was actually initially trying to go to Hakkasan down the street (which apparently closes at 11:30 on a Saturday night). Cover was 15 dollars. Drinks are super strong. Cool place to hear good music, dance to good music, hang out with your friends, etc.", 
    "review_date": "2014-09-07"
  }, 
  "kjXC-SgnC65nGky5nY3UDg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Brian F.", 
    "review_text": "An absolute gem and exactly what San Francisco needs in the nightlife scene.  As you head down the staircase to enter the main area of the lounge, you feel like you're transported to this very elegant, sexy-feeling yet comfortable world surrounded by chandeliers and walls lined  an array of textures and fabrics and classical works of art.    There are plenty of couches, banquettes and chairs to sit at while you enjoy some high-quality drinks created by mixologists on staff. The Blue Peruvian is my favorite with its beautiful blue-green hue, fresh fruit juices, and floral aroma.   Great music from DJ's and artists throughout the week as well.  The main room plays soulful, deeper, and funky house music and the back room with more open format/hip-hop, and top-40 tunes... makes it so that everyone can find something they like.  The dance floor has a very inviting sense to it as well with the fabric ceilings drawing your eye to the inlet disco ball in the center of the room.    The Void Tri-Motion sound system sounds absolutely AMAZING.  Being an audiophile, I have to say that there is no better sounding club out there.  All the design elements used (dark wood, fabric and velvet textures, brick), the lower ceilings create, and the Void system create a warm, rich, and well-balanced sound throughout the club.   Two thumbs up, 5-stars, 10/10.  Will definitely be coming back!", 
    "review_date": "2014-08-27"
  }, 
  "waHkdgNvFdrbBtIKto8Iug": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Anthony K.", 
    "review_text": "The venue was nice balance of modern class. I came on a Thursday, the night before my flight back to Korea. Thursdays  usually brings in the hip crowd. This crowd was a late 20s to early 30s young professionals working in the city. Not anyone cute but what can I expect? The place had good hip hopity house music playing. Hawthorn wasn't a hard bar to get a drink which was reasonable at $12 for a Balvenie on the rocks.", 
    "review_date": "2014-08-21"
  }, 
  "xy0iXlNpFRLluPTgQvQT0Q": {
    "user_rating": 5.0, 
    "user_location": "Capitol Hill, Denver, CO", 
    "user_name": "Matt R.", 
    "review_text": "Nice little spot hidden below street level, low lit great vibe. Somehow snuck in before a cover charge was in effect. Drinks are reasonably priced, made well with a friendly staff. Next time I'm in SF I'll swing thru here for sure.", 
    "review_date": "2014-10-09"
  }
}