{
  "Sg_BvnTHsbc1AABiJjaiPA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian H.", 
    "review_text": "I love the vintage look to this place, and their strong cocktails. Polk street is kind of a mixed bag, but this is one of the good ones.  Cash only is fucking annoying.", 
    "review_date": "2013-11-13"
  }, 
  "5Z-3tcM07Pyc4mOF2Rjt6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "A Polk Street bar that could easily be found in the Mission.  I feel like anybody would feel welcome drinking here.  Though I do think the space is oddly big?", 
    "review_date": "2012-10-06"
  }, 
  "kRW6GXDxkjoGTR3XvropeQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keeks K.", 
    "review_text": "I told myself I wasn't going to post negative reviews on here.  I rarely feel a need to complain about sub-par service.  That's life!  It happens!  Get over it!  I laugh at how entitled people always are on here to having servers kiss their asses, especially when they lack a proper command of, you know, literacy. Or more importantly, being in the right in those melodramatic situations.   And yet...  I was having a fantastic time at Hi-Lo one night.  I sat alone at the bar, was carded (natch), ordered and proceeded to sip on a beer, while waiting for a friend to meet me before dinner.  The vibe was chill: some well placed candles lit the dimmed spot (in daylight when I was here before it's a little... weirder lighting - the skylight lends some fluorescent-like beams into the space, or something?).  There was some funky jungle-esque music playing.  I hadn't known if I liked Hi-Lo before, but I was coming around.  For sure, I was digging it.  Hi.  My friend comes, and tells the bartender she doesn't have her ID - it was hung up in some problem with an African visa situation, I don't really know.  The bartender protests.  My friend apologizes and says she doesn't need to order alcohol, she can just get a soda or wait with me as I finish my beer.  The bartender won't have it, and asks my friend - who is obviously beyond the questionable \"is she isn't she\" 21 charade - to leave the bar.  I thought how it was handled wasn't polite, but whatever.  If that's your policy and you fear your job will be lost, license revoked, and bar shut down if a 28 year old sits there for 5 minutes, psssh.  That's your prerogative.  That's fine.  I won't protest.  What irked me was what happened next.  After my friend walked out to make a call, insisting I finish my beer while she did, the bartender and guests at the end of the bar proceeded to call my friend an asshole and laugh.  Dude, why?  I promise you Yelp lurkers, on all yo mommas' graves, she was anything but.  And to do so while I was still there and within earshot, quietly sipping my beer like non-assholes do?  It left a bad taste in my mouth.  And so I left with that bad taste in my mouth, bummed I realized I don't feel like returning again.  Lo.  We got over it quickly enough, went to another bar where the tenders don't power trip, and enjoyed drinks together.  Hi.", 
    "review_date": "2012-12-01"
  }, 
  "o03ZwIhEEbKLxffxBmcuUw": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Mark A.", 
    "review_text": "A year's worth of KoKo's nostalgia possibly made my expectations unrealistically high, but I couldn't help but be a little disappointed with Hi-Lo Club. What I remember from KoKo's: Quality cocktails at a good price with friendly service and a laid back crowd. That combo's probably too much for any bar to pull off in their first few weeks of being open, so I'm willing to give them the benefit of the doubt as they work out the kinks.  The space is a lot more open than their old spot, with big floor to ceiling windows in the front. Lots of booths are great if you get one, and when we were there they had table service. Our server also doubled as our drink-maker. She was a great server, but not so great at the drink making. I had a Sazerac and an Old Fashioned, and they were both watered down and way too sweet. After every sip of the Old Fashioned, I considered abandoning it and going to another bar, but I don't like wasting alcohol when there are starving children in China who probably don't have any alcohol at all. It's just how I was raised. Other people in my group seemed to enjoy their drinks, so I may have just been unlucky. Things were also pretty busy that evening, much busier than any time I had been to KoKo's - not sure if this is because it's still pretty new or if it's going to be a permanent thing, but I like my bars a little quieter. Geez, I sound so old and not fun.  I'll come back here again, especially if I'm in the area, but I hope they are able to capture some more of the old KoKo's magic as things settle down from their opening.", 
    "review_date": "2012-06-11"
  }, 
  "lnisijp0YlSDOty3ywZsvA": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jeri T.", 
    "review_text": "When we arrived, a little too sober for our own good, we encountered an odd selection of drunken kids and professional alcoholics. The former looked desperate for, but incapable of, sexual activity. The latter looked indifferent to, and incapable of, the same. A quick glance at the price list explained everything.  Having fallen in love with the place, we resolved to return in the right condition.", 
    "review_date": "2012-10-02"
  }, 
  "B1uU8YhmcaFi9xlANuAo8w": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Renee E.", 
    "review_text": "After searching for a bar fairly near my hotel on yelp, I bookmarked Hi-Lo and decided to stop in my first night in SF. I really liked the vibe of the place. Dimly lit, but not obnoxiously so, comfortable....I walked in and sat at the bar, ordered a delicious whiskey cocktail and settled in. The first one was so good that I said fuck it and got another (which led to a longer evening than I had intended, but quite a fun first night in the city!) It's cash only, but there's an ATM in the back. If I lived in SF, I imagine that Hi-Lo would probably be the place I'd hang out the most for a chill weeknight evening.", 
    "review_date": "2012-09-14"
  }, 
  "0CqAmHUSWPEQdrnCbDiaVA": {
    "user_rating": 4.0, 
    "user_location": "Marina del Rey, CA", 
    "user_name": "Brian B.", 
    "review_text": "Cool little bar/lounge off Polk.  Friendly staff.  Decent amount of seating.  Nice enough ambiance.  Lots of local and foreign beers in house.", 
    "review_date": "2013-07-14"
  }, 
  "ti4lRf8rv9KICw6msOJT0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ameer N.", 
    "review_text": "I like the vibe of this place. It's a bit too loud to have a heart to heart talk, so bring that elsewhere.  Old Rasputen on draft, I love it.", 
    "review_date": "2013-01-18"
  }, 
  "7E3reTYHHQonO3jNVJ90PA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "hardy s.", 
    "review_text": "The ghost of Sam Spade haunts the Hi-Lo. Cooooooooooool joint for a cocktail or three.I really like the deco. It is where  the  the history of San Francisco is hidden away as it really was. No pool table but a great place to meet and score points with a chick as the ghost of San Francisco Past haunts the atmosphere. Love it!", 
    "review_date": "2014-07-09"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "I really liked this bar.  I have no idea why it's listed on Yelp as a dive bar.  It's one of the more expensive dive bars, that's for sure!    Love the atmosphere of the place.  It has that worn-in, been-here-forever vibe and it feels like it has come by it honestly.  It's relaxed and unpretentious which I find a million times more enjoyable than some of the other bars in the city that hired a design team to try and make it look old.  It's the difference between an antique and faux-finish.    Small yet interesting beer selection.", 
    "review_date": "2012-09-03"
  }, 
  "mIMvtx5r0OG12NadDUyGYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nette J.", 
    "review_text": "Hi-Lo has great cocktails in a great, casual atmosphere.  But my review is actually for their ESPRESSO.  At night, you might have noticed a beautiful antique espresso machine placed in the window, seemingly for decor.  But it's not.  During the day when the club is closed, the window opens and they serve delicious coffee from that rare and beautiful Gaggia machine from the 1950's (?).  Apparently it's the oldest one of its kind in commercial operation in North America.    I'm pretty picky about coffee and they serve a craveable cup.  And it's just plain cool to see that  Gaggia in operation!", 
    "review_date": "2013-09-22"
  }, 
  "PbmtoKdQ_Td9Ez_WwlEZig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam S.", 
    "review_text": "1.  I have a friend who always confuses Hi-Lo Club with High-Tide Lounge.  They are VERY different. 2.  Why is this listed as a dive bar?  It's not a dive bar.  I've lived in this stretch of Polk Gulch for almost three years.  Somehow for the first two, I managed to walk right by Hi-Lo without really noticing it was there.  It's mostly dark-tinted glass out front, with the side area where Iron and Steam does their thing during the day.  When you walk-in, it's no longer nondescript.  The environment makes me think of a bombed-out building in some European village during World War Two - believe it or not, I say that in a complimentary way.  Perhaps, romantically, I think this feels like a place where a soldier would spend the night and feel a dark and quiet refuge from the war that will come again in the morning.  Or maybe a place where the people from some French village come at night to try and carry on their antebellum way off life in the midst of chaos, knowing that one day this too shall pass.    The walls are distressed, and there is limited natural light coming in from a skylight.  The lighting fixtures feel impromptu - and, it is DARK once the sun is down.  You gotta take a few minutes to let your eyes adjust.  That said - the bar is beautiful, and they have an amazing selection of liquors and craft-beers.  I'm not a cocktail guy, usually, but I love their beer list.  It is a little heavy on the import-side, but that's fitting for the vibe.  And back to the dive bar statement - this place is WAY too classy for that.  The service is really knowledgeable, the products are good quality and I would rate the crowd as upscale but casual, good age-range, no fratty-douche bags.  And, it's never loud or obnoxious.  Not a bad place to go after a late dinner to have a quiet conversation with someone.", 
    "review_date": "2014-07-02"
  }, 
  "APvZBQxa_3XFaYPCaJ2n1Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom M.", 
    "review_text": "Really nice looking place, and not too crowded with B/T or Marina clowns like a lot of the bars have become on Polk St. However, both the Derby (couldn't taste the alcohol) and the Martini (not chilled enough) I tried were sub-par, which is very disappointing for a cocktail bar. It may have been the bar tender I had was not up to their usual standard. I doubt I would come back if looking for a cocktail, but I would pop in for a beer.", 
    "review_date": "2014-03-30"
  }, 
  "K7-zOceF1slgqJTZSKe7YQ": {
    "user_rating": 4.0, 
    "user_location": "Imperial Beach, CA", 
    "user_name": "Nadiyah S.", 
    "review_text": "I highly recommend the Gunsmoke drink with cayenne pepper. It's amazing!  This bar is great cause it's low key, they serve great drinks, and you can actually sit and have a conversation with your friends without shouting.  Fair warning- like many other places in sf- cash only.", 
    "review_date": "2012-07-05"
  }, 
  "1m4Hmm7IbgGjVupM7CQSMw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki M.", 
    "review_text": "Yay Koko's 2.0. So excited they are back in a great new space. Plenty of room. Long bar and comfy booths. Being able to get a Modelo fully loaded and a \"smoked weed\" cocktail again makes everything make sense again.  Welcome back!!", 
    "review_date": "2012-06-10"
  }, 
  "_W2od_YLTYljq9bb-n-1xA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "To sum it up: The perfect dive Returnability: Every week Superstar Factor: The quiet supporting actor in a kinda shitty movie who manages to make you actually feel something akin to emotion in your little cold, dead heart. They probably deserve to be a main star since they're kinda the only ones with any talent around.  What? I don't get it. Supporting actor?   Whatever, if you don't get it, you don't get it. I'm tired and I don't really want to tell you about one of the newest bars to make it into my rotation. But I'm gonna do it anyway, because they deserve it. This says it all:  strong, well-made drinks and good selection.   The end.   Fine Go there. Check it out. Fall in like. I don't wanna, but I guess I'll share.", 
    "review_date": "2012-10-24"
  }, 
  "G9J2uWRrPltfq2rHxSCC8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Milan T.", 
    "review_text": "Very cool spot amongst a lot of party crazed, drunken-messiness of Polk st. Great interior atmosphere that doesn't make you feel grungy while also not being pretentious. Great spot for a nice cocktail or just to throw back a few pbr's!", 
    "review_date": "2014-07-26"
  }, 
  "EuHn-gKS2XzZF1ZoizFtHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Henry A.", 
    "review_text": "So stoked these guys have re-opened with their awesome cocktails.  Just hope the plan to keep a TV out of the place will keep Marina douche from pouring in.", 
    "review_date": "2012-06-08"
  }, 
  "8ilyzfFshDcCF0zIjsp0VA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack F.", 
    "review_text": "I loved Koko's and now this..what a treat. Hopefully it will not be drenched with the Marina spill over.", 
    "review_date": "2012-06-07"
  }, 
  "KXSzTO-bi6_Fcysm0mEHpg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ru C.", 
    "review_text": "the venue seems a little old and dirty but the drinks are pretty decent? may get a little heavy i guess since one of the girls in our crowd said her  old fashion was really strong haha. but i think it's an interesting place to hang but i think this place is neither a dive bar (i was expecting darts, pool table...n some other typical dive bar stuff ahaha), or an actual club! so the name is confusing LOL!", 
    "review_date": "2012-12-11"
  }, 
  "_don8EWxNsvRdjDJqWbw0w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine E.", 
    "review_text": "Had a great time here, but seriously you need to accept cards!!! Was unaware it was cash only before coming, so had to use their shitty ATM which charged me $3 and my bank charged me another $2.50. This alone makes me not want to go back.   Bartenders friendly, cool ambiance, nice drinks, good music and energy---but the cash thing...ugh. So annoying.", 
    "review_date": "2014-02-25"
  }, 
  "V4nNUVs8X9ncc8eAJ9unvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine L.", 
    "review_text": "Hi-Lo is one of my favorite bars on Polk Street. It's a great starter bar if you're out for a night of barhopping, or a great \"break\" bar if you're looking for somewhere calmer to wind down. There's nothing too interesting or unique about it -- I know that doesn't sound like a positive trait, but for me it is. The unique bars on Polk Street (like Soda Popinski's) are always so crowded that I often find myself looking for a quieter place to relax.   The atmosphere is dark and intimate, with a large standing space. From the exterior, it doesn't look like anything special (gray and boring-looking, with a faint \"Hi-Lo\" sign and a bouncer in the front), but once you step inside, you immediately feel more comfortable. The decor is classy-hipster, with hardwood flooring and concrete walls.   The bartenders are nice enough, and knowledgeable about their drinks. My friend told one of the staff to mix something random, and he whipped up some fabulous concoction that I downed within a few minutes.   **NOTE:** If you're looking for somewhere to dance, this is not the place (yeah, they shouldn't be calling it a \"club\" at all).   **TIP:** THIS PLACE IS CASH ONLY. There are definitely ATMs all over Polk Street, but if you only have a card on you and you don't want to pay any service fees, you might want to bypass Hi-Lo.", 
    "review_date": "2014-08-04"
  }, 
  "RB53Qw49yEbtkWGJ9cJXdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B Y.", 
    "review_text": "I kept walking by this place, and saw faint glimmers of action inside. I finally went in, and it's a nice spot. The front of the place seems a little empty, but the booths and counter are nice. Nice strong drinks, but this is cash only, so I gotta ding it.", 
    "review_date": "2012-06-29"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "This is a really intimate and cozy place. Personally, this is the type of place you would bring a date to. Unfortunately, I came in here with a friend to celebrate, but we ordered some girly drinks anyway and weren't ashamed. The service was fast, nice, and friendly. The drinks were actually pretty good, they have a large variety of specialty cocktail drinks. It wasn't crowded at all on a Saturday night. The patrons seemed very young and hip", 
    "review_date": "2013-05-05"
  }, 
  "iOjwFYpHWo7P0rqmIfLm9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah M.", 
    "review_text": "Wow...This little club is what makes this neighborhood great...pass by the crowds of people trying to get into playland and after the Pour House closes- come here for a fresh squeezed Greyhound or a Gin Fizz. Its old timey done new. Grab a booth with your Hipster friends after band practice and enjoy this town you live in.", 
    "review_date": "2012-08-21"
  }, 
  "upRh352VwnipRRWsnJP8SA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlin F.", 
    "review_text": "Talk about a hidden gem! I almost don't want to write this review in attempt to preserve the secret. This is an awesome cocktail bar meets a group of hipsters drinking beers out of cans. The bartender was really friendly and serves up perfectly delicious cocktails. The decor reminds me of a trendy loft and a dive bar all at once. It's cash only too so make sure to brink some dollaz!   I hope this place stays cool, so only tell your hip friends.", 
    "review_date": "2013-05-03"
  }, 
  "bGhC6ryRqVni23HXQYbG1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "carolyne c.", 
    "review_text": "I stopped by for happy hour one day to check this place out for a potential spot to have cocktails with friends after a movie, before dinner or just because.  I had the most amazing lemon drop with fresh squeezed lemon juice.  It turns out that is their thing fresh juice in the drinks.  Brilliant!  So last night I did suggest a friend and I go there for a drink before dinner. Again our drinks were so good my friend wanted to stay for another.  Now these were not wimpy drinks and I am a light weight so I talked her out of it.  I know we will both be back and will bring more friends to share the experience. Also we were unsure of where to have dinner so asked the bartender.  He ended up giving us a list of places in the neighborhood.  It wasn't too busy so he had time to do it. For the people who rip on the service, not sure what happened, but both times have been positive for me.", 
    "review_date": "2014-05-04"
  }, 
  "KmqivnDXe3mVjBtp9ZxkOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley H.", 
    "review_text": "this place totally has \"new bar smell\" so awesome! i love it. been here a couple of times and its a nice place. def like it. its cash only :( but my bank is across the street so it actually isnt too bad. the music here was actually pretty good. put me in a good mood. def a great place to start off a night!", 
    "review_date": "2012-11-26"
  }, 
  "fHnAHkd0rNscAXlWpy7M9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "Not really a dive bar in my opinion... it's been gentrified by hipsters. With that being said, I'll probably be back quite often because it's so close to my school. It seems like a fair share of the teachers actually come here too haha.   There's ample standing room and a bit of seating. Good for large groups. Drink prices are pretty fair as well. Though I'll have to come back and give some of the cocktails a shot.", 
    "review_date": "2013-01-20"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "Fun bar, cute private rooms in the back, casual and amazing bartenders making nice strong drinks!", 
    "review_date": "2013-01-22"
  }, 
  "OqH85SAF0oLijVY_SeAk8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donna H.", 
    "review_text": "Feels like coming home. Skillfully crafted delicious cocktails, 10 (nicely chosen) beers on tap, blood, sweat, and likely some tears working on gutting this place and building this beautiful bar. From permits, to hearings, to construction, I've been sort of kept in the loop, so when I heard about their opening, I was psyched. I finally was able to check them out today, and it seriously felt like coming home. They have a spacious bar area, ample seating, and I love the booth layout. The skylight adds some nice natural light, and I even noticed some familiar faces from the KoKo days. Congrats Lori, Chris, and Justin! I forgot to ask.. Did you keep the special findings from when you cleaned out the holes in the floor?", 
    "review_date": "2012-06-21"
  }, 
  "e0c2kNFKEuq4GLJhxtR4fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt S.", 
    "review_text": "Cool place, great bartenders!", 
    "review_date": "2013-05-25"
  }, 
  "Mru47pGvpa64AlqA2UCfbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley W.", 
    "review_text": "i love the atmosphere of this place.  it gives you the feeling that you are tucked away but it does not offer any pretentiousness.  the bartenders know what they are doing and they are offering classic and speciality cocktails.  there are little booths to sit in and a long bar.    i don't go to polk street on friday or saturday nights, so i am unaware of how packed this place gets at that time. but my two friends and i managed to get seats at the bar on a tuesday around 9pm.    the drinks are reasonably priced too.  this is definitely a spot that polk street needed.", 
    "review_date": "2012-08-24"
  }, 
  "fVUGECEZMCqKO1WCTIHtdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marie A.", 
    "review_text": "Actually really nice for a dive bar. CASH ONLY. CASH ONLY. They do have an ATM but cash only. Not easy to find on Polk. There is no dance floor or food service, just liquor. The service is pretty good. Although it would be labeled a dive bar, it's actually very clean and nicely furnished for anything on that part of Polk. It's also very dark and cozy for a relaxing bar atmosphere.  This is a great place to meet up with a large group of friends before or after dinner or to have a large happy hour. Our running club uses this as a celebratory watering hole for race celebrations. The street itself and some of the surrounding pedestrians can be disturbing and off putting so be aware. The bartenders and doormen keep the bar itself free of stragglers and very safe for its consumers.", 
    "review_date": "2014-08-06"
  }, 
  "HyGuZIfb_jwjXzMCerAJ4g": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Ellie W.", 
    "review_text": "This place is so completely hole-in-the-wall charming. Dimly lit, unpretentious, it has a charming vintage feel that I love in bars. The bar is lined with antique mechanized cash registers, stocked to the 9's, with really friendly bartenders. I wouldn't consider this a dive bar, but just...vintage. It's not old and complete with a floor that's so sticky you'd think you were in a frat house, the way I typically think of true dive bars. It's vintage and in its own way, a touch vintage-classy.  For some reason, it reminds me of the scene in any given movie where two people have a REALLY deep, insightful conversation in their booth, under the fluorescent half-dim candlelight-like bulb that hangs from the ceiling, surrounded by a bar full of half-rusted antiques.   Cash only, so bring your Benjamins if you're planning on hanging out for awhile. Well, more like a few 20s. But you can still bring your Benjamins if you wanna to look like a baller. Just don't make it rain. There's a time, and a place...:)", 
    "review_date": "2013-02-23"
  }, 
  "49i_lNeYqx9jXLPkyyfZww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linh S.", 
    "review_text": "Spiffy window for espresso now at hi-lo. Very strong/acidic/delicious and warrants the sparkling water back.", 
    "review_date": "2013-07-21"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "Door guy cool. Bartender with sleeve tats? not. I guess serve girls first, even though we've been waiting first. Took our money elsewhere.", 
    "review_date": "2012-07-05"
  }, 
  "nVK5ZZ9IDjUX1WFJzzbYKg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan P.", 
    "review_text": "The Hi-Lo isn't exactly a speakeasy and you don't need a secret password at the door, but that's not to say you won't walk right by it on Polk Street.  The bar is disguised under the awning of it's former establishment, and unless you're looking for the gilded letters on the window it's easy to miss.  Unless of course it's 10pm on a Friday when it turns into the hotspottiest hotspot on Polk Street.  And for good reason.   Everything that was great at their previous incarnation, Koko's, has been tweaked and tempered until nothing was left but sweet and sublime.  Craftsmanship is evident in every detail, from the bar that occupies the length of the establishment, to the weathered walls, to the delicate silhouette of HI-LO from the window stencil that shows on the opposite wall in evening light.  The lighting is brighter than Bourbon and Branch and feels more authentic.    Drinks are bohemian, boozy, and about $12 a pop.  You get what you pay for, and a few of these will leave you reeling.  Hopefully into Victor's Pizza next door, for one of the better slices on the street.", 
    "review_date": "2012-06-26"
  }, 
  "zIXwL0ciAFaff-zfBgpBWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sar h.", 
    "review_text": "This is a blink-and-you-miss-it kind of place, tucked in between a busy block of Polk Street. I can't tell you the number of times I've passed it without realizing that there is actually a bar there!  Went there for the first time yesterday, and it was great. They have $1 off draughts during happy hour and a pretty decent selection over all. Even though it got a little crowded as the evening progressed, I never had trouble hearing the people in my group (we were sitting at a booth).  It really sucks, though, that they don't accept credit cards. If they did, I would have probably given them 5*.", 
    "review_date": "2013-01-19"
  }, 
  "98OkNNWig86yBM_ZoAeHOQ": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Uei L.", 
    "review_text": "A place where Steve McQueen would be after a day of filming Bullitt. Has the look of seediness of that time in the light of candlelight and dimness. Just because of the length of the bar it could have been a soda counter without the soda.  The bartenders knows their craft and the mixologists within will be happy with what they have on their menu.  Will come back.", 
    "review_date": "2012-07-09"
  }, 
  "BbAyOwFx27Zhf7hxovHr7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yalda M.", 
    "review_text": "Terrific, little hole-in-the-wall, trying to be divey- but-not bar.  Fantastic drinks but CASH ONLY, so make sure to stop by the ATM on your way.", 
    "review_date": "2013-02-12"
  }, 
  "iIcBsfWeTxsmIyYuTXkxBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mateo L.", 
    "review_text": "Might this be the best bar in San Francisco? It certainly is one of the best, if you like a beautiful setting with engaging bartenders pouring delicious cocktails from an ever changing menu. Come early for an interesting mix of neighborhood regulars, later for an eclectic range of San Franciscans - it always feels like a casual party at a friends house, what could be better?", 
    "review_date": "2013-07-28"
  }, 
  "l3wen_7bmm0mM7HayNZzgQ": {
    "user_rating": 5.0, 
    "user_location": "Anaheim, CA", 
    "user_name": "Joey G.", 
    "review_text": "If you're on Polk St, come here!! Bartenders are awesome. They can have actual conversations! Environment is great. People are friendly.", 
    "review_date": "2014-01-27"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "From what I've been told, Koko's would have been my favorite bar in town if I lived here when it was around. So, I insisted we check out The Hi-Lo Club. Often I'm suggesting off hours to convene for a drink -- 4pm on weekdays or 2pm on a Saturday... or 1am on a Wednesday. I really do this out of respect for the bartenders as... say... there's a good chance I have a hankerin' for a gin fizz, and in a bustling crowd it's poor form to order one. With that in mind, we arrived at 630 on a Friday -- their second Friday being open.   Martinis and Manhattans were the orders and they crafted a Rittenhouse Rye Manhattan that was pristine. They served it in a vintage coup glass. (If you would like to take me home, note: serve whatever you're serving in a vintage glass.)   Some don't like it loud. Some don't like simple, open design. I do. Diner table booths. Concrete walls. High ceilings. It's loud. It's airy. It's comfortable. Note: the prior business's awning is still up that reads \"crepes, pastries,\" and 1423 is the correct address. Cash only. ATM across the street.   The last thing I was expecting was table service -- on a Friday at 7pm... table service they had, and five stars they get.", 
    "review_date": "2012-06-10"
  }, 
  "XYc6FmCJlEeGgdreWYHd_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna P.", 
    "review_text": "Don't blink or you'll walk right past this place.   Walk inside and it looks like there was a fire, but in a cool artistic way. High ceilings.  They have great drink choices, offering water which is really great to keep you hydrated when drinking an 11% alcohol Belgium beer. yum. Nice bartenders! I will be back Hi-Lo!", 
    "review_date": "2013-02-24"
  }, 
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "Dimly lit, you might have passed right by the tinted windows on Polk Street without noticing the flickering candles.  During the day, the Hi-Lo is like Diana Prince and at night transforms into Wonder Woman (believe me, I know nothing of comics...I was just a little girl who watched too much TELEVISION).    Seriously, I might not have known about this place, had I not seen the flickering lights and people with drinks in their hands at 5PM on a weekday when walking buy a couple of months ago.    Well, I dropped in with an acquaintance a couple of days ago and we bellied up to the bar.  After a swift perusal of the cocktail menu, which consisted mostly of whiskey, bourbon and rye (no complaints here), we ordered some beer (Hofbräuhaus München Dunkel).  The specialty cocktail list is very select and there is a relatively hefty list of spirits and beer.  All in all, before midnight, I loved the atmosphere because it's dark, it's intimate (as intimate as can be with many other people hanging out) and the blue crackled walls and tiled ceiling with sky light give off a pretty cool vibe.  The inside looks unfinished, rugged and like a good bottle of half drunk whiskey, you can't help but be attracted to it.  Well, I guess that last statement is only true if you're like me and like a good swig of whiskey.  Shortly after midnight, I turned into a pumpkin, but that's seriously when the crowd and noise level kicked up.  If you're into lively crowds then, arrive here anytime after 10PM.  My assessment:  pretty friendly crowd, decent bottled beer and a cool; yet, unpretentious vibe.  I would not necessarily categorize this as a \"dive\" bar, but a \"local\" watering hole.  I'll totally be back soon.", 
    "review_date": "2013-11-30"
  }, 
  "_ngDdNFUdZNssmOePRbpyQ": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Beatriz L.", 
    "review_text": "When I first saw it I thought that the place was falling apart lol The idea of the bar its to look like its old and bizarre, loved it! Cocktails a little expensive ($9*)", 
    "review_date": "2013-05-02"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Really cool local spot. Just a great vibe, really good cocktails and a good selection of beers.", 
    "review_date": "2013-06-25"
  }, 
  "qK5GQYyckJx_5tyqDtqrXw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Glenn L.", 
    "review_text": "My friends and I made it to Hi-Lo just enough time before they closed!   PROS: + I liked the layout of the club!  + Bar on the left and seats on the right! There's plenty of seats, so it's perfect for a group to just catch a drink and relax! + Friendly staff  CONS: - Cash only... BOO!  To sum it up we had an okay experience here. Didn't love it or hate it, but I'd definitely come back here in the future!", 
    "review_date": "2013-02-07"
  }, 
  "GkGRnqa9NUZK-913K3WIvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "becca w.", 
    "review_text": "One of my new fav hipster dive spots in the city. Why? because it is a cool bar without too many hipsters. I mean they are there... which makes the place look trendy, but they aren't IN YOUR FACE kind of there so you don't have to mingle with them if they aren't your scene. For me, I'm just too old school to talk to \"trendy\" types.  The drinks here are great! and I just love the old timey decor. I love these bars where the bartenders really take the time to make you a good drink with fresh ingredients and quality liquors. The bar staff are all very knowledgeable about the drinks and about random chit chat too. I'm the kind of drunk that sits up at the bar and talk people's ears off, and they are really chill about that. (also why I like dive bars, I'm not suited for fancy establishments)  I used to bartend at a dive in LA... I would warn people not to drink the well because it was pretty much poison. So I greatly appreciate these hipster dives where they don't serve that kind of crap but do retain the chill atmosphere and therapeutic bartenders.", 
    "review_date": "2014-03-17"
  }, 
  "Wu5nuGyNR7MGAR8dG7MaQQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyler C.", 
    "review_text": "This place is awesome. Great beers on tap (Firestone DBA) and a great drink menu. Very cool ambiance. The only slight negative is the extremely low lighting, but if you get a booth with a light, its great.   This may be my new go to weeknight drink spot on Polk.", 
    "review_date": "2012-08-09"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "I don't want you to know about Hi-Lo Club. It's a place I love, my favorite bar in the city. The last thing I want is to have it crowded with your smelly friends and their smelly friends and especially that guy that always tags along with you. He's weird. Anyway, I don't want you to know about their amazing cocktails, their great beer selection and their happy hour deals. I don't want you to know, specifically, about the Creole Cocktail #2, one of favorite drinks in the city, or the Firestone beers and Sculpin IPA on tap. I definitely don't want you to know about the amazing owners and staff--particularly Lori, Justin, Chris and Keith--who always greet with a smile. I don't want you to know about these things because Hi-Lo Club is my favorite bar in the city.  So don't ask.", 
    "review_date": "2012-09-21"
  }, 
  "gJTknzE8KYeqGwYLif42CQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenitha Y.", 
    "review_text": "It's a nice bar and definitely somewhere I'd go if I wanted to lounge with a few cocktails and a good conversation.  With that being said, I came here expecting to get super trashed and my expectations for that type of night wasn't met.  The one thing I didn't like was that it's cash only... for a bar? Don't expect me to buy a bunch of drinks with that philosphy.", 
    "review_date": "2013-12-23"
  }, 
  "61UpkMkyNGllmSLRRBDBsA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dzney V.", 
    "review_text": "So... if it weren't for one thing, I'd give this place a 4. But....  I went there with a couple of friends, I arrived first. Wasn't ready for a cocktail, and ordered a glass of their tap wine. Don't do it. This is a cocktail place, and this is what they know. The wine was bad, I cautiously sipped it for a while not wanting to complain, but then my friends came and confirmed that it was in fact really bad. Not a bad wine, just a bad keg. It was completely corked.  I think the woman that was serving us was the owner, I politely (reluctantly) asked her if the keg was old, and she said she had just opened it and very nicely offered me something else. I ordered a Pimm's Cup which was really tasty. But then she came over and charged me for the drink (I had already paid for the wine). All my friends were shocked--that was not the impression she had given.  I paid, not wanting to cause a scene, but it was really rude. I had been planning to leave her a nice tip for changing my drink (and the $2 difference in price), but instead I left nothing.  I most likely won't be going back. It's too bad. The place has a cool atmosphere, but I feel like the owner/bartender took advantage of me. Not a nice feeling.", 
    "review_date": "2013-01-27"
  }, 
  "nHAOyMf6z8ZNRVGjFvN0hw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan L.", 
    "review_text": "Awesome cocktails.. killer, diverse whiskey selection... friendly ish staff and really interesting post modern/industrial decor. Just about the only bar on Polk st that gets my business.", 
    "review_date": "2014-10-03"
  }, 
  "CCXniyeQdXOTw-_rda_skQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ixchel M.", 
    "review_text": "I was out of town when I read about Hi-Lo's opening, but the fact that it was in the exact location I had been wanting a bar to open, put it on the top of my list of things to do when back in SF.   I love the interior design, the light that filters in through the front windows, and the friendly crowd.   Drinks were strong and tasty - I'll definitely be coming back.", 
    "review_date": "2012-06-15"
  }, 
  "RbyNYVi0_xx7hUA1NEbCuw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kerri h.", 
    "review_text": "I LOVE the Hi-Lo! It's my go-to spot when i'm on Polk Street. They make a fine cocktail, the bartenders are knowledgeable and helpful, and I love the decor. It's hands down one of my favorite bars in the city :)", 
    "review_date": "2013-09-18"
  }, 
  "Dy2fpIPasQlB9vruP0BvLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Malcolm M.", 
    "review_text": "This is a City favorite. Justin is a phenomenal bartender with impressive knowledge of alcohol and mixology. Enjoy!", 
    "review_date": "2013-12-25"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "I loved KoKo's and I'm happy to see them move, expand, redux and impress.  The space is huge and looks great. Plenty of seating and plenty of room.  Polk St. is officially bar hopper's heaven.  The block they're on now has everything you could possibly want.", 
    "review_date": "2012-06-06"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "Really, who uses a jigger anymore?  These guys.  The drinks are tasty but exactly as potent as they \"should\" be.", 
    "review_date": "2013-04-02"
  }, 
  "21e19FbSNbkoLcpOXAxWtw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "bmwcafe c.", 
    "review_text": "what a great bar! a wonderful establishment with a very good cocktail and beer program and a hard to beat atmosphere! the details are amazing! and very nice and crafty bartenders! some reviewers got it totally wrong and the yelp categorizing didn't help much either. this is NOT a dive (in a sf sense) but an authentically vintage looking bar circa 1912.  the owners are definitely not hipsters, way too old. sf bar veterans since last century they looked like that 25 years ago already...", 
    "review_date": "2013-02-15"
  }, 
  "w85ExtcWtZv2tZ35NxN9LA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew C.", 
    "review_text": "How did I JUST find out about this place?  The owner is super friendly and has a good selection of whiskeys and bourbons.  He's happy to offer you a recommendation; just tell him what you like and I'm sure he'll find something that'll make you happy.  Mid-tier whiskies are about $8.  Bathrooms appears to be recently remodeled and very clean.  Cash only.", 
    "review_date": "2012-10-16"
  }, 
  "zoucVJhrlvtPX-eQzSGUzw": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Daniel R.", 
    "review_text": "Surprising find on Halloween night. Ordered a couple whiskey sours. Fresh fruit, stiff pours, great drink. I'm sure I'll come back again.", 
    "review_date": "2012-11-08"
  }, 
  "mLHgb6eufSegCbLkqPS-EQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sami B.", 
    "review_text": "This place is as good as it gets. If you like dim lighting, amazing cocktails, great customer service, and a relaxed atmosphere, this is the spot. The owners/barstaff are very experienced and knowledgable about their cocktails/liquor. I would recommend going out of your comfort zone and trying a specialty cocktail rather than your go-to. They really know what they are doing.   I would recommend this to anyone. Great job guys!", 
    "review_date": "2014-07-03"
  }, 
  "qqKddLtLxbPnTf6c7yqS3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "around town e.", 
    "review_text": "Great bar that was super accommodating for our group.", 
    "review_date": "2013-01-01"
  }, 
  "Q8TGsARjdIfWsnXqgQYHhw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "Came here after work and we were had the place to ourselves.  I did not have any cocktails but their whiskey selection was above average.  I say that because behind the front line, I found a hidden gem in the form of Pappy 10.  It wasn't exactly what I was expecting but it was a sweet surprise nonetheless.  Bartender is friendly and everyone loved their drinks.    However, one of the qualifiers for Pappy is that it's going to be EXPENSIVE.  For a $39 bottle MSRP, it cost $20 for a pour.  Now that's fine with me, I'm not going to argue the price because I KNOW (believe me I do) how ridiculous it is to come across a bottle like that.  My issue is with the CASH ONLY business model.  Sure you can get more value out of your business but if you're going to offer higher-priced liquors, that model sort of goes out the window.  If you are going to have any number of drinks at Hi-Lo Club, you'll be racking up ATM fees like crazy (actually, THAT may be the real business model...lol) unless you carry fat wads with you all the time.  All in all it's a pretty good location and another place to note down where to find a rare pour of whiskey.  However, just be sure you stop by the bank beforehand.", 
    "review_date": "2014-12-30"
  }, 
  "JnUObp6gj3HUvaI6ubTzWQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Lin C.", 
    "review_text": "Love the low-key atmosphere of this place. I've passed it so many times without knowing what was hidden behind the dark opaque doors, but I'm so glad I discovered Hi-Lo! There is a good selection of beers and yummy cocktails. Beware of the spicy drink (the one with cayenne peppers), though!   And don't forget to bring wads of cash (it's cash only)!", 
    "review_date": "2013-07-24"
  }, 
  "UFSqHR-4nBlkR2c9xTLusw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geoffrey L.", 
    "review_text": "I went in on a Wednesday night and was caught off guard by a snarky, rude bartender.  Not sure what his problem was but I found it to be surprisingly lame for such a cool looking place.  I split and went to Amelia down the street:  <a href=\"/redir?url=http%3A%2F%2Fwww.ameliesf.com&amp;s=6ec937ff3727fa15a7810280ed591576d9d8bc3704f5f9b504084a214725d31e\" rel=\"nofollow\" target=\"_blank\">ameliesf.com</a>  There's a big difference between hipster and doush, or is there?", 
    "review_date": "2013-01-03"
  }, 
  "r3UmPWmn_e62xJpEngrAxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Selina W.", 
    "review_text": "Awesome interior. Dim lighting, but not pitch black.  Cocktails - $9 \"only\". Cash only, but the bartenders are quick and drinks are delicious! Gin, Vodka and Rum drinks.  Bouncer at the front is polite as well :)  Cannot wait to come back!  Wouldn't really label this is a dive bar. It's actually quite intimate,romantic-y.  Great crowd, good vibes for sure.", 
    "review_date": "2014-09-01"
  }, 
  "ppGWP3285T0pohRtYtASGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon C.", 
    "review_text": "This place is a nice break from the hustle and bustle of Polk St. I went here with a friend just to have drinks and talk. It's a dark and intimate atmosphere. I loved the candles on the table and didn't feel like I had to yell across the table for my friend to hear me. Not somewhere I'd go if I was trying to party on a Friday night, but definitely worth the weeknight visit when I'm wanting to be chill.  Cash only though!", 
    "review_date": "2014-11-01"
  }, 
  "hetVDs0rgmvvB1ymLQCITg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey S.", 
    "review_text": "If you loved KoKo Cocktails, it's the same 3 owners, and the same vibe, plus or minus some of the Polk/Marina crowd. I'd say it's a better, more mature version of the Koko.  While it doesn't have the same divey vibe of the Koko, it is bigger, better and all-together a more comfortable bar. The owners did all the decorating themselves, importing the original bar from the Koko, even going as far to import antique ceiling tiles from New York City, and putting in old-timey floor boards and a secret storage room (VIP room) with 100 year old newspapers on the wall.   Oh yes... The bathrooms! Oh the glorious, clean, private bathrooms!! (Koko insiders will remember the less-than-ideal restroom situation...lol.) During slow times, they even allow friendly dogs.   This is a COCKTAIL BAR first, not a dive bar, as evidenced by the not-cheap and quality cocktails. They have a decent selection high-quality beers as well (IPAs!). Just don't go here expecting darts and cheap drinks, or sports TVs on the wall. That's not this bar.    Finally, if you go to a bar, and it clearly says \"Cash Only\", respect the freedom and business decisions of the owners, and don't go writing some lame Yelp review because you were **too stupid to read the signs**.    Besides, did you ever think that requiring cash payment in a city known for being \"Cash Only\" filters out some of the undesirable types (ie, loud-mouth, brash Marina yuppies buying rounds on their charge card)?   The HiLo = 5 stars", 
    "review_date": "2013-06-26"
  }, 
  "0aQBX7q__FVRkimGA4vQFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phil S.", 
    "review_text": "My fiancée and I loved Koko's and were so sad when they closed. We were of course thrilled when it reopened as Hi-Lo and moved up a few blocks right around the corner from us!  The cocktails are (still) excellent, the service very friendly, and the atmosphere casual and laid back as any respectable joint should be. We were even treated to history and factoid lessons about whiskey production and distribution in one of our visits.  However, don't expect the same atmosphere on a Friday/weekend evening when douchebaggery overwhelms the place as it does every bar in the neighborhood (the annoying  \"Marina layer\" effect plaguing this city).  But if you ignore them and keep your eyes on the prize - your delicious cocktail the genuinely nice bartenders made with love - you'll still come out happy.  Cheers!", 
    "review_date": "2012-11-11"
  }, 
  "U2kd9MxKaGyab0cI2JsJlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Great crowd, drinks and vibe. Man I like to drink.", 
    "review_date": "2012-08-09"
  }, 
  "Mxf6OaH_W_Zu6OyZ7DeL5g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James K.", 
    "review_text": "Great little spot on Polk to have a good beer or cocktail. Happy hour is an excellent time to stop by and avoid the drunken crowds that Polk attracts at night.", 
    "review_date": "2013-01-31"
  }, 
  "xBcNPTcCigOS4We-4ZIHqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dexter H.", 
    "review_text": "They are so nice here and the decor is sexy. The cocktails are badass. One of the best kept secrets on Polk. I love going here with my friends to be a bit away from the crows and just relax with a great drink. So worth it.", 
    "review_date": "2014-04-29"
  }, 
  "aZrArKlx5GoObm4YlDQALA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick S.", 
    "review_text": "Wonderful ambiance, really great cocktails. Expensive, but a winner.", 
    "review_date": "2012-09-14"
  }, 
  "pa86Mfdc8SEmFJavReMDaA": {
    "user_rating": 5.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Shirley M. J.", 
    "review_text": "Bar hopping here via SantaCon!", 
    "review_date": "2012-12-21"
  }, 
  "dLMcskd648ILxw7we1GeSA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stevie b.", 
    "review_text": "Checked out this spot last night and had a blast.  Kevin the bartender was awesome.  Even though he was busy he kept the drinks coming and chatted us up.  Good tunes, cozy booths, loved the dark, candlelit vibe and creative cocktails.", 
    "review_date": "2013-02-22"
  }, 
  "MaeAIHvnASVdSU2PicFd1A": {
    "user_rating": 1.0, 
    "user_location": "Oakland Gardens, NY", 
    "user_name": "T V.", 
    "review_text": "Drinks were great and all the female bartenders were friendly. Everything was great..except for the d*ck of a male bearded bar tender who saw my freshly made drink spill, didnt say a word to me..then upon asking for a towel-threw his dirty bar towel in my direction. No help with the spillage, no offer of a new drink, just bearded douchbaggery.   Also they played the same pixies album in a row.", 
    "review_date": "2014-02-08"
  }, 
  "2UuNTFCDZPa3DImEA111fw": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Dave N.", 
    "review_text": "Predictably, this place is darkly lit only by the now ubiquitous incandescent \"Edison bulbs\".  It's not much more than a narrow room with a good sized bar in it.  The drinks were okay, but I must say that it seemed like a bit of a boring place.  Symptomatic of what has happened with the 'gentrification' of the Polk corridor, I wouldn't go out of my way to come here.  It gets three stars for at least serving a decent if not inexpensive cocktail.", 
    "review_date": "2014-01-21"
  }, 
  "GS79qDSIM9VE2lQxrbuCtw": {
    "user_rating": 5.0, 
    "user_location": "Berlin, Germany", 
    "user_name": "Brandon O.", 
    "review_text": "This place is great. They recently did a bourbon/bacon new cocktail menu launch party, which really solidified my love for them. I mean, a manhattan with a side of free bacon; yes, please.  So other than that rare bacon night, they also do really great cocktails on every other regular night. They've got a good liquor and beer selection and pleasant bar tenders. The interior of the place is also really beautifully done. There are tin ceilings, a huge I-beam stretching across the ceiling, and rustic crackling paint walls. They also usually have tea lights lining the liquor shelves which is a really lovely touch. Also I came one night and the bouncer had a big snake draped around his shoulders, so there's that.  The place can get a bit loud, and the crowd is sometimes a little square, but I can't dock them stars for that. Overall a really standup place.", 
    "review_date": "2013-03-16"
  }, 
  "d06gf3Y9xlYF7169tVJ3Vg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin G.", 
    "review_text": "I was a big fan of KoKo's and was eager to check out their new place! I always loved the incredible service and quality that the worker owned KoKo's was all about.  Overall, the space and everything was very cool, and it was nice to be recognized and greeted by one of the bartenders from the old location upon my arrival.  I just wish that bartender had stayed around to serve me and my group for the rest of the night.  The only reason this place gets a lower review  instead of 5 is upon purchasing my 3rd round of drinks for my table (with tipping each round) from the bar, the \"other\" bartender (taller, dark hair) made the critical error of taking my drink order (3 Mandarin and Soda's-Not complicated) and then within my hearing range took other people's drink orders afterwards, including one patron who had just walked in the door following my drink order,  and served them all and rang up their drinks before me, while leaving me standing at the non crowded bar like an idiot for nearly 10 minutes while my guests wondered what the hell was going on.  a thoughtful female member of staff noticed this and stopped by to let me know that my drinks would be coming \"right up\", but the real question is, why would you leave a customer waiting for so long? From the bartender himself there was no \"sorry about that\" or \"this round is on me\" or anything that could begin to excuse his lack of professionalism.  This was this Tuesday June 26th at 7:30 pm if that helps.  I'll give it another shot, but I hope someone tips off the bartender that you should serve people's drinks in the order they purchase them, and if you make choices that negatively affect your customers experience, you need to make it right.", 
    "review_date": "2012-06-28"
  }, 
  "6_VkzelWeSHzjTVDlGl-Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "ATMOSPHERE: Nice bar :) I like the atmosphere. Kind of dive layout, but tables to sit on the right, and not ghetto like a real dive bar. On Polk St, so convenient to a lot of other things going on, more bars and or restaurants.", 
    "review_date": "2013-07-22"
  }, 
  "wnxA9Qhc7-owz7qL2SiCew": {
    "user_rating": 1.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "Sof G.", 
    "review_text": "One of the worst experiences in a bar in SF... All due to the staff, really in another world, might have been too busy thinking about their own bday day, but really rude! Will not go back or recommend...", 
    "review_date": "2014-01-12"
  }, 
  "U8c5CKdsk40mj-mTnJysGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Faina L.", 
    "review_text": "Really enjoy the ambiance, great selection of beers and for a bar, the local (Berkeley) red table wine is pretty good too, though could be a better pour. Living a block away helps too, though there's many bars in the area, few have that great blend of comfort yet not divey on Polk. Have seen dogs there a few times whihc is a big plus!", 
    "review_date": "2012-09-13"
  }, 
  "3zLvaIqYSnH9xVZqZyHwzA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gaby G.", 
    "review_text": "Great bar, great drinks, great people!  What more could you ask for?", 
    "review_date": "2012-07-04"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "I'll make a note here and now that I was just here for new years. This...is probably not a good indication of the typical night here, but it just was.  The place looks like how you would make a place divey. So...its not really divey. Someone put together a poor lighting scheme and grey-ish walls, and someone else decided to call it divey. Great...It felt very hipster-ish, so that's likely what you're going to get.  We got a ton of alcohol, and they have a pretty good cocktail. Their Pim's cup here tasted similar to the one at Rickhouse - but not in the giant bowl (sad). The space is huge, and there's a lot of standing area near the door. Tables to the side , but they looked a little intimate to me. A couple of stools and tables near the back...ATM. I'm kind of at a 3.5, but I suppose a round down will have to do, as I've yet to return. Bouncer was super nice though!", 
    "review_date": "2013-02-06"
  }, 
  "0iBCEHRYIAgm0G5JN3IFBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa Kim J.", 
    "review_text": "Big fan of these folks and really appreciate the thought that went behind every detail of this bar. Most of the items are up and recycled materials that were carefully hand picked. It is all love, good service an awesome cocktails here. And this time, there is even wine on tap! Yes, wine!", 
    "review_date": "2012-06-06"
  }
}