{
  "l3ZKUqUguSlG9PH0xRC8dw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saroya W.", 
    "review_text": "Came here for a light dinner after the Fillmore Jazz Festival last weekend. I have to say I really enjoyed the visit. First off, I made a reservation through yelp. Easy, simple, and I got the time I wanted. We even arrived a half an hour early and they seated us without a wait!  I like the feel of this place. Lots of dark wood and splashes of green. Definitely felt Zen-influenced.  We ordered a few items: the hawaiian poke salad, a california roll, a yellowtail dish, and a boiled egg cooked inside of a fried pumpkin bread. All of it was delicious. I really liked how spicy the poke salad was. I'm not a general fan of seafood, but I really enjoyed the salad. The California roll was also really delicious; no imitation crab here! The yellowtail was alright; once again, this is just my palate not being so favorable to seafood. My favorite though was the egg in fried pumpkin bread. I could eat that over and over again!  We also got a couple of drinks: a blood orange chuhai and a green tea chuhai. Strong and flavorful.  Only complaint was that our waitress wasn't around all that often; it was hard to flag her down.  I'd definitely come back though!", 
    "review_date": "2014-07-10"
  }, 
  "9sWf1QjQbmAHZMwRsCI6vg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelcey M.", 
    "review_text": "I wasn't very familiar with the Izakaya tradition before eating here, so I'd return with a large group after work for drinks instead of choosing it for date night. I really enjoyed the octopus balls and thought the ramen was great since it wasn't too salty (and had lots of vegetables!) but I wasn't blown away by any of the flavors. We tried both the chicken and the pork skewers and could barely taste a difference between the two dishes.  The wakame salad was tasty, but I wish there was more of it... the clump of seaweed looked a little lonely in the middle of the big bowl on top of a couple of thin tomato slices.   I'd request the Tatami area next time- and do a little research on the food before hand.", 
    "review_date": "2013-10-14"
  }, 
  "sht0n7Up25_gkrIYbD36jQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia L.", 
    "review_text": "Very rarely will you find a Japanese restaurant that does everything right.  Izakaya Hashibiro Kou is a total game-changer.  They've successfully transformed a traditional Izakaya into a modern, hip, and fun dining experience by offering Japanese-style tapas infused with Asian influences in a cozy lounge-like atmosphere.  Their extensive menu ranges from yakitori to fresh-cut sashimi to ramen to grilled and fried items.  In my opinion, it's the best way to eat.  Because duh, you get to share everything- which means you get bites of everything. It's a win-win.  And lemme tell yah, their drink menu is just as impressive: Sapporo on tap, wine, cocktails and freshly-squeezed juices. They also have an extensive sake list to please all audiences.  So.  If you're looking for a fun night out with a group of friends OR just a high- energy date night atmosphere, then this is your place.  + KOU Sashimi ($18)- You get a total of 9 pieces of fresh cut sashimi; salmon, hawaiian big eye tuna, and yellowtail (no substitution). Overall, I was very impressed with the quality of their fish (being that it's not a true sushi restaurant).  + Gindara Misozuke ($11)-  Miso marinated black cod.  This is one of my favorite things here. You get a buttery piece of seared black cod that melts with each bite you take. It's the only dish where I secretly wish I wasn't sharing with everyone (sshhhhh).  + Tofu Temptation ($7)- The soft tofu arrives beautifully presented with three variations: topped with Korean style mentaiko, uni, and oshinko. This is a great appetizer to get your taste buds flowing for the next couple of dishes.  + The seafood ramen is just ridiculous. Like, I can't believe how much I love this bowl of ramen.  It has just the right amount of spiciness (jalapeño) so that it doesn't take away the taste of the broth. The noodles were cooked to perfection. And you get a good variety of seafood options (shrimp, mussels, octopus, etc).  Get it, and you wont be sorry.  + Uni ($10)- sea urchin from Santa Barbara  They give you hugeeee chunks of uni where it's practically falling over the sides. The uni was pretty good for an Izakaya restaurant (b/c I definitely didn't expect this type of quality here).  + Hotate Yaki ($10)- scallops with garlic and asparagus. The scallops were fresh and so buttery. Overall the flavors worked really well together.  + Buta Toro ($7)- Pork belly garnished with scallions and red onion. The pork belly arrives sitting in a slightly sweet miso sauce. While it was good, the pork was a tiny bit dry. I wish it had more of a \"melt in your mouth\" type of texture. (yah know?)  + Kalbi Tempura ($10)- Korean style boneless short ribs with vegetables mixed in a sesame ponzu sauce.  This is the only dish that I wouldn't order again. It was weird, because the short ribs were fried and really dry.  They should have just left the shorts ribs alone.  + California Roll ($6)- made with fresh crab meat  Yah I know... I'm ordering sushi ROLLS (and I don't even like rolls). But hey, I was craving carbs &amp; they use fresh crab meat here. None of that fake shit.  It was bomb.  To sum it all up...   This place is literally perfect for a fun night out. Social drinking is a big part of the Izakaya experience, so ask your server for some sake recommendations (or beer- whatever floats your bloat!).  Since the menu is so extensive, it has a little bit of everything to satisfy anyone's cravings or taste buds.  The two \"MUST GET'S\" are the miso black cod &amp; seafood ramen.  PS: Make your ressies in advance. If you come with a large group, get the private rooms!  For more pics and deets, visit ze blog: <a href=\"/redir?url=http%3A%2F%2Fwww.cyneats.com&amp;s=49274878551c61176aed0625406da9f4f0ea363278c398c94e05e0d857d26677\" rel=\"nofollow\" target=\"_blank\">cyneats.com</a>", 
    "review_date": "2014-12-01"
  }, 
  "mE-hdFF4RgCxspZU72GAsw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "On the corner of Geary and Fillmore, I hope this convenient spot does better than the previous incarnation here because this place is really tasty and good. For drinks, the signature Kou is delightfully not too sweet and mixes unique cocktail flavors such as shiso leaf, sochu, umeboshi cherry and soda water. The miso-glazed black cod is a big winner here, as well as the tempura squid with arugula. I was particularly impressed with their red tuna sushi, as it's quality, texture and taste was steps above what you would find in most J-Town joints. Most of all, the staff are super nice and motivated and the ambiance is perfect with seating Japanese booths (please take your shoes off) and normal tables.", 
    "review_date": "2013-12-11"
  }, 
  "EumW_610VLzWwWcDvzr_EQ": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Lily K.", 
    "review_text": "JAMES?! JAMES?! JAMES?!  That was me all night today at Izakaya Kou. James was an amazing host for my boyfriend's 27th! I called on Thursday in hopes that they would have a private room available that would fit our party of 16 - no luck. James did, however, offer me the communal dining area of their restaurant. Basically glass walls surrounding the tables with some gaps here and there for ins and outs. $30 minimum per person, which is super affordable. Not bad considering how last minute I was and my only other choice was Sakesan - where the food is definitely not on par.  I was in my office this morning just spending hours looking through their yelp photos and browsing their menu options to see what to pre-order. It's easier to order ahead when it's a group of indecisive people who will probably take an hour to decide what to order! I called James at 4pm - they weren't even open yet and he answered the phone! I went down the list I had created and he punched in the whole order for me. We came to a $650 total for food and tax which isn't bad at all. They automatically charge 18% gratuity for big parties. He also said he'd have everything set and ready to be cooked so once I arrive there wouldn't be any waiting around for food.  OK, I over-ordered. I thought the guys would be these starving tarzan-like cavemen scarfing down the food before it even touched the table. Boy, was I wrong...we had about 6 boxes of leftovers. Bill came out to be around $800 with gratuity - about $60 a person. SO WORTH IT!  What stood out the most to me was the hamachi carpaccio, the baby octopus! the braised pork belly, the miso cod, and the chicken thigh skewers. Definitely worth trying!  Overall, it was a great dinner and I'm thrilled with the service. I mean, JAMES! Give this guy a raise! or a medal.", 
    "review_date": "2014-09-20"
  }, 
  "Dl5xKwDalYN_BWaus_MetQ": {
    "user_rating": 3.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Josh F.", 
    "review_text": "The food here was very good. It was probably 4-star+ quality food, however I'm docking it a star for service. When I arrived, the restaurant was very empty. The hostess asked if we had a reservation and when we said no she asked if we would mind sitting at the bar. I didn't really understand since the restaurant was empty so I requested a table. She seemed annoyed and took me to a table in a corner of the restaurant, right next to the kitchen. It was not a great place to be seated and impacted my experience at the restaurant. Furthermore, it was hard to get the attention of the waiters - with whom I had no issues - because our table was so out of their eye's view. When I left the restaurant was still half empty.   On the subject of food, I got the California roll (the crab inside was exceptionally delicious), the seaweed salad and the scallops with asparagus in butter sauce (this dish was also absolutely delightful). All these dishes were 5-star quality. The only dish I have any contention with was the salmon sashimi (more like 2.5 stars). It didn't seem as fresh as the other food. I should also mention they have happy hour drinks. I got a draft beer for $3!   Overall, I would recommend this place for the food. The menu is creative and most of what I tried was great. That said, the service could be improved.", 
    "review_date": "2014-05-31"
  }, 
  "heolEa-nF4YtNspCwuYp4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel H.", 
    "review_text": "This place makes me feel alive!! Friendly staff, good food and nice cold sake!! What else do you need?  Saba tataki - 4/5 Kalbi tempura - 5/5 Hotate katsu - 4/5 Nagasaki Ramen - 5/5", 
    "review_date": "2013-11-08"
  }, 
  "jzxDJ_fNjNeaGoz7QzdB5A": {
    "user_rating": 2.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Chris S.", 
    "review_text": "tl;dr  Really overpriced subpar food. Great ambience, but unless you are literally rolling in dough you can do a lot better in a city like San Francisco.  ----  I very rarely give 2 stars for an establishment. To me, 2 stars means that not only was the food seriously lacking in some aspect, I also feel emotionally cheated by the restaurant (usually by price). Expensive and bad = Izakaya Kou.  Given that over 70% of my reviews are of Japanese places and I jump at the first opportunity to try any new Japanese places (especially those in the $$ and $$$ range), I had high expectations for Izakaya Kou - it had four stars on Yelp, and it was very close to my gf's new apartment on Divisadero - I had high hopes of making Izakaya Kou a regular haunt the way I've enjoyed Izakaya Sozai through the years.  The restaurant itself is quite nice - it's spacious and divided into private rooms and communal dining rooms. At 10 PM on a Friday night, the ambience is more accurately described as calm and subdued, not like the boisterous smoky izakaya ambience that is usually much more common. This is probably a major plus for businessmen looking for a quieter place to talk or for couples seeking a good date spot.   I never give stars based on service, but it was good enough - seating was quick and service was attentive throughout the meal.  Here were the dishes we got:  Buta toro ($7) - the pork belly that so many people have talked about was unfortunately a flop. To be very honest, this dish can be easily made at home. How hard is it to reheat a few pieces of previously-grilled pork belly and squeeze miso sauce+sprinkle some random scallions and onion on top of it? To add insult to the injury, the dish is not even warm when it came out. Come on - you can do better!!  Kabocha croquette ($8) - now this is actually a great dish - 4/5. The kabocha wrapped in fried breading is terrific, and the egg in the middle is delish :) Really tasty and super good value, especially compared to the buta toro that just came out. Very creative dish - a side note is that they probably can hold the sauce/mayo that comes with the croquette - feels like they're a bit too trigger happy with it :)  Sashimi Salad ($13) - this was a joke. Please refer to my picture - you call 3 small mounds of chopped up fish, a cluster of arugula, 5 blueberries (you can count them), and a random dallop of onion a $13 value? Please. Go to any Japanese place and see how a real sashimi salad is done. This is probably the most disappointing of the bunch.  Sake onigiri ($6) - meh. okay. dry rice. very small rice balls. 3/5. not terrible, but not great.  Volcano roll ($14) - since they ran out of their kou ramen, I opted to get a roll instead. It's pretty well done, but as well as any fancy roll in a Japanese place. Is it worth $14? I'm not so sure. Maybe the random slivers of onion they seem to toss on every dish of the restaurant is some organic heirloom onion or something. That was a joke. Ha ha.  When it's all said and done, $61 post-tax and tip. Left hungry. Will certainly not be back.   Honestly, with a drink list as long as the food menu combined with the nice ambience, this place is probably much more suited for businessmen to drink after hours. I would certainly not come back for the food. (but with them charging $17 for a small bottle of Kikusui, I'm not sure whether that's a good reason to come back either...)  In a word, disappointed, and I have no idea what the hype is about. But looks like they're making good money with all these group dinners that appear to be happening in the other reviews.", 
    "review_date": "2014-09-24"
  }, 
  "nprR61-yZvMS1vcgoXBucw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott E.", 
    "review_text": "We found this place on a whim, and I've been so happy with it that I took my dad here for Father's Day.  It's all small plates, so it's best to go with a couple people and share a bunch of plates.  Some of my favorites were the Hamachi Carpaccio, Maguro Tartare, Kabocha Croquette, Tori Kaarage, Lizard Eye (not an actual lizard), and various yakitori.  There's also a good drink selection, which I would expect from an Izakaya.", 
    "review_date": "2014-08-03"
  }, 
  "IyngL8dipT3FB7GNPvV97A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexei A.", 
    "review_text": "Good atmosphere. They have low-sitting Japanese tables as an option. Delicious food.", 
    "review_date": "2014-01-12"
  }, 
  "UfTnIzrt4001Q8wtPVutsg": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Jay C.", 
    "review_text": "They have the best Uni onsen and tako yaki. Service was so so as we had a little trouble understanding the wait staff (although she was very nice) but the food is very good here.", 
    "review_date": "2014-05-29"
  }, 
  "WcSUyRH_EzUfqKua1m93DA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsea A.", 
    "review_text": "Izakaya Kou bent over backwards for over 80 people at a Yelp event I recently attended. The management and servers exceeded any expectations and truly wanted you to enjoy yourself.   The first thing that impressed me the most was the venue space, it had these great wooden dividers with Japanese style sit down tables.It would be an amazing spot for a birthday party or some sort of group event.   As far as food goes, I'd give it an \"A\"! The uni and soft boiled egg was so delicate and tasty, great way to start of the meal. All of the sashimi was incredibly fresh, the Japanese bacon pancake was mind blowing and the green tea cheesecake was absolutely delightful!  Let's just say this place doesn't even compare to what it used to be...SO GO SEE IT!", 
    "review_date": "2013-12-12"
  }, 
  "zRKXivafaD2qhKigwGBotg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Petri Y.", 
    "review_text": "New fav izakaya in SF! compared to NY or LA i feel like our izakaya has always been lacking but now we have a new place to hit and the bonus is that besides having great food at reasonable prices....they are open LATE!!  Went here for the first time a few weeks ago and although the service was horrible, the food was stellar all around.  we had.  uni onsen- amazing! assorted nigiri- sushi rice not bad, and fish was very fresh ikura, tamago don- highlight, small but amazing textures, and what can I say we love fish roe! Kurobota pork skewers- very juicy and flavorful.  I think the first time we went they were trying to get their act together and the servers were working with an unfamiliar POS system- we had multiple folks coming to our table asking us about our orders, delivering food that wasnt ours, missing food, repeating ourselves, one other couple even walked out cus they were seated for over 15 minutes with no hello of any sort. They had so many staff there who seemed all confused at that time...it was sort of funny watching them in action   HOWEVER! I went back with a large party last night and the service has gotten much, much better, (we were in tatami area)   in addition to the above, we also got   squid mouth- o so delicious!! kaki fry- fried oysters very good sashimi platter- very good beef tataki- good miso clams very good both types of ramen- i forgot names but both were great okonomiyaki- good takoyaki- just like osaka! spicy tuna roll-good + a bunch of sake!  overall a vast improvement in service although they really should keep to one person and ONE busser serving each table vs random pl coming to and from to help your party.  Its very confusing when other servers deliver your food then you attempt to reorder something but they say they cannot only to leave to try to retrieve the server who is helping you out.....  overall a must hit for izakaya I heart!", 
    "review_date": "2013-10-05"
  }, 
  "KMhKFp6L0bVmsoBFXI_Aog": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Michael T.", 
    "review_text": "Good music playlist, but the bathroom light needs to be brighter. I needed to use my lighter to see where I'm aiming.  oh yea, the food is good as always.", 
    "review_date": "2014-03-18"
  }, 
  "wzpH23Zkd3VJeRAwUzPPQg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew H.", 
    "review_text": "Came with a party of 5, scored a sweet Tatami room, and had 30 min left of happy hour.  The server let us pre-order our drinks so we could get happy hour prices throughout the 2 hours we were there so the drinks could keep flowing on the cheap.    The happy hour deals for both the alcohol and the small plates were incredible.  Very affordable and good portion sizes for $3 and $5 plates.  Our favorites: -Eggplant (my overall favorite) -Fish roe don (rice bowl with variety of fish eggs) -Baby octopus karaage -Chicken karaage -Fresh hamachi sashimi -Okonomiyaki  I'm coming back for sure.", 
    "review_date": "2014-11-15"
  }, 
  "pFd7u3ceGZELQwfnc4VkoQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Garrett N.", 
    "review_text": "The Yamakake was pretty good, mainly because they used ponzu and the yamaimo didn't numb my mouth too much. The ahi pieces were pretty damn small. I don't know how I feel about the presentation anymore. at first I was surprised at the martini glass presentation, definitely impressive...but its yamakake...dawg wea my rice at??? Had to order rice cause I'm dumb and didn't check when I ordered...but shit too a long time to get to me...and it was just rice in a bowl....and it wasn't busy. Definitely made me unhappy. Second dish was Buta Toro which the white waiter totally butchered he pronounced it Butta Toro and a part of me died inside.   Being an Izakaya I was hoping for some bomb yakitori....but since I'm an ACTUAL purist, I don't eat that tare shit. Asked the waiter if they had shio yakitori and he had nooooo idea what that was. Luckily a Korean broski upped his game and explained they don't do shio on all the items...namely the ones that I actually wanted.   Happy hour is shit. $3 beers the only thing worth while.  Definitely want to bring money, good atmosphere and excellent food quality. Don't get me wrong though, this place definitely smashes the izakaya in the J-center...its just so americany...which is not really a plus.   Also,  CAN OWNERS PLEASE CLEAN THEIR DAMN WINDOWS. so shame already.", 
    "review_date": "2014-01-28"
  }, 
  "yEk2eym9FLT7hKUOZi0Q8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott H.", 
    "review_text": "My wife and I went here the other night with a friend for an early dinner before seeing a movie at Kabuki and took advantage of the happy hour deals. The space is pretty neat, wide open and also has some private rooms.   The food was great! We shared maybe 6-8 items and a pitcher of Sapporo. Our waiter, James I think was his name, was great. He was very thorough explaining the menu and giving recommendations on number of items to order and his favorites. The food is definitely Izakaya style. We had several of the skewers, chicken meatballs were my favorite. The fried scallops were also incredible. Food came out pretty quick and was paced well so we weren't overwhelmed by the number of things we ordered.  I hope this place sticks around, will definitely be back!", 
    "review_date": "2013-12-30"
  }, 
  "CXhcRjo0_0VAcJQCSAW7pA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim S.", 
    "review_text": "Love this restaurant - it's our fav sushi spot in the city. Gourmet menu. Reasonable prices. Great ambience and atmosphere. Top notch service.   Highly recommended!", 
    "review_date": "2014-04-12"
  }, 
  "kKLVrIDNmBMXNUjTp5UMog": {
    "user_rating": 3.0, 
    "user_location": "Jefferson, WA", 
    "user_name": "Johnny L.", 
    "review_text": "Food is very solid but the waitstaff needs a full replacement. I had to ask for everything twice after waiting for our waitress to take care if our table requests that were as simple as getting our first glass of water and ice for the bottle of shochu we got. I want to come back but they'd better up their service mentality for their waitstaff else I'm not coming back.", 
    "review_date": "2014-04-18"
  }, 
  "vXP9TXAvxwzb_iNPJWETXQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mar B.", 
    "review_text": "I'm reviewing for my experience several months ago. The food was mediocre; I've had much much better Japanese food at way better prices. The service was very slow and they completely forgot to bring us one of the dishes we ordered. Didn't even mention it to the waiter because by that time, we didn't even care, we just wanted to leave. We had to go out of our way to get attention from any waiters because all of them seemed to be preoccupied and/or avoiding us. Will not be returning anytime soon.", 
    "review_date": "2014-05-22"
  }, 
  "WPBrjBbk76ZtZQ8QpG09cQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Henry L.", 
    "review_text": "Upscale Izakaya (Japanese BBQ skewers) restaurant in Japantown  This place always seems to be packed whenever I stop by, with a line outside. I never realized why until when I actually went in recently--damn, the place is nice!  The decor is very, very well done. We sat at the communal table, next to a \"painting\" on the wall that looks like it was the side of a tree, with branches, mushrooms, and bark popping out. Combined with the wooden tables, the dishware (stone bowls), and the dim lighting, the place feels very much like a forest, which goes well with the \"elemental\" vibe of the cuisine.  We ordered the fish roe don (fish roe over rice served in a stone bowl), which was small, but really, really good. The top of the rice was filled with several patches of different kinds of color roes, and the heat made it stick to the rice in a very pleasant way. We also got the chicken thigh skewers, which was ok. The Kalbi Tempura was on the \"chef's recommended\" list, and was pretty good as well--nice chunks of juicy beef covered by crispy tempura shells, topped with some really well-marinated leaves.  Be sure to book a table or go early, since the place is usually packed!", 
    "review_date": "2014-06-10"
  }, 
  "4sqRqJrIrFYlj8UxbRMJ7A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trish P.", 
    "review_text": "I read great reviews about this place and had good expectations, however, my first and only experience was a bit of a let-down.  The interior design is really tasteful - raw wood and beautiful fixtures. They have separate, private rooms for larger parties and seating at the sushi bar.  The wooden table that my guest and I sat at was very small and cramped, I couldn't cross my legs, and we both felt uncomfortable during the entire meal. The first 5 or so wooden tables that seat two people sit in front of the door, so we kept getting chilled.   Our chuhai cocktails were watery and flavorless.  The yellowtail and tuna sushi were fine, nicely sized portions.   The bacon-wrapped asparagus and bacon-wrapped mushroom yakitori were good. However, there was a pretty long wait between our veggie yakitori and our meat yakitori. The chicken was bland (really didn't taste like anything), and the meatballs were dense and just ok.  This was early on a Friday night, and the place wasn't too busy. The wait staff seemed to hover over us, and it feeling cramped and uncomfortable as it was, didn't add to the experience.   The thing that bothered me the most was actually the crappy pop radio they were playing over the speakers. It surprised me considering the place presents itself as upscale (from the website) but it definitely has more of a casual vibe (so be prepared to hear Miley Cyrus during dinner).   We were still hungry by the time we finished but didn't feel like sticking around.", 
    "review_date": "2014-02-07"
  }, 
  "5RPl7M1RpzMvoGx3d-IX7Q": {
    "user_rating": 4.0, 
    "user_location": "La Cañada Flintridge, CA", 
    "user_name": "David L.", 
    "review_text": "-Great food, with elegant presentation (not an understatement!) complimented with a huge menu selection made it exciting to look forward to what the next dish to come out would look like -About $25 per person without alcohol. If you do want alcohol there were ginjo and daiginjo 720ml sake bottles in the ~$50 price range, which comes out to about 16 \"shots\" -very helpful and friendly staff  Will definitely come back again. I've read in a review somewhere that they have a \"buy one bottle of sake, get another for $1\" deal during HH, but didn't confirm if it was still ongoing", 
    "review_date": "2014-06-26"
  }, 
  "PcEA6B2wN1j0ejKzSlSOzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sneha P.", 
    "review_text": "Delicious sushi and yummy ramen. We walked in early evening and were lucky enough to get a seat. We tried the bacon wrapped mushroom, spicy tuna rolls, another avocado/eel roll, and the Nagasaki Ramen. All good, with potent flavors. Loved the seafood/pork/chicken ramen; it had just the right amount of spice. Seems like they have great authentic Japanese dishes.   Service was wonderful and friendly. I'd definitely go back. In my one month officially living in SF, easily the best sushi I've had.", 
    "review_date": "2014-07-14"
  }, 
  "7-9vJ5th5OeTrK59C_GPDg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Louise L.", 
    "review_text": "I came to Izakaya Kou on a whim because I was seeing a movie at the Kabuki Theatre later that night. I had seen the restaurant in passing a few different times but never had to the opportunity to try it out.  Overall I was relatively satisfied with my meal. We tried an arrangement of different small plates. All small plates + sashimi had really good freshness and flavor. I also appreciated the pace at which the plates came out. Sometimes restaurants don't stagger the dishes well but I thought the service did a good job with that.  The dish with the *best* flavor was the miso marinated black cod (although the portion was much smaller than I expected). The *only* dish I would not recommend is the Hamachi Carpaccio. It was beautiful but bland. A bit anti-climatic.", 
    "review_date": "2014-08-30"
  }, 
  "vTbQZNz8FH4jcrni7Vkl1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oleg H.", 
    "review_text": "Kou has quickly become one of my favoirte izekaya locations in the Japantown area (Sozai still numero uno in sf!).  First - the kabocha croquette - will redefine the whole notion of a croquette.  Second - the interior - is really quite spectacular, and the place deserves a visit just because of the ambiance/decor.  Third Drinks - Izekaya - being a drinking oriented food genre -  specialty cocktails are on the lighter side, and all the obligatory beers and a selection of sake is available. However they did not have Asahi black upon my visit and thats a fail - especially so close to japan town.  Was here for an event and got to try almost the entire menu which was a great experience, everything was delicious and fun was had by all.  If you're considering the venue for an event - I can recommend it as it's laid out in a very interesting way that forces people to congregate in small groups and socialize.", 
    "review_date": "2014-01-17"
  }, 
  "UZloE8c_eUdRoBU47tv2iQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amaya B.", 
    "review_text": "Izakaya Kou is the closest I've found to an authentic Izakaya in the Bay Area. Familiar small plates, sushi, pickles and drinks are available. The decor and setting are lovely and the food is good quality.   The service can be a little haphazard, but it feels like they're finding their feet. I have had much better experiences on the weekend than during the week. Be aware that izakaya food is generally shared and so unless you specify you want set dishes per person they will come out 1 or 2 dishes at a time for the table.   A great place for a small to medium group to share some beers and small dishes. Private rooms are available, booking recommended.", 
    "review_date": "2014-02-04"
  }, 
  "5X7FMNE7YZ0WcKxrDz8FEg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moline D.", 
    "review_text": "The Nagasaki Ramen was amazing, really spicy with lots of seafood. But the service was disappointing. We waited an entire hour for our food to arrive, each person got his or her meal at a different time, and they completely lost one order of yaki udon. I could understand that (maybe) if it was a busy night, but there were lots of empty tables. An hour? really? For ramen and stir fried udon?  I'll give it another try because the ramen was so good, and hope that it was just a fluke night with the service.", 
    "review_date": "2014-03-28"
  }, 
  "HZ24oVTVz9_2gN1RviAJ1w": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Denise C.", 
    "review_text": "My friends and I came to Izakaya Kou on a whim when we were just chilling in Jtown. We wanted to try something other than the same places we had been frequenting since high school. So I yelped up sushi places, and Izakaya Kou was one of the few highly-rated, reasonably priced sushi joints nearby.  The restaurant itself looks fairly trendy, with wood paneling all over the place, and glass doors separating different sections. There were also sections where you could sit on cushions on the floor, and then closed off by sliding doors. So that was interesting, and I kind of wanted to sit there.  It was kind of loud inside the restaurant, but not overwhelmingly so. I could still hold a conversation with my friends.  Service was a little bit slow, but attentive whenever the servers came by.  Describing this place as sushi would be inaccurate. This place mostly does small plates, although some bigger rice bowls are available. While I would say that this place is a little pricey (forever living on a poor college student budget), the food was fresh and tasty.  I got the chirashi don, which had about 12 pieces of fish (salmon, tuna, shrimp, and a white fish), all of which were quite delicious and had a great texture. It also had 2 pieces of sweet egg, which were equally as good. I enjoyed the whole dish, but I can say that I wasn't completely full from just the chirashi.  Luckily we got other things as well: takoyaki, karage, and kalbi tempura. I thought the takoyaki was well done, crispy on the outside, but not too crispy where you couldn't reach the inside. The kalbi tempura was really tasty and tender, but the serving size was REEEAAALLLY small. The karage was average. My friend also got a unagi don, and that piece of eel was HUMONGOUS. And delicious.  We were here during happy hour too, so we got a couple of Sapporos for $3 each. Which is a good price for those I think. And the appetizers (takoyaki, karage) were $5 each. So happy hour is not too shabby :)  Overall, I would definitely come here again, but probably during happy hour.", 
    "review_date": "2014-12-04"
  }, 
  "RPtDPYhO1VckFZsjQ-Vv3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rohan S.", 
    "review_text": "We got a private room for about 7 or 8 of us and it was a blast. Great food and great sake. Most of the tapas like items were very good. Specifically the baby octupus, seaweed salad, and eggplant dish.", 
    "review_date": "2014-09-20"
  }, 
  "ZIc-wHerFTKzLvnylyOoFw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Annette U.", 
    "review_text": "We came here for the Happy Hour but also ordered entrees as well. Everything was really good. The Happy Hour menu is limited but still a great sampling to have some lights bites and cheap Sapporo pints ($3). I also got the frisco roll which was delicious and my guy who doesn't really eat seafood got some beef and pork dishes (those were a little on the small side so if you have a big appetite maybe stick to the sushi rolls).", 
    "review_date": "2014-12-05"
  }, 
  "mDQnPtVsjxKQh8Oo2fjjTA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Zooey S.", 
    "review_text": "Excellent food and service. Great spot to try before a show at The Fillmore. I will be back!", 
    "review_date": "2014-09-15"
  }, 
  "1KhECADi-6mS26dc5jsrtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel L.", 
    "review_text": "Good fresh food. A bit pricey but that is to be expected of an Izakaya. Would probably come back again if I'm in the area.", 
    "review_date": "2014-09-29"
  }, 
  "QIssYBaARBy_7lv6hT-ATA": {
    "user_rating": 2.0, 
    "user_location": "San Gabriel, CA", 
    "user_name": "Adrian F.", 
    "review_text": "Amazing food, service not good unless you are a Japanese national! Sanseis like me will be ignored!", 
    "review_date": "2013-12-22"
  }, 
  "8qpFUPR1wd3uz8N1QaWj_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Al L.", 
    "review_text": "Was here recently for a Yelp event.  Having patronized the prior establishment, it was nice to see this floor space totally transformed with an enclosed dining room by the entrance, several Tatami rooms on the left, communal tables and regular tables in the middle and bar seating next to the sushi station and kitchen.  Though we were here for a special event, the food that we tried were items directly from the restaurant's regular menu.  Our Starters and menu selections: Uni Onsen Tamago: soft boiled cage-free w/uni in KOU sauce. This was a unique dish and the uni was nicely complemented by the soft boiled egg. (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#iSu77NXn79XQOR9xOwfHBA\">yelp.com/biz_photos/elit…</a>). Dengaku Miso:  grilled eggplant w/miso sauce.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#xeKgohNxlDNATFpRqfYdWg\">yelp.com/biz_photos/elit…</a>). Kalbi Tempura:  fried Korean style boneless short rib and vegetables mixed with sesame ponzu.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#d2gHjDtAiIQ4272_l-WZMw\">yelp.com/biz_photos/elit…</a>) Gindara Misozuke: miso marinated black cod. Delicious. Reminded me of butterfish.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#dVZIW3Xgi0WP8d1M2NWRCA\">yelp.com/biz_photos/elit…</a>).  Buta Kakumi: Japanese braised pork belly. What can I say?  It's pork belly!  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#pMloE7Lk1HChBRlonXZ5jg\">yelp.com/biz_photos/elit…</a>).  Hamachi Kama:  yellowtail collar. This was good, but felt the collar was on the smaller side.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#TorzhbQrrlr0wYyl_YLDsg\">yelp.com/biz_photos/elit…</a>).  Chirashi Don:  assorted sashimi over sushi rice.  Nice slices of Hamachi, salmon, tuna, albacore and two ebis.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#xcfhOFFtAuJaK69b8EBk6w\">yelp.com/biz_photos/elit…</a>).  Okonomiyaki: Japanese style pancake with bacon.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#z7D5KOG_fMZmwIZ3sFqGUQ\">yelp.com/biz_photos/elit…</a>).  Kou Sashimi:  salmon, Hawaiian big eye tuna, and yellowtail.   (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#0HlNA3CGyRqKxw7IDXZWSQ\">yelp.com/biz_photos/elit…</a>).  Ankimo: steamed monkfish liver with ponzu.  As close as you can get to the \"non-p.c.\" foie gras?  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#RRwhNvqnMCRu2rxPA4Rh_g\">yelp.com/biz_photos/elit…</a>).  Nagasaki Ramen: vegetables &amp; seafood in white spicy pork &amp; chicken broth. Tasty broth...  must be the pork.  (<a href=\"http://www.yelp.com/biz_photos/elite-event-izakaya-kou-de-yelp-elite-2013-san-francisco?select=vTrFYNxi2-ePSp4H-kHDZg#zEiVC780lae9U7BOXTilLw\">yelp.com/biz_photos/elit…</a>)  Overall, the service was friendly and efficient.  The food was very good and we're happy we were able to try so many of the restaurant's menu offerings.  If in the area, will definitely come back to Izakaya Kou.", 
    "review_date": "2013-12-15"
  }, 
  "zi5LgjU_8FGkRCwDni8v6w": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "I came here last night for my roommate's birthday dinner and it was a pretty good experience! We made reservations for 5:30pm but we ended up being really late. We let them know that we were running late and they were very accommodating. Because we were in a bigger group, we were seated in the private tatami room. I thought this was awesome and absolutely perfect for the occasion. I also loved the decor throughout the restaurant. It's all beautiful~  We made it in time for happy hour so we were able to get the deal where you buy one sake and get the second one for $1. By the way, know that the hot sakes here aren't hot. No, they are not even lukewarm. They are cold.. I'm not quite sure why they are called hot sakes. As for food, I tried the Yaki Udon and the Frisco roll. Both were delicious and the presentation was amazing. I liked that the udon had a lot of seafood and vegetables in it and the roll was fresh and flavorful.  The only issue we had was with the service. To put it simply, it was not good. Our waitress would only check up on us when we pressed the button to call her and she was really bad at answering our questions. Maybe she was new..? I'm not sure but the service could definitely use some work.", 
    "review_date": "2014-09-13"
  }, 
  "65VHiQMlmGIDEFMa0akoUg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kat K.", 
    "review_text": "Horrible customer service. I would have given it no star if there was the option. We were sitting at the table where the sun directly hits us. We asked one of the waitresses if we can move to another table or if they can do something about that. She said the other tables were reserved and wouldn't let us move or do anything about it. We were all wearing sunglasses inside the restaurant as we ate which was not enjoyable. After over an hour later, the tables which she said they were \"RESERVED\" were still empty. The restaurant was very empty the entire time. It totally made sense because of their horrible customer service.... We would not be one of the repeat customers and would not recommend our friends to go there. Also, they charged us $2 each for the tea which were usually free at other restaurants. What a rip off!", 
    "review_date": "2014-06-22"
  }, 
  "f7pbQuon-3GbyNbzcNSQdQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Joel G.", 
    "review_text": "pros...this is one of cool japanese taverns, which is a great place to have some alcohol and also some good eats as well.  izakaya kou is a great place just to hang out and have some fun as well. best part is that they have the semi private rooms with the cut out for your feet.  a great little table that seats about 5-6 comfortably and 7-8 in a more friendly manner.  as for the food, it was great.  you have such a wide selection of food types: sushi, sashimi, ramen, yakitori, soups, salads, rice, fried foods all is good here.  we happen to have just about a little bit of everything that night.  best part of the night was exploring the menu and finding yet another delicious thing to eat.  but besides food, there was also a great deal on the beer and also the sochu or soju.    as for service, that was great.  we had one main server who was super cool, she was attentive without being intrusive.  things were refilled well and the food came out at a nice pace.  not hurried, but very comfortable pace to eat and talk and eat again.  and once again all in the privacy of your own room.    cons...well of course we are in the city, so things can get a bit expensive, but the answer to that is to come during happy hour, where some of the stuff is going to be less expensive.  other con, i wish we had one of these of this calibre in San Diego.  otherwise it was really a great night, pre birthday party for me.", 
    "review_date": "2014-08-06"
  }, 
  "WTMS8FIAe_qhYLfTiPvD0A": {
    "user_rating": 5.0, 
    "user_location": "Outer Sunset, San Francisco, CA", 
    "user_name": "Jun I.", 
    "review_text": "This Japanese restaurant is my favorite!! They always have great service as well as awesome food! Their TATAMI room is great and love to have some privacy. Very reasonable price and recommend to everyone! Lastly great atmosphere always makes me don't want to leave. Try out you will never regret it!", 
    "review_date": "2014-05-02"
  }, 
  "sBReCygAeC4Jhyihl7uUXQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Brian B.", 
    "review_text": "Who says you can't just walk into a restaurant in SF @ 8pm and not get seated?!? Well, the stars aligned this last weekend and that's just what we did here at Izakaya Kou. Granted we were seated in a tiny two-top by the kitchen, but we didn't care due to the amazing luck.   The food was very good, also considering the price. The spicy tuna salad was super spicy. Great for me, but too much for my wife, so keep that in mind for people sensitive to it.   Had some sushi, it was good. Not amazing, but not bad by means. $5 for nigiri was pretty middle of the road.   My favorite was the tonkatsu scallops. Crunchy on the outside and light and delicious on the inside. They came out piping hot from the kitchen and were accompanied by a great dipping sauce. If you're a scallop fan, get these. Really good value for the $8.   Interesting beer and sake list. Didn't try any of the sake due to the fact that we had just visited from Sake Day over at the Japanese Cultural Center nearby.", 
    "review_date": "2014-10-01"
  }, 
  "_1_eRkJDiAx0KMkRJncA9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pablo K.", 
    "review_text": "Very tasty sushi, nice people and a spacious environment. The wait has never been long for me, and it's quiet enough that you can hear each other without having to raise your voice. The location is easy to find and it's very close to the Kabuki theater if you want to catch a bite before the movie.", 
    "review_date": "2015-01-15"
  }, 
  "xIwXStH_2AQb6vVzkexroA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon L.", 
    "review_text": "Great izakaya place! 5 of us sat in their small tatami rooms that has a $200 minimum, which was not hard to hit. The room so had a bell on the wall for calling the servers' attention, which is very common in japan. We ordered about 15 different dishes (some doubled), 3 bottles of sake, 2 pitchers of beer and another bottle of beer. It totaled to about $300, which seems reasonable to me. For those of you unfamiliar, izakaya is like a tavern that specialized in grilled tapas. This place also had raw food, lots of fried options, ramen, donburi and other typical japanese snack foods served at beer houses like Tako yaki and kaki fry.  The food was in general above average and the decor and atmosphere was very Californian. It's a very fun and welcoming place to hang out with friends for drinking, chatting and eating without having to scream and loosing your voice!", 
    "review_date": "2014-02-22"
  }, 
  "Ace-HUw-c1f9zJr4QfJjQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "wingless g.", 
    "review_text": "The hubby was initially skeptical of visiting a restaurant that hasn't even been open for an entire week but we decided to try it out anyway thanks to its proximity to the Japanese market.  I'm definitely glad we decided to risk it because we had a great experience!  They were extremely accommodating of our 8 month old son, gave us a fairly secluded corner table (it helped that we went early and were the first ones there) and best of all they commented how cute he was but no one tried to touch him (total pet peeve when waiters touch his face since he is a preemie)!     Food highlights for me were definitely the Hotate (scallop) Gratin and the sake nigiri.  I would go back for these two things alone.  I'm not exaggerating when I say the sake nigiri was some of the best I've ever had.  Generous slices of fish that just melted in your mouth - yum.  And the scallops were so freaking delicious that I literally licked the shells.  Yes, it was that good.  My only gripe is that there were only three per order!  That was my own fault though, I really should have gotten two orders.  The hubby's favorite was the clam miso soup, TONS of clams and the broth was light and flavorful at the same time.    I can't say enough about how great the service was.  The waiter thought we had ordered sashimi instead of nigiri and due to the mixup they gave us an extra order of each nigiri for free!  They didn't have to do that, especially since the food came out so quickly so we really didn't have to wait long for the correct order to come out AND they gave us the 10% first week discount too.  Dishes were cleared quickly and the servers were always asking to check how everything was and if we needed anything else.    I'm officially a big fan of this place and hope they do well so I can come back for the scallops for years and years to come!  (But not so well that I won't be able to get a table if I go at 5:30 lol).", 
    "review_date": "2013-09-20"
  }, 
  "FJWk6Qr_ZLVPgcLS0xPlvQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon P.", 
    "review_text": "Been here 3 times already since they've opened. Delicious food, great atmosphere, and friendly staff. They have a wide selection of food and sake on the menu. I'm excited for my next visit! It can be a little pricey but well worth the price. Definitely a place worth checking out!", 
    "review_date": "2013-10-31"
  }, 
  "ftpfgb4IvNfwroUxuYTl-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mihea O.", 
    "review_text": "I went there with my friends yesterday!!! I like this restaurants' atmosphere, which was cozy and oriental style. I hope ur guys go there and taste this fantastic cusine. They have various food, and it was better than I expected.I and MY friends had a great time there.I think this restaurant is the place that I am looking for in SF. The flavos of Izaka food are sure to excite your taste buds!!!!!", 
    "review_date": "2013-10-29"
  }, 
  "neNSB3Sly1wUS6HFHLMang": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "和子 Y.", 
    "review_text": "I had heard great things about this place and heard from Japanese circles that the place is run by Japanese. I guess I had higher expectations, but I felt they might be trying to do too much. They are an izakaya, afterall, but seems to serve at least one of every type of Japanese dish including ramen (seems de riguer in the US, but you will not typically find ramen at izakaya in Japan), sushi (sashimi or raw fish yes, but not sushi), kushi yaki, koroke, wow, just every thing was on that menu! We tried sashimi (fish seemed like it was frozen then thawed), sansai ika (a bit dry), yakitori (too sweet!). Sunomono was good. Gyoza seemed a bit sweet and mushy. Nice selection of sake, but the brands are relatively easy to find elsewhere in J Town. Draft beer is Sapporo. Service was fine. Efficient and courteous. Interiors seemed to follow the usual SF trend of exposed wood. Nice to have private 'tatami' areas. Maybe this place is good for non-Japanese who could use a basic introduction to 'real' Japanese food, but if you know good Japanese food, then you might be a tad disappointed.", 
    "review_date": "2014-07-23"
  }, 
  "p_4jHMF9f96hXs09ekilKQ": {
    "user_rating": 5.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "so much fun to try all the small plates - I only wish we'd had a bigger group so we could have sampled more! But as it was we ate: hamachi carpaccio: fresh, clean kabocha croquette creamy, fried, salty yum chicken tsukune: umami, grilled, savory caterpillar: luscious, crunch, bbq hotate yaki: maybe the only eh in the bunch kaki fry: crispy, salty, sea  the sake flight was to die for - perfect sized sips (1.5 oz) of sakes that are normally only available by the bottle.", 
    "review_date": "2014-07-23"
  }, 
  "eH034FAZ5xfMFl21yKnhcA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "masa s.", 
    "review_text": "After months of anticipation for their advertised \"Coming March 2013\", I'd given up hope that I'd ever be able to try their food.  But, after seeing signs of life in July and August, hope picked up again.  You can see the amount of work that had been put into this place since Nan closed, and I think it looks great inside.  They have the Japanese-style seating on one side (with at least one table kind of a cool hybrid), and regular tables in the middle.  And the menu has a number of dishes that look really good and a nice sake selection.  So, I was really looking forward to tasting the food.  But, the actual execution fell short.  It all *looks* good.  Like, with the fancy flourishes with the sauce - you know - when they add the sauce on parts of the plate, but not actually on the food.  But, here's the thing: unless the sauce is just garnish, that fancy flourish just makes it harder to eat.  Some dishes were approached \"alright\" (with the tofu temptation making it into the \"good\" category), but mostly, it felt like they came up with the dish, then moved on to the next without  taking the time to perfect it.  And, since they cover just about every section of Japanese cuisine, seems almost inevitable.  The ramen was the huge disappointment.  The Kou ramen was reminiscent of Tampopo's Kyushu ramen, which you could have gotten away with everyone and their brother opened a ramen shop in SF.  But, if you want to be taken seriously, you should really take the time to do it right, and, if it's not working, don't put it on the menu.  (Or, maybe have it on the specials board to experiment.)  Note for the servers: When you are bringing a plate of \"oyster mushrooms\", if you leave out one of those two words, leave out \"oysters\", not \"mushrooms\".  My advice would be to cut the menu in half, and try and focus on a few dishes that they know they can do well.", 
    "review_date": "2013-09-22"
  }, 
  "vUI0jXAxFDzoLX04jN9RPA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "It's rare for me to say this but damn, this place is good! I would definitely bring someone here. It's super hipster and cool inside, with wooden decor and tables. I love the modern and airy feel.  The dishes are Japanese but with a twist. They will have dishes you won't see anywhere else. The quality and quantity as well as pricing was all decent especially for being in that neighborhood.  1. Egg pumpkin puff- delicious!!! The egg was runny, the pumpkin was sweet and the sauce and crunchy outside was perfection.  2. The uni something in the glass- omg. Good. I can just drink it.  3. The Frisco roll- yum!   4. The seafood ramen- spicy and yummy!  5. Chicken karage- yum! Crispy! With Siracha mayo.  6. Pork belly- this was ok.  All in all, a wonderful experience and food came out at a good pace. The workers were friendly.  Iza my type of place!", 
    "review_date": "2014-05-17"
  }, 
  "jMgetwOspGQQFhJs4fDwuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy Seungyeon K.", 
    "review_text": "I had really fantastic dinner at this place! Susi were fresh and good, and Kabocha Croquette was the BEST for me. It tasted so new and awesome! The service was good as well so I'm giving five stars :)", 
    "review_date": "2014-06-10"
  }, 
  "FG_ZKIMm-jMilGfACcgCSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C B.", 
    "review_text": "I like the food, the service could be a bit better, usually end up waiting around for someone when it gets a bit busier. Super close to the fillmore for easy dinner/drinks before a concert.", 
    "review_date": "2014-05-30"
  }, 
  "f_oFXzuujrl-ZG6tR7O81w": {
    "user_rating": 1.0, 
    "user_location": "Palm Springs, CA", 
    "user_name": "B S.", 
    "review_text": "Food tasted as if the staff had left it out on the counter for a day or so, almost moldy, that said the service was not up to par I think Taco Bell is much better! It is a cute little place but the management needs to clean up their act a bit....", 
    "review_date": "2015-01-11"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kim N.", 
    "review_text": "I never ate at the Korean joint that existed before this, but I did hit the Thai place before that. Let me tell you this place has been really transformed. Looking for a quick meal before a Fillmore show, we were denied by Prime Dip and State Bird. So we walked in here seeing a group of 12 before us. Shoot. But the hostess recognized we were stuck in back and we got a table immediately. Lifesaver. We were back near the bar between the tatami rooms and counter service, giving a good view of most of the restaurant Lots of wood, dimly lite. Very well appointed in a more modern way. Got:  -kaboCha Croquette boiled cage-free egg inside of pumpkin puffs   -Chicken Tsukune  chicken meatball  -kurobuta  black pork  -hamachi kama yellowtail collar  -hawaiian poke salad  hawaiian big eye tuna mixed w/sea veggies and seasonal vegetables in spicy sauce  -okonomiyaki japanese style pancake with bacon  Everything was fairly tasty. Portions are actually bigger than I thought they'd be. Staff are attentive and the food came out fast. We were out in under an hour. Definitely a place of consideration if you're trying to hit a show across the street with little time. Just make sure you dont get stuck behind 12 people!", 
    "review_date": "2014-04-02"
  }, 
  "y0rtNjNGdfULY_p-kTs4Nw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cydney S.", 
    "review_text": "My boyfriend and I love this place. Great food, excellent service.   We've been here several times now, brought friends a few times, and even tried one of the group rooms. Every visit was wonderful.   I personally loved the Kabocha Croquette (it's HUGE compared to the other appetizers btw), the Tofu Temptation (not shareable, only 3 spoons). The Buta Toro was also fantastic and their sushi is delicious. I was pleasantly surprised by the size of their fish cuts as well (despite their normally tiny portions).   My only wish is that they had a seasonal fish menu and that they had Sweet Shrimp! =)", 
    "review_date": "2014-12-30"
  }, 
  "irgRhiwd69JNVsNwFiL1BA": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Grvce P.", 
    "review_text": "This place is a big no for me. Unpleasant enough to leave after being sat down, or actually, being to forgotten about at the bar. The hostess (blonde, 5'4ish, glasses) was one of the biggest reasons we left because she set a bad vibe. We hung back so we didn't bombard her (it wasn't busy at all, a handful of tables - I know what it's like having been a hostess/waiter before to get stressed out by waiting customers), waiting for her to call us but was rude with an grouchy/mean expression on her face. We sat at the bar for awhile without being acknowledged so we thought it was just best to leave. Another thing that added on to the unpleasant experience was the language they were using. I speak Korean &amp; the chefs at the bar were using curse words &amp; whatnot.", 
    "review_date": "2014-12-28"
  }, 
  "N_yNJpSDHVVGP7jsshIyKA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Kavya T.", 
    "review_text": "We got the caterpillar roll, O-something sake, porcupine cabernet sauvignon, and the king oyster mushrooms. I had the caterpillar mostly so I can only talk about how fresh that was and I really enjoyed it. I heard the mushroom with the mango spicy sauce was pretty good. Kind of on the expensive side but I liked the very raw decor of the place...and located right around the corner from the Sundance Kabuki Theater. And it's open until 11pm I believe.", 
    "review_date": "2014-08-12"
  }, 
  "urqtKpxG3VM6C2vxhb1ilA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James Z.", 
    "review_text": "I went to Izakaya Kou last night for a Yelp Elite event (so my review may differ slightly from a non-special event meal). I must say, Izakaya Kou really played to their strengths. Normally, I don't crave izakaya. Between the various styles and dishes of Japanese cuisine, I lean towards ramen joints. However, this was a fabulous experience and meal!  Among the food sampled was the Uni Onsen Tamago. It is basically uni with a soft-boiled cage-free egg and their special Kou sauce sitting pretty in a martini glass. Very delicate flavors. I loved the thinly sliced red onions on top. Though I'm not crazy about uni, it was nevertheless refreshing. The dengaku miso was one of my favorites of the evening. It is grilled eggplant with a miso sauce. The kalbi tempura was also excellent and I wish I could've had more!   With fellow Yelpers, we shared: Okonomi Yaki ($12), Kou Ramen ($11), Kuo Sashimi ($18), Hamachi Kama ($12), Yaki Udon ($11), Salmon Skin Katsu ($7), Nagasaki Ramen ($14), and 2 green tea cheesecakes ($7 each). Among that list, it was agreed that the grilled hamachi was a \"must try.\" The okonomi yaki was also on point. I mean, how could you lose with a pancake loaded with bacon?!! The salmon skin katsu was a crowd-pleaser. The salmon was fried to perfection -- didn't turn out dry from the battered outer layer. The Nagasaki ramen was the better between the two ramens we ordered. The broth was delicious and the slight spiciness thanks to the jalapeño provided a nice kick! Now... dessert should always complete a meal and the green tea cheese cake really did! Subtle and rich at the same time -- is that possible?! It was accompanied with -- brace yourself... LAVENDER HONEY ICE CREAM FROM BI-RITE CREAMERY (my favorite flavor from Bi-Rite!). I thought it was vanilla upon seeing it, and once I put it in my mouth (keep it G-rated folks), I pretty much made the loudest \"food-gasm\" sound. The green tea cheesecake and the ice cream in one bite was euphoric.   In terms of cocktails, we tried the Samurai, Ginger Cooler, Love Hotel, and the Kou. I loved the Ginger Cooler most because it was refreshing and the combination of ginger, ginger-ale, sake, and lime was an apt beverage for the meal. A close runner-up was the Samurai.   The service was fantastic. Though it was for a private event and there were multiple servers taking care of the whole restaurant, our server Diane was so sweet, attentive, and very thorough in her descriptions of the dishes. I believe she said she mainly works Tuesdays and Wednesdays  (?), so if you get her, you'll be in good hands.   The interior... the only way I can describe it is... rustic Japanese meets modern American -- if that makes sense. There are Tatani rooms where shoes must be off in traditional Japanese settings, and there are communal dining tables as well. There is a lot of wood action happening at Izakaya Kou. The lighting is a soft yellow dim and its corner location allows for reasonable people-watching views.  Overall, I plan to return. I remember seeing this being constructed every time I'd walk along Fillmore and last night was a fantastic reason to try this spot. I would return in a minute with friends and loved ones. The food and the setting allow for a convivial feel. Also... if you want a cute date spot with sexy sharing food and a fun vibe, this is your place San Francisco. Bow-chicka-wow-wow. I highly recommend this spot. It'll exceed your expectations!", 
    "review_date": "2013-12-11"
  }, 
  "SrR2QuFU04EuYgsoKKh8Ww": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "BRIAN Y.", 
    "review_text": "Solid place and great service. We sat in one of those private rooms, which was a fun experience.  We ordered a TON of food and the bill was still very reasonable at the end of the night.  Also a great selection of sake that isn't too overwhelming nor limited.", 
    "review_date": "2014-02-18"
  }, 
  "_XvuuSBHNvXC4eziLEpbkA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah H.", 
    "review_text": "Wow. Do not ask for ramen at this place...  I came here because it was in walking distance from my house and I was craving ramen.   My boyfriend and I were seated right away, and we each ordered ramen.  He decided on the seafood ramen, and I opted for the traditional.  A few minutes later the waitress came back to tell us they were out of the seafood ramen.. so my bf ordered the regular as well.  I  am no ramen expert which is why I went to a restaurant to get it but I know it does not take 45 minutes to make!  (we were there on  a weeknight where the place was not crowded by any means but there were other people in the restaurant) We waited and waited with empty drinks and an empty table and finally the two bowls of ramen were brought out.   The ramen:  two bowls of the exact same order.. at first glance, my bf had about a third less amount of broth as me, so instead of listening to him complain to the waitress I poured some broth from my bowl to his.  Then we started eating it and the vegetables in it (which were too many for my taste) were overcooked, while the noodles seemed undercooked. BLAHHHH!  He was a little dramatic and stopped eating it altogether, but I was hungry so I ate just the noodles in my bowl.   The manager apologized and offered us a free beer, which I didn't take but my bf did since he had nothing else.   There are so many better places to get ramen or anything else Japanese that I won't be back here.", 
    "review_date": "2014-09-18"
  }, 
  "NO5e0WtLAOYcjheLU6OEVg": {
    "user_rating": 2.0, 
    "user_location": "Arcadia, CA", 
    "user_name": "MarVy S.", 
    "review_text": "Came here for a late dinner.  The ambience is modern, spacious, and very clean.  It wasn't busy so we were seated right away.  Tables and chairs are made of wood.  They also have private Tatami rooms which is good for a party of five to eight.    ::Drinks:: I got the Chuhai which is a Japanese cocktail.  It's blood orange juice with Japanese vodka. I don't think I got blood orange juice, instead it tasted like regular orange soda.    (<a href=\"http://www.yelp.com/user_local_photos?userid=NO5e0WtLAOYcjheLU6OEVg&amp;select=iTz1lJNNM_5aCU9oiZyfQw\">yelp.com/user_local_phot…</a>)  ::Food:: The Bacon Enoki is basically wrapped in bacon.  I thought it was bland and I couldn't taste the bacon.  Then we got the Kurobuta Sausage which is Black Pork Sausage, it was \"ok\".  I like Manila clams so we got the Asari Miso.  It was served in a small bowl filled with Manila clams, miso broth, and topped with parsley; it was salty.  I saw a lot of pictures of the Kalbi Tempura so I decided to try it.  It's Korean Style boneless short ribs with vegetables and mixed with sesame ponzu sauce.  The short rib was chewy and the tempura was soggy; I didn't like it.    (<a href=\"http://www.yelp.com/user_local_photos?userid=NO5e0WtLAOYcjheLU6OEVg&amp;select=3eFpSuFtfLB-YNKZmAPlbQ\">yelp.com/user_local_phot…</a>)  (<a href=\"http://www.yelp.com/user_local_photos?userid=NO5e0WtLAOYcjheLU6OEVg&amp;select=2oWJ1E7yovs2cM4qnp3YMQ\">yelp.com/user_local_phot…</a>)  (<a href=\"http://www.yelp.com/user_local_photos?userid=NO5e0WtLAOYcjheLU6OEVg&amp;select=LXlHW5x8P1FldwpZzoNi4w\">yelp.com/user_local_phot…</a>)  (<a href=\"http://www.yelp.com/user_local_photos?userid=NO5e0WtLAOYcjheLU6OEVg&amp;select=qOM5fOHy5O6aJAH9Qbq_3w\">yelp.com/user_local_phot…</a>)  ::\"Meh\" Moment:: We were looking forward to eating the Nagasaki Ramen but unfortunately we didn't get to because they took a long time to make it. We finished all our food and it still wasn't ready.    ::Rating:: The ambience is nice but I wasn't satisfied with the food.   ::M's Notes:: ~Inside seating  ~Reservations available online.", 
    "review_date": "2014-12-11"
  }, 
  "IO4ZbLWjUM18uC1TS3U2PQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John W.", 
    "review_text": "This is a real find! Excellent food (try the eggplant dish or the blackened cod or very spicy Hawaiian Poke, which were superb), speedy and wonderfully helpful service, and a large selection of fine saki and wine at a reasonable price. It's new, and we plan to return very soon to try other items from the soups and fried list -- the menu is extensive!", 
    "review_date": "2013-11-24"
  }, 
  "jpl1W8uMWbil8ixuI1QbbA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Lisa T.", 
    "review_text": "We stumbled upon this restaurant when we couldn't get into another place nearby.  We are glad we did!  The décor was awesome!! Lots of wood and these cool, private areas for larger groups.   The food was good, we shared a sushi roll and both had the ramen. The broth and goodies in it were delicious.  Service was great, would definitely love to return with a group and sit in the secret cubbies!", 
    "review_date": "2014-10-24"
  }, 
  "h4CI0N2UB8KL7zK-JaHe7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie SoJung K.", 
    "review_text": "I had a party inside of their tatami room last weekend and it was amazing. The staff was friendly and food was delicious, especially the nagasaki ramen and tako wasabi.", 
    "review_date": "2014-05-02"
  }, 
  "pJ9bcaml-WCxl74p-i7FlA": {
    "user_rating": 1.0, 
    "user_location": "Hong Kong", 
    "user_name": "Anthony T.", 
    "review_text": "If the restaurant advertises it closes at 10pm on a Sunday and you wanna grab a quick sushi roll to go at 9:31pm - don't bother, the kitchen closes at 9:30pm", 
    "review_date": "2015-01-18"
  }, 
  "-4uJ9HeVqFhfX28OaxvNBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "chris l.", 
    "review_text": "damn best japanese in town and you won't regret it", 
    "review_date": "2014-05-19"
  }, 
  "FHbWz5kgIXBcDHdNfCLhNg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ivy P.", 
    "review_text": "Place is legit!  Forget the carpaccio stuff and fusion whatevers, the sushi/fish is fresh and no frills.", 
    "review_date": "2014-09-26"
  }, 
  "Juh-g9sATZppHvMmNmHfFw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simon C.", 
    "review_text": "This location is at a walkable distance to Japantown (around 5-10 mins?) so you don't need to worry about parking. In my experience, Izakaya is usually in a small compact environment, with traditional Japanese feeling. Not anything like that here, it's classy, it has high ceilings, very spacious, and it plays light classical music. Anyway, the dishes:  - Maguro Tartare: big eye tuna chopped sashimi (it seems this restaurant emphasizes \"big eye\" a lot as all tuna dishes on menu are big eye tuna) with raw egg. Mix it together and eat; interesting texture, and good as a first dish - Dengaku Miso (eggplant): a must to order whenever I go izakaya not only because I like eggplant, but apparently all Izakaya I have been to had some very different cooking method of this dish. In here, it got a quarter size of a Japanese fat eggplant, so big that you would think the middle of the eggplant will be not as good but NOT - the miso taste was strong, not too hard/soft, and the skin was soft as well - Hotate Yaki: another amazing dish but not because of the scallop, but because of the asparagus - it totally felt like a Chinese stir-fry asparagus scallop dish in local low cost hawkers store; but really, this dish was just phenomenal! - Buta Toro: this one is alright; wouldn't order it next time though - Kalbi Tempura: a dish that I would have never ordered but my friend did - and it turned out to be as amazing as the Hotate Yaki. I always thought Kalbi was only for Korean BBQ but I would have never imagined it can be made as tempura with wonderful taste!! Must try! - Frisco Roll - a regular sushi roll but the fish was fresh and I could instantly tell the chef paid a lot of effort to make it good - Momo skewers: chicken thigh yakitori, a bit overcooked, kind of hard - Mushroom Enoki skewers: not too bad, enoki mushroom smelled good - Ika Yaki (whole grilled squid): descent, nothing too special - Kabocha Croquette: we added this as additional order but we waited for a long time and it didn't came; asked the waiter and found that the chef overcooked the original one and had already started cooking a new one for us instead. I give one additional star just because of the persistence the chef has about his food  Other than that, the waitress service was a bit disappointing, very very small voice, could barely hear what she said; although I could tell she was doing her best and she had a nice attitude at least.  Definitely a coming back to this restaurant! Next time with a larger group though, those private rooms look really nice and cozy. One of my new favorite SF Izakayas!", 
    "review_date": "2014-03-31"
  }, 
  "AuXucaYN2ts9XNk-plKTeQ": {
    "user_rating": 5.0, 
    "user_location": "Rohnert Park, CA", 
    "user_name": "Euco I.", 
    "review_text": "I go to Japantown often, but I have never been this place before. This place is fabulous. Great ambiance and friendly service. We ordered Tako Wasa, Ika Sansai, Kabocha Croquette, Poke, Yakitori Momo and Tsukune, Karaage, Takoyaki, and Yaki Onigiri. Everything was good, and I really enjoyed Poke and Kabocha Croquette. It was in Happy Hour, so beer was only $3. I will definitely come back to Kou!", 
    "review_date": "2015-01-19"
  }, 
  "aYgkKslXRA8u0WbvRtpjSw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "James M.", 
    "review_text": "I was recently visiting from LA and heard about this new place on Fillmore and Geary. I was so excited having passed by earlier in the day... and then so disappointed after leaving. I'm really not sure where the other people who reviewed this restaurant ate. Definitely not here.  I'll make the review short and sweet. For ambiance, this place gets an A+. It's great -- nice lighting, nice space, not too loud, and pretty comfortable. For service, this place gets an A. Our server was nice, funny, and very helpful. For food, this place gets nothing better than a C- or C. We had a speciality roll, which was probably a B-, squid, which was a C, and short ribs that were rubbery and, basically, the nasty shit you've ever tasted. So, F. I think that would all be okay if everything was priced lower, but this is not a cheap place to eat. It's not particularly expensive either, but for the food quality, it was definitely over priced. I love supporting new businesses, and although the place looks awesome and the staff is great, the food sucked.  Fix the most important part of the experience and I'll be back.", 
    "review_date": "2013-11-02"
  }, 
  "GDAwnhCzH0s7x6YrBigOAQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica B.", 
    "review_text": "I went here with a group on a Saturday night for dinner. The concept is great if you can reserve a private Tatami room. You just have to press a button on the wall when you want to order something. Very cool. I tried this sparkling \"jelly\" cocktail that was unlike any drink I ever had. The consistency really was jelly-like. I'd recommend trying it if you like sweet drinks. Although I really liked the ambiance, I didn't care much for the food. I enjoyed the hamachi carpaccio, however the beef tataki, gyoza, icy soba and kabocha croquette were underwhelming. The layer of pumpkin on the croquette was way too thick. The whole Japanese fusion didn't work for me. I'd almost like to see them stick with more traditional preparation done really well.", 
    "review_date": "2015-01-25"
  }, 
  "KRfRO8yMi4pCb9Sh8-vGzg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CatsPjs Z.", 
    "review_text": "Meh. It's ok. Nothing special. The service is excellent. The food is nothing to write home about. But not bad either.", 
    "review_date": "2014-10-31"
  }, 
  "gVddqshP7KTJvzycrw1_5Q": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kit P.", 
    "review_text": "The food's nice so we used to get take-out from here. But I don't think we will anymore because I found out that they increased the tip amount on our credit card without our approval. Hate restaurants that do that. Is that even legal?", 
    "review_date": "2014-06-29"
  }, 
  "ItTeqxJWiW_1IzQ1wTAL9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K. S.", 
    "review_text": "Aesthetics: Earthy wood walls, floors, tables, and chairs, all monochromatic and minimalist without feeling oppressive or sterile.  Twisting tree trunks jutting out of the floor.  Air plants and branches growing out of the walls.  Enclosed rooms with sliding wood doors with floor pillow seating.  Edison bulbs, of course.  I want to redo my apartment exactly like this now.  I couldn't stop thinking about the interior design.  It's genius.    Food: The presentation was pure art.  We ordered Kou Sashimi, Croquette, Volcano Roll, and Shishito Peppers.  The Kou Sashimi melts in your mouth.  Will definitely order again.  Then I cut open the croquette and to my surprise, an egg had been concealed inside, yolk sensually oozing onto the plate.  I like the feeling of the egg gently popping open, the layers and textures...  Like a haiku, the croquette seems simple on the surface, yet contains so much within...  Service: Food arrived FAST!  Staff is friendly, easy-going, and polite, and I was happy to be spared the usual inauthentic small talk bullshit.  They simply did their jobs well so I could comfortably focus on eating without having to socially exert myself.  I'm an introvert in a noisy overpopulated city, so I treasure any moment I can space-out freely with minimal intrusion.  Food orgasms are best experienced sans interruption mid-chew.  Ambience: Despite being full of people, this is an oasis of calm, which is a rare thing to find in San Francisco.  I can't remember the last time I wasn't bumping elbows with the table next to me, or not being forced to eavesdrop on loud strangers seated too close.  Introvert approved!  Verdict: A novel dining experience.  Stylish spot for friend gatherings, yet sophisticated enough to bring parents, co-workers, or a discerning date.  We waited 30 minutes on a sunday night but it gave us time to decide what to order, and the atmosphere is so lovely I really didn't mind hanging out for a bit in their waiting chairs.  Get a reservation if you don't want to wait.", 
    "review_date": "2015-01-26"
  }, 
  "xGDcXcscWQl_X0R3f1LIzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken C.", 
    "review_text": "Overall very satisfied with my meal. Good sushi and non-sushi items on the menu. We grabbed a couple items here and there and made a meal out of small dishes. Service was great, the location is great being right on Geary, and the price is comparable with other 4 star japanese joints. Izakaya has a business casual vibe meaning you should dress up a little, and expect a lot of hard wood and dim lighting. Oh and when you've ordered all of your lovely sushi/sashimi/rolls, make sure to get an order of the pork belly with kimchi - so delicious!", 
    "review_date": "2014-09-08"
  }, 
  "ueaE24P0Xn-T4VRstwZYfA": {
    "user_rating": 2.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Elizabeth K.", 
    "review_text": "overpriced, not that great.", 
    "review_date": "2014-09-14"
  }, 
  "hETgHml_EJ17ry4r_N8A-w": {
    "user_rating": 4.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Katie R.", 
    "review_text": "My friend and I were looking for ramen during the J Pop festival and found Izakaya Kou. They weren't open yet when we called but the staff was very helpful and advised us to show up a little early so we could get a table right when they opened at 5:30.  We were lucky enough to get seated and were able to order fairly quickly. I had the seafood ramen, which I'm no expert on, but it was delicious and the portion size was reasonable (not too big). My friend had an undon stir fry dish and really enjoyed that as well. Both dishes were flavorful and contained a nice variety of seafood.  This was an extremely busy day, but the wait staff was as attentive as could be expected, our water glasses were always full and they even split our check for us. We also really enjoyed the ambiance of the restaurant. It felt tastefully minimalist and modern but the strategic placement of glass walls and partitions meant that it was not too loud or full of echoes.", 
    "review_date": "2014-07-22"
  }, 
  "HCtEYgABFgwGhHB3rPQeQQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coraly S.", 
    "review_text": "Service could not be any slower.  It literally took almost 20 minutes before someone even came over to acknowledge our existence.  I will say food is great, space is beautiful,  but based on the service, I'm not sure I will be back  Mushroom wrapped bacon....amazing tho!", 
    "review_date": "2014-04-23"
  }, 
  "_eRTv9-B33t0ybQaYz-C1Q": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "xue d.", 
    "review_text": "It is very oily and they put a lot of salt in ramen . The food is not very good but service are fine .", 
    "review_date": "2014-11-25"
  }, 
  "Vab-TCp-yAz_UmT0ereFRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B Y.", 
    "review_text": "Love Love Lovin' this place!!!  Excellent fresh food!  Sushi and pork belly was perfection! Excellent customer service! James the host was super nice and welcoming.  He even brought us complimentary strawberry ice cream for dessert...talk about stepping out of the box. Will D-E-F-I-N-I-T-E-L-Y be coming back!", 
    "review_date": "2014-10-11"
  }, 
  "vqBuGCz3DNNXLU03rpu0LA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika S.", 
    "review_text": "If you're feeling fiesty, get the uni w onsen tamago. Lovely presentation. I dare you to eat it shooter style!", 
    "review_date": "2014-01-05"
  }, 
  "8p4w0obQ4tBStWw13omWig": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jill T.", 
    "review_text": "We went and sat at the sushi bar. The sushi was fresh and good. I liked this place but there wasn't a lot about it that made is super special. There is a lot great places around and this place is one of them. If I was in the area I would definitely hit this place up again but I am not sure I'd self motivate to go again.", 
    "review_date": "2014-03-29"
  }, 
  "R1xTLNoaSGgMg96PGpRzOQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H S.", 
    "review_text": "Ramen noodles way too soft, toppings burnt. Okonomiyaki undercooked inside. Buta k akuni good. Good service.", 
    "review_date": "2014-04-11"
  }, 
  "2XLyYL5c9eUpGGz6JZLvMw": {
    "user_rating": 3.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Katarina F.", 
    "review_text": "Don't let the outside look fool you! It's beautiful on the inside. I only took one star off for poor service and the fact that they didn't have that much selection when it comes to food, especially the sushi rolls selections was what annoyed me most. I was out of water for like 10 minutes and my friends teeny scallops came before my sushi. Not sure how that happened but okay. The miso soup was pretty delicious as was my sushi roll (volcano roll), it didn't fill me up but it did take away my hunger. Overall I would come here again, maybe with a group the try that \"private\" style Japanese tea house rooms they have.", 
    "review_date": "2014-10-06"
  }, 
  "qNrHLZPurBWJzeAMkFLvvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracy T.", 
    "review_text": "Highlights - I've seen their coming soon sign and they were originally suppose to open earlier this year, but it is finally here months later and I have to say that it is beautifully decorated with minimalist nature feel. Walking in makes you feel like you are transformed into a different environment with the wooden tables, decor, and private rooms.  - The perfect place to have a intimate event by reserving one of their private rooms or just a casual dinner at the bar or one of their tables within the restaurant.  - Food is delicious during my first visit and thanks to a recent YEE that I attended again here, I had the opportunity to even try more of their fantastic dishes.  - Items that stood out: Kabocha Croquette (Deep fried pumpkin ball wrapped egg), Uni Onsen Tamago (soft poached egg with uni served in a martini glass), KuruMa rbi Zuke (raw prawn in soy sauce marinade w/ onigiri) - Best drink: The Samuri (Sake, Cucumber, Lemon, and Apple juice). Refreshing and thirst quenching.  - Service was attentive and the best I have had. I had the same server both times and she was on her A-game. Ready to swap out chopsticks that dropped, clear out any trash on the table, provide you with extra napkins, and on it when you need something.   Improvements - Very very minor detail that i noticed, but I can see it being cramped in the picnic like table inside the glass room to the right. It's a nice concept, but I'm not sure how patrons would maneuver around if someone were to need to go to to the bathroom and dishes were to be served. Other than this, I can't think of anything else.   Tip - I didn't have to make a reservation the first time I came, since they had plenty of tables free. Parking is a little hard. Other than street parking or an alternative mode of transportation, it's better parking in the neighborhoods if you go a little further out.", 
    "review_date": "2013-12-31"
  }, 
  "zbzbnz43wCXFCj9b211HHg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charmaine L.", 
    "review_text": "This place is a perfect spot to have dinner and hang out with friends. The interior is beautiful and nicely decorated. The ambience is a bit loud. The service was good, but the food was just okay for me. We ordered a lot starting with an appetizer, grilled, sashimi, fried, etc. I like the asari miso. It has seaweeds and manila clams, which is a little different compare to plain ol' miso soup. I like all the food that we ordered, but it got too salty for me after awhile. My man loves the pork belly so much, so I think it's an A- for him.", 
    "review_date": "2014-08-21"
  }, 
  "WF1o6AyXm6-NovD5dFnMOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike K.", 
    "review_text": "Izakaya Kou is a beautifully redesigned space that remains honest to it's shell. Clean, refined and translucent.  Our group reserved one of the private rooms which comfortably sat 10. Soft mats lined the table and tatami flooring transitioned you into the space.  The menu is diverse and rich. Traditional Japanese items are crafted with a modern light to product gorgeous pieces for the table.  The sashimi plates came with deep cuts of fresh fish with a fair selection of choice items. Each slice is decadent and they are generous with portions.  Tofu temptation and the kalbi tempura are the highlights. Each dish is crafted with elegance and the flavor pounds away at your guilt. While the bites go quick, it's absolutely worth ordering more.  Lower Fillmore: A culinary zone that seems to be moving on up and continuing the trend of ambitious yet humble food that is here to stay.", 
    "review_date": "2013-12-07"
  }, 
  "9uYtxCQ4y_2j_8ldgsmRaQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rick M.", 
    "review_text": "Snappy service. Host gave us free drinks because we had to wait for our reservation. Good ambience and decor.   Pricing was very reasonable for good quality product.   Side rooms for traditional Japanese dining were a good touch.", 
    "review_date": "2014-03-28"
  }, 
  "n-UhY5NO70Q1FPpO_hSn8A": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Toro C.", 
    "review_text": "I loved every dish that I ordered except for the sake onigirl. For $8, the portions were so small and the rice was too hard. Maybe I came on a bad night? Oh well.", 
    "review_date": "2014-10-12"
  }, 
  "exygIMUwWiMg8HU4L_lNIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan C.", 
    "review_text": "First time there tonight. No reservation, seated immediately. Menu is quite extensive, and is effectively Asian fusion in nature. A bunch of sushi, skewers, fried options plus standard Japanese faire.  We shared a bottle of sake, some beer, miso soup and then ate:  - Sea urchin with poached egg  - Bacon wrapped mushrooms - Miso glazed black cod - Scallop gratin  The best was probably the fish which was perfect cooked, delicate and nicely flavored. The sea urchin was small but very tasty. Difficult to share. The scallop gratin was delicious too.   What really stood out to be honest though was the service. The waiter / maitre d' walked us through his favorite choices which we ended up ordering, and even steered us away from some dishes that he thought weren't as good as described. Additionally due to an extended wait for our final course, he brought us 2 free glasses of sake which were delicious.  Will certainly return...not as expensive as expected either.", 
    "review_date": "2014-02-05"
  }, 
  "5n_dkk0dEHFSNIJN5AMmvw": {
    "user_rating": 4.0, 
    "user_location": "Bronxville, NY", 
    "user_name": "John Y.", 
    "review_text": "Cool spot to grab some sake or shochu, engage in some conversation in a lively (but not overly loud) environment. The izakaya-style food and appetizers are solid - not the best Japanese I've ever had, but certainly appropriate for a casual bar atmosphere.  I would say that it's fairly authentic, except that most of the staff is Korean. Not complaining (the waitresses are friendly and cute), but just sayin'", 
    "review_date": "2014-08-09"
  }, 
  "wVZwqj_85525t4URtCDvig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessi G.", 
    "review_text": "This place is absolutely delicious! Went here on a date as well as on a girls night out and had a wonderful time on both. It's a great place to go for a special night out. I have only been here twice but I already have a handful of favorite dishes! If you go you must get the Kyokou Mori which is incredibly simple and fresh. I could easily eat 5 plates of these because I am obsessed with the spicy ponzu sauce that it comes in. I could dip.... Everything in that. The Dengaku Miso is also a winner because of its deep and complex flavors. This is definitely much more savory and what I would consider to be a comfort dish.   In addition to all of the wonderful flavors these dishes have to offer the chefs also do an amazing job with presentation. I was very impressed after both visits.  Make sure to make a reservation a few days in advance- especially if you are planning a weekend visit because this place is always poppin.", 
    "review_date": "2014-08-26"
  }, 
  "gji92ao5NAIrb3akKyqTZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "Came here for a Yelp event, thank you!! I'm vegetarian, so my review is fairly biased. The atmosphere is great, and I'm a big fan of the neighborhood so I'll definitely be back for drinks + snacks. When it comes to veg. options, they are limited and fairly heavy (if you want more than a salad). The squash croquette is good, but as I just mentioned, really really heavy.", 
    "review_date": "2014-01-08"
  }, 
  "EVPX7KTQyyh-k15YiNfSdg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chuck S.", 
    "review_text": "We had big expectation when we booked this restaurant. But it turned out to be just OK.  The dishes we liked were their Udon, uni with broiled egg and grilled black cod. Udon and uni was excellent. The cod was really tasty but too small for that price. The atmosphere was OK but too noisy for us. Worst was their seaweed salad. It was just normal seaweed salad you could find in any Asian supermarket put in a fancy plate. Totally not worth it.", 
    "review_date": "2014-09-03"
  }, 
  "1nN4RNJrMSbQJHeyPUvAbQ": {
    "user_rating": 5.0, 
    "user_location": "Bellevue, WA", 
    "user_name": "Lily L.", 
    "review_text": "My sister introduced this new izakaya to me and said we should try it. Where should I start first?   Ambiance #1: I love this word and I always want to check out a restaurant for it's vibe. Do I see myself going even just for a drink? Do I WANT to bring friends there? Is it worth recommending on YELP? For here? Absolutely.   It's easy to find and people are always standing at the greeting guests. Perhaps it's their new business procedure before they get super busy, but having a good first impression is always a bonus. The manager stood at the door with a server, and as you walk in, the server readily walks you to your table.   Ambiance #2: I love the openness of the restaurant. There are tables down the center of the restaurant, sushi bar to the right, and as usual, tatami styled private rooms to the left. Each room can be opened for bigger parties, otherwise become three rooms of eight. Dim lighting and beautiful artwork.   Service: I only have to say three words: friendly, knowledgeable, and quick. I love it when servers can tell me what's good (not just because they work there), their favorites, highly recommended items, and also recommend drinks (sake in this case). I dislike when I ask a question and an answer like \"they're all good\" comes out. It actually makes me question the food.   Food: Can I say WOW?!! Yes. Yes I can. Presentation, originality yet creative, and taste. I'm not a professional food critique, but their dishes are how I see them in Japan and how I remember dishes tasting in Japan. For eight people,  we have about 20 or so dishes and many of them were portioned for at least the number of people present. They were very generous. Photos have yet to be posted, but stay tune! You'll know what I mean after I post them.  There's much to be said, but sometimes tasting it is better than just reading a review. Try it if you haven't and definitely reserve for parties larger than four.", 
    "review_date": "2014-01-14"
  }, 
  "tfeWk9oe8SpJz4ptH0VSqA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin M.", 
    "review_text": "Great aesthetic, felt like I was back in Tokyo. That said, the food was not memorable as the flavours never popped for me. The waitress was great navigating us away from dishes that weren't going to stay on the menu. We ended up eating a variety of everything from fried beef, squid, chicken to grilled egg plant and chicken, to various sashimi and sushi rolls. The ramen was okay, but the clam miso seemed to be the winner. This place could be a great, but they need to kick up the flavour.", 
    "review_date": "2014-04-04"
  }, 
  "bFBQgg7cH_HA36RFGZYXOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cheyenne G.", 
    "review_text": "Absolutely well prepared great food! Everything we have ordered has been great! Also love their sake selection. Recommend the tasting flight. I lost my phone there once, and the next day got it back. They even charged the phone for me! My only one wish is the dish size could be bigger. They are almost bite size. We had to order a lot of dishes every time and the bill gets expensive quick. I think the current 2$ signs is not accurate. More like 3 $'s. The ambiance is also great. Love the large tables they have.", 
    "review_date": "2014-07-28"
  }, 
  "LrTJPD0wO8L_zBbWwzbirg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will S.", 
    "review_text": "Izakaya is such a wonderful thing when done right. Not sure that this fully qualifies as Izakaya in the strictest definitions, as there are some modern twists and fusion happening here (not a bad thing at all). Regardless, this hit some great notes with us and was one of the more enjoyable meals we've had out in a while...   We hit Izakaya hard and had too many things to list here, but some quick high points:   - Yakitori - Basically the whole section of the menu is worth getting. There were some stand  outs (Ebi, Kurobota Black Sausage, Shishito), but in general everything was as it should be (though the chicken and pork were a tad under seasoned for my taste).   - Sashimi - No complaints here; Tasted great and seemed to be high quality fish.   - Beer/wine - As it should be, inexpensive and plentiful. They aren't charging premiums here for alcohol ($25 bucks for a bottle of Cune, and $18 for a pitcher of Sapporo), which is great especially in SF.   - Service - Excellent service, friendly waitress, lots of great recommendations. Well done.  - Ambience - Warm, aesthetically pleasing, and really just a fun place to be.   I could go on and on. The point is, I wish I could have eaten more. With all the booze and food (three big rounds of dishes), we spent two hours of happiness there, and I think it came to $174 for 4 people. A bargain given what we've paid elsewhere for less food and less fun.   I will be going back to Izakaya Kou, and will maybe rent one of their Tatami rooms as they look like a lot of fun.   Kampai!", 
    "review_date": "2014-03-17"
  }, 
  "DTw_x7mz1mIwak6Pa_Ds3A": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "DivaDangerous T.", 
    "review_text": "Nice ambience and decor. Service is friendly but spotty. Food is good, but not spectacular. Portions are on the smaller side which is a plus if you like to sample a few different things.", 
    "review_date": "2014-08-31"
  }, 
  "dS-a0LZDeNTsmOV8gOSLWg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Vincent L.", 
    "review_text": "Cool place &amp; friendly waitress~", 
    "review_date": "2014-04-30"
  }, 
  "6pl4HxA6N1eVLf5f3SxnuQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rollo_Tomasi 1.", 
    "review_text": "Breaking my rule again of only reviewing a place after one visit. For those that don't follow me, one of the reasons my reviews are better than yours is that I review a place after several visits and after trying many things. I have a more accurate assessment of a place rather than that douche who goes to a place, only orders orders one thing and then writes a review like he's an expert. Fuck those YELP reviews!   Anyways, me and the GF ordered:  Spicy tuna roll (ok) Dragon roll (great) Lizard Eye (outstanding) Corn cheese gratin (simple, great) Kurabuta sausage (meh, essentially a hot dog. Good with the rice and corn together though) Beef tataki (disappointing but still ok) Side rice Fried green tea ice cream (poor) 1 beer, 1 soda  It was around $75 +$15tip. $90 total, no wait for the table (Saturday around 10pm) and out in about an hour, full enough. I think that's all pretty good. Will definitely be back!", 
    "review_date": "2014-12-10"
  }, 
  "s1MgWqFhSw3vfS-POOF6AA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marie G.", 
    "review_text": "Chose this restaurant for my husband's birthday dinner based on yelp reviews and accessibility to making reservations via opentable.   I actually booked a table for 7 only to find out 20 minutes before our seating that 2 people had cancelled. I walked up to the host to let them know our part had shrunk from 7 to 5 people and he was only too happy to adjust our reservation and we actually scored a tatami room. No drama, no attitude.   We made it time to order a few happy hour deals, which was great. They have a great deal on 300 ml bottles of sake, buy one at happy hour price and get the second for $1!   The menu is diverse without being confusing and each dish is prepared thoughtfully and with care. I love, love, loved the maguro sashimi presentation and the pork belly was heaven. They have an amazing, sweet and savory eringi mushroom prepared teppanyaki style, as well.   Our server was gracious, attentive, and accommodating and was quick to offer suggestions that really helped make our dinner experience special. While the tatami rooms had a max time of 3 hours, the restaurant did not rush us or make us feel that we had a time limit.  We're looking forward to coming back for more on our next trip up to SF.", 
    "review_date": "2014-08-08"
  }, 
  "aP523nJ5B4xnvqLrLs0gZA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Roger T.", 
    "review_text": "My wife and I had dinner here at 7pm on Thursday night, we made a reservation through OpenTable.  On arrival, the host practically greeted us by name.  We were seated quickly in the main room.  The ambiance was comfortable and noise level reasonable.    We ordered the Kou Sashimi (salmon, hawaiian big eye tuna, yellowtail), Frisco Roll (spicy hawaiian big eye tuna roll topped w/salmon, avocado &amp; unagi glaze), Kaki Fry (fried oyster) and Kurobuta (black pork) and Gyoza (fried pork potsticker).  Everything was fantastic.    The service was equally stellar.  We were always attended to with smiles.  Just a great overall experience both in terms of food, service and ambiance.  Would definitely come here again.", 
    "review_date": "2014-11-16"
  }, 
  "lq_XQWEb6ZKPWMvWnhp4oA": {
    "user_rating": 5.0, 
    "user_location": "Orlando, FL", 
    "user_name": "Charles J.", 
    "review_text": "Stayed at a hotel in Japantown, and was looking for a great place to eat. Saw some reviews, and decided to eat here. Absolutely delicious with a great decor. Surprisingly very reasonable prices (I expected higher costs when I saw the inside). Portions were a little on the small side, so you will want to order at least 2-3 dishes per person. Wonderful service. You won't be disappointed.", 
    "review_date": "2014-07-26"
  }, 
  "gK8N0apndDn7P26_zGuxBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S S.", 
    "review_text": "So good! Great atmosphere. Great food. Great service.   Recommend the poke and volcano roll", 
    "review_date": "2013-11-29"
  }, 
  "KUusL15g7gVmPO7_XRp8cQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "Why is this place doing yakitori when its not even their specialty? Could not believe it when my under seasoned chicken skewer was over cooked! Really haven't had yakitori this bad in awhile.   The \"chef specialty\" - hamachi carpaccio was not fresh. we did not finish it.   With that said, their sea urchin onsen egg was delightful. The Kabocha croquette was huge but delicious. Cheese corn was yummy though it was screaming for some carbs to soak up the garlic butter.. maybe a small japanese pizza would do the trick. Izakaya Kou should take notes from the Vancouver izakayas.   All in all, this izakaya has potential but may need to cut down on the extensive menu, scrap the yakitori category if it cannot be up to par and focus on just having the items that shine!   ** They do serve Dassai 50 in both sizes as well as Calpico.. which is always a plus!", 
    "review_date": "2014-08-27"
  }, 
  "BxARkkmEViMDHDVddUDX0A": {
    "user_rating": 3.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Frederick L.", 
    "review_text": "Decor is great...very very cool.  Dishes looked great from the menu, and they took some awesome pics of the food they were showing off on the TV.  They have a great advantage because they can take some of the run-off of people who can't get in to State Bird Provisions for walk-ins.    Kabocha Croquette: crust was way too hard, and the kabocha texture was kind of dry.  The idea of the egg in the middle was a good touch.  I wanted the Uni version, but they didn't have uni that night.    Grilled Squid: I have this at every izakaya place, but this one lacked the charred flavor I like.    Chirashi: I've never had a chirashi on a plate before, but I didn't really like the sashimi selection I got.  Meh...I get it's a weekday, but they can do better.    Grilled pork belly skewers: the highlight of the night...solid.  Short rib tempura: didn't know what to expect with this, but it was not bad.  Liked the greens to give it a change of texture and flavor.    Takoyaki: another solid dish  Potato croquettes: nice and creamy...solid  Okonomiyaki: it was ok...maybe I don't get to eat okonomiyaki that much, but I felt like it was a bit undercooked.  Presentation was solid though.  Service was ok.  Food came out pretty fast, and I felt like it could have been paced a little better, considering how small our table was.  The restaurant wasn't busy (there was only 1 other table and a few people at the bar).  Our server, with some help, delivered all the food and that was it.  Attentiveness could have been a bit better.    Anyhow, I will be back.  Hope the overall food experience will be better.", 
    "review_date": "2014-06-28"
  }, 
  "VpGATmowGR3iBkHqT-Ec2g": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Lisa W.", 
    "review_text": "Authentic japanese environment, super fresh sashimi, delicious food. Pretty much one of the best japanese dining experiences you can have in the city.", 
    "review_date": "2014-03-21"
  }, 
  "fCpniKsfDPBjKagpCGHMZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy N.", 
    "review_text": "Another must-try is the tako wasabi! I'm a huge fan of the \"crunch\" that raw octopus has. It was mixed with a wasabi sauce that gave it an awesome kick!", 
    "review_date": "2014-01-21"
  }, 
  "M4OZcoLHydGc-M5TTE5Qpg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Molly P.", 
    "review_text": "Writing this review after going 3 or 4 times. The biggest problem here is the service: slow, inattentive, and disinterested. The manager is excellent, and on a slower night, he is able to overcome the lackluster waitstaff, but on a busy night, he can't, and that's when the poor service really shows. On a Saturday night, no one came to our table -- and we didn't even receive water -- until the manager noticed and sent someone to our table 20 minutes later. The food is hit or miss. We tried both the seaweed and daikon salads, both of which said they included \"fresh vegetables from the farmer's market\" -- and they were the most disappointing salads we have ever had. Other than 3 slices of tomato under the seaweed and daikon, the description of \"fresh vegetables\" was totally false advertising. Many of the dishes LOOK great but don't taste as great. I asked for the beef tataki to be cooked a little more, as it was too raw for me, and the waitress didn't bother asking me how I would like it done. She grabbed my plate with a blank face and when she brought it back, it tasted exactly the same. One of the items we ordered never showed up, but it was still listed on our check. All of these lapses would have been more tolerable if the service had been friendly/attentive, and/or if the food had been so fantastic that everything else could be forgiven. But it wasn't. With the new club \"Origins\" next door, this restaurant will likely remain busy on weekends. If they seriously improve the service, this place has a lot of potential. I hope the owner and manager will read this and hire people who understand what good service entails.", 
    "review_date": "2014-09-01"
  }, 
  "B2-CCOGktqx1N7AGs17PnQ": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Michael K.", 
    "review_text": "Long story short: Came here for a nice dinner on NYE and the experience felt sub-par at best...  Ordered the following:   Tako Wasabi - Pretty good. No complaints and was a good appetizer.   Kabocha Croquette - Another good one. Seems like this is the specialty of the restaurant and I enjoyed this one. Basically a fried pumpkin croquette with a soft boiled egg inside.   Seafood Nagasaki Ramen - It seems that the EC here is Korean and some influences show here. This noodle dish is closer to a non-spicy \"champoong\" than a Japanese ramen. Although tasty, I would have ordered something else if I knew this.  Other dishes I tried were Hamachi Carpaccio (three slices of hamachi with some mint olive oil and asparagus), Beef Tataki (didn't seem like the quality of beef was there. Wasn't sure what cut they used but it wasn't as good), Sake Onigiri (really dry and the flavor wasn't there), and perhaps a few others I don't remember.  The restaurant itself is somewhat trendy and nice. The chairs were just wood seats... I wish they were put some nice cushioning there as you notice it more as the nice goes on.   It was a small restaurant and there seemed to be about 3 servers at the time... Although the servers were very nice helpful, they were scarce and hard to get a hold of. Prices were standard but I'd prefer Tanto's or Dan's in the south bay. I guess I just expected more from a 4 star restaurant in sf.", 
    "review_date": "2015-01-04"
  }, 
  "Ep51E0FyVhDO8eyZ85_4xA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Angela T.", 
    "review_text": "Price:  A little on the pricier side, but reasonable if you consider part of the pay goes towards presentation and quality.  Food recs:  Cha Soba (cold green tea noodles in a savory iced broth),   Service:  The kitchen forgot one of our appetizers.  Only received it about 30 minutes after we finished all our other appetizers and entrees and reminded the wait staff about it.  Overall:  Very unique Japanese/Korean fusion dishes.  I would come back to try some of the other dishes.  You would not find the majority of this menu in any other restaurant.  However, some of the dishes still tasted pretty average, which is why this place gets 4 instead of 5 stars.", 
    "review_date": "2014-06-08"
  }, 
  "Le0X2J9KENoGiw9sTOsHrg": {
    "user_rating": 5.0, 
    "user_location": "Danville, CA", 
    "user_name": "HJ K.", 
    "review_text": "How lovely!! Like the interior, lovely presentation! pleasant atmosphere with all nice staffs there.   Will come back again!!", 
    "review_date": "2014-05-03"
  }, 
  "IlnyM_kfFD2zLNmnSmNT9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lulu X.", 
    "review_text": "I love izakaya style food and i want to say the dishes are all well prepared with high quality ingredients, compare to other Japanese tapas restaurants, this is at a higher price range. We made a reservation for party of 13, and were offered two tatami rooms. The bigger room fits 8-10 ppl and the smaller one can sit 6. They opened the room divider so we can still talk and pass beer around. There is a minimum charge for the small tatami room for $200 with 3 hours use of space and the larger room minimum charge is $280. Very easy to make the minimum charge since the portion is small, we made 2 orders for each dishes and ordered about 26 dishes, plus 2 pitch of beer and 2 glasses of sake, the bill came out to be around $530. Our waitress is super sweet, she gave us suggestions of wut to get and also suggest wut not to order. some highlights:  Uni Onsen Tamago: soft boiled egg with uni (interesting taste) Kabocha croquette: biled egg inside of a pumpkin puff ( must order, soooo good!) Hamachi carpaccio Sashimi special: very fresh Okonomiyaki: japanese style pancake (delicious!) Tako Yaki All the rolls are good, my favor: Volcano - depp fried shrimp with tuna Kalbi Tempura: short rib with sesame ponzu  Dessert: green tea cheesecake with lavender ice cream (Ummm, heaven...)  Tempura green tea ice cream =)))", 
    "review_date": "2014-02-16"
  }, 
  "gTDp5QNtHKeAE5LcCs2zFg": {
    "user_rating": 4.0, 
    "user_location": "Outer Richmond, San Francisco, CA", 
    "user_name": "Izaak W.", 
    "review_text": "Kou has there ambience and presentation down. The dengaku miso eggplant dish is perfection. Their sashimi is mouth watering and the cuts they serve are shear beauty.  Very snappy service and generally you can find parking. pricing is a bit steep but if your looking for a treat for a date or a friend this is it.", 
    "review_date": "2014-09-23"
  }, 
  "yhExkeiKiON1kwcv7XSciQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Sasha Z.", 
    "review_text": "Pretty good! Small portions though. I had fried tofu, book choi, and a side of rice, and my sister had California rolls. The tofu was delicious; soft, in wonderful sweet tangy tempura sauce, wrapped in a crunchy mint leaf and topped with fresh ginger! Only problem : all I got was THREE of these babies, and they were 7$. The bok choi was delicious, crunchy juicy, garlicky... Great (5$). And I put my tempura sauce on my rice which was a good decision.   For dessert we had tempura battered green tea ice cream, it was AMaZeBALLs. But again small, and 6$ :/ for one scoop! :/   Oh well. Overall a good dining experience, and if I was wealthy I probably would've enjoyed it a little more. But everything was pretty, the plating was nice, the ambience of the restaurant was nice, nice nice.   And the service was A+, they were a bit busy but the waiter and waitress were very attentive to all their customers, and our water was always filled, and our plates very quickly cleared.", 
    "review_date": "2014-04-11"
  }, 
  "kug4uKJJ0tUBAe-E4SlrPg": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Andy W.", 
    "review_text": "Accidentally found this place while walking around in Japantown. trying to find a decent sushi place. this one is absolutely amazing!!  The fish Don is a must try and also the tempura ice cream.   The sashimi is very fresh and a good collection so sake", 
    "review_date": "2014-07-21"
  }, 
  "_N8uvmbF6A8nltSeIQeHoQ": {
    "user_rating": 5.0, 
    "user_location": "Morgan Hill, CA", 
    "user_name": "Cyndi L.", 
    "review_text": "I went here during a very busy dinner hour. The place was packed and this delayed the service quite a bit; however, the waiter showed absolutely NO sign of stress and kept smiling and gave us sincere apologies for the delay. It was obvious how popular the restaurant was and the staff was working so hard. When we did get our food, it was so fresh, full of flavor, and definitely an extremely pleasurable experience.  The decor is natural, clean, and very hip. There are regular table and chairs and there are private eating areas where the seating is more traditional tatami style that can accommodate larger parties.   I will definitely be back!", 
    "review_date": "2014-12-15"
  }, 
  "qiHItri5qNyG7Zz1ycEQpw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dia Z.", 
    "review_text": "Such a unique Japanese place. Everything from the classic sushi rolls to the interesting twists were delicious, fresh, and intersting. Their spicy tuna roll melted in my mouth, while their caterpillar roll was vibrant and flavorful. I liked how comforting the pumpkin and egg croquette was, but it was a little too close to a scotch egg and the texture was a bit strange (maybe with the proportions of pumpkin to egg). It wasn't enough to deter me from coming back, mostly because the tempura short ribs were lovely, and I could have ordered the pan fried pork potstickers 3 times over. Nice place!", 
    "review_date": "2014-10-12"
  }, 
  "kUsgpVZPCeq7laaK9cg_Iw": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Eugene S.", 
    "review_text": "Great decor, but the foood... Tastes very Korean and really not as good as I hoped. Gave it a chance but really the ramen, pork belly and Kalbi tempura were all cheap imitations of Korean food at a \"Izakaya\". Decoration 5 stars, service decent, but food... Sadly lacking with large price tags.", 
    "review_date": "2014-08-19"
  }, 
  "BzLUyHSJrl-lUVWw9rqlvQ": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "George F.", 
    "review_text": "2.5 stars rounded up to 3 stars.  Last night we headed for a late night Izakaya dinner in the City. We got there at 9:45 pm no reservations only two other couples waiting in front of us. The host was super nice and the 15 minute wait was just enough time to peruse the menu. The interior decor is very interesting, modern industrial meets old Asian wood. The location is terrific right on the corner of Geary and Fillmore. The parking gods saved me a parking spot on the street a block away.   Our table came up and we sat down. Our waitress was excellent and attentive. We had plenty of time to make our menu decisions. The first three items we wanted were not available because they ran out of Uni. The waitress offered to substitute ikura salmon roe in the tofu temptation in stead of Uni. Hummmmm..... If several menu items are dependent on Uni as a ingredient and run out then on a Friday night at 9:45 pm  and you are open till midnight \"The Kitchen Screwed Up!\" The restaurant is within yelling distance of the Japan Town Center. I am sure that with all the Japanese Markets and other Japanese establishments within a couple of thousand feet than at 5 pm before they opened last night some one would have procured some more Uni. No excuse for running out half way through your dinner service.   Advise get hooked up with a Uni distributor like Maru Hide out of Gardena, CA and get enough for your dinner service.   The menu printed \"no substitutions\" then why are you substituting menu ingredients?  Since having Yelp and bookmarking certain restaurants I have kept the underwhelming meals because of the food to a minimum.   The Kuruma Ebi Zuke $12 was raw shrimp marinated in some sort of terriyaki mirin with some chili powder sprinkled on it. The shrimp was dark brown and limp it tasted as bad as it was visually unappealing. Terrible!  Hotate Gratin (3) $9 was less then a mouth full for the whole plate.  Asari Sakamushi $10 clam and sake soup came out luke warm.  The three items that were good were The frosty cold Kirin draft beer, the Buta Toto, and the Sea Bass Sashimi.  The front of the house has its act together, the back of the house ( kitchen) is a mess.   Overall underwhelming !!!", 
    "review_date": "2014-10-18"
  }, 
  "Vquexp-WD-k5mxPZmS2IzA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dahlia S.", 
    "review_text": "Should not have bothered with making a res prior to arrival. Not knowing the restaurant we hoped by reserving that we'd have a decent place to sit. Quite the contrary. They put us in the worst possible location where we saw the back side of the kitchen and prep area (ie. trash cans, ,etc.) Once we saw how bad the seats were, we asked if we could sit in any of the open tables (there were tons!!) that were better situated for 4 but we were told we've have to spend over $200. We'd actually have been inclined to doing this but what a rude way to introduce 4 new potential guests? We sat in the horrible location while other tables all remained empty. In the end we did rack up a bill of over $200 but it was the principal of the matter. We will certainly NEVER return to this restaurant and would recommend you pick other sushi places that are simply better. The only good thing about the bad seats and not-so-great sushi was the beautiful presentation of less-than-ideal-quality food.", 
    "review_date": "2014-07-31"
  }, 
  "d3uP9ZeJRGROx9ZaHjPxrQ": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Roland W.", 
    "review_text": "Went here on opening day and I give it 5 stars. The staff was friendly and the interior decor is very classy yet modern. Having been to Japan, they did a good job making it an authentic izakaya. The sashimis were fresh. The ramen was perfect with great tasting broth. The yakitori was perfectly grilled. All perfect. Highly recommended for a date or a relaxing place for a group of friends or a family outing. 5 stars for sure. A must visit.", 
    "review_date": "2013-09-18"
  }, 
  "67CMefWLwKcz3FHPR6PIaQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Alex T.", 
    "review_text": "Loved this place! Not really your traditional japanese restaurant so I wouldn't come here if that's what you are expecting.  It's very modern and the vibe is hoighty toighty but it was forgivable because of the great quality and innovative dishes. I had THE best croquette of my life here. It was a pumpkin croquette with a hard boiled egg in the middle and it was pretty great. The portions are pretty small but share it like tapas with a few people and it's perfect. You'll find the food is much better quality here than the Japanese restaurants in the shopping center.", 
    "review_date": "2014-05-25"
  }, 
  "7SHLvPjQ-D1vIcYO2pLU5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K L.", 
    "review_text": "I had seen this change from Nan and had been meaning to try it out.  Stopped in on a Tuesday night for a few bites.  I was quite surprised with the upgraded interior and how busy it was for a Tuesday night.  The staff was very helpful with suggestions of what to order.  Food was served timely and everything we had was tasty.  My top picks are: uni onsen tamago, nagasaki ramen and the miso cod.  I'll be back.", 
    "review_date": "2014-01-09"
  }, 
  "IYgcJx84hR3cAX2tllXJcA": {
    "user_rating": 5.0, 
    "user_location": "Kansas City, MO", 
    "user_name": "Melissa P.", 
    "review_text": "YUM YUM!!  Our first night in San Fran for the first time we got a late start on dinner. Walking to Fillmore street where we heard all the restaurants were we started to notice most places closed early. We walked by this one and checked the hours. Good to go. When we walked in they said they were open until 11 but this kitchen was closing in 15 mins (this was almost 10) and asked us to order quickly. We said no problem but when we sat down we were in trouble. We didn't know what a lot on the menu was. The waitress said it wasn't typical Japanese. No Fried rice bowls, no teriyaki anything, no vodka. We asked for suggestions and I picked a sushi roll I was familiar with. Being a little scared we were pleasantly surprised!  Best sushi, Yakitori  and strangely best steamed white rice we had both ever had! I had the volcano roll.  SO GOOD! The yakitori was chicken and pork. Probably some of the best tasting meat. Perfectly charred on the outside and flavorful! I wish we had something comparable back home!", 
    "review_date": "2014-07-18"
  }, 
  "LRbdiwCLK2QSClaxC6aKfA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dan h.", 
    "review_text": "my new favorite izakaya place in the city. Fusion izakaya at it's best. Excellent quality, super-fresh, and creative presentation. The 5 stars are for the food and the ambiance.", 
    "review_date": "2013-09-28"
  }, 
  "-89IDABrt2vnhvoCiUlVCw": {
    "user_rating": 5.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "T M.", 
    "review_text": "They have their full menu!!  Hawaiian poke salad was on our list again, as well as their ebi avo. The poke salad was SO spicy... it was probably the spiciest thing I have ever eaten, but it was absolutely delicious. Also got a CA roll, because you can't beat real crav. We got the croquette this time (regular, not the kabocha) and oh my! My taste buds were in absolute heaven! We also got the momo skewer, which was delicious.   They also have a happy hour menu from 5-7, so we took advantage of their sake special (buy one bottle, get a 2nd for $1) and it was a steal. Luckily, we live upstairs... otherwise the walk home would have been a complete mess.  I already want to go back. I really enjoyed the introduction on the first page of their menu, it gives you some insight on Chef Nick and explains how he became the master chef he is today. **swoon**  The only thing they are missing is chawanmushi. If that was added to the menu, my heart would melt.", 
    "review_date": "2013-11-23"
  }, 
  "gwIqbXEXijQNgdESVc07hg": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Elvis A.", 
    "review_text": "With the Izakayas being a rage North of the 49th Parallel it was only a matter of time before the trend caught on here in the Bay area. This is no shortage of decent Japanese food in the bay but I kind of like the Izakaya take on food here.  We booked ahead as this place does get busy.  Decent selection of beer here as well as a good Sake list.  The setup is nice though doesn't have the hustle and bustle of the other Izakayas I have experienced.  Here is what we ordered Tako Wasabi: Good as ever though its not served with Nori here (A quick chat with the server changed that and we got our nori)  Kobocha: Just right fried perfectly without being greasy. Momo: Devoid of taste. I think I will need to try another Yakitori item to hold the verdict on their Yakitori as this was a miss. Gindara: Decent as ever. Nice sweet finish and grilling was done right. Takoyaki: I am a fan of this dish. This was OK as I have had much better versions. Ebi Roll: OK nothing special. I would say 3.5 stars as we got try a good variety of food and left fulfilled.", 
    "review_date": "2014-11-08"
  }, 
  "n5kvsYIIPUVrARu0pkaazQ": {
    "user_rating": 5.0, 
    "user_location": "Henderson, NV", 
    "user_name": "Sam M.", 
    "review_text": "I was tired, hungry and in a new city firs the first time. I needed a taste of home (Ichiza in Las Vegas is my go-to Izakaya) so Yelp led me to this restaurant.  Oh, it was like coming home- Gyu Tataki, Gyoza, and Edamame (YumYum). I tried something new as well, the Uni Onsen Tamago, which I really liked! Awesome place, Highly recommended!", 
    "review_date": "2014-02-23"
  }, 
  "iBNTPj_nGnZLVpeAzcy0lg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kolja S.", 
    "review_text": "Just opened 6 months ago: One of the best restaurant experiences so far in San Francisco! All of their tapas are just amazing! Can highly recommend it! The best: it's not hyped yet and you can just walk in without a long line!", 
    "review_date": "2014-03-26"
  }, 
  "k9P0_aZbgIrXJXSqU17mIA": {
    "user_rating": 5.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Sunshine Z.", 
    "review_text": "This place is very spacious for being a sushi restaurant so close to Japantown. I love the music and the ambiance! Perfect setting to just relax and enjoy good food. The service is outstanding -- we were seated right away and the food was served to our table in a fashionable and reasonable manner. I will be coming back :) The Frisco roll is delicious!!!", 
    "review_date": "2014-04-26"
  }, 
  "xko8mG7yORt6CvSiE5tHVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mi m.", 
    "review_text": "The food was delicious!  The bok choy was amazing,  flavorful and perfectly cooked. We really enjoyed the  tako yaki,  the hotate yaki ,  ika yaki and the pork belly. The only dish that was not well executed was the hamachi kama.  It was overcooked and dry.  Down one star because of the service.  The staff seems  nice,  but is not well trained.  They are not attentive and they  hang around the kitchen chatting rather that attending to service.  We will definitely be back.", 
    "review_date": "2014-07-19"
  }, 
  "MwIXDt9mhdnz5-ZpzRA1Eg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy K.", 
    "review_text": "This is bad. It's a waste of a great location.   We went there on a Thursday evening with open table reservation at 7pm. The decor was nice, not over fancy, but comfortable and modern. We ordered a few things to start. They were really not impressive.   What did we get? - Tofu temptation: not impressive, but overall pretty decent. They ran out of uni, so replaced it with ikura (fish roe). I felt that the tofu taste was overpowering the seafood. The sauce was ok. This is the better dish that we tasted.  - Kabocha croquette: This looked very interesting, and tasted interesting. It's basically a croquette with an egg inside. It's creative, unfortunately, the flavor of the egg and the croquette don't really go together. - Hamachi Carpaccio(??? I actually don't remember which this was): very bad. Huge piece of fish, but no flavor. On the bottom was whole green onions, blanched. It was very strange. Sauce was strange too.  - Wakame salad: Exactly the same kind that you can find at Costco. I was expecting the branch looking seaweed!  After this first round, we decided there's no need to have a second round. We ended up going to a ramen place for the rest of our dinner. I will not be back again. I don't understand why they have a 4-star on Yelp!!!!", 
    "review_date": "2014-10-25"
  }, 
  "pI15RINDqpXIk5492xx7PA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel R.", 
    "review_text": "Perhaps my friend and I are not suited for Izakaya joints....I thought it was just ok. If you are a fan of Izakaya, please go and sample to make an educated decision.  Definitely a nice space aesthetically, a lot of beautiful furnishings makes this feel like a good place to visit on a night out.  What we got: 1. Edamame - standard and tasty 2. Kyokoku Mori (deep fried asparagus tuna roll with garlic chips on top w/ponzu sauce and spicy sauce) - a NO GO **important to understand this is not a tempura roll, the asparagus and tuna had no battering components, it also didn't actually seem deep fried in general. I would have skipped this. 3. Sashimi - I really enjoyed my salmon sashimi, my friend seemed only partially happy with her yellowtail and monkfish 4. Spicy Tuna Roll tuna and cucumber - not worth ordering 5. Agedashi Tofu - very good! 6. Tsukemono (pickled selection of 4 veggies) - so so, nothing to get excited about", 
    "review_date": "2013-10-29"
  }, 
  "LI8xbnt7wIM0FY5oij-UCg": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Chris S.", 
    "review_text": "They have really good listing of sake and wine. Foods were awesome and the service was excellent. I really liked the little rooms that they have.", 
    "review_date": "2013-11-05"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "I remember years ago, there used to be a Korean joint here that was a total disappointment.  Not only because the food wasn't that good, but because with their location, they could have been a nice addition to Fillmore.  Just like what Izakaya Kou is now!  After recently reading Cherylynn N.'s review and seeing her photos, I suggested to my friend coming here for dinner.  The vibe and décor of the restaurant were terrific (warm, wood centric feel plus rooms for tatami-style dining), but it was the extensive menu that really caught my eye.  Just so many tantalizing things to get!  -- SASHIMI SALAD - Assorted Sashimi and Seasonal Vegetables with Ponzu...$13 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#H0E0zALpcLxkdoo0hgUQhA\">yelp.com/biz_photos/izak…</a>) The salad was fine, but this dish was more about the sashimi for me.  I liked how they gave us a decent amount, but I wish they hadn't cubed the pieces so small.  The taste and freshness seemed okay, but it was hard to say for sure.  -- UNI ONSEN TAMAGO - Soft Boiled Egg with Uni in KOU Sauce...$8 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#-nTxXAQRVnpNwCkeng0mUQ\">yelp.com/biz_photos/izak…</a>) I might have missed this one had I not been looking for it after reading Cherylynn N.'s review.  The \"KOU Sauce\" was essentially just ponzu, but it went well with the runny yolk and the briny uni flavor.  Big fan of this one, though it's not for everyone.  -- BACON ENOKI - Enoki Mushrooms Wrapped with Bacon...$5 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#1C-w9xvus09ef6h8xRKyKg\">yelp.com/biz_photos/izak…</a>) I couldn't not try one of my favorite skewers!  Each piece was evenly cooked and the bacon they used had some quality to it (read: not super fatty nor skimpy in size).  Not a spectacular dish, but solid.  -- BUTA TORO - Pork Belly Garnished with Scallions Drizzled With Miso Sauce...$7 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#5c-EORgte9EllGkGsbqeGg\">yelp.com/biz_photos/izak…</a>) Aside from the slightly excessive amount of scallions/green onions, I thought it was great.  The pork wasn't too fatty and there was a ton of savory flavors to it.  -- SABA TATAKI - Lightly Seared Mackarel Slices with Daikon and Ponzu...$11 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#ltQAZr34I-1a2yoUePjLtg\">yelp.com/biz_photos/izak…</a>) Unlike with the pork belly, the scallions were great here - a fresh element to cut through the fishiness of the mackarel.  As much as I liked that tart, \"seafoody\" flavor though, I definitely wouldn't recommend ordering this on a hot date...  -- TAKOYAKI - Fried Octopus Balls, Scallions, and Bonito Flakes...$7 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#CeCxizto-Ks8uGqr366ufg\">yelp.com/biz_photos/izak…</a>) Not as good as the ones I had in Japan, but one of the better ones I've had here.  Each piece had a good amount of octopus and it wasn't over dressed/soggy.  -- SPICY TUNA ROLL - Tuna and Cucumber in Special Spicy Sauce...$6 (<a href=\"http://www.yelp.com/biz_photos/izakaya-kou-san-francisco?select=lAxWxr3uYtN7vNrf4xXXrw#qLPAHUKu34uu6P_Zca8sZA\">yelp.com/biz_photos/izak…</a>) I'm rather indifferent to Spicy Tuna Rolls, but my friend loves it and threw in an order.  The spciness wasn't as harsh as others I've had (which is good), but I thought the tuna could have been a little more flavorful (not so good).  Much like the food, I thought the service was solid - our server was helpful with his suggestions and refilled our cups often.  However, I do have a knock with the restaurant's awkward layout.  To get to and from our table (right wall, by the front windows), we had to weave our way through the room with the semi-communial tables.  Not an issue when those seats were empty, another story when they're not.  Still, despite that flaw with their set-up (it's not exactly a fatal flaw), nothing about our experience would discourage me from coming back.  And even though prices are a shade high, the taste is there.  Between the dishes I'd want again and the things I still want to try (particularly their ramen), I have plenty of reasons to come back!", 
    "review_date": "2013-10-31"
  }, 
  "N6q8UiEde4e322cBHCxWQw": {
    "user_rating": 3.0, 
    "user_location": "Sonoma County, CA", 
    "user_name": "Flora T.", 
    "review_text": "This is a tough one - a new place with huge potential, which I hope the owners will manage to live up to. The beautiful interior - little nukes, wooden slide doors, chandeliers, make for a great dinner destination. I was in a couple, but if I'd go again with a group - I'd go for the take-your-shoes-off-sit-on-pillows nuke for sure.  And this is the confusing part - in such festive, creative atmosphere (and the service was really attentive, unlike other reviews claimed) - I'd like the food to be a little more inventive. It was OK, possibly even good, but two weeks after I've been there I can't quite remember what we had. The man mentioned, however, that's it's a lot of sushi for the price of a roll. Hopefully soon it will be MEMORABLE sushi!", 
    "review_date": "2013-10-27"
  }, 
  "pHUAZ53qwA_ka07s77Q0Rg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mike P.", 
    "review_text": "Met up with an old friend to celebrate being adults with paychecks and decided to start our night here.  We were looking for some place casual, hip, and because I searched for \"okonomiyaki\" and this place was the first one to come up.    You should note, however, that that they won't have okonomiyaki until February.  Um... :\\.  Stuff happens, I guess.  Their sake collection is quite wide, with 3-5 brands for each type of Sake - nigori, junmai, ginjo, honjozo, and even shochu, which I thought was pretty neat.   We got the Sayuri ($11), which was very sweet, refreshing, and made the couple next to us think that we were gay because it's bright pink.  Later on, we got the Tozai Typhoon ($9), which was a soft, dry sake, but my palate was not trained enough to say much more.  I didn't like it as much.    As for food, it's an izakaya, which is kind of the japanese equivalent of a tapas place, so we ordered lots of small dishes to share.  We got:  Tori Karaage (fried chicken): well seasoned, but the fry coating was less textured than one usually expects.  Still delivered hot and tasty though, so no complaints. 4/5. Kabocha Croquette: BIG fried pumpkin puff with an egg inside.  Nice presentation, but overall a somewhat boring dish where neither the pumpkin nor egg flavors could come through, even eaten without sauce.  3/5. Buta Kakuni (braised pork belly): generously portioned, melt-in,your mouth pork belly.  Really tasty (if you're cool with pork belly, anyway).  5/5. 'Frisco Roll: Spicy tuna topped with salmon, avo, and una sauce.  Above average roll that wasn't overpowered by the sauce; salmon/avo topping was well prepped and shined, enhancing the dish.  Tasty.  4.5/5. Enoki mushrooms: wrapped in bacon, seasoned and charred, and finally served on skewers, this was definitely the strangest dish of the night.  While the char was appreciated, the enoki mushrooms were still a little too hard to chew through, especially when bundled together.  Not what I was expecting, but still pretty good.  3/5.    We also ordered Ikura, Saba, and Uni nigiri, which were of surprisingly good quality for the price ($5-$8 for two).  Ikura was full and juicy, the saba was chewy and fresh, and even though I've never had uni before, Kou's was very milky and delicately briny, so I'm pretty sure my friend just ruined the uni experience at at lesser sushi places.  Loved every bite.  Charge came out to around $100 including tip, which was not bad considering the city, for the ambiance, the quality, and the amount of food we ate.  I do wish that their non-booth eating area was larger so that they could seat us faster, and I also wish they had okonomiyaki, which is what I craved all along :(.  Still, I had a good time.  Definitely recommend for a business casual meeting or a date.  ps they take reservations, which I would recommend.  ---  sweet: delicious, not overpowered-by-sauce sushi.  pork belly was fantastic. bitter: definitely some \"miss\" dishes comparatively, wait can be long.", 
    "review_date": "2014-12-14"
  }, 
  "37scjKqPIj2o_4FFQlYCLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie L.", 
    "review_text": "One of my favorite Japanese restaurants in Japan town. Everything we ordered was satisfying. Sorry that we don't remember the funny Japanese names. We followed the highlights on yelp.  Make sure to make a reservation ahead, even you called in the afternoon for a reservation in the night will be better than wait.  For this restaurant, I prefer the dishes than the sushi.", 
    "review_date": "2014-12-31"
  }, 
  "l7m0oJpWaHaHmHXMaKWcVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jared S.", 
    "review_text": "Delicious Salmon sashimi. Good happy hour.", 
    "review_date": "2014-09-09"
  }, 
  "__LzNQn6eLRaILX7SMASQQ": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Joanie C.", 
    "review_text": "When I first stepped in, cute interior design, worth a try. The food is just alright... Galbi tempura is one of chef recommendation. It's a waste of that piece of Galbi... The fish is good but I can definitely get same quality of food for much cheaper. Upset that a Japanese restaurant charges me for hot tea.", 
    "review_date": "2014-08-19"
  }, 
  "5znQa1L-ghcX4EYQ7gtiFg": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "T L.", 
    "review_text": "tasty. nice ambience.", 
    "review_date": "2015-01-22"
  }, 
  "0niNpv8X_2I7wIWVWl3ZyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison E.", 
    "review_text": "If I had to marry one food, it would be the noodle.  And that was before I had tried the soba variety at Izakaya Kou.  The noodle, with all its amazing varieties, combinations, sauces, broths, textures, accoutrements, is by far the greatest invention ever.  My recent obsession with Japanese noodles made my choice particularly easy.  Per the chef's recommendation, I tried the cha soba (green tea buckwheat noodle).  It was served in an icy cold, savory broth and topped with shredded onion, radish, panko (?) and nori.  Cold noodles?!  Yes, cold noodles!!  This chilly soup may not have been the obvious choice on one of the rainiest days of 2014, but it might have been the tastiest!  The noodles themselves were perfectly shaped,cut, and cooked.  Judging by the slurp-splatter left on my shirt, the walls, my chin, and my dining companions, the noodles were inhaled at record speeds, even for me!  The food here is meant to accompany your drinks, and not the other way around.   Brilliant!  Happy hour lasts until 7, during which time you can get 2 for 1 sake and really decently priced small plates.  We nibbled on pickled vegetables, octopus balls (No, not like balls balls, you nasty twin!), a tasty long roll (I forget exactly what it was now) topped with fresh salmon and tuna, before each dipping into our noodle dishes.  It was a perfect light meal for three, costing around $65 including tax and tip!  Can't beat that!  My love affair with noodles continues...", 
    "review_date": "2015-01-03"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Happy Hours for the win here!  You must get their sake during happy hour, which is buy one get one for an additional dollar!  It's more fun when there is sake involved!  Do order up their Trio of Salad!  I like their Tako Wasabi as one of their salads - it is great as an opening appetizer to enlighten the palate.  Another dish that is made quite well here and is a looker on the eye, is their Kabocha Croquette!  It is drizzled with saucy decor and is a deep fried pumpkin wrapped around a runny cooked egg.  Their Pork Belly Yakitori was mediocre - not much of a spazz to it.  They have sashimi and ramen to try out!    The decor is so woody and spacious here! Service was aye okay!  A nice Izakaya place if you are looking for a trendy Japanese spot and a sufficient restaurant for a good occasion!", 
    "review_date": "2014-08-14"
  }, 
  "ORYu-cLe0SxineXThaNuYA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristen C.", 
    "review_text": "Izakaya Kou definitely has a lot of kinks to work out.  When we first arrived, the host took a few minutes before he even looked up at us because he was concentrating so hard on something he was working on at the cash register. We get seated and the setting is just so awkward to me as we have to walk through the kitchen to get to the area behind the private tables. The menu prices weren't terrible, but the items that came out were not as substantial as the pictures my friend posted from what I believe was their soft opening. Sadly the portions to our sashimi salad were a lot smaller and the beef tataki wasn't even rare. We ended our meal after choosing our 3rd item which was the chicken meatball skewers. I think that was our favorite item out of the three!   But what makes me go back to my first comment is what i saw overall. The couple next to us were very unhappy since the wife's food came out and she was done w/ her meal before the husband even got any of his food. While they were quite loud about the situation, it just goes to show that they need to step their game up a bit.  With so many other places around, I'm not sure if i'll be back yet. I even stayed away when they did a Yelp Event. Me turning down free food...that was a first!", 
    "review_date": "2014-01-06"
  }, 
  "gkjkDvLv4fsMP8b6-Z1d1g": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Shireen J.", 
    "review_text": "Although this place isn't on the best street corner, it is some of the best sushi I have had. We walk in with a group of 6 on a Thursday at about 8pm. Seated immediately.  I order almost every nigiri and everything is fresh and delicious. My favorite was the unagi of course. The volcano roll is amazing. My friend ordered the chicken kagari and it tasted so good! Not oily and perfectly seasoned.  The bacon wrapped artichoke was too oily for my taste so not a fan.  Ended with delicious green tea tempura. Two thumbs up, will come again.", 
    "review_date": "2014-07-22"
  }, 
  "hYeZ8eAIWV2DluhxYaIUuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna H.", 
    "review_text": "I love izakayas but they're so expensive in SF! Here's what you can expect for $90:  Hamachi carpaccio- 3 slices of hamachi  Yamakake- portion expectation? It comes in a martini glass  Pork shoulder and chicken thigh skewers- 2 per order  Cha soba- about 4 mouthfuls Okonomiyaki- about one inch thick Hawaiian Poke- SUPER SPICY. Huge portions  Overall, everything was delicious and the servers were super attentive. But definitely not a place for the voracious appetite unless you're ready to thrown down some money. Be sure to get the okonomiyaki, it's necessary if you want to feel semi full after this meal.", 
    "review_date": "2014-11-20"
  }, 
  "uERX6G3qNCmTKKd-SzFzGA": {
    "user_rating": 5.0, 
    "user_location": "MERION STA, PA", 
    "user_name": "Ben S.", 
    "review_text": "Across Geary from Japantown proper, this restaurant has a lovely interior and even better food. Especially loved the raw octopus salad (from the happy hour menu) and the egg and pumpkin croquette. Service was terrific. All around a fun satisfying dinner out.", 
    "review_date": "2014-08-16"
  }, 
  "VFxrLIlgApHIdOCrkAYIGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tatyana K.", 
    "review_text": "I ate here for my early birthday after hitting the spa across the street. We got one of everything on the menu and everything was delicious!", 
    "review_date": "2013-12-18"
  }, 
  "PvBmRN4suldo06Kcz2-vcw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin L.", 
    "review_text": "Nothing really stood out.  Sashimi was probably the best but no cooking was involved right, just sourced from the right places.  Kushiyaki was missing some aspect of Japanese flavor, like the \"binchoo\" or just having some salt or using tare.  None of these elements came from the yakitori.  Basically skewers were just grilled on a regular grill.  Ordered all the kurabuto/kakuni dishes.  The kakuni dish was the same as the sliced kurabuto kushiyaki without the stick, sad.  Ordered 15 plus dishes, nothing was amazing, everything was good.  Uni with onsen egg could of had more uni of course.  Asahi draft was delicious.  Oh worst was the Kou Ramen, worst ramen I've had in a long time.  Broth had absolutely no flavor, cha siu not memorable and noodles way soft.  Great service though and good prices.", 
    "review_date": "2014-02-10"
  }, 
  "SgTTg4emX7N6gCsHb5nJKQ": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Natasha M.", 
    "review_text": "We had a three hour dinner here!  Really nice place and we had a private tatami room.  I didn't know what to order so I asked the waitress to decide for us.  Really great recommendations and everything was delicious!   Great to be near Kabuki Theatre too...we saw a movie right after.", 
    "review_date": "2014-05-18"
  }, 
  "ZLaCY8Hm-mzv9ZiuO5a3SQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Troy B.", 
    "review_text": "One star for truly awful service.  We've been here twice and both times despite making a reservation were initially only offered a seat at the bar.  We had to insist that having a reservation meant getting a table, not settling for seats at the bar. TWICE.  Both times we went.  The last visit was made worse by the attitude of the hostess, very slow service (no food on the table until 40 minutes in, no water until it had been requested THREE times).  The food is fine, but there are plenty of equally good options in the city with good or great service. Today, despite our dispute with the hostess that a reservation does NOT mean a seat at the bar--- I got an email from Open Table that we were never registered by the hostess as having kept our resy. Glad there are other great izakayas that want our business in town.", 
    "review_date": "2014-04-14"
  }, 
  "4Sixn13l0Ooa7mF_kfR3ag": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marin P.", 
    "review_text": "The second star is only for opening jitters, this was not good.   We had some yaki udon, pumpkin gratin, fish roll, daikon salad and a bottle of sake. The sake was the best thing. Each had some nice presentation but the flavor in all of them just seemed a bit off. And by a \"bit off,\" I mean \"not tasting good.\"   The staff seemed new and are still learning the ropes and that's fine because it's a new joint. That sort of stuff can and should be worked out.   The decor is interesting. It's nice but I feel like it's a bit much - like they're trying too hard to be this super upscale joint when the food and service doesn't match that. Of course, if this had the type of food you find at Izakaya Sozai, I'm sure I would have thought the ambiance really worked well with the food.   A positive is that the food is priced appropriately and serving sizes are relatively large.  TL;DR: I didn't like the food but there's a small chance it could get better as they work out the kinks.", 
    "review_date": "2013-10-13"
  }, 
  "ZOG5_cnLlm_PbWqNfmsLJw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie W.", 
    "review_text": "This is a nice and upscale Japanese place. The service was good but the food is just decent. We ordered the udon,agedashi tofu, pork belly, spicy tuna roll, chicken karrage, croquette, takoyaki and a few others. The sake was good according to my friends. They also only have a booster seat for my son but we didn't use it because it did not have a belt attachment. We paid $40 per person at the end of it all. There wasn't an abundance of food for that price so I would much rather go to a steakhouse or shabu place for that price.", 
    "review_date": "2014-08-14"
  }, 
  "kAyInqcd9y4TXV-5JFm47w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie H.", 
    "review_text": "What a great find - well deserved five stars. Located  right next door to Social Study bar and one block away from Sundance Kabuki, this place makes for a perfect dinner spot for a date or night out with friends.  - Table was ready 10 minutes before our reservation  - Dishes we served promptly (and the volcano roll was amazing)  - The atmosphere was perfect. Causal and sophisticated at the same time, music wasn't too loud and everyone was spaced out enough so you didn't have to hear everyone else's conversation. - Insanely affordable. Just goes to show you don't have to spend an arm and a leg to have a great dinner in SF, and I will definitely be coming back.", 
    "review_date": "2014-11-18"
  }, 
  "Se6zhaEHn0lPSHgQ6q7elg": {
    "user_rating": 4.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Dot C.", 
    "review_text": "My only complaint is the portions are small but everything is so good! Sashimi was delicious!!!", 
    "review_date": "2014-05-08"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Guilt by association.   Admittedly, I was very skeptical about going to Izakaya Hashibiro Kou because I read that their sister restaurant was nearby YakiniQ, an \"AYCE\" Korean bbq joint that limits you to one kalbi order per a person and charges you for lettuce. WTF. Anyways, not going to even get into that. I'll just leave it at that I'm not a fan of that place so I expected the worst with this new izakaya joint. Like when Cocobang decided to open Izakaya Ninja which was an utter fail. I digress.  We initially had dinner reservations at St. Vincent in the Mission which Michael Bauer had revisited and was keen on. Well, I trust Bauer as much as I trust my uncle Charlie at a seedy strip club with butt floss twerking in his face so when I heard about this new opening, I cancelled our reservations and took a leap of faith with Izakaya Kou. Pleasantly surprised was an understatement. Izakaya Kou offers some solid Japanese-Korean fusion izakaya with equally good service to match. I hope they keep it up.   While not an authentic izakaya, Izakaya Kou fits in the area as can cater to the crowds at the nearby music venues (Yoshi's and The Fillmore) and/or walk-ins not wanting to wait hours to get into State Bird Provisions across the street.   As with most izakaya restaurants, the menu is very extensive. Izakaya Kou has small dishes, salads, sashimi, grilled dishes, yakitori, teppan, fried dishes, soups, noodles, and rice bowls. They also have a couple of jive ass rolls and nigiri but that's like ordering fish at a steakhouse so it may be best to stick with their other items.   ~ * ~F O O D~ * ~ Izakaya dishes are meant to be small so the rule of thumb is 3-4 dishes per a person and then finish with a bowl of ramen (we opted out). Expect to spend about $50-60 a person; more if you're a lush.   *Kou Sashimi Combo: Maguro, Sake &amp; Hamachi (9 pieces - $18):  <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1dss1pD&amp;s=0348a481037fe52b42e63233b7a7651d2707a723e9e00b65e2f4969bbc7a7d8c\" rel=\"nofollow\" target=\"_blank\">bit.ly/1dss1pD</a> *Uni Onsen Tamago: Sea Urchin w/ Hot Spring Egg ($7): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1gDvZeI&amp;s=ca9bc22739aae44000965b0b2dc667ca1cecd02de5eedef31c51505ddc779f21\" rel=\"nofollow\" target=\"_blank\">bit.ly/1gDvZeI</a> *Gindara Misozuke: Miso Black Cod ($11): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1gDvRw3&amp;s=74331dbc086ff3d35c7ea1f809b246572aae399c2e6a59a5183a363e4136e5e7\" rel=\"nofollow\" target=\"_blank\">bit.ly/1gDvRw3</a> *Buto Toro: Grilled Pork Belly ($7): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1eUIjMa&amp;s=8c5f40713291f8bdded08728752cc19677547aaaa872c5e213af1c5e498a7dbe\" rel=\"nofollow\" target=\"_blank\">bit.ly/1eUIjMa</a> *Momo: Chicken Thigh ($5): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1gDvMIw&amp;s=f17a81532d0ce19081afddf874cf9f8d25fc6c2f2614993cab71aa1fbca078af\" rel=\"nofollow\" target=\"_blank\">bit.ly/1gDvMIw</a> *Kalbi Tempura ($10): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F19hrKD0&amp;s=5bc7845d3244726b1af8cd1a60519c0d586456ef96e0d4c1e79ed8f5747a66b8\" rel=\"nofollow\" target=\"_blank\">bit.ly/19hrKD0</a> *Kabocha Croquette: Japanese Pumpkin Wrapped Egg ($7): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F17Mg63Q&amp;s=d016411387f7a7ff2edef5d8a3c235a3e6c721ffe9464bed73d8cca45f3c8962\" rel=\"nofollow\" target=\"_blank\">bit.ly/17Mg63Q</a>  The sashimi combo was surprisingly excellent; thick buttery slices of deliciousness that trump many sushi restaurants that I've been to. Even better than the beloved Gochi and Tanto (izakaya) in the South Bay. If you like Koo's spoonful of happiness (the uni &amp; quail egg one) then you will like the uni onsen tamago which had a delectable oozing egg yolk, creamily briny uni, and a ponzu type sauce. Black cod done right, this fish was incredibly buttery and flaky with tons of umami flavor. My only gripe is I wish there was more. The buto toro had a nice lean meat to fat ratio with a delightful savory sweetness and a nice crunch from the red onions and scallions. I didn't try the momo but Mr. NSS said the grilled chicken thighs were tender and well-seasoned.   Two dishes that needed improvement were the kalbi tempura and kobacha croquette. While the kalbi was very tender and robust in flavor, the pale tempura batter was soggy. Perhaps lightening the batter with some soda water and frying it a slightly higher temperature would help? The sweet kabocha with the soft boiled egg was nice combo especially with the crunchy exterior but it was sitting atop some apple-like sauce which made the dish way too sweet. It needed some heat to balance out the sweetness.   ~ * ~S E R V I C E~ * ~ Considering it was the second day of their soft opening, the staff was fantastic. Everyone was very welcoming and gracious. Staff was attentive and tried to help us out with the menu and recommendations as much as they could. The owner passed by several times to make sure everything was ok and offered 10% off during their soft opening stage which is what every new restaurant should do (but they don't).   ~ * ~A M B I A N C E / D E C O R~ * ~ Previously the short-lived Nan California Korean Cuisine, Izakaya Kou's designers did an spectacular job transforming the drab space into a very earthy urban space with unfinished wood walls, furnishings, living plant wall, Japanese street art on the back wall, and sleek glass encased tatami rooms. There's also counter seating available so you can overlook all the action in the kitchen.   ~ * ~P A R K I N G~ * ~ Difficult street parking after 6 pm and on the weekends. The Kabuki parking garage is a block away.   Izakaya is never complete without sake, shochu, or any alcohol for that matter.   Thank you, waiter for the Kikushui recommendation: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1gDM6Jn&amp;s=66e6959976c7727bf2e73b2d23702d6a9b18e3628c5a53343c01c1f0952b9058\" rel=\"nofollow\" target=\"_blank\">bit.ly/1gDM6Jn</a>. I almost twerked my way back home. Luckily, I saved everyone's eyes and ended up at the Korean market next door drunk shopping. Came home with a bag of fish cakes. Fish cakes. *Le sigh*  Happy Thirsty Thursday! *Kanpai*", 
    "review_date": "2013-09-19"
  }, 
  "eZNhFI6m07dvu1zfLfJc-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy N.", 
    "review_text": "Yakitori! Yakitori! Yakitori! They were all delicious. I don't really remember which ones I ordered to be exact because there were soooo many choices, I literally picked at random as I went down the list. Bacon wrapped anything is always good. Besides yakitori, the hamachi kama was great as well. Can't forget the okonomiyaki (pancake).  Come with enough people and get a VIP room!! Definitely call for reservations for that. Walk-ins for 2 during weekdays should be no problem.", 
    "review_date": "2014-05-20"
  }, 
  "wNQtc4ebOrojkuGOJtaR-w": {
    "user_rating": 4.0, 
    "user_location": "Stillorgan, Ireland", 
    "user_name": "Carly B.", 
    "review_text": "Very good sushi, California roll has fresh crab meat, volcano roll was delicious. Miso soup was one of the nicest i'd ever had with fresh mushrooms. Ramen &amp; pork gyoza were tasty. Service was great. Was jealous we didn't have a bigger party so we could eat in the private Japanese eating rooms!", 
    "review_date": "2014-07-06"
  }, 
  "ccfVsl7SZeK-2Ixc2-anuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianna S.", 
    "review_text": "Yum! Really enjoyed having dinner here.  We came in on a Tuesday night and were seated right away.  The decor and ambiance are really cool. They have larger tables sectioned off to create a more private space, which would be fun to do with a group.  Our waitress was very sweet and attentive. Our food came out quickly and with really cool presentations. The hamachi kama and sashimi samplers were really good. I loved the sashimi, each piece was so buttery and fresh tasting.  We also tried the poke salad.  This was my only disappointment of the night, it had a Korean style dressing which was way too spicy for me and took away from the flavor of the fish.  Luckily, our waitress happily offered to remove this from the bill.  i would happily recommend this restaurant to anyone looking for a fun yet sophisticated spot for izakaya style dining.", 
    "review_date": "2014-03-26"
  }, 
  "n5VGv2whg2yvnjELQ5hURA": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "superdave x.", 
    "review_text": "Excellent", 
    "review_date": "2014-03-29"
  }, 
  "d2Skpm7JrZReaYC6luk1nQ": {
    "user_rating": 4.0, 
    "user_location": "Waterloo, Canada", 
    "user_name": "Harshal J.", 
    "review_text": "This place has got a great ambience. The food is really tasty. I ordered the okonomiyaki which was delicious.", 
    "review_date": "2014-09-09"
  }, 
  "9fe41Vmw245Eho1PghHHKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy O.", 
    "review_text": "FANTASTIC.  First time here last weekend. My brother and I wanted some awesome fresh food prior to doing a few hours of karaoke.   Atmosphere ***** Service **** (was great, but severely slowed once became busier)  Sake selection: A+ Food: A+  Agedashi Tofu: **** Hamachi Carpaccio: ***** Frisco Roll: ***** Volcano Roll: *** Kou Sashimi Plate: ***** (super fresh fish!!)", 
    "review_date": "2014-11-28"
  }, 
  "orPR-FKHL95H756vjx2Vrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "X L.", 
    "review_text": "We dined there on a Sunday evening and still had to wait for 30 mins before getting seated. They do take reservations on open table though. I'll definitely make a reservation next time.   We didn't try the sushi or the rolls. We ordered the sashimi salad, two grilled dishes (chicken skewer and the whole squid) and a few small dishes. They were all very tasty. The highlight of the meal was the Kabocha Croquette. I haven't had it in other Japanese restaurants or in Japan. So it's the first time I had it. It's a very good combination of one boiled egg wrapped with pumpkin and the whole thing was deep fried. Very yummy.  The interior design of the restaurant is also nice. The service was good too. All in all, a very good dining experience except it was pretty difficult to find parking near the restaurant.", 
    "review_date": "2014-10-06"
  }, 
  "wEqETrWwpsujK2r8ZueOFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Henry W.", 
    "review_text": "This place has potential to be so much better. It has a beautiful interior with a well thought out design. The location is good being right in the middle of Japantown.  My issue was with the consistency of the food. About half the things that came out were kinda blah/average and the other half were excellent. My guess is that when they were making the menu, they were trying too hard to please everyone instead of just concentrating on what they were good at.  Kabocha Croquette - Super Blah. Its basically what it sounds like. A soft boiled egg sitting inside mashed yam and then deep fried. Not that great.  Buta Toro - Somewhat better than average. Just pork belly grilled. Nothing special here.  Sake Onigiri - Way overcooked/burned on the outside with barely any salmon inside. Probably the worst dish of the night.  Uni Onsen Tamago - The best dish of the night for me. The uni was fresh and paired very well with the soft cooked egg and sauce.  Miso Black Cod - Delicious. Made perfectly and melted in our mouths.  Kalbi Tempura - Could have been a bit crispier, but otherwise was executed well.  Service was a bit lacking as they understaffed and overworked. They never brought out water and didn't ask to refill our green tea. They also forgot to bring out one of our dishes until we were about to sign the check.   But yes - this place has potential to be better.. just remove the things off the menu that are average and hire more servers. :)", 
    "review_date": "2014-08-17"
  }, 
  "UVs_7nPjqK_W_ap96IClpA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam F.", 
    "review_text": "I really really really wanted to like this place but there were quite a few things that were disappointing...  The food did taste pretty good, I will give it that. I would recommend ordering the momo skewers (chicken) and the ika yaki (grilled squid) because these were my favorite dishes. We also had the chicken karaage (fried chicken pieces), kaki fry (oysters) and the tuna poki salad. The karaage was flavorful but cooked a bit too much but my bf really liked the oysters. The poki salad was actually surprisingly spicy, but there wasn't much on the plate for $12!! Definitely a rip off since the dish is mostly greens sprinkled with a few chunks of tuna =( We ended with a spicy tuna roll which was very good: big pieces and lots of yummy fish inside.   The service here was pretty bad which put a damper on the whole evening. We were seated promptly at a \"communal table\" but then were offered a private table which we accepted. However this table was right next to the kitchen which was kind of loud and busy.... I thought this would make it easier to flag down a waiter but boy was I wrong!! It took at least 10 minutes before we even saw our waiter, and this was after I had asked the water guy to send someone over!! Unacceptable. After we ordered I was waiting for the glass of wine to come out first since this is usually easy to pour and bring out, but it didn't come until almost all our food had been served!! What?! My bf had to ask after the wine as well, otherwise I would have received it AFTER we had finished our meal -____-   The food was brought out pretty quick but the waiters pretty much just bring the food to your table and are not very knowledgeable in regards to the menu (my bf asked how many pieces were in the spicy tuna roll and the guy had to go to the kitchen to check.... I would think that was pretty basic information....) Overall most of the food was pretty good but it was PRICEY and the service was SUBPAR =( I would think twice about spending my money here.", 
    "review_date": "2013-10-11"
  }, 
  "97UvRHbgcA8NQL8YKmun2g": {
    "user_rating": 4.0, 
    "user_location": "Outer Sunset, San Francisco, CA", 
    "user_name": "J K.", 
    "review_text": "Restaurant had a nice vibe. Portions were a little small but tasty. The wasabi tuna was my favorite, black cod was tasty and tender, sashimi is also fresh . Sapporo on tap", 
    "review_date": "2015-01-16"
  }, 
  "bOPFDhX5R5CUBgr2wh7Jfw": {
    "user_rating": 1.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Angela M.", 
    "review_text": "We went to dine at this restaurant. The manager brought us a bottle of water. We all drank it and later find out a cloud of mold at the bottom of the bottle!!! Disgusting!!! And we all drank the water before we find out!! Never have this terrible experience before!!", 
    "review_date": "2014-05-01"
  }, 
  "Ey4-_7UQrWXBASoRtNOwXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JP P.", 
    "review_text": "Good food and easy price. Also geeat service. One of very fine japanese style restaurant.", 
    "review_date": "2014-03-30"
  }, 
  "WUn82-t99wHTsNdRkaVkZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nebojsa R.", 
    "review_text": "Love this place, if you are a bigger party book one of the tatami rooms and have true experience of eating in a Japanese restaurant. Frisco rolls are my favorite, but everything tastes quite amazing. The service can be slower at times but you'll forget it as soon as the food arrives.", 
    "review_date": "2014-07-02"
  }, 
  "r8YrTMjERM32vGUHfAw6Zw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy L.", 
    "review_text": "Service 5/5 Kou sashimi 5/5 Pancake looking dish with veggies bacon in it 5/5 Soba 5/5 Fried oysters 3.5/5 but all my friends thought it was a 5/5 (I don't like fried food) Takoyaki 3.5/5 nothing special  Japanese sausage 2/5  Price was $30/person including tip. Atmosphere was great. They have the private rooms Restrooms are super clean Id go back!", 
    "review_date": "2013-10-02"
  }, 
  "OjbTRKAhC48eDNvEe3AcrA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nina K.", 
    "review_text": "It's hard to really see that the food lacks top quality when the hip, modern, LA-like decor of this restaurant makes it look so nice and aesthetically pleasing.   I'm obsessed with the interior of this restaurant. Everything from the long group tables to bar seating to two-person tables and the Japanese rooms where you take off your shoes and sit on the floor. The rich, wooden look of this place. Overall, this looks like a very quality, hip restaurant, but I was disappointed that the food wasn't matching the level of the design of the restaurant.   Overall, this place is more of a Korean-Japanese fusion style restaurant. Some Korean influences in the food which was unique and interesting.  My boyfriend and I love izakaya/tapas types of restaurants. I love upscale, hip restaurants so he thought this place would be great! He came here before and enjoyed it that he took me again this time around, but he was frustrated that the food was not of same quality as last time he came. Maybe we came on an off day?  We ordered 6 variety of plates from the menu (My prices are approx guesses from what I briefly remember) I think we kept ordering more because we were in disbelief of how disappointing our food was.:   -Chirashi bowl - About $16-$18 I think?- The rice was alright. The sashimi/cuts of fish were good, but the quality of the fish wasn't the best. There was even some salmon skin on our salmon. We've never seen that, never. And salmon (which is supposed to be the fattiest, hence one of the butteriest/smoothest fish was actually the chewiest, yuck) The other fish tasted fresh and clean!  -Pork belly- About $10- This was sooo good. Good, thick cut. Melt-in-your-mouth pork that falls apart once your tongue hits it... It was sitting in a delicious soupy sauce.  -Mushroom wrapped in bacon- About $8-Bacon was cooked well..This was good, but tasted a bit burnt (because of the mushrooms) that I couldn't really taste anything else. Most izakaya places know how to grill without the burnt tastes.   -Fried asparagus rolled in tuna with garlic chips - About $9-This was good, but it came out with the garlic chips so we had to ask for it a few times. When it came out, it wasn't even a garlic chip, but rather a few raw garlic shavings. So disappointed. The tuna was fresh and good, but the asparagus did not seem fried, but seemed raw. Was a bit sad because I wanted to try something fried.   -Poke salad - About $12- They should rename it to salad with bits of poke because there were honestly 6 pieces of itsy bitsy poke pieces (that were good), but still, we didn't expect to barely get any poke. Fyi, it's very spicy.  -Salmon Skin Katsu -  About $8- This tasted super fishy. I couldn't even finish it. But very nice crunchiness from the katsu and it wasn't too oily.  Overall, the aesthetics are very nice. The food was good, but a bit underwhelming at times. :( The prices are a bit steep for the small plates (normally I wouldn't mind how pricey it is if the food was awesome, but I thought for the food we did get, this place was overpriced.) Very small portions, decent food. Great service. Overall, this place is okay. I really wanted to love it, though.", 
    "review_date": "2014-07-28"
  }, 
  "rBRuie_HNzxCkMDF-ooRog": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Myra M.", 
    "review_text": "Over a week ago, on a Wed-night, I had the opportunity to dine here. I do like the modern decor, but the music that was playing was constantly jumping around to different genres, which never flowed; sounded like someone in the back couldn't make up their mind what to listen to.  There are private rooms where you have to take your shoes off before entering. This looked like a cool spot for a group dinner party.  My date and I sat in the seated dining area in front of those rooms. I think I would prefer to sit at the bar, which looked pretty cool.  We shared hamachi kama, uni sushi, hamachi and tuna sushi. Didn't like the octopus; that was slimy and truly raw; not at all like what we expected. We also had the miso cod (or was it a sea bass) it white fish that was delicious. Over all the food was pretty good.  So why only 3 stars? Well customer service was friendly when they were finally at our table. Service was painfully slow. And it was a Wed-night; not that packed. Perhaps they were short-staffed that night.", 
    "review_date": "2014-08-24"
  }, 
  "zOWReF-a4g2rPfj9y10r9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelvin Y.", 
    "review_text": "What's up with all the izakayas and ramen shops that popped up everywhere in the City!?  My wife and I have tried about 5 izakaya's around town, and Izakaya Kou is probably one of our favorite. Beautiful restaurant, unless you're stuck at the right side wall facing the kitchen. Sure, portion is somewhat small and but service was attentive, polite and unobtrusive. We ordered:  kabocha croquette - tasty, huge! sashimi kou - very average, will not order sushi/sashimi from here next time kurobuta pork yakitori - juicy dengaku miso eggplant - great miso sauce black cod - delicious, teeny tiny portion hamachi kama - acceptable beef tataki - too salty, 4 slices of overcooked, oversalted beef and a pile of greens buta kakuni (braised pork belly) - not too fatty but still melt in your mouth nagasaki ramen: huge bowl, generous with the vegetables and seafood.  Overall, the food was 3.5 stars, bumping it up 4 stars for the friendly and efficient service. I was well-fed and could barely walk out of the restaurant. But hey, Japantown is only one block away, so must drag self to get green tea ice-cream crepe obviously...", 
    "review_date": "2014-10-04"
  }, 
  "SYQKyn3Pox53A2IHXDV9Mg": {
    "user_rating": 1.0, 
    "user_location": "Austin, TX", 
    "user_name": "Amy P.", 
    "review_text": "As a table of 6 without reservations, the manager offered us the tatami room but only under the condition of spending $200 min. We offered to wait for a communal table. The manager then decides to waive the $200 minimum for the tatami room. Fair enough.  The interior is decorated beautifully and very trendy.  The first half of order which was all the seafood came out first. The hamachi mamas were overcooked and bland.  The rest of our order (5 items) was either forgotten or overlooked. Eventually we asked the waitress to cancel the order. The waitress offered to charge us 50% off the remaining order. We obliged.  After we got the check we wish we just cancelled it altogether. $300 later and we all picked up pizza from Tony's.", 
    "review_date": "2014-05-10"
  }, 
  "9kvzAuCNFpuu-Smx2Uf4FQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Monique M.", 
    "review_text": "First time of taking my shoes off at a restaurant. It was a unique experience. =)  Our waitress was extremely patient and helpful with the new foods I was not used to. I ordered the ramen soup. It was my first time &amp; I loved it! The hot sake was pretty good. My boyfriend got the sushi rolls....we both have had better.   The atmosphere was very nice &amp; quiet. Everyone was very friendly except for the big guy at the counter. Maybe bad day? But no need to be rude or grab the check out of a friends hand. Very unprofessional.   I don't think I will be back, but it was a cool experience with the shoes off &amp; whatnot. I will now try some ramen places though! ;)", 
    "review_date": "2013-10-30"
  }, 
  "TiR1De6epQ0_-mBl8hWo5w": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Tony Z.", 
    "review_text": "This one-of-a-kind Japanese restaurant is the best one I have ever been to. I have been to many Japanese restaurants in SF, LA and New York but this one really stands out. There are couple of points I need to mention here.   1. The ambiance is unique. When you walk into the restaurant you will see everything is made by wood, even the chandeliers in the private rooms look really stylish.   2. Every dish is a product of art. The dish not only tastes good, it is also well designed with beautiful layout and made with fresh ingredients.   3. The service is fantastic. The server knows the menu so well and he even recommended some off-the-menu special dishes. Goodies!!!!   My overall experience was just amazing at this restaurant last night. We stayed there from 9pm to 1am.", 
    "review_date": "2013-11-16"
  }, 
  "gds5r6Aq-Me0gpcdFGt3Hw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shanny A.", 
    "review_text": "Awesome restaurant to have dinner before a  jazz show at Yoshi's or rock show at The Filmore or Boom Boom room; both literally walking distance away. I've been frequenting this spot since they opened.  Although it gets extremely busy on the weekends I do feel the quality of service and food is well worth it. Decor reminds me somewhat of Gonpachi in Tokyo (where they filmed the end of Kill Bill) in regards to the wooden interior and private tatami rooms, the ambiance is just as loud, lively and enjoyable.    I always get the Black Cod, Gengaku Miso (Egg Plant), Okinomiyaki and a random sake bottle. So delicious!  I always leave satiated and happy.", 
    "review_date": "2014-05-22"
  }, 
  "up_llIX0NCO2AglNA2Jiog": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William C.", 
    "review_text": "It's really nice inside, the food is the worst ever. My friend was convulsing over rotten sushi. Do not walk. Run. In the other direction.", 
    "review_date": "2014-05-16"
  }, 
  "WoQg9CssJ9yts7JlueDJBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina H.", 
    "review_text": "Izakaya Kou is not the traditional Izakaya so it has limited skewer selections. However, it has a diverse menu so that everyone will definitely find something they enjoy. From udon to rolls to fun appetizers this is a great place to catch up with friends. The decor creates a warm peaceful vibe without trying too hard to look zen. Hideaway behind dark windows but open the doors and take a look! 4 stars because not necessary satisfying if you are specifically looking for Izakaya (lots of different Japanese skewers). The kabocha (squash) specialty is a must try though ;)", 
    "review_date": "2014-05-05"
  }, 
  "mEr-8BkirskBr357ysgMsQ": {
    "user_rating": 3.0, 
    "user_location": "Parkmerced, San Francisco, CA", 
    "user_name": "Jiayuan L.", 
    "review_text": "The yaki udon is a bit salty. My friend had salmon skin tempura and she felt that the flour layer was a little too much.", 
    "review_date": "2014-09-14"
  }, 
  "ZePYCdEAjP53MOHAtdV4nQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda M. C.", 
    "review_text": "The menu is varied and extensive and provides for a refreshing Japanese dining experience. The uni and egg was one of the more memorable dishes, and I also had their hamachi kama, a dish that I often order at restaurants that offer it.  The second time we visited them, we were a group of five, and we enjoyed having one of the corner rooms in the front with big windows. The service was excellent as well.  A tree grows through the floor in the main dining room, a neat aspect of the decor.  I'd definitely recommend this restaurant for Japanese food beyond the traditional sushi and main dishes. The next time we go, we will try their ramen.", 
    "review_date": "2014-09-14"
  }, 
  "E3WaRvwaDg16pSuIwVkI5w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy T.", 
    "review_text": "Great meal - flavors reminded me of food I had visiting Japan.  The Hawaiian poke, Gindara (cod), hamachi carpaccio, okonomiyaki (Osaka style), and Tako yaki (octopus) were our favorites.  Wish we could've tried about 20 more dishes and will be back for the rest.  Decor was nice, and service was amazing.  Friendly and attentive, made us feel very at home.  Would recommend for a date, small group, or pretty much any excuse to eat.  Or drink - we let them pick sake for us and we loved them all.  Definitely a new favorite in SF!  Must try!", 
    "review_date": "2013-12-05"
  }, 
  "9eVsbfT2f4yAQnmowJHoyQ": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Mark H.", 
    "review_text": "I sat at the bar and ordered just small plates, because I wanted to try different things. I did not order all at once and they seemed fine with that. I didn't have to wait long for food to come out. My favorites were the takoyaki, chicken meatball yakitori, green tea soba, and spicy tuna roll. Overall the it was a nice experience...pretty quiet, nice comfortable interior and the staff was friendly and attentive.", 
    "review_date": "2014-07-28"
  }, 
  "VOmm64TvlWp1cNRb8bYFCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SuhWon L.", 
    "review_text": "I just ate at Izakaya for the first time on Friday and must say their service is amazing and the food is super tasty! I ordered the lizard eye, spicy tuna roll, cheese corn, and uni don! All were delicious! When the waiter brought out the uni don, he let me know it would be free of charge bc the chef thought the uni was a bit bitter that day. He apologized that I was not informed when I ordered. I tried it and it was nothing but delicious! I really couldn't taste the bitterness but appreciated their honesty. Definitely will be back again!", 
    "review_date": "2014-07-06"
  }, 
  "JGnqasIkGMLfSejt7mw9qQ": {
    "user_rating": 2.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Judy H.", 
    "review_text": "If you even knew.  No, really. If you even knew just HOW difficult and frustrating it is to find a quality izakaya in the Bay. I might retire from my search for a while because my meal at Izakaya Kou was so underwhelming and disappointing, I've lost all patience and hope for discovering this elusive izakaya.   The reviews sound promising and the dishes are pretty good. However, it was the nonexistent--and might I even say biased--customer service that really ruined our experience. I even noted in my reservation that my partner and I were celebrating a special occasion. Hint hint: don't be total jerks to us.   From the moment we stepped into the restaurant, I sensed disaster. My boyfriend and I stood at the entrance for nearly 10 minutes as the host completely ignored us. He was seating another customer (who was standing right next to us!), which was totally fine, but even after helping her to her table, he didn't even look at us. Not a single nod of acknowledgement. Not a \"I'll be with you shortly,\" or \"just give me a few minutes.\" He was fiddling with checks and menus, which again, I understand but we're potential customers. Are you trying to drive us away? Finally, after 10 minutes of this nonsense, my partner stepped up to the register and informed the man that we had reservations.   After being seated, it took forever for a waitress to come take our orders (I'll get to the food later). The dishes arrived quickly but the staff only checked on us once during our entire dinner. This would be acceptable if only the two tables next to us didn't receive extremely attentive and courteous service. Nothing stings more than seeing your fellow diners being showered with lots of attention while you're ignored and neglected. I don't want to insinuate anything but both of the tables next to us were older Caucasian couples. I noticed the majority of this restaurant was non-colored folks (it's Japantown so I was anticipating more diversity). Perhaps the staff wasn't purposely overlooking us but it sure rubbed off that way. My boyfriend and I are Asian and in our 20s. Y'all can judge this for what it is.   Now to the food. We ordered the following small plates: *Unagi Don - large piece of unagi but a tad too sweet. *Kabocha Croquette - lackluster. The molten egg yolk in the center was interesting/creative but the flavors were dull.  *Buta Toro - not sure if it's supposed to be tough and chewy, but it was like jerky. The pork was savory and tasty though. *Takoyaki - average dish but stingy with the octopus filling--too much batter and not enough meat.  *Gindara Misozuke - LOOK AT MY PHOTO. $11 FOR A TINY PIECE OF FISH?! It's basically the size of a golf ball. WTH. The taste/texture/execution does not justify this ridiculous price. I'm guessing it was for the \"intricate\" presentation. I've ordered the miso cod at other restaurants and the portions were not this outrageous.  We also got some beers: Asahi Black and Kawaba Weizen. The beers were the best part of our night. Just drinking our misery away! Kidding. We were still hungry after our meal but didn't want to stay a second longer at Izakaya Kou and being subjected to the terrible service while everyone around us was treated like royalty. Unfortunately it took an eternity for them to get us the check so we were stuck there. The Universe can be so cruel.   This is an upscale izakaya; don't expect the hearty and lively atmosphere characteristic of traditional izakayas. The food can pass for 3 stars but the service...I've made my case.", 
    "review_date": "2015-01-27"
  }, 
  "3G9Jkn7hKc8fmbdK8_lC8g": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Regina C.", 
    "review_text": "my experience with Izakaya Kou is based on the Yelp Elite event hosted here a couple of weeks ago. it was really generous of them to serve up more than ample amounts of food and libations to a full house of excited Yelp enthusiasts.   the space itself is really cute. it's modern and full of dark earth tones but still holds characteristic japanese elements such as tatami rooms (shoes off, sit on pillows type seating). it's a good place to bring your friends to converse over many shared small plates and light cocktails.   while i am grateful for being able to taste many of their dishes, i can't say that the food had any wow factor to it. on the plus side there are a ton of options, which is nice and accommodating to people with different flavor palates. the sashimi was of average quality and their signature dish, the kalbi tempura, wasn't particularly crispy or had anything notable to it. i did enjoy the miso black cod and the uni don though. overall i'd say that the quality, flavors and preparation of food was okay. there isn't any reason not to dine here if you're looking for a meal that is \"fine.\" i'd say it'd be a nice go-to spot if your main concern is chatting with friends over small plates in a decent environment.", 
    "review_date": "2013-12-18"
  }, 
  "Ma_gwnVShENgTuhHNpAvyQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David C.", 
    "review_text": "So GOOD!  We were headed to Fat Angel and got put off by the $47 dollar beers, so turned to Yelp and saved the day again with this discovery.  Traditional and new style izakaya.  Adventurous options on the menu.  Huge sake selection with solid choices on tap.    Would highly recommend: Cold Soba:  Texture and broth of this noodle was on point.  Wish they strained out the ice though.  Seared Tuna Tataki:  Incredibly fresh tuna, lightly seared with some green tea garnish.  Nonkatsu Karaage:  Fried to absolute perfection with tendons attached!  Braised Pork Belly:  Probably my favorite dish of the night.  Sweet and savory all at the same time.  Served in broth with a side garnish of large grain mustard.    Everything was super fresh, with quality ingredients and perfect execution.  Service was phenomenal  Definitely affordable for the city's standards.  Bountiful variety and great ambiance.", 
    "review_date": "2014-03-24"
  }, 
  "SQ5m72npgiiVJBtSVpLH3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Little Dragon X.", 
    "review_text": "Went for the \"Calm before the storm\" event. This place should open next week.  The place looks great.  The food was delicious and beautifully presented.  We especially liked the black cod and some of the sashimi dishes.  The service needs a bit of ironing out but once they get that down, this place should be fantastic.", 
    "review_date": "2013-09-10"
  }, 
  "2BxtarGuZ4Rexfb8MybOLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connie S.", 
    "review_text": "It's a great place to hang out with your friends, family or your love. Awesome sea food, sushi, lamam and good service! They also have something room which can give you a private space with ur friends as well as a long round table to watch chief cook food.", 
    "review_date": "2014-01-26"
  }, 
  "BMlmme_YhbcT6LFYeU3wIQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sushi Criticz A.", 
    "review_text": "meh. Nice redesign but the food was just mediocre. I enjoyed the previous spot, Nan, much better.", 
    "review_date": "2015-01-04"
  }, 
  "zSqv6sNrqCGe76OZgxQC9g": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Steven G.", 
    "review_text": "Great restaurant. We got a private room and ordered 16 dishes, everything came out quickly and every dish was superior. Favorites were, the kalbi and the kobocha croquet. So so good. Also, can't go wrong with a pitcher of beer and a big bottle of sake. Would definitely recommend and go again.", 
    "review_date": "2014-12-21"
  }, 
  "WSjmD3hVdnJ3sKEzrOWrZQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carrie A.", 
    "review_text": "Izakaya Kou, I think I love you. Really.  Wandering in to grab a bite to eat before heading off to the Fillmore, we came to this fantastic find. Unfortunately, I was so hungry, I didn't bother to take any pictures of our food. But I think you can browse through other Yelpers photographs and see each of the items devoured.  I instantly fell in love with the decor, raw wood throughout the restaurant, with tiny accents of air plants strategically placed. The atmosphere instantly put this sense of calm over you. We started off with the Maguro Tartar and the Gyoza. Simply wonderful.  The next plates that arrived were the Shiro Maguro, (melted in my mouth!) Ebi Tempura Maki Roll, (great flavor with a nice crunch) and the Buta Kakuni (pork belly goodness!)  We were sad that we were pressed for time, since we wanted to try more on the menu, and savor a dessert or two. (I'm a sucker for green tea ice cream!)  We will be back!", 
    "review_date": "2014-03-18"
  }, 
  "cS7K14kl9VZvenBiNACEqg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tim C.", 
    "review_text": "Pork Belly w/miso sauce is da bomb! Rare tuna w/egg over the top wasn't too shabby either.", 
    "review_date": "2014-11-29"
  }, 
  "aqU0iSjnV0swjyU4ZsxA5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane L.", 
    "review_text": "My first Yelp review ever and I am glad that I have found a place that I want to write about!  I always pass by this area and finally decided to try with my friend. We tried several dishes and all of them were unique and delicious. I definitely will go back soon for other dishes and drinks!   Ambiance It is a beautiful place with lots of reclaimed wood and unique lightings. I felt like I was walking into a gallery almost. It has communal table section with beautiful lightings and air-plant art on the wall, sushi bar area, table seating area and Tatami rooms. Their Tatami rooms are beautiful and private. It has doors between rooms and separate entrance. The calm atmosphere balances very well with dynamic calligraphy artwork on the wall.  Food *Hamachi Carpaccio: 3 pieces served, Hamachi was very fresh and flavorful, green onion adds crunchy texture which made it very refreshing in my mouth. *Nagasaki Ramen: Great for the chilly SF weather! White spicy broth was very flavorful and had plenty of seafood and vegetables. This can be my perfect hangover remedy! *Uni Onsen Tamago: Very unique and delicate. Good balance between richness of egg &amp; uni and the refreshing sauce and slices of onions. I used a spoon to eat but you can actually drink to taste all the delicate flavors in your mouth. *Kuruma Ebi Zuke: This was so amazing! The more I chew, the more flavor I could taste. The server informed us that they marinate for two weeks for the perfect flavor and texture.  *Maguro Tataki: It was delightful, if you want something light, this is a good dish to start with. *Gindara Misozuke: Oh Yum... it literally melted in my mouth. The texture of black cod was so soft perfectly flavored with miso. If you like black cod, this is a must try dish.  Dengaku Miso: I love eggplant so I had to try this. The miso sauce on top of the eggplant was so good and it complimented very well with eggplant. *Kalbi Tempura: OH My.... I never could imagine to fry Kalbi. I am a big fan of Kalbi (the Korean rib) and I didn't know what to expect when I ordered this. It was fantastic. period. The meat inside was so tender and flavorful, and the outside was so crispy. Eating it with vegetables and the sauce really made my mouth heavenly.   Desert *Tempura Green Tea Ice Cream: I liked the fact that it was not too sweet. It had beautiful small edible flowers on the plate that certainly added beauty of desert. *Cheesecake with Bi-Rite Ice Cream (Salted Caramel Flavor): I usually wait in line at Bi-Rite Creamery to get Salted Caramel ice cream. So I was so happy to get this desert without waiting so long outside!   Drinks *Akira Organic: I like sake in general and I wanted to try something new that I haven't tried. Server recommended Akira and said this is USDA certified organic sake! It was very smooth and clean yet flavorful.   Overall I LOVED my experience at Izakaya Kou. This place surprised me twice. The first surprise I had was the price. I was expecting higher price because of the beautiful interior and the 3 dollar sign on Yelp, but the price was much lower than I expected which of course made me happy! The second surprise was the quality of the food. Based on the price and the vast amount of menu items, I did not expect too much on food, but the quality of each food I tried were so delicious, and the simple but beautiful plating made a statement.", 
    "review_date": "2013-11-14"
  }, 
  "riw5myXtCJy95mqw08qFZQ": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "Eric H.", 
    "review_text": "First impression - place is hella cute w their ambient lighting and bamboo decor. Dope! Date is impressed.. DOUBLE DOPE.  Uni Onsen Tamago (A-) - <a href=\"/redir?url=http%3A%2F%2FBomb.com&amp;s=716853a54974befb18bd2a2079d876386c9ebd876290947c699fc1e3eaccf129\" rel=\"nofollow\" target=\"_blank\">Bomb.com</a>! Tangy, not too heavy and very flavorful with fresh uni. We shared one but could have easily gotten our own.  Kurobuta (A) - I can still taste this... The pork was grilled to perfection and so very juicy.. DROOL.  Bacon Enoki (B+) - Purdddy good. Mushroomy and exceeded expectations. Hard to get a good clean bite so ended up eating in one mouthful..   Shiro Maguro (B+) - Super soft texture like nommin on a baby's bum ;)  Hamachi Kama (B) - Crispy and juicy but boo for bones! :(  Unagi Nigiri (C+) - Meh.  Karaage w/ Spicy Mayo (B+) - Pretty yummy. $auce was bo$$!  Frozen Persimmon (C+) - Aight.. Unique, but too cinnamony, hard to eat, and would probably be better not frozen. I liked the pretty flowers tho.  Rice (A) - Nothing makes me happier than some good ass rice..  Overall, great experience, modern interior/classy atmosphere, cool date place, not too expensive compared to peers of similar quality, awesome service and delicious food.  They def go the extra mile when it comes to food presentation and making things look enticing.   4/5 - WOULD NOM AGAIN :D", 
    "review_date": "2014-08-12"
  }, 
  "9akppeqi5dnaIqPyJ75aCw": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Mimi C.", 
    "review_text": "after moving to the bay area, i've started to rely more and more on friends to tell me where to go. there are just so many good eats in SF!!!  izakaya kou has a classy, quiet, and minimal feel to it. it has dashes of bold red here and there to provide visual stimulation.  the kabocha croquette, tofu tempataion, and the hamachi carpaccio were delicately plated. we thought the kabocha was the most interesting but also very rich - basically fried and then you have a very carby squash inside. hamachi was very fresh.   great for catching up and ... an alternative to waiting at state bird. :)", 
    "review_date": "2014-02-17"
  }, 
  "nsCV4WEa4wTh5ZP8nYdnCg": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "Tiffany H.", 
    "review_text": "Their specialties and sushi rolls is okay...nothing special and services is average ( the waitress took our order but forgot to out it in, then later forgot to bring it out and the restaurant wasn't packed) I gave 3 stars because of the Nagasaki ramen and kuo sashimi...those two are the best.", 
    "review_date": "2014-12-05"
  }, 
  "WQexpqUhxTm93V3p0Xj6rQ": {
    "user_rating": 5.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Jack And Barbra D.", 
    "review_text": "At the prices charged, it would be difficult to find a slightly upscale izakaya that provides better food, service and atmosphere than this place. Try the kabocha korokke (croquette), the uni onsen tamago, or any of the sashimi. Some of the best yamakake we've ever had. All the dishes are beautifully presented. A great place to go for sharing small dishes with friends.", 
    "review_date": "2014-07-26"
  }, 
  "rP1JhMcc7sZTzW3KzLpL9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jade T.", 
    "review_text": "One of my best Izakaya experiences in SF so far! Our party of 6 was seated in one of their tatami rooms, so it was very private. *note on that: wear pretty socks, or maybe just shoes that won't take 5 mins to take off* All the partitions were open until other parties started to show up, but even then, noise level stayed pretty consistent.  Highlights: - EXTENDED menu, and they keep adding new items to it!  - ATTENTIVE service - REASONABLE prices - GREAT organic modern decor, good quality tables and partitions - CLEAN, ROOMY bathrooms  We ordered mainly izakaya items from their small dishes, fried, yakitori, and grilled menus, and nothing disappointed. We loved their kabocha croquette  so much that we ordered two more, absolutely delicious. Pork bellies, chickens, bacons, sausages, raw or pickled goodies, we had it all! None of the meats were overcooked, food always arrived piping hot, and the sauces all had different flavours. Presentation was also kind to the eye. Despite the \"private\" table, I could tell that the restaurant started to fill up, yet our service stayed excellent the whole time. Various members of the wait staff checked in on us, kept our glasses filled, and were surprisingly quick at clearing our table of any empty plates... mmmmm keep the food coming!!!  I was a bit skeptical on trying a new place with a group, but I was really impressed by our experience. Despite it being just a soft opening, everyone already worked like a well-oiled machine.. kudos to that! Definitely looking forward to coming back to try out their other dishes!", 
    "review_date": "2013-11-09"
  }, 
  "awmRirDC7WWig6R07XZ_oA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wakako U.", 
    "review_text": "the space is cool (very woodsy and airy) and I love the semi private room for groups with the traditional tatami look, however, I go to eat, not to sit in a pretty room.  that said, everything is ok to good but nothing is amazing and its definitely not cheap for not amazing and not very Japanese izakaya.", 
    "review_date": "2014-02-12"
  }, 
  "d2MJfhB60QAC-pfYogLZrw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kat H.", 
    "review_text": "Awesome place. I love that the waiters speak Japanese (my date also happened to speak japanese, so that was fun). But very authentic atmosphere and food. Nothing we ordered was bad. Presentation was amazing. This has become one of my favorite japanese restaurants for a more romantic evening.", 
    "review_date": "2014-10-07"
  }, 
  "fvPmgRm0qBs8gJHceqCduA": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Jahan T.", 
    "review_text": "A much needed addition to the \"other side\" of Fillmore St. The restaurant is situated on the corner of Geary and Fillmore, across the street from the Fillmore Center. This side if the street is slowly picking up. There is State Bird (which I can never get into anymore) and Social Study close by (and in the event of a moment of utter weakness, Panda Express!!). The night I was here I had a flurry of small plates and grilled eel (damn that was good; see picture). For some reason I had some udon as well which was entirely too much food. But I liked it and enjoyed it at the time. The ride home was a little rocky since I felt like Shamu stuffed inside a sardine box. But I brought this upon myself and hence could not complain too loudly. And I will do it again. Anytime there is a show at the Fillmore, I will pre-party to my stomachs content with the beautiful people chowing down at this place.", 
    "review_date": "2014-11-26"
  }, 
  "ASHegjKcfqLSXQY2OMgQDg": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Chloe A.", 
    "review_text": "Great food, somewhat odd atmosphere.", 
    "review_date": "2014-11-19"
  }, 
  "hRD1uMCRXkpDSbr5xC3R8g": {
    "user_rating": 2.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Jade F.", 
    "review_text": "I was not a fan of the food here; therefore I have no plans to return. The service and decor was great, however, but that's not my objective dining out! The food was either too greasy or lacking in flavor. Too bad, it's in my neighborhood!", 
    "review_date": "2014-05-27"
  }, 
  "-mIiXFN8U0bChS4WcRd8Ng": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Eric F.", 
    "review_text": "Sushi so fresh, delicious and beautiful -- and just across the street from the Kabuki Spa in Japantown. Aprés Spa? Absolutely!", 
    "review_date": "2015-01-08"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "3.5 Stars  I came here with my family for dinner a few weeks ago. We ordered a great deal of food to sample ranging from tempuras to ramens. Since it's been too long I can only recall vaguely the food. While nothing truly stood out, it was all decent with no real flaws.   I will say that food does come out in a swift pace so try to order in waves versus all at once due to lack of table space. Also the music gravitates towards the EDM scene, right up my alley way, but might not be for everyone.  They have traditional Japanese sit down rooms good for large parties secluded from everyone else.  Service is quick, especially tables with call buttons.   Overall Thoughts  I will have to go back another time and relive the experience again", 
    "review_date": "2014-03-20"
  }, 
  "JOtF5CrxlvHKpoKU4ByAbQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff L.", 
    "review_text": "I've been here twice now. This place has a few things going for it:  1. It's accessible. Next to Japan town, so parking nearby is easy. And it kept popping up on opentable when I was looking for dinner options.  2. It's a nice scene.  3. The food isn't bad.  Apparently I'm doing lists today - so why not a higher score?  1. It's a scene, so the food is expensive for what it is.  2. Presentation is great here, taste is okay.  3. The meal seemed to be randomly coursed and orders have gotten mixed up every time I've come here.  4. What was unique here wasn't that good, it was the food that can found at any other Japenese restaurant that was done well.  5. Worst of all, the last time I was here they were out of uni.  This is a pretty good date destination. It could be fun to go drinking here with a group. But I'm leaving this review mostly so I don't accidentally make the mistake of initiating a third trip to this place without remembering what I'm getting myself into.", 
    "review_date": "2014-11-18"
  }, 
  "QDLTqEx-HXAX7zN2yC7U2g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristen F.", 
    "review_text": "Amazing food! I usually just do sushi when I go to a Japanese restaurant but Izakaya  Kou has a much more extensive menu. The best dish we had was the miso cod. Very flavorful and rich for a usually dull fish. We also enjoyed the roe don and volcano roll. The ginger cocktail was fantastic! The restaurant is very chic and there are a few rooms with recessed seating, traditional Japanese style. Great service, our waiter was very knowledgable about the more obscure dishes. A little pricey, but totally do able for a special occasion. I highly recommend this place.", 
    "review_date": "2013-12-12"
  }, 
  "x_PyGiblzQ2nFs3hoRHXYA": {
    "user_rating": 5.0, 
    "user_location": "Midtown, Sacramento, CA", 
    "user_name": "Joe R.", 
    "review_text": "New restaurant, had to check it out. My server was Diane. Pretty, sweet and very knowledgeable of her menu. The food is on the pricy side but every dish is delicious. The set up of the place is pretty dope. Its Japanese style so you enter a room, take your shoes off and sit on the floor. Tried every sake and left pretty drunk. Good times", 
    "review_date": "2014-01-21"
  }, 
  "u_RB8njILJomIeEZ1QJXvQ": {
    "user_rating": 5.0, 
    "user_location": "Temecula, CA", 
    "user_name": "Kevin R.", 
    "review_text": "We were in the mood for Izakaya food later at night and were having bad luck with everyone being closed or unwilling to take us when they were about to close. Unlike the others, Izakaya Kou made us feel welcome even though kitchen was closing soon. The server was very friendly, helpful in recommendations, and gave us a primo table. The atmosphere here is much nicer and upscale than most Izakaya and the dishes were far more creative than typical. This was what I would conisider upsscale Izakaya. But the prices were not outrageous considering the atmosphere and quality of food.  Food standouts for me were (don't remember the proper names): 1) Battered japanese pumpkin with soft egg inside. This was a crazy Frankenstein creation that reminded me of a mixture between a corn dog and a scotch egg. It sounds weird, but was incredible tasting and a great portion size. 2) cheese corn - once again seems so simple as to be boring. It's cheese and corn. But it was delicious after an exhausting day of SF fun. It could have perhaps used a spicy component though for an extra dynamic. 3) chicken meatball - I'm not a big meat eater, but this was on point  If I lived closer to the area, I'd certainly want to go back post haste to try other stuff on the menu.   They also have an extensive sake selection if you're into that.  This was a real treat to have perfect food and service after other Izakaya places being unwelcoming jerks that night.", 
    "review_date": "2014-02-14"
  }, 
  "_RkyZClDvAdaG6xwgNaF5A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina K.", 
    "review_text": "I came here for a friends birthday and we got the tatami room because are party was too large to be seated in the dining room. I have to say the service was really bad. Maybe because 18% gratuity was already added to the bill. We didn't get the menu nor a glass of water until I had to wave them down and that was 20 mins later. What was even worse is when the waitress asked us to clean are own table! (I think she is Korean) she told us to put the dishes that where done next to the sliding door. We told her that all the dishes where finish and that she can clear the table, but she insisted on us to put all the dishes which was more then 10+ next to the door. I think she didn't want to take off her shoes. My friend had to tell her that we didn't  want to get are hands dirty! She closed the door on us and never came back to clear the table even when we didn't have space to put the desert. You will expect excellent service if not at least good service after spending over $500 and giving $75 tip but think twice.  Besides the service food was ok and the atmosphere was nice.", 
    "review_date": "2014-09-14"
  }, 
  "0S_t5JmmTjtZsM46J9UHlQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Sheena P.", 
    "review_text": "I couldn't be much happier to try my very first sashimi here at Izakaya!  We came here on a Saturday night, but since we didn't have reservations we waited about an hour to get seated.  The bar is quite small and they weren't enough chairs on the waiting area.  The place looked decent and it's somewhat \"romantic\".  I ordered Kou Sashimi (9 pcs) and it was satisfying!  Everything was fresh and well-prepared.  The uni onsen tamago was quite intriguing so I decided to give it a shot.  I'm not a big fan of uni, but this one was actually good.", 
    "review_date": "2014-11-17"
  }, 
  "yY77W4CAgbA45er1oIFpbw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen H.", 
    "review_text": "We had the fortune to come here on their soft opening and beyond the delicious food and friendly service, I appreciated how serious they were in making sure their restaurant would be successful. Using it as a learning opportunity, they identified kinks to iron out and took feedback to enhance the menu.  A couple of weeks later, I came back with my brother and ordered some new and old dishes alongside a pitcher of Asahi. Once again the service was friendly and the food delicious. The sushi was great (especially the ankimo), especially for the price. The yakitori was well prepared. And the okonomiyaki awesome with the bacon. The only item that could have been done better was the miso black cod. It was much better at the soft opening as this time it was a bit rubbery. In any case, the taste was there.  I hope these guys rock it. The location hasn't had a great history of restaurants, and if there's one restaurant that has a chance among them, it's Izakaya Hashibiro Kou.", 
    "review_date": "2013-09-25"
  }
}