{
  "11XPmwV5GIXz2fyxzsxj2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie V.", 
    "review_text": "My boyfriend and I eat here about once every 2 weeks.  It's so nice after a long day to sit on the patio, drink a beer and enjoy that absolutely fabulous Mexican fare that comes out of Marta's kitchen.  The guacamole is great and I am a personal fan of the Chile Verde super burrito.  We haven't tried anything we haven't liked.", 
    "review_date": "2007-10-07"
  }, 
  "DPD-xnF1r45SgxA38xfSgQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trudie S.", 
    "review_text": "LOVE. LOVE. LOVE. Casual and easy going place for a drink and AWESOME pizza and this is coming from someone who doesn't like to eat pizza. Staff is friendly.", 
    "review_date": "2013-09-26"
  }, 
  "96us9i9zB7QIxBtyRlhvDQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Rho T.", 
    "review_text": "The nite I came here, it had the most random groups of people I have ever had the pleasure of being in a bar with.  But first- the service. The Bartenders were fantastic. It was obvious that there were regulars at the bar upon entrance, but the 'tenders made you feel welcome and were open to high-fives and pounds should the hand gestures be called for during bar banter. Beers are cheap, from what I remember all less than $5. Cash only, but there is an ATM machine. Drinks were stiff. And the pizza! THE PIZZA. We ordered 2 large pepperoni and sausage pizzas, at about $17 each. (I think. Drinks were stiff. I mentioned that, yeah?) These thin crusted pizzas aren't frozen, kids. They are made fresh on the spot and will remind you of New York pizza at first but will then make you proud that you are in fact eating this fantabulous piece of heaven in SAN FRANCISCO. You will look around and be like...where.are.we.again? Jay'n Bee Club. Don't get it twisted. Home of the obscure magical pizzas. There is a menu with fun names of available pizzas, but I was too far gone to remember. Sorry, Yelp. But I'll tell you what I DO remember. The patrons there that nite!  At the bar: The regulars. The Cliffs, The Norms, the Jack Trippers and Janets' and Chrissys'. Off to one side, near the pool table, were younger, frat-ish boys. At a table nearby, a group of Asians. Out at the back patio, a group of Mexican guys. (don't worry, we clarified.) Then you had my friends and I - 1 Argentinian, 1 Salvadorean, 1 White, 1 Black, and 1 Filipina. The whole bar was a walking United Colors of Benetton ad.  As I looked through their jukebox song choices, a frat boy yells to his friend: \"Hey PANSY u gonna buy this chick a drink or do I have to make out with her for you too, bro?! Frat boy then turns to me and says, \"What you havin, fancy face?\"  At the Asian table, they were ON one. Red-faced (as was I) and havin a great time, they started belting out Adele. \"We coulda have it awwww....roarin in the deeeee-heeeee...\"  I walked out to the back patio, to where the rest of my friends were. They were talkin Niners with the Mexican guys. One of the guys said, \"Just watch, we're gonna take the NFC West!\" (and several weeks later, we did.) Then one of the guys starts waving his beer around and starts singing: \"Weeeee are the Champyons, my frennzzzz...\"  Now see. You can't put me around singing people. Cuz I will join you. I was almost roarin in the deep with the Asians, but this time, I couldn't resist. \"......and we'lllllll keep on fighting..till the end...\"  All of us now: \"We.Are.The.Champions. We!Are!The!Champions!\" Cue a few frat boys who enter the back patio: \"No time for loooosers cuz weeee are the Champions...\"  Enter Asians: \"Of da worrrr!!!!\"  True Story.", 
    "review_date": "2012-01-02"
  }, 
  "vTugBdYg34rX4KvGpzBrNA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sonya D.", 
    "review_text": "Best music at a local dive! The dj was spinning super rockin tunes, and I was totally in love because usually it's the same type of stuff everywhere I go. This in particular makes this bar very unique. The drinks looked impressive, even though I was lame and only drank Guinness. Everyone there had cute style and were dancing up a storm! This is definitely a great place to hang out, have a couple drinks, enjoy good conversation, and simply be awesome.", 
    "review_date": "2010-04-28"
  }, 
  "W2iOOuHjSNBC5QJu7UNTEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Timothy T.", 
    "review_text": "Great place knowledgeable bartenders good atmosphere and affordable prices only wish they had a more diverse food menu but what they do have is delicious", 
    "review_date": "2013-05-19"
  }, 
  "eVLBGAgrTxc3tUfb5J0-Gg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ivan L.", 
    "review_text": "Great beers, great pizza, great place to watch the Giants!  I generally head here on Tuesdays. That's when the owner makes up fresh batches of the amazing meatballs. Get a pizza or a sandwich for the best meatball in the city.", 
    "review_date": "2011-07-11"
  }, 
  "SMfq-__aZWg_YEWhrgwgFQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "Good beer for okay prices in a decent bar atmosphere; your typical neighborhood joint.", 
    "review_date": "2009-02-13"
  }, 
  "HsTEfv2QiJBI1VclnVsxnQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon Z.", 
    "review_text": "NOTE: Marta's Kitchen (Mexican food inside of Jay'n Bee's) is now closed as of 09/2010  We need more bars like Jay'n Bee in SF. I love that I can get a nice mixed drink or beer, some Mexican food and watch TV or play pool. A totally unpretentious bar. You can bring your dog on to the back patio too. What more can you really want? The food is just so-so but the laid back vibe makes it worth the while. This is a great place to bring a group of people for a relaxed night out.", 
    "review_date": "2008-02-07"
  }, 
  "Q0qo1Gi99LihNjitnpfCAw": {
    "user_rating": 4.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Audrey C.", 
    "review_text": "Good, simple dive bar. Not overly crowded. Serves fresh pizza, to order.", 
    "review_date": "2013-05-06"
  }, 
  "K-NT_xHy7q779oSPLCyvNQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Most definitely a \"neighborhood bar.\" As in it's the totally lone commercial establishment in a sea of Mission residences. I was like, \"Wow -- is that a BAR?\"  (Cue golden beam of light shining down from the heavens on this glorious surprise, as dude and I trekked back to Potrero Hill feeling parched from too much healthy food and exercise... GAH!)  Now, really, this alone makes it cool. Who doesn't love a great neighborhood bar? A place where you can wander in any old night, chat with some chill people from your 'hood, get really shitty, catch a ball game, stumble out, do a faceplant and land in your bed, yada yada...  But the cool factor is a direct corollary of how cool said neighbors are, let us not forget. And when the joint is jumpin' on a Sunday night because the majority of the neighbors ARE that cool, but then that one guy has to come in from next door and ask for the music to be turned down at 11:00...  That just sucks. Big time.  But alright -- it was Sunday. I'll come back on the weekend and I'll probably end up upping the starrage.", 
    "review_date": "2007-07-31"
  }, 
  "pO6mu_37HMNGZlyzWBwZ7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelli R.", 
    "review_text": "Fantastically perfect bar.  Good beers on tap, good margaritas.  Great chill atmosphere.  Really nice bartenders.  And a freaking Mexican restaurant with great food.", 
    "review_date": "2008-02-23"
  }, 
  "FM8O0tk-dr-shroxU43jQA": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "melissa h.", 
    "review_text": "Happy Hour just a hop skip and a jump away! WOOOOHOOOO!!!!!", 
    "review_date": "2007-11-11"
  }, 
  "Tdsd6ojiId3tgJsBBQz4NA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Danielle B.", 
    "review_text": "So I was a little leary of the location, since some of the Potrero Hill/Mission neighborhood that's close to San Francisco General can be a bit shady.  That being said, it was quite convenient for a quick, casual, after-work drink.  Can't really beat the cheap beers and little patio.  Boo for running out of Stella; interesting gesture of them to give us the half glass of bottom of the keg Stella for free.  Thank you?  We did not sample the food that everyone seems to be complaining about.  Overall, a decent place to unwind after work, but I wouldn't go out of my way to come back here.", 
    "review_date": "2009-06-03"
  }, 
  "SH1FniYpQSa8_bc9kuzkhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles S.", 
    "review_text": "I used to frequent Jay'n Bee a year ago when I was living in the Mission. Actually I lived right down the street, so my review may be a bit skewed over the fact that I was able to get thunderously drunk and still make it back home-- lightening quick.   This place is is a neighborhood bar in the truest sense, meaning that by 12:30 you won't find many people there who don't live close by. The friendly patrons and eccentric bartenders are the selling point. Drunken conversations about everything from the state of the economy, Anthony Weiners schlong to urban farming can be had, and by people who can actually hold a conversation without leering at you all bleary eyed speaking with a play-doh tongue. The female bartender, an older woman with dirty blond hair and wouldn't you believe her name escapes me, is MILF-tastic. The food thy serve is relatively cheap and reasonably tasty. Nothing extraordinary, typical bar fare. But when things get a bit stuffy or when you need to smoke a fag there is the outside patio, though it ain't shit compared to the now shuttered Eagle Taverns outdoor patio. There is a pool table located in the main barroom, a bit of a squeeze, but seeing as this place never sees more than fifteen people at once it shouldn't be a problem for you.", 
    "review_date": "2011-06-10"
  }, 
  "PECXedG2F9cOUN_9Otru6Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nelson W.", 
    "review_text": "Nice place.  Easy to find, as the big red neon sign can probably be seen from space.  I am always mystified by the proverbial pool table in a crowded bar.  The folks trying to shoot pool have to keep asking people to move.  The people standing around are perpetually being moved around.  I was there on Sat night, and the pool players finally just gave up.    This  place is pretty nice looking and well run.", 
    "review_date": "2006-11-12"
  }, 
  "V4yqq3Lu7_ONT0XnPXiJ3Q": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Kurosh H.", 
    "review_text": "I heart JnB's.  It is the perfect neighborhood hole in the wall bar.  Its got a cool old sign hanging outside and a nice feel inside.  There is even a patio.  Sometimes I come here for the mexican food lunch special.  Other times I come here for a Hoegarden (yes, Hoegarden at a mexican place... whatever!)", 
    "review_date": "2008-07-29"
  }, 
  "Syt_iQqW_c9T2_lrvsddqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gwynnie p.", 
    "review_text": "We were at a day long event at the nearby Verdi Club, and pickins are slim for an easy to walk to eatery. This is where Yelp comes in, and thank g_d for the Jay'n Bee Club.   Some in our party requested a venue with a full bar, I'm pleased to report  the drinks are strong and cheap. Like the amazing thin crust pizzas, adult beverages are served up with just the right amount of sassy attitude. We also had smokers in our party (I know, I know, the horror), and they were happy that we could all sit together on the huge outdoor patio where they could singe their lungs and shower us with second hand smoke.   In addition to the pizzas one person had a meatball grinder, he reported it was quite good.   There is something about the Jay'n Bee that seems like the SF of yesteryear, before hipsters and tech gazillionaires invaded this hood, we likey.", 
    "review_date": "2013-09-28"
  }, 
  "zEY2p_TwGFVFcJi09PbZ9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lesliegh H.", 
    "review_text": "I go for the margaritas! They're served in a pint glass, yep, and for $6, I am set.  I live close by, so when my sis and I crave a margarita we always think of this place.  The margaritas are so delicious!  The food is surprisingly good (Had the garlic fries and buffalo wings, tasty!!!) and the bartenders are always super friendly!  I don't need anything more than that in my neighborhood bar!", 
    "review_date": "2010-04-28"
  }, 
  "vI2Oc__Y4ehNoO0S_v1QOg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Magda G.", 
    "review_text": "Neighborhood bar, has a pool table and outside patio. Full bar.", 
    "review_date": "2013-12-03"
  }, 
  "9fg9i7ke1NAGhf8W3e97VA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth m.", 
    "review_text": "In the mood for a friendly neighborhood bar? It's tucked away in the mission at 20th @ York, but it's worth the trip. Where most bars can get a little stuffy, this place has a small patio area where you can hang out and get fresh air (or smoke), you can play pool, or grab a bite to eat  The food is amazing, if you get there and feel hungry ORDER! Traditional Mexican food- the carne asada plate is a must try, but if I just want to nibble sometimes I go for a rice and bean plate to share with chips. SUPER REASONABLE, full dinner aprx $9 a person and you leave full.  ...", 
    "review_date": "2007-11-29"
  }, 
  "tjuyNx0d8PjYXeBcn2nH7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Venessa J.", 
    "review_text": "Best pizza in SF in my opinion!  Friendly staff, great locals, this spot can't be beat if you're looking for a relaxed dive bar with great pie!", 
    "review_date": "2014-04-12"
  }, 
  "vTbQZNz8FH4jcrni7Vkl1Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oleg H.", 
    "review_text": "Friendly, towny vibe  decent selection pizza  ok beer selection of decent beer  a pool table   and overall good times =D   this place is a solid 3+ possibly even a 4 - i guess ill need to update the review after i go back :)", 
    "review_date": "2012-04-17"
  }, 
  "s34YzoiIo4l-6lqBOy0R0Q": {
    "user_rating": 5.0, 
    "user_location": "Reno, NV", 
    "user_name": "hubei m.", 
    "review_text": "Awesome thin crust Pizza, Great beer selection, decent priced Pizza (under $20.00) beers $4.00-5.00. could be cheaper, Hard to find parking but not impossible (welcome to SF)", 
    "review_date": "2013-12-25"
  }, 
  "XhCwjW4ZyN56gUl-ju5QPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "amanda k.", 
    "review_text": "We call this place \"secret pizza\" but it looks like the secret's out. They have some of the best pizza in the city, and that's a bold statement! Along with that comes pitchers of beer, a pool table &amp; an outside area? Oh did I mention its dog friendly too? Yes, it can be a little rough around the edges, but it's an effin bar! With amazing pizza! And dogs!", 
    "review_date": "2014-10-12"
  }, 
  "QKbq76KuUHLRZjWXDtbwWQ": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jess R.", 
    "review_text": "Whoa, Jay'n Bee Club...  Are you OUT OF YOUR MIND?!?!?  What on earth is wrong with you?!  I've been coming here regularly for the past year and a half or so, since I moved two blocks away.  The bar was always okay, but it was the Mexican food that kept me, my friends, and the large majority of your clientele coming back again and again.  Tonight I arranged for four friends to meet me there who had never been there, and all who had to travel fairly far to get there.  I hyped up the shrimp nachos as if they were made by the Baby Jesus himself.  I got there and a friend pointed at a small green cardboard rectangle and said, \"Is THAT it?\"  I glanced and said, \"Ohhh, no!  They have a huge menu with lots of choices...  You usually just stick your head in the kitchen where a really sweet old lady gives you some menus, then brings out chips and salsa.  It's the best.\"  When I went to the kitchen, there was a white guy cooking burgers.  Wait, what?  Where am I???  I said, \"Hi, uhmmm....  Do you have any menus?\"  He says yeah as he reaches for more of those small green cards.  I asked what happened to the other menu.  He said, \"Oh we don't serve that food any more.\"  He handed me a menu filled with ...  Burgers, Bacon Burgers, Turkey Burgers, French Fries, Onion Rings...  You know...  All the shit food you can get every where else.  Oh, but the only things that seemed like they might be good, Fish n Chips, Calamari, ...  they were out of.  I had to break it to my friends that this was no longer the establishment I once knew.  So we left and went to Cha Cha Cha.  The food here was the only thing that had people freaking out for you!!!    Your new menu, for lack of a better word,.... SUCKS.", 
    "review_date": "2009-03-09"
  }, 
  "1rfBjfB_1KQP_BslqE5zxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole J.", 
    "review_text": "This is a perfect neighborhood pub. There is nothing I would change about this place, except for making beer free. It's relaxed and open, with a back patio and friendly bartenders. It's just the place to go when you want to hang out and eat great mexican food in a pub environment. You can actually talk to your friends while downing pints.", 
    "review_date": "2007-07-27"
  }, 
  "GPw7iCFBMga1pH6Eamrgpw": {
    "user_rating": 5.0, 
    "user_location": "Santa Ana, CA", 
    "user_name": "David H.", 
    "review_text": "Ever since the GF and I decided to go to visit friends in SF she's been telling me about this place where she got the best tacos and most incredible carnitas nachos ever.  She just couldn't remember the name.  So my friend picks us up at the BART station and drives towards his house.  We talk about the last time I visited and the places we ate.  I said there was this great little place that we had good drinks at and ate some pretty good mexican food.  We just couldn't remember the name.  The GF points across the street at the classic, old Jay'n Bee Club sign and says \"That's were we get the tacos\" right as I point in the same direction and say \"That' the place we ate at\".  The Jay'n Bee has been memorable in the past (the tacos and drinks were so good we couldn't remember the name).  And it didn't disappoint this time either.    It was a beautiful sunny San Francisco summer day.  We had already had bloody marys at Zeitgeist.  We needed some tacos.  When we arrived there were only two other customers.  We claimed a patio table, went back in to order a round of margaritas, and put our taco order in at the window.  More friends showed up.  More drinks were ordered.  More tacos and nachos were ordered.  We spent almost 3 hours eating and drinking.    Everything was excellent.  Marta makes great food.  The bartenders pour good drinks.", 
    "review_date": "2008-08-05"
  }, 
  "30MGqoQBmgZ1e8K2T_jNHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "angie b.", 
    "review_text": "i heart you jay'n bee!! your salsa too.", 
    "review_date": "2007-08-05"
  }, 
  "MzXPOK2_T5O8GF-4qUVmGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica M.", 
    "review_text": "A quintessential neighborhood bar...  Bartender remembered my drink of choice after one visit over a week later.  Serious.    I'd been told by a friend that the pizza here is his favorite.  I thought this was ridiculous.  SF is home to some of the best pizza in the country.  But I'm always game to discover more of a good thing, so I agreed to try a pie.  What happened...  Having already had dinner I suggested we get a pie to go, &amp; then have it for breakfast the next day.  The true test of great pizza (&amp; Chinese food) is how good it still is the next morning.    My expectations were not very high.  Again, this is not my first rodeo.  The following morning I was running late &amp; could only take a couple bites of it as I was out the door.  I didn't even have time to heat it!  I haphazardly wrapped a couple slices in a paper towel w the intention of eating them in a somewhat civilized way when I got to my destination.  That went out the window fast...  It was so good, I scarfed it all down, as I was driving, on the freeway.  Cold pizza.  Yeah.  Totally delicious.    The pizza here does truly rock.  All of them.  My last visit I ordered a margherita &amp; asked them to add prosciutto.  Home run.  Thin crust, great sauce.  Trust.    The menu is entirely pizzas &amp; salads, w the exception of meatball or Italian sausage sandwiches.  So they totally accommodate bringing in outside food if that's what you're feelin at the time.  When I found out that it's ok to bring in outside food, I brought in Wise Sons Deli, &amp; they inquired what looked &amp; smelled so good.  Nice peeps.  There's a patio in back.    Tunes crush it.  Their iPod.  If you like a song &amp; want to know who it is, &amp; your Shazam isn't gettin it, just ask.  They also happily take requests.  The parking bites.  But that's par for the course in SF.  A neighborhood bar w personable &amp; efficient staff, way above par food, &amp; outdoor seating.    4 stars.", 
    "review_date": "2014-12-11"
  }, 
  "LAzQ5rSsny0u8nVeiRwSgA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janet F.", 
    "review_text": "When they first opened the kitchen and none of you  were going there it was great! Nice that they're doing well but you ruined it.  Crowded. Noisy. Guacamole was not fresh. Food took too long to get to the table. None of these things were true when it was fresh and new.  and \"patio\"? from what I could tell only one or two tables can fit there.", 
    "review_date": "2008-08-17"
  }, 
  "GXSbU3uyKGEYsz0gKJ95iA": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Ian S.", 
    "review_text": "Best neighborhood dive bar, with great pizza and great service. Seriously, these guys are awesome, even to people trying to drink on crutches. Come in to watch a game, grab dinner or hang out on a weeknight.", 
    "review_date": "2014-01-22"
  }, 
  "2p5MWSzQZv1kkYwix7Hujg": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "N C.", 
    "review_text": "Love the Jay'n Bee.  Strong drinks at a fair price, pool table, back patio... done.  They used to have excellent (but very very slowly served) mexican food, but they've switched to a more typical bar menu.  The fish and chips are stellar, the burger was just okay.  The bartenders are great, and not snarky (as in Zeitgeist.... you know what i mean).", 
    "review_date": "2009-07-23"
  }, 
  "LRMAvc9fGrUR5riqTA5TPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "P-nut K.", 
    "review_text": "I like jay bees because they have outdoor seating and you can get food if you want. They also have heat lamps outside whichmakes sitting outside actually an option.  The inside is lame and loud but the patio area makes it a great little find. one of those perfect little mission spots....", 
    "review_date": "2008-01-11"
  }, 
  "F3-Etluf7r4_1h651kvweg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ciara W.", 
    "review_text": "i don't want to be accused of being prejudiced just because Jay'n Bee's happens to be the closest bar to my apartment, but this place is great!  (And i don't usually use exclamation points!)    Here's a few reasons why you should go, if you haven't already, in no particular order.  Jay'n Bee's has great prices on beer ($2-$6), wine ($4-$6) and mixed drinks, and the service is typically quick.  The guys behind the bar (yeah, Mike and James!) are friendly and accomodating.    And the pizza...well, you'd think you'd be getting something gross and pre-made, like you do in most divey bars, but Jay'n Bee's makes theirs delicious and fresh.  There isn't a huge list of ingredients, but what they have is really good.  Watch out for the peppers--they stock a particularly hot brand  So, even though I don't really want to share, I want you to go to Jay'n Bee's, if for no other reason than I want the place to stay in my neighborhood.", 
    "review_date": "2011-02-24"
  }, 
  "UdRwlfVkEmgWCfDQZqd6KA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "David W.", 
    "review_text": "You'd think this place was owned by two people from Thailand because it is so \"Nguyen, Nguyen!\"  As noted, it seems like forever \"Happy Hour.\"  Priciest beer on the menu is a Guinness for $4?  I mean, it's actually hard to goto another bar at this point with those prices.  I had a Maker's on the rocks for $5.    They're making pizzas, which are really solid, and this comes from a guy who knows more about pizzas than I do my own body temperature.  I've lived in the city for 5 months after being in NYC most of my life.  Again, they make good pizzas.  Pool table?  Check.  Backyard area?  Check.  Jukebox?  Check.  Bartender willing to \"put the game on?\"  Check.  If there's ONE thing about the bar which could rub people the wrong way it's that it's VERY chummy.  The owners and patrons have known each other a long while (not everyone, but an obvious crew), so if you're in there say on a Saturday afternoon you might feel like you're not in on the joke, or that it's a more a Social Club.  Which is fine if you're into that, and I am.  I'll take \"chummy\" over fix-geared hipster any day.  And those are limited too, which is also nice.  Nothing quite like a brand new SF Giants fan who walks in during the 3rd, and out in the 7th...  It's a bit off the beaten path, but I walk there from Guerrero because it's WORTH it.  I am told they're not open on Sundays, but they were on the Superbowl.", 
    "review_date": "2011-04-05"
  }, 
  "qpqvJqq_CoG7_vyOeGt8kw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sabrina r.", 
    "review_text": "Hard to express how much I love it.   But I can give a somewhat illustrative example of why-- if you go here, the bartender, without fail (but not without a little prompting), will whip out his circa 2004 samsung flip phone to show off camera photos he's taken of his overweight cat in a tee shirt, and he will emote very loudly about it.", 
    "review_date": "2011-05-02"
  }, 
  "GVTfB_FHFcgBAN1NxjWYlw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jacqueline S.", 
    "review_text": "Delicious Pizza - Green Mo' has so much Spinach on it, which makes it really healthy.  Also endless garlic, so bring mints if you order this.  The waitress had some swagger - really friendly, shared her Doritos with us.  Classic selection of beer. You won't be disappointed.  If this bar were a woman, she would be super down to earth, friendly, wholesome. She is your best friend, but could also be an amazing lover.", 
    "review_date": "2012-11-01"
  }, 
  "PneFv0XPJjK7hOVcCpsWlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MissNance R.", 
    "review_text": "When the thermometer rises above 75 in SF, I'm all about being outside...or  drinking outside, that is. Thus, the quest for outdoor seating begins.. Zeitgeist? Too crowded. Medjool? Full of Marina people slumming it in the Mission.   Then a little gem like the Jay'n Bee comes to mind. Cool, unassuming place off the beaten Mission path..has a patio, good beer on tap, Mexican food, and man-sized Dewars on the rocks for $5 all night (Thanks for the tip, Scott W).", 
    "review_date": "2008-07-10"
  }, 
  "aX77UpDrZHPlxWxQJaXW-A": {
    "user_rating": 5.0, 
    "user_location": "Winnetka, CA", 
    "user_name": "Gary K.", 
    "review_text": "This will be the most honest review of this place.  These guys are jerks and if you dont have a thick skin, then you are going to get offended.  If you can handle jokes.  If you can handle laughs and enjoy a beer, then get some good ol fashioned San Francisco Mission hospitality.  You will enjoy this place.  These bartenders may seem scary, but they are legit.    p.s. they play the best  music.", 
    "review_date": "2014-02-25"
  }, 
  "TKNihC283vzIvVQS8JE3cA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael W.", 
    "review_text": "Went here recently for lunch. Great Fish &amp; Chips and the Cobb Salad was amazing!", 
    "review_date": "2009-12-18"
  }, 
  "GfB6sC4NJQvSI2ewbQrDNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitch A.", 
    "review_text": "Yo, the Jay'n Bee rules.  It's a low key dive around the corner from my house.  They even have a back area where you can hang outside.", 
    "review_date": "2007-10-30"
  }, 
  "YDelRDHO4JkuZwWV7law1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda P.", 
    "review_text": "If you are looking for some delicious, home-style Mexican food at a casual spot, step into Jay'n Bee.  Despite the slow service, during which you can down a couple of thirst quinching margaritas, the food is consistently tasty.  I would not recommend ordering tamales because the three times that I had requested them as part of my combo plate, I either was notified that they ran out or got something else in place of it.  It could be my luck, or tamales are a hot item there.  I hope to try them some day.  The food takes a while to appear because everything is cooked from scratch, even the tortilla chips are real.  This is definitely a regular Mexican restaurant/bar for me.", 
    "review_date": "2007-12-26"
  }, 
  "FAkhKPwC4eWrM9enHZoYQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A. M.", 
    "review_text": "On one hand, I love this little gem of a neighborhood dive. It's got a decent selection of beer (though not as cheap as some other Mission bars), excellent homemade Mexican food, and an aweseome back patio that can sometimes feel like it's all your own.   On the other hand, I hate that Yelp has blown up Jay'n Bee's spot. Try going there on a Friday night now, and it's full of randomly big crowds (who I assume are different work groups from around the area) who stay way too long and take up all the seats!   I know, I know, call the waaambulance, a bar is crowded on a Friday night. But Jay'n Bee used to be all mine, and I hate sharing. I'm happy for the bar that they are doing well, but I enjoy some space and a nice, intimate outdoor drinking alternative to Zeitgeist (with clean bathrooms too).", 
    "review_date": "2008-04-26"
  }, 
  "b4sh3USeRiUQJY3y83b12w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ali K.", 
    "review_text": "What a pleasant surprise. It's like a local neighborhood bar mixed with darn hot and good mexican food.   We walked in to find a yuppie couple and their two kids eating dinner, a young couple chatting over beers and nachos, old men playing pool and speaking in spanish, and a mix of random locals and urban hipster scattered here and there.   I felt right at home. After the food came, however, I truly understood why this place so was damn popular.  The carne asada was very moist and reported the best in town by my meat loving man. Their enchiladas were super delish. And the salsa... to die for. I also liked the fact that they served their margaritas in very large glasses. Order just one unless you want to stumble home.  Check this place out. And don't fret. Weekdays are not too busy.", 
    "review_date": "2008-05-11"
  }, 
  "Tohm6m3FHtTm9jUFMDjDTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen P.", 
    "review_text": "Love this place! Friendly staff, simple place, delicious fresh made pizzas, nice drinks, relax atmosphere, patio! ... Great neighborhood place.", 
    "review_date": "2013-07-16"
  }, 
  "2D_SPKmRSJwfBKJrEKzaGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dawn a.", 
    "review_text": "this is a great neighborhoody bar.  small, loud, a bit dirty and cheap.  great servers, they know you by name and remember what you like.", 
    "review_date": "2008-10-21"
  }, 
  "BUrOSbugPe9TZPxuHhdVHQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon S.", 
    "review_text": "It does the trick.  There's beer, pool, a back patio, and sports on TV, that's exactly what I need in a neighbourhood bar.  Added bonuses are the ample space, generally good music (though last time I was there Sheryl Crow got played twice), and a friendly crowd and bartender.", 
    "review_date": "2009-05-25"
  }, 
  "edjCqHXkLzdJPeQexLTJuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary S.", 
    "review_text": "This is a good bar to hang out with friends. The drinks are pretty good. But it depends on the bartender.  I would not advise to eat there. The food is not good.  I would suggest El Metate instead if you want some good and cheap mexican food. It is only 3 blocks away.  Update: they changed the food menu now and may be it is better, but I have not tired it.", 
    "review_date": "2008-03-18"
  }, 
  "pBAnCaacZRtk1PWtjPANAA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John T.", 
    "review_text": "Some times my television will talk to me. It tells me things. Special things. Like, vote for Barack Obama (Any show on MSNBC). Hookers are funny (Rock of Love 2 - VH1). You're a fat asshole who will die alone (The Biggest Loser - NBC). I could use a \"freak chair\" just like the one 50 Cent has (Cribs - MTV).  99% of the time, what the magic box tells me goes in one ear and straight out the other. But when \"Check Please Bay Area\" told me I should go eat and drink at the Jay'n Bee Club, I listened. This time, they were completely right. I had 3 margaritas, watched the Warriors lose, and consumed probably the best burrito I've ever tasted from Marta's kitchen.   There was an old man sitting by himself at the window table. He didn't say a word the two hours I was there. He just sat there, with a plate of what looked like enchiladas in front of him. I kind of felt sorry for him. But then I thought, if there's a place like Jay'n Bees around when I'm his age, that wouldn't be so bad. 5 stars.  Sorry, but I have to cut this review short. 'Rock of Love 2' is coming on in a few minutes. Hookers are funny.", 
    "review_date": "2008-01-30"
  }, 
  "a9H5BN_lXZfUtezq1A97pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "Neighborhood dive bar.   Pinball - Check Pool table - Check Sports on the TVs - Check Good selection in jukebox - Check  Here is the biggest surprise. Some of the best pizza in the city is made at Jay'n Bee.  The Joe Formaggio is my favorite pizza.  My only fault with this place is the cocktail making skills is lacking. If you want a great Manhatten this is not the place to go.  Stick with beer and wine.", 
    "review_date": "2011-09-11"
  }, 
  "qijOkAHJs4Hx8yJ9pw68vA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D Z.", 
    "review_text": "This is an easy, straightforward, unpretentious, casual neighborhood bar where the drinks are strong and inexpensive. The owners and people who work here are really wonderful. It's easy to throw a party here or invite a relatively large group of people (say, 10). I think the food is fine; nothing remarkable. I would come here for the drinks and the local-bar feel and eat somewhere else either before or after. The place is drafty. Bring warm clothes. ;)", 
    "review_date": "2013-07-07"
  }, 
  "RrgD2R5QWTnviDEIZdBXLA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ravi P.", 
    "review_text": "A perfect neighborhood bar hidden in the outskirts of the Mission.  While I've only been there a dozen times each one has been a pleasurable experience.  From jam packed birthday celebrations on a beautiful summer day to 'just the locals' on a Monday each time has been great.  The bar is accompanied by a separately owned Mexican restaurant (separate check from the bar tab).  I've only managed to eat the 'super burrito' which is so delicious I can't bring myself to try anything else at the moment.  Please note: this is a neighborhood bar.  With that comes with quirks that you learn to know about, accept and love.  There is a pool table, patio, and turntables are setup at the end of the bar though I've never been there when someone was DJ-ing.", 
    "review_date": "2006-11-03"
  }, 
  "n2PcO9RwXNgFmuJGv3sXTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gym W.", 
    "review_text": "Ain't nothing wrong with the Jay'n Bee. Bartenders are always quick with the drink and they make a good margarita. Good mixture of locals and after-workers of all collars. No douchebags that I've ever seen.  I've only eaten here once and it was fish and chips. I was hoping for a seafood scramble type deal, which they don't have on the menu, but the bartender offered to have them throw in some shrimp for a small upgrade. When it came it was a HUGE order of F&amp;C with shrimp. Three minutes later another basket of enormous shrimp came. Almost made myself sick trying to eat it all. But it was goood.", 
    "review_date": "2009-06-18"
  }, 
  "IDspjqSUCso9kzl5ctZMtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jen h.", 
    "review_text": "Laid back neighborhood bar which happens to be in my neighborhood!", 
    "review_date": "2011-08-02"
  }, 
  "Ciqk6VFl3Qn0t_r1mOcGHQ": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Jocelyn J.", 
    "review_text": "Pool table....patio....cool bartender...nice in the afternoon.....and pretty good burritos.", 
    "review_date": "2008-06-16"
  }, 
  "Bqx48CAa9GqoyPi4Nmdp-Q": {
    "user_rating": 4.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Kristin B.", 
    "review_text": "Great place! I loved the bartender, so funny! Didn't get a chance to play billiards, but definitely a plus!  Women's restroom was also very clean, even smelled good.   It was hard to get past the exterior though, pretty shady looking, but great once you're inside.   We had a thin crust cheese pizza ($10), a large was almost enough for 2.", 
    "review_date": "2011-07-14"
  }, 
  "pDzGkWfeq_Bf6piSTQqnnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley F.", 
    "review_text": "I love this place.  It is the kind of bar where 'everybody knows your name' with good drinks and food.  Great thin crust pizza for a great price plus cheap pints and a pool table. This is my new neighborhood joint (just moved in a block away) and I will keep coming back!", 
    "review_date": "2012-08-08"
  }, 
  "zaIr4I0cjLR8w_0AIJJdDA": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Rocky C.", 
    "review_text": "Great, cheap drinks; perfect for happy hour with co-workers.  Chill vibe, free chips and salsa, and no yuppies!  Delicious nachos!  Can't wait to order more from their bar menu.", 
    "review_date": "2008-10-17"
  }, 
  "_w1VPGRQ57sFIyNg0PXS3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seiji C.", 
    "review_text": "the owner's generous  there's food, drink, juke, patio, pool, and SPACE. that's about it.", 
    "review_date": "2007-07-03"
  }, 
  "bA6sFAZTIc5ddwpnB_WJUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gil S.", 
    "review_text": "A fairly generic pub, but in a good way -- everything is cozy and comfy, a little on the loungy side but not edgy or hip.  Good neighborhood-y vibe on a weekday.  Nice back deck.  The jukebox selection is quite broad (reggae, jazz, oldies, alternative, etc).  Reasonable drink prices.    And then there's Marta's kitchen.  Real Mexican food in a pub atmosphere -- as opposed to a pub that serves Mexican-themed snacks.  How cools is that?  Well, I've got to say California microbrews and Guinness are not a good match for enchiladas -- they have Tecate on tap.  Service and kitchen is a little slow but very sincere, everything cooked to order, and a pretty ambitious menu of Mexican steaks, prawns, lobster.  Pricing was a little inconsistent and two steps higher than the taquerias, but still in the moderate zone.  Free chips and salsa of course.  Salsa was a little watery and bland, but homemade and fresh.  Chips were very good, very fresh.", 
    "review_date": "2006-03-07"
  }, 
  "-Cus770i5pweQ4-tUOeRwA": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Nomad T.", 
    "review_text": "Pizza ($12) and a legitimate IPA draft ($4) were both satisfying. I only ate 3 of the 8 pieces of pizza - it only comes in one size. Basketball on the TV, plenty of people for a Tuesday. I read at the bar and felt comfortable. Seems like it'd be a good place to meet people if you felt so inclined. Server/bartender was friendly and cute. They reported they are only closed on Sundays. Atmosphere was lively without being annoying. Will go back.", 
    "review_date": "2012-06-19"
  }, 
  "tx407EtvKoXXEZqYQFQVJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff M.", 
    "review_text": "This is an awesome neighborhood-type bar.  There's a nice long bar with a good selection of beer and liquor, a handful of tables scattered around the room, a pool table, and a very pleasant back patio.  There's a full kitchen with some great Mexican food, and the people who work and/or drink there are awesome and friendly (almost eerily so in some cases, such as the guy who offered to whore his sister/girlfriend out to me).  It's also one of the few places that reaches that perfect balance between dead and packed on the weekends.  No one wants to be alone in bar with three drunk frat boys and a sullen 70 year man with a permanent whiskey face, but fighting through hundreds of Kilowatt hipsters at 11:15 on a Friday night is no picnic either.  At Jay &amp; Bee, there'll be just enough people around to feel like you're really out, but there's enough space to comfortably hang out with a couple of friends for the night.", 
    "review_date": "2007-10-05"
  }, 
  "9byOhSKRB3kJywi3KxjtPw": {
    "user_rating": 3.0, 
    "user_location": "Placerville, CA", 
    "user_name": "Emma L.", 
    "review_text": "One star for good food most of the time, one for the fact it is close to my friends house, and one for the fact that they have a full bar...otherwise, I refuse to go to this place because the service is ssssssoooooooooo sssssllllllllllloooooowwwwwwww and bad!  It's fine, I get it, they are a family joint, but really they need to try talking to their customers or taking a class in Hospitality because they really don't know how to give even standard service.  So it's up to you.", 
    "review_date": "2008-05-31"
  }, 
  "0XtSLQ7YjY57p_ZVPsdTWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rama S.", 
    "review_text": "Ahhh the JBC. My fav neighborhood bar. The new pizzas are bomb!!!!!!!", 
    "review_date": "2011-03-17"
  }, 
  "mROok9JZx19AwvOJlI8FHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art O.", 
    "review_text": "Why am I Yelping about one of my favorite bars in SF? It's not like I want to see this place overrun with hordes of hipsters or anyone else that'll lessen the near perfectness that is Jay'n Bee.  Alas, this bar will probably hold it's own since it's a bit out of the way from the main corridors of the Mission. So I'm not worried, much...  I love the combination of simple yet great Mexican food, a wide variety of drinks, friendly bartenders, and an outdoor patio. The place has a pool table and although I haven't quite figured out how the jukebox works, the bartenders have played some great music everytime I've gone in there. One of them likes to play ska! Oi!  Jay'n Bee has a relaxed vibe with people that know how to enjoy a bar atmosphere - i.e. no chodes posing around trying to look relevant.  Everything just seems to fit into place here.   Really, what more can you ask for?", 
    "review_date": "2008-01-28"
  }, 
  "EC9M2c7CDBaACDnn3Rtzgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tristan H.", 
    "review_text": "best Enchiladas de Camarones ever.", 
    "review_date": "2007-08-07"
  }, 
  "OwrbY4L1qgtA1857zqkP0A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael D. R.", 
    "review_text": "Maria is gone, but the good ole bar is still there.", 
    "review_date": "2010-06-24"
  }, 
  "2o6x7CL7q1OA7FSwLJ8kog": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trevar M.", 
    "review_text": "Good vibe, and a great outdoor area to hangout. The drinks were cheap, but down right bad. Too much booze, not enough balance. If you're looking to get crooked on the cheap, then this might be your spot. I prefer a well mixed drink over a glass full of booze, with a splash of mixer.   I did have a couple tacos, and they were delicious. I would give a 2 based solely on the mixed drink factor, but the vibe and food pushed the needle up to a 3.", 
    "review_date": "2008-09-28"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "Probably one of the best pizzas I've had in SF, and lots of variations on an original theme. Reasonable prices and solid, strong drinks, plus cold, cheap beer. Tried to plan a birthday for a friend here, but by the time we showed up around 8PM, the place was absolutely packed.   The pizza IS really good, thin crusted deliciousity comin' at ya. The thing about J'n B that's unique to me is that it has such a divey ambiance, and people drink hard here, probably more than they eat, it's just not really a place I would expect such bomby pizza to come from.   Though usually overrun with regulars and locals, J'n B is welcoming to new folks, the bar tender has chopped it up with me and my friends on multiple occasions.", 
    "review_date": "2014-04-02"
  }, 
  "2GWtMCz30JwBuD8unlCksw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya T.", 
    "review_text": "Best thin crust pizza in the city. Hands down.   Nice low key bar, good beer, back patio, giants on TV, Pizza that is so good you will shit yourself.", 
    "review_date": "2011-09-12"
  }, 
  "Lu8y2ayxVlAzuJEVfVcH4w": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Rebekah T.", 
    "review_text": "After living in the neighborhood for years, Jay'n Bee has always had that local bar feel. I had not been here in years and was asked to arrange a get together at the bar for my coworkers before the holiday season.   We called and mentioned we would be coming by, not that you need reservations but as a heads up that our large group would be coming in. They are cash only, yet have an ATM for your convienance.   We ordered a couple pizzas and a couple large salads. They came out pretty quickly and I was impressed by the quality of the pizza. Everyone enjoyed the food and drinks, had a great time.   It's nice to see that Jay'n Bee still has it and I'll be back for more.", 
    "review_date": "2013-01-02"
  }, 
  "T8B4eFdcwg9fB2jOTI3UBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roberto M.", 
    "review_text": "Been going to this spot for a while my GirlFriend loves it and she's love it for the past couple of years. Their Pizza is amazing (coming from a NY boy) and their drinks well...they get you drunk, what more can I say. I was there tonight and met Nygel (Alfredo one of their bartenders) and he was amazing! Now  I have to say I will be going there not only b/c my GF loves it but because I have found my new favorite bar!", 
    "review_date": "2013-07-14"
  }, 
  "eOdD6ya6Kg1qcWjLTjti4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bonnie P.", 
    "review_text": "thanks for being such great neighbors! i work around the corner at asiento  (a bar) , and love having a great bar with awesome food and cool people nearby. the guys here are great and the pizza is DELISH.", 
    "review_date": "2012-10-09"
  }, 
  "WyqYyLV9UxX6dM_y_rX_Kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine Y.", 
    "review_text": "Attended a farewell party here and as I walked through, looking for my friends, I was pleasantly surprised to see a patio at the back of the pub where the party was.  Really enjoyed the thin crust pizzas, they were all great with a glass of beer.  Prices were cheap and found plenty of parking on the streets. Really like the neighborhood too.  Will go again if ever in the area.", 
    "review_date": "2013-09-30"
  }, 
  "Uju5Rl-AMBKSd82f3T_kUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cindy p.", 
    "review_text": "Hell's yeah.  I love this place.  It's typically a very mellow backyard sitting margarita sipping kind of place.  I've loved every bartender who's served me and the mexican food is really great.  About that food... don't go in there with your hypoglycemic fit. It takes seemingly FOREVER to get your food.  Apparently they make everything from scratch.  It's worth it.", 
    "review_date": "2008-05-30"
  }, 
  "RMPtZAzjq57FTfQSE9Gglw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Junior J.", 
    "review_text": "My faith in The J&amp;B has been restored completely!!! After a few weeks of no longer wanting togoI read on yelp today that they had fish n chips and calamari. I have to say I was truly blown away.The service was outstanding I was greeted by a nice likeable young lady.I ordered the calamari I have to say I used to have to travel all the way to Fishermans Warf for this treat.I am glade that I no longer have to their calamari was on par if not better than Alioto's or any other resturant down there.I believe the new atmosphere in the bar is great and will be going many times a week as I had in the past.", 
    "review_date": "2009-03-28"
  }, 
  "1Tg1ehCx7tgq7U3d2mG3Cw": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Thuy M.", 
    "review_text": "True neighborhood bar. We came here before heading over to support my friend's showcase at Art Explosion. The pizza here is the best I've ever had. A strong statement, I know, but it was so amazing to me... I ATE half a whole pizza- true fact!! Why is this better than Toto's or Costco or that pseudo thin crust NY style pizza I had at NY NY LV?   The key thing that did it for me was the fact that the pizza was doused in extra tomato sauce. Anything tomato-ey wins me over, hence my profile name.  Toppings- fresh and not abundantly greasy.  The flavor- never bland The crust- on the thinner side, I don't like it thick. Just enough to enjoy all the toppings without getting too full from all that unnecessary flour.   The guys behind the counter are really personable and chit chat with you for a bit. They are very welcoming and are really observant with who comes and goes. Beer and pizza were all under $25. Cash only. I rave about this place to all my friends and will definitely bring them in. I'd love to see this place stick around foreverrrrr.", 
    "review_date": "2011-07-05"
  }, 
  "gPDqEiZXqh9WzrM60Z94hw": {
    "user_rating": 4.0, 
    "user_location": "Vega Baja, Puerto Rico", 
    "user_name": "Bombiz V.", 
    "review_text": "Good place to just have a beer and relax. Place has been around since I was a kid riding my bike in the hood. Good to see it has changed but not to much.", 
    "review_date": "2013-07-12"
  }, 
  "FN__lFwA6r2MtH9jdbVnQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayni R.", 
    "review_text": "couldnt find a bodega so wandered in one night with my man to grab a quick little taste of tequila. ended up staying for hours. we thought it was our own hidden gem, until everyone i tried to share it with already loved it.  they have a kitchen open pretty late, great bartenders, and enough space that you dont feel like you're fighting for your place at the bar.", 
    "review_date": "2006-07-13"
  }, 
  "C5yqtVykXl914oGX-KAkwQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suyog D.", 
    "review_text": "Not a good experience. The drinks seemed over priced and mixed very weirdly - Long Island ice tea wasn't nearly like what it should be. The worst part - they don't accept cards!! Food options were limited and the ambience just seemed bad.", 
    "review_date": "2014-12-18"
  }, 
  "3Ttx_EwurF4tVRn723SIjw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "LaSha G.", 
    "review_text": "I was looking for a dinner and drinks place to hang out on a Friday night, before heading over to Mighty, and Jay'n Bee Club did the trick.  It's in a pretty quiet part of the city, and if I hadn't found this place on Yelp, I'm not sure I would have ever made it over here.  This place is a solid notch above your local dive bar, but still has that local watering hole feel to it, with regulars and bartenders that are real characters.  The margaritas were good, the music varies because of the jukebox, and there's a cute back patio area with \"a\" heated lamp (yes, just one).  My favorite part of the night, was the food.  My friends and I ordered enchiladas and tacos, and our orders came with rice/beans/salad, with complimentary chips &amp; guacamole.  The food is a little pricey but prepared to order (I watched them make it) by a small team of Mexican women in the back kitchen and it tastes very much homemade and it's not greasy.  I finished everything on my plate and wanted more...so I would say the portion sizes are decent, but if you're hungry, go with two enchiladas instead of one.    We arrived at 8pm and staked out a table for about 30 minutes...so I would suggest going early or going at 10pm when it clears out again and seating is more available.  Also, if you want to order food, you get a menu and order your food at the kitchen door and they'll ask you where you're sitting and bring your meal to you.", 
    "review_date": "2008-06-08"
  }, 
  "icsYa1K8YKgu3wzLefwYWA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leslie S.", 
    "review_text": "If I could give negative stars I would! Asked if they served food last night and got an extremely rude answer from behind the bar:  Husband: are you guys serving pizza Guy behind the bar: pizza! What are you f*ckn stupid- we don't serve pizza after 10   Enough said!", 
    "review_date": "2014-12-14"
  }, 
  "wQdr_MqZs1tD6Iahp8w5zw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gurpreet S.", 
    "review_text": "Lovely little neighborhood pub. Great pool table, friendly service, and not too heavy on the pocket. Grabbed a few beers here, as we were exploring the neighborhood. Managed to play a few games of pool as well. It was fun to play and meet some random strangers. Nobody was really great at the game, which didnt make you feel too bad when you missed sitters.   Fun place, just a little divey in appearance.", 
    "review_date": "2011-02-20"
  }, 
  "Vel-kfbVyyUbRovliEkqwA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kris m.", 
    "review_text": "really?  4 stars thus far?  the margarita was pretty effing good, (a bit pricey).  other then that i really don't see the appeal.  we waited over an hour for our food on a night that was very slow. when the food came it was subpar.  the chile relleno was all egg...yuck! and the cheese enchilada was pretty bad.  the sauce did taste like it was from a can...very watery.  i grew up on homemade mexican food and this isn't it.  they missed the mark big time, which i am sad to say, because this place has a lot of potential.", 
    "review_date": "2008-08-15"
  }, 
  "8e9yar-mnsfGzOH6ICVJnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica P.", 
    "review_text": "This corner bar has excellent Mexican food!  Not to mention the rockin' jukebox with very random, very excellent albums.  The bartender that is always there when I am is very nice and pours a beautiful sidecar that actually has a sidecar big enough to refill my drink a time or two.   I can't get over the full Mexican restaurant hiding inside this unassuming neighborhood bar.  I had a great chile relleno burrito, and for so cheap!  The nachos are also to die for.  Extra star for the pool table and back patio.", 
    "review_date": "2007-05-10"
  }, 
  "6Mi5woaSUh6gGcLnzLYNfg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan C.", 
    "review_text": "CASH ONLY. But totally worth it.  $6 for a wealthy pour of Macallan 12.  How can you beat that?? Just goes to show this place doesn't over charge at all.  And their PIZZA IS AWEOME.  I moved to SF from the east coast 4 years ago.  This is one of the two places that even comes close to having a good pizza.  Definitely a \"must try\" for pizza lovers!  Very friendly service and very cool employees.  And they also have a outdoor patio for smokers.  Not many places out there that lets smoke and drink at the same time!", 
    "review_date": "2011-06-15"
  }, 
  "oOE6GdVb_4aTC2oufln8WQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zoe s.", 
    "review_text": "great dj's + great dancing + great drink selection + strong drinks + great crowd + patio!!! + = great weds night out.  of course i was there for a bday party so maybe that is why this place was so fun, but i enjoyed it so much i would go back on a non bday night.", 
    "review_date": "2007-08-02"
  }, 
  "hGVB0JBSj1dHCMZSAiHZBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela R.", 
    "review_text": "The biggest plus is that this place is 2 blocks from my house!   The pizza is excellent!  Especially considering how it's only ~$12.  I got the Mo' Green (or Green Mo') once and I actually expected cooked spinach instead of raw, but it was very tasty.  Normally I order a pepperoni, olives and banana peppers and am perfectly satisfied.  Also, they make good strong drinks which are also relatively inexpensive.  Cash only though!    Lasty, the guys that work there are great!  One night we even had a bit of a karaoke thing going on.  So much fun!  It's one of the few places I feel comfortable going to by myself.", 
    "review_date": "2013-03-03"
  }, 
  "yM6heLD8YJjMaA1uEL9-kw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francis B.", 
    "review_text": "Great neighborhood bar with a great burger.  It also has an outside area for those nice evenings.   Come for the company and stay for the burger and beer.", 
    "review_date": "2009-10-19"
  }, 
  "2GXryzNyL-mtQPim79C01g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "goldberg d.", 
    "review_text": "Great chile colorado super burrito!!  Cool spot w/friendly bartender(Kasha). Getting drunk here is fun.  Good food and booze!", 
    "review_date": "2007-08-29"
  }, 
  "dBrSL_PJzwTs0OE_V13CXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dario B.", 
    "review_text": "Alas, even if the fish'n'chips is good and so are the calamari, this place lost its vibe. And I don't even know if I like the white roof top they've arranged in the back: no more sunny days sipping beer in the back.", 
    "review_date": "2009-03-20"
  }, 
  "HTanJi6W59GYXRVBjCHa8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zac S.", 
    "review_text": "great pizza, great bartenders, great atmosphere. easily my favorite bar in San Francisco!", 
    "review_date": "2014-05-08"
  }, 
  "tNhkTYThoBLFddfmH2-BhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave P.", 
    "review_text": "Solid all around - backyard patio, (mostly) level pool table, good jukebox, natural afternoon light, chipped barware, easy access via the 33. Good place to while away a bunch of time. And they've got a little kitchen turning out some fine comida mexicana.  Good thing I live nowhere near this place.", 
    "review_date": "2007-05-29"
  }, 
  "eCfQ8o94H05jCzSSmCnakg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kristen v.", 
    "review_text": "This place is awesome, especially if you're past the hipster age. The bartenders are friendly, there's room to sit down and it's walking distance from my house. It's a great place to go with friends as it's definitely not a meat market. My only complaint is that there's only one stall for the women's bathroom, so expect to wait around crossing your legs before you can go in.", 
    "review_date": "2007-06-18"
  }, 
  "Rzjbl7-yV5anedZmJbbavg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Catherine K.", 
    "review_text": "Came here this past weekend for a friend's birthday shin-dig and was very plesantly surprised.  It was super chill, drinks were cheap, and they serve food late.  I did not order anything (which was simply poor planning on my part), but everything I saw coming out of the kitchen looked and smelled really good.  They had a cool jukebox, a good sized patio, and a pool table.  It never got too crowded, and it was just a laid back vibe all night.  It was a good, brisk walk from 24th and Mission BART, and if we hadn't gotten turned around (due to my craptastic sense of direction), it wouldn't have been bad at all. Thank goodness I wasn't wearing heels.", 
    "review_date": "2008-03-12"
  }, 
  "vEKjnpd8c5VBjsmWp_O-8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ivy P.", 
    "review_text": "Ditto pretty much what everyone said here. Space is kinda small with limited seating, but it makes for an intimate setting. Came here on a friday night- the crowd was a little older with folks who came to have a drink and chill out after work. There were two tv's that were playing the Celtics/Min game..damn you Celtics!!! Like other people have said, the service for the food was a little slow- it was kind of hard to get the waitresses' attention. But dammit, the food was GOOD. the salsa was GOOD. The margaritas (on the rocks) that the bartender made was yummy and potent at the same time. The other bartender, Mike, was a total sweetheart. Since it's by my job, i'm sure i'll be back.", 
    "review_date": "2008-02-09"
  }, 
  "9zwOfZhh1TIeAWUl3t-3bw": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Greg S.", 
    "review_text": "Newbie to the neighborhood. 1st time to this place. Incredibly good fish &amp; chips + semi-serious wine (Beringer Chard). Friendly staff, attentive service; a solid 4+ in my book.  Will come again for sure....", 
    "review_date": "2010-03-13"
  }, 
  "FJB8GxSqQGMJP4C8GkNm5g": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Ian M.", 
    "review_text": "It's a block from my office so I've been for lunch with my coworkers. Right after we sat down they brought out freshly fried tortilla chips. The lunch specials were cheap and really tasty, there was a good selection of drinks and the staff were friendly and flexible to our growing and shrinking group.  It's now my favorite place to get slightly tipsy in the middle of my work day.", 
    "review_date": "2007-03-10"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "HOLY FVCK  i got 6 drankz for $30.   I did a double take at the bar and had to ask twice for the price. SIX DRANKZ! Okay, it was like 2 shots of Jameo, 3 beers and a glass of wine but still, THIRTY DOLLARS!   yea... but they're ca$h only which is the shit I don't like.  STILL! they're cool.", 
    "review_date": "2014-09-23"
  }, 
  "ShkJlC9pgmoTUEfqCXqFhw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will L.", 
    "review_text": "What are you all smoking!!! This place is completely gross!!!!  And canned enchilada sauce, come 'on!!!! Your killing me.  Two stars for the good margarita and the local feel of the place but for mexican food, go to a taqueria.  This place blows!!!  Might be edible if I was totally f***d up!! Don't believe everything those morons on BACP say.", 
    "review_date": "2008-02-17"
  }, 
  "rygQ9f9YtCb3fdlquavwog": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J B.", 
    "review_text": "I really, really, really wanted to like this place, I swear.  Closes at 2am on Friday and Saturday, but the rest of the week at 11:30pm, which seems sort of early to me.  Brought in a larger group in of non-regulars on a Thursday, and I'm not sure if they liked that.  At first things seems great, but not so much as the night wore on.  The main reason I won't go back is the fact they changed me double on my last drink and when I asked about it was told I was wrong.  How does a beer go from $4 to $8 in an hour?  Too bad :(", 
    "review_date": "2009-07-19"
  }, 
  "4L-5NBEU2BNgwZ2IVuipxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grant W.", 
    "review_text": "Fantastic pizza + a locals spot with pints for $4.50. Absolutely recommended.", 
    "review_date": "2014-04-15"
  }, 
  "0niNpv8X_2I7wIWVWl3ZyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison E.", 
    "review_text": "A good pal of mine suggested Jay'n Bee as a pre-dinner cocktail spot, because her grandpa used to be a regular there.  She told me that it was his place, where he would come to sip on a vodka on the rocks, where everybody knew his name. Having a real soft spot for grandparents in my heart, I wanted to recreate the image of this guy on the bar stool, so I purposely arrived a few minutes early.    Jay'n Bee is my kind of bar. It immediately struck me as a happy place, where the drinks are stiff and the people are happy.  I ordered a pint for $4, and sat and sipped and imagined what this place was like 40 years ago.    I bet it hasn't changed too much- except that the crowd might be younger, a little more lively, and the music might be louder.  The sports games are on flat-screens, and the liquor selection includes every flavor of vodka imaginable. But the sign out front looks original, as does the bar.  And it exudes that friendly, neighborhood vibe.  I wish I would have ordered a vodka rocks.  After my first beer, my friends arrived, and one of them ordered a vodka soda.  I guess it's a slight modification of the original. I left happy, promising myself that if I ever lived nearby, I'd make this a regular spot.", 
    "review_date": "2011-10-17"
  }, 
  "uWIDAK24WCMp5fd1Z8wOyQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kristie h.", 
    "review_text": "best pizza in the mission...maybe in SF...maybe on the west coast.  and the salads are an awesome compliment.  bartenders are friendly and provide a good time.  drinks are strong.", 
    "review_date": "2011-02-16"
  }, 
  "J-YjBamNLgH-Nq4B2iMQ8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ray e.", 
    "review_text": "at the recommendation of a complete stranger, I headed to Jay'n Bee for a weeknight supper. to my surprise, their menu was fairly extensive AND they had chilaquiles!!! i am a sucker for chilaquiles! and theirs did not disappoint. tasty morsels of fresh fried tortillas swimming in a delectable sauce bespeckled with yummy eggs and served aside well flavored beans and rice. the bartender was super nice, the server equally gracious and the vibe was comfy and downright fantabulous! hooray for gems in the 'hood! i am especially pleased at the small but varied beer selection. thanks stranger!", 
    "review_date": "2008-06-04"
  }, 
  "RWZpw8Zo0AMYMV9yboI84g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie H.", 
    "review_text": "I completely agree with all the other 5 star reviews. This place is great- the perfect neighborhood bar. The crowd size is just right, the food is good and cheap, everyone is friendly, outdoor heaters, the list goes on and on... Thank you for being you Jay'n Bee.", 
    "review_date": "2007-12-12"
  }, 
  "MfbJ1lWVma4HJEMQn3O-ZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M B.", 
    "review_text": "Nice neighborhood bar. I like the outside patio (cute) and that it's neither too dark or too loud to hold a conversation....at least the night I went. I hear they do parties sometimes &amp; it gets really hopping, but on a weeknight it was a great chill place to go.  I didn't eat the food (except for some chips and salsa - which was excellent but spicy!) but have it on good authority that it is yummy. I plan to go back and try it - it LOOKED really good.   Drink prices..average I'd say? Neither remarkably cheap or pricey, but I wasn't looking out for any specials, either.", 
    "review_date": "2008-10-15"
  }, 
  "7t_bXok58QFMgNgeM3kNzQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica H.", 
    "review_text": "THIS IS MY BAR! The place to be.  The margaritas are my drink of choice for only $6 (AH-MAZING!) and the PBR is $2 (all day, everyday).  I must say that I am very happy to have a bar (with cheap drinks) in my neighborhood, very hard to find! I am a very big fan and come here quite often. What I like the most about it, is that it is never crowded, I always find a seat when I walk through the doors whether it is at the bar or at the tables.  CASH ONLY! But there is an ATM machine near the restrooms. Outdoor seating, which I have yet to experience, but I will when the nice summer weather comes back around. Music = iPod from the bartenders (i love it!). They do serve food which consists of Pizza now (very good, I was very surprised although I forgot which one we ordered), but the plan is to try every single pizza here! :)", 
    "review_date": "2010-10-27"
  }, 
  "WfcvmH3N5RyhAb-v6NHqPg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "The P.", 
    "review_text": "This place is horrible, you'll hate it.  The bartenders are mean and ugly, the drinks overpriced and weak, it's smoky and full of scary old men.  Just trust me, you'll absolutely hate it.  The food is disgusting.    All right I lied about everything, but stay away anyway.  I hate it when it gets crowded.", 
    "review_date": "2008-06-13"
  }, 
  "LhdIGJbwAgfslLaruuQq3A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rebecca P.", 
    "review_text": "Came here already drunk the other night. Ordered more (dirt cheap!) drinks and then decided it would be a good idea to get dinner too. My group ordered a pizza and a meatball sub and they were both delicious. That mozzarella cheese? Amazing!  My sober self cringed at this decision in the morning; when I think about eating bar food for dinner, I automatically think, \"How dirty,\" and \"I'll be puking blood within 12 hours.\" Not the case at Jay'n Bee, however. Everything was clean and yummy and if it happens again, I won't hate myself in the morning.", 
    "review_date": "2010-12-05"
  }, 
  "f7K7RAwpC5NVQ_oEUg99ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "elly j.", 
    "review_text": "excellent neighborhood joint. back patio, tasty mexican food, pool table, jukebox. i live right next door and go here often for dinner or a drink. my only complaint would be that they aren't always the best for the super fancy girly drinks (my favorite kind), but if you just want a beer or a margarita, or a delicious cheap taco, you're all set.", 
    "review_date": "2006-06-25"
  }, 
  "qUGQGEMATgNWQ0U3sLLC-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ana h.", 
    "review_text": "The Jay 'n  Bee is the best place in the city, bar none!  I come all the way from North Beach just to chill here.  The atmosphere, the staff,  the food!   This place has it all going on.  You always find one of your fellow sf natives in the house,  which always brings back memories of the good ol' days.   Here you can drink,eat, play pool, play the jukebox (the bomb) and sit and smoke in the backyard. (our backyard, to all you transplants, no offense)  On a warm evening, theres nothing like it.   Holla at Mike and Steve, and all the other cool people who make the  Jay 'n Bee the gem  it is.  Peace and Love'", 
    "review_date": "2008-02-18"
  }, 
  "yvr3BGnQVzACGtMw-ucKiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mingus R.", 
    "review_text": "The Kitchen has reopenned as Marta's kitchen serving up authentic Mexican cuisine plus Great burritos at a nice price. This spot has a decent jukebox and occasionaly some one will be maning the Decks. (Although this will happen a lot less with JP gone.) If you're really lucky you might even catch a chump who calls himself Swahilisheen. He can't mix for shit but he has good records!\n Jay N' Bee is the place to go when you are the party.", 
    "review_date": "2005-12-08"
  }, 
  "duymKKwUruH8GwbvcaFd0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene X.", 
    "review_text": "Jay'n Bee was packed on a Saturday night when I showed up after drinking at Yoshis earlier.  As most people have noted, the crowd isn't as young (thankfully) and the drinks are good and reasonably priced.   Didn't have any of the food, but did randomly run into some other friends this particular time so that had to be a good sign.  Nice, chill, unpretentious, low key spot...", 
    "review_date": "2008-01-21"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "i love this place. reasonably priced, great feel, outdoor patio, pool table, nice dudes working there.", 
    "review_date": "2014-09-15"
  }, 
  "yO2X4vL784RBvVfdMPg3yA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alfred M.", 
    "review_text": "Excellent pizza. Great neighborhood feel. Cool mix of old-school SF regs and newcomers. Place always welcomes new faces.", 
    "review_date": "2014-03-31"
  }, 
  "EH-5NbjZ3WHBx_ldBz5zKA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Divya P.", 
    "review_text": "Live in the neighborhood.  The pizza is great, the number 4 or number 2 are the best!  Good selection of beer, down to earth, non-pretentious place to have a drink after work!  The guys who work here are kind and there is a regulars crew that create a friendly neighborhood vibe. Will be here to get my pizza/beer fix often!  Also, pool table is a plus!", 
    "review_date": "2013-02-04"
  }, 
  "ySWtaB9pp1fXF-WPXCQe7A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C. M.", 
    "review_text": "Are you kidding? Asked for sausages and peppers without bread and cheese (due to food intolerances) and they wouldn't serve it because they thought that sounded gross. Immature, unprofessional, rude. Won't be back.", 
    "review_date": "2012-04-26"
  }, 
  "63d7114a9Ym-XcgDIZcJTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blondie R.", 
    "review_text": "Awesome place: cheap drinks, strong pours, friendly bartenders.  Just don't tell other people - let's keep this secret!", 
    "review_date": "2013-08-03"
  }, 
  "vNxbFoKLJoFjSOWsDBl5Jg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jono K.", 
    "review_text": "Jay'n Bee Club is a great neighborhood bar featuring great bartenders, pool and an excellent outside area. Go for the beer/booze (they have a great selection), stay for the pool and outdoor seating area.   I haven't tried the food yet, but I hear it's good bar food... looking forward to trying it and posting another review.  Cheers.", 
    "review_date": "2010-02-18"
  }, 
  "OCkcU3Kaf0C56ezeuDsrJQ": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Jorge H.", 
    "review_text": "Honestly one of my favorite places to go. I love the back patio area and the beers are pretty damn cheap.", 
    "review_date": "2011-02-16"
  }, 
  "856Zi7gfwjFDBaiyB7TU0A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel L.", 
    "review_text": "I was craving some good Mexican food and a few good beers, and this place was perfect. The food was delicious", 
    "review_date": "2008-12-20"
  }, 
  "x0tmfUam_Jj_NCKKuqomyQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Andrew J.", 
    "review_text": "Jay'n Bee Club is great.  Very simple concept: beer and pizza at a bar.  My friend and I shared a pie at the bar while the bartenders kept attending to our drinks.  The bartenders are nice and not overly-chatty.  This is what every bar should be like in San Francisco: friendly and affordable.", 
    "review_date": "2013-11-12"
  }, 
  "pmPdnSoKZRVifejpEP0pbg": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "JoJo C.", 
    "review_text": "Another one of the reasons I love San Francisco  This bar was totally chill the bartender friendly, drinks were cheap!! The outdoor space was large with lots of seating, there was a pool table and its in walking distance!  AWESOME!!   What can I give it but 5 Stars?!?!?", 
    "review_date": "2007-12-23"
  }, 
  "7OX_ZeAMdP5IA6U5aLv73w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Andi R.", 
    "review_text": "What a sweet little spot this turned out to be. It's a perfect neighborhood bar that happens to have pretty good mexican food. I had the deluxe burrito with chile verde and it was very tasty. Two other people had avocado tostadas which they loved. Of course I didn't have a drop, but they all seemed to enjoy the two pitchers of margaritas they went through. The little patio area we sat in was perfect for the warm night.  Also, the jukebox kills. Any bar that has Q Lazzarus' \"Goodbye Horses\" is good in my book.   The table service is lacking quite a bit, so I took off a star. I may readd that star post pregnancy, when I go back and get drunk on margaritas.", 
    "review_date": "2008-10-24"
  }, 
  "zGOXKICJ-X6tcoIHaGaITg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kia B.", 
    "review_text": "A great place to be on a lazy sunny sunday. Relaxed here with a good friend and had enjoyable conversation while I got my buzz on. The Giants were on the screen, the cutesy  girl-DJ was spinnin' oldschool faves, and the locals were droppn' in to shoot the breeze. Didn't try the food(had just eaten)but it looked and smelled fantastic. Pooltable, patio, chill people, good vibes, and a damn fine margarita-no need to complain. See Ed at the bar, he'll take good care of you. . . .", 
    "review_date": "2006-07-31"
  }, 
  "EKtZy9H3SRhKcGh67Rqe2w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay B.", 
    "review_text": "This place is great! The two owners are super attentive; they were consistently clearing off empty glasses from our table and were quick to say hello when we walked in. We had $4 Blue Moons and a $12 large pizza! It was the Luca Brasi, with sausage and mushrooms -- and delicious!!! It was perfect for the three of us and so cheap!", 
    "review_date": "2011-05-20"
  }, 
  "m2jPZIpBy_NpseTX0uCkOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E P.", 
    "review_text": "I really like this place! I went here last Saturday night with a friend who just moved into the area. They have a lot of jazz music in the juke box, which is great. I did not eat anything but the bar tender was really nice and attentive.  Also, they serve Chimay and there is an area in back with tables for smoking. The mixed crowd of locals seemed to come in and out in waves. This was great because it never got too crowded. Oh, they have a pool table too. What more can you ask for.", 
    "review_date": "2006-03-10"
  }, 
  "fGkpW1GpmRUQ4E3vEJTn8w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara H.", 
    "review_text": "When I moved to the Mission nearly two years ago, I was SO excited to discover Jay'n Bee.  I couldn't wait to spend my Sundays sitting on the patio, drinking beer and eating nachos at my new neighborhood bar.  Fast forward to my first attempt at Sunday bliss....my roommate and I went to Jay'n Bee, ordered our drinks and the nachos and sat on the patio.  When our nachos came (after quite a wait) my excitement waned a bit.  They were ok, but nothing special.   Fast forward yet again to my second attempt at Sunday bliss... I had some friends in town and we decided to go for a beer at Jay'n Bee and they were CLOSED!  What kind of bar closes on Sundays?!  Especially a bar that has a PATIO and is located in the sunniest neighborhood in San Francisco?!   Apparently, they are open one Sunday a month - I don't get it.  I love Jay'n Bee as a bar.  The bartenders are friendly, they mix a stiff drink, and the beer selection is pretty good.  It's a cozy place with a pool table and good jukebox, and of course the patio.  I'm just not impressed by the food.  I've tried several different items on the menu and it's not bad, but I think you can get better for less money elsewhere in the Mission.  The only exception is their guacamole - it is fantastic.  While I don't pretend to be a connoisseur, this is some of the best guacamole I've ever tasted.", 
    "review_date": "2007-08-31"
  }, 
  "zBuLi3gxNffQDSEbpvJdEA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Megan S.", 
    "review_text": "My friend and I were in town from Seattle and stumbled across this spot after having some hoity-toity sushi.  We had an early dinner so were just wandering about the neighborhood drawn by the cute apartments and wondering what it would be like to live here.    We saw the neon lights of Jay'n Bee and squeeled, \"BAR!\"  We both love dives, but this isn't really dive-y, just a friendly neighborhood pub that serves awesome pizza.  Since we had already eaten we didn't try the food, but the smells and the looks of what people were ordering had us drooling.    We ordered a couple of pints (cheap) on this Friday night, our first night in San Fran and took a seat by the front window.  Great mix on the juke box and the crowd was a sweet mix as well.  When I stepped up to the bar to order drinks I was nervous that the regulars wouldn't let me get in my order, but in fact, they noticed me right away and made room.  They made me feel like a lady and were all smiles.    Wish I had more time in this city, because this would be my regular joint for sure.", 
    "review_date": "2012-02-21"
  }, 
  "kvqks3onvR80p84RZw8Kqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete S.", 
    "review_text": "My dive-bar, not yours.  Stiff drinks, outdoor patio, and Sharks/Giants games on TV all the time.  Love these guys.", 
    "review_date": "2011-09-14"
  }, 
  "A2mx9xsHoIDNnd81_lxiFA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Javi V.", 
    "review_text": "Good choices for the beer, pool, food ...  It is a very nice neighborhood bar, and you can park your bike right outside. Thumbs up!", 
    "review_date": "2009-09-17"
  }, 
  "xl3fVHYw1oePhSw34sILmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess H.", 
    "review_text": "Admittedly, we often only head to Jay 'n Bee when we think that Zeitgeist is too crowded or just need a change of scenery.  That said,  the back patio at Jay 'n Bee is a great place to kick it with a group of friends.  There's also the added bonus of Marta's Kitchen, the in-bar restaurant, which pumps out really friggin delicious Mexican favorites. \n  Depending on who's behind the bar, your experience can be awesome or not quite awesome.  Ed is by far and away the best bartender, but if he's not working you will likely be subjected to one playlist on repeat.  (The longer you stay, the more times you will hear Massive Attack and other tracks that should have been deleted from music history after 1999.)  Additionally, the pitchers are, for some strange reason, expensive.  Even usually cheap beer.  \n  Pros: pool table, empty on weeknights, patio.\n  Cons: pricey pitchers, the occasional child running around the patio, and a jukebox that is rarely turned on.", 
    "review_date": "2006-08-23"
  }, 
  "mtpek5XdI8oqrA5KCGFXZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bumble B.", 
    "review_text": "We had nothing to do for lunch on the 4th of July - our neighbourhood stand by, Puerto Allegre, was closed so we decided to take a walk and check out the Jay and Bee club. We arrived at about 1pm and the place was empty. We sat at the bar and ordered some yummy margaritas and took a look at the menu. the lunch menu is pretty sparse so we decided on burritos ($6) - my wife had chicken and I had a vegetarian burrito. We were promptly brought some yummy freshly made thick chips and salsa and our food followed shortly afterwards. The burritos were pretty plain but tasty nonetheless. My wife commented that the chicken in her burrito was all white meat. The burritos came with Mexican rice and re-fried beans.  It was a decent lunch but I think that Puerto Allegre could have done a better job. I'll go back again sometime for dinner", 
    "review_date": "2008-07-04"
  }, 
  "L_D92ILEY9P8BVSI9Avcuw": {
    "user_rating": 5.0, 
    "user_location": "Boynton Beach, FL", 
    "user_name": "Rich F.", 
    "review_text": "This place is the best!  No BS, just great food, cold beer and friendly people.  The bartenders are as good as any in the city- they make great drinks but they don't expect you sit there in awe of their 'mixologist' cred.  They just want you to enjoy yourself and come back often...  which you should!  My only regret is that I don't live right around the corner- I can only go there when I visit my daughter... Of course, it gives me one more reason to visit...", 
    "review_date": "2013-06-06"
  }, 
  "GoZkLzA11Gq39Zmd8ie-yA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Travis S.", 
    "review_text": "Jay'n Bee is absurd. Its pretty dirty, the bar tenders are usually slow and confused, the seating is sparse, and the food takes forever (like an hour+).   Why 4 stars then? Because Jay'n Bee is perfect for what it is. If you're not in a rush, want to grab some pretty good Mexican food, and have a few beers with your friends, then the Jay'n Bee is the best.  Small bars like this make the mission a better place. Everyone is in a good mood, there's never drama, and if you're down for whatever you're bound to meet some interesting people.", 
    "review_date": "2009-02-06"
  }, 
  "ORpEQRS2csrBbaucaNuSlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate D.", 
    "review_text": "I had the best time here! After reading the yelp reviews of Jay'n Bee Club  I figured it would be a good spot to head by myself for a drink and meet new friends. What an understatement!  The bartenders, James and Constance, are awesome and made me feel right at home. James makes fantastic drinks, including margaritas. I met a lot of great, friendly people and ate some tremendously yummy pizza. Can't wait to go back!", 
    "review_date": "2011-11-23"
  }, 
  "TmAd0zvOqTd7lRCclz_ouQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob R.", 
    "review_text": "Great dive bar with food. The pizza was very good (though that spicy pie was danger bay).  Get's a bit cold and drafty by the door -- which requires a certain level of insulation with beers (but again, watch out for that spicy pizza. It will not help you).", 
    "review_date": "2013-04-24"
  }, 
  "HxPr0MWQSqsk2IFqd4O1ug": {
    "user_rating": 5.0, 
    "user_location": "Tiburon, CA", 
    "user_name": "Sharon L.", 
    "review_text": "Our friend kidnapped us from the Marina and took us to Jay'n Bee....So glad that he did. Food was fantastic, and vibe was awesome. One of the best mexican meals I've had in SF...", 
    "review_date": "2008-01-07"
  }, 
  "Ofdt7Nqv_IJuSQRcUdQlBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacey J.", 
    "review_text": "Jay'n Bee Club = awesome. Everyone who works here is amazing. Whether James, Fox, or Steve (or any of the others whose names I don't know) are behind the bar, you're in good hands. Oh, and did I mention the pizza? Sooooo tasty. Great food, great drinks, great people (employees as well as the regulars). Back patio and a pool table. Bar seating, with tables as well. Cash only, so make sure to have some handy. :D", 
    "review_date": "2011-07-13"
  }, 
  "N2t7i89KstqDMRoxnWVdlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexander F.", 
    "review_text": "It's my bar! Stay the hell away!  The best pizza I've had in San Francisco, all the guys working here are awesome. The freshest, coldest friggin beer in iced pint glasses for $4. I take everyone I know to this bar.   (Try their pizza with \"spicy sauce\") (They're open Mondays)", 
    "review_date": "2012-05-23"
  }, 
  "haahbe0UcilP0zZeD8-ltw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "the k.", 
    "review_text": "For thin crust pizza there is no place else in the City I'll go. Grab a drink, take a seat out back and enjoy. The super chill people who work there just make it an all around awesome time. I almost don't want to give this review in fear my spot will get blown up- but far be it from me to deny anyone such killer pizza, I guess....", 
    "review_date": "2013-08-29"
  }, 
  "F_Gl1FLwpFeNzkYre8jzQQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Suman G.", 
    "review_text": "damn, thought I would get a first with this one, but I was beaten to it by 5 months!  \n  Check out this spot.  It's a bit out of the way, but it's worth seeking out.  Good music (Gene, are you still spinning here?), good vibe.  Free pool (still?).\n  It will most likely be Ed or JP behind the bar.  Tell them I sent you.", 
    "review_date": "2005-11-30"
  }, 
  "9j8MIbxEcNbkwum1bdfLJQ": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "church B.", 
    "review_text": "newly re-opened after being shuttered for a few years (a rarity in SF) Jay'nBee is back to slake our thirst.  $1 PBRs during happy hour, $3 pints,a backyard patio for those inclined to light up while tossing back a few, and backyard BBQ on Sundays!  good jukebox, with a pool table to boot.  I wasnt too hungover when I went so I didnt try a bloody mary, so the jury is still out on those, but a nice place w/ a nice vibe.  20th @ York.", 
    "review_date": "2005-06-28"
  }, 
  "7ZR360HxMmNeYVIoZXmZZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen S.", 
    "review_text": "I love the Jay 'n Bee, it's possibly the perfect neighborhood bar.. The bar is great, the bartenders are great, Marta's food is fantastic. Great jukebox, outside patio, pool table. Pretty much everything you could possibly ask for. I don't love the people who think that it's OK to yell to each other as they walk to their cars when they're leaving the bar late on Saturday night (shhhhhh, I'm old and I'm sleeping), but that doesn't change how I feel about the bar.", 
    "review_date": "2007-09-24"
  }, 
  "23wQqI-DYwKkIp1av55A1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "I love this place, although I'm afraid to say so and have it be hijacked from a fun, easy-going, and chill neighborhood bar into a hipster scene.  But, I must say, the drinks are affordable and the food excellent.  That guacamole is addictive, I'm telling you.  They play most sports games on TV, but also have a pool table and jukebox.  It's such a great place to just kick back.....damn, after writing this, I think I'll go tonight!", 
    "review_date": "2007-02-16"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "This has to be one of the last gems of the mission.  Just far enough out that the people climbing up and down Valencia stay at bay for the fear of being raped or something.  Anyway, if you can handle the walk down here you will be treated to a real home-like feel that is long lost in this town. Bartenders that want to have a drink with you, want to chat you up and are willing to go out of the way for whatever it is that you want.  Honestly, this is a great bar. Nothing more... it doesn't need to be.", 
    "review_date": "2006-11-22"
  }, 
  "j_uRUddih3IGst50FKnylQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terri S.", 
    "review_text": "I went to Jay n bee because it was a convenient location to my next stop, needed a bite and a drink and had read good things from other yelpers.  It did not meet up to the reviews I read. First off sat down and when no waitress appeared after 20 minutes, a request from the bar tender as well a  free beverage as an apology from him, she finally came over with menus, chips and salsa and an apology. Okay, I can deal with that since the chips were clearly homemade and hot as well the salsa, although a bit mild,was homemade. So another 20 minutes later and another basket of chips and a finished beverage still no sign of the wet burrito I ordered. Finally, I went to the kitchen entrance where the waitress stood and asked what was going on. She apologized and said there was nothing she could do about it,  but my food was on it's way. So after at least 50 minutes my food arrived.  I ordered a pork chile verde super burrito which has enchilada sauce on it. It was mild and tasty, but relatively small for the price ($6.75) considering being in the general Mission area and the wait. As well there was very little meat in it. When the waitress delivered the very tardy meal she let me know, \"It always takes a long time here. The kitchen staff doesn't prep, but does everything to order\", funny they weren't that busy. So in the end I have to keep in mind it is primarily a bar and if you out for some cocktails you would probably just be thankful to be able to order some food and not mind the very long wait since you are hanging out to drink or shoot pool any way. Now I know, maybe some chips n salsa with my cocktails is the only expectation to have at this otherwise convenient neighborhood dive.", 
    "review_date": "2008-11-17"
  }, 
  "UzNPMamyS1PyBscivM5hHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J L.", 
    "review_text": "Great local bar with a small patio out back. Serves good Mexican food too.", 
    "review_date": "2008-08-13"
  }, 
  "_wNIbDPZzX9h3ut6ED30SA": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "alex g.", 
    "review_text": "great lemon drops!", 
    "review_date": "2013-05-08"
  }, 
  "ccQvyiUeqsXhweY2hHrHAw": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Adam Z.", 
    "review_text": "If you want to drink with friends while waiting for a home-cooked Mexican meal, you would be a fool to go anywhere else.  It has a great mix of hipsters and locals, a pool table, and two TVs for the sports. Pints of Tecate with lime for $3.  Cool bartenders (Hi Kasia!)  The only drawback is that the service is very slow, and you can wait 45-60 minutes to order and get your food.  However, since they serve the world's best chips and salsa (hands down), it's hard to complain -- just plan accordingly.  UPDATE:  It's lost a star since it appeared on \"Check, Please! Bay Area\" because the quality has slipped slightly while the prices have increased. Also, the internet jukebox has largely killed the vibe.  SECOND UPDATE: Marta's Kitchen is no longer associated with the bar, so that sadly, it's no longer worth eating there. Minus another star.", 
    "review_date": "2007-05-12"
  }, 
  "Wd7ToYLzJxcKIr0YFcwugQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rachel d.", 
    "review_text": "My default place to take anybody visiting San Francisco.  Maybe because its just a block from my apt...or maybe because the combination of great mexican food with good beer and sweet margaritas and a great patio rocks.  Its great to find somewhere off Valencia or Mission where you can chill outside and get tasty authentic Mexican.  The patio even has heat lamps which come in handy after you find yourself still sitting at your patio table well after you have finished your burrito, are on your third beer and the sun has totally set.  The food is all fresh and I've never had a dish here I have been dissatisfied with.  If I had to make one complaint, its that occasionally you have to beg for service but while you are waiting, you have a decent beer selection to choose from and, if you want to go all out, they make awesome margaritas that you can get by the pitcher.  Definitely worth the trip from the many taco places off Mission.", 
    "review_date": "2008-09-07"
  }, 
  "v11Qj90pB6aLoM8FRtbbNA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Karen S.", 
    "review_text": "Score $4 beers and cheap pizza... cash only though", 
    "review_date": "2012-10-01"
  }, 
  "pAGSv-8vo6k6hpgqw_fIdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Netty L.", 
    "review_text": "Nacho's + patio = a good neighborhood bar to know about in case one finds themselves in the Mission / Potrero area.  Other pluses include a decent jukebox with lots of late 90's hits, and  Hoegarden on tap.  There is something though that is holding me back from giving this place 5 stars.", 
    "review_date": "2007-04-12"
  }, 
  "YpyWOuqc3o3IbVfYklVpFg": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Dan S.", 
    "review_text": "Hm, OK. Let's make a little checklist:  Atmosphere: Relaxed, friendly, only low-level sports-bar action sometimes  Bartenders: awesome. Friendly, responsive and cute.  Beer: properly priced, good assortment -- though sometimes served in annoyingly-logoed pint glasses (such as \"GIANTS\" or the one that tells you what kind of asshole man you are on a date)  Bridge &amp; tunnelers: Strangely and delightfully either absent or behaving themselves.  Food: Marta's Kitchen is honestly some of the best Mexican food I've ever had, and I've lived in the Mission off and on since 1992. And: homemade chips with excellent salsa.  Hours: Closed Sunday nights! How weird is that? It's OK, though.  Patio: present, pleasant. I rarely go out there though, because I like the window seat that looks out on 20th St.  Pool table: present -- though blocking ATM and bathrooms.  I have never had a better stumble-home-from bar. Yay Jay &amp; Bee!", 
    "review_date": "2007-06-12"
  }, 
  "rJ5mJ18V-2fjW_5OkeHnng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David C.", 
    "review_text": "This is like your perfect neighborhood watering hole where they have cheap beer and bourbon. My kind of place. It's big enough for a large group and they have outdoor seating if it's a nice day/night. AND it's not on the main 16th/Mission drag so you don't have all the drunken boneheads. It's chill. I like chill. AND they have a pool table.", 
    "review_date": "2010-05-10"
  }
}