{
  "-GFZucvLDX-TDj64MHeW3A": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Christopher A.", 
    "review_text": "Great place to have cocktail after work. Liked the mellow atmosphere and unique decor.", 
    "review_date": "2013-03-11"
  }, 
  "an-ijVpGQxgiOBX9qTBOyQ": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Asina G.", 
    "review_text": "Beautiful, swanky and chic lounge located in the Hotel Nikko.  We were staying across the street at the Hilton and found Kanpai on Yelp.  We were a little confused at first because all we saw was the Feinstein's sign, but we eventually found our way there.  The décor is very nice -- think plush black and red arm chairs, white leather tufted benches and fuzzy rugs.  Very clean and classic, but also very modern.  I had the Chipotle Cabaret, which can be described in one word -- FANTASTIC!  If you like a little kick in your drink, you will love this!  I could drink those all night.  The servers were attentive, without being bothersome.  It's a bit pricey, but what isn't in that part of town?  All in all, it was a great experience, and I would definitely go back the next time I'm in San Francisco.", 
    "review_date": "2014-02-17"
  }, 
  "6PPE58sc9KrZhNaFhqIYqw": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Brittany S.", 
    "review_text": "Beautiful lounge in the lobby of our hotel in San Francisco. Very relaxing, good drinks. The bartender was very helpful and friendly and the cocktail server made sure to check on us. I loved it.", 
    "review_date": "2013-06-05"
  }, 
  "xy6nD4IOlne5HTaVb2OLtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ABBY A.", 
    "review_text": "I love taking advantage of new places. You know why? Because that's when you get the best of everything; and in the case of Kanpai Lounge, you get great service and even better drinks! Located just one block away from Union Square and within walking distance from BART (don't drink and drive), if you're looking for a semi-private area to have a casual business meeting or meet with friends for a few drinks, look no further. Keep it classy at Kanpai Lounge!:)", 
    "review_date": "2013-03-29"
  }, 
  "uOBnejjNdnjjItQDrQDXiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate m.", 
    "review_text": "This place is really classy. Nice furniture to relax on and great environment to drink with friends. The people are really cool who work there and there is a live pianist playing classy music. Just a well rounded lounge.", 
    "review_date": "2013-03-07"
  }, 
  "0LbfE7KicGIRdI18mrcI-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly R.", 
    "review_text": "Wonderful location and super Chic girly! Great place to get together with friends. Lots of little niches in Hotel Nikko to meet clients or have quick one on one chat.  The service is top notch and ambience is wonderful. Drinks are good... a bit pricy. Close to union square and Bart.   highly recommend.!", 
    "review_date": "2013-07-18"
  }, 
  "fW3jJI6f1_TcGnpqc21_lQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R A.", 
    "review_text": "Their Tuesday happy hour is pure awesome! Great DJ's, but not overbearingly loud, music was on-point! Not too many food options but just the right amount for the vibe. **Pro-tip: Sake bombs with co-workers always make things more interesting! If that's not your thing, order the Godzilla from the secret menu.", 
    "review_date": "2014-04-02"
  }, 
  "RFpnfgB2dSLfGY00FppcAg": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Tony M.", 
    "review_text": "Had the very popular Kappa delight, and was a very good tasting and refreshing drink. They also have late night appetizers.", 
    "review_date": "2014-07-18"
  }, 
  "IzeCe1wvya_eNHstarWw_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher B.", 
    "review_text": "This place is really laid back, super cool. I think it's brand new. It used to be the Rrazz room and now it's a really awesome looking, really pink lounge with great cocktails and a chill atmosphere. I'm really interested in seeing what they do with the performance space, there's a lot of potential there. For now though, they've got a great selection of spirits and it seems like it could be a sweet place to take a date or meet up with people.", 
    "review_date": "2013-02-25"
  }, 
  "_3JIAp5ePArzx3T2xvaBWg": {
    "user_rating": 5.0, 
    "user_location": "Norwalk, CT", 
    "user_name": "Lawrence D.", 
    "review_text": "They have a happy hour at like 1030pm i think which is good. They play House music which I love. The Kappa drink is nice and a must try. Bartenders are nice too. Thats actually all I remember til I wake up and writing this review haha!=P", 
    "review_date": "2014-10-19"
  }, 
  "giFVT2uYbYtF5L9wQMmqKg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Beth N.", 
    "review_text": "Took a out of town friend to Kanpai lounge to wind down the night after dinner. What a wonderful place. The decor is beautiful and the ambiance is classy with nice music. The wait staff were very attentive; we actually had TWO tending to us!! LOL!! Even when we asked to order desert, the waiter graciously told us the kitchen had closed but accommodated our request for chocolate for our teas anyway! The drinks are a bit pricey but I am from NY so I am used to those prices, but they were delicious. I will definitely visit this establishment again!!", 
    "review_date": "2013-11-03"
  }, 
  "kM3A6_F9Ecr4ayFiAbmC_A": {
    "user_rating": 4.0, 
    "user_location": "Halifax, Canada", 
    "user_name": "Bryan H.", 
    "review_text": "nice little location. Went there for \"Sake and Sound\" expecting a dance club, but its just a lounge. Still quite nice ambiance, and nice seats overlooking the street.", 
    "review_date": "2014-04-23"
  }, 
  "6OsqYvCScSAcqP9jQcOAlA": {
    "user_rating": 2.0, 
    "user_location": "Bay Area", 
    "user_name": "M G.", 
    "review_text": "Anyone that knows my dining partner &amp; I, knows we are pork connoisseurs. If pork does not hit our table in a great way, I will discuss it openly. With that being said, we ordered the pork skewers &amp; were sadly disappointed. When your menu says the pork is glazed, we expect a melt in our mouth, sugary piece of pig to excite our taste buds. Instead, we received a poorly plated &amp; seasoned pig on a stick that was dry,  not so tasty &amp; glazeless. They were sent back.  We move on to the chicken spring rolls. It's hard to mess up fried food but it was hard to swallow the price for 3 rolls @ $12. You can get the whole bag from the market for $3.99 &amp; be happier. They were decent &amp; their peanut sauce was great. We also ordered the chef's special Makimono(sushi). It was salmon rolls with spicy tuna on top. It was better than the pork, but wasn't  spectacular.    My dining companion commented , \"For San Francisco, I expected a better menu for the price.\" We would agree. We do not believe any local would regularly hang out here when a well priced happy hour is steps away from them. The pricing seems to be geared toward hotel guests &amp; tourists. We paid $60 for 2 appetizers &amp; 2 cocktails. That would have been a great dinner somewhere else. We felt we were paying for the ambiance of the room, rather then the quality of food.", 
    "review_date": "2014-02-14"
  }
}