{
  "lYe3heyEcn0Nj51TyShmTg": {
    "user_rating": 5.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Jay B.", 
    "review_text": "Wow This place is amazing. A secret little Japanese restaurant tucked into a corner of japantown behind a very hard to find door. The Best japanese dining experience I've ever had! My wife and I tried the omikaze. (whatever the chef has in mind for you. ) and wow what an amazing mouthwatering experience. Make reservations because this place is only open for 4 hours a night and only sits about 12. A very very special experience! Thank you Kappa , we will be back", 
    "review_date": "2011-12-23"
  }, 
  "fVjdQVRWNZ0MljH8UWzayA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie D.", 
    "review_text": "finding this place is 1/2 the fun. I heard about it from my friend \"above the Denny's in Japantown.\"  you go above the denny's and you see a karaoke place and a small sign next to closed wooden door. If you read Chinese, it says \"small eats\" (or so tells me my friend) if you read hiragana the sign says \"kappa\"  so, we knocked on the door. We asked if they were open b/c of the closed door. The waitress said yes \"but we don't serve sushi.\"  I thought to myself good b/c I don't do raw. When we said can we come in. The waitress again said we don't serve sushi. i said fine. Then she brought the menu to make sure we were ok.  It is high-end japanese tapas or food to go with drinking. they serve sashimi but not sushi.  divine fatty pork, divine everything. very pricey. very small, only seats like 7 at the bar, and 1 room of 4 people...  reserve in advance or risk being turned away. or perhaps just try dropping in...  there is just the chef and the waitress. perfect service.", 
    "review_date": "2011-07-29"
  }, 
  "vASaF47nWvCHEEDA8nfCVw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ClosetDork ..", 
    "review_text": "There's something elegant yet understated about this restaurant, tucked away in an unassuming location within Japantown.  The lack of sign and the unmarked sliding door, which leads to a dining room capable of fitting no more than 12 guests at any given time, would surely keep the tourists (or those who are not in the know) away.  The establishment consists of a private room with a small table for 3 and a small sushi bar with 9 little chairs and almost no decor.   Everything else in the entire Kappa experience is just like the restaurant itself - the minimalist menu is devoid of glossy colorful pictures (and, sometimes, English translation), each dish (no sushi!) is beautifully presented sans fancy garnishment, and service is excellent yet not overbearing.    Intimate and personable, this must've been what it feels like to stop by an old aunt (whose culinary skill is out of this world)'s house for a homemade dinner.    Without the annoying inquisitive aunt hovering about in the background, of course.", 
    "review_date": "2008-06-21"
  }, 
  "mE-hdFF4RgCxspZU72GAsw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "Not sure how to start this review, so I'll leave it up to you; here are 3 options:  1.) Saved about $1400 on two tickets to Japan last night! Instead, I walked there!  2.) This is why we live in SF, why we deal with the outrageous costs and the damn parking tickets. It's because of places like this!  3.) Someone once told me, the first thing you should eat in a Japanese restaurant is the tamago, and the quality of the tamago would dictate the rest of the evening. The Japanese  group next to me did just that. In fact, the chef had a big block of tomago on the counter that looked and tasted outstanding. Judging by the look on their (and our) faces, it was going to be a great evening.  Now here's the rest: We were the only 'foreigners' in the place. Everyone else spoke Japanese. And we were the only ones doing the Omokase. Although I can't afford this place on a weekly basis, I feel blessed we were able to experience it. Next time, I'm ordering off the menu. But, if it's your first time, I don't suggest you do the same. Get the omokase. Enjoy. (and the flight home won't be bumpy (or long.))", 
    "review_date": "2010-08-27"
  }, 
  "Rt2BtV0Xbwrd_h9KoCXtvw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich H.", 
    "review_text": "We had the $85 omakase.  It was good -- but not fabulous.  The toro, katsu, duck breast, and ankimo were all very good.  The rest of the meal (asparagus over some sauce, red bean dessert, etc.) was just OK, though.  Much of the meal obviously had been prepared well in advance, and the chef was just slicing everything and laying it out in front of us.  While the others in my party were full, I left a bit hungry.    Good, attentive (but not annoying so) service.  Good sake selection/recommendations.    All totaled, $120 a person.  Only 3* because, for the cost, I don't think I would rush back here.", 
    "review_date": "2008-09-13"
  }, 
  "njNP6Gw1MfPWVqQKhs3Dsw": {
    "user_rating": 2.0, 
    "user_location": "Ewa Beach, HI", 
    "user_name": "George N.", 
    "review_text": "I give two stars for the awesome food, but for atmosphere they put us in the tight corner, where you hardly had room to move around and that young with that streaks of blond in hair must be having a bad day,. Her service sucks...otherwise the food is delicious...", 
    "review_date": "2013-03-02"
  }, 
  "2-ZpF_iIHgc_5njdiJfM3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stan V.", 
    "review_text": "My wife and I had omakase.  For the most part it was very delicious.  The dashi broth dumpling and salad were very good.  The smoked salmon... not so much.  Everything else was very good.  Service was impeccable.  The chef and his wife were very hospitable.  I would say they can even cut down on some of the portion sizes in a few of his dishes because the sizes of some of his cuts were a bit too big.  Overall, I would highly recommend it to anyone.  Do not order sushi because they don't have it on their menu.", 
    "review_date": "2013-02-09"
  }, 
  "3roJp-RoqKVoMgdtuJFM9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine M.", 
    "review_text": "*chirp*chirp* the silence deepens  we were running a few minutes behind and called to let them know, and they said it was alright. i knew the place was somewhere next to milo, and sworn i had seen it before. luckily once you walk up the stairs...the door was open and viola! it says Kappa..and then  you see a wooden slide door...and I'm like hmm is it in here...and you slide it and into a zen Japanese place.  We were the only ones there at 6pm, and yes, lets just say it. it was AWKWARD! felt like we had to whisper, and although they were nice, just staring at us every second didn't make me that comfortable =/  we did the omakase, and had her suggest us a sake, i preferred something sweet and she got us just that. not too sweet but perfect.  new years soup- very refreshing, light, the mochi was chewy, mushroom was tasty crab in vinegar- perfect balance tuna in a wasabi miso sauce with wakame and scallions- the sauce was a good balance b/c the wasabi was just spicy enough to hit your nose but not too overwhelming. although my bf said thats how mustard is suppose to be but i don't really know. the platter of everything- tamago (more egg-y than sweet), fish cake (yum i love fish cake in general), duck breast, salmon, conch shell? (chewy, never had it before),  asparagus in sesame paste, shrimp, corn fritter, eggplant, tonkatsu, and one more fish, and new years beans as they said. all very delightful, one easy bite, full of flavor! the sashimi...hamachi, tuna, amber jack and halibut? was so buttery and the texture was really nice. except i think i wasn't fond of amberjack...too crunchy? chewy? yea... nigiri!!  i usually dont like raw scallops but this lil guy was yummy! and right off the shell. seared toro? im guessing from pics on yelp, but it tasted like a salmon lox? the unagiiiii, my bf's chef said it would and should melt in your mouth. it totally did. every bite was savored. DROOL then the dessert- mochi, persimmon ( i like persimmons), pear, and persimmon jello, apple sauce texture. then a strawberry, raspberry, and peach sorbet.   overall definitely an experience, if you have the money to spend. it did get less awkward as the courses trickled in and another couple joined us. the wife was very hospitable and I wish I could have used my japanese language skills on her. lol   were we full? content but not stuffed which is how it should be. we did try to take our time eating..lol since we didn't want to look like fat pigs and gobble everything up. ponder and think about the flavors, yes look smart, yes  now we're excited to try other omakases! for special occasions of course. oh and my bf got a small gift b/c it was his bday. arigatou!", 
    "review_date": "2013-01-15"
  }, 
  "ifrL9DZ30ibOWX5KfXxFDA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Mel S.", 
    "review_text": "Go here for a real indulgent treat especially around the holidays for a special menu! You won't be disappointed! Great service as well.", 
    "review_date": "2013-11-02"
  }, 
  "dm2zyOFEl2ZMMRGUYjc-Zw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "George L.", 
    "review_text": "Walking thru the door of kappa (assuming you can did it..) it's like crossing a portal to japan. Everything here, the decoration, the hominess, the wife-husband duo, and all the dishes is close to perfection. I'm sure the chief is keenly working towards it. Just like jiro always is.", 
    "review_date": "2014-03-14"
  }, 
  "v-6rnKSlJC9rE0mi1AiPyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cameron B.", 
    "review_text": "Best Japanese meal I've had. This place has been in business for 25 years. It seats 10. Had the omakasse. Run by a husband and wife team. Entrance is hidden away next to a karaoke bar. What else do you need to know? Dinner and two sake was $150 with tip.", 
    "review_date": "2013-11-12"
  }, 
  "eRkLCltnCb5EYcK0928t-Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy K.", 
    "review_text": "Wow, Kappa was a disappointment. For a 4.5 star rated restaurant, I was expecting a lot more.  We ordered the omakase for $85 each. Overall it was a big let down.   Started with 2 sashimi size pieces of soy sauce/shiso marinated marinated tuna with scallions. Ok, tasted fine, but hardly unique. I can get that at any sushi bar.  Next was an interesting bowl of fish gelatin, fish eggs, fish, and okra. It was ok.  Then we had a plate of sashimi and other bite size foods. BBQ unagi, sardine nigiri, duck breast. I think there was nine pieces of stuff. Not that tasty, nor original, except for the single slice of duck breast.  Next was a bowl with 6 pieces of sashimi. 2 tuna, 1 yellowtail, 1 halibut, 1 mackeral, and some uni. Didn't taste fresh, and I hate mackeral.  Then a small plate with a shrimp ball, corn fritter, and grilled miso-marinated seabass. I felt like I could have gotten the shrimp ball from a street vendor for $1. The corn fritter was very salty. The seabass was a charred mess. I sent it back.   Finally we had a soup dish with an egg custard square, some fresh fruit, and green tea ice crea.  In total, with tax , tip, and hot tea we were over $200.  Aside from the food, which was nothing special, the chef would prepare everyone's (as in, everyone in the restaurant) dishes at the same time. Therefore, if you weren't the first group finished with your plate, your next plate would be preplated and waiting next to the dirty dishes in the sink, cold, or over-cooked.  If you really want an authentic japanese restaurant like this, then go to Kiss. If you're looking for fresh fish on rice, go to your favorite sushi place and you'll leave much happier.", 
    "review_date": "2007-07-22"
  }, 
  "DW48cVl8pVGEC787UPfVtA": {
    "user_rating": 5.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Raul S.", 
    "review_text": "There is not much to say that other reviewers have not said about this place. Somehow I neglected to review it after our trip to SF a few weeks back, so here it is, to the best of my recollection.   We made reservations a few days in advance, shortly after touching down. I did not want to miss a chance to dine here. Luckily we got to Japantown about 25 minutes prior to the reservation, as it was very hidden. It's up a flight of stairs next to a bar. Small letters on the door say KAPPA.  We did the omakase, as suggested, and it did not disappoint. If I recall, there was sashimi,  a cold cucumber salad, a shrimp, some dumplings, a red bean desert, and a melon-y ice cream, just to name some of the items. All delicious, all different, all elegantly presented. It was quiet. There were 2 other couples dining when we were there at the counter area where you sit. A table in the back which accommodated about 4-5 people. And that's it. Looks like it holds about 10-12 people at a time, max. Very friendly couple running the place. It was more than eating. It was definitely an experience.", 
    "review_date": "2012-10-02"
  }, 
  "8hvXl0oJmU61l17LG9aDag": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Euge L.", 
    "review_text": "conversation with a life long friend.  friend : hey lets go out to dinner. i found out about this place thats supposed to be real high end japo food. its on top of dennys in jtown.  me : on top of dennys? are you talking about the korean bar? theres a restaurant on top of dennys? you smoke too much weed man. i think you are mixing up info.   when we arrived, we were like wtf, where the hell is this place. called, a lady said she will come right out. a completely non descriptive door opens and whoa... theres a restaurant there?  the place itself is tiny... seriously about the size of my old room in my sisters mcmansion in fremont. (yeah, shes the successful one, im the kid in the parents basement one). since we were a large party for the place, 3 people!!!, they stuck us in a little room away from the counter. i was so lost. ive been around japanese food all my life, but pseudo japanese (big ups to nobu). kappa is the real deal japanese cuisine. i didnt know up from down here.  glancing over the menu, everyone had the look.  me : mmmmmm i dont know. i took japanese for two years but other than _______ ku dae sai, i dont know shit.... thank you public school education.  we went with the omakase..... like ive said many times, who knows their best dishes better than the staff?   mmmmmm basically, i LOVED everything. i really couldnt tell you what i had, what it was, but i can tell you what it wasnt.... it wasnt a rainbow catapillar sunshine out my ass roll with tonkastu sauce. every small dish came out and was greeted by us with oooo and ahhhhs... the simple elegant balance of each dish was wonderful. the gracious lady matched up some cold sake for us also. excellent.  for so many courses, we didnt get stuffed. more like a very pleasant full.   it felt like a mini vacation to japan. a very good experience. now would i frequent it often? probably not. though the food is VERY VERY good, i prefer a more lowbrow dining experience. im a lowly salary man so stick me in an izakaya.. KAMPAI!", 
    "review_date": "2007-02-22"
  }, 
  "BCHyzFtX1R5eZ5AoOkuONQ": {
    "user_rating": 4.0, 
    "user_location": "Singapore, Singapore", 
    "user_name": "Ruby K.", 
    "review_text": "Kappa was a must experience. The bar only fits 8 people. The restaurant is ran by a Japanese couple. The waitress/owner was beauitful and very lady like, and her husband focused on cooking. There is a room that you could book for a small party.   This hidden gem is inside/next to Milo Lounge. I couldn't find it and had to call my friend for directions since I didn't want to call the restaurant. Once you walk through the door, you are in a whole different universe. It was dead quiet, and you truly focus on the food.   Beautiful presentations and fresh seafood. My first omakase experience!", 
    "review_date": "2013-03-29"
  }, 
  "cfVDBmjnlY2iJaBqz7D2Ng": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Christina L.", 
    "review_text": "Had the omakase. Probably the best meal of my life. The eel.. was amazing. The husband and wife who own the place are really nice. I came here for my birthday, and the wife gave me a birthday present before I left!", 
    "review_date": "2013-10-18"
  }, 
  "fK9p4IrqIpdJY4EbYPQSfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mami T.", 
    "review_text": "One should know that what truly differentiates Kappa from the rest of Bay Area Japanese restaurants is their veggie dishes.  I have never had such authentic Japanese vegetables perfectly prepared in such an authentic way at any of Japanese restaurants around here.   Where do they get their vegetables?  I'm dying to find out.  They don't just cross over the street to Nijiya, for sure.", 
    "review_date": "2007-05-29"
  }, 
  "ylRKufHFoOIs1_B4VLIJkQ": {
    "user_rating": 5.0, 
    "user_location": "Discovery Bay, CA", 
    "user_name": "don k.", 
    "review_text": "We both had a very nice meal. This is a small Japanese Restaurant that is operated by a very nice husband and wife team. They have been perfecting their business for the past 25 years and it shows how much passion they exhibit. The Chefs menu had many fresh ingredients from Japan which resulted in a well executed and Delicious meal. We are looking forward to returning soon.", 
    "review_date": "2013-05-30"
  }, 
  "ut9LXMr6uLDoATXHQExgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lois L.", 
    "review_text": "Making our way from the chaos of the Japantown Mall to Kappa, we were transported to an all together different dimension of being. The term 'Tappas' has been overused, so I'll use the less oft used 'small plates' to describe the Koriyori cuisine at this small/micro establishment. The prix fixe menu apparently changes from day to day, so I'm not sure what I might be served on my return visit (and I will return), but the dishes wrought surprised ahhh's from my lips time and again on this occasion. A bite of sea essence contained within perfectly creamy uni, followed by seared duck? Yes, more please! After having just enjoyed Joss Whedon's Much Ado About Nothing, all I could think was 'get thee to Kappa...get thee to Kappa!' But, be certain to make reservations and prepare for a leisurely, drawn out meal.", 
    "review_date": "2013-04-28"
  }, 
  "nwKsR5_epCypSzGPsMn0HA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza T.", 
    "review_text": "It is definitely a hidden restaurant in Japantown.  Looking for this restaurant for the first time was challenging.  It was upstairs of the J-town Denny's, next to Playground (Korean karaoke lounge).    The restaurant is very tiny and traditional.  It made you feel like you are dining in the traditional Japanese home.  The waitress (the chief's wife) was so sweet and friendly.  There is no standard menu here. Instead, you will be treated to unique meals based upon only the freshest ingredients available during the time.  We wanted to have Omakase, but they required one day in advance for reservation......TOO BAD!  We started off the Sashimi Combo.  The fish was good and fresh but it was not the best.    Since we have no idea of what to order, so we asked the waitress to order couple dishes for us.  My favor of the night was the Dungeness crab meat, and pickled cucumber with sesame seeds.  Very refreshing!  Overall, the food is simple here but it presented in a unique way which is hard to find in other Japanese restaurants.  However, this place is super expensive and I would have higher expectations.   The food is good but just but not to die for and memorable.", 
    "review_date": "2009-10-19"
  }, 
  "Vf3DJncooLUHWYele0Cxrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Impossible to find tiny tiny little place to get Omakase.  The whole experience here is well to be had, but I doubt the place sees many regulars.", 
    "review_date": "2010-03-29"
  }, 
  "rqMYol4ZfvLm9WmIMtV4IA": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Mei W.", 
    "review_text": "7 course omakase for $95 is overrated.   As much as I was hoping to come home and rave about this place, I just can't seem to figure out how other fellow Yelpers can give this place 5 golden stars. My experience here was well, underwhelming and unsatisfying. I didn't just pay $95 for some fried chicken, fried corn and egg plant... which was surprisingly part of our third course. Nor did I expect to have half a strawberry, orange and sorbet as my seventh course as dessert. (C'mon, for a $95 meal you think you'd at least have something better than that!) I have paid $200 for a twenty course omakase before and it was the real sh*t! I'm talking about sashimi and other seafood in every course! Other than the soup that was served as the first course, none of the other dishes here stood out to me. I was pleased to finally see sashimi served as our fourth course; however the quality of the fish was mediocre.  I definitely don't see myself coming back here, not anytime soon at least.", 
    "review_date": "2014-05-25"
  }, 
  "YdRlFZAkjUEhmO1KT7oKtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate G.", 
    "review_text": "i kinda feel like i shouldn't write about kappa because its so special and i want to keep it that way.... incredible japanese food, owned by an adorable japanese couple. get the set menu (although i think you have to) - they make you a special dinner, 7 courses or something crazy like that - stuff like seamed sea urchin... soooooooooooooo good and special and wonderful. i'm pretty sure you have to make a reservation because they buy just enough to feed their guests for the night!", 
    "review_date": "2007-01-24"
  }, 
  "Fs2NdgpjX0AIA5dVrr48Eg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Andrew Z.", 
    "review_text": "I can only say this place is bizarre. I went there saturday night with my girlfriend and there was only one other couple in the restaurant. The food was generally pretty good, some things very good, but some things very poor like the chicken which was of very low quality.   Also, for the price, there is absolutely no way this place competes with the best SF restaurants. Friendly service, but the place was dead calm, no music, no one else talking, just a weird dining experience that was very expensive. One waitress and one cook upstairs from where denny's used to be in japan town. I cannot explain all the very positive reviews, and frankly I am at a loss. I have a hard time believing these reviews are real, but whatever, good luck if you go here.", 
    "review_date": "2012-03-12"
  }, 
  "BQr4xLs0IpO3MBjPe1ns2w": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jaslex C.", 
    "review_text": "Omakase. Kubota and Hakkaisan sake. A wonderful experience that almost lead me to tears. Tears of joy. If you appreciate Japanese food, you will not be disappointed during and after dining here. I dare say its a oral orgasam. Sit at the bar so you can watch the chef owner put your artistic dinner on to the plates. Will return soon.", 
    "review_date": "2012-03-03"
  }, 
  "OUg8qQgRikF-ySoFzuqUzQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "annie d.", 
    "review_text": "this small little joint has a very authentic feel to it. i could have been convinced that i was in Kyoto again. When i was there, there were only two people working: the chef and the Okami-san, and i had a very nice extended chat with the latter (i'm not sure because i didn't try relying solely on English, but i get the feeling that knowing Japanese is very helpful here). There are drawbacks, however. Vegetarian options are limited, and i left $30 poorer and still hungry.", 
    "review_date": "2007-02-28"
  }, 
  "CYvwH-v8pvaR3K3e4jtbrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bunny C.", 
    "review_text": "The location and sliding door are just as the other yelp reviewers have said, hidden, very Japanese and very cute. We sat in the small private room at the small tetragon shaped table and had the omakase. The service was great with the wife in a lovely kimono and very hospitable. Each course came out super quick and nicely presented. The dinnerware was beautiful from crystal to blown glass bowls to traditional Japanese ceramics. The food was well executed but to be honest, it didn't completely blow me away. However, I'm not so in to challenging foods. I'm pretty moderate in my taste buds so some of the flavors pushed my limits although I tried a bite of everything. The wasabi is freshly grated and the tea is matcha. I found the meal generous and I was very full by the end but my husband and I tend toward a small appetite so it may feel light for some folks.", 
    "review_date": "2013-09-09"
  }, 
  "0DqHs2Fyak-6COeZRJEE7Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel A.", 
    "review_text": "I've worked in restaurants. I work in customer service. I know that sometimes things happen and you get backed up and it's hard to catch up, so I'm generally pretty understanding of less than spectacular service, but every once in a while...  Our party dropped in to Kappa for a much deserved feast after a long day of park exploration. We let our server know how we would be splitting our check upon ordering in an attempt to alleviate any confusion. It was fairly busy when we got there, and slowly cleared as the the other guests finished their meals. The staff were running around in chaos. They only had one chef that day, and you could tell it was getting to them.   None of our orders came out together,  but it did get to us eventually and when we finally got our food, it was super bomb. The sushi chef made us a special roll, on the house, which was redeeming.  Even with our orders on separate tickets, it took our server 20 minutes to get us our bills (no really, we went out for a cigarette and then still waited) and a couple of the checks were incorrect.  Kudos to the Kappa chefs, the food was incredible. They just seem to need a little more organization up front.", 
    "review_date": "2012-06-28"
  }, 
  "65uXk38DABB4uofHRP7VyQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Christine C.", 
    "review_text": "4.5 stars for the food, rounded up to 5 stars for the ambiance and impeccable service.   As other's have mentioned, its location is somewhat hidden. For those who remember Denny's in J-Town, this restaurant is located on the top floor of the same building. Denny's is no longer there, but there is signage for Playground Karaoke in the same building; Kappa is located right next door to Playground Karaoke, with old signage on the door for a club that used to be there.  I was in love with this place the moment I stepped through the door. I felt like I was beamed to a small restaurant in Japan, far far away from San Francisco.  The main area has 10 bar seats; the restaurant also offers a private room that seats 4.  The Mrs. is super friendly (w/o being intrusive) and made us feel right at home.    It was our first time at the restaurant so we opted for the omakase (which has to be ordered at min. one day in advance). Kappa's omakase is a 7-course meal (including dessert) and a fair amount of food. Ingredients used on all the dishes were fresh and the Chef Kimura's skills are solid. Unlike kaiseki cuisine that sports complex flavors and more intricate presentations, Kappa offers koryori cuisine where flavors were simple, elegant, and pleasant.  These were dishes in our omakase tonight, from upper left to lower right in photo: <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=IJB-mLcTT_XVewYiVSrZdg\">yelp.com/biz_photos/jI7h…</a>  1) Sake (ordered separately) 2) Tempura fish with lemon juice squeezed on the top, dipped in some fancy sea salt - loved this dish! 3) Crab in vinegar w/cucumber and sesame  4) Asparagus in sesame dressing 5) The main course with 13 items! Fried taro with dark miso, fried fish cake, squid + spicy code roe roll, duck (very flavorful!), egg yolk roll (with seafood on top), ankimo (monk fish liver), shrimp, tofu-mochi (very interesting in a good way), scallops, meatball, anago roll, yuzu radish (super refreshing), and baby octopus (probably my favorite on this plate) 6) Sashimi course: tuna, hamachi, smoked salmon, and halibut w/fresh wasabi 7) Grilled hamachi sushi, unagi sushi, and fried corn 8) Mango mousse 9) Left: Sakura mochi (one of the BEST mochi I have ever had!). Right: Mochi with red bean filling and soy bean powder on the outside  The damage came out to be around the same as Wakuriya in San Mateo so depending on whether you prefer kaiseki or koryori cuisine, you may want to splurge at one or the other. A meal at Wakuriya is generally slower-paced and takes 2-3 hours, whereas our meal at Kappa tonight took ~1.5 hours.  We came on the Monday evening after Mother's Day (probably extra quiet at most restaurants!) and there was only one other couple at the restaurant so it may be a little easier to get a reservation here at Kappa than Wakuriya (which also has limited seating). We'll be back!", 
    "review_date": "2010-05-11"
  }, 
  "6m54nq7IilsWW2wXEd4Vkg": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "tabisky c.", 
    "review_text": "What a great experience to dine here when we made a last minute reservation on the night that the Cherry Blossom Festival was in force. We did not realize that the event was going on and parking was a big issue.   However, we found parking blocks away and were late for the reservation, but somehow it all worked out as our seats were not given out to other patrons.  They are open from 6-9 p.m. and reservations are accepted after 4:30 p.m.  I would love to go back but I do not want to be served the same omakase that I saw on yelp that we were served that evening. I would hope that they would serve a seasonal omakase, so we'll wait 6 months to venture to this place again.", 
    "review_date": "2013-04-29"
  }, 
  "a27Uotn3zg8r2hLi-ckzwA": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Fozzie D.", 
    "review_text": "A wonderful dining experience. The husband and wife team (Toshiaki &amp; Rumiko Kimura) are very gracious and attentive to detail. The food is prepared very simply, highlighting the freshness and depth of taste and flavors. My partner and I went for a special occasion dinner, and as such, we indulged in the Koryori style Pre-Fixed menu (starts at $85 per person and requires one day advance notice). We felt like we were transported back to Japan and some of the great little local restaurants we had eaten at. In completing our total surrender, we allowed the owner to match the food with several appropriate sakes throughout the meal service.  Ambiance is quiet and calm...you know, Zen like feel. They must be doing something right since they have been in business for almost 25 years now.  Well worth the price.", 
    "review_date": "2009-11-12"
  }, 
  "pl5IeWLa9jPcwaABaUk4rA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alvin J.", 
    "review_text": "I enjoyed a nice intimate dinner here a couple weeks back.  I wanted to try something unique and I'm glad I shared in this 8-course Omakase style experience.   My bill came to about $260 for two dinners and an order of sake.  The food was delicious with much of it delicate playful seafood plates.  There's a very attentive couple who run this small establishment with a cute sliding door entrance into a private sushi bar suite.  It's very simple and straight forward inside, but I very much felt like I was \"somewhere else\" trying something different amongst a few other special guests.  I would recommend this place for couples on special occasions.", 
    "review_date": "2014-04-16"
  }, 
  "ilesK4CRarjiblkxUDL_tQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vickie Z.", 
    "review_text": "My mother-in-law and her husband are visiting us from Canada so we decided to treat her at one of SF's best Japanese restaurant.   Not the typical Japanese restaurant nor the typical Omakase.   The location was a bit hard to find but we end up finding it after going up and down on Post street.  We just came back from eating at Kappa. Starved, we ordered the Omakase and got served right away.  The dishes were very flavourful and tasty. Loved the fact that the chef took the time to introduce us to the various types of Japanese food (fried, raw, poached, grilled...etc). It was quite impressive.   The service was excellent. We enjoyed every bite of our Omakase. Personally, I don't think that the dishes they served us were for me (don't take me wrong, I loved the restaurant) but a lot of the dishes the chef served us were deep fried and kind of on the salty side.   After our last dish and before our first dessert, my husband and I asked for some uni. IT WAS DELICIOUS. The uni was sooooo fresh and the portion was very generous!", 
    "review_date": "2011-12-02"
  }, 
  "5IX9FOesKrLRyz618xc6tw": {
    "user_rating": 5.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Helen Y.", 
    "review_text": "i've had kappa bookmarked forever and tonite we decided to go there on a whim. unfortunately (or maybe fortunately) the omakase menu requires at least 1-day notice so that the chef has enough time to prepare the dishes so we were left with ony a selection of the \"koryori\" menu which means traditional Japanese dishes. we ordered the hamachi and maguro sashimi ($25 for 5 generous quality pieces but still overpriced), hirame usuzukuri (thinly sliced halibut presented sashimi style with fresh green onions, spicy radish and ponzu sauce), fresh sardine from Japan simmered in a sweet brown broth, chicken tsukune (3 skewers of savory chicken meatballs), simmered green vegetables with slices of kitsune tofu, and grilled fish (sardine again).  everything tasted wonderful and the dishes were made with perfection but our favorites were the simmered sardine, hirame usuzukuri, and simmered green vegetables!   this is now my favorite japanese place in the city. thanks to the wonderful hostess (chef's wife?) for educating us on how to make authentic japanese broth from boniko and her pleasant demeanor. we will be back for sure!!!", 
    "review_date": "2009-02-10"
  }, 
  "AubdZjrTVXkyN8uPoUw87A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chie J.", 
    "review_text": "Very Authentic Japanese restaurant.  It was very refreshing experience since I am getting sick of Assn-Fusion and \"creative\" sushi these days.  I liked their simple and traditional dishes.  They also had great dry sake list (5 stars) including Otokoyama, Hakkaisan, Kikusui, and Kubota etc...   Over all 4.5 stars - I liked everything I tried: 1. Hirame Usuzukuri (thinly sliced sashimi) $25 - very fresh and great quality -5 stars 2. Hirame with Salted seaweed (sashimi) $18 - great combination of Saltiness and sea aroma. -5 stars 3. Squid and Uni sashimi $25 - my favorite combination in general but it was not that great here... Little disappointed.  Squid was not soft and lacked sweetness -3 stars 4. Maguro yamakake $25 - Very nice Big-eye tuna with Japanese raw potato and real wasabi on top.  Classic goodness -5 stares 5. Tsukune (chicken meat balls on stick) $8 - Average.  I can make much better one. -3 stars  6. Satsumaage (fried fish cake) $8 - one of the best I had in the US (the best one is in Kichijyoji Tokyo ttp://www.good24.jp/shop/l006.html) -5 stares 7. Katsu (panko bread crumb Fired Black Pork) $15 - Very juicy!  Best dish I had at Kappa.  - 5+ Stars 8. Grilled Chicken wings $8 - nothing special - 2 stars 9. Pickled red tuneup $8 -nothing special - 2 stars  10. Grilled Fish $15 - Very nicely grilled.  Not dry - 5 stars 11. Ochazuke (rice with hot tea or broth over it) $8 -very nice broth.  Great way to finish dinner. - 5 stars   I want to go back and order 5 orders of Fried Black Pork and tons of cold sake!", 
    "review_date": "2007-10-23"
  }, 
  "aFnYKllcqto1p_ZnxOT31w": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Michael W.", 
    "review_text": "Boring, uninspired food and stingy substitutions.  I had the omakase menu like everyone else and was assured that they would substitute some things on the menu, as I told them I was allergic to crab and lobster.  But when the dishes came out, it turned out that three dishes had been substitued with daikon!  So while my dinner mates feasted on crab and lobster, I just had pickled daikon.  They didn't give me any additional dishes or a discount off the omakase price, either.  The rest of the food was also not very memorable, and certain not worth the price.", 
    "review_date": "2010-03-28"
  }, 
  "sXKmP90GCdF0oM0AzYRhaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rika P.", 
    "review_text": "Sure, the place was tucked in a small dark corner of a place, and there wasn't any sign of restaurant around it, just a shut-tight dark sliding door, but there is a small sticker that says \"KAPPA\", which helps a little. Otherwise, the dishes crafted by the lovely husband and wife inside was worth to go hunting for! As you go up the stairs on the corner of Post and Buchanan, you'll find 2 doors. The left side has a neon sign that says \"Playground\". The left is an open glass door with \"Milo Lounge\" sign. Walk past the Milo door and standing right in front of you is Kappa's shut-tight door. Slide the door and you'll enter Japan.  When I said Japan, it really feels like you're not in San Francisco anymore. They specialized in Omakase, in which you're served a 7-course meal that includes very small, delicately prepared dishes. Each ingredient is carefully selected, making sure that they use the best graded ones in the market. Having to experience omakase for the very first time, it turned out to be an exquisite dinner. There was always an \"Mmmmm\" moment in every dish served.  So the 7 course breaks down to:  1. Clear soup with a snap pea, and halibut wrapped uni and a slice of yuzu peel. So subtle and delicate, it opens up your appetite and gets you ready for the following courses.  2. Goma-ae. Spinach and wakame smothered with a sesame-mustard paste, and paired it up with a piece of seared maguro block. This is intense, as the sweetness of the mustard and sesame rushed in, then calms back down as you savor the maguro.  3. Sunomono. A vibrant cucumber salad, so fresh and mouthwatering. Pairs it up with a chunk of king crab meat. (could be a dungeness or blue)  4. A fun combination platter that has 12 different things: -Boiled prawn -Unagi jello -Yolk sushi (so creative and yet so yum!) -Tonkatsu -Yakitori -Sweet corn fritter -Hamachi with ginger and soysauce -Adzuki konyaku -Asparagus with sesame paste -Herring roe -Duck breast with red miso -Grilled smoked salmon  5. Sashimi Moriawase (we were served the freshest uni, hamachi, maguro and halibut)  6.  A plate of Unagi (perhaps the BEST unagi ever!), baby scallop in its shell.  7. DESSERTS! There was icecream and home made adzuki mochi (wife made these), red bean jello, a slice of grapefruit and a slice of pear.  Everything goes well with sake! omg. I will totally come back!", 
    "review_date": "2012-02-06"
  }, 
  "epeDgCUc6WZm38bOMXIh1g": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Christine G.", 
    "review_text": "Great, great, great experience for me and Mo. The atmosphere is a little intimidating at first because of the smallness of the space. Also can be hard to find if you aren't careful and prepare beforehand. So be sure to leave enough time before you reservation to find the place.  Decor: Clean, very classic japanese, small, very intimate 10 seats MAX (thus reservations are a must-do).  Service: Very Japanese, hot fresh towel before and after meal. Wife and husband duo have clearing been doing this a long time and work very well together. Every part of your meal with be timed almost perfectly. No need to worry about anything while here.  Pricing is steep but for us was worth the splurge for the omakase experience.  As for food...Mo and I thoroughly enjoyed our experience. I have tried many things but I still was able to experience something new here at Kappa and maybe even a little out of my comfort zone. Something to be prepared for is that is NOT your typical run of the mill Japanese restaurant. Almost everything if not everything is prepared and produced by the owners. Thus the price. The style of cooking is very homey and all of the preparations are classic Japanese. If anything you are getting Japanese cuisine in its purest form. No fuss. No fancy foams or heaping plates full of food. SIMPLICITY is the theme and the key here. Food at its purest form with as little done or added to it as possible so that you are actually tasting the ingredients. If your not down for that Kappa is NOT the place for you. Mo and I went in knowing that and we had a lovely meal.", 
    "review_date": "2014-06-29"
  }, 
  "d1iQ6JAdwg3meF9WOND3og": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Delilah B.", 
    "review_text": "Kappa is a quiet little Japanese restaurant with excellent food.  There's a 10 stool bar and a little corner that can fit a party of about 4.  The décor is nothing extravagant or overly fancy.  Don't get me wrong, it's still exceptionally charming and quaint.   The service is EXCELLENT!  There was always a constant flow of attention to every group.  You're never left waiting for any period of time.  Each meal arrived shortly after the next, all done by one beautiful, courteous Japanese woman.  Impressive.  The food in and of itself was phenomenal.  Each and every unique item on the dish had its own distinct flavor(s).  The combination of ingredients were well thought out and blended well in your mouth, not one thing overpowered the other.  Harmony.    Of the all Japanese restaurants that I've been to here in the city, let alone all my travels, this is definitely on my top 3 and one of the most memorable ones.  The Omakase experience is definitely a must.", 
    "review_date": "2011-11-02"
  }, 
  "PGgoW9yvAd7dBgTWzI82RA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Solomon B.", 
    "review_text": "Went here the other night and found the food to be hit and miss. We did the omakase, which based on reviews here we had expected to be amazing. While we enjoyed the small setting and excellent service, we found ourselves thinking several dishes would have been better warm (e.g. the salmon, stingray, duck breast and others). The sashimi included was fresh enough, but fairly standard (maguro, hamachi, and saba). Overall, it was fine but nothing wowed us.  The tea and sake were great though. Instead of some cheap green tea, they served a nice matcha.", 
    "review_date": "2010-12-05"
  }, 
  "Zl-8Z8pnJpSFkUucscS0GQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dennis M.", 
    "review_text": "Behind the sliding wooden door is a wonderful, friendly Japanese koryori meal experience. We enjoyed 6 courses: monk fish liver, crab and cucumber salad, steamed rock code --- crispy pork (katsu) --- grilled eel, sashimi tray, soup with pumpkin and green vegetables, and dessert tray. The sashimi contained the freshest halibut and salmon roe I have ever tasted, and a delicious first for me, sea snail. The dishes were served one at a time with a description of each. This is a very small restaurant (sushi like bar with about 10 stools and one small room with a table) so be sure to make a reservation.", 
    "review_date": "2006-12-10"
  }, 
  "Tfk9xr5E5ZqaNLjUJBFerw": {
    "user_rating": 5.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Chun C.", 
    "review_text": "The place is difficult to find - 2nd floor, share the same entrance with Milo Lounge. Definitely a hidden gem! We were the first customers at the restaurant since we made the last minute reservation for 6pm. We tried their Omakase - 7 courses, each is impressed. My favorites are -  Snow crab &amp; dungeness crab with cucumber in a vinegar broth - the very original taste reminds me the childhood summer days, it's so refreshing.  Variety Platter is fun - the Japanese lady also introduced that the decorative leave is the fresh wasabi leave, you can actually taste the wasabi from the stem. She also showed us the fresh wasabi root!  Sashimi are fresh - I love amberjack's texture and I love the taste of the fresh wasabi so much that I ask for more =)  Seared toro on rice -  The strong flavor of the seared toro along with the fermented rice made it the highlight for me!!  Overall, it's a very enjoyable experience. Besides the food, the Japanese couple are so nice and we would definitely come back again!", 
    "review_date": "2013-11-18"
  }, 
  "5S8gujNxsB3x4rUOcOK_dA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frank F.", 
    "review_text": "Mecha Mecha Umai!  CALL Ahead to reserve the omakase\"shef special\" and Please don't cancel your reservation, as it is a small mom and pop shop and they will spend time preparing your meal ahead of time.  Food is excellent even for those who have lived in Japan like me, and it is expenisve b/c it is small, place only seats like 10 total.  If you don't know Japanese culture very well, be careful, infact, maybe go some  place else as this place is for those that appreciate japan know somthing more than \"konichiha\" and \"oishi desu\".  I am disapointed to see the lame postings by the clueless morons who had no Idea what to expect, read a flipping yelp review!!  cost $210 after tip for 2 people.  If you have a Japanese friend and you want to surprise them, I think you couldn't go wrong taking them here.", 
    "review_date": "2009-08-06"
  }, 
  "eqh9P_kmoA2lCFKuRBZCvw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "What could be more fun than finding a hidden wooden door that slides open to be greeted by a woman in a kimono?  The restaurant is small and cozy and the husband and wife who run it are very sweet.  Not the place for you if you are looking for something very intimate; I think I saw one table off on the side by itself but all the other (8 or so) seats are sushi bar style - you can keep yourselves to yourselves but hard to ignore others if they are loud talkers.  We had the omakase fixed menu and it was DIVINE.  Every course was different - the flavours were amazing and each dish was so beautifully presented.  They were very accommodating with a shellfish allergy with no problem.  We even got a beautifully wrapped gift (sake glass) when they overheard it was my husband's birthday.  A little pricey but I am looking forward to going back someday!", 
    "review_date": "2011-10-24"
  }, 
  "rNt-QP--3Cb0lvJCPU_Nlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "bisou m.", 
    "review_text": "I thought I was in a Tokyo izakaya (only without the heavy smoke!).  It was a full house--3/4 of the clients were Japanese and the menu on the wall was all in Japanese.  I really enjoyed the grilled tuna belly, monkfish liver pate and sliced hirame with ponzu sauce.    I came here for a pre-Valentine's special dinner.  So beware, it is expensive and more of a place to savor food slowly with some sake.", 
    "review_date": "2008-02-14"
  }, 
  "77dqNHQB-XujnDs35RlKqw": {
    "user_rating": 5.0, 
    "user_location": "Sonoma County, CA", 
    "user_name": "Lee S.", 
    "review_text": "Once you find this tiny, charming little place (it took us 1/2 hour)....you'll be rewarded with a traditional Japanese dining experience of the best kind.  There were only six diners during our visit, and it was nearly full.  But the beauty is the pacing, the service, and the wonderful couple who will provide you with an authentic experience that is tough to find outside of Japan.  Go here.  Go with the slow flow.  And savor every moment.  It's art.", 
    "review_date": "2014-11-08"
  }, 
  "H7I6AKkYu-1jemA5cEVu4w": {
    "user_rating": 5.0, 
    "user_location": "Tokyo, Japan", 
    "user_name": "トモ T.", 
    "review_text": "Possibly the best Japanese restaurant in the city of San Francisco.  Go to Kappa for absolutely amazing Japanese culinary experience, however you may go home disappointed if you approach this place with the wrong expectations.  I had to think long and hard before making the difficult decision in post this review.  Why?  A 'wrong' customer going to this place would be disappoint and as the result, be frustrating to the owners.  They don't have a sign outside the building for reason.  They are not looking for a casual tourist to bump into Kappa; they can go to Mifune and Osaka-ya instead.  They are not looking to fill the place to the maximum capacity every night with a line outside the door; leave that to Sushi Zone.  They are looking to build a relationship with the regulars and present them with the best seasonal food in the comfortable cocoon that reminds you of places in Japan.  When you are inside, you could almost forget that you are in the U.S.           Kappa is a Ko-ryori specialty restaurant. 'Ko' = 'Small' 'Ryori' = 'Cuisine'  Ko-ryori restaurant captures a special nitch in Japan for businessmen dining alone or two co-workers bonding over sake.  It attracts customers who care about the quality of food and sake.  Many are small, operated by a single chef serving counter seats only.  People come to places like Kappa to eat the seasonal food made from the best ingredients, with minimal handling, enjoying the taste of the ingredient.      Is it...  IZAKAYA?  Nope.  Izakaya is characterized by a lively casual environment, more beer than sake, and often cheap.  In some cheap Izakaya, people order sake without caring about the brand, and eat food which is sometimes microwaved.     KAISEKI?  Nope.  Go to places like Kaygetsu (<a href=\"http://www.yelp.com/biz/4ok9qA8DJMCzOeqv25u0hQ\">yelp.com/biz/4ok9qA8DJMC…</a>) or Kiku of Tokyo (<a href=\"http://www.yelp.com/biz/MAA074Az23TmXMoufOPtOw\">yelp.com/biz/MAA074Az23T…</a>) for Kaiseki style food (<a href=\"/redir?url=http%3A%2F%2Fen.wikipedia.org%2Fwiki%2FKaiseki&amp;s=24f556a26a3b18acb890e18c8be361424577921211e13717ee5ac01796a004ab\" rel=\"nofollow\" target=\"_blank\">en.wikipedia.org/wiki/Ka…</a>).  For the most part, kaiseki involves lots of prep work, dishes that involve lots of handling.  Places like Kappa, or Tekka (<a href=\"http://www.yelp.com/biz/BLcV0Z4nzKLkCjneKrTclA\">yelp.com/biz/BLcV0Z4nzKL…</a>), operating in a wife and husband team, cannot serve complex dishes.  Kaiseki is often served in Ryoutei --- which is known for private rooms.  Many come in medium size groups, often for business dinner.  SUSHI?  Nope. NO SUSHI at Kappa.  Japanese visitors are often amazed by the amount of Japanese restaurants in the U.S. that serves sushi.  If you go to a town in Japan with 10 restaurants, only one would be a sushi restaurant.  Here, everyone makes sushi!  I really applaud Kappa for sticking to the roots/principles by not folding to the American customer demand.  I bet that if Kappa chef wanted to make sushi, he could make it better than 90% of the sushi chefs in San Francisco.       So, do you still want to go there?  If so, continue reading.  HARD TO FIND:  I highly recommend making your first visit to Kappa with someone who has been there before.  Ever since reading Dan V.'s (<a href=\"http://danv.yelp.com/\">danv.yelp.com</a>) review explaining that it's on top of Denny's in J-Town, I was in a mad hunt to locate it, peeking into the Korean Bar, wondering if they are actually a Japanese restaurant.  After an extensive search, I finally found it.  They don't have any English sign on the entrance, so I needed to bravely open the wooden sliding door.  This does not mean they do not welcome non-Japanese customers.  In fact, they want all customers to enjoy their food...as long as they don't start demanding California Rolls.  SEATS:  They have about 8 counter seats and one table for three.  They do take reservations.  MENU:  They recommend Omakase (chef's choice) ($85) for first time visitors, which requires one day notice.  The menu is written on the wall behind the chef (in Japanese); they also have an English menu (see pictures).      I had: Sashimi (hamachi, maguro, clam) Hirame with ankimo sauce ($15) Crab sunomono ($18) Tsukune ($8) Grilled Unagi ($15) White Pickled Turnup ($15) Grilled fish Aka-miso with clams Onigiri (rice balls) with salmon Tara Shirako (cod milt) Takenoko with miso (bamboo shoot) Grilled soramame (fava bean) Maguro yamakake Nanohana Oshitashi (celery cabbage) Karashi mentaiko  FOOD:  Delicious!  Owners are from Hokkaido, the northern island of Japan, known for good food.  Each dish is small, but the quality is top notch.  They try to avoid unnecessary seasoning, so most of their dishes were prepared with subtle flavoring.  Food really goes well with Sake.  They have about a dozen selections of sake, including Hakkai-san, Otoko-yama, Oni-koroshi, etc.  LAST WORDS:   - Again, NO sushi. - Come alone, or with one other person.  Never in a group. - Don't come here to chow-out.  Stop by In-and-Out afterwards, if you are big eater. - Expect to spend about $60-100/person.", 
    "review_date": "2007-02-04"
  }, 
  "-pG4fm6eWoGLP6fIsFBvzw": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Teri Y.", 
    "review_text": "Kappa is not your typical Japanese restaurant. What makes it special is that it focuses on omakase, which means diners let the chef decide what he thinks is best in terms of the food that he would like to serve you that night. This is an excellent dining experience for people who are serious about Japanese food. Sometimes people only associate Japanese food with fancy rolls and tons of (unnecessary) dressing that is not representative of real Japanese food. Therefore, Kappa is a breath of fresh air that gives us a glimpse into real and authentic Japanese food.  Kappa is run by a husband-and-wife team. The husband is the chef and the wife helps out in serving. All the food is prepared by the husband so you will know that everything is handled with care, as they don't hire anyone else to help out at the restaurant. The restaurant seats no more than 10 people so be sure to make a reservation.  We had excellent food such as sea urchin and whitefish in clear soup, seared tuna, scallops, etc. Each item allowed us to savor and appreciate the main ingredient used for the course. I also had the best mochi dessert at Kappa. My husband loved the green tea cheesecake and he doesn't even like desserts usually.", 
    "review_date": "2011-11-14"
  }, 
  "DK57YibC5ShBmqQl97CKog": {
    "user_rating": 5.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Karen W.", 
    "review_text": "Quite possibly one of the best Japanese meals I've had.  We had the omakase menu, and each selection was exquisite, full of complex flavors and textures, and visually stunning.  The couple the run this restaurant are very friendly, and I love supporting small scale mom-and-pop operations like this that focus on quality, authenticity, and treating their customers right.  P.S.  This restaurant can be very hard to find!  Go upstairs from the now abandoned building that used to house the \"Dennys\" which then became \"New Danny's\" which then apparently became \"New Minnies\" and go through the entrance that says it's for the night club.  There will be a sliding wooden door, go through that door and you will be welcomed by the lovely Japanese couple!", 
    "review_date": "2012-10-26"
  }, 
  "BIkivGwMblK3_r2N0pSE8A": {
    "user_rating": 5.0, 
    "user_location": "Silicon Valley, CA", 
    "user_name": "Lance W.", 
    "review_text": "Many things have been said about Kappa, I won't repeat them other than to say that dining here is a unique and beautiful experience.  The husband and wife team have been operating Kappa for over 25 years and they still seem to have a passion for what they do.  The passion is evidenced in the cuisine that they offer at Kappa and in the gracious way they treat their customers.  As others have stated, on your 1st visit go with the Omakase meal.  $85 for a tasting menu that will likely push your palate to new places unless you are very experienced with Japanese cuisine.  Kappa will be my go-to place when friends visit me in San Francisco and are looking for a truly unique experience.", 
    "review_date": "2013-09-19"
  }, 
  "GqFD0qdPz0yAEi9akVeJ9g": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Donnette O.", 
    "review_text": "If you're looking for a unique dining experience in Japantown, this place is great.  It's above the \"New Minny's\" (guess it was a Denny's) - just go up the stairs and look for the small lettering on the door.  We had the omakase and it was well worth it.  Every course (six of them) were explained in detail by the chef's wife who was very cordial and interesting to speak with during the evening.  She was very good at suggesting the right sake for our taste, also.  The food was exceptional and beautifully presented.  We'll definitely go back the next time we visit Japantown.", 
    "review_date": "2009-11-30"
  }, 
  "9P9udGjQeF1TBhCCcBHTIQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kiko' N.", 
    "review_text": "I took my assisted elder Larry to mot wonderful real Japanese  spot! kappa! for celebrate his Chinese new year! i have to treat my Chinese gland pap once a year!  he enjoy it so i did! beautiful wife and very nice chief husband.beautiful  artistic meal come with great taste.they been there 24yrs what a shame i didn't know this place until i found from yelp! thank you to yelp. EVERY PEACE OF MEAL YOU LOOK FIRST ENJOY HOW THEY DECORATE AND AFTER PUT IN YOUR MOUTH ENJOY EACH taste IS SO DIFFERENTLY .. highly highly recommended. if you really like real Japanese quality meal. i want take my friends and my old brother and brother in law pretty soon. just get in place made me feel relaxed. i have broken rib, trubles.etc... but this place come me down. great meal so small but taking time to eat make you full. so great. thank you for keeping  real Japanese heart in sf. there are so many fake in this USA. but not kappa!!!!! every yelp friends who love real Japanese food please try!!!", 
    "review_date": "2013-02-09"
  }, 
  "d32yUyhorm0uuNkW6-6YrA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Wtf D.", 
    "review_text": "Kappa is hands down one of the best dining experiences I've ever had.  The entire possible range of Japanese cuisine is explored in 7 courses hand-picked by the Chef of this husband and wife restaurant team.  I have never experienced sushi of this grade and quality anywhere - and I've had sushi all up and down the West Coast.  Honeslty, I could not begin to describe the range of incredibly flavors and textures of this meal -- hot dishes, sushi dishes, modern salads, hand-crafted desserts.  The dungeness crab was to die for.  And the sake -- the amazing sake!  The wife half of this team made the most perfect sake recommendations and provided meticulous, attentive service.  Hot towels before and after your meal, beautiful place settings.  Honestly, this place is the total experience.  To top it all off, when the wife found out it was my partner's birthday she disappeared momentarily and came back with a gift wrapped box that contained a really pretty sake glass (and no, she did not know in advance).  They are just lovely people, who have run this restaurant for 25 years, and really embody a \"mom and pop\" high dining, Japanese experience. Worth absolutely every penny.  Go!", 
    "review_date": "2012-06-05"
  }, 
  "NtaJYAQAlqI9IaBak_6biQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophia Y.", 
    "review_text": "Only those in the know eat here. Now I am sharing it with my friends that follow on yelp...  finding this place is 1/2 the fun. I heard about it from my friend \"above the Denny's in Japantown.\"  you go above the denny's and you see a karaoke place and a small sign next to closed wooden door. If you read Chinese, it says \"small eats\" (or so tells me my friend) if you read hiragana the sign says \"kappa\"  so, we knocked on the door. We asked if they were open b/c of the closed door. The waitress said yes \"but we don't serve sushi.\"  I thought to myself good b/c I don't do raw. When we said can we come in. The waitress again said we don't serve sushi. i said fine. Then she brought the menu to make sure we were ok.  It is high-end japanese tapas or food to go with drinking. they serve sashimi but not sushi.  divine fatty pork, divine everything. very pricey. very small, only seats like 7 at the bar, and 1 room of 4 people...  reserve in advance or risk being turned away. or perhaps just try dropping in...  there is just the chef and the waitress (wife). perfect service.", 
    "review_date": "2006-09-06"
  }, 
  "JKVvXX-hdybAf0f2ZJ9vrQ": {
    "user_rating": 5.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Norases V.", 
    "review_text": "Very authentic. Went on a date night with my girlfriend. There are only about 10 seats at the counter and a private room (can fit probably 10). Make a reservation in advance! Our favorite items were fish liver, miso cod, snow crab on light vinegar reduction, green tea mochi, homemade strawberry-rasberry sorbet. Every The hostess was extremely nice. The restaurant has been around for 25 years! The chef really made great presentation for every dish we had. It is $110 per person after tax+tip so it is perfect for a special night!", 
    "review_date": "2012-12-13"
  }, 
  "GfB6sC4NJQvSI2ewbQrDNA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitch A.", 
    "review_text": "I went to Kappa because of a recommendation from the master of Japanese food, Nobu K, and because I like very authentic Japanese food.  When we arrived there were other people looking for the entrance too.  It's kind of hidden with only the name printed in Japanese.  We eventually found it and walked into a very small place. They greet you with the standard \"Welcome\" Japanese greeting and promptly seated us at the bar.  The menu behind the bar (I think it's a menu ;) )is all in Japanese but they have one menu that's translated into English.  You can order off of the menu, or they will make you \"omakase\" which means that the chef picks it for you.  For this you have to order one day in advance.  They have one table and a sushi bar which sat about 8 people.   The atmosphere is very Japanese and we were the only couple at the Sushi bar speaking English.  It really reminded me about my trip to Japan.   They start with a piece of fish (think it was salmon) which was cooked in a small bowl.  Very tasty and cooked to perfection. We had the Hirame with salted seaweed.  This was amazing.  The seaweed and the sauce it had complimented the fish perfectly.  The next dish has a bit of a story behind it.  So, I thought that I'd order one of the specials which she said was \"fish roe\".  It sounded interesting and I like fish eggs.  When we get the dish, it looks like kind of small sacks.  It was really slimy in a sauce and some onions.  We tried it and it tasted good but the consistency was really strange.  We tried to also pick it up various times with our chopsticks in small pieces but it kept attaching itself to our chopsticks with these huge slimy sacks.  We asked her again what it was and she said \"you know the female fish, well this is the male\" Well, at that point we determined that we were eating fish \"sperm\" but we tried to not say anything between us so that way we can try getting it down.  It was really difficult and I didn't want to seem like we didn't like it, because that can be translated as an insult in Japan. Eventually, after about 4 dishes, she finally took it away and we mentioned that we were just \"full\".  Authentic, from what I have seen especially Japan, means eating all types of things that we are not accustomed to, and this one definitely was on the edge.   Then we had: Japanese Bamboo with a spicy green Miso sauce  - Amazingly tasty and the sauce was perfect.  The bamboo was very juicy A few select pieces of sushi which the chef picked for us.  It was amazing and melted in our mouth's.  I usually never eat sashimi but this was VERY flavorful and tender.  Cut perfectly and not a bit of fat in it. Grilled Unagi --- Probaby the best Unagi I've ever had.  It was cooked to perfection right on the skin.  Very tasty and tender. We were pretty full, but they suggested we try some type of Beef stew.  The Beef was so tender and tasty and it came with some vegetables and potatoes.  Amazing and I couldn't believe how light it was.  When we ordered it we asked for a small order and he said \"no\".  He knew that we could stomach it down. She suggested that we try the Mochi for dessert.  It had red bean paste in it and at one point we bit into a strawberry.  It was amazing!   We also had some amazing Daigingo Sake, I had 2 Soju's which she recommended and some Green tea which was very good.  This place isn't for everyone, especially if you don't have an open mind.  If you are a typical American which craves X mixed with X in some kind of roll this place isn't for you.  It was AMAZING and as soon as I get my next bonus check, I'll be running back. :)  No more fish sperm for me!  ;) Update: <a href=\"/redir?url=http%3A%2F%2Fwww.flickr.com%2Fphotos%2Fmarc0047%2F300524889%2Fin%2Fset-72157594465282534%2F&amp;s=6cffd14fe4b8112568bd5ac5535e6a6fc5eba31014458c0749523ecf98c47ca4\" rel=\"nofollow\" target=\"_blank\">flickr.com/photos/marc00…</a> So check this out, I found a photo of it on Flickr, it's called Shirako and it actually means \"white children\".   It's a delicacy in Japan.", 
    "review_date": "2007-04-02"
  }, 
  "NK-zIxHMuTnLRU0RhoZWqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonas T.", 
    "review_text": "Great food, great atmosphere, great service. It's like stepping into a different world (or country). My favorites were the dungeness crab in a vinaigrette dressing, the sashimi (I've never had fish so fresh before), and surprisingly to me, the monkfish liver pate.  JONASAPPROVED!", 
    "review_date": "2007-12-20"
  }, 
  "BVaLu0XGQfCocZZelk7L1w": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "C M.", 
    "review_text": "Great experience! Just surrender and let the chef surprise your senses. One of the sweetest Japanese experiences in San Francisco!", 
    "review_date": "2014-10-19"
  }, 
  "LOAo5pHUxrOaZUQN359hoA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Joseph G.", 
    "review_text": "Very tasty food and so simple and clean. Very Good service.  Mrs. Chef is very nice and took the time to describe each dish.  If you want a quiet place to have a good japanese meal this is a good place to check out.  Although the portions were small for some reason I did not leave hungry, but content and very pleased with her hospitality.  Check them out they are right beside playground karaoke bar.  It was a cool experience :-)  I'll go again but I would explore the menu.  If its your first time you should try the Omakase to get an idea of the other japanese dishes.", 
    "review_date": "2012-01-15"
  }, 
  "9zEr_yHvIKVQ7m0VDnc7gg": {
    "user_rating": 5.0, 
    "user_location": "Calgary, Canada", 
    "user_name": "Ange T.", 
    "review_text": "Coming from Calgary, Canada, there isn't much of an omakase scene compared to San Francisco. With much deliberation and research, we finally decided to try Kappa as our first omakase experience.  The experience was worthwhile. Our hostess and chef were beyond courteous, it felt like we were honoured guests in a home of an old friend.  The meal was fantastic. We were served 7 course items that was delicious. Not being an expert on traditional Japanese cuisine, I can certainly say it was a refreshing break from the usual items offered at other Japanese restaurants. I only wished I was a San Francisco resident that I could frequent Kappa more often and the chef can create more personalized dishes .Our hostess made excellent sake suggestions according to preference and was a very warm person to converse with.  The price was a little on the expensive side, but this is fair considering it was a fine-dining experience.", 
    "review_date": "2010-11-25"
  }, 
  "qqyxCOZSxXcKdf_3fQFbKA": {
    "user_rating": 3.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "TIM M.", 
    "review_text": "Spicy Country Roll was just what I needed.", 
    "review_date": "2013-10-04"
  }, 
  "uO_Fbh_k28FGt4yqXdysCQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kapo T.", 
    "review_text": "this hidden gem in japantown is really HIDDEN! i only knew about it because my friend took me here. i usually come here on a weeknight so it's pretty quiet here. their fishes are SOOO fresh! they will tell you what fish is fresh for the night. also, ask the waitress what she recommend, she's always recommended dishes that was amazing! i haven't been there in a while... hope i can go back soon!   take a look at the specials and order a few dishes off the specials! you won't regret it!", 
    "review_date": "2010-04-27"
  }, 
  "Yz6VVf1KhzbiZU9mvxsb9Q": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Foodie C.", 
    "review_text": "What can I say ?  I simply do not understand the 4 and a half rating, assuming most reviewers were qualified foodies.  Nope, there was nothing wrong with the omakase dinner for $85.  As a matter of fact, the price is more than reasonable compared to what you will have to pay in Tokyo.  The good:  As other yelpers pointed out, the sashimi was very fresh and they did serve with grated fresh wasabi which is a huge plus. Presentation was acceptable as I think Kaygetsu in Palo Alto did a better job, consistently.  The bad:  Ebi shioyaki was not prepared from live spot prawn but previously frozen from any Asian market.  Kurobuta was the toughest I have tasted.  For much more tender version, try Sushi Sam in San Mateo.  Grilled chicken meat ball was served cold and tasteless.  Kazu in SF uses organic chciken meat made fresh as you ordered.  The ugly:  Marinaded kampachi was overly salty, with a strong fishy taste.  How about trying black cod in miso broth at Bonzu in downtown SF.  When asked to substituted for my friend who has food allergy, my friend received 2 pieces of daikon in place of frozen crab meat.  Not acceptable.  Overall, the decor reminds me of very authentic high end eateries in Tokyo, the atmosphere was very pleasant and comfortable which deserves one star.  For food, definitely two.", 
    "review_date": "2008-09-20"
  }, 
  "3S53VaMDPy8Lywk2TuPb4A": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Mark D.", 
    "review_text": "This is such a unique dining experience.  My dinner companion had eaten there before.  We have visited numerous restaurants and she suggested that I would enjoy Kappa.  I phoned and made a reservation.  The hostess asked me to phone the day before to communicate if we would be dining prix fixe or ordering a la carte.  I asked my companion what she had previously done there and she said prix fixe.  So, I phoned Kappa and communicated our choice to the hostess.  We had a quick drink at the Playground next door and then went to Kappa.  As stated in other reviews, it is tucked away upstairs over what used to be the Japantown Denny's.  This is a very small restaurant.  I think it seats a total of 14.  Ten seats at the \"bar\" and a small private room for 4.  It is only open from 6 pm to 10 pm (closed on Sundays).  The last seating is at 8 pm.  It is a intimate space.  Many restaurants have friendly service.  The service at Kappa goes beyond friendly.  It is kind.  It truly does feel like you are being invited into the home of the husband and wife team.  He is the chef.  She helps with preparation and provides front of the house service.  She is very patient.  She explains each dish.  She keeps the meal moving along without any sense of rushing the process.    Overall, the food was very good.  I do agree with a comment I read in another review that it might be nice if there were a few more warm dishes.  I am not going to provide great detail on every single dish.  But, I will quickly cover them.  It is a unique set of courses.  Course #1  Eggplant with dried bonito  This was a delicate dish.  The eggplant was tender without being mushy.  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F4326jhb&amp;s=80c004a976f1bea44d5ba3e3715cdb21cecdf68c6df8d868a9643b31394b1d5d\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/4326jhb</a>  Course #2  Dungeness crab with vinegar sauce  This was very good.  The tartness of the vinegar sauce was such a great background for the sweetness of the dungeness crab.  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3up7vn7&amp;s=af4a0b96a57cb6fb7f984a2f373b30892cec6bd8a844e6f2b7f3098c20a93c55\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3up7vn7</a>  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3k7w7n2&amp;s=6565604179d20eceb2bbc41516ad7606d63a0d29aabe5dd52b70df63db740beb\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3k7w7n2</a>  Course $3   Asparagus with sesame paste  This was a enjoyable dish.  There is a grittiness to sesame paste that I do not prefer.  However, with the asparagus it worked well.  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3zn2lut&amp;s=aece569a23d3578a5a2e32f551b1cae2a075f351f6e6e8cbfc7d6881873491c8\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3zn2lut</a>  Course #4  Mixed Plate - I am going to try and remember what each item on the plate was.  Rock cod, duck, squid wrapped around some type of spicy seafood, a type of fish I do not remember, egg, pork roll, whole prawn, tofu, sweet corn fritter, chicken ball on stick, hamachi  This was a very eclectic plate.  For the most part, it was an excellent culinary experience.  The squid was a little tough.  The chicken had a very unique texture.  I am still not sure whether I enjoyed it or not.  The tofu was the first tofu I've ever eaten that I thoroughly enjoyed.  I would have preferred the duck to have been heated.  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3nopls2&amp;s=f4ec796579c33d31de8e066df91636a68f0308ec69738fa73a9ea0a0906a303e\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3nopls2</a>  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3qat2xo&amp;s=d55b5b1e6056d6865d323bb7bc5c4fdd26a048c34f611ec3f98329373846ac10\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3qat2xo</a>  Course #5 - Sushi (hamachi, bluefin, yellow-jack) - I boycott bluefin tuna.  However, it looked amazing.  My friend does not boycott it so she was able to eat hers and mine.  The other sushi on this plate was very fresh and well cut.    <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3zel3el&amp;s=32bfc372c5f194d7e2fce549d59aa20706f6a60e25d42507b8a25eee7b9e6ae4\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3zel3el</a>  Course #6 - Sushi (toro, unagi, clam) - This was an amazing plate of sushi.  The toro had a nice touch of smokiness.  The unagi was simply perfect.  The clam combined with the fresh green was a excellent combination.  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F43cylky&amp;s=b7ad48138b5c13a4b3f2827e922770e69fbf96fb4756814c983a191d5319bb8f\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/43cylky</a>  Course #7 - Dessert - This was a dessert trio plus a ice cream with cheesecake and mango.  One part of the trio was a mochi dessert. I do not really enjoy mochi.  The remainder was very much to my liking.  The cheesecake with ice cream and mango was a heavenly dessert.  It was so good that I forgot to take a photo.  <a href=\"/redir?url=http%3A%2F%2Ftinyurl.com%2F3twtc4h&amp;s=478cd97279abc90fbf1eeaab9a454fae7e216a1b16a219a801e30d8260ae6092\" rel=\"nofollow\" target=\"_blank\">tinyurl.com/3twtc4h</a>  Overall - The food was very good.  But what really brings this together is the intimacy of feeling as if you are truly being served a meal from very kind hosts.  It is a unique evening.  I will note though.  If you plan on taking a guest insure they are adventurous with cuisine.  We both are and, for us, another part of the experience is trying different dishes.", 
    "review_date": "2011-06-15"
  }, 
  "XOFEzOrwphwy_wfa66Sezw": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Elena G.", 
    "review_text": "Kappa Japanese restaurant has very traditional cuisine. A Japanese couple is operating this very quiet little restaurant. The dishes were so good. We love their food.", 
    "review_date": "2014-09-29"
  }, 
  "ZMocFA2lNMJeiKjguUKu7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack R.", 
    "review_text": "It was like finding some old Japanese ruin. \"Look for a light,\" people said, and I wondered if I was in a Miyazaki film or something. Was the cat bus going to come and take me there?  So my friend is getting married and asked me to be groomsmen, so we can here to celebrate!  Kampai!  It just so happens that I have a tux from my Uncle's wedding, so I'm all set.  The service right off the bat was superb. The woman in the kimono was sweet, and the chef was kind and smiled often.  My only complaint was the private party of frat boys behind me who were swearing, drinking beer, and talking so loudly I could barely hear my friend.  Nothing against frat boys, I lived in a frat house during my undergrad, but these guys were jerks and made my meal unpleasant since I could barely hear how my friend got engaged. And swearing at the top of your lungs at a restaurant...man, these guys must have been raised by wolves. If I ever swore at dinner or otherwise, my mom would beat the you know what out of me.  Back to the meal, it was, well fun. We had a lot of small \"fun\" dishes like fried corn, crab sunomono, scallop salad, strawberry sorbet.  Each dish was bite sized, except for the nigiri, which had fresh salmon, uni, and unagi.  Is this place into fancy presentation? No.  Is it nice comfort food? Yes.  I felt like I was back in Japan for 2 hours. Laughing with my buddy, and saying over and over...congratulations!", 
    "review_date": "2014-02-14"
  }, 
  "EQ-fPVMNGhwZOdB8PJ25ug": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bobby B.", 
    "review_text": "pretty good place. intimate and unassuming.   try the tsukue, satsumaage, delectable sardines, and of course, the unagi.  super nice people working there.   not that super high end but expect to pay a grip here", 
    "review_date": "2008-11-30"
  }, 
  "txWFXIMtDUaheiePKnAQyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny R.", 
    "review_text": "Want to go to Japan without the expense and time?  Just go to Kappa.  The interior is exactly like a small restaurant in Japan - everything wood, screens, a long sushi bar and a table just big enough for our party of 4 off to the side.  And the food.  We had omakase - eggplant with bonito flakes; crab meat with cucumbers and sesame seeds; asparagus with miso paste; a plate filled with single bites of monkfish liver, shrimp, tofu covered in some kind of crunchy rice, duck, chicken meatball, pork, and other seafoody things I can't remember; sashimi; and hamachi and unagi rolls.  Everything was delicious and fresh.  I don't even really like seafood, but the unagi and hamachi rolls were amazing - both melted in your mouth.  Dessert was two different kinds of mochi and ice cream with green tea mousse.  It is a little challenging to find . . .  the address is technically 1700 Post.  But if you walk off the street into 1700 Post, you'll find yourself in Dimples, some seedy bar.  Which I did.  You actually have to go around the corner from Dimples and up some stairs to get to Kappa.  Definitely expensive too.  But you're really paying for an experience, not just a meal.  And it's a 2.5 hour experience so be prepared for some sore legs at the end of it.", 
    "review_date": "2010-05-03"
  }, 
  "ibvH1Y7Rh_tstiWgH0OFTA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica S.", 
    "review_text": "I'm going to make the post on this restaurant brief, straightforward and to the point as I can tell that many have already gone in depth with very precise details about this cute little charming spot!  The wife and husband have been open for 18 years at this little place, very tiny as everyone has mentioned, but I liked the feel. I did not feel claustrophobic whatsoever. Everyone is treated with a lot of attention and food arrives very quickly in a very delicate manner. No arrogant feel, the owners are very kind, welcoming, and warm - keeping a warm smile along with class.   Dishes are pricey but this place is the definition of Japanese fine dining. You will find a variety of cooked dishes as well as cold dishes and good sashimi (they go to the Hayward fish market just a side note).   I want to come here again for the omakase but point taken - it is pretty expensive here. Just a few dishes will easily make its tab up to a few hundred dollars or so. (or omakase = $85/person).  People who don't think this place is good are probably people who only dine at sushi places that serve rolls, nigiri and call the cooked food chicken/beef teriyaki. No sir, this place is not like that at all. Rather, dishes will consist of Japanese delicacies such as Simmered Sardine, Grilled Fish, Grilled Unagi, Sea Snail, Crab sunomono, etc.  Hits: you MUST get the GRILLED UNAGI! Very good", 
    "review_date": "2008-02-17"
  }, 
  "zYo-Nn1tBshKFULRhg9shA": {
    "user_rating": 5.0, 
    "user_location": "Half Moon Bay, CA", 
    "user_name": "Betty W.", 
    "review_text": "Met up with my buddy from Taiwan here. What a wonderful dinner and evening we had. I forgot to make reservation the day before and requested that they just serve us whatever was good. Umm, were they good!", 
    "review_date": "2011-03-30"
  }, 
  "s_GhpN0WSJIV5R7vJ4HiaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua K.", 
    "review_text": "Went in for the omakase menu.   The food was excellent, the flavors were really light and delicate. The sake was great and so was the service.  One thing was the atmosphere, it is so extremely quiet in there to the point where you feel like you need to whisper and keep your talking to a minimum. Thank god there was a family drinking and chatting it up next to us, or it would have been dead silent and awkward as hell in there.  Oh well, I suppose you go there to enjoy the service and the food.", 
    "review_date": "2012-08-01"
  }, 
  "oEnRlfdm4cP1bm3ZOeq6gw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Nick L.", 
    "review_text": "Sushi is great here. We tried more than ten kinds. Every one of them won't make you disappointed.", 
    "review_date": "2014-07-17"
  }, 
  "nbIR2COIJrcUM9yVagBCCQ": {
    "user_rating": 5.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Sandy L.", 
    "review_text": "Quite an experience.  I found this place on Yelp and the reviews are definitely on target!  I've gone to one other Omakase in Southern California and this one exceeds the quality of the food and service x 10101039128402984029.  the owners are a lovely pair who are very respectful and take great pride in their work and quality of food.  i wasn't sure if the man could speak English or not but i sure found out when we were plated our food.  i didn't know what one item was and the boyfriend and i were staring at it for a long time.  finally i said maybe it's a sea cucumber??  then the man started giggling!  i looked up and realized he was giggling AT ME!  he goes you think that's a sea cucumber??  and i soon found out i was about to eat EGG PLANT.  o_O  quite embarrassing!!  i had a very enjoyable experience and definitely one to remember.  I'm not sure if I'll go for a long time only because it's VERY expensive and would only be to celebrate something extraordinary!  i believe the cost per person was around $130 which includes 2 bottles of sake with the Omakase menu.  but if you've never done this before I really recommend coming here cuz really, this is an extraordinary experience.    i think be weary if you are not open to trying new things.  while the food itself may not be TOTALLY out of your palette, sometimes the tastes are a bit different or the preparation is different from what you would normally expect.", 
    "review_date": "2012-01-06"
  }, 
  "KI7gPbRvdngGcgq3-RD7Gw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kendra W.", 
    "review_text": "A treat for not just your tastebuds, but your whole being!    The boyfriend took me here for a belated valentine's day dinner (good work, bf! and yes, i'm behind on my reviews).  I found very enjoyable for the both of us to be able hand over control and share the experience of feeling like a kids again.  So, I definitely recommend \"omakase\" (where the chef choose your dishes for you).   $85/person is a lot, but quality of food is amazing.  Each \"koryori\" dish is bite-sized, but each is painstakingly crafted and ingredients taste undeniably fresh.  Plus, given you get about 7 plates worth -- it really is worth it. See my pics, but some of the dishes when I went included: --Dungeness crab meat in light vinegar, topped with sesame --Seared tuna (melts in your mouth) with miso sauce and leek --Variety plate with 11 small bites!  Some warm, some cold, all delish --Sashimi plate with 4 pieces of FRESH fish --Plate with 3 Nigiri including unagi, scallop, and seared hamachi --Dessert plate with 4 types of japense sweet treats  My biggest dilema now is on whether to spread the word as they can only seat about 15 people total!", 
    "review_date": "2012-03-26"
  }, 
  "q3MiCqCAALCrzzGunST0SQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nancy T.", 
    "review_text": "Enjoyed my first koryori style set dinner for $95. 85% of the items were very fresh, very good and very enjoyable but the fried  items like karaage and the corn fritters were just not up to par. Did not go home dreaming about it afterwards.Will try the other comparable places and report back with a comparison chart,", 
    "review_date": "2014-10-21"
  }, 
  "Lf7MRy1_uFxgKUYn6ov5yw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Da Wei S.", 
    "review_text": "A very solid 4-star review. Loved the experience. Highly recommend it. But probably won't come back.  Kappa is a lovely small Japanese restaurant. The bar seats 10 and there is a back room for parties of 4-6. They appear to do only one seating per night. My GF and I showed up early (6:30PM) and were the first to be seated. The service was impeccable. We never felt rushed, she answered all of my detailed questions, and she made some wonderful recommendations for sake. The food was quite amazing. Kinda like a fusion between Kyoto kaiseki and the best Japanese eki-ben (train station bento). It was delicious. Every taste was unique and to be savored. We got the more expensive omakase and were glad that we did. My favorite dishes were the sweet corn tempura and the braised pumpkin in soy sauce. I must have spent 15 minutes slowly eating and savoring the sweet corn tempura.... sigh. They have an amazing sake selection, but it's by the carafe. We probably spent $125-$150 just on sake. Do yourself a favor and buy a very nice bottle to bring to the restaurant. The $20/bottle corkage fee is well worth it.", 
    "review_date": "2014-04-08"
  }, 
  "SI0B9MRW_x3O9ua-L3gvPA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stella J.", 
    "review_text": "Came here for my bf birthday dinner and we were both pleasantly surprised! As other reviewers have mentioned, it is slightly hard to find if you have never been to the playground. It's actually above the playground and there's a sign in front that says KAPPA.   When I made the reservations we went with the koryori style menu which is basically an omakase. We were presented with 8 beautiful and delicious dishes. We first started off with a salad, several appetizers, we had tray of assorted cooked items, some sashimi and dessert. We were blown away by the assortment of the dishes. Everything was tasty and well prepared. We would come back again for another special occasion!   Total for 2: $220 with tip!", 
    "review_date": "2013-10-03"
  }, 
  "UAEIS5BUFsIIN0DJzIIKvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison C.", 
    "review_text": "Kappa serves delicious, esoteric, artistic foods.  Sometimes the foods have been pre-arranged and sitting for quite awhile in plastic wrap at the bar, so may not look as fresh as possible.  This was my first time eating steamed uni nigiri and it was amazing.  But, just too pricey for what it is.  Expect to pay over $100 per person for the omakase.  The chef and waitress are very pale, and refined-looking.", 
    "review_date": "2007-04-05"
  }, 
  "E1NS3y97-klQESHBycfMuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aor R.", 
    "review_text": "I went there on my friend's BD. I really like it. Every ingredient is fresh. Some dishes might look simple but it's really taste better than it looks. The service is perfect but u have to make a reservation.  I do recommend Omakase. There are 7 courses. Because it quite expensive, it's good for special event like BD or anniversary.", 
    "review_date": "2014-10-31"
  }, 
  "GX6YV2sORHR7tOma3mcYfw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marina N.", 
    "review_text": "The fish is out of this world. The husband and wife pair that run the place are super nice. But both times I have eaten there, many months apart, I got the same exact menu. I refuse to have the fixed menu again and frankly I don't recommend it. About half of the dishes are good-the sashimi ones. I hate that F'n okra and hot shrimp ball and the ugly sea snail.   Every time we try to go off the fixed menu (which we can't control), and we ask for sashimi or nigiri, we get their adamant response \"we have no sushi\". For FXXX sake! We just want more freakin' fish from the treasure chest of amazing fish in the middle of the bar. GEEZ. I am so pissed off by this because the Japanese men just a few seats from us are getting beautiful belly slices from the treasure chest.", 
    "review_date": "2007-11-19"
  }, 
  "kKEqjyJ0YNT-kfaj6x-thQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Miinno N.", 
    "review_text": "I gave 4 stars not 5 because I am not sure if a person without knowing Japanese language would enjoy the experience at Kappa restaurant as much as the Japanese speaking people.  Also, if you are interested in very private place where the chef and the server should not disturb you at all, this is not the place; I do not mean that they are intrusive, but you need to communicate and make some conversation with them to enhance the experience.  They want to know something about you. This is NOT sushi place.  Well, sushi is really not the main food in Japanese cuisine anyway.  This place can tell you there are so many wonderful cooking styles in Japanese cuisine.  All of the dishes we ordered were tasty.  You could get \"otsukuri / sashimi\" (raw fish) if you wish. If you like sake (rice wine), this is a great place.  Unfortunately, I do not drink, but I was impressed with the choices of sake. They do NOT allow children in the restaurant.  The restaurant closes if there is no customer, and you need to make a reservation. It is upstairs to Denny's.  There are two doors from the stairs, and the one on the left is the one.  You need to go inside of the initial door to see the sign in Japanese \"kappa\".", 
    "review_date": "2007-10-02"
  }, 
  "RlI8vfhbYeUahO875DBFIw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "N J.", 
    "review_text": "Had a delightful meal at Kappa with my 2 bffs. We called the day of and asked if we could pretty please come in for omakase that night because we were leaving the next day and they said yes!  We couldn't find it at first so we called again and Rumiko told us to \"just walk up the stairs\". She was waiting for us at the doorway.  At first, we were the only ones there and the meal lasted about 2 hours. Each course was carefully created by the chef (except for dessert which was done by Rumiko). Delicious. Everything. Ask Rumiko for sake suggestions as well. We promised them that we would come back each time we are in sf.", 
    "review_date": "2009-12-23"
  }, 
  "_2BDX4Xs7IQ0oAp0m58LwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor B.", 
    "review_text": "Not for everyone.  No sushi, no ramen, no california rolls (or any other kind for that matter).  What you get is a fair much closer to Kaiseki (but a lot less scripted or formal).  Having said all this, I really like what Brian J said earlier.  Don't worry about paying $150 per person - you will feel like you just saved $1k on a ticket to Japan.   The food is absolutely authentic, meticulously prepared and absolutely delicious.  The service is quintessentially japanese.", 
    "review_date": "2010-12-28"
  }, 
  "PiVbpShA-HHZp3b-oDBqdg": {
    "user_rating": 5.0, 
    "user_location": "Miami Beach, FL", 
    "user_name": "Jack C.", 
    "review_text": "Wow! Ditto with all the other 5 star reviews. The flavors, textures were wonder...full! They just kept bringing out layer after layer of delight. Very gracious hosts.  Will come into the city more often, it was that good.", 
    "review_date": "2012-10-29"
  }, 
  "wb0UCBHncUifUjnZeA7Gsw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie O.", 
    "review_text": "One moment you are in San Francisco, the next in Japan. What a treat!!!. We went for our anniversary. Given our little experience in traditional Japanese food, we let the chef decide for us. Omakase is to be ordered one day in advance (Pre-fixed menu). The place is tiny but well arranged. It feels like being in a personal home. Toshiaki &amp; Rumiko Kimura are very attentive. The experience was a delight. We have a succession of nice dishes with variety and originality. Simple but cooked superbly. the host suggest us some wonderful sake to go our menu. We had a great time and the dessert are on a certain different level. If you need some adventure without needing a passport, this is a place to go. I would recommended it for special occasion if you like something more original. Enjoy this treat!!!", 
    "review_date": "2010-10-24"
  }, 
  "ggJEtcyPLtrgrwFxjQG9RQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frost L.", 
    "review_text": "Fantastic! Best tasting menu experience of Japanese restaurant in SF so far. No fancy decoration, no romantic music, just really really good food. Family style hidden place is actually good for conversation and make the date even better and memorable than all the sorta fancy restaurant downtown.", 
    "review_date": "2013-05-25"
  }, 
  "ZcXKAvTSPFgHay788z3pMA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pierre K.", 
    "review_text": "This place was heaven. The food was amazing. There were several times that evening where I said, oh, that's what that is supposed to taste like. The freshest and highest quality ingredients made the simple and elegant presentation shine. The simplicity of the place, the graciousness of the service, and of course the food made for a memorable meal. Don't come here to be wowed by the decor or to have a French Laundry experience. Come to appreciate fine Japanese ambiance and food.", 
    "review_date": "2014-02-21"
  }, 
  "NXvOzqZpj-7NFjOmxN8tzg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cupie M.", 
    "review_text": "Loved my visit here at Kappa.   As a native Japanese, I expect a lot from those reputable Japanese restaurants in the Bay Area. Being in South Bay, we have access to many good Japanese restaurants that are considered to be pretty authentic. I live in South Bay for the Japanese communities, restaurants, grocery stores and other Japanese resources (including my job).  Because of that, I don't really know many good Japanese restaurants or do not expect to find anything as good in SF. Even my Japanese friends in SF admit they come to South Bay for better Japanese food.   After living in the bay area for 15+ years, this is the first time I've heard of this place. And I'm definitely glad I visited. Maybe some Japanese people wouldn't appreciate or consider this place as greatly as I do. But I definitely appreciated its quiet and authentic atmosphere, and of course the food.   You see those photos people have already posted, and what you see on the photos are pretty much what you get. Certain dishes may change depending on the seasons, but it will be pretty close to those photos. But they are all good. It gave me the nostalgic feeling eating some of their food as it reminded me of my mom's food. But at the same time, some of the dishes were so well prepared and beautiful that you know you could not get some of their food at home in Japan (and believe me, my mom is a very good cook). Just like Kaiseki food, you can tell the chef has spent a lot of time and effort making these dishes. The service his wife provides definitely complements his food. She's very attentive, polite yet pleasant. There was a customer who was sitting at the counter alone, and I thought the wife was being a great companion for him by having an enjoyable yet polite conversation. The chef is rather quiet, but when he speaks, he's also very nice. From the moment she greets you at the entrance, it feels like you're in a Koryouri restaurant in Japan.   Honestly, I did not think I could get such a quality and traditional Japanese food in SF Japantown where it has become a multi Asian cultural spot. Their food was delicious from the starter to dessert (even their green tea was great). As we leave, the wife walked us to the door and thanked us for the visit. You will not regret your visit here in any ways. The whole experience was so pleasant and we're already looking forward to coming back.   We originally tried to make a reservation at Kiss Seafood, but they never picked up the phone so were not able to make a reservation.  Well, I have to say now I'm glad they didn't pick up the phone because we were able to have such pleasant experience at Kappa instead.", 
    "review_date": "2011-05-20"
  }, 
  "zKJWcAJAPCdHcnJEDdOHEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody T.", 
    "review_text": "The omakase is a bit pricey but it deserves the money. This place has a nice, elegant and private atmosphere that I recommend you give it a try when you want to impress your special ones.  We tried the 7 course omakase  Through the dishes they prepared, my boyfriend and I were able to tell this couple is truly passionate about what they are doing. Foods are fresh and delicate.  I've tried omakase in asian countries and this is similar to what I have experienced, maybe even better because of the private and quiet atmosphere.  Total for 2 $222 tips included.", 
    "review_date": "2013-12-02"
  }, 
  "tYLjIRDKyJZnvCMFKAKZQw": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "tiana w.", 
    "review_text": "small quiet elegant traditional japanese food in love i am.", 
    "review_date": "2014-01-16"
  }, 
  "EAUrXj9VgqYvGuPYEVYOJw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen N.", 
    "review_text": "What a special treat!   My boyfriend took me here for my birthday last night. We've been wanting to go for a loooong time so this seemed like the perfect opportunity. We got the omakase and loved every minute of it. (Note: This might not be up a picky eater's alley.)   We both felt like we were in Japan last night. The place only holds about 10 (with the exception of a small room to the side) and we were the only two non-Japanese people there and the only people conversing in English. How fun!   The husband and wife couldn't have been a more beautiful/adorable couple (I kept saying to my bf 'How adorable is he????' He could only smile and totally agree). The woman was absolutely a sweetheart and made the truly authentic experience a bit less intimidating (I'm sure we were eating some things the wrong way?).   The sake she recommended was dee-lish, too.   Gosh, what a great night. They even gave me a small gift for my birthday. Absolutely so sweet.   We're already saying we want to go back...and now that we aren't total rookies, we might even try our luck at ordering off of the menu!", 
    "review_date": "2010-08-27"
  }, 
  "KUusL15g7gVmPO7_XRp8cQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "Clean. Small. Extremely nice wife-husband dream team. NOT a sushi restaurant.  Kappa serves Koryori style food which is a traditional Japanese cuisine mostly consisting of cooked food. they do a small sashimi platter which is beautiful but usually no sushi is served.   Presentations were beautiful and I loved the ambiance. It reminded me of being back in Tokyo so for a second I forgot I was in SF.  Highly recommended to all who want to try something a lil different from sushi.  Prices are quite steep tho so prepare to open your wallet for an amazing experience in return! ;)", 
    "review_date": "2013-01-21"
  }, 
  "IPzVg0wE9EW2_VfJI0Uzgg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Pat T.", 
    "review_text": "Big tip: you've read that they're upstairs from the Dennys in Japantown. However, you also need to know that the entrance is an unassuming sliding door which absolutely does not say \"OPEN,\" \"restaurant\", or even \"KAPPA\" (unless you can read the small unlit Japanese sign off to the side).   You *will* think you've walked up the wrong flight of stairs, or it's closed.  But then you open the sliding door, and the hostess comes to greet you, and you know you've found the place.  A real gem. The food is great and the hospitality and service are unmatched. I can't think of another restaurant in SF where I can have excellent food and feel relaxed. The menu is varied, with specials that change frequently. You either go for the prix fixe menu at $75/person or a la carte, with entrees around $15-$20.  The team that works behind the counter, I imagine they're husband and wife, are so in sync it's like watching a ballet as they prepare dishes in near silence. They're quite welcoming and will talk to you, ask you what you like, where you're from, what your family name is, and so on. It's unlike any restaurant I've been to in the US; I felt more like a guest of a family in Japan.  The restaurant is tiny - there's a sushi-style bar that seats 10, maybe, and at least one small private room that looks like it might seat 4 - 6.  As others have mentioned, Kappa does not serve sushi (and they're likely to tell you this as you enter, just to make sure you're not disappointed). They do have sashimi though and while I haven't tried it, I expect it is very good.  Five stars for the food, two stars for the warm hospitality and attentive service.", 
    "review_date": "2007-01-09"
  }, 
  "W9G_MVW_KBe5BQlbSOmYUg": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Delroy H.", 
    "review_text": "I was skeptical about this place meeting expectations but thankfully I was not disappointed. The food was great and I like the atmosphere.", 
    "review_date": "2014-12-03"
  }, 
  "Rkhm3bht88rhk5pR3kF3FA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike G.", 
    "review_text": "Pros: This is definitely a unique experience to share a Japanese meal with a husband and wife that have been running the restaurant for a decade. Go for the Omakase on your first visit; some highlights from the night I went: Stingray Seared bigeye tuna with amazing sauce Soft chicken  Cons: If you want sushi, they'll warn you that this is not a sushi place. There are plenty of other options for great sushi, so come here for another style of Japanese small dishes.  Fun: It's almost impossible to find the business on your first try! Go upstairs at the building on the corner, and there is a barely marked door next to a night club or something.", 
    "review_date": "2011-10-02"
  }, 
  "Ud6j2HN40qEhycq2PuwcBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yan M.", 
    "review_text": "After reading Nobu K. and Toro E.'s reviews, it has been on my \"To Try\" list for the longest time.  The entrance is conspicuous and finally I noticed the littlest sign..... The host/server/probable wife of the chef is super warm and courteous and service was right on. She explains every item on the omakase offering and I truly enjoyed all bits of it! Omakase is the way to go and thanks to Zendesk girl and hubby for a wonderful time!", 
    "review_date": "2010-06-15"
  }, 
  "XHmsNa9tHPk8yt_MmkXREA": {
    "user_rating": 4.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "H. H.", 
    "review_text": "A bit of a hole in the wall, but in a good way.  Had a relaxing course with my family and enjoyed every bite. Great service and wide variety of small dishes. The fresh persimmon in the dessert was refreshing. My favorite tastes were the sea urchin and the crab. Will be going again in a couple of months.", 
    "review_date": "2014-01-25"
  }, 
  "ggk1thd4F2hlhc9JdspTRA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kawai Y.", 
    "review_text": "Went here for a dinner for an authentic high quality Japanese dinners around. For those who know where Japantown Denny's is, it's just right above, on the second floor, and look for a yellow lantern light there as many have indicated. The place is quite small. It seats around no more than 8 or 10 people, so I booked reservations around 2 hours advance before the place opens at 6pm.   Decided on the $85 Omakase (chef pre-selected dinner) beforehand too, which we had to request one day in advance (at least). We were greeted warmly by the husband wife owners/chefs. The Omakase came with around 9 small dishes. But the fish, veggies and asparagus were very fresh.. Each dishes were presented nicely and care. The chef and server also perfectly interacted with each of the customers. The standout dishes from what I remembered were the Shitake Broth, Maguro, Fish Liver and Strawberry Sorbet for dessert.   We spent around $220 for two people after tip given the effort the put to prep, present and serve the food and interact with customers.   Probably will come back in the very distant future. Certainly glad I came and it was a very pleasant and enjoyable experience. It reminds me of a typical small traditional mom pop restaurants in Japan.", 
    "review_date": "2013-06-30"
  }, 
  "Dd9NqLdmDnXERovE37dcuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "paul p.", 
    "review_text": "I've lived and eaten my way through SF for over 15 years. Truly, this is one of San Francisco's most unique dining experiences.   Call at least a day ahead for the Omakase (Chef's Menu). Most everything they serve is flown in from Japan. Amazing! The owner/chef is truly a culinary artist and his wife/hostess is both charming and helpful. This is not a \"wolf down a California roll before a movie\" kind of meal. This is a time honored tradition of each taking time with every course, appreciating each bite, and relaxing before the next course. If you're not adventurous, move on. But if you lump yourself into the \"foodie\" category, it's a must try.   How this place isn't packed every single night is a mystery to me.", 
    "review_date": "2010-04-14"
  }, 
  "4lAVKVISeiwPPAyy2Tk9ug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gurei K.", 
    "review_text": "Every Japanese food lover should try Kappa at least once. They do Koryouri, traditional Japanese small plates, which is pretty rare in the US. The whole restaurant holds only about 10 people. I'd recommend going with 2 people and sitting at the counter. You'll need to get a reservation for omakase a few days in advanced. Expect to spend about $250. The two owners are a couple and prepare each dish directly in front of you. The lady wears a serving kimono and the man a head chef outfit. Every dish is petite, elegant, and extremely simple -  It's a wonderful experience.", 
    "review_date": "2012-08-19"
  }, 
  "DS0Idr2XDhz5e7ZfSy0dYA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Ken K.", 
    "review_text": "I've only been to Kappa once, and it was on September 7, 2003. Granted this info is old, but judging from the more recent reviews, this place has not lost its touch, identity, or reputation and quality.  The restaurant is a lot smaller than what it appears to be from their website. The interior was quite upscale, but the intimacy and atmosphere created by the husband and wife operation, in addition to top notch service, made the dining experience even more memorable.  Rumiko-san (wife of the chef who was our server) was a delight and very helpful in recommending dishes and translating some of the menu items on the wall. Tell her what category you are interested in and she can check with availability on the wall or ask her husband (the chef).  On with what was ordered (a mix of regular menu and special wall items):  1) Tamba Kuro-mame - This is a special black bean from Japan (supposedly the bean is named after a region, Tamba). Very large sized and apparently cooked over 2 days until the right texture is obtained. Then they are soaked in a mix of sake and presumably sugar (I was able to taste box sake and something really sweet). A wonderful appetizer/dessert/palate cleanser which had a delicate aftertaste. Rumiko-san was saying that this is a high end dish in Japan, typically served during special occassions (like New Year's). We liked the black beans so much we ordered two glasses!  2) Maguro sashimi - 5 nice pieces of good aka maguro. I didn't try anything else, but the maguro wasn't as good if you went to the better sushi-ya's in the bay area (Ino, Toshi's, Sakae's, Sawa's etc).   3) Thinly sliced yamaimo. I was expecting some sort of cooked yam but to our surprise it came out in delicate thin slices, served raw with some shredded nori on top. Rumiko recommended dipping some soy sauce with some of the fresh wasabi on the side. Tasted wonderful though it was a bit slimey on the side (that is how the raw yamaimo is...probably an aquired taste). Note: I'm sure I would enjoy this way more now.  4) Grilled chicken meatballs - 3 skewers, each with two meatballs. Very flavorful and I think there is more than just chicken in it! Served with a light brown sauce that complements the dish.  5) Grilled black pork (kurobota) - yakiniku style thinly sliced pork. VERY delicious, juicy, and tasty. Lots of finely chopped green onion (or chive...arguable as it was very thin) and some sesame seed.  6) Grilled Matsutake - This was quite a treat (but very expensive for 4 pieces...$20 for this dish alone!) It was dirty white looking but more so light brown after being cooked. My first time having matsutake.  7) A simmered vegetable dish (greens) in broth with tofu skin and some spices.  8) Miso soup - red miso with a touch of green onion and what appeared to be cilantro stems.  9) A very big piece of mentaiko onigiri, served with finely chopped greens (stems) and one yellow pickle.   I believe that was it. Everything was amazing, service was excellent (the chef came out and personally bowed to thank us when we left, and Rumiko-san walked us out of the door to greet us farewell), and a good feeling overall The meal was $110 after tips for two people, without drinks. I still remember that meal to this day, that's how wonderful the experience was.   I need to go back again, so that I can put this place and Nami Nami in Mountain View (if I ever get to go for dinner), into their right equivalent perspectives. Kappa has the edge of the more personable and intimate setting, while NN's decor is more upbeat and izakaya-esque.", 
    "review_date": "2007-02-04"
  }, 
  "VH921HuaETsT2bmRBZ9Zew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "michelle k.", 
    "review_text": "my boyfriend took me here for my birthday and i loved it!  yes, it's somewhat hidden and challenging to fine but once you enter the sliding door, it's like you've entered a different world.  we had the omakase and it was amazing.  all of the fish just melts in your mouth.  and for cooked dished that night, we had don-kat-su, duck, chicken meatball, seaweed soup and lamb.  all amazing.  and they even gave me a sake glass as a birthday present!  will def find another special occasion to go back.", 
    "review_date": "2007-11-07"
  }, 
  "FAeIsKkBeXvpQpj6Zc29iQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "spiff e.", 
    "review_text": "i don't like scallops. i don't like oysters. uni is generally unappetizing. and i wrinkle my nose at red bean anything. BUT my meal at kappa included all the aforementioned and i LOVED it all.  funny how that works. all 4.5-star-yelp-bias aside, this place was impressive. down to the very last details: their oshibori towels are full-size fluffy martex face towels as opposed to threadbare mini-towels you might find at other places. and you get one before and after your meal. their napkins are from williams sonoma: fancy! and when refilling our tea cups, the lady put our cup on her little tray and filled it, instead of reaching over us to pour. and she and her husband were a generally sweet and pleasant host couple.  as for the food, yea, i got the impression that some of the food wasn't freshly shipped in from japan that morning as a lot of seafood was left sitting in the case. but whatever, it tasted excellent and i didn't get sick. no real need to list off what i ate since i imagine the omakase menu changes often, but i did enjoy all of it (except maybe one piece of marinated/smoked fish that was a tad too salty). also, someone in our group is allergic to shellfish and the substitutes weren't bad at all. and we left very satisfied and wanting to come back.  what else. oh, kappa isn't that hard to find. it's just that the outer door leading to it is mis-labeled, so you think you've gone to the wrong place. it's just at the top of the stairs above denny's. the door on the right goes into playground. the door on the left goes into kappa. just ignore the \"club nishiki\" lettering on the window and proceed through the wooden sliding door.", 
    "review_date": "2007-06-21"
  }, 
  "BblbmWuODTQ369leBu4o4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kanishk P.", 
    "review_text": "Kappa is a sensational experience for new lovers.  A small, hidden, and unpretentious restaurant in Japantown - this authentic restaurant dazzles the senses with it many courses.  Gents - Just go all out. Koryori style.   (For the unenlightened: \"Koryori\" is the Japanese equivalent of tapas style cuisine.)  I was dating a Japanese gal when I first found this place.  She was my interpreter to the cute couple that run this place.    \"What do you think?\" I asked my date.  \"It's better than the real thing,\" she said.  (Home run, boys.  Home run.)", 
    "review_date": "2014-09-20"
  }, 
  "I6-bQXALn5HhEg68VMzApQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patty J.", 
    "review_text": "Definitely lived up to the hype.  Lovely husband and wife team did all the work.  Very accommodating couple-last member of our party of 5 could not make it and Rumiko said that was fine.  We were stuffed by plate number 5 and had 2 more plates to go (which included dessert).  Reserved for mom's birthday and was presented with silk bag made by Rumiko's mother!  Very nice touch.  Went with the omakase or chef's tasting menu of small plates: hearty miso soup, asparagus with sesame sauce, fresh crab in cucumber vinegrette, large tasting platter which included monkfish liver pate (delicacy), fresh sashimi with the sweetest uni ever, tonkatsu with a huge crabcake, and finally dessert consisting of 2 platters, homemade green mochi with red bean center with vanilla ice cream with green tea powder garnish followed by side of fresh pear and papaya.  Yum!  Tried one sake and generous amount poured for the evening (party doesn't drink).  Owners were so attentive and were filling our green tea and hot water glasses.  My party and one other guest were the only ones in attendance in the small establishment for early dinner and that's the way we liked it!   Our party was so large, unable to chat with the owners but great atmosphere.  Would have liked some traditional music in the background, but maybe that would have made it too commercial? Difficult to locate but check out the previous postings for photos (adjacent to Playground entrance, through sliding wooden door-thank goodness the telltale lantern was lit-next to club Nishiki?).  Would love to go back esp. if somebody else paid this time, not cheap.  Party of 4 with one sake came to $348.44.", 
    "review_date": "2010-02-20"
  }, 
  "A02ryK2u5hA_ANkErNjuCA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Timothy L.", 
    "review_text": "My buddy and I come here all the time during the day for mid day or early afternoon lunch. I am amazed that this place is not busier than it is, as the service, food and prices are always exceptional. The only thing that I would find fault with is that sometimes the young ladies that work there have language difficulties, but they always are very accommodating and try their best to make sure you are efficiently and quickly served with deliciously served food. My buddy and I whom I always go with usually go for the lunch box specials, which are quite filling and are priced very moderately. I highly recommend this place. It's a great place and is a great reprieve from the \"brush\" and \"lackluster\" Chinese Restaurant close by that has extremely rude service..P.S..I love their Pork and Chicken Ton Katsu dishes.", 
    "review_date": "2014-05-19"
  }, 
  "jSmcODsZ3QiAehNlpfH50Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J D.", 
    "review_text": "San Francisco's best kept secret. So wonderful. Makes me miss Japan.", 
    "review_date": "2012-04-22"
  }, 
  "m077SPgDrTwQBhUlP7xSOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff A.", 
    "review_text": "When I first walked through the very hidden sliding door of Kappa, I felt like I was entering an underground club, feeling like I was in need of the right password to get in.  Then a woman in a kimono and smile welcomes us, making everyone feel privileged for being one of the lucky 10 people there.  Kappa is a hidden gem, and I almost feel bad for blabbing the secret out on Yelp but I won't be selfish.  There are many dishes on the menu you won't find at any other Japanese restaurant, making it a truly unique dining experience.  I recommend this restaurant to anyone that appreciates Japanese flavors and cuisine outside of sushi.  (no sushi served here)  So bring an adventurous pallet, someone who can speak Japanese (it certainly helped us) and don't forget your Visa, as you'll be spending at least $75 per person.  Enjoy, but please save me a seat!", 
    "review_date": "2006-07-16"
  }, 
  "DKmUukETiMVidu548TE-zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candice B.", 
    "review_text": "If I had gone to Kappa on a different day, I might have liked it more.  But I went on a day when the other dining guests (the place fits like 8 people, so it's always gonna be just you vs. them) were the most obnoxious, annoying, loud MOFOs.  They probably would have been okay, boasting about their restaurants and career and knowledge on Japanese food, if I were sitting next to them at Cheesecake factory or something.  But for god's sake, it's just us and them, and I felt like we were trapped in an elevator with a frat boy belching out the alphabet for two hours.   The chef and the wife/waitress were nice and I enjoyed watching them prepare food. They had very cute dishware and utensils.  (ah, maybe one day my dining table will enjoy something like that)  But it could be awkward at times when you feel like the waitress is watching you (probably true) and waiting for you to finish your dish (probably not true).  It got especially awkward for me when she started asking me about the difference between Chinese food and Japanese food.  I wish, I truly wish I had some decent knowledge to offer on the subject but I don't, and I really didn't want to sound like a traitor and tell her I actually prefer Japanese food over Chinese any day.   We had the Omakase.  The most memorable dish was the crab meat, juicy chunky crab meat stuffed into two tight sushi rolls, and more juicy chunky crab meat on the side.  Boyfriend said he has never liked crab as much as this.   Some dishes I like the presentation more than the taste: the large plate with 9 different items on it.  Some meat were rather rubbery.  Maybe if they kept their portions smaller, it would have tasted better.   Overall, I felt the dishes weren't as delicate as Kiss Seafood and the environment not as pleasant.  But if someone wants to take me to Kappa, I'd definitely go again.", 
    "review_date": "2007-06-28"
  }, 
  "wKPCISrVLeUfGoOhpUCKKg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily T.", 
    "review_text": "The service was excellent. The waiter was super nice. Plus the sashimi was super fresh and tasty, even when they were about to close", 
    "review_date": "2013-02-27"
  }, 
  "shfhrdFn8aGgFP8dyXNyxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eater S.", 
    "review_text": "Kappa was a great experience. The service was incredible - the most attentive and authentic I've experienced outside of Japan with none of the unpleasant behavior so common among the proprietors of Japanese restaurants in the city. We ordered Omakase (chef's choice) and had a number of great dishes. I thought too many of them were chilled and too much emphasis on various seafood dishes without enough rice or veggies to balance them. A few items actually didn't taste good. I'd still give Kappa another try. A beautiful, small, intimate, and unassuming small space.", 
    "review_date": "2007-06-03"
  }, 
  "a2E7Knfh7jEW8rupPafP3g": {
    "user_rating": 4.0, 
    "user_location": "Kirkland, WA", 
    "user_name": "Sandy L.", 
    "review_text": "There are too many reviews about this place so i am trying my best to make it short and get to the points:  PROS: -Nice little restaurant (10 seats by the bar in total served by 1 chef and 1 server)  -The server was very attentive, dressed up in complete set of kimono which is very rare in US  -8 course for $85 is very competitive price (1 soup, 2 app, 1 main entree, 1 sashimi, 1 sushi, 1 dessert, 1 fruit plate)  -Every course was presented well with nice dinnerware  -Located in Japantown which is quiet but very safe at night  CONS: -The restaurant only provides multiple course menu and require one day in advance reservation, not very convenient for travelers.  -You can order extra sushi/sashimi to go with your multi-course menu only but not just sushi/sashimi there (don't know why ?)  This is bit sad for me cos i like these two most among all courses and seems this is the chef 's background as well  -the main entree (hot food) came out bit cold and dry.  Since this is a two people running operation, most of the hot food was prepared ahead of time and reheated for us when ready to serve.  I would recommend to people who never have Japanese multiple course dinner before, but once is enough.", 
    "review_date": "2013-01-13"
  }, 
  "jydBnjVv3V0tg_CXZIU91w": {
    "user_rating": 5.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Aaron E.", 
    "review_text": "Impeccable service, and the food was expertly prepared.  You know you are in a high end place, when you are served REAL wasabi, not the paste or powder stuff.  The Omakase was plenty of food, and every taste expertly crafted.  The presentation and ambiance reminded me of Tokyo, and it is definitely a place you have to go to since it is unique in the bay area.  I will definitely return!", 
    "review_date": "2013-03-12"
  }, 
  "kg49IgzsS7-C7d2AaY-c9A": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Amy L.", 
    "review_text": "I like that I don't have to order anything at this place... they take very good care of you from beginning to finish.  I walked away full and very very satiated....  I wish there were more celebration occasions for me to come here...", 
    "review_date": "2008-04-27"
  }, 
  "i55-mHGx31A5rpFrrdnqKA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael C.", 
    "review_text": "Good food - but like many have said - it is overpriced for what it is.  Nice couple that has been doing this for a long time. Its a really small place and we went on a Monday and were one of the only ones there.  Service was good - though since it was a Monday - I think the food came pretty quick so they could go home early.  But essentially - if this was $20-30 less per person - i would say this place is 5 stars..", 
    "review_date": "2014-08-13"
  }, 
  "cI15fqq7P13Vp7A3xc3lQA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fandango L.", 
    "review_text": "I came here in Aug '08 with a friend from Tokyo who was here on business, and after a week in the Midwest he was dying for quality Japanese food, his treat and he didn't care about price.  I had read good things about Kappa, and when we walked in it indeed felt like we were back in Tokyo.  Unfortunately, when it came to the food we were both disappointed.  As it turns out, Kappa caters primarily to a clientele of Japanese visiting SF on business, and we happened to come during Obon season (festival season in Japan) when most Japanese are vacationing with family and business travel is limited.  As a result, business at Kappa was slow, all of this explained to us by the hostess.  What this meant for us though, was that the sashimi was not very fresh.  We didn't mind paying high prices, but you expect quality in return, and I have to say, the tako (octopus) sashimi actually tasted like it had already turned bad, which was unacceptable, especially at $90 for the sashimi platter (sad to say, but I had much fresher sashimi in the $6.95 bento lunch special across the street at Takara).  We dined a la carte, none of the dishes were remarkable, came to $250 for two and we only had a couple small bottles of beer and didn't leave particularly full or satisfied.  My friend said that if Kappa were in Japan it would not survive.", 
    "review_date": "2008-10-24"
  }, 
  "RVJEM5wqx9_LYM30LEZhkw": {
    "user_rating": 5.0, 
    "user_location": "Berlin, Germany", 
    "user_name": "Nemo O.", 
    "review_text": "Genuinely Japanese.  Highest quality and attention to detail.  I found it extremely relaxing, and the food was excellent.  Service was very good too.", 
    "review_date": "2012-05-22"
  }, 
  "nMvd0T2l4CdRCd8KlYc_sg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex P.", 
    "review_text": "This entrance is upstairs right next to Playground karaoke and easy to miss.   GOOD: - Small, intimate setting. There are like 10-12 seats along the bar, and a table for 4 on the side. - The place is run by a husband/wife combo. The wife does all the serving and is very nice.  JUST OK: - The food is average to good but few of the dishes were exceptional. Most dishes are COOKED. This is NOT a sushi/sashimi omakase so keep that in mind if you are looking for raw seafood.   BAD: - I'm all for Japanese cooked food but this place is horrendously OVERPRICED and inefficient. There is only one cook/chef (the husband) and he makes all these little different dishes so of course, it is a very labor intensive process. If a recipe needs chopped onions or panko bread crumbs, it is going to be the husband doing all the chopping and toasting. So essentially, you are paying a premium for this one guy to do everything. And you don't need to be an expert to do prep work so don't kid yourself and think that your food is any better because the chef owner chopped your onions instead of some cheap labor. There is a reason why all restaurants in the city have immigrant workers in the back. - Because the chef/owner husband is doing all the food prep, he is too busy to converse with the clients. What is the point in having a personal chef if you can't chat with him? - Many of the dishes are simple and cheap in terms of ingredients. Asparagus in sesame paste? A piece of TAMAGO? A piece of FISH CAKE? PORK KATSU? Really? I'm not paying $85 for things I can make myself or that I can buy in a supermarket with the same quality. Even if these dishes are all made from scratch, they use cheap ingredients and do not involve expert skills to make. Yet, they still probably take hours to produce because as I said, there is only ONE person doing all the cooking and food prep.  CONCLUSION: Kappa is a TERRIBLE VALUE and not worth $85 at all. If this place was in NYC, this ridiculous pricing (for what you get) would not fly because there are other Koryori or Kaiseki places that use premium ingredients and make better dishes (no tamago!) for a similar price point or cheaper. Unfortunately, there are too many people in SF who don't know better or are willing to overpay so Kappa's rating is inaccurate and overinflated.", 
    "review_date": "2010-05-19"
  }, 
  "XSQZ9irNk8UUwWOEEu6rkA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna L.", 
    "review_text": "This place is super expensive and I had super high expectations.  Why wouldn't I - it's totally hidden, I heard about it only by word of mouth, and it's by reservations only.  We ordered the Omakase since it was our first time,  The food and presentation were decent, but not to die for,  We had spectacular service, but that could be due to the fact that we were the only ones eating there that evening!!!", 
    "review_date": "2009-02-18"
  }, 
  "f6dRSiywqXr8joviPkvinw": {
    "user_rating": 5.0, 
    "user_location": "Oost, Amsterdam, The Netherlands", 
    "user_name": "Brer R.", 
    "review_text": "It's a tiny little place, but one of the most personal experiences I've had in San Francisco. The husband and wife owner are amazingly adept at handling the diners--she usually speaks to the English-speaking ones, and he defers to his Japanese clientele.   I came  here a few years ago and this restaurant single-handedly changed my entire opinion about eggplant. Now, I actually like, after having been served a snow white whole japanese eggplant (it had been peeled) with a lump of ginger and a little soy. The flesh was creamy and tasted ever so slightly of smoke. And the spareness of the ginger and soy was perfect.   It's price-y, so I hadn't been back until recently and was immediately reminded why the price is worth it. Tsukune--three skewers of tender, lightly spiced chicken meatballs are wonderful; as is the more \"upscale\" hiramo (halibut) with ankimo sauce--the monkfish liver has been blended to creaminess, almost like a cross between a creamy ceviche and vitello al tonnato, an Italian favorite of mine.  The woman never blinked an eye when we ordered spicy cod roe sac, served either seared, or as the Japanese eat them, just straight up. There's nothing like it--bitter, spicy, soft, chewy, all at once, and a warning--the texture is almost like raw sausage.  Sunonomo, a traditional Japanese cucumber salad that is lightly dressed in vinegar, came heavily dressed in freshly picked Dungeness crab. It was a big bowl, and that with the chicken meatballs may have been enough.  The only thing she gave us a sideways eye for ordering (and admittedly, we ordered it because it was not on the menu and we saw the Japanese pair next to us order it specially) was a raw squid tossed with pureed squid belly, sake, and shiso. It's kind of a murky purplish-grayish-brownish. Not recommended.  The sake collection can also not be missed. It's great--ask for a good suggestion, they will willingly guide you.  This is by far one of the best, most honest Japanese meals I've had in the city.", 
    "review_date": "2007-02-01"
  }, 
  "LWs6pc7l8BxhVkULbtHBwA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rudi A.", 
    "review_text": "EXCELLENT OMAKASE! (THE OMAKASE AT KAPPA IS PRE-FIXED MENU KORYORI STYLE)  They have a selection of single portion items if you prefer to order your own dishes. Their Omakase costs $85.00 per person, this restaurant is probably the most expensive Japanese restaurant in Japantown and well worth it.  The couple there operating that restaurant is very friendly, old fashioned, and formal, and this restaurant is very calm and relaxing.  RESTAURANT RULES AT KAPPA:  1) Reservations are available either by email or by phone.  2) For Omakase (pre-fixed menu) must be requested AT LEAST 1 day in advance.  3) Same day reservations by PHONE ONLY (After 4:30 pm). NO EMAILS allowed.   MY SUGGESTIONS AT KAPPA  1) Reserve their Omakase.  It has lots of variety of primarily good quality fish and vegetables.    2) To see an example of what their Omakase looks like go to: <a href=\"http://www.yelp.com/biz_photos/kappa-japanese-restaurant-san-francisco?select=IJB-mLcTT_XVewYiVSrZdg#IJB-mLcTT_XVewYiVSrZdg\">yelp.com/biz_photos/kapp…</a>  3) Kappa is very hidden out.  To find it at the stairs on 1706 Post Street walk to the top of the stairs,   4) Walk through the left door that says Kappa  5) Look for this light when you walk in <a href=\"http://www.yelp.com/biz_photos/kappa-japanese-restaurant-san-francisco?select=IJB-mLcTT_XVewYiVSrZdg#fuAfb3xqYKjpLxJd97hXWw\">yelp.com/biz_photos/kapp…</a>  6) Below the light near the door handle you will see a small sign that says KAPPA.  7) Grab the loop ring looking door handle and slide it open.  8) You will hear some bells jingle and a Japanese woman wearing a Kimono will come over and great you.  SO IF YOUR IN JAPANTOWN SAN FRANCISCO AND YOU'RE LOOKING FOR A VERY AUTHENTIC HIGH END JAPANESE RESTAURANT WITH GOOD FISH AND VEGETABLES THEN KAPPA IS THE PLACE!", 
    "review_date": "2013-06-16"
  }, 
  "qY1crTEAG__vaqBsn2_rYA": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "ZF N.", 
    "review_text": "Intimate setting  Make sure you book ahead of time  A bit hard to find the door - its upstairs from Denny's  Clean and delicious food  Everything is made from scratch  Each bite and taste is crafted by them  There is pride and technique in each course  They time the courses perfectly", 
    "review_date": "2014-04-22"
  }, 
  "NgapNNErXajBp6Ro5I21Jg": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Kenson K.", 
    "review_text": "Some people may say that Japanese food is bland in comparison to other Asian countries' food. Chinese food is heavy with exotic sauces, Korean food is spicy with fragrant flavors of garlic, soy and sesame, Thai food has different layers and intensity of spicy, sweet, and savory, etc. But actually, Japanese cuisine has delicate and subtle flavors and overpowering sauces or strong flavors are usually avoided so that you can appreciate the natural flavors of the food.   Kappa is just that. They hold true to drawing out and enhancing the natural flavors of the food you are eating. The entire meal was light , in small portions, and covered 7 courses. However, it was very filling. Presentation was very artful and I was amazed how talented the chef is at creating all of these delicate and subtle flavors in your mouth.   Course 1 - Shrimp Soup. A broth of shirmp stock, with snowpea, shrimp ball tempura and a touch of lemon zest. I found the lemon twist added a subtle taste in the background.  Course 2 - Fish tempura. 2 pieces of small fish, butterflied, lightly battered and deep fried tempura style. Just squeeze a bit of lemon and a bit of salt for a perfect balance.  Course 3 - Seared tuna with sweet miso sauce. This was raw tuna sashimi, lightly seared and topped with miso served with a shiso leaf.   Course 4 - Sashimi platter. 4 pieces of thickly sliced maguro (tuna), hamachi (yellowtail), tai (bream) and 1 more that I couldn't figure out, ,maybe seabass? They were all very fresh and delicious.   Course 5 - Platter of grilled shrimp, corn croquette, tonkatsu, chicken meatball, slowcooked tuna simmered in soysauce and spice, baked fish, duck with red miso, stingray, tamago egg, spicy fish roe wrapped in calamari. Everything was so good but I wasn't too crazy about the spicy fish eggs and calamari though. It was a bit salty. But everything else was impeccable.  Course 6 - Sushi course of grilled hamachi, unagi, and a baby scallop on the half shell with ume plum sauce. The unagi was fresh! Definetely not the type you find ready made in the frozen section of the asian grocer.  Course 7 - Dessert. Watermelon gelatin - A perfect intermezzo to cleanse the palate. Sliced papaya, pear, &amp; persimmon. I usually hate persimmons but this one was very sweet. I couldn't believe it! Green tea cheese cake and mochi (rice dumpling with sweet bean jam) dusted with kinako (dried savory soy powder).  The mochi was so soft and delicious. A perfect ending.   Service is wonderful. The waitress is so humble and courteous and very attentive.   I think a second visit is in order.", 
    "review_date": "2011-10-09"
  }, 
  "cATChnWbNlodRD_Ua4mV0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna R.", 
    "review_text": "Kappa is an invitation to a delicious meal in a Japanese home! I loved all 7 delightful dishes cooked with precision and served with personal attention. I can't wait to go back!", 
    "review_date": "2012-05-11"
  }, 
  "jwAHZLtmPUV2JMLVykMaAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott K.", 
    "review_text": "One of the best Japanese meals I've every had. Also one of the most expensive. This place feels authentic with one table and a 10-person food bar. A couple has been running it for 20 yeras and the presentation is impeccable.  Make reservations. You pay for a prix fixe meal (they'll accommodate dietary restrictions). Each dish is simple with the freshest flavor. If you want to have an absolutely memorable dinner, take your date here.", 
    "review_date": "2007-05-13"
  }, 
  "Nm_oECledKFKPGjq6JjvIQ": {
    "user_rating": 2.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Katie F.", 
    "review_text": "After reading rave reviews about this place I took my parents here for my fathers birthday.  My dad is from Japan so I figured he would appreciate the place, and he did, but it definitely was not worth $450 for three people!    I've been to restaurants before that have costed this much, but they are far more gorgeous and the food is more rare and exquisite.  At Kappa, the 3 of us were sitting at a bar 2 feet away from the owners who were cooking our food.  The place is beyond tiny.  I felt like I could have gone across the street to nijiya and prepared the food at home and been more comfortable because my kitchen and dining space is bigger.  The owners do take a lot of time to prepare the food and present it, but its the same with any other restaurant, with exception to the price.  I just felt like I was really ripped off, omakase is $85, but if you decide to get anything else, watch out, one extra plate of normal quality sashimi could cost you another $85- $90.", 
    "review_date": "2009-02-20"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "I went to Japan and back, but never had to leave the friendly confines of San Francisco. The location is tucked into a small, practically hidden space, the menu on the wall is printed in japanese, the friendly waitress/co-owner/wife of the chef/culinary navigator dresses in traditional attire, and the decor is zen friendly. They've been doing it for 22 years.  And then there is the food. Oh the food. I can't remember everything - we had the omakase and it kept coming and coming. Highlights from my own memory along with reminders from other yelpers:  - Maybe the best scallop ever - Succulent eggplant - Fried tofu with the texture of a rice krispy treat inside and a marshmallow outside - Gigantic, delicious shrimp - Splendid chicken meatball - Some of the best asparagus ever - Uber fresh sashimi - Seemingly incongruous corn fritters. Just go with it. - Delicious strawberries and mochi to close  Pretty sure I missed a few. We were stuffed upon leaving, but easily could have eaten more if there was more to be had. The man making all this doesn't speak a word till the end to say thank you.  Not cheap, but then an experience as unique and delicious as this shouldn't be.", 
    "review_date": "2010-05-27"
  }, 
  "6_76Aby4usWFsCRKognyTQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Thai L.", 
    "review_text": "This place rocks.  We had a big party, about 10 or 11 people.  We called for reservations and the lady was more than willing to handle our reservation.  I was scared that she wouldn't, because I had heard the place was small.  I think she may have cancelled all other reservations just to seat us.  She even gave us her cell phone number in the event that we cancelled, that we would call her right away.  Wonderful.  We were running a bit late and arrived right around the time of our reservation.  I had read it was above the Denny's.  We ran up.  Karaoke bar.  We ran down.  We ran around in circles.  We finally called her and apologized for being late.  It was above the Denny's.  In a hidden door that nobody could ever imagine.  It was a ninja door.  Since we were in a big group, we had a set menu.  Which was fine by us.  She had asked what we could eat over the phone.  We told her everything.  So we let her pick the menu at her whim.  I don't even remember everything on the menu, but I did take pictures of it all.  Yes, there were a few items that I didn't particularly like, but I'd have to chalk that as preference.  Their food quality was top notch and fresh.  I wanted to jump the counter and steal his box of uni.  But I didn't, since they had been so gracious to us all night.  The food was fantastic.  It really does make your eyes roll back in your head as you eat.  Just go and don't worry about what you're eating.  It's going to be good regardless.", 
    "review_date": "2007-04-09"
  }, 
  "yar2IG0Indfazbcbv8xUDg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Carol L.", 
    "review_text": "With the glowing reviews from many of Yelp's Japanese food experts, I had extremely high expectation for Kappa. Maybe it is personal taste or maybe it was a slightly off night for them. While everything was up to par, it didn't wow me.  We had the Omakasi. The sashimi dish was very fresh, the delicate bean jello appetizer was really unique and refreshing, but I am sorry to say the rest were forgettable...  The experience itself was wonderful though. The atmosphere was like dining at a little gourmet restaurant in a local neighborhood in Japan. The Chef and his wife also made wonderful hosts.   Overall it was a 4-star experience for me, just 20% short of excellence.", 
    "review_date": "2008-05-29"
  }, 
  "5SLlPzF9WxaKe0aHQuxhtA": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "CAScuba Y.", 
    "review_text": "I look at my last write up of Kappa, interestingly it was exactly 1 year !  Then I remember I went there last year after the Blue Angel show.  This year, after the Blue Angel show, I wasn't really planning to visit Kappa, it was Ino I try to visit.  I was suppose to go take some pictures at Ino for a potential articles in a newspaper but then Ino was closed for private party !  I swear, about 1/2 the time every time we went to Ino, he is closed because of something !  Then I ran over across the street to Kiss and ask if they will take walk in, well guess not and it was only 6pm !!  So I ran again to Kappa, well they are open (that might be an indication too).  Anyway, we sat down around 7pm.  Instead of the set dinner, I am ordering individual dish this time, sashmi, duck breast, ankimo, hirame seaweed, daikon tofu skin.  A sake and belu. We left at almost 9 and the entire evening there were only 3 couples.  I had a chance to study this place a little bit more.  Everything Kappa prepare and deliver are excellent, they are all carefully prepare, cook or raw, cut, arrange, etc.  It's all very careful.  So you won't eat anything rotten or bad here !  Dishes are not too complicated as you can guess, everything was done by 1 guy.  For dishes that are complicated, it is usually done or partially ahead and then reheat or finish or just cut.  I ask the Mrs how's business and she said ups and downs, ok.   As a previous restaurant owner, I learn food inventory is one of the hardest thing to deal with if the restaurant has unpredictable volume.  So I observe the raw fish display and confirm my theory.  They dont stock a lot of fishes and they don't stock very exotic fishes.  So they stock some tuna, yellow tail, founder.  I didn't see any of my favorite such as aji, toro, nama tako, ika, awabi, no raw shirmp, no mirugai this time either.   By not stocking a lot of expensive seafood, it helps manage the food cost.  Duck breast, grill cod, those can stay for a week !   Our a la cart dinner still comes to $160 for 2, expensive.  But I like the services, I like the conversation, I like the envrionment, I like the consistency of their deliverables.  Will I go back ? Sure, I came back, but just not gong to be too often, may be after Blue Angel 2009.  I like more variaties of fresh and exotic seafoods.", 
    "review_date": "2008-10-13"
  }, 
  "eDAdHV4jpMsudPxgGGPWQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Penn W.", 
    "review_text": "This review is long overdue.  We came here last year to celebrate our anniversary and it was spectacular!  The omakase is expensive, but for a special occasion, it is worth the experience.  Everything was beautifully displayed to compliment the unique and flavorful dishes.  It was a delight to my taste buds bc it was a discovery of new flavors that were melt-in-your-mouth good!!!  I didn't want the experience to end - that's how fun and amazing it was... :)  The creativity behind these meals shows how much the chef enjoys what he is doing.  The sweet woman who served us our tea and explained what all the dishes were reminded me of a Miyazaki character - I love this place!", 
    "review_date": "2014-02-18"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "I have many pet peeves.   From punctuality to talking during a movie to long pinky finger nails to eagle claws aka crusty toes hanging on for dear life from the edge of a sandal (get a pedi and a bigger shoe size please!), one of my main pet peeves is how people treat wait staff. I believe the way a person treats a waiter(ess) reveals a lot about a person's character.   I'm not one to put people on blast but in this case I will.   Thank you, Scott Disick doppelgänger for ruining our dining experience at Kappa by loudly and obnoxiously boasting about your Harvard education, about your $150k minimum salary requirement as a recent college grad, and your customized Ferrari. He probably thought my gf and I  would be impressed overhearing all of his self-gloating (it's very small and quiet at Kappa) but we weren't. It was annoying and he disrupted our entire meal. You're a douche and an even bigger douche for talking to Toshiaki-san's wife in such an arrogant and condescending tone during your interactions with her.  Not cool.  Now that I got that out of the way, Kappa is a neighborhood gem tucked inside the entryway of Milo Lounge (<a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FUTks5y&amp;s=2e5fa7212a46b1ae2b2d40d47510d7c492492889c7b3fdce03fae9baaa595078\" rel=\"nofollow\" target=\"_blank\">bit.ly/UTks5y</a>), next door to Playground (<a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FTeatEU&amp;s=d3d05af4aa13dc329d479a7c88a4f4fa5ff8b3f2fee12b6135f5856fc5351a77\" rel=\"nofollow\" target=\"_blank\">bit.ly/TeatEU</a>). With just 12 seats, Kappa serves Koryori, a Kyoto version of Kaiseki. It's like a Japanese Chef's Tasting menu that's very simply prepared with minimal garnishes so the main ingredient is the focal point and you can enjoy it in its purest form. Though they have a la carte menu at Kappa, the only way to go is with the 7-Course Omakase for $85. Expect to spend about 2 hours for a very well-paced dinner.  Spectacular from start to finish, my dining experience at Kappa (sans douchebag) was most reminiscent to the Michelin-starred Wakuriya in San Mateo (my review: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FTOhWXw&amp;s=29d4b2acf04ba50df7d1222c9dc7845a30dd9cc874aae94a70f6372748f8bba4\" rel=\"nofollow\" target=\"_blank\">bit.ly/TOhWXw</a>) and Kiss Seafood nearby (my review: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FTOi7Sy&amp;s=53973ad8b0ced788c07dc446d3a6ffb42f1dadd3d3c5f504984ddfc867c8e144\" rel=\"nofollow\" target=\"_blank\">bit.ly/TOi7Sy</a>) but with a lot more LOVE.   Toshiaki-san and his wifey are the cutest and sweetest Japanese couple ever. While he works his culinary magic, his wifey runs the front of the house. They were very warm, hospitable, and attentive. It's truly a one of a kind experience so make reservations, take a seat and be prepared to take a culinary trip for your taste buds to Kyoto and back in 2 hours.   7-COURSE OMAKASE DINNER ($85) (1) Fishcake w/ Sea Urchin Soup: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FUGnkNh&amp;s=f5c3f8b8eea125f522724aaeb342fbb9c51f72d0f82b5b3ba51d49e761389b78\" rel=\"nofollow\" target=\"_blank\">bit.ly/UGnkNh</a> (2) Rare-cooked Tuna w/ Japanese Mustard &amp; Scallion: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FT9MGUg&amp;s=480e4d44c75d1bf98b39e2675e0ea974387c967e6fb012fc92d8fc9eadbccb9d\" rel=\"nofollow\" target=\"_blank\">bit.ly/T9MGUg</a> (3)  Snow Crab w/ Cucumber in a Vinegar Broth: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FT1FQjx&amp;s=e780429dae32bfe9081b9ca2b3eb0d7844a13b8d058e203b30cdf18d13653aad\" rel=\"nofollow\" target=\"_blank\">bit.ly/T1FQjx</a> (4)  Variety Plate: Tsukune, Satsumaage, Blackskin Pork, Turnip, Black Cod, Tonkatsu, etc.: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F10nwvHE&amp;s=235aff19c2e680ae91a1f4bfe98377d0db2dd1ad283b45c50a8ade9a9e1b4f6c\" rel=\"nofollow\" target=\"_blank\">bit.ly/10nwvHE</a> (5) Sashimi - Hamachi, Uni, Chu Toro &amp; Amberjack: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FWiiPd1&amp;s=d4b1c69c53690afdccd6b55a2c76cd805a6481a294356a5528a99b19352c2608\" rel=\"nofollow\" target=\"_blank\">bit.ly/WiiPd1</a> (6) Nigiri - Baby Scallop, Unagi &amp; Seared Toro: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F10nwQtZ&amp;s=ed160b6d1c0f885f1e55fd6a9f3f65c96d6d624de85a6eec17090a1d05cb571f\" rel=\"nofollow\" target=\"_blank\">bit.ly/10nwQtZ</a> (7) Mango Sorbet, Sweet Rice Cake, Melon, Persimmon &amp;  Red Bean Jello: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FXxDU9H&amp;s=f8852e2d77e09cb930b6863e7afe4d61bf0e6bb28f6c0da25fc16a9bcb2bce37\" rel=\"nofollow\" target=\"_blank\">bit.ly/XxDU9H</a>  If you appreciate top-notch seasonal ingredients with subtle flavors and delicate textures, you will thoroughly enjoy every course at Kappa. The soul-warming soup led way to the tenderly soft tuna with a nose tingle from the mustard. The succulently sweet snow crab prepared our appetite for the abundant variety plate of 12 items ranging from the supple fishcake, richly flaky black cod, deliciously crunchy tonkatsu to the succulent chicken meatball. There's nothing like fresh fish in its unadulterated form and Toshiaki-san truly knows how to showcase this in the sashimi and nigri courses. The sashimi was ultra-silky and buttery while the slightly torched nigiri created a mouth-watering decadent mouth feel. The delicious simplicity of ripe, seasonal fruits was displayed in the fruit centered dessert closer course.   Kappa is definitely a must for all foodies who can appreciate culinary greatness in its simplistic form.   Going back to the Scott Disick doppelgänger, you know I couldn't leave without some parting words.  You know what they say about people who brag about themselves and all their materialistic possessions... they're just compensating for something or a lack of \"something\".  *Whispers*: Lipstick D*ck.", 
    "review_date": "2012-11-20"
  }, 
  "dxjDPdhIs1vdVDJTskzXiA": {
    "user_rating": 3.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "C D.", 
    "review_text": "Nothing", 
    "review_date": "2013-08-18"
  }, 
  "ccfVsl7SZeK-2Ixc2-anuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianna S.", 
    "review_text": "Came in last night for a belated birthday dinner.  I had been looking forward to our meal here for some time.  Kappa is a quaint bar style restaurant that seats 10 comfortably, in addition to a small 4 top table in the back.  The husband and wife couple are a dream team, friendly, polite, and on their a-game when it comes to service.  We had the 8-course omakase style.  The dishes were interesting and fresh, although most of them left much to be desired in my opinion.  I enjoyed the sushi the most - smoked salmon, unagi, and scallop, yum! The fourth dish was a combination of multiple small bites.  It was fun to try different items, but none really blew me away.   All in all a solid spot, but for the price tag, I won't be a repeat customer.", 
    "review_date": "2014-04-05"
  }, 
  "Lx-s5OayOrCrbDrneCw3jg": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "Jon H.", 
    "review_text": "I took my date here for Valentine's Day. And it was pretty damn good. It was delicate, refined and exceeded my every expectation. So the run down is that I made like four reservations at different Japanese Restaurants because well Japanese places don't open on Mondays. I had a hole in the wall that my friend highly recommended lined up only because the top places were booked; Kappa being one of them. But about 1 hour before I picked up my date, Kappa called me and said they had a cancellation. THAT\"S GREAT SERVICE. And being Valentine's Day, I wanted didn't want to have turf and surf as cliched as that is. If I'm going to the city, then I'm going to be eating sashimi.   This place delivers. The food was so good that I had to google adjectives just to describe it and even then I'm still doing a piss poor job. For one thing, my date spoke fluent Japanese and the fact that the owners, mom and pop, could speak fluently back to her. This instantly raises the bar. Sorry Koreans and Chinese run establishments.   Secondly, prefixed omakase menu was man alive. That's the only way to describe it. My date and I were full by the 4th course. I think we had 8 courses? Everything was so delicious. I can't put a finger on which was the best. To be more frank, I don't think I have the culinary expertise to describe the experience I had at this restaurant. I was very impressed. Presentation was simple, elegant, and creative. I especially loved the squid and roe.   The only negative if any is that if you're going to bring your A game and treat that special someone to this meal: be ready to fork over a few doubloons.", 
    "review_date": "2011-02-15"
  }, 
  "VZJB3l61Pg9rGymPm6DPxg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie T.", 
    "review_text": "Surely one of the best Japanese restaurants in the city. It's ran by this cute Japanese couple who are both very lovely people.    Omakase menu HANDS DOWN! Just do it. But you need to let them know 24 hours ahead of time, so do it while you make a reservation.   It is very expensive I go there every time my grandmother visits from Japan. But it is well worth [my grandma's] money.", 
    "review_date": "2011-09-20"
  }, 
  "GWilkDW_fcxKygfvsssKEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "s t.", 
    "review_text": "d.e.l.i.c.i.o.u.s.  we'd go everyday if it weren't $$$$.  yelp needs to fix the neighborhood listing though: tenderloin?!  hello, japantown.", 
    "review_date": "2013-01-11"
  }, 
  "mAwm8AletAsn5URUOTjUEw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kioko O.", 
    "review_text": "The thing is.., I got used to by so-called Japanese cuisine in Bay Area.  There are so may of them, and sure I like all those funky rolls called \"Monster Roll\", \"No Name Roll\" and \"San Jose Roll\".    But at Kappa, you will re-discover your route.  No, I'm not exaggerating. Right here, you'll experience how a Japanese cuisine should be.  And it is here.   Reservation is a must.  They do not post the price on their menu (I have yet to see the tab, but I am certain it's really, really expensive).", 
    "review_date": "2012-06-17"
  }, 
  "CgPU1rE2Vn457UCGlPHdJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bruce P.", 
    "review_text": "I felt like I was back in Japan, both for the atmosphere and the food.  We had the omakase and it lived up to my expectations for better restaurants in Japan.  Unlike Japan however, they asked about my alergies and tailored the menu to my limitations.", 
    "review_date": "2012-01-30"
  }, 
  "S74bujQk5R0wySdasW1ODg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dean S.", 
    "review_text": "If you like Sake with nice \"otsumami\" in nice \"kobachi\" This is the place ! Good quality sushi with very fresh fish. Had a wonderful time !", 
    "review_date": "2010-11-15"
  }, 
  "s_bwB79YSbfJWcqXCUTqBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "christopher a.", 
    "review_text": "i really wanted to like this place, and i do like it to some extent, but it by no means impressed me in any way.  i suppose its because i have a far superior knowledge and taste for all japanese food. my review of this restaurant is probably the most well founded and expert of all reviews you will read here about kappa.   for sake i expected something far beyond that of the kubota manju that they offered.  the mentaiko was good, but not outstanding.  their ika no shiokara was well prepared and classic but they did not have other less common shiokara.  they did not offer many other classic japanese chinmi that i would expect of koryori, i was very suprised that they did not offer karasumi.  with all that said, i am a firm supporter of 'try everything once no matter the cost'. and with that, i absolutely recommend trying the restaurant.", 
    "review_date": "2008-03-17"
  }, 
  "I0ViOyrQqguZo-QSH9iDjQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deb I.", 
    "review_text": "It's in a weird location. You don't expect a tiny space above Denny's (and next to Playground) to serve up an exquisite meal. But it does.  Kappa is not a place for people who define Japanese food as sushi rolls with names like \"Dynamite,\" \"49ers\" or \"Rainbow.\" It's where you go when you want authentic Japanese cuisine.   The first sign is the lack of English menu. The second sign is that you're the only non-Japanese businessmen in the joint. The final and most important sign? The perfectly exquisite morsels of food served to you.   Everything here is made to perfection, very Japanese. Just ask for the chef's menu and they'll take good care of you. They'll probably ask, but let them know if there are any foods you have an aversion to (i.e. monkfish liver, etc.). If I could find myself a Japanese sugardaddy, I'd have him take me here at least once a week.  The only downside? You'll probably be hungry in an hour or so, so you might want to head over to Sophie's for a Japantown Crepe to fill you up afterward.", 
    "review_date": "2007-08-31"
  }, 
  "oav3V6xd6osrh3uHY_2qxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "One night, my friend and I decided to finally try dinner at Kappa, a wonderful gem of a restaurant tucked away in a hidden corner of San Francisco's Japantown. Locating the restaurant for the first time was slightly challenging. We went up a flight of stairs from the J-town Denny's, peered skeptically into a Korean karaoke lounge, and finally found the entrance behind a sliding wooden door next to the lounge. The only indication of the restaurant's existence was a small sign with the words \"Kappa\" inscribed in neat hiragana.  Yet aside from the odd location, this was one of the best meals I've had outside of Japan. Once I stepped inside, I was instantly transported back to the small, intimate restaurants in Japan, where salarymen drink and eat in between hearty laughter after work hours. The restaurant can only fit about ten seats at the bar, so the dining experience allows you to converse with both the chef and his wife, who served customers while wearing a full kimono (which is very commendable since it's hard to even walk in kimono without looking like a penguin). I almost forgot that I was in the States.  As for the food, let me begin my review with some words of caution. Not everyone will appreciate the food at Kappa. The restaurant serves food in the koryori style, which is harder to find outside of Japan. Small, stand-alone dishes are presented with minimal garnish and seasoning, in an effort to highlight the original flavors of the ingredients. There is no standard menu, as the availability of items varies with the freshness of the ingredients. The result is a sensual, refined dining experience that allows you to enjoy the flavors, scents, and textures of some of the most traditional Japanese cuisine.  If you're looking for California rolls, contemporary fusion fare, gyoza, and teriyaki bento boxes, do not step foot into Kappa. And take your gaijin t-shirt with you. Kappa doesn't even serve sushi, although I'm sure the chef would do an amazing job if he wanted to.  For newbies, the best thing to order is probably the omakase pre-fixe menu. For $85 per person, the chef will select a variety of dishes to introduce you to koryori dining. My friend and I were fairly confident about what we wanted though, so we just ordered a la carte.  - Sashimi: Each slice was thick, juicy, melt-in-your-mouth perfection. Wasabi and shoyu were completely unnecessary. The uni was especially amazing. - Ankimo: Creamy and velvety, served with ponzu sauce.  - Hirame Usuzukuri: Thinly sliced halibut sashimi dipped in a mixture of shoyu, thinly sliced green onions, and spicy daikon. Great play on textures. - Grilled red snapper: Best dish of the meal. Reminiscent of hamachi kama, but the meat was thicker and sweeter. - Blackskin Pork: Thick and fried in batter without too much excess oil. - Anmitsu (agar jelly served with sweet bean paste)   With the limited seating, reservations are a must. The portions are small, so don't show up starving. And the prices can add up to a hefty total, but if you're a fan of traditional Japanese fare, it's well worth it to visit once in awhile.  (See accompanying photos!)", 
    "review_date": "2008-04-29"
  }, 
  "Zz1Yn8ct5Z-ctJ01D8Kpiw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Wenwen J.", 
    "review_text": "Fantastic！ Everything islike art! Just it is hard to find the place! Worth the price!", 
    "review_date": "2013-10-12"
  }, 
  "PLc0_CtEWEQvbztwZ5lZbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dustin E.", 
    "review_text": "Kappa Restaurant is expensive, tiny, and weird.  it is authentic japanese and perhaps the most minimalist / simple fine dining i've ever had.  i've been here for omakase here a couple times, but recently went for my first ala-carte experience.  i had:  simmered white tuna (complimentary) monkfish liver with ponzu -- very good fried fish cakes simmered sardine -- awesome pickled ?turnip? slices -- too sweet for my tastes simmered green vegetable -- awesome miso soup - okay, good for filling you up onigiri - okay, good for filling you up pickles - okay, good for filling you up  (complimentary) one order of sake  total bill (including tax+tip): $105  i definitely prefer the a la carte to the omakase, as i can get what i like most (vegetables and fish) and avoid those i like less (meat and fried dishes.)  i've been to many 2-3 michelin starred japanese restaurants in the us and japan (masa, urasawa, kanda, kikunoi, yamamoto, daigo, hiiragiya, kanamean, tawaraya.)  i'm not going to say kappa is on the same level as those, but i enjoyed it almost as much and it is a fraction of the price (though still very, very expensive).  i thought the food was very similar in style to that of the tawaraya ryokan.  Kappa will probably join ino sushi as the only japanese restaurant i ever go to in the bay area with any regularity.  (Though i have yet to try sawa in Sunnyvale.)", 
    "review_date": "2010-09-24"
  }, 
  "r8YrTMjERM32vGUHfAw6Zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy L.", 
    "review_text": "Great service. A little too much food, but they are going by American standards I guess. I would suggest trying the place. Dont think I would go back though.", 
    "review_date": "2012-04-10"
  }, 
  "TLzwLBhPoO33w85VOXz97g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobu K.", 
    "review_text": "I got a call from my son in January.  He said, \" Hey Dad, I'm goin' Paris in March for my Spring Break!\" I said, \" WhatTheFXXX? Spring Break? There is no FXXXin' Break in Fxxxin' Spring, I never had Spring Break..\" He said, \" Well, dad, I have a favor to ask.\"  My son has a \"female\" friend who is taking internship in Paris so he was thinking he can stay at her place for free, but, it turned out, her place doesn't allow over night guest at all. So, suddenly, he had no place to stay in Paris. And he didn't have enough budget for motel. Even he got a round-trip to Paris and NY for 320.  So his spring break plan was screwed. But, he remember that my gf has friends living in Paris, so that he was thinkin' hoping that it's OK to stay their house.  \"Dad, could you ask your gf?........ Please.....\" ....................  So he went to Paris for 10 days and told me that he had a blast.  Great. Life is too short. I am really glad he had a good time in Paris.  2 weeks after, I got a call from my gf. She said, \" Hey Nobu, guess who's coming?\" I was like..... whatThe Fxxx? She said, \"My Friends from Paris!\" I said, \"HOhLySHIT!\"  The reason why my son had a blast in Paris for 10 FXXXin' days because he didn't have to pay stay in Paris and he was welcome into their family.  So, I said to my gf, \"I gotto take them out for a dinner at least.\" She said, \"WE!\" I was like... ? I said, \"Really? We?\" She said, \" Yes. We.\" I said, \" Ok, let me say it again, We gotto take them out for a dinner at least.\"  But where to? with a French couple? I already made up my mind, no where else but Kappa. I've never met them but I was so sure Kappa is it. I didn't even hesitate but my gf was really nervous. She wanted the best in the city. \"Nobu, you don't know who you'll dealing with. It's like... Jason Bourne. They are really hard-core for food.\"  So, I took her Kappa, for her 1st time 2 weeks ago for a small dinner as a tryout, and she said, \"WOW!\"  So I made a reservation for the French couple.  So, we took the French couple to Kappa last night. 4 of us. Omakase, $85 each 1. Goma-ae, small appetizer of asparagus mixed with grind-sesame seeds and miso paste. 2. Sunomono, crab and cucumber with Pon-zu. 3. Tsukune no Osumashi, Chicken meat ball with soup. 4. Combo plate, 8\"x10\" dish with 8 small great things! See photo. <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=kn0lMZrj-tAlKIn6LgkMbg\">yelp.com/biz_photos/jI7h…</a>  5. Sashimi plate. 1 slice of Hamachi, 2 of Aka-Maguro, 1 of Kanpachi and 1 Hirame. <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=LRjo4fWcibWOykd7GeC1pg\">yelp.com/biz_photos/jI7h…</a>  6. Combo plate of Unagi, Chicken katsu and panko fried corn. <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=Be9KqsSrqJkMckGxKRg46A\">yelp.com/biz_photos/jI7h…</a>  7. dessert, Ohagi=small sweet rice ball with sweet blackbean paste over. 8. dessert, small vanilla ice cream with Kinako=soy bean powder+sweet black bean sauce.  with great high quality green tea. <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=Gz0X8W6-C0fz4df8ASrmmA\">yelp.com/biz_photos/jI7h…</a>  4 decanter of Toranoko, Dai-Ginjo, from Yamagata prefecture. $25 each.  Great presentation of serving with Great traditional manner. And they have such a nice, cute, colorful quality dinner plates. Every single moment was awesome, authentic Japanese.  The 8 items above were all very small size but we were all full after the 5th plate. It wasn't exactly the same as the pictures but close enough.  One comment from the French couple. \"WOW!!!\"  We got there at 7 pm. We stayed there after 9 pm. It was great. I felt a great comfort in Kappa. We had a blast.  I was just thinking ... if we had a similar dinner in Japan, I think, they'll charge us more for it.", 
    "review_date": "2009-04-16"
  }, 
  "t9gnfunKSNQiWEL93dkvwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mike w.", 
    "review_text": "very nice we are so happy me and my wife we fond this place we do feel like at home here thank you staff", 
    "review_date": "2011-03-30"
  }, 
  "F1gz9zCuAuTiKYAU39eATA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "j k.", 
    "review_text": "Amazing meal!  Everything was fantastic end to end, from the food to the service!  The omakase was reasonably priced considering the quality of the food.  I usually prefer raw fish over cooked fish, but surprisingly the sashimi course was the most disappointing of the entire meal.  Don't misconstrue that to mean it wasn't good...it was...but everything else was just that much better!  My husband is so mad that we didn't try this place sooner (it's been on our to-try list for a loooong time).  Most people mentioned that it takes ~ 2 hours.  I went on a week night during a holiday week, so the whole city seemed kind of dead.  My husband and I were the only ones dining there at 8pm, so we were quickly seated and our first course began almost immediately.  We were out of there right on the dot at 9pm, even though we chatted on and off quite a bit with our gracious host/waitress/owner.", 
    "review_date": "2013-07-12"
  }, 
  "mkxCw6GsMZDu-44_aCQTHw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Van W.", 
    "review_text": "If you're reading this review because you made reservations and can't find the place, turn around and look up for the neon blue Playground sign.  Walk up those stairs and between the Bar and Playground is a dark wooden sliding door.  Proceed through the door.  This is like a speakeasy, you go in, it's quiet and it's clean.  The chaos of Japantown and the city disappears and you're in a little Japanese vacation.  We had the Koryori pre-fix meal with no meat.  It's interesting, the website and other reviews said there was no sushi, but we did actually get sushi (maybe b/c we didn't eat meat, it was in addition to the sashimi) -- I'm glad that happened because it was amazing!  There were parts that were the best I've ever had -- the scallops and yellow tail in particular.  The soup was excellent and all the presentation was beautiful.  The atmosphere was not relaxed, but in a way it made you focus on your food more.  It was delicate and I felt a lot more aware of my manners and etiquette.  I did pull out my cell phone to take pictures (I felt it to be a necessary faux pas fusion of modern and traditional culture!) but I will say the other diners in the restaurant kept having their phone going off -- it was on vibrate and while that generally wouldn't phase me, irritated me.  They are very attentive here and that may not be something everyone is interested in -- as soon as your glass is empty or food is finished you'll be served appropriately.  Some of the food was mediocre and forgettable, but even that was eaten with great appreciation.  There were some pieces that were amazing, but hard for me to justify going back for just a taste.  Over all, I loved the experience, but do not feel like I'd need to rush back.  It's like when you travel, there are places you're happy to visited, places you'd like to explore again, and places that you want to straight up move to -- this was the first of the 3.    on the other hand, if I was invited to go back for a free meal, I'd drop everything =)", 
    "review_date": "2013-02-13"
  }, 
  "oAlP03cHvPZrEgqWDdYAAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B B.", 
    "review_text": "WoOoOoOoOw!!!! this place is top-notch!   everything from the food and service.  yes theres a lady (Rumiko) that walks around in a beautiful kimono. yes this place is hard to find. yes the portions are small.  and yes $85 is rather steep per person. but i thought i got my money's worth! let me tell you, the food here is outstanding! i dont know why some of  these hating ass  motherfuckers didnt appreciate the food as much as i did.  this has to be one of the best japanese dining experiences i've ever had. and one of my new favorite japanese restaurants. if everyday were a special occasion (and if i had a billion dollars), you would definately find me here!  maybe i should just kidnap the chef. anyone wanna help? sorry rumiko san he's coming with us! jk.  no seriously. its that good.  the omakase (pre-fixed menu) consisted of 7 courses. if its your first time coming to this restaurant, i would highly suggest ordering this. each and every dish was beautifully presented and VERY delicious. oh and everything tasted FRESH! i made sure i savored every morsel of food.   my favorite dish was the kani su (crab sunomono). best sunomono ever! for $20 a pop, it better be! they use real crab meat and you get a good amount of it!  i also liked the kani nigiri. omg, i would choke a bitch for another one of those!! that shit was hella good! i also have to mention they have the best wasabi i've ever tasted. they use the fresh shit.  not the one you get in a tube or the powder shit. but the fresh shit.  you can tell by the texture and grittyness that it was freshly grated.  and they get it from seattle. how do i know? cuz i asked the chef and he showed me the actual root!  EVERYTHING was very good. and the service was also great.  it did not disappointment me one bit.  FYI, they DO NOT SERVE SUSHI!! so get the fuck out of here with your i-love-big-ass-sushi-that-cant-even-fit-in-my-­mouth bullshit!  no seriously.  go somewhere else if you're looking for quantity instead of quality. if they DID serve sushi here, i think the chef would do a stupendous job! cuz that kani nigiri and sashimi was incredible! but do come here if you want to experience fine and traditional japanese dining. oh and learn to read hiragana. the sign in front is written in japanese. no english whatsoever!  good luck finding it. lucky for me i know how to read it. dont forget to make a reservation! oh and prepare to drop $100 per person.", 
    "review_date": "2008-09-21"
  }, 
  "wo352zBi6mhqU6hCwNOg-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam R.", 
    "review_text": "More like 3.4 stars. Hate to say it, but this place was underwhelming given expectations/price. I much prefer Wakuriya over Kappa. I need to try Maruya for reference as well.  Not much sticks out in my mind about the menu, except how beautiful the plates looked with all the morsels on them laid out with precision. I felt like some of the dishes were a bit heavy handed in terms of flavor profile with sesame and mustard.   One large positive take away was the Japanese beer I had -- Coedo--that was amazing.", 
    "review_date": "2014-09-23"
  }, 
  "m6caGuXb_O7tOs3COPJr_A": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Laura B.", 
    "review_text": "Great with kids!", 
    "review_date": "2013-04-19"
  }, 
  "eJ4RRrwVKj7Kd2-1mJ_pBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott L.", 
    "review_text": "Nice , small  place .. Over priced   359$ for dinner Of 2 with sake Interesting , unique experience  Would not comeback    service  was excellent", 
    "review_date": "2013-10-10"
  }, 
  "1BTadkt9lZPGj0xcZR1pZQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "L H.", 
    "review_text": "I was quite impressed with this place. I stopped in for lunch because of the good reviews on Yelp. I was really impressed with some of the lunch prices; very competitive. Because the prices were so good, I figured the food might not be as good. I was wrong. The sashimi was very good as was the teriyaki chicken. If I was in the area more often, I would go back often.", 
    "review_date": "2013-11-07"
  }, 
  "wu5C1LcyvLBAyX_zPMBWhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E P.", 
    "review_text": "food 5+ ambience 3+ service 3+ portion 5  great food score couldn't outweigh all other factors..  Yet, if I can, I wanna give a 4 1/2.  There's no way...  so I'll save my 5 star for the perfect one of my dream.  If ever, my opinion matters, try this place out yourself.   This is how food is supposed to be.  Nourishing, neatly delivered, presentation and portion good, each ingredients fresh, ...  I can praise on and on about their food.    service, ambience, all others..?  just bring your company to enjoy the food together, and that will be more than sufficient.  By far, one of the best in town..", 
    "review_date": "2012-06-06"
  }, 
  "8pq5wGmgCWEBDJ8KPIe9Pg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sarita O.", 
    "review_text": "What a disappointment.  For over $185 for two (without drinks or tip) for the omakase, which I believe is the only choice, we were served standard fare like eggplant salad, cucumber and crab, tiny pieces of pork katsu, and a meatball. Dessert was a sliced up strawberry.  For the money I expected some original creations or at least an unusual twist on a standard menu.  At half the price I would have felt robbed.  On the plus side, the decor is nice and the service good, though impersonal.", 
    "review_date": "2012-06-11"
  }, 
  "PWP2exy9dNqwnmEeKv5QtQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg M.", 
    "review_text": "I've waited until after my trip to Japan to review Kappa. I had dinner at Kappa in May and just came back from Japan this month.  Kappa is on-par if not better than similar restaurants in Japan. I was very impressed with the quality at Kappa.  I feel great because I know I can get a slice of Japan without the $1600 airfare.", 
    "review_date": "2012-08-24"
  }, 
  "jP2UsrjJoBrP9hKYrCkf5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "s d.", 
    "review_text": "LOVE IT!!! Very authentic.....  and yes.. they will emphasize \"no sushi\" I've tried the sashimi... omakase... selections of fresh sashimi... the uni of my god... it melts in your mouth... *droolllsss* and the wasabi is fresh and home-made.. so it doesn't blow your head off or burned your nose as if you had a nose job. I've also tried the hirame usuzukuri &amp; salted seaweed, tsukune, grilled chicken wings, the bamboo shoot, asparagus, okra and a lot of other things... Don't come here and expect to pig out.... cuz the portions are small and very pricey.... If you don't know what to order.... try the pre-fixed menu.. but call a day in advance.", 
    "review_date": "2007-11-07"
  }, 
  "cEytkA4KL08f46JOjkbcVw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sirima S.", 
    "review_text": "Walking into this hidden gem is like walking into a Japanese speakeasy. But instead of booze and debauchery there's serenity and a transcendental food experience. My charming dining partner had the foresight to order the Omakase dinner for both of us a day in advance so we could just be seated and enjoy the Chef's choice of plates for the evening. True Japanese food is unlike the typical Japanese-American food we're used to here in the US. There is an attentiveness to subtle flavors, textures, and balance. The palette of flavors range from nutty, earthy flavors of monkfish liver w hirame, to carmel flavors of marinated octopus sashimi to the buttery flavors of buri and roasted oysters. Kappa is not for everyone...go here for a nuanced, sensuous meal with a foodie friend.", 
    "review_date": "2007-06-15"
  }, 
  "jCLG0K5ygx1n4r4jSWGkuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mika G.", 
    "review_text": "Yes it is good food. Fresh vegetable and fresh meat.  If I was from Tokyo, I would have been impressed how good these foods are. But I am from country side in Japan where all the vegetables are organic, tofu is home made, and miso is made from scratch. These foods that they serve are very homy and best made by mother and grandma whether or not it is superbly seasoned. I heard the foods best in SF, but I have to disagree considering price of $100 per person.  It did made me sentimental and miss my home, in that way, I can say this is authentic as it gets in SF... I rather eat my mother's kinpira and shiraae, though. If you want authentic japanese food without going broke, go to Minako Organic and spend $30, and use the remaining $70 at Bloomingdales instead.", 
    "review_date": "2008-05-23"
  }, 
  "z-hwsFeY66kqMVTMCp9w-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan L.", 
    "review_text": "I love the food here. We ordered the Omakase so we had a small taste of everything. All the food was very very fresh. My favorite items were the toro and the uni. The atmosphere was very nice and peaceful. The cook and the waitress were very pleasant people and hospitable. I do a more detailed (and amusing) review on my blog. Overall, it was a great experience. I would definitely come here again.", 
    "review_date": "2008-10-25"
  }, 
  "Kx_G5EDppsENTK1rze28pw": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sweet J.", 
    "review_text": "So you are aware that the price here is super high. We were aware of that before we made reservation. When we got there, there was no one else but us. It was really uncomfortable when someone's watching you eat. That was what happened to us when we ate there. We couldn't have privacy. I really wish someone would walk into this place, but gosh who would find it?!?! This place is hidden! It's weird.  The food...it's alright. They don't have salmon, tuna or whatever Japanese restaurants usually have. They kept saying that they didn't serve sushi, which got annoying over time. Everything we ordered was good tho, but definitely not great. It's not worth $160 we paid for. I wasn't even full when we left the place.  :(", 
    "review_date": "2008-01-13"
  }, 
  "3qLsdige9EVLU7LNtn6XyQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Baron C.", 
    "review_text": "Nice old couple that has been doing this for 25 years. They are very sweet. Great pours on the sake...food is average to good on some dishes. I thought it was pricey for what you are getting. 3 stars for a 3 star place. Service was over the top or bad....3 stars all the way around.  We spent about $400 for 2 people with sake.....meh", 
    "review_date": "2014-06-30"
  }, 
  "35CVnpI59bKN1rlCBgaSxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Martin C.", 
    "review_text": "I ate here years ago after reading an excellent review of it by Patricia Unterman, which I can't find any where, even on the Examiner's website.  It was probably lost in the course of the various regime changes at the paper.  However, there are 2 more current reviews in the Chonicle, which reinforce my opinion of the place.    <a href=\"/redir?url=http%3A%2F%2Fwww.sfgate.com%2Fcgi-bin%2Farticle.cgi%3Ff%3D%2Fc%2Fa%2F2004%2F02%2F15%2FPKGUI4QA0M1.DTL&amp;s=299899dfed9526b3cbc42aebd734b14ed24ef2899e29060ee44e7efe2ebeecdc\" rel=\"nofollow\" target=\"_blank\">sfgate.com/cgi-bin/artic…</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.sfgate.com%2Fcgi-bin%2Farticle.cgi%3Ff%3D%2Fc%2Fa%2F2007%2F02%2F02%2FDDGGVNSGOG1.DTL&amp;s=dbd88cae14eba6868a56e74c5c3830dd15a55043bd3f730f4133e0dfe161b768\" rel=\"nofollow\" target=\"_blank\">sfgate.com/cgi-bin/artic…</a>  It was difficult to find, but well worth the effort and part of the charm of the restaurant is it's exclusiveness -- a secret place that only you and a few other people know about.  It's also not cheap, but worth every penny. I had the omakase and can't remember specifically what I ate because it's been so long, except for a unique squid ink dish.  However, it was all excellently prepared, but the cuisine is not for someone looking for sushi or a sukiyaki combo plate.  All of the dishes are uniquely and authentically Japanese and, if you've never had a koryori-ya experience previously, it's probably unlike any Japanese food you've ever had before, including some very \"acquired taste\" type dishes that you may or may not enjoy.  Let's put it this way, if you don't like uni, you probably won't like some of the dishes presented to you at Kappa, but if you don't try them, it will be your loss.    Anyway, reading the critics' and Yelp reviews and reflecting on my prior experience there, reminds me that it's been too long since I've been to Kappa and that I need to go back there again soon!", 
    "review_date": "2009-11-07"
  }, 
  "zpGbH9oVNYXy8YM89qFhPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich L.", 
    "review_text": "I almost missed our reservations for this restaurants due to walking up and down the stairs trying to find this place lol. It shares an entrance with Milo Lounge but it is not obvious from the exterior.  We went for the Omakase and it did not disappoint in one bit. I especially enjoyed the whole flow and experience of the food. It was an well orchestrated delivery of courses with a final course that I felt was like following a food trail throughout the dish.  The final dish had about 12 different types of bite sized sushi and our kind waitress informed us of the order to eat.  TIP: Entrance is on the second floor and shares it with Milo Lounge  Food Highlight: Get the Omakase and enjoy the flow of food.", 
    "review_date": "2013-01-04"
  }, 
  "Q3QX0qCcaubqJPUwf4mY1w": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Alex R.", 
    "review_text": "My wife and I went to Kappa the other night for our 25th anniversary celebration.  This was our third visit to Kappa, and I really wanted something extraordinary and special for our 25th, so I knew it had to be dinner here.    As usual, we were amazed at the food and the overall dining experience.  Kappa is unique in many ways...  it's tucked away behind a practically hidden sliding door.  If you look carefully, you'll see \"Kappa\" in small letters adjacent to the door.  It's tiny, I think we counted a total of 14 seats capacity.  But a tiny, hidden venue like this is inline with the tradition of \"Koryori\" style Japanese cuisine, which emphasizes homemade, small plates.    Run by a husband and wife team, you  are treated as if honored guests in their home.  They are extremely cordial and attentive from the moment you walk in, offering hot towels.  If you order the \"prix fixe\" dinner, be prepared for an awesome treat.   The small plates change seasonally and according to what they are getting freshest from the market, but we had:   #1  grilled, sauteed japanese eggplant and scallions.   (tender, bursting with flavor) #2  rice vinegar cucumbers and fresh dungeness crab  (awesome, fresh, tart, delectable) #3  main course, with variety of treats (chicken meatball, prawn, corn fritter, duck medallion, pork katsu, roe wrapped in calamari, asparagus, marinated halibut (all incredible delicacies, one or two bites each) #4  sashimi plate  (generous portions of absolutely fresh yellowtail, tuna, amberjack, halibut) #5  grilled fish plate (grilled yellowtail, baby scallop and eel.  I love unagi sushi, but this was by far the best I've ever sampled - fresh, plump, tender, perfectly grilled) #6  dessert plate (red bean gel, cherry, mango) #7  fresh sorbet (melon, homemade.  Again, out of this world - best I've ever had).  We enjoyed all this along with a fine, dry sake and green tea afterwards.   Sounds like alot, but they portion it and pace it perfectly so you do not feel grossly stuffed at all.  Just utterly and completely satisfied.   This is  a rare dining experience, for special occasions, and needless to say - expensive.  Plan for about $120 per person if having the prix fixe along with liquor.  A little less ($80 -100 per person) if ordering a la carte, which is also a great choice.  THere are plenty of restaurants we've eaten that I'd have to say are overpriced, but this is definitely NOT ONE OF THEM.  This is fine dining at it's best.", 
    "review_date": "2012-05-20"
  }, 
  "nvwwRcyggvXmY1UDKSwJPw": {
    "user_rating": 4.0, 
    "user_location": "Newark, CA", 
    "user_name": "Kai Z.", 
    "review_text": "Judging by food alone, this is one of the best Japanese I had (not just in the US, but including my trips to Asia)  Last week I tried their Omakase and was not disappointed. Everything tasted good and you can instantly tell they are well above the average.  But I had to remove one star for how expensive it is. A 5 star restaurant in my book has to offer quality and value at the same time.", 
    "review_date": "2013-11-10"
  }, 
  "SbUkDj3UOL6ceCVhsiXUxw": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Lorena E.", 
    "review_text": "Amaizing! The food was fantastic. And the service very special!", 
    "review_date": "2013-05-09"
  }, 
  "__05rytNjsye9MBhqB0DMA": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Marck N.", 
    "review_text": "I am very picky about Japanese restaurants here in the bay area.  I have unfortunately haven't really found a good one, until now. The food a Kappa is amazing.   To have the true experience, you have to order the omakase menu.  The omakase started with a shrimp soup.  The second dish was a fish tempura dish. I think the fish was saba.  The third dish was the main dish. It was composed of a lot of different pieces such as duck, spicy roe wrapped in squid , tonkatsu, stingray, tomago, seared tuna, hamachi in a tart sauce, and a whole shrimp. The fourth dish (which was unexpected) was a sushi and baby scallop dish. The baby scallop was raw and the taste was sweet and delicate.  The sushi served were hamachi and unagi (drool...I love unagi).  The fifth dish was the dessert course composed of watermelon jello, mochi with red bean, fruits, and green tea cheesecake.   All desserts were delicious, especially the mochi (drool....I love mochi), though I considered the watermelon jello as the palette cleanser.  As the omakase is composed of small servings, I thought I would still be hungry afterwards. But I was content and satisfied.   Service was excellent by the husband and wife.   Very polite, precise, and all the executions flawless.  The same type of quality you'd expect and receive in Japan.   A definite must to come back when I want Japanese food.", 
    "review_date": "2011-10-09"
  }, 
  "ex9Vcw4RSggat0UHwlOrvg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "P B.", 
    "review_text": "Kappa is a place that's still around not because the food is good or memorable, but because there are a ton of Americans who have no idea what real Japanese food should taste like, but go to Japantown in SF looking for something \"authentic\" and decide that this place is worth the splurge.", 
    "review_date": "2010-03-28"
  }, 
  "6BPWg3w-B0IphHnePrYt-w": {
    "user_rating": 5.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Tak K.", 
    "review_text": "Summary: if you have eaten very good Japanese tapas restaurants (izakaya) such as Tanto, Gochi, and Saizo, and are ready to experience the extra sophistication in taste, the food is worth the extra spending.  Now here's the whole story.  My mother, since moving to the small town in Texas, has missed quality Japanese food.  She told me she would treat me as my birthday present, so as I have not tried this place, I offered this place to her, somewhat worried that she might say no given the expected splurge.  She said yes, after not being to reserve a table at Kaygetsu.  It's not easy to find the entrance to this place.  Basically, go up the step right at the front of Denny's in SF Japan town, open the double door that says \"club ??? (I forgot the name),\" and find the lantern right away.  Right to that is the entrance to Kappa.  If you turn left, you'll go into the club.  Once inside, you'll notice that the place is definitely small.  It actually reminds me of a quality Japanese restaurant in the middle of Tokyo, even though the food served is Kyoto style (slightly sweeter than Tokyo style, with more frequency of seaweed broth being used).    The waitress was an attentive Japanese woman who makes conversation to customers for hospitality.  The male chef likewise was attentive and quick on customer's orders.  Because this place only serves 13 people, though, they could do that.    The menu only has 30 or so dishes, but boy, were these dishes sophisticated or not.  Fried beefsteak leaves with miso paste inside was a nice way to ignite appetite for further dishes and sake.  Simmered Tanba (a region in Kyoto(?) that is traditionally famous for beans) black bean was sweet, but also delicate.  My kid sister really liked sheared tuna with grated yam on top.  Indeed, inside there was a small amount of broth and freshly-grated wasabi.  Mixing them with soy sauce made this dish wonderful.  Tuna itself was also great.  They also had senmai-zuke, which is pickled turnip with seaweed.  They seem to make their own pickles, and the quality was mouthwatering.  Most American probably would not care for pickles, but if you like other kinds of pickles (kim chee, sauerkraut), you should try this kind of home-made Japanese pickles as well.  Their bite-size pork cutlet was well cooked, but with a lot of flavor.  The bread batter might have to do with it, but the quality of pork (kuro buta = black pork in Japan) probably plays the role too.  Stewed green was easy to eat, but still full of flavor thanks to deep-fried been curd and a hint of red pepper.  Grilled minced chicken and Shiitake mushroom were a little crunchy on outside, and soft and flavorful on inside.  It's not easy to grill like this, trust me.  Their ochazuke was delicate and light.  I was able to finish even though I was pretty full right before that.    Yes, the bill was pretty steep.  But my mother definitely enjoyed the dish, understanding the worthiness of the food she appreciated so much.  I have to agree with her.  On the side story, my mother was aggressive enough to ask the waitress to see if they could use her hand-made glass plate for the restaurant.  While the waitress declined the offer after asking the chef, she was gracious enough to ask him in the first place.  That shows the attentiveness this restaurant gives to customers.", 
    "review_date": "2008-01-19"
  }, 
  "ULG28-Vu8seliYuaHSeNag": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Kassia L.", 
    "review_text": "Upon coming into Kappa, we felt immediately as if we had been transported back to Japan (which we have been to a handful of times). Japan is full of these tiny restaurants that only seat a handful of people. Everyone at the bar, including us, had the omakase and it did not disappoint. The chef's wife was the sole server and very efficient and friendly. She explained what each course was and answered any questions we had. The courses were creative, beautiful, and tasteful. We went from course to course efficiently, yet didn't feel as if we were being rushed - dinner still took about an hour and a half. There was plenty of food and we left feeling stuffed. There was a good amount of sushi but be prepared to try other (delicious) things as well. As we are from the East Coast, where omakases from fancy restaurants can be much more expensive, we felt that the price here, though not cheap, was very reasonable for the quality of food and the service. What a special experience! I have recommended it to all of my friends in the San Francisco area for a nice date night for special occasion.", 
    "review_date": "2013-09-28"
  }, 
  "4qsVIa8wP0EDk86VogIs1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn T.", 
    "review_text": "However, a stunning dinner last evening at Kappa is where I'll start... A farewell to a good friend was a great reason to return here...  An opening course comprised of a gelatinous goo comprised of okra and clarified fish stock on top fresh scallops, topped with large roe. A clean, bright starter...  Kinpira-gobo. This is basically simmered burdock root which had a dressing of mostly sesame oil and seeds with a little red pepper flakes.  A series of small bites; reading from left to right starting from the top-left: cold, seared marinated duck breast (tender and rich), squid rolled around fish roe, grilled meatball. Second row: sea snail, \"sushi\" of egg yolk wrapped with shrimp and cucumber, ankimo. Third row: tamagoyaki, smoked scallop, anago sushi. I love this presentation and all the various bites that are presented.  Assorted sashimi: Very decent hamachi (yellowtail), halibut (very good, very tender), 2 pieces of maguro, and mirugai (giant clam). Also, real wasabi, which was sweet and not too hot.  The fried bits; a corn fritter, a crab puff, cold seared toro, and black-skin pork, tonkatsu-style. The corn fritter was amazing - literally bursting squirts of freshness. The pork was tender and rich and the toro literally melted in the mouth.  Nearing the finish, served in a martini glass was a concoction of pureed fava beans in which was set a single perfect bite of shrimp. Topping all of it was jellied fish broth. I'm not sure I have ever experienced the single essence of fava beans so delicately prepared.  The sweet bites: Along with a selection of fresh melon and mango, are two house-made preparations - the one on the left is filled with red bean paste and topped with soy powder, kinako, and the one on the right molded with white bean and chestnut, a kuri wagashi.  A word on service - this is a husband-and-wife establishment and with only ten seats, reservations are required as all the service is done by the Mrs. The plates and utensils used are delicate, expensive, and quite beautiful. The entire meal is a treat.", 
    "review_date": "2007-11-13"
  }, 
  "BQAHahlWGMabHTQ8wjbn_Q": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Corey C.", 
    "review_text": "I was down in SF for the day and wanted to find a good Japanese restaurant but didn't feel like going to a sushi place.  From the reviews, Kappa seemed to fit the bill.  Reflecting back on my meal of two days ago, I can't say that I remember much that really stood out.  A couple of the grilled items were a little over-cooked but that didn't detract too much from my dining experience. While the food was, for the most part, nicely prepared and the service was good, I've had better experiences for comparable money.  That said, I'm certainly glad that I tried Kappa and will probably return here in a few months to give it another go.", 
    "review_date": "2008-08-28"
  }, 
  "AdReAFj-qXPdZ-Ovx0LmiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Damon J.", 
    "review_text": "Episode 6 of Minami-ke Okaeri (Japanese Anime), at about the 21:55 mark. Apparently one of the characters made a big deal about \"Matsutake Mushrooms\".  Wondering whats the big deal with these mushrooms, I immediately paused the episode and went on Google.  Found out this mushroom is rare and hard to harvest; piquing my interest, I then hopped on Yelp and searched for \"Matsutake Mushrooms\" to see where I can eat such rare mushrooms.  The results led me to this tiny traditional Japanese restaurant called Kappa.  Kappa is located next to Playground, a Korean restaurant/bar.  Though I had been to Playground before, i never imagined such a restaurant existed here.  First time I came here I wanted the Omakse, but that requires 1 day advance notice so I decided to pick individual items out of their menu instead.  Obviously I got the grilled Matsutake Mushrooms <a href=\"http://static2.px.yelp.com/bphoto/k0NsHvB1STOFGaXN1FWOPw/ms\">static2.px.yelp.com/bpho…</a> The Hamachi Neck <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=Z1K-KxyU8iXplNOGOlDQ3Q\">yelp.com/biz_photos/jI7h…</a> and got some Ankimo, combination sashimi, chicken meatballs and the crab sunomono.  They were all very good, though I wanted to try the Omakase.  I decided to come a second time and called in advance so they can prepare my Omakase.  Started off with a light wonton soup, then moved onto the crab sunomono.  Next up was the peanut butter asparagus; not a big fan of asparagus but ate it anyways.  Finally onto the main course, this is where I have decided that the Omakase was worth every penny.  Our 4th course was a combination of many items which I forgot the names for.  <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=_IECZuTFdbdgClPA9aMbVQ\">yelp.com/biz_photos/jI7h…</a> A  few items i do remember is the rice crispy tofu, deep fried tofu thats soft on the inside and crunchy on the outside topped with rice crispies.  YUM! The spicy roe wrapped with squid was outstanding.  Other items on the plate consist of tamago, duck breast, ankimo, smoked salmon, hamachi, red bean paste and the giant shrimp.   Course 5 was a combination of fresh sashimi <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=xn9JBMDghKrcQv70vY4oPw\">yelp.com/biz_photos/jI7h…</a> Course 6 includes a pork katsu, fried hamachi, unagi and a piece of pumpkin. <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=5T6osMv17i7djZgj_U01xg\">yelp.com/biz_photos/jI7h…</a> Finally this brings us to the deserts.  The mizuyokan is a kind of traditional japanese red bean gelatin accompanied with a green tea mochi and vanila ice cream topped with grean tea powder.   <a href=\"http://www.yelp.com/biz_photos/jI7hw41z5sAO6XNLzbzNCg?select=hQCI6oLcNGQmvM7JZ53AcQ\">yelp.com/biz_photos/jI7h…</a> We finished up with a plate of fresh fruits.  Everything in this little restaurant is delicious.  The wife that works here is very nice.  Both times we went she was wearing a kimono or a yukata. (i cant tell the difference)  She would talk to us while we ate and explain to us what each item is called and how its prepared.  The tea here is delicious as well.  At $85 a person for the omakase, for all the different types of food you get, Its definitely worth the money!", 
    "review_date": "2009-12-10"
  }, 
  "oA_PN6zm_r493bIfeDarpg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M J.", 
    "review_text": "Dear Kappa,  We were really looking forward to having a nice birthday dinner in you. Unfortunately, you took one look at my obviously non-asian boyfriend and I and said you were closed. Maybe if he were one of those annoying white guys who is always practicing his japanese in order to pick up asian girls you would have let us in.   Too bad. Luckily we found a nice tapas bar someplace far away from you.   -Me", 
    "review_date": "2007-08-01"
  }, 
  "_9-oyQtb3UsvX87_HYIZbQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pink ..", 
    "review_text": "Don't say I didn't warn you.  Just tell me how useful this review was after you've ben here and wasted your money.  I'm not some rube off the street.  I know my stuff.  Blah blah blah  After reading all of the reviews on Kappa, I thought I should lend a voice of reason to the \"oh my god you have to go here because it feels like you're in japan and there are real japanese businessmen eating at the bar and she wears a kimono\" comments on this place.  First off...I've lived in Japan.  I know Japan...and this place...well, it definitely IS a part of Japan.  But not the part that includes food that tastes good.  It's the part of Japan that makes you feel like you should like the food because it's part of a greater cultural experience or Kyoto-type overpriced flavorless zen experience.  I actually was served a fifteen dollar giant unflavored or seasoned mushroom here, with a garnish of a slice of lemon...that should give you an idea of the food you would expect here.  so, for 2...and only one of us drinking sake, the bill for very petite portions of eel, mushroom, sashimi, and other flavorless things (sashimi good but not memorable), the bill was roughly 170 bux.  For real.  I just think everyone should go into this knowing that you'll be paying for the experience of sitting in a very small restaurant with the wife of the husband wife duo watching you as you try to eat the flavorless mushroom without making a face-type experience.  but if you've never been to japan and fancy yourself the cosmopolitan type of person who would like the \"authentic\" experience of eating in a very small and uncomfortable restaurant, then this is your place.  but if that's the type of person you are then you are probably a manga-reading, english-teaching, nihon-phili-fetishist...and you know who you are.  holla.", 
    "review_date": "2007-04-13"
  }, 
  "NcuiXo3tkYCqUUHFTE5fjw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lisa b.", 
    "review_text": "I really do not understand these superlative reviews.  We ate here on a Saturday night, had the $85 omakase, and were disappointed  throughout the evening. Yes, the owners were lovely and yes, it was in many ways like being in someone's home for dinner, but the quality of the food was really not good.  We had overcooked and overly- salted tuna which ended up tasting a lot like cat food and over-sauced almost everything.  The major plate of the evening was something like a bento box, and after tasting bites of many of the 9+ items, I left much behind as it just wasn't good.  There is much better Japanese food in the city, and for the price, the quality just wasn't there.  I'm sorry to say this, as I had really looked forward to the experience, but I would not return.  We had the feeling that the restaurant was past its time.", 
    "review_date": "2014-05-18"
  }, 
  "P02nu2k_fPGBrp1xLflE0Q": {
    "user_rating": 4.0, 
    "user_location": "Morgan Hill, CA", 
    "user_name": "T D.", 
    "review_text": "Excellent sushi.  Very authentic.  Nice wait staff.  Unique offerings.  Cool hidden door in isolated upstairs spot.  Very expensive!", 
    "review_date": "2008-01-20"
  }, 
  "XrRwbRbPMnC--kUXMtkTSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serena Y.", 
    "review_text": "Forget Gary Danko, forget Michael Mina. Neither of those restaurants have impressed me or my foodie friends. To date, the only \"high end\" restaurant that I would recommend unequivocally was Myth... but Myth was never special occasion high end, and now its changed owners.  And then we met Kappa.  Certainly, Kappa doesn't seem like a schmancy place: it's upstairs from the Japantown Denny's, with an unmarked door, and seating for no more than 10. But the food, the service... its heavenly. Plus, one of the things that I was not impressed by Gary Danko was that the food they served was so generic. It was damn good, for sure, but I can get good foie gras just about anywhere these days.  Kappa is like no other restaurant - Japanese or otherwise - that I've been to. John and I went last Tuesday for his 30th birthday, and it was a wonderful experience. We ordered the omakase so we didn't have to think about what to order, and what paired well with what. We were the only two customers in the place until the last 30 mins, so Rumiko (the owner) fussed about us. Everything was superbly presented. All we had to do was to order a sake, and enjoy the food.  Even though each taste was just a morsel, by the end of the night, even Mr. Hollow Leg John was stuffed. Besides, the flavors were so rich and different that we were able to savor each bite.  It will be hard to top something like Kappa. But that's ok, that's why we have special occasions only occasionally.", 
    "review_date": "2008-03-06"
  }, 
  "LPvlJeH4d_GqQoyYHx-0FQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "G Z.", 
    "review_text": "We don't regularly drop $100+ per head on a meal, but when our anniversary rolled around it was time to pull out the stops.  Reservations were no problem with a few weeks notice. The restaurant is very small, so it's important to book ahead.   The interior is a bit underwhelming. Some guests might be put off by this, but I think it's actually a good thing. The food and the service are so good, if the place looked better, it would spoil the convivial atmosphere and make everything feel cold and formal.  The food has been covered very well by other reviewers. Lots of small plates, very fresh, seafood heavy, and minimally prepared. It's great. Most first-time visitors are encouraged to try the chef's menu (a good choice), and all we were responsible for was choosing sake.  The service is extraordinary. The entire restaurant has a staff of 2! The husband is the chef, and the wife handles everything else. It's not at all off-putting - the experience is like being the dinner guest of a very hospitable couple.   We'll save our pennies and go back some day.", 
    "review_date": "2007-04-21"
  }, 
  "MjlNTynslY_aLDTfGODuIg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LL C.", 
    "review_text": "This place is the only place of its kind in the city, and perhaps anywhere in the vicinity. I will try to explain why that is, but it will be extremely difficult.  The service: an older Japanese husband wife team, no other help. They are cute, friendly, extremely humble and gracious. Attentive, extremely so. Very VERY friendly.   The location and space: located where old Denny's use to be, 2nd floor, in J-town. It size of the restaurant looks like a glorified storage closet for the club/lounge next door - its small, intimate, BUT NOT claustrophobic as they limit the diners, there will be no more than 8-10 at anytime, they space you out so that you have enough privacy and do not feel cramped. It is almost reminiscent of those old style exclusive japanese restaurants you see on TV.   The food: the omakase is a 7 course meal for $85pp. For the quality and portions, it is a VERY fair price. The dishes were inventive and atypical of what one might think of japanese (which is usually sushi, sashimi, udon, sukiyaki, and curry, etc). The couple who owns the restaurants hails from northern japan, they bring that region's flavor into their restaurant. They definitely serve sashimi, extremely fresh and delicious at that, but there are plenty more dishes that I have never tried before.   The highlights for me were the salmon with fermented rice, the squid with squid eggs, the squid roll with fish roe, the sake/soy eggplant, the toro (both sashimi and nigiri versions...extremely fatty sinful and creamy), the asparagus with sesame sauce, their house made wasabi, and house made red bean cake. There were absolutely no complaints on my part for the food, in fact, every dish was spot on! We asked the nice lady to recommend some sake as well, we ended up sampling 3, just tell her what texture you like and she will get it done!", 
    "review_date": "2013-09-07"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "Absolutely, positively fantastic. 4 of us made a reservation for the omakase (pre-fixe) meal this past Saturday.  When we walked in and were greeted by the hostess (in full kimono), and seated at 4 seats in the middle of the bar - the only seats in the restaurant with table settings.  Turns out, we were the only customers that evening. We asked the hostess to select a sake for us to start with, and 2 hours of foodie bliss began. The general format was that for each course, the chef (her husband) would come out front and prepare the course, then would return to the back while she served it and we ate.  It wasn't clear if he wasn't particularly chatty, or just didn't speak as much English.  Know that part of eating here is talking to and interacting with the hostess - she not only explains what each course is, but is also interested in chatting with you during the meal, learning about her customers and making it an interactive dining experience.  If you're looking for a place to huddle over a table in the corner and just stare into your date's eyes, this isn't the place for you. ;) Her English was quite good, but many times I was glad I could speak some Japanese - I think it helped break the ice, and made the experience more fun for everyone.  So what did we have? 1 - chicken meatball with a slice of shiitake mushroom and a couple of other things in a light but very flavorful soup broth. 2 - Japanese eggplant in ponzu sauce with bonito flakes 3 - Dungeness crab meat, and lightly pickled cucumber with sesame seeds 4 - a large square plate with a number of wonderful bite-sized items, all arranged around a huge raw prawn, including: duck breast, monkfish liver, smoked-salmon nigiri, lotus root slice, tako-yaki, burdock root wrapped in sea eel, sweet red beans, tamago, cooked hamachi, crispy tofu, and spicy cod roe wrapped in squid(?).  beautiful presentation. 5 - sashimi plate with maguro, hamachi, kanpachi, and hirame I believe 6 - a plate of hot food bites - fried fish cake with fresh ginger, panko fried scallop, fresh corn fritter, and the most amazing melt-in-your-mouth unagi I've ever had 7 - first dessert - slices of incredibly fresh, sweet fruit: mango, peach, and melon, accompanied by a homemade mochi-like gooey sweet rice ball with red bean paste 8 - second dessert - vanilla ice cream with black sugar sauce and soy bean powder  The desserts were accompanied by a fantastic green tea.  Every single thing we ate was fantastic.  Rich, subtle, simple, complex, balanced... pick a superlative adjective, and it would apply. About halfway through our meal we noticed that the slabs of fish in the display case at the bar weren't being returned (as they usually would at a sushi restaurant) after they were taken out for each course, and we realized that we were eating all of them.  All of the fish had been purchased specifically for our meal, which explained its fantastic freshness and quality.  We also ended up having 5 different sake over the course of the evening (which racks up quite a bill, but was entirely worth it!).  The hostess is very knowledgeable about all of their sake, and is happy to recommend ones appropriate to the meal at hand.  Everything we drank paired magnificently with the food; it was easy to tell these items were meant to go together.  Our favorites were the Naraman (Jyunmai), which was dry but very complex, fruity, and flavorful, and the Kagatobi (Ginjo), which was fascinatingly similar to a hard, mineral water in flavor, while very clearly not being water.  2 hours after we'd arrived, our luxurious meal had come to an end.  It had been the perfect amount of food - we were all happily full, none of us too full, none remotely hungry.  A truly spectacular meal, and an incredibly unique, very intimately Japanese experience that made me nostalgic for my time in Japan.  It's not remotely cheap (especially when you drink as much as we did!), but it's completely worth it.", 
    "review_date": "2009-07-27"
  }
}