{
  "mSH3tAoOfAGJcWRK38DxIg": {
    "user_rating": 5.0, 
    "user_location": "Georgetown, TX", 
    "user_name": "Paul W.", 
    "review_text": "I read the other reviews which appeared mixed. My wife and I  went there and we cannot understand some of the negative reviews. The service was excellent, the food too. Maybe there is new management since the negative reviews, but I would definitely go back there. Two thumbs up, way up ! Check this place out,", 
    "review_date": "2010-12-15"
  }, 
  "I3jioQCaq1TfJ49FdsWIaw": {
    "user_rating": 1.0, 
    "user_location": "Auburn Hills, MI", 
    "user_name": "Tracy S.", 
    "review_text": "Over priced for the quality of food - waitstaff was horribly slow and forgetful - we even made the mistake of eating there twice!  Nice TVs for watching football but NOT a sports bar as advertised!", 
    "review_date": "2009-10-10"
  }, 
  "OWnYWg8L67W-moQJkjrXPQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark W.", 
    "review_text": "Have come here a number of times and always have wished that it was more kick ass.  Definitely my kind of place to hang out at with numerous TVs, draft beers, food and some other gaming activities but everytime I ask myself, why is there something not totally right about this place.    Well, I know for sure their operating hours have always been jacked up.  I don't know what it is but it seems like everytime I come here, they are about to close.  This is a bar for godsake.  You should really open later.    And the food is average.  I'll still come here once in a while if I am in the area.  Possibly when I am entertaining out of town guests but there are numerous other places that are better for viewing my sports.....", 
    "review_date": "2008-08-20"
  }, 
  "HYQoxBC1y1DGPq6pGP09Tw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "Matt and niece were here at this predominant tourist sportsbar, which is connected with the Hyatt Hotel, to kill time and watch the Superbowl. Man, this place is packed full of sports spectators, mainly Chicago Bears fans, which they lost at the end. With many sportsbar in the city being filled to capacity everytime with huge sporting events, this place is no exceptions.    With the bar being overly-crowded, we finally got our drinks. Niece ordered a pair of Long-Island Iced Tea for herself. She decided to get two drinks all at once, because she doesn't want to deal with the hassle of getting the attention of the overworked bartenders who is assisting others. The bartender did a good job on her cocktails, because it was so strong and tasty for $7.00. After the two drinks, you have a idea on her \"Happy\" mood. Matt ordered a bottle Henry Weinhard Rootbeer. The $3.50 drink tasted good, and complimented well with the free peanuts in the shell.   After we left, the facility is full of trash and empty peanut shells among other debris. We might come here again on a quiet weeknight and try the food, in which is upon our interest in the future. The food has names after celebrities and athletes; which is cool.", 
    "review_date": "2007-02-04"
  }, 
  "fPCN1X42dXrz4JL4oJyLmQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Catherine H.", 
    "review_text": "Came here a couple times to watch important games I didn't want fucked up by the bad mojo that seems to overcome my teams when I watch them at Rickey's. Right, you heard me, whether my teams win or lose is TOTALLY based on where I'm watching their games. Recognize.  Anyhow, Knuckles isn't bad for a bar located in Fisherman's Wharf (shudder) attached to a hotel (double shudder):  Cons-- food's at best pedestrian; the drinks are sort of average in pricing; and there's lots of tourists going in and out.   Pros-- there's lots of TV's; the staff is pretty friendly and forthcoming about finding your game; they really don't pressure you to keep ordering even if you're there for three hours and only sucking down diet cokes and one plate of nachos; and the bar has full windows, which makes the sunny room a nice change from the usual sports bar caves.   So, if you don't want much more than alcohol, greasy food and a decent selection of televisions Knuckles is a reasonable option to work into your sports bar rotation.", 
    "review_date": "2008-03-27"
  }, 
  "J56C7Dc9E7Q0mpMTJGW6Qw": {
    "user_rating": 4.0, 
    "user_location": "Richmond Hill, Canada", 
    "user_name": "Roma M.", 
    "review_text": "We stayed at the Hyatt next door and ate here for breakfast every morning. The breakfast is decent - 3 stars with a chef making a mean made-to-order omelette with ingredients of your choosing. I enjoyed the muesli and yogurt available in the buffet, but I would have liked a better array of fruits.   The service here is worth the 5 stars. Each server went above and beyond the call of duty, from providing wonderful suggestions for day trips, to actually bringing other dishes from the buffet. I thought that was an unspoken rule about buffets - DIY.   Amazing service from each and every one of the team.", 
    "review_date": "2014-11-30"
  }, 
  "R-6wal3DD5-K5o7C5OMexA": {
    "user_rating": 2.0, 
    "user_location": "Rancho Santa Margarita, CA", 
    "user_name": "Sarah M.", 
    "review_text": "Overall, Knuckles is what you would expect from a bar/restaurant attached to a hotel.  Good happy hour drink prices and handy location.  Bartenders were nice enough, with the exception of one kinda of cocky guy on Saturday night, but nothing I'd complain about.  One note- If  you love nachos like me, then do NOT order them at Knuckles.    Strike One- They do not use real cheese. And, while I know many a nacho lover likes that, I prefer real cheese.  Strike Two- The top had almost no cheese. So, I just assumed they weren't generous with it. When we got to the bottom, we discovered a pool of cheese. It literally looked like they put the cheese in and then piled everything on top. Odd choice considering a nacho is eaten from top to bottom.  Strike Three: The chicken on the nachos was inedible.  I ate one piece of chicken on my first bite and picked it off of every other bite that I ate.  It was straight gross. I said nothing to my boyfriend, then he said \"This chicken tastes off?\" He kept saying it tasted like it was old and had been sitting out.    I'd say go for happy hour drinks, but stick to all the other delicious food options the city has to offer. We ate at so many other amazing restaurants, we kind of kicked ourselves for wasting stomach space on pretty average food here.", 
    "review_date": "2012-09-25"
  }, 
  "tWyRL6KijkZ-MKvijEwb6Q": {
    "user_rating": 4.0, 
    "user_location": "Fisherman's Wharf, San Francisco, CA", 
    "user_name": "Leslie P.", 
    "review_text": "Had two average mimosas. The soup and sandwich were pretty tasty, the grilled cheese being two thick slices of crispy sourdough and melted cheese stole the show. The chowder was average. I would not recommend the ahi poke nachos, pretty bland. 4 stars for excellent service!", 
    "review_date": "2013-08-31"
  }, 
  "_kSbuZlcen8sjeiVhKj4Fg": {
    "user_rating": 2.0, 
    "user_location": "Foster-Powell, Portland, OR", 
    "user_name": "Dana S.", 
    "review_text": "The only time we go to Knuckles is when a coworker is leaving.  Even if we like our coworker.  Maybe because they'll take a reservation for 20 on a Friday.  Or maybe because they have beer.  At my third such coworker-quitting-quasi-celebration on Friday, the best part of lunch was the car chase on the supersized tv over the bar.  The menu is rough on vegetarians, even before the portabello sandwich arrives with lots of eggplant and no mushrooms.   As a final insult, the fries suck--at a sports bar.    Oh right.  It's a sports bar.  Attached to the Hyatt.  In the wharf.  It's exactly as soulless and bland as you'd expect.  At least they have beer.", 
    "review_date": "2008-02-26"
  }, 
  "iVElFWUG2QurUzIMxlI2Mw": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Janessa ..", 
    "review_text": "Really disappointed in the service here!! Lunch yesterday was fabulous and are server was more than awesome, but for breakfast this morning we've received the complete opposite service! We all got continental or buffet so it wasnt as if they had to do much but our server has been nothing but rude and unhappy/annoyed when we asked for anything. She was also super annoyed when we mentioned a discount. Maybe she was worried about her tip, but we all work in the service industry a d tip generously off the total, unless you work really hard not to deserve it.  Bummed out to leave this review, but this breakfast service was totally unacceptable.", 
    "review_date": "2012-03-28"
  }, 
  "pAU1Wd7FthzR9yB5yOAXPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D.c.g G.", 
    "review_text": "The breakfast buffet and omelet bar are a great way to pig out in the morning.  All the breakfast items are fresh and you get to eat until you explode.  It does cost $19, but if you are really hungry it is a great time.  The other menu items are very overpriced.  The onion rings are very good.  The breakfast is the only good thing about this place.", 
    "review_date": "2013-01-01"
  }, 
  "j7cWTIPhoQDk8dMteEn-rw": {
    "user_rating": 4.0, 
    "user_location": "Burlington, MA", 
    "user_name": "Aaron K.", 
    "review_text": "Was glad to find this place open on christmas night, our first day visiting San Fran.  Our planned restaurant was closed.  The restaurant had a lot of moderately priced meals and good looking meals so we decided to eat here.  The fish and chips didn't disappoint.  They were awesome.  The fish had the perfect beer batter shell which wasn't too thick.  My girlfriend had the cobb salad which was fine for what it was.  Definitely recommend the fish and chips.  Service was extremely slow, but hopefully this was because it was christmas and they only had one waitress but the place was almost full.  I would go back for the fish and chips.", 
    "review_date": "2010-01-03"
  }, 
  "KoGaf723AAIle3AcpAG71Q": {
    "user_rating": 2.0, 
    "user_location": "Downingtown, PA", 
    "user_name": "Mario J.", 
    "review_text": "I only come here because my breakfast is included in the room price. Other than that, I would not pay the prices on the menu. For free, it is ok. For the prices listed, it is horrible! I had the buffet and I tried the waffles. They are dry and hard, so I went back and got the bacon and eggs, and they were ok.", 
    "review_date": "2013-12-30"
  }, 
  "IEygbPOdgOcFG4AQdXT6Aw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Becky C.", 
    "review_text": "It was alright. Slow waitstaff service for the most part although reception was very nice. My boyfriend got baked mushrooms and gave them a 6/10. I really liked the marinara sauce they came in though. I got a strawberry flavored drink that was good, but overall I wouldn't choose to come here again.", 
    "review_date": "2012-07-15"
  }, 
  "JpwaSyhREorkzcItT8M58Q": {
    "user_rating": 1.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Brittni P.", 
    "review_text": "If it wasn't for the convenience of being located at the Hyatt, I am certain this place would not be in business.  I have never been so disappointed in a servers lack of enthusiasm, my husband and I were turned off from the second we were seated.   Besides the horrible service we had, stick to the burgers, fish &amp; chips.  You can't mess those up and it seemed to be the popular items flying out of the kitchen.", 
    "review_date": "2013-06-09"
  }, 
  "js4wjUqfNu4xJBu27KZKhg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul T.", 
    "review_text": "In 1920, when H.L. Mencken was in San Francisco to cover the Democratic Convention, he remarked something to the effect ' we felt we had escaped America'.   As I took a seat at Knuckles, after a bit of a walk on a warm day, at happy hour, I had the sense that America knew where I was, had been following me, and wouldn't let me go.   It was that corporate.  And yet, given the resources of Corporations, it turned out to be rather thin, and not at all well done.  Why?  This sports bar used to advertise itself as \"historic\", in reference to an earlier phase as a warehouse, where the granite and marble that was shipped to town in 1914 was stored, prior to being piled up in what we now know as City Hall.  One should not expect that any of that imperial grandeur was left behind, it was not.  Although, the brick walls have a certain attraction, as bricks always do.  The joint is furnished in what is known as \"contemporary\", with wood to give it warmth and substance, and lots of shiny-shiny to keep it looking clean; it's neither modern nor possessed of any character that comes with age.   One wall, over the bar, is lined with large flat screens, all of which are set to sports stations of the sort that never seem to show any real games, or programs, just snippets of games and talking heads, talking.  WIth the sound turned off, mercifully, although I noticed that you can rent a little box that will allow you to listen at your table.  It was happy hour, which is why we went in, and figuring (correctly) that the wine selection wasn't going to be impressive, I ordered the red, and was told they were out, but I could get Kendall Jackson and some other label for the same price.   When the bartender, a nice and funny gent, went off to get it, the Partner pointed out that the wine they were out of lined the top two shelves above the tvs, and seeing the label, I noticed there was an open bottle of the same, with the rest of the open wine bottles behind the bar.   Hmmm.  I didn't pursue it.  The Partner had Anchor Steam, which I'm delighted to say tasted just like Anchor Steam.  My Kendall Jackson Cab was appropos to the bar, being a bit sweet, rather light, and not at all complex or interesting.  I ordered an Angus Slider and I would like to think that the rest of the cow went to some fine dining establishment, well aged and served in an exquisite preparation.   As burgers go it was O-Kay.   The fries on the other hand, long and thin, like Pomme Frites, were excellent, some of the best I've had, anywhere.  The Partner ordered the stuffed mushrooms which came in the dish in which it was microwaved.   The alarmingly orange sauce had apparently been left in long enough to reach a boiling frenzy, reduce itself by half, and to have splattered the rest of the dish, leaving a thick high water mark and splatters all about.  Presentation:  Nil.   The Partner didn't seem to impressed with the flavors, I didn't even bother.  All in all, it was not what I was expecting.   Frightfully suburban, mall like, very Corporate, yet utterly lacking just the same.  I've eaten in Suburbia---at a place that reminds me of this one, actually, but better done, in Burlingame.     So, I did it, you can say you did, and head off to some much better bar, of which there are quite a few nearby.", 
    "review_date": "2011-09-21"
  }, 
  "YHV4HKDoVAear1EcH1F_GA": {
    "user_rating": 2.0, 
    "user_location": "Culver City, CA", 
    "user_name": "Felicity M.", 
    "review_text": "Should have taken the restaurant name as a cautionary hint against this place.  No San Francisco local should ever eat here... there's just no excuse, with so many other amazing dining options in this fair city. The only people who should ever eat here are guests of the adjoining Hyatt, or other miscellaneous tourists with no other alternatives.  The food was mediocre, uninspired and served cold, draft beer selection was lacking, and the decor/environment was cringe-worthy. Not my style at all. It was a sports bar that was attempting to pass as San Francisco chic, but just failed in so many ways. Either be trendy, or be a sports bar. Just choose.  The service was the only saving grace about this place. They had some very kind people working here. So yay for that!  I can't say that I'll ever be back... but at least I came in with low expectations, so I wasn't that disappointed.", 
    "review_date": "2010-05-02"
  }, 
  "k-MUuyaDinOTlwFUEMeIyg": {
    "user_rating": 5.0, 
    "user_location": "Marietta, GA", 
    "user_name": "Carey C.", 
    "review_text": "Technically, it's now called Brick and Beam.  I don't often give 5 stars!  Honestly, reading the previous reviews, this place may have reinvented itself.  Doesn't really matter to me!  Its solid now!  Ambiance is a cross between a sports bar/gastro pub/NYC styling.  It's definitely in the tourist district, but I wouldn't call it a tourist destination.  To be fair, I came here twice and sat at the bar both times.  But we did order appetizers  off the menu both times.  The sliders and the rolled quesadilla are amazing!!!  I'm told the quesadilla's  are new.  But WOW!  So why 5 stars...  Location * Price * Ambiance * Staff **  Normally staff rates a single star...  so why 2?  Everyone was amazing and friendly!  But one man, Rick (at the main bar) over the top!  FAST, FRIENDLY, and very personable!  He was the gem of this place for me!    Bar is near the kitchen as well... and all the food I saw coming out, looked amazing!     If i'm ever in the area again... I'm coming back!", 
    "review_date": "2015-01-14"
  }, 
  "aezNVjdAn5UsGfiupY1tXg": {
    "user_rating": 4.0, 
    "user_location": "Springfield, OR", 
    "user_name": "Wendy N.", 
    "review_text": "Tom the bartender was great!!! Give that guy a raise!! He had great tips for places to eat &amp; things to see :)", 
    "review_date": "2014-07-29"
  }, 
  "tYVSORGa1XnpEL1W3QW1WA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "Decent food and ok prices. It was convenient since we were staying at the hotel. I probably wouldn't go back otherwise. The ahi tuna nachos were an interesting dish.", 
    "review_date": "2013-06-30"
  }, 
  "P_1Kt0KSd10x9Fjd80_kpg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Stayshuhh G.", 
    "review_text": "We really enjoyed our dinner here. The cobb salad came in a bowl that looked like it could serve 3. Awesome (expensive) drinks and great place for watching a game. I think our waiter's name was Lawrence and he was seriously awesome.", 
    "review_date": "2011-02-05"
  }, 
  "K4sxdjJPilW4snwdejqqRA": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Annabelle C.", 
    "review_text": "Great service!  Great food!  A wonderful place to stop in for a beautiful environment, excellent service and delicious food.  My hubby and I have eaten here twice and both times have been absolutely delightful experiences.  The menu is much more diverse and upscale than any sports bar/restaurant I have ever been in.  The televisions are beautifully placed and it's actually quiet elegant even with 20 or more televisions.  It's comfortable, not too loud and just a really enjoyable place to be.  We will definitely stop in again soon.  Our server, Wilfredo, was very attentive, and had a gracious manner.  Perfect lunch :o)", 
    "review_date": "2013-04-07"
  }, 
  "lbt6UjfyHqO33XEWMJAp6Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Annissa H.", 
    "review_text": "I stayed at the Hyatt here once but didn't eat at Knuckles but last week I tagged along to the Hyatt just for the day with my fiancé and we were actually going to eat at Hollywood Cafe right across the street but they were closed due to electrical/maintenance problems I think??   So instead we ate here and just missed the breakfast window but did have the option of the breakfast buffet, but we weren't left with too much time as it was drawing near to closing it down. Two fails in a row.  We stayed and just ordered lunch. We went for the crab sandwich and the chorizo pizza. I loved the pizza because it had good veggies with feta and I love arugula on pizza. I'm not a big chorizo lover, it's too salty for me so I only ate two or three pieces of it per slice. If you love the meat you will be pleased because there was a lot of it. My fiancé absolutely loved the pizza. The pizza alone would have him rate Knuckles four stars.  I personally liked the crab sandwich better. At first bite I wasn't feeling it, tasted really plain and boring but the second bite where I got deeper in the middle where all the good toppings were made me really enjoy it. It wasn't as crabby in flavor as I was expecting but it was still good. The side of fries it came with were really good too. It has that similar crunch on the outside and softness on the inside like Burger King fries, but better.  The iced tea was really nice. It had a subtle flavor of passion fruit or something. Delish.", 
    "review_date": "2014-09-04"
  }, 
  "MxdPk4L3goC3WyjMAiET2w": {
    "user_rating": 3.0, 
    "user_location": "Laurel, MD", 
    "user_name": "Frank C.", 
    "review_text": "This is the restaurant at the Hyatt at the Fisherman's Wharf area in San Francisco. I did enjoy watching some baseball and football here, but it's lacking that sports bar atmosphere. The bar area itself is pretty small, and most of the restaurant is devoted to tables and folk eating food staying in the hotel. The food was good; but not memorable.  If you need a quick place to grab a bite or drink, it's an okay place. But, if you have some time, seek out a better place for dinner or to watch a game.", 
    "review_date": "2013-11-10"
  }, 
  "y_GMw0XBty_LRrFgSciPeA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kellie T.", 
    "review_text": "An impromptu visit from the Mother Out-law and some friends brought us to Knuckles.  We wanted to eat somewhere around the wharf, but most of the places right on the water are overpriced and, in my opinion, not very good.   The food here was incredible, my pulled pork sliders, the garlic parmesan fries, and everything else that came to the table was perfect.  So what gives with the two stars?  The service is TERRIBLE.  Our waiter was rude, snappy, and not very attentive.  He actually snapped at one of us when she asked what came with her sandwhich.  His answer: \"FRIES!\"   Waters were not consistently refilled, and we were asked multiple times (to the point of real irritation) if we'd be ordering more drinks.  No, sir, I don't need three alcoholic beverages with my meal, thank you.   Oh, and the \"sports bar\" feel is definitely missing.  You can't even see the screens from the booths.    I loved the food here but I highly doubt I'll be back.    Bottom line: The food is great, but until they learn to be a little nicer to customers don't go here.", 
    "review_date": "2010-11-10"
  }, 
  "mg-HQR5V_geD22hhiHTo6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Demi W.", 
    "review_text": "Good food. Tried this place for the first time. Ordered sourdough grilled cheese and soup combo, a pepperoni pizza and garlic fries.  Everything was cooked well and I had no complaints. Service was great also. But the food is just Good, not great or anything super special. For a simple meal I would go back, the atmosphere is relaxed and comfortable, the proportions served are generous.  Acceptable price, clean establishment, expect to leave full and satisfied.", 
    "review_date": "2014-07-28"
  }, 
  "I-0Be1dHEacp293TeRUDpw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art A.", 
    "review_text": "Got a cob salad  here last week for lunch and it was incredibly bland. Flavors were \"meh\" at best. I was really looking forward to a delicious salad but it was quite a disappointment. Service was better than food though.", 
    "review_date": "2010-06-13"
  }, 
  "NlgoEofqBOT7yEFD92uWbg": {
    "user_rating": 4.0, 
    "user_location": "Stamford, CT", 
    "user_name": "K P.", 
    "review_text": "Pretty good food but nothing special, one of the nicest places to go in fishermans wharf area. Nice bar and good service. Pulled pork sandwich was ok and crabcakes were decent, the sauce was probably the best part.", 
    "review_date": "2012-07-02"
  }, 
  "OPtv-lFAgcddoUuHCcTHUQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris S.", 
    "review_text": "Wow went here 2 years ago and they made the most amazing fresh cornbread.  This time was BAD! Cornbread was day old, food flavorless and bland, and service slow. The sweet potato fries for example don't even have sea salt - this is Fisherman's Warf; 2 blocks from the ocean....  What I was not impressed about is when the bill came they charged us $5 per piece of cornbread even though I sent all 3 pieces back! For the portion I would expect no more than $1.50 a slice.  San Francisco is full of amazing locally owned and operated restaurants where the servers and chef's care about the patrons and have passion. This place is a Hyatt hotel bar and does not live up to the Hyatt name. Stick to local options. After the service here I will think twice about ever staying at a Hyatt hotel again.", 
    "review_date": "2011-02-11"
  }, 
  "3K031IamxMLTdDCgjRFwmA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roz B.", 
    "review_text": "Great TV set up, especially for Sunday games. The atmosphere is what was disappointing for us. This is definitely a restaurant over a fun place to watch football. Service was somewhat slow and we didn't try the food. Wouldn't recommend going here to watch games if you're looking for a sports bar type feel.", 
    "review_date": "2012-12-16"
  }, 
  "k1Tt9i9MZjAnjwkDGOHcOw": {
    "user_rating": 1.0, 
    "user_location": "Folsom, CA", 
    "user_name": "Leah S.", 
    "review_text": "We walked in late but before close. We were ignored for about 15 minutes. When our server finally came to take our order, we were refused a food order. The kitchen \"was closed\" though it was still open when we were seated. We were seated near the kitchen and food continued to be cook and served for a half hour after we had arrived. Though we got our drinks in a timely manner, no one came back to ask if we wanted another until long after we had finished. The bar was almost empty but that didn't seem to free up anyone to give us good service. There are too many good restaurants and bars in this city to ever think about coming back here. No thanks.", 
    "review_date": "2014-07-04"
  }, 
  "Zt1Zs23ifbxTCDhvH46pBA": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Victoria C.", 
    "review_text": "The waitresses were great, but the food was so sub-par!  PROS: 1. Super nice wait staff, especially Nancy. When I was not pleased with my lunch, she got me a discount (without me even having to ask!). She asked how the lunch was, I told her the salad was gross, and didn't expect a discount. I just wanted them to know and to tell the chef, but she, on her own accord, gave me $4 off each lunch combo.  2. On the Wharf.  3. Emptyish (not sure if it's a good thing or a bad thing). Seating is abundant.  CONS: 1. Icky salad! I ordered a lunch combo with half a veggie wrap, the chowder, and mixed green salad. The salad was seriously wilted and very, very brown. Like it was old, reused, and/or had been sitting out on the counter for a day. I couldn't believe it. I couldn't even touch it. I didn't have a bite at all. Seriously, chefs, get your shit together.", 
    "review_date": "2010-07-13"
  }, 
  "dGy6LmfgfJyftpcHVkPtEw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "Knuckles is always a great place to watch a game; mainly because they have so many flippin TV's.  It was game 5 of the MLB playoffs with Detroit and the Yankees mixing it up so off we went to watch the game. It sucks the Giants aren't in it but that doesn't mean I can't root against the evil empire.  Some sports bars only have a few TV's and if you don't get there early you have to deal with a sore neck or looking around and over people. That is never a problem at Knucks. They have a nice wall of TV's over the bar and then smaller ones placed around the tables on posts.   I have had good, bad, and ugly service here which is why it rates a solid 3 stars. The food has been decent to good as well. This last visit was straight up beers and appetizers to go with some raucous cheering. With so many TV's even when it gets crowded people spread out a bit so you get some breathing room. Great place!", 
    "review_date": "2011-10-07"
  }, 
  "Jc4B-QUaKuKqeXGUhGZGFw": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Glenn G.", 
    "review_text": "Several dirty tables, slow server. Fish and chips was brought out with ketchup, I had to request tartar sauce. The only reason they get one star is because the Asian wings were awesome.", 
    "review_date": "2011-09-29"
  }, 
  "GPXiBVCx63hpYJImfQxcWQ": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Darnell H.", 
    "review_text": "Just as an update, this Knuckles still sucks.  But on the bright side, the Knuckles at the Hyatt in Burlingame is still a bad ass bay area sports bar that has lots of Niner, Giant, Warrior, and Sharks vibe...good stuff.    Also, Hyatt remodeled the Knuckles in Monterey, and lo and behold!!..it still looks like a sports bar with bay area ties too!!  All of this leads me to believe that the decision to turn this Knuckles into some half-assed version of a \"sports bar\" with bad service and overpriced food was that of the local San Francisco Hyatt manager.  He's probably a Dodger fan or something...", 
    "review_date": "2011-03-17"
  }, 
  "DPiZ_4tSvz6zuFa7ER42aw": {
    "user_rating": 2.0, 
    "user_location": "Miami, FL", 
    "user_name": "favio p.", 
    "review_text": "Great service but not a great menu or tasting food. Got for when you are in a hurry.", 
    "review_date": "2010-08-05"
  }, 
  "ZXNwO2bY3QTYP0k_5bhG1A": {
    "user_rating": 2.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Dan B.", 
    "review_text": "After our small group struck out with all the highly-rated brunch and breakfast spots in the area, we walked by Knuckles and noticed they were serving brunch. And they had a bar...and I was really craving a bloody mary.  Let me just go straight to the summary:  A sports bar atmosphere; decent food; terrible service  Atmosphere: With TVs covering almost every square inch, it was a little distracting for a meal with family and friends; eyes wandering everywhere.  Food: Not bad; but expensive (especially the buffet - yikes!). My egg white frittata with spinach and salmon was decent.  The kids liked their pancakes.  Service:  Waitress was late to arrive at our table; she mixed up the juice orders, forgot waters, forgot some juices, accidentally served my juice in a kids' cup, mixed up our food orders; and she delivered our food to the table over an extended period - not all at once.    But the most annoying snafu was she forgot my bloody mary altogether, even though we had a conversation about the spice level. Plus:  she forgot that she forgot. By the time I could get her attention again, the meal was 90% over. At that point we were ready to kick-start the long process for paying the bill. (At least I was never charged for the drink).  In short, a three star spot.  But when they blithely forgot the one thing I was craving all morning, I am not filled with generosity in my rating.", 
    "review_date": "2014-10-16"
  }, 
  "Ou0bxVnxl9m-7aK9GC6EAA": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jimmy J.", 
    "review_text": "Full disclosure:  Point the First:  I harbor a personal bias against lame silly-ass sports bars in general.  Point the Second:  I've never eaten here, but I have got my drank on on several occasions.  My brother, Bachagalupe, who ordinarily has impeccable taste when it comes to watering holes, for some inexplicable reason loves this place, which is the only reason that I know anything about it.   It is somewhat ironic, I suppose, that I don't really care for Knuckles in spite of the fact that I've had some killer times here.  For example, the last time I was there was for Bachagalupe's birthday.  Weezer and I were commenting upon the big fake jugs that one of the women in our party (whom we had just met) was sporting.  I also observed, in my capacity as an amateur plastic surgeon, that there was a very good chance that she had undergone a major rhinoplasty at some point in the past.  Weezer commented, \"For all we know, she may have started out as a guy.\"    Be advised that the acoustics in Knuckles can be a bit tricky in the sense that although it was noisy as hell and the woman in question was a good ten feet away and facing away from us and engaged in conversation with someone else, she immediately spun on her heels, glared at us and yelled, \"YOU THINK I'M A GUY?!?!?!?!  YOU THINK I'M A GUY?!?!?!?!\" Whereupon she marched up to us, grabbed Weezer's hand, and unceremoniously stuffed it down the front of her pants.  \"There,\" she said, \"do you still think I'm a guy?!?!\"    Weezer, a master of thinking on his feet and who used to gamble for a living said, \"Well, probably not, but you could have things neatly tucked away.  Have you ever seen 'The Silence of the Lambs'?\"  \"Here,\" she replied, grabbing his hand anew and thrusting it down her pants a second time. \"Make sure.\"  (You know you want to roll with my crew.)  Weezer rummaged around until fully satisfied that nothing untoward (like, say for instance, a snake in the grass) was lurking in her trousers.  \"Okay,\" said Weezer, \"You pass.\"  \"Good,\" said the broad in question.  \"Now, I better not catch you sniffing your fingers.\" With that she stomped off in a histrionic huff.  Weezer and I, of course, immediately repaired to a quiet corner where we could sniff his fingers to our hearts' content.  Now that I think about it, that story alone is worth an extra star.", 
    "review_date": "2010-03-15"
  }, 
  "duFP2mFpWc-qc21T5XKvNg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Badri N.", 
    "review_text": "Good sports bar in a typical business hotel setting.  Great TV layout - you WILL see the game in all its glory.  And the place is open when most surrounding places are closed - how can you beat that?!!!  I watched the 2010 NFC Championship game here and saw the Saints win over the Vikes in overtime - with a room full of fair weather Vikings/Brett Favre fans.  It was a lot of fun.  Clean and spacious, lots of seating and a good sized bar area.  Lots of beer on tap - $6 for a 16 oz draught beer - very reasonable.  After the game was over and the rowdy masses dispersed, I ordered some food - an English influenced Club sandwich - ham, bacon and fried egg - can't go wrong with this combination - excellent indeed!  And the fries were good as well.  Great service - bartender (Tom) was extremely generous with his final pour of Single Malt Laphroaig that I took up to my room - slainte mate!!  ~ 4 stars overall - fun atmosphere, affordable drinks, good food and fantastic service.  Recommended hangout if you're in the city.  # 160", 
    "review_date": "2010-01-24"
  }, 
  "NlhwBPbb-O1ZGUSl31dRrg": {
    "user_rating": 2.0, 
    "user_location": "Newton, MA", 
    "user_name": "Kate M.", 
    "review_text": "Worst. Nachos. Ever. If you like fake cheese and soggy nachos, the food here is for you. If my rating was on food alone, this would be a 1. Points scored were for the fact that this is a great place to watch a game and get a drink. Our server, who I forget his name (oh so helpful!) was super friendly and warm.", 
    "review_date": "2011-11-21"
  }, 
  "e6c_s6kJOMYtvkk2_HU7ng": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim O.", 
    "review_text": "Knuckles is not the local hangout...  When I first joined the groupon nation I bought 1 for knuckles just for the sake of clicking buttons.. So me and a friend went down to watch the warriors game &amp; get a bite/beer. Lets just say the food left alot to be desired and the prices were above average. As for the beer..  I was hoppy with the Anchor steam on draft! There was a nice LCD layout with individual TV's in the booths and big screen LCD's behind the bar. I can see coming here if you're an out of town sports fan/family with kids.", 
    "review_date": "2011-03-01"
  }, 
  "1GFynq7bkbq_jyEO52-iVA": {
    "user_rating": 4.0, 
    "user_location": "La Puente, CA", 
    "user_name": "Joseph C.", 
    "review_text": "I got complimentary meals from the hyatt next door. Begger's can't be choosers. It was a damn good meal. check my pics.", 
    "review_date": "2008-08-28"
  }, 
  "CZU1RZavKV2fHhTvRRWdew": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen C.", 
    "review_text": "First time into this sports bar and as soon as you step inside, there's a snooty air.. not a welcoming hometown feeling sports bar at all.  But nevertheless, we were there, so we sat down to watch a game and eat.  Food was only okay. We had calamari which was more soggy than crispy. The nachos looked deceivingly impressive.  Chicken burger was dry.    While we were there, there was a sign on the table that said \"Wear your college team's gear and get 20% off\"  Out of the 4 of us, one person had our team shirt on.  Granted, it was only one of us, but still, we figured we'd try to ask for the 20% discount.    First, the waitress said \"It's supposed to be your team JERSEY but I'll give it to you this time.\"   Ummm... okay.... the sign says GEAR... but whatever fine, they were nice of us to offer to give it to us.    Then, instead of the waitress, the manager comes out instead.  The manager brought over 2 bills and said \"I'm sorry, the discount is only if you wear jerseys, not t-shirts.  But I'll give it to you this time - I took 20% off the items of the person who wore the shirt.. all other items are on this second bill full-price\".  The words falling out of this lady's mouth were flabbergasting.    What was she trying to do??? Lose customers?!? Because that's what she did.    My problem was that I already had to fight the other three to pay for the bill, and now this manager sours the lunch by splitting hairs about who ate what and who gets a discount and who doesn't.. the better way of handling the situation would have been to either give the whole bill a 20% discount or even to just say no and deny the whole table the discount... who asked her to split the freakin' bill !?!? In fact, she even split it wrong but who's counting..........  End story, DON'T GO TO KNUCKLES.  SNOBBY PEOPLE THAT HAVE POOR CUSTOMER SERVICE AND HORRIBLE FOOD.   Get over yourself.", 
    "review_date": "2010-10-19"
  }, 
  "2feX-HoiFo0XAKemgKxlTw": {
    "user_rating": 3.0, 
    "user_location": "Atherton, CA", 
    "user_name": "Carson H.", 
    "review_text": "I wish there were more sports bars in SF. I sadly did not get Sunday Ticket the last 2 years so I am relegated to random bars to catch da Bears. They have a lot of TV's and the food's OK, it's just that it's pretty much in Fisherman's Wharf which makes me throw up a little bit.", 
    "review_date": "2008-04-29"
  }, 
  "QT-ThcQQ_PhrmkzOHtiS5A": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Tiffany H.", 
    "review_text": "Came here bc we had free vouchers to their Sunday brunch.  It was okay, nothing to be too excited about.  If you feel like a buffet brunch, sure.  Otherwise, I would probably just go to pier 39 for some seafood!!!", 
    "review_date": "2012-06-14"
  }, 
  "jgPOl8penY4km_zdEYRAhg": {
    "user_rating": 3.0, 
    "user_location": "Kent, WA", 
    "user_name": "Laurie S.", 
    "review_text": "This review is only for the bar.    My husband &amp; I stopped in for a beer while we were out and about in San Francisco.  The bar area is nice. There were 6 tvs up on the wall with just about everything you can imagine on them.  The place was empty for a Monday at 3pm.  It's part of a hotel so I imagine a lot of people are from the hotel.", 
    "review_date": "2011-09-06"
  }, 
  "qkGkUPyZQ7Mki-rp6Hp1uA": {
    "user_rating": 3.0, 
    "user_location": "Edgerton, WI", 
    "user_name": "Gary L.", 
    "review_text": "Nice bar, but 6 bucks for a domestic beer??", 
    "review_date": "2013-04-26"
  }, 
  "WOlfaz4vzUNvNxCScXeYrg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kirsten V.", 
    "review_text": "I am a native and I have passed this place a million times but assumed it was a place that was only crowded during tourist season.  I went there for a business breakfast and I must say I was impressed.  yes, it was full of tourists but I kinda liked that.  it's swanky inside and flat screen TV's everywhere, so if you're into sports this place would be awesome.  I had the breakfast panini with potatos and a dijon aioli and it was delicious.  My co-worker had the corned beef hash with eggs which looked pretty dang good and it came with toast wrapped in a basket wrapped in a linen napkin and a side of salsa.   Another associate had a breakfast buffet that was $18 which isn't too bad if you can put some serious food down.  I would totally grab some San Fran friends and come back here cause it's relatively untapped.", 
    "review_date": "2009-07-22"
  }, 
  "rtKQeKo7DThaNQuokHKPSw": {
    "user_rating": 2.0, 
    "user_location": "Williamstown, NJ", 
    "user_name": "Derrick J.", 
    "review_text": "Came here upon checking in and coming off the plain from the east coast. Got here at about 10:50am and was told that they only serve the breakfast buffet until 11. Service was excellent as we wanted lunch (whole time change thing), they supplied us with menus and drinks until then.   Ordered a pizza and my date ordered a Cobb salad. Hers looked a lot better then mine! She said hers tasted good! Mine, the thin crust was loaded with pepperoni on some sesame seed crust with semi melted cheese.   Guess that's what you get for being attached to the hotel!", 
    "review_date": "2013-11-08"
  }, 
  "RNHlYf_cI1BdFXmQdB8VOw": {
    "user_rating": 5.0, 
    "user_location": "Vienna, VA", 
    "user_name": "BJ G.", 
    "review_text": "Great beers on draft, amazing nachos (get them with steak) and nice TV's to watch sports on.", 
    "review_date": "2010-03-05"
  }, 
  "cKazHkFnbboM0I3yFrMgpA": {
    "user_rating": 3.0, 
    "user_location": "Manhattan Beach, CA", 
    "user_name": "Tiff P.", 
    "review_text": "Part of the Hyatt in Fisherman's Wharf; it's a tourist area so you're definitely going to be looking at tourist prices. Locals, get a 15% discount! Don't forget to ask. Came here for brunch and ordered off the menu. The breakfast buffet was lack luster, and didn't appeal to anyone really. All they had were the basics.  This place was pretty busy Labor Day weekend and service was just so-so. I would have found it more frustrating, but Nancy is one the best waitresses I've ever had! Let me repeat that...   IF YOU EAT HERE, SIT IN NANCY's SECTION!    No, I don't know her personally, but i was so impressed with her attitude and genuine demeanor. Our group was a picky bunch, and she accommodated us without even flinching, smiling the whole time.  For the food: - Super salty chicken-fried steak.  - Bacon cheese biscuits are A-OK, but better with a side of gravy - Eggs Benedict, mmm mmm good - Bacon cooked just right - Skillet was full of potatoes, some of which weren't cooked  - Egg white omelette with a ton of additions was delish! - Tobasco only. Haven't we moved on from the vinegar based hot sauce?", 
    "review_date": "2014-09-01"
  }, 
  "QRyXsigFa4R3p4iXab0AKg": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Tyler C.", 
    "review_text": "Just wanted a beer and that's all I got. I'm lucky I went in at happy hour or else I probably wouldn't have gone in at all. Decent prices for happy hour beer. The bartender did the bare minimum. Nothing special overall.", 
    "review_date": "2014-01-04"
  }, 
  "7edHxOKYn5UwGXafHGRlAw": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Robert R.", 
    "review_text": "Before I go into this review, I just wanted to state for the record that this is not the same Knuckles that is in the Hyatt in Monterey. I was staying in the Wharf very recently and decided to give the Knuckles a chance at the Hyatt in the Wharf. I was floored by the difference in both restaurants. The one in Monterey has a college feel with Peanut shell husks, and self-serve Popcorn at the bar entrance. Not to mention that all the used husks were thrown on the floor. The Monterey one also has a couple of Pool tables and a couple of Video games. The bar has a lot of Taps of Beer and a College bar type of atmosphere. So when I went into the one in S.F., I was floored. The restaurant looked elegant and trendy. The places did have a lot of T.v.'s, but were strategically located throughout the restaurant. The other one in Monterey had a lot of T.v\"s as well, but had a Sports bar like feel, because they have the ESPN theme with a bunch of monitors bunched around into a Cube-like single-screen. The Wharf Knuckles had reasonable prices and more of a Sports bar feel without out all the College like feel. I ordered the English Club minus the fried-egg. My wife ordered Pulled-Pork sliders and the Spinach dip appetizer. The little one had the Corn Chowder with Kid's Spaghetti. The appetizer was served with toasted Pita bread with Fresh Vegetables . (Broccoli, Carrots) My English Club was served with Dijon mustard and French Fries. The Fries were crispy and hot. I also ordered a Cobbler with ice cream to go. The server said there were no nuts, but there was a mountain of Walnuts in the dessert. Not too good if you have a nut allergy. All in all, good experience at a modest price. I will go there when my team plays an away game. Go Niners!!", 
    "review_date": "2009-07-17"
  }, 
  "eo2qfd7lJeAk1o0iyBXakw": {
    "user_rating": 2.0, 
    "user_location": "Thousand Oaks, CA", 
    "user_name": "Pete S.", 
    "review_text": "Ok breakfast.  Not really a sports bar considering the TVs are not in the best place for viewing.     Food is average at best.  Service is typically a bit slow - but when you are staying at the hotel you really don't have many options for breakfast before heading out to start your day.", 
    "review_date": "2011-01-03"
  }, 
  "Strb-zv7UKWSSirBQZjeWg": {
    "user_rating": 2.0, 
    "user_location": "Beaumont, CA", 
    "user_name": "Sarah N.", 
    "review_text": "Just \"ok\". Granted this is the most convienant place to go if your staying at the Hyatt but the service is slow, and the food was just alright. Go across the street to the Cafe for breakfast, sooo yummy!", 
    "review_date": "2012-07-18"
  }, 
  "o7eqaspRmkbdnAAbp7c7qQ": {
    "user_rating": 1.0, 
    "user_location": "San Tan Valley, AZ", 
    "user_name": "Elyssa W.", 
    "review_text": "Kitchen Closed! That's how we were greeted by the busser and our server when we walked into this \"bar\" to have a couple of drinks around 10:30pm.  The busser blocked the table we were trying to sit at, as if he was hoping we were just going to turn around and leave.  Our server reluctantly asked us what we wanted to drink.  My Husband asked him what was on tap, he replied, \"What do you want?\"  That was it for us...we quickly drank our one beer and left, but not before being scolded that it was last call AND having our server hand his tip back to us as if he was above a tip from us.  This happened to be a Friday night, the place was about 75% full and for some odd reason, they were trying to close down the place early.  Do not recommend this place at all...terrible service!", 
    "review_date": "2012-12-27"
  }, 
  "vJU7VP831iKtwdwdD49MWw": {
    "user_rating": 3.0, 
    "user_location": "Aurora, CO", 
    "user_name": "Jason J.", 
    "review_text": "This restaurant is attached to the Hyatt at Fisterman's Wharf, so we had to visit it at least once while we stayed there.  The ambience was very nice and it was a good place to sit in. Service wasn't that great, but it was okay. Food was good for what it was, but not that great either. So, definitel ya 3 star-er.", 
    "review_date": "2010-09-10"
  }, 
  "m6p5knAyIS79s6WNbeIdGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen E.", 
    "review_text": "Solid place to watch sports with a large group...if that is your thing. I like beer and my friends and they like sports, so I joined the crew for happy hour and football time. The beer was a good deal and kept on coming. The food was typical hotel/bar food: freshly defrosted American food. The ambiance is very hotel bar and fake looking, but man there are a ton of TVs and private booths for large groups.", 
    "review_date": "2010-01-18"
  }, 
  "PgrCdD3iPgYzXxO8QsMnew": {
    "user_rating": 3.0, 
    "user_location": "Aurora, CO", 
    "user_name": "Jessica J.", 
    "review_text": "We stayed at the Hyatt Fishermans Wharf and Knuckles is attached to it, so our first day there we ate dinner here + ordered room service breakfast from them the next day.   The place is actually pretty cute. Brick, open, lots of windows so it is light and bright. There are booths with their own TVs along the wall, a fairly big bar and tables that pepper the rest of the place. All in all a nice feel.   We ate at kind of an off time for lunch/dinner (3p) so not sure if what we had was the lunch menu or dinner menu (or if they are different). However, the hubby had a burger, I had a chicken sandwich and we shared potato skins. All in all the food was good, although extremely basic. We hadn't eaten since like 6a that morning so it all tasted awesome, but then again we were really hungry! I can't think of one thing that stands out now.   Biggest complaint was the cost of it all. I know it was a hotel restaurant and it was near the wharf - so what do I expect? Still it was steep for what we ate/drank. Like a $70/bill for a couple sandwiches and beers.   Oh and breakfast, the next day rocked. Try the zucchini &amp; cheese frittata - it had was so rich and packed with goat cheese and veggies I couldn't get enough. Of course, our two breakfasts cost us $47!   It was a decent place and convenient for us since we were in the hotel, but a bit pricey for what it is.", 
    "review_date": "2010-07-27"
  }, 
  "CmMYi_gqAfBRU0scy53PGQ": {
    "user_rating": 3.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Stacy F.", 
    "review_text": "The drinks were great! The prices were definitely high and the service was mediocre. I've since found better bars in the Wharf but otherwise I'd probably go back to Knuckles.", 
    "review_date": "2013-10-23"
  }, 
  "srC6EDHsMXWERPBopvgC6A": {
    "user_rating": 4.0, 
    "user_location": "Edinburgh, United Kingdom", 
    "user_name": "Ethan U.", 
    "review_text": "Quite impressed. Went here for a beer at first then a couple days later went for food.   Bar service was excellent, then when we went for food was equally impressed. They were busy but not packed yet the service was spot on. After we were seated by the greeter, the waiter came over on route to another table to acknowledge us and say he would be right with us.  Food was great, all cooked perfectly and good sized portions.   Price was reasonable. Plenty of sport on but at the same time the volume was dulled so that it didnt interfere with people who wanted a more relaxed evening.   Definitely worth dropping in.", 
    "review_date": "2009-05-31"
  }, 
  "dUy6PSOP_Se7rdnlHH8cuQ": {
    "user_rating": 1.0, 
    "user_location": "Fisherman's Wharf, San Francisco, CA", 
    "user_name": "Matthew P.", 
    "review_text": "Here now. In from out of town and I wanted to watch the hockey game so I stopped in. Couldn't be more dissatisfied with this place. The service was absolutely awful!  I asked a server (not ours because ours was no where to be found) for a glass of water. His response \"I am not your server\" and walked away. Avoid this place. Over priced. Terrible service.", 
    "review_date": "2014-01-12"
  }, 
  "uM0whjUTDrJ0K6UG-4kpZg": {
    "user_rating": 4.0, 
    "user_location": "Long Branch, NJ", 
    "user_name": "daniel c.", 
    "review_text": "This is a really nice place to watch sports. They have multiple TV's and bring a speaker to your table for volume.  The service is always on point here and the food is very good.  It is very pricey though so be prepared to spend some money.  I got a club soda and chicken sandwich which was really good but spent $26!", 
    "review_date": "2014-07-10"
  }, 
  "RR-hNSxTUs4CSkGQZLEWyw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jamie L.", 
    "review_text": "Came here a few weeks back while visiting my bf in the City. Looking for a place to get a drink and maybe dinner, my bf said he noticed Knuckles at the Wharf while walking to his inside the Hyatt. It was raining like crazy that evening and it was a nice haven from the dodgy place my bf was staying at.   To share we started off with the Knuckles Nachos with chicken. A massive plate of nachos topped with black beans, cheese, guac, salsa, sour cream, and jalapenos. We so did not know the amount food we were going to get. But it was definitely worth the order. However, this \"small bite\" was so not small that when we got our entree of Fish and Chips, we could barely finish it all.   The service here was quite attentive and the restaurant did not seem like it was attached to the hotel. However, the only downfall was that late in the evening, I was surprised that the hosts would sit families so close to the bar. I felt like I had to censor myself when a family of four sat down next to us then ended up switching tables because of the conversations around them that were occurring at the bar. Not like it was x-rated or anything, but I know I was sailor-trucking in my conversation with my bf.   I would like to give this place another go next time where in that area of the City.", 
    "review_date": "2012-04-01"
  }, 
  "1Ezjju1mwsQRoVQlsiIq-Q": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "smriti k.", 
    "review_text": "On a July 4th weekend to watch the World cup and get some Nom nom's.And YES!! I saved up the review and I am filling it up after a few months.Whaaa???Let's face it!It really doesn't matter.     The place wasn't really packed,I wasn't sure if it was a restaurant,a sports bar,or a diner -it was a combination of all the above with pretty LCD Tv's mounted adjacent to every table.We all got seated in a booth and ordered chicken wings,sandwiches,fish and chips,wine and beers -trying to get in the game mood?     The food was ok,nothing brilliant.With a confused ambiance and average food and drinks,the afternoon seemed fine due to the game?or friends?or the wine-effect?Whatever it may be,Mr.Knuckles you managed to get a 3 star and not get knuckle punched with a 1 star rating.  -Smriti", 
    "review_date": "2011-01-16"
  }, 
  "SQBJ5dqi6vyMxxzoAgY2FQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Tani P.", 
    "review_text": "We stumbled upon this restaurant on NYE and it was fine, but nothing to write home about. The sourdough grilled cheese could have been great but was definitely undercooked (cheese not even completely melted) and the drinks are definitely overpriced.", 
    "review_date": "2015-01-02"
  }, 
  "l9Zvr8gnbRvLVFHT-L_McA": {
    "user_rating": 5.0, 
    "user_location": "Trabuco Canyon, CA", 
    "user_name": "Meghan T.", 
    "review_text": "I had a fantastic experience at Knuckles. I was there for lunch and the ambiance of the restaurant was super chill and very comfortable. The staff was friendly and they informed me that the menu had recently been redone. I tried the new grilled cheese sandwich and it was amazing! So gooey and delicious. For my side, I had the asparagus with an over easy egg on top. Man, out of this world! The asparagus was so fresh and perfectly cooked, and the egg was perfectly runny too. I would highly recommend the food at Knuckles. Yum, yum!", 
    "review_date": "2013-04-02"
  }, 
  "wuDd7PD0KJS1yENFV2L9HA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "J R.", 
    "review_text": "I have fondness for this place when I first moved to San Francisco, when I needed a sports bar that wasn't full of Bay Area fanatics and had good food.   Great location, not very busy most times that I visited, very good pub quality food and beer selection.   The service wasn't the greatest, which was surprising considering its proximity to the Wharf and the many tourists who'd visit.   Once I got settled into the area, I stopped going but I would recommend it for anyone.", 
    "review_date": "2009-09-28"
  }, 
  "hdY-JwP3OY2TG5HgByrslw": {
    "user_rating": 1.0, 
    "user_location": "Santee, San Diego, CA", 
    "user_name": "April M.", 
    "review_text": "The food was pretty good.... Then I turned my head as I was sitting at the bar and watched a server eat food off a plate at the kitchen then scratch his nose and then he picked up the plate and deliver it to a table.  I  then watched the servers from there on out... No hand washing and lots of rubbing their own butts and scratching balls..picking their weaves and of course grabbing plates and delivering them to table after table.... Don't forget good servers that people always watch what you are doing.....", 
    "review_date": "2013-11-24"
  }, 
  "drvVOxJxdakl_sQhr28uJA": {
    "user_rating": 4.0, 
    "user_location": "Gig Harbor, WA", 
    "user_name": "Ted H.", 
    "review_text": "This restaurant is attached to the Hyatt.  I got in to the hotel late and was desperate for food (which is how I ended up at a place called \"Knuckles\").  I am so glad I did.  They have a chicken focaccia  that is to die for.  It is really, really good.  Perfect really.  For the cost (on par with most wharf restaurants), it was a lot of food and filled me up. I will definitely be back here for this sandwich.  The waitress also recommended the grilled cheese.  The décor is nice and they have a lot of TVs (including some inside of booths).  I didn't have any alcohol, but the beer menu had all of the usual suspects.", 
    "review_date": "2014-05-07"
  }, 
  "MGhKNO12impia4GKUvdcAA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Patrick O.", 
    "review_text": "Damn, 2.5 stars huh?? I guess the food must be that atrocious. I didn't have time to try it so maybe that's why I enjoyed Knuckles more than most of the reviewers who strive for good food.   Aside from this place being way dead during March Madness I still enjoyed my time with a friend here. The interior is very nice and welcoming. The bartender was friendly and attentive for any of our needs. They have 8 big screen TV's with a very convenient channel changer for each 2 seats at the bar.   If you're just trying to kick it, have a nice cold 1 and watch a game or 2, I would recommend Knuckles.", 
    "review_date": "2011-03-26"
  }, 
  "-z-QZCKdTjupHT0ZDjGVZQ": {
    "user_rating": 2.0, 
    "user_location": "Cumming, GA", 
    "user_name": "Brooke W.", 
    "review_text": "We stayed at the Hyatt, so we thought this was super convenient the first morning. Think again! The breakfast food was just ok and overpriced. Go across the street and eat at Hollywood cafe. The food is better and less expensive.   As for the bar, we spent a little time at the bar. Drinks are good. Bartenders are pretty friendly, and they gave us some good tips on things to do in the area. I'd definitely go back to this bar, but I most likely wouldn't eat there mainly because of pricing!", 
    "review_date": "2011-06-13"
  }, 
  "05796MJj-TwACdzscsqpKg": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Julie S.", 
    "review_text": "Breakfast was delicious ! Crab cake eggs Benedict. Exactly what I expected. Good service , very nice atmosphere!!", 
    "review_date": "2012-07-06"
  }, 
  "RPPFNf2UFiF-fHYuw66-ew": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle R.", 
    "review_text": "DO NOT WASTE YOUR TIME OR MONEY HERE!  This review is on behalf of my significant other, he doesn't have a Yelp account, so here it goes:  He and his friend came here a few weeks back to watch a Warriors game, they walked in and weren't greeted/seated for a full 5 minutes in a very empty restaurant. (That's a realllly long time!) Minus 1 star  They were finally seated but weren't given menus or a server for a full TEN minutes, significant other had to get up and FIND menus to bring back to the table. Minus 1 star.  The only TV playing the warriors game was too far for them to see, so they got up to ask another server if they could either change the channel on the TV closest to them, or move.  The server just looked at them and shrugged (WTF?) and walked away.  Ooookkkk...so they go and ask another server and apparently only 1 TV in the entire place plays the Warrior's game (what?) and won't let them move. Minus 1 star.  They finally order some bacon nachos, or something along those lines, because apparently some other menu items they were looking at couldn't be placed for order. Oi vey.  The nachos come absolutely cold, cold to the point that the cheese had that weird \"I've been sitting out for too long, and I'm not greasy anymore\" glaze. The chips were completely stale and rubbery, and to add insult to injury..there was NO bacon-the only thing they were looking forward to. Minus 1 star.  The check NEVER came, and they had to get up and retrieve it from the bar area. Minus 1 star.  So, as you can see, this place actually deserved 0 to negative stars, but Yelp doesn't have that feature...Yet.  Hopefully after seeing reviews like these, Yelp will reconsider.", 
    "review_date": "2010-02-04"
  }, 
  "GJapRQqOIKyn-tc-fz5M2g": {
    "user_rating": 4.0, 
    "user_location": "Boulder, CO", 
    "user_name": "kassandra t.", 
    "review_text": "We went here for brunch. The brunch was a good meal. The bloody mary was delicious. I would actually venture to say that the bloody mary was one of the best I have had in the bay area.  The food was good as a typical american style restaurant goes. The brunch has good full meals that are not typical and have a good taste. If you are in the area and looking for a good relaxing brunch (especially on a weekend) this is a great place to go.", 
    "review_date": "2010-04-28"
  }, 
  "D3IKd9FffyGvu9E0wikJww": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dan t.", 
    "review_text": "Terrible.  I'm no \"foodie\", and really don't have super high standards when I'm drinking on a Sunday...  But this place was just plain bad.  EVERYTHING we (table of six) ordered was tasteless, dry and underseasoned.  The service was rather spotty, too.  - Potato Skins w/Pulled Pork:  Dry, dry, dry.  (How can pulled pork be dry?!)  It was as if they were made the day before.  - Angus Sliders:  Dry, tasteless beef.  The pickled onions were the only flavor.  - Fish &amp; Chips:  Just gross.  Rubbery.  Seriously odd texture.  The fries were good, though.  - Angus Burger:  Again, dry and tasteless.  None of us finished anything except our drinks.  I think three or four different people waited on us, but this wasn't a good thing; none was the main point-person.  None knew what the other was doing, or had done.  I didn't expect a fantastic meal, conisdering it's in a hotel in a super touristy part of town, but jeeezus it was bad.", 
    "review_date": "2011-01-11"
  }, 
  "N4TxtzExVKNL68G0Ub93qA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mehgan B.", 
    "review_text": "Screw these other reviews!!! I just went last week and the service was GREAT as well as my food.  After a fun trolley ride my mom and I ran into this little place and were kindly greeted by our waitress. The booth was too cool it had a private TV as well as personal iPad to pass the time. We went during lunch and I was able to enjoy my DODGER game in peace hahaha Wasn't crowded at all.  Using the ipad I looked at the reviews and everyone said get the fish and chips so I did, mom got the chicken sandwich.  Our food came in like 20 mins and our waitress was joking with us and taking care of us very well. The FISH &amp;CHIPS ARE HEAVENLY! Might I add the perfect size!!!  LOVE LOVE LOVE!!! CHICKEN SANDWICH was also good too!!!  Go here if you get the chance!! The other reviews can go suck a bottle ketchup!!!!", 
    "review_date": "2011-05-30"
  }, 
  "zC_CmoGUzYIFmD_SU5lDaA": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Roz M.", 
    "review_text": "Nothing special. Not what you'd expect for high end hotel. Corn bread was stale. Food mediocre. Service was poor. We had to go to Dottie's True Blue Cafe to redeem our experience since they serve AMAZING corn bread.", 
    "review_date": "2011-01-24"
  }, 
  "8wHKhb9wqIHca43Xr1xJZQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen I.", 
    "review_text": "*This review is for vegans*  It's really easy to be an unemployed vegan.  Not so much when you find yourself at a business lunch in a sports bar where every salad offered has a fried chicken breast, ranch dressing and hard boiled eggs on it.  I found the one thing on the menu I could veganize and was presented with a grilled veggie wrap sans goat cheese.  It was chocked full of peppers and onions.  You know.  The things that turn me into a complete fartbox when consumed in large quantities.    After I took a bite, I realized the one thing I really really really wanted inside this godforsaken wrap was awfully hard.    Unripe avocado.  It's chewy.    Eeeew.  I refrained from deconstructing my meal and eating the pieces I wanted. I was in the presence of people in expensive suits.  Trust me though, if I was by myself I would have stuck various slimy veggies to different surfaces within the booth I was in, maybe even spelling out the message: \"FOR SHAME!!!\"  I can't speak for the rest of my omnivorous party.  I can only speculate when one of them says \"Wow this is...good?\" that's not a good thing.    That should be a declarative statement and not a...question.", 
    "review_date": "2009-11-12"
  }, 
  "MFmpgDOynM8R9xGG-71i4Q": {
    "user_rating": 3.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Matt R.", 
    "review_text": "Well... they serve beer. That almost guarantees you a few stars in my book. That's about it. There are just way too many other choices in SF to even consider this place. We had a free dining credit here, because our hotel (Hyatt) was connected, otherwise I would have kept walking. It was soooo dead in here on a weekend afternoon. Beer is the usual high price. They have a pretty decent selection (Guinness.) My girlfriend's apple-something martini tasted and looked suspiciously like a lemon drop (yuck.) Service was ok. I consider screwing up a drink in an empty bar to be pretty lame. Then another waiter tried to make a 'funny' remark to us, that just came off as half-rude. Anyway, nothing to see here folks, keep moving. But, you probably knew that already.", 
    "review_date": "2009-06-11"
  }, 
  "VqZwaM86UD-DHsSwpXx_dQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick K.", 
    "review_text": "Great place to watch sports, especially if you're staying at the Hyatt.  They have a ton of tvs, a good beer selection, and their food is pretty good to go on top of it.  Been there several times now and for the most part have had good service.  Once we had a waitress who was pretty horrible but kinda wrote it off as the exception.  FYI it can get a little busy at times.", 
    "review_date": "2013-11-20"
  }, 
  "fGjuj3-oM-ZIaX7FpiMsEA": {
    "user_rating": 5.0, 
    "user_location": "The Woodlands, TX", 
    "user_name": "Elle G.", 
    "review_text": "I met a colleague here for dinner after a hectic day and changing hotels.   I had the chop salad and it was perfect!  I know it's just a salad but the salad I had earlier for lunch was horrible.  This place was within walking distance to my hotel and the atmosphere was very nice.    The waiter was friendly and didn't act put out when all I ordered was a salad and water.  I just wanted something lite and to get to my room.  I would definitely recommend this place.", 
    "review_date": "2013-10-31"
  }, 
  "WI_Rz31DlEu91VTIQjAhQA": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Morgan D.", 
    "review_text": "Husband and I stopped here for a late dinner on a Saturday.  I ordered the Poke Nachos on root chips, and they were very good! I wish it had more Poke but still enjoyed it.  My husband ordered the Catch of the Day which was seared Salmon over grilled radish and lettuce.  The salmon was amazing - the outside was crisp and the inside was very tender.  We ordered a small side of sweet potato fries and they were perfectly cooked!   The staff was great, very friendly!", 
    "review_date": "2014-03-09"
  }, 
  "lXZsUMbmZ5ECMhzSqYnxeA": {
    "user_rating": 2.0, 
    "user_location": "Marietta, GA", 
    "user_name": "Kassandra M.", 
    "review_text": "Ehh...bartender tried to over charge us.", 
    "review_date": "2010-09-13"
  }, 
  "xGkleJ95BAj4a15j9TZlyA": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Jake O.", 
    "review_text": "Here's what's great:  A plethora of TVs.  Personal speakers at the bar/your table to listen to your game of choice  Fantastic Bloody Mary  They are open on Sunday at 10:30 to watch football  Here's what sucks:  The bartenders.....They don't care about you. They would rather talk about what they are doing when they get off. Or, just anything other than taking care of you. I've been there 5 times now over 3 years and its the same song everytime.   The food....it isn't good. From the no taste chicken wings to the underwhelming nachos. It's all bad.   The bathroom....not a huge deal, but you have to walk to the hotel attached to use it.   If this place didn't play sports, I would never, ever ever ever ever come. The bartenders would appreciate that, I'm sure.", 
    "review_date": "2012-11-14"
  }, 
  "xy1kXEzqri6kK1pRYBjquA": {
    "user_rating": 1.0, 
    "user_location": "Portland, OR", 
    "user_name": "Jon S.", 
    "review_text": "Slow service, not very good food, expensive.", 
    "review_date": "2008-04-20"
  }, 
  "Oi0Uc98qhPRfaftKWYeWqg": {
    "user_rating": 3.0, 
    "user_location": "Burlington, MA", 
    "user_name": "Gerald B.", 
    "review_text": "As many said it before: typical sports bar, with the usual crowds, cold beer and bar food. The salads are fairly edible, but I strongly recommend to get desert anywhere but there.   One big bonus for the hungry business traveler is free Internet access through the Hyatt WiFi network.", 
    "review_date": "2007-05-12"
  }, 
  "HAmYzzWGTqMHvUieDstuIg": {
    "user_rating": 4.0, 
    "user_location": "Anaheim, CA", 
    "user_name": "Sherri E.", 
    "review_text": "Nice atmosphere, good drinks and Rick the bartender is a really good guy. Makes a great Lemon Drop too :) Stop in when your in town.....pull up a seat at the bar.", 
    "review_date": "2014-09-05"
  }, 
  "2cB6kcPp9SlqnyOtcLFQYw": {
    "user_rating": 3.0, 
    "user_location": "Palm Desert, CA", 
    "user_name": "Brock R.", 
    "review_text": "Had friendly service and the crab sliders were great - we just came in to watch the Canucks crush the Sharks and found the place full of Vancouver fans so that might have contributed to the good feeling. But the servers were very attentive - brought over individual speakers etc and short of buying a round everytime the Canucks scored :) it was everything a sports bar should be. Had breakfast there the next moring and it was all good.", 
    "review_date": "2011-05-23"
  }, 
  "ZtmeHAQyNFku338dJMIfTg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "Service is still horrible at this place. And the food is always so forgettable. The only reason I ever go is to catch a game near my house... but I always regret it.", 
    "review_date": "2010-05-19"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "I watched the last NBA finals here.  The food isnt spectacular but its still edible.  Its a hotel restaurant.  Expect overpriced mediocre food.  For me it was convenient to watch the game with a bunch of tvs with my boyfriends.  i wouldn't come back on a normal day but i am glad i came in once.  woot.", 
    "review_date": "2011-11-06"
  }, 
  "GnHoxjvlAsG3k35GPJmcqg": {
    "user_rating": 5.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Wes T.", 
    "review_text": "Just tried Knuckles again after it had been closed for renovation for a month, and what a difference a month has made!      The place totally looks a lot better, they have booths now that can fit 6-10 people comfortably (each one has its own flat screen TV) and a huge brick wall with 6 huge TV's.        The menu changed for the better too, its got these awesome flatbread pizzas and huge salads that are soo much better than fried mozzarella sticks that they used to have.  Prices were really good as well, not the usual over-priced food that you find at some hotel restuarants.       Definately an upscale place for watching sports as they still have a lot of TV's but it's not all peanuts and stale beer anymore...  ... which is good.", 
    "review_date": "2009-02-02"
  }, 
  "17Z4JJAIdj6h8HQGxgMSQw": {
    "user_rating": 4.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Cherlyn E.", 
    "review_text": "Great service at the bar, friendly and a bank of TVs with sports.  I had the tortilla soup and that was yummy.", 
    "review_date": "2013-01-16"
  }, 
  "J3pXjuQLVOMBFjqsviy2pw": {
    "user_rating": 1.0, 
    "user_location": "Brookline, MA", 
    "user_name": "Lindsay D.", 
    "review_text": "Suck it, Knuckles. Somehow they screwed a garden salad up on me - on the real tip, I don't care who you are, it takes a special talent to eff up lettuce and miscellaneous vegetables tossed together.", 
    "review_date": "2006-10-16"
  }, 
  "YwT2RxiC4H_8JT_Dkmzb5g": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Cynthia A.", 
    "review_text": "Hard, un-juicy pear makes me sad, especially in a pear salad.  Other than the pear it was a pretty good romaine salad with cranberries, beautiful walnuts, and a triangle of gorgonzola.  The salad was presented in a Chinaman-stereotype-hat-sized-glass bowl, which really cramped our space at the table.  I also ordered the pulled pork sliders.  The sliders were OK, meh.  Bread was boring/dry - maybe more BBQ sauce could help with that.    My friend's steak looked really good.  We liked host Allen and our waiter, Lawrence.  Good service, though we didn't want to wait so long for our dessert.  Maybe they had to freeze the ice cream or something.. I think we were wilting and needing to go home and sleep already.", 
    "review_date": "2009-08-20"
  }, 
  "WE2dhG0ZjfHrmDg-n5sSGQ": {
    "user_rating": 3.0, 
    "user_location": "Rancho Cucamonga, CA", 
    "user_name": "Stacia P.", 
    "review_text": "Bar flys.  So gross.  Food was acceptable but not for the price!  Service was quick but not friendly.", 
    "review_date": "2014-08-30"
  }, 
  "EP8rQdAcvfxx2hfXQevpEg": {
    "user_rating": 2.0, 
    "user_location": "Rota, Spain", 
    "user_name": "Tony L.", 
    "review_text": "Since I went home to Spain and returned two months later, Knuckles has worsen. Not only did they outrageously hiked up their prices which were already high, the food is absolutely tasteless. To make things even more worse, they have taken all the pastas and better-tasting food items off their menus and tables! I go here with my sister otherwise I wouldn't come here at all now it's so bad. To make things worst (from a personal viewpoint), she purchased some online discount coupons for this place! She agrees all the stuff is terrible now, and the place is almost empty every time we walk in now - no wonder, and they probably haven't got a clue (or even care!). When I told my sister today that I will NOT walk in to that restaurant, she asked if I could hold off till she uses all those coupons she has. YECK!!! Do not walk in - it's overpriced, and the food is terrible!! Whoever made the decision to change everything should be fired, and I'll bet the manager has NO idea why everyone is staying away! They should try their own food to find out why ~ I ordered a crab and clam chowder which was served in a bread bowl. That bowl was toasted and STILL stale! The soup itself had a lot of ingredients BUT I did not taste even one crab meat or little tiny clam, plus it was so salted it would have choked a sailor!! Hold it, I was a navy sailor and I choked!! Fix it before you close down due to lack of interest (and clients).", 
    "review_date": "2013-06-13"
  }, 
  "Z0MKbI32sFtDoQHfhOuiDA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brooks O.", 
    "review_text": "This place is tourist central but if you don't care about being the youngest people at the bar and the only locals this is a pretty great place to watch a popular game.  There are T.V.s everywhere in the bar, the food is decent and the pitchers are reasonably priced.", 
    "review_date": "2006-02-28"
  }, 
  "7EkCz6G2bs3f8ecbQRxehQ": {
    "user_rating": 3.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Mike F.", 
    "review_text": "Lots of good beer, check.   Greasy and tasty bar-food, check.   At least two dozen flat screens strategically placed to provide proper sports related sensory overload, check.  Decent place for a greasy bite and a cold beer.  Only downside is that its connected to the hotel next-door which means lots of tourists but other than that, not too bad.", 
    "review_date": "2006-12-10"
  }, 
  "WDFDRmKp5Wu2doYSXJDeDQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Linnea E.", 
    "review_text": "Had the buffet breakfast, which was expensive for what it was.  Eggs were decent.  Bacon was fine.  Nothing really stood out, and the selection was small.  For $20 per person? absurd.", 
    "review_date": "2012-04-16"
  }, 
  "cH4uXJbGAxgO1_fE1BLHOQ": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Stephanie D.", 
    "review_text": "I liked the food but I really went there for trivia on Wednesday nights, and I went there before their massive remodel. No more trivia, no more shuffleboard, peanuts or pool, and no more sports bar atmosphere. Worst of all, did I mention, no more trivia? Wtf.", 
    "review_date": "2009-09-15"
  }, 
  "Q-rcjUuCurPsFxe5OcHVmw": {
    "user_rating": 2.0, 
    "user_location": "Edmonds, WA", 
    "user_name": "Just Y.", 
    "review_text": "Last night was my first visit since they remodeled and reopened.  Before I was served my first drink, having done little more than observe what was being brought out to other tables, \"Style over Substance\" popped into my head, and sadly, the rest of my visit did little to change my mind.   Service was friendly, but dreadfully lacking and requiring one to flag down your server, someone else's server, the floor manager, or whomever for practically every little thing.  I'm not sure if it is the bar or the kitchen that is keeping the servers off the floor, but they all seem to be affected and every table I saw had to perform the same flagging.  As a sports bar, the big draw is obviously going in, grabbing a pint, and watching a game.  Before the remodel, this was easily accomplished; now, not so much.  TVs are in positions that are now not as easy to view from any table, and as I said, getting a pint takes way too long.  That leaves me with the food: just OK, but way overpriced.  Thirteen dollar salads comprised of mostly iceberg lettuce and skimpy toppings are served in the most ludicrously oversized bowls, while a twelve dollar hamburger (how is that cheaper?) could not be more generic and underwhelming.  Do yourself a favor and skip the fourteen dollar crab cake appetizer.", 
    "review_date": "2010-05-18"
  }, 
  "Ma7dwQqKl41fGLeSvYyKug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mira B.", 
    "review_text": "I have been here twice with two different out of towner's, and both times have been so-so.  I seem to wake up the next day feeling like I consumed a huge amount of pork.  Kinda gross.  Good drinks.", 
    "review_date": "2008-04-27"
  }, 
  "0Tv2dl2O0TEQD-VGbPqwug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty J.", 
    "review_text": "I dropped by here before heading for Cafe Pescatore. I didn't try  any of the food, but I had an Alaskan amber for $6. People at the bar were friendly, definitely not dead there. I guess it's connected to the Hyatt. I will have to review again once I try some of the food.", 
    "review_date": "2013-01-25"
  }, 
  "eUEncCTT8ZHeR9NeeFdpiQ": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Meghan B.", 
    "review_text": "Good food and drinks, but what made it the best was the bartenders and servers. They were excellent. Many tvs and ipads to enjoy!", 
    "review_date": "2010-12-05"
  }, 
  "ezO9k_mcyTrW9ZRvuv59qw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clayton V.", 
    "review_text": "Ok I will start with the positives. They have receivers that you can place on your TV so you can listen to whatever game you want that is playing on their many TVs. That leads to another positive, they have a ton of TVs so you can probably see your game no matter where you sit. Third positive is they have a few ok Happy Hour specials, I believe it was 5 dollar appetizers (wings, nachos, etc) and some drink deals I thought were average for the areas. So why just two stars?  Well the service is just bizarre, I would describe it as confused indifference. I couldn't tell who was our waiter as it seemingly changed every few minutes. It would take ten minutes to get a beer at some points, than a random woman would rush over and fill up the water. The food also kind of blows. My girlfriend got the nachos and I don't know what the hell they were made of. I am fairly confident it wasn't cheese. Some sort of weird imitation goo that was confined to about 5 of the 25 chips. Maybe they put a lot less effort into it cause it was happy hour, but man, that was bad. Also, their prices for non-happy hour kind of suck. I get it is attached to a hotel and near fisherman's wharf and does good business, so there is no reason for them to change them. However, it does mean people that live in the city (and visitors that use yelp) can find bars with better food, drinks and prices. If you are stuck down here or really want to find a place you can hear the sound for an obscure terrible game (I'm looking at you Cleveland Browns and Miami Dolphins fans) maybe its worth coming to. Otherwise yelp it up and head elsewhere", 
    "review_date": "2012-10-05"
  }, 
  "XN7gmypk2antDlllPKFgxQ": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Victor C.", 
    "review_text": "Meh.  Sports Bar located in the Hyatt by the wharf.  Ordered the slider's (pulled pork &amp; brisket)... the slider's really was just a large roll... cut in half. Trickery.  The pulled pork was okay.  The brisket was dry.  Definitely wasn't impressed with the food at all.", 
    "review_date": "2008-08-04"
  }, 
  "F5KgQcTXxz9l1349W1RWyg": {
    "user_rating": 3.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Ghenwa S.", 
    "review_text": "3 stars just because I had coupon from restaurant . com other wise it will be too much, ordered fresh and chips the fish is so breaded and oily i told the server he didn't carev at all the burger was okay, the service average, I don't think I will be back again", 
    "review_date": "2014-05-17"
  }, 
  "ayN7C_U3AwBfWN7I3YVA_A": {
    "user_rating": 2.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Yuki M.", 
    "review_text": "Food was ok. No surprise that it's all over priced. Moving on.  Service here is among the worst I've ever experienced anywhere. I set the bar more than a little bit higher when I dine at any Hyatt, and at this particular restaurant, the bar could not have been set lower.  Inattentive wait staff, even worse management (left our table in the middle of an order to talk to another customer and never returned), dirty and sticky floors, and confused bartenders (served me a mojito with little to no ice and a mint julep with gin).  Mind you, this is based on 3 separate visits.  Service is what earns this place a 0/5. The food squeeks by at a 4. Averages out to 2.  Burgers are the standard burger served on all Hyatt menus. Generous in portion size but severely lacking in flavour. Produce is fresh and side spreads are pleasant. The meat itself is what makes a burger great and this burger has only one thing going for it: Consistency. Consistently bland and unimpressive but always filling. Not the best $15 burger I've ever had.  Nachos with steak added were FABULOUS! Tender steak, rich cheese, flavorful chili, and crisp chips. I would order these again.  Crab Cakes were large but much like the burger, entirely unimpressive. I will say that they are not cheating you on crab meat. There's plenty of that in these guys, but they've managed to dilute the flavour and dry out the sweet and moist nature of the crab by over cooking. Sad.  Cobb salad was large and very tasty. Fresh lettuce and generous amounts of cheese, bacon, and avocado.  Other items ordered through room service were the omelet, pancakes, and buffalo wings. All very standard in terms of Hyatt room service. Not bad at all. The wings are a favourite of mine.  Would I return to the hotel? Probably. Why not? Not the best but definitely one of the most conveniently located.  Would I return to the restaurant? No.", 
    "review_date": "2009-09-09"
  }, 
  "KrXU4c4Zf0sBrb7u0QB8-w": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kelsie M.", 
    "review_text": "2.5 stars?!? What is everyone elses problem. Great service. Great food. Pablo is the best server!!!", 
    "review_date": "2012-04-02"
  }, 
  "bgZZxwc3Y6afTNWl_WSgXQ": {
    "user_rating": 2.0, 
    "user_location": "Kernersville, NC", 
    "user_name": "Brandon D.", 
    "review_text": "We used this restaurant several times over the course of a week - it was attached to the hotel we were staying in, so it was convenient.  However, in terms of price vs. quality, I just simply can't give Knuckles a good rating.  I think out of the 5 meals we ate together for (2 breakfasts, one lunch, 2 dinners), we left satisfied just the first time (breakfast).  If we'd had the same experience as our later visits on that first meal, we likely wouldn't have even come back.  Much like other restaurants I visited while in San Francisco, Knuckles has the trappings of a \"high class\" restaurant (big, real wood tables, nice carpets &amp; flooring, a large bar, finely-dressed wait staff, etc), but just fails to deliver once it comes time to actually consume food.  Portions were pretty reasonable (big omelets, reasonable-sized pizza for 2, lots of fries), but overall taste was bland.  We tried the Parmesan-garlic fries the first time we needed a side, and quickly decided we wouldn't finish the plate or get more.  The next time we needed a side, we ordered the sweet potato fries.  They weren't sweet, and they tasted old.  How do you take the sweet out of sweet potatoes?  They were also served just with ketchup, and the restaurant had a hard time understanding my request for something else, like a spicy or honey mustard, either of which would be more traditional with sweet potatoe fries than ketchup.  Our first meal there, we ordered the full breakfast buffet ($20 each), and had a mostly satisfactory experience.  The omelet I had was not only big, but it was good (though they messed up the ingredients I requested, I just attributed that to a language barrier, and either way, it was still good).  The fresh-squeezed orange juice tasted fresh-squeezed.  The pancakes were pretty good (though not amazing), the bacon was pretty good (but mostly well-done, and I prefer a little more chew to bacon), and the eggs were pretty good (but didn't have a lot of taste, but on the other hand, I usually like to just put some cheese on eggs, not season them too much, and there was a nice block of real cheese you could shave off yourself, which worked).     All four meals after that though just kept going downhill.  My wife was very disappointed in their clam chowder, which upset her stomach that evening as well.  They gave me a lot of difficulty when I wanted to change one of the ingredients on the chicken sandwich (I just don't like like pesto generally, and just wanted to know if they could throw on a dollop of spicy mustard - this would not normally be a big deal at any restaurant, but it was here).  The smoothies tasted like those packets of smoothie powder mixed with yogurt &amp; milk.  We're pretty sure there was no real fruit in the smoothie.  I will say, the best food I had all week came from this restaurant - it was a huge, buttered, grilled cheese sandwich made with thick slices of buttered sourdough, and some really great white cheddar.  However, it was the same meal where we had the really lame Parmesan-garlic fries, so that unfortunately affected our opinion on the meal over all.  Basically, if the first meal hadn't been so good, and also it hadn't been a matter of convenience during a work week, we would not have eaten here as often as we did, and we certainly wouldn't choose to eat here if were had been staying at another hotel.", 
    "review_date": "2013-06-25"
  }, 
  "pv7yUP2F4vN0WanV_kWWnw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janelle C.", 
    "review_text": "Good place to watch a game - there are so many tv's.  The cambozola bread was fantastic and I also tried the turkey burger which was good, nothing special.  The service is ok, I was here when the place was packed so we would go long stretches without seeing our server, but he was super polite and friendly when he did come by.", 
    "review_date": "2012-10-25"
  }, 
  "_dKFcQEIOkJNzk74BPKBhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina M.", 
    "review_text": "Very clean and modern sportsbar with tons of big screen TVs - even some of the booths have their own TV. Definitely a good place if you are looking to watch a game but don't want to go to a typical neighborhood sportsbar. The waitstaff was attentive and the food was good. I really liked the sweet potato fries and the spinach and artichoke dip (although the dip would have been better with more bread and less veggies for dipping). I will definitely go back.", 
    "review_date": "2010-04-26"
  }, 
  "Qn4CsempT2TL3mWzdEsHLQ": {
    "user_rating": 1.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Michael L.", 
    "review_text": "Walked in to have a drink and some food.. Set for 10 min and then asked for manager.. Was fucking oblivious to the situation... We left another place I will never come back to", 
    "review_date": "2014-12-25"
  }, 
  "0DAJCCZcwsftU0gX5C0P7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shaun l.", 
    "review_text": "Standard food selection, touristy, spotty service, but I love throwing the peanut shells on the floor!\n  Lots of monitors to catch your favorite game, and it doesn't get too crowded.", 
    "review_date": "2005-12-04"
  }, 
  "vzKEcjq6ODlFOMOSPkhpqA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie L.", 
    "review_text": "Solid 3.5  The food's not bad (if a little overpriced, but it's connected to a hotel, so what're ya gonna do). We dropped in for Wednesday night trivia and a good time was had by all. Staff is friendly and attentive.   Decor is nice, but a little weird to me. Like it's not sure if it wants to be classy or casual.", 
    "review_date": "2009-03-14"
  }, 
  "dlRJglxsoUszqM3R0ejhjQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa B.", 
    "review_text": "I would give it a lot higher rating if the service was half as good as the atmosphere. Our waiter was grumbling, bad-tempered, and generally onery! We were a really nice and not demanding group so it was pretty shocking the way he treated us. We came here on a Saturday night and the place was basically empty which we couldn't believe-- but after being waited on here I know exactly why!   If they could change their wait-staff we would go here all the time. The atmosphere is fantastic-- bright &amp; clean &amp; modern (not like most bars) and the food is decent and reasonably priced. A great place for groups (again, minus the snotty wait-staff).", 
    "review_date": "2010-03-09"
  }, 
  "ZbYU4Tq1Pyand5Bdv2Vavw": {
    "user_rating": 1.0, 
    "user_location": "Hacienda Heights, CA", 
    "user_name": "Maria A.", 
    "review_text": "The food is bad! Came here to watch the game and ordered the chorizo pizza. The chorizo was like hard mini pepperoni that you find on bad frozen pizza. No sauce so it was dry too. I recommend that they use real chorizo and some tomatoes to counter the cheese.", 
    "review_date": "2013-11-25"
  }, 
  "A0V_Uv1TjaFdVJguc_BwZw": {
    "user_rating": 3.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Neil N.", 
    "review_text": "I've only been here a few times, but like the atmosphere. Definitely a must-go for March Madness or any marquis NFL games on Sunday. I went here last year for the Colts/Patriots showdown and the crowd was electric.  Good food, great bars on tap, cannot complain.  Best part: many many TVs and even a separate smaller room with pool table and tv(I snuck in here to watch the Seahawks game). They post the weekly NFL schedules so you will be able to find your game or favorite team playing, along with groups of team supporters or out of towners.  Service can be a bit slow during these peak times, so sometimes it's a good idea to know what you want, rather than tell them you need a few minutes. They'll be back many minutes later.  My big negative: parking is a pain. Unless you park early on a Sunday, be prepared to shell out big bucks as it's near Fisherman's wharf and parking is expensive. $20 to park for a few hours is ridiculous which is why I take the BART then the Muni street car over.  Otherwise, it's your typical great sports bar. I'll probably go to the one in Burlingame as well.", 
    "review_date": "2008-08-26"
  }, 
  "pPeBwfgXoAVe5ZLuGnMruA": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Chris A.", 
    "review_text": "If you like football and have a fantasy football team, this is the place to be on sundays during football season.  I started going a couple sundays ago.  I plan to go every sunday during football season.   They have a breakfast buffet ($18/person) til 11am and you can see all the games.  If you like to drink, there's a bar.  There's a $15 minimum per game (10am-1pm or 1pm-4pm).  The service was real good.....Nancy is the best!", 
    "review_date": "2010-10-23"
  }, 
  "Y18iYjk24P0N3JdMscaI5g": {
    "user_rating": 4.0, 
    "user_location": "Gardner, MA", 
    "user_name": "Melanie P.", 
    "review_text": "Don't let the cold, drab decor in the dining room turn you off. Our bartender, Rick, was super personable and friendly. He convinced us to try dinner here. I had the chicken tortilla soup, it was awesome! Dh had the fish and chips, it was delicious. The batter on the fish was slightly sweety and really tender ...delicious. Price was reasonable for the touristy area. I'd def eat here again.", 
    "review_date": "2014-04-22"
  }, 
  "GhNZzIvDBGKcdEPFVT_eCw": {
    "user_rating": 4.0, 
    "user_location": "Tupelo, MS", 
    "user_name": "Rachel P.", 
    "review_text": "Knuckles will not disappoint. If you're looking for local flair, this is not your place, but if you're in the mood for good food and beverages at reasonable prices, stop in!   We stayed at the Hyatt at Fisherman's Wharf, so Knuckles was an easy breakfast option. The buffet was delicious, and it included enough choices to satisfy every palate. Plus, the omelet station was excellent.    We also dined there for lunch one day.  The menu contains an array of standard sandwiches and specialty burgers. We thoroughly enjoyed the food.  As a bonus, there are multiple televisions, all on different channels, so you can catch a game or catch up on national news while you dine.", 
    "review_date": "2012-04-01"
  }, 
  "QZNLJ68kuS51Tlqljvf3ow": {
    "user_rating": 5.0, 
    "user_location": "Naperville, IL", 
    "user_name": "Matthew W.", 
    "review_text": "I had breakfast at the Hyatt hotel restaurant, Knuckles, in the morning. Service was EXCELLENT, and the food was awesome.....I had 3 pieces of french toast from the buffet.  1 two eggs sunny side up, sausage, wheat toast 14.00 1 juice 4.00 1 coffee 4.00 1 regular buffet 18.00  Total - $43.80", 
    "review_date": "2009-10-14"
  }, 
  "Nz0fiE3wV_EfFCmEABvqQw": {
    "user_rating": 2.0, 
    "user_location": "Colorado Springs, CO", 
    "user_name": "Jon A.", 
    "review_text": "Bottom line? Food was good, service was sub par and for the price we should have gone elsewhere.   Now the background, I'm staying in town across the street at the Holiday Inn Express a group of five of us had just gotten off the plane and checked in.  We're hungry and we see Knuckles and figure we'll just eat there because we have a meeting in a couple hours.  We walk in and the place looks nice, my first thought? Food should be good but may be a bit pricey.  Looking around we see one couple, it is around 2pm and we're after a late lunch so it shouldn't be too busy.  Five of us order our food, wait and talk. A family of three comes in, orders and waits as well.  Bit of time goes by and the family of three gets their meals served and begins eating. Bit more time and we get ours. The family of three finishes and leaves before we finish.  And the food?  It was good. It's what to be expected from a nice looking place. But... The orders came out wrong. Our server seemed to have mixed parts of orders up with each of ours. And she was even writing it all down!  Two of us sitting on the end ordered the \"build a burger\" plate and ended up with a mixture of each other's order. Another asked for sweet potato fries instead of regular and ended up with the regular.  Drinks were not filled or topped off unless asked.  I would have understood the  errors if it were busy or we ordered complex custom meals... But we didn't and it the five of us made up half the customers at the time.", 
    "review_date": "2014-07-22"
  }, 
  "SDUjVwy2S57aae6lhyTy7A": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kelly M.", 
    "review_text": "Ok, my first impression of this place was good (different from all other reviews) because I had a decent salad for a late lunch.     However, since we are guest of the hotel, we had two more meals.  Terrible service all three times and food was bland, boring and tasteless.  Here's the summary:  Cobb salad was very good, but lacked acid...needed citrus. They used romaine lettuce and dressing was a fresh mustard vinegarette.   Decent and I did enjoy it.  Service was off-hand at best.    Nachos - a big pile of goop, low quality chips and just uninspired in any way, execution or content.   Petrale sole and mashed potatoes - downright unappetizing, smelled extremely fishy and my husband did not like any of it.   Breakfast - RUN! Don't go here. Tasteless and awful. Even the fruit was not ripe. I ordered eggs basted and they were actually filled with water!  Waited 15 minutes after asking for a coffee refill and water.   Everyone is correct, the service is propably the worst I've seen in a while. These people are clueless.  Very inexperienced and do NOT act happy to be helping/waiting on you.  Exception is the nice hostess at the front.   Positives are - the decor is very cool, typical Hyatt...very classy but mod.  Love the room the restaurant is in - very light and open, beautiful.  It is a crime to be in San Franscico and eat here for anything other than late lunch or desperation.", 
    "review_date": "2011-02-15"
  }, 
  "TKKGVe_GVYOv5_-Kme6IgQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Ella C.", 
    "review_text": "Nachos are amazing... especially with chicken. Service has improved compared to when it was a Sports Bar..... during my meal, the waiter came up to my table and asked if I like the BBQ Chicken (I did) and invited me back and gave me a suggestion. The experience solely based on the waiters invite back felt really good and felt that my business was appreciated. I think the number of TVs decreased but if you sit in a booth, you get your personal one.... not sure if you can change the channel, but its still nice!", 
    "review_date": "2009-03-08"
  }, 
  "Rmua_ncEG9aCguqLcXgQbg": {
    "user_rating": 4.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Marcy T.", 
    "review_text": "Nice, elegant interiors.  Friendly staff and delicious food.  I had the Shrimp Salad and Salmon with Noodles for my entree.... I loved it!  A place where you get your money's worth.", 
    "review_date": "2009-03-27"
  }, 
  "POPkY1dgdQ4avdRazaCorQ": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Mike Z.", 
    "review_text": "I really liked this place. We happen to walk past it on our way to our boat ride in the Bay. All I saw was a big baseball on a sign, and I think we walked all the way around the block to find it. It is in the Hyatt (I think), this place is really cool. We were there like at 1pm and their happy hour does not start until 4pm...just like most places in SF. My wife and I had 2-3 beers each and they were $5.00 each. Not bad for a hotel bar close to Fisherman's Wharf. Rick the bartender said happy hour was half off which would have been really cool if we stopped by later. Rick was really cool. We were close to the only people in the bar at that time and he talked to us for like an hour. We talked about us being on vacation and going to the baseball game the next day. He told stories of when he used to smoke (cigarettes) and other cool bars to go to close to our hotel. There were TVs all over that place and it looked like even the booths had their own TV that you can change the channel.  When we were about to leave, we mentioned were we could get a good bottle of Cali wine to bring home as a gift and he not only told of us of a few places but he also gave us a few things from the bar, like small key chains, a beer bucket (which came in handy as we picked up gifts for everyone) and a few other things he had laying around. I think he was the best and coolest bartender we had while in SF. We will definitely be back when we are in town.", 
    "review_date": "2009-06-03"
  }, 
  "zqyV61vOYChvQ4aZNiLiJQ": {
    "user_rating": 4.0, 
    "user_location": "Darien, IL", 
    "user_name": "Don N.", 
    "review_text": "Good fish and chips.  Clayton the bartender is a real pro. A pleasure to be around.  Fun place.", 
    "review_date": "2011-10-15"
  }, 
  "IKX74jdqvuUQRJm4G_JkOQ": {
    "user_rating": 4.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Westside P.", 
    "review_text": "Wow!  What a great find!  Random hotel \"sports\" bar, but more of a slick modern open and welcoming new fair restaurant.  Great service by Mary Jane, which included stellar mojito to order.  Got the roasted chicken tortilla soup.  Oh em ge!  Amaze.  This is not cream based, which I confirmed before order as that's not only bad for YOU, but loaded in extra calories.  Anyhow, it's tomato based, and served in a small carafe  that is poured into the bowl, where the tortilla strips, onions and a few other goodies await.  It was thick, tasty and the right temp.  A must get!  Followed up by the chicken quesadilla.  Uniquely served really as two soft tacos, upright with the tortilla crisped with melted cheese and chicken and condiment sides that you add on your own: pico, guac, sour.", 
    "review_date": "2014-03-26"
  }, 
  "bLbSNkLggFnqwNNzzq-Ijw": {
    "user_rating": 2.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Stefany V.", 
    "review_text": "If your bar advertises advertises via a banner on the street that it is a good place to watch the game, and features 16 tv screens showing various sports, you would think there would be game day or game-time drink specials, right? Well, not if you're owned by Hyatt! Found this bar via our GPS and didn't realize it was a hotel bar until later. Regardless, charging $6 minimum for draft domestic is downright unamerican! And it tasted watered down.  Food and service weren't much better- our server, Boris, did not clear a plate or cup from our table for over three hours, nor did he refill any water glasses at the table until specifically asked to do so. Flagging him down to place orders took an average of 15 minutes.  Fish and chips with garlic fries was decent. The mussels appetizer had a great white wine sauce, but was inexplicably served with several pieces of toast- what on earth is that about? Last order, the buffalo chicken pizza, was a total waste- chicken appeared to be microwaved frozen popcorn style, but there was no \"buffalo\" anything to be found on the cracker like crust. Bland at best.   Wont return or recommend bar or hotel largely due to lack of quality and customer service, not to mention deplorable bathroom conditions.", 
    "review_date": "2013-09-16"
  }, 
  "_S5tB9stFX3YKLBPVoEjqA": {
    "user_rating": 2.0, 
    "user_location": "Rome, Italy", 
    "user_name": "Andrew T.", 
    "review_text": "went here once for football and it sucked. the only reason im giving 2 stars is because they had an incredible amount of plasma's. the negative was that, based on where you were sitting, it was hard to watch the game that you wanted to see. my other beef with this place was that they were only serving breakfast for the morning games. why would i want pancakes with my beer? why would you not allow people to order wings or fries at 10am? places like jillian's are 10 times better on a sunday or saturday for football...", 
    "review_date": "2008-08-27"
  }, 
  "B_Via1bKGdvbxcOfd988EQ": {
    "user_rating": 3.0, 
    "user_location": "Antelope, CA", 
    "user_name": "Mymy N.", 
    "review_text": "Came to Knuckles about 15 minutes before they closed to take a birthday shot with my best friend at midnight. At first they were rushing to get us out of there but then a server said he would take care of us and let us sit down to order shots only because we had to leave before 12. My shot of patron was warm but it was pretty big! They didn't have pineapple juice to chase but oh well. The decor was so cute! Can only rate on the 15 minutes I was there but the staff was friendly and we were able to celebrate my friend's birthday.", 
    "review_date": "2010-04-26"
  }, 
  "QMg-26KtQQgUR5DXe1AH-Q": {
    "user_rating": 3.0, 
    "user_location": "McKinleyville, CA", 
    "user_name": "Hana W.", 
    "review_text": "Bartender was an A+. Sports on the TV is an A+. Drinks are an A+. Food is horrible horrible horrible.  Go for the drinks, NOT for the food.", 
    "review_date": "2013-04-06"
  }, 
  "Pfsi-rKQBHwBlsQsVbXiFw": {
    "user_rating": 5.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Marlayna T.", 
    "review_text": "I loved the food, especially the crab cakes.  They were the best crab cakes I've ever eaten!!  The staff was friendly and accommodating.  Good time!", 
    "review_date": "2013-10-25"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "Like a way-overpriced Denny's that threw up a sports bar.", 
    "review_date": "2008-07-05"
  }, 
  "zHptMS7T1FJr4NohqW-jOQ": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Tom K.", 
    "review_text": "Sports bar with plenty of comfort food and wide drink selection.   Nothing uniquely San Francisco about the place if you are from out of town, but it you are tired and need a reliable place for a good meal I'd recommend stopping here.  Service was good and prompt. In our case we'd been out site seeing all day and had gotten caught in the rain a few time. We were looking for a place to relax and restore our energy and Knuckles did the trick.", 
    "review_date": "2010-11-26"
  }, 
  "xUNFuuySOiVQG6OAOsqZYA": {
    "user_rating": 1.0, 
    "user_location": "Rohnert Park, CA", 
    "user_name": "Chris P.", 
    "review_text": "It's trench warfare getting a table for yourself at this place.  Go during a crowded hour and bring your best weapons.   $12 per drink, woooaaahhhhh. The service is unfriendly. Likely won't be back.", 
    "review_date": "2014-10-11"
  }, 
  "TCeBrXFtW4H2lHdyriSZVg": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Nermin A.", 
    "review_text": "This place is awesome !!! I went there at three different occasions. I was staying at a nearbye hotel, and we went there first  for dinner. I had the special, it looks like it most of the time fish or seafood oriented since they are part of the seafood alliance (sustainable seafood program... TO BE COMMENDED...) it just did not taste only fantastic, but I was able to watch my game  !!! I found out that they do breakfast as well, we came back in the morning, and I was in shcoked that they were able to top off my experience from the night before... Breakfast buffet ALL YOU CAN EAT, with a cook that make your omelet in front of you, and it was sooooo good !! The staff was awesome, they gave us a whole itinerary of things to do in SF,... No need for concierge... We came back in the afternoon for drinks, everyone recognized us, we felt that we already were regular, they remembered what I was drinking the night before, they change the channel to my favorite sport.... UNFORGETTABLE !!!!  Thank you Knuckles !!", 
    "review_date": "2013-01-09"
  }, 
  "flUL-Ecy5AKzqlKxL3O8jw": {
    "user_rating": 3.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Amanda S.", 
    "review_text": "We stayed at the Hyatt and subsequently at at Knuckles for breakfast a couple of times.  We had the buffet and it was a good hotel buffet.  There was a good variety and they kept the food trays pretty well stocked so everything was fresh and overall pretty tasty.  It was nice to have the chef at the omelet station.  The restaurant was clean and the service was not bad, the staff was friendly just not as attentive as they could have been.", 
    "review_date": "2011-01-13"
  }, 
  "rNGz8UXU8x94h8x4E8P3OA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jennifer M.", 
    "review_text": "We went here 2x last weekend.  Once one a Friday night and then on Super Bowl Sunday 2013... Friday was meh and Sunday was a blast!  Here is my mixed review...  LOCATION &amp; AMBIANCE:  The bar is connected to the Hyatt, so there was many tourists (I'm guessing, but also have met with many).  The restaurant/bar has two entrances, one from the outside and one to the hotel.  The bathroom is in the hotel lobby, just outside of the entrance to the restaurant.  There is a wine bar on the way to the hotel as well.  On a Friday night, it was empty.  On Super Bowl Sunday, it was packed and the crowd got hyped (in part due to my husband's yelling and getting the crowd going haha).  There are a lot of TV's around the place... see my notes on service though with our experience of the 2nd TV in our booth.  And booths, there are a few of them, but not a lot.  SERVICE:  I'd like to note that because Knuckles was at our hotel (the Hyatt) and because we pre-planned our trip to SF back in October, we intended to watch the Super Bowl here no matter what.  I even emailed the concierge for the hotel to attempt a reservation, but never got a reply.  The day after the 49'ers won the division to make it to the super bowl, we called directly (# from Yelp is correct, not on the website for the hotel/restaurant, FYI!) and I got hooked up with Jennifer Goodson, who began coordinating with us immediately.  She was great in ensuring we got a table large enough for our group and even took pictures of the booth we reserved for the game.  (We had a group of 9-11 people and she wanted to ensure we knew the space we'd have.)  Before I disucss Sunday, I'd like to briefly mention my Friday experience, when I called down from my hotel room to discuss food and they said I had 7 minutes to order; less than 5 minutes later, I called down for to go and they didn't answer.  We got downstairs at 11:01 pm and was told by the bartender the kitchen staff \"wouldn't even serve food to their own mothers at this time.\"  So, he made a recommendation and we prepared on our way.  As I passed the booth I knew we'd have, I asked the server if I could ask a question and he responded \"you just did.\"  Hmph... I asked another one anyway. ;-)  Then to Sunday... Since Jennifer did say there were two TV's and I saw them Friday, I felt fine with our booth.  Unfortunately, upon arrival, they didn't have the 2nd going and two employees made brief attempts to make one work, but then quickly gave up.  It wasn't until into the 2nd half of the football game that I met Jennifer and she began getting others on to it... 5 people/attempts later, it finally was going which made the experience WAY BETTER.  (Previous to that, half of us were stretching our necks to watch or viewing it backwards through the mirror.)  Now, our server was Boris and I thought he was just OK, getting the job done.  He was super busy though, and I do realize that could have contributed to the attention he gave us (or lack thereof, especially initially), but he also asked us not to allow other staff (who came to our table) take our orders.  It was a little odd.  We did comply though and let others fill water or take plates, but not take orders.  I'd add that my husband said he enjoyed Boris as our server and got his dry humor; so I can't dock him too much, but I thought that was weird.  And we realized later he was the same guy from Friday night who said \"you just did.\"  I'd also like to add that there was another employee, Joana (pronounced Jo-Wanna, not Jo-Anna), who was very nice and helpful.  We thought she was great.  FOOD &amp; DRINKS:  They have a full bar and had pitchers around $20 each, so that was good.  They ran out of the Magners after I ordered my 1st one and then didn't have any Angry Orchard, despite having an ad for it on the table.  Kind of a bummer on my birthday, but whateh.  The cocktails were mixed well and that worked for our post-game, end of the night drinks.  The nachos were weird with cheese that was not your normal, but not as bad as I expected per Yelp reviews; I do agree with the chicken comments though.  The flatbread w/pesto and shrimp was yum, as well as many of the deserts (think Pizookie for those of you who go to BJ's restaurants).  The wings were OK and the fries were well liked.    Bottom Line(s) - They don't serve food after 11pm.  The service is OK to decent.  And it is a bar at the hotel with plenty of TV's, so its more of a tourist spot than a local one.  Convenience is sometimes key... and that did it for us.  Would I return? If I stayed at the hotel.  Would I go out of my way otherwise?  Not likely.", 
    "review_date": "2013-02-06"
  }, 
  "WGVRnbgyxQL4FLZpXf7uXw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Steve L.", 
    "review_text": "While visiting in SF several weeks ago, together with my partner, we wanted the opportunity to view several out-of-town MLB games as well as the Giants (even though they were playing at AT&amp;T).   Being an -out-of-towner we checked Yelp for your advices....in fact, unfortunately, our hotel concierge was not sure 'where' or 'what' location would offer mutli-screen viewing capabilities near our hotel. We decided to take all-of-your-review advices and give it a try. We were NOT disappointed.....all we wanted was video, hopefully good food and drink. We lucked out.  Upon arriving, the host directed us to a center-area table but we saw that there were several 'private' booths with individual wall mounted monitors. The booths can comfortably seat up to 6 adults....but as there was just the 2 of us, the host obliged and we got exactly what we were hoping for. The host then gave us a channel selector and we honed in on the Giants game. Further, the advantage of the booth meant that we would have less distraction from other patrons.   Our waiters were quite prompt. We placed our bar-order (Coronas) and were provided same within minutes. Our food order included chicken wings, burgers and crab cakes. All was served well, enjoyable and priced moderately. Our total tab did not exceed 100.00 including tip prior to the end of the evening.  If you are looking for a rawcus (spelling) setting, this is NOT it. If you are looking for a pleasant and inviting location for sports viewing, a full bar, comfortable seating, friendly and attentive staff - and the ability to chat with your fellow guests while viewing and eating - Knuckles meets and exceeds that scenario. It's location, near Fisherman's Wharf, allows you to take any public transportation as we did.   Thumbs Up: 4+ on all points. Good show, Knuckles.", 
    "review_date": "2009-09-01"
  }, 
  "t5nlOwDHJibXGPFetmrxGg": {
    "user_rating": 2.0, 
    "user_location": "Altadena, CA", 
    "user_name": "Jason C.", 
    "review_text": "\"And then he went there. He ordered a vodka rocks and proceeded to try and pick up on a single traveling woman musician in the corner...\"  Knuckles in the Hyatt at the Wharf is what is it. \"That has got to be the worst food that I've ever had!\" is all my colleague could mumble through his fistful of French toast. \"You're a Yelp foodie! How can you eat this stuff?\" more muffled mumbles. Hmmm. He wasn't saying that the day before when we dragged our tired travel feet up to the bar and he proceeded to order a vodka rocks. Which, is my point. It's really a sports bar that's attached to a hotel. You don't go to a pancake house for a scotch and soda, so why would you go to a sports bar expecting a great breakfast? Or, a great anything if it doesn't pair with a frosty beer? And, I might add, I counted 23 godzilla screen TV's.   Frankly, I thought the breakfast was decent. The scrambled eggs were cooked right, the bacon was well balanced with marbling; even the dollar sized pancakes hit the right spot...for what it was. C'mon. It's a sports bar that cooks a decent meal, served by staff who smile even though they're likely to never see your face again.   And, after checking out of the Hyatt, I zipped-in for an iced tea (not the Long Island kind), and the lunch fare seemed equally paired in quality with the breakfast. Fresh looking burgers and fries. Nice looking bowls of chowder. Why would you care anyway if your eyes are glued to one of the 23+ TV's? For all you know, you could be eating the brochure.  Frankly, I think my colleague did.   And then he went there. He ordered a vodka rocks and proceeded to try and pick up on a single traveling woman musician in the corner. Come to think of it, he did eat my brochure. I can't find it.", 
    "review_date": "2010-04-02"
  }, 
  "lp2f1viw61OKUTs7z08ecQ": {
    "user_rating": 3.0, 
    "user_location": "Tampa, FL", 
    "user_name": "Chris R.", 
    "review_text": "Knuckles is a nice restaurant at the Hyatt, but the prices are a little expensive for what you get.  The food was fresh, service was good and there was never a line or wait to get to a booth.  I would recommend to go across the street if you want double the portions for half the price.", 
    "review_date": "2014-03-30"
  }, 
  "Shb446T7icILAkLqdenFgA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer N.", 
    "review_text": "Thank goodness I was with great company because there was nothing pleasant about this restaurant.  We had a large group and we had at least 2 waitresses helping us.  Unfortunately the service was lacking.  We didn't get checked on often enough for a group our size. Some food served was uncooked and food wasn't spectacular.  Sometimes if food isn't all that, service can make up for it but we didn't get either.", 
    "review_date": "2011-11-06"
  }, 
  "BvxT2kV1c_-a0ypnsTmUdg": {
    "user_rating": 3.0, 
    "user_location": "Fisherman's Wharf, San Francisco, CA", 
    "user_name": "George C.", 
    "review_text": "Considering all the great options at Fisherman's Wharf, I wasn't expecting much from this hotel restaurant at the Hyatt, but I must admit to being pleasantly surprised. The dining room is spacious, and the wall of TV's behind the bar makes for a first class sports bar. The food  was good though we only had sliders, nachos, and stuffed mushrooms. The happy hour appetizers are an especially good value. All in all a very enjoyable and relaxing experience if you're looking to stay close to the hotel.", 
    "review_date": "2012-02-29"
  }, 
  "X8Xxpq0z-4mfuOvHvy4VRw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noey G.", 
    "review_text": "HORRIBLE. Don't call yourself a \"sports bar\". Bad food, poor service-inexperienced management, supposed sports bar TV's not properly placed to conveniently watch games unless your right at the bar (trying to make you buy drinks over food).  Came here to watch my GIANTS games...I thought this place was bad before the remodel and came back hoping they would improve the overall experience. NOT  I wish I could give them no stars!", 
    "review_date": "2010-10-20"
  }, 
  "Nh8z4V_OT9mEprDoL7Oqeg": {
    "user_rating": 1.0, 
    "user_location": "Encinitas, CA", 
    "user_name": "Nick S.", 
    "review_text": "Went there for breakfast on a whim. Ordered eggs, sausage, potatoes, and pancakes. Awful food and terrible service. Plus, way overpriced, orange juice was 4 dollars and total bill was 50 dollars DO NOT GO FOR BREAKFAST should have just stood in line at Hollywood Café", 
    "review_date": "2014-08-09"
  }, 
  "wb_N5rbsl-wXQHd0thlvJw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "Went to Knuckles with a <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&amp;s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" rel=\"nofollow\" target=\"_blank\">restaurant.com</a> certificate yesterday. I havent been there before so I didnt care what it used to be, or is supposed to be, or whatever. Its a bar and restaurant with great daytime lighting and high ceilings, a nice bartender, and good food. On a Saturday afternoon it was not busy at all so we got fast service. We ordered two drinks and three appetizers for the two of us. The crab cakes, stuffed mushrooms, and calamari were all delivered within 10 minutes, and there are like 23 tvs in this place, and the booths have their own tvs! just like fuckin vegas.. mm .. vegas. I will visit again. Thank you cute bartender!", 
    "review_date": "2011-02-13"
  }, 
  "WwB6wB0ad3s-WJc9p7gfVQ": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "MissJ J.", 
    "review_text": "We came here for happy hour on a Friday night - ordered the specials: wine and calamari. The atmosphere is nice and it has a lot of TVs for sports fans. The wine was so-so but the calamari is pretty nice - not too much batter and the sauce is delicious.", 
    "review_date": "2011-03-12"
  }, 
  "yWnXP1N0klollvqjDunFtQ": {
    "user_rating": 4.0, 
    "user_location": "Bay Minette, AL", 
    "user_name": "William F.", 
    "review_text": "Chowder was the best I've had in San Francisco. Would have been better with a bit of bread. Fish and chips were good. It's away from the crowds and worth a look. Service was on point. I will eat here next time I'm in town.", 
    "review_date": "2014-04-18"
  }, 
  "-UMfTNkO8X_U1Sqy8R5ciA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Krystine D.", 
    "review_text": "Good for watching sports, lots of TVs. Terrible service. We had a $200 minimum table for the Super Bowl and they forgot our food order not once, but twice. Food was alright, a bit bland. It was mainly the service (or lack thereof) that really got me to write this review.", 
    "review_date": "2013-02-04"
  }, 
  "FRLHsMaXlVg9C4G4tO7GpQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Neda M.", 
    "review_text": "I went there for breakfast. they also have buffet. breakfast time ends at 11 which is not a good thing for weekends.price is a bit high considering the size of food you get and also other restaurants in the area, crab cake benedict was good. waitress was so friendly.", 
    "review_date": "2014-05-03"
  }, 
  "fosVI_oCEpWvM7ax9NhhnQ": {
    "user_rating": 3.0, 
    "user_location": "Eugene, OR", 
    "user_name": "Joe G.", 
    "review_text": "The place looks amazing!!! Plenty of TV's to watch games. Good food but kinda high priced.  They had post some specials posted, but when I asked for one the waiter said it was unavailable. He then removed the sign ???? Never seen this move before. Was there to watch a game or probably would have left.  Still well worth checking out.", 
    "review_date": "2011-12-05"
  }, 
  "11KzEQy1MPaD8iS4yV_Axw": {
    "user_rating": 3.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Moe F.", 
    "review_text": "I recently stayed at the Hyatt and ate here twice - once for breakfast...once for dinner. The breakfast buffet was good.  The bacon wasn't over cooked and it wasn't undercooked, it was juuusssstttt right.  The other items like eggs, blueberry pancakes, local fruits and cheeses made it really good.  I'm not sure if it was worth $23, but it's nice breakfast in a nice hotel in an uber touristy area so those are the expectations. The dinner of fish &amp; chips was less expensive,  but not as enjoyable.  My fish was british style (not Vander Kemps wedges), but it was over cooked and burnt - the chips were meh. The service was great though.  The place has a good beer selection and I got to taste a couple beers before choosing and everyone was super nice.  I would eat here again, but not get the fish and chips. Also, if you are ever at the wharf and needing to get way from the crowds and over crazy priced food and out of the sun, it's a good place to go.", 
    "review_date": "2014-10-13"
  }, 
  "awwKA-2LsAgv4cSn38APhQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mof m.", 
    "review_text": "Service was attentive and appropriate Lots of screens and windows  Fish and Chips were a disappointment Is there such a thing as dead tasting chips and batter that sucks the fun out of the fish and chip experience?  On this day in my opinion yes.", 
    "review_date": "2008-05-17"
  }, 
  "0M5AAPNb9QYbCHp0bDrbGg": {
    "user_rating": 1.0, 
    "user_location": "Bellevue, WA", 
    "user_name": "Glenn S.", 
    "review_text": "Rude staff and extremely slow service! Food is over price for the quality. I'd pass as I know I won't be back for dinner. The manager took 50% off our meal but all I wanted was our food. Excuse was everyone came at the same time and the servers got nervous?? Really?", 
    "review_date": "2012-05-12"
  }, 
  "TourOK1mfKXwwTqtmwmOkw": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Michelle L.", 
    "review_text": "If somehow you are in a serious bind and you can not leave the hotel for food, eat here. Otherwise, there are 9 billion other places you should be eating on the Wharf. They screwed up fish and chips....on the Wharf, I dont even know how thats possible.", 
    "review_date": "2011-03-19"
  }, 
  "tRMMRfpbMnkJEV__QmpK7g": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Juliana C.", 
    "review_text": "I miss the hash browns and the simpler menu but... they're on their way to making something nice here.  Pluses:  Exceptional decor that remains casual while hinting at elegance.  Neat!                Staff.  Polished, sweet, attentive.  Heck, fed my meter for me!  Minuses:  Breakfast.  Oh boy - needs work.  Underdone potatoes and very plain eggs benedict - sad looking little thing on a huge fancy white plate... :(  Summary:  Management jumped all over my feedback via the server that the breakfast was a downer.  She asked me to tell her about my overall experience, I did.  Pluses and minuses - then said it doesn't add up if the food isn't well prepared.  She said the effort went into the lunch and dinner re-vamp, but that she'd send feedback up the line immediately.  Then she comp'd my sad little breakfast (good latte) and asked me to come back and try lunch or dinner with bar bites.  I have a coupon for one free appie - more incentive to try them again.  No, I'm not that easily bribed.  But her response was spot on, and her challenge to ask me to try again was smart on her part.  All in all.. a work in progress.  But the place LOOKS amazing.  And the staff is genuinely well trained and gracious.  Oh how I love to find places in the city where they actually train staff, or where staff are innately gracious.  I'll try again and update...  This place bears no relation to its former self, really...  Which is good.  Except for the potatoes - Jaysus, man...  How hard is it to roast potato wedges???", 
    "review_date": "2009-02-26"
  }
}