{
  "TfXq67nSxkp5z927VSZ2eA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Melissa S.", 
    "review_text": "Just stopped by for their soft opening and really enjoyed it. The staff was very hospitable. I ate here but did not order any drinks. The charcuterie was interesting. The cheese charcuterie  they make here themselves. I am also impressed by the bartender's knowledge and passion for wine (although I did not order any today).", 
    "review_date": "2014-09-15"
  }, 
  "-lzROgx9nuIOO1SkgVvelA": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Noa E.", 
    "review_text": "Came here 3 times in 3 days (was staying at an airbnb just a few steps away). This place is awesome both as a wine-bar with small noshes by night, and as a French breakfast spot. Tried the pain au chocolate and the kouign-amann and both completely exceeded expectations. Cappuccino was great too.", 
    "review_date": "2015-01-29"
  }, 
  "mE-hdFF4RgCxspZU72GAsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "Thrilled to see this new Burgundy cafe in Soma. Been three times now and I must admit my goal is to try all the food on the menu as everything so far has been tasty, especially the frisée aux lardons (best frisée I've had so far actually) and the duck rillette baguette (a complex pate with great bread.) Attention to detail is the mainstay here as all the ingredients, especially the lettuces and veggies, have been of the highest quality. And in a typical French fashion, the servings aren't the largest but at least the dishes are healthy and beautifully presented. Be careful with the wine as the bill adds up really quick, hehe, and truthfully, I suspect there's not a bad bottle on the menu. Again, great to see more awesome spots popping up in Soma. Please let this be a role model for more future cafes. Santé!", 
    "review_date": "2014-11-25"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 5.0, 
    "user_location": "South Bay, CA", 
    "user_name": "Kim N.", 
    "review_text": "Im a fan of the Saison folks and Mark Bright's wine and Shawn Gawle's food in particular. With this new space I dont need to have a special occasion to dine at their establishment anymore. Sat at the bar during the soft opening and had a few bites and some wine. Gnocchi Parisienne, and Tete de Cochon hit the spot. Liberal wine pours and I've got a good mellow going into dinner. Definitely looking forward to the full dinner menu, the massive crazy tea selection service and tons of wine and cheeses to come...", 
    "review_date": "2014-09-22"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "The service is great.  We came in at 10:30 a.m. on Saturday and it was not crowded until later.  I love the interior and the service here.  The croque madam was clean and simple ($14) and you don't have to walk to the Ferry Building to get a scoop of Humphrey Slocombe ice cream ($4 for single and $8 for double).  The coffee was served in Le Creuset mugs and saucers!  I love that.  I definitely would come back.", 
    "review_date": "2014-11-10"
  }, 
  "fitXjNnwVB_HzqaBSrIGXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor W.", 
    "review_text": "Great new French spot and certainly the best French in SoMa. It's a multi-format spot that is a brunch spot, coffee spot, wine bar, and sort of a market. The beautiful design of the place makes it easy for them to pull off the various formats so well as it feels like a intimate French cafe.   I came here for brunch. The French pressed coffee comes in a beautiful le creuset set that elevates the experience a little bit. The French omellete is well done but the standout is the frisee salad with lardon and eggs. Get the large size if you're hungry as that is really entree size. The egg is so rich and beauitfully cooked. The overall dish was very savory which is impressive cause often people make it too salty. The bread and butter side is excellent -- great piece of toast and very rich butter. Service is friendly and fast.   I'd come back to try dinner or wine but definitely would come by for breakfast in SoMa.", 
    "review_date": "2014-12-01"
  }, 
  "UyhnjAlyMXtbR-qB5kkhlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean Y.", 
    "review_text": "I liked Les Clos, and I enjoyed the food and wine I had here. This is a place that can get spendy very quickly though.    The atmosphere was laidback. Something about the decor at Les Clos made it feel like a very upscale dive bar. Maybe it was the TVs streaming random old movies like Labyrinth.   There was certainly nothing divey about the menu though. Les Clos serves up a wide selection of items: wine, champagne, cocktails (without hard alcohol), sake, sherry, vermouth, madeira, Sightclass coffee, tea, American + European cheese, charcuterie, oysters, caviar, bread + pastries from Le Marais Bakery, Humphry Slocombe ice cream, and French-inspired appetizers + entrees. Most of the cheese, charcuterie, bread, and alcohol are available for purchase. Menu prices include tax already, which I thought was nice, even if only due to irrational perception rather than rational math.  The 2 of us shared: * Bread + butter - $2 * 1oz of Basquitou cheese - $3: I really liked the cheese. It was served with a bit of quince paste and bread. * Lobster bisque with gnocchi + sunchokes - $14: Every spoonful of this was amazing! * Frisee with lardons, soft egg, ver jus - $9 for a half portion * Escargot stew with koshihikare rice, sweet garlic, chervil - $24: The stew resembled a very green porridge. I'm not a big escargot fan, but I found this dish interesting. The rice was a bit mushy though.   I wasn't very hungry when I sat down for dinner, and I wasn't very full when I left. I'd recommend Les Clos for a snack or a light meal, but I think it'd be tough to gorge yourself here. All the food was beautifully plated on lovely ceramic dishes.   We each had several 3oz pours of wine. The staff provided good recommendations based on our descriptions of what we liked. The wines here are on the pricier side, with the 3oz pours of red wine ranging from $7 to $27.   I was impressed by the tea selection here. In particular, there was a selection of Pu-erh ranging from $10 (1999) to $150 (1938) for a pot. I went with the cheapest option. The grassy flavor was lovely. I appreciated that the servers paid attention to how the tea was served. They poured the tea into a 2nd pot to avoid over-steeping. They heated water and refilled the 1st pot only when I was almost done drinking from the 2nd pot. I had 3 pots of tea, but the leaves had enough flavor to last a few more pots. The pot would have been good for sharing.  Since Les Clos is open all day, I would definitely come back to hang out, snack, drink, and read in the afternoon.", 
    "review_date": "2015-01-30"
  }, 
  "naE0kj3jbzvtbLNk2Rqf9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "grace k.", 
    "review_text": "Pretty authentic French cuisine.  Having dinner there with my French fiancé reminded me of the authentic French foods from Lyon and we enjoyed the vibe.  We had gnocchi , veal's head and frisée Lardon and they were so flavorful and well paired with white wine.", 
    "review_date": "2014-11-29"
  }, 
  "z8f97MvT-K4Wf4xSi0G2HQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben G.", 
    "review_text": "Went back for dinner and wine. Again, really good food. Some mistakes with temperature (e.g. cold couscous, slightly raw beans), annoying televisions on in the background, music too loud. But the actual flavors, textures and combinations were fab. We had the chicken, the gnocchi and ham &amp; beans.", 
    "review_date": "2014-11-12"
  }, 
  "uU7GIgzs4-5Dtp9Vuymb3A": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nhung T.", 
    "review_text": "The service here was extremly slow, we had to get the attention of the waitor like so many times!!! Sat next to the window near the door and oh boy that was bad. Flies were roaming around us like crazy. We asked to close the door, but they couldn't because it would be way too hot and stuffy. They have an extensive wine selection, some were pretty pricey. The flight of charcuterie and cheese were just typical, nothing special. Ordered the smoked salmon and it was just okay for me, nothing I can further comment on. I have to say that their pate was yummy!", 
    "review_date": "2014-12-03"
  }, 
  "y6I7waddCQUpHKelJ9sC2g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beatrice W.", 
    "review_text": "I came here for brunch this past weekend and my major complaint is small portion size.  Perhaps they're trying to be authentically French?  I had the smoked salmon tartine ($12) and it was smoked salmon and cream cheese on top of a slice of bread, cut in half.  Imagine a loaf of french bread, and cut a 3/4\" slice, and the slice ends up 6\" wide and less than 3\" wide at the widest point.  That was the surface area of the tartine.  Yes the bread was very good, but the dish was underwhelming - it could've used more capers and needed a slice of lemon to add some brightness.  Frankly, the smoked salmon dish at Darwin Cafe a couple blocks away is far more flavorful.  Also, the frisée and sliced radish on the side were aesthetically pleasing but also not filling.  Similarly, my friend ordered the French omelet and it was also tiny, about 6\" long and 2\" wide, served with 4 petite slices of red potato.  Flavor and execution were totally fine, she was just still hungry afterwards.  We were both ready for bunch part deux immediately after eating at Les Clos.    It's too bad, because the place is très mignonne, the people are friendly, and they have the world's most comfortable bar stools.  I just think they should either decrease the prices or increase them and make the portions sizes more substantial.", 
    "review_date": "2014-12-09"
  }, 
  "NpCKcLnZ9KgSuMRXvURcYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina W.", 
    "review_text": "I had a delicious and tranquil time at Les Clos today.  I started from a cup of coffee and a croque madame for breakfast.  Then a glass of ice mocha to chill up.  After that 2 glasses of German trocken white and a petite selection of charcuterie.    The croque madame was soooooo good!  Finally a gourmet place I can go to for breakfast in my neighborhood!  I can't wait to try the other items on their menu so I hung around longer to try a few other items on their menu.  Unfortunately I was so full after the croque madame.  I only had little appetite left for wine and charcuterie.  I normally do not enjoy dry wines, but the German white recommended by one of Les Clos staffs was really good, just what I was in the mood for for a HOT Saturday afternoon.  The charcuterie was perfect for me to savor on while my body was still digesting the croque madame.  The pickles and the olives were great compliments to my wine.    I only ordered a couple of raw oysters to sample.  I was told they are from Vancouver.  Fresh and delicious, equally good as the oysters at Pabu Izakaya which is only $1.88 each during happy hour.  At Les Clos, $3.50 each.    The service was warm, personal, and professional.  Camilla, Cara and one Asian girl all had a warm smile on them the whole time I was there.  They were attentive.  I will definitely go back again to try more of the items on their menu.", 
    "review_date": "2014-10-04"
  }, 
  "WTYdBBSepcmYJeqIviL4Eg": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Asia C.", 
    "review_text": "Great place and fairly authentic wine bar / french bistro like food. Unpretentious and accessible feeling place.  The wine selection introduced was fantastic and explained well. Wine racks in the back are cool to just browse and see what's available.  Went there for dinner with a group of 6-7. Food was superb with a great combination of SF ingredients + French style. To share among a larger party the dishes were probably a little on the small side, but the food itself was fantastic. The Poulet Basquez and Brandade (Salt cod) are highly recommended.", 
    "review_date": "2014-10-18"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "Les Clos is a small quaint spot that lives up to the hype.  We were there just before lunch opened but they were kind enough to take our order and make an exception.  We got our sandwiches to go but I can't wait to come back and have a date night here with some delicious wines.  I ordered the duck rillete based on their recommendation and it was worth it.    Great ambiance for a date night.", 
    "review_date": "2014-12-29"
  }, 
  "01TJKQwf7BZMi1AlRbE88w": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Zahir H.", 
    "review_text": "Packed on a rainy night (these idiots are braver than anticipated). Happy table opened so we didn't have to share the leather sofa in back.  Ended up sharing the following: Tete de Cochon (Have them describe preparation process) Highly recommend! Very surprising tasted like a light warm tuna.  Moroccan Chkn with couscous. Nice comfort food.  Malbec and Syrah both quite tasty. Sommelier was entertaining and posses a pretty descriptive vocabulary when describing flavors.", 
    "review_date": "2014-12-09"
  }, 
  "g5dnQedt89cXHv1qRNAndg": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Hillary C.", 
    "review_text": "Great little neighborhood gem. Outstanding croissants, great wine selection, cheese, charcuterie, and sightglass coffee! Chill atmosphere, high quality ingredients, super friendly staff. I will definitely be back!", 
    "review_date": "2014-10-18"
  }, 
  "1ncQ1FQYSKVUJAW6Yndlhg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G L.", 
    "review_text": "Love the Coffee!  The Staff is super friendly. Didn't get to try he food yet but hopefully soon!  Nice design and comfortable atmosphere!", 
    "review_date": "2014-09-15"
  }, 
  "wfkSu9Htoc8gK27n13ukTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frank R.", 
    "review_text": "What a brilliant, tranquil and serene place!!!  The attention to wine and amazing food is quite marvelous and never over-done; a place for true gentle eating and conversation .. quite impressed by the wine choices and the care, I had the good fortune of having one of the founders of this great venue be my bar-server, she knows a thing or three about all that is good in the world of wine and food! Also like the found-object style of what lies behind the wide and perfect-for-food-service bar, a working old phone from another era, a cooler for Champagne, and a TV set to an old black &amp; white film, mute. The vibe is very very good here!", 
    "review_date": "2014-10-08"
  }, 
  "kxXCIrki3dYVZ-eEGit2kw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fabien-Pierre N.", 
    "review_text": "Solid experience: from the wine selection by the glass to the pigs head appetizer and sublime cheese gnocchis casserole, the French in me fully sign off. Plus add the very good service which is the perfect balance between attentive and letting you enjoy your meal / company.", 
    "review_date": "2014-11-29"
  }, 
  "uVGBWldTUgBvV5sa9_Nb7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kim p.", 
    "review_text": "An absolute gem. My new favorite spot in the neighborhood, and they're finally open until midnight now!  The pommes aligot is served in an adorable blue Le Creuset covered baking dish, and is a light, fluffy, airy combination of mashed potatoes, butter, and comté cheese. A little bit rich on its own, but was perfect when we ate it with the bread we requested (which came out warm and toasted). The Blanc manger dessert is similar to panna cotta in consistency, and combined with the blueberries and crisped rice puffs was the loveliest combo of textures.  Great details in the space itself, from the 3 different types of super comfortable black leather bar stools to the semi hidden seating area behind the wine rack. Staff was warm and welcoming. Oh yeah, and they serve delicious wine too. Couldn't have asked for a better Indian summer late night experience.", 
    "review_date": "2014-10-02"
  }, 
  "4mePqcO2zoQt6TYhCL_OCQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lydie A.", 
    "review_text": "The food was nice, with good prices. I am French and the flavors were quite authentic which is a big plus! The wines were good too, but overpriced.  The service was clearly not amazing, as we had to wait 45mn between two plates... My impression was that the people working there are clearly passionate about wine, but are not waiters at all. It's a shame as it is the only ingredient missing for it to be a great bar, and I wouldn't mind paying this price if all the elements were gathered.", 
    "review_date": "2015-02-03"
  }, 
  "EbtEBo_nccHifQHCABWTXQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bay G.", 
    "review_text": "If I had to describe this place in one word it would be \"expensive.\"  I work in the hood and was looking forward to a new place for lunch.  I have no connection to the owner or people who work here.  I saw they had opened and stopped in.  The menu was difficult to read (small curlycue lettering) and very sparse - one sandwich and a few other things.    The staff was very nice and we were directed to a refrigerated case for pre-made sandwiches.  There was only one there - duck.    Six dollars for a bottle of ginger ale.  My friend actually screamed when she was told the price.  $14 for a sandwich.  It was a croque madame, made with a croissant, which is not traditional.  It tasted great, but was difficult to eat and cost more than twice what I pay for a sandwich elsewhere in the neighborhood.  The area in the back with a black leather couch and club chairs is nice.  The dining area has too many tables jammed into it and they are the tiniest tables I have ever seen.  The back of my chair was right up against the back of the chair behind me.  They just set this place up.  They should have noticed that and gone with a non-linear arrangement or fewer tables.  Ultimately, this may work as a wine bar (I don't think they can serve wine yet) but not so much as a lunch place unless they expand the menu and reduce the prices.", 
    "review_date": "2014-09-20"
  }, 
  "NxDGFy9ETTCljqaIPSFrQQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick M.", 
    "review_text": "I live in the area and my fiancé and I stopped in to have a drink and then decide what we were going to do for dinner. It was 6pm on a Wednesday and there were 2 tables occupied by other customers. Approximately 14 tables open.  We sat down and then the waiter asked if we were eating.  We told him we wanted to have a drink and figure it out.  He came back 3 minutes later (wo taking our wine order) and requested we move if we weren't going to eat (although by move he meant stand up).  I looked around and was like ok so we left.", 
    "review_date": "2015-01-21"
  }, 
  "d7EOm7WAQfVGnmBSY5pYQg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Debbie L.", 
    "review_text": "The food was good and the place is cute but they lose a star for the fruitfly problem they have inside.  It really detracted from the experience and I almost made this a 2 star review.  We came here for dinner and were constantly swatting teeny flies away.  It was really distracting trying to have a conversation, eating the food and looking out for the little buggers. We sat against the wall at a table. They still managed to get in our wine, which they kindly replaced.  But the issue is they didn't seem to be managing the insect problem!!  I'm hesitant to come back.  Maybe sit at the bar instead??", 
    "review_date": "2014-12-28"
  }, 
  "FysDiqCS1fxxwC9PLHNqNg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victoria E.", 
    "review_text": "Mark Bright has a home in Burgundy. I was emailing someone, as I sat down with a friend for brunch, about Burgundy's little town I sometime call home, and he wrote back, \"j'y étais allé une fois en vélo. Chouette.\" Then he asked me to text him a BTG. In a total amateur hour, I wrote back, \"ah, what's BTG?\" That, as he explained much later on, means \"by the glass.\" Great. So much for my sophstimacation!   Opened two months ago, Mr. Bright pays homage to his beloved Burgundy with lots of different wines from that region, including a wine map that prominently displays Beaune and Dijon, cities I'm familiar with.  Plus I'd go wherever Saison staffers go.  I had a rough weekend and this place was just what the doctor ordered: chic, foreign (yes, lots of French people), and familiar all at once.  Like most French wine bars, the tab water did not come with ice. French omelette was airy and tasty. Demi baguette was crunchy and fresh, and whatever my friend ordered, some sort of breakfast plate with soft boiled egg and ham was decidedly, French and yummy.  Here I was, sitting in this tastefully decorated wine bar, eating a proper brunch, catching a Wooden Allen flick, while discussing pre-race dietary needs with one of my super ultramarathoner friends and trying to stay distracted.   I told him the lowdown of the last few weeks, one event after another like there was no tomorrow. I was beginning to drown in work and life when I realized that the race date was coming to up. What should I eat for the next two weeks? I asked. He said, \"Eat healthy, sort of like this.\"  French food is not what I'd call \"healthy\" but it's superbly homey to me.  This place is through and through French-Californian. Jazz music was gently playing in the background. It was not loud, no one was yelling like most of those annoying restaurants are like. Then as I headed to the back side for the bathroom, I noticed something extraordinary: they have Olympic Provisions sausages and pates. I love OP in Portland. Separately, there are endless wines sitting on the rack, many are Burgundy reds. Tons of soft cheeses. Then there was the bathroom, which was filled with aromatherapy stuff - you really don't want to get out after going in, it's like a spa.  Here are a few things that I have noticed about San Francisco and SF food scene as of late:   1. There are a mass migration of French into this town. They are coming in troves.  2. French bistro theme is so in, any and every Michelin Star chef in town is opening up their own version of it: Urchin Bistrot, Monsieur Benjamin and now Les Clos.  3. Bathrooms smell like day spa - Waco in Inner Richmond is another example of it.   Trend setter aside, Les Clos offers something that you just don't see very much in more popular neighborhoods. Sophistication. This is not Plow, Bar Tartine, Mission Beach Cafe or Nopa. This is a place that you want to come when you miss France, really miss France, or perhaps your first casual online date, so that if the companion sucks, down the Sightglass coffee in 10 and you are out. If it does not suck, then order that charcuterie plate you are eying for. Always have an exit plan, and this restaurant will accommodate both!  But if you are like me and just want to find a less seen-and-be-seen place to chill with your friends? This is great too! Like Revolution Cafe, this place carries a sense of style and unique vibe. Do not miss.", 
    "review_date": "2014-11-23"
  }, 
  "SFNpdf6M-s0CQT7hCEwZfw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anita H.", 
    "review_text": "I went here on a friday around 5:30pm and surprisingly there was no wait. Though our waitress was new, she had some great red wine recommendations. I love that you can order half glasses, so you can have a taste of multiple wines. The food is also solid -- the frisee salad with the soft egg was surprisingly amazing... it was lightly dressed and just the right level of saltiness, and the lardons were a good touch. Also had the bone marrow, which was also delicious. the Jamon was so meatily delicious, and though i was sort of thrown back by the breadstick presentation, i didn't care after i tasted them -- they were delicious too!", 
    "review_date": "2014-11-15"
  }, 
  "U28XN1IGtjsQL2DUxr7FKg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Be F.", 
    "review_text": "The coffee, ambiance, and staff are all lovely! They serve Humphrey Slocombe ice cream, yum. However, the nicoise dish scared us off of ordering mains and knocked two stars off my review. It's a chickpea pancake smothered in olive paste that's exceptionally strange. I highly recommend you avoid ordering it so your dining experience has a chance of staying at full stars.", 
    "review_date": "2014-12-07"
  }, 
  "JADdo9NEeO5Az9aOYbyvZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Manda Bear B.", 
    "review_text": "********************* 1163 *********************        Being a fan of Saison, got to meet Master Somm Mark Bright and pastry chef Shawn Gawle, many times before. I admire their work and dedication of what they do best.        I'm stoked to hear they open this Les Clos Soma, more accessible to the norm then the high end Saison.         Les Clos offeres small plate, beer, coffee and amazing wine list oversee by Mark Bright and their GM/sommelier on floor daily. She's former of Saison and Hakkasan SF.       Les Clos is such a cute place serves breakfast, lunch, and dinner. Bread and pastries make fresh daily and so the rest of the food serve here is sustainable and locally sourced.  You can pick up cheese and food items togo here as well.       A neighborhood spot, warm and inviting, good food and so reasonable wine mark up, hard to find wines, think of half  bottle Krug Champage is only $80, that's a retail price, no mark up!  Right now since they just grand-opening, pick up wines to go 30% shelf!        I'll be back for more.", 
    "review_date": "2014-10-19"
  }, 
  "H3xlElALuIW066onz8cOng": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh A.", 
    "review_text": "The first time I came here was late at night for wine, and their selections were fantastic (better than District).  After that, I started coming here for coffee, and it's become my favorite place for espresso in the area (much better than Creamery, and orders of magnitude beyond Starbucks).  Recently I had dinner here, and while it's a bit pricey, it was delicious, and I'll be back.  The staff is consistently friendly and prompt, the ambience is very cute/intimate/warm, and the restroom's clean.  Les Clos really is a new gem in soma!", 
    "review_date": "2015-02-01"
  }, 
  "iHLoUPIXled3ytugJPbvow": {
    "user_rating": 5.0, 
    "user_location": "Miami, FL", 
    "user_name": "Angela N.", 
    "review_text": "It was an amazing experience to having dinner in Les Clos, food is fantastic, the waitresses are very helpful for the wine choosing, we love the dessert and ice cream, I should say it's the highlight of my SF trip!", 
    "review_date": "2014-10-15"
  }, 
  "KtzCu6VQmKmr-nZuQkv7cw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason R.", 
    "review_text": "I don't get the hype. The food is nice, portions are the right size, but the service needs some attention.   They (kitchen or staff) have botched our order each time we've dined here. Missing items; late items; wrong items.    It mars an otherwise lovely experience: the staff is knowledgeable and take the time to recommend food and wine. Alas, if only the food and wine they recommend arrived on time, or at all.    3 stars. Needs work. Sorry, Les Clos.", 
    "review_date": "2015-01-15"
  }, 
  "t2Gj1DlQt5xNUIKD90BQ6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff B.", 
    "review_text": "This place was good. The chicken was juicy and the wines were on point. My favorite part was the dessert. Love that they serve Humphry Slocombe ice creams hey have one table that seats more than 5 so if you're coming in a group, all ahead.", 
    "review_date": "2014-12-09"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "The French omelette (with that classic French ingredient, chorizo) was really good, though very small and came with about four or five potato cubes (home fries, basically). Would've been nice to have at least some toast with it. The saison (I forget which) was delicious.", 
    "review_date": "2015-02-01"
  }, 
  "htf-Fu0S9uleEN8psnP6ZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel D.", 
    "review_text": "Great wine, affordable amazing build-your-own cheese plates, not very crowded on weeknights. The frisée aux lardons is excellent too. I love this spot for solo chill out dinners. Honestly no criticisms.", 
    "review_date": "2014-11-18"
  }, 
  "8mLfO4uNtbYWCQJ5pbjB0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole L.", 
    "review_text": "5 stars alone for the canele - OMG they are PARFAIT. I literally crave them every day. The fact that they are almost always sold out only intensifies my obsession.", 
    "review_date": "2015-01-18"
  }, 
  "ukb89uP-1Qfdb5-xEk6dIA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Gregory P.", 
    "review_text": "Nice, small place, but totally lacking on the concept.  The wine I had - a customized 3 glass Burgandy primer - was excellent: a great Meursault, a fine Cotes de Beaune and a great Chambolle Musigny.  No complaints there.  When I went tonight at 6:45 the place was practically empty.  Sat at the bar next to a gent who was actively talking w/ 1 of the wine buyers.  And thanks, she gave me a taste of a champagne.  The wine was served at the correct temperature in beautiful glasses.  That's all the good.  The food was ridiculous: roasted marrow \"canoe\" w/ caviar obviated the need to add salt, as the caviar took care of that.  But it was lacking on concept.  2 good ingrediants don't make a great dish.  Next, 2 cheeses: a crottin/goat cheese and a \"petite\" {guess they don't really know french, as Camembert is a masculine noun) camembert, both served as if straight out of the refrigerator.  I would suggest they visit Gary Danko where the cheese tray is both beautiful, diverse and prepped at the correct (i.e. room) termperature.    For dessert the rice pudding was quite nice, but it didn't make up for the 2 previous courses.  The service was ploddingly simple; the barman added nothing to the mix and seemed uneasily out of his depth.    I can't see how the folks who run Saison could be so pitifully short-sighted in their attempt to create a sweet little winebar.  The concept is great, the achievement totally mediocre.  I hope they improve their food service, as it is a real offense to the wonderful wines they offer.", 
    "review_date": "2014-12-30"
  }, 
  "cZOMD5-bITGYM_VgoEhNow": {
    "user_rating": 5.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Nicole H.", 
    "review_text": "I really enjoyed my meal here. Not too crowded, fresh oysters, great wine, most tender delicious chicken and super yummy sides.   I would definitely go back.", 
    "review_date": "2014-10-21"
  }, 
  "IZvy2eANmhhcetr69ataqg": {
    "user_rating": 5.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Grace Y.", 
    "review_text": "Came here with my boyfriend at around 10:30 a.m. on a Sunday.  There were only two other groups of people sitting at the tables and a couple people sitting at the bar area.  I loved the ambience of this place! Very chill/cozy vibe.    We decided to get some food and coffee.  I ordered the corn meal waffle with currants and apples along with a pot of green tea.  My boyfriend ordered a cappuccino, a shot of espresso (geez how much caffeine can one have??), and Friseé salad with a poached egg, chicken, and potatoes (I'm blanking on the real name).  Apparently, there was a malfunction with the order printer in the kitchen, so we waited a little while for our food, but honestly, we didn't notice! However, the server brought us 2 complimentary pastries. How nice!  My waffle was perfectly crunchy and the currant/apple toppings added some tang to the flavor.  At first, I thought the white dollop on top of the fruit was some fresh cream, but it was whipped butter! I took about half the dollop onto my fork, at it, and soon after realized what I had done. Whoops! My green tea was the perfect temp. That's all I have to say about that. *thumbs up*  My boyfriend's breakfast was superb! Very French dish. He's a French cuisine enthusiast and he was in complete awe with every bite that he took.  The chicken and poached egg were all cooked to perfection and the flavors were well balanced.  He also loved his cappuccino and shot of espresso.  I had a little taste of the espresso and it was a caffeine PUNCH to the face! TIME TO WAKE UP!  This is not your everyday brunch place.  The food focuses quality and not so much quantity.  If you're hungover and just want to stuff your face with mountains of pancakes and bacon, this isn't the place. May I recommend iHop?   Overall, great service, food, and vibe.  I will definitely be coming back here again!!  **BONUS! This place has the swankiest bathroom. Forget paper towels. You get to dry your hands with actual hand towels. #BougieSweg. Ooh and there's a humidifier. Whaaa?", 
    "review_date": "2015-01-26"
  }, 
  "OjzwEyl7DSgjLxUcJeex6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jia H.", 
    "review_text": "New charming neighborhood wine bar, perfect for a casual date night. Good selection of both California and European wines, and everything comes by the taste, glass or half bottle.  They also have some of my favorite cheeses from cowgirl creamery that are served with nuts and jams.  I look forward to coming back to try the food -- heard brunch here is good.", 
    "review_date": "2014-12-10"
  }, 
  "z5E5lZFo34CF1lR3ITNgnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael H.", 
    "review_text": "Have you ever walked into a place for the first time and felt at home?    That is Les Clos - a lovely cozy place to hang your hat for a while, chat with the folks working the bar and kitchen, who are kind and extremely educated on the drinks and food they prepare and serve, and pass the time browsing books on the coolest and most complex wine region in the world.  For small plates, I'd recommend the chick pea pancake followed by the head cheese dish.  If you must stray outside Burgundy, the Cote-Rotie is amazing.  We loved it - thank you Cara, Dylan and Shawn!", 
    "review_date": "2014-11-16"
  }, 
  "w1ubQ8xkCfA3f4gaQUr_3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny C.", 
    "review_text": "Are you craving French food? Like French food so French that I had to ask what half the menu items were? (I mean this in the best of ways, we went into the night wanting to eat food that we'd never had before). Then this charming wine bistro is the place for you.    We had the bone marrow, the pate, the olive chickpea pancake, the escargot stew, and the blueberry puffed rice which was kind of like a panna cotta. The pate was a bit more like a terrine for me. Bone marrow is always a win in my book and the escargot stew was nice and garlicky.  I kind of just want to come here and sit on the back couches and sip wine all the time- the ambiance is something like a cute European cafe.", 
    "review_date": "2014-11-21"
  }, 
  "ODaeDgjZaEtas8Ot-vZJ9g": {
    "user_rating": 5.0, 
    "user_location": "Albany, CA", 
    "user_name": "Rich R.", 
    "review_text": "Poached Egg En Meurette avec mushrooms, short ribs, herbs + shallots in Burgundy sauce is so complex, layered, and aromatic that it merits a very fine wine pairing.  Which wine would you choose?", 
    "review_date": "2014-09-19"
  }, 
  "kXSEepDXV-DwiA_6BFzE9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan H.", 
    "review_text": "Services is smart and friendly and the owner herself is very kind to her customers. Seems like that should be a given but you know how it goes.  Additionally there's chill music playing at an appropriate volume, something many restaurants in the area fail to achieve.   Last but not least, good food, great beverage selection and clean bathrooms (you know that's clutch when you're drinking -admit it)  Will definitely be back here.", 
    "review_date": "2014-12-24"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "3.5 STARS  If last week's news is any indicator of how the year will play out, then 2015 will be one kick ass year! It was surreal when I heard that the ban had been lifted on my beloved foie gras. It felt like winning the lottery, better yet, having perky t*ts that don't point to my toes.   Les Clos is one of the handful of restaurants in SF that immediately added foie gras on their menu the very same night the ban had been lifted so we paid a visit over the weekend.  Opening last fall, Les Clos is a casual French Bistro &amp; Wine Bar that was started by several Saison alums. It's impressive the hours they keep; they're open for breakfast, lunch, and dinner. Les Clos accepts reservations which Yelp needs to update under their business info.   Les Clos' menu has Le Marais pastries, salads, sammies, oysters, cheeses, charcuterie, and three entrees at dinner. The menu changes seasonally and prices are more in the $$$ range than what yelp indicates: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1BpPa9H&amp;s=dd815876daa24be0ec81c4b4eecb4d79943dec6b7f55fdf01d63e6a7ecfcf225\" rel=\"nofollow\" target=\"_blank\">bit.ly/1BpPa9H</a>. They have an extensive wine list with over 40 glasses of wine by the glass. It's rather expensive though. For reds, 3 oz pours are $11-$16. I'm a total wine noob so I don't remember the name but our waitress recommended a great French blend (malbec and merlot) which was delicious and bold but at $26 a glass (6 oz pour was more 5 oz), it was damn pricey.   We started out with the Foie Gras Torchon (large - $29): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1IK9piO&amp;s=59c14c659a859a161b75df833879e427fa5c3ad80b35c13235532524416281d5\" rel=\"nofollow\" target=\"_blank\">bit.ly/1IK9piO</a>. I usually prefer seared foie over a torchon but this was by far the best torchon I've had. It was ridiculously silky with a cured sweetness that was pure ambrosia between the lips. Paired with their freshly baked parker rolls (same one I had at Saison), it was out of this world...BOMB!  Sadly, the food went downhill after that. We also ordered the Bone Marrow for an app; one plain ($5) and one with caviar ($16): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1sy7njI&amp;s=1f624f4965834373ea5a5b5f2f94efaf329c88a54f3e44678cd5a7eb034736b3\" rel=\"nofollow\" target=\"_blank\">bit.ly/1sy7njI</a>. The marrow was pale and was in need of seasoning. Caviar and marrow sounded luxuriously good on paper but it just made the marrow taste fishy.   For my main, I ordered the Poulet Basquez w/ cous cous ($26): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xZiMcI&amp;s=ef2dec947946eb852e2fe8519ae2ea7afa27760e6a97e005df7fc2740e64ebb4\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xZiMcI</a> which is Les Clos' take on a Moroccan Chicken Tagine. I was surprised with the large portion of chicken (2 thighs and 2 drumsticks) but it was dry and bland. It definitely lacked robust spices (ginger, cinnamon, cumin) and dried fruit that a solid tagine would have.  Mr. NSS ordered the Lamb Shank w/ rye spatzle, maitake, sauerkraut ($29): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F151Tu2q&amp;s=d0a73aaf8be9058d131b4ed5401c97eb9ce51afef04469b6b0fe7060f4791e45\" rel=\"nofollow\" target=\"_blank\">bit.ly/151Tu2q</a> which was beautifully presented. We wrongly assumed that the lamb shank would be braised. The lamb was served too rare and was very chewy in the center. The toasted rye spätzle was very addictive though.  Redeeming our lackluster entrees was the Les Clos Sundae ($10) which consisted of two scoops of Humphry's Taihitian vanilla ice cream, melted dark chocolate, chantilly cream, and candied pine nuts: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1B1mpS0&amp;s=d6b6f592d50376ac84457927aec55aa857bcbb6accb1fd5c68360dbc27172694\" rel=\"nofollow\" target=\"_blank\">bit.ly/1B1mpS0</a>. Every component was simple but together it was delicious grown up sundae (not too sweet). Loved the sweet, buttery crunch from the candied pine nuts.   Service was welcoming, sweet, and attentive. Food service was very timely. We were in and out in less than 75 minutes, and we ate a very leisurely rate.   Les Clos is great for laptop camping in the day while sipping on a Sightglass latte, a casual, romantic date at night, or enjoying a night cap on their plushy leather couch. There's two flat screen TV's at the bar area. Not good for parties larger than 4.   Finding street parking was easy since it's not baseball season and we eat dinner like AARP members.", 
    "review_date": "2015-01-14"
  }, 
  "p6RurvWCPEqR8PP4siwiVA": {
    "user_rating": 3.0, 
    "user_location": "Durham, NC", 
    "user_name": "Emily Y.", 
    "review_text": "3.5 Stars Breakfast at Tiffany's was playing on the screen behind the bar when we walked in, and I could not think of a more appropriate movie for this particular restaurant.  The lights were dim and the air was full of pricey sophistication.  I was pretty tired when I walked in, but I couldn't help cheering up a little when seeing a familiar little French flavor to everything.    However, if you are not familiar with French, the menu is quite confusing.  Thankfully the waitress was super friendly and helpful.  Given that this was a wine bar and we were here mostly for the food, I believe we missed out on a potentially crucial asset of the restaurant, but tant pis and allons-y with the food.  Cheese plate: parmesan, Mt. Tam, and Harbison, with warm bread and jam spreads.  I was a big fan of the latter two, but then again, I have always preferred soft cheeses. Market greens: crunchy but too much oil on the leaves; average. Lobster bisque: very rich and flavorful, but heavy on the stomach.  Ditto for pommes aligot, or very smooth (puréed?) mashed potatoes with cheese.  So unhealthy, but so delicious. Escargot stew: green pesto rice with some white sauce and an occasional snail inside.  I was not a fan of this dish because it was too salty for my taste.   Squash side dish: the cardamom seeds lent an excellent taste to the excellently cooked squash.    Overall, I would recommend the cheese plate, the bisque, and the squash.  Given that this is only half of the dishes and the fact that it came at a very expensive price, I have to dock 1.5 stars.  The service was extraordinarily good, I loved the atmosphere, and I'm sure the wine selection is excellent, but in terms of food Les Clos still has a ways to go.", 
    "review_date": "2015-01-22"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "This is an unexpected charmer in the South Beach area. I say 'unexpected' because I keep presuming places like this are in neighborhoods like Nob Hill and Pac Heights where the snootiness quotient is much higher. Not that long ago but well before the recent wave of gentrification, I believe the dining pinnacle of Mission Bay could be found at the McDonald's at 3rd and Townsend. But now, there are pricey places like Alexander's and Saison that would melt the numbers off my credit card. Speaking of which, Saison's wine director Mark Bright must be aware there are proletarians like me and Jamie W. in the 'hood and opened Les Clos to cater to pocketbooks with less platinum in them like ours.  We came on a Saturday afternoon where it looked like we gratefully just missed a wave of customers. The menu is an endless spiral clipboard of delights that strives to balance wine, beer, coffee and food according to their website. Although they have loads of libations, flights of tantalizing wine and crates of craft beers, we were drawn to the mimosas in the smallish cocktail section of the menu. Jamie ordered the $8 White Ale Mimosa, a nice elixir from the Allagash Brewery in Portland, ME mixed with orange juice and bitters (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1AwWO1i&amp;s=0d2c55c50850d9a8df5178bb1e8dff382f3c7d945c0c6cd7a79ed02c7bc3bfd4\" rel=\"nofollow\" target=\"_blank\">bit.ly/1AwWO1i</a>). In kind, I went for the $9 Prosecco Mimosa also with orange juice and bitters (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1CsipHI&amp;s=d05482e72079a57483a88a4a409a37c2bc67a1ae2250340b4b4e7537efe41407\" rel=\"nofollow\" target=\"_blank\">bit.ly/1CsipHI</a>). Very refreshing with just a tinge of gas. Since we were peckish, we looked for appropriate-size noshes.  Luckily it was just a hair past 2:30PM, so we could take advantage of their brunch menu (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1CmSIuP&amp;s=4624252173d396a80b812e8ffc56d6c1d865046e052e1b14b4d1d525bec2ee5e\" rel=\"nofollow\" target=\"_blank\">bit.ly/1CmSIuP</a>). Jamie decided on the $12 French Omelette, a classic rendition with chorizo, shallots and Cabot Clothbound cheddar cheese served with sauteed potatoes (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xaoutT&amp;s=af889e230ef603af63026dd327d84e892e392b93a7737d32dd696bdddd8c54b2\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xaoutT</a>). You could tell the egg whites were beaten to stiff peaks to attain that requisite airiness. I ordered the $14 Croque Madame with a perfectly shaped fried egg on top of jambon de Paris between crusty pain accompanied by a small mixed salad (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xaoytn&amp;s=35ec11340c0e40a220cceb6c1fa08ddcce7b6babd4389a1059fdc7c5747d7244\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xaoytn</a>). Just the perfect afternoon bite. Jamie couldn't help himself when he saw they served Humphry Slocombe ice cream, so he had a $4 single scoop of his favorite, Secret Breakfast (photo: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1sZqDXD&amp;s=ba4f28df35f8c2dfa36adc4409ab55909ca65082dc883d4d20a7de2e476c69de\" rel=\"nofollow\" target=\"_blank\">bit.ly/1sZqDXD</a>). Definitely worth a return visit soon.  FOOD/DRINK - 4 stars...classic French fare for petit eats and refreshing mimosas to boot AMBIANCE - 4 stars...charming, compact spot SERVICE - 4 stars...quite attentive TOTAL - 4 stars...a classy touch of Saison for the 99%", 
    "review_date": "2014-12-21"
  }, 
  "QYoQLxcg34mQOMOW1nQjvA": {
    "user_rating": 2.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Jonathan R.", 
    "review_text": "Nice wine and beer menu. Friendly but inattentive service. Wildly overpriced ($9 for draft IPA) with no happy hour.", 
    "review_date": "2014-10-02"
  }, 
  "EDwgntEyg69iTtbjM2wHYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex F.", 
    "review_text": "Had the Truffle Omelet, Chicken and Egg n 3 cheese place....excellent.....fantastic mocha latte with chocolate...great service n fair price....", 
    "review_date": "2014-12-13"
  }, 
  "pEvhyxL7YAGrYsKB29VJvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "Amazingly good in every way.  Very French.  I can't believe I didn't know about this place -- it's around the corner from my office.  I was actually reluctant to go inside at first (my default cafe was closed, and this was on the way back); glad I did.  Great food, wine, and ambiance.  Works as a casual cafe or for more substantial lunch or dinner.  Probably not a great choice if you're on a diet, but otherwise excellent.  So far I've only tried the between-lunch-and-dinner cafe service, so I'll have to update once I've been to lunch and dinner.", 
    "review_date": "2014-11-27"
  }, 
  "muFdt8P0B9IRYDwp8tXmCg": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Chris L.", 
    "review_text": "Love the quiet, european feel of this cafe. Delicious bread and great coffee. I'm happy this place opened up where it did, and I plan on stopping by as often as I can. They just need to work on the speed of getting you coffee if you're just getting to-go.", 
    "review_date": "2014-10-08"
  }, 
  "aJwh6Mcw-q7Xio1CJxJmBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate M.", 
    "review_text": "Love this place! It just so happens to be close to work, so I've been indulging in some Le Marais baked treats and delicious coffee (with multiple fancy simple syrups).  Tonight I tried out their dinner and was pleasantly surprised by the quality of the simple French fare. Wonderful cheese selection, incredibly detailed wine tasting options, and lots of sharing plate options.  I was especially impressed with their mussel and saffron stew which was more like a French risotto with mussels, fennel, onions, and flavorful saffron.  Service is attentive, prompt and knowledgeable. Yes, it is rather pricey but portions are quite generous and the ambiance was cozy and intimate without being too loud on a Saturday night.", 
    "review_date": "2014-11-15"
  }, 
  "ib-vUU5hvckrGSQqlJ1VYg": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Sergei B.", 
    "review_text": "Cute small modern bistro, with really tasty and Frenchie food.  It's more about small plates and appetizers than main dishes. It's a bistro not a full-course proper restaurant. But a great bistro it is!", 
    "review_date": "2015-01-18"
  }, 
  "YxXcfbIjHxTKwOLCJfQqyg": {
    "user_rating": 4.0, 
    "user_location": "Eureka, CA", 
    "user_name": "Alea H.", 
    "review_text": "Delicious,  warm,  accommodating and very polite staff. Traveling through on my way home.  Glad we stopped in we will definitely be back.  Very nice  Design and comfortable atmosphere.  A ten on the Richter.", 
    "review_date": "2014-09-21"
  }, 
  "aMhX0yVV_b6IvasAO4I8UQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexei L.", 
    "review_text": "Great place near the ball park.. Awesome service, wine and food.. Plus I designed the place..", 
    "review_date": "2014-10-09"
  }, 
  "AgYjvgJbsqXNr8tVe_Rm-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annmarie K.", 
    "review_text": "impromptu date night in the neighborhood at Les Clos.  We sat at the bar and had a great time.  FOOD &amp; DRINKS:  We had champagne, oysters, Foie Gras and a charcuterie board-  Every bite was excellent- the Foie was the main reason we picked Les Clos and it did not disappoint.  We will go back for the Foie gras.  ATMOSPHERE: casual sort of bistro like  SERVICE:  friendly, informative and attentive  PARKING: pretty hard to find-take public transit or a cab   The only tiny aspect that could have been better were the bar stools.  Not very comfortable.", 
    "review_date": "2015-01-18"
  }
}