{
  "TO5G32j_BZ7zRI3CEPyQ6w": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "R M.", 
    "review_text": "Capacity of 99 filled with 200 guys and 30 girls...won't be back the next time I'm in SF. Was cool they had some live music mixed in, but it was hard to enjoy it with douchy guys in Faconnable shirts bumping into you every thirty seconds.", 
    "review_date": "2014-03-09"
  }, 
  "-Qf4ffBkhYailgZ57ZenOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carly W.", 
    "review_text": "I really liked this place when I went!  It had a live band, although I wasn't too excited about the music, no cover, and once I got passed the doorway area, it wasn't horribly crowded.  It has two bars, one in each room, which is convenient, but beware that one bar is cash only.  With the live band it is obviously pretty loud in here so don't stop here if you want to chat with friends.", 
    "review_date": "2009-09-30"
  }, 
  "mD2w-oEwtpWTUT4k2cGg2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie G.", 
    "review_text": "Live music on Friday and Saturday nights - who doesn't love a good cover band??", 
    "review_date": "2012-12-11"
  }, 
  "3EIc7WAoiojTFdy3TGOMfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony D.", 
    "review_text": "I watched Uruguay lose to the Netherlands here.  Great venue for watching sports and great selection of suds.  Need food?  Cross the street and grab a burger at Mo's.", 
    "review_date": "2010-07-06"
  }, 
  "2KmVI2N9J6jYZtww018Ptw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Eric M.", 
    "review_text": "Came here on a Tuesday evening with coworkers, fresh off a company dinner. MM was fairly empty (typical I'm guessing, on a Tuesday) so it was cool to be able to come in with a group and chill without being bothered by a crowd. I liked the openness, with two different areas (and bars) and would imagine it's also a good place to come even when it's busy.  The bartender was an awesome guy. We ordered Irish Car Bombs, and didn't get the stink eye from him (which alot of bartenders will give you.....it's the \"oh, this idiot wants to chug chocolate milk\" look; which is understandable). One of our guys actually broke the shot glass (rookie) and cool bartender guy didn't get upset. Good guy all around  Only complaint would be pricing - seems a little high ($9 each for the bombs), but it's SF and rent is high you guys.  I'm hoping to come back here again when I'm back in the area.", 
    "review_date": "2011-08-25"
  }, 
  "2uCLXC-oCwtUNjse41IgYw": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Paul E.", 
    "review_text": "What a great place for Easter!  One Bloody Mary turned into three...and The Patrick's took good care of all there.  An added bonus was \"Big Al\" and his owner Luke.", 
    "review_date": "2013-03-31"
  }, 
  "TFpNMh-yRcPiWcFMuIY2bg": {
    "user_rating": 3.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Christina D.", 
    "review_text": "I wandered in here on a Saturday afternoon looking for refeshment on a beautiful day in SF. It was pretty empty, only about 10-15 people in the place total. It was an ok vibe, defenitely had more people in their 30s there. Had a beer or two (mainly because they were showing the Giants game) and then cut out. May be back...I don't know.", 
    "review_date": "2010-04-19"
  }, 
  "legEZzXG28Hy0ikwMnOLzQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Miguel S.", 
    "review_text": "Fun Irish pub with good people, good beers, good service &amp; a great atmosphere for playoff baseball.  In full disclosure, this place was kinda like home for the past week. Can't say enough about the fine folks that work there &amp; welcomed us like family.", 
    "review_date": "2012-10-10"
  }, 
  "nsCrsxiGTYO6G0OZKC-n_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean M.", 
    "review_text": "Found about this gem from my new friends at Bay Area Gooners. Came here during my lunch break to watch Arsenal v. Bradford.  It was fantastic to enjoy a pint with fellow gooners and watch the game without music playing at the same time. Why \"pubs\" do this is a mystery to me. Am I willing to come here at 6 am to watch a game on a Saturday? Definitely/  I will definitely be back, especially if its a work day and Arsenal is on the telly!", 
    "review_date": "2012-12-11"
  }, 
  "d_xM5FJK_MwaWW5g6b45Jw": {
    "user_rating": 3.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Jen K.", 
    "review_text": "we bounced between kell's and this place for the birthday bonanza.  the band that was playing was AWESOME and the crowd was pretty into it.  my friend woz got hit on by a douchey older man who told her in hushed tones he worked for the government and returned from afghanistan two days ago...uh..awesome?  how do you respond to that?  he didn't even buy her a drink!  i think he drank her drink in fact.  not a great representative of the USG my friend.  dirty old men aside, i had a blast at this place.  sadly maggie mcgarry's did not have any food and i was craving some french fries.  happily it is super close to the cheese steak place down the street that has awesome french fries.  the bouncer even let me bring the food in.", 
    "review_date": "2009-12-30"
  }, 
  "JnN7fWESKk3MXR2zfD_XKw": {
    "user_rating": 4.0, 
    "user_location": "Southeast, Las Vegas, NV", 
    "user_name": "Christie B.", 
    "review_text": "Great place! We happened upon this small little bar by accident on a Saturday night.  There are two bars inside, which made it easier to get drinks quickly.  The bartenders were very friendly.  We were lucky enough to be here for an amazing live band and we stayed until the band finished at 1:30am.  There are some bottleneck situations due to its small size, but we never had a problem getting a drink or using the bathroom!  Overall, we had a great time!  If you have the chance to see The Peelers at Maggie McGarry's, we highly recommend it!!", 
    "review_date": "2012-07-04"
  }, 
  "7OagHIAKx2Rm9z3CQ0OmvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "serena l.", 
    "review_text": "Came here to watch Spain beat Italy (whoohoo!) in the Eurocup quarterfinals, and then Spain beat Germany (whoohoo!) in the Eurocup finals. Terrific place to watch the game - just the right amount of crowdedness that you get the excitement of fellow soccer fans, but not so much that you can't see screens/are smelling armpits to the left, right, front, and back. I live close by and chose this place because of all the bars on Grant, it's the least grody, having been remodeled last year. :)  I'm not sure what the scene is like at night, or during the weekends, but for soccer matches, I'd definitely return.", 
    "review_date": "2008-06-30"
  }, 
  "nYufXwZH9ooB_zjNJf8Xlg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Morris D.", 
    "review_text": "Only been here a couple of times. Never really impressed with this place. No real identity I guess...way too shitty and out of place to be considered a \"hip nightclub\" or whatever and lacking cool, interesting people to bullshit with..there's just no reason to go here. Especially since you're in a neighborhood saturated with better places to go..", 
    "review_date": "2011-03-30"
  }, 
  "H-VYDTGKrGiK0NDJ-XhZzA": {
    "user_rating": 5.0, 
    "user_location": "Belo Horizonte, Brazil", 
    "user_name": "Lucas M.", 
    "review_text": "One of my favorites in San Francisco! They have live music on weekends, starting at 10pm going on until 2am. I went there Fridays and Saturdays and every time was so crowded and I really like this kind of bar. They have two bars and some tables if you prefer to stay seated.. As far I could see, they don't accept credit cards on the bars, but they have an ATM inside the bar.. Really good place to listen some good live music and hang out on a Saturday night! I heard they have karaoke on Wednesdays too, and I'm looking for it next week!", 
    "review_date": "2014-04-13"
  }, 
  "YEZdPLpuigLGTjmeUKKEdw": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Cindy G.", 
    "review_text": "My husband and I had a wonderful time at this Great Bar last Friday night .it was the our 1st time there.we had Great Service and and all the staff was very professional. The band that night was Superbad. Lots of great music and well priced drinks. I thought the Mural Wall opening up to the stage so Original!We will definitely come back again.", 
    "review_date": "2014-12-23"
  }, 
  "SVtNctg9k2QOGj0znfHVwQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Eli Y.", 
    "review_text": "80's cover bands FTW!  So I've been here twice, and both times were on a Friday so I don't know about the other nights here, but Friday's are a great night to come to this bar.  I love 80's music and both times I was here they had 80's cover bands. The first was a hair band, awesome and hilarious, the second was a regular band, less hilarious, still awesome. They both played great 80's music and had the crowd dancing the night away.  The dance floor is big enough and the crowd is usually great. I don't generally drink so I'm not sure about the cost of the drinks at this bar, but the first time I was there was my birthday. So my friends kept buying me drinks and I learned later that they were really expensive. So that is a definite downside.   Other than that though, if its a Friday, and you're in South Beach, stop on by this place, especially if you're already good to go, intoxication-wise.", 
    "review_date": "2011-04-13"
  }, 
  "0CqAmHUSWPEQdrnCbDiaVA": {
    "user_rating": 4.0, 
    "user_location": "Marina del Rey, CA", 
    "user_name": "Brian B.", 
    "review_text": "Cool pub with great live music.  Saw The Duvets here.  Recommend the venue and the band.", 
    "review_date": "2014-05-01"
  }, 
  "fgyGrbXFsoUepG2-IIxobg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geoffrey B.", 
    "review_text": "i know i am always doing a new review but someone has to give this hard working bar staff props, especially when they deal with so many Marina Douches. last night i was just trying to enjoy myself when some litle ratchet was trying to sneak in cans of beer into the bar (illegal) and when she got caught she attempted to play stupid , which wasnt really hard for her. And then she was asked to leave and instead of admitting fault and accepting the consequences for her stupidity she has her boyfriend we will call Super Douche threaten the lovely bar tender. they were finaly forced out. and of course gave a bad yelp review. so this message is for all the coors light and Jameson drinkers from the Marina get a clue or get out.   sincerely your friendly neighborhood local", 
    "review_date": "2014-10-12"
  }, 
  "5jQPgMm6YptJzeMGZ775qA": {
    "user_rating": 4.0, 
    "user_location": "Poway, CA", 
    "user_name": "Denny C.", 
    "review_text": "Giving all my stars to ti is reasonable, I highly love it for their amazing delicious foods. I like them and they are well in their faculties. Good location and highly dealing with me. Great choice of it. I will be back.", 
    "review_date": "2014-04-22"
  }, 
  "-hKPqnylgCVP3Ax-ZUdEcQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "joanna k.", 
    "review_text": "crap bar.  dingy...bar people were unprofessional (rude and sarcastic -- they definitely were not having a good night) and just kinda yucky place to go.    the good part is that there were three other bars on the same block and those were DEFINITELY better than this place.  we went to one of them after my friend Janet was insulted by the bartender chick for asking about her drink.  i mean, lighten up -- we were standing around for five minutes!!  the band they had sounded cool -- mainly funk, jazz sort of music on a Thursday night but we couldn't stay.  when we came out of Mojito bar later, we saw them all hanging outside and heard them all complaining that they got stiffed on the pay and they were pretty pissed off.  now it all makes sense -- dingy bar, unprofessional bar people, too much competition from other good bars AND they don't pay the musicians who play at their club.  my review -- NO REVIEW.. this already took up 10 minutes too much of my time already.  for the record, there is the Grant &amp; Green bar, Mojitos and another new trendy one that plays hip-hop/lounge music across the street (sorry..forget the name -- one Long Island ice tea too many :)) all on the same street and they're ALL better places than this one!", 
    "review_date": "2007-09-04"
  }, 
  "1sGYXSkJHPhJ6wQtc-RbZw": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Kimberly M.", 
    "review_text": "Found Maggie's via yelp.. go yelp! Even when I travel you serve me well:-) Maggies was a fun pub.. good beers and ales and even ciders on tap.. live music.. fun lively yuppie crowd.. and seriously, the best waitress in the city helped us find new ales that she recommended.. Enuf said!", 
    "review_date": "2010-01-11"
  }, 
  "HjtFLeBeANVZ9FN5MPTpjQ": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Crystal Z.", 
    "review_text": "I came here for the first time on Saturday night and had a blast.  There was no cover charge, which was awesome.  I loved having the live music which was actually really good. The Rock Doctors were playing that night and seemed to mostly play 90s rock music, which I had no complaints about.  The drinks are super reasonably priced.  The only drawback is that the bar is cash only.  All around a really fun place to bust a move and get some drinks in on a Saturday night.  I definitely plan on going back.", 
    "review_date": "2013-02-19"
  }, 
  "CZU1RZavKV2fHhTvRRWdew": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen C.", 
    "review_text": "friday night - no cover, crowded young crowd all lookin for a fun time.  it was a bit overcrowded and the place could have used a lil more circulation (hate that gross warm air feeling where its like you're breathing in everyone else's body heat)  the band came up to play, and i was skeptical at first considering they were a bunch of 40+ looking dudes, but they were really awesome and made it a fun time.  only stayed for one beer, but wouldn't mind checking it out again--", 
    "review_date": "2009-06-01"
  }, 
  "oPW-LM0pXja0lDwZybXd9g": {
    "user_rating": 4.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Dmytro A.", 
    "review_text": "After gorging myself on $5 entrees at King of Thai with my friends every Thursday, we'd roll our fattened asses slightly up the hill to Maggie McGarry's for some good music and dancercise some calories away.  It never worked though, because the beer is so easy to get here.  Ya see, they have TWO bars here, which means you very rarely ever wait long for your drink.  I made a flowchart:  Minimal waiting = maximum drinking  Simple, right?  Add in the fun atmosphere and the carefree abandon with which people dance here, and you have yourself an excellent evening in North Beach :)  Oh, and it's excellently situated for bar hopping too, should you want to go someplace where you have to wait and can't show off your original choreography.", 
    "review_date": "2012-07-21"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Decent pub with two bars and lots of wood. Sitting by the large open windows is nice, however, it kind of made me wish they actually had an outdoor patio. Nevertheless, its another option on Grant for alcohol which actually doesn't stink like old beer...", 
    "review_date": "2006-10-29"
  }, 
  "W5cwxNwGiZJd393PCDQEvA": {
    "user_rating": 3.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "George A.", 
    "review_text": "After living in the City for 4 years North Beach is still the one area I hardly ever get to and don't really know the scene all that well.   I came here with some friends to catch a Giants playoff game, and I really liked the atmosphere, layout, and everything about it. Nothing really stands out about the place, but like others have said, it's a fun Irish bar. It's pretty big, and for what I guess can be considered a somewhat \"dive\" bar it's pretty clean (and that includes the bathrooms). I didn't get to experience the cover band since there was a game, but I noticed the stage and can see where it would be fun.   If I was with a group of people and someone suggested this place I wouldn't be opposed to coming back.", 
    "review_date": "2012-10-07"
  }, 
  "DfEJ5dE3GKdmc1RQg5AniA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Myron T.", 
    "review_text": "10 years at the Bow Bow's.  It's about time to look for a new place to drink and sing.  MM's weds night karaoke is very enjoyable.  Door person Jim is the best..and nice K.J. too.  Lotta good singers there and might need to wait for an hour to sing a song, which is fine.  Very nice live band on weekends too.  Only problem is their happy hours lol.....bartender seemed to mind his own business all the time.  It should have been a 3 or 4 star rating, but Jim the doorman, Nick the night bartender and th e K.J.  deserve an extra star or two.  MM got me for once a week, may be twice...I like the place.  I leeched for years here, about time to post, lol....", 
    "review_date": "2012-07-31"
  }, 
  "ZObHXI05ILUFpDo_m7DjzQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Andrew D.", 
    "review_text": "I know it gets crowded. I know it divey. I know its not the the trendiest of joints. But gosh darn it, its a blast every time I come here.   So on this drink hunt right.....We popped right across the street to Maggies. Now I've been coming here for years, which leaves me no excuse why I haven't review them before. I love's me some Maggie. Its a guaranteed riot each time I step in the door. This night being no different. We Made short work of the next clue on our Drink hunt and were off to the next local.  Two days later we show up for Santacon, and ooooh man was it saturated with holiday revelers! I'm gonna call this the closest to a dublin style pub this side of the atlantic. Well maybe I'm being a bit to hasty. Lets just say if you want a bit of ye ol' Eire in your pipe, you should come here. The music is always rock'n and the guinness is always flowing. I not sure why I've not been back to this spot. Wait, I know. It must be the gallons of beer that get spilled on my feet every time I come here. Besides that, I am, and always will be a fan.", 
    "review_date": "2012-01-04"
  }, 
  "YOg0l4LRbbNkDIneijyV5w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam D.", 
    "review_text": "I went here for a comedy night on a Sunday. The bar is split into two rooms, so if you didn't want to see the comedy, you could sit at the bar. The comedy was pretty good, though, so I'd recommend it!  The bartender was extremely nice and made everyone feel like she was happy to see them. Pretty good beer selection.  There was lots of room, including large round tables so my friends and I could sit all together.   I'm not a fan of their minimum bar tab. It's $15 on weekends and $20 on weekdays. I like to party, but sometimes I need to keep it classy in front of people and can't afford to go splurgin' all about the place.  It does, however, make you look baller by buying drinks for everyone, so that's an advantage.", 
    "review_date": "2013-11-25"
  }, 
  "6ATfXxQLQuRAQ30-nLI6Yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph F.", 
    "review_text": "Depending on the night, this place can range from a quiet, male dominated c0ck fest, to a mindblowing, nonstop raging party, complete with amazingly ridiculous cover bands.  If it's a good night, you might have to wait a few minutes outside.  Say hi to Andre the doorman before stumbling into the 2009 version of willy wonka's chocolate factory.    There's a bar about 5 feet from the entrance so you won't have to go far for your jameson on the rocks (it IS an irish pub after all).  Down that and head to the dance floor.  If you're lucky, the party already started, but if not fear not!  Just grab the nearest girl, spin her a couple times and then nature will take care of the rest.    girls + spinning + Jameson = great night at Maggies.  Sometimes they place gets TOO crowded (hence the -1 star) but if you can squeeze your way to the dancefloor, there's always room for enjoyment.", 
    "review_date": "2009-05-19"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "Friday night was Irish night, at least that was the plan.  My cousins were to paint the North Beach hood red and asked me to join them.  I hesitated, but after a nap, dinner and chillin out, I succumbed.  My cab ride from SOMA to North Beach led me straight into a Friday night out.  After a drink and a few MsPacman games at Magnet, we decided to venture into Maggie McGarry's.  We were celebrating a despedida evening for an Irish friend after her year of immersion in the States, she is Dublin bound in a week.  I liked the pub, the look, feel and atmosphere reminded me of various pubs you'd find in the outskirts of London.  Quite a few pubs in Halifax and Huddersfield indeed reminds me of McGarry's.  The furnitures and layout of the bar was so UK!  Predominantly filled with Anglo-Saxon looking patrons, yet leave it to me and my other cousin to spot the only two Rasta lookin' bruthas by the other bar.  We hang out with them, a Filipino homeboy, our Irish guests and a Mexican friend, it was the United Nations Friday night at Maggie McGarry's.  Wine was relatively satisfying, as compared to the stale glass I had prior at Magnet's.  The crowd was eclectic comprised of various forms of people, lifestyles and characters.  The service superb and consistent, from the bouncer, to the bartenders and all.  A nice cozy UK/Irish bar in the heart of North Beach.", 
    "review_date": "2007-05-28"
  }, 
  "9fg9i7ke1NAGhf8W3e97VA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth m.", 
    "review_text": "I liked this spot when it was the Lost and Found Saloon, so perhaps I am biased- but it seems that a splash of paint  has just given in a creepy vibe. The bands they have playing always seem to sound like cover bands that perform at weddings. The bartenders have forgotten my parts of my order  (is a shot and beer that complex?) or gotten the wrong beer and then they go on break while the bar is crowded and no one is there to take orders.", 
    "review_date": "2008-03-19"
  }, 
  "FNACom5kNmMt2iPCbe8KJA": {
    "user_rating": 4.0, 
    "user_location": "Danville, CA", 
    "user_name": "Todd M.", 
    "review_text": "Visited Maggie McGarry's Saturday night to see my friend's 80's band (Fast Times) play.   Bar is split into two rooms; one is cash only.  Stage is tucked in the back corner of the place and it's kind of narrow, but that doesn't stop a dance floor from breaking out.  Lots of beers on tap and a good selection of alcohol.  No food options - or at least I didn't see any.  Crowd was a mix of 20-30 somethings.  Good people watching and the 80's music kept me around while I enbibed with several beers.  Overall a fun place to go enjoy a brew and some 80's tunes.", 
    "review_date": "2010-02-14"
  }, 
  "Sj1us4wXVwSyGZmGZ7ganA": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Janice T.", 
    "review_text": "Absolutely love this little bar in the cities north beach area. Great mix of people, great live band, good times at maggies.", 
    "review_date": "2013-11-18"
  }, 
  "usHIYCMtITOtb3v_pFcHNQ": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Christine S.", 
    "review_text": "This is my favorite bar in North Beach! The live music is awesome, the crowd is down to earth and fun, drinks are good and cheap, and every time I come here I have a great time.   ....Although after a few nights of blackouts, I can't show my face here for a few more weeks!", 
    "review_date": "2009-02-17"
  }, 
  "DQhd5pXHCY8frpmU54laYQ": {
    "user_rating": 5.0, 
    "user_location": "Madison, GA", 
    "user_name": "Patrick J.", 
    "review_text": "Great Pub.   I was in town for work and was lucky enough to find this fine establishment. The Bartenders were great (Greg, and Claire), the Bar was clean , the beer selection was perfect for a pub and the prices were fair.  The Bloody Merry and Black and Tan's are especially good.  I will for sure go back - Maggie McGarry's gets an A+.", 
    "review_date": "2012-07-26"
  }, 
  "Lr-B-r-KF80yFy-2u336bw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Eugene L.", 
    "review_text": "This was another stop on our North Beach Pub Crawl. Its a laid back joint . Big Dance floor. People singing Karaoke good beers on Tap nice place to partake in a few beers.", 
    "review_date": "2010-09-02"
  }, 
  "30Pch18LE63MyRYOC34-8g": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Tom L.", 
    "review_text": "We came here on a friday night and the 80's cover band that was playing definitely made the night. They played great music and the entire crowd was really into the show. They have a good sized dance floor in front of the stage area which was full the entire night.   My biggest problem with this place were the drinks. I ordered two long islands ($12 each) for myself and a friend and both of them were incredibly weak. There is only one reason to order a Long Island, to get drunk, Maggie McGarry's seems to have missed that memo. The girl bartender at the cash bar was rude and slow even though the cash bar wasn't very busy.  The place was busy, but not it wasn't crowded to the point you couldn't move around inside. The main bar was packed the entire time and getting a drink took forever. There wasn't any wait to get in and they didn't charge cover at the time we got there (around 11).", 
    "review_date": "2011-02-14"
  }, 
  "-J_WJ0PgSCU0rV-zW_drNQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caro R.", 
    "review_text": "This bar was one of my favorite spots in the city until last Friday. Instead of the awesome band that plays 90s covers, a band called Superbad played instead. The music was great, but the lead singer was the most misogynistic ass - his frequent rants were both insulting and disgusting. If I wanted to hear a douchey speech, I'd go see Kanye. I sadly won't be returning to Maggie's anytime soon, I don't want to spend my nights being yelled at by an entitled idiot with a microphone.", 
    "review_date": "2014-10-15"
  }, 
  "qlJVwqTNPKDv91NOfi0k9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheri N.", 
    "review_text": "watch the football matches of the world here at maggie mcgarry's, be it uefa champions league, or the premiership.  i've also watched bands here, and it's always good times!", 
    "review_date": "2009-04-15"
  }, 
  "OcUC2eFhJJK9mG6K4abmXA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vandana M.", 
    "review_text": "Good times, good beer, and a great Tom Petty cover band. Minus one star for the air conditioning vent blowing cold air on my legs all night.", 
    "review_date": "2008-02-04"
  }, 
  "zpswu_OyqtF4ib1ydsCR3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy B.", 
    "review_text": "Ah Maggie McGarrys how do I love you... wait a second...  I have had several wonderful experiences at Maggies, including my birthday pre-party before going to my favorite cheesy dance bar, fiddlers green. BUT the last time I was in there, the music was SUPER loud for the all of 6 people in there and they didnt kick this extremely drunk guy out who was pawing me and embarrassing me in front of the guy I was with.   Great beers on tap, 3 blocks from my house, plenty of seating, and good music on the juke box. Will I go back... hell yeah! I love maggies.", 
    "review_date": "2007-01-23"
  }, 
  "VNkEB5PlrESiPP6-3JR-xg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janell D.", 
    "review_text": "Hey- a local pub w/ live music and no cover charge! How great does this make your Friday?! Outstanding! We stumbled upon this place last night and had the pleasure of entertainment from \"No Regrets\" - a cover band. They were actually pretty good!  There is not much seating in this place but if you're up for standing around with some good music and a few drinks its worth it. The \"double\" drinks were huge! The regular drinks were plenty strong so I think its safe to say this place is absolutely legit!", 
    "review_date": "2009-02-21"
  }, 
  "v86qehLR8bdFmvNqwi-RrQ": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Becka C.", 
    "review_text": "If the expression local Irish watering hole, could be put underneath the Maggie McGarry's sign, that would be semi true. You may feel like only locals are in this pub because of the friendly nature of the people inside (despite the tight quarters of this place), but I think it's a spin off of the excellent bartenders.  They're quick to get a drink, they're friendly when you are ordering (not scowling or looking annoyed) and in slow times, they start up conversations with you like an old friend. After you get a beer, take it out to the larger part of the bar and you'll be pleasantly surprised to see there is a tall stage and some local band or little known band is belting out for your listening pleasure.  And if at first you don't see anyone on the dance floor just below the stage, get on out there and start a chain reaction! Everyone's wanting to dance!", 
    "review_date": "2011-01-15"
  }, 
  "J0G7SAItOT4opuLSK2-tmw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody L.", 
    "review_text": "Came here last Friday night mostly because of the fantastic music that could be heard from the streets. Fantastic = recognizable songs aka usually Top 40/Billboard 100. Didn't get a drink, but had a lot of fun on the dance floor! The cover band there that night looked kinda sketchies and like old rock bands from the 70s with the long wavy hair, but they were SO GOOD and sounded like every band they covered. They not only sang the current hits (like Katy Perry's Teenage Dream), but they also sang oldies like Bon Jovi's Living on a Prayer! They were just kinda.. rude/obnoxious flirty. Saw them grab something out of a girl's hand and throw it onto the stage, and then refuse to return it to her. Uhhh.  There were a suprisingly large number of cute guys here, but the ones who were dancing were all awkward and not-aware-of  what personal space is.", 
    "review_date": "2011-08-16"
  }, 
  "b8EnjL9DwA6rNDQ9yoIwWg": {
    "user_rating": 4.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Binh D.", 
    "review_text": "Pros: Nice size, friendly bartenders and great place to go dancing in North Beach.  Cons: Narrow entrance right at the bar so it can get crowded and hard to get a drink.", 
    "review_date": "2011-05-31"
  }, 
  "hVgMjKCDMWRix-1PVDtVfg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Ali C.", 
    "review_text": "Wanted to go to a bar during my visit to San Francisco that reminded me of the kinds we have in NYC. Relied on good old Yelp for this one and it did not disappoint! My friend and I got here rather early, around 8:30 on a Saturday. Seemed like day drinking stragglers were still hanging around and the bar wasn't too crowded so we got seats at the bar. As the night went on the place got PACKED. Cheap drinks? Check. Good crowd? Check. Live music? Double check! Great spot.", 
    "review_date": "2014-02-18"
  }, 
  "q0HDybhT0V9dXrs63_WqWQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa G.", 
    "review_text": "For anyone who knows me (or not), I LOVE to people-watch. Some of the most interesting characters I've found have been in San Francisco. At Maggie McGarry's I found that the ratio of funny/weird people to \"normals\" is much higher (e.g. odd homeless Santa asking cops for money).  And the bartender; great guy. Hilarous, judging people for having shots of Jameson at 11am during a Steeler's football game. Just serve the darn drink! Heck, have one with us!  Bloody Marys are great here, extra spicy so watch out if you're sensitive.", 
    "review_date": "2010-12-22"
  }, 
  "jv1DUU_zMt5MZJiPO_PXzQ": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "James B.", 
    "review_text": "Had one of the best nights in  SF danced the night away watching the live band who rocked rocked the house Night Train you fucking rock I'll go there anytime and watch you play!", 
    "review_date": "2012-06-12"
  }, 
  "f0UBxoEUlA0CcNz5yW8d3A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly K.", 
    "review_text": "The amount of fun I have here usually depends on what sort of live music is playing that night.  It's always a fun time when the 80's cover bands are playing, especially Superbad.  Sadly, on the fun nights it's usually packed and the entrance bar area is really really narrow, which makes it awkward to try to get through.  It also gets pretty sweaty on the dance floor.  Most of the nights I've been this place was cash only :(", 
    "review_date": "2011-06-22"
  }, 
  "lLfcbYGTeVxQN5Ig0ompJg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elena N.", 
    "review_text": "Came here after going to Tope for happy hour.  The band was sooo much fun!  Great at doing the Top 40s.  We got here before the band started so we were able to grab a booth which was nice.  Keep going from the booth to the dance floor.  If you wanna go and dance, get here a little early so you can grab a table.  You'll be happy you did.", 
    "review_date": "2011-10-16"
  }, 
  "K4g2p31gIE392nZYtu0tAg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa A.", 
    "review_text": "Fun night out in North Beach! One of my close friends was celebrating his birthday after the St. Patty's Day Parade. Our first stop of the night was Maggie McGarry's and boy was it crowded! Luckily my friends were there before me and snagged a couple seats in the back, but good luck to everyone else finding a seat! It was a great crowd, not obnoxious, and the steady flow of traffic never once pushed me aside. It was great to hear live music instead of a top 40 mix.  On this night, it was cash only, kind of a bummer with only $10 in my pocket... Usually they take card. Trouble was, on such a busy night, there were only two bartenders, which made it difficult to spend it..  Overall, so-so experience; I'll probably go back on a non-holiday to check it out again.", 
    "review_date": "2011-03-22"
  }, 
  "h1JEjco-E5uJyoK32nKH8w": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Sydney H.", 
    "review_text": "Fun bar, and the excellent cover band was totally dance-worthy.  Way better than Grant and Green next door.  Delightfully noisy during the day on major holidays (think St. Patty's weekend).  They have a decent beer selection, and the mixed drinks, though bare-bones, are strong enough to be worth it.  Walking in is like hitting a solid wall of energy.  Definitely a 20s-30s crowd with a few outliers (in particular, one couple that could have been my parents' age breaking it down to a cover of SexyBack).    Unfortunately, the crowd is a little too drunk for a girl to expect to walk out without having been groped or spilled on at least twice.  The bar does its best to keep things under control without subduing the awesomeness of the atmosphere, which I appreciate.  Be warned that if you are a woman, your backside is considered fair game here after 11, and it will exhibit a disturbingly magnetic pull on the hands surrounding it.", 
    "review_date": "2010-05-04"
  }, 
  "08jfo0j-qbcs5yKefByVKQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "* was here for pub quiz tuesdays, fun but the place was deathly empty when we first walked in. a bit of a shocker and almost a deterrent if it weren't for the piles of friends that walked in and thus occupied three team tables, about half of the teams available that night * beers were reasonable, a draft stella artois was $4.50 * music was on a three song rotation between \"under pressure\", queen &amp; david bowie; a beatles hit...; and \"rock the kasbah\", the clash. great songs but just those three...? * only two of the tvs were on and in general the place felt a little quiet until about 9 or so when the quiz started but again became fairly quiet as some teams forfeited and left early. * quizzes were not too hard, it helps to be a jeopardy genius but they don't only cater to the pre-80s crowd, its a good general mix and i appreciate that.   * being a missionite i think i will stick to my local pub quizzes but didn't necessarily have a bad experience here, so i'll give maggie a good ol' 3 stars.", 
    "review_date": "2009-02-12"
  }, 
  "uNIyxmljF0IVuVEifJNQ6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe M.", 
    "review_text": "My pals were getting thirsty after trekking throughout the city in search of new sights and sounds so we pulled into the nearest watering hole in the area.  Maggie McGarry's became that spot for that perfect cold beer.  The bar was packed with football fans, a perfect combination with one of their beers on tap.  I ordered the Sam Adams while watching Tebow take down the Steelers.  His win might have been an upset, but the fans here are top notch.  While the crowds were fun, the service was just so-so but at least the joint was pretty clean.  There's lots of bars to choose from in North Beach so I might consider another the next time in the area, or perhaps make it a pub crawl stop.  Not mindblowingly fun, but not too shabby.  Food: N/A  Service: 6/10  Price: $  Atmosphere: 6/10", 
    "review_date": "2012-01-09"
  }, 
  "3HHLpfU7q4HoREEOXtt7pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "I don't know why I like Irish pubs so much...anyways, Maggie McGarry's is so fun! I love that they have a live band - usually they play 80's and 90's music but thats A-OK with me. I like that there's a band which is a nice alternative to a juke box...takes forever to have your song played! There are two bars, which is great, except when its insanely crowded, which it normally is - at least on weekends.", 
    "review_date": "2009-12-30"
  }, 
  "bJcH5UNzLCXk-pxHnwAi9g": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kayla H.", 
    "review_text": "To the Band who played on July 25th 2014 - you made my life. Not only was it my bachelorette party, but it was my birthday as well.   Thank you for getting the whole bar to sing me happy birthday, but also giving me my 5 minutes of fame up on stage. You let me fulfill my dare to a guy in the bar who would buy us all drinks if I got up there and you totally gave me hearing damage after leaving - that's how hard you rock! I will remember this experience for a life time!", 
    "review_date": "2014-07-31"
  }, 
  "zRU7MOe-x0bC9TNc6aQpGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott A.", 
    "review_text": "We stopped here on Saturday evening following the North Beach Festival and had a great time!  they had an Irish band that was ok in the beginning.  After the band they played so many great songs.  The bartender/owner was playing the music and she was playing a lot of old songs that everyone knew and loved.  The drinks were flowing like water and the service was very afst considering how crowded it was.  We got a great spot in the back bar right by the open window.   What a BLAST!!!", 
    "review_date": "2007-06-18"
  }, 
  "WYd_PMTrnT8zAUlFR9Pr4Q": {
    "user_rating": 1.0, 
    "user_location": "Henderson, NV", 
    "user_name": "Mary V.", 
    "review_text": "Worst service of my life. The bartender was  hostile and rude the second we came in.", 
    "review_date": "2014-02-22"
  }, 
  "I-4TLojynEMylzQwGZcJSA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn H.", 
    "review_text": "My favorite North Beach night club so far (though it's also a bar/pub at times).  Also a great spot to watch some Premier league soccer during the day.", 
    "review_date": "2009-02-27"
  }, 
  "aAoacHNwqlpjGGnS82LxMw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kayan H.", 
    "review_text": "Super fun place! Two rooms, always packed. I've been here on 3 or 4 different occasions and each time the cover band was awesome. Favorite was hands down the ACDC cover band though. Door guy is funny. Come for fun, rowdy time!", 
    "review_date": "2011-07-10"
  }, 
  "xMTmf2rJZsvqPZmM36-lMw": {
    "user_rating": 3.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Hanna Y.", 
    "review_text": "Got there at 11.  Live cover band playing recent pop/rock songs.  Music was awesome but 1) they only take cash 2) when a really good song is playing the crowd will jump up and down...folks that come here have no care about the people around them and will jump onto your feet w/o an apology 3) A beer on tap was $10.  So with tip $11? We ordered a Stella.    Pretty crowded by 12 with increased craziness.  You could feel the dance floor shaking as people jumped and stomped on the floor.  Loved it!  Tables were located closer to the bar where it was open seating - a definite plus.    Would I come here again? Eh... probably not.", 
    "review_date": "2011-02-20"
  }, 
  "yfq4INlwaC8dyX6tpwSqrw": {
    "user_rating": 4.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Dee H.", 
    "review_text": "Laid back bar with a good bartender/owner. Wine is not so spiffy but drinks are made well and the vibe is good. Sports on tv and not crowded on Thursday nights.", 
    "review_date": "2012-02-11"
  }, 
  "XiVlH054UZ3A964ZIrBkPg": {
    "user_rating": 5.0, 
    "user_location": "Davis, CA", 
    "user_name": "Devon S.", 
    "review_text": "I have this theory about a person's presence in a bar...when it comes to going out at night, you ARE a special snowflake. For example, when I walk into a place, I like to be the only excessively tall blonde (ETB). It's my niche and should there be a guy who likes ETBs, I fit the bill and I serve my purpose.   It's an interesting situation when another ETB shows up. In my head, I imagine it playing out like this: <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DSWhhPWyWCv0&amp;s=653de2074f39597180508590b94467eb20eabadf5a604a7902d9663ae7a584ca\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=SWhh…</a>, but in reality I casually walk by her and decide whether or not I am a) taller or b) blonder. This exact scenario acted itself out at Maggie McGarry's Saturday night but I proved victorious when I realized my adversary was a) wearing heels and b) a bottle blonde. Win!  Even if I had lost this competition (which rarely happens because I'm the human equivalent of Gigantor), I'd still think this place was pretty rad. The live band rocked, and I can't help but dance when I hear a great cover of \"White Wedding\" shaking the walls of the bar. For $15+tip I got three strong vodka redbulls, and they were served quickly by a chick with an enviable Irish accent.   This was also the bar where last fall my female roommate realized that not all girls are born with brown nipples and that pink nipples do exist. Five stars for quality music, tasty drinks, a lack of comparable ETBs, and being a great place to learn about anatomical variance in the female gender.", 
    "review_date": "2009-05-04"
  }, 
  "N7wNXF_Bvv1H7eAgK7MXuA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Emma H.", 
    "review_text": "Best new place in SF to watch EPL games!  So I'm now officially an Arsenal fan...British \"football\" is a favorite of my boyfriend's and now I'm sucked in (EPL=English Premier League...hey, I never knew until this year...)!  Sometimes games are played on Fox Soccer Channel (which we get at home) but more often they are on Setanta, which Maggie McGarry's now offers!    We checked it out on Sunday...midday...no, it wasn't quite noon yet...Oops!  The bar itself is great--tons of seating, spacious and really CLEAN for a bar that rocks until late night, being next to Grant and Green!  The bartender, Patrick, is hilarious and knows a ton about every team being routed for, and just likes to get to know the locals (which we are).    Great selection of beer on tap (some good British ones) and obviously a quite complete bar...  Check it out, especially if you are a soccer fan!", 
    "review_date": "2007-08-20"
  }, 
  "Mj_vJCM40HyqLhwoBJjq3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mercedes F.", 
    "review_text": "I have never been treated so great, the guy Mick was amazing the way he handled the crowd was unreal he was like a magician pulling drinks out of no where, and with the most amazing smile and beautiful blue eyes at the same time. And he really knows how to treat  a real lady with class...........we love you Mick", 
    "review_date": "2014-04-01"
  }, 
  "PaOJnFRprpdfTnsX-5k8UQ": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Eric P.", 
    "review_text": "Alright, it may be the fact that I was severely inebriated before I arrived (it was my birthday, gimme a break..), but this place is freakin' awesome! Walked over after having dinner in North Beach and it was pretty busy. We pushed through the crowd to get to the bar, got our first round and made way to the next room over.  We were hangin' out and drinking and talking when all of a sudden... the freakin' wall opened!! I had no idea what was going on until I spotted the band. Unbelievable! The band wasn't bad. I have no idea what their name was otherwise I'd give them their Yelp dues... cover band that did a lot of Nugent and CCR... anyway.  Young crowd, good drinks, awesome wall openingness. All pluses in my book!   If there's one knock on this place, it's the fact that there's a bottleneck of people as soon as you walk in because of the placement on the bar. Not a huge deal though.", 
    "review_date": "2011-09-26"
  }, 
  "O2qAlgUHKft3Lm-hPqO7rA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jessica C.", 
    "review_text": "My friend had his 30th birthday here, which was a great evening. I love how the painted walls in the second room push back to reveal a stage. Totally unexpected for my first visit, and the live music was awesome. When I arrived here recently during the North Beach beer run, the bartenders were still in good spirits even towards the end with dozens of drunken people yelling. That says everything for me.  This place is also fun and relaxing to watch football (American and non-American) during a lazy weekend. Overall, Maggie McGarry's is chill and a refreshing break from tourist-ridden Columbus Street.   Check it out.", 
    "review_date": "2007-10-03"
  }, 
  "i2KocsDcufoW5PNi_1LJnQ": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Dan M.", 
    "review_text": "Maybe I'm just getting old and turning into a crotchety old man, but is it necessary for this place to have thumping bass levels for their crappy 1980's but the guys are 50 cover band? They easily crushed it with the large boned housewife groupies in the audience, and certainly for the married (or philandering) couple at the bar, who couldn't stop making out the whole night. I couldn't talk to anyone in here, it was packed, and i continually felt like I was being stared at (not in a gay bar kind of way either). Glad I had one overpriced Bud here and got out and never will return. Unless said cover band plays some Guns N Roses or Lynrd Skynrd's Simple Man...because then, maybe I'll make an exception.", 
    "review_date": "2013-07-09"
  }, 
  "sBf5IfUPxTowTdUebPZVTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie K.", 
    "review_text": "Two Bars which makes for getting your drink faster. They had a live cover band that played a wide range of music, all of which was conducive to singing and dancing. Overall a good casual place to go for drinks, not much seating available and the place was pretty packed by 11:30 on a Friday.   Bar is Cash Only - Major downfall.", 
    "review_date": "2012-08-18"
  }, 
  "m8MJExtPpHlg35S1e905nA": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Madeline M.", 
    "review_text": "Love this bar with their 80's cover bands especially Superbad!! This band has been entertaining Maggies clientele for 8 years always getting great praise &amp; compliments for their great style! Lead singer puts on such a show &amp; there is no cover on the door ! His act is all a show solely for entertainment purposes he's actually quite a reserved gentleman!!! Go Maggies! Go Superbad! Go Giants!!", 
    "review_date": "2014-10-18"
  }, 
  "VpA9rglOpm_vEHtz4tH_KQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea S.", 
    "review_text": "I'm a huge fan of Maggie's! I have to say I prefer it during the week sans the frat boys and Paris Hilton wannabes but that's just me! Wednesday night Karaoke is definitely a highlight! Great singers are few and far between but the mediocre and passionate are in great supply! If you have a song in your heart and need a little liquid courage in order to share it, Maggie's is the place. The staff have always been attentive and friendly. The locals are also friendly and definitely a lively bunch of characters.", 
    "review_date": "2010-02-20"
  }, 
  "tfhEXLWR095lF9VlVKM8TA": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Brendan A.", 
    "review_text": "Worst experience with a bartender I've ever had. I asked for a tequila cocktail and it was made way too sweet. Didn't realize she decided to pour me a $20 drink until I asked to exchange it. At that point, she said no exchanges or refunds though I had barely drank it. When I contested, she grabbed it and poured it down the drain, and told me to leave. I'm not even drunk. Just flabbergasted.", 
    "review_date": "2014-02-23"
  }, 
  "XxDPzTC-w1UucRUSoxW-bg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "April D.", 
    "review_text": "I like this place a lot. Just stumbled upon this place on Pub Quiz Tuesdays, and boy was it fun. Pub Quizzes are such a good idea at a drinking institution. Me and my friend teamed up with two really cool guys, and we should have won that free booze.  Steve is my favorite bartender! He makes really good \"chocolate cake\" and \"soco lime\". And he'll drink with you, which is awesome. He constantly fed us drinks, and made sure we left on a good note. It was soo good that I was hugging the toilet the next morning.    I don't go to a lot of pubs, but this places has high marks in my book for one really great pub experience.", 
    "review_date": "2009-02-04"
  }, 
  "dr1ks8YlVN48oGzAf4fo_g": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "George M.", 
    "review_text": "My favortie bar in north beach hands down.  Live music on Fridays &amp; Saturdays with no cover charge is a huge plus.  As well they have two bars, which for the size of this place is perfect.  Every time we go here I end up running into old friends or making a few new ones.  This place has a great vibe &amp; hasnt let me down yet - keep up the good work", 
    "review_date": "2009-10-19"
  }, 
  "vjKo265gMl01lhqg8fCylA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Boris C.", 
    "review_text": "I always debate with myself whether to ever give a poor review. I'm a big fan of supporting local business, but then again, the whole point of yelp is to provide honest opinions about establishments, and the real duty is to the reader, not the establishment.  I went with some friends to Maggie McGarry's after seeing an ad for it on facebook on a Wednesday night to see KJ Paul for the first time. Given that North Beach has few Karaoke options, I wanted to support keeping these events alive with fun people, buying lots of drinks, and tipping like there's no tomorrow to show our appreciation. KJ Paul has some association with Glenny Kravitz, one of the best KJ's in the city  (Tuesday nights at Amnesia is the bomb!), and so, that was enough for me.  When we got there, the place was absolutely dead, everyone being next door at Grant and Green where things were hopping. (we were there as well, but wanted to do some karaoke after seeing some great live music, though given how dead it was, it took some convincing to get my friends inside)  Slowly things got going, and everyone was having a great time, with some awesome BEP,  and some cheesy karaoke antics (dancing, sing-a-long, cheering, etc). People started coming into the bar, to join the fun. But, all of a sudden no one was being called. We figured the KJ went to the restroom or something, and then after about 5 depressing songs, everyone in the bar was like WTF?  Someone said some people were being too rowdy. I didn't see it, but it would be nice to exit those people, and keep things going like any normal place would do. Why the collective punishment?  Then the explanation was that it's in the KJ's contract to take 20 minute breaks. I've gone to nearly every Karaoke place in the city, and never have I seen a KJ take a 20 minute break. Glenny doesn't do it, Purple at Jacks doesn't do it, Encore doesn't do it, The Mint doesn't do it, Festa doesn't do it, no one. No one bought it. One is that it was over 20 minutes, and two, it was obvious from the discussions that it was just an excuse to make people leave.  Or if it was true, it's completely a lame policy.  My feeling is that it's better to talk to people and explain the problem. At Encore, for instance, they have house rules (no singing out of turn, no swinging the mic, etc. none of which I saw happen here), and they'll just tell people, and people will follow them, or be exited, no fuss no muss. The show must go on!   Several patrons tried to talk to KJ Paul and the bartender sincerely in order to save the evening, since no one really wanted to leave. But no dice. After the third depressing Sinatra song, various groups couldn't take it anymore. They got the message. The place emptied out completely. It was as dead again. Some wanted to stay, but it was clear the party was over and it was hard to understand why.  Really sad. I don't know if it was KJ Paul or the Owners.   Several people had put in multi-dollar tips after putting in their song, and left them. I saw lots of people tipping for drinks as well. That to me shows complete lack of appreciation.  In the area, the other option for Karaoke is Bow Bow, which has always been fun when I went, though a bit cramped. The other bars we had fun at included Romolo, Grant and Green. After Maggie's we went to Gino and Carlo where we had fun with the jukebox and pool. Those guys were cool.  Sorry, North Beach has no shortage of options, so I'll take my patronage where there's no collective punishment or other nonsense.  Maybe it was an off night, but it's hard to muster a desire to find out.", 
    "review_date": "2010-01-28"
  }, 
  "7tEUgFoRzy_TkOgzPQzCkA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer T.", 
    "review_text": "Large bar with 2 rooms = 2 bars and a stage.  Clean, comfy, fun, drinks are priced average and even though the bartenders are typically a little grumpy, I have fun when I come.  Only real negative: Absurd bottleneck situation when you're trying to get from the front door and passed the first bar into the 2nd room.  They really should open both doors or not allow stools on music nights.", 
    "review_date": "2012-02-16"
  }, 
  "1XLiW-xgvoD8RgVBdKzn2w": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Sarah K.", 
    "review_text": "Never been to this bar after 10 am, but if you are an Arsenal fan, this is the place to be. They play all the big games (not just Arsenal) and the atmosphere is great. There's no food, so if you're in for an early game, I suggest grabbing something and bringing it along - Cash only bar.  Learn more here <a href=\"/redir?url=http%3A%2F%2Fwww.bayareagooners.com%2F&amp;s=2b2d82a81ebfa1a5aa558d874209d43608f7e469008e0885d1928cad02e8eaa8\" rel=\"nofollow\" target=\"_blank\">bayareagooners.com</a> See you at 7am for a guinness!", 
    "review_date": "2009-10-07"
  }, 
  "t5AFrfee1pFSgVQ8Bb05Ug": {
    "user_rating": 3.0, 
    "user_location": "Newark, NJ", 
    "user_name": "Diane S.", 
    "review_text": "I was all but attacked by about 5 Irish guys while I waiting for the friend I was meeting to arrive. Hmm...good seating and fun music...had cider on tap which was nice so I could drink a beer-type drink in this pub-type place. I felt like we could have used a deck of cards...I'm sure I'll go back as it's walkable, hoping for a bit more of a crowd next time. Really nice new decor inside- love the lamps!", 
    "review_date": "2006-08-16"
  }, 
  "aea3PTk1cMMV7UTh9HXINA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sammy S.", 
    "review_text": "Me Likey! But me also got way too drunky. Ok, I can't put my drinking stupidity all on Molly McGarry's (and isn't it Maggie McGarry's?) because it really only started there and progressively got worse after each bar I visited. But this place has a very sweet atmosphere. It's new so the lighting is nice, the blond wood is pretty and not stinky/sticky yet, and there are lots of seats. The bartenders are on top of their game and never keep you waiting, which is always nice when your goal for the evening is to completely destroy your liver. And they have entertainment! At first I thought it was a jukebox playing in the background, but as I paid closer attention I realized that one man was playing guitar and signing all sorts of great cover songs. Two thumbs up to Molly/Maggie's. I live in the neighborhood and after one visit, this will now become of my regular bars.", 
    "review_date": "2006-09-11"
  }, 
  "VmlShd8k2tq7-O4TVx5R1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carol Y.", 
    "review_text": "Cool place to hang out  No cover charge  Drinks are cheap -- parton soda + rum/coke = $17   Laid back feel. Super casual.   But CASH ONLY :P   i like the fact the place doesnt look big but there are plenty of room to just stand or sit. and best of all there's a stage! so when there are live bands they open up the wall which creates a bigger dance fllor.  Would definitely come here again.", 
    "review_date": "2012-08-07"
  }, 
  "pgHCj7DSqI8NWx7WucnH3w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew S.", 
    "review_text": "Maggies is right down the street from me and never seems to disappoint. Always a good mix of people and a good set up with the main bar in the room opposite the dance room.  The bartenders serve pints (actual PINTS!) and have always been good. I think its cash only though. They usually always have a live band playing on the weekends (usually playing Sublime at some point in time).  I'm a fan.", 
    "review_date": "2009-03-31"
  }, 
  "Re0D5snuHFN9ycAfC-aglA": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Michael H.", 
    "review_text": "Nice bar filled with attractive people, but CROWDED!!! Either the bouncer was unfamilar with SF fire code or he is paid by the head.  It got to the point that I had to leave which was unfortunate since I otherwise liked the place. Would like to return to watch games on Sunday. Oh, and be careful for 20 something douchebags who are offended when you try to get past their \"crew\" to use the washroom.", 
    "review_date": "2009-11-16"
  }, 
  "fguoAI3ftbO_GFvB1L3iew": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Tatyana S.", 
    "review_text": "Maggie McGarry's is the place that introduced me to Fernet Branca. I will never be the same. After this magic beverage I could not only forget its name, but also forget the reason I went to that bar in the first place.  The place is half bar half night club with live music. The band that was playing was actually great  - The Gigantics. I even got an autograph on my arm by the lead singer, when exhausted he sat by the bar before the closing.   The bartenders are very courteous, polite (can't imagine how they do it in that line of work) and cool. I wish I could keep my cool like they are in the most unpleasant situations. Like when a drunken patron suddenly starts smoking in the middle of the establishment. Or when drunken patrons suddenly start losing hold of their glassware and dropping it with an eardrum-hurting sound to the floor.  I salute all the bartenders, girls and boys! Be cool!", 
    "review_date": "2009-05-18"
  }, 
  "puS8HuNdeXhhl5F4bb0EEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam S.", 
    "review_text": "Always be ready to NOT find parking at this area.  We went around like 5-6 times to no avail.  If it weren't for the nice guys who let us park at their driveway, who knows if we made it to this bar.  9:30 and it's crowded. Love it! They were playing top 40 at the bar, neat!  We started to move towards the stage and dance floor once the band started playing.  They were actually a fun, cool band.  Looking at the website, they call themselves Johnny Vegas and the High Rollers.  Good entertainers indeed.  I'll come back here definitely.", 
    "review_date": "2010-09-19"
  }, 
  "Rq8m7cL8SG7mYgNvOXq80w": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Marine B.", 
    "review_text": "I'd say the bar is average - good beer selection, average prices ($5 for a beer / cider after happy hour) and lots of sport TV channels. Also lots of space to sit down, which is great.  However, you have to come on a Wednesday, Friday or Saturday night. They have free shows from local music bands playing a mix of classic rock and their own songs, and everybody is dancing. You can find people of 20 and of 40 dancing together - it's really fun!", 
    "review_date": "2013-08-24"
  }, 
  "o0_HPz4Gtr0u_y1L7y8zmw": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Sophie E.", 
    "review_text": "I went here for a friend's birthday and I loved it! There was a live band playing 90's rock and there was a mini dance floor in front of the stage. My friends and I all had 80's outfits on for her themed party bus which might have added to the extra fun haha. But the band was cool about it and let some of us dance and rock out on stage with them.   My complaints would be that the place got incredibly hot. The bar wasn't that big, so you had people rubbing against you. Also, the drinks could have been a bit bigger (but they were strong so it made up for it). Otherwise I'd definitely recommend this place to a friend and I can't wait to go again :)", 
    "review_date": "2009-04-28"
  }, 
  "ELc2M96tMEomAhPz23zH9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alicia A.", 
    "review_text": "The first time I came here, I was celebrating my birthday and... well, I don't remember it too clearly.    We came back on a Wednesday and had a great time.  The girly special was $5 cosmos.  Big, strong cosmos.  The owner of this place is totally hilarious.  The whole time we were there, he kept telling us how big the drinks were and that they were a really good deal and how did we like them?", 
    "review_date": "2006-08-25"
  }, 
  "5j0QmE-ktdY2wfEYX2YStA": {
    "user_rating": 4.0, 
    "user_location": "Otford, United Kingdom", 
    "user_name": "Amy W.", 
    "review_text": "Great bar, awesome barmen/women .. they pour the best guinness. Brilliant music selection ... everything from old chilis to the who .... interesting art on the walls .... cool rest rooms ...... lots of space .... in true Borat fashion ... NIIIIIIIIIIIIIIIIICE !", 
    "review_date": "2007-02-22"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "Maggie's is always a fun time. Live music, centrally located in North Beach and next door to Grant and Green. I like the set up of the bar: broken into two sections with the front of the bar being long with lots of seats, and a back area with another smaller bar and tons of seating and a dance floor.  The bouncers are always nice, a ton of people show up so it has the potential to get rowdy, depending on the night and the music, but overall it's a decent place to get drinks, more of an end-up than a place I'd go for an event.", 
    "review_date": "2014-12-15"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "I like live music. I like fun sing-along music. I like strong drinks. I like bartenders who don't laugh at me when I order shirley temples with vodka in them. I like Maggie McGarry's.", 
    "review_date": "2009-01-31"
  }, 
  "B3SyQdSwe696c5OXvCPiFg": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "dj pie b.", 
    "review_text": "the bartender at this place shut down their karaoke tonight because our group was 'too rowdy'. the place was practically empty when we got there at 9pm on a Wednesday, but somehow it was not ok for our group to be excited about karaoke or dance to people singing on the stage. we didn't break or spill anything or bother any other patrons, and we were buying plenty of drinks. never going back there.", 
    "review_date": "2010-01-28"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "the bartender was a b*tch here on wednesday night, if you HATE your job, QUIT!  three stars because one of my douche bag friends is a regular here.", 
    "review_date": "2008-09-26"
  }, 
  "bG6DkJKwhKMMQ0Z3GSOpmA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete J.", 
    "review_text": "Everyone please flip your sarcasmeters to the ON position. We're about to get started...  \"When you're at a bar, &amp; said bar gets so crowded &amp; packed-to-the-gills that people can't really move, a good thing to do is for everyone to stand in one place &amp; not leave even the slightest bit of an aisle for people to commute through. And then when people walk up to them &amp; say 'excuse me can I get through', a good thing to do is ignore those people &amp; make them push, then glare at them. They are clearly losers. Nobody should ever have to use the restroom in a bar. If you don't hold it, you're a pussy.   Also, nobody is here to talk to their friends. They came for the music. When the din of conversation grows too loud, a good thing to do is turn the music up louder. And whenever people raise their voices to be heard over that increased volume, just turn that knob up to 11. Really, nobody will be annoyed that the speakers are crackling &amp; straining. Nobodys ears will ring when they leave, unless they're pussies. This is motherfucking OASIS, &amp; Oasis was meant to be BLASTED!!!\"", 
    "review_date": "2007-06-16"
  }, 
  "jOP-fnqoNI06w2UJ5lPNNw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristin B.", 
    "review_text": "This place gets 3.5 stars. The drinks were strong dogs, and the waiters were efficient and friendly. Pretty good pub atmosphere overall. My only complaint is that the bar itself can get pretty crowded and its lacking in the music department. Its a pretty good spot for a party or gathering of friends since there are tables and its not deafeningly loud.  Fun spot, mellow, but nothing particularly spectacular.", 
    "review_date": "2007-04-23"
  }, 
  "bkZ4NzsWMZtmEQVGjZn48g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed B.", 
    "review_text": "I stopped into Maggie McGarry's during NB Jazz Fest this past summer.  It was a breath of fresh air after the other spots we'd been to that night on Grant St.  Its a nice clean Irish bar.  Good, down to earth staff and prices.  Its not a place I'd go out of my way to hangout at, but if I was in North Beach and wanted a good Irish Bar I'd stop by and grab a pint again for sure.", 
    "review_date": "2008-01-11"
  }, 
  "91-WOFREtYKDIwzkFU9R-g": {
    "user_rating": 3.0, 
    "user_location": "Ann Arbor Charter Township, MI", 
    "user_name": "Adam C.", 
    "review_text": "Here for the US World Cup game. Great crowd and awesome for watching sports. The bartenders are quick and efficient, and the drinks fairly priced. You will get a young and raucous crowd here, but it is great for a night out, day drinking, or cheering on the US in Brazil.  They often have live music and happy hours. Stop by when you are out in North Beach and you won't be disappointed.", 
    "review_date": "2014-07-01"
  }, 
  "6_te5kIQkAspR-kHhHu0ag": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mike T.", 
    "review_text": "Came here Saturday night,  6 September 2014... Had an awesome time,  met some very funny people...  Mark,  Dana,  Steven,  Miles...  Phoebe the bartender was awesome,  great to talk to and very entertaining...  Saw a bit of a freak show at the end of the bar...  Made for a very fun evening...  Five stars....", 
    "review_date": "2014-09-06"
  }, 
  "0mmu5ME29Y8vLr9wyEvTKQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey V.", 
    "review_text": "The few times we've went out here I've never been particularly excited to go, but we always end up having a fun time. There is very rarely a cover, so that's great. There's live music a lot and it's always fun to dance to. There are 2 seperate bars so it's never a long wait for a drink. The've got some tables that we usually end up using as a crash pad for a rest after dancing. The crowd is hit or miss, but I think that's pretty typical with North Beach. There are sometimes great pep's here, locals etc. Othertimes the b&amp;t wanders up from broadway or you get a lot of tourists so I guess that's my only complaint. Overall, a very good place to go out on Grant compared to the surroundings.", 
    "review_date": "2009-02-01"
  }, 
  "eBnToKDLoXxQvpwY6s5UdQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joy Y.", 
    "review_text": "meh...not too impressed very average....might be a better weekday bar...", 
    "review_date": "2006-08-20"
  }, 
  "hRt0yvtG_mMvNgi7jYia-A": {
    "user_rating": 4.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Rachel B.", 
    "review_text": "It was pretty easy to get a drink and had a good amount of space. $5 for a beer. Good music from an 80s cover band and room for everyone to dance.", 
    "review_date": "2008-09-01"
  }, 
  "qy2RkoEwPk0dPTPSjpNZ-Q": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Lauren J.", 
    "review_text": "Maggie's is the home of the Bay Area Gooners, the SF Arsenal FC fan club, and a new home away from home. I've been coming to Maggie's now for two seasons to support my Gunners and really enjoy the environment and mix of people who show-up for the matches. If you enjoyed the World Cup this last year and are interested in grabbing a drink at 7am on a Saturday, yelling profanities in a fake British accent (in my case) at the TV and watching a damn good futbol team with a group of lively and like-minded sports fans, then Maggie's is the place for you!  Check out: <a href=\"/redir?url=http%3A%2F%2Fwww.bayareagooners.com&amp;s=7471ae79fba40c5339cf352af1d60f38bb6e45b2255edb3c771ba5d4c58af538\" rel=\"nofollow\" target=\"_blank\">bayareagooners.com</a> for more info about the SF supporters club", 
    "review_date": "2010-12-05"
  }, 
  "eAPxR9W0m8SmLElL27_ChA": {
    "user_rating": 1.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "amy b.", 
    "review_text": "GREAT live music on the weekends, weak drinks and crabby bartenders.  Go for the music.", 
    "review_date": "2009-06-15"
  }, 
  "tFXx4VPI814wJLb4RHGoRg": {
    "user_rating": 1.0, 
    "user_location": "Lodi, CA", 
    "user_name": "Casey S.", 
    "review_text": "1star", 
    "review_date": "2013-11-03"
  }, 
  "8EDXjSXCfdG5nkxzb5V1JA": {
    "user_rating": 4.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Gloria J.", 
    "review_text": "I came here on a Wednesday night, visiting one of my good friends in the city, and I have to say, it was an awesome way to end the night. I had my very first Irish Carbomb here, along with a couple others, but don't worry, I remember enough to review ;) Wednesdays are karaoke nights, and they have a surprisingly good selection of songs. I'm a bit new to the bar scene (just started drinking when I turned 21 this year), but I'm a good enough judge of knowing when I'm having fun, and I was definitely having fun. You could tell who the regulars were, and I felt a bit young having been the only person to sing a song from the past two decades (Cee-Lo Green's \"F*ck You\"? I was all over that like jam on toast) but even with the people who had clearly had more than I did were having a good time.  I give the place four stars for definitely delivering on the entertainment.", 
    "review_date": "2011-08-06"
  }, 
  "EXUypc_YLsWfVGtSFOPyIQ": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Irving B.", 
    "review_text": "Pros: Live free music, good size venue, and good service.  Cons: Not all performers are the best.  Experience:  I had an amazing time here on a Saturday night when a cover band was playing. They were playing some pretty great popular songs. The drinks were strong and on point.  Conclusion:  I definitely recommend this place for a night out with friends!", 
    "review_date": "2014-06-29"
  }, 
  "9lVnk6CGKsRG4KQjZR_DDA": {
    "user_rating": 4.0, 
    "user_location": "South Lake Tahoe, CA", 
    "user_name": "Jack M.", 
    "review_text": "Lots of fun,,, I kinda just ended up there. Good music, great service!", 
    "review_date": "2009-02-13"
  }, 
  "a3LavpLZ-rKG7xn1mQJgTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara g.", 
    "review_text": "I have lived around the corner from this bar for years and i only went for the first time last friday! it was great the atmosphere was great and the bathrooms were clean, and there was a great band with no cover! the place was very crowded tough and it was hard to move around. but i guess that just shows how great a place this is!", 
    "review_date": "2011-04-19"
  }, 
  "kxsb-JnGC2cP94KnNX1uaw": {
    "user_rating": 4.0, 
    "user_location": "Westlake Village, CA", 
    "user_name": "Greg M.", 
    "review_text": "Cool bar, awesome stage and light set up. The Deltaz were playing when I was here. Cool door guy and bartender.", 
    "review_date": "2013-01-06"
  }, 
  "3Byya85aJ3JO-tZeyZTd7Q": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christine K.", 
    "review_text": "I've been here a few times before and usually had a pretty good time. Nothing takes me back to college like drinking beer and singing along to a live cover of \"Livin' on a Prayer\". (Not that normally get the urge to feel like I'm in college - but it is fun every now and then.)  HOWEVER, my last experience here was less than enjoyable. (Although, I was considerably less inebriated than my previous visits here). Almost immediately after arriving, I grabbed a beer from the bar, and although I saw the sign that said $15 minimum, I figured we would stay long enough to have more than one drink. After realizing how crowded, hot, and stuffy the place was, my friends and I decided to leave. I went to close out my tab, and the bartender told me my tab was at $5, but since there was a minimum she had to run my card for $15. Now, as a former employee of a credit card company, I know very well that Visa &amp; Mastercard both prohibit merchants from charging minimums... so I told that to the bartender. She insisted that she couldn't run it for less than $15. Not true. Not wanting to argue any more, I ordered two more beers and shared them with friends... ordinarily I am a generous tipper, but since she lied to me I left her nothing. I don't mean to be the credit card ethics police, but I've been in the same situation at other bars and they've broken their ethically-challenged policy for me.  In the future I'll drink at places that don't make me spend more than I want to.", 
    "review_date": "2009-07-20"
  }, 
  "1dW1kLdcKuQprnhi4pC_iQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Séamus C.", 
    "review_text": "I prefer Maggie's on a week night rather then a Friday or Saturday crowd (if your local, you will know why). Great medium sized bar in the heart of North Beach, Where locals and transplants can mix it up. I think there live music is only on Thursday / Friday &amp; Saturdays", 
    "review_date": "2010-10-25"
  }, 
  "ROu0frA1iRnFd-fNBHbKbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle W.", 
    "review_text": "The Iadies on Friday and Saturday nights are the best. You won't find a  better bar in north beach. Live music, fairly priced drinks... Amazing.  Claire, Phoebe, and Fionnual bust their ass to get drinks out. After 10 it gets filled  so show up early.  If your going to NB  this is the only spot!", 
    "review_date": "2014-03-14"
  }, 
  "XwRC5Jqlz4bg1loB2EmlGA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Jose M.", 
    "review_text": "Great vibe! Not too loud to have a conversation, but super lively. Great beers on tap, too!", 
    "review_date": "2014-02-16"
  }, 
  "8-cYaX4GPkH3EtEeGfVNIQ": {
    "user_rating": 1.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jared M.", 
    "review_text": "So I walked into this trash heap unwillingly because of some friends of friends in some post college fraternal like group of guys in SF reminiscent of the Tri-Lambs. Once inside I soon realized I had entered what I could only imagine to be the worst place to be on a Friday night.   The live music was a nuisance more than enjoyable and it was very crowded (seems many got suckered into coming into this dumpster).  It is cash only (technology has not yet caught up to this establishment) and it seems as if they only clean this place once a year judging by the stench.", 
    "review_date": "2009-08-12"
  }, 
  "Byo0hbnRlg0pRTUpZDYJfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean C.", 
    "review_text": "So, I came here after wiggin' out at Grant and Green for awhile next door. There was a dude in a tan leather suit on stage with a pink boa. Hell yes my friends. Hell yes. This was like a leather leisure suit. Like from the movie Vacation. Like epic.  Anyways, the crowd was sort of all over the map - some tourists, some locals, some fatties, some (ok few) hotties, but everyone was dancing. The bartenders and the bouncers were quite nice. The leather man was selling that shit all night too. There were other people singing into the mic, there were people dancing with him, there was like...well...just a very SF party going on there for North Beach. The music was maybe a touch too loud, but whatever. You should be coming here to dance, not to talk :).  I wouldn't hesitate to go back here again if I was in the 'hood and needed some place to wig out.", 
    "review_date": "2010-07-05"
  }, 
  "EAohlmCYSdDev0F_hTQuIg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie K.", 
    "review_text": "What a great place to watch live music and enjoy reasonably priced drinks - WITHOUT A COVER!  I've enjoyed a couple of really fun nights here rocking out to 80's music. The layout makes everything feel ridiculously uncomfortable - but if you can find seats in the back you can avoid all that (unless of course you have to go to the bathroom).  But be prepared, the back bar is cash only!", 
    "review_date": "2011-03-31"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "comfortable and friendly....screens to enjoy the game or catch a tv show....a good local vibe...no frills...just all bar, beers on tap and stiff drinks.....mostly wooden bar stool seating with few table seating for the larger bunch....  quaint pub to sip an after-work brew....guiness and various beers on tap...$5 a glass....stiff mixers for little more change....", 
    "review_date": "2007-03-30"
  }, 
  "jfyBHSgBWKDa51nO5js5pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kim L.", 
    "review_text": "Came here as the last stop on a St. Paddy's weekend pub crawl. It's your basic Irish bar, not much else to say. I've heard they have live music, but there were no bands when I was there, so I might have to come back some other time for it. Irish car bombs ran $10 a pop, a bit steep for my tastes.", 
    "review_date": "2011-03-14"
  }, 
  "-r48DjK82rsDovIZT38MUw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Crystal D.", 
    "review_text": "how do you review a dive bar?   do they serve a plethora of alcohol and beer? yes.  do they have bar stools? yes.  are the restrooms clean? its a bar, i don't they are supposed to be clean.  can you meet people there? yes - this depends on what kind of people you want to meet.  do they have live music and a small crowded dance stage? yes - an attribute i consider to be a step above your normal dive bar.  does this sound like your cup of tea? yes - then visit this establishment on a friday night. no - go someone else :)  i will add both times i've come here it was for a b-day party where half the patrons were SCU alumni - make things a bit repetitive when everyone you knew in college still hangs out at the same bars expect now in SF.", 
    "review_date": "2010-04-01"
  }, 
  "PKUW9VOkdAs-FOFt0KlibA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexia A.", 
    "review_text": "I happened to end up at this spot for a good hour, then dragged to another spot, but I wish I had stayed in here. This place is set up a bit weird. Somehow on the left you got a bar, then walk a few steps and you are in a different place with a stage and another bar. This is especially great so you don't have to wait too long to get a drink. Overall this is a complete party atmosphere.", 
    "review_date": "2012-09-10"
  }, 
  "F5PeWdJZqT8BAQD7LnY6_Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Grace P.", 
    "review_text": "This is a pretty fun bar I north beach. There's usually live music which I'm generally a fan of but I've never heard anyone really great there but the atmosphere is still fun. The other downsides are it's kind of out of the way and generally very crowded. But if you do make it up to the neighborhood and feel like dancing to live music this is a good place for it!", 
    "review_date": "2014-03-11"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "One place to stop on your bar hopping adventures.  This particular night (Saturday) had a mix of Irish natives dressed in Monkey suits, people ranging from young to old and a live band that drew the crowd on to the dance floor.  People watching is so much fun.  Me and my friends were watching this chubby girl try to hard to get the attention of any guy.  It was like a train wreck.  You know you didn't want to watch but you couldn't divert your eyes.  We counted the rejections and after 10 we had enough.  The bartenders are nice and they have three big screens.  The decor of this place is nicer then Grant &amp; Green, another place I like.", 
    "review_date": "2007-12-13"
  }, 
  "pixNhhD7MstDu0Q0F9QyzA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian M.", 
    "review_text": "Great bar!  I always have a blast when I go to Maggie McGarry's.  They've got a great rotation of 80's/90's cover bands that perform on the weekends so check out the Events Page at: <a href=\"/redir?url=http%3A%2F%2Fwww.maggiemcgarrys.com%2F%3Fpage_id%3D24&amp;s=5ef5a0cc6a63c5dff86ef62da3be25ba4a7acce33e887bf4c81c1be8375e6b89\" rel=\"nofollow\" target=\"_blank\">maggiemcgarrys.com/?page…</a>  With a built in stage, Maggie's is a great spot for bands to perform and people to rock out on the dance floor.  Live Bands + Drinks + Great People = One hell of a party!", 
    "review_date": "2013-07-01"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Came here for a law school friend's birthday on a Friday night.  There was a live band doing covers of popular songs so that was awesome!  There is quite a bit of room to dance decided being a crowded bar because I don't think most of the people who go to Maggie McGarry's are really the dancing type?  I saw a lot of guys in flannel.  Haaaa.  Bar is cash only, but drinks aren't too expensive.  Service can be slow because the place gets so packed.  The bar in the room with the stage / \"dance floor\" had only one bartender.  People were getting pissed because they thought the barback was a bartender that was ignoring them.  I wasn't drinking because I wasn't feeling well, but I had a lot of fun soooo maybe that says something about this place.  I wouldn't mind coming here again :)", 
    "review_date": "2012-09-19"
  }, 
  "wb2I6PxYjRStE7OGLL4S7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "Maggie's definitely rivals it's next door neighbor for great live music, friendly service, a kick back atmosphere with an eclectic crowd and cheap drinks.   I received the following Facebook invite last week from an old co-worker who just joined this band:  \"Ladies,  Yes you. Strong Like Bull has seen you around.  Strong Like Bull has noticed that you've been working out to get ready for Spring. You look incredible. You make Strong Like Bull... Strong. Like Bull. That's right. Go ahead and look at yourself in the mirror. We know you like what you see. Cuz baby... WE like what we see. Dirty Girl. Strong Like Bull wants to make you feel the way you make us feel. The only way we know how... A Rock Show. A hot... dirty... filthy... sweaty rock show. Strong Like Bull is gonna make it hot May 1st. We owe it to you. Sexy thing.\"  ...and well since they were clearly talking about me, I had to go.  Surprisingly there was no cover on Friday (Mojito's was charging $5 to get in). The band rocked the house and though it was a little too hard core 80's rock for my taste (not exactly the kind of music you can show off your killer dance moves to) there was a great vibe spreading around and there were good looking people everywhere you looked.   Maggie's is a great place to start your evening off on the right foot. Let the good times roll!", 
    "review_date": "2009-05-05"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "I don't know what's worse - the frat boys screaming \"Freebird!\" or the fact that the band obliged and played it. This bar is what some might call a 'sausage fest' although the few women I saw in attendance were pretty damn hot. Of course I wasn't the only one to notice - I heard more catcalls than at a construction site. And did I mention they charge $2.50 for a soda water?  Don't they know it's the drink of choice of both recovering alcoholics and designated drivers? I'm neither but still....  Two stars because the band was actually fun to listen to and the people watching was pretty damn hilarious.", 
    "review_date": "2008-03-05"
  }, 
  "M_SxfmZjepJYxE_vNbWK4g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deanna T.", 
    "review_text": "Maggie's has the cleanest bathrooms of the North Beach bars.   Their drinks can be stronger, or bigger, or something (something usually has me feeling disappointed in that department.) Live music is always good. And cute Irish boys come by the handful.", 
    "review_date": "2009-02-21"
  }, 
  "7Ud5MkgdBb9iZJlmPKsAKw": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Samantha R.", 
    "review_text": "LOVE IT for the live music, good space for dancing and OK-but-not-great priced drinks (well beers for $5, bottles for $4).  Had a fabulous time dancing until 2 am last night to a ridiculous old-school rock cover band. The band sang the Beatles version of Happy Birthday to our friend, too! Everyone got in, wasn't a struggle, and everyone was happy to be there. It did get quite warm on the dance floor, though.", 
    "review_date": "2009-05-31"
  }, 
  "F4li3HnfS4gY5IeMSPkGcg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John M.", 
    "review_text": "The best part of my night at Maggies (other than the live music) was the service.  The place is a standard Irish dive bar that keeps a loyal following of regulars around so while it has a very familiar feel, there's nothing special about it.  The service, on the other hand, was pretty solid for a dive bar.  The dude at the door, Andre, seemed to know most people going in on a first name basis.  That was cool.  And the bartender was very receptive to me even though the place was three deep most of the night.  I suppose the shot of fernet that I bought her at the beginning of the night helped, but I was surprised how fast I was served and how easy it was to enjoy my time at Maggies.  My only suggestion for the place is to get rid of some of the tables any night they have live music.  It was a shove fest to move around and I'm not the type who enjoys that.", 
    "review_date": "2009-05-03"
  }, 
  "kWJeUVWNvy6auejua1OqiQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan S.", 
    "review_text": "I was visiting San Francisco for the first time and ended up here to watch the Jets vs Pats game. My friend lives in the area and had been here before. Immediately when we sat down, Patrick the bartender came over and started chatting with us. He's hilarious and very friendly. He was excited to talk to a New Yorker and a Jets fan because up until then the other patrons had been mostly Pats fans.   I experienced my first shot of Fernet at Maggie McGarry's (and my second and third...) and while it wasn't entirely enjoyable at first it did get easier and easier to get down with each shot. There seemed to be a lot of regulars and the other patrons were chatty and interesting. The other bartender after Patrick left was also great, though I didn't catch his name, he did take a shot with us at the end of the night. All in all a great bar that made me feel like I was at my neighborhood pub in New York. Will definitely go back here next time I'm in town.", 
    "review_date": "2011-01-24"
  }, 
  "cMICirZm69WlJHyasuUPTg": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Danielle K.", 
    "review_text": "So, I totally pulled a blond moment. I originally wrote my review on Mojito, which is next door... ya, I was a little too drunk and should have done my research before my review. But that's an honest mistake, right?   Anyways.   My girlfriends and I were in search of some ass shaken' music, to grove to for the evening. We originally started on Broadway, and ended up making our way down Grant St. and ended up here.   First thing's first, so we got a drink. Within walking 3 feet into the bar we ended up meeting a few cool guys, one of them my friend ended up making out with later on in the night. We got a drink right away and this time the bartender actually gave Tiffany Y. alcohol in her vodka cranberry.   This bar was off to a good start. Next thing we know, a Sublime song is blasting from the back of the bar. We walked towards it and behold a dance floor and a live band. The band played all kinds of great music, with legends like Sublime to Weezer, I mean the works. I was in music heaven.   Needless to say it was a great night. I will most definitely be back to this bar. Live music, good beers, awesome company, can't go wrong here!", 
    "review_date": "2009-03-12"
  }, 
  "lI_BQEP8HctfwKQQc18EhQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Nate E.", 
    "review_text": "This bar is a must stop for me when I'm in North Beach, and it should be for anyone on a pub crawl. You have to love the Irish, they just do bars right, loud, crazy, good fun, and of course great drinks for a good price in North Beach.  Maggie's always has good music too, there are two bars which you will have to wait for at both, but the bartenders are good and will get to you; hey it's a popular place to expect a crowd, and usually a good lookin crowd at that.  I love starting, ending or whatever time my night here, plus Golden Boy pizza is real close for late night drunken munchies", 
    "review_date": "2008-07-14"
  }, 
  "Z7-gaA681iKBcojqB6OT-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan B.", 
    "review_text": "It can get crowded here because people LOVE it.  So nice to have a good, authentic Irish bar in the City (there are a few).  Whoever the female bartender is with a very thick Irish accent: she is as hard working, funny and gracious as she is stunningly beautiful.", 
    "review_date": "2013-11-26"
  }, 
  "0ZXVhuR4JCsBDmak002adw": {
    "user_rating": 4.0, 
    "user_location": "Littleton, CO", 
    "user_name": "DJ V.", 
    "review_text": "My friend and I were looking for a place to put a little hair on the dog from partying pretty hard the night before doing the tourist thing. The wives wanted to go shopping around town so we decided this would be a good place to sit and collect our selves. After a beer and a shot we warmed up and sat with some locals in watching soccer. It was mid day but everyone was so friendly and I felt at home. Would love to come back sometime and see what this place is like at night. Great neighbor hood pub.", 
    "review_date": "2014-09-21"
  }, 
  "ztd0ck9f5dCQK322QuiZHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate P.", 
    "review_text": "I watch my football matches here pretty often. Went here last night and the band was really good. Also saw the most beautiful girl I'd seen all year here then. So five stars.", 
    "review_date": "2009-08-23"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "We came here on a Thursday and there was a live band.  They were pretty good.  Some people were dancing.  They have a large bar and plenty of room.  It was pretty busy but not too crowded.  Staff is friendly.  I definitely would come back!", 
    "review_date": "2013-10-21"
  }, 
  "_WYxpA12_jFHeS3GaWdjlw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clay T.", 
    "review_text": "Live music is great, live music in a bar with normal people, even better! Always a great time!   Only problem is their CC minimum is $15.", 
    "review_date": "2010-07-27"
  }, 
  "woW3EEoyj5M42Z7yXLhNLg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna K.", 
    "review_text": "Must be slim pickings for live bands in North Beach, cause I really, really can't understand why a band of aging hippies with a Journey fixation played on a Saturday night. Did I mention the lead singer was a 50 year old broad whose ass seemed intent on eating her leopard print spandex pants? There was not enough alcohol in the entire bar to compensate for this. But, it helped that the bartender forgot to charge my friend for a round of shots.", 
    "review_date": "2008-04-29"
  }, 
  "hFvLaKDNHMxHze13Hd-FZQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misha F.", 
    "review_text": "Do you LOVE dark and loud place filled with drunken people? How about live music and beers on tap? If this sounds all good, then Maggie's is the place for you.  Stumbled into this place close to midnight last weekend. We nabbed seats at the bar, ordered our drinks, and... men approached us and chatted us up, but it just wasn't the scene for me.  It's very dark...which has it's pros and cons if you know what I mean. My gf did meet a guy there though and they're going on a date this week...so not all is lost.", 
    "review_date": "2010-03-14"
  }, 
  "Ju9_9sGZAvwc9jGnXb7rQg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Madeline S.", 
    "review_text": "This place was fun!  We came here on Memorial Day and it was DEAD.  Hopefully the next time I go there will be more people since it was a little boring.  The bartender Patrick was fantastic, such a fun and friendly guy!  They were also nice enough to change one of the TVs to the hockey game.  Thanks!", 
    "review_date": "2014-06-03"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "After seeing the same apartment in North Beach that my flatmates and I have been eying for weeks, we decided to go to Maggie McGarry's to take a last look at the lease before signing it.    Plenty of places to sit at the bar and back room with high and low tables and chairs.  We each got a beer (Stella Artois for me) and sat at the corner booth-like table in the back.  The noise level was good, it wasn't too loud even though there was some sort of sports on tv and a group of guys sitting across the room was a bit rowdy and obnoxious pushing each other up against the wall (like they wanted to start a fight or something).  I doubt that they were drunk already since it was only 7p, but who knows boys will be boys.  Anyway, we just ignored them... After downing our beers, we all initialed and signed the lease.    Definitely a great bar and I'm sure I'll be coming here a lot since I'll be living only a few blocks away... 5 blocks to be exact :-)!", 
    "review_date": "2007-02-22"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "We needed a beer and this looks like a decent spot and one of the few pubs open around 1ish in the afternoon.  Seriously, what drew me in was the sign listing the Specials - Trumer for $3.50.    Nice neighborhood joint - a couple regulars there watching the game on tv, another having a burger over newspaper - just feel like a place to chill and \"where everybody knows your name\".    Anyway, when we walked in and settled in front of the windows - I went up to the bar to see what they had on tap (12 total) and was happy to see they had Boddington.  Can't resist that - give me one of those!  After a couple of gulps, I decided to check out the place.  Dark wood throughout, a jukebox that has a good selection of music, the other side has another full bar and some tables (all with wooden barrels as base).  From some posters around the joint, this place also has live music - need to check that out some other time and perhaps become a regular.", 
    "review_date": "2008-01-26"
  }, 
  "XkLK2iBsgqF6mWwDfRgqqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seong P.", 
    "review_text": "i went to go see a cover band on saturday night and the place was packed.  the sound was off since the lead singer could barely be heard but they had a fun playlist.  i think most in the crowd were friends or acquainances of the band members but it was a pretty good looking group on the whole.  i ran into a friend i hadn't seen in the while so it made me like the place more.\n  they had one bartender that seemed unaware of what her job was.  she had a look of confusion and panic so maybe the bar is usually not that busy.  then again, the other bartenders were much quicker so avoid the short blonde haired one.  also, the place was insanely hot.  i saw one  fan and that's it.", 
    "review_date": "2006-11-05"
  }, 
  "Ks9eVYblgKP1IdCksQGMvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney W.", 
    "review_text": "Maggie McGarry's is the best bar in North Beach! The bartenders are some of the best bartenders I have ever seen, especially the two girls from Belfast (LOVE THEIR ACCENTS!!). They offer free live musics, with the best bands around! Any douchebag  that thinks they should get drinks refunded because their pallet doesn't like it, is NOT mature enough to drink in bar! (How old are you 19 with a fake idea or 56 with nothing better to do?). Great bar with great service, will definitely come back for a visit when I'm back in town! Love it!", 
    "review_date": "2014-03-18"
  }, 
  "w0hA9hZPZhCdJTbJlIFXKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bew B.", 
    "review_text": "As a gooner and a rabid one at that this place is the bee's knees.  Large tv's and packed with Arsenal fans for every game.  Good selection of beers and perhaps the greatest bartender in Patrick as he's completely bonkers.  He also makes irish coffees just how I like them.  Up the Arse!", 
    "review_date": "2009-10-20"
  }, 
  "4mzGeIRXTrzC85xjYqYGSw": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Mike J.", 
    "review_text": "Maggie McGarry's is the official home of the Bay Area Gooners &amp; the San Francisco Branch of Arsenal America.", 
    "review_date": "2009-02-18"
  }, 
  "-340SwO2ilj8UWV9yeP9SA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Joseph A.", 
    "review_text": "This is a great place! Patrick one of the owners is amazing. Great hospitality, and if you want to watch real football ( The game played by feet), there is no better place in San francisco to watch English Premier League games!! They open as early as the first game which is around 4:45 AM. and even that early in the morning, Patrick greets you with a big smile. I was on a business trip in San Francisco and my hotel room was not showing the game, so after a lot of searching and inquiry, I could not find a better place. Thanks Patrick.   Joseph  A. from Los Angeles", 
    "review_date": "2013-09-16"
  }, 
  "D01KrKs9izEdoT0Eh4i4rQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dipesh G.", 
    "review_text": "A dive bar with live music.  The place is separated into two sections, one section that has the main bar and another section with a stage, a little dance floor, and a small bar.  The setup isn't too bad but the music is definitely loud, loud enough where you have to yell at anyone you want to talk to.", 
    "review_date": "2010-05-22"
  }, 
  "E9m9adcWg9h8mRX9idm9Qw": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kelly C.", 
    "review_text": "Another stop for drinks amongst the bars that run along Grant Ave--but this one has an Irish theme and a comfortable interior. It does get pretty crowded on the weekends, however there's a large back room with high-top tables you can sit with groups. They serve Guinness, a few other beers on tap, and of course, shots of the hard stuff (including patron silver tequila, which seems to be my boyfriend's favorite drink at this particular Irish establishment.)  In attempt to jump on the Tuesday night trivia bandwagon, Maggie McG's also has a guy with a mic reading questions around 8:30pm once a week. A little pop-culture skewed and definitely easier (and less competitive) than Edinburgh's Castle trivia, but still pretty fun. Not sure how long this fad will last, but it did entice me to stay for a couple more rounds of Guinness on a Tuesday eve.", 
    "review_date": "2007-09-25"
  }, 
  "DpiMuxg2g4urzClzjykUHg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Em L.", 
    "review_text": "It's still fun.", 
    "review_date": "2012-12-17"
  }, 
  "CNhhP_OSJp_-OhZerMWYlg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Marc E.", 
    "review_text": "Great place to see a live band. The place has a good vibe and fills up quick. Decent beers on tap and the bartenders are attentive.", 
    "review_date": "2014-11-23"
  }, 
  "R4DVayqiW63jHle7AG_NXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha M.", 
    "review_text": "Good ol' Maggie McGarry's!  This place is a load of fun, and right next to the Mojito bar, which is why I always stop in for a few drinks before I go over there Mojitos to dance my behind off. *smiles*. The place is large, and has a very good atmosphere. They're HUGE Arsenal fans there (as am I!) so that makes it better. The downside was they had NO midori when I asked for my midori sour, and I nearly had to force the bartender to give me a $1 off of the drink he did end up making me since he didn't have what I wanted. But it was nice that he did, even though he was under a bit of pressure. Hehe. There was a really cute Englishman and Aussie there that chat my friend and I up a bit, good times. Sports screens are huge, a perfect place to watch any big game imaginable! The bar itself is HUGE, often there is live music as well. A great way to spend a weekend night!", 
    "review_date": "2009-10-27"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "There is a time and place for janky dive bars.   I had 20 min to kill because I was waiting for a guy.   (side note to men:  NEVER make me wait unless you have a damn good reason or suffer my wrath)  Instead of stewing in my impatience and male loathing...I had a beer.   The bar was sticky, dark and sprinkled w/ regulars...on a Sunday afternoon.  There were three tvs showing various sports games.  No one was watching...they were all drinking.   It was eerie...I was contemplating the possible complicated lives of these men and lost the anger I had for having to wait when said guy finally showed up.", 
    "review_date": "2007-10-25"
  }, 
  "XEeFjAW4NahelwwItEGHXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shelbie B.", 
    "review_text": "All the stars for the DJ. I went last night and he was honestly playing hit after hit. He really made a simple beer pong event fun.", 
    "review_date": "2014-03-08"
  }, 
  "ywTB3kC4J2rO9hSTXyyJJQ": {
    "user_rating": 5.0, 
    "user_location": "Merced, CA", 
    "user_name": "Jessica Z.", 
    "review_text": "Came here as the last stop for a Bachelorette Party to see the 80's cover band \"Fastt Tmes in the 80's\".  The energy was great and everyone in the bar seemed to be having a good time.  Even as the DD for the evening, I was having a blast!  Girls in my party commented on how the drinks were decently priced and still tasty.  I can't wait to find another excuse to come back to this bar - my new favorite in SF.", 
    "review_date": "2013-05-13"
  }, 
  "Pofs_dI0I_BUyGfIORX0gQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "ale z.", 
    "review_text": "So you can come in this place even if you're 12 years old. They got Looney ass people working the door... Turns out it's a drunk ass Irish homeless bum  working the door that's not even employed here. K. Service sucks. Staff sucks. Environment sucks. Don't go here, don't waste your time.", 
    "review_date": "2014-10-11"
  }, 
  "A5PqLu1bVHd3uWYJoK9gsA": {
    "user_rating": 4.0, 
    "user_location": "Charlottesville, VA", 
    "user_name": "Kelly S.", 
    "review_text": "Good beers on tap. Can be pretty chill on a Saturday afternoon or weekday night, or pull a big crowd for events like THE WORLD SERIES (GO GIANTS!) or during a festival. Love it. Also, great bloody marys!", 
    "review_date": "2010-11-01"
  }, 
  "iXdrlePfdaiLxzHkAh9Feg": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Chris C.", 
    "review_text": "Great place to meet friends and have a time to remember. Staff is great and the drinks are strong  I was going there from the day it opened. I moved out of the city, but always stop bye when I am in town.", 
    "review_date": "2009-03-17"
  }, 
  "KtCONIE5_XOHybzkB0iysw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ale S.", 
    "review_text": "Ehh, an ok bar with live entertainment. Went here on a saturday night during a north beach pub crawl. The bar was extremely crowded; it took forever to get drinks and then it was cash only. A lot of places in North Beach are cash only actually. Average crowd. 20s and 30s. Nothing spectacular. A large pub if you will. I had a vodka collins - it was super sour. Stop by if ur doing a bar crawl of the area. Stay for one drink and bounce.", 
    "review_date": "2009-09-23"
  }, 
  "TMr5z8JDuGPc0I-5WfpBMQ": {
    "user_rating": 2.0, 
    "user_location": "Boston, MA", 
    "user_name": "Liz W.", 
    "review_text": "This was my last stop for barhopping in the North Beach area, and it was kind of a buzz kill.  It wasn't super crowded or anything inside, but we all waited outside in a short line.  Once we got in, the bar area was so narrow that we could barely walk through without pushing people to the side.  Deeper inside, there was a stage with super hillbilly music playing, which I only recognized a few of them... probably why I didn't have a good time here.  Also, the people that were here were much older, and I didn't saw people my father's and maybe even grandfather's age here.", 
    "review_date": "2011-05-28"
  }, 
  "qHmLQQZF1GKrU6HFZqZqGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela D.", 
    "review_text": "Good chill place to grab drinks. Bartender was really cool and poured our drinks strong. Will be back if in the area!", 
    "review_date": "2011-12-27"
  }, 
  "Le081ROooqFzteWcMs1-1g": {
    "user_rating": 5.0, 
    "user_location": "JFK Airport, Queens, NY", 
    "user_name": "Steven H.", 
    "review_text": "The bouncer was a long hair fellow...long flowing blonde hair. His customer service was more then exceptional; it was graceful. The ATM was out of cash and I stormed out but this bouncer calmed me down just like a new mother to a child. I called my bank to check I wasn't charged and when I walked back in the bouncer had two free drinks ready for my immediate consumption. This bar hires the right staff, they care...they give.", 
    "review_date": "2014-01-03"
  }, 
  "J7ka23aCUNK-v_yLB4AL1Q": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Justin C.", 
    "review_text": "Solid spot to grab a few drinks with your buds.  Well made Car Bombs but a bit pricey. Friendly bartenders and a comfortable crowd made me want to stay but the was making my wallet cry.  This was the fourth stop on the Pub Crawl and I couldn't wait to par the hole and move onto the next. Good thing our Marshal wanted to keep us on schedule and pressed us forward.  I would have loved there to have been live music, I would have probably stuck around.", 
    "review_date": "2011-11-05"
  }, 
  "AqBNpXElwesY8zwGXQ2xbA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "John D.", 
    "review_text": "I've been several times, as I don't live too far. When I do go usually its to just have a couple of beers. I tend to go early before the rowdier crowed stumbles in. its not bad..The bar tender thats on at this time is nice and the drinks are fairly cheap. The jukebox has an unlimited list of all kinds of music; however, the music I listen too isn't fancied by the locals. Its an ok bar...Nothing too special in my opinion.", 
    "review_date": "2013-08-11"
  }, 
  "vJQZ8yFNerGuRnvs9HLj4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Martin M.", 
    "review_text": "Love Maggies - good place to grab a beer in the afternoon and great atmosphere for football/soccer/baseball games.", 
    "review_date": "2012-11-03"
  }, 
  "P3onMWiIYufwVxHhX7BKXQ": {
    "user_rating": 2.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Brandi G.", 
    "review_text": "Got separated from some friends when wandering the streets of  North Beach, instead of blowing up their mobile babysitters, I decided to post my feet up and grab a drink.  Chose to walk in to Maggie McGarry's Pub because the large open windows were refreshing, and frankly, because I have a secret obsession with everything Irish!  The special of the day was a Pomegranate Margarita, which I have to admit was pretty damn good for having been ordered in a dark dungeon-esqe pub. So damn good, I decided to order another.  It must have been a hellish night full of outrageous boisterous drunks the night before, however, for Miss Bartender. She was quite a grump being very curt with me whenever I ordered, when I paid, when I smiled, anything. I don't think I saw her smile once at me, nor anyone else. I understand that it is difficult being a bartender at times, the constant come-ons from drunkards, reeking of booze every night, crap tippers, demanding people, I get it.  But c'mon laddy, you work in an Irish pub, just take a shot of whiskey to drown your sorrows and get over it!   All in all, my drink was great, yet I know a laundry list of more friendly  Irish pubs that I would rather frequent than here. And it's over to them I go to suffocate my crummy experience with a hefty pint of Guinness.", 
    "review_date": "2010-08-17"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "Kinda pricey/weak drinks, and there's a clever trick wall that opens up and reveals a stage. As in for bands to rock out.", 
    "review_date": "2009-02-21"
  }, 
  "0juzbrgcLHqobdK-OZAyiw": {
    "user_rating": 3.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Daniel L.", 
    "review_text": "I happened to bump into a few friends whom I haven't seen in years so they invited me to go kick it at Maggie's for a while. I really liked their clean, red brick ambiance and thought the bartender was very pleasant and attentive. Our rounds of drinks were on point and once in a while we would take a glance at the small TVs to catch all the scores and highlights. I really enjoyed the vibe and the crowd was mostly low key and pleasant.  The disappointing part of the evening was someone who had to be escorted due to severer intoxication while another person puked outside where the nasty stench started to linger into the bar. Despite having a lot of fun reconnecting with my friends those incidentals were our cues to leave. Too bad we weren't able to stick around to check out their live music but I thought we left at a good time. The place didn't make the best first impression but I would consider going back if I'm ever in area with friends.", 
    "review_date": "2009-07-03"
  }, 
  "4nS8Evpd4GI3tdbEG_sW4Q": {
    "user_rating": 5.0, 
    "user_location": "Redding, CA", 
    "user_name": "Stephanie G.", 
    "review_text": "We found this place after a Giants game last weekend, we had a blast!!! Playing darts, drinking good beer, then out of no where a band appeared! They were kick ass! Great cover band! (Aug 16) Would definitely go back next time we're in the city. Laid back, packed with fun people! Loved it!", 
    "review_date": "2014-08-22"
  }, 
  "u6RnIJmxtcYQikmmTciYhA": {
    "user_rating": 5.0, 
    "user_location": "Bozeman, MT", 
    "user_name": "Rebekah M.", 
    "review_text": "Such a great experience! Great \"local\" atmosphere. Chill environment. The bartender, Patrick, was fantastic &amp; so helpful. He guided/recommended several other things for us to try while in the city. #nowthatsagoodbartender. Go there. Talk to him. Enjoy a great bar &amp; have someone take time out to teach you a thing or 5 about San Fran", 
    "review_date": "2014-08-11"
  }, 
  "jXzwG-IK0Xw0khZTPFsFxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon L.", 
    "review_text": "I've been here a few times now, and have always had a good time! The bar tenders are attentive and friendly. The live music is off and on, but with no cover charge (at least when I went) you can't complain.  One of my favorite NB bars!", 
    "review_date": "2009-12-10"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "Yay, ho! Yay, ho! Let's score a goal! [x2] Football. European Football. uh-huh. Football. European Football. sexy. Football [x4] Yay, ho! Yay, ho! Let's score a goal!  Football  OK, just had to add the lyrics of my favorite ode to soccer by Parry Gripp, as Maggie McGarry's is one of the finest spots in town to be surrounded by ravenous futbol fans from all over the world. They open early during Arsenal matches, and if you think watching 49ers games amongst a rowdy group of sports fans is fun, you haven't seen anything until watching the sun rise here in the company of fervent soccer hooligans! It's a must.  Aside from the fun game watching, it's a pretty standard Irish bar. Nothing overly thought provoking.", 
    "review_date": "2011-12-12"
  }, 
  "TroCliPm7jduwsuwacJT4Q": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Timmy G.", 
    "review_text": "Awesome venue for live music on the weekends and an authentic Irish Pub experience smack in the middle of North Beach!  Love the vibe here, and love all the bartenders and staff as well.  They all know how to pour a perfect pint of Guiness :).  Go here for a great time on the weekends, or during the week for karaoke or football (soccoer :)) games.", 
    "review_date": "2014-04-20"
  }, 
  "5hHGHTb_8mlsI3On6WiCjg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nhi T.", 
    "review_text": "mMm Good Beer and live band! And much better ventilation than next door (Grant and Green felt like a bad sauna that night). Nice bartenders who, from what I hear, know the proper way to pour/serve Guiness (who am I to question? I just know it looked oh so good). One bar accepts plastic, other does not. Restroom wasn't scary. Parking might be a problem, but so is all of North Beach (and I walked) so all is good =)", 
    "review_date": "2009-04-30"
  }, 
  "6e0khvHCOJU1YTCx8gDfSw": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "kelli d.", 
    "review_text": "Fun place to go to. Went here on a Saturday night right before Bay to Breakers. I don't recall the name of the band, but I think the only appeal to majority there (guys) was the female singer. Some of the songs weren't bad at all. Only had smithwick's so can't judge the drinks but this is a lively place to go to. Definitely a place to hang out out with a friends, but it can get noisy.", 
    "review_date": "2009-06-17"
  }, 
  "BHDBfx4mWOdtT-ug0CPc3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany L.", 
    "review_text": "Live music, GREAT bartenders, fun atmosphere, and one of my favorite places in the city! The bathroom is almost always clean which is refreshing. Plenty of seating for large groups and plenty of dance floor as well! Drinks and shots are strong and very reasonable!", 
    "review_date": "2009-02-14"
  }, 
  "IG9oulUO-tprUZOY4jfG3g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa W.", 
    "review_text": "good prices on drinks.  more of a week-night place i would say though.", 
    "review_date": "2008-11-17"
  }, 
  "MhcfUz_p-aA_BXGw_9B3IQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Justin K.", 
    "review_text": "Absolutely terrible customer service. I have been going to this bar for years, but will no longer spend my money there after how rudely I was spoken to and treated by the staff and, worst of all, the OWNER. They seem to have forgotten that they are in the SERVICE INDUSTRY.", 
    "review_date": "2013-11-09"
  }, 
  "lM9ZDLy3Uz4BOPmyB6euWA": {
    "user_rating": 2.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Sabrina P.", 
    "review_text": "It was 28 dollars for four fernet shots (break it down, 7 dollars per shot).    Down the street at Columbus Cafe you can get a fernet shot for 3 dollars.  I dont expect everything to be as great as Columbus, but seriously they did not offer ANY drinks at a reasonable price.  Maggie McGarry's is just a normal pub, nothing special.  I don't know why they think they can commit highway robbery on drinks for a place that is, again, not that special.", 
    "review_date": "2011-02-17"
  }, 
  "DrWFZ8H7UjtHvbhCTSQ7Wg": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Neeraj A.", 
    "review_text": "Tie ups with amazing bands for live music, good drinks, great location. Could not ask for more. Great sports club for Soccer matches", 
    "review_date": "2013-11-11"
  }, 
  "OhzYAGNLxX4TWMdKuowB3g": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joshua R.", 
    "review_text": "Normal bar behavior, replete with significant tips met with hostility and mischaracterization.  Skip.", 
    "review_date": "2010-01-29"
  }, 
  "bzXcplEVo3rOb4aJNnN4Ow": {
    "user_rating": 1.0, 
    "user_location": "Valencia, CA", 
    "user_name": "AJ S.", 
    "review_text": "I had just finished a bar crawl with  the hostel group,  and I can say without hesitation this is not a hostel friendly bar.  This bar happened to be across the street from the bar the hostel crawl ended at,  and they were not open to new patrons at all.  They treated us like shit.  Keep looking if you're looking for a bar friendly to new people.  It is not surprising at all that they have a sub 4 out of 5 review ratio.", 
    "review_date": "2014-11-13"
  }, 
  "TWcqLHYI4xRWlodtNZvoHQ": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Erin S.", 
    "review_text": "Pheobe, buttery nipples, Simon says, what more do you need?? Best bar in North Beach!", 
    "review_date": "2013-12-22"
  }, 
  "9QP8plakeuE-iGAA6QK4mQ": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Petz C.", 
    "review_text": "I've always wanted a pub to call my own, where everyone knows my name *cut the cheers music* ok so I admit, I'm a proud manchester united fan, Maggie's is the BEST spot to watch English Premier League games, even though its swamped with gunners (arsenal fans) but I love to poke fun at them, especially when they are losing (then I know they won't stick around and hog the air space) it's all in the spirit of fun. Normally Patrick works the early shift and he's a very cool guy who has a lot of great stories to tell and you can share a lot of laughs with. You get to meet the locals who come in there as well, they always have some interesting banter and welcome you to their friendly Irish Neighborhood Pub!", 
    "review_date": "2011-06-12"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "Is it really possible that I have never reviewed this place?   After dozens of trips here of there years (same doorman somehow :-) ) there is no better safe bet on a weekend night. ...or after SantaCon. ..or when everyone is back from school over a holiday .. or f#@% it, just about anytime.  They get drinks churned out quickly considering the number of patrons, and the cover bands are the stuff of legend.  if there is a cover band from the 80's or 90's here, I'm \"in\", no question.", 
    "review_date": "2012-12-04"
  }, 
  "h0js35x4a8MMFtEQ6BqKkw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vickie Y.", 
    "review_text": "I really like this pub-  friendly staff, lots of locals.  Good music, lots of space to move around.    Though pubs are not generally my thing, will return when in north beach  =)", 
    "review_date": "2008-09-02"
  }, 
  "TN-SMdPNdWv2gHSzGqGHzQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Aasim K.", 
    "review_text": "Was here this past weekend to hear a 90s cover band play.  Great venue with tons of friendly people.  They don't mind jamming this place tight but everyone is friendly and not too uptight.  A great place to bring friends and move on past the conversation portion of the evening.", 
    "review_date": "2011-07-17"
  }, 
  "RZUGrWB5EiNwaXHi6ZH7fw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Tony C.", 
    "review_text": "C'mon Arsenal! The official spot to watch The Gunners on match day with a crowd of like minded Gooners. Been here plenty of times not shouting out chants and my personal opinions of how to play a proper central midfield and have always had a good time. Pretty typical Irish pub with a typical drinking fair. They have 2 bars inside on each side of the joint and I have ever only once seen one of them closed at night. Great spot to jump off from or to stumble into during a crawl, as we did for my birthday pub golf crawl. Thanks for putting up with us singing karaoke without a machine. Cheers!", 
    "review_date": "2011-11-30"
  }, 
  "jswYyz57RKLQ_pt0qvysow": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Melissa R.", 
    "review_text": "It was a stormy Saturday a few weeks ago so we decided to do what's best in SF when you can't show a tourist the sites - day drinking.   Wanted to hit a nice pub in North Beach and the only one nearby that came to mind for some reason was Grant &amp; Green. Would you believe it was padlocked at 1pm on a Saturday? Freezing and wet, we found Maggie McGarry's next door, open and bustling with people who had the same mo as us. It all came back to me now - I had been to this place at least a few times before, back when I was much younger and the North Beach bar scene was actually a scene, but I had never been here in the daylight or even half sober.    Net/Net: While I can't remember if Maggie McGarry's is a fun bar after dark, this place is perfect if you want to throw back a few (many) pints with some friends on a Saturday afternoon-turned evening.   Pros:  - Atmosphere: Clean, bright pub with a long bar for plenty of seating. Not sure if it was the joy of escaping from the storm, but everyone (service and patrons alike), just seemed really happy to be there. Bathrooms were unusually clean, too! (true, it was still early). TVs to watch the games, a juke box, and an extra room for groups or probably live music in the evening.  - Service: Bartenders were awesome! Friendly and hilarious, quick service, great Irish accents if you like that sort of thing.   - Location: Excellent spot on Grant in North Beach. Tons of restaurants and shops nearby.   Cons: Can't think of any! Will be returning to Maggie McGarry's soon.", 
    "review_date": "2008-03-13"
  }, 
  "pEnPxArLOZlKC94iVkVFxQ": {
    "user_rating": 3.0, 
    "user_location": "Brunswick East, Australia", 
    "user_name": "Megan L.", 
    "review_text": "I love north beach so I try to check out the different bars.  I have been to all the bars around it but this one and my friend that I was with wanted to go.  They had a trivia night which seemed fun, but im not good at trivia so instead we drank beers at the bar and ate some cookies the bartender had.  The bartender was really nice and we talked about music all.  I mean its just another bar, nothign special but nothing bad... I would not rush back though.", 
    "review_date": "2008-06-25"
  }, 
  "cCeCQxErE9ToaQQBEVFuFA": {
    "user_rating": 3.0, 
    "user_location": "Bellmawr, NJ", 
    "user_name": "Abigail W.", 
    "review_text": "still walking around north beach before dinner and the guys needed to try some other pubs out. it was only about 6pm, just a handful of people in here. patrick (who i think works here) was a hoot. the beer i was sipping on poppy jasper was sweet and delicious. and the drunk guy in the corner singing was quite amusing", 
    "review_date": "2009-09-14"
  }, 
  "1P5Ce52ttCVNH2Xs7uFAwg": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "michael jackson Q.", 
    "review_text": "ooh to be a gooner!!", 
    "review_date": "2014-11-28"
  }, 
  "JsVB8eE-FOhJjf5hL0nNwQ": {
    "user_rating": 3.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Amanda S.", 
    "review_text": "The Saturday band (not sure if they're regular) is very talented and a lot of fun! They mix in 80s and modern hits - decent size dance floor too. The bartenders are observant and serve people in the order they've been waiting. There were a couple fights that broke out, but employees were attentive in responding and throwing them out. Small line when we arrived, but no cover - yes!", 
    "review_date": "2013-09-22"
  }, 
  "LGoRaDnAgD33hP2m0F2S5g": {
    "user_rating": 5.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Lupe B.", 
    "review_text": "Gotta love this pub! Great drinks and awesome live music and even better bartenders! Ms Clair is always lively and mixes a hell of a cocktail and if your looking for a laugh see Fionnuala (don't know if I'm spelling that right but she is hilarious)!!  Grab your friends and give this place a visit, you won't regret it!", 
    "review_date": "2014-02-26"
  }, 
  "vStYOq-y-R9sWs2mCZEF7Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kitty B.", 
    "review_text": "Absolutely crap bar. The manager was the rudest, most unprofessional bartender I've ever had the chance to meet. I thought that it was her job to provide drinks when requested, but instead I got a serving of: 'I'm going to take your order, then ignore you. When you ask for your drink again I'm going to make it seem like the biggest inconvenience in the world and take as long as I possibly can.'", 
    "review_date": "2007-09-05"
  }, 
  "_kMxRe7x1oJ3M6Nu-BEN-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam B.", 
    "review_text": "This is definitely the best bar in North Beach not to mention one of the best Irish bars in the City.  There is a good mix of locals and visitors which always makes for interesting conversation and a nice balance of Irish and Americans.  The bartenders are so friendly and make you feel like you're part of the family. I'm always very well looked after when I'm there. I must also recommend an Irish Coffee which is made with North Beach's very own Cafe Trieste coffee (which is 1 block away on Vallejo, if you didn't know). The bar staff will even allow you to order food from the local restaurants and eat at the bar.  In the true passion of North Beach there is nothing better than the family owned businesses supporting each other. I think that Maggie's has settled into the neighborhood quite nicely.", 
    "review_date": "2007-04-04"
  }, 
  "mJH1L8vKU9p2BChGcNBaBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SisterMable S.", 
    "review_text": "Ok, I have a slight hangover from the stiff drinks, so bear w/ me please :) LOVE this bar. Sweet no-nonsense bartender, aforementioned drinks of stiffness, flocks of cute Irish guys, clean loo! :) also karaoke on wed nites!", 
    "review_date": "2010-04-08"
  }, 
  "BZOf-RMFNcNsBnj4c17-cQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drea B.", 
    "review_text": "I need to preface this review by stating:  I, a female with a preference for wearing high-heeled leather boots and a black mini-skirt, walked into the packed bar BY MYSELF on a crowed Wednesday night. I was simply waiting to meet up with gal pals at The House across the street.  I immediately proceeded to the bar and started chatting it up with a friendly gentleman. Said gentleman turned out to be the owner. I had told him it was my first time at Maggie McGarry's, so he ordered almost every item on the menu for me and I essentially was forced into drinking bottomless glasses of wine. And I was not complaining! This made me a very happy girl. SOOOO HAPPY that once my friends met up at The House, I opted to stay at Maggie McGarry's a little bit longer! Ok, a lot of  bit longer.  The kitchen manager was a doll, too. Great conversation. We teamed up to play trivia. The trivia wizard was also a sweetie-pie. They were all just so  very personable!  I eventually parted ways with my new three friends (hugs were given to all, of course) and I finally met up with the gals SUPER LATE to dinner... but I was totally fine, for I had already eaten dinner with  the Maggie McGarry's owner, kitchen manager, and trivia answer grand marshal!   Next time I make it to Maggie's, I think i'll be going alone again... just for kicks.", 
    "review_date": "2012-08-09"
  }, 
  "Q9kTp0Qlm9vCmbTwBuUyWg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael M.", 
    "review_text": "Just be careful when paying by card.. for some reason my account was preauthorized twice amounting to over $200...  other than that.. staff are friendly", 
    "review_date": "2012-05-01"
  }, 
  "Ip-QVKDEjjjg5xQUwdE4rQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mick G.", 
    "review_text": "Great for watching free soccer/football in the am; always a friendly  reception, even if you're not an Arsenal fan, as many attendees are... Nice pint og Guinness, of course...", 
    "review_date": "2010-03-01"
  }, 
  "d5J5E3GhDX-o534NP9Jo3w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah B.", 
    "review_text": "Ok, so it is odd, Irish in an Italian hood, and they do have a bit of a sauna going on in the back by the dance floor. But all I know is that I had a cover-free blast dancing and singing with Livewire last Friday.", 
    "review_date": "2008-11-19"
  }, 
  "cpdHtPxy6O1GTURUTlZkaw": {
    "user_rating": 4.0, 
    "user_location": "San Luis Obispo, CA", 
    "user_name": "Lauren G.", 
    "review_text": "This place is great. Loved the classic rock cover band. I need to personally thank the bartender- the girl with the curly hair and glasses. She was beyond amazing and kind last night to me when I had a little too much to drink. She remembered my friend who I was there with and got her off the dance floor for me. They are truly good people who work there.", 
    "review_date": "2013-04-28"
  }, 
  "iXb6BquJQpg6Y02wEqa5Yw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zack I.", 
    "review_text": "Good place on Friday and Saturdays to dance to music and have a big crowd. Doorman is Jim -- nice enough guy usually but can be a jerk. Better than most bouncers.", 
    "review_date": "2014-09-20"
  }, 
  "WFz1Rtv31XJSVduwGa4TZA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Megan-Bria B.", 
    "review_text": "Hella narrow and sweaty, but always brings promises of heavy amounts of drunken debauchery. Did I mention 80's cover band (amongst various other live bands)?  All in all your standard Irish pub, only awesome because it's not in Sacramento, so the percentage of Affliction-clad frat boys and bedazzled 21 year old girls tends to stay at a refreshingly low number. Winning!  **side note - bring cash!", 
    "review_date": "2011-03-27"
  }, 
  "EGuLB7xaTYzzIVFeq3F-2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin W.", 
    "review_text": "Came here on a random Wednesday night, when me and some friends decided to randomly go into some bar we never go to. Walking down the street, we saw that they had Kareoke night and the people singing was actually pretty good, so we decided to go in.  This bar has a great atmosphere, everybody is having fun, singing along to whatever song they have up on the screen.   They have 2 bars, so it''s pretty easy to get your drinks, unlike other bars where everybody is crowding up the bar area and takes forever to get anything.  The bartender took our order and was pretty quick in preparing our stuff. They do have Hef on tap, so that's an extra for me.  The owner (I think it's the owner, the one who checks the ID), is a pretty chill and funny guy.  Everybody here is really friendly and just looking to have a great time. So with that said, and the drinks pretty good and not too pricey, this is definitely a great bar to come kick it with some of your friends.", 
    "review_date": "2012-07-12"
  }, 
  "-40hChgdlI5clkagmyoh5g": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Karen B.", 
    "review_text": "Not bad!!  After a gruesome property midterm we came here to drown our sorrows!!  On the day we went, Sunday, they had free weiners which was perfect since I was starving and had to eat something to soak up the Trumer PilsnerS. Was surprised on how empty it was for a Sunday Football day...it's okay cuz more weiners for me.....", 
    "review_date": "2007-10-01"
  }, 
  "v_gv21JqJYv8ikelp-ksOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sunshine S.", 
    "review_text": "I can't help but love this place! Live music for free, Hello! They never charge cover which means more money for the drinking fund (hick-up). The bartenders are super-duper fast and friendly!  This is a must for any pub-crawl in the area, big space is a plus! They show early morning soccer games, I'm not usually a morning person but its cool to have a place to go for the die-hard soccer fans.  An Irish bar with real Irish people, now we're talking!  The hot whiskeys are amazing and so are the Irish coffees.  I'll be back soon.  Karaoke on Wednesdays is always a great fun.  Don't tell anyone who blows to come here, I want it to stay cool.", 
    "review_date": "2012-02-28"
  }, 
  "3zWYE-sXRgbT6pHzGo8LNw": {
    "user_rating": 3.0, 
    "user_location": "Stafford, VA", 
    "user_name": "Hammer Time H.", 
    "review_text": "i'm 27 and i think i was the oldest person in there.  the band was decent but the dance floor was filled with 21 year olds...if that old.", 
    "review_date": "2010-05-10"
  }, 
  "XnbGrJNw0wglmqXekW138Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn B.", 
    "review_text": "hope i got the name right for this place... fun new irish bar where the lost and found used to be - right next to grant and green.  i think they did a good job renovating the inside - it has a cool atmosphere and lots of tables and places to sit.  pretty good music - they have a jukebox which i think is always a plus!  its still really new but the 2 times i have been there its been pretty full.  it also kind of reminds me of the field, which was an awesome bar on union at grant which i am sorry to say closed a few years ago.  good times at that place!  hopefully this will turn out to be more of the same!  definitely check it out...", 
    "review_date": "2006-08-13"
  }, 
  "l0PYkotRgNgz4ZqAjGFzPg": {
    "user_rating": 2.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Rachelle T.", 
    "review_text": "Kinda pricey for drinks, even in North Beach. Effen Black Cherry and tonic and a pink of beer was $15! For a better deal and less stinky bar, head to Gino and Carlo's.", 
    "review_date": "2012-12-31"
  }, 
  "XG-JynrbKiiNaqT4ffdI_w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ossama A.", 
    "review_text": "Not a bad addition to the neighborhood. Typically not crowded, has beer and other booze, what more do you want from a bar? Tip: Do not ask the very Irish bartender if she gets offended when people order Irish Car Bombs. (She does)", 
    "review_date": "2007-01-11"
  }, 
  "P_0MidHAEbcO8gmHE6eQcw": {
    "user_rating": 3.0, 
    "user_location": "East Palo Alto, CA", 
    "user_name": "Yan Biao B.", 
    "review_text": "band. good.", 
    "review_date": "2009-03-01"
  }, 
  "616XlyIHcXy_znH8xMkTTg": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Alison A.", 
    "review_text": "Seriously the dark headed bartender sucks. She was so rude when we tried to order our drinks. $20 minimum I get we are in sf but everywhere else is $15. And no need to be rude about. I would skip this bar and go to the ones near it.", 
    "review_date": "2014-01-05"
  }, 
  "DH7ABAMHvl6IQfJ_yK7x5Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara G.", 
    "review_text": "With the rumors of Irish bars being the new \"hot thing\", I was expecting this one to be as inauthentic as it gets.  At first glance, it smells new and not of the usual stale Guinness, it's clean and light, and it's got an awesome mural on the wall of legendary rock 'n' rollers.  I was pretty suspicious of it until I was pulled aside by a friend of mine who frequents my Irish bar in the Sunset.  She said it's owned by a good Irish friend of hers so I know it's legitimate.  It's pretty spacious and has the typical dark wood bar and such.  Definitely a good choice if you aren't feelin' the pretty boys of Magnet or the grunge of Grant &amp; Green.", 
    "review_date": "2006-10-16"
  }, 
  "me12xQhNiGNnau9rHus3HQ": {
    "user_rating": 5.0, 
    "user_location": "Emmetten, Switzerland", 
    "user_name": "Mark B.", 
    "review_text": "As a Gooner I cannot rate lower but have loved watching an Arsenal game early in the morning as well as chatting to Borussia Dortmund fans in evening. Plus great advice from locals on food...", 
    "review_date": "2013-06-11"
  }
}