{
  "EZVIq_fP8DVnUWwm1xVkfA": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "D A.", 
    "review_text": "Very Good Food, Service and Atmosphere........", 
    "review_date": "2009-05-05"
  }, 
  "ZJMrk2BwAkN0Dtc73qtN8g": {
    "user_rating": 4.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Christian W.", 
    "review_text": "cozy, functional, unpretentious, well-priced, good service.  We went during the north beach fest, and these guys were even keeled about it, when they could have been up-itty and annoyed.  Peroni on draft.  Panini's looked great, i'll be coming back for lunch on a regular basis. Bathroom sucked, whats new, its north beach.", 
    "review_date": "2008-06-16"
  }, 
  "Qd5GyT45vcCydR2mM9dcmg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laurence W.", 
    "review_text": "Mario's is more than the sum of its parts.  It's one part old wooden bar, European cafe, cozy corner hangout, and piping hot, grilled sandwicheria.  I went there last Saturday to pop in for a late night sandwich while waiting for friends, and settled in comfortably and quickly into one of the corner tables.  There was no bump or bustle, but it was still pleasantly alive.  My sandwich was near perfection, and I was disappointed I had to gobble it down so quick to meet my mates.  I could have easily spent more time lounging at Mario's over a tiramisu and coffee...", 
    "review_date": "2009-11-17"
  }, 
  "4IjzfbO7XKFNWWVufHNhww": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalie N.", 
    "review_text": "At first when I was told to meet for lunch at the \"Cigar Store\" I was a little thrown. Upon my groups hungry arrival the staff was really friendly and helped us be the (annoying people with the big group) that needed to gather more chairs.   The Hot Foccacia Sandwiches are amazing and served really piping hot. From what I could gather they cook them right behind the bar on what seems to be a small pannini press. The ingredients were fresh and the group consensus was to come back.   Seating: The table at the front window overlooks the streets and Jackson Park which is fun to watch. Grab it if it is free. There are also tables outside so if it is a nice day opt to sit there and watch the tourists wonder by.", 
    "review_date": "2007-12-26"
  }, 
  "fagcapi3Lzeu9LWUUlJYuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie D.", 
    "review_text": "Came here with one of my new roommates as this is a favorite spot of his, and I have to say it was pretty good! Nestled in north beach, this Italian spot does a pretty good ceasar salad and we had something else resembling enchiladas stuffed with different fillings. Those were pretty good but I think next time I'm going for something a bit more my speed- sandwich or pasta or something (if they have those). Split a bottle of wine, which was great, and chatted with people at the next table after they overheard our conversation regarding my roommates slut of an ex-girlfriend. I really like the bathroom for some reason, which I think has to do with the slanted ceiling, like you're peeing in an attic. Check this place out, it's got a relaxed, local vibe with good people all around.", 
    "review_date": "2009-04-07"
  }, 
  "SVtNctg9k2QOGj0znfHVwQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Eli Y.", 
    "review_text": "SUPER hipster, but a damn good sandwich.   My friend and I were feeling some sandwiches so she'd suggested this place. Super glad she did.   It feels much more like a bar than a sandwich spot. And it has a very hipster feel. But I can't deny that they made a ridiculously good meatball sandwich. The meat, the sauce, the bread, the cheese...all of the things!!  So on a nice summer day enjoy the outside seating, or even go across the street and eat in the park. But wherever you eat it, you'll enjoy the sandwich.", 
    "review_date": "2014-06-02"
  }, 
  "6z26YTb8Dz_jlsgjt7qOPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cindy c.", 
    "review_text": "delicious paninis, awesome cappucinos, and oh my god tiramisus...i'm drooling thinking about my wonderful lunch here yesterday.  the service is a little robotic, but as long as my food is good i'm going back!", 
    "review_date": "2008-08-11"
  }, 
  "lConjPFTZqz4zWELK_EJtw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Keila N.", 
    "review_text": "What we had:    Italian sausage pizza and Caesar salad  We were mislead by the myriads of reviews and high ratings.  We found the food regrettable especially since we had high expectations from Little Italy.  I wanted a do-over at another pizza place, but my daughter refused to participate and I wasn't about to chow down on a slice of pizza alone.    The pizza lacked flavor.  There was only a traceable amount of cheese and a slight sweet hint that we didn't care for.  The Caesar was unremarkable.", 
    "review_date": "2012-08-25"
  }, 
  "t0r4rT-_b-Y4bAoZba8h6Q": {
    "user_rating": 4.0, 
    "user_location": "Whittier, CA", 
    "user_name": "Mathew W.", 
    "review_text": "Despite the name, there are no Cigars in use or on sale here. It's just a restaurant. And a damned good one. Try the meatball sandwich, quite delectable. Parking is a problem, but this is San Francisco, so I can't really complain about that too much. Prices are okay, a little high.", 
    "review_date": "2008-09-09"
  }, 
  "GbblKnri6ovFZI-E8j3kIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith G.", 
    "review_text": "Great bar for a casual bite. The wine is just okay but they make nice aperitifs too.  I recommend the grilled eggplant sandwich on foccacia bread (with balsamic vinaigrette, feta, tomato, arugula).", 
    "review_date": "2008-07-22"
  }, 
  "8dbSdpvNMkz8-MZ8QByrTQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Liz L.", 
    "review_text": "Meatball sandwiches, YUMMMM!  Right down the street from my place, EVEN BETTER!    I went through a phase of craving their meatball sandwiches almost on a daily basis.  Apparently, you can't eat meatball sandwiches for every meal (or so they say ...), but I still try to come here at least once a week.  It's my neighborhood favorite, and I make sure to take all my guests from out of town here.    From here, you can see all the craziness at Washington Square park, the parrots, and throngs of tourists staring in the window wondering where the cigars are. You get the best view (and most space) at the corner table.    The bathroom is the size of a kid's shoebox.", 
    "review_date": "2007-05-22"
  }, 
  "rD2tJLlrXnyLnc8X0GPlEg": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Hratch P.", 
    "review_text": "Go there Saturday to sit outside, watch people at Washington square park, have a beer, maybe even a great sandwich. Pay next to nothing, yelp about it and come back next week.", 
    "review_date": "2006-06-12"
  }, 
  "m8Ck4pNpWOaXk9yyDXD5hQ": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Bridey B.", 
    "review_text": "Try the chicken panini or the chicken focaccia. Delish. Small size coffee, not over priced. We'll be back for sure.", 
    "review_date": "2008-10-25"
  }, 
  "6A4QMfBAbuxUP5ZZWZ8hvw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Emily L.", 
    "review_text": "This is a fabulous little corner cafe in the heart of north beach. I love sitting outside on a hot day, sipping white wine and snacking on a delicious panini. The people-watching from this corner is great, as it is right across the street from Washington Park, and the food is wonderful. They cook it right inside at the bar in a large wood burning oven. The staff is kind and attentive. This place has a lot of character is a small, quaint, non-pretentious spot that doesn't ever feel touristy. Definitely check it out.", 
    "review_date": "2009-08-17"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Great Food, great drinks, great service. I need to go here more often...", 
    "review_date": "2005-12-04"
  }, 
  "a3gZmBACfe290XDwTcrtrw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Eyal M.", 
    "review_text": "An epic meatball sandwich. No words to describe the experience. Simply incredible.  Love the vibe, even though last time I was here the service was better, I still don't really care as I did come specifically for this sandwich. Ha.   Beer selection is small but right on the money. Love the park across the street. Makes the places vibe even cooler.   Even love the hipsters that fill up the place. They are from the positive kind ;)", 
    "review_date": "2014-10-26"
  }, 
  "sbWem88kDUO6tDNbKpl-_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne Marie F.", 
    "review_text": "The sandwiches are unbelievable here!  I am a fan of heated sandwiches, and Mario's has an oven similar to a pizza oven that they use to heat the sandwiches.  The service is always quick and courteous.  The location couldn't be better.  I do enjoy people watching at Mario's, and the beer is out of this world.", 
    "review_date": "2009-05-17"
  }, 
  "rp_cK3PN78kqRt_suzjRwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arlene C.", 
    "review_text": "Tucked in a corner in the heart of North Beach, this is purely a San Francisco experience and great for people watching. You can't go wrong with any of the Focaccia and Panini sandwiches at this old Italian North Beach institution. Coffee is good and strong. Hit and miss on getting in as space is very cramped in this wedge shaped venue. Best to go at an off time.", 
    "review_date": "2007-05-14"
  }, 
  "AoBCZN72QIYofUnbQlaAGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Freddy H.", 
    "review_text": "I will do dirty, dirty things for a Chicken Sandwich #2", 
    "review_date": "2012-05-02"
  }, 
  "M7a-eJMUJGYeMkOlLMniMw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Princess P.", 
    "review_text": "It's odd that I avoided this place, but that's another langley porter story on my girl interrupted days.  I love all the sandwiches, especially the the sausage, meatball, and eggplant ones. My only complaint is that the focaccia bread could be sliced in half for a filling sandwich.  I love the old time feel of the place.", 
    "review_date": "2012-11-23"
  }, 
  "R2p221627ZK5IhFBVI0OzQ": {
    "user_rating": 4.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Constance C.", 
    "review_text": "It's an easy place to walk past, so don't walk past it anymore and go in.", 
    "review_date": "2009-04-06"
  }, 
  "8Wt4_xi5WOWdEp706ZBuoA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jessica L.", 
    "review_text": "Mario's is a lovely, unpretentious, and comfortable cafe.  It's small and there are a few tables that overlook that park, some outdoor seating, and a bar that takes up most of the restaurant.  They have beer on tap and that always makes me happy.  My boyfriend and I split a grilled eggplant foccachia sandwich and house salad. Both were delicious.", 
    "review_date": "2013-07-18"
  }, 
  "1-sKWNYf2D-LUcybA9NQPg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Alberto R.", 
    "review_text": "Excellent place, with a lot of character.  Feels like one of these old café-bars from Southern Europe.  Both coffee and desert were excellent.  The place is cozy or crammy, depending on your perspective.  Servers are on the slow side, but extremely polite.", 
    "review_date": "2013-07-09"
  }, 
  "WZpM1tR5nMIj618C4D-RcA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve J.", 
    "review_text": "OK, folks. I get the charm of this cafe's location and setup. Sipping a coffee or glass of wine in the corner or outside at a table on a warm afternoon (today was unusually warm) is a great way to spend time. But I bellied up to the bar for one of the panini's and walked away (far too many minutes later) having eaten half of what must be described as the least flavorful sandwich I've ever spent good money on in this town.   The big, sloppy, hot foccacia sandwiches ordered by others looked more appealing and I understand this might be about my choices, but come on! My \"panini\" came on a grocery store roll that was filled with mediocre lunch meat, almost no blue cheese (it was a smoked turkey/blue cheese sandwich) and a few red onions. The only  distinguishable flavor was the burnt bottom. I'm OK with dark grilling ... a little scorch can make the sandwich. But it was the ONLY flavor stand-out.  Service was friendly enough and they treated the regulars very well. My server saw the disappointment on my face and charged me for what I ate - half a sandwich. I'm not afraid of eating a lot at lunch and I was looking forward to a full belly, but I won't finish something I'm not enjoying.   With all this neighborhood has to offer, why would anyone spend a dime on a sandwich that doesn't meet even the most modest expectations of flavor?  One star for a perceptive server.", 
    "review_date": "2007-08-29"
  }, 
  "8ahguXNS9FJjDwPynFr4gQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taylor W.", 
    "review_text": "Now, if you want a great panini sandwich this is where to go.  The sandwiches on foccacia bread are the best with a tall glass of Stella beer.  Above all, the best we delight ourselves in is .... the grilled  \"Eggplant\" sandwich.  Their salads are good but not as good as Mocca Cafe.   Coffee \"Cappuccino's are THE BEST!!  Dessert's are soooo good and made homemade.  Try the Ricotta Cheesecake and not to mention the Coffee Cake. The Merlot house wine is not good. The wine selections are just ok.  They have great music playing loud and they change it often.  Yes, it is a small place but you won't regret it. The service is kinda a slow and yes it depends who's working the shift. For two people, about $35.00 to $40.00. This is way better than Mocca Cafe, still I love those tri tip sandwiches. Remember, you are getting the best quality homemade everything.  I just love Mario's, We treat ourselves so often there.   I love these places 'coz I make these at home and just as tasty, thats why I find it worth spending your hard earned $ for what you pay when you do dine out ...... it has to be GOOD!!", 
    "review_date": "2008-11-21"
  }, 
  "hs49qaQtTkiiUk1GWvNDkw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevra P.", 
    "review_text": "I love this place, always have.  The staff makes us feel like we are family and they know to keep the wine coming.  Even if we got into a fist fight ( Hey, I said they are like family!) I'd still keep coming back and if they had more varieties of salad...I'd never leave.", 
    "review_date": "2008-07-26"
  }, 
  "xt8tqNaVPzgBhhftXBr-5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven M.", 
    "review_text": "Such a great San Francisco establishment.  Set right across the street from Washington Square Park with huge windows to watch over North Beach.  They have cheap wine and great focaccia sandwiches.  The kind of place you go and realize how great of a city San Francisco is.", 
    "review_date": "2005-11-02"
  }, 
  "ppiZAoXF0p6DBvNRt1UcwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam P.", 
    "review_text": "Ciao! I love the chicken sandwich #1 with a Peroni, Anchor or a glass of Montepulciano!  Buona Sera!", 
    "review_date": "2005-06-28"
  }, 
  "gEI2dgZSa-JD-3gVOHjVgA": {
    "user_rating": 5.0, 
    "user_location": "North Hollywood, CA", 
    "user_name": "Wolf Yener O.", 
    "review_text": "Best spot in Little Italy.  Great people/service and top tasting food. They have a true coffee machine! Their deserts are made home made from the true Italian owners.  A++", 
    "review_date": "2012-03-25"
  }, 
  "3gxZfCVPp7HNMutb-eLchQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen B.", 
    "review_text": "In need of a solid panini? This is the place to hit. I had the mozerella, tomato and basil pesto panini and it was scrumpcious! Grilled to perfection and hit the spot after a sweet workout. This place is a cool little spot. Not too big and every table including the bar area was full. I took a peak at the drink menu and both beer and wine were very cheap. I see myself returning without a doubt. The staff carries a sense of humor and you will definitely be entertained.", 
    "review_date": "2009-02-14"
  }, 
  "PluuoC0vKMq_159qjFiR-A": {
    "user_rating": 3.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Jonathan R.", 
    "review_text": "A Iconic sandwich and cocktail pit stop while wandering through North Beach. The place has an alluring smell from the years of caked on grease on the one deck oven that sits at one end of the bar. It's a nostalgic smell that always delivers memories of foggy &amp; rainy days in North Beach, where we ducked in here to escape the weather and have a drink.", 
    "review_date": "2014-04-14"
  }, 
  "Or65RHS0Shmuw7tAwoLJkg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirl L.", 
    "review_text": "if you are looking a great sandwich, Mario's got it.  It has the best paninis and other baked dishes.  although food comes rather slow given the number of customers the two cooks serve.", 
    "review_date": "2005-07-17"
  }, 
  "zigzaCWeF8ooSeRsksmn0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serena S.", 
    "review_text": "My absolute favorite place in all of North Beach to enjoy a glass of wine and a light meal at an affordable cost.  We always eat at the bar where you can watch them make your food and take in the whole room.  We like the lasagna, the eggplant parmigiana and anything made with the foccacia (it's from Liguria).    Service is always friendly.  You come here to relax, not for a fast meal - if you want that, please go to In 'n Out Burger down at Fisherman's Wharf.", 
    "review_date": "2013-05-27"
  }, 
  "emIVSls-1hbkPIf4QeEDkg": {
    "user_rating": 5.0, 
    "user_location": "Orange, CA", 
    "user_name": "Carly J.", 
    "review_text": "\"The best sandwich I have EVER had.\" You must go to Mario's and have the Chicken #2. Sit outside and drink some wine-- just be sure you get the one table with sunshine.\n  UPDATE!!!!!\n  So I have been to Mario's twice since this review and the Chicken #2 was lame... Still love the ambiance. Looks like I am going to have to order something new next time.", 
    "review_date": "2006-07-07"
  }, 
  "OsUxhCIgxRxF5cu6Z4_dLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy R.", 
    "review_text": "The food is really decent, and the location can't be beat.  The wine selection is a joke, and served in juice cups.  I get that is authentic, but they could do better.  Drinking bad wine out of a crappy cup doesn't work.    I would give them four stars, except for their shitty, arrogant service.  Who the hell do those hipsters think they are?  They belong in the Mission, not North Beach, which is a friendly place for cool, normal people.  I don't think the waitstaff understands why they are getting small tips.  It's because you're assholes!", 
    "review_date": "2014-03-13"
  }, 
  "TuFsdCB7HzJ4eigRQQYNbw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew M.", 
    "review_text": "This is the spot in North Beach where my friends from Napoli like to go, bypassing all the touristy pretend-Italian joints that predominate on Columbus ave.  \n  For the love of god, try the meatball panini (of if you don't eat meat, the fried eggplant panini is a close second choice).  The foccacia is baked fresh daily right around the corner and it's fantastic.  Get your panini, a bottle of peroni, and watch through the window all the people walking by washington square.", 
    "review_date": "2006-04-24"
  }, 
  "qQa9J0fXA6E-3JSFNsF7TA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "O'Shea J.", 
    "review_text": "Decent sandwich - I had the grilled chicken #1 - the foccacia was perfect and good enough to eat by itself. I was dissapointed it didn't come with any sides - fries would've been nice or even a bag of chips. It did come with pepperoncinis which I absolutely love. They got gobbled up before I even started on the sandwich.   The establishment is quite small so if it's just you and a friend you'll be fine but anymore than that and space will become a premium.  I hear the meatball sandwich is crazy good.", 
    "review_date": "2010-03-03"
  }, 
  "oo8fs0VCoyQfhD9PKmGmig": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Benjamin R.", 
    "review_text": "I'm 35, I've had my share of Meatball sandwiches during my life.  This is by far the best Meatball sandwich I have ever had.  I live in Chicago, 2,135 miles from Marios, its rough.  By the way, they have the smallest bathroom ever, its crazy.", 
    "review_date": "2007-05-17"
  }, 
  "UQcjPecs1-vvr2Ut0fh6ow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "passion f.", 
    "review_text": "it pains me to give mario's a glowing review b/c i want to be able to grab a seat next time i go by.  cram yourself into a tiny table inside, belly up to the bar, or brave the san francisco weather at one of the outdoor seats with a view of columbus ave and washington square park.  order a seriously delicious sandwich and watch your quality of life improve instantly.  years ago i sat at one of the tight little tables  (in the pointy corner of the store where columbus ave meets union st)  with my then friend and now husband.  cozy spaces are seriously romantic (at any time of day).  my girlfriend's have told me of \"special moments\" with a date here.  it must be the no-pressure, un-assuming atmoshphere that allows people to relax with each other.  the only downside for me is that the coffee is lack luster.  i know mario's gets it's coffee from the local coffee roaster (so it's super fresh) but it's not quite as good as you get from some of the other coffee bars in the neighborhood (there's no shortage).  maybe their machine needs to be \"calibrated\" or tweeked, i should give it another try.  it's worth it.", 
    "review_date": "2009-06-02"
  }, 
  "TZExGajxC02oetl7iQ77eg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H.A. ..", 
    "review_text": "Mario's sandwiches, selection and service has been on a downward slide for a couple of years now.  Their formerly nice selection of ports has been narrowed to \"tawny\" and \"red\" - one of each.  The last four sandwiches I've ordered there have been served either over or under cooked, and staff is careless.  Sad to see the old place slide.  Hoping they can reverse the trend.", 
    "review_date": "2005-08-23"
  }, 
  "y7oeeuOub0p-ih5Olbct2A": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tania D.", 
    "review_text": "This is a cute little corner cafe! Love the tiramisu here. Right across from the cathedral and Washington Square....  Get a tiramisu and a coffee/tea and just people watch :)", 
    "review_date": "2012-02-29"
  }, 
  "W46UkrAvPokkWfXno1cD6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsey E.", 
    "review_text": "I have been sitting on this review for awhile, agonizing if I was going to give it 4 or 5 stars. And then it hit me: The focaccia sandwiche(s) that I have had here has become the end-all be-all sandwich to which I compare all other sandwiches.   In the last couple of weeks, every time I eat a sandwich (which seems to be fairly frequently at the moment), I catch myself saying, \"It's good, but it's not as good as Mario's.\" It has set the upper limit of my sandwich scale. If that's not reason enough to give this place 5 stars, I don't know what is.   Not surprisingly, I think the secret is the bread itself - perfectly crunchy but still soft. If you want something that can only be ironically described as \"health,\" I suggest the salami/ham sandwich.   To. Die. For.   The service is a little...strange. They are nice and try to be funny, but come off as just a little awkward. It's really hard for me to put my finger on it, as they are attentive and not rude, but just...different.   Bottom line, even if the service was the most horrendous thing in the history of the world, the sandwiches would make up for it x20. Definitely a must when in Northbeach.", 
    "review_date": "2009-04-20"
  }, 
  "QQ_Wg6ZiLhiG0WHtLdnY2A": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Wendy M.", 
    "review_text": "I've spent way too much time in this little shop looking out onto washington square park!  My favorite table is the one in the very corner, looking out on both Columbus and Union Streets.  Get a focaccia sandwich - grilled chicken #2, meatball, veggie are all truly notable - and an italian soda.  Give yourself a while though - the customer service is friendly but lackadaisical.", 
    "review_date": "2006-08-11"
  }, 
  "k6CQ4HbIC1hGCTbhVjgXCA": {
    "user_rating": 4.0, 
    "user_location": "Miami, FL", 
    "user_name": "Jose P.", 
    "review_text": "We loved this place when we visited for lunch a few Mondays back.  Food was excellent.  The Rollie Fingers look a like needs to quit his job as a waiter though.  He certainly did not look like he enjoys it.  Other staff was great.  It is a small place and overall, awesome!", 
    "review_date": "2013-04-30"
  }, 
  "ut0JV6-7t9NVP4lJqz36_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "marjorie v.", 
    "review_text": "Ohhh yeah snap into a beard. These guys ooze man-hood. never mind the the north biatch. a spicy meatball will satifies me. love the boys at maaarios.", 
    "review_date": "2009-06-19"
  }, 
  "tMvJ3MgOGUw2X5KGkmC1Gg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "melissa m.", 
    "review_text": "I love this place - whenever I am in San Francisco, Mario's is like my compass. I have found myself on a barstool eating an eggplant focaccia panini and drinking some house wine several times and I couldn't have been happier.  Falling into Mario's is like leaving 21st century earth and landing into 1974 (as I imagine it).  It just feels right.  Oh, hey, and their bathroom ~ you will never visit another one like it, I promise...", 
    "review_date": "2008-12-18"
  }, 
  "8k3aO-mPeyhbR5HUucA5aA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Victor G.", 
    "review_text": "Mario's was a cigar store 50 years ago but not now, it's an eatery with expresso, pizza, sammies, beer, and .a few bottles of wine. seating is at a bar and a few tables.  review is of the coffee only.  brew: americano (2) -full body, edgy,  freshly brewed,  -thatsa italian!  drips: -biz looked slow on a saturday morn. -even found parking in north beach, so rare.", 
    "review_date": "2013-07-06"
  }, 
  "D1Wbw8tlt8sNCq049No5pA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "P H I L H.", 
    "review_text": "Good food, not great when I was there, but the prices are fair.  Nice location next to the park. Drinking a soju on the rocks was my favorite course of the meal :)", 
    "review_date": "2007-06-25"
  }, 
  "_xVqtBEIBS2nTffGl9UrUQ": {
    "user_rating": 4.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Suzanne L.", 
    "review_text": "Tasty inexpensive sandwiches on foccacia made from the tiniest sandwich station on the planet! Super good tho.  Can get pretty crowded.", 
    "review_date": "2007-09-19"
  }, 
  "XOrMnYsmiSj54ivFrAsK3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shane R.", 
    "review_text": "The mozzarella panini is amazing. Takes a bit for them to prepare but, oh man, it is well worth the wait.", 
    "review_date": "2011-12-05"
  }, 
  "ss1PGLjfjitXP2o0_95SCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misti L.", 
    "review_text": "This place is better than an average sandwich joint and beats the Subway 5 for 5 for sure.  I once did an engagement photo session here since the couple met here and that was fun!  It is charming and service great and truly good food.", 
    "review_date": "2009-03-10"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "local north beach sandwich 'n' pizza bar....weekend stroll down the corner for a sluggish meal to come....one cook oven action....construction...oven bake...out..finishin' slice and plate....filled and cozy....sip on a soda, brew o' coffee....awaiting sausage..others awaiting eggplant, meatball 'n' more....wait..wait...wait...wait...waiting~~~~...­patience necessary....  surprising good sandwiches.....meaty 'n' fillin'....tasting great 'n' final product actually above satisfactory.....only small questioning of sanitation of bread piled open on bookshelf corner wall....", 
    "review_date": "2007-11-04"
  }, 
  "AxJNQAe5DVEIcSdOSOo3Yg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jo S.", 
    "review_text": "Meatball Sandwich to die for...: Went for a lunch of the meatball sandwich and an iced tea. Handsome waiter that I made smile and the sandwich truly surprised me. The meatballs are cut in half and packed tightly in sauce and cheese between triangles of foccacia bread. Got quite a bit of writing done and had a great view of a guy playing Frisbee with his son in the park.", 
    "review_date": "2007-09-14"
  }, 
  "KgDOK0iFpD2mQsKkpvrALg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris T.", 
    "review_text": "My favorite hang out in the North Beach!  A small lil joint at the butt end of NB.  The floors are wooden and busted.  The entire place is rather triangular making the restaurant a bit oddly laid out.  I enjoy places with a lot of charm and you can tell this place has a long history of it.  I mean, there has to be some story behind why a hot sandwich shop is called a Cigar Store!    My favs are the meatball sandwich and the open faced tuna melt.   Most of the sandwiches are oven heated so the foccacia are nicely toasted with a crispy crunch to it.  Crumbs crumbs everywhere and I lick my fingertip to pick up every bit I could find on my shirt!  The must in all meals here is the coffee (bottomless btw).  I usually dump a lot of cream in my coffees, but Mario's coffee doesn't require much.  It's pure silk on it's own!    -1 star for inconsistent service.  Some days I could be utterly ignored, and other times they'd be by your side once you pick up a menu.  Your best bet is dining at the bar area where you can just shout your order to the oven master!", 
    "review_date": "2006-07-21"
  }, 
  "1eS6uvwDUv8d5fMbbfZNOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Slim B.", 
    "review_text": "Good coffee, good food, good atmosphere, good location.  I wish they had more outdoor tables.  I disagree with the info on Yelp about this place that says it isn't good for kids.  I see babies and kids here with parents frequently and they all seem to be having a fine time.", 
    "review_date": "2008-02-11"
  }, 
  "t9cze1D9Gb8d-spMoHHSSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay S.", 
    "review_text": "This is a fun place to just hang out and their sandwiches are the best. They use foccacia bread (very yummy). We had the #1 chicken sandwich and the combo. The sausage and the meatball sandwiches are also very delicious. Great No beach hangout!", 
    "review_date": "2008-07-27"
  }, 
  "YbZg36FoMgkKcTEPae5siA": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Amy J.", 
    "review_text": "I've stopped by here on numerous occasions and I've always had a good meal. The sandwiches and pizza are just the right amount for the right price and the staff have always been great.  This last time I stopped in I came and sat at the bar as a lone diner with a book. I ordered my food and the bartender noticed that my nose kept running. I thought it was due to allergies. He brought me a port with hot water in it because he said, \"This is what I have when my nose is running.\" Sure enough, it cleared up my nose for the entire day. I'm sure if I didn't bury myself in my book there would've been much more chatting going on. I'll have to thank him for the runny nose cure and catch his name next time I stop in. I didn't feel rushed but since it was starting to get busy I figured I should get going since I had finished eating.  I know this place is small so I never bring more than 3 other people with me max. I like that it has a cozy feel to it that a lot of places these days seem to lack.  You won't find cigars here but you'll find a lot of regulars who just want to have a drink or a quick no frills meal. The prices have gone up a little bit since I've been going here but I think that's expected in a city such as this one and it's way more reasonable than a lot of other places along Columbus.", 
    "review_date": "2013-02-18"
  }, 
  "09XgrUKILZklJGlBT6cJ8g": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Asli T.", 
    "review_text": "Ok so I had one day in San Fransisco and decided to try out this place and I'm so glad I did.   It's a small place. 10 people can sit at the bar and there are about 10 tables.   There is no back kitchen. If you're sitting at the bar, you can watch them make your food. Right behind the counter is where they prep everything in a big fire oven.   When you ask for a sub, that's when they throw in the dough in their oven and the break bakes right then and there.   We tried the meatball sandwich and it's one of the best I've had (and I have tried maaaany meatball subs) and the grilled chicken salad. Both greaaaaat.   The cakes sitting at the counter were hard to resist but i somehow did.  Having said that... I'm taking a star off because the staff can be a bit moody (not rude..just kinda cranky) and slow at times. I waited 10 minutes to see if they will ever refill my coffee (i was sitting right across from 2 workers at the bar) and then gave up and asked for it. I didn't mind their personalities it as much as someone else might.", 
    "review_date": "2009-11-30"
  }, 
  "lGF_5chfdvtGHoFwmM6yCQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maxwell S.", 
    "review_text": "Before I lambaste this place I need to qualify my scathing review by admitting that I'll be back.  The only reason is that they serve Graffeo Coffee, which is easily the best stuff within a 100 mile radius.  Okay, now I can proceed to blast this place.  Let me begin by explaining that my tiff is with the waitstaff.  They have a server who is worthless and a bartender who works at a pace that rivals the speed at which grass grows.  We walked in the door on a nice Saturday afternoon and it wasn't really all that busy.  We went to the bar where we were ignored for about 5 minutes.  This server was waiting on one of the tables inside, we make eye contact, and then a table opened up outside which we promptly nabbed.  After being ignored for another 10 minutes the same server comes outside and walks past us.  I quickly asked him if he could grab us some menus as we still hadn't been served, and this guy has the nerve to suggest that I \"go inside and get them at the bar\" because the Sultan himself is \"on a break.\"  Yea that guy is a complete turd burglar.    Anyhow, I walk inside and up to the bar, I ask the bartender for the menu and she says she'll be right with me.  Another 5 minutes go by - NO EXAGGERATION.  This chic was actually moving about as fast as a glacier - and she served several other people who came after me... and all I asked for was a menu.  What the hell is wrong with these people?", 
    "review_date": "2008-11-16"
  }, 
  "4vPenosP7mMkADQLhfLHGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "GirlAtTheCafe N.", 
    "review_text": "I just love this place.  It is true to itself: a cozy, local neighborhood joint that has been around for decades and serves up non-fancy fare at decent prices.  No, it won't be the best meal you've eaten, but it will be reasonably priced and fill you up.  A great place to meet friends for a casual low-key impromptu dinner.  We don't have nearly enough places like Mario's in SF these days.", 
    "review_date": "2011-06-08"
  }, 
  "VpREWOjt5Pna6OIgXI9Jcg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara H.", 
    "review_text": "Despite the enticing aroma of garlic and sauces all hereabouts, I normally run screaming from any food establishment in North Beach. I've only had bland meals with fine-dining prices in this part of town, so I tend to leave Steps of Rome and their ilk to the tourists.  But Mario's has me wondering whether I've been a bit hasty.  Similar to Cafe Francisco a few blocks up, Mario's is good for a quality lunch. Also like Cafe Francisco, it's a wee bit expensive (in the $10 range), but they do have table service. I came with a co-worker, and we both had paninis, mine with chicken and avocado and the right amount of cheese. The sandwiches are on the small side, but I usually try to avoid food-coma-inducing lunches anyway.  Cozy interior, cute decor, be-Diesel-ed staff (maybe they're all actually Italian?), and a view of Washington Square Park to go with the meal ain't so bad at all.  Oh, and I don't know if they actually have cigars, but I don't think those would go well with panini.", 
    "review_date": "2008-08-11"
  }, 
  "OfBxv_lindDyWpqyvK_pzw": {
    "user_rating": 4.0, 
    "user_location": "Bay Area", 
    "user_name": "F T.", 
    "review_text": "Food: 4.5 stars Service: 4 stars Value: 4 stars  We came to the city to meet our friends for Saturday brunch. They took us to this little cafe by Washington park. My friends said this cafe was very old-fashioned, authentic and yummy. And man, it was true!   I was amazed by their delicious hot sandwiches and pizza. The price was about $9 each, which was pretty average in the city.   The waiter was good and make sure we were happy with food and drinks. I highly recommend this place if you ever stop by the Little Italy area in the city.", 
    "review_date": "2010-02-08"
  }, 
  "m-45HDQiH2uIL1dbR6fJUw": {
    "user_rating": 5.0, 
    "user_location": "Marin, CA", 
    "user_name": "Stephen N.", 
    "review_text": "Very cool place, never changes. Quintessential old North Beach. Fried eggplant sandwiches and drinks are great!", 
    "review_date": "2012-12-26"
  }, 
  "NINonEafvhz3Z1tF0rtmWA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raleigh S.", 
    "review_text": "Delicious! great service and relaxed atmosphere.  I need to come back and try more items and write a longer review.", 
    "review_date": "2012-07-02"
  }, 
  "zcUcJAU9Hiah9R5-UZWOug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janet Z.", 
    "review_text": "Their sandwiches are soo filling! You can eat half and you will already be SUPER filled. This isn't a cigar store, I do not know why they even call it that. I think this place is really old because the place looks quite old. The staff was really nice, a lot of recommendations from them. The place is quite small and the tables are too. Their pizzas are good! Thin crust, I wished they would put more cheese. The food that I orders seem to take quite a long time to come!!", 
    "review_date": "2008-01-10"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "Just got back from a coffee/hot chocolate date on this beautiful, almost-sunny Sunday morning :-)!  I've lived in North Beach for almost a year and I'm sad to say that I have not been to Mario's until today.  It's a really cool cafe with great atmosphere and a great place for people watching -- straight out the window are the outstanding view of  St. Peter &amp; Paul Church and Washington Square Park.    The place is small, but not only do they have coffee and pastries, they  also have a good selection of salads, hot foccacia sandwiches, panini, pizza, lasagna, eggplant parm and beers (on-tap and bottle).    Service is good... attentive, friendly and funny.  Don't ask for whipped creme on your hot chocolate because, \"that's not how we roll at Mario's,\" according to one of the servers.  The bathroom is tiny, if you stand over 5-foot tall, I do not think you'll be able to use it.    After finishing up our hot beverages, we were served a short-glass of sparkling h2o with lemon, which I thought was perfect. Too bad you cannot smoke cigars in here, but there are cigars available for purchase.    I will be back again.", 
    "review_date": "2008-02-03"
  }, 
  "l3znAei9pbBJiLK9IxnwSw": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Kristine B.", 
    "review_text": "This is one of those joints that I wouldn't go out of my way to eat here, but since I'm in the area and I don't want to drive or walk super far, might as well.  Try the pastrami panini - it's a solid choice.", 
    "review_date": "2010-06-01"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "We're talking about casual eats in a classic setting (see my photos). This place probably represents the third corner of the North Beach triad that includes Caffe Trieste and Victoria's Pastry Company. OK, maybe you have to add Caffe Sport and Steps of Rome. OK, maybe not Steps of Rome because they lick your neck there. Well, not mine, but Rachael Ray's, I think, on that $40-a-Day-Cause-I'm-Too-Rich-to-Tip show. Oh my gravy.  But back to Mario's. Big bar, little tables inside, a few more outside. Lots of Italian-style atmosphere - bottles of Chianti against the wall, a picture of a boccie ball player, those old artful advertising posters you see at Z Gallerie. Yet again sparked by a complete stranger's adoration of this place on \"Check Please! Bay Area\", Jamie W. and I went to see what the fuss was about. The menu is small but focused - focaccia sandwiches, paninis, three salads, a few pizzas, some lasagna, some eggplant parmigiana, and a few desserts. That's it.  We went for splitting two paninis, both in the $7.50-$8.50 range (see my photos). The verdict is that the salami was really good, and the chicken one a little too dry. But the bread was nice and crunchy. It comes with no extras except for a couple of pepperoncinis - which was a bit disappointing since I never turn down fries. We decided to order the $6 Caprese, which consisted of four thick, somewhat unripened tomato slices with a slab of mozzarella and a dollop of fresh basil pesto (see my photo). All in all, it's a good snack place but nothing much more than that except for a great spot overlooking Washington Square.  FOOD - 3 stars...good, toasty paninis but nothing extraordinary here AMBIANCE - 4 stars...feels like a good paisan's hangout SERVICE - 3.5 stars...friendly enough, not as indifferent as I was expecting TOTAL - 3 stars...the small servings bring this one down a little...also the easy-to-screw-up name with three nouns in a row...make up your mind!", 
    "review_date": "2008-08-28"
  }, 
  "m9oL5PQ_Sjqpmgqe85qvSA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily M.", 
    "review_text": "My husband and i love this place.  it is very relaxed and has the feel of a place that has been around forever, which it has been.  In a good way.  I always get the breaded eggplant focaccia sandwich.  We have been going to this place since before they had a menu.  the sandwiches are just as good as they have always been hot, toasted perfectly.  My husbaND likes the eggplant pizza.  Together with a glass of wine or a beer on tap it makes for a very easy dinner on the nights we are too lazy to cook.  thank you, Mario's! Don't ever change.", 
    "review_date": "2014-03-05"
  }, 
  "z7C7pheG7hujTylgvag9OQ": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Paris J.", 
    "review_text": "Oh wow!  I am sitting here beginning the digestion of one of the yummiest sandwiches ever eaten!   I got the eggplant open faced half sandwich. I wish I'd gotten the full now ( even though I don't need it! ) because the tastes are extraordinary.   I'm a bit of a food snob vegetarian and a little sick of people lack of creativity when it comes to veggie dishes. They're usually eggplant or portobello mushroom based... And I usually boycott them as a result of their blandness and ubiquitousness. I am so glad that I didn't here! I would highly recommend this sandwich to anyone... Veggie and meat eaters alike.   Also there a nice view of the park and the church is just eclipsed behind a willow tree.   The ambiance is low key and the price are very reasonable. The bartenders are pleasant but a bit distant.  I will be returning, hungrier, and for the full sandwich!!! The beer's not bad either!", 
    "review_date": "2014-10-03"
  }, 
  "u6ms8jCUMd3qhlB6hufV-w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly C.", 
    "review_text": "This was the worst groupon-type experience I've ever had, and the worst restaurant experience I've had. Truth be told, it's one of the worst ways I've  been treated as a human being, hands down.  Our dinner was fine. Service was abrupt, but not so much that we would make a fuss. When the bill comes, I show him the coupon on my homerun app. The night manager at Mario's flips. He tells me that it's no good, he'll only accept printed, that I should have told him when I came in. He starts screaming in the middle of the restaurant and caps it off by simulating slapping me in the face.   Let's be clear how offensive this is. I've a women in my twenties. He's a man in his forties. And he just simulated slapping me in front of 15 people because I had the gall to use a prepaid coupon his restaurant had volunteered to offer.  In my opinion, he stopped just short of assault, and I absolutely felt unsafe and threatened while in their restaurant.  I'm disgusted that this is the way we were treated for patronizing his restaurant with a prepaid coupon that his restaurant agreed to. And by bringing friends who spent double what the coupon was worth.  None of us will ever be returning, which is a shame because I really loved this place and despite not living in the neighborhood made it a point to come several times a year and recommended it to many friends. I'll never make that mistake again.", 
    "review_date": "2011-04-14"
  }, 
  "DXHSUpeuGsFczkdRVxuKtg": {
    "user_rating": 1.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Catwoman C.", 
    "review_text": "On a recent excursion into the city my husband and our dear friend thought it would be nice to have a cigar and a cappuccino while watching the world go by in North Beach.    Now, all of us are from the greater Bay area, so we aren't exactly tourists from the Midwest or anything, but we aren't exactly experts on San Francisco either, so we didn't really have a clue as where to start looking for cigars, and seeing that none of us are so touristy that we read guidebooks, we had absolutely no clue that this place did not actually sell cigars anymore...oops...our bad, but this small oversight does not excuse the absolutely rancid behavior of the resident bartender....  We walked in and stood at the bar for about five minutes where we waited for the bartender to look up from the wine glass he was cleaning to acknowledge our existence.  He never does look up and give us eye contact but he finally asked us if we \"needed a menu or something.\"  Our friend asked to see the cigar selection and the bartender snapped \"we don't sell cigars and we haven't sold them for over fifteen years.\"  We then asked him if he would happen to know of any place nearby that does sell cigars and the bartender gets even more visibly annoyed by our mere presence and snaps, again without even looking up to acknowledge our existence \"NO, I DON'T---there isn't a single cigar shop in North Beach!\"  At that point we decided we didn't even want to bother with ordering a glass of water from this jerk, so we hightailed it out of there, all three of us swearing that we would never step foot in that place again.    Now I realize that our lack of knowledge about this place did make us look like a group of idiotic tourists, but that's still no excuse for treating us like second-class citizens...and even if we had been Midwestern tourists there still isn't any excuse...I realize that tourists can be annoying and I make fun of them just as often as everyone else, but still...behavior like that is just uncalled for, no matter if someone is a tourist or not...  Anyhow, our experience was so unpleasant I doubt we will ever step foot back into this place...  And to the bartender with the slicked-back dark hair and goatee---you are a jerk and I suggest you brush up on your customer service skills.", 
    "review_date": "2007-09-04"
  }, 
  "LBTp89k-qNO4UY5-zsI7nw": {
    "user_rating": 3.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Debbie Y.", 
    "review_text": "4 stars for the really great location, atmosphere, and comfy setting.  However, the eggplant parmesana was disappointing but after reading the reviews sounds like the thing to order there are the sandwiches.  It's still a great cafe and I'll definitely be returning but will stick to the drinks and sandwiches...and of course desserts.", 
    "review_date": "2006-04-19"
  }, 
  "Uftwnhj_yWzCZC7JEK0VHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura Gardner S.", 
    "review_text": "Classic, friendly neighborhood spot. There are always a bunch of regulars at the bar. Their open-faced, hot foccacia sandwiches are delicious and I love how their wine is served in carafes. The staff is extremely cool and efficient. One of my favorite neighborhood cafes.", 
    "review_date": "2008-03-12"
  }, 
  "zP9HLd5nwdpHXhO2rKXjEw": {
    "user_rating": 4.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Nancy K.", 
    "review_text": "Frommer's includes a stop here during Day 1 of San Francisco and who are we to disagree? We were quickly seated and told that the kitchen was backed up - a nice touch. We ordered drinks, a half salad and two sandwiches: mom and I split a meatball and K got an eggplant.  The dressing on the salad was a little odd but the lettuce was great. The sandwiches were good but very different from the East Coast version on which I grew up: they use Swiss cheese here, a really different twist. Both servers were incredibly nice local hipsters who clearly cared about the job they were doing and answered our initial barrage of questions about the beer on the menu with which we weren't familiar.   Very good way to break up the day!", 
    "review_date": "2012-04-16"
  }, 
  "B6xxXHebsWphZe4_uXi3pw": {
    "user_rating": 4.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Jon H.", 
    "review_text": "Sandwiches on focaccia are the best here!  Veggie or Sausage are my favorite.  A little messy, but well worth it.   It's very reasonably priced - and always a great casual place to eat and drink.", 
    "review_date": "2014-03-07"
  }, 
  "08mOpJRCpZe3D8UHszP4FA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Ann L.", 
    "review_text": "I like eating there when it's not very busy otherwise you just have to have patience cuz it's a bit of a wait.  They only have a small oven and it takes time to make your sandwich.  I got a meatball sandwich to go..it came out to be $9.22 that's with tax, pricey right?!!  In the past I had a cappucino which I liked, $2.25.\n  they take credit card, God bless them.", 
    "review_date": "2006-03-31"
  }, 
  "2UcWRvyQDYlVh_4pOfYd5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter K.", 
    "review_text": "I always say that I never give out 5 stars unless I am willing to call someone and tell them about a place. This is one of those places.  I love Mario's because of it's authenticity and its history. The place has been around for many many decades and you can tell. They have amazing sandwiches (esp the chicken focaccia). They also have good selection of wines and their cappuccino's are excellent.  Above all else, it's a neighborhood spot. I love going in and sitting in the corner table and writing for hours. During the day you can people watch as they walk through North Beach or play in Washington Square park. The people who work there are all very interesting and great conversationalists. Almost as an art form. On nice weekend days, they open doors on both sides of the establishment to get a great cross breeze and an influx of neighborhood characters.  CLINCHER - They play the best music. I discovered Calexico here - one of my favorite bands  ONLY COMPLAINT - no wi-fi... then again, what restaurant/bar does right? Bad for turnover I guess", 
    "review_date": "2009-04-23"
  }, 
  "DEtFNQFuUphOVcgD2Kbn6A": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Monica S.", 
    "review_text": "This isn't \"fancy\" Italian food. But it's honest and satisfying. My favorite is their lasagna, an unpretentious mix of noodles, rich tomato sauce, goopy mozzeralla cheese, and ground beef. Salty, fatty, meaty goodness. Sometimes, when I'm elsewhere eating fancy lasagna, I wish it were this.   The space is small and cozy and has nice views of the nearby church and park. It's a great place to read a book and sip some wine.", 
    "review_date": "2011-11-13"
  }, 
  "xpRAjmgL-pIcIY_9iOpcQw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay W.", 
    "review_text": "Cramped, loud, piss-poor wine selection but an all-time favorite.  If you haven't had the focaccia sandwiches, you really haven't lived.  Go with a friend, get one meatball and one sausage and go \"halfsies.\"  Otherwise if you get the meatball you're going to wish you'd gotten the sausage, and vice versa.  And don't let 'em be stingy with the pepperoncini...they'll try but don't let 'em.", 
    "review_date": "2006-05-12"
  }, 
  "k3Ter4z5RGBuPGeTVt067Q": {
    "user_rating": 1.0, 
    "user_location": "Chelsea, Manhattan, NY", 
    "user_name": "Fraser W.", 
    "review_text": "This used to be a great cafe overlooking Washington Square park. However, as other reviewers have noted, the 'hipster' staff appear to see customers more as an annoyance. Service SUCKS...especially if you grab a table outside. We waited 30 minutes and still had not ordered a drink. When I went in to order the food myself the rude barman said \"I won't take your order  - that's why we have a waitress\". When I questioned waiting 30 minutes, he said. \"We'll get to you when we are ready\". At that point we left. Seriously....there are too many good choices in the neighborhood - my advice, skip the attitude and try one of the other cafés instead.", 
    "review_date": "2014-07-12"
  }, 
  "PtK1p7dF6k4ljUivjLdALg": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Manuel W.", 
    "review_text": "Good paninis. Nice location across from the park.", 
    "review_date": "2011-05-02"
  }, 
  "he4K1UtoD4Su54SbCoFkUw": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Sean MC E.", 
    "review_text": "Give me the sun in washington square and a Chicken #2 sammy and I'm happy. as long as the chicken is cooked right. I give Mario's 3 only, only because the quality of food can be hit or miss. At times the food can be over cooked, dry etc. Pizzas included, and other times, i'd say the majority, the food is killer and its a great addition to a day is washington square.", 
    "review_date": "2012-08-08"
  }, 
  "YEB1pj90TVwomI97OBqPKQ": {
    "user_rating": 4.0, 
    "user_location": "Coronado, CA", 
    "user_name": "t d.", 
    "review_text": "Great sandwiches and salads.  The place is small.  The staff is friendly and fast.  Good atmosphere.  I've not had anything bad here.  Anything on their foccacia is good.  I love the eggplant, my children and husband love the meatball and chicken sandwiches.  Their coffees and expressos are outstanding.  I feel compelled to consume quickly and get out to make room for others, and there's always someone waiting for our table.", 
    "review_date": "2010-05-30"
  }, 
  "4dclJLG4cO_ACx2zkCbjag": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Esther K.", 
    "review_text": "This is a great place to eat lunch or take it out and eat it in Washington Square Park (on one of the few days San Francisco is nice to you and the sun shines).   I will order anything with the dijon mustard on it and Chicken #1 and the meatball sandwiches are my favorites! It takes awhile for them to make your sandwich (about 10 minutes if they're not that busy), but it's worth the wait. The foccacia bread they put the sandwich on is so good.  The cheesecake was kind of a disappointment though. It kind of tasted like thick egg bread and wasn't what I expected at all.", 
    "review_date": "2008-08-14"
  }, 
  "QqcWKvwLBzXKLqdJnbbgAg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary L.", 
    "review_text": "Came here for lunch today with some co-workers since we work really close by! It's a cute little cafe with a catchy name and I've been wanting to try this place! I ordered the breaded eggplant sandwich while my coworkers ordered lasagna, chicken salad, and polenta &amp; sausage. After taking a few bites of my eggplant sandwich, I ended up opening it up so I can add in some salt &amp; pepper. It was a little too bland for my taste, in which one of my coworkers agreed also. As for the breaded eggplant, it was thinner than I thought it would be! If I do come back, maybe I will try a pizza instead next time!", 
    "review_date": "2014-10-08"
  }, 
  "hVm6iln51tI4gkM5o5PbOA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John P.", 
    "review_text": "Food is very nice - A little overpriced for the sandwiches and 'weak' italian soda's, but it is San Francisco after all. What lets this place down is the service - or lack thereof. I realize when things are busy the servers might take longer to take an order or check on you, but today was the final straw. Considering I have been here a few times before, I expected to wait five minutes for the staff to acknowledge me, but twenty minutes of sitting outside and I still didn't have a menu, glass of water or any awareness that I was there. Indeed other folks on the five tables outside also seemed rather confused (this is a tourist area). Once I did get service, the waitress had a serious attitude - as if I had somehow inconvenienced her somehow. Seriously....she's a waitress...that's her job. Even better if she has a smile on her face. But no...By the time I got the check, I just wanted to get out of there.  To the management of Mario's: Your service is getting worse. I for one won't be back, and judging from some other reviews, the hipster attitude is alienating your regular customers. Believe me...when the tourists leave, its the locals who keep your restaurant in business.  Shame....but there are too many other places to get coffee and a sandwich who make your feel welcome.", 
    "review_date": "2014-07-12"
  }, 
  "2nBPGg56am7XoOdGR4tofg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Caroline T.", 
    "review_text": "This is a cool and cozy place to get something to eat and drink in a fun location with great people watching across from Washington Square park. The food is simple, but really tasty and satisfying. The meatball sandwich is great, and my personal favorite is the lasagna (which I am always a sucker for, no matter where I am). Every time I get Mario's lasagna, I am presented with a bubbling dish of gooey, cheesy, meaty, tomatoey goodness. Again, it's all pretty simple stuff, but it really hits the spot. Add to that a beer or glass of wine with a view of the (hilarious, in my opinion) segway tours that often pass by outside, and you've got it made.", 
    "review_date": "2012-06-08"
  }, 
  "SpNerb3jINdfMvpN-4L5PA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth C.", 
    "review_text": "Not all of us ordered food, but those that did were really satisfied. We had lasagna, which had a bit of a sweet flavor to it. My fave dish of the night, the oven baked meatball sammy with swiss cheese, onions, and marinara on onion focaccia bread. The focaccia, which came highly recommended lived up to the hype. The crunch of the bread combined with melted cheese and warm sauce was a great combination. We also had the grilled chicken #1 sammy- dijon mustard, pepper jack cheese, and onions on the amazing focaccia bread. This one was good too. I had the caprese salad- fresh mozzarella, sliced tomatoes, and fresh basil pesto. This was tasty, the pesto was awesome. Mario's is priced right, the service is excellent, and the food is terrific. For a more detailed review visit:  <a href=\"/redir?url=http%3A%2F%2Fconsumingcolumbus.blogspot.com%2F2013%2F03%2Fmarios-bohemian-cigar-store-cafe-is.html&amp;s=4834a95f57d164e2eeae276d565e6873827083a413a4f5e6c9236cf6a21bac8a\" rel=\"nofollow\" target=\"_blank\">consumingcolumbus.blogsp…</a>", 
    "review_date": "2013-03-22"
  }, 
  "mLSmllyXR9psRMFqQiET8Q": {
    "user_rating": 5.0, 
    "user_location": "Littleton, CO", 
    "user_name": "Steve S.", 
    "review_text": "Gem of a find.  Small and friendly, best lunch experience I had on my entire San Francisco trip.  The pastrami was beautiful...", 
    "review_date": "2014-08-28"
  }, 
  "aYATgajrWIiL8be0Ty-CbQ": {
    "user_rating": 3.0, 
    "user_location": "Roanoke, TX", 
    "user_name": "Jessica C.", 
    "review_text": "On our adventure through Little Italy we stopped by Mario's because we heard they had a mean meatball sandwich.   We walked in, and I don't know if the girl working there could tell we were tourists but I got a weird vibe from her. Like this was a local spot and she didn't know what we were doing there. Or maybe it was just her being an awkward hipster girl...I'm not quite sure. Either way, I didn't get a good vibe. Since we had already been exploring elsewhere we ordered one sandwich to go.   When we got to the hotel we finally started grubbing. The sandwich was very good! It was melty, gooey and flavorful. The cheese, meat, veggies and sauce went well together.  If it was based solely on the sandwich this place would be a 4 stars, but because of the snobby girl, I'm giving it a 3. Oh, wellll.", 
    "review_date": "2012-03-04"
  }, 
  "neL0eerLKJXPmWqxDjNIWQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jeddie k.", 
    "review_text": "Gah. I hate to do this. I really do. I wanted to like you Mario, but you just weren't for me. Maybe it was the rainy dreary weather. The hunger. The thoughts that kept drifting to Liguria's or Mama's or even Tartine's in the Mission... Whatever it was, this didn't match up.  I was determined to try a new place in North Beach since I had been to a couple of the places already. Liguria's- good. That other place on the corner that was pretty un-rememberable that I don't remember the name- not that special. But, I was yelping and I had just dropped off stuff in Chinatown to get altered, so I thought I would try the paninis here. In truth, they were okay. The bread was okay and the toppings okay.  A pretty good \"half sandwich\" for 5.50. Turkey for my mom, veggie for me. But bland sir, bland for my taste. I was hoping for some interesting spread or quirky cheese to spice it up, but it was just...okay. I had this eggplant affixation, but alas this place did not relieve me.  However, on the upside, probably one of the best mochas I've had. So go there for the drinks. Or at least the mocha.", 
    "review_date": "2011-06-06"
  }, 
  "8p-kv82J5uP3583thTPa4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "the meat ball sammich is still the best!, that is all.", 
    "review_date": "2009-11-03"
  }, 
  "pAGSv-8vo6k6hpgqw_fIdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Netty L.", 
    "review_text": "Yay Meatball! Cheap Italian style food in North Beach? Yes! It exists! Mario's is a great place to get an affordable tasty meal, have a drink, and oogle all the people as they pass by Columbus Ave. I highly recommend the Meatball Sandwich. I think it's the only thing worth ordering. mmm. Pilsner and Meatball.", 
    "review_date": "2005-06-23"
  }, 
  "fsmEp-zDD-sqXoMnmBX6Yw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve L.", 
    "review_text": "KInda like \"Cheers\" for the 94133.", 
    "review_date": "2007-05-06"
  }, 
  "4DWrjufPQW7Xeb-HgsVU3g": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Damen D.", 
    "review_text": "I was going to say I was unimpressed with the size of the panini sandwich. But then I did some research and found out panini is the plural of panino which translates to \"small bread\". So egg on my face.   So instead I'll say the panini is good and I am really anxious to try some of the bigger varieties of sandwiches. A panini is more a snack you and a friend would share as you take advantage of the beers on tap.   But the real draw is the Americano. So far the best I have had in SF. I know it is just espresso and hot water, but beyond Starbucks it's tough to find good ones and Mario's Americano is great.   I just love the fact you can get an espresso drink and a biscotti or other dessert or load up on carbs with beer and Italian food. Or both in the same day if you plan it right (one of these days).   And the location right on Washington Square is unbeatable. Considering 90% of Columbus Ave is tourist traps, Mario's is a must see European style cafe, even down to the slow service. But hey, why are you in a hurry in North Beach?", 
    "review_date": "2009-06-26"
  }, 
  "2NuzVdjq89uIOCwRzEHeFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark M.", 
    "review_text": "Mario's is a great place to hang out on a rainy afternoon or evening. It's a neighborhood spot - tourists tend to stay out.   I simply haven't found a better meatball sandwich, ever. The other items on the menu are good. The pizzas are nice. But I only eat the meatball sandwich.", 
    "review_date": "2008-02-24"
  }, 
  "PGo2u9t4sLCg9tEpbFXMtA": {
    "user_rating": 4.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Peterson H.", 
    "review_text": "This was my first visit to Mario's. I tried this place on a whim and was very impressed. I ordered the Combo sandwich which was perfectly toasted. I also ordered a glass of wine to go along. Thanks Marios", 
    "review_date": "2008-10-11"
  }, 
  "Qkr_FLR4eLftWT294dpjlw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geoffrey B.", 
    "review_text": "Best focaccia sandwiches, great espresso, and a variety of beers and wines. Good music. Hip spot, and lovely view of WA Square Park with Sts. Peter &amp; Paul in the background. Been coming here since the old man owned in and the place was full of cigar-smoking men parlando italiano!", 
    "review_date": "2009-03-27"
  }, 
  "ZGiXcOTc508cAer5aZlQqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dorothy L.", 
    "review_text": "this place makes consistently great sandwiches on focaccia bread however don't go for the service.  they have been known to be brusque.", 
    "review_date": "2006-07-25"
  }, 
  "kGo4PwSjA_t27Dsj71WldA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John R.", 
    "review_text": "\"to the pastrami sandwich\"", 
    "review_date": "2015-01-17"
  }, 
  "R_aCqb62GyeU2h7OmSufeA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Julie F.", 
    "review_text": "Best sandwich ever!  Ever!  Yes, it's really that good. Try their foccacia sandwiches, you'll be back again, and again for them. I go here about once a week. This place is my go to spot for chilling at a restaurant near the park, people watching, good sandwich eating, and having a great meal for a reasonable price. Don't expect the severs to wait on you hand and foot, but the service isn't bad either. They'll get your food and drinks to you in a reasonable amount of time, but since the place is so small they will probably be busy. You might have to wait to get a table if you come on a weekend, but if you're looking for an amazing sandwich, do yourself a favor and wait it out. It'll be worth it :)", 
    "review_date": "2009-03-10"
  }, 
  "9GHA-fDa3gIzU3WyHrdrpg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy P.", 
    "review_text": "Come here if you want sandwiches and beer.  It's like a bar with tables, and without the TV.  This is the perfect Saturday lunch spot if you want to be able to just chill and get some quick food on the sorta cheap.  I live in the neighborhood, and hit it up at least twice a month.  The only food I can vouch for is the eggplant pannini and foccacia sandwich, both baked and breaded. Good stuff man, I think the arugala makes the difference... and that fine ass north beach bread.  My friends assure me that the dead animals they serve are consistently delicious as well.  Also, it's not too touristy, which is always a worry in North Beach.  They would get 4 stars but... at the end of a day it's only an eggplant sandwich,even if it is the best I have ever had. They would have to stuff that eggplant with truffles to get 5 stars from me.", 
    "review_date": "2006-08-26"
  }, 
  "OphYmSCK6VrMMXMA7AtdEQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Corinne L.", 
    "review_text": "Great spot for people watching &amp; having a beverage. Liked the staff - was offered a free beer, but seeing as I don't drink beer anymore and my date was doing all the driving, we declined. Food looked good.", 
    "review_date": "2010-09-27"
  }, 
  "PL4kWPoeNgVP-oJK_lPGGg": {
    "user_rating": 5.0, 
    "user_location": "Piedmont, CA", 
    "user_name": "alfio l.", 
    "review_text": "Killer sandwiches!  Love it!", 
    "review_date": "2008-01-21"
  }, 
  "iuM58omo8jIrLvO31w-L-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "toome b.", 
    "review_text": "This place is the bomb-diggity. Tasty morsels and all the right details when I want to go Italian and get my draft Anchor Steam.", 
    "review_date": "2009-08-20"
  }, 
  "slD4NzJqbv_ehv1kQa4D1A": {
    "user_rating": 5.0, 
    "user_location": "Reading, MA", 
    "user_name": "Liza M.", 
    "review_text": "11/18/09 I had a delicious foccacia sandwich with grilled eggplant, $6. nice that you can choose to only get half a sandwich. I seriously could have eaten there everyday, that one taste I had was so good. Staff was nice too. I was alone, so I sat at the bar. Sad the hubby never got to eat there as he would have loved it.", 
    "review_date": "2010-02-20"
  }, 
  "HvUXiTSN-Y8raG1pqQubtQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anya B.", 
    "review_text": "I brought an out of town friend here, and it was cold inside, my tea was so-so, and the food wasn't too impressive.  But it's a great place to sit and enjoy the view of the Washington Square.", 
    "review_date": "2006-05-28"
  }, 
  "vcudFvE9T6_wV-2zEA9-iw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fay V.", 
    "review_text": "Their meatball sub is not to be missed. Very cute hole-in-the-wall vibe, and foccacia from the bakery across the park. Seriously, their meatball sub is the best!", 
    "review_date": "2013-03-18"
  }, 
  "Fbtnt96HKD3ISMvmqGTNAg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Lisa C.", 
    "review_text": "i went back on saturday around 12:30.  it was SUPER busy and since its such a small place, it was kind of hard getting a table and service. but nonetheless, it was still delicious :) good job guys!  note: its all about timing when you come to mario's on a weekend. but its worth the wait!", 
    "review_date": "2010-04-25"
  }, 
  "686PUfFvZ-Y4b0opAUtikw": {
    "user_rating": 3.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Magdalena ..", 
    "review_text": "Met friends for lunch here yesterday and though I enjoyed the food and the company, I didn't get what the big deal was about these sandwiches.  Maybe if I'd had their signature sandwiches, Meatball, or Sausage, I would have had a better idea.  But, they were out of both.  So, I had the grilled chicken #2.  It was good, but, I've had just as good at other places for less money.  It's a great location, right across the street from the park, for people and dog watching, of which I enjoy.    However, I feel my friends hyped this place up too much.  So much so that my expectations were probably impossible to meet.", 
    "review_date": "2007-09-04"
  }, 
  "jxdGL90JR1b6UTvfxwW9TQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laurie H.", 
    "review_text": "I cannot believe that we lived 2 1/2 blocks from here and never went. Dammit.  Had to grab a quick bite before our son's concert across the park at St. Peter &amp; Paul on a Saturday night. Sat at the counter - me, hubby, daughter. Ordered the half carafe of wine while waiting for hubby to find parking.  Daughter orders caprese and a pizza. She has pronounced it the best caprese in the world - the tomatoes were perfectly ripe, the mozzarella was the freshest she's had, and instead of just a basil leaf, they topped it with a dab of pesto which she loved.  I had the grilled eggplant half sandwich plus a salad. It was the best, most simply satisfying sandwich ever. The caesar was just fine.  Hubby also had the sausage half sandwich/salad combo and he liked his meal as well.  But what gives them the extra star(s)? Service. They were so incredibly friendly.  In fact, while we were there, one of the people associated with our concert came to get some to-go sandwiches for a few of the boys who were singing. They made them as fast as was humanly possible with only 2 guys working the whole place and most of the tables taken.  And towards the end, after we paid the check, they realized they didn't charge us for the half carafe of wine...so they apologized, brought the bottle over and filled our glasses to the top gratis, and then gave us the wine check for the original half carafe. That made me so happy because I wanted just that one more glass of wine but wasn't going to order one. I love it when people make inconsequential mistakes but have the good sense and superior customer service approach to make it an opportunity instead. They have guaranteed my return business by that simple gesture (which they didn't need to do) and this is exactly why I will be back again and again.", 
    "review_date": "2010-05-03"
  }, 
  "IH28llFlUXRfsckbxDryqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie K.", 
    "review_text": "I discovered this perfect little cafe the moment I arrived in San Francisco over a year ago now. It has served as my favorite hide-a-way in North Beach. I do my writing here as I enjoy a glass of wine and a macchiato. Ah balance.", 
    "review_date": "2008-10-29"
  }, 
  "NmWYBMJJgWpNyN7DLDVaWQ": {
    "user_rating": 5.0, 
    "user_location": "Lodi, CA", 
    "user_name": "Perry M.", 
    "review_text": "Been eating here since the days of them selling cigars. Yeah it stunk up the plaace, but now we can reminisce how cool it was...      Look most places in North Beach are touristy traps, but the  places still original in my book are Marios and Stellas down the street. They treat you right here, are nice and by the way make good foccacia sandwiches. Hits the spot after a walk from the Embarcadero over the Filbert Steps.      They play pretty good catch with the dishes when they're done cleaning them too! Never seen em drop one!", 
    "review_date": "2008-10-11"
  }, 
  "5z2nW6VytwdX3-aEpmTRTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis M.", 
    "review_text": "I first popped into this comfortable cafe while I was trying to avoid the drunken crowds on St. Patty's Day.  It is a great place to sip a coffee  while watching the pedestrian heavy streets of North Beach.  The table in the very corner of the wedge shaped cafe is the best seat in the house. Slip into this cozy spot on a cool and breezy San Francisco afternoon.", 
    "review_date": "2007-10-24"
  }, 
  "5eNzy6FRdxQlkiCMFBFgRg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia W.", 
    "review_text": "This would be a long, glowing review if I ordered more than one thing over and over and over and over again--\"The Combo\" focaccia sandwich. The best hot club you can join.", 
    "review_date": "2008-01-03"
  }, 
  "BM6d18JXD4639bgRqtWc7w": {
    "user_rating": 1.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Molly G.", 
    "review_text": "Came here with my boyfriend after seeing the great reviews. We saw a few reviews that warned about the service but thought, well if the food is good who cares. After an hour and a half of waiting (with people who came much later than us receiving the same food we ordered) I was ready to get up and leave. The food came right then and I thought this better be as good as the reviews mentioned. We got a meatball sandwich and a pizza and let me tell you, it was mediocre (and I was starving so that says something). You could go to literally any other Italian cafe in this area and have something better that doesn't take an hour and a half. Oh and I forgot to mention, the servers were pretty unpleasant. Needless to say, I suggest you avoid this place.", 
    "review_date": "2014-07-19"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "All about the focaccia sandwiches. So good! Can be really slow sometimes, but absolutely worth the wait.  I really can't describe just how yummy it is.", 
    "review_date": "2005-11-30"
  }, 
  "Z4t8gv0MPl26KdeNOBov-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R A.", 
    "review_text": "I can't really be objective about Marios. I've  been going to Marios for so long -- I've known so many people who work(ed) there spanning so many eras. It's a true North Beach institution and rivals Cafe Trieste and some others in that regard. It has its 'people' and following. I can't be objective about the food or service, since I've had everything they make 1000 times and know everyone personally who works there. This place has been a home to me. And I appreciate Paulo the owner and all the various people over all the various time periods that has made Marios a part of my life.  For the unintiated, Marios is a place you go to just hang out and be merry. You have some red wine, order a pizza or a meatball sammy and talk loud and be animated or sit outside on the stockton street side between 4-6 when the sun is shining there and people watch.  Be cool with the people who work there and they will be cool with you. Tip well and they will be even cooler.  Marios hours sort of roll with how busy it is, it can be open late. In the old days it was open really late on weekends, and I still think the owner should re-consider serving food til 12:30am on Fri and Sat., as there is nothing this end of the 'hood to get a pizza when hungry late.  They selection of food is not vast, but it what it is and its consistent. This is not a place to come in being a vegan or foodie. Just be cool. Bring a cool book or some post-cards or a scrabble board or deck of cards or your flyers for your next gig or some Euro hotties you just met -- converse, hang out, see what happens -- and enjoy a beer and go on about your business. A pretty good tiramisu, carrot cake and some other treats to go with the coffee. No soy here! You want raw milk without pasteurization? I applaud you -- just don't come looking for that at Marios. This is a good old fashion real authentic north beach haunt.  Bravo!  PS Once you couldn't smoke inside anymore, they did away with the cigars -- and they finally got a credit card machine a few years back after being known for \"cash only\" -- i took great pleasure watching a guy on a first date sadly have to make the walk up the block to the ATM...ah, the good ole days... :-)", 
    "review_date": "2008-08-26"
  }, 
  "qYtceH6w5ZD2_CKsZCJdqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan W.", 
    "review_text": "Cozy, Euro and very friendly. Munch on the smoked turkey foccacia sandwich while downing the smooth house red wine and plan the revolution. If you need further fortification, try their tiramisu and cappuccinos.", 
    "review_date": "2007-04-25"
  }, 
  "5xFkiPEarQUZMbUcJYz8Rg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza B.", 
    "review_text": "4.5 stars...well I can't give 5 stars all the time or you'll never believe me.\n  I love this place...I'm almost a regular, but only eat lunch here about once or twice a month so that doesn't quite qualify me.\n  Today a Perfect Cappucino and also a perfect Eggplant Parmagiana. I only drink coffee about once a week, so that perfect gets a capital \"P\"  - when you only drink coffee once in awhile, it better be good. Don't ignore the parmigiana ~ it is lovely ~ delicious and hot. Other sandwiches and caprese, etc are all very good.\n  They should get that 5th star today for being so FAST! I've had a few lunchtimes where they slowed down my return to work too much and I couldn't come back for awhile.\n  Two gelaterias nearby, so you're all set for dessert. Although the cakes and pies are yummy right here.\n  p.s. I came here when I was very young and remember the actual cigar store! How many people can say that?!", 
    "review_date": "2006-10-24"
  }, 
  "iC7X-D9ks5u8W5jKtzttiw": {
    "user_rating": 4.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Greg S.", 
    "review_text": "i love their meatball focaccia sandwich!", 
    "review_date": "2008-03-04"
  }, 
  "Ow_oHwqaBBRuUAiNrL8rRw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie S.", 
    "review_text": "I love this Place on Columbus in my favorite Neighborhood \" North Beach\". Small Cafe with great I mean Great Eggplant sandwiches. They are so fluffy and light and big!. They are so tasty I always get one to go.  You can sit there with some wine or beer and people watch folks on the street or St. Mary's Park. It such a great place , check it out.", 
    "review_date": "2011-01-04"
  }, 
  "jFSrZYDK85AM4Yhrbg99kg": {
    "user_rating": 1.0, 
    "user_location": "Clayton, Saint Louis, MO", 
    "user_name": "Michelle B.", 
    "review_text": "ridiculous service!  the espresso was awful and asked for a refund.  the Italian sounding barman said it's a perfectly fine espresso and \"you must pay 2.75\" !no offer to make a different one or compromise in any way.  plain nasty experience.  after all we are on vacation Mario,  so please take it easy- your espresso is bitter,  watery and gross!", 
    "review_date": "2013-12-17"
  }, 
  "woLSJl4U1Un0lfYTYpCUwg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "On my last day in SF, we were supposed to eat at Sotto Mare, but it was closed, so we found Mario's, which was said to be good.    Mario's really looks like a small bar or cafe; there is enough seating for maybe 20 people in the bar, and it's slightly crowded in the sense of space, but that didn't bother me too much.    When we first walked in, we weren't sure what to do because no one came to us so we seated ourselves and then requested menus at the bar.  Then we found out that there are actually servers that do that for you, and one tended to us from there.  Servers are very friendly, which was nice.  I ordered the meatball sandwich, which is HOT &amp; delicious and possibly the most flavorful meatball sub I've eaten.  It was slices rather than a whole meatballs and covered with cheese and marinara, on foccacia bread  which was crispily toasted and served with a side of pepperoncinis.  It was an expensive sandwich ($9.75), but I would have it again.  Being the fatty I am, I had to have some of my friends' sausage sandwich, which was also really good, and a bite of my brother's canelloni, which had a homemade taste to it.    The location of Mario's makes it a good people watching spot.", 
    "review_date": "2009-10-21"
  }, 
  "kpKV8hwc-pkMDKO5eKdjlQ": {
    "user_rating": 5.0, 
    "user_location": "Midtown West, Manhattan, NY", 
    "user_name": "Michael P.", 
    "review_text": "I think this place has amazing character.  I love the meatball sandwich and sitting outside facing the park.  On a sunny day it is the ultimate North Beach experience. Love it.", 
    "review_date": "2014-11-07"
  }, 
  "hj7U5xIeohSoryeV2yVvRA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "allegra f.", 
    "review_text": "Apparently I had a cigar theme last night. Ducked in here while waiting for our table at the pizza place around the corner. Super chill vibe, and the bartender even juggled the oranges before slipping them into the blue moon.  Grabbed a nice table outside, and watched the parking on the street and everyone taking photos of the park at night. ?  I think that I just don't understand this part of town sometimes.", 
    "review_date": "2009-10-18"
  }, 
  "Sh_tZqIfhWHdvbAQTf5ofQ": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Tuff G.", 
    "review_text": "Cigars . . . No. . . Good eats. . . yes sir Simple, yet just what the doctor ordered. We stopped at Mario's for lunch on a beautiful Sunday afternoon, post walking around North Beach all morning. The place is simple, and tight, with about 6 tables along the windows and then a counter overlooking the small kitchen, boom, that's it.  The guys were great on the service! The atmosphere is quaint and super friendly. The three of us split up a Chicken #2 panini, and the (man this was good!) eggplant panini. They were both great sandwiches. As commented by others, no sides here, just your sandwich. But, you know what, I didn't care! We three left completely satisfied. The focaccia bread was wonderful and fresh, the veggies seasoned and cooked excellently, and the chicken and the eggplant, nicely seasoned (eggplant was breaded). For a quick stop to a local shop, I definitely recommend Mario's, for a bite to eat in an old world location. And, don't be afraid to ask the boys about their coffees. They know about their coffees.", 
    "review_date": "2010-02-21"
  }, 
  "4yLpXuXv8XqeaT0GvP60SQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna R.", 
    "review_text": "This place was fantastic! My Bf and I just got back and I am beaming Im so satisfied. He ordered the chicken panini and ordered half of a grilled eggplant and vinagerette sandwich. For $5 is was huge! And the best $5 ever spent. It was cozy, busy and we barely got a table but it was close to our new house and we've always wanted to try it. Im so impressed by this place! Good coffee, no soy milk though, kind of a bummer, so I had an italian soda which was delicious.", 
    "review_date": "2009-03-22"
  }, 
  "GO0GU6sTOdgtUpAwzj1Tbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Manny R.", 
    "review_text": "I like this place a lot,  Compare to the rest of the places in North Beach I like their straightforward concept.  Small Cafe, small but well done menu.  Reasonable prices and great location.  Taking into consideration the location you would think this is a tourist trap and on the contrary this is more of a locals place.   The people working there are nice and seem to enjoy their jobs.  Grab some coffee, a beer and lunch and sit outside on a sunny weekend to people watch.  Go to Washington square park on a sunny weekend and walk across pick up a beer and sit outside", 
    "review_date": "2012-09-13"
  }, 
  "z-ElbRef0nw-QLwzfEZENw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Annabelle S.", 
    "review_text": "When you drive by Mario's and there's a parking space right outside, you have to take it. Then you must go into Mario's, grab a seat at the bar and order a beer and a meatball sandwich. They serve it on Liguria green onion foccacia and toast it in the oven. That sandwich is one of the most delicious things that you'll ever eat: the perfect amount of sauce, cheese and meatballs nestled inside the best toasted foccacia. With pepperoncini on the side.  I've also had the eggplant sandwich and it was heaven as well, but for some reason I almost always gravitate towards the meatballs.", 
    "review_date": "2014-10-22"
  }, 
  "3uIqew23Ev1SOMVEvLHD_w": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Sam A.", 
    "review_text": "You can't beat the adorable atmosphere with rickety wooden tables and a view of the park. Get the chicken sandwich (add tomatoes if you like). Their mustard has a delicious kick to it - watch out if you're a little sensitive to horseradish-esque tastes, but it's SO GOOD! Cheap carafes of wine as well. It's not the most amazing, droolworthy, tell everyone you see meal in North Beach, but sometimes you just want to grab a leisurely sandwich in a really comfortable, cute, pleasant atmosphere. Go!!! Perfect weekend afternoon stop.", 
    "review_date": "2014-01-14"
  }, 
  "mtpek5XdI8oqrA5KCGFXZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bumble B.", 
    "review_text": "Mario's Bohemian is a North Beach institution.  The tables out side face Washington Square park and are perfect for people watching but I like to sit at the bar.  The service was quick and friendly. My sausage sandwich was delicious as was a cappuccino with Vov.", 
    "review_date": "2013-11-14"
  }, 
  "QH35cIYlQ9JKW27jGlrE8Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate H.", 
    "review_text": "Great sandwiches, friendly proprietors, classic North Beach charm. Ask for the Chicken #3! (Not on the menu )", 
    "review_date": "2012-06-28"
  }, 
  "xAwSWwRUpQh5GD_Cmdsr8w": {
    "user_rating": 3.0, 
    "user_location": "Trabuco Canyon, CA", 
    "user_name": "Diane E.", 
    "review_text": "The food, if you ordered a focaccio was great.  That is what they are known for.  Everything was good.   The service, on the other hand was not good.  I don't ever remember a waiter scolding me for anything.  This guy was just a bear to deal with.  We had eight people and the place was tiny.  After four failed attempts to situate ourselves and four rethinks he finally came up with a solution that should have been the first thing out of him mouth.  I asked for additional dressing for my salad and was told that there was already dressing on the salad.  I had obvioulsy tasted it and got an argument.  Then he set down a huge bowl of dressing and told me that it should be enough.  What is this guy a waiter or my mother?  Get a new waiter guys, and update you menu a little to accomodate people who can't eat wheat. I only ask for one nice salad.  You have the ingredients.", 
    "review_date": "2012-08-10"
  }, 
  "MQbaGVfwGnddzrcABnS-Fw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Troy C.", 
    "review_text": "three letters OMG.. this place is awesome and I mean awesome.   the fococia is just sexy and the service exceptional.  the Italian sausage sandwich is heaven.  it is my new regular spot.", 
    "review_date": "2012-05-18"
  }, 
  "Zcr90BeQ8QWV32XIqpH82A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake W.", 
    "review_text": "I can't believe I haven't reviewed this place!  Mario's is an institution in a neighborhood full of institutions.  The place just oozes character in its funky little way.  The sandwiches are great, the beer is cold, the location is rocking.  One of those places that so easily could have been taken over by tourists and stripped of its character (there are plenty of tourists, but the character is still intact), Mario's still is going strong.   Go with a friend or two, get a carafe of the house wine, and just enjoy.", 
    "review_date": "2006-05-30"
  }, 
  "LZzyszEXnhr3KzPs6GWM1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eva H.", 
    "review_text": "Service: 2.5/5 Food: 3/5 Wait: 3/5 Price: $$ Portions: 2/5 Presentation of food: 4/5 Presentation of restaurant: 3/5 Overall: 3/5  I HAD THEIR CHICKEN PANINI WITH PESTO, ITS GREAT. BUT THE FACT THAT IM PAYING $8.50 FOR A SMALL SANDWICH... WITH NOOO SIDES WHATSOEVER, AND THEIR SALADS RANGE TO $6.50-$10! ITS QUITE PRICEY FOR SOMETHING SMALL, ITS NOT THAAAAAAT GOOD FOR IT TO BE SMALL AND EXPENSIVE. THEIR SERVICE WASN'T ALL THAT GREAT NEITHER, THEY SEEM TO DONT REALLY CARE FOR YOUR BUSINESS IF YOUR JUST THERE FOR FOOD?? IONO...", 
    "review_date": "2009-07-22"
  }, 
  "mGfCCHRkpuzfygPzg92-Ig": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Emily M.", 
    "review_text": "Great beer selection and a nice view of the park.  My panini was delicious, despite being a bit over toasted. I'd definitely come back!", 
    "review_date": "2009-10-26"
  }, 
  "UzW_6PaLFzPjP7_2Czk3Wg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin K.", 
    "review_text": "I was confused by the name since I don't think they actually sell cigars.  A cigar store that sells sandwiches definitely sounds like a dive, but this place had decent Italian-style panini sandwiches.  I wasn't thrilled by my grilled eggplant sandwich flavor-wise but I'm pretty sure their other offerings are much better.  The ambiance is pretty hipster.  The staff was friendly and funny.", 
    "review_date": "2012-01-15"
  }, 
  "m6p5knAyIS79s6WNbeIdGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen E.", 
    "review_text": "This is a great and affordable spot to grab a sandwich in northbeach. It is one of the few places where you can find a meal for under $10 and they also have a pretty affordable wine list. Mario's is also located on the corner of Columbus right next to the park, which can be amazing for people watching.", 
    "review_date": "2010-12-05"
  }, 
  "kOSLWOSDJrllntYg4b-Jmw": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Debby W.", 
    "review_text": "Former \"Old School\" now a \"hipster faux school\" joke.  Quaintly triangulated corner location with old San Francisco charm.  We enjoyed the good coffee, great food, mellow local staff who were nice and efficient.  Especially loved watching the former Hispanic chef who'd whip out amazing panini's, pizzas, and salads that made you wish you had more room in your belly.  He virtually danced while he cooked, watching him cook was the enticement and entertainment.    This has been a \"must stop\" on regular visits to San Francisco.  On our recent \"must stop\", the waitress for the outside tables was efficient and friendly, but there was this mustache guy who couldn't move his face or serve a beer in the time it takes to pull a tap.  We came again the following day, service was so slow to the point where you wonder if you should help yourself.  Was left alone with our \"one\" beers long enough and decided to go, when I went in for the  bathroom.  I could've been a new customer since I only sat outside while partner went in for the service and the check.  I walked passed the mustachioed, a gal, and another bearded hipster guy who looked at me without saying a word nor moved their faces.  It was like the hear-see-speak no evil monkeys, lined up behind the bar.  Instead, I helped myself to the bathroom without being acknowledged.  THIS is now the place where you can use the bathroom freely without being a customer.  You don't have to worry since you won't be stopped, nor be sold a drink or food.  They won't dare to crack their faces for you. Bathroom is straight to the back, then turn right.  Would've tried the food (didn't see the Hispanic chef), but since we could only get one beer each, used our money in other parts of North Beach where they want to take it.  Lost its real San Francisco local charm, and 2 customers now.  So sad.", 
    "review_date": "2013-11-30"
  }, 
  "opVAP6IrUMSbGsbO3ez2_g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kaylee T.", 
    "review_text": "A charming little spot in North Beach to take a friend for a casual bite or to read a book and have a glass of wine alone. I work next door to Mario's so i've never had the pleasure of actually dining there but I do take-out on average once a week and i'm always envious of the people chillin in this cozy hang out. I usually order the eggplant parmesan which is made with a flavorful marinara and plenty of good cheese.  The pizza is also delicious, italian style with a cracker crust.  A filling meal or a light snack for 2.  For the quality the price can't be beat.  The wine list could use a little work but that wouldn't stop me from coming back again and again.", 
    "review_date": "2008-07-16"
  }, 
  "2U4Y0Hz6tRD1JjKUJF_Z3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sora O.", 
    "review_text": "I love this tiny cafe. Not only does it have a great location by the park/good food/cozy atmosphere/nice-though-not-hovering-servers, but it plays reggae music. And I enjoy listening to Bob Marley when I eat eggplant sandwiches.", 
    "review_date": "2010-01-01"
  }, 
  "zuW3cDC5XRXS9q7Hpwwq6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha M.", 
    "review_text": "Great quick food. Authentic tasty Italian food and totally delicious focaccia sandwiches. This is a great stop for before a show at Bimbo's or before the bar run or even on a quick lunch.", 
    "review_date": "2009-09-20"
  }, 
  "ghost_id_1": {
    "user_rating": 4.0, 
    "user_location": "Stuttgart, Germany", 
    "user_name": "ghost_user", 
    "review_text": "I used to come here when you were still allowed to smoke cigarettes in this place. Most of the time we had tasty ciabatta at lunch or in the evening here, overlooking the square. Marios is a cosy place with character, history and patina.  I stopped by recently and was glad the place still existed. In general I felt Northbeach is stuck in time and has not moved on in the last decades. Parking the rental car was a pain.", 
    "review_date": "2011-12-10"
  }, 
  "a6mFy0UBIlmpGg8aev8YqA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trinity M.", 
    "review_text": "Solid. My favorite is the breaded eggplant sandwich with a glass of house red. Great place to meet up wtih friends for a quick bite before hitting the town. Cappucinos are tasty, too. Hits the spot on a sunny day, if you can get a window seat. The service used to be better a few years ago. Not sure the deal there. Could just be cluelessness or a decision by the staff to treat locals like passing tourists.", 
    "review_date": "2009-03-31"
  }, 
  "hHX3dkAFo93CcG8NnUhdkg": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Ozzy D.", 
    "review_text": "i know this place for more than 4 years.Nice food ( sandwiches )  , kinda slow but friendly service .It's quite European style ,nice view, tasty wine...i recommended...", 
    "review_date": "2010-07-17"
  }, 
  "2obAyPuH-G3Dn3EUdQnQlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dean E.", 
    "review_text": "great focaccia bread sanwiches. the grilled chicken #1 and #2 are excellent as well as the turkey and the combo. great location for north beach people watching, especially if you get a seat looking toward washington square.", 
    "review_date": "2005-04-13"
  }, 
  "AHz3sGxkZjAzv8uu0Q9hqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiromi N.", 
    "review_text": "I can't believe that I just realized that I hadn't drafted a review for Mario's!!!!  It must be all the drinking that I've been doing!!!  Some of which was actually done at Mario's.  This little joint is FULL of San Francisco character.    Are you from out of town and want a slice of North Beach?   Visit Mario's!  They have a slim alcohol list (beer and wine), but the food...oh the food...and the atmosphere.  There is a cast of regulars, as well as tourists that happen to stumble upon this little gem.  Oh...two words...focaccia...and panini...  Now talk amongst yerselves, dahlings!", 
    "review_date": "2007-01-24"
  }, 
  "cdNrjPMAXvqMd4O71dIcrw": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Alex A.", 
    "review_text": "Small, friendly, doesn't feel as touristy as some of the other places on Columbus (granted, I say this as a tourist).   We only had the cappucino (very good) and the biscotti (also good).", 
    "review_date": "2012-09-16"
  }, 
  "v25DMFAod5z3MEEh3uENJw": {
    "user_rating": 1.0, 
    "user_location": "Long Island City, NY", 
    "user_name": "Jeanine I.", 
    "review_text": "This place has really gone downhill! It used to be one of our favorite places when we lived in North Beach but now the service SUCKS!!! We had a horrendous experience last weekend. We got a eeat outside and the waitress kept coming outside but never came over to our table until about 20 minutes later.  She said she would bring us menus but 15 minutes later, we were still waiting (she came outside a bunch of times gave other people menus and took other people's orders but did not acknowledge us.  It was somewhat busy but at least come over and apologize.  I finally went inside and picked up 2 menus, on my way back saying to her nicely \"you look busy, I dont mind getting the menus.\"  She just gave me a dirty look. Then we waited another 20 minutes to get our order taken and we were still waiting.  I finally went into the bartender and he said \"we have table service.\"  I told him I knew but we were waiting over 30 minutes so can I just give him my order.   He basically barked at me in a nasty, loud voice \"YOU ARE AT THAT TABLE OUTSIDE, YOU HAVE NOT BEEN HERE 30 MINUTES, THE MOST 5 MINUTES!\"  I said calmly, no we have been waiting over 30 minutes, I know she is busy but can I just give you my order?\"  He rudely said \"WE WILL GET TO YOU WHEN WE CAN!\"  I was FUMING but gave him back the menus and walked out.  Of course we left after that.   I worked as a barista, bartender and waitress and would never treat a customer that way, no matter how busy I am and especially if they were nice and respectful. The people that worked at Mario's last Saturday demonstrated the WORST service I have ever experienced.  They should be embarrassed.   Needless to say, we wont be going back. If I could give negative stars I would.", 
    "review_date": "2014-07-14"
  }, 
  "m5cBT7OYfn0HM0d-RCsdZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miika M.", 
    "review_text": "Perfect Late Spot  I have several friends.  Shopping friends. Complain-to friends. Driving friends (golf dudes, golf!) Intellectual/Art friends.  One of my good friends would fall under the Intellectual/Art friend since he is really the only one I can go out with to a lecture-a performance-an art show and feel that our intellectual percents totally vibe.  Basically, I think we are creative equivalents, and then he tops that off more by being tops in the technical department.  After a fantastic performance at the SFAI, we wandered over to North Beach for the habitual haunt of either coffee or something tasty to nibble on.  Since I've been on a roll with the gym and my butt looking better in my bikini, I was loathe to roll into Cafe Greco where my fave Tiramisu would be attempting to sabotage my intentions with a little love from behind the display.  We opted for Mario's.  We've been here a couple times before because they are open late, until 11:00.    My friend ordered the Chicken Panini and I ordered the standard Mario's green salad tossed with a balsamic vinegarette.  His panini came right out of the grill: hot, melted, gooey loveliness between two crunchy soft pieces of bread.  My salad hit the spot, a large round plate loaded with crisp Romaine, tomatoes and red onions.  I worked out earlier this morning AND walked 7 blocks in my 2 1/2 inch platform sandals, so two slices of French Bread took refuge in my stomach.  I love Mario's for the casual atmosphere and the typical corner where we could watch the people walk by enjoying this sudden turn of events regarding cold SF weather.  I wore a summer dress out and it was nice to have bare shoulders once in a while.  Inexpensive, good staff and hot little sandwiches to keep us intellectual junkies out on the road.", 
    "review_date": "2008-05-15"
  }, 
  "HPJGk8P98aM-MJkbNasNDA": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Amy K.", 
    "review_text": "This place is a great stop for lunch or a light dinner.  With one tiny oven and a panini press they manage to crank out some delicious sandwiches (I always get a half of chicken #2 and have never been disappointed).  Friendly service and really inexpensive (albeit mediocre) wines by the glass.", 
    "review_date": "2007-09-04"
  }, 
  "_DmZf8CUPgsuPdSnQcP4Ug": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "nina B.", 
    "review_text": "Is this the most amazing Italian food you've ever had? no. Is this most amazing service and experience in SF? Probably not. Is this the perfect place to perch on a warm Saturday afternoon, sipping house wine and people watching in the park while listening to mellow blues? YES!  On the edge of Washington square park and in the heart of North beach lies this little gem of a bar. Completely unpretentious and inviting, a two person operation on a busy holiday weekend still felt chill and relaxed. We ordered with our eyes (the caprese salad - which was surprisingly light given all the cheese and meat on the plate) and sipped on the 'house' white wine. The bar is comfortable and the staff is efficient. When I explain everything individually - it sounds like it's 'nothing special', but if you put all the elements into an equasion, it's perfect harmony and a great place to put your feet up for awhile and enjoy San Francisco.  Definitely recommend to tourists and locals.", 
    "review_date": "2014-09-01"
  }, 
  "i1IUqcMBd9DyEgkRoySCkQ": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Michael H.", 
    "review_text": "less than 5 stars?  really?  kick you in the shins and make you live in cleveland.", 
    "review_date": "2008-04-03"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "The meatball sandwich was recommended by the 7x7 cheap eats.  The sandwich is pretty good but its more like a meatloaf versus a meatball.  Its a cool bar serving some decent sandwiches and pizza.", 
    "review_date": "2013-03-31"
  }, 
  "-p5Jz999bm9JjcMoCoJdmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt L.", 
    "review_text": "North Beach is full of false havens but this place is legit- a pearl. The grilled foccacia sandos are unreal in their deliciousness. I can't say I have had it done better EVER. The lasagna is very good as well. The space is utterly classic and brimming with character without being kitschy or... well... dirty. It's a great place for a casual evening dinner that really knocks it out of the park with how tasty everything is. I also believe the owner does all the service so he is of course very attentive and wants to keep you happy which he does with ease. This will now be my go-to place to eat in North Beach.", 
    "review_date": "2011-06-10"
  }, 
  "RZqYPjZ-GGMwkAkO0nsnDg": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Deborah N.", 
    "review_text": "A native San Franciscan took me here years ago, and I have been coming ever since. I usually order the toasted meatball or sausage  sandwich...the portions are are large and the price is reasonable for the City.  Today, I switched it up a little and ordered the hot pastrami which was absolutely fabulous!  If you are tired of having a boring sandwich, come here for the focaccia sandwiches.  You will love it!", 
    "review_date": "2014-10-21"
  }, 
  "PwBriZjb_u69RTujuaZPPA": {
    "user_rating": 3.0, 
    "user_location": "Boston, MA", 
    "user_name": "Julie B.", 
    "review_text": "Mario's was one of the few places I stumbled upon during my trip to San Francisco. I was hungry for lunch and was intrigued by the name, so decided to head inside.   First off, service was friendly but soooo slow. There were only two guys working and the place was pretty busy. I'm happy I didn't have anything strict on my schedule or else I would have had to get up and leave.  Food wise, I ordered half of a Mario's salad and half of the highly recommended meatball sandwich. The salad was fine, just your average house salad, but the meatball sandwich was great! The meatballs and sauce were so delicious, and it was covered in melty provolone cheese. Yum.  If I ever return perhaps I'll order to-go and avoid the long wait?", 
    "review_date": "2013-11-11"
  }, 
  "G5TfE1HRwR4PGTldlY7pag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt B.", 
    "review_text": "I really like this place.  There are no cigars, just hip party kids who can give a shit about you. That's what makes it charming though. Oh and the raggae constantly playing puts me in a good mood.  The food is also great and it's a nice place to have a pint on a Saturday afternoon.  Just steer clear of the coffee.", 
    "review_date": "2009-03-25"
  }, 
  "CQ8OSQFPCCoo0ujxEyEVRA": {
    "user_rating": 4.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Raina B.", 
    "review_text": "Was visiting North Beach today while it was just sunny and gorgeous outside (yes, I am talking about San Francisco) and happened to stop by the window and read their menu. Don't expect something fancy here, just some simple, flavorful creations.  I had the grilled eggplant panini with mozzarella instead of feta cheese and I loved it. Simple flavors, nice and warm... it was just what I wanted.   I really welcomed the laid back nature of this place. You don't experience the over-zealous Italians greeting you at the sidewalk to reel you in which was so great. Just some friendly guys, making sandwiches and pouring beers. This place is a great escape from the hustle of touristy North Beach, right on the edge of Washington Square.", 
    "review_date": "2012-08-29"
  }, 
  "w632RkPs5VyIB9LYSaKXFA": {
    "user_rating": 5.0, 
    "user_location": "Portland, ME", 
    "user_name": "cmando M.", 
    "review_text": "So many good memories here. Been coming for 20 years. It' that kind of place.  North Beach might change, but Mario's does not.  The food is limited, but who cares because the sandwiches are the best you're going to get, the venue is so inviting it makes you want to sit there all day reading a paper and watching the people wander through the park.", 
    "review_date": "2014-06-25"
  }, 
  "3YqEmeoCXo_05rq2iPNs5Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bae L.", 
    "review_text": "Classic North Beach! Mario's has been here for decades. The service is polite and friendly. The food is basic and oh so delicious! No fancy frills needed. Great view out into Washing Square Park; sit inside or outside. The name is slightly deceiving as they don't sell cigars anymore, but this place is pure history. Love it!", 
    "review_date": "2013-10-11"
  }, 
  "0lDl1Jg1Qz2KhvkfJKk6fw": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Brian B.", 
    "review_text": "Chicken foccacia sandwiches. There are two on the menu and they're both delicious. Get one of those and an Anchor Steam beer. Pick up a Chronicle from the corner (the crossword puzzle will be done but that's ok). Grab a table by the window overlooking Washington Square park. Get another Anchor Steam. You, my friend, are having the best lunch in the City.", 
    "review_date": "2006-08-29"
  }, 
  "P2r4Y0Sh8RugQJsMw_tFqg": {
    "user_rating": 1.0, 
    "user_location": "Napa, CA", 
    "user_name": "Megan C.", 
    "review_text": "This review is based on after dinner drinks and dessert. We arrive into the tiny place and there are two free tables, so we grab one and take a seat. Time passes and the server comes over and we order a drink each and 3 desserts. A lot more time passes. Drinks weren't complicated, 2 draft beers and 2 glasses of wine.   We're started to get antsy, bummed that are incredible dinner out can end like this, but finally the server comes over with....the dessert. Where do you serve food before drinks? When asked if we could get the drinks, the server replied \"as you can see, we are really busy tonight.\" There are 5 tables, so if that's busy....well, we have problems.   At any rate we wait...and...wait for the drinks. Why start eating dessert when you have no liquid to wash it down? Drinks were the highlight because two of the three desserts were unedible. The chocolate cake was dry and tasted like a cake from Cosco. My ricotta cheesecake was reminiscent of a quiche, eggy tasting and like the chocolate cake, dry. I took one bite and pushed it the side. Tiramisu that my friend ordered was decent.  Server came by about 15 minutes later and I told him I didn't enjoy the cake. He said, \"it's supposed to taste that way, it has ricotta.\" OK, but the point is I don't like it. Bill comes with cheesecake charged on it. I don't understand this, I didn't like it, I didn't eat it, but you are still going to charge me?  Bad service, bad desserts so I won't be going back.", 
    "review_date": "2012-12-16"
  }, 
  "NP-675YVy9URhNmdQdnWsQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa K.", 
    "review_text": "This is a nice enough little place, but I just have to weigh in negatively on the meatball sandwich. The ingredients are ok (the foccacia is nice of course), but it's cooked in that little oven and mine got singed and smokey, which was not good. I liked that they had a half-sandwich offering ($5.50 rather than $9.75), but they didn't mention the half is open-faced - not bad, just something I'd like to have known. The beer selection was fairly limited. I would recommend going one block over and getting an excellent meatball sandwich (or spectacular pizza) at Tony's Slice House.", 
    "review_date": "2012-09-22"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "After trying to get in a few other places without success, we settled here.  The side door was locked so they can accommodate another table of 2 inside., where we were sat.  We shared the pizza special - prosciutto with arugula - $10?  The pizza fits on a dinner plate.  It was a nice thin crust pizza with a very generous portion of chopped up arugula on top.  The end crust was crispy.    Hubby had a pint of Sierra $5 and I had the Italian watermelon soda $2.    Service is a bit slow so be prepared to chill and enjoy the quaint ambiance - not the ideal place if you are in a hurry or with someone you can't carry a conversation with...", 
    "review_date": "2010-12-04"
  }, 
  "T7T1wli0Gy3s5rLmb87vKw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "V M.", 
    "review_text": "I saw this place reviewed on Check Please Bay Area, and thought it was worth checking out. Perhaps if you're a regular you'll get decent service. Our waiter made us wait way too long at every step along the way. I had a Panini that was ok and the atmosphere/location are good. I'd go back if the service wasn't so bad.", 
    "review_date": "2008-07-05"
  }, 
  "AFVGx2ke2XNdzjt9sX2kYA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dave D.", 
    "review_text": "The view is awesome!  I always have the panni and a house wine!  This place is so laid back perfect for unwinding.  I love to wander in the owner is always nice.  I love to bring my friends from out of town here.  It makes such a nice impression.", 
    "review_date": "2009-01-10"
  }, 
  "1UKab-nmvbBoyp6y6f052A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miran C.", 
    "review_text": "This corner cafe has a cozy ambience if you care to get over the barmaid's surly 'tude.", 
    "review_date": "2011-09-21"
  }, 
  "khvn7hhX08g33N5niO676w": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Bleep S.", 
    "review_text": "Did not have a meal here, but I did have a delicious espressso made with love and care by an expert barista.   I believe the man had a moustache with the ends turned up.  What a sweetheart. We sat at our table for a long time and were never hassled to get up to make way for the diners.  The music was fantastic.  I intend to go back for a meal.", 
    "review_date": "2009-03-21"
  }, 
  "uoo9B8-2GnvTA5OunT60GQ": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "LC B.", 
    "review_text": "The name sounds almost like a liquor/cigarette shop with a deli..but it's quite a cute, cozy bar cafe across the street from Washington Square.    Friend and I ended up here to people watch over glasses of wine from one of the outdoor tables.  I wish they had names of the wines they serve on their menu though.  I had their pinot noir and it was delightful.    Nice weather, enjoyable company, an attentive waitress, yummy wine, and outdoor seating equals perfect SF afternoon/evening.", 
    "review_date": "2013-10-01"
  }, 
  "YaS3LMly8LeveGRYazRgPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlin C.", 
    "review_text": "I LOVE LOVE this place. The focaccia sandwiches are absolutely delicious! I haven't even tried anything else. Both chicken sandwiches and eggplant are great. Staff is super friendly and chill. My boyfriend and I had a great lunch at the bar one day and our waiter asked us to find Shark Week on the TV, giving our drinks for free :) Check it out! And check out the old pictures of Mario on the wall - very historic!", 
    "review_date": "2011-08-20"
  }, 
  "V6WZXcF8LHJWXmhZC5uc8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SunnyandNolan E.", 
    "review_text": "Sunny: I had their salami panini on a baguette. Absolutely fantastic: hot, crispy and flavorful. Simple ingredients, but the combination, with the panini press and voila! I would love to visit this place again. The atmosphere and friendly staff are great.   Nolan: Mario's is one of my favorite hang outs in north beach, it is a great place to be a regular at.  Their panini's are and focaccia sandwiches are delicious, great to enjoy on a nice day in the park or on a colder day in the restaurant with a pint.  My favorites are the salami panini, and grilled chicken #1 and #2 focaccia sandwiches.  They do a great home made tiramisu too!", 
    "review_date": "2009-10-11"
  }, 
  "QbR55hB1NyJiRanjWVsPrw": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "carolyn h.", 
    "review_text": "yummy yummy yummy. i love Mario's. it is everything good about San Francisco rolled into one place...mellow people, great food, wonderful neighborhood. this is why i love my hometown...  try the meatball sandwich:)", 
    "review_date": "2007-02-07"
  }, 
  "-0jQI-Ru2BAJsGsGcFglPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "chelsea b.", 
    "review_text": "Cute little spot. My friends brought me here to show me one of their old hangouts  from \"back in the day\". Mario's struck me as the stereotypical North Beach cafe in a positive way. You can come here and grab an espresso or a beer and kick back while enjoying a relaxing environment. It struck me as a good meeting place for friends. It has a pleasant environment with a  few frills and no fuss.  They're located right across from Washington Park so there's a lot going on if you're a people watcher like me. I wouldn't say you should go out of your way to visit this place but it's a great spot to stop in when you're in the area.", 
    "review_date": "2009-06-22"
  }, 
  "T4E1PMvIF78PKVMXnYcuRw": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Greta R.", 
    "review_text": "Great little cafe in north beach.  I'm a little sentimental because this was the first place I went to when I moved here.  It is in such a cool little corner location.  It makes you feel like you're in a little cafe in Europe.  Such a cool vibe.", 
    "review_date": "2014-03-03"
  }, 
  "yqBa9rXfqWjdNKUtmz7DRw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "National H.", 
    "review_text": "This place is the bomb-it does just what you want it to and doesn't tread into areas outside of their mastery. GREAT focaccia sandwiches, cheap vino, stupendous people-watching location, and wicked bad-breath inducing caeser. Eat your anchovies and kiss a stranger for a new twist!", 
    "review_date": "2007-04-08"
  }, 
  "NhCE_HoUkhNE8aDH6SURPA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "This is probably one of my favorite places in the 'tourist' friendly North Beach.  Most places in North Beach don't need to keep up to par because they know they will have plenty of Union Square'ites visiting them.  The thinng that is cool about Marios is that is has a local feel and the food/drink are simple but good.  The menu is limited and they cook all their food out of an oven the size of a dishwasher.  The beer is always cold and fresh.  The wine is always cheap and tasty.  Great little place to take something to read and eat solo.", 
    "review_date": "2006-04-29"
  }, 
  "1dlT00tW1O84bdZPHeyTdg": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Geoff W.", 
    "review_text": "I moved to San Diego after living two blocks from Marios and I crave it every day.  Hands down the best meatball sandwich EVER!!!  Go there and order it, you won't regret it.", 
    "review_date": "2010-12-23"
  }, 
  "bn0Bvmb5XwUYGnXi6O7M1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "daphne w.", 
    "review_text": "The place sells not only tasty focaccia sandwich but ambiance.  We waited 20 minutes for Golden Boy to open and the grumbling in the belly moved us here.  It took them another 20 minutes, but the waitress was super courteous and so friendly that we smiled through the wait.  Seems like a true North Beach place, as she knows most people by name as they come in.    It's a small place, with limited menu items, but we'd return for the sandwich served by great staff at the table outside facing the square.  Even if the service is a bit slow, it just gives you time to slow down to the pace of the neighborhood.", 
    "review_date": "2013-07-06"
  }, 
  "UKyn4Q-lyK5knej-OXkskw": {
    "user_rating": 4.0, 
    "user_location": "Riverhead, NY", 
    "user_name": "Luke F.", 
    "review_text": "I used to live around the corner from Mario's and it was one of my favorite North Beach spots.  The polenta &amp; sausage dish was my fave but I don't think I ever ate anything I didn't like there.  The hipster waiters are a little stand-offish but they warm up once they get to know you.  The dreadlocked dude (does he still work there?) didn't really acknowledge my existence until I had been a regular for about a year.  But I figured he was the guy picking all the great reggae music so I lived with it.  They also have some seats outdoors across from the park which are a great spot for and afternoon lunch.", 
    "review_date": "2008-07-16"
  }, 
  "7XdxTuCY8a9OezIxc5Lmzg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Gero W.", 
    "review_text": "User to live in SF for more than 7 Years. Walters were nice and polite. Location is great, food is mediocre at best. G-man", 
    "review_date": "2011-09-23"
  }, 
  "W2DuKlBALsA8O3XjENnn_A": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "A Y.", 
    "review_text": "Get the eggplant sandwich, the breaded one. My friends &amp; I have been going here for, holy crap, almost 20 yrs just for that. Grab a table looking out on Washington Square.   Then maybe walk up Columbus for some truffles from XOX. A good place to meet friends for lunch on a rainy day. Or a sunny day. Or a non-sunny night.", 
    "review_date": "2007-09-15"
  }, 
  "RNqUxVGKYMHZZmBEcH4iVg": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Silvia T.", 
    "review_text": "The place is cool to hang out, have good coffee, or a beer.  I ordered a chicken panini sandwich that was insipid, I asked for some olive oil and vinegar to dip my sandwich into because I couldn't taste much flavor but the bread was good.  The server was nice, I sat on the bar by the door which was kind of annoying since people kept walking in without closing the door and it was windy.  Really people, you walk into a place, close the door behind you, is called courtesy.  Try it.", 
    "review_date": "2007-09-05"
  }, 
  "G7eeiEtL7Y3u-T7Fij-Wgw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "Pretty good sandwiches, a little touristy-feeling, and a little too pricey for the food you're buying. Not bad... just not somewhere I plan to visit often when there are so many better options in N.Beach.", 
    "review_date": "2007-02-02"
  }, 
  "HaqL5KNW5bqCwTX7Y8pigQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lillly G.", 
    "review_text": "Chicken sandwich #2 is my go-to order when eating in or taking out. I live in the neighborhood and love this spot.", 
    "review_date": "2014-12-11"
  }, 
  "XQ-m75M0aCkCckFBjL0d4w": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "David T.", 
    "review_text": "You will never go wrong with a meatball sandwich--or with the breaded eggplant sandwich--accompanied by a glass of chianti at Marios.  Its the atmosphere that puts it over the top, right on the corner off Washington Square, watching all the local color and enjoying a bit of old time North Beach ambiance.", 
    "review_date": "2009-06-25"
  }, 
  "IqKj8kMJEe8nyOeIuGRpoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sierra D.", 
    "review_text": "oh my god!  the combo changed my life.  and i only had 4 bites.  the sandwich was rich, cheesey, hot and yummy.  mmmmmm!  can't stop thinking about it.  can't wait to eat a whole one....or two.", 
    "review_date": "2008-05-15"
  }, 
  "c14mdc_XMbDF-70UJIh7uA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela M.", 
    "review_text": "Went back to Mario's and am happy to report that it's still awesome. I have yet to find better foccacia bread in the city and forgot to mention my delight over the peppercinis that come with each sandwich. Delicious. I also enjoy the camaraderie between the staff members. Love this place!", 
    "review_date": "2009-08-03"
  }, 
  "wCtf5_zG8EpWiBp_Oi7P0g": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Sarah G.", 
    "review_text": "I want more places like this  in Boston. It is a tiny little cafe/bar/sandwich shop and supposedly a cigar store too? All of  that packed into one tiny corner shop??   You walk in here and see the big oven to cook their pizzas and paninis and to melt all of the cheese that Kelly D. got on her tuna melt. That oven is tucked into  the bar itself  and when we were there, they had two awesome people working, the guy who worked the bar and made all of our food made sure we were all completely happy with our sandwiches and pizza. Frances S. and I both got panini's, mine with chicken and pesto and sundried tomatoes and cheese all melted and toasted together and Frances S. got their mozzarella panini and we were both pretty happy with them. A little on the small side though for the cost and definitely in comparison to Kelly D's tuna melt which was made open face style, and I pretty much had  sandwich envy with that  one ha ha Kat got one of their sausage pizzas and she also seemed pretty darn content.   A nice quaint little bar and lunch spot that if you happen to be walking around this area, I know the people here will treat you like they are your friends.", 
    "review_date": "2012-01-09"
  }, 
  "_rCTsmoYmWmM-F33PBGN2w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dave C.", 
    "review_text": "Fun place to stop by for a beer or coffee.    Sandwiches are good too.  Kinda small, but that's part of the charm.", 
    "review_date": "2012-02-20"
  }, 
  "q9NM8_ExzpkoxskbKRvcDg": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Eva Leona Lerriqs S.", 
    "review_text": "I am not into cigars or bars, but someone introduced me to Mario's long, long ago, and I have been a fan ever since. Consider this great comfort food. I am a fan of the hot foccacia sandwiches. I've had veggie and breaded eggplant. I get one or the other and have been for the last twelve years. Sometimes I think of trying something else, but I am worried the eggplant will miss me. On my last visit, I sat at the counter for the first time (usually I'm at the small table in back) and enjoyed watching the food being made. Kudos to the sandwich makers!", 
    "review_date": "2009-12-02"
  }, 
  "b5xky1NsvoaUK4ScJT695g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erica G.", 
    "review_text": "Nothing too fancy at this place.  Just delicious grilled panini accompanied by great beers on tap and an authentic old school vibe.  What more could you ask for?", 
    "review_date": "2006-04-14"
  }, 
  "zZVlTm9PQKd6js3QbURlWg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Frances N.", 
    "review_text": "Great atmosphere for an impressive (and AFFORDABLE) dinner with friends. Came based on Yelp reviews. I would come back in a heartbeat.   FOOD/BEER: Mouth-watering. Ordered a pitcher of their summer special beer, a stout that tasted amazing. They're famous for their foccacia, so I ordered an eggplant foccacia that came out steaming hot and smelling seductive.  Went to Gelateria Naia next door for delicious dessert to top off the evening!  SERVICE: Meh, nothing to complain about. Waitress mostly stayed out of our way but checked in on us; I was hoping for a homey, mom-and-pop manager with whom my friend could practice his Italian, but the waitress didn't seem friendly or Italian.", 
    "review_date": "2012-06-07"
  }, 
  "RWIuUNWFYYWS2tbQ6VzKJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "O K.", 
    "review_text": "This place is very nice. I love North Beach and all its cafes. After passing by this cafe many times, I never went in even though it looked alluring, but after hearing that they have the \"best foccacia sandwiches\" on Bay Area Backroads I decided to give it a go. I ordered the turkey foccacia with pepper jack cheese and onions, and I replaced the dijon mustard with red bell peppers. We sat outside and it was very comfortable, and the sandwiches came right away. Sadly, they don't carry \"exotic\" Torani flavors like coconut or mango, so I had to settle for a peach Italian soda. It was still yummy. The sandwich was very very tasty, nice crispy bread and great cheese.. kinda spicy too, which I liked. I had a bite of both the grilled eggplant and breaded eggplant sandwiches and they were awesome. A+", 
    "review_date": "2005-08-21"
  }, 
  "JhHo2-fej5do28snWXSSnQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mindy S.", 
    "review_text": "Cheaper and more reliable than the string of overpriced tourist-centered Italian cafes down the block. This place is cozy without the overly-friendly waiters that I find to be overbearing in most of North Beach.   Good lunch spot for panini, focaccia sandwiches (breaded eggplant!), cannelloni and lasagna. Go at off-times (like 2pm for lunch) since table seating is sparse and this place tends to fill up.", 
    "review_date": "2007-10-05"
  }, 
  "Ngk3BorlpPc0QV_xuo3xvw": {
    "user_rating": 5.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Jack H.", 
    "review_text": "Killer cappuccinos, excellent panini on focaccia bread, consistently groovy SF vibe with interesting tunes from the 60's. Highly recommended, unless you are a tourist.  For the location and ambience, they get an extra star.", 
    "review_date": "2012-10-17"
  }, 
  "UfRm6t31UuCJ8u50Sc24VQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa C.", 
    "review_text": "Omg yum! We stopped in for sandwiches late in the afternoon and were not let down. We got the grilled eggplant and the chicken number 1 and were very pleased with our meals. Personally, I had the eggplant and it was so delicious!  The foccacia was very flavor and crispy and the filling was just right. Highly recommend!", 
    "review_date": "2011-11-05"
  }, 
  "sA4ZTzEFNZSh668S2sldaQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "E C.", 
    "review_text": "A historic boho bar and sandwich joint perfectly located across from Washington Park and St. Peter and Paul's church. A great place for an afternoon break in North Beach.", 
    "review_date": "2009-09-22"
  }, 
  "bD2VZd1WlLGEp9B_r8aitQ": {
    "user_rating": 5.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Sherman M.", 
    "review_text": "Great little cafe with excellent food and good service! My girlfriend and I visited San Francisco and went to this place almost every day! Every time we tried somewhere else, it wasn't as good and we thought, \"Why didnt we just go to Mario's?\"", 
    "review_date": "2011-10-19"
  }, 
  "XwsvbmuPyW7hl39yux8giQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Jonathan D.", 
    "review_text": "Great place for a quick bite - really good friendly service, good and simple food, and absolutely terrific hot focaccia sandwiches.  A great place to head if you just want a simple place to grab lunch or dinner", 
    "review_date": "2009-09-14"
  }, 
  "tUKpixy4c24_2W0PngxooA": {
    "user_rating": 2.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Roxy G.", 
    "review_text": "The lasagna was greasy, the glasses were dirty, and the wine list consisted of \"cab\" or \"merlot\"  I think we ordered the meatball sandwich too, but it was so uneventful I don't really remember if it was \"ok\" or ''good\", but it certainly wasn't great or memorable.  I wanted to like it, the location is great, but the actual quality of food and beverage was low.  I suppose if you want to grab a beer and sit at a bar in a prime location it's good. I was terribly unimpressed :(", 
    "review_date": "2011-06-27"
  }, 
  "aIma8XWJUh_CIW3XbOBWvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan W.", 
    "review_text": "On a whim, or rather, on a bit of Yelp research, I discovered Mario's.   Yelp again succeeds- the eggplant foccacia sandwich not only made me solidify my position on eggplant in the positive. I found myself searching the plate for any dropped crumbs of this sandwich that I could find after devouring it.   It's a bit pricey for sandwiches, but not too pricey for awesome sandwiches.", 
    "review_date": "2009-02-28"
  }, 
  "cTvnc3yOhFQzOQEtSE-xLg": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Emil A.", 
    "review_text": "I'm about to leave North Beach after a year here, so it's time to write a review of my favorite corner cafe.  Mario's has provided that perfect North Beach feeling for me: sitting on a street corner with my son, having excellent food, and watching people go by.  I always get the same: a caprese, a balsamic chicken oven-baked foccacia sandwich (chicken #2), and a glass of vermentino (or a cappuccino if I need the caffeine).  The caprese is good, though I'd prefer better tomatoes.  But the oven-baked balsamic chicken is amazing: moist and tender, smoky flavor, light touch on the balsamic, with good greens, tomato, and feta.  Funky vermentino by the glass is nice as well.  I'll miss this place.", 
    "review_date": "2011-12-20"
  }, 
  "7Na1pUcEv3oF_QTRwZ-2iw": {
    "user_rating": 4.0, 
    "user_location": "Carpinteria, CA", 
    "user_name": "Amanda H.", 
    "review_text": "Love this place!  -delicious foccaccia  - great drink selection -prices are low  -cool vibe -always leave full  BEST PANINIS in SF!", 
    "review_date": "2013-01-06"
  }, 
  "5Xp1puM4TMVPvwox_ryu6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Otay B.", 
    "review_text": "I was really disappointed when I went there in late May. I used to go there back in the 80s and early 90s and the food was so much better. The focaccia is completely different from the recipe they used back then, when it was fresh, chewy, and delicious - this time is was a little overly crisp and the flavor was just not very good. My sausage sandwich was cold and not much better after I asked the guy to put it in the oven again (annoyance factor). My partner's meatball sandwich was...meh. The hipster dudes behind the bar seemed not that excited with their job. I won't be going back to spend my hard earned smacks when there's so much other good food in this city!", 
    "review_date": "2009-07-13"
  }, 
  "-aX9XhJQYvnDvzwW6YRYlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bobby L.", 
    "review_text": "Unpretentious perfection. Amazing staff! Excellent food! Perfect location!  I suggest- Breaded Eggplant sandwich, and an IPA draft. Chill, and tip your servers well!  Cheers!", 
    "review_date": "2011-08-13"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "No smoking of cigars, but the oven baking the focaccia sandwiches can fill up the place with that burnt bread smell that's actually kind of nice, but makes your clothes stink for days.  I've enjoyed every visit to Mario's.  It's the kind of place that I would love to own.  Or what I'd use as a template for the perfect comfortable cafe with food and wine.  I order a half carafe of the montepulciano, an Italian red and the eggplant marinara sandwich on focaccia.  They layer the sandwich with thin slices of breadcrumb coated fried eggplant, roasted red peppers and then a layer of provolone.  Then bake it open-faced in the oven on the wall.  After ten or fifteen minutes, they slap the two sides together and slice it diagonally and garnish with those green pepperocinis, which I bite the end off, pour the tangy vinegar into the sandwich and then munch down as I eat the sandwich and sip the red wine in smallish hexagonal tumbler glasses.   One memorable time was when my brother Rufus visited and we went there on a Monday for dinner.  It was raining out.  We ate and had the wine.  It continued to rain, they had cool music playing.  Coltrane or Sonny Rollins or Thelonious Monk...  Anyway, we didn't leave that place for 3 hours just laughing about dumb things we used to do as kids and can now talk about.  No reason to go out in the rain when you've already found a cool place to hang. I do have to admit that in the past few years, the charm has changed a bit for the worse.  The lighting is now much brighter and too bright in my opinion. I like it dim when work on getting a good wine buzz.  And the jazz music has been replaced by either dancey world music or reggae or just contemporary Alice-type music.  Maybe it's the workers who just play their iPods or whatever they want.   The great foccacia they use for the sandwich is from Liguria Bakery on the corner of Stockton and Filbert, but the Italian French Bakery up the street on Grant @ Union makes a decent substitute, but it's not the soft wonderful foccacia from Liguria.  There's a difference.  They ran out of the Liguria foccacia bread for the sandwiches a couple of times too and I asked about when they changed to the Italian French Bakery foccacia, our waitress was convinced it's always been the same.  They also installed a few taps of draft beer, which is nice, but I suggest the red wine with the sandwiches.  2006, the old school is changing.  Update: They had a sign on the window saying they're using Liguria focaccia.  Hmm.  Maybe they read the yelp reviews...cool.", 
    "review_date": "2006-01-16"
  }, 
  "tMvLorYiqTteITTEvys6HA": {
    "user_rating": 5.0, 
    "user_location": "Overland Park, KS", 
    "user_name": "Ruby H.", 
    "review_text": "My most favorite place to eat in North Beach!!!  The best panini's i've ever had! They also make wonderful lattes. Just a simple little restaurant that serves great food and provides a relaxing environment.  You can't go wrong at Mario's.", 
    "review_date": "2009-02-27"
  }, 
  "496e9_P-xJnHbR3gEADaVQ": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Yasmine G.", 
    "review_text": "I have a weakness for focaccia sandwiches and funky cafe names, and Mario's does not disappoint.  Order the grilled chicken #1 (especially if you like dijon mustard), grab the Onion paper off the counter, and enjoy one of those rare sunny San Francisco days.", 
    "review_date": "2006-04-21"
  }, 
  "e3NowcEKREbtH2qa_ZUPMQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "S. G.", 
    "review_text": "One can't go wrong here. Yes, it is pricey, but look where it is. A classic place to watch the day go by.", 
    "review_date": "2012-12-23"
  }, 
  "sU5a5IvwZCOMt7xx1ceuQg": {
    "user_rating": 4.0, 
    "user_location": "Bakersfield, CA", 
    "user_name": "Sheryce S.", 
    "review_text": "One of my fav places to eat in the city!  One night while on a cab ride to North Beach we asked our cabbie which place he liked the best and he said that the meatball sammies here are hard to beat.  Yeah, I've been twice now and he he was right!!  They are so yummy and filling.  I also had the caprese salad too which was a great, light accompaniment to the sandwich.  It's authentic, cheap, and a great lunch!  I would rather eat here then pay way more for some fancy Italian place up Columbus.  It's way better.  This cafe is so old and authentic.  Tip: take a trip to the bathroom in the back.  It's tiny!!  When it is a sunny day, there's really no where else I'd rather be.  Out the window you can see gorgeous Washington Sq and once outside Coit tower is in view!  Awww, I so miss living in SF.  *sigh*", 
    "review_date": "2009-02-18"
  }, 
  "a4kLuLwhU9uxPLW7igBv7A": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Donald A.", 
    "review_text": "Nice corner bar. The manager/bartender was arrogant and ignored me for awhile. Didn't want me taking pictures. It would be great if the service was just a little friendlier.", 
    "review_date": "2011-09-08"
  }, 
  "4AwA8QlK6NR4kMfyCvlrJw": {
    "user_rating": 5.0, 
    "user_location": "Somerville, MA", 
    "user_name": "Jennifer D.", 
    "review_text": "Walked around North Beach yesterday morning for a half hour looking for a place that 1. was open for lunch, and 2. would fulfill my random intense craving for an eggplant parm panini and a diet soda.  Stumbled into Mario's and was happily surprised that it met these requirements.  One enjoyable conversation with the server and one absolutely delicious panini (for real... the focaccia bread was AMAZING) later, and I was happily off to enjoy the rest of my day!", 
    "review_date": "2012-05-16"
  }, 
  "Syt_iQqW_c9T2_lrvsddqQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gwynnie p.", 
    "review_text": "I'm just stealing this from another review; it's not worth any additional effort:  \"Anyhow, our experience was so unpleasant I doubt we will ever step foot back into this place...  And to the bartender with the slicked-back dark hair and goatee---you are a jerk and I suggest you brush up on your customer service skills.\"  That is all.", 
    "review_date": "2007-11-30"
  }, 
  "jX53tCQyLopl98uaFXwGiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maryam S.", 
    "review_text": "Best cappuccino ever", 
    "review_date": "2012-03-06"
  }, 
  "8IeUGe4ffhx-KJVc4xkqjQ": {
    "user_rating": 5.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Victoria S.", 
    "review_text": "Oh my!  I was temporarily transported to Florence last night when I scooped a spoonful of their housemade tiramisu into my mouth!  Heaven pure Italian heaven on a plate.    I've been going to Mario's Bohemian Cigar Store Cafe since the late 1970s and have so many fantastic memories of this place.  Every time I go I acquire a new and immensely pleasant experience.  Last night was no exception.  We had a cappuccino con \"Vov\", their special house made \"campari\", and the tiramisu and our night was blissfully perfect.  The cappuccino con \"Vov\" is a frothy cup of vanilla/eggnoggy goodness.  I'm hooked on their house made \"campari\" which is a blend of sweet and dry vermouth, bitters, a splash of soda and a perfect twist of lemon.  Our server suggested the tiramisu and outside of Alberto's in Florence this was hands down the best.  A gushy, creamy, wet mass of cake, cream, and liquor just as it should be.  Thank you Mario's for yet another memorable experience!", 
    "review_date": "2013-12-19"
  }, 
  "0OgM7Ma1AJmP_t86HsPMFg": {
    "user_rating": 4.0, 
    "user_location": "Muir Beach, CA", 
    "user_name": "Bitter B.", 
    "review_text": "IT IS WORTH THE CALORIES! My favorite thing about work--Is the lunch hour.  No seriously, I brake for lunch only because the food is so good in North Beach, not because I need the pounds.  Can I tell you--Mario's is my office away from the office. We go there daily for meetings and you will not find better canneloni, well, pannini's well, lasagna and bread and hefty pours of wine.  All in all, it is the neighborhood hang out and we Love It.  The people that work there are not servers they are friends.  This place rocks.  Not Low Cal but Worth It!", 
    "review_date": "2007-07-05"
  }, 
  "b0p3fOxJcZjB3iTl7zoqTA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rego S.", 
    "review_text": "Go there and try the canneloni.  It takes a few minutes, but when they pull it out of the oven, you'll be the envy of the place.", 
    "review_date": "2005-12-31"
  }, 
  "CSl3chHc4aLsoEHNCsEgSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron K.", 
    "review_text": "Stellar cafe, and a true San Francisco landmark.  Most of the Italian joints in North Beach are cheesy, but this one has the history and food to match the great location (right on Washington Square).  Pull up a chair at the counter, order your machiatto (they make them well) and get a grilled sandwich.  Best sandwiches in North Beach, only caveat is don't sit outside cuz sometimes the staff will forget about you.", 
    "review_date": "2007-10-08"
  }, 
  "Vp14grGEIvYzmrsOdix4UQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "G. J.", 
    "review_text": "Best. Lasagna. EVER.   Bohemian, yes... Cigars, not so much. Which is great news, because instead they have delicious food!  I personally ordered the grilled eggplant panini, which was incredible, but the lasagna was actually the best of its kind that I've tried yet. The carafe of red wine and the sunny day certainly helped, although it did get a touch cold on the terrace because the sun wasn't directly hitting it. Despite the homeless serenader and the nippiness, however, it was a fabulous way to spend a lovely President's Day and be outside after such a long week of rain. Our server slash bartender was friendly, in a quirky hipster kind of way, and the prices were the usual North Beach standard... which, in this case, were absolutely worth it. Very quaint, right next to Washington Square Park, and great for people-watching without being right slap in the middle of the chaos. Even the bizarre restroom set-up seemed strangely enchanting after such a scrumptious meal and charming experience!", 
    "review_date": "2011-02-22"
  }, 
  "SIcz9tmyUGlZtiaa39fBsQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon P.", 
    "review_text": "When I lived in the neighborhood, this was my never fail go-to spot.  A small corner space with windows looking out onto Washington Square Park, a comfortable place to sit and drink wine and talk for hours.  I'm partial to the cannelloni that comes bubbling from the small counter oven.", 
    "review_date": "2005-11-10"
  }, 
  "7yoZgNgUBNRU1wCVHpK2Gw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "scott j.", 
    "review_text": "Mario's has delicious focaccia sanwiches and the best espresso in north beach (Graffeo beans) made from some really wonderful antique machine.  it's a bummer Mario's can't serve cigars/allow smoking.", 
    "review_date": "2008-09-21"
  }, 
  "yH4E7zen5rI-rRM2UeAFKA": {
    "user_rating": 5.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Ally M.", 
    "review_text": "The lasagna is my favorite.I always get it. Best lasagna in town....sorry grandma", 
    "review_date": "2013-01-22"
  }, 
  "KE8OqqLW2aJpzPNJy55x4A": {
    "user_rating": 4.0, 
    "user_location": "Schenectady, NY", 
    "user_name": "Mercedes Q.", 
    "review_text": "Great sandwich shop.  Nothing like the hot foccacia eggplant sandwich.  And to user \"Catwoman\" from Santa cruz - I asked you why you gave a one star review to a restaurant where you didn't even dine or order a cup of coffee.  You responded, \"And why do you care what my opinion of the place is?  You live on the other side of the country and have never even been to the place I was reviewing....\"   You asked me a question, and then you block me.  How do you know if I've been there or not?  You think people don't travel or live different places or move around?  I just asked you a question about your one star review where you weren't even a customer there....", 
    "review_date": "2008-01-04"
  }, 
  "3b4efqz06QrLQ_w2xLc4pA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ace C.", 
    "review_text": "My friend and I got the sausage sandwich and the #2 chicken sandwich: both were very good. The staff was friendly. It's a great place to sit, enjoy and watch the world go by, which is a plus.", 
    "review_date": "2012-04-03"
  }, 
  "r0N7ck7_quS_kvh9JEmfWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul A.", 
    "review_text": "I'm not going to say the menu wowed me but the people, decor and the location did. Just came out of lunchtime prayers at St. Francis with thoughts of death, retribution and light weapons tactics weighing heavily in my well calculated thoughts, and I needed a place to chill before getting back to work. The beer list is nice and it is a vibe from the old town that I miss. So completely worth it. The food probably is good too. I had a salad, so hard to judge. I'm gonna try the tuna melt next time.", 
    "review_date": "2012-05-15"
  }, 
  "9YzE6ybg4Trnsd4kkXWEnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Naomi P.", 
    "review_text": "Love this place!  I think the best words to describe this place are: cute, quaint, friendly, &amp; delicious.    Mario's is on the corner of Union and Columbus right across from Washington Square.  The windows look out to the park and busy street.  It's a great spot for people watching, sipping coffee, reading a book, and catching up with a friend.  There are about 10 seats at the bar, and about 5 small tables that can fit 2 people (can fit up to 4 if you squeeze).  No big groups here!    Very nice/helpful staff - if you have questions about the menu, feel free to ask.  You will get no rude talking back here!  As for food, there's a Great assortment of sandwiches, paninis, and salads (my friend highly recommends the meatball sandwich!)  Plus, coffees, lattes, mochas, etc.  Everything is delicious and very fresh!  I was surprised to find such a light meal here because Italian food is generally heavier, but after leaving here, I felt energized and healthy.  I will definitely be coming back!  :D", 
    "review_date": "2010-01-19"
  }, 
  "becChstN1Nelt61S8j8exQ": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mike W.", 
    "review_text": "Perfect SF hang out.  Best turkey sandwich I've ever had.", 
    "review_date": "2011-03-08"
  }, 
  "3tkyUW4xtIsLPD7n1ZdXUw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Charles K.", 
    "review_text": "I used to always get my lunch here. I miss your sandwiches. That's all I've ever ordered here, and I miss them dearly. Perfect in a lot of ways, minus one. It's no longer close to home.  Miss the great service, and humble atmosphere.", 
    "review_date": "2007-11-21"
  }, 
  "TuP8ovZUL3kXtJnE2B71bA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Mary N.", 
    "review_text": "Their meatball sandwiches are the star of the show.  Nice and gooey with a non-traditional foccacia bread that was perfectly seasoned and complemented the meatballs very well.", 
    "review_date": "2013-10-20"
  }, 
  "mOCM896HwdM4sL961RRNHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric G.", 
    "review_text": "I ordered a combo sandwich and an anchor steam. The guy taking my order immediately said \"some guys have been coming in here and ordering that or 20 years\". Good to know, I was a little concerned that I would not make it out of here alive after eating it. I am not saying this because it was bad, because it was not, it was delicious. I mean really delicious!! ...but it was all meat, cheese, and mayo on a very oily (but also delicious) focaccia roll.   The people here were a mix of regulars and tourists. I had a good time listening to some visitors and the staff talking about the appropriate maximum amount of time to keep ground coffee beans.  They have Peroni to go along with your italian meal but if you are not into that sort of thing your only real other option is anchor steam. The rest of the beers are mostly the boring blue moon type stuff.   Finally, Thanks for the great service. I sat at the bar and was always being taken care of. The staff obviously is intent on keeping this place the classic that it is.  I am going to try the Cannelloni next time...", 
    "review_date": "2010-01-18"
  }, 
  "kVcBS5R1lSIjFrVD8MPTEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley A.", 
    "review_text": "This place has some of the best paninis and focaccia sandwiches!  I love to sit at the bar and look at the old pictures or outside on the sidewalk overlooking Washington Square Park and have a beer while I wait for my sandwich.  Everytime a friend of mine comes to visit, she requests we come here.  If you are in a rush or one of those people that can't chill and enjoy a good atmosphere while you wait for your food, do not come here if there are a lot of people.  It is a small, casual, corner joint and they have room for just one oven and one person to make the food - but that is personally what I love about it!", 
    "review_date": "2007-08-15"
  }, 
  "RPD2MK_RJbCY_GFsLAZjig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teddy d.", 
    "review_text": "Love Mario's...i have been going here for years now. Usually to meet a friend who lives in north beach. I definitely agree with everyone the meatball sandwich is divine. So grab a samich and a glass of wine or beer and socialize with the crowd. It is a small place but feels more cozy than crowded.", 
    "review_date": "2007-05-04"
  }, 
  "0GMMy-FD8ImVsF4M6CAE5Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "cynthia l.", 
    "review_text": "Great Focaccia in a small corner cafe of Litty Italy.", 
    "review_date": "2005-01-13"
  }, 
  "x-i8n-WW7YHrhRrPHos75A": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Mollie M.", 
    "review_text": "BEST CAPPUCCINO IN SF!!! Im serious. And the food is great too. I beeline here whenever Im in the 'hood.", 
    "review_date": "2008-02-08"
  }, 
  "YUQuJA0i5Y4wobydFjhYiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chad S.", 
    "review_text": "I only had 30 minutes until my open house started so I should've ordered a salad but the hot sandwiches everyone else was eating looked way too good so I ordered a turkey sandwich with melted cheese and dijon mustard and a beer. The beer took 5 to 7 minutes and the sandwich 12 to 15 minutes even though it was not that busy. Is this too long? Not if your hanging out with friends, but it seems like forever when your eyeing the clock. The beer (Anchor Steam) was good as always, the sandwich was out of this world! Too bad I didn't get a napkin (I was served by the cook who was a little flighty, he should stick to the cooking).  If your in North Beach and want a hot sandwich and a beer and don't mind paying $20 a person with tip you owe your self a trip to this great cafe!", 
    "review_date": "2010-08-09"
  }, 
  "Bx1iLCgUyu4HPepkYut4Uw": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Alison B.", 
    "review_text": "Mario's is a great neighborhood cafe. I love stopping by this place for a cappuccino/beer/panini/whatever. I'm not a huge panini fan, but I come here for their paninis. Service is friendly, even though it's a small place you won't feel rushed out if you want to sit there and read for a bit. I like how even though it's in a touristy area, it does't feel touristy. No complaints at all.", 
    "review_date": "2012-02-26"
  }, 
  "lcBxErp_W1aNAPD_2RikcA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan F.", 
    "review_text": "Mario's was great.   After ordering, it took at least a half hour to get our food, but the price, taste, and location more than make up for that.   I love the fact that you can get a half salad or half sando for half the price. I really enjoyed the Caesar salad and meatball sandwich!  Will definitely be back. They do takeout too, which is a great alternative most of the priceyer, sit down restaurants in north beach if you want something quick, easy, yummy and cheap.", 
    "review_date": "2014-04-06"
  }, 
  "MsbIFptSdbUIBng23wFhbw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michael S.", 
    "review_text": "always a great espresso served right and the tiramisu always perfect.  The lemon ricotta cheesecake was not on the menu due to Mario's widow broke her arm a couple weeks ago.  This is the kind of place it is.  I have been going there for years.  Always a treat and the current staff was really nice.", 
    "review_date": "2013-11-18"
  }, 
  "pBAnCaacZRtk1PWtjPANAA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John T.", 
    "review_text": "Gavin Newsom. Here. Ordering a chicken focaccia sandwich. It was surreal.  Can you imagine his life? Wake up, cocaine, throw on fancy pants and casually sophisticated white oxford, cocaine, make a speech at whatever city event, cocaine, have lunch at Mario's Bohemian Cigar Store Cafe, cocaine, glad hand old ladies at whatever city fundraiser, cocaine, service his married cougar mistress, cocaine, act all mayorally (sic), cocaine, fall asleep in the limo. Yelp friends, it all sounds pretty GOOD to me...minus the cocaine.  Honestly, he seems like an OK guy. I would have liked to say to a few choice words to him, but I was too busy devouring my meatball sandwich. I'm fat, Gavin ain't.  Gavin Newsom, 3 stars. Mario's Bohemian Cigar Store Cafe, 5 stars.", 
    "review_date": "2007-07-01"
  }, 
  "XQMaAvF3YUslCD-0tZY1xg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brian D.", 
    "review_text": "Came in on Friday April 13th for dinner - and was impressed. We ordered a Caesar Salad -- split onto two plates and made to perfection, simple yet tasty along with the Canneloni and the Veggie Sandwich.  Each item was prepared in front of us - by the staff and tasted amazing and a great value for the price. I will definitely be back again.", 
    "review_date": "2012-04-20"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "We were walking around North Beach this past weekend and Mario's had been on our list to try out and we finally got the chance to.  We both ordered the meatball sandwich which had been written up all over the place.  When we sat down there was a framed letter from Mario Batali mentioning how much he loved the meatball sandwich so we knew we had to order it.  It was delicious too.  The onion focaccia it was on was amazing and had a great flavor.  I ordered an Italian soda too which was tasty.  We got there a bit before noon and it wasn't to busy but by the time we left it was packed so maybe get there a little early and enjoy.", 
    "review_date": "2013-03-04"
  }, 
  "iyMdItITmFx7-LmRV2-F0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Surely I Am C.", 
    "review_text": "Quaint, friendly, and unpretentious atmosphere with fresh, olive-oily focaccia. Neither the sandwiches nor the people-watching will disappoint. It's almost a small piece of Europe within San Francisco -- fortunately without the smoking.", 
    "review_date": "2006-03-24"
  }, 
  "4U6g5TcuTD1QvQf_uZPz6Q": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Allen H.", 
    "review_text": "Have been coming here every time that I visit SF since 1991. We last weekend (Jan. 10) - order the same meatball sandwich every time and love it every time.   A few years, ago, my wife and I went, sat at the bar and someone put on a full James Brown record. Marios - meatball sandwich, great coffee and James Brown! We always talk about that experience.  Staff is very nice; food the best (at a reasonable rate) - a trip to SF is never complete until we go to Marios!", 
    "review_date": "2010-01-24"
  }, 
  "odM7WqRsORcMsFymWEMiAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric H.", 
    "review_text": "Damn good.  And lots of personality, too.  Probably the best Eggplant Parmagiana Foccacia sandwich I've had.  Lovely room.  Great staff.", 
    "review_date": "2008-01-15"
  }, 
  "jveIBHpWOfZFv24luiDjPA": {
    "user_rating": 3.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "David R.", 
    "review_text": "Lots of history and the building is really old and cool but the food sucked! There are like 5o restaurants in the area, my guess is that for food you can do better. If you want a cup of coffee or an expresso I'm sure its a great place.", 
    "review_date": "2013-09-08"
  }, 
  "_vjsG7AJhw_44xC6M3YDXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K B.", 
    "review_text": "Food was okay for the most part. Salads were sad but the meatball sandwhich was great.  Service was awful. Our waiter was incredibly rude, sarcastic and arrogant. That, along with the long wait for the food and the bill, made the whole experience a nightmare.  After we finished the meal and asked for the bill we waited over a half an hour and eventually had to ask the waitress to remind our waiter because no one in our group even wanted to talk to him at that point.   As good as that sandwhich was the service was so bad there is no way i would ever go back.", 
    "review_date": "2011-04-28"
  }, 
  "H7pOIDkDqUBjBj1ulCwk7g": {
    "user_rating": 5.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Neil W.", 
    "review_text": "The warm sausage sandwich on toasted green onion foccacia bread is to die for. It's so filling that I often order just a half sandwich. I guess I've been ordering it for 47 years and it's still wonderful and tastes the same as it did in 1967. On rare occasions I order the meatball sandwich which I guess is equally as good but even though I'm an experimental Gemini, I seem to end up with the sausage version.   Get it with a beer or Orangeno soft drink and you can't go wrong. Their deserts are limited but their cake has always been good and fresh although I usually go across Columbus to Mara's Bakery for canolli or a raspberry ring unless the ahole owner is there who seems to hate everyone unless you are a local Italian.    I have to thank a long out of print booklet titled \"My Secret San Francisco\" for turning me onto Marios Bohemian Cigar Store which I don't know if they ever sold cigars.", 
    "review_date": "2014-11-16"
  }, 
  "y5BWogG5nO9jH7Fi-ss7GQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deidre B.", 
    "review_text": "You know those random Sundays when you can't motivate yourself to work out or run errands?  When all you want to do is relax and be entertained on the cheap...anywhere other than your apartment?  Well, Mario's is my solution for those particular doldrums.  Come in with yourself and either a book or a friend.  Order a coffee or a glass of wine, and perch at the bar or grab a tiny table next to the window.  Sit as long as you like and watch the tourists, church-goers, and older Tai-Chi-loving folks in Washington Square Park.    Breathe, grab a little snack, and relish that you have a whole afternoon before you have to get back to grindstone on Monday.", 
    "review_date": "2009-03-06"
  }, 
  "UCTin7iQ_oR0E11EYemsEw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse W.", 
    "review_text": "Love the food and atmosphere, but can't stand the arrogance of the bartenders / servers.  5+ for foccacia sandwiches  2 for staff", 
    "review_date": "2009-03-25"
  }, 
  "rAFBtociqzge2afydDy2nA": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "The best Meatball sandwich I've ever had. I love this place, I always stop in when I'm in Northbeach. Great Italian beers - great atmosphere, get there early because it gets crowded. Hit it on a weekday.", 
    "review_date": "2011-06-02"
  }, 
  "qF5BaqUhCHXGKGU-44Nwow": {
    "user_rating": 4.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Sean C.", 
    "review_text": "Just love the entire scene of this place. Its at the corner of Washington Square Park. They have outdoor seating, and a cozy indoor cafe/bar. The sandwiches are so good on their fresh Foccacia bread, definitely get the Meatball. They also have pitchers of beer to wash it all down. Just a really great find in my favorite neighborhood!", 
    "review_date": "2011-05-22"
  }, 
  "cMSZp7Go1bPKEQMYqStaXA": {
    "user_rating": 5.0, 
    "user_location": "Brighton, United Kingdom", 
    "user_name": "Joan S.", 
    "review_text": "I instantly loved the neighborhood vibe I got from this place. A small joint, nothing fancy but not grimy either. My friend and I went family-style and ordered the mozzarella panini, eggplant parmesan,  a basket of focaccia bread, and pinot grigio. I have no complaints. The food was impeccable. Overall, if you are looking to have a quick bite (not fast food) in an unpretentious environment, check of this North Beach classic.", 
    "review_date": "2008-03-12"
  }, 
  "Av14iV8L9700Lsvdm21DtQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ghosty A.", 
    "review_text": "It makes me so sad to write this because I used to adore this place. But after the last few visits here I've decided this place is kind of shit.  First off, there's no seating. Heaven forbid you arrive in a group with more than two people and have to cram yourselves in one of their tiny ass tables. To be honest, their tables aren't even that small. There's just no place to walk hence, no room to pack four chairs around a table that could easily sustain a small group of people. If there is a fire, you will fucking die.   I get it, it's San Francisco and space is expensive. If you come on your lonesome or on a date though the space isn't that much of an issue.  Come in with a small group of friends and you'll get some eye rolls from one of the waiters aka wanna-be-king of hipsters, Moustachio ( Epic stache and epic douche ) Anyways, you'll know who I'm talking about when you see him.   Food is pretty pricey considering how little you get. For $8 you can get a tiny ass sandwich with mozzarella, tomatoes, and basil. That's it. They won't even spring for a handful of potato chips because fuck you. They give you a couple pepperoncini's though.    I think the part that really irks me about this place is the service.   I get it people have bad days and sometimes their service is a bit off. I'm just going to get straight to the point here and say the waiters here are simply bitches. No, they aren't having a bad day because Urban Outfitters burned down and they don't know where else to buy Holga film.  They're just bitches.  Moustachio can't hear your requests for service over his unnecessary facial hair. He hates giving soda refills too because carbonated water and 5 cents worth of syrup is a total scam.   There's another chick that works there that acts like she is so inconvenienced because she has customers to service- ironic considering we are the reason she has a fucking job. She slammed a cup of coffee once on our table and then sauntered over to Moustachio to faun over how large and thick his moustache is. Giggling and twirling the ends of her upper lip facial hairs that someday hope to become as hipster-y as Moustachio.   She's a bitch. He's a bitch. Food is pretty good but pricey and as filling as a holy communion bread chip during a 2-hour Christmas Eve mass right before dinner.", 
    "review_date": "2012-08-21"
  }, 
  "OqgYxqEHc9K7oq-8VHJgxw": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Francis K.", 
    "review_text": "Excellent Panini sandwitches and a good Italian wine list.  The Italian sodas here are certainly the bomb, and the sandwitches, oh the sandwitches, all warm and gooey and toasted perfectly on their old school panino press...Try the turkey, which is always one of my favorites...This place is quite small and can get quite cramped with all of the tourists of north beach, but the wait and the tight quarters is worth it once you bite into one of those darling sandwitches...", 
    "review_date": "2007-07-29"
  }, 
  "kL-M7e4dBDe3nTr4qLvE_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam S.", 
    "review_text": "So I've just come down from a walk over Telegraph Hill, and I'm thinking a little dinner would be just the thing, and there's Mario's, and so here I am writing a review while I finish my wine and reflect on why this is one of my favorite comfort food spots.  Most of my old favorite North Beach restaurants are gone, replaced by places that are hipper, shinier, airier, pricier, and packed with tourists and dudebros from the Marina.  Mario's is one of the remaining holdouts, a funky little triangular building with a bar on one side and a few tables on the other, with a great view of the park.  You can get a meal here for under ten bucks and a drink for under five.  It's mostly a local crowd, a good number of youngish hipster types like myself, but there are still a few older North Beach Italians who haven't been driven out yet.  The menu is small and focused -- salads, panini, pasta, that kinda thing.  All of it good.  I go for the cannelloni more often than not; it reminds me of Christmas Eve when I was a kid.  Decent wine and beer selection, and they make a nice cappuccino.  I don't know if it's the good food, the laid-back atmosphere, the drink, or what, but I can't think of a time I have come here and not had it elevate my mood.", 
    "review_date": "2013-11-29"
  }, 
  "ooRqTtP8NLP068cnkWpUYw": {
    "user_rating": 4.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Adam X.", 
    "review_text": "Get some focaccia and be happy. They also serve really good tiramisu :) Been a fan since 04. Would always go back when in north beach.", 
    "review_date": "2012-01-12"
  }, 
  "hFn4mjyLOXsgmR1wEtVa8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin K.", 
    "review_text": "Toasted sandwiches made from Liguria foccacia are dreamy.  They're the dreamiest when you've been wandering hungrily within a 1-mile radius of North Beach and want a seat and a dinner that's in no way a big production.  Barstool, beer, bohemian eggplant &amp; mozzarella.", 
    "review_date": "2010-07-21"
  }, 
  "xyNdK7m0i1Y4pb4gJicA6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clar L.", 
    "review_text": "Note: no cigars or related found here. Sorry, cigar aficionados.   Ambiance: Small and cozy, about 4-5 tables for three, with a bar. Quaint dark wood interior, and a split door entrance with character. Everyone is guaranteed a view of lovely green Washington Square, which is directly across the street. Depending on who is manning the CD carousel, you'll be listening to soothing bossa nova, new age world music, or lively Spanish salsa. Loud but not too loud for table conversation.  Seems to be a quiet choice for active, 20s and 30s North Beach locals who happen to be in the vicinity. Not one tourist to be seen.  Only one bathroom. It's in the back, as large as an airplane restroom, without the mirror. Seems almost like it was installed as an afterthought.  Drink:  Kinda on the small portion size for the money, but hey, it's North Beach. Tea options are nothing exotic and quite limited (about 5 choices of bagged supermarket-grade tea), while coffees are standard fare. They do better by their coffee. Of course, they also have beers, many in bottles and about 3 on tap - I'm personally happy to find Italian beers here, even if only in bottles.  Food:  The desserts are a bit disappointing. Their tiramisu and ricotta cheesecake are the only ones homemade there. The cheesecake tasted nothing of cheese, strongly resembling angel food cake in taste, look and texture. The lower half of the cheesecake was some sort of egg custard. Better to go with a meal order, as that is where their strength lies.  Service:  Good and friendly. The staff is youthful, calm, all smiles and happy to give recommendations and answers.", 
    "review_date": "2007-02-27"
  }, 
  "U9yWtQO_0LPjtaU9jN0JsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean K.", 
    "review_text": "After having the meatball focaccia sandwich bookmarked for ages I think that I waited to long to finally try it. Not because I've been missing out but because so many good sandwich shops are now in business. So whereas the meatballs were tender and the sandwich was okay, it just wasn't great.   I guess if I lived nearby I would stop by more often not because of the food but because of the vibe. It's apparent that this place attracts regulars who banter with each other and the staff during the day. Very cozy and convivial atmosphere.", 
    "review_date": "2013-12-04"
  }, 
  "X_9DrBW2oI_FR21nf7yx8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane P.", 
    "review_text": "The lasagna here is the ultimate winter comfort food. Mario's is very cozy, with an old-fashioned San Francisco atmosphere. It's a good place for dates ... my parents had their first date here in the early 80s, and it's where I take a guy I'm seeing if I think he's really special. If the weather is nice, get an outdoor table facing Washington Square Park and people-watch. My only complaint is that service can be very slow. My friend and I were here for lunch once and waited almost 40 minutes for the check after we asked for it. I'll be forgiving since it was the day of the North Beach Jazz Festival, but that was really bad. Come for the food and the atmosphere.", 
    "review_date": "2009-03-05"
  }, 
  "bFVQxZzaqIrt8Ih9Ju8SPw": {
    "user_rating": 4.0, 
    "user_location": "Portland, ME", 
    "user_name": "Rebecca M.", 
    "review_text": "The bf &amp; I were out for a long, rambling walk, &amp; got hungry for something not-so-heavy.  Found this place via Yelp, &amp; so glad we did!  It was about 8-8:30pm on a Sunday evening, &amp; the place was steady, but still had several open tables.  Nice, mellow atmosphere.  We both got the meatball panini.. normally we'd try two things &amp; share, but it sounded too good to share.  I got mine without onions, because when asked, the waitress advised that they weren't cooked (I'm not a huge fan of raw onions).  SOO yummy!  The bread was amazing!  The meatballs had wonderful fine, meaty texture &amp; delicious flavor.  Lovely melted cheese.  And perfect serving size... enough to satisfy, but not overstuff.  And good beer.    Cozy, warm interior.. very classic, pretty small.  Nice neighborhood-y vibe (even though it's not our neighborhood, lol).  A perfect stop for a cozy bite &amp; sip, alone or with another.", 
    "review_date": "2009-10-10"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "My friend and I stopped in over the weekend to grab a cup of coffee when it was downpouring.  Unsure of what would await us inside (cigars?  maybe something else?), we both ordered lattes, and they were pretty spectacular.  It's a great little nook in North Beach where you can mostly avoid the crowds of some of the other coffee shops.", 
    "review_date": "2011-02-20"
  }, 
  "aBfT6rp0tfhEyc7fWeuYJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rose Q.", 
    "review_text": "Mmmm.  Delicious foccacia sandwiches, unlike any I've had elsewhere.  Plus a great view of Washington square park, a bar to sit at if you're by yourself, and usually friendly staff.", 
    "review_date": "2006-08-18"
  }, 
  "ZBvgdepd6a_eRL9100jnvQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheila W.", 
    "review_text": "I spent the weekend sick as a dog.  Awful.  I managed to stumble down the block in search of sunshine and sustenance and made it as far as Mario's, where I almost collapsed onto a barstool.  The friendly guys behind the counter took good care of me, and within minutes I was set up with a copy of The Onion and an absolutely delectable chicken sandwich.  Sweet!  Thanks, Mario's, for letting this Typhoid Mary inhabit your joint.  I'll definitely be back.  (PS:  I tried really hard not to cough...I swear...)", 
    "review_date": "2007-04-15"
  }, 
  "0NHFUcmVPIUTXn8hJzagNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "I didn't notice any cigar business going on here  I had a great experience here on a beautiful summer July evening.   Mario's is small, but has plenty of San Francisco charm that you'd expect in North Beach.  There's a nice mix of international and local folks that come here. Since I'm a music snob I noticed they had some reggae on the ipod which helped the laid back vibe. Hence the Bohemian in \"Mario's Bohemian Cigar Store.  I ordered a Salomi, Jack cheese Panini and the GF grabbed the chicken pesto with sun dried tomatoes.  The sandwich is a decent size, and very tasty.  Great place for a glass of wine and some food.  FYI Take your parents here for lunch when they visit.  They'll love the Neighborhood", 
    "review_date": "2008-07-01"
  }, 
  "Nq79UljHwHu6y6W795_O9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nolan E.", 
    "review_text": "My favorite cafe in north beach, tasty sandwiches, friendly service, good beer and wine, and no pretension.  Their focaccia sandwiches are the best!", 
    "review_date": "2009-08-23"
  }, 
  "B3_3WVRuHGccKEPT5fbbdg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corbin C.", 
    "review_text": "Good for coffee, paninis and sandwiches are pretty disappointing.  Add a side to the $10.50 sandwich and then we'll talk.", 
    "review_date": "2014-01-04"
  }, 
  "MS1N3m_RPWAghXBLR4OgkA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "DeeDee E.", 
    "review_text": "This place is fun...low key little neighborhood place that my sister recommended. We had yummy pizza. A fun little find.", 
    "review_date": "2011-02-05"
  }, 
  "gG6FFEEVRf9qu0cMqosSQg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "saurabh S.", 
    "review_text": "I can't believe a cafe in SF doesn't have soy milk.  I had the espresso and it wasn't very impressive. My friend had a regular cappuccino and it was very clear that they don't know how to foam milk. Ironically there is not much good coffee in north beach.   We had one of their focaccia sandwich which was good but we were certainly expecting more from a such a historical place.", 
    "review_date": "2009-04-24"
  }, 
  "u6t-4eN6VEPRG85k3sKmaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John E.", 
    "review_text": "This has been my favorite hangout in the world since my first visit in 1973, the year the Crismani family took over the former \"Bohemian Cigar Store\" (which really did sell cigars), and i arrived in NB. it had been one of the several \"Italian old men\" coffee/wine bars in North Beach. they were all gone by the late '70's, the Portofino (where Cafe Roma is today) and others i can't remember the names. within months Mario kicked out all the old guys, took out their old Italian pinball machines, and completely shifted the customership to all us 20-somethings who were flooding into San Francisco and NB in the 70's, plus its many continuing beat-era denizens. very smart business plan, betting on the future. there were no windows on the Union Street side at all, those were added in the 80's. Mario kept a box of cigars under the counter to sell just in case someone wandered in and asked for one until he passed away in the 90's. at some point around then they had to take out the Foosball game in the back to add more tables because the landlord raised the rent a lot, also adding the sidewalk tables outside. but aside from such details it really hasn't changed at all. they have had the good sense not to redecorate or try to update. it still has one of the funkiest (but clean) bathrooms in town. Lilliana still bakes the pastries, the sandwhiches are tasty, and the servers are always very neighborhood-y. the generations of customers, servers, and passers-by shift with the years, but the place is timeless.  just thought i'd offer some history for context.", 
    "review_date": "2012-01-25"
  }, 
  "ksRdqPxR-of7gpnAD8JrZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace g.", 
    "review_text": "I come here at least twice a week. I love the food and everyone in there!! I say....it's a must!", 
    "review_date": "2013-07-09"
  }, 
  "rOOn-eWAaoSx-1omIO-KZw": {
    "user_rating": 2.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "V Z.", 
    "review_text": "coffee and wich, not much for me for a weekend lunch", 
    "review_date": "2010-10-08"
  }, 
  "dknykwweCpZFt6V_59wlvA": {
    "user_rating": 5.0, 
    "user_location": "Missoula, MT", 
    "user_name": "Susie O.", 
    "review_text": "My husband was first here 15 years ago and he was hoping it was still there.....IT WAS!  What a great place.  Wonderful sandwiches....pannini and foccacia, and great beers.  They have a house Campari that my husband had....mmmmmmm!  Great staff, charming location, right on the corner in the North Beach area on Columbus.  So good!", 
    "review_date": "2012-10-29"
  }, 
  "2gV1sQgDbZHOvfPaewbYZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pastor Z.", 
    "review_text": "A nice little spot near the greenery of Washington Square; perfect for catching the last sun of the day while sipping on a cold beer and munching on a petite slice of pizza.  Very shifting quality among their personnel though: sometimes service is good, sometimes service can be straight up horrible/non-existent.", 
    "review_date": "2008-08-27"
  }, 
  "hAA318ThgJmKWiHKhPX-Xw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ferdinand B.", 
    "review_text": "This is review is based on service and service alone.    I guess its true, but the first impression is always important.  The fine customer service I received from Mr. Moustache can be rated at 1 star.    Why you may ask?  Where should I start with my list of adjectives, pretentious, sarcastic @hole, cocky, rude, and the list goes on.    Take your time and money elsewhere.    I hate it when decent north beach establishments become ruined because monkeys are giving aweful customer service.", 
    "review_date": "2012-12-18"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Mario's is fantastic! For the longest time, I thought they only served coffees. Then I realized they also served beer and wine. Then I realized that they also serve some of the best sandwiches in San Francisco...!  The foccacia sandwiches which range from about $7.75 to $9.50 are huge and amazing! I was particularly impressed with chicken #1 and the tuna sandwich but the grilled eggplant and grilled veggies were good too.  The panini sandwiches are a bit smaller and about $1 less and still great! The salads are also very fresh and I've heard that the pizza's are yummy.  The cappuccinos that I've had have been very good but the straight coffee's that I've ordered have been not as good... In terms of other beverages, they have lots of great wine starting at about $5 a glass (Dad complained that they weren't using \"real\" wine glasses outside... more like mini water glasses but I think he may have gotten a bigger pour than a wine glass!).  We stalked a group that were finishing their lunch and then grabbed their great table out in the sun. There aren't enough outside tables but it's great when you can get one!   I've also done take-out for dinner and their sandwiches maintain their amazing quality as they travel in perfect little cardboard boxes where they can't get squished!", 
    "review_date": "2009-03-09"
  }, 
  "bHKnWT6cUshsxBs9DLVHfQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mike S.", 
    "review_text": "Mario's is a great neighborhood spot if you want a simple place to get affordable food and drinks and be able to talk. Doesn't sound like much to ask for, but these things are at a premium in this area.   The location is just far enough away from all the shit hole tourist traps with neon signs down the street so there's no real spillover. Every seat is a window seat and the people watching is great with the park right across the street.   If you're a guy over 4ft tall and have had a few Peronis, have fun trying to use the bathroom.", 
    "review_date": "2010-11-30"
  }, 
  "M271Ac7UKVaQ9U5AOvc_9A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicky L.", 
    "review_text": "Let's get something straight.  A hot tea and a latte should not cost $7.  Oh wait, it's because they overcharged and I didn't feel like bringing it up to them because we were in a rush to leave.  Just another regular coffee shop with some good people-watching seats overlooking Washington Square Park.  With so many other options in this area, Mario's doesn't rank high on my list.", 
    "review_date": "2011-07-06"
  }, 
  "wW_qpveJyFmG2KUuoIi3jg": {
    "user_rating": 2.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Sandi O.", 
    "review_text": "I was at the bohemian cigar cafe we ordered I/2 hr later the waitress tells us she forgot to put in our order she laughs about it as her and co workers are drinking behind the counter she brings us the wrong drinks as we were still waiting than she's behind the bar eating toast and licking her fingers (gross)  finally our food comes after 45 mins ,it was only a tuna salad and a panini that was burnt we were the only ones eating. So it wasn't busy Never apologized asked if everything's ok. Never going back.", 
    "review_date": "2014-11-05"
  }, 
  "7At-2aosTzh6pJcQyMrubA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "J P.", 
    "review_text": "Went only cuz Molinari's was closed.   :( Pretty good sandwiches. Waited 30+ min for take out.", 
    "review_date": "2011-03-15"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Crappy service. Sluggish workers that took like 20 minutes for a waiter to come by to provide the menu and then another 15 to get our orders.  Ugh.   With competing restaurants next door, down the street and around the corner, I could have went to another cafe with the similar theme and be served by them the time I got my beverages here!  Tea and coffee is mediocre and the prices for beverages and sandwiches are a bit above the norm, but with this kind of service, it is not worth it at all.  It is located on the corner of the main street Columbus, so it has a good amount of exposure for people to walk in.  As for me, I am definitely not coming back.  There are too many restaurants and cafe shoppes in this vicinity to simply explore!", 
    "review_date": "2013-04-13"
  }, 
  "Yb5sQ-UyHptOUJbQq0lo3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alix D.", 
    "review_text": "BEST TUNA MELT IN THE WORLD....Seriously, no joke....I have been eating here for over 25 years (since I was just a little girl, getting my first hair cut next door).    Served open-faced on freshly baked focaccia bread, with swiss cheese and white onions, then cut into \"fingers\" about 1 inch by 3 inches that perfectly mold (and melt) in your mouth.  I have taken countless other people to Mario's and everyone agrees.....best tuna melt EVER...hands down...  Priced around $12, its not the cheapest tuna melt around, but its worth every penny", 
    "review_date": "2012-04-23"
  }, 
  "uDNkwTSWMsLMlfUKumKlXg": {
    "user_rating": 4.0, 
    "user_location": "Morristown, NJ", 
    "user_name": "Sean O.", 
    "review_text": "I love this place. Just a tiny bar at the corner of Columbus and Union that happens to serve kickass sandwiches and Moretti in a bottle. Ended up stranded here last week when it started pouring rain and i was without umbrella. Mario's is not a bad place to be stuck inside.   I must note that i have never purchased a cigar here, nor ever even seen a cigar here. I'm sure they are somewhere. I guess i have have a reason to go back.", 
    "review_date": "2009-10-28"
  }, 
  "ZZyrSR4pke-Qi7Ul9EVKxQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Yan P.", 
    "review_text": "Very cute Italian style coffee shop we stopped at to recharge.  They have a full selection of coffee drinks and beers as well as a great staff.  I wish I can give bonus points because they had a phone charger that they let me use.", 
    "review_date": "2013-07-24"
  }, 
  "HQLNCYvZS3-gYTGaGvOS9g": {
    "user_rating": 5.0, 
    "user_location": "Nob Hill, San Francisco, CA", 
    "user_name": "Charles H.", 
    "review_text": "This is the best meatball sandwich I have ever had. That's an aggressive statement, but totally true.", 
    "review_date": "2014-05-17"
  }, 
  "-34NV3A5a5gcL-s8UH4KbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie T.", 
    "review_text": "When I am in North Beach (which is not often), this is the cafe that I will go to. Everyone who works there is so nice. Sweethearts.   If you get a chance, order the cheesecake. It's not even cheesecake. It's light and fluffy and an enormous piece of heaven. The wife of the owner couple makes this at home. Mm. I am thinking of heading over there later today just to get me some of that.  And... their sandwiches are amazing - no fuss, simple is better, high quality ingredients. The perfect place to spend a lazy few hours.", 
    "review_date": "2007-11-20"
  }, 
  "u3xVUab_KTM_ddu7ifeJhw": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Spencer W.", 
    "review_text": "mario's is pretty cool.  no cigars here, but a very nice location serving good coffee, tiramisu, and hot sandwiches and pizza.  my favorite:  an anchor steam, a cappuccino, and tiramisu in the afternoon.  if it's warm enough, i'll take a seat on the sidewalk on the North side of the shop, which is fully shaded during the day.", 
    "review_date": "2008-01-18"
  }, 
  "eiTboCTfpX0t8mWXLwcwYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "Tried this place about four times now and have mixed reviews. The sandwiches taste great, but on the pricy side for not coming with chips or a salad...they need to improved their customer service, it takes them a while to get to you for being such a small place...I will continue to go there when I'm not in a rush, the paninis are that good", 
    "review_date": "2014-02-09"
  }, 
  "Uzr6q-ad8aJ7OFzsx0tgyw": {
    "user_rating": 2.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Angelo A.", 
    "review_text": "Used to be great. The service is awful. I wish the owner would hire more competent people.", 
    "review_date": "2013-10-12"
  }, 
  "VnzpoG3nClXrv41x5Mx0mg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D A.", 
    "review_text": "Great cafe on the corner, North beach classic.   Grab a seat outside or at the counter, try a meatball, sausage, or eggplant  focaccia sandwich.  (About $8.00) Love the pepperoncini on the side for that extra kick and goes down nicely with a peroni.  Great spot for lunch or a great spot to film your music video like R&amp;B singer Monica did back in the day.  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DGx9cl-QChyU&amp;s=b3f695da46411e7274d59757a8cc9a073c11d649b33051871147c1cc5896bc3e\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=Gx9c…</a>", 
    "review_date": "2007-10-08"
  }, 
  "moatmEAhuR7u7PnYwhAvpQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anastasia B.", 
    "review_text": "Eh. Was very excited to try out the food here, but mediocre service and bland food made this a 2-star review.   I had the Chicken Sandwich #1 ($6.50 for half, $11.75 for full) and it was disappointing. Barely any flavor, no spices, etc. I had a bite of my husband's meatball sandwich, and while it was better, it was still \"eh\". I really wanted to like this place, but oh well :(", 
    "review_date": "2014-12-15"
  }, 
  "oxweEEnMFLCIuFMZxv43hQ": {
    "user_rating": 5.0, 
    "user_location": "Bay Area", 
    "user_name": "Mary K.", 
    "review_text": "I've been going here with my dad and my grandmom since I can remember. Every friend I've brought here has been impressed and wanting to come back! We only go here for the focaccia sandwiches. I've had all of the sandwiches on the menu, and my faves are probably the meatball and the chicken dijon.  I dont know how they do it, but the bread is just perfect. every. time. Crispy and oniony on the outside, with the perfect soft bread on the inside.  I've also had one of their salads before...I forget what it was called but there's slices of mozerella cheese and tomatoes, with spinach leaves, topped with pesto sauce. that was also pretty delicious.  I cannot get enough of this place. its a really cute, local little cafe at the corner across from Washington Square park. a great place to people watch!  Just to add a story to this post, I went in there with some friends one day, and this Italian guy was at the bar. he comes up to our table, pulls up a chair, and says to me \"you look just like my ex girlfriend back home!\" and we start up a conversation. It was fun, he was nice. A cool place to meet people too. haha.  Also a good thing: they open until 11pm!!!", 
    "review_date": "2009-04-29"
  }, 
  "bE5Swrp3qwsgA_SyVBUfbg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Novalina N.", 
    "review_text": "Perfectly satisfied with the meatball and the combination sandwiches. Meatball sandwich is pretty good. I ate the combination sandwich the day after, so it definitely is not as good as if it was eaten there. The focaccia bread is yummy, but it's really thick and 1 dimensional? I probably prefer a panini myself.  Tiramisu tastes amazing! I finish the entire dessert myself. I like how it's a bit wet and very flavorful.  I used a HomeRun voucher with me and there's a little bit of confusion on whether the expiry date has passed. He stared at the voucher for a good 10 minutes before giving me the americano and water. The owner doesn't seem too pleased with the voucher in general I'd guess, so I definitely advice against buying any vouchers for this place. And this is validated by another reviewer's crazy experience before mine!", 
    "review_date": "2011-04-21"
  }, 
  "uF5V6WYHa38TJU9LFQyjFQ": {
    "user_rating": 5.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "David B.", 
    "review_text": "Amazing meatball sandwich, out of this world tiramisu, perfect coffee, and one completely hip and comfortable place!! Especially since all can be had for next to nothing!", 
    "review_date": "2010-12-20"
  }, 
  "kPeiNC7_wWsrkUynBl1-HQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sonia H.", 
    "review_text": "Ages ago a friend took me there and recommended the eggplant parmesan focaccia sandwich. It was so good that I've never been able to order anything else. About once a week (or more) I get this undeniable craving and HAVE to go. It's wonderful.   In addition I like the environment. It's never too crowded, the people working there are really mellow and friendly and it's got this nice patina of age. If their sandwich wasn't sublime, I'd probably still go there sometimes for a drink. But I'm glad that their sandwich exists.", 
    "review_date": "2008-09-12"
  }, 
  "HkPT4Y19Olqsmtvvnalw3A": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Liz C.", 
    "review_text": "Damn this spot is great. I suggest the Foccacia sammies or the tukrey and blue cheese panini and or the tomatoe mozzarella. My boyfriend eats two freakin sandwiches, which I cant even believe, But imt telling you, its ridiculously bomb and worth getting a parking ticket!! Great on a sunny day, or a \" you just slept at my house, I dont really know you, but, eh, I wanna see what you are REALLY like,\" brunch", 
    "review_date": "2008-02-08"
  }, 
  "QIEgvzl1764XnHqW1enHyg": {
    "user_rating": 5.0, 
    "user_location": "Forestville, CA", 
    "user_name": "fused g.", 
    "review_text": "This is the real deal....if you like to relax in 'little Italy' and dream of Florence or Lucca whilst sipping a delicious cappuccino, look no further. It is small, intimate, old-style. And very European, very Italian. I knew Mario's while growing up in NB and it's barely changed; thank god. This sweet little cafe fronts beautiful Washington Square Park and corners busy Columbus Avenue...great for people watching. Order their absolutely wonderful meatball sandwich (or any for that matter). I adore this place. All is right in the world.", 
    "review_date": "2012-06-26"
  }, 
  "3gRykLgv5-_vxngoRlAFrQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julian M.", 
    "review_text": "I discovered this place 7 years ago when I lived in north beach and even though I live in the mission I still make it over there whenever I can. There is something about those foccacia bread sandwiches that is so delicious. I have taken many different people there and everybody has loved the food. The mini pizzas are tasty too. I could eat the chicken sandwich #2 everyday. The atmosphere is great and coffe is strong, and on a nice day/night you can sit outside. My favorite place in North Beach by a mile. Minus one star because the waitress with the big eyes is kind of rude.", 
    "review_date": "2009-04-17"
  }, 
  "9aZJMOox-6E0W_pBnaVZlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alli J.", 
    "review_text": "Man, that oniony foccacia bread is heavenly. I think I'd be happy if it were just a little toasted with big bowl of fruity olive oil. I've tried one of the chicken sandwiches and the meatball one and I prefer the latter. I'd say it's not a typical meatball sandwich though - it's most of a deconstructed meatball slash sausage sandwich. In any event, it's pretty good. (Sounds like the eggplant one should be next based on the other reviews...)  I like the relaxed vibe of the of place - the bartender/server guy was super friendly both times I dropped in. It's nice to know there's a mellow place to get a bite when you're too hungover to deal with anything that's remotely uncasual.", 
    "review_date": "2009-05-25"
  }, 
  "QR58q2KsjkTKzACr1JahHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda S.", 
    "review_text": "I love Mario's.  It is an Italian style restaurant.  It has a bar and some of the best pizza and sandwiches on focaccia bread.  It is walking distance from Bimbo's.  Check out the International Bar across the street from Bimbo's.  That is a regular spot for me and it's where most people go when they leave Bimbo's.  The bartenders are friends of mine.", 
    "review_date": "2005-02-24"
  }, 
  "qoYZ6QbVczMo3Dtyaeubhg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ali L.", 
    "review_text": "Lovely little cafe overlooking Washington Square. From the comfort of your seat, while sipping delectable hot chocolate, you can see the bronzed yoga man in nothing but shorts on a cold day, dog walkers pretending not to notice when their dog takes a shit, and random children playing (not sure I knew children actually existed in this city)  Good food, interesting people watching, and a nice respite from the usually touristy North Beach.  Note: Not actually a cigar store. Don't go in here thinking you'll pick up some Cubans on the down low. Not gonna happen.", 
    "review_date": "2007-01-25"
  }, 
  "sFP8CNt6hFqepeiuqgj6fg": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": "Joe J.", 
    "review_text": "intimate feel, fast service, the menu is simple an straight to the point, all components to a good spot. I had the tuna sandwich here today, definitely worth it. Stop by have a Peroni on me.", 
    "review_date": "2008-02-22"
  }, 
  "uKd-4aCc2ud8Sum1fjYRfA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Laurie A.", 
    "review_text": "I loved this place. We only went in for a cup of coffee but the experience was great. The cakes looked amazing. My favorite part was the 2 servers behind the bar. They were hilarious (you know who you are handle bar stache). Plus the latte was amazing, best I had had in years.", 
    "review_date": "2010-06-09"
  }, 
  "nb5Q_TnCH8CjgjWDaCDVvg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Crystal H.", 
    "review_text": "What a fantastic little place! Great service, super food and drinks, and so affordable. My friend and I split the spicy tuna foccacia and prosciutto baguette (both daily specials and FANTASTIC), hummingbird IPAs, and coffee drinks and got out of there for less than $20 each. Our server was even kind enough to give us public transportation directions to our next location on the back of a napkin. The other server even gave us some gum after our strange combination of food and drink - much appreciated!", 
    "review_date": "2012-12-27"
  }, 
  "_4SntAIQYfGdPtWdTBUTHQ": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "David F.", 
    "review_text": "This is one hell of a little fantastic place to grab a drink and a quick gnosh. The sandwiches and pizza are pretty effin great.  I even saw the bartender carefully take down a poster from the wall and give it to a customer because the customer liked it.   Deliciously San Franciscan. Don't miss out.", 
    "review_date": "2007-07-31"
  }, 
  "cCeCQxErE9ToaQQBEVFuFA": {
    "user_rating": 4.0, 
    "user_location": "Bellmawr, NJ", 
    "user_name": "Abigail W.", 
    "review_text": "on a crisp cold afternoon we (mostly meaning I) was starvin and looking what would crave my hunger. my boss had told me to try this out, so the bf and I headed on over. love the feel in the place; comfortable, homey, and right across the park for some good dog watching :) we split the caesar salad- romaine fresh and crunchy, croutons were just perfect, shaved parm, and the dressing, although lightly dressed, was absolutely delicious. tasted just like our homemade version. for the main parts- i got the meatball sandwich, him - the salami panini. i really enjoyed the marinara and the meatballs. they were fluffier, probably had a good amount of bread in them. the bread on both sandwiches were just awesomeness, asked the server and told us they get it from Bakers of Paris. his salami panini had that meaty slightly spicy thing going for it. pretty good prices too.", 
    "review_date": "2009-11-22"
  }, 
  "bt4pSBah2St9nWoBB-EOAQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mercutio k.", 
    "review_text": "$15 after tip for a rather unforgettable meatball sandwich that was overhypped as hell does not qualify as one $ nor good eats.  Service was adequate, but there's no reason to make a trek out here for an average sandwich.  Go to Ike's instead.", 
    "review_date": "2010-10-06"
  }, 
  "ydSrLLpFSl9oYcTUtJnbaA": {
    "user_rating": 5.0, 
    "user_location": "Aptos, CA", 
    "user_name": "Ebert S.", 
    "review_text": "I've lived in S.F. for over 20yrs and would come here at least once a month. I moved away but still have to stop by here every time I visit my family to get my meatball sando fix. Bar None the best meatball Sandwich ever. I sit at the bar, order an Anchor Steam and feel like I never left. The staff is great, they remember me and address me by name, which is amazing.", 
    "review_date": "2012-04-17"
  }, 
  "CNw5B3BBhTbOlrOlS1meEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael R.", 
    "review_text": "Despite the unappetizing name, the sandwiches here are good, especially the eggplant or meatball panini. Add a cold beer and you have a very filling lunch.", 
    "review_date": "2006-05-05"
  }, 
  "Ven8UIY0u3Jxqa_V9p021g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jon F.", 
    "review_text": "Another local treasure I'm prone to sit in for hours. Its really not about the food, its about the people. Its about the space, the place, the close proximity to Bimbo's. Its about people watching, and listening in (or joining in) on conversations and the bar is easy to lean against.", 
    "review_date": "2006-05-05"
  }, 
  "qXTZ2Ffu-Esa3I3F7u9HrA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Charlene M.", 
    "review_text": "OOOOH MY GOOOOOD Yeah baby.... MMMMMM MMMMM  This is the place to go for a huge meatball sandwich and a slice of tiramisu  the meatball sandwich comes with flavorful tender meatballs in a rich mild tomato sauce and mozzarella cheese enclosed within two fresh slices of foccacia bread. This sandwich was huge and definitely you will have leftovers.  Have a slice of their tiramisu. Creamy, fresh, lightly sweet and delicious.", 
    "review_date": "2008-01-13"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "I've passed by this place a bunch of times and finally stopped in for a quick bite before lounging in the park. I walked right in and started chatting with the guy behind the bar/kitchen that was making sandwiches and pizzas. Found out they do take out so I ordered up a chicken panini and coffee and continued chatting. The space is super cozy and had I not wanted to soak up some sun, I probably would have stayed to eat my sandwich there.  The sandwich itself wasn't anything spectacular. It wasn't bad, it wasn't excellent...just meh. I did see a plate of sausage and polenta that got me drooling, so maybe I'll just go back and sample that? Yes.  Also, I asked for a coffee and they offered me an americano instead. I mean, yeah, I get it. Same concept, but I feel like I ended up spending more money.", 
    "review_date": "2011-07-08"
  }, 
  "LwJuBvnmCPWxyaCVO6L_PA": {
    "user_rating": 5.0, 
    "user_location": "Portsmouth, NH", 
    "user_name": "Laura J.", 
    "review_text": "The first bar I went to when I moved here four years ago.  I will never forget Amor, Nelson and Heiyme (sp?) = the bartenders.  You want a mellow, chill night? Get drunk and enjoy a salad and paninni at Mario's", 
    "review_date": "2008-07-15"
  }, 
  "2hHZVnE1WThvDU3Y3jNjTA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Ron B.", 
    "review_text": "Good sandwiches servered heated out of the oven on local bread, good views of Washington PArk in North Beach.  Very small, best if its just for two.  TIP: get your sando to go and eat in the grass across the street.", 
    "review_date": "2005-04-19"
  }, 
  "HFECrzYDpgbS5EmTBtj2zQ": {
    "user_rating": 4.0, 
    "user_location": "Albany, CA", 
    "user_name": "Eric B.", 
    "review_text": "Mario's Bohemian Cigar Store is one of the oldest cafes in North Beach, (and maybe the US) and was founded by Mario Crismani and his wife, Liliana. They serve oven baked Focaccia Sandwiches (and other Italian fare), beer, wine, coffee, great desserts, but no cigars.  Gayle and I have been here on a date, and were lucky to find a table at this very compact and authentic corner space. It's also cool to see Washington Square park across the street and watch the world (including a few Bohemians of course) go by. The food was good, the service was \"direct\", the energy was exciting, and the decor was homey. In other words, it's a real North Beach neighborhood experience.", 
    "review_date": "2011-06-04"
  }, 
  "45QGl0zmMCBTR8xK43yNEw": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Vanessa E.", 
    "review_text": "Yummy!! This place is unbelievable. My hubby and I have been coming for years when we are in the city. Try the Meatball focaccia sand which and for the veggie in your life go with the eggplant.   The staff is fantastic even if they don't acknowledge you right away... It's probably because they are pouring a stiff glass of wine or making you some kick ass food.   Be a cool kid and go here!! If you dint your a fool. ;)", 
    "review_date": "2015-01-30"
  }, 
  "oDUwWXVtVN8YFivMfFK1hw": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Jay E.", 
    "review_text": "This place is the perfect little hole in the wall. It always has a crowd, but never the overly busy feel to it. It is a very cozy corner shop with friendly staff, beautiful focaccia bread and a diverse crowd of tourists, regulars and passersby.", 
    "review_date": "2011-02-22"
  }, 
  "0wT8cxKg9WN3Xhf3vbN-tA": {
    "user_rating": 5.0, 
    "user_location": "Salida, CA", 
    "user_name": "C T.", 
    "review_text": "I LOVE this place!  My husband brought me here on one of our dates and we always go back to it when we go to the City.  The owner is very nice!", 
    "review_date": "2012-03-22"
  }, 
  "Cp3i9koV3ryHFQ8CM764zw": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "R M.", 
    "review_text": "Between three and four stars and pushing the culinary limits of what's possible with a glorified toaster oven. Mario's limited menu is consistently decent and they do panini, focaccia and small thin sliced pizza well. Good place for a simple meal, beer or wine, or coffee drink. Check out the photos on the wall of the family, including the original owner excelling in bocce ball and looking like the Soprano's Feech LaManna and son who is a dead ringer for ex Pittsburgh Steelers head coach Bill Cowher. A fine and authentic, low key, North Beach vibe.", 
    "review_date": "2008-02-10"
  }, 
  "jAes_OPpvQy-cnmctqRqwg": {
    "user_rating": 4.0, 
    "user_location": "Allen, TX", 
    "user_name": "David V.", 
    "review_text": "Cool spot, cool area, friendly, on-the-ball service and good food. Definitely worth a visit if youre nearby or on a regular basis if you live close.", 
    "review_date": "2009-10-05"
  }, 
  "H96D8BoF4e24MMSnxXZdMg": {
    "user_rating": 2.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Y B.", 
    "review_text": "The meatball focaccia is very good - but had to wait 45 minutes to get it. As soon as we got our food, we took it to go as paying $4 / hr for parking just doesn't warrant me sitting around waiting for food for that long.  No one said - your food will be about 30-40 minutes.", 
    "review_date": "2011-07-02"
  }, 
  "CII7ZpjbiSM_m_C62QkfAA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Buddy R.", 
    "review_text": "Mario's Bohemian Cigar Store Cafe is a great place to the following...  - Get lit at the bar and make small talk with people.  - People watching on the outside tables.  - Drinking coffee and/or eating very good focaccia bread inside on a nice day.  Great place to bring a party of 2 or more.", 
    "review_date": "2005-08-07"
  }, 
  "HKJaeOUgAU01deyjfCSXHA": {
    "user_rating": 5.0, 
    "user_location": "Rancho Cucamonga, CA", 
    "user_name": "Kelley S.", 
    "review_text": "As good as it gets!", 
    "review_date": "2014-03-29"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "It really can feel like like Europe on a lazy weekday afternoon in North Beach and we're not talking about the number of tourists. Sitting out in the sunshine at Mario's Bohemian Cigar Store Cafe overlooking Washington Square Park is a nice staycation thing to do.   Now to be honest the food isn't that special. You can get better sandwiches elsewhere but the charm isn't really the food. I've had paninis here before but more often than not, I end up just grabbing a nice cold beer to relax and watch the day go by. It's a take it slow kind of place. Service here is never hurried so it complements the whole kick-back experience.   Come for the experience and relax, take your time, and enjoy.", 
    "review_date": "2012-07-10"
  }, 
  "qVCGzJCDnjwut1dnHef2Og": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Rew C.", 
    "review_text": "No Cigars but great food. They use Foccacia bread and the meats for the sandwiches are delicious.  Definitely GO!!", 
    "review_date": "2011-01-19"
  }, 
  "9Wrg-nTHQtM7KFn_legxow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dan B.", 
    "review_text": "The panini here are fantastic. It's the perfect spot for a quick lunch or dinner. But let's be honest. There's a lot of other reasons they get 4 stars: the name, the view of Washington Square, Moretti Rosso in a bottle, the old North Beach bar. You can't go wrong at Mario's.", 
    "review_date": "2008-10-10"
  }, 
  "0YSBWd176lBnRUHDmwgQcg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kenny d.", 
    "review_text": "it pains me to blast marios with a 1 star review because their food is good but.... Last time i ate there i ordered a chicken panini to go and while i waited for the guy to make it I watched him (with one glove on) sweep the floor, put his hand in the trash, touch multiple other dirty surface's with both hands then proceed to handle my sandwich and garnishes with unwashed hands with one glove still on. I dont mind cleaning up while you wait. but for f@cks sake wash your hands and put on clean gloves before you handle someones food. Especially if they are standing right there watching you the whole time. Based on this one experience I unfortunately will never return to this establishment.", 
    "review_date": "2011-10-20"
  }, 
  "QEXU4HcSdqkeTPM6BXp1iw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex R.", 
    "review_text": "Food is good not great. Ambiance is great not good.", 
    "review_date": "2011-09-18"
  }, 
  "ndcKCKVhlFs_h2rTE8gMGg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "sara p.", 
    "review_text": "LOVE IT ALL!!  I've had pizza, and chicken panini's.I haven't tried their meat ball sammich but I hear its great!  My FAV is the TUNA sandwich- with melted cheese, tomatoes and a side of salad, which they are definitely generous with their portions. The staff is AMAZING- not only is overall service a PLUS, they make you feel like family. That's what keeps me coming back to this place. My fiance and I love going to Cobb's comedy club so we always make sure to stop by and grab a bite before the show, and come back for drinks after.   Overall it's a chill place to go on any occasion. Rain or shine, Mario's is a perfect place to go solo or with a small group of friends...", 
    "review_date": "2010-01-06"
  }, 
  "T5T_SAuW2uFuiJNQ--mtKg": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Carol C.", 
    "review_text": "I never knew about this place until my younger sister suggested meeting here for lunch before we headed to Pier 39.  The cafe is pretty casual and cozy.  Even though the service is a tad slow, still it's a nice place to relax, enjoy the scenery (if one is sitting by the window) and carry on a conversation without a lot of noise around.     Since my sister has been here before, she mentioned that the sausage and meatball with marinara sauce on onion foccacia bread were the \"bomb\".  Instead I opted for the smoked turkey &amp; pepperjack sandwich with my usual...an Arnold Palmer.  Reading over the menu,  I have to say everything sounded delish.  Thus, it will be more visits to this cafe in the future to taste the meatball, breaded eggplant sandwiches and the tiramisu listed under Italian sodas.  My smoked turkey sandwich (piping hot and fresh) with the pepperjack cheese oozing from the side and the hint of dijon mustard was yummy.  It was a nice balance without any flavors overpowing each other.  However, my expectation for an Arnold Palmer was a tall glass filled partly with iced tea and then topped off with lemonade.  Yes, the beverage came in a tall glass, but I was caught off guard and slightly disappointed that it was a bottle of Snapple Arnold Palmer (3 star).  I guess that's why the Arnie Palmer was listed at a price of $2.25.", 
    "review_date": "2011-12-19"
  }, 
  "292O6zybNDXGcVG6F1Frbw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "ali l.", 
    "review_text": "molto bene!  my mozzerella/tomato/pesto panini hit the spot and i enjoyed the cozy atmosphere of the bar area.  plus, i was transported to and from mario's via scooter, which only served to complete my italian moment.  grazie mille!", 
    "review_date": "2007-06-08"
  }, 
  "0QA8_53vKf8Vzn7S65sOnw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Skip Towne ..", 
    "review_text": "This used to be a good bar/cafe, now, it's just historic.  Still its a decent, only semi-touristy place to take your out of town visitors for a relatively inexpensive lunch of foccacia sandwiches.", 
    "review_date": "2006-02-27"
  }, 
  "AWN20sIwFrjG_NIkDrIAlQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Rob P.", 
    "review_text": "i've been coming to mario's since 1994.  it's one of those places where time basically stands still.  it's old school like that.  the decor, the attitude of the folks working there, the patrons...it's got that no b.s., no fronting vibe that only a few north beach spots still have nowadays.  and it's not obsolete in any way.  what worked so well then still holds up today.  excellent paninis.  solid coffee drinks.  inexpensive, not cheap, wine served in gibraltar glasses.  music plays at a volume level that allows for conversation.  bartenders/baristas/servers are attentive and friendly, but without any fake friendly that so frequently passes for customer service nowadays.  the cafe gets great light and is a fantastic place to while away an afternoon.", 
    "review_date": "2010-05-04"
  }, 
  "SCqvfTpB9QhKEIlKDrwC6Q": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Jean O.", 
    "review_text": "Don't be fooled by the name of this place --- the focaccia sandwiches here are so yummy!!!  My favorite is the breaded eggplant.  One tiny drawback is that I think prices went up slightly and the sizes also look a bit smaller.  But I'll still come here to eat!  A great place for take-out to eat at Washington Square Park across the street on a sunny day.", 
    "review_date": "2010-02-24"
  }, 
  "QKSIsCkY834vb6Z1SH-Dyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tory Q.", 
    "review_text": "Tasty sandwiches!  We had the meatball foccacia sandwich and a salad.  The foccacia was toasted to perfection and the meatballs were perfectly seasoned.  Yum-O as Rachael Ray likes to say.  (Okay, she totally bugs.)   The salad was good too, but nothing to write home about.  The waitstaff seemed quirky, but very friendly.", 
    "review_date": "2008-02-10"
  }, 
  "mYHXFms1TY4vZCcoVTGVqg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "The I.", 
    "review_text": "Bad food, worse wine, good time", 
    "review_date": "2008-07-22"
  }, 
  "7TGoPZcVuiQFuHK2WFykKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "I have been eating at Mario's for years.  As big, and I mean BIG a pain as it can be to find parking in the area, it is well worth the effort.  Cozy up the to bar and have a beer while perusing the simple but well done menu.  I love the combination focaccia sandwich.  They buy the focaccia fresh every morning from a focaccia bakery right across Washington Square.  I have heard the vegetarian sandwich is really good too.  It is a family owned business and they treat customers really well.  I know of a couple of generations of families who frequent Mario's.  Suck it up and deal with the parking.  It will be worth it.", 
    "review_date": "2007-10-28"
  }, 
  "mAhty2OHDTtLm00quB5Xjw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Jon F.", 
    "review_text": "5* for Elizabeth and Brian's lovely Festivus party here! Look forward to coming back to see what they serve in this charming little annex of a cafe.", 
    "review_date": "2010-02-10"
  }, 
  "K1oh2YuJghc-pdjfWfVqTg": {
    "user_rating": 5.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Farzin E.", 
    "review_text": "A real Bohemian cafe with cool staff! Not a typical cafe...try their cappuccino!", 
    "review_date": "2013-09-17"
  }, 
  "Bjah16Vlkk6ocxFTfL5G9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "Meatball sandwich is the bomb! Sit outside, drink a beer, eat a sandwhich, and contently watch the world go by. Great place!", 
    "review_date": "2011-10-26"
  }, 
  "n-eYeIpSTiKhoDeubO1mmA": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Omid T.", 
    "review_text": "I got my karmic payback for making light of herpes the other day.   You see, shortly after making fun of the social disease, I sprouted a pimple on the inside of my lip, and anyone who's ever had any sort of blemish or bump or whatever inside their mouth knows that they can hurt like a bitch!   So it was without thinking of this ailment that I bit into a pepperocini while at Mario's. OH GOD DAMMIT TO HELL THAT BURNS! I shoved the generous portion of the offending pickled peppers to the side of my plate.   I took a bite of my heapingly huge foccacia sandwich (your choice of fillings: chicken, eggplant, sausage, you name it!) as the crusty corner of the deliciously perfect foccacia brushed against my lip-pimple. OWW! OH GOD, OK, I WON'T MAKE JOKES ABOUT PEOPLE'S LIP &amp; COOCHIE SORES ANYMORE. AND I WON'T USE YOUR NAME IN VAIN. PLEASE, JUST MAKE IT STOP.   But it was so good, I continued to eat.   Thank you, Mario, for serving up delicious food, a very cozy and homey atmosphere, and lessons in karmic retribution and humility before god.   Note to those confused by the name of the business: The food is not Bohemian in any way, and while cigars are sold, they cannot be smoked here. If anything, it's more of a casual Italian restaurant and wine bar with a dark, homey atmosphere that could've once been a den of cigar-smoking and backroom deal-making.", 
    "review_date": "2008-07-01"
  }, 
  "_gkHU53dyXy6GxK6AX-b0A": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Adam B.", 
    "review_text": "Stumbled upon this place at about 2 on a Monday afternoon while looking for a quick and yummy bite after visiting Alcatraz and climbing way up to Coit Tower. It was the perfect spot to plop down and kick back and relax for a few and, upon walking in, you could tell it was a neighborhood classic.  The staff was super-friendly. When my girlfriend inquired about their Sabu Bloody Mary they told her it wasn't very good - honesty is the best policy, right? Instead, we ordered a couple Anchor Steams and waited for our food. The bathroom was unique but clean and funny to use.  I ordered the smoked turkey hot focaccia sandwich which was perfectly grilled and delicious. It was served with a great cucumber salad and pickle. My girlfriend ordered the eggplant pizza which was delicious as well (although the crust seemed oddly similar to frozen pizza crust).  Prices were fairly good, although on the high end but the personality the place has totally made up for it. Overall, loved it!!", 
    "review_date": "2008-03-12"
  }, 
  "cUVXN2NZX2wEseNfHcetQg": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "A T.", 
    "review_text": "I may be biased but I only ordered a Latte at this place. Why am I giving it four stars then? The coffee was perfect, the temperature was perfect (read: did not burn my lips) and the decor is funky. I'd go here to read a book if I lived in San Fran.", 
    "review_date": "2008-01-24"
  }, 
  "CKT1MbZxKNWtSpj7qINn-A": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Janina U.", 
    "review_text": "i took the 30 bus back to work, but wanted to stop for some lunch.  i had my heart set on giordano bros for some sandwiches, but i friggin' missed the stop.  so i looked out the window and saw focaccia bread sandwiches scrawled on the window.  FOCACCIA!!! I LOVE FOCACCIA!  it was late afternoon and hardly crowded at all, but i swear could they have been any slower??  i was starving, and i did not enjoy the fact there was nothing else on the menu you could munch on along with the sandwich. minus one star.  i got my sausage with marinara and swiss focaccia sandwich, it smelled great and looked great, but for $10.00 including tax and tip.  UH... not so great.  i felt it was missing something, like a kick!  it was a bit bland, i was looking for lots of flavors on many levels.  it fell short. minus last star, BUT I Must say that the focaccia bread was delish!  maybe this place is more of a beer/wine joint.  i will not be returning.  i'd prolly go back to giordano bros a couple of blocks down if i were to get a sandwich in north beach. :) smiles tho", 
    "review_date": "2006-11-09"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "It took a while as my order was briefly lost in the shuffle, but when my open-faced veggie sandwich finally arrived, it was so worth the wait. This calorie depleted yelper, who was just a few hours removed from a 4+ hour epic with Markus Schulz, went right to work.  This focaccia-grilled veggies-marinara sauce creation stood no chance, and as I reflected on last night's show, already being referred to in the text/Facebook world as \"best night ever\", I found the sandwich enhancing my mood even more.  Brilliant weekend. Brilliant sandwich.", 
    "review_date": "2010-07-06"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 3.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "This place reminds me of the cafe's they have in Europe. It's a one-stop shop for all your indulgent needs. Need a drink but also a hot meal? Done. Need a drink but can't unless you get a smoke? Done. Need espresso and a quick pastry? Done. Need all of the above? Done and done.   I have yet to have the food here but the panini's looked amazing. The wine selection is not great so don't come here thinking you're going to get Amelie style wines (not that you would - I hope!). Next time I'll stick with beer; you can never go wrong with a Stella.   I also want to note the generosity of the bartender who gave us a round for free towards the end of the night. Good shiz.", 
    "review_date": "2009-04-06"
  }, 
  "fU-8n2G_hT1vv45W9k6Htw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Prabal D.", 
    "review_text": "I used to love this place,  but wow the service has become terrible.  I came in this week and it took me 20 minutes just to get a drink while I was at the bar!   After that my sandwich was completely burnt.  We go in today for a drink with a big group, we were there for literally one minute and the waitress started yelling at us for being in the way.   POOR SERVICE.  It's really too bad, lot of potential but poor service.  I unfortunately have to recommend that you stay away from this place until they right the ship.", 
    "review_date": "2013-12-13"
  }, 
  "1weX1NNnTFjaRzQHJKhCuw": {
    "user_rating": 4.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Karen M.", 
    "review_text": "I just visited for 4 hours last night with a colleague/friend...and found this to be a charming little spot. Love it! The place is pretty cozy and feels like your own personal cafe when you walk in....very friendly, familiar, charming...  Simple menu which is awesome---simple wine list, again, no problem. I don't do or need fancy-shmancy. My friend told me try either the tuna, sausage, meatball or eggplant panini....now I usually delve into meat options but I'm a huge fan of eggplant so I opted for that and an unlimited amount of Malbec.... SO GOOD! The bread...incredible, the flavors in the eggplant, wow, hearty.... I tried his tuna.... SO GOOD! WIN!   ***note, the amount of Malbec had no influence whatsoever on the rating of the food, promise!***  The server was a really nice character who poured our last glass on the house.... don't know if that meant he was really being gratuitous or if it was because we almost finished the bottle... :) Who cares! It was great.   And the neighborhood is a gem to walk around after... apparently there is a great gelato spot nearby... possibly my next review??", 
    "review_date": "2012-01-12"
  }, 
  "LksuiNKspbDOZYNOkDx1bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lan H.", 
    "review_text": "Love this place!! I woke up this Saturday with no real plans for the morning/early afternoon and wandered to Marios for a cup of coffee and a foccacia sandwich. Reading the newspaper while eating the #2 grilled chicken sandwich (request it open faced!) was the best way to spend this relaxing, sunny Saturday.   Mario has a very attentive staff and great food, although I found myself walking past it for several months before walking in and trying it out. It isn't ideal for large groups, but a great place for intimate coffee or brunch/lunch time w/ friends. The ideal seating would be the front table away from the draft that comes from opening and closing the door.   Again, I recommend the coffee, espresso (strong!) and grilled chicken sandwich open faced. The caprese salad would be more delightful sans the pesto sauce but other than that, I've heard good things about their other sandwich and panini options.", 
    "review_date": "2009-06-06"
  }, 
  "lBaoq2G8xXrSX_esMQXM-A": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Dianne M.", 
    "review_text": "Mario's is typically not a place I would have tried in SF but our favorite bartender at Vesuvio's recommended it when asked where can we get a good sandwich.  The name alone (containing Cigar) would have been enough to make me think not.  Food and smoke don't settle well with me unless we are talking BBQ.  Asking a local is always a good idea because you usually end up with great food at inexpensive prices.  Mario's was one of those places.  Don't overlook Mario's, give it a try, you will be pleasantly surprised.", 
    "review_date": "2009-11-19"
  }, 
  "W_07r13S-cTjPxsd169KYg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Julie H.", 
    "review_text": "I MAKE my friends who live in San Francisco take me here when I visit.  For those of you who know how hideous the parking is in North Beach,  you KNOW this is a favor akin to Sophie making her \"choice.\"  I won't wax, but their meatball sandwich makes me believe in God (and I mean capital \"G\").  I airship these to my father, they're that good.  I can't say more.  It's too intense.", 
    "review_date": "2007-08-31"
  }, 
  "zaBX3i2WgmixzgQBwA33GA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick C.", 
    "review_text": "When you come to North Beach...you usually have 2 things on your mind...1) girls 2) itallian food. Well this place offers up some THE BEST Italian Panini Sandwiches you will find in SF.   Let's start off with the bread...onion focaccia bread, because as we all know it's the bread that makes the sandwich. Perfectly toasted, flavor pops in your mouth.  All their sandwiches are amazing...but their sausage panini...soooooo good.   I ended up ordering the cannelloni...which was AMAZING! Their mix of spinach, cheese, veal, and chicken in a marinara sauce...wow...too bad they only give u 2 :(. I was still hungry so I ordered up a sandwich...best choice I've made in my life.   DEFINITELY RECOMMEND COMING HERE!!!", 
    "review_date": "2010-12-20"
  }, 
  "EuuyiAuEa_s3VSS9i8okmg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah F.", 
    "review_text": "Damn good lasagna!  This is a quaint restaurant/ bar that's no frills, but in a good way.  It's quiet enough to actually have a conversation in this joint, yet not quiet in a boring way.  The server/bartender was really nice.  And, when my dumb ass left the restaurant, forgetting my credit card on the table, he ran outside to give it to me.  Now that's good service.", 
    "review_date": "2008-01-22"
  }, 
  "t8aJIHxkutRlWMRNSvpq6w": {
    "user_rating": 4.0, 
    "user_location": "Enfield, United Kingdom", 
    "user_name": "Grant T.", 
    "review_text": "So, today for lunch my boyfriend and I were looking for a place, and as we tried to go to Mama's (yet again, but an absurd line), we almost went to our usual standby Cafe Divine, but we decide to go to this place instead.  We walked in and sat down, and the first thing I noticed was the cool place.  I was just digging sitting there.  I think it would be a great place to go and just have some coffee or a beer or something and hang out.   We sat by the window and had a great view of the park.  We browsed the menu and I decided on the meatball focaccia sandwich, and he wanted the sausage sandwich.  Mostly so we could just share and each try half of a sandwich.  I had some coffee and we just sat there and enjoyed the atmosphere, the music, and the view.  The food came, and it was pretty darn good.  I think the meatball sandwich was better than the sausage sandwich, but I was happy with both of them.  The focaccia is great too, I don't think they make it there, but it was tasty!    I'd definitely go back for lunch sometime.  There were several other sandwiches on the menu I wanted to try, and the coffee wasn't bad either!  More than anything, I just loved the atmosphere, the view, the company, and the food!  I guess that's everything there!", 
    "review_date": "2009-02-20"
  }, 
  "lNSkba_B8yrvpEuHAi7mXw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marla L.", 
    "review_text": "Mmmmmm.  Great staff, great food and great location makes for great times.  Perfect for lunch.", 
    "review_date": "2006-04-09"
  }, 
  "MzXPOK2_T5O8GF-4qUVmGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica M.", 
    "review_text": "A North Beach institution.  Back in the day, Food &amp; Wine magazine put the breaded eggplant sandwich @ Mario's on their list of \"the 10 things you MUST eat in SF.\"  This was way, WAY before 7x7 magazine came out w their first list, since 7x7 magazine didn't even exist then.  I had to mention this because there are so many newbie \"foodies\" out there that actually don't know that there were lists like this &amp; that there was a thriving food scene in SF long before \"the 7x7 list\" ever appeared.  Even worse, there are droves of people that use \"the list\" as the deciding factor on where &amp; what to eat in this town.  And that's just sad.  SF has been cranking out exceptionally noteworthy food forever, &amp; Mario's has been doing it from day one.  The skinny...  Yes, they used to sell cigars.  Heck, the place used to be filled w smoke when you walked in, when smoking inside was still legal.  When the non-smoking law started, they still sold cigars, just no more smoking.  An espresso here is iconic.  They make a mean cappuccino.  It's written up in many a travelers guide.  We're talking internationally.    The breaded eggplant is just as awesome now as it was way back when.  Only now many peeps seem to love the grilled eggplant just as much.  I say yes to both; let your mood decide or order a 1/2 of each.  Standouts... The chicken.  The meatball.  The sausage.  The tuna.  The veggie.  The turkey.  The combo (ham &amp; salami).  Yes, they're actually all great.  No joke.  Basically, if you haven't had a focaccia sandwich from Mario's, preferably right out of the oven &amp; piping hot w the requisite pepperoncinis...then you just haven't lived.  And that's their focaccia sandwich out of the OVEN; NOT a panini from the panini press.  There's just no comparison.  Trust.  The house made tiramisu is THE BEST in NB.  No contest.  Sometimes the service is great, sometimes it's not great.  But the tunes playing are always great.  Always.  So, just tune the service out if need be &amp; enjoy everything else.    An institution.  Mangia.", 
    "review_date": "2014-07-07"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "Driving around the city looking for a place open at 3pm for food! HUNGRY!! Ended up walking around Northbeach and walked right into this place seeing that it was crowded, must be good right? The staff was very nice, young guys hype and charming, mocha came out mmm it was good but could be a tad hotter. Ordered the meatball hot sandwich and caprese salad. The pesto on the Caprese salad was to die for! Soaked up every last drop with extra bread! The sammys took an hour to come out! YES an HOUR! man lucky the staff was real nice or I would of bitten their arms off I was so hungry! The sammy was yummy. Goey cheese, good meatballs and delicious focacia bread with green onions Oh my ! I would go back just for that focacia. I had a quarter of my friend's eggplant sammy and it was just OK, it was too salty for me. I love eggplant sammys, I've had better. It was good, if I lived in the hood I would be there alot. Since I'm not at NB too often I don't know when I'll be back.", 
    "review_date": "2010-01-03"
  }, 
  "aea3PTk1cMMV7UTh9HXINA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sammy S.", 
    "review_text": "Mario's is bella bella. Wonderful atmosphere to sit and sip brews with friends. The decor is vintage, and I hate to say it but it sort of feels like a \"Central Perk\" type neighborhood place. I love it.  The paninis? Oh heaven! Just make sure you're not too drunk to enjoy it, and make a note to let it cool down. I burned my mouth numerous times because I was too impatient to wait till the melty-hot, obscenely delicious creation cooled down.", 
    "review_date": "2006-08-03"
  }, 
  "8D-HrtrDZZrH5_URNAAUHA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mukul S.", 
    "review_text": "One of the best places in northbeach to much on some amazing sandwiches, punctuated with awesome Italian sodas. The staff is awesome. Very accommodating and nice. I loved the music too that was being played in the background just in the right volume. Thank u guys for a wonderful afternoon!", 
    "review_date": "2011-09-20"
  }, 
  "pgHCj7DSqI8NWx7WucnH3w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew S.", 
    "review_text": "I really wanted to give this place 4 stars.  I even witheld writing my initial review, because having only had beer and wine the first time, I felt it was unfair to review it without having actually eaten here. Not only did we get very affordable (though average at best) drinks, we even got a free round from one of the bartenders. Much appreciated.  However after wandering back here on a beautiful sunday afternoon to try one of their delicious looking foccacia sandwiches, I have to settle on giving Marios 3 stars.   Marios is a nice little place that offers a little bit of everything. Food, drink, coffee...the only problem is that they don't particularly stand out in any one of these categories. Don't get me wrong, nothing here is bad and the atmosphere is quite nice, but you'll most likely leave Mario's thinking \"well, it was pretty good, but not great...\"  Pretty good service, pretty good food, pretty good drinks...but nothing stands out.  So while I can't fault them or say anything negative I have to give them a somewhat neutral review.  In short: Mario's is a tease which entices you into thinking that it will totally put out, but when it comes down to it never seals the deal.", 
    "review_date": "2009-04-20"
  }, 
  "eKrVnlMkBLXc3LCnQqX4Jg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tif S.", 
    "review_text": "First thing, don't go there expecting cigars.  The food is fantastic, if a little expensive ($8 for a sandwich).  Meatball and balsamic chicken foccacia sandwiches are personal favorites.  Outdoor seating is nice, just make sure you're sitting directly in the sun.  A great place to take friends from out of town or to have lunch in between Washington Square Park hangouts.", 
    "review_date": "2010-07-05"
  }, 
  "PZfAMbDJjmO_yZsCWm4oqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robyn C.", 
    "review_text": "A meatball sandwich like you've never had.  Simply da best!", 
    "review_date": "2011-01-08"
  }, 
  "_9s6vNpPyxBWwACbt32_Uw": {
    "user_rating": 5.0, 
    "user_location": "Asheville, NC", 
    "user_name": "Xavier F.", 
    "review_text": "I don't  normally give 5 stars, but this place deserves it.  The eggplant panini was phenomenal.  The espresso is excellent.  The people are friendly.  The place is small and cozy with great ambiance.  They were pretty jammed so it took 20 min for the food to arrive, but it was well worth it.", 
    "review_date": "2011-12-28"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "Such a warm and enticing little North Beach spot! I spent a rainy Sunday afternoon just hanging out here and loved it! Good beer, food and coffee. Great views of Columbus St. and Washington Square Park. The small space, with lack of tv's, makes the place pleasantly comfortable and homey.", 
    "review_date": "2008-12-23"
  }, 
  "m9m06NCYDlSpes08U0r3Xg": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Nathan R.", 
    "review_text": "I'm a meat guy- so for a portabello mushroom sandwich to knock me over and kick my ass several times as I pleaded for more is a giant leap of vegetarian faith...and that's exactly what happened:  me, first bite- whoa- I fall over on the floor and let  the pummeling begin.  The foccacia bread alone- I could just have a bread sandwich, I believe they get it from that mom n pop shop just down the road.  Anyway- I'm headed down to SF this weekend and I look forward to another beating.", 
    "review_date": "2008-07-16"
  }, 
  "BwFEjsr9yLqdszAmAxFYQg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Asha S.", 
    "review_text": "DATE/TIME: April 7, 2011 / 1:00pm  PRICE: $12-$18 AMBIANCE: Quaint, rustic, and a bit small. To use the word \"interior design\" to refer to the mix of wooden chairs and tables in the place would not be appropriate. It's definitely unpretentious.  CHANCE OF RETURNING: 40%  NOTE: The following review was written in May 2011 but never posted. ___________________________________  A HomeRun took me here on 4/7/2011, and I probably won't be back unless they've implemented some major changes or improvements to their menu. What kind of a place in North Beach can justify offering a whopping total of TWO wines, without any clarification of year or vintner until we prodded further and asked for a bottle.   [UPDATED 3/15/13: It looks like they might have improved their menu a bit.  Also, since I last dined there, I've noticed that many TV shows with episodes or scenes that are meant to be set in SF tend to show the facade of Mario's Bohemian. I wonder if they think this is the ideal representation of our diverse city. If so, how disappointing. There was even an episode of House of Lies that had a scene with Jeannie (Kristen Bell) hooking up with a musician there. Well, it was a version of Mario's that looked nothing like the real thing.]  In reality, the best thing about this place is its location and proximity to Washington Square Park. And sure, the meatball sandwich is worth a try. ___________________________________  :::: [ THE SPREAD ] ::::  * MEATBALL SANDWICH (<a href=\"http://www.yelp.com/biz_photos/marios-bohemian-cigar-store-cafe-san-francisco?userid=BwFEjsr9yLqdszAmAxFYQg#Mqqic4utfXnPET9BMSCYhA\">yelp.com/biz_photos/mari…</a>)               - [4/5 - Tender well-flavored meatballs with a melted mozarella cheese on foccacia bread.] * LASAGNA               - [3/5 - I *love* lasagna. Throughout my childhood, almost every time I went out for Italian food, I would always order the lasagna. I'm not sure if I came here on an off day, but their lasagna was very well flavored, but a bit chewy and even a little on the greasy side.]", 
    "review_date": "2013-03-15"
  }, 
  "30l6PviyQqfH0qVC5Vu7MQ": {
    "user_rating": 3.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Hugh R.", 
    "review_text": "Mmmmm, almost $10 for a sandwich? Alone? With nary a side to be seen? (Well, there MIGHT have been a pickle. I don't recall, to be honest.) The frugal diner should steer clear. Also, the Frommer's-toting traveler who's not from Lilliput. My guide suggested that the BCSC's \"large\" sandwiches were best enjoyed across the street in the park, but I chose to stay indoors and close to the counter, lest my far-from ample meal attract the gaze and titters of passersby. That, and it was dark out. And possibly raining.  At least the ladies working the counter were a hoot.", 
    "review_date": "2010-02-15"
  }, 
  "lyk-fom2nFBKUyzFwEE_Xw": {
    "user_rating": 1.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Ed V.", 
    "review_text": "Good sandwiches worst service ever.", 
    "review_date": "2014-07-10"
  }, 
  "TLzwLBhPoO33w85VOXz97g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobu K.", 
    "review_text": "if it's a nice lazy weekend, strolled around the North Beach is my favorite thing. I just love it. I don't mind so much for tourists because I still feel and remember the feeling, when I was here for my first time in SF.  I like almost every where in NB, but MBCC is one of my favorite joint.   The place isn't fancy, very easy going and relaxing. This is a great place for beer and little food. We had: Cannelloni  $10.50, great hot out of the oven.  Mario's Salad  $6.50, this is pretty big for 6.50. like the dressing. Peroni on tap  $5, Nice Icy 1 pint great Italian beer. Espresso $1.75, I was a bit drunk by the great Peroni, so have a cup of Americano was a good idea. it was great strong a cup of Americano that kept my rest of the day going.  OMG, What a boring review! I'm sorry but the review is true. We were loving it. Mario's Bohemian Cigar Store Cafe. What a Great place!", 
    "review_date": "2012-06-04"
  }, 
  "NJkKim1vaowyEKtazPdByw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Counter C.", 
    "review_text": "House Campari.  Four bucks.  Best cocktail deal in North Beach.", 
    "review_date": "2009-10-23"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "This is one of my favorite lunch spots. Always great sandwiches, the  meatball is my favorite.  Service is always friendly. Always a welcoming place", 
    "review_date": "2009-09-14"
  }, 
  "F5PeWdJZqT8BAQD7LnY6_Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Grace P.", 
    "review_text": "Some of the best sandwiches in the neighborhood! The bread comes from the focaccia bakery a few blocks over, by far the best bread I've ever had so it adds a lot to the sandwiches. The grilled sandwiches are the best, my favorite is the chicken #1. The guys that run it are super old school and refuse to do any substitutions but you really wouldn't want any!", 
    "review_date": "2014-01-08"
  }, 
  "8-cYaX4GPkH3EtEeGfVNIQ": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jared M.", 
    "review_text": "The sandwich, #1 Chicken, was very good. The bread was soft unlike most places and there was a lot of melted cheese. Overall, very good.   My problem with the place and the reaosn why I wont return is the price. To spend nearly $13 with tip on just a sandwich is just too much considering the prices at Dimaggios a couple doors down arent much different for a sandwich. I would at least expect some chips or something on the side. And, no, I dont count the two jalopenos they give as a side item.", 
    "review_date": "2010-09-22"
  }, 
  "Ogtdt1vzFXT5dDdfR-E7rw": {
    "user_rating": 5.0, 
    "user_location": "Amherst, MA", 
    "user_name": "Baer T.", 
    "review_text": "Tasty Barolo /  Religous Focaccia /  Cute Peeps, no cigars.", 
    "review_date": "2008-03-02"
  }, 
  "7kmlaGMjjCHN8rL8oncz_A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tim y.", 
    "review_text": "after two years, and all my hangouts either closed, changed hands, or whatever ... good coffee, warm surroundings, and decent snacks", 
    "review_date": "2007-07-01"
  }, 
  "IlYuwBxMyt-WN9pIwklhgg": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Kevin C.", 
    "review_text": "Yummy  Corner of Union and Columbus, right next to the park.  Good coffee  Good meatball sandwich  Good atmosphere  great way to start a day", 
    "review_date": "2008-05-13"
  }, 
  "WaQ7KcZd3wVozXiDFWIDVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Niniane W.", 
    "review_text": "Excellent eggplant sandwich.  Also it has that \"corner diner\" vibe which is cozy.", 
    "review_date": "2011-08-21"
  }, 
  "Qa6s4dYtNA7W9WmnIUn4Fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kimb s.", 
    "review_text": "very, very good coffee (graffeo).  i really like this place; it's authentic and no-nonsense.  it's not stupidly expensive like most places in sf.  some of the people who work here will speak italian with you and not make fun of your j.v. language skills.  tosta.", 
    "review_date": "2008-01-13"
  }, 
  "3Yahu7lXBNt9RNjDdBX7Dg": {
    "user_rating": 4.0, 
    "user_location": "Kingston Upon Thames, United Kingdom", 
    "user_name": "David W.", 
    "review_text": "We popped in here to have a beer whilst we decided what to do for dinner.  It has a really friendly atmosphere, even though the Reggae music was a little loud and not really to my taste.  At the far end of the bar we could see a chap making and stretching the dough for pizzas and cooking them in a small pizza oven.  They smelled pretty good and we were having fun so decided to stay for one.  We had the Italian Meat pizza which was ok.  The owner (or at least the bar man) was very kind and attentive, when my other half was coughing he noticed and brought over a glass of water and after we'd settled up he came over and gave us a half of beer each on the house.  Nice touches that reinforced initial impressions.  Be warned that if you're particular about your Rest Rooms this place only has 1 for everyone and the door is a little rickety, and the basin is in the hallway - but that's kinda in keeping with the relaxed feel of this place.", 
    "review_date": "2009-01-03"
  }, 
  "sIRCHraUB3GREUlIr2A4xQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenz y.", 
    "review_text": "not only do they have an excellent name, these sandwiches rival molinari's (huge, packed with whatever of your heart's delight, and toasted) and its stellar location right on the square is a great place to watch the bums try to con tourists. they also have a short menu of more dinner-oriented items, but i haven't tried them yet.", 
    "review_date": "2007-11-10"
  }, 
  "CePez4M8ww0xqWi10A2B_A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon N.", 
    "review_text": "Coffee and food excellent, service not so much by the guy with the curly mustache...maybe he's pms'ing", 
    "review_date": "2012-04-19"
  }, 
  "1UOTsXkq54pGB5jnFreTdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carol K.", 
    "review_text": "\"We are going WHERE for lunch?  You are making me trek in my heels to go WHERE?  Just b/c guys don't wear heels...\" is what ran through my head when a colleague/friend told me where we were going for lunch.  I would have never guessed it by the name and I'm quite sure I have passed it many times before my NB-aware friend introduced me to Mario's.  I had the warm vegetarian sandwich, which was sooo good.  To be honest, I can't recall what my friend had since I was so busy devouring mine.  The reviewers are not kidding about the focaccia.  It is really good.  The focaccia bread is fresh (none of that dry or hard business), with plenty of flavor, and the warmth of the bread embraces the ingredients that sit on top.    Mario's decent price points make it only more desirable.  Yay!  So, why have I not gone back since that first bite?  Heels or not, I regularly remind my friend how glad I am he took me there.  A get-away from FiDi is always refreshing and for such a delicious experience -- well, I better repeat the visit!", 
    "review_date": "2010-03-23"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "Food here is really good (tried both the chicken and meatball focaccia sandwiches) and service is friendly.  I still have a problem paying $5 for a bottle of Stella but hey, we are in North Beach.  Good spot for a quick bite before a night of drinking (that focaccia bread can really soak up some alcohol!)", 
    "review_date": "2006-06-10"
  }, 
  "PFlJjve41Ez4AVYLPpu9qQ": {
    "user_rating": 5.0, 
    "user_location": "Carpinteria, CA", 
    "user_name": "Sam L.", 
    "review_text": "anything you need to smoke", 
    "review_date": "2013-03-22"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Really good service.  That can make up for a lot of mistakes, but there were no mistakes at Mario's and we still got really good service.  Great vibe to the place and a great location for people watching.  Sit down, have a pint, enjoy a great meal and watch things unfold in the park.", 
    "review_date": "2010-01-24"
  }, 
  "u474u_0jbgz93GFHU8lGNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kari D.", 
    "review_text": "Close to work and home I gave it a try today. Ordered a chicken panini to go. As I was waiting I saw these big, delicious, beautiful sandwiches being served so I was really excited to try mine. It didn't take very long to make and I was handed a box. When I got back to work and opened the box I was surprised to see a very small chicken panini. For $10 I thought it was going to be bigger and it didn't look like anything like what was being served. I guess what I saw was the focaccia sandwich. Aside from the size, the chicken panini was absolutely delicious!! I can say that I will return for it and maybe get a salad for a side if I'm really hungry. Service was without a smile but I noticed they are a little nicer to regulars. Taking the good with the bad, I don't doubt I will return...ya, it was that good. =)", 
    "review_date": "2012-03-23"
  }, 
  "JNyLyXn-unUhJmiGJnI6tQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah J.", 
    "review_text": "I have to admit that I'm not entirely comfortable stopping in by myself at most sit-down restaurants when on American soil.    But I've done just that at Mario's.  Twice.  Maybe I'm at ease dining sola at Mario's because it's so traditionally Italian I think I'm really in Napoli?  Or because it's friendly, and unassuming, and more casual (read: less pushy) than other North Beach trattorias? Whatever the reason behind my newfound homeland confidence, I'm happy to say that the times I have sat at their bar--all by myself--with the newspaper, a panini, and a glass of vino, have been two of my most pleasant and relaxing North Beach memories.", 
    "review_date": "2007-01-26"
  }, 
  "Q2Iest8oggBub6nVBFEcNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes M.", 
    "review_text": "Mario's worked so well as a coffee break stop on my last walking tour that I decided to promote it to lunch stop this time around.  Which is another way of saying that I was dying to come back and try the much-Yelped focaccia sandwiches (actually, the grilled veggie focaccia is open-faced, meaning it's really more of a pizza, but it's frankly less messy this way, and still crispy-chewy, oiled-to-golden-glory and 100% drool-worthy).", 
    "review_date": "2009-05-09"
  }, 
  "pCGhLbFA8Q2N_LypEOdHcw": {
    "user_rating": 3.0, 
    "user_location": "Davis, CA", 
    "user_name": "Herbert S.", 
    "review_text": "The food didn't thrill me, it was unfortunatly bland and ordinary.  Despite the fact it was almost empty, i was still left waiting for my food for ages.  I know this place has quite a reputation, but i'm not going to come back.", 
    "review_date": "2006-05-04"
  }, 
  "-z3iZnsOuJF08O86oylZfQ": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Willie A.", 
    "review_text": "This place is so charming and quintessential Old North Beach. The staff was very helpful, nice and easy on the eyes on this particular visit. The food is worth the walk from where I work across from SF tourist Hell (Pier 39) On this visit I had the chicken #1 on focaccia &amp; shared a Ceasar Salad with a friend. Delicious!    Again I have to thank Fredda H. for introducing me to this place a couple of years back. We can't figure out for the world why we don't come back here more often. This will definitely be on my top lunch time spots list.", 
    "review_date": "2010-04-29"
  }, 
  "HVgfJPbbFleEsBA2EFpckQ": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Tory A.", 
    "review_text": "I enjoyed my recent trip to the Bohemian Cigar Store this past weekend. The restaurant/bar/cafe is pretty small, but not too claustrophobic, and I found the service to be friendly and attentive. I ordered the oven roasted chicken sandwich #2, with tomato and feta, and thought it was pretty delicious. My only complaint is that for the price I would've appreciate some fries, chips, etc. any side accompaniment, because while the sandwich was good, it didn't completely fill me up. This is a minor complaint though, because I plan to return in the future when I'm in North Beach.", 
    "review_date": "2013-05-29"
  }, 
  "sZLmgGwzupgrdL7pH-BXnQ": {
    "user_rating": 5.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Scott J.", 
    "review_text": "Really good panini sandwiches. I loved the accompanying pepperoncini's. Small, cozy place - very cool.", 
    "review_date": "2010-03-08"
  }, 
  "8CJUQwZWj1Z8SxLMTYZC8Q": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Mac S.", 
    "review_text": "Best Sandwich ever is \"The Combo\"!  If you order to go, don't let them forget the pepperoncini.  Tear 'em apart and put 'em in the sandwich!  Damn good.    Been hooked for 20 years now!", 
    "review_date": "2010-06-21"
  }, 
  "AnpIbinfzqdoETYZ9XqQ3g": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Sharlene C.", 
    "review_text": "happened upon this neighborhood mainstay.  got the meatball sammy on focaccia.  it was delicious!!!  get it.  you won't be sorry.", 
    "review_date": "2006-12-28"
  }, 
  "twUwbPXoBpqDDFnPKnXUbQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark C.", 
    "review_text": "I went here with my Girlfriend the other day. The atmosphere in here is amazing. We were lucky enough to get a table right when we walked in despite it being quite crowded. The waitress that was serving us was a little slow, but at the end of our visit she had totally redeemed herself. I ordered the Combo sandwich, which comes with Swiss Cheese, salami, ham, mustard and mayonaise. She got the sausage sandwich which is served open faced. She also purchased a Salad but that did not arriave. The sandwiches we had were very good. I ordered an Anchor Steam off the tap, and she got a Coffee. The cup seemed a little small and the waitress forgot the cream. When we were getting ready to leave and asked for the check we mentioned the salad never arriaved. Appologizing she gave my girlfriend a free Biscotti and Coffee which made up for the lack of salad. All around our experience was good. Had the service been better it may have been pretty amazing.", 
    "review_date": "2009-03-23"
  }, 
  "MOZNSqLAo8TfhCi5x8iLzg": {
    "user_rating": 4.0, 
    "user_location": "West Los Angeles, CA", 
    "user_name": "Vince W.", 
    "review_text": "We came here because of Graffeo up the  street. They recommended Mario's because this cafe serves Graffeo beans.   We entered from the Columbus side with a  door that is slightly narrower and a door knob that is about the pop off. I get it. It's the cafe thing. Replicating something vintage, European  that sort. I like the the coziness of the cafe. Just a few small  round tables and a bar of course. Friendly staff.   However the cappuccinos that we ordered were a bit subpar. Not the coffee but the milk foam.   Will probably return.", 
    "review_date": "2010-04-22"
  }, 
  "FNxUwpkNMNg8hdJB5guBsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ell B.", 
    "review_text": "I love everything about Mario's. I love the meatball sandwich (and cesar salad), I love the cappuccino, I love the bizarre Balkan pop music, I love the ambience, I love the adorable staff. I *love* the carrot cake. Honey, sweetheart, Mario's, please don't ever change.", 
    "review_date": "2010-05-21"
  }, 
  "wb2I6PxYjRStE7OGLL4S7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "This is one of my favorite hang out spots in NB. Their sando's are made with love and they use  focaccia bread made down the street which is just awesome. The place is pretty small inside but it's fun to just sit at the bar and have a glass of wine and a delish caprese salad. To be honest their wine isn't anything to write home about hence the 4 stars, but it's reasonably priced and taste's decent.", 
    "review_date": "2008-02-04"
  }, 
  "hdKbGzlTvplL5VM9aQcGjw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T. F.", 
    "review_text": "GABRIEL Jer, you have the check out the meatball foccacia. JERRY The fu*k gotcha?  What is that? GABRIEL Foccacia.  Sandwich bread. JERRY Fu** atcha? GABRIEL The meatball sandwich.  It's good.  Bread's thick.  Meat's good.  And they  have two of those spicy things on the side. Jerry looks over and sees a meatball foccacia (my recommendation). JERRY Just how I like my women: crispy on the outside.  meaty on the inside.  spicy on the side. GABRIEL You used that line in another review, dude.", 
    "review_date": "2006-05-29"
  }, 
  "V50vZyOmePiIl7Axe2MWXw": {
    "user_rating": 2.0, 
    "user_location": "Summerlin, Las Vegas, NV", 
    "user_name": "P. J D.", 
    "review_text": "I liked the way the place felt at first. I was hoping for the whole in the wall quality meal. Well looks can be deceiving.   The food was mediocre and the service was very poor. Our server was so rude and not helpful at all. I do not recommend this place for anyone.", 
    "review_date": "2014-09-25"
  }, 
  "Rx3aRxu4vXJ-v3suVREfmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mickey D.", 
    "review_text": "So this is truly a San Francisco classic, the sandwiches are great on Focaccia from Liguria.  Sausage and the breaded eggplant sandwiches are the two best.  Try a house campari, they rock.  The pizza's aren't bad either.  It is a world class cafe.  Prices are reasonable, look to spend about $15 a person.", 
    "review_date": "2007-03-14"
  }, 
  "PDiJYUQZ8QILb23-n8HzGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cellina B.", 
    "review_text": "History in the  making, one of the oldest cafes in North Beach.   Unpretentious cafe feel, so you feel welcome right away. Grab a seat at the bar, a table by the window or if it's sunny you may be lucky enough to get a spot outside.   Great vibe, local hangout spot, friendly bar staff.   Great panini sandwiches served on foccaccia bread. I had the tomato mozzarella panini and loved it.   The servers move as fast as they can, but don't expect miracles as this place can get pretty busy.   Portions are a little smaller than I would've expected.   I give 3 stars because I was in a rush and the bar server was taking his sweet time as if I didn't have to rush back to the Fidi.", 
    "review_date": "2008-03-28"
  }, 
  "avTTU8DbBFSP0eqMBZpEKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brett k.", 
    "review_text": "Got the meatball sandwich and a coke for $14.  This isnt a traditional meatball sandwich, i.e. sandwich roll with three whole meatballs covered  in sauce and cheese.  Rather, it uses a thin, but delicious focaccia bread, which was excellent.  It's not as saucy as your normal sub; the sauce, meatballs (chopped in 1/2)  and the cheese were all well proportioned.  Service was fine.  Ambiance was fine.  If you want a great meatball sandwich, try it out.", 
    "review_date": "2013-04-02"
  }, 
  "_4ZFOXm_AXh88ZT_8YbpmQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "darla s.", 
    "review_text": "Wonderful hot focaccia sandwiches.  It's great for take-out for a group - order 3 types of sandwiches, and cut them in fourths, so everyone can have a bite of the many kinds of tastiness - meatball, Italian combo, veggie with cheese.  Their kitchen is also open fairly late so you can go there after seeing a show at Cobb's for a late bite.", 
    "review_date": "2005-10-18"
  }, 
  "HTD7EW4Fmj-s0EKkUUc3Ig": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Moto L.", 
    "review_text": "Oh for the love of sandwiches and everything that is holy in this world!  I went here on a blind date the other night.  While the guy was less than mediocre, the warm eggplant sandwich and baby green salad was amazing.  More please!!!   I generally shy away from eggplant but I am SO happy I chose to go for it this time.  It was perfectly prepared, SO tender and perfectly seasoned.  I don't know what they put on that sandwich but I can tell you it was a mouth full of love and deliciousness.  YUM.  The waitress was great too- actually she had more personality than my date =)  Well worth the time!  I say gitcher butt in there and order the sammich ASAP", 
    "review_date": "2009-12-22"
  }, 
  "cvp4it-nKFW7g2pXzb4eMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony And Candace T.", 
    "review_text": "Foccacia sandwich!  I remember thinking, \"how good could a sandwich be?\"  But when I bit into it, a smile and an mmmm emerged.    Saw it on some write ups and was pleasantly surprised.  But haven't returned, not sure if I need to refresh my memory soon...", 
    "review_date": "2012-02-10"
  }, 
  "hGxh6OiANg0E3X3OpChtrw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Joe S.", 
    "review_text": "I've been coming here since I could walk. It's an awesome place that defines SF food culture.  The actual cafe was a cigar bar many moons ago, not much has changed however now it's a hot sandwich spot  and cafe. I'd advise you to grab a seat at the bar if there is room, but the old school tables next to the windows are not bad either.  Cruise in and grab a hot focaccia sandwich with a few beers (ANCHOR ON DRAFT) and the  small-vintage vino glasses of red wine wine is nostalgic and PROPER. To complete the Mario's experience grab the best piece of tirramisu you'll ever eat along with a cappuccino made with Graffeo coffee roasted locally right up the street.  After visiting this spot you'll be embarrassed of where you eat and drink coffee.", 
    "review_date": "2012-01-20"
  }, 
  "Fg1ZhF_2pHcRwgyq_6yUiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles C.", 
    "review_text": "the meatball or eggplant sandwiches more than make up for any shortcomings in the service [stefano acts like an asshole to everbody, i learned to deal with it], even after a long hike over coit tower like on the day i discovered this place  take it to go or have it there, you'll have a view with the park and tel-hi only a few feet away  again, the best meatball and eggplant sandwiches in the city, with lots of great scenery and opportunities to people-watch", 
    "review_date": "2006-09-12"
  }, 
  "ZJ0Z8N3cGu8zEtsy5KeLAw": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Daniel S.", 
    "review_text": "Mario's is just about the perfect neighborhood bar and cafe, in my opinion.  The service is thoughtful and friendly in a low-key way, the coffee is from Graffeo across the street, the bread is from Liguria across the park, the \"campari\" cocktails are $5 and low enough in alcohol that you can linger over a few of them without getting too drunk, the location overlooks Washington Square Park, and the interior is a time-capsule to a time when people had the capacity to enjoy a straight-forward, quality establishment like this for its own sake without deconstructing every perceived slight afterwards on the internet.  If I lived in SF, I would live at Mario's...", 
    "review_date": "2012-11-13"
  }, 
  "oarKDJg3V7mLpgdDVPYmSg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Michael L.", 
    "review_text": "This place is one of my regular haunts.  I always recommend it to house guests visiting San Francisco.  It's good for morning coffee,  lunch, afternoon espresso, drinks, dinner.  The sandwiches are great - the meatball is the popular favorite - and the pasta is great too.  It's a good place to go with a few friends, and its great to go alone. The service is usually friendly and good, but if you go and they are in a bad mood, don't take it personally- some days are just better than others. It's a place that locals hang out, so you know its good and the prices are right.", 
    "review_date": "2013-02-09"
  }, 
  "XG-JynrbKiiNaqT4ffdI_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ossama A.", 
    "review_text": "Fantastic sandwiches, great neighborhood vibe, very friendly staff. I eat here at least once a week.", 
    "review_date": "2007-06-01"
  }, 
  "ixYLMqLBLo4tfcuQ-ewk9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karla R.", 
    "review_text": "Great foccaccia sandwiches, with a good vegetarian option.  Bottles of wine are $21, which is also nice.  Not the best wine in the world, but what do you expect for $21.  They also have house wine for cheaper.  Has a good local feel to it, despite the location.  Sitting outside is great.", 
    "review_date": "2007-07-04"
  }, 
  "Rgxe6btTSPFvVVgLtaLncw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T T.", 
    "review_text": "Grilled eggplant foccacia sandwich. OH.MY.GOD. 'Nuff said.", 
    "review_date": "2010-07-13"
  }, 
  "wCPkiI4PuHrv5dQif6gDvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ladybird G.", 
    "review_text": "Daang! This place always does me right. I love the vibe that this place brings. Super chill and laid back, if this is not you, then go else ware.  If you appreciate good sandwiches and like to accompany it with a good jammy wine or a cold crisp beer this is your place. They brew up a good cup of joe,so quit reading this and go hit it up.", 
    "review_date": "2013-03-31"
  }, 
  "WDyILww9HxfTwq5zKOGymw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy L.", 
    "review_text": "It turns out that this is my sister's favorite cafe in San Francisco, and she'd been hiding it from me for almost 10 years!  Since she introduced me to Mario's, I find myself drawn back here every time I want to sit with a friend over coffee and dessert or a sandwich without having to deal with the rough, misanthropic crowd over at Cafe Trieste or the overly bright lighting at Mara's.  Mario's feels intimate, definitely Bohemian, maybe a little sexy.  It's your secret hideaway in plain sight.    The cafe mochas here are delicious, rich, not made with cheap chocolate like at so many other places in the area, but something smooth and tasty.  The crunchy focaccia sandwiches are delish, if perhaps a tad pricier than expected for \"just a sandwich\" (giving me a pepperoncini or two with it doesn't really count in my book, especially since I don't even like them).  There are better sandwiches out there, but these tasty.    But best?  Is the homemade tiramisu.  YUM.  Seriously?  It's the BEST in the city, even *gulp* better than mine (and I make a MEAN tiramisu!!!  Just ask my friends...).  Who would've thought I'd find it here in what is essentially a cross between an Italian coffee shop and Hernando's Hideaway?!!  I think this is a great place for a first date.  Or catching up with an old friend.  It's not well suited to larger groups, because it's actually kind of a tiny place, narrow and a bit cramped, although I HAVE seen folks trying to fit 6-7 people at what is really a four-top.    If you're in a WHEELCHAIR, this place might be a bit too frustrating to try to maneuver around, and I'm not sure how accessible the bathroom is, since I didn't visit on any of the times I was here.  Just writing this review has made me think about going back to Mario's for another round of cafe mocha and tiramisu...mmmm....!!!!", 
    "review_date": "2011-01-05"
  }, 
  "nNoLwBUu45N-YkiTagNVvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy K.", 
    "review_text": "Really delicious sandwiches. I've had the meatball and the eggplant sandwiches on focaccia and they were both really good. This is a nice, low key neighborhood spot where it's usually easy to get a table.", 
    "review_date": "2013-02-18"
  }, 
  "aMJfDcKDsLkiIJvHnVWy4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Perry D.", 
    "review_text": "The holy grail of meatball sandwiches. A+ for atmosphere as well. Among all the great spots in North Beach, this place is certainly a top five destination.", 
    "review_date": "2014-08-21"
  }, 
  "Tj58A0_D-WsD-UirmpYSEQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jen C.", 
    "review_text": "My first visit to Mario's was in '04 -- a friend of mine and I were overwhelmed by the number of Italian places to try in NB and somehow out of all of them we ended up stumbling upon this gem right smack on the corner of all the action.  This place is a bona fide Italian cafe -- the espresso machine is sputtering non-stop and the waiters are scrambling between taking orders, serving food, and brewing espresso.  The meatball sandwich was amaaaazing.  So fresh and so tasty I'd be hard pressed to find one better.  We also met a local here who was kind enough to show us around NB and said Mario's is the best Italian in all of North Beach - all the other places like Steps of Rome are tourist traps.  We ended up hanging out the rest of the weekend.  Love Marios, and whenever I come back to SF I will be sure to return here!", 
    "review_date": "2010-02-06"
  }, 
  "WNuLe5TyJpL14oV1_R079Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan K.", 
    "review_text": "Situated near Washington Square Park, Mario's Bohemian Cigar Store Cafe (that's a mouthful) is a great place to lounge around with some good ol' Italian cooking, a meatball sandwich, and a few ice-cold pints. Also a perfect place to people-watch if that's your thing. Mario's has a certain charm about it that you may notice when you step inside. It's relaxed. It's small. Even the service is pretty relaxed. Don't expect chipper, happy-go-lucky waitresses taking your order in harmonious sing-song voices. Rather, the service is no-nonsense, you'll get your shit when it comes.   The meatball sandwich is indeed a delight! Melted mozzarella and meatball with marinara sauce on toasted onion focaccia bread. I love how gooey the cheese is (definitely not a clean eat). The sandwich, among most other things on the menu, are priced reasonably at around 8-15 dollars.   Spend a warm, sunny (you get a few in SF) afternoon here on your next visit to North Beach!", 
    "review_date": "2012-07-17"
  }, 
  "8Ces6YdT6j7BYycnZLrSng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luis C.", 
    "review_text": "The place is a rustic looking bar, located in an odd shaped corner, with indoor and outdoor seating overlooking Washington Square park. It's a great local cafe, well suited for lingering while sipping on your cup of cappuccino, latte, or wine (or whatever you like to drink), and enjoying the view of the park and the people that walk by. Despite the name they don't sell cigars here (they just kept the name).  Their menu includes focaccia and panini sandwiches, a few salads, pizza, a few hot dishes (cannelloni, lasagna, eggplant parmigiana, polenta with sausage), coffees and bar drinks (beer, wine, etc.). Surprisingly, they have a lot of vegetarian options in the menu. I like the focaccia sandwiches. They are open-faced, so it's more like getting 2 'mini pizza' (they sell personal pizzas also), with the toppings and melted cheese on top of the delicious+toasted+fluffy focaccia bread (from the famous Liguria bakery). I have tried the chicken #1, meatball with marinara and onions, and the veggie. Sandwiches are $9.75, and the half sandwiches are $5.50. It's a little pricey for sandwiches, but this is an expensive tourist area, so it goes with the territory.  And don't forget to get a slice of cake for dessert ($4). I like their homemade Ricotta Cheese Cake - this is not a \"cheesecake\", this is a cake that has cheese in it. Let me explain, think of this like a moist cake with a built-in custard in the bottom part. Their chocolate cake is good too.  The place is usually busy, and they use a small oven to make all the sandwiches, so the wait for food could be long (like I said before: good for lingering). If there are no seats available, I recommend that you place the order to go, come back in 10-15 minutes to pick it up, and enjoy a picnic in the park across the street.  ******************* Additional tip: FYI, if you prefer a cheaper sammie instead (not grilled, no focaccia), you could go to Petite Deli (~$6, ciabatta bread, long wait time also) which is only 3 blocks away from Mario's down Columbus Ave, past the WS park (PD closes at 4pm M-F/ 3pm Sat, closed on Sundays). And while you're at PD, maybe get some yummy chocolate truffles next door at XOX Truffles (XOX closes at 6pm).", 
    "review_date": "2008-08-30"
  }, 
  "YAV6s34aS5nm1n9lLt3D7Q": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Ryan M.", 
    "review_text": "what can i say?  this place is across from one of the most active parks in one of the most beautiful parts of the city. you are bound to have a good time (especially when sunny) here.  food is good.  small, but just right to get a good feel and service. a lot of gawking can be done inside and out!  beers on tap are good.", 
    "review_date": "2010-03-25"
  }, 
  "ceowV9LSKZEb397yVDqdgA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren M.", 
    "review_text": "I was so excited to try their famous meatball sandwich and then the day my friend and I went, I had had meat lasagna the night before and the meatball sandwich just didn't sound good. So I decided to go with one of their sausage sandwiches. Overall, I think both my friend and I enjoyed our sandwiches (she got the half meatball so it was open-faced), but maybe it's just a preference, this wouldn't top my list of best sandwiches and I'm not hurrying to go back. The panini was really crispy and the sausage was good, but wouldn't be my top pick as far as flavors. I asked for some crushed red pepper and that helped.  Service was good, we went in on a weekday and they were pretty quiet. My friend wanted a diet coke but they only have specialty sodas, he brought her one to taste, but she didn't care for it, it was no problem, they didn't charge us for it. He checked in on us constantly as well.  I'd recommend anyone to try this place, it's definitely a solid sandwich, just wouldn't be the top of my list.", 
    "review_date": "2013-01-14"
  }, 
  "wI4R1BE6wOfsd3_3XoA5_w": {
    "user_rating": 5.0, 
    "user_location": "Cobble Hill, NY", 
    "user_name": "Tash F.", 
    "review_text": "Amazing meatball sandwiches!! Got a table outside by Washington sq park with a view of cloit tower...not too shabby!! And amazingly not rammed full of tourists like some places on Columbus Avx although that may change on weekends...worthy of my 1st yelp review! Had to write something about this place, loved it", 
    "review_date": "2014-11-05"
  }, 
  "e77JyltArqckcdBl13bVbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve C.", 
    "review_text": "Oversight of the century:  me not reviewing this place.  I've been coming here since the early 90s and it's one of my favorite places in SF.  The woody decor, the wall-full-of-windows, and the view of the cathedral ... fuggetaboutit.  My favorite beers on tap, delicious espresso, and fantastic panini and pizza.  There's pretty much nothing that I don't love about this place.", 
    "review_date": "2010-01-20"
  }, 
  "db6zYDb-ZNuIUxuLaGY07A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David H.", 
    "review_text": "This is a great spot to grab a pannini for supper and a nice Peroni or Moretti to wash it down.  Their coffee isn't bad either.", 
    "review_date": "2010-07-13"
  }, 
  "49tI3YmkP7Gu_tk7X8z60g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A W.", 
    "review_text": "After hearing all the wonderful reviews and being one of the must eats by 7X7 magazine, I was disappointed.  I had their meatball sandwich and it was OK.  I do like how it was on focaccia bread.  But for $10 for an OK sized sandwich and no sides (those peppers do not count especially since I do not like peppers), it was not worth the money.  I do not know how this is only one $ when after tax and tip for only a sandwich it was still $13.  I would rather get 2 5-dollar footlongs at Subway.  At least that will fill me up.", 
    "review_date": "2010-05-04"
  }, 
  "PXJ1YraRcd20kMS3mSOT-Q": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Lee L.", 
    "review_text": "I'm no italian, but I definitely know the difference between your typical tourist trap italian restaurant on Columbus and the real deal meal-ios. These guys are definitely legit. The owner always greets my roommates and I with a smile and a ready, eager hand to cook.  This place has a neighborly feel to it more than any place I've tried in North Beach. Definitely going to recommend it. Oh, and do they actually sell cigars?? Cause I'm not seeing it!", 
    "review_date": "2010-10-17"
  }
}