{
  "eMjSKTPb0l_p-uo3gphqzA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia J.", 
    "review_text": "From the moment I walked in and saw Intelligentsia, Stumptown and 49th Parallel, I loved Ma'velous for being all about the coffee.  I found high quality beans, from the top roasters in the US (&amp; Canada), all prepared by a professional barista to create a serious cup of coffee.    As a coffee lover who's not into the Coffee Snob culture one can run into in SF, I was happy that the barista actually had time for me and was knowledgeable. Where else can you get a well prepared cup of coffee while being entertained by the cup brewing in a Syphon Coffee Maker all moments from work?    Ma'velous is definitely worth a trip across town if you aren't lucky enough to work nearby!", 
    "review_date": "2011-09-23"
  }, 
  "Gv84VtMVV9n0xJ1g00QQLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Olivia V.", 
    "review_text": "When I found out that I'd be in the area for a meeting, I immediately did some recon and came across Ma'velous on Yelp.  As a coffee geek, it's a bit unfortunate that Handsome and Stumptown have not opened up shop closer to Northern California, but understandable - we San Franciscans are pretty spoiled with third-wave coffee options that are locally roasted and readily available. Ma'velous buys coffee from all over, which means that latte you order today most likely will be different than the one you order next month. You just don't know what you're going to get. Pretty cool.   I walked up to the counter and the girl was so welcoming and cheerful; she seemed delighted by how googly-eyed I became when I looked around at all the coffee paraphernalia strewn on the counter. I immediately saw bags of Stumptown lined up and was tempted to buy one, but I currently have a backlog of Four Barrel and Sightglass I need to finish first. I asked if I could have a latte made with Stumptown, and she told me she thought they were currently using Handsome. Even better, I thought, since I haven't tried anything made with Handsome (Los Angeles) before. A male barista said their current espresso was actually The Coffee Collective (even farther away...Denmark!) and I got really excited. The latte was delicious, a bit nutty, and noticeably creamier than any other latte I've ever had. The flavor profile was very distinct and significantly different from Blue Bottle, Four Barrel, Ritual, etc. I impulsively ordered a Gibraltar after I finished the latte and was impressed again. The Gibraltar was just as clean and smooth as the latte, despite the different espresso-to-milk ratio. Incredible CC roast and great preparation by Ma'velous.  If you love coffee, Ma'velous is a destination shop. Where else can you a) taste foreign micro roasts expertly made and b) also buy a bag to take a bag home for your Chemex? I'll definitely be back the next time I need to stock up on beans...", 
    "review_date": "2014-02-07"
  }, 
  "Ow-Xwx0TtjDoYB0ooWNKlA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Teddy B.", 
    "review_text": "A menu consisting of coffee, wine, and cheese primarily. Not a lot of experience in Phillip Ma and his crew in the industry, but they're trying to make up for it with enthusiasm and curiosity.  Offering coffees from Ecco Caffè, Intelligentsia, and Tim Wendelboe, they have some great sources to dial in with their custom La Marzocco (the 'Musashi 4' custom 4-group machine tweaked by Seattle's Espresso Parts), V60 Hario drippers, Chemex, Kyoto slow drip, French press, and siphon bar. So it's a playground of options not seen in SF since the 2006 closure of Café Organica.  The results are still being tuned in, so it will be worth revisits.", 
    "review_date": "2010-11-11"
  }, 
  "1qNpzBiag1yDAhdggNC3gQ": {
    "user_rating": 5.0, 
    "user_location": "", 
    "user_name": "V R.", 
    "review_text": "Immediately, I noticed the marks of style: beautiful paneling, standard San Francisco Victorian molding, 70's style décor with flash, aficionados coffee bar gleaming with silver and brass, mural art, and books. Inside I hoped this beauty would stay and prosper as a beacon in the revitalization of Market Street.   At the counter was a way cute hipster Asian guy. I asked if they had tea since I rarely drink coffee, he said, \"No.\"  I said, \"How about hot chocolate?\" He said, \"Yes.\"  I asked, \"Is it good?\" He looked me straight in the eye and confidently said, \"You're gonna love this.\" I thought, \"Yeah right, sales fluff, oh well... let's see.\" He handed me the chocolate with a cute foam heart and I decided to sit awhile on the green glitter crocodile patterned chairs.  OMGOSH! That really was the best chocolate I ever had!! I went raving to my friends about it and referring it to Ivy League professionals as the perfect meet, greet, study and hang-out place.  Later I learned from <a href=\"/redir?url=http%3A%2F%2Fsfgate.com&amp;s=0f4d7be1601547e507f56cd57cc884ea09b8f66863f7f0f77c5ba67b434854a1\" rel=\"nofollow\" target=\"_blank\">sfgate.com</a> Style articles the cute guy was owner Philip Ma -- to him I say, \"Rock on Dude!  You're a San Francisco treasure!\" xoxo", 
    "review_date": "2013-07-18"
  }, 
  "zdqgQKLAbtPNNP-y8bmFbQ": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Mike G.", 
    "review_text": "This is a kewl place! Strictly coffee with barista that loves what he doing. The proof is not only the frothy milk design but the perfect temp &amp; creation of the latte (no frapps, flavored or foofoo choices) also! By night they serve wine &amp; beer.  I had the latte with brown sugar, it's deeeelish!  Would definite come back! Convenient walk from the hotel &amp; far better than the commercial coffee joint in the hotel lobby!", 
    "review_date": "2014-10-06"
  }, 
  "4Y81J2Tdq5XAnkeYmCZ2ow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nique F.", 
    "review_text": "A beacon of light in the dingy mid-Market 'hood! A slice of trendiness near the Tenderloin! Ma'velous is most famous for their coffee, but I went for the boutique wines and enjoyed squeezing into their little booths, separated by colorful etched plexiglass.   It's a narrow space with intimate table-for-two seating along one wall, and one large group table towards the back. You can also perch on the edge of the tiny bar, which boasts 3 little stools. They have about 7-8 wines by the glass, including a perfect French rose for $9. The vibe is pretty mellow, since it's off the beaten coffeeshop / wine bar path. Discovering it feels like a little triumph.   If you need to kill time in the not-so-exciting Civic Center 'hood, this is a great escape.", 
    "review_date": "2013-04-26"
  }, 
  "pYnOLcg4-cgQjSLUiaSg4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ezequiel R.", 
    "review_text": "Seriously, why wait in the line for Blue Bottle when you can have exceptional coffee here??   I have been here about three times now because the coffee is just so damn good! You walk into the shop and listen to the cool house music that's playing. Then are greeted by the server who is always really nice. You can obviously take it to go but I would recommend checking out the relaxing feel of the room.   They also have a great selection of wine, beer, and champagne! Awesome! Cool place to bring a group of friends to chat and drink!   The mocha and hot chocolate are very good as well :D", 
    "review_date": "2012-07-14"
  }, 
  "RrfcgvnjsH58eOtfTbEJEA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda K.", 
    "review_text": "This joint is super narrow and cozy and I could totally see myself and a group of friends drinking wine and chatting here but I just needed a quick fix at 1 on Monday afternoon so I decided to give their coffee a try.  I had the black iced coffee in a 8-12oz cup and it cost $4 and there was a huge ball of ice in it! So I barely had any coffee and the cool solid ball remained front in center in diluting my coffee... I see that there are many reviews on their HOT coffee though! I may return for that.", 
    "review_date": "2014-10-20"
  }, 
  "UzEjSADMrDFAx0LFUfgPyQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael D.", 
    "review_text": "Ma'velous is trying to bring a bit of class to the coffee house.  This isn't a place to go and duck your head into your computer. It's designed more as a bar to interact with your friends than to park all day with your iThing.   Beautifully well designed and comfortable with the excellent Stumptown coffee.  Not the typical grungy barista and industrial design.  One of the few places that will assume that you want to stay and relax with your coffee and give you an actual ceramic or glass cup.  You have to make sure you request a to-go if your doing a grab and dash.  But why grab and go?  Sit down relax and chill in the wifi free environment with some good friends or take a break from the grind alone or with your work buddies.    Been looking forward to an opportunity to come back after work and enjoy a micro brew.", 
    "review_date": "2011-03-29"
  }, 
  "cWUujiu3rpRhnPC0qqCVKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nels A.", 
    "review_text": "Stumptown and Handsome? Mark this down as a coffee shop must. Great beer selection as well.", 
    "review_date": "2014-03-25"
  }, 
  "U4lqV4No16bnXFBQYM_TfQ": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Carlos L.", 
    "review_text": "Solid cappuccino . It could have been just slightly more intense , ill have to ask if if is two shots in a small next time. I'll have to try the Kyoto iced coffee next time. Folks behind the counter were decently friendly, but I need good coffee more than I need more friends.", 
    "review_date": "2012-12-19"
  }, 
  "odzxMYWv4LmNU4KqyHi7rA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vien T.", 
    "review_text": "Ma'velous is Ma'vafriggin cool! I can't give it 5 stars without going back a second time, which is surely inevitable. These guys seem to have excellent taste for coffee, tea, and now brews and wines I guess. You'll pay the price of an upscale coffee house but it's worth it.", 
    "review_date": "2011-03-25"
  }, 
  "0ueCgg8sTFRIhRMVhznTKQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Minna D.", 
    "review_text": "No cream. No raw sugar. No white sugar. No Splenda. No equal. No nothing. The whole milk isn't even out. You have to ask if you so dare to request from the mustachioed man and he looks none too pleased to get it for you. The sweetener is this brown sugar simple syrup concoction. I think it's so obnoxious to only have that - aren't you in the friggin customer service industry? It's expensive and the coffee, latte and americano have all (each one of them on separate occasions) been not very hot.", 
    "review_date": "2014-04-06"
  }, 
  "0LEuX4vVr6dANyV9VmQ10Q": {
    "user_rating": 5.0, 
    "user_location": "Richmond, VA", 
    "user_name": "Elle T.", 
    "review_text": "Fabulous fabulous place! Had a latte which was fantastic.", 
    "review_date": "2013-11-08"
  }, 
  "CfV_axQI2rK0eHB9FfG_GQ": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Cori W.", 
    "review_text": "STUMPTOWN COFFEE in SF. This is the only thing I care about. Very friendly barista/owner, STUMPTOWN COFFEE AND ESPRESSO, chill vibe. $2.50-$2.75 for drip. Trying really hard not to come in every morning for Stumptown, all the other coffee in the area is now crap.", 
    "review_date": "2011-05-27"
  }, 
  "J8ZjumpRAFqatUlxtX2L-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ericka A.", 
    "review_text": "Awesome barista's who take the time to warm your mug. Only downside and its a major one in my book, is they don't seem to have half &amp; half. I really dislike drinking coffee with milk and would give 5 stars for this common accompaniment to coffee.", 
    "review_date": "2014-11-10"
  }, 
  "3-Fdl-0rn3eE-ofvfoQqeA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joelle K.", 
    "review_text": "The Humboldt Fog cheese platter with Syrah......perfect combination for a chilling after-work wining.", 
    "review_date": "2013-12-10"
  }, 
  "y1LKuiARsmgp_LDMA3oKCg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Irene C.", 
    "review_text": "Ma'velous is such a charming cafe and a lifesaver in an area with limited coffee options. The patrons and baristas are incredibly chill, and the decor is trendy but comfortable. This is a great place to catch up with friends or just to relax and get your mid-day caffeine fix. I got the 2oz house espresso with milk, and it was strong but so delectable. I wish there were more cafes like this throughout the city!", 
    "review_date": "2014-07-15"
  }, 
  "cqGzzeRwKvTamliSZPM95w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robin P.", 
    "review_text": "Just add the 'R' and call this place Marvelous.   Perhaps their too shy and retiring in their true-to-hipster ways to call this place what it is - marvelous.  I discovered the gem close to my apartment and it's one of my newest fav spots for coffee meetings and discussions. It's small, the space isn't too impressive, but they've done wonders to give it a comfortable and welcoming vibe.   I've spent hours here comfortably sipping coffee and having intense conversations. And I love it.  The drinks are good, I like the coffee - but to be honest, I'm not a coffee snob. I come for the vibe and I'm pleasantly surprised by the delicious coffee.   Throw in the cute hipster baristas (all sporting facial hair), good location (it's near Civic Center BART - not the best neighborhood, but convenient), and alright prices and you have a hit.", 
    "review_date": "2014-01-20"
  }, 
  "DdsU7PkQqovVXoFnbHiG2g": {
    "user_rating": 4.0, 
    "user_location": "Wellington, New Zealand", 
    "user_name": "Wendy C.", 
    "review_text": "Cool place, good coffee and a good selection of beer/wine.", 
    "review_date": "2014-04-04"
  }, 
  "M1jidngQ-ebxp50I5a1fbA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Steve M.", 
    "review_text": "Loved it! Explained that I needed both coffee and beer. Further, I gave an example of what I like. The barista, who was quite cool and knowledgeable, picked Sweetgrass IPA for its bitter but not too bitter flavor and paired it with a sweeter Kenyan espresso. The result was a phenomenal pairing!", 
    "review_date": "2013-09-09"
  }, 
  "jxdGL90JR1b6UTvfxwW9TQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laurie H.", 
    "review_text": "Yummy macchiato, very cool furniture.", 
    "review_date": "2011-06-25"
  }, 
  "aNXibYVKsml7S3ycWbkbIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc L.", 
    "review_text": "Nice to have a place like this in the area, the neighborhood really needs more of them.  Coffee and pastry was great. It was a bit too cold though.", 
    "review_date": "2011-02-03"
  }, 
  "TMgO2VmxduVBDwMHbeCWpg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "rohooo A.", 
    "review_text": "This is one of my favorite places to visit from now on.  As a Los Angeles native, I was visiting my sister in San Francisco and she insisted we go to a cute and hip wine/coffee bar.  The location is in the middle of the metro district but defiantly worth the trip. Wow!  The interior is so well decorated with detail in clear red stools, large Muriel of painting on the wall and an old fashioned coffee making machine... So cool. In addition the quaint tables, vibey music and all the gourmet coffee drinks make this not only a fun but inviting place to relax and enjoy a cup of Joe or wine.  I ordered the Americano which was probably one of the best ones I've had since going to my neighborhood coffee shop in Larchmont.  The owner is super nice, knowledgeable and warm- We thought we'd stay for an hour but ended up spending almost two and half hours enjoying the music and conversation.  Everyone that walked in was also very friendly and said hello.  I would say make special trip to this wonderful coffee shop even to just sit in the vintage chairs in the back with built in ashtrays (totally mad men-esic)  Go one and go all to this place and order the Americano to be blown away!", 
    "review_date": "2011-07-29"
  }, 
  "eHNP_CtIPjp_pZeh6DtukA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josie C.", 
    "review_text": "Great lattes and cookies too! The staff are total hipsters, at least when I went :)", 
    "review_date": "2014-04-05"
  }, 
  "1KKFt9EYIkxADxbdVJ_fqw": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Elisabeth A.", 
    "review_text": "As Kelly H. notes it's a little pricey, but I love the cool artsy vibe and the people behind the counter are really nice. Try the siphon coffee if you have time, otherwise the TCHO (local chocolate) mocha is quite good.", 
    "review_date": "2011-05-14"
  }, 
  "4lWnLmNdW3mAOIMgxqqyPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raoul D.", 
    "review_text": "Coffee, kouign-amann, and AJ the turtle. Friendly service as well!", 
    "review_date": "2013-05-02"
  }, 
  "wHXr_I5D8hvtaeWLSVxHig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim R.", 
    "review_text": "Best coffee in SF, awesome environment. Not a wifi joint to work from all day, but it's great for meetings, a chillout place in the afternoon or evening, and also for the coffee.   The thing that originally attracted me was that he has Stumptown, and that he was serving it in three different styles -- espresso, cappuccino, and drip. I thought that was an awesome idea, and every time I go in I enjoy it.   On the suggestion of coffee-loving friends, Philip (the owner, who is always there) has even done a few other taste experiments like giving me a shot of espresso done correctly, and then a second one that he's deliberately done wrong in some way. It's an awesome way to quickly raise your coffee-fu.", 
    "review_date": "2011-07-06"
  }, 
  "C0UknZBqI7DdYFu_nhgPuQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John B.", 
    "review_text": "***hipster alert*** Clean and decent place. Somewhat overpriced for what you're getting for beverages. The only reason I may ever go back is because there aren't too many coffee options in the neighborhood besides Starbucks.", 
    "review_date": "2012-07-07"
  }, 
  "sZ3mumX9WjJqp6qrjPPUBQ": {
    "user_rating": 4.0, 
    "user_location": "Stockholm, Sweden", 
    "user_name": "Mathias H.", 
    "review_text": "Great place for some coffee from outside San Francisco as they serve Stumptown coffee brewed to order (the barista also said that they use coffee from Ecco, Intelligentsia etc). The coffee was skillfully prepared and was a great cup. Space is very nice and relaxing and like the cool feel of the place. My girlfriend had a hot chocolate that was also excellent.  Browsed both the wines and beer available and really had a great selection of that as well. This is exactly the type of place I would want in my neighborhood.", 
    "review_date": "2013-01-18"
  }, 
  "ckA1J1cndmYbqXcERXqntg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark K.", 
    "review_text": "Ma'velous is the best I think in SF.  As the other botique places continue to scale, the level of artistry seems to drop.  Phillip, cares so much that every single time I go, it's perfect.  He cares too!    So much thought has gone into the decorations, the selection of the beans for each particular type of preparation.  I don't know anyone else who uses Stumptown, Intelegencia, and Ecco in one place!    Anyway, if you love coffee check it out, it will be worth your while.", 
    "review_date": "2011-06-27"
  }, 
  "sXKmP90GCdF0oM0AzYRhaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rika P.", 
    "review_text": "Skip the blue bottle line at Linden and visit this cute atmospheric cafe. Yes, it's a new cafe, BUT it's definitely an experienced coffee crafter. From Kyoto Brewer, Siphon, Chemex, Musashi, you name it. They are serious at serving you the perfect cup.   Philip the only barista and person working behind the counter is such a knowledgable guy that he will answer any questions about coffee or whatever you have in mind. No doubt he's patient, great latte artist and hygienic.   Very nice and quiet place for studying and reading. No wi fi, but you get the point.", 
    "review_date": "2011-02-24"
  }, 
  "BD_V1sr65lLi9MXxOvI3pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex C.", 
    "review_text": "Coffee was solid, but when I asked for cream the cashier said to ask the barista. That's kind of weird to not have it out and readily accessible, but ok. So I ask the barista and he hands me a plastic jug of whole milk. When I ask again he says this is all they have.  Got CREAM? Nope. WTF kind of coffee shop is this?", 
    "review_date": "2014-07-17"
  }, 
  "dGy6LmfgfJyftpcHVkPtEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "After dropping a girl back off home I decided to kick my day up a notch with some fresh coffee. Sometimes when I got out for breakfast I take the juice route instead of the bean. But then I always need my fix so off I go coffee shop hunting.  By the way, coffee shop hunting is a very underrated game. With so many places to chose from around the city you can easily go a month without hitting the same place twice (if you happen to get around as much as I do). Today's experience is Ma'velous which had me with just their name. Really, a great name attracts me like a deer to headlights.   I went full blown international this morning. If you like a shop that carries specialty coffee options then you should stop by here. They had 3 or 4 roasts I had not heard of before and were more than willing to talk about them and the taste. I love a knowledgeable barista on a cold morning. I decided to let them surprise me with something of a medium roast and was not disappointed. Sadly I forgot the name of it, something from Scandinavia I think. Not a big problem since I shall soon be back to try other roasts. The place is a total hipster spot with art, books, and music. I just can't say enough good things about this shop. For the true coffee lovers you must visit them to taste the experience yourself.  Welcome to my personal map of great coffee spots!", 
    "review_date": "2011-11-19"
  }, 
  "04DGWK7buplll91q-XSxWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A M.", 
    "review_text": "No caramel syrup, no vanilla syrup. I was not thrilled. But nice customer service, and this was the first coffee place that made me a plain latte that actually tasted good.  Well done hipsters! :D", 
    "review_date": "2014-03-04"
  }, 
  "02a7McTL8I8ovUhd5wYcuQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ann K.", 
    "review_text": "Average coffee and sweets at outrageous prices....$7.00 for a small cup of coffee and a medium sized sweet roll. Awful dark decor including a large turtle in small tank that seems to spend its entire time trying to get out. So was I...and glad to get out....", 
    "review_date": "2014-04-11"
  }, 
  "0f_0XfO2qcgNwSJAHwfR9g": {
    "user_rating": 4.0, 
    "user_location": "Porter Ranch, Los Angeles, CA", 
    "user_name": "James B.", 
    "review_text": "I came here to relax and chill before going to a music event and i needed a pick me up before the event, so I came here for some coffee.  Decor: Very quaint and a nice place to people watch, relax with some friends. Nice relaxed atmosphere as opposed to the hustle and bustle outside.  Drinks: I'm more of a person who drinks coffee only when it's really necessary to stay awake or I have a lot to do during the day. However, if the coffee is as good as it is here, I'll actually make an exception and have a cup just for the taste. The quality is amazing! There aren't very many places I can go and drink straight up black coffee.", 
    "review_date": "2012-07-17"
  }, 
  "iD830SWH1YNrR8DipUe6Xw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Marissa P.", 
    "review_text": "Wine bar an coffee shop that carries Stumptown fresh from Portland! Why did it take me so long to discover this place! I was looking for a cozy place to catch up with friends on one of my return trips to SF and Ma'velous had been on my list for a long time. However, had a realized that Stumptown was just a couple of miles away, you would have seen me trekkin through the TL on a daily basis to get this brew!   Cute place, great coffee selection, fairly affordable and wonderful vino selection as well. Not too busy in the evenings and the kindly put up with my friends and I after a few bottles a vino and the excitement of catching up.   The only thing that was disappointing is that they don't have outlets near the tables so if you are looking for a place to camp out with your lamptop and ride a Stumptown high, this may to prove challenging. The barista was kind enough to charge my phone behind the bar though! Also the food selection is very limited pastries and  cheese plates. If you are looking for something a little more substancial I'd reccomend eating elsewhere beforehand.   Definately, a great find! I'll be back for sure!", 
    "review_date": "2011-12-25"
  }, 
  "N0M8KmfBFyKD5NjDSxvaXA": {
    "user_rating": 5.0, 
    "user_location": "Venice, CA", 
    "user_name": "Shauna M.", 
    "review_text": "If you weren't a coffee snob before coming in, you probably are now. I brought my husband to witness the beautiful mad-science-like siphon brewing method. Phillip was so sweet as to answer a million silly questions ranging from coffee bean shipping methods to how best to spike your coffee. (Hot sake pour over, if you're interested.) We sat there for a few hours and the taste of the Ecco coffee changed as it cooled, constantly getting more and more delicious, never bitter, never acidic. In his effort to give us a full and complete coffee education, Phillip also made an espresso from the SAME beans...and it had an amazingly unique taste, almost opposite from the coffee. (The coffee was very mellow and nutty, the espresso fruity and bright...yeah, you try and describe palette tastes without sounding like a D.Bag, I dare you.)   I also ordered a mocha, because hey, I'm a girl, and I like chocolate. It was lovely and dark, and even with almond milk still tasted like a \"real\" mocha.   Ma'velous really is just that and I hope that San Francisco supports Phillip's awesome business!!", 
    "review_date": "2011-07-31"
  }, 
  "1rAseXhc5B_MXZjX67uvsA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "This place is great! Working for Starbucks for two years you really can tell the huge difference in quality. Their brewers are unlike anything I've ever seen, it makes the coffee so smooth! Working in fine doing for 3 years they've got a fantastic wine list. I enjoyed a the Caramel Road pinot nior wich is one of my favorite pinots. This is all besides the great friendly staff and the awesome decor, especially the crazy cool stencil by the great Eddie Colla. Very excited to keep coming back as I live up the street.", 
    "review_date": "2010-11-22"
  }, 
  "EXqRybkIKj2b3YpAVq91_w": {
    "user_rating": 5.0, 
    "user_location": "Oshkosh, WI", 
    "user_name": "Ryan D.", 
    "review_text": "Cool atmosphere.  We sat by AJ the turtle.  Drinks were good.  Wine and beer selection available.  Ashtray chairs are so cool.  We ordered the mocha because of the other reviews.  They were amazeballs!", 
    "review_date": "2014-03-10"
  }, 
  "-5qlOZhqoiKE6_wP2vyDNA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "René N.", 
    "review_text": "This is a great addition to the neighborhood! Talk about neighbohood gem!!! Great wine, coffee, and cool crowd!!", 
    "review_date": "2010-11-15"
  }, 
  "DkV0Y_h3G7atpzMd8pjrsg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kelly H.", 
    "review_text": "OMG, am I really giving five stars to a coffee shop that has no wifi and that charges $6 for a mocha? I guess I am. Really, this place is probably 4.5 stars.  Although I think $6 is still too much, this place definitely serves quality drinks. They serve only the premium specialty coffees - Stumptown, Blue Bottle, Intelligentsia, 49th Parallel.  The barista (and owner) definitely took great care in crafting my mocha. Plus, he added some beautiful free pour latte art on the top, for which I am a total sucker.   I love the ambiance and vibe of this place. It is incredibly unique, hip, and modern.  There is a great variety of seats and tables to sit at and fun music playing in the background. Plus, the owner is very friendly, and not pretentious like some of the people at the other specialty coffee shops in SF. This place is also a wine bar, so if that's more your thing, this is still the place for you!", 
    "review_date": "2011-05-11"
  }, 
  "UsfMP4nDyDroZrUVvMw0bA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel L.", 
    "review_text": "I was going to go to Starbucks but instead happened upon this place, and I'm glad I did! The cappuccino I got was very, very deep in flavor. The atmosphere was relaxing and the service was very nice. I shall return!", 
    "review_date": "2013-02-26"
  }, 
  "uNIyxmljF0IVuVEifJNQ6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe M.", 
    "review_text": "I've recently had a taking to fine wine bars as they're great places to relax and chat with friends, old and new.  It's between the Van Ness and Civic Center MUNI stops and can be a little hard to find so I left plenty of time before my meeting time so that I could track it down.  As I waited for my friend I got started with a cup of their hot chocolate.  It was warm and only slightly sweet, with bitter notes throughout.  When he arrived, we each got the pinot noir which at $15, was no cheap glass of wine.  However, it was really tasty and super smooth and several glasses in, we should have probably bought the bottle.  Ma'velous is a great local wine bar and I really liked their diversity of drinks and super awesome service.  It's significantly more expensive than InnerFog so it would be unlikely that I'd come here more often but it's definitely a great place.  I look forward to coming back and enjoying another glass of the Pinot Noir!  Food: 8/10  Service: 9/10  Price: $$$  Atmosphere: 8/10", 
    "review_date": "2013-03-21"
  }, 
  "ASP2ZWXO7PgsKE0sIb6Rhg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kara M.", 
    "review_text": "Came in around 9 to get some coffee before a concert. The door was open the whole time, so it was a bit chilly. One person was working, so it took quite awhile. There were a few groups having wine/beer that came in as we were drinking our coffee. They were out of the coffee I ordered so I took the second option and it was not very good. No sweets/food to speak of, unfortunately. Might come back for a glass of wine as it is in a good location and has a nice atmosphere.", 
    "review_date": "2011-12-16"
  }, 
  "jBXmqT-CWxXmwVs5GG0iMA": {
    "user_rating": 4.0, 
    "user_location": "Civic Center, San Francisco, CA", 
    "user_name": "Snow G.", 
    "review_text": "Amazing mochas! And the ambiance is really swanky and cool. Usually dead on saturday mornings, which is my favorite time to go since I can read in silence. A little pricey though. $7 is a little much for a mocha. Anyway, definitely worth checking out!", 
    "review_date": "2013-12-09"
  }, 
  "1mkSb8zqy8JG2Yr4qD7uag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen S.", 
    "review_text": "This is my favorite *true* caffe in SF. It's amazing!!!! The servers are nice, the coffee superb, the atmosphere old-school Europe, and no wifi means people actually talk to each other and you can make new friends. Well done, Ma family!! Stupendously helpful service too. The congeniality is infectious. Other cafes boasting \"servers with attitude\" (Contraband for example) take note: Ma'velous is exemplary. Five stars.", 
    "review_date": "2013-07-19"
  }, 
  "sVj5Dl2y7T3KLjyuFAnMBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica C.", 
    "review_text": "Thank god for this place, because the alternate options for coffee in this neighborhood are Starbucks and CUMAICA - no thanks!   The coffee is perfect. I get an Americano, and it is probably the best I've had in the city (not exaggerating). It's the perfect size so as to not taste at all watery (but not too strong either). They use Stumptown, which is smooth, rich, and without a hint of bitterness. I add a bit of soy milk, but it would probably be great even black.  It's a great place if you want to actually sit and drink - the inside is beautiful, well suited for coffee OR wine - high ceilings, dark wood floors, red booths (not the cheesy steakhouse kind)... but great if you're in a hurry in the morning too! I've never had more than a couple people in front of me, so I'm in and out within five minutes.  The staff is always really friendly. They're not those aloof hipster type baristas, which is nice since they're some of the first people I have to deal with every day.", 
    "review_date": "2014-03-17"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kim N.", 
    "review_text": "Ma'velous indeed. This part of town needed a cool venue and this place is definitely it. A strikingly beautiful interior and artifacts of coffee loving geekdom. Had an excellent Kyoto cold brew coffee extracted via an Oji drip brewer. It's unfortunate that I was in a hurry to make the train but I'd love to hang out here for a few hours, try umpteen different brews and slowly go Cornholio on the caffeine..", 
    "review_date": "2011-01-11"
  }, 
  "LH274bVcrM8KRgvfPLhQTQ": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "caz L.", 
    "review_text": "I passed by Ma'velous walking down Market St and seeing the siphon machines in the window thought it must be a place that knows about making serious coffee. I was not disappointed. I went out of my way to go back a day later for more of the same, 6oz espresso.  I have generally been disappointed with coffee  when I come to the US, living in London I guess I am spoilt. The coffee here was on par with my favourite places in London. I can't comment on the wine or food but I think this is a place I would stick to the coffee, perhaps they should as that is what they know how to do so well. I just hope it survives until next time i am visiting!", 
    "review_date": "2011-06-24"
  }, 
  "cAzduvk8ddGHLVlyJwbodA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Spaulding A.", 
    "review_text": "Quite a little gem on Market Street, which is an odd thing to say.  Since returning from Italy I've amused myself by looking for cafes that will serve latte macchiato, and this place was a jackpot. The fella working the till was a little dubious, but when I explained it's just steamed milk with a shot dumped in, his lovely co-worker just went right at it, and it was fantastic (and even decorated on the top). I heard them chatting afterwards, decoding the eternal mysteries of cappuccino, caffe latte, and latte macchiato. The baristas were nothing but friendly, and the latte macchiato was so fantastic I think my wife is now hooked too. We'll be expanding our search!  On to the space: pretty spacious indeed, with little partitions between the tables. That means you might have a hard time finding somewhere to sit, but if you find one you'll have room to breathe and relax or have your friends crowd around. It's actually sort of a super-upscaled version of the crummy cafe that used to be on 16th Street (now sadly a hipster bar called Gestalt).  I left off one star because of the techy hipster vibe, not really their fault as it's across the street from Twitter but you'll need to be prepared to listen to others kvetch about their work or blather about startup financings, etc. A particularly annoying pair showed up as we were leaving; I gathered my things while my wife was in the rest room, and some overly friendly trust funder with a white wine (at 11:30 AM) came up to ask \"are you finishing up here\" (there were empty tables just to the right of us, can't you just wait a minute until we're gone?). His equally annoying woo girl sidekick literally pushed past me so she could take a picture of the turtle.   We'll be back, but hopefully Biff and Buffy won't.", 
    "review_date": "2014-08-09"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Stylish coffee.  You only get that compliment when your attire and surroundings are as equally as good as your caffeine. My cup of dark was brewed by a gentleman bringing back a more proper time with a vintage outfit and hat, and he was doing his craft on one of six different beautiful brewing machines. All of this happens in a space that could be a century old speakeasy if its purpose was a saloon.  Fortunately for all of us their purpose is coffee, and it's very good.", 
    "review_date": "2011-05-27"
  }, 
  "SaSxhE-6B5xfGB37KOJXGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew M.", 
    "review_text": "Mocha to die for. Awesome street art, and feel to the place.", 
    "review_date": "2011-11-22"
  }, 
  "dOi4DOAqncsohAOULkq7yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina T.", 
    "review_text": "Perfect nexus of a coffee + wine bar. Skip the Muscadet on the white wine list. Order a cheese plate to share with a girlfriend, and chat the evening away! There was live jazz music when I went which was a nice touch.", 
    "review_date": "2014-06-13"
  }, 
  "apH-zpPZLpr6PTZ84vzklw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott S.", 
    "review_text": "I've been here twice in the early morning (7:30 or so).  Good selection of pastries and the coffee is good. Both times I've asked if I could have an iced coffee, but both times had to make a different choice because there was no ice.  I did notice that after I'd ordered and was drinking my latte, the barista went outside and got a bucket of ice.   I was also surprised when I asked for a receipt, that meant giving them my email address. I did, but relucantly.", 
    "review_date": "2013-10-08"
  }, 
  "Rhf0UKQsIcB0Wj4ao39lZg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle C.", 
    "review_text": "Best mocha (Tcho) I've ever had. Lovingly prepared with a side of relaxing conversation. I come here whenever I can afford it!", 
    "review_date": "2013-01-18"
  }, 
  "JjjLPCKqcEaeo9U9OvF-yQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "J W.", 
    "review_text": "I like this place. Very fresh, cool tunes and good coffee. Much better than Starbucks down the street.", 
    "review_date": "2014-01-23"
  }, 
  "X63aSSkqTxNHjoMAVbZ2YA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sonia c.", 
    "review_text": "Ma'velous is ma'velous in providing stumptown coffee. Thank you! Cafe space is hip in a classy way. $4 for the small one-size cup is pricey :( but guess that's how much coffee costs..", 
    "review_date": "2013-04-13"
  }, 
  "nGozHYFspeWe2DliD9GqcA": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "liz c.", 
    "review_text": "I love everything about Ma'velous.   I try to use the \"l\" word sparingly so that when I mean it, there is a sense of distinction. I didn't know Ma'velous existed until a co-worker told me about it. South of Market doesn't always offer the most delectable coffee or quick eat options so walking up to Ma'velous is a hugely welcomed alternative to Starbucks or diner coffee.  Beautiful dark paneled wood, tall ceilings, red lucite panels and gorgeous lamps all work together seamlessly creating an effortlessly exquisite atmosphere to enjoy an expertly crafted cup of coffee.  I am not a coffee connoisseur but I know everyone else in SF is. And because of them, I can identify a Chemex coffee maker, a French press... at Ma'velous you can have your coffee made one of six different ways. Even if your coffee palate isn't entirely refined, like mine, you'll know that you're getting a coffee worth every dime (Stumptown has easily become one of my favorite types of coffees).   The owner, I believe, who mans the coffee-making is friendly and always greets customers with a smile. It's nice to get your coffee from someone who isn't presumptuous about it. Can't wait to come back for some wine. Love this place through and through.  Check out their website for a really great education on what Ma'velous is all about.", 
    "review_date": "2012-02-07"
  }, 
  "D9MWg8MGiLTMYtL2_5eoew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "Philip is great. Coffee is delicious, if a little pricey, but completely worth it. Awesome interior and a great space to enjoy some good music.", 
    "review_date": "2014-08-25"
  }, 
  "E2YrW6Fh5cjMANNgA8lmOQ": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Kathy S.", 
    "review_text": "I really love Blue bottle coffee, however this place is my second favorite place to go. I had the Kyoto ice coffee and it was very delicious. It had a nice, creamy, and smooth chocolate note that was very pleasant. I would give it five stars but the hard bass from the music they played gave me a headache.  The music is cool it's the bass that they need to decrease. The ambiance is great as well.", 
    "review_date": "2012-08-30"
  }, 
  "E1p1QZj9sYDkoWLnIX-qsA": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Vivek V.", 
    "review_text": "A 3.5 experience. rounded down due to ok coffee and no tea  Context: looking for coffee and maybe a light snack on a Saturday about 11am and had read a write up of this place.  Atmosphere: situated on the edge of the tenderloin on one side and on the edge of Hayes valley on the other, it felt a bit like no mans land. While we were there, about an hour, they served one person. So, Saturday morning must not be their busy time.  They are a narrow, small place with some nicely situated seating if you like a bit of privacy. It's an eclectic decor with wood tables and plastic seating as well as some banquet seating. The place reaches from market to fell  with entrances on both sides. It's dark and there are a few tables that look over market but its not a very nice part of market.  Service: the barista was not particularly friendly but he seemed very competent, making ritual worthy patterns on the foam. But, he barely spoke to us.  Coffee: well, there was very little food here, just a few muffins and they do not serve tea, so we stuck to coffee. They also sell wine and beer. The coffee is stump town and it is served in heavy diner glassware. We had a cappuccino, above average but not as good as ritual in terms of depth. It is smooth though. We also had a latte and it was just way too milky and Luke warm but it was smooth and the coffee is good just not particularly powerful or intense.", 
    "review_date": "2013-03-06"
  }, 
  "L569rUmLrr37yo1QOdwZqw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "MonkeyKin G.", 
    "review_text": "Diagonal streets in the old Business District render this a space with front and back entrance with wood carved chandelier anchors and the decor intuitively respects history. Down the hatch with a limited but acceptable range of street-credible upper or downer selections.", 
    "review_date": "2014-01-14"
  }, 
  "jpwDmn396xUcSikoDJnpTA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Alice W.", 
    "review_text": "This area of town is getting nicer. Ma'velous is an excellent addition to the area.   The place is very nice &amp; has some very cool decore and reminds me of being in Japan. Really friendly and helpful staff as well as owner.  The coffee is awesome. I would recommend trying the 17hr brewed ice coffee. Its something you'll have to sit there sipping and enjoying while talking to the owner (Phillip) who will explain to you what the chemistry set is for &amp; how it works.  They have a nice selection of cheeses that comes with some crispy crackers, artisinal olives &amp; cured meat.  The counter has some nice looking pastries that I didn't get to try yet.   I will definitely come back again &amp; recommend all my fellow yelpers to give it a try.", 
    "review_date": "2010-11-27"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "What a mavelous concept combining fine coffee beans, top notch brewing processes, coffee tasting menus... and wine!   First and foremost, the (expensive) Kyoto Coffee $4!, was pretty overrated, although on par with, maybe slightly better than Blue Bottle's. Philz is still the standard. I found it irritating that the coffee was iced with a long cube of ice that wasn't broken properly, making it next to impossible not to spill it when stirring. Sure, it's nitpicky, but when you're specializing in one product it better be good.  Secondly, what kind of coffee shop doesn't have: Cream, Splenda (or any other sugar except brown), Napkins or coffee sleeves. Usually I'm never a stickler for wasteful coffee sleeves, but my cup was poor quality, and 30 min in I could feel it crumpling in my bare hands from the coldness of the ice coffee.  Lastly, I found the service to be slow and unfriendly. I asked the dude where Stumptown Coffee is originally from, and he said it's \"from everywhere.\" FYI Stumptown is originally from Portland but it has locations in Seattle and Manhattan. Apparently, they are widely known for their bottled ice coffees. As a small business, you should make it a point to know your products... but if you don't, just own up to it.  Excellent concept, mediocre execution, poor service.", 
    "review_date": "2012-10-31"
  }, 
  "2mBScQpeFTiL1ku9MGxvFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew A.", 
    "review_text": "Great new spot on Market St. for an excellent cup of coffee. I had a cup of Stumptown for $2.75.  Having just returned from Portland, OR, I was super excited to try Stumptown's beans again.  My cup was made-to-order (hario v60 pour-over) and delicious.  No need for milk and sugar here; this coffee is not bitter at all.  If you're anywhere near city hall, go to Ma'velous!", 
    "review_date": "2011-06-15"
  }, 
  "dVpYTO1J8ipOCgVAzU5-lA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Philippe M.", 
    "review_text": "The coffee is really good! (And they have a bottle of Westvleteren 12, probably the best belgian beer. But it costs 80$......)", 
    "review_date": "2013-03-09"
  }, 
  "O88LwOgLtZtzNBFofJNfKA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Marina B.", 
    "review_text": "Lovely ambiance, great soy lattes! The right balance of espresso and quality (not to sweet) soy. The Eddie Colla mural (Oakland artist) and Phillip Ma (the owner and barista) are also marvelous.    Checkout the custom espresso machine and other coffee contraptions when you visit. Impressive.  (Great cappuccinos and ice coffee too.)", 
    "review_date": "2010-11-19"
  }, 
  "dkKP9p6XqiBH-XrdxHrYPg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanie M.", 
    "review_text": "This seems like it would be a great place for a get together after work.   We came in one evening for a glass of wine, and had a cheese plate.  Both were fine.    The loud booming bass for the sound system was more like a night club than being conducive for drinking wine.  I'm sure if you were trying to drink a coffee and read a book it would be annoying too.  Like I said, probably great for an after work drink, I was not a fan for enjoying a glass of wine to the overly thuddy music.", 
    "review_date": "2011-01-27"
  }, 
  "IMOOyjf3UbcExgm_hyCCpg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peters G.", 
    "review_text": "i went there for the first time, i had no clue a coffee shop were serving wine as well at night. I really liked the design inside as well and the staff were very friendly as well.", 
    "review_date": "2014-09-21"
  }, 
  "8eqLCHBeMjbgalyZDkgSAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna S.", 
    "review_text": "Great wine list, tasty cheeses, &amp; cool atmosphere.  Also, very reasonably priced.  This is truly a great lounge bar for coffee or wine.  I've gone ~ 3 times now (only at night) and have enjoyed every time just as much.  The server/barista named Sarah is super nice and is VERY knowledgeable on Ma'velous's wine's and coffees.  Great music as well - what more can you ask for? okay, maybe a better location.. but the service, atmosphere and overall experience totally makes up for it!   checkit outtt", 
    "review_date": "2011-01-19"
  }, 
  "VIZzMOlgfnLD1zLXD5YvGA": {
    "user_rating": 5.0, 
    "user_location": "Bastille, Paris, France", 
    "user_name": "Eric G.", 
    "review_text": "This is such a great addition to the neighborhood. Actually this would be great in any neighborhood but luckily it's in mine. Phillip is super nice and discussed everything about the place from the designer to the awesome custom espresso machine and other contraptions. We went for wine and were pleasantly surprised to see the variety from French, Italian, to local varieties.  We sat in one of the beautifully designed nooks and felt quite comfortable. This place is very much worth checking out. The next time for me will be to get some artfully prepared coffee.  Someone mentioned that there hot chocolate is to die for.", 
    "review_date": "2011-02-15"
  }, 
  "ra3OzaxpILytSjHRRKoT8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel B.", 
    "review_text": "It's beautiful.  It's stylish.  The coffee costs $100 a cup.  Okay, not that much, but there's no way that this will last at these prices in this location, so go now!  and maybe it will last after all because it's pretty great.  I wonder if the wine costs $200 a glass.  Wine is definitely more expensive than coffee in life (except maybe not here).", 
    "review_date": "2011-03-09"
  }, 
  "cNz6bOo5I9sfkMw-qsuClQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "scott o.", 
    "review_text": "Great ambiance. Owner is super nice. Coffee is delicious. Highly recommend!", 
    "review_date": "2012-06-28"
  }, 
  "drI9J9xeWephVGlfMC487w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole M.", 
    "review_text": "Woke up with a headache. Took some Advil and went to work. Head still hurts. Work (quite unintentionally) makes head hurt more because its hot. After work, head still hurts. Enter Ma'velous. One glass of ruby port and a lovely little (blue) cheese platter later, the headache is gone. Miraculous. A gorgeous interior, good music, and cute baristas didn't hurt either. Visit for miracles of your own.", 
    "review_date": "2011-01-18"
  }, 
  "f1MFQxTZAWJnRQdrouLg_A": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Matt E.", 
    "review_text": "Wow. This is a serious coffee bar for people that are serious about coffee! As I've said before, my idea of coffee is generally a vanilla latte, so I'm a bit out of my element when people start talking about the texture and mouth-feel of different roasts of coffee. But my ignorance has not stopped me from learning to appreciate a fantastic black cup of coffee. And a fantastic cup of coffee is the Ma'velous guarantee.  My travel buddy is an absolute coffee geek and went for the siphon method. All very steampunk, It involves water being heated by halogen lamps and copper tubes and beakers. It's also $14. I wouldn't pay for it, but it VERY was interesting watching the process, and my friend greatly appreciated it. I did try a taste, and I enjoyed it. It had an interesting texture. Look at me learning about coffee!  They sell Stumptown beans, which means nothing to a midwesterner like me, but again...local coffee nerds rejoice!   Aesthetically, this place is great. Again, very steampunk with all sorts of oldentimey lightbulbs. I dig.  One thing? Don't come here if you're in a rush. The guy at the counter likes to talk, and you can be behind somebody in line for a good five minutes before he even starts making their drink. If I had a meeting or a place to be, I'd be more than a bit annoyed.", 
    "review_date": "2012-03-17"
  }, 
  "6fYB_FK0eP-OlzAetR76uQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina Z.", 
    "review_text": "Great space. Friendly service. So far, I've only had the tea. It was good. The portion was just small served in tiny but stylish cups. I'll be back to enjoy Stumptown coffee away from the Northwest and to try their wines. It's a welcome addition to the neighborhood and definitely brings the area up a notch (or three).", 
    "review_date": "2011-04-27"
  }, 
  "rhROLqZmn8HiSJGUn8cB-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priyanka P.", 
    "review_text": "Mavelous is right where I work and I'm a regular here for an afternoon coffee.  Cosy atmosphere - great for beer , wine and coffee ... they also have live music at times ...", 
    "review_date": "2013-08-19"
  }, 
  "AjU1dYlzNVi_GRiWthHjhg": {
    "user_rating": 5.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Frank F.", 
    "review_text": "Definitely my favorite coffee place.  The shop is beautiful--really beautiful coffee-making implements that double as decorations, nifty mural, classy furniture, etc.  The coffee itself is probably the best coffee I've ever had, and Philip is really knowledgeable about both the beans (Stumptown for the espresso) and how to make it.", 
    "review_date": "2011-09-25"
  }, 
  "JSs4Izb9zhZySG-wSMrLQA": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Matt M.", 
    "review_text": "People rave about blue bottle in this town. I challenge you to compare the espresso here. Lovely people, great coffee. Can't go wrong.", 
    "review_date": "2013-02-27"
  }, 
  "lm0pGKm-HJEegS17bJRoAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arcee X.", 
    "review_text": "Everyone who knows me knows I'm a total coffee snob. Ma'velous blows all the other coffee shops out of the water.   Walking in, you see the awesome coffee beans lined up and the really neat siphon coffee machines (I admit, they were the main reason why I walked in. It's hard to find a coffeeshop with Siphons these days here in SF).   Mad props to the owner for stocking Intelligencia and Stumptown. This place is awesome -- decor is nice, music not too loud, and coffee is incredible.  I will be back again and again.", 
    "review_date": "2011-10-07"
  }, 
  "iDwZQQhnlg13CAVwXq9bEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony S.", 
    "review_text": "Ahh Phil your coffee is delightful ...   Really great coffee shop located on Market at about 10th ... very close to me so its a great way to start my day ...  The coffee is fresh, flavorful, and accompanied by a very friendly barista.  If you want great coffee made by the cup ( best triple latte as well ) check this place out .. its small its kinda hip and its just plain old good ...", 
    "review_date": "2011-11-05"
  }, 
  "i6V3NyTdkBVwPpH7r2BINA": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Tina H.", 
    "review_text": "The pour-over Ethiopian from Stumptown was delicious black. Nice interior. Friendly staff. Cool espresso machine. Other cool brewing equipment.   They carry Stumptown, and one of my personal favourites, 49th Parallel (hailing from Vancouver, British Columbia, Canada).   This place is A-ok for me! I would definitely make this a favourite spot if I lived in San Fran but since I'm on vacation I'll just have to think about it and miss it when I go back home.", 
    "review_date": "2013-10-26"
  }, 
  "Z-NjDpNw_SDPEap81FN9OQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ann T.", 
    "review_text": "not too bad.... just a bit pricey. so, definetely not an everyday habit.", 
    "review_date": "2011-04-26"
  }, 
  "kXKI2JVFFh-pb12NQguNgw": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Rex H.", 
    "review_text": "Excellent establishment for relaxing alone or with colleagues. Try the coffee ciphon   Phil is definitely the spirit behind this concept.", 
    "review_date": "2013-09-28"
  }, 
  "0JfJYZT6vPKsXi5NaQSCeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew B.", 
    "review_text": "Make room Ritual, Blue Bottle, Sightglass and Four Barrel, Ma'velous is the real deal.  Don't listen to the tools below who are crying its a hipster place, James is a lifelong coffee aficionado, owns, runs the shop and is there every day all day.  Make a point to stop in, great for an after work vino as well.", 
    "review_date": "2012-09-12"
  }, 
  "rjE_SpqTmW-mrQOSAmGhdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicente G.", 
    "review_text": "So this is a preliminary review since they've just opened and I definitely want to return and see how they progress.  The space is SO cool!  Great furniture and color palate, sleek and sassy vibe!  The service was uber-friendly, and the owner is outgoing enough to chat with all of the patrons.  People kept walking in randomly from the street to look the new place over.  They offer a great selection of gourmet coffee with several brewing options.  I tried the Intelligentsia PNG coffee through the Siphon bar, and it was very tasty.  Had never witnessed the siphon brewing process before, so it was really cool to see.  I usually take my coffee with cream and sugar, but decided to drink it black to determine if there was a noticeable difference from other straight forward brews.  I must say that it drank pretty smoothly without any bitter aftertaste.  They had a small assortment of pastries, but I hope they will stock more and have more varieties in the future.  My berry bread pudding was ok (perhaps a warming option?).  They also have wines and accompanying small bites, which I need to try in the future.  Definitely a much needed addition to the neighborhood, and can't wait to return!  Maybe I'll try coffee from the huge Kyoto contraption or something from their fancy espresso machine.", 
    "review_date": "2010-11-16"
  }, 
  "IDhcaHM7KG4EDmWf9b3c0A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Came here for an event a while back.  Ordered a hot chocolate.  It was $5.  I was shocked, seemed like a lot for chocolate, sugar and milk.  Staff told me that it wasn't the best hot chocolate I had ever had, they would reimburse me.  They were right.  Best hot chocolate ever!", 
    "review_date": "2012-02-23"
  }, 
  "H3PFTHE-SL1gg2exnNy1jg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily S.", 
    "review_text": "Really cool coffee space off Market with exceptional coffee. They have many unique coffee brewing methods which are quite rare. My only complaint is that some baristas are significantly better than others at extracting the espresso, but I suppose this is what happens when it's all manual. Definitely check it out!", 
    "review_date": "2012-06-16"
  }, 
  "ggJEtcyPLtrgrwFxjQG9RQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Frost L.", 
    "review_text": "The selection is limited for both wine or coffee. The coffee is good but at SF standard, not quite impressive. However, this place is lovely, cozy and good for an after work hanging out with coworkers or friends. It's casual and relaxing, doesn't have too loud music and the staffs are friendly.   Maybe not worth going from far but definitely a go-to place if you live/work close by.", 
    "review_date": "2013-02-24"
  }, 
  "Y_i7PfuyX3bB8AXP0QHtrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike J.", 
    "review_text": "Perfect morning coffee, perfect afternoon spirit.", 
    "review_date": "2014-09-19"
  }, 
  "fwl3IE1G7fsZafVYYI6Uxg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles W.", 
    "review_text": "One of my favorite coffee shops. I like this place because they got me hooked on Stumptown coffee. Definitely have to try their ice coffee, its the best!", 
    "review_date": "2013-05-29"
  }, 
  "gfyW0vuJls8ARoHmogfcmw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marilyn T.", 
    "review_text": "This place has a cool feel - it's not like your usual coffee shop because they serve wine and beer, too.   I had a cafe au lait, which was pretty standard.  They have some pastries, too, but the $5 kouign amann was not worth it, especially when B. Patisserie is only a few miles away.   The guy at the counter was really nice and friendly.", 
    "review_date": "2014-09-21"
  }, 
  "h0qqVLlOwAG75SmxZuLFzg": {
    "user_rating": 5.0, 
    "user_location": "Venice, CA", 
    "user_name": "Alita W.", 
    "review_text": "Thank you, Ma'velous.  I love this place.  This is the best new coffee bar in town.  It's thoughtfully decorated and styled to almost the same standard that the coffee is picked and brewed.  Amazing.  I have never learned so much about coffee making, beans, temperatures, devices than by spending an hour speaking with owner, educator, gentleman, and all around wonderful man, Philip.  It is the most unique and specialized coffee bar in town (and there is a lot of great coffee here).  Come and enjoy it before it becomes a hot spot sceney scene.  They also have a delightful wine menu.  Although I have only been daytime for coffee, I believe this place would be stylish place to enjoy a drink.", 
    "review_date": "2011-04-15"
  }, 
  "b39y_inQloddW6I49gV5AA": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Edward M.", 
    "review_text": "While other area cafes close shop ridiculously early (4pm?!  seriously?), this place stays open until far more reasonable evening hours.  Their coffees are high-quality, crafted with care, and served in sturdy-looking mugs.  They also have various wines and beers available for your quaffing pleasure.  The coffee machines and paraphernalia are interesting and lovely to look at.  They have a variety of seating options, including sizable booths, small tables, and a somewhat secluded study area in the back with comfy looking chairs and an a aquarium ruled by a mid-size tortoise happily swimming about.  The decor is steampunk-inspired modern, darkish, and comfortable.  The menu appears on a couple of tablet computers by the counter.  The servers were helpful and friendly.  Prices are on the high side, but if you have it to stay, you're also getting an experience.", 
    "review_date": "2014-02-16"
  }, 
  "WuWyzh-bd2P86TEt-GygrA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Yenyi F.", 
    "review_text": "Ok. Not really a wine bar. Limited selection. But the atmosphere is good.", 
    "review_date": "2012-01-19"
  }, 
  "4eMf_36O9SaIzaEJdJXl9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christy L.", 
    "review_text": "This is a cute wine/beer/coffee bar on Market.  The atmosphere is great &amp; the coffee is tasty.  There is only one power outlet, so it isn't a spot to stay for a long time, but the large booths make it nice for a group.", 
    "review_date": "2013-11-17"
  }, 
  "U9yWtQO_0LPjtaU9jN0JsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean K.", 
    "review_text": "Wow.  I must be out of the loop.  How long as this place been open and I've never noticed?  It's a long thin wine bar that also serves fancy coffee during the day - and I mean like Blue Bottle crazy machinery fancy coffee.  Although I didn't get a chance to try the coffee, I did enjoy the wine here.  The owner was super friendly too.  A great addition to this part of Market.  I would definitely come back here again for happy hour.", 
    "review_date": "2011-04-13"
  }, 
  "6BTUPrCbEyJ1-tIRvYK-Lg": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Jessica S.", 
    "review_text": "IT'S MA'VELOUS!  Ever thought of getting into coffee but didn't know where to start or how to learn? This is the place for you. It's also the place for those serious coffee and espresso drinkers that want variety: Ma'velous offers Tcho, Intelligentsia, stumptown, Ecco, along with Forty Ninth Parallel for a season blend.  I tried the Black Cat Espresso from Intelligentsia and fell in love with the syrupy sweet balance. It was prepared on their custom-built espresso machine called the Musashi 4. The bright red boiler is encased by glass and trimmed with oak--most beautiful espresso machine I have even seen.   What makes it such a great coffee bar is the palette tasting menu! They have six different brewing methods, including Chemex and Siphon Bar. You can taste house espresso versus guest espresso, or brew different coffees with different methods, or try the same beans brewed with different methods. Depending on how many you try, the price range can vary from $7+ to $15+. All of this can be done with one of the three baristas that work there, which includes the owner/manager, Phil.    The interior is carefully designed to reflect the coffee with a sleek and modern style. It's not your coffeehouse down the street with wifi, it's your coffee specialist.", 
    "review_date": "2011-06-15"
  }, 
  "szhitaiKPsjC15bveyXRzA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G R.", 
    "review_text": "$10 bucks for coffee is steep.  I like the feel of the place, nice to relax with an expensive but great pot of coffee.    Have not been here for the wine/beer selection yet, will try that and update my review.    The location has much to be desired but I do with this place well and will be back from time to time.", 
    "review_date": "2010-12-15"
  }, 
  "a4Pv_i4roT2XdADebM0bLw": {
    "user_rating": 5.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "Brent S.", 
    "review_text": "Easily..... EASILY the best espresso in the city. I get a triple cap or latte just about every day. So smooth despite the three shots. Phil is there every day and is the only barista. He's efficient, friendly, and you always get a consistent product from him. In a good location on Market St. If you live in SOMA or the TL, it's worth the walk. Give Ma'velous a try.", 
    "review_date": "2012-02-22"
  }, 
  "XiUdnODtgeKe1wpIvHQFEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zehra A.", 
    "review_text": "I give Philip three stars just for the decor. Super chic, vintage style, sexy lighting and good use of space. The little sections are perfect for cozying up with a book and a friend. The Masushi is pretty good; a strong, bold concoction with a double shot of espresso, whipped up creamy and frothy. I love the vibe, and the set up. My only complaint is that they don't offer wi-fi, which makes for a tricky telecommute. While I have only been here once so far, I think this will quickly become one of my favorite places to work from.", 
    "review_date": "2010-12-06"
  }, 
  "Y7XqTa5dIMhx-0_VvGzchw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandra C.", 
    "review_text": "WOOHOOOOOO SERIOUSLY  are you sure that's espresso?! As my girl Cherylynn mentioned, this is liquid crack!   I am an avid espresso drinker and self-proclaimed espresso-holic and BAZING....Ma'velous you are just Ma'velous.  Best mocha I've had in SF, come on... TCHO chocolate and high -quality espresso, perfection.   Ma'velous is the best in town, seriously... coffee shop thou shall not be named, I will refer to as \"POO BOTTLE,\" cannot even compare to high quality coffee and espresso and mochas, and lattes, and slow drip iced coffee that Ma'velous serves.", 
    "review_date": "2014-02-22"
  }, 
  "fitXjNnwVB_HzqaBSrIGXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor W.", 
    "review_text": "Cool little spot for either high quality coffee or a nice glass of wine or bottle of beer. The place is well designed and feels welcoming yet cool.   I recommend stopping by if you're in the neighborhood already but it's nothing to go out of your way for.", 
    "review_date": "2013-07-27"
  }, 
  "lUwlSqU_s4bo_IMJew03pw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tal n.", 
    "review_text": "Ma'velous critique  This place definitely deserves more traffic. Mainly because of the *$**%*#(@*&amp;! Coffee (\"*$**%*#(@*&amp;!\" is Excitedeish for the English word \"spectacular\").   Mr. Ma is not roasting his own coffee, but he definitely knows how to pick out top-of-the-crop bags of beans - in a way that allows you to think of yourself as true out-of-SF coffee feinschmecker, Palatably, Ma is also a Ma'ster-barista... Well I'm sure you got that I love the coffee....  Why not 5 stars then you ask? (on my tenth visit: decided this place really merits 5 stars)  Well, I'll tell you: My main quip is the water situation. I don't know about you but after five Americanos I tend to get a little dry in the mouth. This is when I go on the lookout for a water pitcher. So, to cut to the chase: Ma has no pitcher, no mug nor even a self-service water-well. When you eventually despair and ask for water, Ma goes out back for the precious liquid.   Other things which make me less enthused are only reflections of Ma's choices that may make life less than perfect for me but which I can accept: No WIFI. No outlets. No sweet-talk from the owner, (Ma's nice, but not in the effusive way). Not crazy about the music either, but it is definitely thought out.   Oh, and the restroom is too dark, so it's hard to check out whether you are pretty...", 
    "review_date": "2011-10-13"
  }, 
  "_Cd3FLNtIvItpe2-_-vPug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sebastian M.", 
    "review_text": "A little pricey, but great coffee in a really cool atmosphere. I work nearby and come in every so often to buy beans and a pourover - the staff are very knowledgeable and, despite the intense hipster vibe, are really friendly. Definitely worth a trip.", 
    "review_date": "2014-05-17"
  }, 
  "o_83sDIGibU4F8cQZMVCjQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh B.", 
    "review_text": "Such a sweet spot in grungy neighborhood on market. Once twitter moves in this place will be packed every day.", 
    "review_date": "2012-01-10"
  }, 
  "0SsfGC3T2-UdBHXbKa6X5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle P.", 
    "review_text": "Tcho mocha. The best mocha you'll ever have.", 
    "review_date": "2013-10-14"
  }, 
  "0PGQWRDjFDhvnGkipBG_wQ": {
    "user_rating": 4.0, 
    "user_location": "Second Mesa, AZ", 
    "user_name": "Rich H.", 
    "review_text": "Summary based on one mid morning visit: --Tokyo style with attention to detail --great ambiance --ok prices", 
    "review_date": "2013-03-05"
  }, 
  "sN6XqrVCINH-_fBbLiPleg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark S.", 
    "review_text": "We had an amazing evening at Ma'velous this weekend. The owner and his staff spent over an hour chatting with us about how coffee is made, from bean to cup. They told us how they visited one of the coffee farms in Costa Rica, talked about the different flavors, and processes for making good coffee and espresso, and they explained all the machines/contraptions they have. We had a siphoned coffee which was smooth and delicious, and an amazing espresso. They also gave us a cup of drinking chocolate on the house. The chocolate comes from a local artisan chocolate company, and it was divine. The owner went to great lengths to source everything they serve - it is all fair trade and organic. They offer cheese from cowgirl creamery - one of my favorites. The atmosphere is calm and inviting with artwork commissioned by a local artist. To top it all off, I have to give these folks kudos for opening businesses in our empty storefront area of Market Street. They are bringing life to this otherwise baron area. I can't wait to go back often for really good coffee and a friendly atmosphere.", 
    "review_date": "2010-11-14"
  }, 
  "lzdiEbQtWoylJ_X0kHHD1Q": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Phil K.", 
    "review_text": "Usually I dont venture to these type of places but my \"friend\" Zack F. insisted.  We met there and he had a nice cab waiting for me.  One glass turned into 5 and what started off as \"A\" drink turned into a magical night of debauchery.  Ma'velous is an understatement.", 
    "review_date": "2011-05-17"
  }, 
  "l04FarZdi7Kt2t4IdcjEQg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T T.", 
    "review_text": "This place has good espresso if one of the waxed mustaches feels like making it. Early morning service is slow and full of attitude. Better get it together if you don't want everyone going next door. Which is exactly what I did after waiting outside for the hipster to open ten minutes late and then staring blankly at me instead of asking what I wanted to order.   It's 7:45am on Monday morning and you don't have any food stocked?", 
    "review_date": "2013-11-04"
  }, 
  "FdsW_L_tQnk6yFUXh8CHdQ": {
    "user_rating": 4.0, 
    "user_location": "Albany, CA", 
    "user_name": "matt h.", 
    "review_text": "Friendly service (They are hipsters. I'm not. Didn't seem to matter). Cool setting.  Possibly the best mocha I've had in the Bay Area (Cafe Madeleine is the other contender).  But by far the most expensive. $6.50 for a mocha (Twitter efffect? They're right across the street). Worth it? Quite possibly.", 
    "review_date": "2014-04-12"
  }, 
  "mnSD-IF2RSOeMeDFZm5bzg": {
    "user_rating": 5.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "Brent T.", 
    "review_text": "I don't know much about coffee before coming here and I'm sure I've only scratched the surface after visiting a few times.  Phillip not only makes a great cup of coffee, he also knows so much about coffee that he can fill your mind with interesting information about what's actually going into your cup and eventually pumping your veins with caffeine.  The decor of the place is stylish but casual.  You can hang out here and sip on a great brew while you contemplate your next move in life, it's great.  One thing you must try is the siphon coffee.  Apparently it's a rarity here in the USA, so try it and be impressed.  It's a different experience that what you're normally used to.  Another great thing about this place is how close it is to the Civic Center BART station.  Just a few minutes of walking down Market St.", 
    "review_date": "2012-04-15"
  }, 
  "YqIDIYVBwd8r8qytCYgd1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke C.", 
    "review_text": "I have to take another star off. This place is never open. You are a coffee shop; you're meant to be open early enough in the morning so people on route to work can grab a coffee. I have been past at 8 oclock most weekday mornings and you're open at most 20% of the time. Even on weekends, never open. Such a shame seeing as there is no other place within a 10 minute walk that serves decent coffee.", 
    "review_date": "2014-06-01"
  }, 
  "f1R0SgOh7raS3dsVlAhwNA": {
    "user_rating": 5.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "John J.", 
    "review_text": "This is the kind of place I had always wanted to find: a pretty chill place to enjoy a beer, hang out with some friends, and with the noise not covering up our conversation causing us to yell at each other. The drinks are all very reasonably priced, the people at the counter are very courteous, and there's a pet turtle. A pet freakin' turtle. He has his own Twitter handle, too! I can't believe I didn't find out about this place sooner! If they served food, then this would be the definitive hangout spot, luckily it is right next door to The Little Griddle, so it isn't a huge deal.", 
    "review_date": "2014-07-02"
  }, 
  "GmIp6DOepYL7VhRS2pwhCw": {
    "user_rating": 3.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Gisele C.", 
    "review_text": "Nice ambiance especially with the decor. The place has a vintage feel to it that I really liked. I met my friend here specifically for wine so this review does not include the coffee and food options available. Wine list is extensive but lacks many by the glass options across the spectrum. When I go to a wine bar I enjoy a more interactive experience wherein I can chat with the person behind the counter about their favorites and compare notes. This place is lacking that but since it is still new I have high hopes that it will only get better.", 
    "review_date": "2011-08-26"
  }, 
  "29t-DpbQzeL4JTwbKlfYhg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy M.", 
    "review_text": "minus one star because the prices are high (damn those techies!...) excellent friendly service not much selection foodwise but if you just want a coffee, glass of wine or beer and perhaps a pastry, this is your place cheese plates at $14 are again priced high - 2 small wedges of cheese and about 10 slices of salami plus small crispy chips (many of them broken) i would certainly go back but bring a thicker wallet", 
    "review_date": "2014-08-13"
  }, 
  "8hh50iYCCPaMYZcRREG46A": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Farah S.", 
    "review_text": "Really good coffee, really good service, really fancy decor, really good bacon maple scones. A diamond in the rough end of Market Street.", 
    "review_date": "2011-03-27"
  }, 
  "4jdX7sHKe9AnwdlhxYKQLg": {
    "user_rating": 2.0, 
    "user_location": "Ridgefield, CT", 
    "user_name": "Mike B.", 
    "review_text": "Yeah.  $5 for a standard cup of coffee is  ludicrous.  Even if he brews it fresh in front of you. It's fine. It really wants to be uberhip. It is a hipster haven. It is a great example of how you can really overcomplicate something that doesn't need to be complicated.", 
    "review_date": "2012-08-29"
  }, 
  "zH2SvkifEIWT9it4ZR_g6w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lidia Z.", 
    "review_text": "Came here for coffee and I was impressed by the atmosphere and the coffee was really good. The barista was very friendly.", 
    "review_date": "2011-10-23"
  }, 
  "GBc0JzFKfLNvZdqMwxojsA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony N.", 
    "review_text": "Hands down one of the best and unique places to grab a mocha, drink coffee and sip on espresso while you wind down and reflect on your day.  What this place has is a barista who is professional, knowledgeable and proud of his work.      The mocha is a definite must - it's strong, packs flavor and you really REALLY taste the chocolate    The coffee is good too.  Not only is it fun to watch but it's freshly made and is quite flavorful.", 
    "review_date": "2011-08-13"
  }, 
  "pFercu-uMeQSRA-vyGvCGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamer I.", 
    "review_text": "I got back from a river cruise in Amazons in Brazil and Peru this morning feeling tired, so when a friend of mine suggested that I join him early this evening to go to the opening of a new gallery in the Mission District called Carte Blanche on Valencia, I was at first hesitant. But nevertheless we arranged to meet in downtown and go to the gallery.  I read about Mavelous on Yelp and wanted to check it out, but somehow never made it there as it is in a part of town that I rarely go. So, I suggested Romain Colignon that we walk to the gallery since it was a really nice sunny afternoon and stop by Mavelous for coffee so that I could revitalize myself with caffeine.  It is not easy to notice this place as it is nestled in between shops with no visible sign or prominent entrance. But once we were inside we both fell in love with the decor. The space is very stylish and kind of reminiscent of art deco cafés of Montreal and Paris. The photos on Yelp give the illusion that it is a big space but it's not, however their coffee is good and the owner Phillip who also happens to be the barista is a super nice guy. I'll definitely go there again with a good book or with some friends to enjoy their coffee and pastries. This is a San Francisco gem and deserves our support.", 
    "review_date": "2012-04-20"
  }, 
  "kZJWAY828P8QZTqVYzhTCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fancypants X.", 
    "review_text": "3.5 stars rounded up   Ma'velous' eclectic design choices are a feast for the eyes. The glass Kyoto thingy is so imposing, it's as much a part of the decor as it is a functional slow-drip coffee maker. The pressed tin ceiling is a beautiful sight. An adorable turtle by the name of AJ hangs out in an aquarium &amp; totally loves the camera.   Stumptown coffee is super strong. Straight outta Portland (thought i was gonna say Compton?!) &amp; sold at Rainbow Grocery in SF, I first tried it in NYC &amp; found out just how strongly caffeinated their beans are.   We stopped in this week for a quick bite of pastry...I wish the Kouign Amann was bigger, but damn, that outer layer of sticky, caramelized goodness made up for the size.   No wifi access.   Beware the crack heads &amp; drunkards--they are a plentiful bunch on this street. This dude was straight up riding a bike with a Four Loko in hand... Surprised he could drive at all.", 
    "review_date": "2013-04-28"
  }, 
  "-pzQvqBRnrEVRYq4bsPxHw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie A.", 
    "review_text": "Great coffees, impeccable interior and design, and a chill ambience - truly as good as it gets for a cafe.", 
    "review_date": "2012-07-01"
  }, 
  "zRICowrh6Wm8THjCJ0Jxcg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Victor C.", 
    "review_text": "Very cool place...but pretty small.  Coffee is great. Ambient is good for small group to get together for wine or coffee.", 
    "review_date": "2014-11-22"
  }, 
  "bIEiIKz0sciLtooIPogLzw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sheena G.", 
    "review_text": "It's refreshing to be able to escape away into a cafe such as Ma'velous. The narrow, vertical interior stretch, paneled by a deep, heavy color palette almost cultivates the kind of creativity that can only be revealed by a present feeling of solitude. It's a quiet place with an unique ambiance probably best suited for smaller, more intimate groups or by your lonesome.   My 49th Parallel was served black, in a cream-colored ceramic cup. It was one of the better cups of coffee I've had--undiluted of cream and sugar. Additionally, they also feature a small selection of wine (sustainably grown).  Overall: Unique atmosphere, great coffee, 4/5 stars. Would return.", 
    "review_date": "2013-09-30"
  }, 
  "OaRk-RwFEzfOtc45ff0fGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "If you're around the area, say...you're about to hop into Starbucks at Fox Plaza - STOP!  Walk across the street and save yourself some dignity.    So unassuming on the outside, I bet many of you might have passed right by without noticing, but the interior is rather nice, and so is their coffee.  I only wish their hours were more extensive on weekends.", 
    "review_date": "2011-06-19"
  }, 
  "8MeD1D70MC-0dIK2Lr11WQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richa A.", 
    "review_text": "I would give this place 6 stars if I could. I just love everything about it.  First and to the point: The coffee is fantastic. I really like Stumptown, so I usually get that, but there's a few options for pour-over.  The baristas are amazing. I don't know whether it's the anticipation of the coffee (or the pastries... which I'll get to) or just that they're great people, but chit chatting with them always brightens my day.  They get their baked goods from Starter bakery, which is the best. I don't think Starter bakery has a storefront itself, so it's always a treat to find them in cafes. I know they're known for their kouign-amann (which I haven't seen here) but choose your poison, because it's all good.   It's a quick walk from my office, so I usually am in and out, but the atmosphere is great -- relaxed, quiet, great for sitting and reading a book.   Perhaps the best part is the fact that they left the 'r' out of their name. I get a huge kick out of asking my coworkers if they want to go to maaaavelous with me.", 
    "review_date": "2013-08-01"
  }, 
  "yj6ctKufl4F4SZFS7lMVxA": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Jerad H.", 
    "review_text": "This place is great! I was not a coffee drinker until I had a real cup made by a professional!", 
    "review_date": "2011-03-09"
  }, 
  "0B46nblFSmucpw9IHO_EjA": {
    "user_rating": 1.0, 
    "user_location": "East Austin, Austin, TX", 
    "user_name": "Christopher F.", 
    "review_text": "This place was the most pretentious coffee shop I have ever been in. I ordered a cold brew and I received the smallest coffee of my life with a fucking sphere ice cube in it that made it so my coffee had literally about five sips. Since I got about five sips out of my coffee that means it cost me about $1 per sip. I have had coffee that is actually worth $1 a sip and this was not that. The service was not too stellar either.  If you wanna buy a $5 ice cube THIS is the place!", 
    "review_date": "2014-11-21"
  }, 
  "sp70oCo2DpOTyDK8vlfBvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily C.", 
    "review_text": "Really like this little coffee shop.  I work nearby and come here once or twice a week.  The service and coffee are great and the space is much more pleasant than the other coffee shops in the hood.", 
    "review_date": "2012-09-06"
  }, 
  "8lDrHEmkMcQ5jQN7laf1AQ": {
    "user_rating": 4.0, 
    "user_location": "Rialto, CA", 
    "user_name": "Susan J.", 
    "review_text": "Wish they would keep their actual website up to date on the coffee they are serving. Went there because they said they had coffee from a Microroaster from Norway. I've since learned the owner orders it when he wants some for himself. to me that was a huge draw.  No offense, it's not a bad place, would be good to go for mixed group who want either coffee or wine but there are better places near by for coffee.", 
    "review_date": "2013-09-02"
  }, 
  "In-jPXAVKHLbR_7pjESGPA": {
    "user_rating": 5.0, 
    "user_location": "Gilroy, CA", 
    "user_name": "Mark C.", 
    "review_text": "Tasty  informative  and entertaining.   Coffee  snobs  at its best edgy  interior  along with mellow sipping  of coffee  and teas from around the globe.  With not a hint sugar condiment tray", 
    "review_date": "2011-04-14"
  }, 
  "ghOQ3yUgAc6v2_ZhAqL5Ag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael B.", 
    "review_text": "Very interesting coffee shop / wine bar in what appears to be (finally) an upcoming neighborhood. Great looking decor. Japanese siphon pot coffee, of which I'm a great fan. Fun place to take a friend, date, etc. in the neighborhood.", 
    "review_date": "2011-06-15"
  }, 
  "CX71NDrxCkcuXICKMz3mww": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "David W.", 
    "review_text": "I really like this cafe.  A nice place to sit and have a [Stumptown!] coffee, beer, or wine.  Really nice people, nice atmosphere, and the pastries are delicious too!  I had a kouign-amann today (they stock them from Starter Bakery), and it was amazing.  I haven't seen those in America before, but they are like a little croissant but with more butter + sugar, caramelized on top.  Great place.", 
    "review_date": "2012-12-08"
  }, 
  "9R58KzDxHIZAkpFakWqj_w": {
    "user_rating": 3.0, 
    "user_location": "Aptos, CA", 
    "user_name": "Food C.", 
    "review_text": "Just OK. Nice to sit out on Market Street. Do not order the almond croissant . Very little filling. La boulange is far better.", 
    "review_date": "2014-05-15"
  }, 
  "gLNhhX2WGjXgdu23jvDEmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Odette L.", 
    "review_text": "Tasty, fresh coffee and a sweet spot. Great for a meeting as the seating is pretty private and the decor is pretty hip.", 
    "review_date": "2014-02-26"
  }, 
  "iBIElXhJd-zS2r6eT3IXeg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rebecca R.", 
    "review_text": "I am reluctant to give a worse rating, but my one visit I just didn't see the hype.  I stopped by for a minute to take a mini break from work and read a little bit over a cup of coffee.  I didn't want to start off with anything fancy just whatever passed for their regular cup of coffee.  That was $3.  What I got was a pre-brewed (not that I was complaining...yet) cup of joe which seemed to have a fair bit of grounds floating on the top.  They wiped the rim of the excessive grounds that clung to the top, but I still was picking grounds out of my mouth as if I still smoked unfiltered cigarettes.  And to tell the true, I just didn't see what was so special about the brew--mind you, I'm also not a fan of bluebottle sometimes.  I'm a fan of peets, and of the couple brews from Philz-if that makes a difference, but in any case, I expect to be wowed for $3 fo 6 ounces of liquid, you know?  I will try again at some point, but I'll have to forget about my disappointment from the first coffee I've had there before I go again.  The staff was lovely and the atmosphere was decidedly dark and romantic in semi squalor semi fanciness of the neighborhood.", 
    "review_date": "2013-10-05"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "I AM A WUSS.   Ever since watching Paranormal Activity 3 over the weekend, I haven't been able to sleep. I even had my cardigan over my face with one eye peeking through 80% of the time and I was still jumping during the majority of the movie.   Except for the occasional liquid crack aka Philz' Mint Mojito, I've given up caffeine because one minute I'm on a caffeine high and the next, I crash and end up worse off than when I took that first sip of coffee.   Come day three of barely any sleep, a caffeine fix was needed if I was going to make it through the work day. I was willing to suffer through a crash just so I can get a good caffeine buzz to plow through some work.  Brought to you be the same owner(s) as Little Griddle, Cafico/Lunch Geek and Happy Donuts comes Ma'velous, a coffee and wine bar. Housed in the old Quincy's space, Ma'velous serves international specialty coffees and international wine. I'm no coffee aficionado but they have roasts such as Intelligentsia, Ecco Coffee, and Norwegian micro roastery Tim Wendelboe which can be brewed six different ways. Geez, I never knew coffee making can be such a science.    I went with the Kyoto 18-Hour Slow Drip Ice Coffee ($4). I normally add TONS of sugar and cream when I drink coffee. But this time just a little of sugar and a dash of cream was needed. I can tell the coffee beans were superior quality as the taste was bold, rich, and nutty with no bitter aftertaste like some generic coffees can taste like. *CoughStarbucksCough*  9:15 AM - Starts sipping my Kyoto Ice Coffee 9:30 AM - Things starts looking sharper 9:45 AM - Types faster 10:00 AM - Bangs on the keys of the keyboard as if I'm playing Warcraft 10:15 AM - Speedwalking down the aisles in the office 10:30 AM - Starts chanting like an auctioneer: \"One dollar bid, now two, now two, will ya' give me two? Two dollar bid, now three, now three, will ya' give me three?\" 10:45 AM (peak high): Wanted to do an rendition of Jennifer Beals' \"She's a Maniac\" from Flashdance but then I thought about getting caught and sent down to HR.  I continued speedwalking back/forth again.  The caffeine high lasted for hours (till 8 PM) and the best thing is I NEVER crashed. NO headaches. NO tiredness. NO lethargy. UNBELIEVABLE.   OTHER NOTES: *Artisan custom made drinks *Funky chic vibe with artwork from local artists *Library of books and articles for reading *House music *CC's accepted", 
    "review_date": "2011-11-02"
  }, 
  "p3KXTE3qGAvqWhNIk2ZQfQ": {
    "user_rating": 5.0, 
    "user_location": "Orange, CA", 
    "user_name": "Mindy H.", 
    "review_text": "After almost getting attacked by a nose diving bird, (i really feel like im in a real life version of Angry Birds sometimes) I ducked into Ma'velous again to try a cup of their drip coffee. I went with the Columbian and it was absolutely Maaaaahhhhhvelous. Don't you dare put anything in it because it is naturally smooth, light and creamy on its own.   I stopped by again to try their cappuccino and it was definitely, definitely much better than my first cup a few weeks back. I had a feeling the first cup wasa  fluke since the capps ive gotten from Lunch Geek were fabulous.   I honestly think that their coffee is as good, of not better, as BBC. No joke.  Also, I really dig the awesome \"wake up\" music they play whenever I've stopped in. (who doesnt want to groove to \"Face down, Ass Up\" while waiting for your coffee??)   Mindy says: will come back.", 
    "review_date": "2010-12-20"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "Gee, I didn't know Ma'velous has been here in the mid-Market area  for two years. I really thought it only opened just to cater to the Twitter employees across the street. But owner and chief barista Phillip Mah established this combination coffee and wine bar quietly, so quietly that I didn't even notice there was a quality caffeine alternative to the pair of Starbucks on the next two blocks. I happened by it on my stroll back from Hayes Valley. There was a large group in the middle of the bar, but the window seats were surprisingly empty. I thought I should take advantage and take a quick coffee break. The interior is retro-cool with period furniture that looks like it was purchased at an art deco store down the street.   The pressed tin ceiling, the drop fixtures, the mural, the dark woods - all of it conjures up images of a Depression-era speakeasy but peppered with state-of-the-art machinery like a custom-made La Marzocco espresso machine, a manual Hario V60 coffee drip, a Chemex coffee maker, a French press, a Japanese siphon coffee brewing machine, and a Kyoto cold slow-drip coffee maker. I was thrilled to see first on their menu a $3 cup of Stumptown Ethiopia Nano Challa with a peach-pear-cinnamon flavor (see photo). Smooth and rich. It's Stumptown after all. Enough said. I parked myself at the window and remained as still as an Edward Hopper painting at my full discretion. I'll be back.  COFFEE - 5 stars...mmmm, Stumptown AMBIANCE - 4.5 stars...nice period touches really make this space feel cozy SERVICE - 4 stars...nice and patient TOTAL - 5 stars...did I mention they serve Stumptown coffee here?", 
    "review_date": "2012-09-13"
  }, 
  "sxa51b6xOqdyq1esxmbceA": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Joe A.", 
    "review_text": "This is my favorite place for coffee in San Francisco. Phillip is the nicest guy and is happy to talk about all aspects of coffee. He has some of the best coffee and really tries to make it a personal experience.   Stumptown Esmeralda Mario Carnaval. Holy $!$%#. First of all, most people won't even get a chance to have a cup of something so exclusive. The lots are freaking auctioned off from this farm and Stumptown sells it for $75 a jar (or more). I split a cup with my buddy and it was awesome. I was very unique. Not the best thing I've ever had, but pretty darn good. The fact that Phillip even has this illustrates his commitment to having the best products available to his customers.   Nice atmosphere, nice guy, awesome place.", 
    "review_date": "2013-06-15"
  }, 
  "1EhLKcY4DmD2wvfR_2PFvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary H.", 
    "review_text": "Ma'velous stands out as a true purveyor of high quality beans who makes it accessible for fans to experiment coffee in new ways. This became my favorite place in the city for some of the best, single dripped coffees, made with Stumptown beans sourced from around the world through farmers who carefully hand pick the best fruits of the crop. You can choose the type of beans you want and have it brewed in the method of your choice...espresso machine, french press, dripped in a ceramic filter, chemex, siphon, aeropress...  This place does not fit the average coffee shop setting as it's also a wine bar, making this a great wind down spot. Great wine selection, great coffee, and an exceptionally knowledgeable owner who continuous to perfect the art of coffee in this little hidden gem at the quiet ends of Market street.", 
    "review_date": "2012-02-06"
  }, 
  "1c5v5rglitx979f552Zqyw": {
    "user_rating": 1.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Larry L.", 
    "review_text": "Oki, so I ordered green tee over ice for $3 times a buck, waited for 10 minutes and they did not cared to bring it to the table,  which was dirty...  The only classy thing about the place is overpriced menu. Not coming back for sure.", 
    "review_date": "2014-08-15"
  }, 
  "AjWFrKlkIrw6Oj8iY8eQeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen L.", 
    "review_text": "A fancy coffee shop near my work.  I love the Kyoto Iced Coffee.  Freshly brewed, great chocolate after taste.  The big chunk of ice was a bit annoying, but meh, coffee was good enough.", 
    "review_date": "2013-06-24"
  }, 
  "fw9VtoEZw91A9b8vZ93r1A": {
    "user_rating": 5.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Niels J.", 
    "review_text": "It's 5.30 on a saturday afternoon, and I'm recovering from an arduous struggle with four tapas from Cha Cha Cha that left me far too content with the world. I have but one choice - make a beeline for \"that new hot coffee place\" to keep the pleasant buzz of good food and good company going. And boy, did Ma'velous deliver.   This is clearly the new haven for coffe connoisseurs in the city. The selection of beans are unrivaled by any other shop in the city, and the care and quality put into the coffee is unbeatable. Philip, the owner and barista, pours his heart along with top notch espresso into every cup, and he'll gladly join you at a table or on the couches in the small lounge at the back to discuss coffee, wine and san francisco architecture. I also met several of his regular clientele, and we all sat down and discussed startups for a while. Kurt, Dan, I'll see you guys here again soon!   About the beans! I went with @mutdaline and, since it was our first time here, splurged on their Coffee Collective beans for a top notch cuppacino. Philip informed me that Klaus Thompson, world barista campion, runs this micro roastery out of Copenhagen, but I tend to believe that the devil himself roasts these beans. At $12 a cup it's more on par with a good cocktail than a standard espresso, but that's partially the point of this place - you can get coffee on that level! This was top-end beans that we paid good money for and yes, it was worth it! Ma'velous also provides more affordable options when you're not about to spend your weekly bean allotment on one cup, and by the looks of it this will be just as great. The only place that I know of that can match the espresso here is Blue Bottle. Quality wise, Ma'velous is first tier coffee.  Philip, the guy with the mohawk will be back for more soon!  PS: Clearly this is also a great little wine bar, so come on down for a classy alcohol experience too.  PPS: Look up at the ceiling!", 
    "review_date": "2011-02-27"
  }, 
  "V-5d1N-7rrczXEGYXfG4gA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi H.", 
    "review_text": "Best cafe in the area! Friendly staff, really cool atmosphere, and great coffee (and hot chocolate!)  Also a fun spot for after work drinks, they have a pretty good selection of wines, beers, and snacks which are also really reasonable.", 
    "review_date": "2010-11-15"
  }, 
  "zaz_5qYy3DSr-W8312PCiA": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Alex R.", 
    "review_text": "Stumbled upon this place on the walk to work - was surprisingly good. Cool looking inside (plexiglass machine? great!), amazing coffee, great music, friendly staff. Though I must say, it couldn't be a more douchey name....", 
    "review_date": "2012-07-20"
  }, 
  "UxK635aEbTvikox8MqUKvw": {
    "user_rating": 5.0, 
    "user_location": "Auburn Hills, MI", 
    "user_name": "Mathew S.", 
    "review_text": "Such a cool spot! Great selection of coffee and beer... Both of which I took advantage of! The barista was friendly and knowledgeable, and the pricing is totally doable for a drink or two! Beers start at 5 dollars and in a city I feel like that is fair for sure.  If I had to find any issue it would just be a lack of food, but drinking my dinner is perfectly okay too!", 
    "review_date": "2014-11-07"
  }, 
  "k_PSkYpsex3vP-f08xfGxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "Good coffee, great idea to have multiple extraction methods available.  Seems they need extra / more highly trained baristas, as the latte came out looking just a little rushed....foam needed work...  Blue Bottle on Linden is only 4 blocks away, so hopefully they will iron this out soon....  Perfect location.", 
    "review_date": "2010-12-05"
  }, 
  "qUL8F298WoeaJLc61MkhoA": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Kat W.", 
    "review_text": "I met some friends for a leisurely coffee this morning and it was - yes - ma'velous.  I definitely, definitely recommend this spot to coffee aficionados and interested novices (like me).    We tried the slow cupping - a single type of bean prepared 4 ways (siphon, cold brew, and two types of drip).  I have never had the opportunity to taste these side-by-side, and it was remarkable to taste how much of an impact the temperature, brew time, and filter can make.  We sat at the bar to watch the beautiful machinery at work while Phillip Ma and his barista explained every step.  Basically, my friends and I got a half-hour private lesson in coffee (plus a delicious caffeine buzz) for about $6 each.  We also loved the attention to detail in the decor.  The beautiful custom expresso machine, the hand-painted lampshades, the reclaimed light fixtures, the spiffy upholstery - Phillip put a lot of love into this place, and it shows!  Ma'velous is a gem and we hope to come back for many cups to come!", 
    "review_date": "2010-12-20"
  }, 
  "c3X8oIkgv93Q7kRJZ7xmAg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bill L.", 
    "review_text": "Update: Rainbow Grocery sells Stumptown Beans and a 12oz bag of Hair Bender is only $12.09  As far as I know this is the only place in SF that serves &amp; sells Stumptown Coffee so I was really looking forward to visiting this place. I was disappointed.  We walked in and the Barista barely acknowledged us, he seemed a little bothered by having to make coffee.  We ordered a Mocha and an Iced Coffee, $10. The iced coffee was served in a mug and was mostly ice. I asked for cream and the guy rolled his eyes and poured milk himself into my coffee.  I asked for cream, not milk, thanks and I'm capable of pouring myself.  The Mocha was just, meh.  Normally if I go someplace and have a bad experience I'll try again, sometimes you just hit a place at a bad time. I'm not giving the benefit of the doubt on this one. If serving coffee to customers is your business you should at least try to be good at it.   I just got home and ordered a bag of Hair Bender from the Stumptown site. They sell the beans at Ma Velous but I decided I'd rather pay for shipping than spend any more money there.", 
    "review_date": "2011-11-22"
  }, 
  "oRWp73EAzos724vOY4qB6Q": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "Kat G.", 
    "review_text": "This is a hipster coffee/wine bar.  We came here to check out the kyoto style drip coffee, but ended up watching the owner syphon the coffee instead.  It's pretty interesting how it's done...almost like I'm back in chemistry lab in college!  This is definitely not your average, run-of-the-mill cup of Joe! The hubby gave it thumbs up and as a coffee addict, he's very hard to please.  The wall art are also pretty cool and very Asian-inspired.", 
    "review_date": "2011-12-29"
  }, 
  "n1kdYXByRHKzkg74DQwuCg": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Marnie S.", 
    "review_text": "I agree with other reviewers.  Totally hipster in here, and although my sister and I are not (yes I am not in my 20s anymore), the barista made us feel more than welcome on the Sunday afternoon we showed up, just before a San Francisco ballet performance.  Only reason I take a star off my review is that the mocha was NOT the most amazing mocha I've ever had...I guess the fellow customer who was ahead of me in line talked it up too much.", 
    "review_date": "2014-06-12"
  }, 
  "eGttxee8qfvTMypDGksVbA": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Blake A.", 
    "review_text": "If you looking for delicous coffee, try out Mavelous, serving Stumptown coffee, which is the portland version of Blue Bottle.  I walked into Mavelous to try their coffee, when I was surprised to find stumptown coffee, being a northwesterner I couldn't resist, and I was an instant fan when the owner comped me a coffee after I forgot my wallet.   Also late at night it turns into a wine bar, a great place to chill mingle, and have a few glasses of pinot. Very suave.   Mix that with a very cool owner, and mavelous delivers everything you could expect from a hip new coffee/wine bar.", 
    "review_date": "2011-03-06"
  }, 
  "UVdMooUg69A4pR9LqfEZwA": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kathy W.", 
    "review_text": "Amazing coffee. These guys know their stuff. Friendly place, lots of seating. I'm a latte girl, but they do pour overs and have  varieties for every taste.  A busy corner on market street, but worth braving for the coffee. I've never had a bad coffee here.", 
    "review_date": "2013-11-04"
  }, 
  "vguybeVhVDGETEm68XzggQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kimya P.", 
    "review_text": "While Ma'velous has been open a year, I unfortunately only noticed this gem a couple months ago.  I love the coffee, the inside seating, and the name (say it out loud, it'll make you smile!)   1) Yes, $4 lattes are expensive, but they are no more expensive than Ritual and Blue Bottle.  Why I will come here instead of those two? Consistency!  The owner has made my latte the five times I've visited - not only have they been identical in taste and flavor, but amazingly delicious every time (better than a Ritual latte; and on par with a well-made Blue Bottle latte). Ma'velous's espresso is great.  Also, he only has whole milk which I think  (in combination with his skills) greatly contribute to a perfectly crafted creamy latte.  Blue bottle is nowhere near this consistent and Ritual is nowhere near this tasty.   2) The music is fantastic - techno-ish? It's steady, fast-paced beat perfect for studying.   3) Owner is incredibly sweet and accommodating!  I didn't realize they don't open until 10 on weekends - we arrived a little after 930 and he opened his doors for us early!  4) There's wine for all y'all on the evenings.  Ma'velous unique and trendy decoration lends itself to a smooth transition from chic coffee bar to chic wine bar.  I have yet to make my way over for an early evening of wine and cheese, but the wine list has some options (not your typical Napa Cab) which definitely caught my eye.   If you are a fan of Ritual or Blue Bottle - make your way over here; Ma'velous competes with them and wins.", 
    "review_date": "2012-04-08"
  }, 
  "OTcKsnEQ1Fm0EJ5YsSSgZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura K.", 
    "review_text": "We live across the street and it's so nice to see this place open up. They have a wonderful selection of coffee and wine. Philip is very nice and extremely knowledgable. The decor is beautiful and it's just a pleasure to hang out there.   Main downside for me is the cost. Latte's are $4, which I believe is significantly more than either blue bottle or Ritual. A glass of wine and meager cheese plate ran close to $30. I really like this cafe, but I cannot afford to go here every day.  The name is awful, unsearchable on the Internet and needs to be changed, but that doesn't deter from the experience.", 
    "review_date": "2011-04-11"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "They had me at Stumptown!  Though I've heard nothing but great things about Ma'velous from friends who've had a chance to pop in for a delightful cup of coffee in the morning or a relaxing glass of vino in the evening hours... I just haven't been in a position to dip in and check out Market Street's finest new hole-in-the-wall until very recently. Or course I've had every intention of doing my darndest to spend some time here at some point, but the final motivating factor to break ground was when I learned they serve single drip Stumptown Roasters coffee every morning beginning at 8:00am. Even before tapping a single pinkie toe onto their polished concrete floors, that alone made Ma'velous one of my new favorite coffee shops in town.  Sure there's all sorts of great roasters here in our own backyard like Ritual, Four Barrel, Philz, De la Paz, etc... but Portland's Stumptown can to nose-to-nose with those cats in an old timey, bare-knuckle boxing match any day of the week. If there's one thing the Pacific Northwest does well, it's coffee, and Stumptown is a perfect example of their prowess in the field. If you've yet to try it for yourself, run (don't walk!) to Ma'velous as soon as you encounter a need for caffeine!  Now that I've essentially found my new morning ritual, I'll have to pop in after work to see if their wines bring about a similar giddy, childlike excitement. It's a really, really cute room chock full of whimsy, so I'm guessing this quaint street side cafe will quickly become a new favorite haunt of ol' Ruggeford H. Joesten III. Stay tuned!", 
    "review_date": "2011-07-29"
  }, 
  "mS-4O56dx6wt5fWxbbx-LQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priya S.", 
    "review_text": "PSA: Hipsters of San Francisco, add Mavelous onto your list. Yes it's $4.50 plus tip for a latte but yes it's also Blue Bottle and oh so well made.   The ambiance is hipster-modern and it's tucked right at Civic Center across the street from Twitter so it's somewhat central and easy to access.   And the baristas are quite sassy... In a persnickety kind of way.   Happy drinking, Yelpers!", 
    "review_date": "2014-05-28"
  }, 
  "b9gyrlB-G23rtqTrlB820A": {
    "user_rating": 3.0, 
    "user_location": "The Loop, Chicago, IL", 
    "user_name": "Elena K.", 
    "review_text": "Nice venue. Right across Twitter. I liked the interior design and the atmosphere of this little coffee shop. However, the coffee was disappointing.. It tasted alright. But from the other photos I saw on Yelp, I expected pretty coffee art on my cappuccino. It wasn't the case. Small cappuccino for $4. It came in a plain white paper cup to go. Didn't even have a cover for the cup... Maybe it will be better if you drink it there instead of having it to go?", 
    "review_date": "2015-01-08"
  }, 
  "2pPNxXnyh6EDUuBJVuoQmA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Brandi W.", 
    "review_text": "This is a really quaint, charming little cafe-slash-wine bar. I originally stopped by hoping for a delicious soy latte, but I spotted the beer and wine list, and decided to have a little drink instead.  The boy working the register and pouring drinks was really friendly and charming, and you know, pretty good-looking, which doesn't hurt, either.   It was pretty crowded for six PM, so I sat in the back by the turtle. Yes, there is a live turtle hanging out near the back door. His name is AJ, and he is absolutely adorable. Go say hi to him and feed him a food pellet or three.", 
    "review_date": "2014-07-09"
  }, 
  "uSCYNal_CJDPGBYUAenyoA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke M.", 
    "review_text": "Ma'velous seems well intentioned and shows some promise, but (and i think they are something like a month old) has some major not A-OK issues going on right now.  They need some time to ripen and take care of problems like...  The overwhelming smell of wood varnish in this WINE BAR!  I'm sure this will dissipate over time, but they could get some air fresheners, or some flowers, or air the place out or something...  And that IT'S FREEZING INSIDE at night.  I came in to meet someone Saturday night and it was extremely cold in the place.    And they don't actually have the food their website promises.  And I don't think they own a cheese/meat slicer!  You didn't need to hire a consulting chef to offer cheese (accompanied by some tasty salumi) unceremoniously HACKED into irregular, awkward strips.   These are all problems of the place being new.  I hope! So maybe in a couple months it will be worth going back, but other things about the place are intentional that I'm not attracted to.    The offers of olives are finicky/over dressed! You're trying really too hard to make olives gourmet.  And if all you want to offer food-wise is cheese, get some that people haven't tried before.  No one needs your paragraph introduction to Mt. Tam.   And if Ma'velous wants to be useful to people on regular wine bar evenings (after it no longer smells overwhelmingly of wood varnish), they need to add bottles to their list in the $25-$29 price range.    Never tried the coffee. Maybe it's incredible-I don't know. But I'm not going back just for that.", 
    "review_date": "2011-01-09"
  }, 
  "q1t5SRqWxp6TMaXu6e18xA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cavin T.", 
    "review_text": "Ma'velous=Marvellous?   This place is truly a hidden jewel in the Civic Center area. Not only does the place reminds me of an antique shop from the 50's but is renovated and combined with retro cheek contemporary coffee shop. Their coffee is really good. I think the best part is the cocoa extract that they used, Ive tried a lot of coffee but this place is one of my top mocha destination. Well, it better be, not only did i wait for more than 10 minutes for the mocha, but the price is more than $5!(I think, Its been awhile so im not sure exactly the exact price but its more than any other mochas ive got from SF). Nevertheless, it was worth the wait!  Cheers.", 
    "review_date": "2012-09-28"
  }, 
  "bR2feXIaZMk3R_OqCrjpxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosti b.", 
    "review_text": "SF's secret spot for hands down, the best cup of hot chocolate I have ever had in California.  Rich, decadent, TCHO chocolate.  Whole milk.  Coated the cup and the back of my mouth like a proper cup of hot chocolate should do.", 
    "review_date": "2011-12-11"
  }, 
  "sjXDLpvcrMldagWJJDlBTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "monica c.", 
    "review_text": "Wow. I'm super excited to have Ma'velous around.  Stopped by on a Saturday afternoon. It wasn't super busy, so we had some time to chat with the owner, Phillip. He is extremely friendly and knowledgeable about coffee. Definitely impressed. I learned a crazy amount about ph levels, water temperature, extraction rates, and the whole process in general.  And they have Stumptown beans! Yay! If they're brewing hair bender when you go there, just get it. One of my favorite coffees ever. I have been searching forever for a place in SF that has Stumptown. My search can finally end :) Apparently no one else in the city (and Northern Cali) is even allowed to have Stump beans at this point because they are sooooo selective about who uses them.  The coffee itself is delicious. I tried the kyoto cold brew since I had never heard of that before. Perfect on a sunny day! It was super smooth and not acidic in the least. There was none of the grittiness that I normally find in cold brews, yet it still maintained the same depth of flavor. Apparently it takes about 16-17 hours to brew a batch, and it requires an awesome contraption (see pic) that allows the water to drip through about 3 different levels before it reaches the coffee and drips some more ;)  They have siphon, V60, chemex, and french press as well. I'll definitely be back to try some of these. Most of the coffee options will run between $4-6 for a cup. Definitely worth it.", 
    "review_date": "2011-01-23"
  }, 
  "qe9r7hfzHbNm1amyCPqECQ": {
    "user_rating": 5.0, 
    "user_location": "Columbus, OH", 
    "user_name": "Tullia F.", 
    "review_text": "Now with Stumptown and more microbrews.  This place just keeps getting better.", 
    "review_date": "2011-03-13"
  }, 
  "F-vwvPdLybo0AFwbhCB2Yw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael C.", 
    "review_text": "Ma'velous is a great and very needed addition to the neighborhood!  Warm, comfortable atmosphere--dark wood and deep colors--and the long narrow space is broken up by head-height partitions to form booths, so you don't feel like you're in a crowd.  Furnished with unique pieces to form an eclectic whole.  Very good wine list, excellent stemware.  Amazing, mindblowing treatment of coffee. You won't believe how good and complex coffee can be until you have coffee here.    The best part: the owners!  Super friendly and knowledgeable about both wine and coffee.  The wine is stored at the proper temperature (unlike other wine bars within a quarter-mile radius--I'm not naming names, but you know who I mean), and the espresso is exactly perfect--if you've ever burned your lips on a Starbucks latte that's cooked to near-boiling, you will appreciate this alternative! And once they've met you, they'll greet you by name when you come in.  I mean, who does that?  And they like to talk to their patrons!  Lunch Geek (down the street on the opposite side, which they opened a few weeks ago) and Ma'velous are making the corner of Polk and Market seem like a neighborhood. And once Twitter moves in, this place will be even more famous.  They serve light food as well--exceptional cheese selection and delicious salume served with McEvoy Ranch olives (yum). This would be a great place to go for a bite and a drink before or after the Symphony or Opera.", 
    "review_date": "2010-11-18"
  }, 
  "bzCcQbknoZ7WQL5KB356Iw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Silent A.", 
    "review_text": "Very good coffee from some definite coffee snobs (in an okay way- but they do make a person feel guilty for adulterating the coffee with milk.) The prices reflect that they are expensive roasts of coffee, so it couldn't be an everyday thing for me. Similarly nice beer selection.", 
    "review_date": "2013-07-18"
  }, 
  "C-eN-HI_iI3yUwX0c-awZQ": {
    "user_rating": 4.0, 
    "user_location": "Downtown, Seattle, WA", 
    "user_name": "Yana Alexandra C.", 
    "review_text": "When people care about their ingredients, it shows.  The milk here is organic and very tasty.  Their choice of bean: superb.  Barista: friendly,  knowledgable, and willing to share the knowledge and his great personality.  You could taste the good vibes in his pour.  I recently had the same roast he used and it was just as delicious as it was in its home (Heart coffee). Nice to have a yummy cup of espresso served without a side of pretentiousness.", 
    "review_date": "2013-08-26"
  }, 
  "GrktSJ7Bv9t37gwDLIlAwg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "The wine list is pretty extensive. There is even a pretty good bottled beer selection, though nothing on tap. I don't even think the wine is on tap. Which is too bad. Though popularly known as a wine bar, I would highly recommend coming for coffee. They have rotating coffees from all over the world. Some third wave coffees from across the country like Chicago's Intelligensia, Oregon's 49th Parallel and Oregon's Stumptown are hard to find a region where we take full pride in our own artisan coffee makers (here's to you blue bottle, four barrel, ritual, de la paz, verve, ecco). They make it 6 different ways: individual v60 dripper, chemex dripper, aeropress, french press, espresso machine, siphon. Most of these methods you can easily do at home.  The downside is that there is no wi-fi and in a part of town that's not quite so pleasant, but I do think it's a great addition to this part of Market Streeet.", 
    "review_date": "2011-05-27"
  }, 
  "UK-nkxH4s9Vb08jdlJ8pKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Namrata J.", 
    "review_text": "Cozy place. Will definitely visit again.", 
    "review_date": "2015-01-22"
  }, 
  "_HVQorAvXWMwJ0cxwDp7Zg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna H.", 
    "review_text": "I only go with 3 stars for now because I've just had wine. No coffee, no food (yet). Still, I'm glad that Ma'velous is open. The stretch of Market where it's located needs some more businesses just like this to help bring it back.   My bf and I went in one quiet Tues evening for a glass of wine before getting dinner somewhere else. Since it operates mostly as a coffee bar (and it was a little early), we ordered wine at the counter like we would coffee, which felt a little strange here, even though I do the same thing at other places in the city. Maybe it's some operating kinks still being worked out.   The wines were really good though. I can't remember exactly what we had, but they were reasonably priced per glass. I'll be back soon to try the cheese and cracker plates too, and maybe coffee if I go earlier.", 
    "review_date": "2011-02-19"
  }, 
  "I465k_hnNR2M-sDNEwPcQA": {
    "user_rating": 5.0, 
    "user_location": "Ridgefield, WA", 
    "user_name": "Gary S.", 
    "review_text": "I think this is the best all around coffee bar in San Francisco even though the owner, Phillip Ma, doesn't roast what he serves. He just carries fresh beans from several of the best roasters around, and because he truly loves coffee, he's invested in great equipment and prepares those coffees as well or better than the roasters themselves. Case in point, Phillip prepared for me a better espresso shot of Stumptown Hairbender than they served me in one of their Seattle cafes. But here you also get to taste Stumptown blends and single origins back-to-back with Ecco, Intelligentsia, 49th Parallel and sometimes Tim Wendelboe. Some other paradoxes: this cafe is very pretty but it's modest in size in a so-so part of Market Street near the civic center. Phillip is modest, friendly, approachable, and one of the best baristas around. Located near MUNI and a couple blocks from BART. Oh, and it's a wine bar too. Probably equally as good as his coffee bar.", 
    "review_date": "2011-11-17"
  }, 
  "HKKJJEy2nynvyiVLOG1UqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ariel M.", 
    "review_text": "My go to place for coffee in Civic Center. I love that they offer the cortado (in between a macchiato and a latte), they refer to it as the 3oz espresso.   Both the coffee and milk are high quality and the people working there are always super nice.", 
    "review_date": "2013-05-31"
  }, 
  "dmOdiOGjczpaiAaCLUmuog": {
    "user_rating": 4.0, 
    "user_location": "Glendale, CA", 
    "user_name": "Anna N.", 
    "review_text": "Stumbled in here early in the morning while visiting SF &amp; trying to catch the Muni which was out of service...great! Nonetheless, I'm glad I got a chance to sit &amp; enjoy a nice cup of Stumptown coffee (had never tried it). Coffee aroma was nice &amp; smelled delicious. Cheapest cup is $3.  I've been to Intelligensia &amp; Demitasse in LA which are exactly like this place so I knew what to expect.", 
    "review_date": "2012-04-16"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "One of the only coffee shops below the 49th Parallel &amp; West of 7th Street where the proprietor is behind the coffee bar to craft your cup on the regular. This former turn of the century bar has welcoming 15-20 foot tin-laden ceilings, dim lighting, comfortable booths, and stools in front of the siphon bar, where Stumptown Coffee is served. Once it was considered an odd location but now I'm imagining many twitter employees seeing this as a prime spot across the street. I reroute my morning and nightly commute to stop here. I schedule meetings here because it's that much of a destination. It's Reason Number 11 to live in SF, just behind the burger at Nopa and in front of that view at California &amp; Mason.", 
    "review_date": "2013-03-11"
  }, 
  "95ViFXQELkF-r_vGbyXrsA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne Y.", 
    "review_text": "Ah dangit, and here I thought I had already hit all the good coffee places in SF.  WRONG, Jeanne, WRONG.  Missed this one.  The coffee is excellent, here.  You can't go wrong.  I love, love, love the decor (chic and classy, but slightly edgy-- ESP with the awesome Eddie Colla mural on the wall?!  I LOVE.)  Philip, the owner, is great-- definitely knows what he's talking about.  I highly recommend this place.  :)  Photos and such stuff here: <a href=\"/redir?url=http%3A%2F%2Fpineapplebread.wordpress.com%2F2012%2F02%2F12%2Fmavelous-coffee%2F&amp;s=fa96e649187ebc9b6a7b2b523de29907f07052309dfdca0a1daec694cd89f024\" rel=\"nofollow\" target=\"_blank\">pineapplebread.wordpress…</a>  Will definitely be back.", 
    "review_date": "2012-02-12"
  }, 
  "UPP1RCn3J4rtdmzVEMBoCw": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Ryan D.", 
    "review_text": "A great little space that deserves all five stars for their wide selection of alc for a very narrow estate in the heart of Market Street.   Books to read, comfortable seats to lounge in and a very warm sun-filled cafe at noon to sip a beer!", 
    "review_date": "2014-11-30"
  }, 
  "4DOFVu9HFx6T5MqCEZFKWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon P.", 
    "review_text": "This amazing little coffee shop came to the rescue when I was informed that it would take the Honda dealership 6 hours to work on my car! I sat at the bar area near the front of the cafe where there is a lot of light. The place is small, but has a very high ceiling so it still feels very open. I had two different types of pour over coffee and two types of espresso while I was there and all of them were delicious!   The baristas were very friendly and know their coffee! This is an awesome spot to come read by yourself and get some work done, or meet up with a friend or two. The option to get beer and wine is an extra perk of this place. How could you go wrong with awesome coffee AND great beer and wine??", 
    "review_date": "2014-11-26"
  }, 
  "yE7cm9Cyo7YZKrzcP-9wTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mele M.", 
    "review_text": "The owner was very nice and made us a good latte and espresso. Wish they didn't have the same morning pastries that so many coffee houses use. Hard to get to if you are driving. Great decor.", 
    "review_date": "2013-06-08"
  }, 
  "FRi4pcAyEj7xdWmj1PpQXA": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Zenobia R.", 
    "review_text": "Best iced, fresh brewed coffee I've had in a long time.  Neighborhood is kind of lame, but if you happen to be there, pop in.", 
    "review_date": "2012-10-10"
  }, 
  "sYAuw1PW8YsadyXou4oPIA": {
    "user_rating": 5.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Jan W.", 
    "review_text": "Went here last week after work! Great wine list. Cool guy behind the counter. A hipster chair just for reading. And in a neighborhood that's just looking for love. So nice to have an easy going spot to meet a friend.", 
    "review_date": "2013-09-07"
  }, 
  "QVbD5S-YxKhFCu1SQGd2-A": {
    "user_rating": 4.0, 
    "user_location": "San Marino, CA", 
    "user_name": "Eugene Z.", 
    "review_text": "Tried the kyoto cold brew, espresso, and the mocha.  - first time ever trying kyoto cold brew. I think the cold brew process was able to bring out certain notes in the coffee that I had not tasted before. My friend said it tasted a bit like tequila lol - the shot of espresso was STRONG. it'll put hair on your chest - mocha was a winner and possibly one of the best I've ever tasted. Rich, chocolatey, and totally worth the longer wait for this drink   sadly the drinks were a little pricier than I'm used to paying for coffee or I would have been a regular customer. Maybe I'll treat myself to a mocha the next time I'm up in the bay.", 
    "review_date": "2012-03-14"
  }, 
  "3O6AQoUkCUORDMA2Z30kBg": {
    "user_rating": 5.0, 
    "user_location": "Quincy, MA", 
    "user_name": "Andrey L.", 
    "review_text": "Espresso is perfect. Well balanced and has great aftertaste. I would say its one of the best espressos I've drank in my life", 
    "review_date": "2014-05-20"
  }, 
  "JRkVt9wg3Yf0-BYg_tXs1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacey K.", 
    "review_text": "YUM! Stopped in for a cup of coffee, stayed for a cupcake...  I love that this place goes beyond the usual corner store coffee shop.  Instead of going in each time and getting the same old  same old, I chat with the (usually) ladies and see what is new.  Yeah for a break in the routine!  Would love to give it five stars, but obviously have a few bugs to work out...supplying everything they have on their menu, getting up to speed on register, etc...  But, can't wait to go back to try the wine...", 
    "review_date": "2010-11-19"
  }, 
  "smKxbOJb9p2SrwSyOFHwvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Renata P.", 
    "review_text": "We're spoiled for choice when it comes to coffee on the west coast and this place lives up to that reputation. The coffee is excellent. I've even tried the \"Tasting menu\" which gives me three varieties of brews (espresso, drip, and a cappuccino). It really opened my eyes to how differently the brews can taste; never mind how wired I was the rest of the day. The tea is also excellent.  All of it is organic and free trade so the prices are more then you'd pay just about anywhere else for the same thing but knowing it's the good stuff helps ease the pain on the pocketbook.    The atmosphere is quaint and a nice break from the workday.  If you're local to the area, definitely check it out.", 
    "review_date": "2012-08-07"
  }, 
  "HAv257_IVJnQT0ZIL8Nn-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg G.", 
    "review_text": "OK so the the secret is out. This place has been here for a while and used to be quite calm. However, now with all the new business developments in the area, it has become packed. I can't blame them though. Great coffee from Stumptown (Portland), 49th Parellel (Vancouver), sometimes even Coffee Collective (Denmark) and a few others. Nothing really local to SF I admit but its good to have choices I think and their taste in coffee selection is terrific. Pastries are delicious too. I believe some are sourced from Starter Bakery in Oakland (or so says the boxes). The kouign amann that is here is terrific. It is simple, decidant and in the morning is a huge wake up of sugar and bliss. The place gets crowded in waves in the morning. I even alter my commute to avoid them. No WiFi but sf public WiFi is within reach. But who wants to camp out in such a great place with their eyes glued to a screen. If you come at night there is live music some nights and always \"fancy\" beer and wine (which you can order all day I seem to see).", 
    "review_date": "2014-07-26"
  }, 
  "g3-4LSFaRu_mDMFg6-SX5w": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Ari M.", 
    "review_text": "Had a great latte today on my first try.  Phillip is obviously serious about coffee -- will have to try some of his other techniques besides espresso (siphon, Chemex, etc.).  Absolutely beautiful decor -- definitely a great night hangout.  Great addition to the area -- still sketchy, but improving.", 
    "review_date": "2010-12-29"
  }, 
  "xfrRKuHXbvz7J_dShdsTHw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gev M.", 
    "review_text": "Wow.  Funky without being silly; cool without being austere. Really good and strong espresso.  Philip (owner) is super friendly and helpful. And take some beans home. It will be pricey but better than any pound of coffee you've ever bought!", 
    "review_date": "2011-08-22"
  }, 
  "9IF2ZMnkrZlvxCHcO0h1EQ": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Lee H.", 
    "review_text": "The TCHO mocha is like no other. Hands down the best mocha I've found in the city. At $6.00, it's not an everyday indulgence, but is always a treat when I do decide I need a splurge.", 
    "review_date": "2012-03-11"
  }, 
  "hx0lbwKHg8stt7-18uf26w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ania w.", 
    "review_text": "I really like this little place and even though for selfish reasons I would like to keep it a secret, I still feel they deserve that more people will find out about them. The place has a lot of personality, the decor is cool, the ceiling is amazing and the art on the wall makes you think. The tiny room in the back is super charming and perfect for an intimate conversation (you might even be able to still a kiss without anybody else aware of it). It is like being in your living room except there is somebody to serve you coffee or a glass of wine. I have only tried their wine and olives on 3 separate occasions and every time I had a lovely experience.  I hope this place will find its followers. It definitely deserves more attention and more business. Go and check it out!", 
    "review_date": "2011-03-26"
  }
}