{
  "3z445xqzdpEQWaCB1yXO6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linz H.", 
    "review_text": "My favorite neighborhood bar! They have a full bar, unlike most of the other bars in the area that serve only beer and wine.  Everyone that works here is beyond nice, Molly, Les, Summer take your pick..really a refreshing change in the SF bar scene.  And best of all they are huge supporters of the neighborhood, putting up new art installations on their walls every 6 weeks provided only by local artists!  And they support all the great local restaurants by allowing you to bring in your food (pizza from Little Star, lasagna from Herbivore, whatever) to eat while enjoying a tasty brew!  Cheers to Mini Bar!", 
    "review_date": "2009-07-04"
  }, 
  "cG5l8teICW5NRtRJ0GpMww": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Keith K.", 
    "review_text": "Dan TNT and I walk in late Christmas Eve. Patrons are loud and happy.  Molly the bartender is cucumber cool - her pouring and mixing are effortless despite the demanding crowd.  She gives us some cookies she made. We wait for Sunny.  Sunny comes. Then it's midnight.  We have to leave. Something about the law.", 
    "review_date": "2008-12-25"
  }, 
  "-NQXpKDDwHIK3y3bNR70EQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James G.", 
    "review_text": "I've now been to mini-bar a few times although I don't think it was open yet when I used to live 3 blocks from it.  It's a great place for happy hour (although I'm not sure of their happy hour specials) with a few friends but probably not the place for a large gathering since it is kind of small.  Sure there might be an incentive to reserve the back room but this seems more like a launch pad for a longer evening.  Meet for some drinks and then head out somewhere else along Divisadero for some grub or something.  The atmosphere in this place is real nice too.  They have art work up and some of it seems to be WIP (like the bottle caps and Muni passes next to the bathroom).  The can collage on the wall near the bar is super cool too.  Only backdraw is size so if it gets a little packed you might be waiting a few minutes for a drink.", 
    "review_date": "2009-07-11"
  }, 
  "ZjXXJvnnn91dW0RSGR4_rg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Al B.", 
    "review_text": "This is a great little bar in NoPa. I think it's the perfect place to meet a friend to chill, hang and qvetch!  Love it. Two thumbs up.", 
    "review_date": "2009-02-17"
  }, 
  "o1tPaXSIJMNC_4uPGX9lZg": {
    "user_rating": 4.0, 
    "user_location": "Albany, CA", 
    "user_name": "Monica M.", 
    "review_text": "Love Art Bars! Keep an eye out if your going to this place cause you might miss it, from the street it doesn't look like much, but go inside. Lots of variety in the local art from sculptures, paintings on the wall and canvas to skateboards. Art makes the atmosphere but as the name says it's pretty small. My favorite place to sit is in the far back, it has steps up and its a cozy setting, with a comfortable and seats, good for a small group to hang. Sometime it gets too packed and uncomfortable to drink wine when people are bumping into you if your standing. Its nice if you want to get dressed up or a special occasion and go out. Usually no cover charge, but we were there on New Years Eve it's expected everywhere, just arrived before 10 so it was free.", 
    "review_date": "2011-01-02"
  }, 
  "8Q0xnxT-KrvCl2pQF1qsFQ": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "omar b.", 
    "review_text": "after the disappointment that was previously hailed as one of the best fights of the century...(you go golden boy promotions!!!) it was necessary to find some real entertainment tonight in nopa.  the options discussed were- flybar, 821 and minibar.  all spaces are tight and not so great for a decompression forum amongst the 7 of us, we went with minibar cos it has more than just beer and soju.  the crowd was not so mixed, but everyone seemed pretty cool and i was immediately greeted by the cool tender chica that was already serving two other patrons.  lori, dan and chest were able to jump on the tight little booth area near the door as a party was leaving and we nestled in nicely tho once our other three compadres made it there, two of us were standing while the rest were chillaxin in comfort.  the sapphire tonics made were hella strong but still tasty.  we all roamed on topics from joy division to geto boys to the eventual return of grunge then to the whole rockband phenomenon...we all couldn't help but continually put all of our attention to the photography on the wall, supposedly from a past Playboy shooter...and thx again friend for making us all throw up in our mouth a lil by talking about the model being a tucked dood, not a woman..ewwww  i was just happy to be surrounded by my pals on a fine sf evening and to top it off i noticed The New(interpol) playing in the background..YEAHYAH!! sommer, one of the owners cruised by to chatty chat and pick up empties...again suuper-fly staff!", 
    "review_date": "2008-12-08"
  }, 
  "QQv2tPG5NfQJvQDoZO7ehA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Akemi O.", 
    "review_text": "Our neighborhood bar! !  Love the Mini Bar :) Always pretty mellow, not a lot of douchebaggery going on, nice bartenders,  just a great place to get a drink.", 
    "review_date": "2010-04-11"
  }, 
  "vTugBdYg34rX4KvGpzBrNA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sonya D.", 
    "review_text": "Just for the cute little couch/chairs/tables in the back. Love.", 
    "review_date": "2012-04-13"
  }, 
  "cx438ltALpLBDFp7U1kAIw": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "J Z.", 
    "review_text": "Ended up here again last night (i live like 1/2 a block away). I used to really like this bar. To start, the bar tender was a total B!@# last night. She was rude and slow. Reading over the other reviews, it seems like they have a consistent problem with shotty and or rude service. The drinks are very much over priced, $6 for a house wine, which wouldnt be so bad if they wheren't so extremely skimpy on the pours. Ive had heavier pours at wine tastings. This was shitty wine, get over yourselves.... Next they charged my girlfriend $3 for a water. Maybe that lemon was really expensive...  In summary, there's a plethora of bars on Divisadero that are bigger, cheaper, and have amazing service. Dont waste your time on this place...", 
    "review_date": "2009-11-11"
  }, 
  "SSD26yoDiBSSITalN3In7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy K.", 
    "review_text": "Mini Bar has the feel of a dive, but without the grunginess.  The space is optimized by counter and couch seating in addition to the bar.  The art adds a nice touch to the mostly gray interior.  The full bar and decent selection of beer make this bar a-ok.", 
    "review_date": "2010-07-02"
  }, 
  "-DBncPR7y4MeAyLVGmXAKQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie R.", 
    "review_text": "I recently went there with a bunch of friends on a pub crawl for my birthday &amp; we had an awesome time.  Great music, chill atmosphere, great drinks/prices &amp; friendly bartenders.  Love that I live so close &amp; it's across the street from Little Star (best pizza in the city).  Now, if we could just get some decent shopping on Divis.....", 
    "review_date": "2009-03-29"
  }, 
  "rZRCEAy-xv7TwDstUliTnA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deann M.", 
    "review_text": "In the 'hood. - yay Minimal seating - nay Normal peeps including a sprinkling of hipsters, burningman folks and just plain ol' neighborhood alchies (moi) - yay Full bar - yay Semi-slow service - nay *may speed up w/ more practice and time  Not my favorite yet...would rather go to The Page, but good addition to the local bar scene!", 
    "review_date": "2008-09-10"
  }, 
  "Qnenv3a6_jjKQi8ZZm7ObQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Subhash J.", 
    "review_text": "This is a great addition to the neighborhood. They have amazing selection of beer local as well as import. The drinks are good too. The bar tender will work with you just let her know what your choice of alcohol is and she will create something for you. .", 
    "review_date": "2011-05-17"
  }, 
  "rtl1e2FVr67mPulZFxrkbQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Nathan W.", 
    "review_text": "Only had the one experience here, but damn I wanna live in San Francisco. Racer 5 for $4, Anchor Steam is cheap and bountiful. The bar was comfy, despite being \"mini.\" The back room was better though, nice couches, felt like I was hanging with friends in a chill hipster pad. Friendly as hell bartenders, but I guess that is how you peeps roll up there. Mad respecting happening.", 
    "review_date": "2009-09-08"
  }, 
  "HcciAbTkNzkPjrA3uNrYnw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lee S.", 
    "review_text": "The bartender was rude and uncongenial. I am accustomed to standoffish goth servers but this chick was fucking whack.  I'm accepting of someone not appreciating my humor but this chick was basically a butt hole in terms of her service, despite my over-tipping. Her being a goth chick is okay but being a B word is not! I am the spender of money and we were not in her house, she was combative and jerkish. I would NEVER send my friends here and I would NEVER recommend Ty's place. Even though they get an extra pt for having Pliny.", 
    "review_date": "2014-11-25"
  }, 
  "HZOe14TfcZQRNBg8AC4NQg": {
    "user_rating": 5.0, 
    "user_location": "Washington Metro", 
    "user_name": "Christina R.", 
    "review_text": "This little warm bar is just fabulous! Not only did they allow us to bring our pooch Bob, but they gave us the back room for our little bday party gratis! And, get this, asked if we needed anything. What? I said. Yes, they asked if we needed plates or plastic ware. I could not believe my ears.   The bartenders are very warm and friendly and really down to earth. No pretension. All goodness and grey and warm and good. Just good.   This is the little bar that could.", 
    "review_date": "2008-12-09"
  }, 
  "fkf5X7EV3pijav8EtDUuHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikolas B.", 
    "review_text": "Reasonably priced drinks, not Castro-strong, but acceptable. ($5 sidecar) Music is not anything to write home about, but it didn't interfere with conversation. It was a bit crowded, but it's the price you pay for quality.", 
    "review_date": "2012-06-18"
  }, 
  "1IhUNzJOySkhPidE5BuxRA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mo S.", 
    "review_text": "We live in the neighborhood and stopped in recently to try this place.  We asked the bartender what he could make with mescal, and he gave us an annoyed look, said he didn't know and added \"well you gotta give me some direction man.\"  Alright. He ended up making a drink that tasted like an ashtray. I mean, I know mescal is smoky but this was disgusting.  I would have asked him to redo it but his horrible attitude and the long wait wasn't worth the bother, so we left having wasted our $15.", 
    "review_date": "2012-09-17"
  }, 
  "W5cwxNwGiZJd393PCDQEvA": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "George A.", 
    "review_text": "I think Mini Bar opened shortly before I moved to NOPA, and whenever I'm doing the bar scene on Divis I attempt to stop in here, but the place is always so crowded (I guess that means they're doing something right!).    Well, I had a friend in town this past weekend who insisted on drinking hard alcohol for her birthday, so we went this past Sunday.  Luckily, the place wasn't crowded and we were able to sit at a table.  I really like the loungy feel this place has &amp; it's a big plus that they serve (high quality) hard alcohol, unlike most places in the neighborhood.  I thought the drinks we had were decently priced ($7 for Makers &amp; De Serrano), especially considering they have virtually no competition from other bars and could probably charge a buck or two more per drink if they really wanted to.  I'm not sure how often the bouncer who was there on Sunday works the door, but he was great!  He was very friendly (he took several pictures for my friend's birthday) and even played a little harmonica for us.    Even though we were there on a Sunday and the place closed at midnight, I did notice that they stay open 'til 2 on Friday &amp; Saturday.  This should be a standard thing,  but I have noticed that some bars in this neighborhood close early on weekends, so this made me happy when I saw this.  I really liked this place, and I may even be willing to the brave the crowd to stop in for a drink or two in the future :)", 
    "review_date": "2010-02-16"
  }, 
  "ZqEW0hByiV8PtMvHS00OIw": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Quentin J.", 
    "review_text": "One of the few Divis bars that serve liquor (others being The Page, Wazemia, Madrone, and recently 821 Bar) -- an automatic one star boost -- Mini Bar is the quintessential neighborhood with a dash of scene. Art  of varying quality adorns the walls, changing over monthly (I think).   There's not much seating due to the long geometry of the bar. Booths line one side of the wall which make for good art viewing but you sit in a row with your friends which is bad for convo but great for a photo ops. Think A Clockwork Orange's Korova Milk Bar scene featuring Alex and droogs posting and staring. So maybe Mini Bar seating is better for photo ops than conversing. Tell your camera happy, FB posting peeps wassup!  If you're lucky enough to snag the back room, grab it. This smoking room sans smoking offers comfy, couches for intimate lounging and chatting.   A friend's had problems with a door man but I haven't and find the bar staff nice.   Prices are quite fair. Top shelf whiskey -- bulliet -- for $6. Quality drafts for $4. Mini Bar gives a sense of class at dive bar value. I like that. I like Mini Bar.", 
    "review_date": "2012-05-07"
  }, 
  "JzmJ6U20uJ9pZonwKGvMuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua W.", 
    "review_text": "On my second visit I noticed a few things that detracted from the experience here.  My Hendrick's and tonic was $8 and very weak, it's way too bright in here, it was really hot, and they were out of Damnation.  Still not a horrible place for a drink in the neighborhood, but I think it's still worth walking the 5 or 6 blocks south to the Page.", 
    "review_date": "2008-08-20"
  }, 
  "BdMDq5SXlDU07wxErRohTw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cath M.", 
    "review_text": "Wow this bar is really \"mini!\"   Sis and I went here after dinner at Bar Crudo. Place was packed from the street festival. I had to literally squeeze my way onto the bar to get our drinks. One plus = they serve Hanger One (the original) so I got my usual: OJ + Hanger One and sis had a Guiness. Total for our two drinks: $14! Yah I was shocked! In SF, $14 for two drinks - WOW!  We chatted with some Europeans (very intense discussion about Pottery Barn!) and once my bro-in-law arrived, we left.   Will probably stop by here again when we're out roaming this district.", 
    "review_date": "2010-03-05"
  }, 
  "9WzUerODzyYUkQO0u3Nyjg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy S.", 
    "review_text": "Small and cozy.  Dim and warming.  Not sure if it's my crowd.    $4 for a bottle of Hoegarden, which we thought would be draft.  Oh well, bad choice.  They had a bar dog running around, which I thought was weird, but I guess it's fun if you're a regular.    Disliked the fact that everyone was so close and every guy would touch you every time they walk by.  Can't say too much since I only stayed for about 15 minutes.", 
    "review_date": "2012-03-19"
  }, 
  "9fg9i7ke1NAGhf8W3e97VA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth m.", 
    "review_text": "The first time I tried to go there, it wasn't too crowded but I still waited and waited and WAITED without any service...so I walked out  ************************* On to the SECOND try- I waited it out, because I want to give all the spots in my hood a try. They didn't have anchor steam (or were out) and they didn't have stella....so I think I got a fat tire. The bartender poured it so quickly it was COVERED in three inches of foam...seriously?! SERIOUSLY?!  I walked thru and there was a chill little back area but this place was just too crowded (and yet pretty empty.) It mostly reminded me of walking through a crowded hallway at a house party.   Eventually we got a booth and got to enjoy some of the art on the wall, I never would've noticed it if I didn't have a seat. I'm glad I did, as I thought they had a very talented local artist.", 
    "review_date": "2008-12-03"
  }, 
  "OtajNsBfaqjUBIUDJqf3ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon C.", 
    "review_text": "I always hit this place up on my \"happy hour run\" after a long week of work.  This is a very positive, hip addition to the otherwise not-so-hip or positive Wester Addition.  First of all, I have met some of the owners and they are invested in revitalising the WA (and Divis. specifically) with things such as the \"Art Walk\" that occurs every month I believe.  Very cool.  Secondly, the bartenders here are friendly and helpful (as opposed to say the 500 club).  Third, the interior is artsy (local artists can hang pieces on the walls-like Gerrard L. did a few months back) and sophisticated.  Only bad thing about this place is that they don't carry red bull.  This drink is not solely consumed by tweeniboppers.", 
    "review_date": "2009-03-16"
  }, 
  "s6K6Ny0GfgRkia6app873g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyke J.", 
    "review_text": "I have only been once.  The 2nd night they were open.  Pretty full, but was able to get a seat at the bar.  I was with 3 girls and we were excited to have a full bar in the hood.  My house actually backs up to Mini Bar on Broderick.    Was very put off by the owner who kindly indroduced himself, served me a Kettle and soda for $6.  VERY COOL.  Then the 2nd drink was $7. OK.... The third he said $8, but he took $9 out of my 20.  Haven't been back.  That alone just ruined what would have been a great relationship.", 
    "review_date": "2008-09-03"
  }, 
  "YS8zwKmUfYVcu77IjW8mDQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M M.", 
    "review_text": "I send the husband here when I need him out of the house.  Sometimes I even join in.  Happy hour is a great deal.  I like their beer selections and that the specials are something they've tried and not just gotten a deal from their distributor.  Great ownership and a great addition to the block!", 
    "review_date": "2011-06-10"
  }, 
  "1me87I-cI8IcEe7CYLTiBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan N.", 
    "review_text": "I attended the \"soft\" opening and was very impressed.  I live in the neighborhood and met the owners. They are very committed to making this place welcoming to the neighborhood and supportive of emerging artists.   It's impressive what the owners have done with a narrow space - cool art, beautiful bar, a couple of lovely custom-designed booth seats, semi-private back room, attractive interior painting and lighting.  SOMMER is AWESOME.", 
    "review_date": "2008-08-16"
  }, 
  "ppkBNgjuAwNsoiddIt3mzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "chandra g.", 
    "review_text": "it certainly is Mini. The place bottle-necks easily but folks are pretty nice so it's rare you'll get rammed by a chrome bag or over-sized \"put a bird on it!\" tote.  I adore Molly, she is always very sweet always says hello and serves you quickly. Everyone that works there is very nice and laid back.   I do not recommend getting a Trumer if they are still serving them in the test tube-looking glasses. Because the bar is small and people gotta push past you they are a prime target for getting spilled.  Often there is really nice art there, if it's cheesy or awful it's usually because the owners are giving locals a break...and come on, in a town like SF, that's a really kind thing to do.", 
    "review_date": "2011-03-26"
  }, 
  "mjMN4kpfrcXuF3RKinMwxw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anthony P.", 
    "review_text": "This place was full when my party arrived. We had to stand the whole time, but it was okay because we were there for just 1 drink. We were hoppin around to other similar places in the area. They make a pretty good whiskey sour, not the best i've had but still enjoyed it.", 
    "review_date": "2013-05-02"
  }, 
  "_dYh1PTodhcZNo5cGvYq7Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "casey c.", 
    "review_text": "people seem to love this place, there is always a crowd outside, they must be doing something right. i like the name, but the interior design and vibe not so much. kinda sterile.....do not like the bar stools...i think they need traditional, chunky, vinyl bar stools to match the booths.... i am really fucking picky...but i may have a point.", 
    "review_date": "2009-01-22"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "Us Bar 821 regulars didn't take kindly to the idea of another bar opening up almost next door. We were standoffish, we were suspicious, we were downright talking shit. But then I moved away from the neighborhood and therefore no longer care :)  At a friend's insistence (persistent insistance, I might add), I finally made my way over to what is actually a not-so-mini bar. I mean the place is narrow but it's like a cave- it goes pretty far back. It may even be the same square footage as 821. The bar is attractive and they have a prosecco (which was interpreted as \"percocet\" when I ordered it...) that's actually pretty tasty. Unlike 821, these guys have real booze, which makes Mini a dangerous destination for me, especially on a school night.  Overall, it's a pretty cool space. The actual bar is a little small and seating in the front comfy booths can be hard to come by but there's also an upstairs space with couches and chairs. I was three sheets to the wind upon arrival, so I really can't give much more detail but I'll definitely be back.", 
    "review_date": "2008-09-25"
  }, 
  "S7xHRmKiTRoT2Ji8AeTq9Q": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Buttonwillow M.", 
    "review_text": "Great bartender - friendly and ready to make up a drink for you on the spot.  Nice neighborhood spot to hang out with your dog after a long walk.", 
    "review_date": "2012-04-22"
  }, 
  "0Chi_CzoTmkw1NvZg0sksg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer B.", 
    "review_text": "Hmm.  This place does not have miniature bottles of Jack Daniels that will set my hotel bill way over the limit.  False advertising.  Actually, I didn't find it all that minature in general.  The passage along the bar was narrow, I'll give it that.  The result being that people are forcibly friendly here, but I think they'd be anyway.  There's thousand+ dollar5X8 (inch!)* art on the wall, so you have to figure the clientele's just a little more classy than your run-o-the-mill place.  Even if it is pop design on wood paneling.  Bartender poured a great drink and served it with a smile.  Other patrons all seemed to be in a good mood.  Word around the bar is, this place is popular.  Or is that just the narrow passage?  My recently developed philosophy** about this place is: Pop in, it might be hoppin.  *OK, sort of \"mini\" **recently developed philosophies should rhyme whenever possible.", 
    "review_date": "2009-03-02"
  }, 
  "ePB3pBx7eE6ozJ3QHRTxtw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza P.", 
    "review_text": "I'm on a roll of comparative reviews today.. But that's what Yelp is about, right? It's about standing in front of two doors and picking the right one.  I LOVE Mini Bar! I've never had a bad drink, a bad night or a bad experience here!   It's very small, so it get crowded, however it's crowded with people I don't mind being around.   The bartenders are incredibly skilled. Every time I've been here, which has been quite a few times, I've asked for a drink in loose terms and let them make me something.. You know, \"I'd like something warming and Whiskey based, not too sweet, not too heavy on the Whiskey, maybe along the lines of a Blood and Sand, but different\".. and BAM! I'd get EXACTLY that and LOVE IT!  Also, it's dog friendly, and has a great little sofa filled lounge area in the back!  Can't go wrong here!", 
    "review_date": "2012-03-11"
  }, 
  "0NHFUcmVPIUTXn8hJzagNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "Right across the street from Little Starr. Can't beat that.  The place is small, but carries a neighborhood charm. Great place to meet with friends for a happy hour drink. No DJ just an IPOD. There is also great local art work inside. Laddies the bathrooms are really clean  Big ups to Joel and his lady on a great bar", 
    "review_date": "2008-09-09"
  }, 
  "Ow_oHwqaBBRuUAiNrL8rRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie S.", 
    "review_text": "Very Small, but delightfully decorated. Service good, prices great! and a neighborhood bar all in one. Once inside you forget your on Divisadero with the loud Muni going by every 20 minutes. Across the Street from Little Star Pizza which I love too!. Drop in for a few you will be back!", 
    "review_date": "2008-11-05"
  }, 
  "UKsBKla6IjgOeKe_UC5Dbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam X.", 
    "review_text": "I've been here a few times and its a great little bar. They support local artists who hang thier photos, paintings, drawings, etc on the walls, and have a good exchange of each over the months. Polly, one of the owners is super cool, and they keep drink prices down. Beers are $4 at all times, Wines around $5-8, and sparkling $6-8, and they have a full bar. I haven't been for happy hour, but am sure its lower. It'll hold about 40 people with about 15 seats at the bar and 2 booths plus standing room. There is also a slightly private room near the back that will hold around 10 people seated. Cool Spot.", 
    "review_date": "2009-01-11"
  }, 
  "HzIIEAdbEa5G_Hi6JpT7Bw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Rachael S.", 
    "review_text": "apparently, i really like this place. i seem to take everyone here...they make tasty drinks at relatively affordable prices and the space is nice and intimate. i just noticed the rear \"living room\" space this past weekend and will have to go back to sit on one of those comfy looking leather couches. my only reservations are that it is only open until 2am on fridays and saturdays (what the hell?) and that once when i came here on a wednesday they had the lights up and no music which i thought was kind of awkward...i'll still be back.", 
    "review_date": "2009-08-25"
  }, 
  "C9UNC57uR-AFQ1rZNYVruQ": {
    "user_rating": 1.0, 
    "user_location": "Portland, OR", 
    "user_name": "Vince D.", 
    "review_text": "My friends and I were in the mood for some festive drinks and asked the bartender if he had any coconut rum. Are we cheesy? Yes. Do we know it? Yes. He told us they didn't stock coconut rum because they were \"classier\" than that. I told him the Polo Lounge in the Beverly Hills Hotel stocked it and they were pretty classy, but he didn't like that. We decided on some Mai Tai's and he made sure to announce it nice and loud when they were ready so everyone at the bar could have a good laugh. Now THAT was classy. But hey, Mini Bartender, it looks like you won in the end. You made me pay for 3 shitty Mai Tai's and I only get to write a 1 Star Review of your business and give you no more money. Well played.", 
    "review_date": "2009-09-08"
  }, 
  "9QcB2t3uHgpgp2BGb1FRPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren K.", 
    "review_text": "Whenever my group of friends is sort of wavering or indecisive about where to go in the Panhandle/Lower Haight/Divisadero area, Mini Bar always ends up being our choice. It's got a lively, interesting mix of people, good drinks, and quick service. However, I wouldn't go here in a group of more than 4, as this place is just too small.   Mini bar is indeed mini. Finding a space to sit is usually out of the question, as there are only 2 or 3 small tables in the front, a cozy lounge area at the back, and about 8 seats at the bar. Even standing can be hazardous, as the place is so narrow there's basically nowhere to stand without sort of blocking traffic. But it is a bar, after all, so if this is a dealbreaker for you, you're going to have a hard time finding a good drink in this town.   This is one of the only bars (maybe even the only bar?) in the area that serves hard liquor, which probably explains why it's always crowded. It serves no food, so dogs are welcome and almost always present... my pup loves to snooze under the bar stools when we're here. Mini Bar's walls showcase work by local artists, the quality of which ranges from \"meh\" to \"wow.\"   Pros: hard liquor, good service local art, dog friendly Cons: tiny, loud", 
    "review_date": "2011-08-05"
  }, 
  "TdlUWr2Bc7XSpH9L2-FYbw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Martin M.", 
    "review_text": "A slight taste of Texas. Queso Mondays uh-huh. Lone star on ice yup. Great staff and cozy seats.", 
    "review_date": "2014-08-11"
  }, 
  "3UzVsIOwGAQr6wS6GXW_zw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clarissa P.", 
    "review_text": "I absolutely love that Mini Bar is right down the street from my house.  Although I'm not a regular (and I can tell that they definitely do have their regulars), the place is a gem to have in the neighborhood.  Initially self-advertised as \"the only full bar for awhile\", the bar is not limited to the beer/sake selection that Fly Bar, 821, and other bars in the area are limited to.  The service is awesome- the bartender lady (who Ialways seems to be working everytime I come through) is on point and very attentive to her patrons.    Several times, they've had a recession friendly drink special for people on a budget- the last one I can remember was a pabst and jameson shot (I think) for something like $5 - $8.  Great value, and definitely helps me convince my friends who are trying to watch their spending to grab a drink on a tuesday night.    Big plus:  You could get 4505 chicharonnes as a bar snack for $3.50.", 
    "review_date": "2011-03-01"
  }, 
  "gaW6IXETO1y2kKYuxeg3RA": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "BP J.", 
    "review_text": "I went into the Mini Bar on a recent trip to SF after checking with Yelp to find a good bar in the area.  Since it had four stars, my friends and I went inside to have a drink.  Wow, the Mini Bar is lame.  I have no idea why anyone would give this place four stars.    SF is an amazing city with a lot of incredible places to hang out at, I'm not sure why anyone would want to hang out at Mini Bar.  Lame drinks.  Lame service (yes you Mr. Bartender, you're a dick).  Lame vibe.  And what's up with all that bad art on the wall?   Do yourself a favor.  Skip this place.", 
    "review_date": "2009-09-10"
  }, 
  "CIyICwrEeEVCuuBUmaSdOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "HY L.", 
    "review_text": "Small hidden treasure.", 
    "review_date": "2010-06-07"
  }, 
  "o98O95NtBjGGcVVGIGAdCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roman N.", 
    "review_text": "Great drinks and some pretty damn good whiskey. Apparently they also have all sorts of gimlets, but I haven't tried 'em.", 
    "review_date": "2009-08-23"
  }, 
  "a3sSPkmxve_lB2G7ph233A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin Q.", 
    "review_text": "I've been here twice, both times on a Sunday evening. The first time, I kept falling asleep (probably because of the half marathon I ran that morning). They had really comfy couches in the front of the bar and the backroom of the bar. The second time, I was awake. The drinks are stiff and the bloody mary's are supposed to be great. I'll have to come back for a bloody. Great atmosphere and cool bartenders. I also like a bar that has coat-hooks under the bar top.", 
    "review_date": "2009-01-05"
  }, 
  "uTSGqJGFwngSLTSckILesw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kandace K.", 
    "review_text": "Minibar is an awesome space that truly is mini! Sommer, the owner, did an amazing job with the design. The artwork that is displayed is awesome and THERE'S A FULL BAR!!!!! There's only a couple places in Nopa that have a full bar so this is a very exciting thing.   The staff is nice and the prices are good. The little private room in the back is  perfect for a group of 6-8 people.", 
    "review_date": "2008-08-31"
  }, 
  "UY5h51GRFQcIzEg308ecOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "annie s.", 
    "review_text": "I went for the first time to check out the Noise Pop Retrospective Art opening to get my art on.  Instead I got my art broke then had an art attack.  And it was GREAT!  No seriously...this place is my new favorite art gallery with a full bar!   It's cute, friendly staff, good happy hour prices, drinkable wine.  Recommended for those having art openings plus it's right across the street from Little Star and they have a binder of menus from neighborhood restaurants so you can bring stuff in.    Good good!", 
    "review_date": "2009-02-15"
  }, 
  "TzVKEIW46exGDGAjc5amTA": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "N S.", 
    "review_text": "I had a great time here while waiting for my table at Little Star. Unlike most of the other places in San Francisco, I wasn't treated like shit, which was a nice change of pace. James hooked it up with a delicious variation on the Old Fashioned. I also got a taste of the homemade Bloody Mary mixes that I am looking forward to imbibing this upcoming weekend.  There is a little lounge area with couches that look like goooood sittin. I will enjoy it.   Go Mini Bar! Also, whoever \"Larry\" is (you know, the guy below me with 2 reviews and no friends)....yea, he is a douchebag.", 
    "review_date": "2009-01-22"
  }, 
  "C6qExAutKzFRAQJSmGY_Jg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna F.", 
    "review_text": "This place is great! we went there on a thursday night when they were doing an art show (i guess they do a new art installation approx every 6 weeks). apparently, whenever they do a new art show they have happy hour prices all night along with complimentary cheeses and chicken from the bbq place next door! what a deal!   also, the drinks are stiff and the service was friendly and prompt. it's a small place, but not in a bad way. there is a big(ish) back room with couches and chairs for extra seating.", 
    "review_date": "2008-11-18"
  }, 
  "q0HDybhT0V9dXrs63_WqWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa G.", 
    "review_text": "Great local bar. It wasn't too crowded and has a nice nook all the way in the back for intimacy. Definitely a great place to have a drink while you wait for a table at LSP, literally across the street. The bartender is pretty awesome, looks more biker-esque than anything else. Good guy. Walking a total of 2 blocks here from home makes it all the better!", 
    "review_date": "2009-12-25"
  }, 
  "GiaFNH4lKtvASKGn6Taymg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle M.", 
    "review_text": "This place is AMAZING.  The spicy bloodies are delicious and the fact that they serve magnolia beer makes me so happy.  The owners are also top notch!  I was also pleased with the amount of artwork on the walls.  I will be frequenting this place too much for my own good (or my liver's). . . but so be it!  I have been there quite a few times, most memorably for my birthday bash.  The bartenders were AWESOME and it was a blast to have such an awesome space filled with my nearest and dearest getting (mildly) sauced on a sunday.  This is hands down one of my favorite bars especially  during the daytime when I can get a seat!", 
    "review_date": "2009-09-30"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "I went to a small art show here. This is a solid little bar -- a little trendy/a little edgy.  It's dark and cutely appointed - gets very packed. The bartender IDed me and none of my other friends b/c he said I looked older, so I had to dock them a point. Don't know what else to say.", 
    "review_date": "2009-03-01"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "It's taken me too long to stop in here, given that it's now the closest bar to my house. (about .3 miles, according to Google Maps. I could walk that even if I've lost one of my shoes.) It took Nadja M. who now lives in New York flagging me down on the sidewalk to get me to finally try it. I am a terrible local.   But you know what Mini Bar's got? A full liquor license, cool bartenders (Drew knows his stuff, and has convinced me to give Rye whiskey a second chance), a nicely decorated space, and comfortable seating, and friendly regulars instead of smug aloof hipsters that some of the other neighborhood bars are still sporting.   Not at all like drinking alone in a hotel room, like you have to with most other mini bars. Except that you can't get away with refilling the gin and vodka bottles with tap water.", 
    "review_date": "2009-06-28"
  }, 
  "KKdBQXnUlVUZ0ZNTfMQoEA": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Tolga E.", 
    "review_text": "One of my favorite bars in the whole city. I tend to love small bars, and mini bar is pretty small. But at the same time, it's deceptively large. There's a \"front\" area, the bar itself and this crazy cozy secret back room that I've never actually been able to find a seat in .   Mini bar has been open for, I think, about 2 years now and they've stayed surprisingly true to their premise. A small bar, good friends, good neighbors, and a splash of local art over reasonably priced drinks. The bartenders are very friendly, at least one of them has a pretty awesome taste in music. The drinks are fairly strong but they won't knock ya over (unless you ask for it). They carry a decent amount of respectable beers. And they do push that gimlet on ya for some reason, but it ain't bad.   I really like that during the annual Noise Pop festival, they host the \"art of noisepop\" on the walls, which is a bunch of historic promotional posters and what not. Very cool. They also feature lots of great local photographers.  The only reason this bar doesn't get 5 stars is that, like any good thing in this town, it's ruined by the crowds. It's become near impossible to grab a seat here on the weekend, and even Thursday has become a challenge. Yes, I am blaming them for being popular...but lots of people goes against the whole \"mini\" concept. You can't meet new friends when the person next you already brought his 6 best ones with them. Oh well.", 
    "review_date": "2009-08-25"
  }, 
  "af6ayEH9BzsOPQRoxKNE0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney A.", 
    "review_text": "I loved this spot! Great neighborhood feel and just big enough. It's cozy and I was lucky enough to get a couch in the back \"lounge\" area and it was just intimate enough for a good conversation without being stuffy. I tend to come to bars with friends to catch up over a drink and hate the loud drone that accompanies many hot spots, minibar was the perfect in-between.  Decent drink selection, I had two G&amp;Ts for a whopping $5 each that left me stumbling home - not sure if I'm the lightest weight ever or what, but the pours seemed to be pretty generous.   I'll definitely be back here and pull up a chair and stay awhile - if I can get one.", 
    "review_date": "2012-08-08"
  }, 
  "RWJ9ycJUFxdezcquPV1WKg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Penelope D.", 
    "review_text": "The ambiance rates five stars, but the service and cocktails both get one from me.   If you end up at the Mini Bar, stick to drinking beer.    I first wandered in here because they were having a No-on-8 fundraiser.  Great vibe that night.  I wisely ordered a beer, which was fine.    The second night, I ordered a Manhattan.  The bartender (short tattoeed guy with dark-rimmed glasses) was a dick and made the worst Manhattan I've ever had.  He acted like I was interrupting him and his friends by trying to order a drink.  The manhattan tasted like Robitussin in an up-glass.  I think the bartender must've poured a full ounce of maraschino cherry syrup into my drink.  This was the sweetest, nastiest manhattan I've ever had.  Also, they put two cherries into the smallest up glass on Divisadero.  So most of what you're buying is fruit, not bourbon.    They do the same with their martinis.  Two olives in a real small glass.  If I want an olive plate, I'll order an olive plate.   If I want to drink, I'll go somewhere besides the Mini-Bar  If you need a cocktail on Divisadero, go to the Page or Madrone or Waziema.", 
    "review_date": "2008-12-24"
  }, 
  "ClSLy8CtYVCFrltbDhOf2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott B.", 
    "review_text": "Okay Russian River Brewery has a couple good beers.  There IPA is awesome and you can't mess with Pliny.  I would still like to see Mach 10 from Bear Republic though.", 
    "review_date": "2011-08-25"
  }, 
  "seiyj9OMwQohvzq4iu7B3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kamilla H.", 
    "review_text": "Love you guys! Awesome staff, perfect location, fun space!!!", 
    "review_date": "2012-09-09"
  }, 
  "3zyBvSsgLEWYsPpnFIxV2g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniella B.", 
    "review_text": "They stole my perfect idea of a place with awesome bartenders, nice seating areas, outstanding selections, champagne cocktails, incredible happy hour deals, vibrance, cozy, relaxing, fun...yes I give myself 5 stars!", 
    "review_date": "2008-11-18"
  }, 
  "uOP5d3lhIQP1S4uG5UFXAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan M.", 
    "review_text": "Nice neighborhood bar. Good drink specials daily. I went tonight, and while it started slow (at 5PM) it picked up nicely by 7PM. They had Pliney the Elder bottles (16 oz) for $4 a pop - good deal. The well drinks and beers were also a buck off during happy hour.  The crowd started mellow, locals, but grew nicely. I ended up chatting up the girl next to me that was from the same tiny town as me, and had a good time. Overall, this place is very nice.  Summer, the bartender, is extremely sociable and makes a good drink. Reason enough to come for a few. And the close proximity to the Independent makes it nice.", 
    "review_date": "2010-02-16"
  }, 
  "aN3bpfDLsMjQloJ_4-P13Q": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jenn W.", 
    "review_text": "Hmm. I'm gifting Mini Bar three stars since there wasn't really anything wrong per se, I just wasn't feeling it.   Walking in at around 5pm, I was first surprised by the crowd, and then the dogs. Not until after we sat at one of the narrow, uncomfortable, side bars was it pointed out to me that I was the only female in the place. Not that I mind, just odd, a bar full of boys and dogs. The art on the walls, while not very good overall, felt out of place, what with all the animals running around sniffing at each other.   Drinks - they had a Tuesday special of Russian River Pliny-The-Elder bottles for $4 which were quite nice, not sure why the bartender felt the need to let us know that NOPA sells it for $9 though. Happy hour is $1 off wine, but my prosecco was a stingier pour than I am used to.   Overall, not my scene, won't be back. Probably a great bet if you feel the need to imbibe while walking the dog though.", 
    "review_date": "2010-01-12"
  }, 
  "_2wjJmrOZ-e0R5EyBs7E4g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rachel T.", 
    "review_text": "Hands down my favorite bar in San Francisco. I did just move here so I haven't seen much, but the other week I went in and it was their 4th anniversary. They had free drinks and food and it was incredible. I got pretty lucky walking in there that day! Their bartenders are always super sweet and the drinks are pretty reasonably priced. My favorite part is that they allow dogs inside. (I assume only when its not too crowded?) Even when the place is packed I love coming here for the atmosphere. Lots of great art to look at and great beers on tap!", 
    "review_date": "2012-08-24"
  }, 
  "aUDszhAv0HPQmd6e-9qmjg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emille L.", 
    "review_text": "Cool spot! Friendly and funny bartender, down to earth patrons, dogs wondering about (yes, more than one), and a back room that's perfect for groups, if you can snag it.  Good after-work happy hour hang out, and it has a full bar unlike most other spots in the area.  Winning!", 
    "review_date": "2011-11-05"
  }, 
  "Zks_5om5SyYuFi2NmPUEUA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mattew W.", 
    "review_text": "love this place. it has all the potential to be  tool shed of bars but its not. the crowd and vibe is cool i dig the art and they serve me booze. what more could i want.", 
    "review_date": "2010-01-24"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "Ugh, I promised some folks who live in the neighborhood that I'd give Mini Bar another chance, so I checked it out for a bit on a relatively busy Saturday night.   I was able to get the bartender's attention pretty quickly, and he was actually pretty cool; I ordered a Kettle One &amp; Soda for my friend and a Hendrick's Martini (up with 2 olives) for myself. I guess he had to run an errand because he then stepped out of the bar and another person made my martini. Again, she was nice enough, but at nearly $8 per drink, I was expecting a perfectly made cocktail. Instead I got a version that was at once too dirty and too sweet. Maybe I'm used to drinking at Absinthe or NOPA, but to me a martini is that classic that just has to be done right.   If you do go, try and go early and get the front booth, seems like a good spot to enjoy a few drinks with friends.", 
    "review_date": "2009-03-30"
  }, 
  "D-rKFBb1s4_4vpDA9Wjiog": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "Has hard alcohol, usually not over crowded.  Kinda chill.", 
    "review_date": "2010-08-03"
  }, 
  "Wnl-KH8ocIpnPbluM7mRkQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Briya S.", 
    "review_text": "Great ambiance, friendly staff, interesting art and a new signature drink thanks to moi. (Drew - call the drink \"Briya\".  I will be back even though I don't live in SF anymore.  B", 
    "review_date": "2009-02-24"
  }, 
  "8HWLNGn4jxEh9NeK6GRk1g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie M.", 
    "review_text": "Want to like this place. But we've been 3 times and that will be our last. Overall, it's hard to feel comfortable (though the back room is nice), it's loud, and the staff can be a mixed bag. It's not awful but there's nothing special. The kicker was during beer week when they were serving Pliny the Younger. They had run out but continued to serve flights - that's fine but instead of letting me know they were out of the Younger when I ordered, the bartender just served me four glasses instead of five. So then I had to ask where the fifth glass was and received in return, literally, a snort, an eye roll, and a terse \"We're out.\" Gee thanks, sorry I bothered you.", 
    "review_date": "2011-02-19"
  }, 
  "gu4yh8oORJrDTPoWK0Zy8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yeeman N.", 
    "review_text": "Part bar, part lounge, part art gallery. Tiny. Great crowds. Awesome bartenders. Home made Bloody Mary mix. Dogs Allowed.  What's not to love?", 
    "review_date": "2011-10-12"
  }, 
  "-IrubD2dfyl0CoQ_Y334yA": {
    "user_rating": 3.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Kathryn M.", 
    "review_text": "This is mostly a review, but I can't help but start with a rant.  And that is regarding the over use of the term \"hipster\", which a couple people have referred to Mini Bar as and I feel like has become the defacto description for things contemporary, urban, artistic or just beyond someones experience.    Mini Bar appeared to me to be rather cozy, though the decor is contempo-loungey and showcases a collection of art by different rotations of artists (unfortunately they chose to display the worst paintings on the only wall you can see if you're sitting down).  They don't have a cocktail list, which seemed odd (they're all about the cocktail), but the service was efficient and when we got a seat it was primo and looked out onto the street.  I would go here again when I'm next in the neighborhood and know exactly what I want to drink.", 
    "review_date": "2009-09-28"
  }, 
  "ojur8znWZhIDlfQmdPTj8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy W.", 
    "review_text": "Great little bar with strong drinks!", 
    "review_date": "2011-12-03"
  }, 
  "CorMvaqZtz4O-Pr4QVSc3w": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Tee Jay R.", 
    "review_text": "Not much of a barfly, but I *love* this place.  It has been my \"local\" since I moved to the neighborhood and so far only Mojo comes close to rivaling it.  Cozy, chill, unpretentious, lovely mixed crowd (i.e., no discernable \"scene\"), friendly bartenders, small but solid selection of beers (including Racer  5 and a seasonal from Magnolia) and they let you bring delicious Little Star pizzas (or any other local takeaway) in from right across the street.  I'd feel comfortable bringing anyone here, from die-hard hipsters to Marina dwellers.  Sometimes the art is great (I've even thought about buying the occasional piece) and it's always at least decent.  As others have noted, our little neighborhood straddling Lower Haight, USF/Panhandle and the Western Addy is gentrifying and it isn't clear what the ensuing results will be, but regardless I hope this place remains the gem that it is.", 
    "review_date": "2010-05-16"
  }, 
  "8Sumi5Vt1njZTaYlA8wGSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kamila A.", 
    "review_text": "This place is small and dark, but in a good way. The back room is very cozy. So cozy, in fact, that I may or may not have fallen asleep there one night. Anyway...the drinks are affordable, and it's located in a great neighborhood. I'll definitely see you again, little guy.", 
    "review_date": "2013-03-20"
  }, 
  "3UtTalOKNJ2Iz5CHoLdA0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosanne L.", 
    "review_text": "Bar 821 was closed on a Tuesday evening for some odd reason, so my coworkers and I went to Mini Bar SF. It was only 5:30pm so the crowd was small and gathered around the bar. My first impression was how clean everything was with plenty of seats. The bar is super chill with 3 big ol' dogs just chilling by their owners. I think I was distracted by the dogs more than anything else.  Good thing about this bar is they allow outside foods. We bought two pizzas from Little Star Pizza right across the street and munched away.  Great selection of beer along with Pliny the Elder and Damnation on tap. My boyfriend would love this place! Not many people sell Russian River Beers on tap or at all...  I'm still dying to try Bar 821, but if you just want a place to chitchat and eat, this is place is great. Oh, and bring your doggy ;]", 
    "review_date": "2011-06-01"
  }, 
  "TWMn0oA1G00m1gDNOHMTOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah L.", 
    "review_text": "I dig this cute little place. It's a great local hangout spot, especially on weekdays. They have good daily specials and friendly bartenders that actually remember your previous drink orders. Of all the handful of times I've been there, I've had a great time....But maybe it's because there is some good eye candy there. As a straight lady, I was flabbergasted to find a place that actually had straight, single men....Shhhh, don't tell anyone.", 
    "review_date": "2010-10-04"
  }, 
  "JoZ4eQqs__OU_Xiky_vG0w": {
    "user_rating": 2.0, 
    "user_location": "Orange, CA", 
    "user_name": "Nikki P.", 
    "review_text": "The name says it all. This is a MINI bar! This place is so small!! The bar was dead on a Saturday. We got there about 1:15am but usually places are still packed. This place was like a ghost town. People were sitting there looking somber. The music was turned way down low (actually I'm not even sure if I heard any music playing). It was pretty lame and just was not where I wanted to be at all. Not sure how this place stays in business.", 
    "review_date": "2013-09-28"
  }, 
  "U7ykMsZbSv1heetIuFgONw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordana C.", 
    "review_text": "Great neighborhood bar.  They serve Pliny the Elder, which is one of my favorite beers.   cool space, a bit divey, fun, nice vibe, good date spot.", 
    "review_date": "2012-07-02"
  }, 
  "hCyGy0XVGF--OsoTP522ZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mi M.", 
    "review_text": "I've had mixed experiences here. Sometimes it's nice and chill - I've had some great conversations in the back area with other folks - but sometimes it's full of douche-bags trying to be trendy in da citay.   Mixed drinks are mixed - sometimes perfect, sometimes not, so I stick with either vodka and tonic, wine or beer. Can't screw that up. Bartenders friendly - I think they are all co-owners - the lady with the curly hair is especially good.   I like the art. Sometimes it's disturbing, sometimes it's cool, sometimes it's a kind of \"I could do that!\" type. But it's rotating and that's cool.   So, try it out. If you are put off by the crowd, try again another day. That's what I say...", 
    "review_date": "2011-03-25"
  }, 
  "vxfWyMrAvqvJRIoL0naCIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie W.", 
    "review_text": "100% pure awesome.    Great booze.  Great bartenders.  Great space.  Great art.    SF needs more classy-ass, yet low-key places like this one!", 
    "review_date": "2009-02-25"
  }, 
  "yEzkG-SwFI5B4JsDkVeuFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber I.", 
    "review_text": "I go out here every once and a while. As a local its a good place to hide out from the crowds on Divisdero. Good drinks, small place, cool little room in the back. If your swift like me you can grab some seats on the couches and it's really nice.", 
    "review_date": "2012-06-12"
  }, 
  "5Tc0YXgYDvTTlps0e8xTNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jill D.", 
    "review_text": "I kind of like this place! When Girl's Night found us here I wasn't upset. We all grabbed our respective beverages and they didn't cost us much either. Comfortable seating and some cute little areas that make it easy to hear conversation are easily found. The bathroom is super cute and very clean and I never had to wait in line the 3 times I used it. I'd go back and if I lived in this 'hood I'd be a regular for sure!", 
    "review_date": "2008-10-11"
  }, 
  "CF9Xxwhn33S6lNNHZtbY1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sumi Y.", 
    "review_text": "The place is narrow and doesn't have enough seating, but they have a hard to find whiskey: St. George. It's fine, fragrant &amp; delicious ... perfect for when I'm feeling like a lady!", 
    "review_date": "2008-09-03"
  }, 
  "-akUbNjW7KlixhIgZOAu8Q": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "ahsal a.", 
    "review_text": "It's okay.   And for your information anything from Haight to California  and Masonic to Octavia was the Fillmore or the MO for short  before all of the new comers decided the neighborhood needed to be unidentified with the former residents, got it.  And NOPA is the most ridiculous name of late.", 
    "review_date": "2011-08-14"
  }, 
  "NwZ8ohk7-IKL7IDbrksNow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriel F.", 
    "review_text": "This place frakin' rules and anyone who says otherwise is a damn liar!", 
    "review_date": "2010-08-28"
  }, 
  "xtZMctl7AQNspIL_SF3guA": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Chris B.", 
    "review_text": "Cool space, laid-back atmosphere. Another great spot for the Divis corridor that seems to spit out these great bars like a factory. Came here with a few friends on a Friday night while waiting for a table at Little Star, and definitely glad we did. Didn't order from the cocktail list, but from what I could tell, they make some tasty ones. Small but good beer from the tap list, and a decent wine list as well. I could see it being a great spot to catch up with friends, like I was doing, or taking a date here after Nopa or Tsunami. It definitely would have been on my short list back in the day when I was courting my wife in the neighborhood.", 
    "review_date": "2008-11-08"
  }, 
  "mcZMD9N1MSUqPh2emfROKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason G.", 
    "review_text": "Mini bar is a great neighborhood bar. Cool crowd. Dogs abound. And they serve booze, not just beer and wine like most other places in the neighborhood. Les is one of the best bartenders in SF. Just like Jon, Molly, Scott, James, Star, and Summer. And though I read a review about someone complaining about getting guff for ordering a bloody on a Sunday evening, go home and make it yourself... ordering a bloody in a busy bar after 5 is an amateur move (especially if the bartender lets you know after a few rounds, it's a hard f*cking job). Appreciate your bartenders! Go back to the marina, and better yet, stay there...", 
    "review_date": "2010-08-20"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "i don't do bars in my hood, but stopped in early saturday night and the bartender named drew was cool.  it was early in the evening but it's probably the best bar on divisadero street.", 
    "review_date": "2009-10-18"
  }, 
  "DB5mItq8csnRAMkdCEgTow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jane d.", 
    "review_text": "With $2 draft beers a plenty, it can be a mini-feat to find a Jack and Diet or a Vodka soda.  Minibar can give me what I want since it is one of the few establishments on Divisadero with hard alcohol.", 
    "review_date": "2010-09-22"
  }, 
  "bG6DkJKwhKMMQ0Z3GSOpmA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete J.", 
    "review_text": "Well, I started writing a review for Mini Bar three weeks ago after my first drop in for a whiskey post birthday dinner with roommates past &amp; present. I stopped a few sentences in &amp; haven't come back to it until now. Why is this important? Because I've been back to Mini Bar THREE times since. It's effectively around the corner from my old house, serves liquor (lord knows I love my whiskey), &amp; the environment is cozy &amp; unpretentious. Additionally, they've got some killer art on the walls from neighborhood artists, the owners are incredibly nice people who have lived in the 'hood for more than a decade &amp; can often be found mingling with the clientele. The list goes on &amp; on &amp; on.  A Welcome Addition to the Western Addition.", 
    "review_date": "2008-09-25"
  }, 
  "gfjgoJ_ERWzp8JbmlYo_bA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connor Skye R.", 
    "review_text": "Good prices, well-made drinks, a back room lounge with often-bizzarre art and comfy couches, and board games! (If that's your thing. I recommend Cards Against Humanity.) I think I love Mini Bar a little more every time I visit.  This place has the mellow, laid-back neighborhood-y feel that I really appreciate in a bar. Fantastic place for a date, catching up with friends, even reading a book. It's fast becoming my base of operations when doing anything on or around Divisadero.", 
    "review_date": "2013-01-21"
  }, 
  "U8-ywcU6og0jrcf2uTIXdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie T.", 
    "review_text": "Love this place. It's a pretty chill little bar, at least when I come, but it can get busy.  Because of my schedule, I come mostly on Saturday afternoons and usually a bartender named Annie is there. She makes an awesome martini (dangerously good really), is super friendly and quick with the drinks, even when it's busy. Love an efficient bartender and she obviously knows what the hell she is doing. The art they feature is great and the dogs are fun too - as are the regulars.", 
    "review_date": "2011-10-26"
  }, 
  "0hlsFkkaHdoXd9fW197EvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David A R.", 
    "review_text": "Genevieve is a great barkeep and the place is the perfect local bar. It's dark, but not too dark. They play good music which fills the room but isn't too loud. It's a great little bar but tables to spread out onto. Happy hour till 7p is $5 well drinks, $2.50 tecate and if you're lucky they might even give you some chips and Quesa.", 
    "review_date": "2015-01-12"
  }, 
  "rUktcQgb1_fnBjwdsbKjHw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay C.", 
    "review_text": "I paid 11 dollars for a Glenlivet 12 on the rocks here. I've paid more, but let me tell you why this sucks so bad.   It is cramped, there is nowhere to be comfortably out of the way (except the back room, but we looked in there and there were 2-3 dogs running around so we said fuck that) and you're always getting bumped squeezed passed. Somebody said in their review that it is a crime that the bartenders have double the room of the patrons, that is totally true.  The crowd is pretty much uniformly young and hip, lots of plaid, thick glasses and hip jackets in this place. It makes it worse that you can't ignore people you would like to because its so small. I'm not saying I walk into a bar thinking \"I don't want to see these people\" but when there are people way far ahead on the drunk level and you can't keep your distance it sucks.   There are comically small tables to sit at. Seriously. I don't think my laptop would fit on one. The only good thing I can say is that I enjoyed 2 of the art pieces on the wall.   So anyway, I paid double what I pay most places for a simple drink on the rocks and went up to the bar to ask if this was correct. I was thinking that I might have gotten the 18 years bottle instead, which is understandably pricier. I will never know because I was ignored completely and eventually gave up.   Not great. Over hip, over priced, too small. Two stars.  *****EDIT*****: Contacted by manager, offered a refund for the confusion and a free drink.", 
    "review_date": "2010-08-07"
  }, 
  "URHf5mueYVR0vGuVPr1oUQ": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Sarah M.", 
    "review_text": "If this bar were in my neighborhood I would be in there way too much.  Really cute space, and the drinks were amazing as well.  I had the spicy bloody Mary, and I loved the fresh cucumber in the tomato juice.  It was like gazpacho with spicy vodka, yum!  My friend and I went on Halloween night, so it wasn't very busy, don't know how it is on a normal night.  Love the rotating art!", 
    "review_date": "2009-01-10"
  }, 
  "VXQCx1qlRy8g24s8uuGjIg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric D.", 
    "review_text": "Probably not the most fair review grounds, but this lowly one star is meant to be strictly negative to the JERK bouncer working on Thursday Sept. 4th who was a total dick to my friends and I as we were trying to come in. Shaved short hair, tan skin...yeah YOU, guy. Not even a busy night either and you had to push everything and just flex your power.   Think about the clientele who comes to this place vs. the rest of the neighborhood. Hipster, young, slightly caucasian possibly, riding stupid fixies...not the THUGGERY in the 'hood that surrounds it. So, don't pretend to be too much of a thug yourself and front on us \"make love not gang fights\" types. We don't need it.   If you can get PAST the door to have a good experience here, I think it's possible. Seems like a nice joint and I want to give it a shot. But this is my review for now.", 
    "review_date": "2008-09-06"
  }, 
  "jsH32P47ZU1K4cLkWjL1JA": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "scott c.", 
    "review_text": "local art was in my opinion very good. the floor needed to be painted.aside from that the drinks were good. first time i had a whiskey sour made from scratch in a long time. the bar snacks were worth paying for. definitely will be back.", 
    "review_date": "2014-10-17"
  }, 
  "h8fL8j2VgqDTLcqvh3HRhg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin M.", 
    "review_text": "A local gem of a drinking establishment.  Awesome art, comfy couches, sweet staff, sociable regulars, and strong drinks.  I fell \"in like\" with my now boyfriend there and I think his allure may have been half this bar's fault.  Do it!", 
    "review_date": "2012-04-18"
  }, 
  "YiwC9uu9RUKqCaeTueNW7w": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "ella j.", 
    "review_text": "Five stars for my first time here on a Wednesday night.  My friend and I sat ourselves at the bar.  Very small bar but full liquor license!  Friendly and very knowledgeable bartender who really schooled me on Scotch.  Not sure how it is on the weekends...  Sardine-style packed bars are not my fave, and this one would fill up fast.  But I will definitely be back for a mid week night cap!  Oh, and good artwork on the walls.  Big bonus.", 
    "review_date": "2008-10-24"
  }, 
  "sufkjANL62wXkSDH8gO0og": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin H.", 
    "review_text": "Met up with friends to celebrate a birthday here last night.  Great atmosphere, cool art on the walls, and a kicking Monday drink special-$3 for a 16oz bottle of tasty German lager.  When the 16oz bottles ran out, the bartender gave us 12 oz bottles for $2, which, after we did the math, turned out to be an even better deal!    Speaking of the bartenders, it was the second time I'd been to Mini Bar, and both times I was utterly charmed by the staff.  They like, talk to you like you're a real person and stuff, like you've been their friend all along and only just discovered it for yourself upon wandering into their bar.    Nice bartenders, WTF?  Oh, wait, I'm not in the Mission!  THAT explains it!", 
    "review_date": "2009-03-17"
  }, 
  "BBSYyLG824fZjP-kulhLgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dessa R.", 
    "review_text": "Soooo....I was driving by one night and almost crashed trying to do a triple-take on what new bar had popped up on Divisadero next to Bar 821! I pulled a u-turn and had to run in!  It's very cute, cozy, intimate and plain cool. This place has been open for 2 weeks the owner tells me-I sat at the bar and the bartender made me an awesome raspberry lemondrop-one of my favorite cocktails. THe atmosphere here is very friendly-I didn't dive too much into the signature cocktails, but the drink I had was perfect enough. Bathrooms are CLEAN  (Whooo-hooo!!)  The art on the wall is cool and I love the lil \"champagne\" room in the back ha! I would definitely come back here-I always appreciate new spots-never a dull day in SF ;)", 
    "review_date": "2008-08-30"
  }, 
  "rPZI7WpI3jxy_48NHOXSdw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas L.", 
    "review_text": "I had a very bad moment in that place. Unfriendly service, the place was okay but the drinks not that good. I don't recommend.", 
    "review_date": "2014-04-06"
  }, 
  "YfjXtgtCjPxQGoFs8Vr__g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Timur A.", 
    "review_text": "Wander in, seemed like an interesting place to check out. Quickly realized that the fact that the bartender makes eye contact with you has no bearing on the fact that you'll be ignored, repeatedly for whoever shows up after.  If you're the person that gets served ahead of everyone else, it's a cool place, otherwise figure out how to get cozy with the bartender before going there.", 
    "review_date": "2012-07-28"
  }, 
  "34zf-H6-nMAdUcr0MocI0Q": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Joe G.", 
    "review_text": "Who designed this place? There is no safe spot in this bar where someone will not bump into you. I constantly hear \"excuse me\" because the genius architect behind Mini Bar decides to give the lone bartender 500 square feet of legroom and none to their clientele. Sure there's art on the wall, but this is a BAR! It takes me 15 minutes every time to get my beer and the single bathroom is tucked away in the most inconvenient spot of the room. No thanks.", 
    "review_date": "2010-01-24"
  }, 
  "Z80uMWgPOW2QH0nIGc12pw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarina U.", 
    "review_text": "Aside from having some awesome bartenders... Mini is located in one of the greatest neighborhoods of SF.  Come in here to get a relaxing drink (if you can find a seat on the more busy days...) and view the local art that is on display regularly. Definitely a cozy neighborhood chill spot. Not to be placed in the same category as Page Bar on Divisadero which is more of a pool table, beer guzzling, jukebox hang out.", 
    "review_date": "2010-12-09"
  }, 
  "5Vil6zBbs4Q3Wj0uO1gqFA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joe L.", 
    "review_text": "Small bar with good prices. I would go back.", 
    "review_date": "2012-11-22"
  }, 
  "pQMbjcDfr7A1aKtU_ls00w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer M.", 
    "review_text": "The size certainly lives up to the name. Minibar is narrow in width but huge in charm and atmosphere.  I ordered my glass of wine, walked straight to the back and nestled into a comfy couch with great company.  I only wish they had speakers in the back room.  hint: if little star across the street is packed and you're craving their cornmeal pizza...you can get take out and enjoy it at minibar.", 
    "review_date": "2008-12-08"
  }, 
  "OUCG504rlcCJSMMkSOBHuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "doe a.", 
    "review_text": "2 things I love about you: 1. That keg of Mas wine, and  2. The little back room.   Gets a little busy on weekends but the bar tenders are cool and it has a nice vibe.", 
    "review_date": "2010-08-04"
  }, 
  "qdMoCgotoT7UAkNBhQAd0A": {
    "user_rating": 4.0, 
    "user_location": "Shreveport, LA", 
    "user_name": "wes p.", 
    "review_text": "My new favorite neighborhood bar!  It's cozy, friendly and hip all at the same time.   Plus the bartenders are cheerful, knowledgeable and enjoy experimenting.  Bartender: What'll you have? Me: I dunno. Something with whiskey. Bartender: Ok. Anything you don't like? Me: Cherry. Blech. Nothing too sweet. Bartender: Don't worry, I'd never do that to you.    I felt so safe and cared for! :)  A nice feeling, at a bar.  Moments later he presented me with a lovely little concoction that I didn't even know I'd wanted.   Other perks: Cool, local art.  Reasonable prices.  Friendly locals.  Plush booths.  Sparkling mirrored bar.", 
    "review_date": "2009-02-09"
  }, 
  "sRVGewx--HgwwlKwAfCO9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz S.", 
    "review_text": "Who can resist the lure of the Mini Bar? All of those pretty bottles...funny snacks...  Not me.  This is my favorite new bar in the city.  We've been a couple of times and it has just the right vibe:  unpretentious, neighborhood-y, various choices of seating arrangements, local art.  Excellent Women's restroom.    This is a long bar, so you have to keep your body to one side and keep the pathway in mind.  Do this, and you can park yourself indefinitely for a fun and fairly chill evening.  Even when full, you can still hear your companions.  Key.  The location is right across the street from Little Star Pizza (mmmm), and unlike Bar 821 which I do like, it is a full, hard alcohol-laden, bar.  If you need this, you know who you are, and will be as happy as we were to have this option in this neighborhood.  Something for everyone, and a good beer selection which I always appreciate.  Now, don't you all go crowding this bar up as I intend to patronize it frequently and don't want to have to fight for space, but feel free to visit when you are in the neighborhood.", 
    "review_date": "2009-01-10"
  }, 
  "JYxt5_1tAoIVHYRZ2PkKcw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben M.", 
    "review_text": "Mini Bar is totally under the radar in a busy flourishing neighborhood. The gentrification of the Divisadero corridor has left the established bars alone for the most part.   When you walk in to Mini Bar you get a funky cross section of the people in the hood. Some older, some younger but really just never know. The last time we went in the bar tender was making Paloma (grapefruit ,salt, lime juice, sugar, club soda and tequila) for someone else and it looked great. I see people complaining about the drinks not being good and this being a dive bar. It's all true to some degree. They have only a few beers on tab but the beers they have are good.  It's a dive of a bar and its perfect. The bartender knows how to make good drinks, there is usually not a huge crowd and the music isn't too loud. You could have a nice conversation, a couple drinks and life is good. And it's not expensive.", 
    "review_date": "2015-01-17"
  }, 
  "_E3yaczgef7enusOIf7Jug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne L.", 
    "review_text": "Why is it called this? There are no mini objects. Good beers &amp; specials. // Came here for a drink, Friday Happy Hour time Not too crowded then.", 
    "review_date": "2011-07-18"
  }, 
  "IWal1ziP1AlfcgDJj5CKFw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron T.", 
    "review_text": "Mini Bar is fine.  Nothing special.  Not sure what the fuss is about.  Small intimate space, maybe in another hood this wouldn't rate a second glance.  Drinks are not cheap and not special.  The Alembic this isn't.", 
    "review_date": "2008-08-24"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Generally a cool bar, but now seems to be overrun with dogs....talking real dogs. Seems like this is the bar to come to with your dog in tow.", 
    "review_date": "2013-07-14"
  }, 
  "FVVLMU7cz5kMcT6c3VRJRg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kerry T.", 
    "review_text": "It's a cute dive bar and the bartender is super nice. Loved the Raspberry Motijo even though I don't really like mint.", 
    "review_date": "2013-06-07"
  }, 
  "RDwgEc8o15O2wqu-YQu29Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamal G.", 
    "review_text": "Mmmm...mmmm...mmm... how I love me some Mini Bar.   The owners are all amazing and hangout on a daily bases. They also support local business and are trying to make sure there are no problems or loud drunk folks hanging outside their bar (except for me of course). I don't know what it would be like without the doorman. Some folks seem to be hating but I love it. I won't drink beer there (that's what I got 821 for) but damn if I don't have a few double jack and coke in a pint glass with a lime!  I just wish I could wake up early enough on a Saturday or Sunday to try one of their bloody mary's. I know Molly heads down to the farmers market each morning for fresh vegetables. Hmmm... maybe they should start making wake up calls? Holla atcha boy!  MMMMmm....mmmm....mmm.... how I love me some Bar, Mini!", 
    "review_date": "2008-10-01"
  }, 
  "Udet0hipXVPsiqV_f9QfdQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Meredith M.", 
    "review_text": "I went there for the first time last Friday night.  Pretty great experience considering I rarely venture out on weekend nights to weekend places.  The crowd is not anything overly specific.  They're a dressed up version of 821, friendly, mid 20s to 40s, locals.  Well behaved, just lookin to relax.  Love the art.  Love supporting local artists.  We were lucky enough to get a spot in the back room.  We were four, and shared the room with two other groups.  Everyone played nice, and shared the space well.  Of course, around midnight, the two other groups had gone, and a loud group of douchebags replaced them.  We left when we realized they were there to stay.  But that's not the bar's fault.  The staff were extremely friendly, which is not always the case in this neighborhood.  We get a lot of ARTISTE types working the service jobs.  I generally do not appreciate the ARTISTE types.  Unless they're friendly ARTISTEs.  That's cool with me.  The location is great, as I live about 6 blocks away.  Overall, I could not have been happier. The music was good, yet ignorable.  The size was perfect for not feeling like a sardine in a massive tin.    Oh yeah, my last kudo is for the bathroom.  They had recycling for paper towels (sweet), and it was so nicely decorated and well kept.  So civil.  THAT bumps them up to 5 stars.", 
    "review_date": "2009-01-15"
  }, 
  "NUDW-B8soSHRhkB9Yrt8gw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Billy A.", 
    "review_text": "Good drinks, good bartenders, great neighborhood bar.", 
    "review_date": "2009-11-14"
  }, 
  "0o02J-LA5CmrMjRxDMMUMg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan L.", 
    "review_text": "Great place to go with a small group of people for a few drinks and a little conversation.  It certainly has a very regular crowd that you will see pretty much every time you go in, but they are friendly and welcoming.  The atmosphere is cozy, dark and artsy, with ever changing artwork on the walls and a quaint little back room, and as the name may hint, it is quite small. My only dislikes are that the beers are all about $0.50 over priced and my party was once told to keep it down, so as to not disturb the neighbors.  I went to Mini Bar to not disturb my neighbors, now I have to worry about theirs?", 
    "review_date": "2009-12-24"
  }, 
  "BWDsBTMGDrpbrpXoABAQOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "david c.", 
    "review_text": "Like usual, I am late to the punch. Really, what does one have to do to be the first to review something?  I guess I need to wonder around the city, notice places about to open and then write my review on some portable device while there.  Chill the fuck out people.   Anyhow, I digress, and if you can't tell, I have been a bit stressed lately. Hence my recent stop at Mini Bar.  Mini bar is not much in the way of bars, it has your traditional drinks and general choices. However, the real allure here is the art.  Mini bar is not trying to be something other than what it is. Typical drinks in a cool place with interesting art.  Its like mac and cheese. Not nobel prize winning, but still good. Oh ya, try the keg house wine, its actually not bad.  I was suprised and pleasently so.   Everything all together, I am dedcuting stars because the owner was shit talking the Love Parade. Hey, now!!! Stop that. I help produce the Lovefest.  Actually, it was quite amicable, but if you go, give her shit and request electonic music. She's a punk rock chick and thats sure to get you into a good conversation!", 
    "review_date": "2009-02-11"
  }, 
  "gEAQtuovjciyrbgaLWSv1Q": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "James R.", 
    "review_text": "i love wes p's review - i had a similar bartender experience here when I ordered a campari/soda; the guy smacked it down on the counter and said \"how's that for an orange slice?\" and he was right - it was a thick, generous, delicious piece, which both was great for the drink and a testament to these guys' awesomeness.", 
    "review_date": "2009-03-01"
  }, 
  "Vgh-CjwAl4tFleP39OdzaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "linda t.", 
    "review_text": "Cool bar :) I like it - great vibe &amp; decorations. Definitely go to the back room - totally awesome. Frequent this place every Tuesday :) No food, so be sure to hop across the street and get pizza from Little Star! :)", 
    "review_date": "2009-06-23"
  }, 
  "REyJXN6QLsZ3qt1VO2k_jg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer S.", 
    "review_text": "The place to go when you're waiting for a table at Little Star.  It's literally across the street.  Put your name in and then head across Divis for a beer or cocktail.  Pros - good beer selection, reasonable prices and comfy booths.  Cranky bouncers, sometimes cranky bartenders, and slow service are the cons.", 
    "review_date": "2009-09-30"
  }, 
  "qD51vvp5Zf5DgPEGy7yfDQ": {
    "user_rating": 4.0, 
    "user_location": "Ocala, FL", 
    "user_name": "Marsha Z.", 
    "review_text": "As a big fan of its neighbor, Bar 821, Mini Bar had a lot to live up to in my eyes.  And while similar in a lot of ways, both have its share of unique qualities.    Mini's biggest advantage is in serving hard liquor, and a few--albeit, healthy (Pirate Booty, and the like)--snacks to munch on.  The space has more couch seating, allowing patrons a larger area to relax.  Compared to next door, the bartender here was a chatty Cathy; alone or not, she'll strike up a conversation with you, regardless.  Local art graces the walls, which are also available for purchase on the spot.  Although I gravitate towards 821 for their $3 Happy Hour cocktails, I always found the small place more conducive to grabbing a quick drink and jetting.  The atmosphere at Mini Bar, on the other hand, seems comfortable enough to lounge around at all night.  Either way, both attract a mellow, neighborhood crowd.  Given how pretentious some bars in this city can be, sometimes, that's all you can ask for.", 
    "review_date": "2008-10-10"
  }, 
  "TMLVzNYs-zwwREudyvI08A": {
    "user_rating": 4.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Matthew R.", 
    "review_text": "Of course I finally get a full bar in my neighborhood.  Only to have me move to a different neighborhood.  I'm an idiot.", 
    "review_date": "2010-01-07"
  }, 
  "kLh6DJKLi9c46NqIokmPaA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Erin M.", 
    "review_text": "Everything I could ask for in a drinking establishment. Well-made drinks, excellent bartender and a bestest friend to vent with. It's the size of a dive bar, but not-smelly, not-dark or -dank, and not-full-of-hipster-irony.   I'm a fan of little efforts that mean a lot. We were sitting at the bar chatting away when we ordered our second round. By this time, we were 45 minutes past the end of Happy Hour, but the bartender indicated that she'd discount our next round anyway.   Honestly, it only cost her $2 (which we then added back into the tip), but it's those small things that make a big difference.   And, it's those small things that will keep me coming back.", 
    "review_date": "2008-11-19"
  }, 
  "gT53mQcqdy9u7fcN2XJfaA": {
    "user_rating": 3.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Irene L.", 
    "review_text": "This place is pretty hip. I was caught off guard with their bar dog hanging out with the crowd. This place is small but it works for me.  I forgot what beer I ordered but I thought it'll be draft but $5 for a bottle of beer at the bar? No bueno. Was only here for less than half an hour so I can't say much about this place but it's cool to grab a drink and hang out here if you want a very dim atmosphere.", 
    "review_date": "2012-03-19"
  }, 
  "SKm-qHK7U9mqjobLCcjK1Q": {
    "user_rating": 5.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Desiree P.", 
    "review_text": "I love mini bar! The drinks are perfect and all of the staff is so friendly! I especially love the cozy lounge in the back. LOVE IT!", 
    "review_date": "2008-10-04"
  }, 
  "-qDiotF8Qd0ThdLNEpg9Aw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "What I like about Mini Bar is that it is a shining example of the great comeback of the Western Addition. D Street is one of the coolest spots in the City and Mini Bar leads the way with its lively \"locals\" feeling, no bullshit approach and fantastic curation of weird art. I enjoyed the exhibition of NoisePop posters a couple months back. This bar really rounds out the lower Divis. area.", 
    "review_date": "2009-04-19"
  }, 
  "e8VRo380t5zeVzK5yAzj0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick S.", 
    "review_text": "Rounded up a group and hit Mini Bar on Saturday night to celebrate my birthday.  What a great place!  We filled the back room and the bar staff were really lovely all night.  The art on the walls is great and the bar had a relaxed fun vibe all night long.  I'll go back for a more low-key visit again soon.", 
    "review_date": "2009-04-06"
  }, 
  "uqOizjedeV43lEiwJa5RNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah G.", 
    "review_text": "I have a soft spot for this place.   Maybe because Molly (a bartender) is so nice to us, maybe because it's one of my neighborhood bars or because they let me order in Little Star from across the street when I drink my Margarita.  Sometimes it's too mini for me when I can't get a seat, but that's part of the fun when you're the one with the table!", 
    "review_date": "2010-05-13"
  }, 
  "shfhrdFn8aGgFP8dyXNyxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eater S.", 
    "review_text": "Absolutely fantastic. Really nice bartenders. Attentive, professional, and friendly. They don't know much, but they try hard, and that was good enough. Nice atmosphere. Not too loud. Nice art. Nice music. Nice light. Small. Nice people. Good drink selection.", 
    "review_date": "2009-11-08"
  }, 
  "7zXSdGMLgiWz7VPWhijU1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darin L.", 
    "review_text": "This is my favorite neighborhood artbar. I almost hate to give it a review because I would like to keep washed masses out...but, I really appreciate the monthly changes in displays of 4-6 local artists...any establishment that supports the arts, especially local artists gets two thumbs up from me!!!", 
    "review_date": "2015-01-10"
  }, 
  "A6TaiGkTkTlbnjir5XgpFA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Cailie S.", 
    "review_text": "I'm not going to lie, I've only been here twice and was sober all of none of those times. However the bartenders are always nice and there was a sassy punk guy working the the door who was really nice.", 
    "review_date": "2011-10-06"
  }, 
  "OaRk-RwFEzfOtc45ff0fGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "Summer the season isn't my cup of tea, but Sommer the bartender is money!  Having a drink at Mini Bar SF was like unwinding at a small party  in a friend's arty but understated livingroom, and she was the perfect host.  Being a Richmond kid, I expected the other patrons to smell it on me from a mile away with shunning glares awaiting me inside, but to my surprise, it was incredibly nice and laid back.  All that and great daily drink specials?  This could make a regular out of me.", 
    "review_date": "2010-04-06"
  }, 
  "D8JswSWcY-fznIm05Y3WZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marlon R.", 
    "review_text": "It is exactly what the name says \"Mini Bar\", but its spirit is anything but mini. Great place. I really enjoyed it. Like I said it's a bit small and  even though it can sometimes take a bit of time to get your drink it's worth it.", 
    "review_date": "2012-07-31"
  }, 
  "5JBUr02Eemexu4f3nVIRvA": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Andrew C.", 
    "review_text": "Whoa, did I just go to a non-dive bar with a group of friends who live for dive bars? IS IT POSSIBLE?  Yes.  Mini Bar is pretty damned mini. When it gets packed in there, it gets packed. The drinks are stiff and interesting--try the shit weasel. Perhaps a round of shit weasels for all. Whoooo gives a shit?  There's an art rotation that is kind of hodgepodge and doesn't seem to follow any certain theme but it's interesting to look at. Drink prices are what you'd expect in a non-dive in SF. You're looking at $7 mixers for the better kinds of booze... Jameson..etc.  Not a bad spot at all, though I hear the burrito place next door is pretty wacked. And if you're smoking outside, do so on the left side of the building as the neighbors are trippin (Neighbors always be trippin) about living above a bar with smokers.  Only bummer, or perhaps a godsend, is that they close at midnight. With the drinks as strong as they are, that's probably the best decision for our collective health.", 
    "review_date": "2010-10-17"
  }, 
  "m5ssxEA0FTwYpGKi646Rjg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lara O.", 
    "review_text": "My group stopped in here briefly to check it out.  It was 11PM, there was no music playing, and the layout made the bar cramped.  The drinks were completely forgettable. It did have a very clean ladies room though.  Needless to say we didn't stay long.  With Fly Bar and The Page right down the street I don't think i'll be stopping back in here again.", 
    "review_date": "2010-09-06"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "I finally have a full bar near my house!   I've been to Mini Bar a few times since it's opened and though it's small I never felt claustrophobic. The bartenders are nice, the place is clean and the drinks are strong. I went this past Friday night with a group of people. We grabbed a table and never had a problem getting a drink.   Thank you Mini Bar, for letting me get trashed and stumble home the full block and a half to my house.", 
    "review_date": "2008-12-01"
  }, 
  "NpgLAjKepFGfBMwzit4SUA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Julie S.", 
    "review_text": "Well after a year of Mini Bar awaiting their green light to open, I am glad to see these folks up and running.  As a local in the neighborhood I know i am def. happy to see a full bar open up because one can only drink so much sake and soju cocktails- which have taken over everywhere due to SF's next to impossible liquor license acquisition.  I dont know who they had to knock off to get this license but whoever they were, I hope they are smiling in their grave knowing that the NOPA-lites are getting sauced and loving it.  R.I.P. soju.  I will say that when I stopped in on opening night, I didn't order a drink so I cant review that.  Also, it was not the neighborhood crowd which is fine and to be expected since it was an opening.  What I did pay more attention to was the art, which is decent but because of this aspect the lighting in MIni-Bar is way too bright.  They are lighting the art well but its not cozy nor relaxing.  Its like being in a gallery.  They have this cool lounge room (with what I think were leather sofas) in the back up a few stairs but when I went back to it I felt like I needed sunglasses if I were to ever hang back there.  If they dimmed the lights--that room will become prime make-out  real estate.--. Lighting for art's sake I understand, but at the end of the day this is a bar and should feel like one.  Minus one star for that.  And I agree with another reviewer who says that music is key and should be a main focal point.  I can't recall if and/or what they had playing but I do hope they incorporate good DJ's or mixes or both.  I spoke with one of the owners, Summer who was very sweet and welcoming and she mentioned they had been paying rent since last August!  Thats reason enough to get me in there for some drinks...these people need our support!  As if they haven't dealt with enough delays, she mentioned that  apparently there are 2 individuals in the neighborhood who arent so thrilled on a new bar so they have been making this long overdue opening not only annoying to the owners but us locals too and as a result  Mini Bar is required to close at midnight until further notice (upcoming public hearing: date unknown).  These folks protesting dont live above the bar or even on the same block so thats gotta suck for Mini.  This is Divisadero St. for crying out loud!!  So with a few hurdles still left to clear, by all intents and purposes --Mini Bar is open, looking good (minus the bright lighting), and serving up good cocktails.  They are also doing Bloody Mary's , etc. on the weekends starting around noon so that will be another plus for them.  Buena Suerte Mini-Bar---We got yer back but turn down those lights a bit!", 
    "review_date": "2008-08-20"
  }, 
  "_xpivv6pnLim13KiaHBKqg": {
    "user_rating": 2.0, 
    "user_location": "Redwood Shores, CA", 
    "user_name": "Sally L.", 
    "review_text": "This was the only full bar we could find while waiting for a table at NOPA, and it's not that great.  It doesn't seem as \"dive\"-y as aforementioned reviews would have you think it is.  The place is small &amp; clean with nice photography on the walls.  I ordered a lemon drop with no sugar on the rim and got bottom shelf vodka with lime juice &amp; no sugar in it (talk about puckering up...) but it still had the sticky mess of a sugar rim I was trying to avoid in the first place.  At least it was only $6.  All in all, \"meh\" sums it up.", 
    "review_date": "2010-11-23"
  }, 
  "3wjqn70BkV8nXzqBDLpUvQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica P.", 
    "review_text": "Mini Bar SF....eh. This bar has great drinks and fun art to \"critique\" as you get your drink on but it is long, narrow, and typically packed. If you can get your hands on a ledge then it makes the experience all that much better. Otherwise... channel your inner art student, throw an elbow, and settle in for a beer. Per usual on Divis.. .bring cash.", 
    "review_date": "2010-04-16"
  }, 
  "AlXx0P-OhUylep0jNi773g": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "sarah l.", 
    "review_text": "I pretty much love this bar &amp; it would be my local if I lived in town.    It's full of regular, friendly, cool, nice people.  Both times I was here last week I struck up a conversation with a neighbour in the backroom.  I went to Russian River night during beer week and I had a great time.  We arrived at open, so there was plenty of Younger to go around and I loved the flight of RR beers.  I also LOVE the artwork that was on display in February 2011 in the back. I was less excited about the photos in the main space but the Adrianna Bamber Phantasmagoria stuff was really interesting and awesome (and reasonably priced).  I probably should have bought one.  I kind of have didn't-buy-regret.  I will be back here everytime I visit Kat F.", 
    "review_date": "2011-02-23"
  }, 
  "xwGQDwmWMRuzy2TxLKPXRA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Daniel D.", 
    "review_text": "The sign says \"modern art &amp; classic cocktails,\" how could I *not* check this place out? Inside, Mini Bar is funky and intimate, a perfect place to (re)charge your batteries. After our group dinner at nearby Blue Jay Cafe, a few of us stopped in to fuel up before the serious partying that lay ahead. Racer 5's for me and my friend, Jack &amp; Coke for the others, a nice little back lounge to kick back, interesting art, and friendly staff; we couldn't have asked for anything more.", 
    "review_date": "2009-03-20"
  }, 
  "szSAT_ZZ6kCoUQES1flsWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve M.", 
    "review_text": "sorry, no more Pliny the Younger here as of 02/15. But they do have Pliny the Elder and it's still a cool bar", 
    "review_date": "2014-02-15"
  }, 
  "Fz3y-d7Ru7wMRnPuwG-OLA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mick F.", 
    "review_text": "Seriously?  Nu Metal?  The guy that works your fucking door is AWESOME and into black metal....and you abuse him with the musical stylings of Papa Roach, Trapt and the like?  Course, that was one night....but just saying...nu metal is a disease that leaves a dirty trail for a long long time.  The first time i went in here, it was election night, and i ran in screaming \"OBAAAMMMAAA!!!\" where the doorguy chased my silly ass out for breaking 9 noise ordinance laws.   On the total, I have been in here thrice, or fourthce, and each time the bartenders pour quick and strong, like a kick from a mini horse.  The little FauxVIP area in the back is definitely a cool area if you can land it, but be careful....trying to scale down them at Spiderman speeds after your 6th Dewer's rocks makes you look like a slippery wet rat.", 
    "review_date": "2009-01-06"
  }, 
  "c5KrN6ob4YHFM8f2DOrMsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex W.", 
    "review_text": "Cool little neighbourhood bar! Friendly atmosphere.", 
    "review_date": "2009-11-07"
  }, 
  "Gq5D1V5jwrYPpOxfwM5lag": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Jessica M.", 
    "review_text": "Well it's around the corner from my house so of course I love this new tiny lounge and art gallery in Western Addition (otherwise known as Popeye's Terrace or, ok, NOPA.) While it's upscale it's certainly not pretentious and goes by one ideal I support - localism. Artists in the Mcallister/Divis area are encouraged to bring their work to the Mini Bar where exhibits will changes every few weeks. Beware- it's not just a clever name.", 
    "review_date": "2008-08-13"
  }, 
  "gLke-4oih1t7urvoQAENcQ": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Kevin L.", 
    "review_text": "The name clearly set me up to expect itty bitty, but this place is pretty sizeable. There's a little nook of a room in the back where three couches are jammed into a U. Interesting art all along the walls, friendly clientele, and clean. Dog-friendly bar since there was a sad pooch wandering around being confused. Even dive scenesters could like this place!", 
    "review_date": "2010-11-25"
  }, 
  "OUDaJuPhq5dHi6XRPAGTCg": {
    "user_rating": 3.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Johnny H.", 
    "review_text": "I'd usually go 4 stars here because the space is nice and the drinks are wonderful, but as the only bar on Divis that offers a full bar, this place gets jam-packed on most summer nights.  The trick is come early (6-8) to avoid the crowds.   Especially true if you're bringing your dog, which is allowed.", 
    "review_date": "2010-06-22"
  }, 
  "7K_emyMVzU0VXhBYVF5biw": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Jeff H.", 
    "review_text": "This place is cool.   Mini bar isnt just a name the bar is actually pretty small but it has pleanty of atmosphere.  I like this place because it is just down the street and it is a full bar and unlike other full bars in the area it is nice not all run down and ghetto  you can go there with your girlfriend one night and your buddies the next.", 
    "review_date": "2009-06-09"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "Meh. We came here late one night while looking for something open and not too crowded. I always like to ask bartenders at cocktail bars to surprise me with something good. I've never had an issue at Rye, Redford, or similar cocktail bars with that request. Most bartenders see it as a way to be creative and try something different. You would have thought I asked this girl to solve a quadratic or something-- deer in the headlights. Don't put \"cocktails\" on your window if your bartenders don't feel comfortable making them. Drinks are cheap...lots of bottled beers, maybe 5 on tap?   There's cool local art on the walls at least. Very narrow space. A back room with couch and some chairs. Clientele is white, hipster, tattooed, pierced, etc.", 
    "review_date": "2014-01-18"
  }, 
  "vcOtDqQ2Cc731kFjklFeBg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany V.", 
    "review_text": "Solid bar. Came in here for shelter from the rain while waiting for friends to arrive before seeing You Won't open for Lucius at The Independent.   They didn't have mint for a mojito and didn't have Malibu for a Malibu pineapple so I ended up with Bacardi Pineapple that tasted like ass. At least it was only $6! Definitely a no frills kind of bar. No cocktail menu but plenty of beer selections.   Love the art on the walls and you can tell a lot of regulars frequent this place since it seemed like everyone around me knew the bartenders. Love the fact they played Tom Petty as soon as I walked in!", 
    "review_date": "2014-02-09"
  }, 
  "02ptBTJ9S7P_iW0izUNq_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janet D.", 
    "review_text": "Good for a mini date. Wee bit extra privacy because of the lighting and nook in back. First time I went here was for predrinks before getting dinner at Nopa. It was an exceptional night that began very unassumingly.  4 stars plus 1 because they have Guinness on tap!", 
    "review_date": "2011-10-24"
  }, 
  "D1RnzRaedm11oYZdhmqwvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Velvet V.", 
    "review_text": "The staff have excellent service and are well schooled in their craft.  It's cozy and easy to chat with new and unsuspecting strangers.  Not a lot of sitting as it's more of an alley type layout.  It's nice for small groups to mingle and lovely for a ladies night.  Thumbs up good option for a low key night.", 
    "review_date": "2009-08-29"
  }, 
  "DodFQgkojJ2hCXuI85RR3A": {
    "user_rating": 3.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Vanilla C.", 
    "review_text": "I am reviewing the Art element of the Bar.  I did not drink there since I don't drink.  I stopped by to check out the art.  I loved the work in the back upper room.  It is done by a furniture artist who did a great job of hanging carved wooden furniture on the walls and even designed the wooden coffee table in the back.  Innovative way of showing utilitarian art work.    I love that the shotgun style architecture was welcoming and had some really nice hanging art work in the front bar gallery.  It is a great idea to create space withing a space.    The space is nice yet not uptight. Love the simple decor and bi-level bar layout.  Small but cute. It was not busy when I went in around 4:30 during a weekday.    Minus for me:   However I am not into socializing with dogs  and other 4 legged animals in public facilities (allergies. and other health/safety concerns) so if you have allergies to doggies you might want to skip this place, they allow them in the space.", 
    "review_date": "2010-07-27"
  }, 
  "4aXFsIMEwDD_puCvS5xR5Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sarah l.", 
    "review_text": "Love staying local so this is a great addition to our neighborhood. It's fresh, clean and has good music taste. With only one bar tender tho double up on your drinks.", 
    "review_date": "2008-11-26"
  }, 
  "bOzsdIkTveA6glHOOMPpkg": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Arthur Y.", 
    "review_text": "It's not as small as the name makes it seem - but it's not big.  Booth seating in the front and like 10 bar stools otherwise.  Probably like 400-500sq ft?  Nothing spectacular about this place.  It's just a small bar.  I would ever choose to go there....just ended up there due to friends.  It just doesn't offer anything different or any one good thing to hang its hat on....  I guess the name in kinda good...?  Kinda....", 
    "review_date": "2014-09-03"
  }, 
  "r8Trb1164K98yHiOimj5Tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison P.", 
    "review_text": "My go-to neighborhood spot.  Never too crowded (but I go on the early end of the night), great service, and reasonable prices.  Not much more to say...", 
    "review_date": "2014-12-15"
  }, 
  "TH5Rh36NpoeF8khMBZQJJw": {
    "user_rating": 2.0, 
    "user_location": "Napa, CA", 
    "user_name": "Megan D.", 
    "review_text": "Thought this place looked great from the outside. Went in on a Saturday afternoon, ordered 2 happy hour margaritas and could barely take a sip they were so sweet. Asked the bartender to trade them out for a beer and a vodka/soda. She didn't apologize, smirked instead, andgave me a beer and a soda water (no vodka!). Won't be back again.", 
    "review_date": "2013-04-23"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "This mini bar is larger, plusher, cheaper and stocked with more premium liquor than any mini bar I have encountered..... and it comes complete with one of the nicest bartenders ever. Holiday Inn room 403 has nothing on this place.", 
    "review_date": "2008-10-06"
  }, 
  "cL-AqfiZcGRwkyfxRomGvw": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Christine P.", 
    "review_text": "Stiff drinks, interesting art, friendly bartenders. Not too crowded either so great place to shoot the poop. I liked it!", 
    "review_date": "2013-08-29"
  }, 
  "aEKUC4oQg2CokbwyW_CXSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah R.", 
    "review_text": "Cool little bar. Went last night before a show at the Independent. Friendly bartender, plenty of open seats, good beer selection, cheap drinks - really what more do you want from a neighborhood bar? Beers are $4 each and at happy hour only $3. Nice! Worth stopping by if you're looking for a watering hole in the area.", 
    "review_date": "2008-10-29"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "It's been awhile, but Mini Bar is still holding strong and still just as inviting and charming.  I adore that despite the intimate size of Mini Bar, that you can still hear yourself and your friends. Their back lounge area is absolutely adorable and so what's up. With casual laid back couch seating, it's such a divine secluded space for gathering with a bigger sized group.   Mini Bar really captures Divisadero street beautifully. The crowd is always mellow and diverse and I appreciate they still display local art and have built up a true local following since their opening a couple of years back.   Mini Bar's garnered big love in this hood.  Trust.", 
    "review_date": "2012-04-26"
  }, 
  "hFvLaKDNHMxHze13Hd-FZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misha F.", 
    "review_text": "What I like about the Mini Bar: the vibe, the decor, the art, the drinks, the peeps.   Laid back and unpretencious. Score the back room if you can.   Ask for a \"gopher's butt.\" It's delicious! aka Mango gimlet.", 
    "review_date": "2009-05-27"
  }, 
  "W35eV_BkLI4qC0mmwJ6QWw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Stephen D.", 
    "review_text": "Came here after Bar 821 closed up early.  They have a full bar, but no cocktail menu so you kind of order blind if you want anything more interesting than a \"x and y\".  I managed to get the bartender to recommend something and she made me a fine champs elysees.  Because of the narrow space, there isn't a great place to stand/sit if it's crowded and the back is full, and dang it gets hot in there.  I guess the name kind of says it all.  Closed up at midnight...better than Bar 821, but c'mon people, doesn't anyone stay up late anymore?", 
    "review_date": "2010-06-04"
  }, 
  "5IqFbxiON9LCSSrvbL4nWQ": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Lauren J.", 
    "review_text": "Is it wrong to judge a bar for being small when it's in the name? Probably. Bartenders were nice, prices were inexpensive. I think there were a couple of bday parties when we went, as there was no room for our group of 7 to congregate. Back room looked awesome and I'll definitely be going back.", 
    "review_date": "2009-08-19"
  }, 
  "_zkty5EuqtAEe5n1O8CHCQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "michelle m.", 
    "review_text": "its a great bar when its not packed wall to friggen wall. when it gets that crowded leave. if you stay in this place when you cant even move it because you have an overwhelming need to belong and feel like your a part of something.  OK that's my attempt to clear it during its busiest times.  oh and get some good Bourbon, no Knob Creek, Woodford?", 
    "review_date": "2010-06-16"
  }, 
  "zGOXKICJ-X6tcoIHaGaITg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kia B.", 
    "review_text": "4.5 stars! I'm slowly falling in _.O.V.E with this place. We stopped in quickly to decompress after work before heading out to dinner. A great, funky and cute crowd much like the neighborhood. Lots of daily happy hour specials and as always comfy booths and friendly barkeeps. I totally man-browsed on the DL and noticed that there were  many cute single boys in attendance(tuesday night) I totally wanted to call one of my very fun and very single BFFs' to meet us and scope out the scene. But alas, we were only there for one round :( Next time I'll drag her along. . . .", 
    "review_date": "2009-03-05"
  }, 
  "6yx9bNp_e1p1SF0eTOkWHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt K.", 
    "review_text": "This is the perfect place to get a drink before catching a show at the Independent. Of the many times I have been here, I have only seen two different bar tenders, both of which are great. I bring up the fact that I've only seen these two because it seems to me that a place that holds onto it's employees is most likely doing something right. The crowd can vary, if it's people from the 'hood it's fun. If it's people pretending they are from the 'hood...well, it's too small for big egos. :)  I love the art, even when it's crappy, it's legit.", 
    "review_date": "2011-05-09"
  }, 
  "KCaOZUnCx25FJhFr_lKsEg": {
    "user_rating": 4.0, 
    "user_location": "Mill Creek, WA", 
    "user_name": "Heidi M.", 
    "review_text": "I've recently started going here for drinks before shows at the Independent.  The bartenders have been quick to serve orders, even when they're busy.  The draft selections here don't really suit me, so I've mostly had mixed drinks and have been happy with the pours, and one of the female bartenders made some of the best martinis I've had in months.    The ambiance is nice.  When I walked in for the first time, I was afraid it would be a bit snooty and pretentious, but it's far more casual than it appears from the street, and both the staff and the patrons have been very friendly each time I've visited.  There is a nice little back room that is often empty - it's perfect for groups and makes it easy to carry conversations over drinks even when the rest of the bar is crowded and loud.", 
    "review_date": "2011-12-18"
  }, 
  "26M--Wa2ZtO02t8EjmvXRw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dan S.", 
    "review_text": "Awesomeness, from the art to the bartenders (hi Molly!) to the drunken dudes rambling on about the Amish and how kids today don't know how to fuck shit up (wait, was that me?).", 
    "review_date": "2010-07-22"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "Awesome new bar with great staff and an excellent selection of potables and art. They also are fairly green in their practices, which is a feat for bars (speak to Elixir &amp; Doc's on that!) I really love the deep red walls in the back area of the bar, sultry!", 
    "review_date": "2008-08-16"
  }, 
  "8pcS7msnV3CMKLDnxp9MUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mynameisdavid M.", 
    "review_text": "Mini Bar is very nice and welcoming, aesthetically as well as owner and staff-wise.  I hope that they'll be able to get permission to stay open until 2am in the near future (opening a bar in san francisco at all can be a herculean feat, and the owners apparently went through a lot just to get the doors open).  edit: I guess they're open until 2:00 now?", 
    "review_date": "2008-08-17"
  }, 
  "7HRRmQMG4ZVxtAnTQYvpXg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chris J.", 
    "review_text": "The too-cute name of the bar concerned me, as well as the fact that while walking down Divisadero to meet my pal here I observed that this formerly grotty thoroughfare is swiftly transforming into Valencia Street 2.0.  Got plans to start your own \"artisan\" salumeria/cupcake bakery/brinery?  Best grab a storefront here post haste.  My sad, rundown Western Addition, what have they done to you?!  I digress.    Fortunately, my worries were for naught.  This is a totally laid back neighborhood bar, not too rife with hipster fashion victims.  The bartender was awesome and very friendly.  Plus - what earns this bar its fifth star - they have Pliny the Elder, my current best beer in the known universe in 14 oz. bottles for six American dollars!  Dude!  Run, don't walk.  I'm thinking I'll go back after work today for Friday night sloppy time!  Yay!", 
    "review_date": "2010-03-12"
  }, 
  "2kKT8fNutWeQ-ruLluz3lw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen S.", 
    "review_text": "Best SF Bloody Mary I have ever had, indubitably. Thanks Sunday James!", 
    "review_date": "2009-04-05"
  }, 
  "IH1iOatR3UkGxuiZVD4Xqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron W.", 
    "review_text": "I came on the second night and was greeted by a nice doorman. I live a block away and couldn't wait to try this place finally!  CONGRATS for getting it open and running.  The space was warm and clean and I liked the art.  We made up our own names for the art, which is always fun with modern art.  Like \"Melting Igloo\" or \"Sideways Pointy Horse\" etc. The back space was also interesting, but perhaps the lighting could be different?  I also would have like the music to be a tad louder, as someone mentioned.  The only complaint I really have is that one of the bartenders seemed really green. We went to party later at Casanova in the Mission and the drinks were much stronger and more artfully prepared.I'll be back in.", 
    "review_date": "2008-08-18"
  }, 
  "ujHBDWF_jrv2mJ23-9bcew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike K.", 
    "review_text": "what a great neighborhood gem. I came in here for the release of Russian River's Pliny the Younger and after a couple pints of that 11% deliciousness we were very happy that little star was across the street! I'd totally stop in for a drink if I was in the area and really love little neighborhood bars like this that feature local artwork on the walls.", 
    "review_date": "2011-03-22"
  }, 
  "KS-iygmyLw66hGi5sWMpzg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Edgar N.", 
    "review_text": "A fun, little (and I do mean little) spot for the locals.   When a friend of mine told me she and friends were meeting here for drinks, I immediately thought \"well, just how 'mini' is mini?  Lemme tell ya, it's tiny. I think I've seen apartments bigger than this place. You can't fit more than two people side-by-side in the hallway leading to the living-room-type space in the back.   Its size, however, is not such a bad thing. Considering personal space is at a premium, it's a good place to meet the locals, chat it up and pet your neighbor's dog (as in it's a dog-friendly establishment). I've read reviews of this place being too \"hip\" for their tastes, but I didn't get that impression at all. If anything, as long as you're not a complete, loudmouthed tool (leave the Ed Hardy at home), you should ok here.  For a place so small, I wasn't expecting the beer + liquor selection to be as solid as it was. Russian River Damnation AND Salvation on tap? Specials on Pliny the Elder? Very nice. The mixed drink I had was stiff, too - snuck up on me real fast, that one.   As I mentioned before, the space in the back resembles a cozy living room that'll comfortably seat 6-8 people or so - perfect if you have friends from out of town.   So, all in all, Mini Bar has earned a spot on my \"must visit\" list whenever I find myself on Divisadero St.", 
    "review_date": "2011-01-11"
  }, 
  "eGXRRUt2iujlePIu_fnXDA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jay m.", 
    "review_text": "This place is decent, despite the dearth of seating. The two stars are due to one of the bartenders who was nothing short of belligerent after a benign miscommunication with a member of my party.  His behavior was 100% out of line, for example: he asked my friend to \"suck a dick and go back to Fremont!\" He also clairvoyantly shouted \"you don't have a legit job!\" and of course hurled the requisite \"douchebag\" accusation. Clearly psych-evals are not a pre-req for employment here.  It might be a good place to go, but be prepared to be berated. Or maybe that guy will be on his meds or not wasted-while-working next time.", 
    "review_date": "2010-08-10"
  }, 
  "Z2PISdtGHThSUUbFccGkrA": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Scott G.", 
    "review_text": "Pluses: Decent happy hour, not too crowded on week nights. Full bar.  Negatives: Can't imagine how crammed this place gets when more than 15 people walk into this place!  The music they play sucks (Pinback, anyone?) and the over ambiance is just plain, well, plain.", 
    "review_date": "2009-01-06"
  }, 
  "w7RP1MZad3YO7Vjgp3s3Dg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claudine V.", 
    "review_text": "Good stiff drinks, friendly bartenders, love that you can bring your fluffy loved ones with you while you grab a glass of your favorite drink. For a Friday night, it was still low key and few places to sit. I would definitely give this place another shot for another shot!!  FYI - parking is terrible around this neighborhood. I should have taken a cab or a muni!!", 
    "review_date": "2012-04-30"
  }, 
  "xL3SwemFaltcKodW57pjQw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy H.", 
    "review_text": "ok, I have tried this place twice and am not impressed at all. In fact, we are starting a pool to see how long it will be open!  The first time I went in, it was almost the end of Happy Hour. The super snobby bartender refused to look up to acknowledge anyone was waiting for her servitude and then decided they were no longer going to honor happy hour prices, so we left. The seconf time, the security guard almost fell off his chair and had SUCH an attitude like he was working at a NYC club- Please, this is only NOPA, not the Village. Once again, took forever to get bartenders attention. Nice they have a full bar,artwork is fantastic as is  the design, but the attitude needs to stop.", 
    "review_date": "2008-09-07"
  }, 
  "KdpOV80eXNjJF0989DXdGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Excitable R.", 
    "review_text": "Jesus, time to call the hater Wahhhhmbulance.  \"You are a bar and have a doorman\"  WAHHHH.  \"Drinks cost more than $3\"  WAHHHHH.  \"There is art on the walls\"  WAHHHHH.  Get over yourselves.  Its a nice neighborhood bar, if you don't like it you can always waste your life in the same cheap crappy watering hole you have been for the previous years of your sorry whiny life.", 
    "review_date": "2008-09-21"
  }, 
  "3ReyPpmtIE-qvw5ZmpiEew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren M.", 
    "review_text": "Comfortable and laid back, no cliquey feeling. A+ for serving Russian River beers.", 
    "review_date": "2009-12-28"
  }, 
  "dy4OvKg-9GBhgGaZFaKqTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris D.", 
    "review_text": "What a great space! Nice art on the wall, great beers on tap, smart music and just a cool vibe, this is going to be one of my favorite spots for drinks!", 
    "review_date": "2009-03-22"
  }, 
  "Ylmv-YxetMeMZJ1d6R4N7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brent N.", 
    "review_text": "The initial suggestion of coming to Mini Bar didnt overwhelm me with excitement.  I mean, a mini bar in itself is a small fridge packed with small drinks...and any true alcoholic can sympathize paying for small drinks.  But my fears were put to an end quite abruptly after reaching the bar.  The shots were normal, but I think it's the atmosphere and wonderland of local art that truly makes this place a winner.", 
    "review_date": "2008-12-23"
  }, 
  "qCrAu3LAbj4zkDYVST2efQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine B.", 
    "review_text": "This place is too hip for me but they let me in the door anyway :)  The bartender was extremely helpful in assisting me with a low or zero calorie drink option. I ended up with a Vodka Soda and the scale still went down this morning! According to her it is what the Queens and Models in NYC drink. Take it from her, she knows what she's doing.  My friend had a mixed drink of some complex sort she was able to whip up splendidly.  I cant wait to come back. This place is exactly what I want in my neighborhood bar.", 
    "review_date": "2010-06-15"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "Mini Bar is right. This place is tiny, and the clientele leaves something to be desired. The people are fairly grody (literally dirty), and they bring dogs into the bar, which is a bear, because walking around is difficult enough as it is. Their drink menu is extensive, but there's just nowhere to really stand around or sit. I wasn't feeling this place at all.", 
    "review_date": "2013-01-27"
  }, 
  "RyWKKwLzLSWi_8bZd1QWYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh M.", 
    "review_text": "Update:  They are now open and serve much more than just beer/wine, which is great news.  The people working seem really nice, but I'll plan to go a few more times before I give it a proper review.  And hey, I haven't had a chance to have one of their Bloody Mary's. =)  Old Review: Well, I know it's hard to give 5-stars to a place that isn't open yet - but I have high hopes!!    While 831 Divis is really close to my house, I hate that it closes early and refuse to go because of this reason alone.   If this new bar stays open till 2am, I'll be really happy.  Although I think I have heard it's another beer/wine place, which will kinda suck.   I'll make sure to update my review when they are finally open.", 
    "review_date": "2008-06-30"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "Mini Bar, Maxi Fun!  I dig this place. You can call it the Little Star waiting room or a pre-party spot before a show at the Independent...either way, it's a cool space packed mainly with locals (Hi Gabe!) that not only features a full bar but also rotating art on the walls.  Good stuff, I'll be back.", 
    "review_date": "2009-03-03"
  }, 
  "uYFz9ITmzqome2xfq-kkhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David K.", 
    "review_text": "I just moved to the Nopa area and this  a great local bar to grab a drink and catch up with friends.  Bartenders are nice, the environment is laid back and the crowd is chill.  They also allow dogs from what I heard and they also have art on display to view and purchase, overall great experience, will be going back.", 
    "review_date": "2011-11-22"
  }, 
  "IBrL-6twlZmQBGLdV2DQiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie C.", 
    "review_text": "Cute, small, immaculately clean bar w/ nice bouncer and wholesome singles and couples mostly 20s, early 30s.", 
    "review_date": "2008-10-24"
  }, 
  "UVmJTV3PV2Ra-znRl0nrHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley P.", 
    "review_text": "My favs on Sunday  Great bloody marys with home made mix Everyone who works there is super nice, down to earth, neighborhood folk.", 
    "review_date": "2008-09-23"
  }, 
  "sZUC9GbwvDHWrHl0D_d2dA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen K.", 
    "review_text": "this is my new favorite (and local) bar.  every tiny detail in, about and around this place is well thought out and cool as fuck.  unfortunately, they are only open until 11pm these days and until that time gets pushed back, i won't be able to enjoy the mininess since i can only come out and play after midnight at present...  look, to whoever just 'funnied' this review, i am well aware that this review isn't even remotely funny, but thank you anyway.  i just don't have that kind of time these days to make shit funny anymore.  sorry.  maybe in  a few months when things get better i can get back to being funny and shit.  i dunno.  for now i suck, so leave me alone.", 
    "review_date": "2008-09-04"
  }, 
  "ccQvyiUeqsXhweY2hHrHAw": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Adam Z.", 
    "review_text": "Met up with friends here in the back room for a birthday. I just was not impressed.  The back room has no music, so there wasn't much of an atmosphere. The lock on the bathroom door was broken, so friends would have to post up outside to watch out for each other. I don't usually notice the art much, but all agreed that the stuff here was pretty much ugly and awful.   Some drunk folks were yelling and being obnoxious at the bar, and because it's so small it was loud as hell. I don't know why they weren't thrown out.", 
    "review_date": "2009-06-29"
  }, 
  "E-ws0CUwkAYlv5JEfRr9mA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay S.", 
    "review_text": "OK People, so what do you want to hear? I just went there for their Opening Night (supposedly) last night. It's just another neighborhood BART (Bar with Local Art) and yes I just made that term up. Too many of them mushrooming around the city, just like wine bars. My Observations : Music Music Music - we need music - just a few decibels higher please. Dim the lights. Drinks are good, doorman was very friendly.  As for the Art - check it out  for yourself.", 
    "review_date": "2008-08-16"
  }, 
  "JEv3xGdvqlVRV9U2Fj8avQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rena G.", 
    "review_text": "I just moved to the neighborhood and was really missing my old hood standbye, The Argus (best drinks in SF!), when I finally popped into Mini Bar. I'm hooked. Love the place. Cheap drinks, neighborhood vibe.   The bar is small, limited seating, not a lot going on. People come here with friends or to meet friends or grab a solo drink. I wouldn't recommend this place if you're looking for a crazy party (although you could meet someone that would lead you to that...).   There is also artwork by local artists on the wall. Don't come here with pretensions.", 
    "review_date": "2009-12-04"
  }, 
  "Sw4e9geYXjwG8-JgsuZTSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cecilia k.", 
    "review_text": "Hey all! You know me.... The drunk one that only spills her drink while being sober... TWICE! You know the short and loud asshole that loves your bar, it's bartender, it's bouncer and it's costumers! I love walking in to a bar where I can find the same people every night, gives me that warm and fuzzy feeling ( in a non sexual way)....  Good selection of beer and great drinks. Awesome bartenders and bouncers. I am sick but I might be able to get my ass down there for just ONE ... just ONE more drink!  peace out!", 
    "review_date": "2010-11-07"
  }, 
  "eu19K9KfnvvubzWuv4l6Wg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lauren F.", 
    "review_text": "Liquor on Divisidaro close to my house.  It has a cute room in back for a more intimate gathering...and we got a makers rocks and a vodka soda for $11.  Pretty reasonable.  And who doesnt love mini things.  The decor is sexy, the couches are leather, and there is local art on the walls....  Everytime I pass by, its never crazy packed either, which makes it much more inviting for me...", 
    "review_date": "2008-09-24"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "A no fuss bar serving straightforward drinks. When I asked for a drink menu she told me they don't have one. You ask for what you want and they will do their best to accommodate.   Whiskey Sour and Gin &amp; Tonic only $5 a piece when we went   Overall Thoughts  No craft cocktails but still a decent place to grab drinks at a reasonable price", 
    "review_date": "2013-04-28"
  }, 
  "582iTyqKkoHeBFPMJuQEJw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris D.", 
    "review_text": "To me Mini Bar is like a Pop Tart.  So hot it's cool.  So cool it's hot.  Great concept and execution.  Simple but yet refined.  Great jovial crowd.  Good presentation of pretty damn good art.  Solid bar and barkeeps.  Loungy space without pretenses.  It is actually quite small without feeling cramped.  It is just a cool place...that you'll be excited to go each time.", 
    "review_date": "2009-07-30"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "I love this cozy little spot! Came here on a Thursday night and there were just a few people at the bar, a couple dogs hanging out in the front room and no mmtss mmmtsss music to keep you from hearing your friends. We snagged some seats in the small back room, which kinda reminds me of sitting in a college apartment, but with fun artwork instead of posters. Two thumbs up. Oh, and it doesn't hurt that the bathrooms are clean.", 
    "review_date": "2011-08-08"
  }, 
  "en7bEkzUtMBcZBGrADW3Xg": {
    "user_rating": 4.0, 
    "user_location": "Palm Springs, CA", 
    "user_name": "Amanda S.", 
    "review_text": "Whenever I'm in the area I always drag whomever I'm with here! Always a great selection of art from local artists, and great bartenders who are always on top of their game. Last time I was here I had a \"strawberry lemonade\" drink with white rum. OMG. I had two of those and I was done! However I guess it's not on the menu because I've been before and a few of the bartenders had no idea what I was talking about.   plenty of seating, decent bathrooms, and a cute little back room with christmas lights and some interesting mixed media pieces right now. Decently priced drinks and a great atmosphere!", 
    "review_date": "2010-12-26"
  }, 
  "LdWIjNvjdaAoAfpQhT6F9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tinna H.", 
    "review_text": "I like Mini Bar. The mini bottles of booze at the top of the bar are cute and what I'm assuming to be the reference for the name since the place itself is not so small. Even on a bustling Friday night, we were able to pull up a seat at the bar. It wasn't so loud that we couldn't hold an intimate conversation, even at the bar.  The mojitos we ordered were fresh and tasty. The bartender even offered to sweeten up mine on the spot if it was a little too tart. On round #2 of ordering or round #5+ of drinking [We'd had several rounds earlier in the night.], one of the ingredients in the drink I ordered wasn't readily available, so she improvised. It's nice to walk into a place, knowing that they care about the drinks they are serving.  If I lived in the area, I'd visit regularly and make it my mini bar... Drinks aren't ridiculously priced. I'd also get my grubby fingers on the Pirate's Booty too.", 
    "review_date": "2008-10-13"
  }
}