{
  "r0N7ck7_quS_kvh9JEmfWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul A.", 
    "review_text": "Was Sadie's Flying Elephant. Drank here after sinking another $90 at a local lunch spot with disastrous results. The local flavor of this bar is cool. They have a small overall selection but several top shelf bourbons.", 
    "review_date": "2014-09-25"
  }, 
  "YieiYQXLjMJ92Pejvqc2Gg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J J.", 
    "review_text": "I have been going to Mission Hill Saloon since the new owner took over.  It's awesome.  It's got a neighborhood feel to it, and the owner is always there making sure everyone is taken care of and happy.  The happy hours and drink specials are fantastic (you can get a shot and a beer for next to nothing) and they have a pool table in the back.  They have been doing events such as a Happy VD for Valentine's Day in February (think Black Valentines:) with the Herpes Highball and something called the Gonorrhea that had Fireball and a cinnamon heart in it.  Twisted. The  Mardi Gras Fat Tuesday in March had Hurricanes, Hand Grenades and Sazerac's as the bar's drink specials.  (I looked on their Facebook page and it appears they are doing a Cinco de Mayo event as well).  It's a great place to go hang out, watch a game, and get merry if that's your thing, which it's mine.", 
    "review_date": "2014-04-11"
  }, 
  "BGzavA_ddMr-jGmhArv7fg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vivek S.", 
    "review_text": "In a spot that has endured many iterations -- Sadie's Flying Elephant, Mission Hill Saloon, the Unresolved Love Life Of Evelyn Lee -- this corner at Potrero and Mariposa is once again: Mission Hill Saloon. After just over a year under the ownership by the Thieves crew (Dear Mom, Thieves Tavern), Tony \"The Pope\" is back at the helm.  The horde of hipsters that used to cram in there seemed to have followed Evelyn out the door. That bar was simmering (but not busy) on a Thursday night but this is not a bad thing. The poor table remains in the back, a silent black and white film plays high above, and as always, posting up at a barstool is the place to be.  They have a lotta bourbon behind the bar, and thankfully chopsticks too so I could eat some Thai food while I sipped a Manhattan. There are a few beers on draft, but I neglected to note the selections. You'll just have to see for yourself.  Obligatory Title Pun: King of the HILL.  Menu Readability: I don't remember a menu. Is there a menu?  Need to mention: Cash only.  What this place teaches me about myself: There is only one kind of place where I don't mind sitting on a stool.", 
    "review_date": "2013-04-19"
  }, 
  "bW4fYKOSudv5dmHGSCl4PQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leslie H.", 
    "review_text": "Love this bar.  Great neighborhood spot with old school mission bartenders who know what they're doing.  For a limited selection of liquor, they have a good selection indeed!  Pool table is a plus, and always a few cute dogs for mine to run around with. I go here at least once a week these days!", 
    "review_date": "2014-04-26"
  }, 
  "W970qta4CNWGQLiH5FFLaA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike M.", 
    "review_text": "Very nice and friendly neighborhood bar. If your in the Potrero Hill neighborhood stop in . The staff is awesome , very friendly and experienced. Highly recommend as a great SF neighborhood bar. Easy to get to , take the 9 , 33 , 90 or 22 muni will put you a block away, there is also ample street parking.", 
    "review_date": "2014-04-25"
  }, 
  "4sqRqJrIrFYlj8UxbRMJ7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trish P.", 
    "review_text": "A low-key, cash-only dive bar in the Mission where you can grab cheap drinks and chat with friends without swimming through a boistrous or hipstery crowd.  Parking was easy to find and the bartender was really friendly and accommodating despite some of us ordering complicated/pain-in-the-ass drinks. The crowd is definitely diverse but friendly. There's a jukebox, pool table, and ATM.", 
    "review_date": "2014-12-28"
  }
}