{
  "Sg_BvnTHsbc1AABiJjaiPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian H.", 
    "review_text": "Badass bar for good drinks, super strong.. I hear their burger is good so will have to return for that. I love the bartenders, they're so much fun!! Outside patio for diners.", 
    "review_date": "2013-07-09"
  }, 
  "9FOrsYpBwOIHvTzqBpe0Qw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Janette W.", 
    "review_text": "I can't wait to try out the lanes here! We got here a little late on a Tuesday, but it was still pretty crowded, so no bowling for us. Still, we enjoyed a good meal and some good wine.", 
    "review_date": "2014-10-23"
  }, 
  "3LhKzTf4hRTc6NWtFEU1_A": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Kristin P.", 
    "review_text": "The best. Food and cocktails are incredible- no exaggeration - and if you enjoy bowling all the better. Can't recommend this place enough- dare I say its's a sure thing? Yes.", 
    "review_date": "2013-08-25"
  }, 
  "doqM5t20UrhPe2K8VF2ixw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "As you might expect, the primary focus here is the bowling. However, the food is, as you would expect, exemplary. I loved everything and I'll definitely be back.  The service that night, left something to be desired. They were training someone new but, I don't think she had served before. Who cares though! It's the best burger in town! Well, in the top 5 anyway.", 
    "review_date": "2012-07-20"
  }, 
  "RQR-bncvVssevK_WIPWvCA": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Emily M.", 
    "review_text": "We went to MBC for a friend's birthday. The food was great, pitchers of beer plentiful, and bowling super-fun. I loved the small size of the place, it felt like we took over the place, even though there were other people there.  Also, the animations during bowling are hilariously cheesy. Wait too long to take your turn - the \"hurry up\" message is super cute.", 
    "review_date": "2012-11-25"
  }, 
  "ijWQ0R9ra0KF1IGNbhkODQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly H.", 
    "review_text": "The Mission Bowling Club was a lot better than I expected. I came with a hungry group of friends, so we were able to eat a lot of things together. The food here has a lot of flavor and is well cooked. It's a bit on the fried and greasy side. That's my only complaint.  Corn Nuts - Crunchy. Paired really well with alcohol. It's a good snack to have out on the bar.   Green Chili Cheese Fries - The green chili and pork was really delicious. Other than that, fries are fries.   Fried Chicken - Really good! Crispy on the outside, warm and tender on the inside. It's what all fried chicken should be like.   Salmon - Delicious! I felt that this was the healthier dish and so I was really pleased. Trust me, just order it and try!  Mission Burger - Juicy and with lots of flavor.   In conclusion the food seems to come first at this bowling alley because it was really excellent.", 
    "review_date": "2014-07-03"
  }, 
  "xyhIboKojc_HfOAVO7Egfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benita M.", 
    "review_text": "LOVE BOWLING!!!  You would have never expected this place to be a bowling alley. Outside looks like a warehouse!! They have outdoor seating, not that it's a bad thing. They have a bar on the left of the front door and tables for diners on the right. 6 bowling lanes and 6 couches. Couches are pretty comfortable. Service was wonderful. Everyone there was very nice and helpful.  Food was delicious. The burger was thick and juicy but the grilled onions were a little mushy. The fries with the aioli sauce was AMAZING!! The fried chicken... wasn't as big of a hype. Dipped it in the ranch and I just wasn't feeling the urge to get more. The brownies were delicious.  Had a few cocktails. Didn't like the 3 I tried... but my friends enjoyed theirs.  I gave 3 stars because I thought it was A-OK, not really a fan.", 
    "review_date": "2014-06-28"
  }, 
  "lxOcZ1VZ58nSCFgcunecjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake B.", 
    "review_text": "I unfortunately was out of town when my wife and group of friends had dinner here a few months ago so I was excited to come back on the weekend during family time with my wife and son.  We rented a lane for an hour and while it's not cheap it's a great place and atmosphere.  The lanes don't seem to be 100% legit but after you bowl a bit you get to understand how they roll.  I was one away from 200 on my final game too so I can't complain.  They make some cool cocktails at the bar as well.  I look forward to coming back and trying some food and breaking 200 :)", 
    "review_date": "2013-09-05"
  }, 
  "d1ZxMYrgFTSMfa0pARbjkA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "J J.", 
    "review_text": "Oh their chicken sandwich is good.  Unique slaw they put on top.  Their fires were okay but they were fry pieces vs. long normal sized fries.  Maybe they were running out.  They have my favorite beer on draft so I will certainly be back.  Wish their prices were lower but it is SF.  One of the owner's is really cool and fun to talk to.  It does get loud in there so it is nice to sit on the patio and chill.", 
    "review_date": "2014-02-19"
  }, 
  "Vf3DJncooLUHWYele0Cxrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Ok - bowling here is stupid expensive.  I mean like for that kinda cash I should be able to rent 5 lanes.  Then again, peeking at the average score...this crowd ain't pro.  That said, the food here is really tasty and they have a lovely covered patio. So I like.", 
    "review_date": "2012-08-23"
  }, 
  "2TIY4PUb9oyBWn2vmLKy5w": {
    "user_rating": 4.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Bonnie S.", 
    "review_text": "It was such an interesting place! It's small but a very nice facility.  There are only 5 bowling lanes so make sure you make a reservation if you want to bowl! It's hipster culture at its finest.  The food was really really good.  Probably one of the best cheeseburgers ever! And the fries were extra crispy with a delicious aioli .    The only complaint is that we reserved 3 lanes for 2 hours; I guess our reservation was at 3, but we didn't check in til 3:10.  Cut off at 5 - charged for the full 2 hours.  I guess it's fair since we had the lanes from 3-5, and with so little lanes, it makes sense that they'd be strict about it.  But it's just not ideal.", 
    "review_date": "2013-08-23"
  }, 
  "BYQNUm_Mzomjz7vC9AmmJA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Uda W.", 
    "review_text": "I love the bowling set up and the bar, but the restaurant space and food leaves something to be desired. The design is off for one. It's almost like they didn't know what to do with the space. I would have created an open casual space with big communal tables to drink, eat and watch the bowling.  The food is only OK and should just be billed as upscale bar food. The cocktails are delicious, but their wines are not the best, nor is the burger. It is NOT the best burger in town. Seriously.   GO for the Bowling and drinks (hence 3 stars) !! But eat elsewhere!", 
    "review_date": "2013-05-14"
  }, 
  "IUXmQbiQSG97Aez2rOKmcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "An-Nhien L.", 
    "review_text": "Love the casual trendy ambiance. The staff is nice and helpful. My buddy pulled a faux pas and brought in outside food but the waitress was nice about it after we apologized!  Had the Fried Chicken and it was just so delicious! A pitcher of PBR was pretty cheap and the we paid for the lanes/shoes per hour. We got to pick our names and they all had to be 5 characters so we of course took the liberty to choose the most awkward/vulgar/awful names possible. Gave the guy at the desk a chuckle i think--i'm glad he had a good sense of humor!  We forgot to make a reso (*Cough* it wasn't me who forgot *cough*) but they were understanding and tried their best to accommodate us! I love that this place accepts reservations!  I would pick Mission Bowling Club over the chaotic 80% night club 20% bowling alley that is Lucky Strikes almost any day!   Tips: -weekdays are less busy (DUH) -get the fried chicken! -bring cash so that they only have to charge one card--I don't think they require only one card, but I can only imagine how annoying it is to have to split a bill 6 ways every time! -Bring socks! -Give yourself enough time to eat first if you want--you cant eat in the bowling area.", 
    "review_date": "2012-06-27"
  }, 
  "OJyy3jYZecJBKsB_zCFgrQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cyn B.", 
    "review_text": "I had to wait a couple of days to write this review.   My little girl decided that she wanted a bowling party for her birthday. I made reservations a month in advance, paid cash up front for three lanes, two with bumpers for the kids, one lane for the parents. We needed to accommodate a large group of more than 15. Including running an open bar tab, and shoe rentals.  When we arrived to set up for the 2 o'clock party, no one there knew what was going on. They had made other reservations on our lanes, had no clue as to who the party was for, or how many to expect. We got our lanes at 2:20 after much complaining.   We were not well received, and staff/ owners, there are about 5 or so, hovered and complained about any and everything! Even though, I spent several hundred dollars.   I found Mission Bowling Club to be snooty and pretentious when it comes to us locals.  After I posted this, I received a call from one of the owners. She said that she was hoping to maybe work it out and maybe I would reconsider my negative review. I decided to give her my ear.   Unfortunately, she said that there are always two sides to a negative review, she was commenting on some food that a parent had made to share at the party. I had no problem paying a fee for that. She claimed that we left bad tastes in each others mouths. Really?  I suggested they take heed of the negative reviews. When multiple customers complaints take on the same tone. Try to fix it. Try not to repeat it!", 
    "review_date": "2012-09-24"
  }, 
  "76Y70W2mfSaI_XzU3gF8Xw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tricia H.", 
    "review_text": "What is not to love? Killer brunch, yummy cocktails, fun activities like bowling and local art viewing, adorable staff. MBC for the win! xo", 
    "review_date": "2014-06-18"
  }, 
  "6lw2Qs2AW-e8ue2uKXZj3g": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "CJ M.", 
    "review_text": "I love this place. While I can see giving it less than five stars (the service at the lanes could be faster, it gets crowded in the evening hours on the weekends), I get so excited about going that it doesn't dampen my enthusiasm. Mission Bowling Club is great in the afternoons and early evenings when there is less competition for a lane. The bar makes excellent cocktails. I haven't tried any of the food yet, however. The people working the lane area are curteous. I do think an hour works out to slightly closer to 50 or 55 minutes considering setup, but I've had mixed experiences with this and sometimes it seems closer to an hour. I think an hour is not enough time and would personally opt for two, which is the maximum, but either way is fun. If you are reserving a lane online, be aware that reservations can't be made same day. Be prepared for the other patrons to watch you bowl, which might bother our less skilled brothers and sisters at first, but nothing ever seems to be in bad spirits. Overall, this is a must activity for groups of 4-6 looking for a fun as a group.", 
    "review_date": "2014-11-19"
  }, 
  "cfVDBmjnlY2iJaBqz7D2Ng": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Christina L.", 
    "review_text": "Possibly one of the best chicken and waffles I've ever had!! It was more like chicken and deep fried corn bread, but I'm not complaining. The chicken was really good with their chili sauce and the waffles were AMAZING with the maple butter. I'm not a big butter fan, so I asked for the butter on the side so that the waffle wouldnt be drenched in the butter. I was surprised at how maple-y the butter was-- it was like solidified maple syrup and it went perfect with the waffle. I can't get over how good the waffle was.   The wait staff was also really nice. Me and my boyfriend were like an hour late to our brunch/bowling reservation but they were really cool about it. Overall, I would definitely be back for the food (the bowling is kinda pricey unless you have a big group since they charge by lane).", 
    "review_date": "2014-04-28"
  }, 
  "yh8_9Ix1wp9dekvyOZbilQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Christina P.", 
    "review_text": "When I first heard of the concept of this place, I had to admit I rolled my eyes a little bit. It just sounded too manufactured hipster to be true, simply a Lucky Strike with some thick rimmed glasses thrown on top. But I have to say that after experiencing it firsthand I was completely won over!   I was about to give it four stars because they don't have very many lanes, and because only 6 people can bowl at a time. But I now realize that though it might not be the most convenient for large parties, that's actually what makes this place so great. The space isn't huge and it feels intimate, and the smaller numbers allow the staff to be fully attentive and friendly to everyone. So be warned!   The other thing to note is that you can't order food at the bar and restaurant and bring it to where you're bowling. So make sure to leave time to try their food and drinks (which are delish, read on for more on that) before your game starts.   They're known for their burger and understandably so, but I also very much enjoyed the smaller and healthier seared scallop dish I had. It was so well made and tasty - you would never ever think you were eating it in a bowling alley! They also have fancy cocktails, or pitchers of beer if that's more your thing.   Overall my friends and I had such a fabulous time here, and were super impressed by the quality of the food, the service of everyone from the bartenders to the bouncers, and the cute ambiance of the place. I highly recommend it!", 
    "review_date": "2013-05-09"
  }, 
  "XmEywucVDyUP9VJ4SXGjzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "From the outside Mission Bowling Club is so declasse that you know it is going to be chic.  And it is.   And the food is much too good for a bowling alley.  Even better, rather than the menu telling you that they are adding to the check because of the San Francisco health care mandate, something restaurants must and should do, here some of your bill goes to help the needy.  That makes the good food they serve very tasty indeed.  I started with fried chicken and paired it with four bean salad.  Good and very good.  Plain and simple.  And for the price a steal.  The vaunted Mission burger that I ordered medium rare came well done.  Too bad.  But it was good anyway, because the balance of onions, cheese and beef was perfect.    I have a theory that if you don't eat the potato sticks (probably from a can) that come with the burger, then the burger becomes calorie free.  Try for yourself and see.  And the wine pour (I got a glass for the resveratrol) was generous.    Go, live long, and be happy.", 
    "review_date": "2012-06-17"
  }, 
  "jEkr6g8zL9TkLQz9kuHZWw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eggy P.", 
    "review_text": "Oh dear. What happened? The first time I ate here, several months ago, it was absolutely amazing. This past Monday (mid January 2014) it was a complete disaster.   The menu was revised and the only thing that was good was the drink. I am pretty easy to please, so this is saying something.  Mussels and bone marrow: No perceivable bone marrow, but otherwise palatable.  Baby greens salad: completely ruined by way too much extremely salty salad dressing. We sent it back, it came back less drenched, but still overly salty.   Then we waited over half an hour for our entrée, so finally we paid the bill and had them put it in a box to go. This was the porkchop, which was a good-looking piece of meat with some nice veggies, but again it was incredibly salty. Now, I like salt, but this was pucker your mouth salty!*  They appreciated that we were extremely unhappy, and let us know that they were retraining some people in the kitchen. Thankfully, they comped our drinks and salad. The servers were obviously distressed over what was going wrong in the kitchen, so we left a nice tip.  I won't be going back for a while, until they get their stuff straightened out. This is a great little place that seems to be going through a rough patch.  * all was not lost; I took it home and used the fatty parts like pancetta. :-)", 
    "review_date": "2014-01-22"
  }, 
  "WVljAjviZwY4Y3oYC1Qw_Q": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Jeffrey Y.", 
    "review_text": "My preconceived ideas of this place were blown away! At first I laughed at the concept - boutique bowling? But MBC won me over. Such a fun way to spend a Saturday night.  This has got to be the cleanest, best designed bowling alley I've been to. Gone are the bright fluorescent lights, tacky disco ball, and uncomfortable fiberglass seats. Instead, pendant lights, Public Bicycle posters, and leather couches (which they wipe down in between each group session!).  The staff and crowd were unpretentious and nice and laid back. Fairly inexpensive pitchers of beer with great service to clean up your empties. The windows looking into the kitchen was a plus - watching the cooks make juicy burgers was so distracting from my poor bowling game.", 
    "review_date": "2013-04-19"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "Only 69 reviews?  Surprising!  I thought people would be all over this place..  Before one of my friends moved across the country for med school, a few of us got together for one last boys night out to send him off right.  After all, since we weren't at Mission Bowling Club to do any actual bowling, what better way to send off a future doctor by loading him up with fried food, burgers, and beer?  After starting off with a pitcher of beer, we ordered the Home Fries and Fried Chicken appetizers to share and a round of the Mission Burgers for everyone.  The Home Fries were pretty good (<a href=\"http://www.yelp.com/biz_photos/hEXhf40Y9PdnYJzT_LEJlg?select=Z1cf09enbz8aNyZ7-GVtxg#ZrBCsmq-8lyNP_9qYIUPAA\">yelp.com/biz_photos/hEXh…</a>), and I liked how they were lightly fried and seasoned.  They tasted even better with the aioli, but I wouldn't say the dish was amazing.  Solid, but not amazing.  The Fried Chicken, on the other hand, came highly recommended by one of my friends and it was easy to see why (<a href=\"http://www.yelp.com/biz_photos/hEXhf40Y9PdnYJzT_LEJlg?select=Z1cf09enbz8aNyZ7-GVtxg#FSqdmh6we1qZKAnP2Zi14g\">yelp.com/biz_photos/hEXh…</a>).  The breading was thin and crispy, and the meat at the center was moist and tender.  I thought the ranch dipping sauce was a little heavy on the dill, but not terrible.  Now as good as the appetizers were, the burger was definitely the star (<a href=\"http://www.yelp.com/biz_photos/hEXhf40Y9PdnYJzT_LEJlg?select=Z1cf09enbz8aNyZ7-GVtxg#ZAJ9WBJh11PNw4NnSKmeug\">yelp.com/biz_photos/hEXh…</a>).  All of us were fans, and one of my friends even claimed it was the best he's had in SF.  Although I'm not sure I would go that far, it's definitely one of the better ones I've had in the city.  The meat was very well seasoned, the patty was juicy, and the grilled onions were a great addition.  Lots of flavor all around.  The only part of the dish I wasn't big on had nothing to do with the burger - I would have preferred regular fries instead of shoestring, but that's just me.  Despite its somewhat inconvenient location to where I live, I know I'll be back at some point to both eat and bowl.  Other nearby alleys might have more lanes (MBC only has six), but I'm pretty sure none of them can offer the same chill atmosphere, a full service bar with several unique beers on tap, AND great food.  Even if there's likely to be a wait, that's one hell of a burger to help pass the time!", 
    "review_date": "2012-07-15"
  }, 
  "UySLQuZU6SOuuMO4J74x7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven F.", 
    "review_text": "Too bad they don't have more lanes (only 6).  Clean and nice venue, good food, full bar.", 
    "review_date": "2013-07-08"
  }, 
  "WPBrjBbk76ZtZQ8QpG09cQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Henry L.", 
    "review_text": "Great place for group events.  Having drove and walked by numerous times, I've finally had a chance to visit this place in person! We were a group of 6, played for about an hour, got a pitcher of beer, and ended up paying about $13 each including shoe rentals. Not bad for mission standards.  Plus, the atmosphere was great, with nice decoration in the entrance, nice clean lanes, a clean bar with lots of beer selection, clean couches, and in general a cool, relaxed vibe where everyone can go and have fun.  Since I went at night, I was hoping for the neon \"cosmic\" bowling theme to show up like they do at other places, but alas, cannot ask for too much :)  In general, a nice, chill, cool place to host events and bring groups!", 
    "review_date": "2014-08-28"
  }, 
  "jvAFUKSG2cUJeA95_OVTfw": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "Jeff M.", 
    "review_text": "I was here last Saturday pretty late celebrating my birthday with some friends and we had a great time. I looked this place online and decided to go. The food was awesome and the service was even better.  It feels like an exclusive place when your there because there is only 6 lanes which in a sense feels like your in a bowling club. I want to thank Michelle who was a great help to me and my friends as well as Fred who played some James Brown as requested by me up until closing time. Will definitely come back on my next visit to the city.", 
    "review_date": "2014-10-22"
  }, 
  "NnzhHARuS94VzVQ-WqIdxw": {
    "user_rating": 4.0, 
    "user_location": "Rockridge, Oakland, CA", 
    "user_name": "Dalton C.", 
    "review_text": "4 stars for a killer bar (especially with Susan running it), beautiful interior, and awesome front patio. It's an awesome, fun place to spend time with a big group. The staff is so friendly and happy to help.  I knocked one star off for the expensive prices for bowling. It's very costly to party here... make it worthwhile!", 
    "review_date": "2014-06-14"
  }, 
  "pRDdcScJUj6lA60rFUH1VA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandre J.", 
    "review_text": "The hype around the burger brought me there. The place is awesome (the first hipster bowling I have ever seen), the burger is good, the fries are incredible. I'll come back and try to get a lane this time.", 
    "review_date": "2014-06-20"
  }, 
  "w8tSXcAF5yO4MiE9dDnLwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicholas R.", 
    "review_text": "Great place to grab a seat at the bar and get some tasty cocktails and appetizers. Can't go wrong with the fried chicken on stick, and a Paloma to drink!", 
    "review_date": "2014-02-13"
  }, 
  "cCPjASKs5YpMB4BmN2oSZg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike H.", 
    "review_text": "The concept of bowling, drinking, and eating was underutilized in SF until the last couple years. Now there are various competitors around the city. Mission Bowling Club is more approachable and serves better food.   We came here for a birthday party, and the guest of honor always chooses solid venues for great people to meet.   Get your drink on - the beer list here really sticks out. For food, I can vouch for the excellent jerk pork shoulder sandwich, the really good burger, and the fried chicken. If we don't plan on bowling then plenty of the non-finger food dishes look compelling.   Pro move: Eat and drink only with your left hand and bowl only with your right. The only thing in this place than the bowling balls are the bowling balls' holes, of course.", 
    "review_date": "2013-05-11"
  }, 
  "jhPAC7UyPiRFNPlNQYMMXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kazu O.", 
    "review_text": "Bowling, decent food, and a nice bar in the middle of the Mission? Pretty sweet!   I threw my friend's bachelor party here (No, I did not bring strippers or blow into the bowling alley). They were more than accommodating when I was planning this event, and they made the whole experience painless to organize! We all had a great time here!", 
    "review_date": "2012-11-02"
  }, 
  "aZNC53EYiGJAECV7_FZgKQ": {
    "user_rating": 1.0, 
    "user_location": "Kaneohe, HI", 
    "user_name": "Kalea K.", 
    "review_text": "One word: Disappointed. This is now the 4th time in a row that I arrived here only to find that they were closed for a private event. The first time that I was rejected, I didn't check their calendar ahead of time so, I will give them a pass for denying me entry due to their \"private event.\" But, for the second, third AND fourth time, I had diligently checked their calendar online ahead of time on the DAY OF, and was happy to find that they did not have a private event going on that day. Each of those times, I arrived at this joint only to find out that they will be \"closed at 5:30pm for a private event.\" And the most recent time I was denied entry was on a Wednesday afternoon. Ok. Then why didn't you update your calendar to reflect this closure? Your calendar said you were wide open. I had even checked the calendar on your freakin'  website no less than 2 hours before I arrived and the coast was apparently clear -- your website did NOT mention being closed for a private event. Each time, for THREE TIMES IN A ROW, I arrived at your doors, only to find out in the last minute that you decided to close your doors for a private event -- AND THIS HAPPENED TO ME THREE TIMES IN A ROW NOW. What a waste of time, even after checking the calendar on your website for availability. My advice to future patrons: Call 30 minutes ahead of time to check their availability because the calendar on their website is NOT reliable -- even on the day of.", 
    "review_date": "2014-02-05"
  }, 
  "l1s_15WpYmi-unlNhaKvMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny K.", 
    "review_text": "The burger here was delicious and the beer selection ranged broadly from overpriced PBRs to cutesy Japanese brews.   4 stars for food, beer, and service.  Pro-bowlers beware: The rightmost lane keeps bad score.  The number of pins struck were miscounted at almost every turn. :(.   Minus two stars for the broken counter.  Plus one star for the fun indie playlist.    All-in-all, this was a decent hangout spot for a moderately-sized party.", 
    "review_date": "2013-03-12"
  }, 
  "t2Gj1DlQt5xNUIKD90BQ6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff B.", 
    "review_text": "MBC has consistently been a good experience since my first time. Friendly staff and good food. Luckily it hasn't been so crowded where reservations can make or break your experience. Especially like the brunch here with football on the projector. Loco Moco and chicken and waffles are money.", 
    "review_date": "2014-12-14"
  }, 
  "WVgmvTObpZHvvgzsWRC3bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen C.", 
    "review_text": "MBC is not your hometown's bowling alley.  It's a terrific venue with creative drinks, food, and atmosphere.  Great staff, great service, and great fun.    It's just that simple.  Build it and then will come.  Find it and settle in.    Get your bowl on.  And to think, I was 'this close', to a high of 151.", 
    "review_date": "2012-11-03"
  }, 
  "riGkQwFY0wWHwsa5HASVbA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chia L.", 
    "review_text": "Vibe is great. Drinks are great. Staff is awesome. With reservations backing up until when we're gray and old, it's definitely a good idea to book a lane waayy ahead of time.  The food was less impressive though.   What we ordered: Fried chicken with blue cheese ranch green taco salad with pineapple and avocado chili verde mission burger  Um, I honestly what was going on with the burger. Large and really thick patty over toasted bun, with the standard pickles, lettuce, and tomato on top. One thing I noticed though was that it had no sauce. So far so good right? But one bite in, I realized the meat had less meat texture and more meat loaf consistency. And I do not like my burger patties to be squishy. On top of that, it was incredibly salty to the point of bewilderment whether the seasoning had been an accident or not... Just a no-go on this one for me.  Green taco salad was good. Rolled up into cigars and deep-fried, the taco shells are nice and crunchy. Add the slightly sweet pineapple avocado salsa on top and it softens up nicely. The strong lime juice, though keeping the avocados green and attractive, distracted a bit from all the other flavors. Alright in my book.  Fried chicken came skewered on a stick dangling over a pool of blue cheese ranch dressing. The chicken was fried nicely, with incredibly juicy and tender meat inside. The marinate is oddly sweet and felt more like a dessert than a dish. The ranch also erred on the sour side. Not a fan, but I'm gonna blame this on personal taste.", 
    "review_date": "2015-01-18"
  }, 
  "GvRh9s4sUpSVJYy1U5czKA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan G.", 
    "review_text": "This is really a 3.5 star review, but I mainly wanted to review the food. For all the mentions of the burger in other reviews, I really thought it would be a top-notch burger. It wasn't. It was a lot of meat, but the toppings were thin, mediocre and barely recognizable. The bun wasn't anything special, and the fries -- I would have preferred just normal fries, not shoelace fries.  Would have made this a 3-star review, but the service was solid, atmosphere was great and I loved the indoor bike racks.", 
    "review_date": "2012-07-19"
  }, 
  "zyLIp7DRFqeIE1Grrh3Zng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derrick V.", 
    "review_text": "Small bowling alley in the Mission, featuring food from the Mission Chinese food team.   The burger has received a lot of press so I had high expectations. Overall a very juicy burger, but a tad undersalted for my taste. The fried chicken suffered the same problem with seasoning but was nice and crispy.  Bowling was fun, but kinda cramped in the 6 lane alley. Good cocktails.", 
    "review_date": "2012-09-20"
  }, 
  "HwxKs9Cu-y87kCIbfFedSA": {
    "user_rating": 5.0, 
    "user_location": "Bellevue, WA", 
    "user_name": "Kay C.", 
    "review_text": "Awesome place!  Really great food and reasonably priced at that.  Bowling was super fun as well. Love that the bowling lane chairs were these nice comfy leather couches.  Drinks were solid.  Food was seriously great - we tried deviled eggs, fried chicken (both the appetizer and the sandwich), fried oysters , burger ... I was pleasantly surprised and impressed.", 
    "review_date": "2013-11-24"
  }, 
  "Jl7wukjs3Y0WSQOQQ1vkgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nei N.", 
    "review_text": "Bowling is great. Good food is even better. What happens when you have both? Mission Bowling Club! The lanes are pretty pricey, and they fill up fast. The plush leather upholstery is a nice touch though. If you don't get to play, the food and drinks alone are worth the trip.  The mission burger is a serious burger. And by serious, I mean serious. The 1/2 lb. patty is cooked to perfection, with a sear on the outside that gives it a delightful crispy crust and a juicy medium pink center. This is right up my alley as I generally don't like burgers cooked too rare, because instead of having a tender crumbly patty, it becomes mushy and pasty. The burger is also seasoned very well. It's salty enough to make the rich beefiness pop, and the flavor maintains its integrity as it mixes with the grilled onions, cheese, and bun. The only thing that would make this burger better is to slap it on a charcoal grill. It would be divine to have the same crust and juiciness with just a kiss of smokiness.   The jerk pork shoulder sandwich was really good when I first came here. It had big smoky flavor, and the warm spices gave the pork flavor some depth. It reminded me of my own barbeque since I use jerk spices in my rub. Unfortunately, it wasn't as smoky the last time I ordered it. Too bad...  Don't forget the home fries if you're here for brunch. They have a light but very crispy exterior, and the inside is nice and soft. I also really enjoy that there's rosemary to add an extra herby flair.  Bowling + Good Food = Duh Winning", 
    "review_date": "2013-01-30"
  }, 
  "wo38nW_JbXC4m_zlaN86wQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Amy L.", 
    "review_text": "I rate this place 3.5 stars because my dish was very delicious.  I had the summer rataouiie.  It came with eggplant, and squash on top of polenta.  The polenta had a tasty flavor to it.  The only problem I had with my food was that the portion was smaller than I expected and I was still hungry after licking the bowl clean.  The reason why I'm rating this place 3.5 stars is because my boy-friend orderd a burger with no onions and when the server brought it over, he again asked if the burger was without onions and the server said it didn't have any.  Well, this burger had onions and he said it was so salty it tasted like someone dropped the whole salt container in.  The fries the burger came with were really good.  It tasted like they were fresh and not previously frozen.  The server we had was very nice.  (She wasn't the one who brought over the burger with the onions.)  Overall, I had an enjoyable time.  My food was yummy.  I just wish there was more of it and it's too bad the burger came with onions and tasted like salt rock.", 
    "review_date": "2012-10-13"
  }, 
  "thN6J0phXSgzbwmjjwYQWA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Katie H.", 
    "review_text": "This place was really fun!  I haven't bowled in many years, and as a work team building event, it was perfect.    It's a small, swanky, 21+ alley, with just a few lanes, and the shoes weren't that gross!  We reserved three lanes, so there was no wait, and they kept the food and drinks coming the entire time.  The mule was fabulous... I think I had 4 of them, and the food choices were upscale versions of what you'd typically see in a bowling alley.  Burgers (including a vegan version), corn dogs (w/ sausage), and a variety of fried apps and salads.  My biggest learning was that I'm a terrible bowler, but I still had a great time with my colleagues.", 
    "review_date": "2012-05-08"
  }, 
  "Z0yHptbS93271s_h6LJOMw": {
    "user_rating": 5.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Alice C.", 
    "review_text": "HUGE thank you to mbc for helping me make my boyfriend's surprise birthday party a fun and flawless one!  i was eyeing mbc for my boyfriend's surprise party around thanksgiving and had e-mailed them and turned out everything was pretty much booked up until january (they only have 6 bowling lanes).  i asked nicole from mbc to put us on the wait list and lo and behold, 2 lanes opened up and i snatched them up right away!  from reservation of the bowling alleys and restaurant to service, the mbc team really have service down to a t!  personal thanks to:  nicole:  for putting our party on the waitlist and getting back to us.  being patient with the reservation process even when it's during the thanksgiving holidays! jarrod:  for being our awesome server for our party of 9 and being SO patient with us and getting our food AND drink orders down and letting us split our bill on multiple cards. fred &amp; adrian:  for checking us in for bowling and getting our shoes ready to bowl and accommodating to 5-10 minutes late start as we wrapped up dinner.  mbc isn't cheap, but you really get what you pay for for food, drinks, bowling, music, and service.  there's a $10 cake cutting charge because only the kitchen is allowed to cut the cake.  they will help set up and light the candles and bring out the cake.  expect gourmet delicious grubs from mbc!  everything was SO good!  i got a small bite of everything on the menu and loved them all!  fun times, we can't wait to be back!  thanks again!", 
    "review_date": "2014-12-17"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Pretty sweet setup, especially if you plan ahead and reserve a lane. Not only is the bowling decent, but so is the bar and the food. The fried chicken was surprisingly great as were the fries and the mushroom fritters. Sure the bowling isn't cheap, but it's fine for a group of six...", 
    "review_date": "2013-03-27"
  }, 
  "FbgqbR_Tr8hTHjYy32KG4A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim E.", 
    "review_text": "Ever seen the episode of Southpark that takes place in San Francisco? If you haven't, you should. This bowling \"club\" basically epitomizes the stereotype that Trey Parker so brilliantly pointed out in regards to San Francisco; That this town is completely full of itself. I mean, what other city takes something as sacred to American culture as the crusty bowling alley, and turns into a fine dining, wickedly overpriced, nauseatingly hipster experience? The all American bowling alley, complete with its inedible food, piss beer, and tacky decor, has in many respects been at the heart of this great nation. Mission Bowling \"Club\" has taken this key piece of Americana, and completely sanitized it. I gasp to think what \"the dude\" would say about this place. Utter sacrilege, and frankly, an assault on  \"Merica!", 
    "review_date": "2013-02-18"
  }, 
  "cHdSQISeMpp8HlCWgNb1QQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bianca C.", 
    "review_text": "Great place in the mission to grab some drinks and food. I didnt actually bowl so cant really say anything on that front. The staff was friendly and helpful. The food was great! I definitely liked the mission burger! The devilled eggs are also good", 
    "review_date": "2014-02-18"
  }, 
  "u_tsaDmAgGnmOUGdbA2tNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Racquel N.", 
    "review_text": "\"Welcome to your Friday night.\" When your server opens with that line, you just know your evening's gonna be awesome.  We heard great things about the burger and were very eager to try it. It was well-seasoned, juicy, and a pretty good size. But what really got my attention was the fried chicken appetizer. Perfectly crisp on the outside, moist and tender on the inside, with a tangy ranch dip. It was glorious. I will even go out on a limb and say that it was the best fried chicken I have ever had (and believe me, I've had a LOT of fried chicken). And now, months later, nothing else comes close. It was a decent portion for an appetizer, and at $8, it's a steal. The dirty martini was disappointing, but they had a sizeable enough beer selection to more than make up for it.   I don't go to a lot of bowling alleys, but I think it's safe to say that this is one of the better looking ones out there. The lighting was great -- bright enough so that you could see what you were doing, but not bright enough to ruin the atmosphere and make everyone look ashen. None of that garish fluorescent and neon crap. They had some interesting posters on the walls too. With just six lanes, there was a really long wait, so we didn't get to bowl. Not that I'm broken up about it, since I'm not much of a bowler anyway. It's a fun alternative to the dreary dive bar scene, so I'm glad there are options for a night out without sacrificing your need for good lighting. ;)", 
    "review_date": "2013-05-15"
  }, 
  "dJtrZhOFp7TAF685qc8JjA": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Raquel R.", 
    "review_text": "Like drive-in movies, there are too few bowling alleys around. What a great idea, and what a good location.   I went for my friend's birthday tonight, I missed the bowling fun, but I did enjoy the bar. The decor is really welcoming. Everything is pretty hip/modern, and overall really comfortable. The patio in the front is really cute, and again, comfortable.   Sony is the most awesome bartender I have ever come across. Super friendly, and gave us the best drink recommendations. Aviation is my new favorite!    I don't know the name of the guy who was checking ID's tonight, but he also deserves to be part of the good review.   I am already planning a trip back! I heard the food was good, so I'll have to try it.", 
    "review_date": "2012-08-27"
  }, 
  "ljaDy_lIKNWr2MfjV6Mt9w": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Eric Y.", 
    "review_text": "A great spot for hanging out with friends and having a good meal. For a bowling alley, it's almost outrageous how good the food is. The restaurant is almost never full but make sure you book in advance in order to be able to reserve a bowling alley. With only a few alleys, it's almost always full!", 
    "review_date": "2013-05-28"
  }, 
  "y_jl-bErj1mnb4KF04F74Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "I'm excited to host our team event (group of 12). Great vibe. Friendly and helpful staff.", 
    "review_date": "2013-11-01"
  }, 
  "48mOAMtqs3AUgT4OL2UnlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily L.", 
    "review_text": "Pretty hipster but fun.   There are only 6 lanes so a reservation is necessary. The food is also pretty good and well priced.", 
    "review_date": "2014-04-09"
  }, 
  "NFM0QH6X3vQCsXYry4j63g": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Mike L.", 
    "review_text": "This place is AWESOME!  When I go to \"bowling\" places there's usually a restaurant/bar inside of the alley.  This place is like the opposite!  A few lanes in a restaurant/bar!  So I came in here with the girly to grab a drink and check the place out.  Upon entering, the place has an outdoor patio area with some pretty cool abstract and natural art.  We sat down at the bar and ordered some local beer from the tap (they try and support local brew!).   Ambiance: There a patio area, inside area for dining and a bar area.  They project sport events along the wall so that was cool.  A little further in, there's 6 bowling lanes with sofas.  Very chill and lounge like!  I love the fusion of bowling-lounge!  Service: The service here was very friendly.  We entered and were immediately greeted by the hostess, though we just grabbed a seat at the bar.  They even have a section of the bar that is lowered, designated for the disabled, which is very thoughtful!  The bartender was very friendly and knowledgeable about the beers and drinks.  Food/Drink: We didn't order any food, but the Bar Harbor drink was awesome abeit a bit pricey ($10).  If the other drinks were like this one then they've got it good.  The food looked like a pretty decent portion and the prices were about average.  Overall, I'd love to come back and chill here with a game or two of bowling!", 
    "review_date": "2014-06-03"
  }, 
  "euZebQQYhgDuUZjBjbIC_Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Teresa T.", 
    "review_text": "I love this place and wish I loved closer to it.   I went to a meet and greet event tonight here with a group of about 30 people total by the end if the night. The organizer didn't make reservations, but they were super accommodating and have the bartenders a heads up. We stay around the bar area instead of sitting in the areas reserved for dining.  There was a great vibe, I was absolutely feeling it. What sweetened the deal was their great selection of beers. I had the Blind Pig IPA. Delicious. There was also a dark IPA that I will try next time.  $7 for my beer was a little painful, but the great people and awesome atmosphere made up for it.   It's a little far from the bars in Valencia, but still close to BART. A definite winner for hanging out after work over a couple drinks and maybe a game. I'm a fan!", 
    "review_date": "2013-09-18"
  }, 
  "Ve0LUwcrzxL7w0RYgY4Aaw": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Katy H.", 
    "review_text": "Once in a while there's nothing more fun than going bowling with some friends. Growing up in the suburbs it wasn't too hard to find some seedy, stinky bowling alley to hit up for $10-15 a person for a few hours. But living in the city whodathunk someone would come up with the genius idea of putting a small bowling alley right smack in the Mission in SF?  Only open for a week, Mission Bowling Club is already a hotspot in SF. With fantastic cocktails, multiple levels of eating/drinking space and 6 really gorgeous lanes for bowling, this is by far the nicest bowling alley I've ever seen. Forget your Lucky Strikes, MBC might be 1/4 the size but is easily 4x nicer.  Staff was really accommodating and polite and though I didn't eat, I spied a few folks nomming on what looked to be some pretty awesome corn dogs. Can't wait to come back!", 
    "review_date": "2012-03-25"
  }, 
  "K7-zOceF1slgqJTZSKe7YQ": {
    "user_rating": 4.0, 
    "user_location": "Imperial Beach, CA", 
    "user_name": "Nadiyah S.", 
    "review_text": "Boutique Bowling!  This bowling alley is incredibly missionesque- simple but modern and updated, a little new with the old, and yes, there are hipsters.  Lanes here are limited, but there's great food and drinks to indulge in on the side.  This place is a great place for small groups, and fun to hang out at, even if you're not bowling.", 
    "review_date": "2013-03-12"
  }, 
  "s1mD1PvJQrAYHfNG9UDYJw": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Lily T.", 
    "review_text": "My coworkers and I had a fun-filled night here. Everyone ordered the Mission burger (with the exception of one vegetarian who got a vegan burger) and we were all in food heaven! It was one of the best burgers I've had overall, but it is THE best burger I've ever had at a bowling alley. The drinks were no joke either. After two Kingston Mules (basically a Moscow Mule) and a Cooler, we stopped caring that we couldn't bowl for crap.  One thing for sure is that I wouldn't recommend this place to my friends who are \"real bowlers\" because it costs some serious dough. Our party of five laid out $75 for one game (and I brought my own shoes, so that's one less shoe rental). Still, we walked away with a smile on our faces.", 
    "review_date": "2013-02-18"
  }, 
  "87hSO1uA83c5SQ9x8hoDlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystal T.", 
    "review_text": "So I really do love this place. It is a one stop shop for an evening of fun! We had dinner in their small classing dining area. They have a fully stocked bar and 6 bowling lanes. Dinner was a bit pricey, but you're kind of paying for the ambiance. The food itself was pretty good. Drinks were average price and bowling a bit over average, but its almost like you're own private bowling party so it was totally worth it! We ordered dessert and they brought it close to the lanes so we could bowl and dine! Loved the panicotta and the smores brownie! A definate must try. My friends and I all enjoyed ourselves!!!", 
    "review_date": "2013-01-20"
  }, 
  "TZatgTt9RyYGlBa7uZTgBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terry K.", 
    "review_text": "I didn't even bowl here, just had brunch!  I had the fried chicken and waffles, and the eggs with chips and guac.  Both were exxxtremely delicious!  The chicken was atop a generous amount of chili sauce and the waffles were fluffy and chewy.  The eggs are a good option too, and nothing here is particularly healthy unless you get the side salad, which is a bit dull, but I would guess that every breakfast item is top notch.  MMmmm.", 
    "review_date": "2013-07-09"
  }, 
  "toOht-Wn-X3g30GFpMkP4w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnson S.", 
    "review_text": "Interesting place hidden in the Mission! Came here with a group of friends around 4 and the workers here are pretty nice since our entire party wasn't here yet so they started us on the \"practice\" round even though they were going to be busy. We had an hour reserved for 2 lanes, at the end of the game I checked my time and it wasn't even an hour yet. So I'm not sure if he included the \"practice\" time into it (which he made it seemed like it wasn't) or... we got jipped 15 minutes! Only 6 lanes, so either come early or make reservations. They're also limited in bowling balls that they have or size/weight you want. I didn't care too much since I don't really consider it a \"full blown\" bowling alley... otherwise I would have went elsewhere. You don't get to control the screens as much... you basically have to go up to the person up front to add names if you do, which is kind of lame. More of a hangout spot with friends.  Food here, I didn't get to try much. We only got a few appetizers... the fries were really good though. Nice and crunchy. I think it came with an aioli dipping sauce that was smoked... I didn't care too much for it. I preferred the ketchup sadly. lol. But the fries alone were good and seasoned. Also tried the hush puppies... probably won't order this again next time.. nothing special about it and rather boring and bland.  Wish they had more beers on tap, but they still have a pretty good selection of other drinks.  Overall, nice place to just stop by and hang out with some friends. Bowling here can be a bit pricey compared to other places you may be used to... but again, it's more for the socializing aspect and it is in the city... so meh! Will definitely try the burgers next time. I feel kind of schizo since I'm reviewing two separate things... the bowling alley itself... I would give it a 3. The food aspect... a 4. So... I would give them a 3.5 if I could.", 
    "review_date": "2013-12-07"
  }, 
  "wmWni5egGi-ZW1SVAX7XYg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Angela C.", 
    "review_text": "Very clean and the decor was so nice.  We ordered shoestring fries &amp; the fried chicken! The Fries were delicious...amazing avioli sauce... The Fried chicken was a little oily, but bomb.   We went early because yelpers said it gets busy and they were right. Go early or call in :)", 
    "review_date": "2013-05-28"
  }, 
  "Eypq5gLLjCapBVVnMw_MyA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Misha T.", 
    "review_text": "Great fried chicken, ok fries (not a fan of the accompanying sauce), and bowling.  That pretty much sums it up. I mean you know it's hipster bowling. Nothing wrong with that. you even get to use a PBR branded ball which probably earned the dude who thought of it a bonus. Capitalism?", 
    "review_date": "2014-02-10"
  }, 
  "4PIcs3X-Ro_KoczDJ3y4ZQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Charmaine L.", 
    "review_text": "great beer, good food, fantastic service, and bowling. somewhat hidden in a barn-ish warehouse in the mission.   ordered the egg sandwich, biscuits and gravy, and their famous mission burger. the portions were generous and very delicious. the home fries were very crispy and flavorful on the outside while the insides were creamy and comforting. the biscuits were fluffy, the savory gravy was thick. the meat in the burgers was fresh and cooked well, however it was cold by the time they were served, and so were their fries that resembled pik nik potatoes. i quickly became envious as i saw a plate of fried chicken pass by, i should have ordered that! our waitresses were very friendly and full of smiles which was pleasant.   the tab for 4 with drinks came out to $90 before tax/tip. and that's before bowling.", 
    "review_date": "2012-07-10"
  }, 
  "QOiZu9pn65H7zR49_DdVdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony R.", 
    "review_text": "That's a great burger. Well seasoned. Enjoy the tangy caper aioli on it as well. Wasn't crazy about the bun. Wish it was heated to soften it up. Patty was literally oozing juices as it was set in front of me. Points for that.", 
    "review_date": "2013-06-09"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 4.0, 
    "user_location": "South Bay, CA", 
    "user_name": "Kim N.", 
    "review_text": "I totally forgot that you can get the Mission Burger which was once sold at Duc Loi Supermarket down the way here. Great patty, cheese, soft bread. However they seemed to not have the pickle to cut through the salt and fat, which is key. THe piece of lettuce was a bit sad too but we showed up right before close of kitchen. The \"chili cheese\" fries they had were pork shoulder with cotia in a nice sauce. I could have made that my dinner. Watched folks bowl a few rounds but was never enticed to go toss hard balls myself :)", 
    "review_date": "2014-07-07"
  }, 
  "PMmDYnKwGKTzPr7qyr4CFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney S.", 
    "review_text": "I have never been here for an actual round of bowling but it does look like fun except I'm usually too busy stuffing my face with their delicious chicken and waffles. I mean could it get any better on a Sunday morning!?   If you're in the neighborhood stop by and try the Mission Burger! Aged to perfection.   To rinse it down, I recommend the honey bee cocktail if you're a vodka drinker like myself but they also have a shit ton of beer to choose from if you aren't!", 
    "review_date": "2013-09-07"
  }, 
  "8wT-FkHPs6bmEvLG5GawIw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mariza H.", 
    "review_text": "Bad service sums it up.  We were charged for a drink we didn't receive. We got that taken off. We waited an hour and when we checked in they said they thought we had cancelled. We waited twenty minutes for a server and then finally got one after I got up to find one. Our drinks got forgotten and/or brought out after another twenty minutes. The servers were rude and slow.  The food was maybe three stars, ham on the croque madam was too salty. The burger was ordered medium rare and served medium well.", 
    "review_date": "2014-02-16"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Strike.  Three star score: 144 average, 200 remains elusive.  Four star brunch: Two large slices of fruit compote topped French toast were delicious. Bite of my friend's bacon and egg sandwich was outstanding.  Five star scene: Old warehouse renovated into a six lane bowling mecca. Wood tables with pin for legs. Balls stored in iron racks. Leather couches. Vintage signage.  Hourly rates range from $35 to $55 depending on day of week and time of day. We had time to bowl four games in an hour. Absolutely worth it.  Super popular for a reason. Mission Bowling Club bowls a 300.", 
    "review_date": "2012-12-20"
  }, 
  "XzG908fzJ3vtHUaTrLKr2w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jay E.", 
    "review_text": "Awesome food and service. Perfect burgers and cocktails.", 
    "review_date": "2014-09-07"
  }, 
  "rbqHGnbuoz5HgPpUAIXL8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rachel g.", 
    "review_text": "fun", 
    "review_date": "2014-01-03"
  }, 
  "kBogzjf4Okfi4_EQUkfZSw": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Alison W.", 
    "review_text": "This was a super fun place to check out. We were there with about 20 people in our party and they were very accommodating. First we hung out in the bar area and had some drinks and food. The hubs and I tried the chicken sandwich with a margarita and beer. Yum! Next our group had reserved two lanes to bowl for two hours. We had a blast!  Staff was super friendly and the food came out quick, even with all of the people that were there. I would definitely go back.", 
    "review_date": "2014-05-01"
  }, 
  "OtA3JyBtxjl-Wo3l_iWmzQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michele C.", 
    "review_text": "Amazing experience with full buyout! Company holiday party with about 85 people. Karaoke, photo booth, bowling, kids crafting, movie area and popcorn, glittery centerpieces.....and the staff handled it all with ease. They were incredibly helpful the entire evening and helped keep the pace. The drinks were excellent, the food was excellent. Fun was had by all. I propose we have our holiday party there every year! Thanks MBC!!!", 
    "review_date": "2015-01-12"
  }, 
  "uMLAo3ALUySWisGSlWX93g": {
    "user_rating": 4.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Niño M.", 
    "review_text": "- The decor was fancy hipster.  I liked it alot.  Perfect spot to have a date night!  - I didn't go bowling here, but it looked like the peeps bowling were having a great time.  I went here to eat and draaaank.  FOOD - Burger is a 7.5/10 - it tastes great, but nothing that blew my mind away (like Father's Office in LA).  - Fries were really good too. I'd eat those fries all day long yo!  - A friend ordered their ginger beer and it was de-freakin-licious.  - The highlight (for me) of the venue is their beer list.  They have great breweries like Russian River on their list.    - Parking is easy to find on the street.  - Service was great!   - I'd definitely come back again", 
    "review_date": "2013-08-30"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "I guess I can finally review this place... or should I say, my favorite new place in San Francisco, as everyone is finding out about it.   I've been here about a dozen times for everything from Birthdays to Burner parties to Brunch (bottomless mimosas plus bowling balls equals brilliance by the way) and I've had a ball every time.  Love the cocktails (Molly, you rock).  Love the house-made ginger mix.  Love the food (ahi tuna, corn dogs, and the that chicken dinner especially)   Love the brunch (crab benedict, chicken and waffles, french toast with sides on a big plate for shared dipping, and chilequilles with the pork)  Thanks for making bowling \"cool\" again. (first time since the 50s I think). I really missed it.", 
    "review_date": "2012-11-21"
  }, 
  "_if5711_QFV-vwAuhwBH9g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam P.", 
    "review_text": "Look I want to write a good review for this place..I love this place in some ways. I love coming here on a Saturday or a Sunday day and eating in the outside cage area. But it is a bowling alley, and my review is for what the place represents itself as: a bowling alley.  I get here at 8:15 on Thursday and put my name on the walk-in list. The lady says she will probably have a lane at 10pm. She asks for my number to put down for when a lane is available and I give it to her. Cool. I go to a nearby bar. 10pm comes and goes. Then 10:15. Then 10:30. I arrive at 10:36 having gotten no phone call. A lane is wide open. The lady gives it to me. Me and my date bowl for 15 minutes before the lane breaks down. Apparently a pin is stuck in the tube under the gutter. Fine. Then it happens again two bowls later. A pin is stuck. Next thing I know it has been an hour and we haven't finished a two-person game.   The lady says I don't have to pay. Thanks for not charging me for an hour of my wasted time. I VERY politely ask for an opportunity to be comped next time I come (\"pleeasse I really don't mean to be a d*** about this, but I feel my time was not well spent here\"). She smiles, shrugs, and says she'll ask her manager. Her \"manager\" comes over and smiles, shrugs, says she understands why I am frustrated for wasting my time, and the concludes that she doesn't feel comfortable comping me for my wasted time.  Thanks Mission Bowl. Way to treat your customers. You wasted a full 3.5 hours of my time and you don't even offer me an hour worth of free bowling in return. I've heard the word STINGY but I didn't picture your establishment in my brain dictionary under this word until tonight.", 
    "review_date": "2013-04-05"
  }, 
  "-aq0KKWyMbhugu183UGj7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie A.", 
    "review_text": "This is a review for the food as we did not bowl here. They take reservations so please reserve online! Please find this review funny.  My 3 companions all got the burger and I got the fried chicken and ordered a side of fries, seeing all the pictures of the pillows of potatoes from fellow yelpers labeled home fries. To my dismay, the fries that came were NORMAL fries :(  The burger was delicious (got a few bites in from my bf) but the fried chicken was okay. I just came back from Houston where I had the best fried chicken at Breakfast Klub and I cant stop thinking about it and I won't shut up about it.  The ranch and aioli sauces were not palatable for me.  My friend really liked the magnolia morning dew beer.  Overall it had a good atmosphere and the food was good an reasonably priced. It wasn't the best I've had, but it was sure worth the visit.", 
    "review_date": "2014-02-22"
  }, 
  "UUaEx34rm3DxygabC6b_sw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jae K.", 
    "review_text": "I had a great time there today with a couple friends!   I showed up not knowing what to expect - I was pleasantly surprised. They had a full bar (with very tasty Bloody Mary), a nice brunch menu that goes til 3 on a Sunday, and great food. I had a vegan burger, and it was the perfect (modest) size with a side salad. I ordered an okay house Chardonnay, but I suspect if I'd asked them for a Perfect Manhattan, I would have gotten a great one.  So glad there's a full-service bowling alley in SF!", 
    "review_date": "2013-11-24"
  }, 
  "IcDn5f-a5mt7v3WnFBvOdg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Captain B.", 
    "review_text": "Pros + bowling, food and drinks all in one place, in the Mission + the environment is very modern and hip + the dining area on the 2nd floor overlooks everything + the crispy fried chicken sandwich special I had was great. Came with perfect fries too. I hope they add it to the menu. + couches to enjoy while bowling, instead of the usual uncomfortable chairs you see at most alleys + the staff, both in the dining area and bowling area, were very friendly  Cons - our bowling lane (#4) was broken! i.e. it wasn't counting multiple pins that we knocked down almost every turn. - prices (mainly for bowling) are rather high - long wait to get a lane - lanes are placed very close to each other, making it hard to bowl in particular styles - the chicken entree: while the chicken itself was good, that's basically all you get besides a tiny sprinkle of greens. It would be nice if there were some less fried/unhealthy options", 
    "review_date": "2013-02-10"
  }, 
  "wTEduhbLx1cEdiaNNwg-zw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alexis Y.", 
    "review_text": "Really great spot! The staff here is really friendly and chill. The food was delicious. If you're here for brunch, I highly recommend the chicken and waffles (more like fried pieces of corn-bread love). The cocktails were great as well. I can see this place getting really busy. I came here for a noon time reservation on a sunday and all lanes were already packed.   I highly recommend this as a date spot!", 
    "review_date": "2014-04-13"
  }, 
  "anScoNPGqurOPRGGqGk7OQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandy L.", 
    "review_text": "First time here and I would come again. I ordered fries and pork chop. It was very tasty.", 
    "review_date": "2014-04-02"
  }, 
  "ESNbiWHJWK9seFiNmw-FDA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel F.", 
    "review_text": "Stopped by for a quick bite last night and it was delicious--the vegan burger was super tasty, with a simple green salad. Just what the doc ordered, with a side of sumptuous red wine! The service was excellent too! Don't stay away just because you aren't bowling--the bar and restaurant stand on their own.", 
    "review_date": "2014-02-17"
  }, 
  "bTFZ-cepM91pdS2PFpvJiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody T.", 
    "review_text": "Came here for a team event, rented 2 lanes for 2 hours.  LOVED that it was clean, trendy well maintained.. full bar AND good food?  No one could stop talking about how amazing the place was - this is how bowling SHOULD be.  The downside is that they only open up lane reservations 1 week prior, so can be a bit tricky if you are just trying to do an intimate gathering ahead of time.  Fried chicken and burger were both great.  We had to the 2 lanes to the far right so the side counter worked perfectly for us.  Thought the price was also reasonable across the board.  Will definitely return! Hooray for mission bowling club!", 
    "review_date": "2014-08-06"
  }, 
  "Ixd5fdjQreCYpsIkaP_cgQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan R.", 
    "review_text": "One of the coolest hipster places in San Francisco. Although i probably would never bowl here since its expensive and small - i would def come back for the food.   The Mission burger is the perfect amount salty and savory. Tender meat and savory onions - really really good. Def one of the best burgers I've ever tasted!   Come during hh, its served without fries but its cheaper and less crowded.", 
    "review_date": "2014-07-04"
  }, 
  "T1X6F2bO4JE4cVvfMbYu4g": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Kathleen W.", 
    "review_text": "You need reservations, but it's worth planning for. Beer/drink selection is really nice, and the atmosphere is chill/fun.", 
    "review_date": "2013-09-28"
  }, 
  "KRfRO8yMi4pCb9Sh8-vGzg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CatsPjs Z.", 
    "review_text": "Tried the Mission burger and the Vegan burger here. The Mission burger is pretty damn good, but maybe a little less mayo would be better, the meat is juicy and tasty enough.   If you're a vegan, you'll love the Vegan burger. IMHO, I'd add some more greens inside the Vegan burger, or maybe a tomato. But the vegan patty is pretty interesting. It does not resemble a traditional veggie patty, it resembles a tofu patty more. This is probably because its made out of chickpeas. Its quite soft inside and lightly fried on the outside with a little spicy kick. Definitely different than most veggie burger patties. So if you're expecting a regular veggie burger, you won't get it. You'll get something else, but it will be pretty good.  Other menu items looked yummy too, I'd be back to try more things. Not sure about bowling there, I hear its expensive. But for dinner, its a great place!", 
    "review_date": "2013-07-20"
  }, 
  "8D2du2DHo1N_XGhXTJHV0A": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Ryan M.", 
    "review_text": "Really awesome place in a cool location that needs something like this. This part of the Mission can be a little sketch, but this place is like an oasis.  I went for a birthday dinner and bowling and it really did the trick. First, my burger was excellent. This isn't your standard bar burger. Gormet shit. The Mission Burger isn't cheap at $15, but the caper aioli and Monterey jack cheese really worked well together.  The beer list wasn't extensive but good.  The bowling is tough to get, however. We were munching on dinner for probably 2 hours before we could get a lane. There just aren't a lot of them, so tough to secure a spot.  That said, the staff was helpful and kept us updated with the progress on getting a lane. The lanes were nice, and I always love the scoring that tells you the speed of your roll. It was a nice alley.  I'd definitely go back.", 
    "review_date": "2013-05-05"
  }, 
  "D-rKFBb1s4_4vpDA9Wjiog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "The missionburger is the best burger i've ever had.   Good beers on tap, and bowling is fun.", 
    "review_date": "2014-02-17"
  }, 
  "i0C4bhHjTVaAMKvz6G7fOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole O.", 
    "review_text": "If you're at MBC and they have a pork special ORDER IT. On the Wednesday before Thanksgiving we popped over for dinner and proceeded to have one of the best meals of our lives. The most tender, juicy, flavorful pork chop with a kumquat marmalade accompanied with brussels and spaetzel. DIVINE! I had to interrupt the chef and pay my compliments. Wow.", 
    "review_date": "2014-11-30"
  }, 
  "HCtEYgABFgwGhHB3rPQeQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coraly S.", 
    "review_text": "First things first. I'm not a big bar food person, but this bar food is too notch!!!! Doesn't get better than this. Tried to go mini golfing at Urban putt but it was a little too crowded so we ended up here. Make sure you put yourself on the list the minute you walk in if you plan to bowl. We didn't because it didn't seem that busy. It was a Wednesday night and we missed our bowling opportunity. : (  Sony our bartender/server is amazing and provided us with the best service ever. She knows every little detail about every drink and menu item. We loved her!", 
    "review_date": "2014-06-06"
  }, 
  "MzXPOK2_T5O8GF-4qUVmGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica M.", 
    "review_text": "Don't let the name fool you.  You'll not find the standard bowling alley grub fare here.  Oh, no.  The truth is that this menu could not be a bigger departure from standard bowling alley grub fare.  Possibly ever, in the history of bowling.    The fried chicken.  OMG!  This is some of the best fried chicken I've ever had. Serious.  I know...I was surprised too.  The cocktails are artisan to boot.  Gourmet fare w specialty cocktails.  MBC is actually more of a first rate restaurant that happens to have a bowling facility, instead of just a bowling alley that serves food.    Atmosphere is fun.  A great addition to SF.    Who says you have to have generic hot dogs, soggy fries, &amp; greasy onion rings when you want to bowl the night away?    You don't anymore.  Try &amp; sit in a booth.  Somehow sitting in a booth here complimented the whole vibe.  A great dinner &amp; a great time.    4 stars.", 
    "review_date": "2014-12-16"
  }, 
  "gn6XvNDvcrTMF3QbqtCD9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie J.", 
    "review_text": "I've been to Mission Bowling club once and had a great time!  The burger was delicious but the drinks were even better.  I wish I could have tried every cocktail on the menu.  They also have a good beer list.  Bowling itself is always fun but I really liked how the cocktail waitresses serve you while you bowl!  No need to go back to the bar yourself, and they were very attentive at keeping our drinks full :)  Can't wait to go back and try the brunch and more bowling!  As for the comments about families, for me it's actually a plus that it's an adult themed bowling ally.  Not everyone wants kids running around while they're having fun with friends..  sorry!", 
    "review_date": "2012-04-30"
  }, 
  "HOnpLdM3-jawK9hxE5TGCg": {
    "user_rating": 5.0, 
    "user_location": "Outer Richmond, San Francisco, CA", 
    "user_name": "Kim M.", 
    "review_text": "A group of friends and I wanted to go bowling for a birthday. I reached out to Mission Bowling Club and even though they were all booked up, they said they had a number of lanes available for walk-ins. We arrived early and were able to secure lanes for the party. The staff helped accommodate our large party and they even set-up my cupcakes with a birthday candle that we brought in. I highly recommend this place to anyone looking for  bowling place with outstanding service.", 
    "review_date": "2014-10-27"
  }, 
  "7H9ewyPrGlr8ybrHC87Egw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gentlemen's Burger Club O.", 
    "review_text": "Our rating is an average (rounded-up) for the members of Gentlemen's Burger of the Month Club.  Individual member reviews below:  This one's a down and dirty, greasy burger -- juicy beef, cheese, and tons of aioli.  In other words, totally delicious.  Fries on the side and a beer from MBC's locally themed list makes for a solid dinner. 4.5 out of 5 -Chris P.  This was a pretty messy burger. I ended up eating it with a fork, which is not something I usually like to do. Fortunately, I value taste over tidiness, and this was a tasty burger that was perfectly cooked and full of flavor and delicious toppings. The bun was also excellent, even if it was not quite up to the task of holding all the messy goodness together. 4.5 out of 5 -Jamie H.  At first sight, I was suspicious of my burger. The tomato, lettuce and pickles were on the side and looked like they could have been stolen from McDonald's. I was also worried that my burger might drown in the aioli sauce that looked more like an unhealthy portion of mayo. But looks were deceiving. It only took one bite into the unusually savory meat to change my mind. Best patty I've tasted yet and the aioli complimented it well. Fix the fixings and you might have a 5 star burger. Ps. Bonus points for the fantastic bun. 4 stars for now... -Paul L.  The self-proclaimed 'home of the Mission Burger' indeed had a fantastic bun, but the caper aioli took away from the rest of my burger experience. It was messy, rather nondescript and made the overall burger mushy. Also, for reference, ordering the salad instead of fries is a total error. 3 out of 5 -Cameron E.", 
    "review_date": "2013-09-11"
  }, 
  "25CeUxnELWA4ecRT-D3Ocw": {
    "user_rating": 5.0, 
    "user_location": "Lodi, CA", 
    "user_name": "Rik N.", 
    "review_text": "I have been a Yelper for quite some time but have never written a review. Before I felt as if my opinion didn't matter and I hadn't experienced enough to compare one restaurant's food over another.  That all changed yesterday when my better half made reservations to Mission Bowling Club. I've read reviews and blogs about how hip and trendy this place is (Food, Drink, Atmosphere etc...)  Hell, its a friggin' restaurant with a bowling alley as it's main focus!  Sounds like a winning combination to me. Our experience was so good I had to write a review.  I've had some fantastic burgers in my day... 'Awful Awful' in Reno.  'Burgers and Brew' and the 'Squeeze Inn' in Sacramento.  The super chic 'Umami Burger' in Hollywood.  My hometown favorite 'Andre's' in Lodi.  The California Classic 'In-N-Out'.  All fantastic burgers but The Mission Burger is a religious experience.  I am a fan of a good burger that is fresh, not greasy and has quality meat and toppings.  All previously mentioned burgers are excellent at providing said qualities but never have I had a burger that shows you what the burger should actually taste like.  Every quality of beef that we Americans like are in this burger:  Tender meaty chew from your favorite burger.  The perfect texture of crust and char from an open flame.  The flavor and juices of the best steak you've ever had in your life.... You know what I'm talking about, and they're all in this burger.  The burger itself was so good it completely out-shined the extremely high quality bun and toppings that came with.  I've never had a hamburger that completely nailed the hamburger patty.  Other places choose good quality meat, but then rely on some gimmick or topping to set their burger apart from others.  Not here.  Not at Mission Bowling Club.  I must also note that every other part (except for our host - slow, unfriendly) of our experience was nothing less than fantastic. -Our server was friendly, sweet, and checked on us at the best times, never too much.   -The fried chicken appetizer was insanely good.  Cripsy, tender, very Chicken-y. -We even got a free order of home fries due to a mistake in the kitchen.  BTW better than any other potato dish I've ever had.... And I know my Potatoes!!!   -For dessert we got Cinnamon Crunchy Toast which is everything you love about Cinnamon Toast, Creme Brulee, and Ice Cream.  I've had the single best Hamburger experience and single best Potato experience in my life.", 
    "review_date": "2012-07-13"
  }, 
  "qo9VoTwxz_QdNHAazCKLZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betsy K.", 
    "review_text": "5 Important Things to Know about Mission Bowling Club:   1. This bowling alley is NOT for kids. This is a bowling alley designed (both aesthetically and menu-wise) for ADULTS. The drinks are intense and tasty and priced for adults who work hard and want to play hard with their friends. The food is designed for a seasoned palate NOT for bowling alley regulars who want deep fried/greasy late night food like nachos or wings. Families you can definitely come once you have all graduated from college and are celebrating your engagement, grad school/med school exams, and parents 30th wedding anniversary but before you and your kids have turned 21 go to Presidio Bowl for neon-family bowling instead.   2. Go as a group with at least 3-4 other friends. You will all pay less that way to rent a lane and to share the tab when you order their tasty drinks. That's just common sense here people...  3. Stop whining about their prices. It's a small bowling alley that can only accommodate 6 lanes of players comfortably (at 2-6 people a team). There's plenty of room to sign up on their reservation list so call ahead and make sure you ask for a lane. It's simple if you plan in advance. If you go later, expect to pay more for late night rates. The drinks are worth the price and are tailored well with great flavor and food pairings.   4. A+ for cleanliness, service, and overall upkeep. Fantastic, intimate ambience, in a really unique space. It's both a nod to the neighborhood but also to the local artists! The art is a variety of styles and levels.   5. Upstairs, downstairs, booth, table, bar, outdoors and indoors seating. You think of it, they found a place for you to sit whether you're there for a drink on a date or with a group to celebrate your birthday they can figure out where to seat you. Outdoor patio with sculpture art YES YES YES!   MISSION BOWLING CLUB IS THE BEST BOWLING ALLEY I HAVE EVER BEEN TO. Period. It's that simple.   And that's coming from someone who has bowled in Chicago, Philadelphia, LA, New York City, and now San Francisco. Yes, I've been to Presidio Bowl and yes, it's fine but it doesn't capture the art, style, and late night/SF noir/leather chairs/bowling alley/sexy escapades vibe that MBC can so well. Cheers Mission Bowling Club, you are kick-ass! I will definitely be back for more.", 
    "review_date": "2012-06-04"
  }, 
  "qNrHLZPurBWJzeAMkFLvvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracy T.", 
    "review_text": "Highlights - Who would have ever guessed this gem of a place existed in this area?  - Bowling alley complete with bar and restaurant all in one. I'm not even hesitating to say YES and tell all my friends about this place, so that I can partake in indulging in their mean burgers and awesome bowling here.  - I like the fact that there aren't a bunch of kids running around here. More of a classy adult day/night out with friends. - Foodwise, think gourmet burger because the burger is around $15, but well worth your $$. Probably the best burger I have tasted.  - Bowlingwise, they have limited lanes and if you have a big group it would be advised to plan ahead and make a reservation. Everything is really new and clean though, which is a plus in my book.   Improvements - Inconvenient location that is not very close to Bart nor do they have much street parking around.   Tip - Park at the lot nearby. It's not too expensive and you won't have to worry about your car.", 
    "review_date": "2013-12-31"
  }, 
  "wHYIzKeTyvqkhXvbut0TQA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard C.", 
    "review_text": "Came here on a Tuesday night for dinner and it was a bit lackluster. I went in and didn't get addressed by the staff at all. A customer having a beer at the counter told me that I needed to get the menus from the bar and gave up his seat for me and moved to the bar. After doing so, I ordered and got the Mission Burger medium. When I got my burger, it was just slightly under well-done with a slight tinge of pink - obviously not medium. I decided to eat it anyway as it didn't bother me that much to want to have them remake it and probably have them throw away this burger in front of me. The burger itself was okay but the bun was rather hard and was rather difficult to bite into. The fries were okay, nothing to write home about. Overall, it was underwhelming and the service, frankly, wasn't very good. I would understand it a bit more if they were very busy but they weren't. Don't see myself coming back unless there was nothing else available unfortunately.", 
    "review_date": "2014-11-12"
  }, 
  "nUms0RzJFJsqlR_VkjrSuw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kevin W.", 
    "review_text": "I was dressed in my button-up dress shirt and slacks from work, so I had to splash on some hipster-repellent cologne to complete my ironically hip, anti-hipster ensemble for this hipster spot.  So ready to be uncool!  The Tall Vegetarian ordered the $10 Cooler, served in a tall pint glass, and my manly self ordered the $10 Honey Bee, served in a dainty martini glass.  How ironic to start the evening.  For the night, between the Cooler, Honey Bee, and TBD, I preferred the Honey Bee because I'm ironically sweet like that.  The food lacked irony - just bluntly delicious or not:  - $7 Sausage Corn Dog &amp; $8 Fried Chicken - The Corn Dog is just a sausage, breaded and fried.  The Chicken was a little too crispy with a little too much breading, although the meat was moist.  Gimme two bacon-wrapped hot dogs from the carts outside instead.  - $15 Mission Burger - A bit salty, but nevertheless tasty with the crispy fries.  (The Tall Vegetarian's $10 Vegan Burger looked good, too, but I didn't have a taste for fear of Tall Vegetarian cooties.  I heard you become a vegetarian, if you're infected.)  - $11 Crispy Pork Belly &amp; $19 Marrow Braised Short Ribs - Small bites of both were amazing.  Pricey for the size, but I should have gotten these instead of the burger.  - $7 Cinnamon Toast Crunch &amp; $8 S'mored Brownie - Get both, and then post a pic about ironically getting the best desserts at a bowling alley with the #YOLO hashtag.  The bowling is definitely posh - newer shoes, fancy scoring, and big comfy couch seating rather than plastic chairs.  But then again, I would have much preferred the ironic hipness of cheap folding chairs instead.  Wait, now I'm just confusing myself.  Maybe it's be hip to be confused?", 
    "review_date": "2012-09-19"
  }, 
  "wBGcrVreF1QAkTgHXVO3Hg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marisa K.", 
    "review_text": "It turns out I'm a pretty good bowler (maybe the drinks helped).  I've been here twice to drink and enjoy the outside patio and once bowling. I haven't tried the food here, but I hear it's pretty damn tasty. They have decent beers on tap, and the bartenders aren't shy to make recommendations. As with all the new places popping up in the mission, MBC is pretty hipster trendy. But the staff is nice  No food allowed in the bowling area, which kinda sucks. but I understand that they want to prevent grease from getting all up on their balls", 
    "review_date": "2012-07-23"
  }, 
  "NDw3ViA756mSTMV2HQeobQ": {
    "user_rating": 3.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Alex B.", 
    "review_text": "The bowling and drinks are great, but the food and service need much better execution. The venue is really cool with a hipster vibe in the most positive sense. it won't take much to improve both food and service. Management just needs to pay more attention.", 
    "review_date": "2014-08-16"
  }, 
  "_aSs5dSAabuwnXUGBPzASw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevieve Y.", 
    "review_text": "Date &amp; Time:  Monday March 19, 2012 @ 7pm Companion:  The Husband Scene:  Hipsters in Flannel Checkered Shirts+Skinny Jeans &amp; Girls in Short Striped Dresses w/ Hue Tights Music:  Rock &amp; Alternative Decor:  Warehouse turned Bowling Alley + Resto.  Cool Bar, Dining Rooms in Main Level &amp; Loft, 6 Bowling Lanes Service:  Very Friendly Imbibe:  Gin Fizz &amp; Beer Devour:  Thai Beef Jerky, Everything Pretzel, Corn Dog, Burger, Coffee Cake, Panna Cotta Total:  $68.36", 
    "review_date": "2012-03-19"
  }, 
  "VSINPig75DiGswnie1xxYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Foodlover B.", 
    "review_text": "Ate here last night and enjoyed all our food choices. The only negative is that portions are very tiny for the price.    We had the roasted carrots, the melon salad (the white melon portion was great), and the vegan burger (it seems you get a half a burger portion).  Even the meat eating hubby liked the burger a lot.  We like the chef and his ideas and dishes.  Not sure if we liked it enough to go back just to eat.  We walked over to bi rite after for salted caramel ice cream. And then onto The Marsh for Boomeraging , from LSD to OMG by Will Durst (eh, a little repetitive)", 
    "review_date": "2013-07-31"
  }, 
  "-34NV3A5a5gcL-s8UH4KbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie T.", 
    "review_text": "1) The space is pretty cool. 2) The staff are awesome and supportive of parties and large groups 3) The food is DELICIOUS. Like really really good. 4) Drinks are also DELICIOUS.  That's all. That's all you need to know.", 
    "review_date": "2014-12-18"
  }, 
  "dB11NQfvGM-cv-05YV_SGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liv A.", 
    "review_text": "One thing I like to do, but don't get to do much is bowling.  I usually go bowling once every 5 years or so.  If I'm lucky, I'll break 30.  Gutter balls love me.  After this morning, I do have a new found liking for the Mission Bowling Club.  A good friend of mine suggested meeting up for brunch and bowing there.  Rad!   Mission Bowling Club is a triple threat!  You have the restaurant portion, the bar and a small bowling alley.  You don't have to feel inclined to eat, drink and bowl but you're certainly welcome to do as many or little or the activities you fancy.      Our party of four started off with brunch (with reservation) at 11am.  Meanwhile, we were also waiting for a lane to open up.  Luckily, friend got there a little early and was able to sign up for a walk-in lane.  Otherwise, you need to call and reserve a lane more than a week in advance.  The waitress was great server and didn't get annoyed with our special requests.  Bf and I asked to substitute the sides of potatoes with salads and also had the sauces on the side.  Only gripe I had was that it took incredibly long for us to get our food (about 30 minutes) and there were only a few other tables of patrons.     Brunch eats: - Crab Benedict: In hindsight, I should have ordered this instead of nibbled off of bf's plate.  The crab and over easy eggs were wonderful on the English muffins.  The Hollandaise sauce had just the right amount of lemony flavor.  Side salad was dressed with a light vinaigrette.   - Mission Burger:  I hadn't had a burger since I can't even remember when.  If friend didn't mention the burger, I wouldn't have known about it since it wasn't on the brunch menu.  Apparently, they serve it all day.  The burger was huge....we guessed about 1/2 beef patty.  The burger was stacked pretty high and came with caramelized onions, swiss cheese, tomatoes, lettuce, pickles and aioli.  I also asked for the side salad.  I'm not sure why they cut off the tops of the buns but that's fine with me.  Although the beef patty was juicy and well seasoned, it was a bit salty for my taste.      - Waffles:  Friend ordered the waffles minus the chicken.  They served two perfectly golden brown, crispy waffles with butter and syrup.  I tried a small piece and it was quite yummy.  - Hibiscus Ice Tea:  I was very happy that they didn't put sugar in the hibiscus tea.  It was tangy and refreshing.   Overall, the meal was good.  It's much better than any fast/bar food served at most bowling establishments.  Our tab pre-tax (including 2 cocktails and another burger) was $86.    Bowling:  We paid for 1 hour which included shoe rentals for the 4 of us.  It cost $35.  There are 6 lanes and plenty of bowling balls to go around.  They have comfy leather couches for everyone to sit on.  All the while bowling, you can stop by the bar for a drink and also order food.  The bowling staff was super friendly.  Shoes were a little nasty but I didn't get any feet fungus so I'm peachy.  Children are allowed to bowl until 6pm.    Parking is tough in the Mission but don't let that stop you from giving Mission Bowling Club a try!  Food is better than alright.  Bar seemed laid back.  Bowling = fun factor!", 
    "review_date": "2014-02-09"
  }, 
  "Z-NjDpNw_SDPEap81FN9OQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ann T.", 
    "review_text": "This joint will be opening at 6pm tonight!   This will be the second bowling alley opening in SF in just two weeks! Glad there are more choices to choose from once Serra Bowl closes it's doors.   This bowling alley has 6 lanes, where 3 are reserved for walk-in's (unlike lucky strike). They also serve food here. Check out the menu uploaded! There's food on a stick!   There are also tables in the front patio to hang out and grub if you choose not to bowl.", 
    "review_date": "2012-03-19"
  }, 
  "Al91UkRtVxCXnT4-lTpa7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adelina W.", 
    "review_text": "I never venture to the Mission, but I'd totally come back here. We didn't bowl, just came for drinks and food for a friend's birthday. The food was beyond great. I never expected restaurant quality food here, but it could give a lot of places in the city a run for their money. The drinks are also spectacular. There were so many of us, we would go up to the bar in waves, so we kept them pretty busy. Towards the end of the night we were hanging out by the end of the bar and the bartender joked asking what kind of shot we were having, but we were pretty done for the night. He brought out 7 shot glasses and lined them up and we were confused. He saw our faces and just said \"what? they're just shot glasses.\" He poured out seven shots of whisky and said it was on the house . . . turns out he was one of the owners. Awesome food, awesome drinks, AWESOME owners!", 
    "review_date": "2014-07-01"
  }, 
  "aHkN15XSGeDqkM85voZG3Q": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy C.", 
    "review_text": "Given how much I like Mission Chinese Food, I had really high expectations for the food here, but it was disappointing in both taste and portion size.  The blackened salmon was too salty and somewhat burnt tasting, the beet salad was flavorless and unimpressive and the \"latka\" was just a mushy hash brown.  I went with a party of 6 and no one was really that happy with the food.  Especially considering how much our meal cost, we shouldn't have had to go to El Farolito afterwards to feel full and satisfied, but we did.     The best thing that I had all night was my drink.  I had the TBD (mescal, dry vermouth, jalapeno jam and lime), which was delicious and expertly made.   MBC is a cool spot with great ambiance, but I would only come back here to bowl and drink.  The service was mediocre (we felt unwelcome and rushed even there were other empty tables) and the food was expensive and unsatisfying in every way.  If you do come here to bowl though, make a reservation because there are only 6 lanes.", 
    "review_date": "2012-07-30"
  }, 
  "aRflSjWTqdI7ZmH_QaApZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle M.", 
    "review_text": "Ohhhh Mission Bowling Club, where do I start?  When we first met, I stepped in your doors for a first date with a fellow from OKCupid.  I admitted it.  What?  I'm putting myself out there.  The burger was juicy and flavorful.  The drink selections were plentiful.  There was, however, no bowling.  That is a whole other animal.  An animal that I know nothing about at this establishment, since it seems impossible to ever see a free lane.  I have since given up on that pipe dream.  I have seen you once again, now that I live around the corner.  I brought a fresh SF transplant here to share with her your charms.  She mentioned possibly having her upcoming birthday party there.  \"This weekend?  It's Wednesday now.  Fat chance.\"  And with that, her dreams were crushed.  Okay, maybe not, but seriously?!  I wonder if there will ever be a day that I can enter this spot and be able to bowl without having a reservation weeks in advance.  I realize there are only three lanes, but come onnnnnnnnn!    One can dream.", 
    "review_date": "2013-10-24"
  }, 
  "uGGjLd5JCVIfmfXSXABqpQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miss V.", 
    "review_text": "PLEASE READ BEFORE COMING!!!  If you want to go to a place where you are treated kindly with respect and want to have an experience of a lifetime DON'T COME HERE!!!! In a nut shell.... If you are anything but WHITE, OLD, and HIPSTER looking guaranteed you will be treated unfairly. (Nothing against White ppl, Old ppl, or Hipsters)  Let me explain our sad experience at this hell hole....  Saturday Night 9/28/13: My friend was throwing a b-day dinner for his gf. SMALL group of 8 ppl. Upon arrival, staff still made the party wait for 20 MINUTES PLUS. Ummm reservations made for NOTHING apparently...while others (WHITE PPL, get to walk in and be seated with no problem no matter how big their group). STRIKE ONE.   When my friend's bf asked to speak with manager, the coward fill in mgr, who was a Caucasian female with short black hair, refused to talk to our group, WHAT???? STRIKE TWO!!!   When finally seated, two ppl of the party (myself and hubby) arrived half and hr late and waitress was asked to add us to the table. No big deal we thought as there were plently of empty tables available. However, per mgr, we could not add a table to the group because it was a \"Fire Hazard\" and \"Those extra tables were for other walk-in guests\" STRIKE THREE!!! Anyplace else, would of been no problem.   Service: awful. Especially if you are upstairs. Waiters are lazy (esp you blondie), and they will minimize the times they need to assist you to avoid the long trip up and down the stairs. STRIKE FOUR!!!  Yes, the food was good thanks to experienced culinary Mexicans in the kitchen, muchas gracias!!!   We bowled and that was OK as we had music (big whoop same at many other bigger bowling alleys, Lucky Strike, Seabowl, etc). What was not fun was that there were no waitresses to bring drinks. You would have to go to the bar to bring drinks back which is inconvenient if you are trying to buy rounds and bowling on a timed schedule. It sucked to have to wait for ppl to come back from the bar which at times took awhile and interfered with the game. STRIKE FIVE!!!!  As we were leaving to a BETTER LOCATION, there was a good song playing and my friend and I, who were far from being drunk, started singing to a song as we walked out. As we did, we were attacked by the door man who yelled at us to stop singing because they did not want the neighbors to complain. He literally tried to scold us as if we were children in front of other guests who were looking at him like what the heck is his deal???......at that point I had had enough of this dump and vowed to never come back. STRIKE SIX.!!!  Despite all the wonderful reviews ppl have left for this place....sadly not everyone here is treated the same. Our small group was a mixture of SF Locals, Military Veterans, Teachers, and Out of Town Guests. Luckily we went to 16th and Valencia St. after and had a blast which made us kind of forget the unfortunate experience at Mission Bowl which should be renamed \"WE WILL TREAT YOU LIKE DIRT BOWL.\"", 
    "review_date": "2013-09-30"
  }, 
  "9MZegxijKS1t5aiwgW2D0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charlie H.", 
    "review_text": "Food is tremendous; it started out great but a little oily, but over multiple trips it continued to improve. The burger is one of the best I've had. btw - the burger to-go is just as good as eating it there. Bowling is so fun, hilarious and if you're not a jerk, they're very kind about giving you a little extra few minutes if they can. At the same time they're good about getting you your lane on time and not leaving people who've had their time on for extra time. Drinks are really good.  It always comes down to the people for me, and as in every place I love, the people here are totally awesome.", 
    "review_date": "2013-01-06"
  }, 
  "qMF9AxnVt6JGFtlLY7m88g": {
    "user_rating": 5.0, 
    "user_location": "Western Addition/NOPA, San Francisco, CA", 
    "user_name": "Jennifer B.", 
    "review_text": "Tried to make a reservation for 14  at a restaurant may be one of the most difficult things you can do in San Francisco. I was frantically trying to find a place to have my 21st birthday party and stumbled on Mission Bowling Club.  They were able to accommodate everyone for lanes, including a table reservation upstairs for dinner after. The service was very nice and friendly, and when they took a little while longer than expected to get our tables ready, they threw in an extra game of bowling for us!  In the end, it was a successful 21st birthday. Drunk bowling and good food with great friends is afterall all one can really ask for a successful night out!", 
    "review_date": "2015-01-28"
  }, 
  "AlgwaveLYUhPX327TDO3rg": {
    "user_rating": 5.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Elena K.", 
    "review_text": "For 23 long years of life, I have hated bowling -- until I went to Mission Bowling last night. When you have a clean, hip, fun environment, plus excellent food (highly recommend the fried chicken and chili cheese fries), real-deal cocktails, good service, not overpriced, not too packed, indoor-outdoor patio, comfy and not terrible looking bowling shoes (plus cute socks available for only $4 if you forgot your own) -- how can you go wrong? This place is perfect for birthdays, dates, you name it. I can't wait to go back.", 
    "review_date": "2014-08-24"
  }, 
  "gSqxSw8CvnKpxjzNyuCkYw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamon B.", 
    "review_text": "Worst. Bartender. Ever.   If you want a drink that tastes like something you made in middle school when you broke into your parents' liquor cabinet, then you'll like this place.   Honestly, it doesn't matter which drink you order, because it won't taste like what you ordered. I ordered a dark and stormy that tasted and looked like a long island iced tea (but a bad long island iced tea).   And the bar tender was so S-L-O-W. Partly because he was more interested in socializing than doing his job, and partly because he's clearly just an awful bartender. No wonder he was working on a Monday night (last night).   Bowling was fine, not great--but what you'd expect from a hipster hangout in the City.", 
    "review_date": "2013-07-30"
  }, 
  "HrKZHln-qA3z0LOhqWUCeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike E.", 
    "review_text": "A great place to bowl with even better employees!  I met my Girlfriend a year ago at this place and recently went back to celebrate our 1 year anniversary. I forgot to make a reservation, but Fred and Joe were able to fit me and my woman in for a quick bowling session, but were so excited that we came back to the place we met.   Great service and a great atmosphere!   Thanks guys, you made the night.", 
    "review_date": "2013-10-28"
  }, 
  "LqK9jxnp-X61q742Y5F_Vw": {
    "user_rating": 5.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Nadine B.", 
    "review_text": "What a great place. I celebrate my 25th birthday at this place and everyone had a wonderful time. Service was nice, food was good and yummy drinks. We will come back :D", 
    "review_date": "2013-11-20"
  }, 
  "U9yWtQO_0LPjtaU9jN0JsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean K.", 
    "review_text": "Came here for a meeting so can't comment on the bowling. We ordered several appetizers - the normal bar food - nothing memorable. I couldn't leave without trying the fried chicken which came in several chicken pieces on a long stick with dipping sauce. The famed fried chicken was only okay. I think it was too heavily breaded. Maybe because they're boneless pieces but as soon as I bit into one the skin just fell off the rest of it so I was eating pieces of chicken meat alongside pieces of breaded chicken skin. Not the most pleasant way to eat fried chicken.", 
    "review_date": "2013-10-09"
  }, 
  "qEdxnnadZ2tcU9JOXjnGdw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine C.", 
    "review_text": "#223.  Great place for groups to hang out.  Be warned though, this place is small: only eight lanes.  And if you come here on a day where two lanes are out of order, this place only gets smaller.    With 25% of the bowling alley gone and the rest fully booked, we had to wait 45 minutes before a lane was available.  Reserve ahead of time!  You can put your name on the waiting list, but there's no guarantee.  You have to wait until someone cancels in order to get a spot.   The place is nice though.  There's a patio and lounge adjacent to the bowling alley, so there is decent food and drink if you're hungry.  There were five people in my party, and we were able to play a full game and then some.  I think rental is around $60 for an hour and shoes were $3 or so.  Definitely good for groups.  __________ My 2¢: - This place is small.  Reserve a lane before your group arrives.", 
    "review_date": "2015-01-31"
  }, 
  "stQ0nzs7x4n8Kde_CN3F0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nakissa G.", 
    "review_text": "A fun bar with a Bowling Alley attached - I say that because it is REALLY hard to secure a lane! If you ever want to do an impromptu bowling night, this is probably not the place for you - usually a long wait for a lane, but if you are OK with that, the bar and restaurant here makes for a great waiting room!  Food is tasty and the drinks and pitchers are well priced.  Also, when you do get on a lane, it makes for a fun night with a great vibe.", 
    "review_date": "2013-05-21"
  }, 
  "k2xdkJHb44nXpvbZVDEzrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maggie F.", 
    "review_text": "Bowling: SO fun and nostalgic. A bit pricey and they only allow 3 lanes to be reserved so it's recommended you do it early. Otherwise its first come first serve. THey made that seem scary to me and like i HAD to make a reservation, but really there \"first come first serve\" lanes when I went on a Sat morning were totally free the whole 2 hours I bowled.   Food: AMAZE-BALLS! Seriously...so good! Had their breakfast sandwich (went on a Sat morning) and it was mouth watering. Friends got the chicken and waffles which were also amazing. Wow.   Will definitely be back.", 
    "review_date": "2013-01-18"
  }, 
  "eIa4QJXp5ZNmuFORnuPvDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ziyan C.", 
    "review_text": "Been dying to go here for so long - good for a casual and fun dinner!  On the music: loved the mix. I remember hearing Little Dragon, Kanye, Solange, and lots of good 90s rock.  The service was laid back and friendly. They were sure to check in with us often.  Cost: $26 per person total (including tax &amp; tip). We got 2 drinks, 1 app, and 1 entree - a good dinner for two.  ~~Cocktails~~ * Honey Bee - 4 stars (tito's vodka, honey syrup, fresh lemon, orange flower water. $10) Slightly bitter from the vodka, but the server did say this one had a slightly stronger taste from the alcohol base. It was still refreshing, kind of tart the way I like my cocktails, and lemony. A good drink.  ~~Apps~~ * Fried chicken - 4.5 stars pic: <a href=\"http://www.yelp.com/biz_photos/mission-bowling-club-san-francisco?select=ozJI1IWrRBGLrmADKdHmGQ#ozJI1IWrRBGLrmADKdHmGQ\">yelp.com/biz_photos/miss…</a> (w/ ranch dip, cayenne + paprika breading. $8) What a great value! You get three giant pieces, and they all have super moist and tender meat. The breading was nice and crunchy, and the dip thick and delicious. I love low they hoist up the pieces on a stick over a wooden board so you can see the oil drip off. There is also a layer of some sauce between the breading and the meat that was spicy! We thought it was sriracha but it was their own seasoning mix.  ~~Entrees~~ * Flemish Ale roast pork - 3.5 stars pic: <a href=\"http://www.yelp.com/biz_photos/mission-bowling-club-san-francisco?select=ozJI1IWrRBGLrmADKdHmGQ#0e0RVC9jmaSrl00ShfpLRg\">yelp.com/biz_photos/miss…</a> (and spring vegetables. pork belly, favas, orach, cherries, chard leg. $18) The pork was moist, though the meat was a little tough with very thick layers of fat. I prefer pork belly to be softer with a bit of a crisp, while this was more homogeneous meat. The fava beans were nice and the cherries not too sweet. The chard leg was basically pieces of crispy fried skin (nice). But the veggies were like collard greens, kind of flat and flavorless.", 
    "review_date": "2013-06-07"
  }, 
  "2OYuOS2LUEZpMJw6ur_9pQ": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Mar-quis A.", 
    "review_text": "For the dining side: Rarely do I spend more than $10 on a burger, even in an expensive city. Rarely should ANYONE spend more than $10 on a burger; if you're spending that kind of money there needs to be a party going on in your mouth, unlike the snoozefest you get (or rather I personally get lol) with Mel's $10+ Avocado burger that tasted and felt like a typical $3-$4 burger.   Mission's burger is $15. I was starving and didn't want to trust anything else random on that menu like the \"Seared Halibut\" or  \"Summer Ratatouille\" (really is this an American bowling alley or a fine dining restaurant?? LMAO), so I got the burger. I heard from others it's usually salty but mines didn't taste that salty. Of course again I was starving so maybe I overlooked it haha but overall was a very good burger. Except for that cabbage stuff or whatever that is that comes on it. I'm glad it automatically came with fries because at $15 if it didn't I would've probably yelled at the manager. Stop trying to act like your restaurant is some grand location with a beach view and orchestra. One thing I don't get is how the Vegan burger is cheaper than the meat burger isn't that backwards??   We had a rather large party because it was someone's birthday celebration. The waitress who seemed rather annoyed was trying to be nice but wasn't doing a very good job. Big tables are big tables. DEAL WITH IT.   For the bowling side: Um that is a very small alley; only 6 lanes?? Not worth the wait on a busy night (we went last Saturday). At least the glow in the dark pins are cool to look at. If going to bowl, be dressed for the occasion please! Apparently a memo went around that you had to be semi-formal because like all the guys had on button-ups and all the ladies were pretty much dolled up like at a mixer. You most likely won't find any baggy jeans, fitted caps, over-revealing skirts/short and tight dresses or sweatshirts at this place (except for me, I think I was the only one wearing a sweatshirt. In my defense, it was a zip-up one) lol.", 
    "review_date": "2012-10-16"
  }, 
  "BZ76C50h--GlEMZxY9kEgg": {
    "user_rating": 3.0, 
    "user_location": "Danville, CA", 
    "user_name": "Chrissy R.", 
    "review_text": "To an East Bay Suburbanite - taking BART to get to this place for a friend's Birthday was super easy! Tucked between poorly lit buildings, the Mission Bowling Club is inviting with its outdoor seating and bright lights!    The bar has some great house cocktails on the menu - the HoneyBee was delicious.  Dinner was interesting...I'm a 5 year old at heart when it comes to eating, so the menu put me right at the edge of my comfort level.  The hubs and I split a burger and their version of a caprese salad that came with \"edible dirt\"  It was worth checking out but I'll hold the dirt next time.   Bowling was great - we had two lanes for the rest of the night and had a blast celebrating the Birthday Girl!  The Bartenders were keeping us \"hydrated\" and the staff was super chill and friendly.  Great spot, loads of fun!", 
    "review_date": "2013-09-30"
  }, 
  "cVHGXQFo2roQGH0wvZeWHA": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "Loren John B.", 
    "review_text": "For me, I believe I found the best burger in SF.   Well, this is pending a visit to Blue Stem and NOPA. Plus Roam Burger is a current co-champion with MBC, but its just in a different class.  The burger was big, the patty was thick and full of medium rare goodness, and each bite was just an explosion of flavor. The fries were pretty good too, but then again, I like french fries in general. Since we generally enjoy more portions, I give the nod to this over Marlowe or the Cavalier based on burger size.  The place however oozes with trendy hipster-ness. I've already over paid for bowling at Lucky Strike, so I'll pass on playing here. However, it is a good place to people watch when your table is on the second floor. In the two visits I have made here, it does make for a lively and entertaining atmosphere. The facility and dining areas are clean, and the wait staff are competent here.   Overall, I do like the spin this place puts on your standard bowling alley. You can wait for a table at their reasonably spacious bar area, with a few craft beers available on draft. Otherwise, get a reservation online if the time permits.", 
    "review_date": "2014-07-23"
  }, 
  "crxhOesQjRjlPr9tuqralA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey A.", 
    "review_text": "The service here is appalling. Four people behind the bar, three people waiting, and no orders taken. For 15 minutes.", 
    "review_date": "2014-06-14"
  }, 
  "If_EHwN-G2HOkCTIWNhSfQ": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Daniel A.", 
    "review_text": "I am a newly converted huge fan of this place! Decided to spend a Sunday afternoon in the Mission and got brunch at Mission Bowling.  The pork belly hash was incredible: the pork belly was so tender but with crispy skin, on top of sweet potatoes and mustard greens.  The fried chicken, however, was my favorite part of the meal.  It was so crispy, perfect spice and came with a great cream dipping sauce.  It has ruined all other chicken places for me.    The space is pretty special. A loft dining area, table out on the patio, bar, and don't forget tables and couches for when you are bowling.  Yeah, its hipster, but in the best way possible.  On top of the meal, bowling was great.  A bit pricey, but I didn't go all the way to mission for just any bowling alley.  Unfortunately, our lane had some mechanical malfunction, eating into our allotted time.  No worries, they set us up with a new lane and gave us an extra hour for our trouble! We bowled so much, my arm couldn't take another game even if I wanted to.  To summarize: great food, great service, great venue, no complaints.", 
    "review_date": "2014-04-07"
  }, 
  "_Kt01zAkzGDjSphy7W3qOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber K.", 
    "review_text": "This place is tres San Francisco. It takes a very Americana concept and repurposes it to match our collective snooty, refined taste. Case and point: expensive, fancy drinks. Killer potato appetizers instead of fries. Homemade vegan burgers made of chickpeas and kale. Only 5 or so lanes to bowl with in the first place - which creates scarcity and therefore desire.  The Dude might not abide, but I sure do. I definitely think this place wins Achiever status.", 
    "review_date": "2012-07-08"
  }, 
  "8P50te5SxbNJanOkc6iesg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom S.", 
    "review_text": "We held a birthday party for a good friend of mine at Mission Bowling Club on a Saturday night. Bowling was fun, cocktails were great, manager was accommodating. Most everybody was very friendly and we had a great time.  However, one of the bartenders, a short and thin woman with straight short hair was not only a bad bartender, but she was mean.  After bowling, my friends and I went over to the bar to continue celebrating.  We sat at the bar for more than 20 minutes before the bartender acknowledged us or asked us what we would like (and the bar wasn't busy).  All we wanted were a few glasses for a craft of water that I had received earlier in the night. After waiting so long for water glasses, and not receiving them, I decided to drink straight from the craft (a small bottle).  This got the bartender's attention and she finally brought us water glasses.  Then, my friend offered to buy me a cocktail and the bartender refused to serve me because I had drank from the craft.  She said it was an indication that I was drunk when in all actuality, it was a clear indication that the bartender was not attentive and took more than 20 minutes to get us water glasses.  My friends and I got a kick out of this because I had only had two drinks all night and was clearly not drunk.  I apologized for drinking out of the craft but she continued to refuse to serve me a cocktail. I was unable to participate in the toast for my good friends birthday.  I was being very nice to the bartender and trying to make light of the situation but she was clearly taking something else out on me. This was unprofessional, mean and represents Mission Bowling Club poorly.  This is too bad because besides the weak-link of a bartender, we had a great time.", 
    "review_date": "2014-03-30"
  }, 
  "h1vVClifElhxCb-a7TChIA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Burger B.", 
    "review_text": "Things that make you go hmmm...  Theres burgers over there them bowling...  I thought I smelled a burger, I did I did...beef beef...  7/10 beef, nice buns, dressings...  Interesting dining area.", 
    "review_date": "2014-11-25"
  }, 
  "_7nUM6OzjcpWxuZ20nodFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie R.", 
    "review_text": "I'm really not always super excited to go bowling, but my girlfriends planned a Saturday afternoon for us all to hang out at the Mission Bowling Club. (I was thinking, \"really... can't we find something more exciting?\")  Well, I was pleasantly surprised by this place and is definitely the best atmosphere and hip bowling alley I had ever visited. The food and drinks are just as amazing, too. It made for a really fun afternoon with friends! Next time I go bowling, I'll be back here.", 
    "review_date": "2013-04-11"
  }, 
  "tv1MpIa4AkUhZkxH-19oDA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie H.", 
    "review_text": "Wonderful venue for a small corporate event!  We hosted our annual holiday party at Mission Bowl this year and I cannot say enough about the wonderful experience.  The staff was SO helpful in putting together a simple event in which everyone had fun, we had great food, and plenty of drinks to keep the fun going.  Jillian, the event planner walked me through all of our options and helped me to select the perfect menu for our group that worked within our slightly humble budget.    A couple hours of bowling later and everyone was thanking me for choosing this as our holiday party this year.  Thank you Mission Bowling Club! You made us all MERRY and BRIGHT :)", 
    "review_date": "2013-12-03"
  }, 
  "r-A0VKZVWhVPwcwfybbAMg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian C.", 
    "review_text": "I was a little skeptical going in but I had a great time. Despite relatively few lanes, the wait was not very long. Staff was very friendly and accommodating. Nice bar, (from what I hear) good food, and a cool space.   Also, they played Pony by Ginuwine. Would definitely come back again.", 
    "review_date": "2013-04-29"
  }, 
  "_E8fCCrB9T4wZnX8CsS75A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dorris W.", 
    "review_text": "1/2lb burger with fries is so worth it for $15! it is a large portion and has ALL the dressings. I can never finish the burger so I always have it for leftovers and it's still good  The lanes are usually always crowded so you would have to be there at the right time to get a lane, but you can definitely book a reservation", 
    "review_date": "2014-07-29"
  }, 
  "v4iP3AChmQ8Rls9UTPmThA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca G.", 
    "review_text": "Why you would make a bowling alley with just 8 lanes beats me. Overall the place was clean and swanky with a good vibe and the bowling staff was nice.    Bowling: We had a fun time bowling with friends, but the lanes are def not regulation. Really short runway before the lane starts, and the lanes are narrower than usual. I bowled a 109 and 120 - my husband didn't break 100 and complained all night about the non-regulation lanes. Spare me!  Food: They make you eat far away from where you bowl so it's not really conducive to eating and having fun with friends while bowling, which is weird cuz I thought that was whole the point. Took the bar tender 20 minutes to take our order. The Deviled eggs and French fries were not particularly good.", 
    "review_date": "2014-02-25"
  }, 
  "fxyXOkSrkQ2xF51d_LrSIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Preston B.", 
    "review_text": "My favorite bowling alley in San Francisco, well maybe just my favorite place in San Francisco, basically the best place to spend time if you are looking for a) something to do b) something to eat c)something to drink. All three areas are exceptional, from a fun staff to exceptional food and even better cocktails/beers to 6 lanes that don't feel like your average bowling alley. The team at MBC also take being a part of the community very seriously, working with non-profits and youth groups nearby (7 teepees etc) to really make a difference.   Cannot recommend this place more highly!!!", 
    "review_date": "2014-10-14"
  }, 
  "LTWUnGE5dCVGFsKuwuWV9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom P.", 
    "review_text": "Drinks/dinner/bowling here is a fun, though a bit pricey, way to spend an evening.   We arrived early and started with the cocktails at the bar. I know, I know, I'm a snobbish San Franciscan whose bare minimum for acceptability is a good cocktail. These were good cocktails, and were worth the $10 or whatever the price was, but they were just good. I wasn't blown away, but I thought they were solid. I had a very nice mezcal/lime cocktail which is a spinoff of a margarita.   Then dinner. This is where I actually think they shined. My friend had said the food was kind of mediocre, but I was pleasantly surprised.  The seasonal salad was a gaspacho-infused melon salad which was very light and summery.  I had the chicken roulade, which was super flavorful and came with brussels sprouts.  The total for both was $29, which is well within the realm of acceptability. The zinfandel they had on tap was great as well.   Bowling was fun, but pricey. I think for 6 people at prime time with lane rental and shoe rental we paid $80. But we had a great time, and the computerized system was much more advanced then those I've seen elsewhere.   Overall, a lot of fun. Will definitely go back.", 
    "review_date": "2013-06-08"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Came here for food. They had a wait but were flex and let us sit upstairs. The menu was tantalizing. The pork tenderloin was a scanty portion. And totally overpriced.", 
    "review_date": "2013-02-14"
  }, 
  "mDTrcaA-0SvxG4AYmgMCMA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi L.", 
    "review_text": "This is a fun spot for bowling, which I do about once a year so I don't take it too seriously. I've been here twice for birthdays and both times the large groups enjoyed their experiences. Reservations were made in advance to reserve mulitple lanes. Since you can squeeze 6 people per lane the price per person isn't bad (avg $45/hr/lane).   I definitely preferred coming on Sunday afternoon since I liked the brunch options better. If you like all the elevated comfort food, you'll like the fried chicken and cornmeal waffles, loco moco, chilaquiles, biscuits and gravy. Portions were fair for about $10. I would go back just for brunch without the bowling since there is plenty of seating in the dining area, at the bar, and outside. For dinner, the greasy foods are on the apps side and you get the usual California cuisine entree options for $15+, which is difficult to eat at that side shelf thing when you're trying to bowl. Drinks were also good and standard pricing for a non-dive bar in the Mission.  You can order food and drinks at the bar on your own, separate from the bowling tab, so there's no messy tabs to split among your party. Staff was nice and not pretentious. But when one of the birthday boys was starting to show signs of drunkenness, we were politely asked to leave.", 
    "review_date": "2012-11-21"
  }, 
  "j2apIyDIcVyHxxSFoaCiLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy S.", 
    "review_text": "I love this place! I had no idea that this place existed until we were invited here for a birthday meetup. I must have passed by it dozens of times before.  This is not your normal bowling alley and while it might be comparable to the brand new Lucky Strike, I am assuming that Mission Bowling Club has a lot less douche bags. Its more a hipster place than anything. (Think: guys wearing skinny jeans, thick rimmed glasses, hair swept to the side, drinking PBR). But hey, who doesn't love a hipster?  I digress- this place is awesome. The decor is really nice, the bar is beautiful. Hand crafted cocktails and an impressive food menu. The staff is nice as well. You won't find fake nacho cheese here. I can definitely see this place being a great place to rent out for a cocktail party. They have a beautiful upstairs and outside space as well.  If you're in the area, this place is definitely worth checking out. My only complaint is that it closes at midnight...hope that changes!!!", 
    "review_date": "2012-06-05"
  }, 
  "pILIpZRwQdQF1Rcm8r2RDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "prior O.", 
    "review_text": "Quick update - went in for dinner last night and they have updated the menu with a variety of options.  The selection has been greatly expanded with familiar favorites but with a fresh, local flair.  Great change and the food was delicious! And, as always, the best crew in the City to serve these great dishes.", 
    "review_date": "2014-01-28"
  }, 
  "qSh-q8M-rL4PRVukXsDwWg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ellen W.", 
    "review_text": "Super trendy and cute bowling venue for groups to hangout, eat, and play in the city. Mission Bowling Club offers an intimate and classy ambiance for bowling. This is not your average bowling club so it's expected that it's a bit pricer than the other bowling venues in the area.  They have a full service kitchen that serves food and drinks. The staff is friendly. It's really a ideal choice for the yuppie, older crowds who are looking for a great group spot or date night spot.", 
    "review_date": "2015-01-20"
  }, 
  "L3fXp2Bn4ONh7kV5oDOIZA": {
    "user_rating": 4.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Kate S.", 
    "review_text": "I'll admit we came here just to see it with the hopes of scoring a lane.   No luck on the lane, but we were pleased with the friendly service. The hostess is the nicest ever and the bowling managers were so friendly.   They excellent beers on tap (we so wished we would have been there a week later so we could taste Pliny the Younger!) and we had fun watching the olympics on the large screen.   Hopefully next time we go we can check out the food! It's a fun atmosphere even if you aren't bowling and definitely the fanciest bowling alley we have ever been to.", 
    "review_date": "2014-02-23"
  }, 
  "OZ1NmK2RLv0UxGFABE0CHw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David W.", 
    "review_text": "My review is based solely on the burger, because that's all I got. Stopped in on Friday afternoon with a bunch of people as part of a little Happy Hour food crawl. Because we were going to be eating a lot, three of us shared the burger. After the first bite, I knew that I wanted to eat it all! It was juicy, it was well-seasoned, it had great texture, and the combo of meat and cheese and caramelized onions was spot on. Everything worked!  Get the burger!", 
    "review_date": "2015-01-31"
  }, 
  "ru56jxMOThHWLccvXLPXdQ": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Natasha S.", 
    "review_text": "This was one of the best birthday parties I have been too. Never mind, that I was the genius mastermind behind the idea to have a party at a hip place such as this. Thankfully it was Pride and no one wanted to bowl on such a glorious Sunday afternoon because we had a nice choice of times to bowl.  There are only 6 lanes and you can only reserve one 7 days in advance. So, I think you have to be pretty zealous to get a lane in general.  The price is between $35-45 for one hour of bowling. The shoes cost extra and remember to bring your own socks because their only option are a crappy pair for 5 bucks. Obviously, somebody by the name of Natasha forgot her socks.  My bowling score was 104- which made me so happy because I usually bowl about a 30.  Those damn gutters are always in the way.  The bartender made me a glorious Bloody Mary to accompany my two previous Royal Bermuda Yacht Club Cocktails- a cocktail that tastes similar to the kind of drink that causes a lot of teenage pregnancies.  All the staff was unbelievably friendly and special kudos to the young kid that works the actual bowl desk. That kid is awesome and definitely knows how to do the service thing right.", 
    "review_date": "2013-07-05"
  }, 
  "BbBzub67X5sAHHTEtk2GAA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "I came here for a holiday event so I'm not too sure about what the prices are but after looking at the menu online it looks to be decently priced for the portions + quality of their food!  Coming to a place called \"Mission Bowling Club,\" I really didn't expect there to be food..  However, this was PROBABLY THE BEST BURGER I'VE EVER HAD (Gamine is a close second!) Doesn't need any ketchup or extra sauce because it's so damn flavorful and juicy. I can give this place 5 stars just for the damn burger.  Drinks are good and strong, and the fried chicken appetizer was also pretty freakin' amazing.  Bowling is fun and service is attentive. Clean and spacey. That goes for the bathroom as well. Lol =)  MM.. I can't wait to come here again...", 
    "review_date": "2013-01-13"
  }, 
  "UsXqCXRZwSCSw0AT7y1uBg": {
    "user_rating": 5.0, 
    "user_location": "Silicon Valley, CA", 
    "user_name": "Candice G.", 
    "review_text": "How out of shape does one have to be in order to get a giant muscle knot in their butt cheek after a game and a half of bowling?   Because that is precisely how out of shape I am.  Basically could not walk today. Totally not a joke. Totally worth having a pimp limp today for all the fun had wiping the floor with my co-workers during a friendly game of bowling.   Our group of 14 took over 3 lanes, had a small buffet of hand-held bites that kept-a-coming, and access to any of the bar's hand-crafted cocktails, craft beer, and wine. The only caveat on these things was that you couldn't bring the food over to the couch/lane area, so you basically had to stand and eat, but it was a good way to keep the area clear and clean so us bowling aficionados could have our space to do our rituals and bowls our strikes, spares, and sadly sometimes gutter balls.   I was surprised to see there were only 6 lanes in this bowling club, so it's not ideal for huge groups or coming in without a reservation, but they have a great bar, dining, and patio area if you're in it for just the food and drinks, which as far as bowling alley beverages and bites go- were spectacular, even including some vegan options (burgers- which were outstanding).  Besides all the winning I did, my favorite thing about coming here was that they've got great balls. A lot of bowling alleys carry mainly big balls that are in the 10-15lb range, and that's just too big for me. I need something more in the 7-10 range and they had quite a few balls that catered to my lack of upper body strength, just out and available so I didn't have to ask for a kids ball or anything.    I only wish I had more friends to bowl with... and that they allowed more character/spaces when entering your name on the score board so I coulda been 'BigErn'. 5 letters is too few letters, MBC.", 
    "review_date": "2014-10-01"
  }, 
  "c4bNOJ5XnKKoHJoQE4zrcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber M.", 
    "review_text": "Fun, relaxing atmosphere with good food. Lanes are hard to get and EXPENSIVE. You pay by the hour and they cut you off to the second :(", 
    "review_date": "2013-07-03"
  }, 
  "uXisHyFcwaeAvZDTwWjsKg": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Michèle S.", 
    "review_text": "We went there on a team offsite and I was surprised how nice atmosphere is. The bowling venue I know look a lot different, this one looks more like a bar which I liked. Since I am bowling newbie I can't say too much about that but the bar is great. They have a good selection of draft beer and you are allowed to bring drinks (not food) to the bowling area. Unfortunately I missed the food, but it looks amazing from the pictures on Yelp.", 
    "review_date": "2014-07-09"
  }, 
  "vbO4ZppKRL4cYeq_ud8PPQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amin S.", 
    "review_text": "I came here for brunch on Sunday and it was easily the worst brunch I've had in San Francisco. I had the fried chicken and waffles and my friend had the yogurt with quinoa granola and a bruleed grapefruit. The chicken was overly greasy and had a strong smoky flavor. This did not pair well with the bland waffle (the loads of butter on top didn't help either) and the fake maple syrup. The yogurt and quinoa was fine, but didn't go well together. The grapefruit was edible after taking off the thick layer of sugar.  The bowling was great, but not enough to merit a 2 star review.", 
    "review_date": "2014-01-25"
  }, 
  "RjXoItFdpC2juYjgu9sfUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy T.", 
    "review_text": "This review should probably be on Foodspotting  because I'm writing only about their chicory salad, but I don't have an account there and anyway I didn't take a picture.  They have the most amazing chicory salad. You have to try this. It is bitter tasting and dressed with smoke oil, which I had never had. The chicory is big, soft leaves that look like lettuce and are chewy like kale. They are bitter and I usually don't like bitter things but they also taste like bacon so somehow it all just works. I don't know how to describe it. Anyhow, just go there and get some. You won't be sorry.   They also have a butter lettuce salad with chunks of avocado in a lemon-mustard dressing that I enjoyed. And fried oysters, and mussels in bone marrow broth. My date liked that, but I didn't. We *all* loved their s'more brownie dessert. I almost didn't eat the bottom of that because I hate graham cracker but it turned out to be more of a toffee-cookie sort of experience so I was about to order a second one but I'm only just getting back into my smaller pants again, so I decided, maybe not.", 
    "review_date": "2014-02-08"
  }, 
  "3PBv7qP7MU7JX-HQ561W6A": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Kez Q.", 
    "review_text": "Best food and service that you will ever find in a place with \"bowling\" in its name.  GREAT  burger (with part of the $ proceeds going to local non-profits). Shrimp fritters that are mostly shrimp.  If you get the fries, and you should get the fries, the smoked chili aioli will ruin you for any other  fry condiments.   Great booze and even better bartenders.  Lindsay, Susan and Will- you guys are the best! The whole staff is pretty kickass, when you get down to it.  (No, I don't work there and I'm not sleeping with anyone that does - this place is simply doing it right ). Nice but quiet outdoor area where you can bring your bike in with you.  Restrooms would be better with paper towels along with the dryer. That is my only complaint.", 
    "review_date": "2014-11-25"
  }, 
  "-3RDox7tSilod2ntyXs2AA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron K.", 
    "review_text": "Mission Bowling Club hosted my 30th birthday party last weekend and they were absolutely wonderful!!  The planning and execution were both top notch and I could not be happier with the results.  Jillian, the Events Director, was extremely cooperative, thoughtful and engaging in the planning of the event.  She helped plan the menu (asparagus bruschetta, beet crostini, french fries and fried chicken), the number of lanes needed, the open bar for everyone and what was most wonderful was how flexible she was able to be on the number of guests as it varied between 30-40 in the final days (landed on 32).  While not present for the party, Molly stepped in and helped execute along with Nadia, our wonderful host that was assigned to our party.  Nadia was amazing!  We had 32 guests and she was extremely attentive to me and all of our guests for food and drinks.  She was also very good keeping me informed of when we met the minimum costs and wether we would like to keep the tab running (kept it open of course!).  The food and drinks were all delish!  This was my third time at MBC and only the first time I was able to actually bowl!!  It was a great time and I would highly recommend them to anyone looking for a fun venue to host a similar affair.  Thank you!!", 
    "review_date": "2014-04-28"
  }, 
  "YbZg36FoMgkKcTEPae5siA": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Amy J.", 
    "review_text": "My friends and I have stopped here several times just to hang out in the front patio for drinks and food. I hear the bowling prices are a bit on the higher side. The drinks are quite delicious including the non-alcoholic ones. We've ordered appetizers before too which were better than most bowling alley food.  The staff are super sweet and helpful. Perhaps maybe one day I'll bring some folks to bowl. I dunno though because there are much more reasonable bowling alleys in my area.  It's not very noticeable from the street. In fact, someone asked us where it was since we were going to the same place we just told him to follow my friend and me.", 
    "review_date": "2013-06-28"
  }, 
  "W0Y8ttpKctH8wIQJP4z6sw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ann K.", 
    "review_text": "Great fun, great people, terrific time. Eat somewhere else before or after.", 
    "review_date": "2013-07-22"
  }, 
  "N_IJg4Oy-OoYtzIE8Mxq9w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert B.", 
    "review_text": "Doorman was a hipster douchebag ( more on that later)  We went to this place for a team event and I couldn't have had a worse time. I will never be back to the place again.   Pros-  * Um, it's a bowling alley nearby my place.  Cons-  * As I was walking in I noticed a guy sitting on a barstool outside the place smoking a cigarette and talking to a girl on a fixed gear bike. I thought he might be checking IDs but he didn't look at me and didn't say anything. As I walked by him, this self-righteous hipster loser had the audacity to say, \"Yo chief, where do you think you're going?\" He then looked at the girl on the bike and was like , \" what does he think i'm doing, sitting here just for fun?\" and laughed. I told him he was an idiot to think I was going to assume his little hipster jackass self was actually employed by this place. Strike one - what a F'ing douchebag   * The bar staff was over-extended. They couldn't keep up with the amount of people that were at the bar. It took over an hour to get the drinks the 7 people with me ordered. Not really the fault of the bar, more of an issue with a lack of resources.  * We ordered the \"world famous Mission Burger\". Who gave it this moniker? It was fine, but nothing amazing.   * You are not allowed to eat in the seats where you're bowling. You have to sit on a bar away from the regular seating? Ridiculous.   Overall : I will always give a place a second chance, however this places \"I'm better than you attitude\" has turned me off completely. I wouldn't be surprised to see this place go up in flames when one if it's staff accidentally set fire to their wax mustache while smoking their Benson and Hedges cigarettes.", 
    "review_date": "2014-03-16"
  }, 
  "cZ32kzf_M5ZCpxq2y0vYDw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anne H.", 
    "review_text": "Here's the deal. This is a happening place. The ambience is edgy Edwardian meets pop art Star Wars. The food, service, and beverages are equally as impressive rendering an A +++ score.   The experience is worthy enough to justify the journey through the sometimes shady Mission neighborhood.   Fair warning however...  This place was hipstered out BIG time.  If you do not like the Runaways/ Belinda Carlisle circa 1976 punk look you may be a tad uncomfortable with the crowd.  I was born in the 1970's so I have never understood Generation Y's obsession with distressed cowboy boots, Laura Ashley jumpers, weird half shaved heads, and Super Mario brothers.  No matter...   Interesting observations  I observed an ultra-Christian bowling team (Bowling for Jesus) battle a team with matching fighter pilot jump suites and handlebar mustaches. I also observed a male bowler sporting a 1980's tail and mullet.  (Extremely random)   Bottomline: Worth checking out even if you don't ride the Apple or Google shuttle bus to work.", 
    "review_date": "2013-08-20"
  }, 
  "B_-hfjqjuaF0ScIrBYh9iA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick L.", 
    "review_text": "The only reason I gave it 3 starts was because after 2 hours of bowling we had dinner in the restaurant. The wait staff was great and super nice. They were attentive and very sweet. The food was bar type of food which we all expected, but what we did not expect was the over-saltyness on everything we ate... The fries were so salty it made the burger taste salty... So I think next time I would go bowling, but not for dinner... I will say I would go back for brunch sometime too... Overall it would receive 4 stars for bowling, 4 stars for service and 3 stars for food. Just stop salting everything so much... Please...", 
    "review_date": "2013-08-05"
  }, 
  "vubm_oo7r2dp39lwGztgCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eleanor L.", 
    "review_text": "I've been here several times for take out.  The food is consistently very good.  So if you're looking for a great place to eat in the neighborhood, you can't go wrong eating here.  Definitely give it a try.  I've just had their fried chicken and salads.  Looking forward to trying the burger.", 
    "review_date": "2014-06-30"
  }, 
  "LJVqYAAkezBZFSdcicv0pg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madhu P.", 
    "review_text": "Mission Bowling Club has become my goto first date spot in the city for a few reasons: 1. Even if the date isn't great, I still get to bowl so that's a win. 2. Really nice cocktails and fast bar service. I like their Bourbon Reviver or the Ruby Fruit if you're looking for something more sweet. 3. You can reserve your lane online up to a week in advance, so no need to wait. 4. It's usually a pretty lively crowd, even on a Tuesday night. 5. Also, bowling in the Mission. Did I already mention that?  The one negative is that it can get kinda pricey with the lane rental for an hour running you $55 and $4 per shoe rental.  Well, that's pretty much all you need to know. In case you're wondering, I've been hitting the 140-150s pretty consistently lately, which I consider awesome for a guy who doesn't know what he's doing despite watching Kingpin and The Big Lebowski about 100x.", 
    "review_date": "2014-04-10"
  }, 
  "kKhE9CsizWb7PEEg301s9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phuong M.", 
    "review_text": "Best burger of my life, hands down! Grilled onions, monterey jack, and caper aioli; cooked medium, and without any of the side toppings available on the plate. The shoestring fries were tasty as well. My friends and i split a plate of the home fries, and we agreed they were magical. Tasted as if they had been fried in bacon fat.  The cocktails were also quite good. The staff was really nice, especially when i had to change my reservation from 8:30pm to 9. There are plenty of items on the menu that looked good (i sampled my friends' ratatouille and chicken sandwich), but i will definitely be back to try a bunch more.", 
    "review_date": "2012-06-11"
  }, 
  "eDalDbIeIeJlZrSW-cpIIA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J R.", 
    "review_text": "AMAZING BURGER!    That's what this review is for. Not for the bowling. Not for the service. Not for any other food item. I am giving this place 5 stars for the burger alone. Yes, it is that good. I eat a lot of cheeseburgers, too (for example, I will easily go to Five Guys for lunch, In-n-Out for dinner, and Jack in the Box for drunchies).    First off, you could argue that the patty is the best pure beef patty in the city. Many places will mess around with the cuts of beef that go into the patty, or they will mix in bacon, onions, etc, and those are all great. But there is something really special about a burger seared in tallow (beef fat). Very rich and a lot of meat, too.    The bun is excellent as well. It is very soft and holds up well with the large, greasy patty wedged in between. The burger is garnished with caramelized onions (which are a little sweet for my liking), Jack cheese (could be good if they had cheddar or American, as well), and caper aioli (almost tastes like a high-end Big Mac sauce).    The fries it comes with are about as crispy as they come. I suspect they use cornstarch spray to achieve this. They are delicious.    All in all, for $15 (with fries), I am very impressed. I don't know if I would say it's the best burger in the city, but I find it hard to believe that there could be one out there that is significantly better.    I didn't get a chance to bowl, but there were not many lanes. The bar area has a cool vibe to it, and the service was pretty good. We also tried the dry-fried pork ribs ($12), which had somewhat of a curry flavor to them. They were great, as well; surprisingly tender for being fried.", 
    "review_date": "2014-10-02"
  }, 
  "ekaQsTZ_PlxR88xtHgZtcA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ravena F.", 
    "review_text": "Disclaimer: I am such a non-bowler, that I have in my history, a *sober* incident of having actually let the ball slip out of my hand behind me . . . yes, rolling *away* from the lane and pins and toward the snickering onlookers.  However, I do think that I've embarrassed myself in enough bowling alleys to be able to say: This place is seriously cool. And not just in a hipster way (although several reviewers would beg to differ) - I've definitely seen families, straights, jocks and squares here, all bowling away and having a grand ole time.   Best is to reserve ahead of time, as there are only 6 lanes. Further recommended is to eat and drink here: drinks are tasty, not watered down (as they are at other bowling alleys).  The breakfast egg &amp; sausage mcmuffin thing is the bomb.  Hamburger &amp; fries are solid as well.  You can even go and just drink or just eat - but why not do these AND bowl, I say?! At a recent baby shower here, the staff very graciously cut &amp; served our homemade cake, making it seem like we weren't putting them out at all.  Do go - you may just want to think twice about sitting in the seats directly behind my lane . . .", 
    "review_date": "2013-08-23"
  }, 
  "K-IwyVCopU0fuxToo_aHVQ": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Caleb M.", 
    "review_text": "The Mission Bowling Club is the s***, hands down the best bowling alley in SF.  First off, its much more than just a bowling alley.  The bar, with the giant 1080 p massive projector, is by its own right a properly stocked and entertaining establishment. Their cocktails are reasonably priced, delicious, and they usually are playing whatever Bay Area sports team is playing at the moment.  The bowling alley, while small, is a great time. The guys (n girls) that work the bowling operations are always going out of their way to make sure you have a good time n that you get in as much bowling as you can. The prices do go up later in the evening. Refer to the description of the bar, for awesome distractions while you bowl... i.e. projector n beverages.  And last but not least, what completes this well constructed puzzle is the dining room. The kitchen, now run under new head chef Chris Kiyuna, is some of the best food for its price in the city. The chicken roulade is exquisite, cooked sous-vide style with browned crispy brussel sprout chips... you had me with sous-vide. The burger is superb, and understated perfection of properly prepared meat, caper aioli, and a toasted bun.   I had to give this next nugget of information its separate paragraph-anything deep fried out of this kitchen is golden. The fried chicken is the best I have ever had, and the mushroom poppers are bomb.   In a nutshell, the Mission Bowling Club is a must. Even if you're visiting for a couple of days, I would recommend spending a day in the Mission, and some quality time with the one and only MBC.", 
    "review_date": "2013-07-26"
  }, 
  "GC7x8kBNx-gVyCCxck6VFQ": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Josh S.", 
    "review_text": "First time there for a friend's surprise bday party.  It is basically a bar,  bowling alley and small eating area.  We were one of two groups there for a surprise bday party and management proactively insisted that we couldn't yell surprise or blow those silly bday horns when the bday person walked in - because that 5 seconds of noise would disturb the two people in the tacked on dining area.    It seemed pretty irrational.  15+ people select your BAR for a bday party and you tell them they can't make any noise.  We are a very quiet group, not loud drunk bar go'ers on a Wednesday night.  The manager wouldn't even discuss it and was far from enjoyable to talk to upon inquiring.  Hilariously, part of her brief explanation is that they were worried about Yelp reviews.   The only way I can see it making sense is that they charge $15 for a hamburger, every other entree is ~$20.  Guess they are trying to earn their money less on the groups drinking and bowling, and more on food.   Burger had have a metric ton of salt in it.  Wouldn't recommend it.", 
    "review_date": "2013-12-12"
  }, 
  "ElvZfHPHe5g-Ib61IPXvDw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany B.", 
    "review_text": "This is a really tough review for me to write because I love Mission Bowling Club, and have always had a great experience there. I've experienced their brunch, dinner, and bowling, and normally it goes off without a hitch. (Reservations are clutch for busy times on Thursday and Fridays.) The bar is well stocked with generally quick service, and the bartenders know their way around most of my favorite drinks. They also make one mean Bloody Mary.  So why the negative review? I went to brunch at MBC yesterday; two people at my table ordered the chicken and waffles (usually delicious). I have a hard time finishing full portions, so I split mine with another diner at the table. The table next to us had 7 people who all ordered chicken and waffles, so the kitchen was a bit behind on the dish. The other two dishes my table ordered came out about 20 minutes before the chicken and waffles, which would have been fine if the three of us who ate the chicken and waffles didn't all immediately get sick.  My guess? They felt bad about being behind, rushed the order, and under cooked the chicken. The toilet was my best friend yesterday and today, and I'm not sure if I can ever order more of their friend chicken. Which is such a shame because it's usually delicious. So if your orders are coming late, make sure you ask them to cook the chicken thoroughly. Your stomach will thank you later.", 
    "review_date": "2013-12-16"
  }, 
  "PvBmRN4suldo06Kcz2-vcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin L.", 
    "review_text": "A friend and I got a reservation pretty easy on a Thursday.  Food was very good and service was quite fast.  We had the talked about burger, fried chicken and pork belly.  The burger was super juicy but could of use a bit more seasoning but cooked perfectly.  Probably one of my top 5 burgers all time.  Chicken as well, needed some seasoning both in the meat and batter.  Chicken meat to me had some citrus/lemon notes?  Weird but maybe it was a part of the brine?  Addendum in Yountville, best fried chicken ever.  Pork belly wasn't the star of the night but enjoyed the jalapenos and pickled/grilled cabbage?    To the bowling...There were huge crowds at the 6 lane alley.  The two guys working the lanes were cool ass shit.  We signed up at the start of dinner at 7:30 and they said it might not be ready until 10:15.  Well we finish dinner in an hour and was going to cancel the bowling because we weren't going to wait that long, but Fred did some magic and had us in at 9:15.  Awesome dude!    Nice bar.  Great outdoor patio.  Will be back to try the corn dog and the burger again.  And bowling of course!", 
    "review_date": "2012-08-24"
  }, 
  "pme7GsuU86rKc78DMoyBIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beril Y.", 
    "review_text": "Such a gem in the mission to get your bowling fix with drinks and good food. Really cool lounge area and bar plus staff is really helpful and kind as well.", 
    "review_date": "2013-08-11"
  }, 
  "FGkq_yMe53te4_o2f6JVpg": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Julie M.", 
    "review_text": "Come for the bowling but stay for the food.  We went with a group of 6 people.  First thing you should know is that when you make a reservation for dinner your doing just that.  Making a reservation for dinner.  If you want to bowl that is a separate.  You can not eat on the lanes just drink so be aware of that.    We started out with the fried chicken, crispy pork belly and the home fries.  The fried chicken was the best.  I don't know what the coating was but it was tasty and the chicken was really moist.  The crispy pork belly did not excite me.  I have had better. I had the mission burger and it lived up to all the hype.  It was cooked medium rare and was seasoned perfectly.  I would go back again just for the hamburger.  One of my friends had the short ribs.  It was ok.  The other had the jerk pulled pork, one had the fried chicken.  I tasted them all and with the exception of the fried chicken the burger was hands down great.  For dessert we had the Smor'd brownie and the cinnamon crunchy toast.  They both underwhelmed me and I would pass on them next time.  This was a really fun place with a great atmosphere.  It is certainly worth the trek (and it is one)  I would head over here again if given the chance.", 
    "review_date": "2012-06-13"
  }, 
  "5RCcFwMRghhw1wMhnZY5RA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hillary H.", 
    "review_text": "I feel guilty even writing a review about this place because its such a hidden gem.   Popped in here on a convenient Thursday evening for a little late night meal and some bowling. We only had to wait about 45mins which was perfect, so that we were able to grab a bite to eat.   We ordered the Mission Burger with some fries.(A++)  We were told the Burger was voted one of the best, so we HAD to try it. I must say, it was pretty damn delicious! The bartender/manager was absolutely one of the best parts...He was SO nice and informative of his knowledge of the area and the Bowling Club itself(Mike/Michael...I believe!?!)   This will become a favorite local hangout when i am in the area. Great place, good people and GREAT food!!", 
    "review_date": "2013-04-19"
  }, 
  "-IRA58GTq9LLA2MXD24DfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin F.", 
    "review_text": "I came here for brunch yesterday (Sunday) with my fiance. It was absolutely astounding. I can't say enough about the food. The whole time we were there, we kept saying \"is this possible? How is this so good? That kitchen is so small?\". I think they have a magical vortex in the back where delicious food comes out somehow, because, oh my gosh. It is indescribable. We split the french toast and the chicken and waffles, and holy crap, it was all good. So good. The french toast was eggy and delicious, and the chicken was cooked to perfection - the chicken even has some chili sauce cooked in it...oh my gosh, heavenly.   The waffles are cornbread waffles, which are not my favorite, but they go brilliantly with the chicken and chili, and are a great pairing. Also, we had the best mimosas we have ever had in our entire lives here (and I love mimosas). They were just...perfectly balanced. Usually you get a mimosa and it's good, same old same old, but these were just... mind blowing. Everything was. I am absolutely bowled over (haha see what I did thar) by this place, and will come back again and again! Love love love. Our waitress was also lovely, helpful, and wonderful! Seriously. If I had a million stars, I would give this place all of them. If I only had to eat one meal for the rest of my life, I would want that fried chicken.   Also, the bowling is really fun. :) As a native Bostonian, I obviously prefer candlepin bowling, but this was still ok. The food clinched it for me, though. Stellar food and great drinks, and some fun stuff to do? I am in. I am so in. Can't wait to go back!", 
    "review_date": "2013-11-04"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "You know that guy that's great on paper? He has a double masters, a promising career at one of the Big Fours and spends his free time volunteering at The Food Bank...  He seems so perfect until on your third date at Balboa Cafe (which he suggested), you find out that e-v-e-r-y-b-o-d-y knows him by name. You then overhear from cougar #16 that he has mommy issues and has went through the entire cougar town and then some. Guuurrrl, I hope you kept that cookie IN the cookie jar!   This is how I felt about Mission Bowling Club (MBC). After being featured on a handful of foodie publications and being praised as having \"one of the best burgers in SF\", I found it to be sorely disappointing. They might as well be featured on Fieri's Triple D because that's how overrated I felt the food was.  MBC has been on a radar for quite a while since I bookmarked it after reading that the chef came from Coi and the Front Porch. I recently found out that this chef is now at Ichi + Ni Bar; overseeing the izakaya kitchen. I revisited Ichi last week and the sampling of izakaya item(s) we had were stellar so I think it's safe to assume that with his departure and the slew of recent bad reviews that MBC has gone downhill.   With a small, focused menu with less than 20 items, everything should be executed well; theoretically speaking of course. Unfortunately, almost everything we had at MBC was poorly executed.   I'm not much of a fried chicken person unless it's KFC (the Korean kind) but I do follow the 7x7's Big Eats List. I'm completely baffled at how MBC's Fried Chicken (3 pieces - $10) got on that 2014 list: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1fp8CKp&amp;s=8afc2bd9f0179ebf6ee62d42de0e34369a5e15963098544fb1d29e73104b82ba\" rel=\"nofollow\" target=\"_blank\">bit.ly/1fp8CKp</a>. They should rename it to \"deconstructed fried chicken\" because upon biting into, all the batter fell off the chicken like an easy beezie smashed on one too many patron shots. We also ordered the Deviled Eggs ($8) which were dry and tasted like leftovers from a tea party.   Another round of disappointment came with the much raved about Mission Burger ($15 + $1 avocado) which was on 7x7's Big Eats List last year: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1fnr0xi&amp;s=16476696231b4ec72616272c5c44e7ced57ee8e8219860ff3e279b8c829a6eb0\" rel=\"nofollow\" target=\"_blank\">bit.ly/1fnr0xi</a>. I read that MBC uses a \"granulated\" patty modeled after the Heston Blumental technique. Blumenthal's, (UK chef of The Fat Duck, 3-Michelin stars) technique of \"granulated\" patty involves grinding pre-salted beef, aligning it in parallel rows before forming into a roulade (log), and then slicing into patties. The result is supposed to be a more tender patty because the grains are running in the same direction as you bite into it.  I'm sure the original Blumenthal burger is perfection but MBC's execution fell really flat because what resulted was an incredibly salty meat puck with a texture of a tightly packed sausage: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1huBaPU&amp;s=8202d22d6c69b7b015fff9868a238b7cb215610aa5674014155a53c24461d0f0\" rel=\"nofollow\" target=\"_blank\">bit.ly/1huBaPU</a>. I like my beef patty to crumble into my mouth. This didn't. Sure, it was a big, half pounder burger but who cares when it was so overbearingly salty that I could barely finish half. Three of my gfs who also had the burger agreed that it was way too salty. The super crunchy fries (double fried?) were otherwise good albeit greasy.  The best thing of the night was the S'more Brownie ($8) and I don't even like brownies: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1bJkqGp&amp;s=07c6f8521ab2a5134a85a5cfa627e519fde3ab1bbbcb5d03f22a8ee1d774ab33\" rel=\"nofollow\" target=\"_blank\">bit.ly/1bJkqGp</a>. It was super chocolately with a nice crunchiness and oooeey goooeeyness from the torched marshmallow.   Disappointing food aside, service was painstakingly slow. Our waitress was really sweet (and so are the bouncers) but the kitchen had some major timing issues as it took over 40 minutes AFTER finishing our apps to get our burgers. Our manfriends sat at the table next to us and were done in an hour but we were left still waiting for our food. Mind you, we were the second table to order and the couple next to us who took over our manfriends' table received their food before us. What the heezy?!?!  Beware of the wrath from the female waitress with black, shoulder length wavy hair. As we were gathering up to leave, we stood near the ramp, and with a huff and a puff, she rudely said, \"Guys, I'm going to be coming through here all night ok!?!\" basically saying to GTFO of her way. My bad, your hipster majesty, we should of rolled out the red carpet for you.   MBC is a large venue for the Mission standards but tiny for bowling alley standards. There's an outdoor patio in front, a bar area with communal tables, a small dining area and an upper loft dining area. There's only 6 [short] lanes for bowling which you MUST reserve.   Our group came in six different cars and parking didn't seem to be an issue unlike the more central part of the Mission where hot spots like Beretta, Lolinda and Foreign Cinema are located.   TIP: If you plan to eat and bowl at MBC, allot at least 2 hours to eat since service was as slow as a herd of turtles moving through a pool of nutella. So slow that the girls missed our bowling time slot.   MBC is not 100% at fault though since our manfriend organizer thought an hour would suffice for a group of eight to eat. Sorry J, but not all of us finish fast like you.", 
    "review_date": "2014-02-26"
  }, 
  "kyqtO6okDapzZBekubM1xw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "morgan m.", 
    "review_text": "We read that this burger was a competitor to the Zuni burger and the likes. Not even close. Overcooked and underwhelming.  We're used to small, overpriced cocktails but these take the cake.  Not coming back. Ever.", 
    "review_date": "2014-11-09"
  }, 
  "hOPhxpCvB2bKjRoMG16OCw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Asmita J.", 
    "review_text": "Came here for a celebration, and had a great night! I actually didn't even have a reservation for either dining or bowling, but still managed to get a lane on a busy saturday night.   The food is mediocre - perhaps a bit too greasy for my liking (but what can I expect...I'm at a bowling club, right?). There were more empty tables than I would've expected, so I'm guessing most people come for bowling and drinks/apps. The prices are fair (~$15 for a burger with fries...) for the location.   There are only 6 bowling lanes, so things can get busy during the weekends. the four of us bowled for 1.5h, played roughly 2.5 games and spent $25 each for bowling including shoes. Being able to enjoy drinks made bowling a thousand times better (you can drink on the lanes, but can't eat).   All in all, we had a great night and I would definitely recommend the place to anyone wanting to enjoy a more adult version of bowling.", 
    "review_date": "2014-02-09"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "True story: I took bowling instead of gym class in high school. Back in the day, I used to be pretty good. Top score ever? 199 (just a pin short of 200, might I add).  Fast forward many years and I find myself at Mission Bowl, throwing gutter balls down the lane. I guess what they say is true, practice really does make perfect.   Even if you suck at bowling, a few games here is a lot of fun. Great space, nice bartenders and a special treat in SF. The only other bowling alley that I'm aware of in the city is all the way in the Presidio, so great business idea.", 
    "review_date": "2012-11-07"
  }, 
  "wkNUVy8LK28OytucC8MASw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek W.", 
    "review_text": "Just the notion of combining bowling and creative cuisine under one roof merits praise.  Then when you toss in the avant-garde bowling-themed decor and an overall vibe of retro-recycled chic, you are hitting a strike on nearly every frame.    Our lively Irish waitress was extremely pleasant and engaging, although we did wait just a bit of time for her to show up (note: the scene here for diners is frenetic but not intrusive or rushed).  This gave us time to get acclimated to the menu and offer silent prayers that our lanes would open up before the cows came home (alas, no...see below).  Dinner was a far cry from the hot dog, cheese fries and fountain soda feasts of my bowling-obsessed youth.  We started with a big, salty bowl of \"home fries,\" somewhat pedestrian on their own but instantly convertible to a can't-put-down finger food when paired with MBC's avocado-edamame dip (we had to ask what combination of ingredients was creating the creamy-earthy goodness).    Hot on the heels of the fries came a seven bean salad served over mache and whimsically strewn with edible flowers and crunchy fried chickpeas.  A perfect, fresh, flavorful palate cleanser, and a great tee-up to the hearty roasted chicken.  I used to think ordering chicken at restaurants was a cop-out decision that steered me away from more inventive options -  not here.  This chicken is roasted in a sublime fashion that produces impossibly moist meat that melts in your mouth while exploding with the tanginess of pickled mustard seeds.  The \"crispy skin\" perched on the bird when it arrives is the proverbial cherry-on-top, a guilty pleasure that adds yet another satisfying dimension to the dish.  We didn't get to experience the bowling after all, but the gentle thud of bowling balls on hardwood and pins hitting the deck was a great soundtrack for the evening.  And everyone seemed to be having an awesome time and not taking the actual bowling too seriously - no slick, off-duty PBA bowlers in this joint.", 
    "review_date": "2012-07-22"
  }, 
  "xoOVvRGOFG3hwzz19F3Y9w": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "Nadeem A.", 
    "review_text": "What's better than eating and bowling? Eating and bowling as a work event, that's what! The food was good, and the bowling was fun, so this event was right up my alley.  We had the mushroom lettuce wraps, beet crostini, french fries with a smoked chili aioli sauce, and fried chicken with ranch  The chicken and fries, along with accompanying sauces, were really good. The lettuce wraps and crostini were interesting, but didn't really do it for me.  The food on it's own, or the bowling on it's own, wouldn't have merited a 5 star review.  But it was just the combination of it all, plus the good service that we received, that made for a 5 star terrific good time.", 
    "review_date": "2014-11-14"
  }, 
  "EGvptPOz6SDKdxvbeqQ7Vw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc T.", 
    "review_text": "Very cool spot. More of a bar with pretty good food and art than a bowling joint. Mini gastropub slash art gallery with bowling lanes?  There are 6 lanes so you have to reserve a spot. I actually bowled my highest game here which was awesome.  Beer wise it has a pretty good selection and the prices are reasonable. Green flash on tap makes me happy plus all their Belgian selections were nice They also have a good assortment of liquor like hangar 1 vodka.  Food wise, there's a decent selection. From corn dig sausage to bug burgers to pork belly. I was disappointed by the pork belly since the serving was small but it was good.  The spot is cool and if you really want to bowl, this probably isn't the place unless you can get reservations which we did. Great bar spot though!", 
    "review_date": "2012-10-02"
  }, 
  "fMUBsXKl8GYHTj5cqAbvBQ": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Elaine P.", 
    "review_text": "Went to Mission Bowl to celebrate my sister-in-law's birthday on a Sunday at 4pm during family bowling hours.  The food was great and the upstairs is perfect for a large party.  The management however is terrible.  We had a great server but about 30 minutes after we got there they came upstairs to tell us that minors cannot be in the bowling alley after 7pm.  No problem.  However, over the course of the next 2 hours they told us 6 times.   No issue leaving at 7 but it was completely annoying and insulting frankly that they continued to remind us like a broken record.  If you don't want kids there, make a no kids rule. But don't invite families in and then ruin the experience by continuing to remind them that they have to leave as soon get they get there.  We will not be going back, with or without kids.  (Update) The Events Manager followed up today to apologize on behalf of the staff for the unnecessary multiple reminders of the 7pm policy.  We appreciate her focus on good customer service.", 
    "review_date": "2012-08-20"
  }, 
  "tFpue3FaJQWKmVRm2vFq_g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sly C.", 
    "review_text": "Had a great time here. We got a dinner reservation at 6 on a Saturday night but since we weren't able to reserve a lane, figured we might be out of luck for bowling. Luckily, since they keep some of the lanes open for walk-ups, we were able to put our name on the list before we sat down to eat, and the bowling desk guy came over and let us know the lane was ready just as we were finishing up dinner.  Dinner was tasty, and the veggie burger is definitely worth a try -- it's a chickpea panisse (chickpea flour formed into a patty). Fries and salad were good too. Cocktails were fine, and they do a couple beer flights too.  Bowling was great! The music was excellent, and the room wasn't too loud (or quiet). The scene was low-key but fun, and it wasn't too crowded. Rental shoes were surprisingly un-gross ((maybe I'm just used to really old, gross bowling shoes?).", 
    "review_date": "2014-10-13"
  }, 
  "9fe41Vmw245Eho1PghHHKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy O.", 
    "review_text": "Came here for brunch, and was so excited to see a menu that had some original things on it - or a more modern twist to brunch options with fresh ingredients.  My brunch companion ordered the chilaquiles - a deconstructed one with fresh guacamole. It looked beautiful, and she loved it.   I had the pork belly dish that came with two poached eggs, potatoes, saukercraut. It was beyond perfect balance of flavors and textures. I was so pleased.  Their coffee is Four Barrel - makes sense, the place is right around the corner. Their cocktails are innovative and smart. Also, super tasty.   Service was friendly and didn't lack in anyway.   Overall, a great experience! No need to bowl, but there are a few lanes. I'm excited to try dinner...or maybe throw the ball down the lane.", 
    "review_date": "2014-03-23"
  }, 
  "NiuqkrQQAh3B_HQMhb5wsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M B.", 
    "review_text": "This place has a great ambiance. And you're paying for it.   On the whole, prices seemed 25-30% higher than I'd see/expect elsewhere. While its sorta okay, because it's so nice, it sorta also sucks.  Things to know:   During happy hour, burgers are cheaper @ $10. After happy hour they're $15 but  they come with fries, which are $6 if you buy separately. So if you plan on having a side, it's *cheaper* to come after happy hour. (I wasn't feeling too happy when I realized this.)   The cheap beer was super skunky last night, and more spendy then at similar hipster hangouts, so it was also a poor deal.   The chicken sandwich is okay, but the chicken on a stick is better.   The burger didn't look to great to me, but tasted excellent. Really good.   Friends got the mushroom fritters, which were heavy dough balls- I'd skip them. Blegh.", 
    "review_date": "2014-07-18"
  }, 
  "rAcQ-AcLwFm6DxiiCkXOYA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan R.", 
    "review_text": "I'm leaving a one-star because I don't appreciate businesses that discriminate against people with families.  Mission Bowl, even though they serve food, prohibits people under 21 even on their patio during brunch -- even if the patio is totally empty!  I have been here a few times for parties including parties I helped organize.    But recently I went back with my wife, my son and a friend on Sunday while they were serving brunch.  We walked into the patio area which has a couple dozen tables, of which only 2 were occupied.  We went to sit at one of the many unoccupied tables and were immediately approached by a waitress telling us to leave and pointing to a sign we had missed saying nobody under 21 is allowed.    If they want to discriminate against people with families, I guess that's their business decision to make (unless it's illegal which it might be).  But if they make that choice, then they deserve to suffer the results of that discrimination too -- and that includes me telling everyone I know not to patronize Mission Bowl, telling my company to stop having parties there, and letting people on Yelp know about their policies.", 
    "review_date": "2014-10-26"
  }, 
  "ES12kMOR5fdoEnSXvxE0qw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "scott h.", 
    "review_text": "Amazing little bowling alley. Friendly staff. Outstanding food. Immaculate bowling lanes. Clean bathroom. Fully-stocked bar! Overall WOW!  Friends and family celebrated several birthdays at once. We had two lanes for two hours. Kids and adults had a GREAT time. Everyone loved the food. Some loved the adult drinks. I loved the VERY STRONG coffee.   The ambiance inside is very cool, but the sidewalk outside is anything but. The neighborhood is a bit rough with a meth-prostitute wondering back and forth on the sidewalk.", 
    "review_date": "2015-01-11"
  }, 
  "mVxg_vBXcUAAQJ03uHxiIQ": {
    "user_rating": 1.0, 
    "user_location": "Austin, TX", 
    "user_name": "Alex C.", 
    "review_text": "They're trying, but bad service and a couple kitchen gaffes left me feeling burned.   No waitress for over 10 minutes after we sit down. I finally catch a server and ask \"are you serving this table?\" She says \"let me check,\" and then it's another 5 minutes before she comes back and confirms that yes, she is serving us.   Drinks were slow and some were forgotten (later brought out after a reminder). Two of our four food plates were well behind the other two. My companions seemed to like their food OK, but my eggs benedict was almost totally cold and was served on raw untoasted english muffins. Maybe next time.", 
    "review_date": "2014-02-15"
  }, 
  "JVHlFff199O9R0JjKaE0ew": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anastasia P.", 
    "review_text": "Came here on a Wednesday night for a friends birthday. For just five of us it took 2 hours until we could get a lane so we had some overpriced drinks and ate dinner. Everything was slow and over salted. Cool atmosphere and good for small groups of hipsters but it's way too small and overpriced.", 
    "review_date": "2015-01-23"
  }, 
  "gaPnh6koItDnhZbciG5GPg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Justin P.", 
    "review_text": "Some things in life are just meant to be paired together. Peanut butter and chocolate. The Splash Brothers. Bacon and...everything. Mission Bowling Club does the same, combining a bowling alley and amazing food to create a truly unique experience. A bite of the burger and sunchokes instantly washed away years of trauma inflicted by the food provided at childhood bowling alley birthday parties (parents: don't let your kids eat hot dogs of unknown origin).   One unexpected treat - The Nightmare Before Christmas was playing on a big screen the night we were there. Watching Jack Skellington, Sally, and Oogie Boogie dance to the music playing in Mission Bowling Club was absolutely brilliant.", 
    "review_date": "2014-12-21"
  }, 
  "2Ul7JOPv4PwAwhmF0WlUag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle I.", 
    "review_text": "We came here for a work function and it was superb. We didn't have reservations and with some heavenly intervention we got two lanes right away. Its $10 an hour to bowl and $4 to get the shoes. Not bad at all. I expected it to be worse.   As a group we decided it was very necessary for team building purposes to try (pig out) on the cheeseburger. And boy did we bond. We bonded over how stinking delicious it was!!! Its big, succulent, tasteful, and downright amazing all around.   I love it here. Great spot. On the small side so it may be harder to get lanes on those busier days.", 
    "review_date": "2013-08-18"
  }, 
  "O9iVmgS_hPtNd887LDBctw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saminda W.", 
    "review_text": "The fact that this place is a bowling alley seems incidental.  With 6 lanes, it's not really designed to be the focus of the venue either.  I've been a couple times and really just enjoyed the food and drink, and the comedy of watching hipsters try to bowl in skinny jeans.    Their food is pretty good gastropub fare, and I am huge fan of the burger (get it medium rare), and their fried chicken is not bad either.  The first time I went, I enjoyed some good beers on tap and a decent cocktail too.    Fun place to hang out with a couple of friends and think about bowling. I don't really like bowling so it never advances beyond that stage but I am not complaining.  It's just kinda cool that we have hipster versions of everything now in the Mission, including miniature golf at this point!", 
    "review_date": "2014-06-08"
  }, 
  "WDsr8RnPqbceR3s2yZYr3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron M.", 
    "review_text": "Yeah, it's as cool as it looks from the outside.  You walk in, and you can grab a seat at the high tables behind the bar, from which you can see, holy cow, people bowling in the Muthaeffing Mission.  Somehow I felt like this should be occurring about 2000 miles east of here in the Midwest.  They have a number of great things on the menu.  At the server's suggestion we tried the mission burger which was dripping with wonderful juiciness, plus the \"asparagus bruschetta\" which really should be called the \"miso with egg yolk magic dish\" because that's the sauce that does all the work on this one.  That was my fav and I highly recommend it - and it's vegetarian!  They also have a decent beer selection including Old Speckled Hen, a cream ale  (it has creamy head like a Guinness).  They also let you do a \"beer flight\" which is 4 mini glasses for $12.  I love that.  I'll have two, thanks.  See you again soon, Mission Bowling Club.", 
    "review_date": "2014-07-16"
  }, 
  "426IAYOuscDp4KzKa1_mcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mella M.", 
    "review_text": "I decided to have my birthday here last year after having tried the spot just weeks before I was impressed by the quirkiness and easiness of this place . I'm pleased to say that it all came together on my birthday and it wouldn't have been right if it hadn't been at Mission Bowling Club.  MBC is located in the Mission area just blocks away from the Southern Brewing Co. and has plenty of street parking, too. Inside MBC is a good-size full bar, seating for dining, a dj booth, and about 6 alleys for bowling. The spot does get busy so please do make rezzies via online. MBC also has outdoor seating in which you can bring your dogs and enjoy the hipsters that pass by!  One downside is to MBC is the short food menu, however, it does have a couple of mentionables which include their infamous burger and fries and MBC even has a brunch menu worth checking out. . I do also have to bring up their specialty cocktails, which is great if you're planning to do a group thing (like I did), MBC has a full bar and offers all types of beer on tap!  Overall, the main reason I did book my event here was because it was great for all ages and allows everyone to have a good time whether it was just enjoying the burger, bowling, having a cocktail, and/or even just enjoying the lively scene- MBC was great for all these things!  Thanks MBC for celebrating my birthday with me and making it a happy one!", 
    "review_date": "2013-06-26"
  }, 
  "B6xxXHebsWphZe4_uXi3pw": {
    "user_rating": 4.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Jon H.", 
    "review_text": "We came for the fried chicken - and it did not disappoint. The chicken was tender, juicy, and crispy. The waffles were a wonderful cornmeal waffle, served with maple butter!   The sangria and Bloody Mary were a perfect to go with it.   We will be back to bowl...", 
    "review_date": "2014-10-26"
  }, 
  "s4eGhA7wluf_g-4ib9s_4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirley T.", 
    "review_text": "My shuttle use to always pass by this place and I really couldn't tell what it really was.  The word \"bowling\" is on the building but there are also some contemporary art pieces and outdoor seating.  Doesn't really seem like the typical run down bowling alleys that I know, and after checking it out, I realized that it really isn't typical.    Mission Bowling Club is like a hip high-end bowling alley with art pieces inside and with surprisingly good food and drinks.  (Not just beer).  I was quite impressed with the the atmosphere of the place and the tri-tip sandwich that I got wasn't half bad.  I also got the fried chicken and it was displayed very nicely.  It was crispy and decent.  Can't say it's the best fried chicken I've ever had but definitely good enough for me to say \"Wow....food and drinks are pretty good here (at least it surpasses all the other bowling places).\"  It's a good hang out spot.", 
    "review_date": "2013-03-12"
  }, 
  "C1ccV5ednpSJSL5NKibCOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "The fried chicken is one of the best I've ever had. The crust on it was so crunchy it was unreal. My first thought was someone used crushed up biscotti to make this :)  Lots of flavor in this super moist chicken that I never even touched the ranch looking dipping sauce.  The burger was also great. Juicy, ground on site patties that stands out from other burger joints. Two thumbs way up!", 
    "review_date": "2013-06-08"
  }, 
  "pauOTA3dvD944S6IhDAiBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael C.", 
    "review_text": "This place is so new, you can't even tell that it exists if you research the address on Google Streetview. But it's there and so are the crackheads! I came here for another friends birthday and we all had a good time!  There's a really awesome patio that fronts the bowling alley. There is plenty of space to lounge with drinks, or park your bike off to the sides of the patio. There is one person at the front who checks IDs, sorry kiddos, this is 21 and up. There is a bar on your left and seating to your right as you enter the actual building. The lanes, approximately 6-7 standard regulation go from the rest of the front to back. The building appears to have been an old warehouse, and there is this awesome skylight that runs over the top of the bowling lanes. The decor just feels right for a bowling alley. As a group we tried to guess how much it cost to build this place up. I had researched in the past how much it might cost to start just a club/bar and you usually need about 1.3m in capital to make a decent bar and take over the plot of land. But this obviously had to be a lot more considering that they put in a complete renovation, installed multiple bowling lanes. I took my guess into the 3m range.   I was really starving, so I made the rudest call and ordered food before the birthday girl arrived, and made her really jealous as soon as she arrived. It's okay my friend still hates me :D I got the 1/2 lb. Mission Burger and ate it really slowly in front of my friend. I pointed to the patty after the first bite, to show her that they actually cooked it Medium Rare, just the way I liked it. The bun was so tasty too! I also proceeded to eat my shoe string fries very slowly and also demonstrate that they were slightly spicy! My friend, the birthday girl was pissed. Who's an asshole? This GUY! That's okay eventually her corndogs and fried chicken came out and I dropped my jaw. They came out on platters skewered by their own sticks and propped up on the plate like they were part of a mid-evil castle. I also had a payback porter to wash everything down.   The waitstaff was really helpful and courteous. They were not overbearing at all, but I can't say they the were doing anything exceptional. There was a $5/person cost for cake cutting since we brought our own cake to celebrate my friend's birthday. What a phenomenal deal!  We didn't get to try out the actual bowling lanes, but maybe another day! I would definitely return to this place, the environment is low-key and relaxed, exactly what you want for a weekday night.", 
    "review_date": "2012-05-11"
  }, 
  "FIkDUA_Dsjs-pKtuqFf8bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "I was really happy when I went here.  The bowling is pretty good, the local crowd seemed great, and I would have been super happy with the food in an upscale restaurant, let alone in a bowling alley.  It was crowded; you have to be okay with not a whole lot of personal space.  And, with any crowded young group place, it was pretty loud.  But, I'll be flat out - I haven't had this much fun bowling in years and years.  I would strongly recommend this to anyone who's got a hankering to throw rocks at pins.  The prices are pretty high, but in my opinion, they're worth it.  Good luck parking though :(  I mean yeah, it's San Fran, just, leave some time to find something, and expect a couple block walk.  Five stars.", 
    "review_date": "2013-02-17"
  }, 
  "5i2Uwd20tuR4RM5mq7RX3w": {
    "user_rating": 1.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Mel N.", 
    "review_text": "We booked a large party (14 people, 2 lanes) in advance, and arrived a couple minutes early.  The guy at the desk had given away one of our lanes to two people, leaving all of us on one lane.  That lane didn't even work properly.  The pins failed to reset, and the same guy who was running the desk was supposed to be running back to do the maintenance.  The balls were poorly drilled, and the bar service was nowhere nearby.  Fail.", 
    "review_date": "2012-12-19"
  }, 
  "DkFR-AE68Nr0jRR8mKQmlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sin F.", 
    "review_text": "Killer establishment!!  Had no problem getting a lane to bowl each time I've went.  The staff was pretty chill and the place was less pretentious than I expected.  One major perk was that the pins always reset with no hassle.... I've never been to a bowling alley where the pinsetter didn't freeze and you have to reset numerous times or go grab someone.  Prohibition Witness beer on tap was choice.  Only drawbacks were that there are always private events happening and that it is pricey.  Overall helluva cool place!", 
    "review_date": "2013-05-03"
  }, 
  "JJNdVimvX83J9Qu-IXh_Jg": {
    "user_rating": 5.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Monte H.", 
    "review_text": "This place rocks! Especially the bar. Lindsy behind the bar is the perfect mixologist and uses unique ingredients like her own home made tonic.  Really, really good. They have a good Central Coast Sangiovese ON TAP! The place is really fresh and original, the staff friendly and helpful, and the foods good. From Vegi burgers and steaks to pork and unique small plates.", 
    "review_date": "2014-07-29"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "Now I had the Danny's burgers back when he was making them in the Doi Loch Supermarket for $5/per, so it is a little painful to see them here for $15.    But such a cool spot in SF that everyone should check out, a real hidden gem in the Mission.  We were passing by on the way back from Charles Chocolates and thought we would stop for a quick bite (Thursday around 7pm). Without a reservation we could only eat at one of the bar tables (bonus points for purse hooks under the tables!). We spilt the fried chicken appetizer and the pork loin entree and 1 beer total was about $30 pre tip.  The chicken was yummy and a pretty good portion for $8. crispy and spicy, sorta like fried buffalo chicken. The pork was just okay - but I still love this place. I would love to come back for Brunch and/or a fun night of bowling &amp; snacking with my girlfriends.   Decor is fantastic, just the right touch of classy, quirky and cool.", 
    "review_date": "2013-06-12"
  }, 
  "5GqtMUFZwn9oxeLBT22ViQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine D.", 
    "review_text": "LOVE this place! I've never been anywhere like it -- trendy, fun and vibrant bar and restaurant scene with cool bowling?! Yes please. They also have an adorable outside patio where you can enjoy a cocktail and an appetizer while you wait for your group's turn on the lanes.   After having come here once, it is now a constant thing I suggest for group activities or out of town guests. An easy, super fun and lively place to enjoy some quality time with friends. Couldn't recommend more.", 
    "review_date": "2014-09-07"
  }, 
  "e3xe2-HZrYElon__E7GGTQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sarah S.", 
    "review_text": "Forget about bowling.  I come here for the solid $10 cocktails and the great burger.  Been solid the last 3 times.  The fried chicken is a little too greasy.", 
    "review_date": "2014-04-02"
  }, 
  "4RlzFohEgBdFXUGoqvpZqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa N.", 
    "review_text": "*On our quest to try 52 new places in 52 weeks.*   You are going to fight me on this. You are going to say this doesn't count as a place to get drinks, food, or coffee. BUT we did have drinks here, it's new, and we've never been, so I am keeping it on the list., damnit! At least for now.  We came here last Saturday for my friend Lia's birthday. She had reserved the lane ahead of time so we didn't have to wait. Clean, hip, and new. And amazing art on the walls to boot! The rentals for shoes seemed cheap and to be honest I can't tell you how expensive the lane was to bowl, but the hour sure went by quick! The waitress was SO nice with her cute little top knot and was very accommodating when some extra drinks we didn't order were put on our tab. To be honest, everyone in the place was celebrating a birthday s0 it had a fun, celebratory vibe. I will come again!", 
    "review_date": "2012-05-25"
  }, 
  "LgqaNO1mXwWncSfmSn2AtQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jenny P.", 
    "review_text": "Decent beer 'n bowling. Pop-y tunes make you want to dance. Plus, nice staff.", 
    "review_date": "2014-03-20"
  }, 
  "6kWAL8wWRAe17ARc78Ay9w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Noah C.", 
    "review_text": "When I was invited out to the city by some friends for bowling, drinks, and food, I had a bad feeling that it was going to be Lucky Strike. I hate Lucky Strike and everything it stands for. Happily, though, my buddies insisted that Mission Bowling Club was not Lucky Strike, and even better, had a menu conceived by Anthony Myint from Mission Chinese.  And Mission Bowling Club, friends, was a good time.  Yes, the wait was long for an alley, but the food and drinks were good and kept us busy until it was time for our turn.   Drinks wise, I wound up drinking Manhattans the whole night. They were well prepared, though maybe a bit too light on bitters. For food, my group snacked on the fries and the awesome pretzel with the lardo infused mustard. I couldn't resist trying the burger, and it was pretty damn delicious, especially the caper aioli.  The bowling experience itself was fine. It's not the best, most polished alley I've ever been to, but I kind of don't even think that's the point. It's a great combination of food, drinks, and good times.", 
    "review_date": "2012-05-08"
  }, 
  "ZBLZIOrO3DZJzDFlFO-bJw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Carlos A.", 
    "review_text": "This place is a winner. I've been to Lucky Strike (In Hollywood) many times and while nice it is crowded and the food is mediocre and drinks expensive.  Mission Bowling has excellent food, good drinks and has a relaxed bowling vibe. The food is so good I'd go there for the food alone.", 
    "review_date": "2012-05-06"
  }, 
  "0c_GFwm7lkj_4avuwWvicg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Joiera C.", 
    "review_text": "I really like the food and how intimate this place is. It was such a great place to bowl and also the brunch on the weekends are not bad after all. The location is a little sketchy but other than that, i think i want to come back and bowl again.", 
    "review_date": "2013-10-14"
  }, 
  "awoGUpad0Ng6ftpkywwVgQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maji H.", 
    "review_text": "NOT a full service bar, actually no service at all.  I can't believe how lousy we were treated the day of my birthday! My boyfriend made reservations a month in advance. When we checked in with the hostess they had two booth tables for us at opposite ends of the dining room! Even though we had reservations, they would not sit us together, they would not put tables together and the tables that were together were needed for \"walk in business'. I guess the idea of walk in business was more important than guaranteed business with reservations.  By some miracle a table upstairs had \"opened up\", which is amazing seeing as how we already had reservations. So we went upstairs, when the rest of my party showed up, once again they wouldn't allow us to put another table on the end because it was a \"fire hazard\" and they wouldn't let us sit at a larger section. Our waitress said, \"This is what's it's gonna be, so deal.\"  I guess on some level I can understand all their policies, but it wasn't just that, it was the way they spoke down to us.The house manager refused to speak to us, she made her hostess do all the dirty work. On the way out, the doorman actually told us to \"Keep it down!\" It's an effin bar, on a Saturday night! What a dick!  As a native to this city, I still have trouble with how much the mission has changed over the years. The fact that a stuck up establishment even exists in the mission, still gets to me. If I wanted to be talked down to I'd go to Pac Heights or even the Marina, not the mission. I will not be going back.", 
    "review_date": "2013-09-30"
  }, 
  "EU5cmRY4EJy2O0Ca87y9NQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Julia S.", 
    "review_text": "What's not to love?   It's corny fun but in a cool atmosphere. Great space, like a converted airplane hangar or something, with very courteous service, decently priced pitchers of beer, good music, tasty food, and oh yeah, BOWLING.", 
    "review_date": "2012-07-17"
  }, 
  "XcuwFBs8RN5MQeFVjQMHJg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carolina S.", 
    "review_text": "I have yet to actually bowl here, but the food is amazing!!!   (How often are you likely to see a bowling alley given a review like that, eh?)  The dry-aged beef burger is out of this world, and the veggie burger ain't half bad either. The chef here was on Food + Wine Magazine's \"Top 40 Under 40\" list, and it really shows.  The youthful hipster atmosphere and the fact that you're eating in a friggin' bowling alley are just icing on the cake.", 
    "review_date": "2013-01-02"
  }, 
  "s81VRLqYFEpXPIQtGx2mnw": {
    "user_rating": 4.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Carol L.", 
    "review_text": "I was skeptical when told that this place has the best burger in San Francisco.  We ventured here to put it to the test.  I must admit that the food here totally caught me off guard.  This isn't your usual bowling alley fare!  We had a miso crab appetizer that was delicious, and the burger was indeed juicy.  I don't know about THE best burger in San Francisco, but overall the food was tasty.  Didn't get to try the bowling though!  TLDR: Surprisingly fancy food for a bowling alley -- try their burger!", 
    "review_date": "2013-05-09"
  }, 
  "EhIolH5byA5_IO7VVZyAPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett B.", 
    "review_text": "Such a fun place. The place has a retro feel to it but the lanes themselves are very modern. (I've been to places with old-fashioned lanes and my already poor bowling suffered as a result.) There's a decent selection of drinks and comfy leather couches to enjoy when you're not up at the lane, and all of the staff we encountered were incredibly friendly. It's a bit pricey, but worth it for a large group.", 
    "review_date": "2013-07-30"
  }, 
  "I1-7pV9Xas-7-_RZgl_Z9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bobby N.", 
    "review_text": "Overall, this was a great dining experience.  Good beer list, everything we ate was actually delicious.    The Fried Chicken was out of this world - perfectly cooked, crispy, and well seasoned.  And, surprisingly light.  The dipping sauce was a savory sauce with herbs.  Seemed like a cleaner take on ranch dressing.  I ordered the Pastrami Buns.  I was hoping that they would be similar to a similar dish I'd had at Momofuku Noodle Bar, and sure enough, they were spot on.  The Pastrami was a little dry, but as a lover of burnt ends, they were spot on for me.  Delicious sauce and I believe pickled shallots made this a really enjoyable  and again light dish   My buddy and I shared a side of fries.  They were perfectly seasoned and crispy.  It seems like fries are supposed to be hard to mess up, but when a place nails them, it is worth pointing out.  Service was attentive and helpful.  All in all, have to recommend.  Will be back.  Perhaps bowl a game or two next time as well...", 
    "review_date": "2014-06-15"
  }, 
  "7kPR3NAhl72EGbUU1h9FOw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg F.", 
    "review_text": "While we didn't actually bowl, we did get to enjoy the atmosphere. They have 6 lanes, and plenty of space to carouse. The Bar tenders were good, if a bit easy to distract with all of the pitcher orders flying at them.   We really wanted to sit upstairs, but apparently that is for diners only - fair enough.", 
    "review_date": "2013-12-09"
  }, 
  "FucUIUbYeZ4LSwfVoRf8Ww": {
    "user_rating": 3.0, 
    "user_location": "Leonardo, NJ", 
    "user_name": "Allyson D.", 
    "review_text": "Came here with a group of friends on a Sunday.   This place is super cool and cute - I love the loungey entrance, and the sounds of people bowling is strangely nice to hear while hanging out eating.  So, no complaints about the service. But wow the prices here. $10 cocktails. I opted for a beer, and I also ordered the vegan burger. While really delicious (really, it was a great vegan option - especially the sambai sauce), it was TINY. For the price, it felt like half a sandwich and a salad. Fries extra, as always, anywhere.  Good food, prettyyy crap prices. But it's a pretty chill place, I guess!", 
    "review_date": "2014-04-03"
  }, 
  "jteCb0GYOLVEl7IcZbmI0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas M.", 
    "review_text": "Though I made a reservation for six when we actually had seven, the hostess was very willing to accommodate us in whatever way was most comfortable. This alone earned them a few stars. The food was good. The atmosphere is trendy and welcoming. The downside is the lack of people to call beforehand to figure out situations like having a group of seven when the reservation must be made online.", 
    "review_date": "2014-02-05"
  }, 
  "McnAn0w_Fff4ikbWJXIVww": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Susan L.", 
    "review_text": "great burgers and bloody Marys... fun place to hang out with friends", 
    "review_date": "2014-02-14"
  }, 
  "xNtpzroZKi9WtTgW3rJeXw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John P.", 
    "review_text": "The cocktails here are great. The food is good. I've never had a good bowling game.  The 2 or 3 times I went, it was too crowded to get a lane. Totally understandable. Can't fault a business for being successful. Go Mission Bowl.  The next couple times I went I reserved a lane ahead of time. Both times we had at least one frame incorrectly scored per player. Sometimes it'd mark the wrong number of pins, other it's skip a frame, other it'd miss a roll entirely.   Now I think every game is more fun with money riding on it. Gambling is an important part of my being. Having to debate scores, or adjust scores on the little machine after drinking was not fun. Wagers were left in dispute.  The last time I went the machines were working perfectly. Everything was scored correctly. We had just finished the 8th frame when our hour was up and we were booted off the lane. No ten minute extension was granted.  So that's 5 or 6 times I've been, and not once was I able to have a problem free wager on a bowling game.   I really want a bowling alley in the mission, but I'm going to try lucky strike or go back to Seabowl.", 
    "review_date": "2013-01-06"
  }, 
  "K1wCbP90gxqACyz2w6fu0A": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Rebecca S.", 
    "review_text": "Super cute, super hipster. Love the outdoor covered patio (dog friendly!) and decor inside. Make a reservation for a lane if you want to bowl (or not! the bar is pretty awesome). No opinion on the food, as I didn't eat. Just t up with some friends to bowl, drank and run!", 
    "review_date": "2014-07-17"
  }, 
  "__05rytNjsye9MBhqB0DMA": {
    "user_rating": 2.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Marck N.", 
    "review_text": "Having to always wanted to try the burger, I was excited to eat here. My bestie and I shared the deviled eggs and my main the burger.  The deviled eggs were not what I expected. It yolk portion was mixed with chickpeas. The eggs were colored a brownish color, assumed it was soy soaked.   Not really to my liking. I wanted something savory and not healthy.  The Mission burger was good, but not 5 star good. I ordered mines rare, so rare meat was a 5 star for me. But everything else with it was just average. Maybe I should have ordered it medium rare to let the fat melt. But I would assume the seasoning would still be pronounced in rare meat.  Not so for me.   A good place for cocktails and beer, plus bowl. Maybe I will come back to try the burger again.", 
    "review_date": "2014-02-18"
  }, 
  "cCeCQxErE9ToaQQBEVFuFA": {
    "user_rating": 4.0, 
    "user_location": "Bellmawr, NJ", 
    "user_name": "Abigail W.", 
    "review_text": "Food is awesome here, and the bowling is lots of fun. not a whole lot of room between seating, though. Pricing seems reasonable. I did enjoy the theme better at Presidio Bowl, it was like being in the late 80's.   Clean, and good beer with lots of choices. What we ordered: Sausage Corn Dog Fried Chicken Jerk Pork Shoulder Sandwich w/ fries  everything was absolutely delicious, unique and with a fun presentation. patio seating best choice.", 
    "review_date": "2012-09-12"
  }, 
  "JDbnOECGbsUPd8Etg_O7Pg": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Robert Z.", 
    "review_text": "Sat at the bar. Out bartender Peter gave us some seriously great customer service. I'll definitely come back.", 
    "review_date": "2013-12-10"
  }, 
  "9rdz74ub05wudQdtOPQjaA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Xteethx B.", 
    "review_text": "Yes, get the fried chicken. Mixed drinks are okay but I felt they were small.", 
    "review_date": "2014-02-24"
  }, 
  "zst5ol5eBsx-Uz6wfKDzAA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny M.", 
    "review_text": "This is a great place to bowl.  Super fun.  Hubby and I ended up here and decided to bowl for an hour.  I don't remember how much it was, but it was reasonable i'm sure or i would have heard about it from him. Ha!  The drinks were average price too.  I love that it's small doesn't feel like a giant loud bowling alley.  Good times!", 
    "review_date": "2012-10-02"
  }, 
  "lFdcgrMkHCmvTjMEw4CVDQ": {
    "user_rating": 4.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Joy A.", 
    "review_text": "$55/lane for 5 people.. Pretty pricey.   But well worth it.  Food is delicious and the burger is just as good as everyone says it is. (Been on my bucket list for months!) It's HUGE so you can totally share the  burger with a fellow meat lover..and devour their french fries because they're super  good too (extra crunchy and delish). Their mushroom fritters are great too--they're like hush puppies with ground up mushrooms and  spices.    Service was superb--always  got my water filled up on time and was checked on multiple times throughout finishing my meal.  Brandy (waitress) was super  nice and the two cute boys working the bowling lanes were friendly.   Totally worth checking out.", 
    "review_date": "2013-03-10"
  }, 
  "rVs5Ttf3TcjX952G289c9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina C.", 
    "review_text": "Unfortunately we didn't get to bowl here, but the five stars is really for their service. I accidentally left my wristlet here the other night, and within seconds of us leaving, one of the waitresses ran after us! I'm super, super grateful for this!  Also, their drinks are pretty strong and tasty!", 
    "review_date": "2014-03-21"
  }, 
  "4qA3ZTymquyb8Fl2ye-sqw": {
    "user_rating": 5.0, 
    "user_location": "Windsor, CA", 
    "user_name": "Sylvia C.", 
    "review_text": "Wow, what a treat to run into a place without knowing anything about it, and totally have a great time with great friends and great food. The first thing that caught my eye was that it is beautifully decorated. Then I saw the bowling area. What??? Big leather couches instead of hard chairs? I'm in. What a great place to hang out with friends or your special someone. Well, if the beauty of the place wasn't enough, the food will knock your socks off. Our waitress recommended the brunch menu. First thing I noticed was the Waffles and Fried Chicken? Huh? Ok, I'm a NorCal girl. I guess this a SoCal thing. (Never heard of it).  It sounded weird so I went with the Mission Burger which sounded so good because I was STARV....VING!!! When the table next to ours got their food, yup, one of them ordered the Waffles and Fried Chicken. It looked delish! Guess what I'm ordering next time I come here. That's right,  the Waffles and Fried Chicken. Back to my Mission Burger. Let me just say there's a reason MBC is known for their Mission Burger. It was (in not so many words)....the best burger I've eaten. Finger licken' good. Oh yes, I will be back again. Can't wait. And just in case you wondered....the drinks aren't anything to sneeze at. I had the 'Strawhide\" , let's just say, two of those are enough to get you in a good mood. I'll be back for sure.", 
    "review_date": "2013-10-21"
  }, 
  "SsfjEoKdt3Q6szxL2sAGZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lani N.", 
    "review_text": "We sat at the bar and had some small plates and cocktails before catching a performance across the street at ODC Theatre. It was great. We can't wait to go for some bowling. Food was promising, and cocktails were awesome.  Fried Chicken 5/5 So good. So good. So good.  Elote 3/5 Hubs really like it (sauce and corn), I just liked the corn.  Fries with chili aoli 4/5 Fries were thick, aoli was good. Wanted em a bit more crispy.  Clover Club Cocktail 5/5 Delicious and light.  Gin and Small Batch Tonic 5/5 Awesome tonic.  Corazon de Melon 4/5 Had a hard time tasting the melon, but it was still delish.  Kingston Mule 5/5 Refreshing.", 
    "review_date": "2014-08-06"
  }, 
  "awmRirDC7WWig6R07XZ_oA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wakako U.", 
    "review_text": "Food is delicious and comes out quick. The burger is thick, juicy, tasty with good hard buns. Fried chicken comes on a stick with three pieces with homemade ranch - this too is delicious.  I come here to eat, but wouldn't mind bowling either. oh, and hitachino nest white ale - my beer of choice.", 
    "review_date": "2014-06-13"
  }, 
  "M9FL-chYhMA4nZpmTbWIZQ": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Erica L.", 
    "review_text": "Review based on brunch experience: A few things were jarring about the Mission Bowling Club.  Firstly, enjoying a sit-down meal with friends is interrupted by the sounds of pins crashing.  The food's not your stereotypical finger-foods, i.e., greasy chili cheese fries and tacos, so it demands a more \"upscale\" dining atmosphere that can't be had by bowling.    The brunch menu is limited.  Especially to vegetarians.  My boyfriend and I aren't that strict (we'll eat seafood), so I inquired about the Dungeness Crab.  It's the one savory item that the Mission Bowling Club offered that didn't contain chicken or red meat...and the waiter informed us that they didn't have it.  I was in a state of disbelief, considering it's a weekend morning, we were the first party there, dungeness crab is in season, and its BRUNCH time!  I don't know who's doing the ordering but that chef needs to get it together.    My boyfriend orders the French Toast <a href=\"/redir?url=http%3A%2F%2Fgoo.gl%2FU0bLp&amp;s=8b336b0e78e290d5c90b4f0ef312cb691782733793d0e3ad3212acd09232b775\" rel=\"nofollow\" target=\"_blank\">goo.gl/U0bLp</a> (because that's the only vegetarian dish on the menu, albeit sweet), and I, being super hungry, put-out, and not into sweet entrees, end up with the Loco Moco <a href=\"/redir?url=http%3A%2F%2Fgoo.gl%2FAkC8U&amp;s=e0325501ad5ce8ffaebe4e0d47b7c856b8ffa2fbcb7b5ab6e729d4a557a11464\" rel=\"nofollow\" target=\"_blank\">goo.gl/AkC8U</a>.  As much as I love Hawaiian food, and as much as this Loco Moco was flavored well (it's hard to f*ck up Loco Moco...), I was upset that I *had* to eat meat (even if it was short rib) just so I could have a meal with the rest of my friends here. Geez.    Since bowling ain't my thing, and the menu didn't win me over, I probably won't come back here.  Ever.", 
    "review_date": "2012-08-18"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "One of the hottest new ventures in town, Mission Bowling Center fills a void that's been missing in this part of town - a great place for food, drinks and entertainment. The scene is hip but not pretentious, the staff friendly despite being swamped since day 1, and I can definitely picture myself drinking one too many cocktails on the patio on a warm afternoon.  I've been to MBC three times so far...once to bowl, once for drinks and a third time for brunch and have yet to be disappointed. Some highlights: the fried chicken and waffles (whereas the chicken is INSIDE the waffle - genius!), the blackened salmon and, of course, the Mission Burger. Not in the mood for a (well made) $10 cocktail? Belly up to the bar for a $3 PBR and some great people watching. $15 Mission Burger too rich for your blood? Come at happy hour when it's only $10.   All that being said, it begs the question: is Mission Bowling Center a bowling alley with kick ass food or an awesome restaurant with a side of bowling? I'm not quite sure but I think I'll have to keep coming back until I figure it out.", 
    "review_date": "2012-04-17"
  }, 
  "5_gbaJzM9w_oAvLf7ARBWA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick T.", 
    "review_text": "When did bowling become an event you had to save for? I thought this was the sport of soggy hot dogs and slightly chilled bud lights, a sport where your rental shoes are the fanciest piece of clothing you're wearing.   THE VIBE:  Honestly, it's not that bad. the space is cool, right off of Mission and 16th, a little unassuming until you go in. There's a small bar, food items, and about 7 lanes. It all looks like it's going to be a fun night of bowling and drinking with your friends, until they quote you the price. $70 for 4 pairs of shoes and 40 minutes of bowling. 40. minutes. That's absurd. with the pitcher of beer being $26, we were looking at a cool $100 for 40 minutes of entertainment, which is about 1.75 games, if you play quick. we had to go back and pay for 10 more minutes to finish our second one.   That's pretty much the issue: It's too expensive. Make the trip and go to Daly City to one of the crappy bowling lanes down there. Authentic, cheap, a little sticky, and totally everything bowling is supposed to be.", 
    "review_date": "2014-06-02"
  }, 
  "w7RP1MZad3YO7Vjgp3s3Dg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claudine V.", 
    "review_text": "Came here on a Friday evening after 3 stops in mission and ordered the fried chicken and burger. The chicken was super crunchy, moist and very tasty. The burger was great as well. Fun vibe , not crowded at all , easy to get a table. Will definitely come here again and try the other things in the menu.  TIP: There's no cover charge.", 
    "review_date": "2013-06-10"
  }, 
  "m46mnqdQg_lUGJJz4vokVw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew P.", 
    "review_text": "Great bowling, the beer selection was killer, the fries were crisp AF, and the atmosphere was perfect for a Friday night with friends--- HOWEVER....... the burger was simply devastating. Really soured my experience.   They didn't have bacon (da fuq?). The onions were tasteless and I'm pretty sure they came out of a can. The patty didn't taste/feel grilled... it was literally a loaf of meat that gave me an eerie lunchroom vibe. Finally, omfg, the worst part---- there was an egregious lack of bun given the enormity of the lunchroom loaf and I am utterly shamed to say I broke down and had to use a fork and knife. You guys fail, I mean help me out here.", 
    "review_date": "2014-10-08"
  }, 
  "6_VkzelWeSHzjTVDlGl-Ug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "FOOD: Burger real yummy soft w the cheese mmm  Chicken tenders - a lil too extra fried but still good  Fries - pretty crispy n seasoned really good with the thousand island or whatever orangey color sauce   SERVICE: Workers are nice   ATMOSPHERE Casual chill hip loungeish mini bowling alley w high bar tops, bar, mezzanine. Went here once for a Christmas party and it was good for that. So it's good to know it's rentable and they do a good job with service and food, and reserved lanes.   12.15.13", 
    "review_date": "2014-12-13"
  }, 
  "mzv3adVXMorJ92n1HkEp5Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric K.", 
    "review_text": "Fantastic pork chop.  Was just waiting to bowl again but that was seriously one of the best pork chops I've ever had.  I can't believe what a gem the mission bowling club is.", 
    "review_date": "2014-03-02"
  }, 
  "sHq44LP-ZuSnHO0QiHafgQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tough C.", 
    "review_text": "All right you damned hipsters! Live it up while you displace the locals with your little bowling balls, and your idiotic, first world \"what should I drink in the ghetto that might make me appear to fit in?\" problems. Jamon B. If you want a drink, go to a BAR.  Calbe B? It's \"the s***\" because it's the ONLY BOWLING ALLEY IN SF, if you can really call it a bowling alley. I just wish you'd all drop the balls on your little Tom's clad feet so that you can't maraud up and down Valencia street like spoiled children on your bicycles any more.  Earthquake, baby. Earthquake! *crossing my fingers*", 
    "review_date": "2013-08-05"
  }, 
  "r0uY6pozqbZ2GtK0XCpBug": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simi J.", 
    "review_text": "i would likely rank it higher if i could ever get in again. i went 2x when it first opened and now you have to plan like its french laundry to get in on most nights.", 
    "review_date": "2014-02-25"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "7x7 100 Best Things To Eat In SF Before You Die 2013  #57 Mission Burger at Mission Bowling Club  Bun-unique, provided good supporting role to the the dish, would have liked it toasted better  Burger-great crusty sear leaving a good juicy burger, seasoned relatively well with a good meaty bite  Sauce-caper wasn't pronounced, compounded the greasiness of the dish  Grilled onion-well done, sweetness accented the dish well  Fries-felt I got way too many crispy ends and not enough substance  Service was great, was not expecting that at all  Overall Thoughts  A unique burger technique yielding a good solid burger that's worth trying but be warned its on the heavier side", 
    "review_date": "2013-06-26"
  }, 
  "AMKrPRWJMBAt671UD86YMg": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Julia N.", 
    "review_text": "Mission Bowling Club offers a fun concept! Indoors is a small bowling alley with the bar and some tables for food, and outdoors offers a few tables for brunch. My groups of 4 made a reservation at 12 on a Saturday, and sat outside. I would recommend that - just to enjoy the good weather and also, carry out an easy conversation less disrupted by the sound of falling pins!   After glancing at the menu, three of us decided to get the chicken and waffles (the fourth initially wanted to do that too, but thought he should be different and get the loco moco).   All I have to say is, get the chicken and waffles! That is the stuff dreams are made of. The chicken was fried to perfection, the battery crispy and the chicken juicy. It was complemented by the waffles, which were savory (made with corn instead). The best part though, was the maple butter. Sweet and creamy and whipped so lightly. Amazing. We all ate in silence for a while as we enjoyed our food. My friend who had the loco moco enjoyed his dish, but by the looks he was giving us, I'm sure he would have wanted the chicken and waffles instead.  We also all got drinks. I got the corazon de melon, which had a mixture of juices and Cointreau. It was flavorful but a little strong for me.  Overall, a great experience! Our server was very friendly as well, which was a plus. I'll definitely return!", 
    "review_date": "2014-10-25"
  }, 
  "YnHf1BPFjfj3kK_i1AC4rQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Duke X.", 
    "review_text": "MBC is my new favorite spot for burgers~ the mission burger is so delicious and goes great with a pitcher of squid ink beer from SPBC down the block~ if you wanna bowl show up early since the lanes here get taken up pretty quick~ MBC is a fun spot to hang with friends or just to grab a quick drink or snack~ parking is bad and neighborhood is sketchy so watch yourself when in this area.", 
    "review_date": "2013-07-11"
  }, 
  "oIPeq87rRzUMrOTbKzWfAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William T.", 
    "review_text": "I kind of wanted to dislike this place after hearing that the lanes aren't full regulation size.  But, I've become a regular; however, not for the bowling.  The bowling is fun but pricey.  The food is the main attraction, followed closely by great drinks.  Their burger is probably up with there with my all time favorites in The City, perfect bun, big patty, caramelized onions.  The fried chicken appetizer is extraordinary.  I had given up on finding perfect fried chicken, but, low-and-behold!  Thank you!  My date ordered a salad with watermelon in it.  NOT my cup of tea, but it was amazing!  I'm looking forward to having brunch in their great outdoor patio soon!", 
    "review_date": "2013-07-03"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Mission Bowl is so nice, it's like Beretta for bowling. Apparently, it's cheaper than Presidio bowl, but more expensive than Lucky Strike; the food is great and the cocktails are tasty. The fried chicken was extra crispy but too lemony for my liking, I would instead recommend the burger which won several awards I hear.  About 5 lanes, and they rent per hour, so bowl fast and make a reservation now!", 
    "review_date": "2012-12-04"
  }, 
  "5X7FMNE7YZ0WcKxrDz8FEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moline D.", 
    "review_text": "This place is awesome! It is luxury bowling, with big leather couches and ambiance lighting. I stumbled across it during an evening stroll. We went in to get drinks and check out the place. Apparently the food is really good. The staff was great, super nice and fun.  Can't wait to go back with a big group of friends to bowl.", 
    "review_date": "2013-10-10"
  }
}