{
  "mE-hdFF4RgCxspZU72GAsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "This hidden Japanese hostess bar has high sentimental value, and I enjoy coming back periodically to have a drink with friends, chat with the hostess, get caught up on the latest J-pop, eat Japanese bar food, and hone in on my inner rock star singing skills. Standard Japo beers are on tap and they have a decent sake and shochu selection, if the latter is your thing. The bar food does the trick and enables patrons to quaff more. I especially liked the salmon chazuke and the takoyaki. I was warned against ika no shiokara, or fermented cuttlefish, but I still tried (a bit of) it. I don't suggest it. Don't by shy, come in and drink beer and sing a few karaoke songs.", 
    "review_date": "2015-01-08"
  }, 
  "EtkermjXbvAF5-7-0oJajQ": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Herm C.", 
    "review_text": "Friendly service. Decent song selection. $2 a song with one drink min. Four bottles of saki later, we had easily met the drink min, but didn't try the food.  I kinda like this place.  I'll be back.", 
    "review_date": "2011-09-26"
  }, 
  "doqM5t20UrhPe2K8VF2ixw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "We were very excite to be trying this place. The reviews looked good and the pictures of the interior were interesting.   My review will be short, as our visit was.  We walked in at 11:30PM. We were asked to leave at 11:31PM. The place had at least six people. They were singing! THEY asked us to stay. The waitress/bartender asked us to leave. She said they were closed.   Huh.", 
    "review_date": "2013-07-03"
  }, 
  "iAy1PCXiMA-jqnqrsbGk3Q": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Jamie M.", 
    "review_text": "I came here with a friend after a night at Playground Karaoke. It is tucked away, but it is clean, and I thought the hostesses were nice. I don't recall being terribly impressed with the drinks, but it kind of did not matter. We were still riding the wave from a great time at Playground. The hostesses told us that they have karaoke for special people. I guess they thought we were special since we got to sing more karaoke at Mogura until the bar closed. It was a good time at a very intimate bar.", 
    "review_date": "2014-11-30"
  }, 
  "ySVppiyeqALQ7DKLCosmOw": {
    "user_rating": 5.0, 
    "user_location": "Lagraulière, France", 
    "user_name": "Button L.", 
    "review_text": "favorite bar ever. authentic japanese atmosphere, bartenders, drinks, karaoke, food and patrons. i have never experienced such an amazing night out in japan town. this place is a serious gem! got invited to have my birthday party at club mari's next door. i love her!!", 
    "review_date": "2012-11-30"
  }, 
  "4lAVKVISeiwPPAyy2Tk9ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gurei K.", 
    "review_text": "Mogura (means mole in Japanese) is a traditional Osaka style shochu bar with the works: chill but traditional atmosphere, sitting-karaoke around the bar, &amp; serving girls wearing wafuku. Sapporo &amp; Asahi on tap. A bunch of sake. Ochazuke &amp; takoyaki.   A couple hours here and you'll start to believe you're actually in Osaka. Here's some tips:  * Mogura is nestled in Club Maris - a Japanese-only hostess bar. I'm not sure if that rule extends to Mogura but I haven't heard any English while frequenting. * Be prepared to take your shoes off and potentially sit cross legged or on your heels. * Try the takoyaki! Osaka is known for it and Mogura gets pretty close. * Bring 3 or less people because there is only seating enough for about 15. * Don't be too loud or drunk, it's considered extremely rude and you will lose you're ability to return. Remember, this is an Osaka shochu bar not an Irish pub!", 
    "review_date": "2012-06-17"
  }, 
  "qgzJROfpgUdpWse24-bxJQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simon L.", 
    "review_text": "Wow, what an interesting place.  Buried in a corner of Japantown center, you feel like you've walked into a foreign country when you walk in here.  The Japanese music videos looping on the little TV really sets the mood.  Awesome place to grab a few cold beers or glasses of sake in Japantown.", 
    "review_date": "2014-03-22"
  }, 
  "dzSDQ_QWwVoQcFX1pum_eg": {
    "user_rating": 4.0, 
    "user_location": "Salt Lake City, UT", 
    "user_name": "Neil C.", 
    "review_text": "Fun, little gem hidden away in Japantown. We didn't eat here, but drank plenty of sake and sang a lot, i mean, a LOT of karaoke. One warning if your friends are anything like mine: your bill can skyrocket because it's $2 to sing a song, which seems kind of ridiculous to me.", 
    "review_date": "2011-02-23"
  }, 
  "lrp5aQP31ar3JDlbwccfHQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vanessa S.", 
    "review_text": "This is probably the definitive \"hole in the wall\". My friend and I walked over here from Yoshi's. We had a hard time finding it because we didn't know that it was in Japantown until I had mentioned we should check inside. Both of us never recalled seeing a bar in there so when we walked in, we looked at the directory and sure enough, it was upstairs. It's at the end of the hallway and it's very intimate. There were several people in there that turned out to be regulars. It's run by a petite Japanese woman and if I can recall, she mentioned that the bar had been there for about 7 years. It's not a full bar, but they have an odd selection of alcohol including sake. They also have some bar food if you feel like a snack. It's definitely a place to check out.", 
    "review_date": "2014-03-10"
  }, 
  "RgDVC3ZUBqpEe6Y1kPhIpw": {
    "user_rating": 4.0, 
    "user_location": "São Paulo, Brazil", 
    "user_name": "Monica S.", 
    "review_text": "This karaoke place might as well be tucked away down a dark Tokyo alley. It's the ultimate hidden secret in that it's almost impossible to find and it's likely the most authentic karaoke bar in the city. Just wander into the unmissable Japantown mall (next to the Sundance theater), take the stairs and hang an immediate right.   Once you walk in, you'll have to take off your shoes (don't worry, you can wear little bathroom slippers when you go to the bathroom), and rather than showcasing your pipes to a crowd full of drunks, you'll gather around the U-shaped bar and sing sitting. Festive, it's not, but if you bring a crowd it's unlikely to be packed (let the current 7 reviews be a testament to the popularity).  For those nights when you wanna sing sad songs or watch other people do the same, Mogura is tops.", 
    "review_date": "2011-01-23"
  }, 
  "fHnAHkd0rNscAXlWpy7M9Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "Met a friend who who recommended the place. Mogura is a bit hard to find as it's located behind an unassuming corner. You'd think that the pathway led to a janitorial entrance or something, but nope, you'll find Mogura.  You walk in and the ambiance is sorta cool. Looks like a ninja cave or something. Bartenders are all female and dressed in yukata / casual kimonos. There's also apparently a \"secret service\" in the back room of the establishment, but I'm not sure if I just revealed something illegal? Sorry.  I can see this place a very scene place for Asians to hang out. It is quirky enough to attract newcomers, but also cozy enough to attract regulars. I'd give it another go if I were in Japantown.", 
    "review_date": "2013-01-16"
  }, 
  "D_hRMnURrxtTdTHYlhxZag": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Eric L.", 
    "review_text": "I love this place!  I went here a few months ago with a friend.  Don't come here if you don't have an appreciation for japanese culture.  Take your shoes off at the door and enjoy the variety of japanese beers and sake.  Be sure to ask for the 'additional' sake menu.  As others have mentioned, it's rather hard to find (the name 'mole' is rather appropriate since you have to go through a few tunnels to get there).  Our server was Haruna.  She was very sweet and we spent the night discussing japanese music and television :)   I consider it a hidden gem of japantown.", 
    "review_date": "2009-05-21"
  }, 
  "UzG5IHFUu6H1UyCRbqHHZw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Ting A.", 
    "review_text": "i'm on the cusp of lower pac heights and japantown and haven't explored much of the neighborhood.  i know.  life is a circus, and i'm missing out on all the hot bearded women roaming the streets of sf.  through the entrance of club mari's, make sure to turn left at the end of the hallway.  otherwise, you'll find yourself at mari's next door.  ...i felt right at home as i removed my shoes and stepped onto the mat.  (yay for asian customs!  hehe..)  the lighting choice and decor make you forget that you're in the japantown mall.      seated at the elevated bar counter, pre-dinner drinks ensue.  now, i'm no sake or shochu expert, but i thoroughly enjoyed the few that we tried.  one had a sweet flavor, and the others were mixed w/cold water and went down smoother than a brazilian waxed hoo-hoo on yer upper lip.  as for the grub, take notice that some of the menu changes daily.  i hope that the vegetable croquettes (which were the perfectly delicious balance of crunchy and soft) will make a second appearance soon.  the seaweed, tofu, and carrot mix served when we sat down, however, was a little too sweet for my taste.      hirue, our server, was extremely friendly and engaging.  in addition to making sure that our sake fill was being met, she made a great addition to our evening's conversation.  mogura will certainly see the likes of me again.", 
    "review_date": "2009-04-16"
  }, 
  "59QzQ3-dmOD1USV2hQpwkw": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Leo K.", 
    "review_text": "This place is terrifying. I wandered in here on a weeknight because I wanted to see where that random unmarked door in Japantown Plaza lead to, and a few minutes later I found myself forced to sing the Aladdin theme song repeatedly while buying round-after-round of sakes.  The hostesses just kept bringing the drinks out even when I didn't recall ordering anything. I would've complained, but these girls looked like the type that'd keep knives in their fans.  +1 extra star because I do remember thinking the hostesses were mildly attractive (or was that the sake?) and also, out of fear.", 
    "review_date": "2011-04-20"
  }, 
  "Qq_fV6NFDnu7sKuScVS5Gg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mariko F.", 
    "review_text": "I love this little place. It's insanely hard to find but worth the look. I thought I knew that mall like the back of my hand, but go figure. The bar is a little sake bar with a few nibbles. The staff is incredibly friendly, as is Mari, the owner. I think my hubby and I were the youngest customers by about 15 years, but it didn't matter. It's a great little place to sip some beer or sake and have some small plates while you're at it.", 
    "review_date": "2013-01-12"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "First off no way will I sing here! The people singing are actually good ha. 2nd of all I am obsessed with their Tacoyaki now $5 for 5, I can eat all 5 myself. I found out why it's so good here, they are fried! The fried chicken, it needs some spice to it, it's moist but not all that. Bartenders were very nice. And still love the atmosphere.", 
    "review_date": "2011-09-06"
  }, 
  "OHLr0T6mAF31tcjSskvK4w": {
    "user_rating": 4.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Michael A.", 
    "review_text": "The joint is tucked away in then corner of a random mall in j town and that makes me a fan. I love Japanese everything and therefore I love Mogura. Drinks are a tad expensive though as the Macallan I was throwing down was 12/glass.", 
    "review_date": "2013-08-14"
  }, 
  "caYtxYP2zgsOcz9U7bdCgg": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Niu N.", 
    "review_text": "A very nice place tucked away. Drinks are not that special though. Come here for the atmosphere.", 
    "review_date": "2010-05-31"
  }, 
  "Nk5X94U9NrBvhTDwr3WXFQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Alejandro V.", 
    "review_text": "I would be lying if I said I wasn't a regular here. This quaint establishment has a very Japanese decor, including a screen wall, elevated wooden sitting platform, and the requirement of patrons to remove their shoes. The service is wonderful, and the staff very friendly. The music selection is pretty good, with a decent mix of old and newer songs, as well as Japanese language music. I have had many a good time here, and I would suggest it for anyone looking for somewhere fun to go at night in Japan Town.", 
    "review_date": "2011-04-12"
  }, 
  "arRYVFlYrRWYOeJdHfjkSg": {
    "user_rating": 5.0, 
    "user_location": "Buena Park, CA", 
    "user_name": "Michael W.", 
    "review_text": "Traditional Japanese shochu bar with updated Japanese karaoke songs.   Plus beautiful Japanese bartenders serve you in Yukatas.  Quite expensive and bar holds max 10 to 15 people.   Same owner of Club Mari, the Japanese hostess club next door.  Ideal place if you want to host a small event in an authentic Japanese atmosphere.", 
    "review_date": "2011-07-13"
  }, 
  "TDnoRfgfdcCMxiIQDsH04Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ChiYan T.", 
    "review_text": "Wow, this little hidden away gem must have every single Karaoke song on the planet. They have this huge monster songbook to choose from. Still in ESL? They have a whole slew of English, Japanese, Korean, and Chinese songs at your disposal, from the old standards to Marilyn Manson to even Lady Gaga.   Located in Japantown, its entrance is from the outside. Although having walked past this same spot for many years, day and night, I've never noticed it before. It has no signage and above the double doors there is no number. But if you're standing on the street, the entrance is to the left of Sundance Kitchen if that helps.   Once in, there is a long and huge stairway leading up to the bar, try not to scrape yourself on the thatched ceiling. Make sure to leave your shoes before stepping into the upstairs room. Sure it's a bar with a single TV screen and all these strangers can hear you sing, but they're all drunk and by the time someone suckers into you picking up the mike, you are too!   The waitresses are very polite and tend to play Utada Hikaru whenever they can while people are mulling over their upcoming music choices.   Usually only open night. They also provide small snacks of average yum-factor.", 
    "review_date": "2010-05-21"
  }, 
  "eIHoumATNNrpvu1nYGoPxA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy L.", 
    "review_text": "Love the chill atmosphere and snacks. The oden was awesome! Great place to chill before a movie.", 
    "review_date": "2013-01-24"
  }, 
  "-89IDABrt2vnhvoCiUlVCw": {
    "user_rating": 4.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "T M.", 
    "review_text": "I was wandering around Japantown one day with my boyfriend, and was curious about Club Mari. I walked in the hallway, and veered left. The BF was asking where I was going, to which I replied \"I don't know\" and kept walking down a brightly lit hallway. We passed a bathroom, and a kitchen, only to find a dimly lit bar!   The decor is very nice, and the bar area is intimate. I do enjoy the seating area (although I wish I could go into the couch area, not entirely sure how to become VIP enough for that.) The drinks are pretty simple, they have a limited menu with small appetizers. I have had the Ebi Shumai and the Fried Chicken so far, both are pretty great (ebi shumai is my favorite of the two though.P)   As far as drinks go, the Sake Wine is great. The Fuji Apple smells like a Jolly Rancher, and is about 3x sweeter than one, so if you are not a fan of super sweet drinks I would recommend going with the Lychee flavored one. The J-Pop drink is pretty good, it's a malt beverage that is very sweet. I got the grapefruit flavor, which was good until about 3/4ths of the way down; It was a little too sweet and became hard to stomach.   They play fun J-pop music while you are there, so far I have seen the same 2 videos play everytime I go in, so I can't say that they rotate the videos... but they are entertaining to watch. From what I have read, this place use to have karaoke, but lost their license or something.  Definitely stop by Mogura for a drink or two if you are in the Japantown mall, I am going to be bringing my friends here when they come to visit, just for the experience alone.", 
    "review_date": "2013-03-30"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "A difficult to find little sake bar with takoyaki, french fries, and poorly spelled drinks and other assorted food, including ramen, squid, and tofu. I like the ambiance, but the beer selection is small, and the sake is so-so. The service is decent, as it's generally the same two bartenders, but the clientele is generally of the unsavory, old, Asian gawking kind. They do keep bottles of sake for you under a counter, so the customer service is great.", 
    "review_date": "2013-05-17"
  }, 
  "DpkpCFdMKYSJAYAPtkvq_g": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jeremy H.", 
    "review_text": "Came here again last night with a friend from London. One quick drink, turned into several \"one more for the road\" beers such was the good time we were having.   Aya, our charming server, was a delight. Both witty and engaging, she added some sparkle to our increasingly drunken discussions. Ayaka was also super nice :)  I got the chance to try the fishcake soup which was simmering in front of me - recommended!", 
    "review_date": "2009-12-09"
  }, 
  "ir6XtoAr_dYiWYqdID3exw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Momo C.", 
    "review_text": "This was a hole in the wall bar/lounge that my friends and I stopped by while waiting for our other friends to arrive. I'm Japanese myself, but my friends weren't, so they were very hesitant to enter since it seemed to be more suited for Japanese customers and the entrance didn't look very inviting.  It was about 8pm, so early for bar standards and there weren't many people. But it was interesting listening to the Japanese music shows and it felt very nostalgic to listen to SMAP. The drinks were very classic to a Japanese style bar, as well as the decor. It felt like I was in Japan again for a moment and I liked that a lot. My friends liked the decor and the calm atmosphere and since I handled everything with the bartender/server, they grew to like the place. But I can see why they were a bit worried, the lady, though very courteous and nice, couldn't speak English very well.  Anyway, I'd definitely come back here again for some more drinks. Don't feel turned away by the shady looking entrance, it's a really nice place to have a drink and a chat!", 
    "review_date": "2014-03-10"
  }, 
  "ACUVZ4SiN0gni7dzVDm9EQ": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Tiffany N.", 
    "review_text": "Say, do you want to do karaoke, but you're feeling too lazy to actually have to stand up at the mic? Well then you should head over to Mogura where you can sit around the bar on small cushions to do your singing. Please don't bring more than 3 of your friends though because this spot might seat 15 people if they are lucky.  Also check out your feet situation because you will be required to remove your shoes. Karaoke songs cost $2 each and there is a one drink minimum, beer, sake, and wine only. Or you can get the sparkling malt beverage I tried. Recommended only if you like Zima or are trying to start a new \"icing\" trend among your friends.  This is one place that is on my \"you should really experience this at least once\" list. And I'm betting I'll be back time and again in the future.", 
    "review_date": "2011-01-25"
  }, 
  "nZ9LKWhs52WVRQR-ic_7wg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bono B.", 
    "review_text": "This is Mari-san's little business venture that is basically a bar fashioned from a defunct robata restaurant that went kerplunk because their cooking area wasn't up to code.  In the J-town area, it's slightly better than- Dimples (no cigarette smoke, no Korean/Mongolian women in indentured servitude), Festa (no loud, drunk fools who can't sing to save their lives) or Ikkyu (drunk Japanese girl \"students\" who barely function as bartenders).  Understand, Mogura is not a dive, and Mari-san tries to make it nicer than the aforementioned establishments. Her small plates are meh, but be forewarned, all of the food is basically pre-cooked and microwaved/heated up. I think she serves up the food just to satisfy the licensing requirements for the place.  Drinks aren't exactly cheap, but then again, when compared to the aforementioned establishments, the cover charge seems like a good deal if you want a quiet drink.  So, if you want a quiet drink in a place hidden away from the raucous drunken wails emanating from Festa just down the hall or respite from the cigarette smoke at Dimples or the drunken servers at Ikkyu, go to Mogura.  One thing to remember, don't be surprised if there's an extra line item on your bill for a beer/drink that you didn't order. That's the price of admission if you have Mari-san \"entertain\" you with her witty conversation. Entertaining indeed.  Oh, and yes, for all you guys who have the fever for Japanese girls, you can go there to try out your lame pickup lines in Japanese. At least these girls might understand them because they won't be drunk.", 
    "review_date": "2009-10-29"
  }, 
  "jPG9VvKCfp4RAMuaRFD91Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thi N.", 
    "review_text": "Mogura is an easy place to miss as it's located at the end of a random hallway in the Japan Town mall.  Since finding it, I've found myself here on plenty of occasions singing the night away or as a first stop before heading out to another karaoke bar.  There's seating around the bar and there is limited space, but of all the times I've been here there was always space available for me and my party.  Song choices and drink selection are decent.  It's nice that they serve food here and it's pretty good.  The staff is always very friendly and attentive.", 
    "review_date": "2013-10-07"
  }, 
  "XzYUOcZft2c-oQUxDThFgw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Eddy M.", 
    "review_text": "Its a Japanese dive bar.   What more could you ask for?", 
    "review_date": "2014-08-20"
  }
}