{
  "YXM7wi07ICHM6Os0cNFluA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan K.", 
    "review_text": "Industrial themed bar on top with strong drinks. They make a really good Moscow Mule. I like the various lounge areas upstairs to chat up with friends.  Downstairs has a great sound system with a big dance floor. Great DJs/Producers are constantly getting booked and price of admission is affordable. The crowd downstairs is there for the music which is a plus. Great vibe. Highly recommend it especially if you are looking to get down.", 
    "review_date": "2012-05-15"
  }, 
  "fgwI3rYHOv1ipfVfCSx7pg": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Emi H.", 
    "review_text": "My BF &amp; I were apprehensive about visiting Monarch because a friend described it as \"divey.\" But we were both pleasantly surprised by how much we enjoyed it and Monarch turned out to be a bar favorite during our latest trip to San Francisco!   We popped in on a Monday night to hang out with a bunch of co-workers and were greeted by a friendly bartender who introduced himself by saying \"I make a mean Tom Collins.\" While he mixed up our drinks we sang along to a fantastically fun mix of 80s and 90s tunes. There's a ring for an aerialist that hangs in the backdrop of the bar and we remarked on how cool that would be to watch during a busy night. While hanging out my BF &amp; I took some photos in their totally free photo booth. After you take your four poses, the booth emails you your photos AND it prints out a copy. We have a great souvenir from our visit there and kudos to Monarch for having such a super marketing tool! We didn't get to check out the nightclub downstairs but we're pretty sure that the bar upstairs is much more our style.  My friends warned me that Monarch was located in a seedy part of town but not being from San Francisco, I didn't know what that really meant. I walked there with my BF and a co-worker and I will definitely say that this is not an area that you want to be walking around alone. We ran across a few sketchy characters during our journey there. While waiting for a cab we noticed that one out of every 10 cars driving by was a cop car and on that particular night there was a shakedown across the way. At least you know if something goes down, there's lots of five-O in the area!  Yelp 365 Challenge: #190/365 (The Trip To Sketchville)", 
    "review_date": "2012-03-25"
  }, 
  "-50xx_J7kdHb928HlyWJfw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristi G.", 
    "review_text": "I was here for learning about CouchSurfing and meeting folks who do.  So I can't rate the experience as a customer only to note that this place is not exactly a high end club or lounge, but it is a decent bar.  There is no dance area I see upstairs.  Just a bar, and a place to \"lounge\" in another room.  DJs appear to be building their skills in the craft and you see their electronics out in the open, as oppose to usually they are high on a podium jamming.  The place is small, so the point seems to be just to mingle.    Downstairs is where the club dancing is more capable.  There is a DJ and bar there as well.  The dance floor is more like your downstairs garage or basement with pillars in the way.  They have a crystal ball and light works to jam the night with appropriate loud sound system.  I would say Monarch is good if you don't like large crowds and huge event scenery clubs.   The beer(Heinekein was $4.00 a bottle).    The worst part about this place is the location.  6th and Mission is not exactly a safe place to be in San Francisco especially at night which is likely the times open for this place to meet people.  So go with friends.", 
    "review_date": "2013-10-04"
  }, 
  "wVv8-yw8wlzDyYJMDEXFVw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elise G.", 
    "review_text": "There's a super chill bar on the top floor and a dancefloor with a live DJ on the bottom.  I saw DJ's M3, Nikola Baytala, Colette, and Heather.  Then knew how to throw a party!  I've come here twice now and both times were awesome.  I can't wait to see Mark Farina play in a couple weeks too.    If you're into dancing without anyone judging you and love house music, this is the place for you!", 
    "review_date": "2013-10-08"
  }, 
  "IfFx7fpKK5H5T5palPpSYQ": {
    "user_rating": 4.0, 
    "user_location": "FOREST HILLS, NY", 
    "user_name": "Erik P.", 
    "review_text": "Interesting place, mixed crowd, cool and diverse music that wasn't too loud. Very good drinks at  good price. Went here on a saturday night, there was a decent amount of people. Bartenders were very friendly and know how to make good cocktails. At one point they had an acrobat girl performing on a big metal ring, it was kind of artsy and elegant. The ambiance was very cool but the location is not the best.", 
    "review_date": "2012-05-24"
  }, 
  "doqM5t20UrhPe2K8VF2ixw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "Love this place! Great ambiance and great space!", 
    "review_date": "2013-07-07"
  }, 
  "_-CzPWl3d8wMO9MBxU1JaQ": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Kathy R.", 
    "review_text": "I had read about the ring performer in the \"best of SF Weekly\" so while in town I decided to check the place out. First of all the bar is smaller than it appears on the website. So if you are looking to get a table for a group you will want to get there early. The decor is beautiful, which is one of the things that enticed me, but overall I was really unimpressed with the staff. The bartenders apparently can't multi-task for shit because if a decadent drink was ordered the entire bar line came to a standstill while we waited for the bartender to make ONE drink. Having bartended in the past myself, to me they came off as inexperienced. Second of all, one bartender charged me one price for my drink and when I went to refill from the other bartender I was quoted a different price. When I quoted what the first bartender charged me I was accused of lying! As we waited for the performer to arrive the bar filled up and the crowd seemed sort of preppie. There was even a bachelorette party that came by. So with the crowd we saw that may be why we were treated the way we were. The downstairs staff seemed to be equally as unfriendly.  As promised, the ring performer was appearing that evening, and was outstanding. Now that I have gone once, to sort of check it off my list,I would never go back. There is too much competition in this town to afford crappy staff.", 
    "review_date": "2013-07-15"
  }, 
  "VRdCuSjnz4rNhzd8_ZNb8Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sebastien D.", 
    "review_text": "I love the place, the sound system and the music BUT the last 2 times I went there they tried to charge more at the door than it was advertised. After 10 seconds they dropped down the price to regular.... don't be fooled people.", 
    "review_date": "2012-02-27"
  }, 
  "X73BkHcfIKRAqiTvmpqlwg": {
    "user_rating": 5.0, 
    "user_location": "Victoria, Canada", 
    "user_name": "Riley K.", 
    "review_text": "Void soundsystem! Awesome space and decor! WIN", 
    "review_date": "2014-03-01"
  }, 
  "eyQBhTuI-Tu5mMI0Jl3mpg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M M.", 
    "review_text": "Apparently Monarch has the best sound system in SF. Well I can confirm maybe it is only the best sound system if you are right in the middle of the dancefloor, in front of the DJ booth, getting tossed and pushed by the massive crowd. I can hang with crowded clubs, but you usually just need to hang out on the sides so you can actually chill/not feel claustrophobic. However, the speakers are all pointed to that point spot in the middle, so if you are on the side, the sound literally sounds awful.  It can be fun, but IT HAS NO AIR CONDITIONING DOWNSTAIRS so it literally feels like a sweaty pit of hell when its really crowded. That's not sexy at all.   And to LeVanna whining about getting pushed out of the club.... Maybe don't act like such a n00b and get so drunk in a place where you are not savvy on the streets.", 
    "review_date": "2012-11-18"
  }, 
  "vTugBdYg34rX4KvGpzBrNA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sonya D.", 
    "review_text": "My friends and I ended up here after a long day of Santacon festivities for their Santa dance party. Plus we were intrigued about checking out this new SOMA club. It was nice inside, and the drinks were nice a strong. Soon after arriving we scooted downstairs to the dance floor, which was flooded with red santa suits. I remember having fun, but wanting to leave soon after. There were definitely a handful of creeper guys, and the music was filled with trance-y type beats. I guess I just wasn't feeling it at the time...or maybe waking up at 7am and drinking at 11am till whatever time it was that we got here, was just too much. I would definitely like to come back because it did seem like it would be really fun and have potential!", 
    "review_date": "2011-12-12"
  }, 
  "n9NEd4wwuMs72gffl21AOg": {
    "user_rating": 4.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Sebastian L.", 
    "review_text": "Up in SF and stopped by on Saturday (5/11/13) evening; like the star count indicates, I'm a fan.  My brother and I arrived before the girls, but no hassle from the bouncer, who was friendly and a pro. No cover to get in. Easy access to the bar on the top floor. Don't know why people are complaining about drinks being expensive...they were $11, that's pretty cheap nowadays. And they were tasty.   Top level is broken into two sections, separated by a wall with cirque du soleil-inspired contortionists. A bar, and a lounge area, with plush seats and video projected onto the wall. Very mellow.  Downstairs is a club area. $10 cover, no big. Decent space to dance. At one point I had to briefly leave to meet one of the girls who had parked nearby and who wanted an escort through the neighborhood. Bartender covered my drinks for me while I went to get her. Awesome. You, sir, are a gentleman.  Well done, Monarch. Anyone who's hating on you has issues of their own.", 
    "review_date": "2013-05-12"
  }, 
  "hl0HdvFfndVGKVxmP1d5PQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jason W.", 
    "review_text": "On my way to the Monarch, I had to walk a couple of blocks up Sixth from Howard past porn shops, hotels that looked like they hadn't changed since the 1970's, the worst smelling pizza place ever (it smelled like a gym sock), and a variety of folks who didn't seem to like me for some reason. Was it my new glasses? My cardigan? When I got to the door of the Monarch, I felt like I'd reached a nice, little oasis in the middle of a neighborhood that was trying really hard not to give a ****.  The inside of the Monarch looks like a dark, Victorian mansion upstairs and a little Space Mountain'ish downstairs. It wasn't crowded the night I was there, so I was able to get a drink quickly and cruise around looking at the place. I really liked the different areas to hang out in and appreciated all the couches and comfy chairs.   I was there to see a couple of DJ's I like, so I'd bought a ticket for $18 ($15 + service fee). It honestly took me a little while to figure out what I was supposed to do because the stairs to the lower area were kind of blocked by a rope, but there was nobody around for a Will Call and the doorman didn't seem to know anything. I eventually just walked around the rope and went downstairs. I'm happy to support the local music scene, but I could've just come to this event without paying just as easily. Kinda weird. It would have been nice to have somebody at the top of the stairs by the rope.  The crowd at Monarch the night I was there was a little mixed. There were some really friendly folks, some random people spacing out, and a bunch of other guys and girls who were a little douche-y. Lots of cutting and pushing at the bar by guys in suits and girls massed up in groups who would pull their friends in like some sort of amoeba. However, once I got my drink, I was able to find a place to hang out that was comfortable without dealing with those people again.  The Monarch has a cool space, a great sound system, some really nice people behind the bar, and an almost laid-back vibe that I liked a lot. I'll definitely be back in the near future!", 
    "review_date": "2014-05-09"
  }, 
  "8pYGe9IKNHcbuj6NDgrqeQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Suzanne A.", 
    "review_text": "The decor is sparse but interesting.  Be prepared to stand for most of the night since there are about 30 or less unreserved seats (counting the bar upstairs too) in the whole place.  Went there for NYE and my friends thought it was great.  I would like to give it a second chance and write a new review.  The price was right for NYE and the early appetizers were delicious.  it just seemed that although they opened early, the staff did not act like it until about the time we left to go to another club.  My bartender, mind you, gave me great concoctions that had me wondering what the secret ingredient was.  I love when that happens, don't you?", 
    "review_date": "2012-01-07"
  }, 
  "Zf8hBwMSsETuB1ALcwAANA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle K.", 
    "review_text": "I'll be honest, the main reason I'm a fan of Monarch is because there's so much cushy seating on the ground level floor!  In terms of music, they have two levels. When I went here last year, the bottom floor had some house music and the ground level had some sort of jazzy music going on. Not sure if that's what it's like every weekend, but I sure enjoyed it. I would definitely come back.", 
    "review_date": "2013-04-10"
  }, 
  "py5vmLMLmRLWlQ0gny0LQA": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "Beau K.", 
    "review_text": "I LOVE this place.   I recently had the chance to DJ here and the sound system is a djs dream,  great crowd, great staff and all around fun place to be without worrying about the normal club crowd.   This crowd is much more in tune with the music !", 
    "review_date": "2014-09-08"
  }, 
  "BYQNUm_Mzomjz7vC9AmmJA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Uda W.", 
    "review_text": "Went there for happy hour mid- week. It was empty and great for about an hour, until  they turned the music up so loud that the 10 people in the place were all yelling at one another to be heard. Their specialty cocktails are delish, but detour away from them and the drinks are not.  I might go back to check out the free Jazz on Monday's but I don't  suggest it for a night out otherwise.", 
    "review_date": "2012-04-12"
  }, 
  "D4TME5hXHvQMDY_ipKVpSA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mariesa S.", 
    "review_text": "Such an awesome place !   The nicest staff, yummiest most creative cocktails you ever had !  Its got everything you need .", 
    "review_date": "2012-10-09"
  }, 
  "-Hxvjz-t5ttsuH6H1osA4A": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Susanna W.", 
    "review_text": "JF's Tour de SF finale Pt2  (review for BAR/LOUNGE area ONLY)  How can you not love any place that has a FREE PHOTOBOOTH?  Not in the nicest of neighborhoods, eclectic crowd, average drinks.  But the free photobooth makes up for all of that and more.  I had to restrain myself from hogging that thing all night.", 
    "review_date": "2012-08-07"
  }, 
  "-SgDEf6-et8vKLSJUfBY-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven M.", 
    "review_text": "Great Cocktails WITHOUT the suspenders, curled mustaches, 30 minute prep time and general indifferent attitude of the bartenders? What more could you want from a bar?   The place is stylish without being uncomfortably chic, has creative and friendly bartenders as well as crafted made to order concoctions. Great!  i went with some friends for a mid week happy hour cocktail. My co-workers started to complain about the neighborhood but i pointed out that he lives in the Mission and never complains about 16th street BART station. Come on, people in street are as SF as fog and the Giants!  We enter into a stylish bar with tunes planing and a few people chatting away at the bar. The first thing i noticed was the huge selection of booze! i like to think i am experienced in the world of spirits, but i was dumbfounded by the selections. We bellied up to the bar and cruised the menu. Lots of beer in the bottle and a good selection of cocktails that sounded good!   Make a long story short because it starts to get a little fuzzy from here on out. we ended up staying past 11:00pm! An happy hour drink turned into many cocktails!  Anyways, great cocktails, fun bartenders, and near the office makes for a 5 star review from me!  Will be back!", 
    "review_date": "2012-10-16"
  }, 
  "t7M5Apw8zQt5zi5zyRERbQ": {
    "user_rating": 5.0, 
    "user_location": "Albany, CA", 
    "user_name": "Billy R.", 
    "review_text": "Hands down my favorite sound system in SF. My boyfriend and I always feel comfortable regardless of usually being one of the only gays in the joint. Always a sick calendar of DJ's spinning here. My favorite night so far was dancing to Little Dragon's guest DJ set! Bartenders make a sick margarita too!", 
    "review_date": "2012-10-01"
  }, 
  "eXtzmsQBv91T6foM1_shwQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Bryan S.", 
    "review_text": "Went to Monarch for a friends B-Day and had a blast!! The Bouncers were SO nice and helpful unlike most bouncers who just want you to move one or out of the way! Slightly sketchy neighborhood  but you would never know from the inside! had a great time!", 
    "review_date": "2012-03-03"
  }, 
  "hFPi3XKLPKAoZrutSPPy1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Romany X.", 
    "review_text": "I've been coming to Monarch fairly regularly for over a year now. I like the way they've set up different environments within the venue. The club downstairs is very high-tech, with huge video displays and a truly state-of-the-art sound system. Upstairs, the decor is more steampunk, with the main bar at the entrance and a lounge behind it with victorian couches &amp; tables, where you can listen to anything from Eighties Pop to Psychedelic Funk, depending on which DJ is spinning that night. Now they've added a new space behind the lounge, the \"Emperor's Drawing Room,\" with a second bar. It has a more intimate feel than the front bar, definitely the place to settle if you're planning on conversation over drinks.  The drinks are a little more pricey than a lot of other places in the neighborhood (especially the fancy cocktails), but you definitely get what you pay for, and the staff are all very nice (and nice to look at). Speaking of the neighborhood, it really isn't scary like some other reviewers would have you believe. I've walked alone from Monarch to wait for MUNI at all different hours of the night and never had a problem. Be aware but not afraid--it's SOMA, not the Tenderloin.", 
    "review_date": "2013-09-29"
  }, 
  "arx6ptL4sztiPdxp7HoF9w": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Melody A.", 
    "review_text": "I came here a few weeks ago and was impressed! They have an upstairs area that has vintage high backed chairs and rotary telephones, reminding me of a smoking room (in a good way!). The night  was there, they had a Cirque de Solei esque performance upstairs! The area downstairs is great. There were some great DJs performing and good drinks! The bouncers were also very friendly and seemed to really care about our safety. I will definitely be returning.", 
    "review_date": "2012-02-09"
  }, 
  "iJnkBIRcRVbLBgtd2IWXOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "anna s.", 
    "review_text": "Pooky is my favorite bartender. Her skill at creating perfect cocktails is second to none.  The lounge is a chill place to go for great drinks and good vibes.", 
    "review_date": "2012-10-08"
  }, 
  "Yf7ps0NUfsAYsHywv2BAwA": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Shayna S.", 
    "review_text": "I had some friends visiting from Israel and most of them wanted to go clubbing to electronic music. One of my friends recommended Monarch. I had no idea what to expect, especially since we were going on a Tuesday night, which is random for me. We get there and it was a cute upstairs with a little DJ booth playing mostly hip hop. The drinks were reasonably priced ($11 for a fancy cocktail) and around $6 for a Stella. The real night was downstairs which is still small for club standards but enough for a good amount of people. The cover for the downstairs party was $10 which wasn't too bad. There were 3 or 4 DJs playing in a row and they were awesome, playing a mix of hip hop, dub step and trance. The crowd was a little druggy but I think that was just cuz it was a Tuesday. Either way it was really fun. I wanna go back and see what it's like on a weekend.", 
    "review_date": "2013-08-16"
  }, 
  "Eo4iEYfKEyKVoNOzJdY2Rw": {
    "user_rating": 5.0, 
    "user_location": "Richmond, VA", 
    "user_name": "Jamie D.", 
    "review_text": "What do you get when you combine a photo booth, a basement dance floor, an upstairs lounge, strong cocktails and rockin' staff? Monarch.  Man, they really know how to pull on a girl's heartstrings. I'll take a photo booth (and a free one, at that) any day. Give me a cocktail in one hand and a dance floor at my feet and these white girl moves might just make an appearance. In fact, they did make an appearance - thankfully the dimly lit atmosphere did wonders to mask my lack of coordination. Of course, the perfectly crafted cocktails might have added some fuel to that dancing fire. Some may think late night dance parties are reserved for the weekend, but I say bring 'em on any night of the week! At Monarch, anything is possible. It's definitely a \"let-loose without judgement\" type of place, and one to which I'll certainly be making a return trip next time I'm in SF.  I'm just bummed I missed the aerialist. Next time, Monarch, next time.", 
    "review_date": "2012-11-27"
  }, 
  "8a_LOZmeEBmB5-Mp4cUgRA": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Rebecca S.", 
    "review_text": "This place is not what I expected. I had come on yelp to get an idea of what it would be like. It has a nice interior and all, but it's honestly nothing to write home about. This is coming from someone who will frequent any place no matter how sketchy or how traditionally clubby it is as long as there's a party to be had. And I have to say the party isn't here. If I wanted to go dance in a half empty basement I could stay at home or go to Pappy's in Berkeley (which, trust me, isn't desirable). All in all: not great, not terrible.", 
    "review_date": "2014-03-27"
  }, 
  "thFaM9Kj4qqewkuKg3VT_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian S.", 
    "review_text": "What can I say, I love this place!  Great staff, great bar, and great club downstairs.  The sound system is phenomenal downstairs, and the place has a really intimate feel.  They bring in some top notch DJs to this place, and it has the reputation as one of the best clubs in the country for a reason.  The bar upstairs is really fun, I loved the atmosphere, and the aerialist will steal your attention almost right away.   The staff I just cant say enough good about, very professional, and very friendly.  Monarch can expect to see me regularly.", 
    "review_date": "2013-09-15"
  }, 
  "FIDPP65G4FxtZfqt5HwWWg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine S.", 
    "review_text": "Location of this place seems kind of shady outside, but it's nice inside! The bar is pretty big, and the bartenders seem cool. They do have a lot of variety of drinks, which were all reasonably priced. Besides seats at the bar, there are tables and sofas in lounge areas.   I didn't realize there was a downstairs until I read the reviews now, but my friends and I only stayed in the bar area anyways. The music was so incredibly loud, so it was hard to hear anyone unless you were a few inches away from each other. (Whoa bro, you're definitely in my bubble.)   My favorite part was definitely the photobooth! I mean, there's nothing more fun than getting drinks with your friends and making memories in photobooths!", 
    "review_date": "2014-02-13"
  }, 
  "BguSPnZ_hqC7jx7u-gGd-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deep P.", 
    "review_text": "Really cool vibe inside, I like that there are two bars upstairs (never had to wait longer than 5 minutes for a drink) with a DJ booth in the middle.  It was free to get in at the top, and a cover for the basement (which was playing harder music)... frankly, the top had a great lounge feel and the DJ was spinning some very good deep house.  The bouncers are huge but they were surprisingly friendly.    Intimate without being claustrophobic and a sexy vibe without creepy undertones.  A really well done space, kudos to the owner.", 
    "review_date": "2014-08-29"
  }, 
  "1By0VrUKDVKHgsRhYclL3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alycia M.", 
    "review_text": "This place is awesome. We came to see a friend who was DJing. It's amazing how it goes from kind of classy nightclub on the top floor, and you go down the stairs and it's a complete UG. Kind of biased since my friend was one of the live DJ's, but still. AWESOME.", 
    "review_date": "2012-09-28"
  }, 
  "iuCyO8XyvfcsxVa2Fivc-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Virginia B.", 
    "review_text": "A solid bar with quality cocktails and a decent beer selection.  The ambiance captures a 1920s vibe, which is only supported by the projection of silent films on the back wall.  I have never had the pleasure of being in the bar when the aerial performer is up in her ring, but I have been told she is quite talented and its a great show.    Don't let the shady street corner fool you, this bar is worth a visit.", 
    "review_date": "2014-06-26"
  }, 
  "ndK4iQbD3Yvt-sI2WsV8aA": {
    "user_rating": 2.0, 
    "user_location": "Davis, CA", 
    "user_name": "Angela Y.", 
    "review_text": "The bar up top was nice. The dancer performer in the center alcove was beautiful and talented. I didn't particularly like my cocktail, tasted like paint thinner and wasn't drinkable at all. Was hoping to get a lot of excitement out of the dance floor but hell, the music upstairs was better. Sound system was awesome but the music was the same beat for 2 hours. Nearly fell asleep on my feet. Crowd wasn't responding either. There was so much potential. Get a better DJ and maaaybe i'll come back. Not goin back unless I'm invited to a party or an outing.", 
    "review_date": "2014-10-12"
  }, 
  "js3BShREkesKFuTpPnFCsw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Antonia H.", 
    "review_text": "Went there Friday to see a DJ, it was really crowded downstairs and realized my phone was stolen out of my side purse after about 30-min. Talked to security that night, and the next day, and they informed me that phone-stealing is quite common there. I never got it back, watch your phones if you go there.", 
    "review_date": "2013-09-16"
  }, 
  "OnuNOlWnTo_xCTyNrMrlEQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becca B.", 
    "review_text": "I have attended Monarch several times since they opened last year and have always enjoyed the music and the crowd and had a rarin' good time with my crew. However, the club's employees are not responsible for any of these things. The clubs employees are responsible for creating a safe  environment for patrons, making sure no illegal activities go on, and making their customers feel comfortable returning to the venue for another artist's show. Based on my past experiences at Monarch, I can safely (now that I am off the clubs property) say that they are not interested in doing any of these things.  Last friday I attended a show at Monarch with several friends. We were all enjoying the show, but after it started getting packed decided to go outside and have a cigarette. While I was standing in the area of the side walk designated as a smoking area, 'Rick' one of the doormen pushed another customer on the ground in front of my feet. I do not know what originally provoked this, but the reaction was clearly overly violent. Rick the doorman, who is tall, broad shouldered and weighs perhaps 200 lbs, had grabbed a slim younger customer and thrown him on the side walk. The boy was covering his face and trying to get up, but Rick kept pushing him back down to the side walk. After he was allowed to get up and leave I walked back to the entrance of the venue, shaken, and showed the doorman the stamp on my wrist and calmly said to Rick 'I would appreciate it if you respected your customers physical space' (direct quote) Rick pushed me and said 'You're done!' at first I didn't believe what was happening and attempted to walk through the door. He pushed me again and said 'Get out of my doorway!' My friends came back out to ask why I was not allowed to go back into the venue to see the act I had paid for, at first trying to be reasonable. Rick told both of the boys with me that they weren't allowed back in either. Met with more shouting and pushing, tempers began to raise. After asking if he thought this was how you treat paying customers, Rick pushed my friend into the street and said 'I'm OPD! You can't touch me! If you don't leave I'm going to call my boys around the corner to f#@% you up!'. We did, eventually leave but not before calling the cops and reporting the 'security' guard for aggravated assault.  I understand that Monarch is in a bad area of town, and that additional security is perhaps necessary. However, nothing about Rick's behavior made that corner a safer place. At best he scared away 5 frequent customers, at worst he committed aggravated assault. I realize some people will be inclined to think that there was just some misunderstanding, and perhaps my friends and I were more incapacitated or more belligerent than described here. However, I have also witnessed the 'security' guards at Monarch taser (yes taser) a man on the dance floor repeatedly while he was lying in the fetal position in the corner of the dance floor. In another incident, my friend was standing in the wrong part of the side walk while smoking and was likewise refused re-entry without any warning. This are just the events I personally witnessed and I am sure there are many other stories concerning this security guard's abuse of power as well.  I would strongly encourage the owners of Monarch to hire a doormen from a different security company (Rick claimed to be the manager) which focuses on protecting a venue's customers and property as opposed to demonstrating what little power they have by use of physical violence. I would also encourage any customers looking to enjoy electronic music or any promoters or artists looking to create a comfortable, fun environment to go elsewhere.", 
    "review_date": "2013-01-29"
  }, 
  "0tcrRrovg9Xhz2jNrA6z8A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amelia H.", 
    "review_text": "Beware of the small female bartender with short black hair and tacky black eye makeup. My friends and I came here last night night for a birthday party and it should have been a red flag when said bartender didn't know how to make a simple gin martini. Gin shot? Gin and tonic? I'm sorry, do I need to write my order down for you? My goodness it's literally one of the easiest drinks to make, gin and vermouth, that's it's. I let it slide as it was a Friday night and they were relatively busy, which is a complete overstatement. I'm not quite sure how things escalated, as I was sober (refusing to drink her disgusting concoctions) but she ended up holding my credit card ransom behind the bar. I had my ID in hand ready to close out and she's telling me I've never ordered a drink. Excuse me, I've returned two of your drinks and have politely asked you to remake them. On top of that, I repeated myself enough times telling you that I'm not trying to be rude or offensive, I just want a proper drink that doesn't taste like bleach. Clearly Gin is not her forte, but when I'm paying $12 for a martini, I want a martini.  Anyways, a very kind gentleman sitting at the bar next to me informs me on this sweet little piece of information: she's been taking shots being the bar all night. It's fine to indulge here and there but when you're drunk at work, sweetie please, are you still in high school? Return that horrific outfit to 2007 and take a quick lesson on professionalism and class. One thing led to another, and I'm sure I've said nicer things in my day, but the bouncer and eventually the owner had to come over to make this difficult woman give me my card back. So tell me, rude bartender, what's more embarrassing for you? Your security guard giving you a stern talking to and snatching my card back? Or your boss telling you he's seen you on the cameras all night and that you're fired?   Regardless of this colorful story, Monarch is worth it when you don't have to deal with rude and drunk bartenders who are aging less gracefully than their mothers. Kudos to the rest of the staff for handling the situation properly;I give them 5 stars.", 
    "review_date": "2014-09-27"
  }, 
  "lumb9eEB41N1eexjBBaBig": {
    "user_rating": 4.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "Lily Z.", 
    "review_text": "If I have to give you a reason to go to Monarch, go for the free photo booth. I mean, unlimited pictures with friends for free and souvenir pictures to bring home? Yes.  I came here for a friend's good-bye party. It was a very laid back get-together. And Monarch was just that. The place is super casual, you don't have to wear typical club clothing. A lot of people wear jeans, shorts, a regular sweater, etc.   There are two floors to this place. I was only at the top floor. It was small and cramped and more suitable for chit-chat. The underground floor is supposedly more club like (dancing). I didn't go downstairs because there was a cover charge-- I didn't have to pay cover for the top floor.  Drinks are the typical price, I paid $7 for gin and tonic.  What I really had a problem with was the location. The area was so sketchy. I parked on Howard and 6th and had to hold on to pepper spray for my one-block walk to Monarch. When I had left yesterday night, police cars had blocked off a section of 6th St. because someone got shot.", 
    "review_date": "2012-07-14"
  }, 
  "HajwFeKAoAnE4YRF35Uf_A": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Stephanie S.", 
    "review_text": "Wowee! Fun club. Cool vibe and great sound system downstairs. Nice ambience and atmosphere with plenty of pretty people populating both upstairs and downstairs.  I can't comment on drink prices or the $20 admission fee downstairs since my girlfriend and I were treated by a guy we were hanging out with (Sunil-thank you!) but I guess if they put that kind of money into the sound system, that explains why the steep entry fee.  Either way, it was a fun place to see and be seen, plenty of good drinks to go around, nice people and vibe to the place. Bar tenders seemed attentive to our thirsty needs so no complaints from me! All thumbs up!  I'll come back!", 
    "review_date": "2014-02-04"
  }, 
  "sMfAazU842DN6NNTC7PUuQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Anna P.", 
    "review_text": "Amazing Speaker System!  Upscale, steampunk decor. Great opening night. Props for hosting an all-day Santacon event, too!  Downstairs dancefloor is well ventilated &amp; may I mention again that the (gold bell) speaker system is AMAZING! A little strange platform, staircase layout downstairs, though.", 
    "review_date": "2011-12-11"
  }, 
  "r86hWmVTTSM6If0gSUuBrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tanya K.", 
    "review_text": "This is THE new hot spot in SF. I love to party, and have become a little bored with many of the usual venues like Vessel and Icon recently. Monarch has swooped in to bring a fresh new face to SF nightlife and it could not have come at a better time. They bring in incredible talent (not just electronic, but live music too), have an amazing sound system, tons of room to dance, inexpensive drinks, unpretentious staff...it's pretty much tits all around.  But here's the BEST part about Monarch: if you just want to have a nice cocktail and chat with your friends, the upstairs bar has a great cocktail menu, plenty of seating, and music is played at a low enough volume that you can actually hold conversations. But if you guzzle a few of those Manhattans and suddenly feel like dancing, head downstairs into the nightclub area and get down! It's like 2 bars in one - what a great concept. BOTTOM LINE: Go. Just...go.", 
    "review_date": "2012-01-19"
  }, 
  "maFSfzP5bWJihyYLNTtziw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Caitlyn M.", 
    "review_text": "This is possibly my least favorite bar in SF.  Girls twirling from hoola hoops hanging from the ceiling?  No thanks.    Also, a $20 cover downstairs?  This isn't Vegas, and even if it was, no thanks.", 
    "review_date": "2013-12-11"
  }, 
  "lPAWAIF3yhfQbTbIBpRmxQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Sherry C.", 
    "review_text": "Went here on a Wednesday night just to chill and hang out.    It was pretty empty, but that didn't bother me.    The bar has a cool vibe and I'd definitely come back to visit next time i'm in town.", 
    "review_date": "2012-05-14"
  }, 
  "-ITQRhpPXXC_XhDZ-t4slw": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Robert W.", 
    "review_text": "I haven't yet been here for a club night. My review is based solely on their upstairs cocktail lounge(s). I've been here 5 or 6 times and every time I end up discovering a new favorite cocktail and even get inspired enough to give it a try (usually unsuccessfully) at home.   Last time I was here, I had an Aged Rum Old Fashioned with Creole Bitters which was really incredible. The staff are very friendly too and happy to suggest new things to try based on your preferences. Also, their recent extension to the upstairs lounge is really classy and unique and only improved their already impressive selection of top notch booze!", 
    "review_date": "2013-10-14"
  }, 
  "NfU0zDaTMEQ4-X9dbQWd9A": {
    "user_rating": 3.0, 
    "user_location": "Cleveland, OH", 
    "user_name": "Cara L.", 
    "review_text": "This bar had two faces--one I like, and the other I could pass on.   But one thing I can say I don't like about both faces is the $12 shots. I'm from Cleveland and that price is just redonkulous! You can get a hand-crafted, incredible cocktail for $15 at home, so maybe you can see why I think $12 for a shot of tequila is a little much. (Just my personal opinion, here...)  The upstairs won me over with its vibe and *gasp* free Photobooth! How much fun is that? We pretty much dominated that thing for at least 30 minutes straight. I also loved the ring swing hung above the bar for the dancers. There weren't any while we were there, but it would have been amazing to see one.  Then we walked downstairs and it was dark, cold and damp. The vibe was just off. Don't get me wrong--I love dive bars. This place was just trying to hard to make a basement seem trendy. I would have much rather stayed upstairs and skipped the weird, trance music and weird people dancing in circles.  I will say the bouncers here are awesome. As we were waiting for our Uber Cab outside, he stayed around us and made sure no one messed with us. I guess this isn't the best area of town and knowing that, he made sure no creepsters walked up to us for any reason. He did not go inside until we were safe in our cab. Love that!", 
    "review_date": "2012-03-23"
  }, 
  "rO2YKN1PqAJjd6YgP0PM0A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen S.", 
    "review_text": "I went here on a whim during happy hour (so upstairs) and loved it. Not too crowded and strong drinks. Highlight is....FREE color photobooth that actually takes flattering pictures. Winning.", 
    "review_date": "2012-05-31"
  }, 
  "oTpmi6DjCotg0htLaETemg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Harold C.", 
    "review_text": "Diamond in the rough.", 
    "review_date": "2012-04-03"
  }, 
  "lS-wxXFJWxVdbA1OAJDFRg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Joanna S.", 
    "review_text": "I went here for Burlesque and Trapeze night. It certainly brought out the weirdos! There was a clown DJ and lots of dorky people dancing to retro-vintage-circus-music on acid. I absolutely loved the burlesque show.   My drinks were a small, yet decent size; the bartender put my vodka cranberry in a whiskey glass when I'm used to getting full beer-sized glasses.   The bar has really beautiful decor. The basement/dance space is a nice compact size--not too small.   This is not in the best neighborhood, but the bars/clubs in this area are really affordable and fun!   I would definitely come here again if it was convenient.", 
    "review_date": "2013-02-01"
  }, 
  "fqS9OIMZ8EXzVvGk3BTpIA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kristin G.", 
    "review_text": "I literally *just* got back home from their \"Deep, Dark, and Dangerous night\" of dubstep in the downstairs portion of the club. The music was good, and I danced my ass off to it. Their service, however, SUUUUUCKED.  I have been in the hospitality industry for over ten years. I was a wine bartender and a club bartender during that time. I KNOW when I am being cheated. A super-weak cranberry vodka is not seven goddamn dollars. That's the price of a mixed cocktail in an up glass, darling, not half a shot in 10 ounces of cranberry juice.  So, WAAAAAAY overpriced. Also, I did the standard thing of covering my drink with a flyer while I was dancing--it still got taken. The bartender lady was nice enough to give me a free drink, this time with enough alcohol to actually taste. So kudos to her, but take away points for the staff who threw away my drink. And by the way, if you're going to have a night that is geared towards those who like dubstep AND the darker side of life (goths, for example), as your flyer suggested, I would really appreciate NOT being scoffed at by what looked like your \"regular\" crowd. It felt like fucking high school, a gaggle of girls and one guy all crowded together doing the \"sneer and giggle\"--looking at those of us who came to actually dance and enjoy the music with derision in their purposefully sidelong glances before turning back to each other in their safe haven of \"cool\" and giggling mockingly in so high a pitch I swear only bats should be able to hear it.  Try again, Monarch.", 
    "review_date": "2012-06-06"
  }, 
  "REGjppkq2IkDLRQVmRj_Bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin J.", 
    "review_text": "Monarch doesn't have the best location in the world.  I felt like the only way I'd want to go back is if I was driven and dropped off.  Walking down 6th street towards Monarch is the rough spot.  I have to say that when you're inside you're in a new spot.  Somewhere a bit cleaner (just a tad), somewhere a bit homier, and somewhere where the party doesn't stop until the next morning.    I was happy to be attending one of Monarch's intimate Yelp Elite events for a recording artist producing his second album. The event was rather packed and the upstairs bar was hard to maneuver around. So after grabbing some water we ran downstairs to grab a seat at the bar and listen to the beats.  Such a different vibe downstairs from up.  The music was a bit House and a bit Hip-hop with some Rap thrown in from time to time.  It was a great vibe with drinks flowing throughout the night.  I've heard that this is one of the best sound systems in SF, but I can't say I agree.  The sound was GREAT but the space is rather small and limited.   I would be back for a happy-hour or another music event.  Just make sure not to get shot on your way to the club.", 
    "review_date": "2012-08-22"
  }, 
  "EoNCo8q0J74HJAzLSqPdpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam N.", 
    "review_text": "This place has it all!  A super swank bar upstairs and a club with a killer sound system downstairs.  They even occasionally have a Cirque du Soleil style performance above the upstairs bar.  Best of all they have lots of bartenders and serving capacity, so you're not waiting around for drinks when you want them.", 
    "review_date": "2012-01-05"
  }, 
  "Ve0LUwcrzxL7w0RYgY4Aaw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Katy H.", 
    "review_text": "Pretty sweet bar. There's a dog wandering around, pretty cool music and occasionally you can catch an aerial act too. It's got a bit of a dive feel to it but not the type where actually divey people hang out.  I had some scotch here and stood around a tall table to chat with some friends. There's plenty of room at the bar if you can nab a stool and there's even a few seating areas if you're lucky. Great for groups as small as two and as big as about 10. The walk here from my hotel in SOMA wasn't awesome but you can always grab an Uber or risk getting mugged. (Some friends were worried but it's really not too bad of an area. Just get off your darn phone and pay attention to your surroundings!)", 
    "review_date": "2012-03-27"
  }, 
  "IUynQMRFlmNG8hzlHRiuwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "wendy w.", 
    "review_text": "Monarch is my new favorite bar in the city....hands down. Not only does it have amazing cocktails made by some of San Francisco's best bartenders but it has a free photo booth people!!! Whenever i've had one too many cocktails, I can find the evidence of my night's debauchery by checking my purse full of photo booth pictures....whoopsies. The interior design has this cool vintage feel with ornate velvet couches that are perfect for plopping down on and getting all caught up with my girlfriends.  I'm not sure if it is every night but I was also blown away by the trapeze burlesque girl who comes out and does this show on the a ring that floats above the bar.  Very, very cool bar....oh and the sound system and DJ acts in the club downstairs will knock your socks off too :)  Enjoy!!!", 
    "review_date": "2012-10-11"
  }, 
  "3zxy3LVBV3ttxoYbY4rQ8A": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Farrah A.", 
    "review_text": "I don't know much about SF, but when Ruggy J suggests a spot for a group of 100+ people, it's gotta be a real crowd-pleaser.   For one, there's a half naked, extra bendy senorita doing sexy aerial acrobatic stunts from a rotating hoop which hangs high above. Sex-ay.   The bartenders are cool, but for a Friday night, I found them to be seriously understaffed. They're shakin' up craft cocktails, and two peeps just doesn't do it.   There's a photo booth - a FREE photo booth, My girlfriends and I took advantage of that stat.   There's a bumpin' club in the basement, but I wasn't quite felling it that night, so we didn't get to check it out. The playlist upstairs, however, was the bomb-friggin'-diggity ... however, it was TOO loud. I actually couldn't hear myself speak at some points of the night, which put me in a pretty bad mood and we had to leave. Kinda redic considering upstairs is supposed to be more chill and loungey.", 
    "review_date": "2012-04-16"
  }, 
  "RvirR53BOkK4KF0Zb-77ag": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Jenn K.", 
    "review_text": "Gorgeous venue! I was here for NYE and had the best party ever. The space is big and the decorations were beautifully done. Even though it was New Years Eve the bartenders were still on top of it and we didn't have to wait long for drinks at all, which were done really well. My fav are moscow mules and I loved them here. Empty drinks were picked up promptly and they had an awesome dj and fun performers. I don't know the reference (if there is one) for the woman in the sparkly sexy lobster outfit but it was hot! Balloons, champagne and countdown was executed perfectly! I hope to come back again on my next SF trip. = )", 
    "review_date": "2014-01-02"
  }, 
  "8XK6ZS4z5SzInSfu0xrfSg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole R.", 
    "review_text": "Wow, well I used to come here but I'm officially banning this place from my rotation.    If you are fine with a small upstairs bar and don't want to dance, by all means go and try a drink.  The bartenders are friendly, and while the drinks aren't cheap (~$12), they're delicious.  I wish I could continue supporting them, but I just can't justify it anymore, and here's why:  - $20 cover to go downstairs to an empty dance floor (gee, I wonder why it's so empty!) - No exceptions or discounts on the $20 cover for females, being dressed up, etc.  Which is fine, especially when the cover is going to a DJ or performer, but... - No live music or DJ to justify that cover.  They're just charging to charge. - There's not much else around if you, like me, decide this place isn't worth your time.  But wait, I haven't gotten to the best part!  There's a gem of a bouncer there.  I unfortunately don't remember his name, but it starts with a T...  He's a real charmer, that one.  - When I balk at the $20 cover, he tells me \"it's not that much money, just pay it\" - When I reply that I'm a student, it's the end of the night and I just spent the last of my cash on a cab specifically to Monarch and 2 $12 drinks, and that I don't have $40 in cash just to get me and my girl friend downstairs for an hour, he says:  \"why don't you get a job?  I'm a student, and I have a job.\"  Wow.  Well sir, I do have a job.  Two, actually, and I don't appreciate your tone.  He then proceeded to hit on me.  My girl friend and I were so disgusted that we put down our $12 drinks, 3/4 full, and walked out.  Mr. Bouncer had the gall to wink and make a kissy face at me as I left.  I want to find out where else that guy works so I never have to go to his bars again.  So if that's what you like for a Saturday night, go for it!    And to the bartenders: you guys really are great.  Move to a different bar and I'll follow you.", 
    "review_date": "2013-03-12"
  }, 
  "NEOSYsubf7SVeVm8RytxYA": {
    "user_rating": 3.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Michelle T.", 
    "review_text": "Found this place because of SantaCon.  The layout seems small at first, but there is a downstairs.  The downstairs portion isn't designed that great, just a simple open dance floor.  The guy who was in charge (I guess) was EXTREMELY nice, so were the bouncers!  CRAZY!  It was fun, but we weren't there long.  Don't know if it's reflective of the usual days it's open.  They had a girl doing aerobatic moves on a hoop...so that was pretty cool.  I would come back here again to see what the regular crowd is like.", 
    "review_date": "2012-01-05"
  }, 
  "mFM9e6geCc0_nX7QqMnpYQ": {
    "user_rating": 3.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Nancy P.", 
    "review_text": "Came in to meet hubby towards the end of a disappointing loss in Game 6 to KCR. Sat at the bar. Nice ambiance. Stiff drinks. Friendly service.", 
    "review_date": "2014-12-29"
  }, 
  "nLH48VyCpl8FLrUiUF-sBg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew W.", 
    "review_text": "Having seen a half dozen bars over the last 10 years at the Monarch address, I wasn't too hopeful about the prospects, but with Light Asylum headlining, I figured it would be worth a shot.  The crowd is YOUNG, like 21-25 yo.  The acoustics are good.  The upstairs looks like someone raided a garage sale to decorate it.  Drinks are expensive.  And after waiting til midnight to hear Light Asylum, we were only treated to a 45 minute set because the Monarch's water pipes from the upstairs were dripping onto - and messing up - the band's equipment.  Not going back.  The only thing positive is really the downstairs sound system and visual electronics.  I give these guys credit for trying to succeed at this doomed location, but perhaps getting the plumbing fixed would be good?", 
    "review_date": "2012-02-10"
  }, 
  "LLqAoLOOZu35wdI1QU9VlA": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kate W.", 
    "review_text": "i hope i don't have to go to another show here again. the upstairs is very pretty and the downstairs was a nice venue, but the 2 incredibly rude main bartenders (downstairs)  from last night (11.9.13) partly ruined the evening. they were snotty and reluctant to serve me and my boyfriend and charged $9 for a glass of wine that i am sure wasn't filled as full as it should've been. it wasn't very good either. and if it was the case that the glass should only be filled halfway, then the drinks are incredibly overpriced. in addition to that, there was just a bad feeling about this place and the people that frequent it. i never would've gone here anyway, if it weren't for the band i wanted to see.", 
    "review_date": "2013-11-10"
  }, 
  "JWPAM9z6Ob4LDn10NppBLw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Léa B.", 
    "review_text": "Club/bar  2 floors, 2 different atmospheres. A free photo booth. Not sure if it still works we couldn't get our pictures yet :(", 
    "review_date": "2013-02-02"
  }, 
  "RvMSLO9vtSsX5YuQ5UcBhQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BARRY L.", 
    "review_text": "Past the loonies on 6th is a gem called Monarch.The good folks here took good care of my event. The fully stocked bar and knowledgeable staff offered each and every one of my guests personal cocktail attention.", 
    "review_date": "2013-11-18"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "Tamale Tuesdays!! Those Tamales were so good I think I might just go back for more. Drinks were also good, only problem the place is in the ghettos, not fun walking down 6th street alone.", 
    "review_date": "2012-05-10"
  }, 
  "MniM4s3_274LU2isiu8n0Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Conrad G.", 
    "review_text": "What night did we come out? Saturday  How was the line? Short  What did we have? 2 Shots of Don Julio  How was the crowd? Very Good Looking  How was the scene? Dance Party  What's the demographic? Equal numbers of men and women.  What's the ambience? Denim, casual, and cohesive.  What kind of music was playing at Monarch? Electronic New York Electronic European Electronic  What's the noise level? Loud  Will we hang out at Monarch in the future? Yes", 
    "review_date": "2012-01-13"
  }, 
  "Xi3gq3P427JtlQfoeV2SaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah D.", 
    "review_text": "A fine palace in the heart of 6th street!  You are greeted with a warm ambience and will be pleasantly surprised by what awaits you in the dungeon of this castle! yummy cocktails and beautiful people!!!! Exactly what this neighborhood needs!", 
    "review_date": "2012-01-05"
  }, 
  "p9E3biSelobOXPLgXdtd7A": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Shawn A.", 
    "review_text": "I am amazed every week at the amazing talent that the club is booking! I also am impressed at the level of professionalism the staff has been exuding on a daily basis. I think that this club will continue to grow and change...The Sky is the Limit!", 
    "review_date": "2012-05-01"
  }, 
  "j1VUe41XObdkrbsYmZUctA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin L.", 
    "review_text": "OK besides from Kaskade being uber amazing, I have to give props to Monarch's awesome sound system downstairs (my ears are still buzzing good music the day after - good thing or bad thing...).  The downstairs area really gets poppin too.  Intimate feel for dance area.  The bar is alright, but the drinks could be a little more stiff IMO.  I didn't spend too much time upstairs but the atmosphere is pretty chill.  Pretty good spot in the middle of a not so great neighborhood!", 
    "review_date": "2013-05-02"
  }, 
  "5jLkKtE4HPlrbjw-0w9lvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon T.", 
    "review_text": "This bar has been on a roll lately. It was host to the Pulp after-party and then Blow-up London's SF appearance. Don't let the small area upstairs fool you, this place has a really cool basement floor. Down there you'll find another full bar, small stage for a band, and rad looking speakers.  Also, I thought the door guys were really friendly. When my girlfriend and I left early on a Tuesday night, they asked if we needed them to get us a cab. Considering it was an early week day night, it seemed a nice gesture.  Hope this place keeps playing home to one-off club nights and maybe some up-and-coming ones.", 
    "review_date": "2012-05-15"
  }, 
  "bxe_XbDvOgVAGRExTYDYVA": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Douglas L.", 
    "review_text": "My new favorite place to b... The staff is so welcoming, friendly, and gorgeous. I have gone to events 3 times in the last month and I keep having a better time than the last. Thank u to the entire staff for making each event over the top awesome. Panda is the best!!", 
    "review_date": "2012-01-19"
  }, 
  "FaYXjGgLtetpCCiKmEsq9g": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Fraulein C.", 
    "review_text": "I'm a social butterfly. What can I say? As always, I handed myself the club card to go out for some dancing. Well, I deserved it after a stressful few weeks. Where else would I go? Nonetheless, SF.   Meandering the streets of SF and feeling obliterated to leave Supperclub, I had the urge to head to Monarch. Odds were 10 to 1. Gambled with my friends and my conscience of what I had left after a few drinks to figure out how the club scene would be. Since its only been open for a few weeks, I didn't want to make the poor choice. Well, why the hell not?!   I was taken aback! Monarch was a different vibe. Upstairs was more open. Fresh and lots of room, air to breathe and you can check out the crowd while tunes of rhythmic melodies streamed throughout the top floor. The place so far was inviting and so tasteful! Newly renovated and the color scheme of everything fell into place. I was loving every piece of it. The upstairs was definitely more of a lounge feel. Quiet yet elegant in such a casual setting. The upstairs DJ booth is tucked away in a window-like display before heading down to the rest of the venue below. My friends and I worked our way downstairs to their dancefloor. Downstairs was more packed yet still more room to get yourself to dance. They have the DJ set and stage nearby the downstairs entryway and bar area. Shocking they have stools and chairs to sit down if you care to rest a bit. Spectacular venue. Uptempo, mix crowd and the music is jumpin'!! Grade A in my book. You can't go wrong with the place.  Luckily, I found out they had Miguel Migs and Julius Papp spinnin' the evening we went. House music and $5 cover charge?! Not so bad. If you come in earlier before guestlist closes, FREE. Drinks are hit-or-miss depending who pours your drink but I won't complain. They do have one bar upstairs and the other downstairs. However, it's a CASH ONLY bar, but they do have an ATM machine. Unfortunately, the night we went it wasn't working. Love the place anyway, so that doesn't take away a star! Experience was fun! Security kept crowd control under wraps, so there was no problems whatsoever.  I was feeling exhilarated when I swayed my hips from left to right and my feet was dancing to the groove with everyone! Lots of eye candy! I may have found a new joint to dibble dabble my tush to and fro the next time I visit. Penciled into one of my go-to spots!", 
    "review_date": "2011-12-05"
  }, 
  "blNkkNGH6o_lv5STmRN_Xw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine A.", 
    "review_text": "classy decor but i think of monarch like a place that can't quite make up it's mind what it wants to be -- a hipster bar?  trendy venue? someone's living room? dance party? circus entertaining? maybe it's a play on words \"monarch,\" like a caterpillar / butterfly in a transition state. after being inside for about 15 minutes, i couldn't tell and neither could my friend. there wasn't enough to hang on to in order to vibe with the scene. we went, we saw, couldn't figure it out &amp; promptly left for a venue with less of an identity crisis.", 
    "review_date": "2012-01-17"
  }, 
  "xEc6S6ZTbFeNekKgWTZP9A": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Preethi C.", 
    "review_text": "Brand new club in the newly happening (and still quite sketchy) Market/6th street neighborhood.  This club looks like a typical LA hotel bar/ultra lounge on the top floor and the basement is a small, but pounding electronic music venue with a sick sound system that will give Function 1 a run for its money.  The bartenders upstairs mix a mean drink, door service is extremely friendly, and so far I haven't had a bad time here.  If you like house and techno, you should definitely check this place out.  If you like to be seen and lounge, stay upstairs :)", 
    "review_date": "2012-01-25"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Fit for a king.  Modern design with retro accents. The speakers are incredible.  Clear and crisp sound system commands you to dance.  Groovy and soulful beats by the likes of Marques Wyatt.  Sophisticated and well-behaved crowd radiates positive energy.  Exquisite taste proven by the bartender offering me an alternative beer when he discovered the last Bud Light was in a blue bottle. No one wants that.  First time could have been an aberration. Until proven wrong Monarch is on the list of favorites nightlight spots in the city.", 
    "review_date": "2012-04-03"
  }, 
  "gGLn-ogVTI58vJ5e98gDmA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg R.", 
    "review_text": "Monarch has a serious identity crisis.  Upstairs, you'll find a hipster SF bar with the prices to match. Techies will be playing Cards Against Humanity, the bar will have flowing drinks, and there will be a DJ playing some music, often matching what is going on downstairs.  Downstairs, you're going to find an amazingly sweet Void Acoustics horn-mounted Sound system, the first of it's kind in the City, and one of the first on the West Coast, voted one of the top ten sound systems in the United States by a respected dance music writer. The sound cannot be understated, it has absolutely no dead spots throughout the club and sounds crisp, punchy, clear, and will toss you around the dance floor... if you can find any space. The dance space is frighteningly small for the amount of power the sound has. There is a small-ish VIP section (that gets in the way of everything, as they usually do), and cocktail waitresses will randomly walk through the crowd balancing a bunch of drinks on a plate, causing you to suddenly freak out when they push by.  Some amazing talent comes through here, including Dixon, Ame, DJ Tennis, Carl Craig, and other great deep tech/house DJs, but you're going to have a tough time finding room on the dance floor and the identity crisis the entire club has really makes it tough to stand and vibe out with the room. The sound nearly makes up for it, but I have honestly yet had a time there where I didn't feel like I was swimming in scene-ish hipsters who are looking to be seen rather than have a good night.  They sometimes throw afterhours here, including a brand new one that happened on New Years Day this year, so I feel like the aim of the club is to be one of those great dance spots for discerning ears, but I can't help but feel disappointed that the great, if packed, club space has to be attached to the hipster bar.", 
    "review_date": "2015-01-06"
  }, 
  "zHGclvkpYOFPoChJNBqreA": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Max K.", 
    "review_text": "I don't go to clubs much anymore, preferring instead the occasional lounge night with great cocktails and good friends.   But Monarch is quintessentially San Francisco, and is simply amazing.    Eclectic, edgy, artsy, and slightly weird - just perfect.   And then there is Pooky.    Named recently as one of the top Bartenders in the City by a number of online pubs and blogs, she is an absolute tornado behind a busy bar, but moreover an amazing Alchemist of all things intoxicating.     Case in point...I read about her unique ability to size up a customer's whim with a couple of questions, and then mix the absolutely perfect &amp; unique drink...so I said \"Hi Pooky, I'm Max...I've read all about your amazing talents...I love Scotch...\"   and that's it.   The tornado started spinning, and after a couple of pickled cherries, a crush of lemon and sprig of zest, I have a purplish cocktail....which absolutely blew me away (and knocked me on my ass).   I can't even remember the name, but damn, it was good.   And I rarely drink mixed drinks.   Downstairs is a massive dance floor, and a DJ spinning great house music.   Upstairs is the Bar and a cushy lounge area behind.   It's not a huge place upstairs and initial impressions belie how big the dance floor actually is downstairs.  Crowd is a bit older - not the crazy drunk 20 something Asian kids scene so common at Temple, Ruby Skye, etc...  Monarch is perfect for a somewhat older (but young at heart) guy like me who still likes to live it up every so often and blow off steam.   Cheers Pooky...", 
    "review_date": "2012-09-29"
  }, 
  "PUbEy2Wq0jwmXTgx6-pyNw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Henry F.", 
    "review_text": "I went to LIGHTS DOWN LOW HALLOWEEN PARTY WITH L-VIS 1990, SFV ACID, URULU that was supposed to run until 4. People cleared out after 2:30 and they just cut the music.  it  sux to pay 20 bucks for only 5 minutes of a headliner.", 
    "review_date": "2012-10-27"
  }, 
  "Jtfz1WbIB_FtYDkO3MtRXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yolanda Y.", 
    "review_text": "For a Friday night this place was very bearable which is why my friend and I decided to stick around for a drink. The bartenders were friendly and competent! The drinks were wonderful and just what we needed. We were checked in on several times and the men in here at least on this night seemed normal and non-annoying. There were a few women but def mostly men. I liked the space. No idea if they have food.", 
    "review_date": "2013-12-18"
  }, 
  "O3itQaf7WABkxg5bDIURkw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan G.", 
    "review_text": "Terrible service!!! I decided to take a gamble on this club with a $30 dollar cover... that's right a $30 cover to see the dj that was showing tonight. Never heard of him but he was supposed to be good. Despite the ridiculous charge to see someone I never heard of I decided to pay because all my friends were going. Boy what a mistake that was...  I danced for a couple of songs and then decided to go outside and smoke a cigarette with my friends. As we were all going inside I was the last one in the group and I flicked my cigarette apparently to close to the door and the bouncer took a huge offense to that and decided that i was no longer permitted inside. Obviously I was not happy with that and put up a huge fit and because I'm a rather large man at 6'5 I was swarmed with bouncers that threatened to beat me if I decided to make another move towards the club. I asked all of the bouncers why I was being kicked out and none could give me a real answer.... besides the fact that I was with an attractive girl that was already inside and they decided that I was threatening to all of them.  I will never personally go back to this club because of the terrible service, not so good music, and very drugged out crowd that was very clearly too fucked up to make a good scene... the bouncers were clearly used to dealing with very fucked up and drugged out people and when they actually came across a sober man that stands up for himself they didnt know how to act besides abuse the power they were given,   DO NOT COME TO THIS CLUB UNLESS YOU ENJOY BEING MISTREATED. TERRIBLE SERVICE, TERRIBLE ENTERTAINMENT, TERRIBLE TIME!", 
    "review_date": "2013-04-07"
  }, 
  "IcdxwCBX6rNHwlcFJEVVtQ": {
    "user_rating": 4.0, 
    "user_location": "Providence, RI", 
    "user_name": "Hilary H.", 
    "review_text": "Party in the front, party in the back, party downstairs... It just depends on what kind of party you're in the mood for.   Looking to be seen, sip fancy cocktails and giggle with the girls (and boys) in a free photo booth? Stick with the front. Want to sulk in a corner with a few friends and nurse a beer in a mellow setting? Hit the back bar. Want to dance with somebody in the glow of low lighting? Hit the downstairs club. There is truly something for everyone at Monarch, I do declare.   I've sipped the cocktails, danced the club and slugged back a beer or two here, and every time it's been a joy and a pleasure. The staff is quick and friendly, the drinks are stiff and cold and the ambience is so inviting and comfortable I could chill all night. Plus, free photo booth. Need I say more?", 
    "review_date": "2014-03-14"
  }, 
  "7B4hsOExX3Q_PszS6emCag": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L C.", 
    "review_text": "Came here for a Direct to Earth party, which was really fun.  This place has a cool vibe.  Three stars because the dirty martini was totally undrinkable.  It may have been  dirty dishwater.", 
    "review_date": "2012-04-22"
  }, 
  "j0Etv4KhMMpowk6iI1AWqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Alberte K.", 
    "review_text": "Somewhat expensive drinks! Though their Photo Booth is free!", 
    "review_date": "2014-05-05"
  }, 
  "be_VC6SjhIABLvpGqRlMow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Veronica H.", 
    "review_text": "Came here last night and it's a decent place. On the corner of 6th &amp; Mission. There was no cover and there's a guestlist that you can add your name to on their website for free entry. We just walked in.    Spent most of the time downstairs and was only there for maybe an hour? It was pretty empty when we first got there (right before 10pm), but in the next 30-45 minutes, it got pretty full. A mixed crowd in terms of style but also more casual and laid back. Some were dancing, others just standing around. The music was a mix of lounge/downtempo but then the DJ started playing a weird mix of hits from the 60s, 70s, 80s - and not really danceable stuff for most people. I'll dance to anything so I was having fun, but my friends that are more into hip hop and top 40 were not feeling it.  So as a result, we left and went to another place.   But overall, I liked the dance floor area. It's a decent size though there's limited seating and a stage. I'm not sure how hot or crowded it could get and how that would feel, but it wasn't bad when I was there. Parking in the area is okay though you might have to circle a little or park a little further away. Inside there's a coat check for $3.   Would like to come back another time to get my groove on...", 
    "review_date": "2011-12-04"
  }, 
  "JYK0gy3YA-1jg-46cYBU_w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claudia O.", 
    "review_text": "Ron, za bartender. a.k.a. music expert. Lover of irony. I can't wait to be the guest contortionist. I guess I can wait.", 
    "review_date": "2012-01-09"
  }, 
  "cz76cbJvk-ZLVTofNff0XA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shira O.", 
    "review_text": "My 300th review goes to none other than the newest cool kid on the block.  As I enter Monarch, I feel pretty fly due to the attention paid to my girls and I from the men at the door. \"Hey, hey there beautiful ladies, so nice to see you, please come right in.\" Why thank you, I think I will.   And then wait, what is this I hear flooding the room, Wolfmother, and Cheap Sunglasses no less?! Yes, yes I think I will sit and stay a while. Then there is a free photo booth due to the owners Bday, free print outs?! Don't mind if I do Monarch, don't mind at all.   But wait, there's more! I grab a tequila concoction of sorts that tastes heavenly and plop my bum down on one of the nicely styled Victorian-esque plush couches. Then as I think I'm fairly satisfied and set on this early evening out, I look up to see this amazing acrobatic show by a woman spinning in a ring. Yow-sah! They obviously crossed their Ts and dotted their Is when working on the concept and the delivery for this place, yes, yes I would say they just about nailed it. Congrats guys, congrats indeed.", 
    "review_date": "2012-02-07"
  }, 
  "Nu0Jcb2yzMegToOpAvpOog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris F.", 
    "review_text": "Can't get enough of this place.  I've been going since it opened and it continues to impress on the cocktail list, the atmosphere, and happy hour variety.  Monday's don't Suck are a great way to start that week...  The place is huge too, 2 bars, downstairs and upstairs with two different types of room entirely.  Never get bored at Monarch.    dont forget to put on your game face when you hit up the free photo booth too!", 
    "review_date": "2012-10-16"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "Skid Row (aka Sixth Street) just got some nocturnal splendor with the arrival of Monarch, a new nighttime destination that's a bar-on-top, club-on-bottom. I was skeptical of the location, having seen at least three other concepts fail in the same space over the years, but this time they might have hit on something just right.  The upstairs bar is set against a beguiling wall art piece that resembles a monarch butterfly, or at least that was my interpretation. There are enough seats to allow for proper lounging as well, and if you're really bored you can continue walking in circles scoping the eye candy (especially on DJ nights).  If you consider the other definition of monarch, then the name could allude to a slightly ego-driven entendre towards well-made cocktails and music reigning supreme. Then again, when I found out that Tadd Cortell (who opened Cav) is one of the guys behind this place, mixed in with Chris Smith (of Om Records fame), then it's entirely possible that the future thumping dance scene down below will truly rule.", 
    "review_date": "2011-12-01"
  }, 
  "S7lxiY8zc5gBV7PwVzKThg": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Rick D.", 
    "review_text": "We rolled in with a huge group of girls that were shooting fireworks in to the air and all of the guys were freaking out and throwing money everywhere and I'm making this up. Great drinks.  Great music.  Lots of fun people.  Go here.", 
    "review_date": "2012-06-26"
  }, 
  "d1VXeXMq67_QgdvWY1tcKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark A.", 
    "review_text": "contrary to what others say, this is not the best sound system in SF (i can't imagine anyone de-throning mighty for that title). just had to get that out of the way.  that being said, this place is amazing. i'm usually not too into decor, but this is onef the most beautiful bars i've ever been in - the steampunk touch is amazing without being over the top. they have a wide variety of delicious and affordably priced cocktails, but also have all the cheap stuff that you'd expect too.   they also are always doing some type of special; i'm currently loving the free tamale tuesdays; and these aren't just any tamales, but rather tamales from the best place in SF; la palma. the $6 tecate/tequila combo makes for a fun night.  as a bar, it easily gets four stars. but what really puts it over the top is the club down stairs (and the ability to give you the decision to decide whether you want to do bar or club; most places blur that distinction). killer sound system, and great talent.  definitely a welcome addition to sixth street.", 
    "review_date": "2012-05-20"
  }, 
  "e6-y18X4plzYWwx-wTDSUA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Manav M.", 
    "review_text": "We hired Monarch Beverage Catering for our celebratory company acquisition party. Everything about the event was amazing, they went out of there way to make every step of the process easer for us, they don't do food catering, but they were able to bring in another company to take care of it for us. Not only were there drinks incredible and there staff friendly and helpful but they were also amazingly creative in helping us plan all aspects of the event, going above and beyond just the needs of the bar.   Need less to say we will be using them again, and would recommend them to anyone looking for an amazing beverage catering experience that is second to none!", 
    "review_date": "2014-04-08"
  }, 
  "pWxjxymsxNJ1r7F4ijnibQ": {
    "user_rating": 5.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Ava L.", 
    "review_text": "Monarch is absolutely great!  You get the best of both worlds here: a great nightclub with amazing sound and a nice bar that is separate from the club where you can get delicious cocktails and enjoy yourself.  The upstairs bar when you walk in is stunning with excellent drinks!  They have a   fantastic happy hour during the week where you can get a delicious beverage and unwind from your daily grind.  The downstairs is like an underground night club.  They have the best sound system in the city, FOR SURE.  I love going to dance at Monarch because they always have good music.  They book a variety of types of music on different nights throughout the week, so make sure you check whats going on there before you go.", 
    "review_date": "2012-10-21"
  }, 
  "t9b4q8MlLzwbnsELTuvrEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittany T.", 
    "review_text": "Hands down the hottest new bar and club in Sf, Monarch is a diamond in the rough, the one gem on 6th Street.  The bar upstairs has a victorian vibe, stunning furniture &amp; bar, unique art, and a fun photobooth. Great place for after work drinks and meeting up to catch up with friends.  The downstairs is a rockin nightclub with a state-of-the-art Void soundsystem.  One of the best places to catch DJs and live music to date. The staff is awesome and the talent they book is off the hook. Monarch should get 10 stars! I practically live there and my friends are moving in as well.", 
    "review_date": "2012-03-18"
  }, 
  "4yVx1735_p3EuF_dpws7zA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cole B.", 
    "review_text": "A fantastic new club brought to us by local impresarios of the local bar, music and fun scenes. In full disclosure, i am friends with the owners, and created the hand-blown glass lights above the bar downstairs. Regardless, this place is great, with easily the best soundsytem for a club of it's size in SF. They keep bringing in the best electronic acts, as well as live bands, so it will only continue to get better and better. See you on the dance floor! :)", 
    "review_date": "2012-02-11"
  }, 
  "x9ApM6vrBeOH2QqSMucIKw": {
    "user_rating": 4.0, 
    "user_location": "Ottawa, Canada", 
    "user_name": "Shawn L.", 
    "review_text": "Great space, great drinks, great people.", 
    "review_date": "2014-05-14"
  }, 
  "kW8ytVNkBq2RtLlZpc5HOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Big S.", 
    "review_text": "I love Monarch!  First off, the sound system in the downstairs is one of the best in the city.  If you want to go check out DJ's in a cozy, underground environment, this is your spot.  The staff are friendly, even the door staff smile when you walk in.  I went to a private event there last year for a company holiday party and it was off the hook!  We had a blast dancing all night and everyone was all smiles and full of cheer.", 
    "review_date": "2014-04-15"
  }, 
  "s8nkbQAlrVPfg1u4anGKtw": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Kelly S.", 
    "review_text": "Nineties spiiiiiiiiiraaaaaaaal! We dropped into the Monarch after the recommendation of none other than Ruggy J. When we walked into this dark space with funky twisted copper pipes, gorgeous tuba chandeliers and an aerialists ring, I was immediately  psyched.   Three drinks later, and some sarah mclachlan, 90s rap, live, smashing pumpkins, candlebox and gin blossoms, we were comfortably ensconced with cocktails in hand. The free photobooth and handsome bartenders are a total plus as are the really architecturally interesting elements and the super secret bathrooms   Though we walked through \"a bad part of town\" nothing felt creepy or dangerous. Same homeless dudes, different time of day. We were also in a large pack. Had it been a solo jaunt, I might have grabbed a cab. Nice cocktails, vintage furniture and an aerialist above the bar means this might just need to be a stop on your trip.", 
    "review_date": "2012-03-24"
  }, 
  "JMQkWXZw8I20MlfGPD76tw": {
    "user_rating": 4.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Alex S.", 
    "review_text": "Sound system downstairs - AAAAAAWWWWWESOOOOME !!! ! sound was loud, mega clear and soo full range   not big but pretty cool spot !", 
    "review_date": "2012-11-13"
  }, 
  "sOWJsyTsuJWE78SzZ3pbsA": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "E. B.", 
    "review_text": "As everyone else said - horrible location, simply bad, be prepared to walk 1-2 blocks feeling very unsafe.   The place itself is ok, great sound. The design of the place remind me of clubs back in the 90's - very stiff.  On top of that simply cheesy crowd selection, people who have too much money to spend or people who have no connection to the music that is playing.", 
    "review_date": "2012-08-27"
  }, 
  "f1MFQxTZAWJnRQdrouLg_A": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Matt E.", 
    "review_text": "Monarch: The friendly Schizophrenic!   That's right, it seems like depending on what day you visit, Monarch will be completely different clubs. And even within one evening, Monarch can be two completely different places, depending on your mood. I gather that if you attend on certain nights and delve into the deep recesses of its psyche (or the basement) it becomes a terrible club with awful people and awful music. But so long as you stay upstairs, Monarch is a perfectly pleasant host!  I arrived with a large group of coworkers on a random Monday night. The stereo was playing all 90s hits, which I was 85% a fan of. The bar was dark, and old and authentic. Now my memories are a bit fuzzy, but I recall a lot of wood, and boudoir-esque wallpaper. There's a huge ring hung behind the bar for an aerialist to perform. Tucked in the corner is a FREE photo booth for all your picture taking or secret making-out needs. The lighting is dim yet dramatic. Monarch is a little dirty but a lot sexy!   Now they have a large number of specialty cocktails at Monarch, but I can only speak to one, The Darkness. Do you know how much fun it is to go up to the bar and say \"i'll take The Darkness\"? It KINDA made me feel like a badass. Made with Buffalo Trace bourbon, bitters and I don't recall what else, this drink was seriously good. So good I had three of them. Everybody else seemed to love their cocktails as well, but I was NOT about to switch away from my cup of amazing.   In a city that I visit so rarely as San Francisco, I often don't want to go back to places I have already tried. However, I would gladly go back to Monarch, so long as we could stay upstairs.", 
    "review_date": "2012-03-27"
  }, 
  "fSzJO3tSVQ6DNx6jNf_fzA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Calvin W.", 
    "review_text": "Came here for a bourbon tasting event last night and it was great! The venue is a little on the smaller side but there's two floors and a dancefloor on the lower floor. The downstairs bar looks very wide and great for some manhattan-making classes they were doing!", 
    "review_date": "2013-02-22"
  }, 
  "dDdDylnedqL-xH4Zf98tig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel E.", 
    "review_text": "A Big Thanks to the management for hosting a sizable group of Yelp Elites for the Yelp Tamale Tuesday Takeover Elite Event @ Monarch on 5/8/2012.  Really gotta give you guys a High Five for allowing us to stake a claim to the entire venue for the evening!  Also you deserve Big Time credit for making a go of it there at 6th &amp; Mission . . . a bit of a tough location . . . but I think a vision of the future for what this particular vicinity of SOMA can evolve into in the coming year or three.  Monarch definitely has a head start in this area. Thanks very much for having the vision (&amp; risk tolerance) for investing in this part of SOMA!!  Monarch has a comfortable \"lounge-y\" feel to it that just seems to welcome you in and swallow you up.  There's a great bar-side vibe upstairs (which is the ground floor) . . . although the downstairs (basement) was closed off from the Yelp Event for this particular evening (I'm told there's a dance floor down there).  At the bar, the experience included a great vibe with well mixed bar drinks . . . professional bar tending . . . great tunes from an awesome sound system . . . and I'd say my Top 3 highlights for the evening . . . Number 3 . . . Free-bie photo booth Number 2 . . . Free-bie Tamales (every) Tuesday . . . and . .  Number 1 . . . Sexy, entertaining, &amp; rather scantily-clad overhead aerialist and acrobatics!", 
    "review_date": "2012-06-22"
  }, 
  "iSDS1ef0dAbh3GTEFgtskw": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "LeVanna V.", 
    "review_text": "This club is on one of the worst streets in San Francisco, it is literally 2 doors down from a 24 hour needle exchange and surrounded by sleazy hotels and people waiting to rob you, SO BE CAREFUL IN YOU COMINGS AND GOINGS. 4 Stars for their stellar lineups and excellent sound.", 
    "review_date": "2012-11-18"
  }, 
  "Rq8m7cL8SG7mYgNvOXq80w": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Marine B.", 
    "review_text": "We wanted to go there for a before party drink on a Friday night - and that wasn't the best idea. The bar was totally empty at 8.30pm!  However, the bartenders are great, prices are OK (around $6 for a bottled beer) and they have a FREE PHOTOBOOTH. I can assure you you can spend hours in there doing stupid faces - especially after your second drink.   I also heard it became quite crowded later at night, especially since they have a club downstairs - so if you are in party mood do not avoid that place, just come later!", 
    "review_date": "2013-08-24"
  }, 
  "kd767_Fi6Fabx8b-pF8nUg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Vanessa S.", 
    "review_text": "i love you monarch!", 
    "review_date": "2012-01-06"
  }, 
  "qqgeGlg1eKgrqnKLz9Veeg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Compliment Fairy F.", 
    "review_text": "The Compliment Fairy will not compliment businesses that don't treat me right. I ordered a Jack Daniels and ginger ale, and also a soda for my DD. I was charged $8. Okay, I said, and gave the bartender my credit card. He said the minimum charge was $20. Okay, I said, I'm sure between the three of us there we would meet the minimum.  Finished our first round of drinks. Ordered a second round of the same, plus one bottle of Anchor Steam. Said I was ready to close out my tab.  Was presented with a tab for $44. Hmm, that didn't seem quite right, so I politely pointed out the error.   Was asked what I had. Told the bartender: Two Jack and ginger ales, two plain 7-Ups, one bottle of Anchor Steam.  It seems to me that the correct handling of this situation would have been to apologize for the error, and fix it. Instead, what I got from the bartender was, \"By MY calculations, that seems right, but what do YOU think it should be?\"  Hmm. By MY calculations, if one Jack and ginger ale cost $8, then TWO Jack and ginger ales should cost $16. It was Saturday night so there was no happy hour pricing or anything like that. That leaves one bottle of beer unaccounted for. $44 - $16 = $28.  By MY calculations, I don't think I should be paying TWENTY-EIGHT FREAKING DOLLARS FOR ONE FREAKING BOTTLE OF ANCHOR STEAM!  I calmly asked how much the beer was. The bartender said it was $5. I calmly said that by MY calculations I owed $21.  He put $21 on my card. I did not leave any tip. Mind you, that wasn't for the initial error; it was for implying I was either:  a) stupid b) a liar c) a stupid liar  Well, I'll tell you what: MY calculations made more sense even after I'd had two admittedly strong drinks. I'll tell you what else: by MY calculations, not coming back here again.  If you do come here, I recommend that you pay with cash. They've proven to me that you really have to watch them.", 
    "review_date": "2012-03-13"
  }, 
  "gji92ao5NAIrb3akKyqTZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "Great sound. Two floors, upstairs and downstairs bar. The night I went dancing/dj were only on the bottom level...it's nice to have a well lit place (top floor/entry level) to relax and get away from the raucous. A lot of great acts/djs have performed at this spot already, it's centrally located, hip-friendly-mellow crowd ..", 
    "review_date": "2012-07-30"
  }, 
  "BP_8Wpee-Wyu4dgFs8pqYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Max H.", 
    "review_text": "I went here on a Friday night to see two neo-80s (?) bands: FM Attack and French Horn Rebellion. I spent all of my time downstairs on the dance floor. Thoughts:  * The first band didn't start playing until ~11:30 (originally scheduled for 9:30, not sure if that's typical) * Downstairs men's bathroom stall has no door. * Drinks are on the stronger side. * Sound system was great but LOUD! Earplugs recommended. * The dance floor is pretty small, but filled up to the right capacity around midnight. * The crowd had a better gender ratio than I expected for SF, at least earlier in the night!", 
    "review_date": "2013-02-17"
  }, 
  "_48hHzhjD7wyks1ZWkqkww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjami N.", 
    "review_text": "Ever since I was thirteen I've been living with an alien slug in my brain. People ask me if I'm sure about this, as if I'm not engaging in cerebral warfare with it every single day. It's like this: I'll have an impulsive thought, like to GoPro myself overturning my boss' desk in his face, and then I'll suppress it. I just haven't figured out if the parasite is the impulsive thoughts or the cautious ones.  Anyway, when I'm freed of it I'll be able to live my life, and I know you can kill a brain slug by exposing it to high-pitched frequencies. I'm giving Monarch 5 stars for providing me that opportunity, every Tuesday night, with their experimental drone/screech/modemcore nights.  The one time I went, I ditched before the slug liquified, but I could feel its turmoil as soon as I stepped through the door. The venue was full of the 30-year-old equivalent of those 15-year-old rave chicks, and the 22-year-old equivalent of those thousand-year-old vampire pitlords. There were wolfmen everywhere, but they stuck to their human form. Everyone was trying to kill their parasite with glasses of poison and loud noises and twitchy dances. I'll definitely try it out here again.", 
    "review_date": "2014-01-26"
  }, 
  "jhemJPw55YCm4eKOalcQqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracy P.", 
    "review_text": "Monarch is as good as it gets in terms of bar-tastic action. Classy, cool, sophisticated, those are all adjectives that would be used when describing Monarch. Mix the amazing sound system, with out of this world drinks, friendly staff and beautiful ladies spinning in the hoop/ random performers with the kind of SF kookiness we've come to love and adore and you have yourself the best cocktail in town.  From here on out, Monarch is my boyfriend and I like it like that.", 
    "review_date": "2013-12-15"
  }, 
  "6ePMnTjFD4VGlknfdVLrRA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela Z.", 
    "review_text": "i've never had a bartender yell at me and give me attitude before. all we were trying to do was explain that we transferred my friend's drink from her card to my card with the other bartender and he got all frustrated and yelled at us. thanks bearded man bartender at monarch. what a buzzkill :(", 
    "review_date": "2013-01-23"
  }, 
  "t3V-JbUUJ81sHZnPmm48Bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nasim K.", 
    "review_text": "Monarch is definitely the best venue in San Francisco for private events, event spacing, company or corporate events, private parties and company holiday parties!!  I've held a number of private party there and I've been extremely happy with the management, bartenders and cocktails. They really have a nice grasp on accommodating to big private parties and am looking forward to the next event I will be throwing there. Thanks again Monarch for being so amazing!!", 
    "review_date": "2014-04-18"
  }, 
  "XSBWy9YYt5ekyez790Jyig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Van-Anh N.", 
    "review_text": "We came here on pride weekend so it's very different but one of the owners came out to invite us in.  Had a drink upstairs first with a great DJ playing. House music or deep house would be how I'd describe the place. Upstairsx lounges and regal feeling mirrors with great bartenders. Downstairs is Monarch and it was packed with serious underground deep house music going.", 
    "review_date": "2014-07-12"
  }, 
  "yqApI093zmDIx5TFcVeuXg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Riza D.", 
    "review_text": "Good looking bartenders!", 
    "review_date": "2014-03-11"
  }, 
  "WNtrH0DsUK3OX6thvzeOLA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny Y.", 
    "review_text": "Monarch is an awesome club!  The sound system is amazing, you are guaranteed to have a great time dancing, and the bartenders are HOT!  The only downside is that since it is new, it is pretty much impossible to get a cab when you leave, but hopefully this will change as time goes on.", 
    "review_date": "2012-01-07"
  }, 
  "e4s6HELfxmi01VJQvcjlEA": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Jill R.", 
    "review_text": "great sound system, acoustics are great and great place to dance but 3 out of the 4 times I have been here were down right shitty. The first time i feel down the stair well on the far right hand side when you walk through two doors then you come to a curtain that looks down a stair well that looks like a scene out of a freddy krugar movie in the boiling room( they need my feng shui services) it was not well lit and there was no glow in the dark paint or any paint to tell you there were more steps than I could see and there were huge slippery gashes in the steps that looks like it got knicked off and chipped off by a wrecking ball. The second time I got berated by the black security guard I forgot his name for standing infront of the club waiting for a cab while also being told to buy more drinks or leave. So there i was trying to leave and then he told me to get off my cell phone because he knows that neighborhood and its unsafe for me to be on the cell phone...but then tells me to go down the street because i was blocking the entrance and down the street was more unsafe to wait for a cab if you ask me. I need to go back and find out his name because he is on my shit list. Way shitty and unprofessional for business and clientele. I will only go back there if my friend is djing again or to find out the security guards name. How are you going to act like you care for the customers safety one minute and then tell her to go down the street the next (and mind you I wasn't even smoking!) and not even hail a cab for her....totally rude and unprofessional.", 
    "review_date": "2012-05-16"
  }, 
  "1d2OhcrENm38_brxwpMEzg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric T.", 
    "review_text": "Great place and good drinks. Bad business practices. $30 bill (including tip) ended up being $40 on my bank statement. I disputed it with my CC but this type of shady behavior shows no respect for your customers. I have hard copy receipts so I'm not worried about it.", 
    "review_date": "2014-02-09"
  }, 
  "pou3BbKsIozfH50rxmnMew": {
    "user_rating": 2.0, 
    "user_location": "Tampa, FL", 
    "user_name": "Brett N.", 
    "review_text": "Why 2 stars?  Because I couldn't find anything redeeming about it.     ---   ---   ---  I know that this review will be jaded because a house music club just isn't my thing.  But here's why Monarch was one of my least favorite places I've visited in San Francisco...  A group of three of us were meeting up with some co-workers at Monarch one evening.  I labored the decision: A) hit the bricks early for a healthy night of REM sleep  -OR- B) walk across town to some club and be a social butterfly.  What do we all choose, every single time......  Upon arrival, I think, \"boy howdy do I ever need to drown my sorrows away, let's head to the bar and hope that they have a good beer selection...\"  Nope.  Just a  collection of budmilcoors, blah blah blah.  Bad music, bad beer and a cover charge.  0 for 3.  On top of it all, I left my ID there and to go back the next day.  Not Monarch's fault, but it piled on to my cynicism for the evening.", 
    "review_date": "2012-04-20"
  }, 
  "zpWizDgUk4-rQJXdjiBY1w": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Christina L.", 
    "review_text": "This place is like an underground club that is the perfect amount of crowdedness for me. The crowd did seem a bit older, but who cares if you're going with friends?  COAT CHECK $3 for 1 jacket, $6 if you want to hang a crapload of other things on one hanger. COVER CHARGE TO GO DOWNSTAIRS -- I don't remember what it was. Bring yo cash.  WHOA, Monarch. It's such a cool bar. The upstairs (level you walk in) had such a edgy, trendy vibe that felt great and from there we knew the night was going to be awesome. You walk into a fancy schmancy room where you can romance your date on the couches upstairs or head downstairs to the more crowded area and dance like no one is watching! I LOVED it. The music and DJs were great. My group had an amazing time, and we're all in our 20s.  Cocktails had the perfect amount of alcohol for me, but it wasn't TOO strong. I would advise the bar tender to put in more alcohol if you want a stronger drink.  If I ever found my way to this place again, I'd be back.", 
    "review_date": "2012-05-27"
  }, 
  "JvZxZvLHI16ytfWdPBBONw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ana F.", 
    "review_text": "Love this spot! The atmosphere is relaxed, the music is great and the drinks are delicious. what more could you ask for?", 
    "review_date": "2013-02-12"
  }, 
  "7ryda1dI2KwSbtB1VRjzvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vic A.", 
    "review_text": "I love the fact that they have such a wide selection at the bar. I asked for anything spicy and the lovely bartender lady offered me a habanero margarita! I was like ooooo hell ya! No cover for upstairs bar but thats okay cause if the music (DJ on site) of what they were playing upstairs is downstairs...no thank you. Great vibes all around from of the bar and in the back. The lighting is dim but not too dark.  Seating available are vintage couches, bar tables and stools and booths.  Opened areas to mingle but not opened enough to dance.  4 stars because the back bar doesn't offer many options so you have to walk to the front bar.", 
    "review_date": "2014-02-08"
  }, 
  "U9yWtQO_0LPjtaU9jN0JsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean K.", 
    "review_text": "I admit it, I'm too old for clubbing. I don't go out on weekends and I don't stay out past midnight. So it's not surprising that I've never heard of, let alone been to Monarch until I got a ScoutMob email forwarded from a friend about \"Beats for Lunch\" (<a href=\"/redir?url=http%3A%2F%2Fwww.sunsetpromotions.com%2Fevent%2F144147%2F&amp;s=fe7add1906b60b9bfb4007406298e7b0d05819490dfcb7ab6af9a019bd9c8ba9\" rel=\"nofollow\" target=\"_blank\">sunsetpromotions.com/eve…</a>).   The concept behind \"Beats for Lunch\" is that you go clubbing over your lunch break instead of just sitting at your cube. On the way out you grab the bag lunch provided.   I won't go into details but props to Monarch for hosting this event every month. The upstairs (ground floor) is a laid back bar. Downstairs in the basement past a heavy curtain is the club.   I know that Monarch is supposed to have an awesome sound system. I'm not that familiar with sound systems but I can say in my inexpert opinion that the music sounded good without resorting to being body-shaking loud which I appreciated. Is that what the technology is supposed to do? I liked how my ears weren't ringing afterwards since I had to go back to work.  The DJ was fun and everyone had a great time.", 
    "review_date": "2012-09-13"
  }, 
  "eIa4QJXp5ZNmuFORnuPvDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ziyan C.", 
    "review_text": "Get the rickshaw, an amazing grapefruit cocktail. It's got a thicker texture, has that slight bitterness of grapefruit along with tangy/tart flavors, and was loved by all.  There's this new library-esque room in the back - good for extra space, an extra bar, but it closes around 1am.  The basement had a different electronic DJ (Saturday, Sept 14th) with a separate cover, and since we were staying for just a little bit we opted out of that part.  The upstairs was still a lot of fun because there was a DJ doing hip hop remixes of Beatles classics. Not too crowded, but still a good amount of people dancing or hanging around.", 
    "review_date": "2013-09-18"
  }, 
  "2tOQ2Js0SxHsRdxFfwL-VQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miranda b.", 
    "review_text": "My favorite place in the neighborhood, whether it's after work or a Saturday night.  The downstairs dance floor is always a good time and they often have special events like Beats For Lunch and sushi night.  I've never had a problem with it being too crowded and the staff has always been friendly.  If you think it's too crowded you should go to the Sunset or the Richmond for a good time.  Or Daly City.", 
    "review_date": "2013-03-11"
  }, 
  "HFkqjlom9cdUFC-2SHsrFA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kyle F.", 
    "review_text": "First I thought it was just a normal bar, but I started to notice ppl flocking into the stairway going down to an underground club! we were surprised seeing hot gals and dudes in here underground just to stay away from the homeless and mean ppl on the street.. the cover is just 10, and you get perfect-looking bartender to serve you, why not ppl.", 
    "review_date": "2012-07-30"
  }, 
  "cQ9AqVycRdxY5K2kHK1RRQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brenda C.", 
    "review_text": "They say \"location! location! location!\" and unfortunately, this place doesn't fall into the best one. Which is probably why I just stumbled on it. But I'm glad I did, because it is definitely what you'd call a \"diamond in the rough\" (and boy is 6th/Mission rough)...   Also, not too pricey for drinks, they know how to make some good cocktails like real mixologists should. I'm pretty sure the bartender I saw working last night (Thursday) has arms of steel from crushing all that fruit and mint. He crushed like he meant it, which I had to applaud with a nice tip.   As for the music/club venue: it's in the \"basement\"--which usually isn't the best sign (I've been to LiPo, that place is where you go to leave part of your soul.)  We came here to see MoshiAudio's free show with Loquat playing a live set. And at first, you're taken aback: will the lead singer's voice even carry in this basement venue? But then the first note is hit and you realize, \"holy shit. this place has badass sound!\" As it should, since it was just voted by 7x7 as the best sound. It holds up to its rep.   Anyway...with good drinks, and bartenders that serve without attitude, and a decent sound and venue to shake my ass, I'll definitely be stumbling back (and out of) this place again.", 
    "review_date": "2012-06-15"
  }, 
  "PebYOhzVTAmkHMytVD0Z_A": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Celine G.", 
    "review_text": "We put our name on a reservation list that promised we could get in to the downstairs lounge free if we came before a certain time in the evening.  After ordering and enjoying some drinks at the bar upstairs we get down and the guy letting people in makes us pay a $20 (If my memory serves me correctly) cash-only cover charge. He said the list is just to get an idea of how many people will show up. That's BS, my friend knows what she read.  We had a better time a couple blocks away just hanging out at the apartment of some people we met at the bar than downstairs in the club.  Management needs to get ahold of these inconsistencies before they put more people off.", 
    "review_date": "2014-11-11"
  }, 
  "RFwqMJKwc46SW-fCwnvW6w": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "David C.", 
    "review_text": "TL;DR: A grown up's bar. Mixed crowd. Good drinks, good spot for both talking up strangers (upstairs) and dancing your face off (downstairs).  Pro-tip: there is cover for the dance floor downstairs, but they take it downstairs. It varies but the night I went, it was $5 before 11, $15 after. Unfortunately when I got into the bar around 10:40, I thought I was ok. We went down to the dance floor at 11:05 and had to pay the extra $10. C'est la vie. I recommend if you come early, head downstairs, pay, get a stamp, and then come hang out upstairs for a bit.  I think concerns about leaving your car in the neighborhood are overblown. I parked on 5th and Mission and walked a block up and felt perfectly safe. Full disclosure, it's a main road and they start sweeping at 2 AM, and I'm a bigger guy so I tend not to worry too much about my surroundings.  Drinks are strong and reasonable. My date got two vodka tonics and a mojito from different bars, all reasonably strong. I got a sidecar and could definitely taste the Marnier. They don't gyp you.  There was a very eclectic crowd, people from all backgrounds and \"scenes\", which I really liked. I'm too used to being surrounded by a pretty monolithic Asian crowd, so it was nice seeing different faces around.  CHECK OUT WHO IS PLAYING THE NIGHT YOU GO. The nightclub downstairs was stuffy and hot, but still fun. The DJ they had spinning was terrible, but in all fairness I'm not a big house guy. Too much monotonous UNTZ UNTZ UNTZ. I wasn't alone as I saw a lot of people sort of standing around, unsure how of how to dance to the music. I can tell that with the right DJ, the place would be popping.  The DJ upstairs was actually pretty awesome, mixing in top 40s with old timey Motown with his own little flair. I wish he'd been running the show downstairs.  I'm altogether too used to going to Vegas-y clubs like Grand and finding a place that didn't suck was awesome. Definitely coming back.", 
    "review_date": "2012-12-22"
  }, 
  "2TXi4leSwlMY8rmSKol9Hg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leena B.", 
    "review_text": "I love this bar and I love that it's across the street from my house! I can literally roll home after those strong drinks that they make! Woah! The drinks are \"cry in the bathroom \" strong! I loved it! They also have a dance floor downstairs and I think they only charge cover after a certain time. The dance floor is fun and I think I went on Gay night which was even more fun! #bestdancers! The music selection is fabulous! None of that Nicki Minaj shizz! And they also have this living room set up back near the bar upstairs where you can just lounge with your buddy while drinking a cocktail...so relaxing!", 
    "review_date": "2013-12-14"
  }, 
  "VqOVUpvSDzc2rNSa0abYSg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "John B.", 
    "review_text": "Chill vibes. Great bartending staff and a badass sound system in the basement. Wear comfortable shoes and loose clothing cause you'll be shaking your booty here and sweating so much you need new pants. Wear moisture wicking clothing here.", 
    "review_date": "2014-03-04"
  }, 
  "eK_KHtMiHKbgTfn5FSNN7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilys S.", 
    "review_text": "Classy charming club + bar + mini performance love it. It's a classy, well-dressed, fashionable crowd here. People are friendly, hip, and very modern. Kind of reminded me of a Hunger Games fashion style minus the futuristic part. Cover charges are ridiculous though $20 Saturday night (for the dance floor. Nothing at the upstairs bar), but heard it is a fully functional bar downstairs. We sat upstairs at the counter, sipped some classy nice cocktails. Free water and self pour! The alcohol is generous, definitely dry and occasionally bitter. Not to mention the performance ring at the ceiling and right above the counter. Quite a neat setup. Perfect for people watching too.", 
    "review_date": "2013-12-30"
  }, 
  "RLWwM7aInJxNoOPKuvAevA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Cool spot.  Chill vibe. I don't know why but my first impression walking into a lounge or a bar is the bouncers.  The bouncers here are always polite and professional.  Bartenders are friendly and attentive. Never have to wait more than a minute or two to be served.", 
    "review_date": "2014-08-03"
  }, 
  "hVyXowHxeHXoIZjctOmKJg": {
    "user_rating": 5.0, 
    "user_location": "Hollywood, FL", 
    "user_name": "Jo A.", 
    "review_text": "The more I come to this place, the more I love coming here.  It's the best sound system in the city, the best underground music, fun party people, two floors of awesomeness and I love every beat.  Since I got to the city I'm there almost twice a week and if you haven't been then get there because you're missing out.", 
    "review_date": "2012-09-28"
  }, 
  "9frzZwrSXzDcGzSpEk6D0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mckenzie E.", 
    "review_text": "* Good music * People who ain't afraid to dance * If you're a girl, it's good to bring a friend so you don't have to walk alone to the venue * I've never been disappointed with the music or turnout", 
    "review_date": "2013-05-28"
  }, 
  "Jp2PbHR1BpFBEdkUvSCmRQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amir M.", 
    "review_text": "This place is A-Ok.   It's not for locals. Definitely for out of town (eastbay/southbay) club rats, and the bouncers cater to just that style of dress shoes on trashy feet kind of patrons.   But other than the bouncers, I really like this place for dancing.", 
    "review_date": "2014-02-12"
  }, 
  "qyenO1MIwKkEL9SIQnxFyQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "William M.", 
    "review_text": "Easily one of My favorite spots when visiting San Francisco! Custom void sound system down stairs and always top quality music. The bar upstairs has some of the nicest bar tenders who have always whipped up good drinks + Cocktails!! If you are looking for a place to bring a party, enjoy good vibes and listen to good music..Monarch is easily always a winner.   If you are in San Francisco, GO CHECK THIS PLACE OUT!", 
    "review_date": "2015-01-05"
  }, 
  "GXn4ZsasLKh0qZ5g3nIqcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "They say location, location, location is key to running a successful business. So what the hell is up with this place then? All that's really around here is XXX movie stores and crackheads, so how do they survive? The bar runs on pure class, apparently. The downstairs is a great place to see an intimate music act and (I could be wrong) but feels nicely remodeled with an amazing sound system. The upstairs has the nicest bartenders and bouncers despite having such a, well, unique set of clientele.   It's just off the safer beaten path, but it's worth the trek and the neighborhood's bark is worse than it's bite.", 
    "review_date": "2012-08-17"
  }, 
  "EH1FoiCPY6eKf3WdV4M-yw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beau B.", 
    "review_text": "Best staff, best drinks, best sound. Best times!  You can't go wrong.", 
    "review_date": "2014-04-04"
  }, 
  "4UkA6Sjw-RE-RuZQ1MIcTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tuesday C.", 
    "review_text": "Wohoo!  This is the place if you are looking to get your techno fix and dance on! Upstairs is an artsy/classy bar worth a visit. Downstairs is the party! Great great great sound system! Clean, loud and fun!  Dress up and get your groove on!", 
    "review_date": "2012-01-02"
  }, 
  "JseBksW8DVL596kJ18GGpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gretchen T.", 
    "review_text": "Professional all the way. With a dream team of collaborators behind it and with decades of experience in the SF club scene between them, you'd expect nothing less, but I was still awed by the homey yet red-hot result. Crawl in like an overworked caterpillar, fly out like a reborn butterfly.  (As for the location, no biggie, though maybe cab if you can. One of the staff VERY sweetly hailed one for me even.)", 
    "review_date": "2012-05-16"
  }, 
  "rS4OEY7fWDZG_JuJjR9HWg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle L.", 
    "review_text": "The owners of Monarch have definitely brought a space to the City that is a step above. Intimate, moody and chic, the club has made a name for itself as THE prime spot to go for quality sound, top-notch DJ's, and shoulder-rubbing with the beautiful people of SF. On the occasions that you get a crowd of genuine music lovers, or just cool people here for more than getting wasted and laid, it's a really great time. Monarch sports a world-class sound system, friendly bartenders, wonderfully eclectic and inspiring decor, a photo boof!, and fantastic drinks. No, they aren't cheap, but that's simply the price you pay for a visit to one of the top clubs in any city.  But... I have to knock a star off for the douchebag factor that overruns Monarch on weekends. The club has blown up, lately attracting Marina &amp; Bridge-and-Tunnel types with some seriously entitled attitudes; I've experienced so much pushing/shoving (with no excuse me or sorry), sexual harassment, and other generally belligerent behavior that it's a huge turnoff--to the point where I've stopping coming at peak times. This is to be expected of any great establishment, but it is what it is. You've been warned.  If you're friendly, love to dance, and respectful of people around you, come out on a weeknight, and toast to the awesomeness of our city and those who add to it with places like Monarch!", 
    "review_date": "2014-08-22"
  }, 
  "S6t6HZcdKx_z2ZGEcSxfTw": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Nyx R.", 
    "review_text": "Did not check out the dance floor, but the bartender upstairs was super cool and the cocktails were great. About $10 per cocktail and $5 for a beer. Not terrible but not the cheapest either. A cool lounge place and a good crew.", 
    "review_date": "2012-10-21"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "Monarch is great for the following people:  - Lovers of craft cocktails - Lovers of beautiful lounges - Lovers of dance or live music - Lovers of photobooths  Monarch is bad for the following people:  - Alcoholics with no self-control - People who don't like fun - People who think shadows follow them around because they touch themselves at night  Okay, if you're the last one, you'll probably have fun at Monarch too...", 
    "review_date": "2013-11-19"
  }, 
  "L2uIVVgoODNLj16V2U1eCg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aiden B.", 
    "review_text": "This is the work of some of my favorite night-spot industry people ever, and it continues their legacy of properness without pretense.  Beautiful space, awesome vibe and killer sound system. Had an absolutely great time on NYE (and I typically hate NYE, as a rule).   Much props to kick-ass bartenders Moe and Beth. They will take solid care of your refreshment needs. Check out Tamale Tuesday for some cheap deliciousness!  It's a bit in the weeds (we all know 6th and Mission isn't exactly the nicest spot in town), but it's also on the way home from the FiDi and a block of MUNI. Put on your big boy/girl panties and walk a block. You won't get shivved, you'll probably just get hit up for a quarter.  I'm a fan. Nicely done.", 
    "review_date": "2012-01-20"
  }, 
  "NNL1zLTP2J_SOputgoPYeQ": {
    "user_rating": 4.0, 
    "user_location": "Buffalo, NY", 
    "user_name": "Alex L.", 
    "review_text": "My favorite place to dance and socialize in San Francisco.   It was just so fun. The whole experience. Walking down a sketchy street into a lounge/bar that itself has split personalities.  There's a classy bar in the back with fancy drinks, a more divey bar out in the front and a sweaty dance floor down below.  I enjoyed chilling in the back bar and moving around the place. There are some couches out back and front, great if you want to transition to a more laid back lounge environment. There were strange colored drawings of naked people plastered through out the bar (not that naked people are inherently strange, but these drawings looked like something a 14 year old boy would sketch), which were a fun conversation-piece.  The DJ in between the two bars (where I suppose the aerialists were supposed to be, but they were not present on Wednesdays) spun some fun low-key house music and by midnight, the dance floor was in full swing. Although, when when we started dancing around 11pm...we were the only 3 people on the dance floor. Not sure if upstairs dancing would have happened on a Wednesday night had we not started it.  I wanted to go downstairs and check it out, but I wasn't keen on paying a cover fee. The one gripe I had was one of the employees wouldn't let me go downstairs to check it out for a few minutes to see if I enjoyed it. I didn't want to pay a cover for an environment that I don't even know, let alone a band that I've never heard of. I just wanted to go and see what the vibe was like downstairs before I committed to paying a cover charge, but she wouldn't budge. Later on, when the security switched...I asked the other guy and he let me go down and see, which was nice. I didn't end up going downstairs.  Anyway, this is a fun place. It does have a split personality, but that's accepted in places like San Francisco. It's a mix of classy, divey, dancey, electronic...but best of all: it's a super fun environment to hang out with friends or meet new people.", 
    "review_date": "2014-05-05"
  }, 
  "-NQXpKDDwHIK3y3bNR70EQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James G.", 
    "review_text": "Been waiting for another premier house music spot to open up in SF after Triple Crown closed in 2011...Monarch IS IT.  Excellent sound system.  Great layout both upstairs and downstairs.  Everyone who works there has been super polite and nice to deal with.  Having been there a few times already, I definitely intend to make this a regular stop for the foreseeable future.  And a good club isn't a great club unless they have great talent playing regularly and in the short time this place has been open, the talent has been nothing short of amazing.  I'll be a regular!", 
    "review_date": "2012-01-06"
  }, 
  "5AgMe_UtUSugOQ4_GxpUFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karina L.", 
    "review_text": "Beatiful place, did not like the music.", 
    "review_date": "2013-04-12"
  }, 
  "Nq31P668CK-_3GyHNgb77g": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Stephanie S.", 
    "review_text": "omg the free photo booth. we had a freaking BLAST with that thing. tip on getting the best picture: pack as many people in as possible, and the last picture is the one that shows up the biggest on your print-out, so make that one count! my fridge is now plastered with pictures of me and my friends looking pretty plastered ourselves.  love the drink specials ($4 whiskey shots, $4 fernet), both which go great with ginger beer. i would definitely come back to watch someone dance on that hula hoop above the bar. my group of 6 or so girls had a great time running around this place on a monday night.   it's kinda grundgy, kinda punky, kinda has a bad attitude, but under it all, it's stylish, glam, and very fun.", 
    "review_date": "2012-09-26"
  }, 
  "VxMu17sXBq6qVZwzvjVAVA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "David D.", 
    "review_text": "So loving this place. The drinks are beyond amazing and Moe is by far the best bartender in SF. He can make anything and make it well. The dance floor downstairs is huge and is what most bars in this city lack. An who doesn't love a photo booth in a bar?!?   Def hit this place up. Well worth multiple visits.", 
    "review_date": "2012-03-01"
  }, 
  "mun8HtTyHk8RKpic5cbB8Q": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Ellie B.", 
    "review_text": "I dont know why there's so many negative reviews on this place. do you people NOT realize this is a CLUB!?!  1. it's going to get hot from; 2. all the crowded people; 3. little ventilation, but I DID find a spot on the dance floor that had air flowing in from outside which was like AC to me, a God send! minus the fact that it smelled like smoke every so often.  bartenders were nice, bouncers were nice.  some idiot who was about to start a fist fight with my husband on the dance floor got escorted out of the place very fast, THANK YOU guys who work at Monarch that took care of that.   great experience, Greg Wilson blew the house down last night! :)", 
    "review_date": "2013-03-16"
  }, 
  "s6z34Vp9pyyk0NYKrzs6wQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pablo G.", 
    "review_text": "Yelpers are hilarious group of people.  I decided to take my time and review this place because some of these people feel so entitled to everything the record has to be put straight.  Upstairs: Perks: super \"chic\" bar.  The prices might be \"high\" but you get what you pay for, REAL cocktails that are unique in the city [This is not a normal bar or a dive bar... go to OMG down the street]. Awesome decorations, good music, great scenery.  Also, FREE PHOTOBOOTH!!  Just be careful!  People can see your pictures outside :)  The Happy Hour is dope, the bar staff is amazing, the cocktails are DELICIOUS, and every day there is a special event going on for different drinks, new drinks, or awesome food. Cons: Can get really crowded (if you aren't one for crowds) Music can get a little loud and anti-loungy. And that's about it.  Downstairs: Perks: Oh where to start.  Audiophiles will LOVE the VOID ACOUSTIC AIR MOTIONS V2 that they have.  It is the cleanest most neutral sounding sound system in SF.  None of the levels ever overwhelm each other and the speakers are always tweaked to perfection.  Standing in the middle sounds amazing.  Talent is always on point.  They bring in the best in underground music (sorry Tiesto, Ke$ha, Trap Expert Taylor Swift, or Skrillex don't come) the world has to offer.  It's predominantly House and its sub genres, but they have dubstep/trap on Tuesdays and some tech nights.  Mondays are live music. he bar staff is awesome and, my god, are they attractive as [censored]. Like DAMN.  Its a small and intimate setting with great music. Cons: Its a small and intimate space, so if you don't like small places with a lot of people, it can be overwhelming.  That's it.  If you are worried about paying $20 or $30 at the door... buy pre-sale tickets... DUH!  I have gone to normal clubs and had to pay $20 to get in for a SF based, top 40 DJ (playing the same kind of terrible music I hear on the radio) on a terrible sound system and dealing with a whole lot of douche nozzles..  Also the security staff here is awesome as long as you aren't an a-hole.  I've been too drunk and smoked too close to the door and all they say is \"please sir, can you stand by the wall past the tree\"   Monarch IS the best club in sf. Haters gonna hate cause Yelp gives them a place to feel like their opinion is important.  They are just like the magazines that freak out if a celebrity gains 5 pounds.  Get a life.", 
    "review_date": "2013-05-01"
  }, 
  "HXOfPXPMvdXNpQ_l0RRjKw": {
    "user_rating": 4.0, 
    "user_location": "Midvale, UT", 
    "user_name": "Jeffrey S.", 
    "review_text": "Free photo booth. So that's how I spent my evening. Seriously, there's not much in bars for non-drinkers (this is amazing news, I know) but with a free photo booth where you can grab your pals and haul them in to snap a pic or two went a long way to beckoning me back to Monarch. Also, the copper bended pipes coming out of the double tuba fixture was something kinda special as well.  Downstairs there was dancing and random projected old timey movies. Seems to be the thing now, and while I wasn't totally jamming on the downstairs vibe, it's probably much jammy-er when there are more bodies bouncing to the beat.   A word to the wise. Or rather, unwise. The cops stopped a group of my cohorts on the way to the bar and told them not to turn down 6th. This little stretch of road ain't exactly \"hang around in a dark alley\" kind of neighborhood, so if you're feeling sketched by the whole thing it may be worth cabbing it.", 
    "review_date": "2012-03-24"
  }, 
  "zYIbOOlHXuSSqthrn8YQOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "This was the last stop for a 21st birthday party I planned, and my group of 28 absolutely loved the venue.  Christy is in charge of the group events and VIP bottle services. She's so nice and extremely organized. I had a great time planning and reserving a spot for my group with her. All you have to do is either call or even e-mail her and she'll get back to you asap.  If you are planning an event at this venue, make sure to inform them about a party bus (if you are using one) or have your party bus drop you off a few blocks away. The bouncers wouldn't even talk to me or any of my group members when we first arrived because our bus was there. However, when I was emailing Christy, I let her know that we did have a large vehicle and had permission to enter despite this! This is a HUGE TIP for any event planners out there.  The club up top was pretty crowded (this is around 10-11 pm), but the club was pretty spaced out. There were a lot of people there, don't get me wrong, but the lights were cool and everyone was just kinda jammin' out on their own. The band that played (... Valentine?) was awesome. The sound system, as expected, was amazing (I read reviews on it beforehand).  Overall, the night turned out great and I am so happy I chose Monarch as a stop. I found it on the site: <a href=\"/redir?url=http%3A%2F%2Fsosh.com&amp;s=04a2fc502da60b1629cfac7d6c6d550add1119c04870a29139018ff0390774b3\" rel=\"nofollow\" target=\"_blank\">sosh.com</a>.   Hope this was helpful!", 
    "review_date": "2012-07-17"
  }, 
  "SxBab_2kwGUQCYW7wDes1A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carlos S.", 
    "review_text": "Sound quality here is by far the best in San Francisco. Nice vibe!", 
    "review_date": "2013-06-01"
  }, 
  "UE-rXhA8njNnADFkDA3EuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Inigo M.", 
    "review_text": "Intimate, classy, unlike its surroundings. Basement dance floor, strictly house on a Saturday night.", 
    "review_date": "2012-04-21"
  }, 
  "FUpXGHoRcHfba4w0YnhsxA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Derek S.", 
    "review_text": "Monarch has the best cocktails, served up by an amazing bar staff.  Happy hour specials are awesome, in particular, free tamales on Tuesday with a drink order!  Free photo booth is good times too!  When I need happy hour, this bar is my spot.", 
    "review_date": "2012-10-15"
  }, 
  "fHS0bQ-l5rHME_xXKQSYXQ": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Kevin N.", 
    "review_text": "Getting here is the toughest part: wandering through the badlands of San Francisco, having never been to Monarch, I was more than a little concerned that if we didn't end up some sort of statistic on the way over that perhaps our final destination might do us in. What a delightful surprise, then, was Monarch, a classic space now envisioned as a rather hipster-forward cocktail bar up top, with dance space on the floor downstairs.   It's the little touches that make this place work well, from the performance hoop dangling in the negative space beyond the bar to the hand-crafted libations they're spinning here. I've not spent any time in the dance club below, but then again, that's not really my bag. What I did do was settle up against the bar for some lively chatter and a cold one or two. And in a pinch, that worked out just fine.", 
    "review_date": "2012-03-26"
  }, 
  "eRYd9H81wIj_0IfiXgPs-Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M F.", 
    "review_text": "my phone was stolen from the lounge area upstairs. i realized it rather quickly and when i tried calling my number, the phone had already been turned off. the upstairs bar staff/security were not helpful or compassionate about the loss. i realize there's often not much they can do but the downstairs folks were a lot friendlier and at least offered to keep an eye out for it and gave me a number to call the next day.  Since my phone was stolen, I've been hearing from others that petty theft has become quite a problem at Monarch. I guess it's time to wear fanny packs in the front, if you go here.", 
    "review_date": "2013-06-11"
  }, 
  "cnvcbaNujbPHCxzGyCyq0w": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lisa P.", 
    "review_text": "Went to Monarch on Friday to get my house music fix on. I must admit, although this venue is small, their sound system is thee bomb! Drinks were decent, the crowd was friendly, but it got mad crowded and cramped by midnight. If it wasn't for their lame, hot tempered, meat head security guards who constantly harassed people outside when folks were trying to chill and cool off, I would be more inclined to spend my money here again.", 
    "review_date": "2013-03-03"
  }, 
  "14nzk-Yf6eVDdhB5A43c8g": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nan T.", 
    "review_text": "Awesome happy hour and great selection of beers. Bartenders are friendly. They also had awesome 80s on", 
    "review_date": "2015-01-24"
  }, 
  "WFxg6Yma8gz3RAk1x-v8FQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara S.", 
    "review_text": "wow this place is sexy sexy sexy. you roll into a steampunk victorian (as they call it?) lounge with a huge horned instrument chandelier, couches and a long antique bar. A big cutout behind the bar wall showcases an acrobat (yes!!) twirling and bending in godly poses.   but here's the best part. you order a cocktail and take in the lounge, the mellow DJ spinning. your friends arrive. then..  you DECIDE if you want to go to the club below. yup, no walking cold into a pumping music scene which may be way off the mark for your mood. and i am moody. you can slip downstairs onto the debaucherous dance floor for a few hours. or not. choice is where it's at!  i did. got sucked in by the sound of the club below. haven't heard sound that good since.. hmn...don't know that i have.   will be back. shoulder slaps to the guys who put this concept together. finally! a lounge and club in one. and tastefully done.", 
    "review_date": "2012-01-22"
  }, 
  "eIyWuZUkeQH9Ju7BfnPWRQ": {
    "user_rating": 4.0, 
    "user_location": "North Vancouver, Canada", 
    "user_name": "Minori S.", 
    "review_text": "great dance crowd, young and almost straight oriented.  great house DJ's. upstairs is great for lounging and watching the hoop dancer, and downstairs got a good setup.  drinks were a bit on the $$$ side.", 
    "review_date": "2013-06-12"
  }, 
  "vR5XrnNESKdFeOxuhFh78A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sharon t.", 
    "review_text": "Hot damn! I am a happy girl. This place is rad ass from top to bottom. Classy cocktails upstairs with an unpretentious vibe (my favorite is the Rickshaw). And, if you're lucky, they might have some sort of circus arts going on upstairs as well. And then there is the downstairs which has the most amazing sound system I have ever come across. The speakers look super rad- all gold and shiny. The best part is, they don't pump crap out of those speakers, they book some seriously awesome talent. I will definitely be back- again, and again, and again.", 
    "review_date": "2012-01-07"
  }, 
  "4wp4XI9AxKNqJima-xahlg": {
    "user_rating": 4.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Rachel C.", 
    "review_text": "Right off the bat, there's no way you can beat a free photo booth with FREE print outs!  How can you not help going in there like 20 thousand times (especially under the influence of some delish bevvies!).  But aside from the awesome photobooth the whole atmosphere is pretty neat.  The place reminds me of the haunted mansion in Disney (or any other haunted mansion you've ever wandered into... It's really dark with lots of Victorian looking furniture and really cool looking chandeliers.  The whole vibe is just really cool.    Mix that with some uber friendly bartenders and some sta-rong drinks and you've got a good night ahead of you!  I had two different drinks.  The Paloma Brazilia and the Brass Tiki.  I really liked the Paloma Brazilia, with grapefruit and tequila but once I moved on to the Brass Tiki I was a little over having so much sweet in my drinks.  I think I would have stuck to one specialty drink and moved on to beer.  While they're well made, i was past my sweet limit (surprising, I know!).    There's also a club downstairs with a totally different atmosphere.  They play house music, which I'm not really into, but it's a pretty cool space.  They have a wide open dance area with little corners where there's lounge areas.  I wish they played better music (in my definition = booty shaking music) but it's still fun to lounge around for a bit.    I will mention the upstairs music was awesome though!  The first night I went (I know, we went twice in one week!) it was 90's rock, which was RIGHT up my alley.  It was awesome to sing along to Smashing Pumpkins, Gin Blossoms and Flaming Lips.  The second night was more 70's Rock, not my fave, but still fun regardless and way better than the house music downstairs.    I need to come back for more photos again alone, bar glamour shots here I come!", 
    "review_date": "2012-03-31"
  }, 
  "BOU25_BWQnLdFJBKUe2XdQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M C.", 
    "review_text": "The neighborhood is really bad. Came here for an afternoon event and was already kind of wondering what the homeless that were hanging around all the corners were doing.   These are not the silent kind lying in the streets just requesting money, they are loud and blocking people's way.", 
    "review_date": "2012-07-14"
  }, 
  "0niNpv8X_2I7wIWVWl3ZyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison E.", 
    "review_text": "I don't have facebook.  But there is still a small social networker inside me who wishes that she could constantly be taking vogue shots to post for all to see.  And anyone or anything that will feed this hole in my life is mention-worthy here on my anti-drug, Yelp.  Monarch's free photo booth made me feel like a star.  I was here for a friend's birthday, but this night, it was all about us. We were ready for our closeups, and we struck no less than four poses that I'm sure Tyra will want to see. (See photos).  The upstairs has a loungy-feel to it, but the real party was downstairs. Drinks run you about $7 minimum, and you'll have to order multiples because the speakers will sub-woef the vodka right out tha glass.   I escaped, juiced enough to sing happily all down the 6th St. Corridor, but sober enough to see what seemed like a war of the crazies in the middle of 6th street.  One guy told the other guy, \"I will kill you in your face, muhhh-fuhhh.\" Good thing I brought my pocket knife.", 
    "review_date": "2012-02-08"
  }, 
  "bFNwr-aQjpr7DJknKDIZlA": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kevin Y.", 
    "review_text": "This is by far the simplest place to review.  Sound System: One of the best I've heard (similar to Cielo in NYC) Staff: Super friendly, not a dick Music: Techno, deep house, tech-house.   Crowd: No jersey shore bros, come as you are and dance your ass off Cover: Just pay the $10 cover charge, you won't regret it.", 
    "review_date": "2014-03-04"
  }, 
  "1KDBDqGE9EsgtdOSt78SQg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nery Z.", 
    "review_text": "Monarch is an okay place. Here's a couple of reasons why;  (+)  - Manic Mondays! (BEST DAY TO BE THERE, TRUST!)  - Downstairs big clubbing area - Cool DJ set up and light - The couches downstairs are nice  (-)  - Security was kind of rude - Upstairs bar is kinda pointless  - People hogging the couches downstairs   Met the person who usually djs Manic Mondays and he was very nice and gave me a drink ticket so that was cool! Thank you mustache DJ man!", 
    "review_date": "2013-12-19"
  }, 
  "2MPTbMgbVCwUClgCKP75MA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josue V.", 
    "review_text": "Got bottle service here on a Saturday night and it was a good experience. Couch style seating that was pretty spacious. The bottle pricing was great relative to most clubs in San Francisco, only issue I had was that the bottle service seating was not closed to the general crowd, had many people coming and sitting by us that we did not know, but other than that it was a fun night, would come back again.", 
    "review_date": "2014-10-12"
  }, 
  "BDHDu2gEcRS6d4qz8yf7zg": {
    "user_rating": 4.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Kevyne R.", 
    "review_text": "Went here after Christmas eve. I think it was the only place open and has a DJ that night (i yelp and yelp and everything was closed!). Though it's Rock &amp; Roll Monday, it's better than nothing. The place was of course not busy but there were a fair amount of people who were coming and going. There's no dancing whatsoever, it was just a chill night to enjoy my drink that the nice bartender made for me. I just told him I don't know what to drink but I want it sweet. He said he will make me something and tadaaaaa - <a href=\"http://www.yelp.com/user_local_photos?select=c4U8a-ZephQF2_PatdBOcg&amp;userid=BDHDu2gEcRS6d4qz8yf7zg\">yelp.com/user_local_phot…</a>. I think it was a mixture of Baileys, Jameson, and something else that I didn't catch (thumbs up! Love it!)  Too busy chatting with my couple friends. Yeah, I was the third wheel.   The basement was closed that night where the dancing takes place but the bartender Greg gave us a tour when they found out that that was my first time in Monarch. I think i was told that they are one of the dance clubs that has an award winning sound system or something like that? I was not paying attention with the jibber jabber. Heh! Bottle service available, corner VIP couches, stage for dancing. Yup they have it. They are open everyday and the music is different every night.   I like the decor of this place. I didn't really expect it judging from the outside where there are bunch of homeless people loitering. Wait, I'm not sure if they're that but this part of the city seemed sketchy to me.  Did i mention the photobooth? You can snap a photo of yourself for free with prints and also have it emailed to you. I think we took like 5 since no one was there anyways. Strike a pose there's nothing to it, VOGUE!   After a drink or two, we called it a night and left. Nice place to kick it with good friends.   Good times!", 
    "review_date": "2012-12-29"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "What the heck?  I didn't know this place even existed.  On the street level floor, there the bar, photobooth, some seating and a DJ playing hip hop music.  You go down the stairs and there's a bouncer and someone charging $20 cover to get into this very strange dance floor room with a full bar and a DJ stage where the DJs are placed to actually interact with the crowd.  On one side of the dance floor, there's a full bar (prices are reasonable for SF) and on the other side, there's a stage and some tables for bottle service.  At first I thought this was a gay club (and still, I'm not sure, maybe half-half) and some of the girls looked like they were dressed in American Apparel head to toe.  I normally don't like dancing to music other than hip-hop but this place was an exception.  Great music and people are pretty friendly.      Since this is not a great area, there was plenty of parking.  This is a good place to take your friends if you want to show them something unique to SF.  Pretty casual atmosphere - beanies, leggings, jeans, etc.", 
    "review_date": "2012-04-30"
  }, 
  "TcR2L-xBnBS-tPnZnaXn1A": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Joy J.", 
    "review_text": "I was here recently and just so happened to have ONE OF THE BEST NEW YEARS' OF MY LIFE.  Most definitely will return. =)", 
    "review_date": "2012-01-07"
  }, 
  "ZkI5KW10ucprQfMIgZLWwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ron e.", 
    "review_text": "Certainly impressed with this new bar/club/lounge...Downstairs is an amazing venue with the best system I have heard in San Francisco.  So far I have seen nothing but A-Level dj talent on all the fliers.  Kudos to whomever is doing the booking.  Upstairs is a kick ass Victorian themed cocktail lounge.  The cocktails are delicious and not overpriced. Overall the staff I have interacted with there have been quite warm and inviting. Another kudos to whomever is doing the hiring.  Looking forward to many a libation and ass shaking at Monarch.", 
    "review_date": "2011-12-30"
  }, 
  "_Q8dmyd5y3fvMMGyqeFZHA": {
    "user_rating": 5.0, 
    "user_location": "Toa Baja, Puerto Rico", 
    "user_name": "Vanessa M.", 
    "review_text": "It was our first time in San Francisco and me and my husband were looking for a good place to dance electronic music. When you first arrive to Monarch you enter a nice area where you can get a few good drinks (kind of pricy) and listen to sort of lounge music. They also had a woman dancing on top of the area of the bar very entertaining. And once you pass the bar area on the first level there are stairs to the downstairs level. The manager was very nice and showed us around the place. Downstairs had really good electronic music. The drinks were less expensive and it wasn't that crowded (just how I liked it). The entrance was only $5 bucks. The DJ's hit it off with the music. Overall, we both enjoyed ourselves very much!", 
    "review_date": "2014-01-17"
  }, 
  "O1qpcUJh-jimrOefGp49Jw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gunter L.", 
    "review_text": "As of right now this is my favorite trendy bar. Beautiful design on the inside, reasonably priced drinks, great crowd, killer sound system downstairs (with well selected DJs and music). The times I have spent here have only been fun.", 
    "review_date": "2013-10-04"
  }, 
  "qI3uzegMdq3q3WxAajECGw": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Tara L.", 
    "review_text": "So nice I hit it twice - in one week!  Although I was not here for the weekend aerialist, I *was* here for the awesome staff, delicious cocktails, warming ambiance, detailed decor and plenty of fernet.   At first appearance, the space may seem small. That's just an initial illusion. There is actually a cozy side room behind the bar adorned with antiques as well as a booming basement full of bass if you slide through on the late night tip.   Plus, there is a free, photo booth for you to mean mug and throw up faux gangsta signs or test out that sexy face you've been working on in the mirror. Either way, it promotes good times and the ego!  Oh, and plenty of fernet. Can't forget that. (Unless, you actually forget that.)", 
    "review_date": "2012-04-24"
  }, 
  "EO9FDZ07cP2QwrX-vLlkjQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gary C.", 
    "review_text": "Hosts the best music in the bay. Staff, including bar backs and security, have serious attitude problems and make it very difficult to enjoy myself here though. Sound system downstairs is really nice.", 
    "review_date": "2014-09-26"
  }, 
  "GGjFUXJ1BlSNJoPZIgle1Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "E B.", 
    "review_text": "Great bar and Great drinks.......really fun specialty cocktails with top notch spirits, fresh ingredients, and even better cost!  Lounge area is great, old fashioned looking with a spunky DJ buzzing beats in the background.   Has a downstairs, that has one of the best sound systems in the city!! Awesome place to party, and the staff is quick and wonderful, or will at least acknowledge you if they are busy.   Love it  :D", 
    "review_date": "2012-05-03"
  }, 
  "8_Hs9Bh5tgFdc_1ycxHChg": {
    "user_rating": 5.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Kailey O.", 
    "review_text": "A perfect bar for a chill Monday night. Great place to meet up with a group of friends, since you basically have the whole place to yourselves. In addition, the free photo booth makes that special group gathering 10000x more fun.   The drinks on the menu are specially crafted with a mixture of herbs and different ingredients. Unfortunately, the one i had my eye one was not available that night, since they had run out of the ingredients. No worries, there was another one that piqued my interest and was probably just as good.  I will come back here, had a great time!", 
    "review_date": "2012-09-30"
  }, 
  "DyrYoDVAEMXvsWZz5M01zA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phil C.", 
    "review_text": "Really really unique space and definitely become one of the top places on my list of go-to places I'd recommend to people. Crowd is really good ... no fuss, good looking, interesting and chatty, lively crowd without any drama or brofest.   Having both the dance space downstairs and another bar upstairs is real cool ... like you're bar hopping without having to go anywhere (and there's still plenty of other spots in the area too if you needed to).   That and also whoever does their music booking has really good taste, lots of \"soon to be massive / underground favorite\" dj's come through. Those that know the Resident Advisor / Berlin scene will recognize a lot of names.... oh and the sound is sick btw ... downstairs sounded bumpin but I still left the club without any ringing in my ears.  Certainly something new and fresh in the SF scene.", 
    "review_date": "2011-12-23"
  }, 
  "kHTpRKU5ulUdDy1Lg-RNHg": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Bonnie Z.", 
    "review_text": "Gotta be honest...the FREE PHOTO BOOTH lured me in. Friend had a birthday dinner on a Friday night downtown, and we wanted to find a bar to go afterwards.  DRINKS - Rasputin: pleasantly refreshing! I just remember raspberry, mint, and some whiskey was involved. The big plus was the mint. It was decently strong. - Rickshaw: my friend got this drink! This seriously tasted like grapefruit juice, but it packed a kick so don't be fooled.  PRICES I think the special house drinks were $10, which is a bit steep but that's SF for you.   ATMOSPHERE Top floor was more loungey--there's huge couches all around with big tables. There seemed to be a dance floor on the bottom, but since we didn't want to pay to get in (or to check our coats + bags), we opted to chill upstairs. Apparently there's some kind of trapeze acts on wknd nights too, but we didn't stay long enough to see. Gotta come back!  LOCATION Since it's SOMA, the walk there is a bit sketch so come with a large grp of friends! It's easy to miss cos it sits between 2 adult book/video stores, haha. Close proximity to downtown and BART.  EXTRAS Photo boot ftw! It wasn't crowded at all and it comes with pretty backgrounds. Remember the last pic will be the biggest one, so pose accordingly for that", 
    "review_date": "2012-06-06"
  }, 
  "RT-zQ4lKNgSWp2fc1-HLsQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christopher J.", 
    "review_text": "I was here for a get together last night and there was a fair little group of us enjoying the bar.  The atmosphere on a Sunday night is calm with good music and not much of a crowd, so you can really enjoy each other's company without feeling as though you've been packed into a sardine can.    The two bartenders were great; they were quick with the drinks, had big smiles, and a fun sense of humor. The bar is pretty well stocked and should be able to make most patrons quite happy with the varied selections.  Above the bar is an eight foot (roughly) circular hole in the wall, and hanging inside the circular hole is an acrobat's hoop on a secure lanyard with carabiners.  I asked the gal behind the bar if it's ever used and she said \"Yeah, all the time on the really busy nights\".  I think I'll come back to see that on a Friday or Saturday  :-D  The bar, the tables, and the bathrooms were all clean and well kept; always a good sign.  There's a back room with a large projection screen, a couch, some chairs, and a small bit of dancing space. There's also a downstairs, but I didn't venture in that direction and can't speak to what you'll find.  It's a good spot, we had a lot of fun, the drinks were good, and the bartenders were friendly/funny. I recommend dropping in for a drink with friends.", 
    "review_date": "2013-09-23"
  }, 
  "gdpPpmkc-6_pq_1jx-Waug": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "Kokei O.", 
    "review_text": "This place actually sucks. We are currently here for my friend's bachelorette party &amp; we are looking for somewhere else, after ordering bottle service based on all of the reviews. The music is terrible (unless you exclusively listen to EDM) and no one showed up until 11:30. Skip it.", 
    "review_date": "2014-09-05"
  }, 
  "MvTxOTAMagiFwMpmXkU4iw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bridget H.", 
    "review_text": "This is a review of the HAPPY HOUR.  Manny, the owner, worked amazingly well with me to put together a wonderful Happy Hour and fundraiser to raise money for a nonprofit that provides solutions to homelessness.  The staff at Monarch are professionals- Pooky, the mixologist/bartender, made delicious drinks that satisfied our crowd of 60+ for two nonstop hours.  I rarely saw anyone waiting for a drink at the bar- I don't know how she did it!  I can't wait to come back and see what kind of holiday drink concoctions Pooky and the Monarch team come up with!  Thank you for giving back to the community MONARCH!", 
    "review_date": "2012-11-14"
  }, 
  "RgDVC3ZUBqpEe6Y1kPhIpw": {
    "user_rating": 4.0, 
    "user_location": "São Paulo, Brazil", 
    "user_name": "Monica S.", 
    "review_text": "If you're looking for a stiffly shaken cocktail, there's no doubt that Monarch will likely be the butterfly you're after. It's got all the proper fixings of a dark bar gone fancy with their short list of house created concoctions.   I particularly enjoyed the Negroni, a beverage that's sure to get you off your bar stool (whether intentionally or not). The only rule for this classic cocktail is blending only liquids with alcohol. With a cocktail sans a non-alcoholic mixer, it'll likely put hair on your otherwise unhairy chest.   As for the rest of the cocktail menu, it's a handful of other potent items, so if you're searching for something respectable, this is the place. Sadly, the hoop that hangs over the bar and presumably features contortionist or swinging lassies was devoid of said sirens. Better luck next time!", 
    "review_date": "2012-03-22"
  }, 
  "vcOtDqQ2Cc731kFjklFeBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany V.", 
    "review_text": "Can we talk about how I attended a holiday party here for Stimunlant.io and ended up waiting 40 minutes for the M train to drunk study at the library for finals. That is some motherfucking dedication.   ...and by study for finals I mean eat midnight salad and IM every guy I've ever dated.   For some reason my photobooth photos came out looking like I've never taken a photo before in my life. Good thing its free since I definitely need a do over! Drinks were solid. The bartender upstairs sucked. Had to ask three different times for the same drink before he served us and we were the only people there. I have no idea who did the catering but the food was amazing!!!!! Multiple rooms and everything was beautiful! They had vintage typewriters and all sorts of interesting shit laying around.   Oh and they had a girl dancing from a hanging hoop. How can you not love this place?!", 
    "review_date": "2012-12-18"
  }, 
  "Vwslifegl59fQVOe5BH1gw": {
    "user_rating": 4.0, 
    "user_location": "Edmonton, Canada", 
    "user_name": "Brittany K.", 
    "review_text": "What a weird, weird bar. This seems like something straight out of Stefon's most twisted fantasies. It would go a little something like this:  \"SF's hottest club is Monarch. This place has everything. Aerial hoops, a photobooth, gentleman-friendly cocktails, a weird 90s soundtrack, and is that Uggie The Dog from The Artist in the corner? No, it's just some random dude's random dog.\"  Weird, but I liked it. The drinks aren't very sweet or girly but even I like to mix it up once in a while. I like the secluded lounge space in the back.", 
    "review_date": "2012-03-27"
  }, 
  "aMy9jShStch4RzbZuNN0Ow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric A.", 
    "review_text": "If you're into house music with a local vibe this is the place to go!  They bring in both international and local talent to their small and cozy club.  As mentioned in other reviews, they have an amazing Void sound system that'll move your booty on the dancefloor. Another great thing about this place is that its open till 4am!  I've had some amazing times here and this will always be one of my favorite clubs in the city.  For popular acts, I highly recommend you buy presale tickets as the club is not that big.  This will guarantee you access and not leaving you waiting at the door.", 
    "review_date": "2015-01-15"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "Monarch is hip and so San Francisco in just a what's up way.  I have so much love and respect for places that see the potential of 6th Street and not only embrace it, but add even more personality and edge to it.  Monarch is that spot.  With an upstairs lounge that whispers coolness, and cocktails that scream quality, and a staff that are as personable and laid-back as they come -(woot woot - Mo!)  Monarch is made up of a truly beautiful recipe of pure goodness.  From a hoop aerialist that performs above the bar on the weekends, to a photobooth that captures the magic of the superbly concocted cocktails perfectly, and to a bottom floor that will blow your mind and not your ears.  Yeah - if you want to know what's up in the city when it comes to sound-systems - look no further than Monarch. Their downstairs boasts a gorgeous custom coned sound system imported from London, that has perfected sound to a science. It directs it exactly where you want to hear it, while still allowing you to speak to friends. Absolutely genius. Right now they host a slew of on point DJs on the weekends - but going forward they're even looking to hosting more live musical acts as well - so stay tuned.  For a swank, yet casual happy hour spot during the weekday - make your way on over to Monarch. For a late night weekend dance spot - Monarch is still the supreme reigning spot. And down the road if you want to check out live music - stay on top of Monarch.  Trust.", 
    "review_date": "2012-04-27"
  }, 
  "Qza0EVW1J_k0u8BIqMRbHQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Cara C.", 
    "review_text": "This bar has 2 personalities.   #1- the top floor bar area. Very chic. A nod to a speakeasy, old dark bar. Very classy with nice couches and a gorgeous bar. The lighting is very nice and this is a good area to sip on a glass of champagne or whiskey and talk with a small group. This is definitely more of my scene.   #1- The \"club\". Downstairs, has a cover and is a dark basement with a loud sound system. They have a nice big dance floor and a few tables, but this area is much more of a \"club\" feel than upstairs. You almost forget that you are in the same place.   Overall, it was a fun experience and I'd definitely come back. To the top floor bar.", 
    "review_date": "2013-04-28"
  }, 
  "TZelLnaGbHgaG7LBI6rfgg": {
    "user_rating": 3.0, 
    "user_location": "Calgary, Canada", 
    "user_name": "Jonathan W.", 
    "review_text": "Just folks crowded around loud bar doing nothing. I'm sure the drinks are good if you can ever get to the bar to grab one. The \"chill\" room behind the bar was pretty quiet but too much so.  20 cover to go downstairs to empty dance floor. No thanks.   Pass", 
    "review_date": "2013-03-08"
  }, 
  "vBZywpF-vTrS3oayjpjkAA": {
    "user_rating": 2.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Angela L.", 
    "review_text": "It's hot. It's crowded. People are pressing against me so that I can't draw breath. It's Friday night, and I'm at Monarch.   The crowd is young, and cool. I'm not, but they don't know that. I blend in. I press the flesh. I try to approach the bar to get a drink. I fail, such is the crush of sweaty bodies likewise competing for the bartender's attention.   There are comfy stools at the bar, all filled. There are comfy couches for sitting. Those are full, too. I find my friend amid the crush of hipsters, and we decide to leave, sans drink, because it's just too insanely crowded. Perhaps on a weeknight?", 
    "review_date": "2013-03-07"
  }, 
  "lWP8MzKDY95PzNjk479wvw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mindy H.", 
    "review_text": "PRO:  Photo Booth on the main floor and a stage with live performances downstairs.   CON:  Really, really loud.  Overall:  Great bar!  Would definitely go back again.", 
    "review_date": "2012-10-18"
  }, 
  "cST8Zaw_m73cMYPYA1m1cA": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Heather F.", 
    "review_text": "Weird location for this place.  My friend and I were going to see a show at Mezzanine which has no in and out's so we sought out a cool place near-by to grab a drink.  Only there isn't much near-by in this area.  Except for Monarch.  When you step into the front door of this place you are transformed from the dark, neglected spirit of the neighborhood into the swanky, sexy, pulsing environment of Monarch.  There is an upstairs and downstairs.  The downstairs is a dance room with music so loud it makes the floors vibrate.  The upstairs is gorgeous, with an antique, long bar and inner back room with a few seats.  Which brings up a point:  there isn't much seating here.  In fact the night we went it was so JAM PACKED with people that we couldn't walk forward (only sideways--any really hardly at all with that direction) so be aware.    There was no cover so that was nice.  I think I would come back to Monarch on a less crowded night to dance or hang out as the crowd seemed nice.  I don't know about the area surrounding it though so just be mindful.", 
    "review_date": "2013-03-05"
  }, 
  "IIurtwGhcPMxHd3VSKmeJw": {
    "user_rating": 4.0, 
    "user_location": "Atwater Village, Los Angeles, CA", 
    "user_name": "Courtney H.", 
    "review_text": "the underground downstairs part is really fun for dancing! its not all douchey and stuff. I had fun.", 
    "review_date": "2013-02-24"
  }, 
  "KCaOZUnCx25FJhFr_lKsEg": {
    "user_rating": 2.0, 
    "user_location": "Mill Creek, WA", 
    "user_name": "Heidi M.", 
    "review_text": "Monarch, sadly, is lost to most of us now, as it's been overrun with the Ruby Skye types.  The bar upstairs is till enjoyable to me, but the downstairs music venue has had an intolerably bad crowd the last few times I've gone.", 
    "review_date": "2013-10-30"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "Ever spent some real time at 6th and Mission? Shits is rough, son. There's enough crazy to fill an insane asylum, and if you don't watch your step, you're almost guaranteed to drop your penny loafers atop a steaming pile of human waste. But there's one group of brave souls taking the daunting challenge of trying to clean up this neglected corner of SOMA, Monarch.  Equal parts Mixology Mecca and tubthumping dance destination, it's quickly become one of my favorite haunts in San Francisco. If you feel like grabbing a finely-tuned elixir upstairs around good people and interesting bartenders, have at it. If you're in the mood to dance yourself clean with one of best sound systems in Northern California in the basement, that journey awaits you as well. It's like having your cake and eating it too, but slightly more sinful.  If you're there on the weekends, look out for a sprite little pixie bending her body into painful-looking shapes from the ceiling. It's quite the sight!", 
    "review_date": "2012-04-03"
  }, 
  "Uhei-9Dqvi4faOSFYkuC9g": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Amanda P.", 
    "review_text": "Monarch is RAD. Period.  It's awesome to be able have 2 very different experiences at one place! Upstairs is somewhat loungey, with funky retro decor, rock music (though I've seen DJs upstairs on occasion as well), delicious craft cocktails (the bartenders know what the hell they're doing!) and suuuuper comfy couches to chill out on. The best part about the upstairs bar is the PHOTO BOOTH!! There is a screen on the outside of the booth displaying all of the pictures ever taken in there, and I swear it makes for endless hours of entertainment. (I definitely saw some boobies)  Downstairs is a whole different world! The most epic sound system I have heard in the city, BY FAR. Monarch plays primarily house music, so you wont be hearing mash-ups and getting hyphy here. This club is douche-free, non-pretentious, and the drinks are reasonably priced (and strong!). The bartenders are hotties (seriously) and seemed super cool too! Not rude like a lot of club bartenders I've encountered. One of my girlfriends got bottle service for her birthday a coupe of weeks ago and she was really stoked on it- bottles were cheaper than at most clubs in the city, and she said the service was on point.   If you like fun, good drinks, cool people, and awesome music, you MUST check out Monarch!", 
    "review_date": "2012-01-07"
  }, 
  "mkxCw6GsMZDu-44_aCQTHw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Van W.", 
    "review_text": "Came here on a Monday on my walk over from work, some lady yelled at me and threw her full and open can of diet coke at me. Luckily, she didn't hit me.    anyhow  service was great drinks were tasty  they had a 2 for 1 shots, and instead of just ordering 1 to get 2 for me and Ken, I ordered 2 and got 4 and shortly afterwards we were chatting with one of the bartenders and the bouncer.  I'm chatty it turns out after a bunch of booze. Go figure.  we weren't allowed downstairs so no comment on that. and no one was on the ring, so again, no comment.  was a nice place to go to after work.", 
    "review_date": "2012-04-30"
  }, 
  "UXlc5ERHzlK6uzkef9C5gg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Masha E.", 
    "review_text": "We just held a private business party for 40 people at Monarch club and it was a huge success. I worked with Tadd Cortell and cannot compliment his professionalism enough. His help, experience and kind attitude made it possible to have a plenty of tasty appetizers, interesting drinks for open bar and, what is very important for any kind of business event, to stay in our budget. Moreover the design of the club and its vibe made the party very special and fun for all our guests. If you are looking for a great place to hold a memorable party, I strongly recommend you to consider Monarch.", 
    "review_date": "2014-03-24"
  }, 
  "jwbcs_eQ2QznrOyMuqz1LQ": {
    "user_rating": 4.0, 
    "user_location": "Milwaukee, WI", 
    "user_name": "Rachel F.", 
    "review_text": "Big fan of Monarch over here.  Maybe it's the interesting, varied craft cocktail offerings. Maybe it's because the guys behind the bar really seem to know what they're doing, and really seem to care. Maybe it's the vibe, the decor, and the faint yet noticeable scent of Nagchampa wafting through the air. Maybe it's all of it.  It is.  I loved my drink... something something \"darkness\" which involved Buffalo Trace -- you had me at Buffalo Trace! -- as well as a few other interesting ingredients. (Perhaps some vermouth-y type deal? I can't recall, folks. Sorry.)  As Monica S noted, contortionists and aerial performers behind the bar during select times. How awesome is that? (I only wish they would've been there when I was there. Maybe next time, because I'm most certainly coming back.)", 
    "review_date": "2012-03-23"
  }, 
  "PwQBWbXrfbp4wh3HaYIEfA": {
    "user_rating": 5.0, 
    "user_location": "Nevada City, CA", 
    "user_name": "Darby P.", 
    "review_text": "I Heart Monarch!  Found myself there on Jan 2nd for Last Man Standing..... &amp; then again &amp; again &amp; again.  Love the tuba chandeliers, photo booth &amp; lyra over the bar. The unique sound system downstairs isn't 2 shabby either....I do wish though that it could be turned up a few notches PLease!", 
    "review_date": "2012-05-10"
  }, 
  "38M__vAGqk9uJLK1dBr3QA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan K.", 
    "review_text": "This place is not bad depending on the bartender whos working. If you get one of the taleneted ones you'll get great drinks if you get one of the not so taleneted ones well you'll get a cup of citrus.", 
    "review_date": "2013-03-21"
  }, 
  "8AbWGLXt9XlHQuwvl1yOiw": {
    "user_rating": 5.0, 
    "user_location": "Seaside, CA", 
    "user_name": "Omar J.", 
    "review_text": "This place is great... Im not from the bay, just happen to be in town when i stumbled into this GEM. It was on a Tue which lucky for me meant Tamale TUE...Let me just say those were the best tamales i have had in my life.. It was pack with meat and the tamale itself was moist and not dry.. The bartenders were fabulous... Oh and they have a Aerialist that performs right about the bar and they have a FREE photo booth... This place is amazing.. So if your bored on a Tue head on over to Monarch and get your Tamale Tue on....", 
    "review_date": "2012-05-11"
  }, 
  "pa86Mfdc8SEmFJavReMDaA": {
    "user_rating": 1.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Shirley M. J.", 
    "review_text": "Small, intimate club-drinks are expensive; bouncer had difficulty controlling crowd due to lack of space moving from room to room; two co-ed bathrooms-always a line waiting to go to the bathroom . . .  Lack of seating inside club, so having a birthday gathering of 25 or more peeps becomes unmanageably annoying with the bouncer yelling at you to clear the walkway; please view video:  <a href=\"/redir?url=https%3A%2F%2Fwww.facebook.com%2Fvideo%2Fvideo.php%3Fv%3D10150655164276969%26saved&amp;s=7d8ce57149788c90d26bd15a39d09e74dc15077a99666a59eae850e830b45145\" rel=\"nofollow\" target=\"_blank\">facebook.com/video/video…</a>  Sixth Street &amp; Mission is a dangerous street-I was accosted by a black woman who did her very best trying to Kung Fu round-house kick me~do!  She proceeded calling me a \"white bitch!\"    Gee~Do I REALLY look white to you?  That black woman was on crack or something!", 
    "review_date": "2012-04-11"
  }, 
  "wq_Twp10CYCk_kfewrJtSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S W.", 
    "review_text": "Swank.", 
    "review_date": "2012-03-16"
  }, 
  "ZyG9Hw7Kxif471y76hm8rQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren N.", 
    "review_text": "I came here after I heard my favorite Moombahton DJ was going to be here. 4 stars for bringing him to SF. I had heard great things about the sound system. It didn't disappoint.  It's a good venue for what it's used for. The lower area is a little cramped with low ceilings. Typical SF joint. Upstairs is a nice place to have a drink and chill with friends. Photo booth in full effect.", 
    "review_date": "2012-05-11"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "It's... alright. Decent place to see live music, but suffers from Slim's-itis (poles in the sight lines).", 
    "review_date": "2012-03-05"
  }, 
  "iY2NTzFDcvtx-CMykK7QGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Galen A.", 
    "review_text": "Monarch is pretty sweet. It's not only a place to grab a tasty cocktail and dance your ass off but it also seems fantastic as a private event space. I was just there for a private party held in their Emperor's Drawing Room while the rest of the space was still in action. It was really cool how we still felt like we had our own space and support staff. It's great space for an intimate gathering or you could probably rent the whole place out and commandeer both bars and the downstairs club for a corporate or holiday party of epic proportions.  Everyone on staff has been super nice and helpful. Look forward to my next jaunt over there soon.", 
    "review_date": "2014-04-21"
  }, 
  "yIQaqfqdov2ptyEqPzZ5-A": {
    "user_rating": 4.0, 
    "user_location": "El Granada, CA", 
    "user_name": "Sarah G.", 
    "review_text": "This place is incredible! With the dance club downstairs and the bar upstairs, it feels like you have two different experiences in the same location :)  The bar is very upscale (even acrobatic women who swing from a gigantic steel ring hanging from the ceiling). No, it's not \"stripper-ish.\"  It's classy and invigorating!  Drinks are expensive but worth the experience.  The club is a blast. Techno music literally vibrates the floors upstairs, that's how strong the sound system is there! Unreal.  For a fun night out, albeit a little pricey, it's very worth it!", 
    "review_date": "2012-08-08"
  }, 
  "uBUzwNeruT3zcw5If8XdFg": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Sofía A.", 
    "review_text": "Kind of dead when i came here. But really good reggae bar and music. Also really friendly bouncer. The drinks were alright. Only one restroom for everyone in the bar.", 
    "review_date": "2015-01-06"
  }, 
  "pOqxYzJhxOAlxQSbM7DoLQ": {
    "user_rating": 4.0, 
    "user_location": "Edmond, OK", 
    "user_name": "Emily D.", 
    "review_text": "I was here for an event (the \"Travel Salon\" with Gogobot) and was pleasantly surprised by the place.   Yes, the atmosphere is dark and yes it's in a slightly creepy part of town, but save getting scared for the walk back to BART and bask in the glow of the golden chandeliers instead.   Seeing as how I was watching a panel of four people talking about how to go on sabbaticals and not a dance floor pumping with jams, I may not have gotten the full experience of this place, but I'm definitely open to coming back and grooving.   I liked the lounge-feel downstairs, with the comfy couches and the nooks. I could definitely see a make-out or two happening down there.   Service was friendly. If I'm in the area, I might be back.", 
    "review_date": "2012-07-11"
  }, 
  "NMNauN3TXZapniWfQ6rYFw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "This place is confusing.  When you first walk in, it's super bougie; so SF. Nice cocktails, hipster bartenders, well decorated.   But then you go up to the DJ and you're like, \"hey, can you play 'Icona Pop - I love it' for my birthday? It's my favorite song (and one of the most played songs on the radio)\" and the DJ answers with \"? What? I have no idea who or what that is. Maybe ask downstairs.\"  So then you walked downstairs, confused, wondering who in the hell has never heard that song before and head through the deserted dance floor to the DJ booth. There, you get ignored for 3 minutes before this guy behind her is like \"Oh, she's not that kind of DJ.\" Ooooooooookay?  This place is all house/edm music. That's fine, just not my cup of tea, but wouldn't that be better suited for some warehouse with candy kids? I mean, when you're blacked out, the music doesn't matter, but as you're getting there and trying to dance, this place is weird, and doesn't match. I just did not like it at all.. I feel like I got tricked. And with a $20 cover? It's just not worth it.  I originally started with 3 stars, but as I wrote my review, thinking about that DJ downstairs, I just got this really blegh feeling and lowered it to 2.", 
    "review_date": "2014-05-28"
  }, 
  "SDJPBswe8bMoHIruyxeslg": {
    "user_rating": 5.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Julien R.", 
    "review_text": "Took a trip out to SF and stumbled over this place. Monarch is super chill, probably one of the best places to party it up  I was told that the bartenders are really down to earth and the club itself has a good vibe. Word of mouth got around and Monarch has lived up to their name.  They guy basically giving my group VIP service was Mike (i think) and treated us like royalty.   For everyone trying to mingle up with some people, the single life may continue here. Great potential with the ladies over at Monarch.  Lively atmosphere, so if you want to get a rampage going on and party hard, come check out Monarch!!", 
    "review_date": "2012-01-06"
  }, 
  "Z1GkmmyhHAG8Q1e_QEOGgw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Adam S.", 
    "review_text": "Talk about dancing on the fault line. Make sure you know where Monarch is exactly because one step in the wrong direction of 6th Street and you'll find yourself in the shady part of the town. That being said, Monarch is definitely an awesome spot to hang out and socialize. There's a good sized bar area when you walk in and pass that is a bigger area with a decently sized dance floor and another bar area. If you feel like going underground to the real party, well then just head on downstairs to the basement! The drinks here are ok and the staff are pleasant and lively. Considering you're in San Francisco, the prices are as good as you'll find for the location. Overall, Monarch is a pretty fun joint to chill and enjoy the night. I would definitely recommend it if you're in the area.", 
    "review_date": "2015-01-25"
  }, 
  "9LUWTUJF3PfP-8jn3i_reQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erica L.", 
    "review_text": "I hung out at the club downstairs, which was the coolest scenes ever at 10 pm when Mark Farina opened his own show with the first set.  People were just dancing, there were no creepy guys trying to dance up on me, and the sound system, lights and media playing were really hip and interesting.  Plus, the staff, including the bouncers and bartenders were actually really nice.  This guy started talking to me, and introduced me to the owner who he was friends with.  Yet, in a few hours the scene changed as drunk and obnoxious people took over, which maybe is inevitable.   Be forewarned: It is in one of the WORST neighborhoods in SF.  6th and Mission is, according the the sfgate article I just read, the intersection with the highest crime rate in the city.  So, park in the 5th and Mission garage (open 24 hours) so that your car is safe, and don't be hanging out and walking around alone.  Be careful, and have fun!", 
    "review_date": "2013-03-02"
  }, 
  "ekMxlSyTubauImuQkF5RpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauryn S.", 
    "review_text": "Ever wake up from a night out in the city and have either of these scenarios happen:   you roll over to find a hideous monster next to you, so you then have to chew your own arm off or pull the fire alarm in your building so everyone evacuates just to get away from the mistake that you banged from the club with a horrible crowd ...or...  you open your eyes and instantly feel like you are going to barf from the worst hangover you've ever had (even worse than the time you drank a whole bottle of absinthe in Madrid) and all you can think about is how many douche bags you partied with, and that the stereo system was buzzing like a blown speaker in the back of your high school friends mom's car, and subsequently how much booze you had to drink to make them cool, and make the music sound good.   if yes...well... clearly you should have been at Monarch.  Monarch is like the magical heaven that you dream about going to when you die. Upstairs is the cities best cocktail lounge, spirits you cant find anywhere else with someone to mix them up in a way your taste buds have never experienced, Im talking about god having an orgasm its so good.   downstairs is the BEST SOUND SYSTEM IN THE CITY AND 7TH BEST IN THE NATION. yes folks, AWARD WINNING NATION WIDE. You will dance your face off with the most beautiful people in the city to the best music you can listen to, and it sounds good too.   if you want to have an awesome night, go to sleep and wake up with a smile on your face, then go to Monarch. the rest is for amateurs. dont make the same mistake twice.  honorable mentions FREE PHOTO BOOTH &amp; an AERIALIST", 
    "review_date": "2012-11-12"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "I pay cops to empower us to play. I pay cops to weave in figure eights in parades. I pay cops to have fascinating conversations at Philz coffee. What I don't pay cops to do... to tell my friends where &amp; where not to go. Because a cop may or may not appreciate the value of a cadre of cocktailiers &amp; business owners (the Monarch fellows) committed to bringing prosperity &amp; propriety into a section of the city, doesn't give them the credence to turn people away from said business. This is what happened to a group of friends that were on there way to meet us at Monarch. Now if those cops want to come into Monarch, scope the scene, tip the tenders for the Fernetiquette and have a shot with us... that might've been the more balanced approach. Whether they've noticed or not... there's trouble a brewing all over the city... so to judge Mission &amp; 6th to turn away people is boggling my brain. They must not have experienced the hap happenings of Monarch. If they had... they would've joined our friends.   Don't heed to their unwarranted call... go to Monarch. Five years from now it'll all be gentrified. Maybe they don't know about the Monarch butterfly and they're thinking the name of the place means \"Mo' Narc.\" Maybe? Wait, shouldn't they like that?  Astute bartenders. Astute tunes. Astutely crafted space. For the same reason young professionals &amp; hipsters love going to dive bars in the middle of gentrified nabes... you should enjoy going to Monarch as it's not a dive bar and it's a dive-y section of town. Repeat: not a dive bar. Other reviews are noting it's a dive bar. First sign of being a dive bar is when your first step into the dive bar your foot has a fair chance at getting stuck to the floor -- and the same goes for the first time your elbows hit the bar. The only reason you'd be stuck at Monarch is the refined cocktail menu &amp; your eyes may get stuck on the strapping gents tending bar. This is as a nice of a bar as you need, unless, well, your interested in cufflinks being mandatory.  There's definitely a caustic tone to all of this, which I suppose is due to this cop situation. It has nothing to do with the gentility of Monarch, the essence of Bon Jovial. I was in SF for a week, and the highlight night of my time there was my night at Monarch -- because of their smiles, kindness and their likelihood of handing us tiny glasses of Fernet.", 
    "review_date": "2012-04-02"
  }, 
  "WhhOoUlXC9Xbw93vYzgCzQ": {
    "user_rating": 4.0, 
    "user_location": "Point Loma, CA", 
    "user_name": "Cole M.", 
    "review_text": "This is a cool little place.  And when I say little, I mean little.  Not very big, but the decor is interesting enough.  Drink menu is on point, but they could do way better with the beer selection.  It's not like people won't spend the money.  The place is divided into two sections, and you have to pay a cover for the downstairs section where the dance floor is.  The sound system is good, and they don't bump it so loud as to destroy your eardrums.  I would check this place out again if I was in SF and they had a sick DJ coming through.", 
    "review_date": "2014-10-08"
  }, 
  "MT-C1GLOFo8brllzCVZhVg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca H.", 
    "review_text": "Past the tourists, the Sunday brunchers, and the ladies of the evening lies Monarch. Upon first entering, your eyes gasp in delight at the Cirque du Soleil antics of the aerialist and depending on your evening, you can either choose to lounge in style with high-quality cocktails in hand or so Yelp tells me or you can take the steps downstairs and just \"F@#$ it!\"   Well, guess what the boys and girls did? We came, we saw, and we chose to dance our tail feathers off.   Props to the owners for knowing how to integrate that San Francisco-something-for-everyone spirit into Monarch.   Downstairs was the hidden mecca of white boy hipsters. For all the girls, who love white male hipsters, I dare you.  I dare you to come here and teach these boys that there's more to life or dancing, at least, than the Jersey-shore antics of fist pumping and bobbing up and down to house music.   Just do it.   PS - At the bar downstairs, if you want shots or strong drinks to go cray cray, it's not happening.   PPS - Be advised your mom/dad will sleep better knowing that you've taken a car/taxi to or from here.", 
    "review_date": "2012-05-20"
  }, 
  "F5LhbsLPALA0B_yUBG2n9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa R.", 
    "review_text": "When did this place open and why did I not know about it?    First of all, there is no cover.   One of the prettiest and nicest cocktail waitresses I've met in a long time served me a tall Makers ($8).  People cycle in and out rather quickly, so if you are patient a seat opens up rather quickly.  For entertainment, a scantily clad girl makes her way onto a suspended hoop to do some circus tricks for the crowd,  The music is upbeat, but all over the place, like a crazy  ipod list.  I definitely heard Hall &amp; Oates and Herbie Hancock's \"Rock It \"at one point during the evening- groovy.   The crowd was a melting pot of contradictions.  No one looked pretty enough to be from the Marina, nor hip enough to be from the Mission. However, everyone was pleasantly good looking, laid back, and more than one gentleman apologized for bumping into me.   If I had one complaint, I would say that the bartenders need to look up and make eye contact more often. Also,  hold the bottle at a reasonable distance from the glass when pouring drinks. Holding the bottle over your head and the glass at your waist is not sexy.  There is a reason why the movie \"Cocktail\" was forgotten 20 years ago.", 
    "review_date": "2012-02-25"
  }, 
  "HRRFaQ-F1kExRGaR7Ag6HQ": {
    "user_rating": 2.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Stanford R.", 
    "review_text": "We bought will call tickets to a show here, but when we showed up they were totally disorganized. They didn't have us on the list and instead of apologizing, they interrogated us about it. Even though we had receipts on our phones that we paid for the show, they didn't believe us. As if we would go through the trouble of making fake tickets to a $10 show in the worst part of town. I pointed out that we were the only ones there, and the woman at the door kept saying \"it doesn't matter, you have to pay.\"  Finally, only after getting the manager involved, they let us in. The bar itself is pretty nice, but I'll only go back if a musician I really want to see is playing there.", 
    "review_date": "2013-11-12"
  }, 
  "YwrlQkK_9MTuBOfQfjiSsQ": {
    "user_rating": 5.0, 
    "user_location": "Cincinnati, OH", 
    "user_name": "Sara B.", 
    "review_text": "Pooky is the sh*t and so are her bartending skills!! Showed up well before the party began and me and my six girls had an epic time with the awesome staff. Def can't wait to go back.", 
    "review_date": "2013-05-08"
  }, 
  "gPlJ1ukVVi0Ahex2SzjZug": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Baciula L.", 
    "review_text": "I decided to take a solo trip to San Francisco this past weekend to satisfy the curiosity I have had about this city for a while now. Traveling to new places I always try to experience all aspects of the city life, including nightlife. After reading reviews about Monarch I was a little hesitant to go to that part of town by myself but I had a pepper spray handy and decided to check it out after all.   This place was nothing but awesome! And the surrounding did not look as bad as some yelpers say. Bartenders were very friendly and did their job very well with serving drinks that were mixed just right. The dancer in the bar upstairs had some legit skills! I ended up spending most of the night downstairs, which had a cool underground feel to it, with a dance floor that could have been just a tiny bigger but I didn't feel to squeezed. I really like the free self-serve water on the side of both bars upstairs and downstairs, it contributed to no hangover the next day!  I met at least 10 people when I was there, anywhere from locals to visitors like me. The music was great, very chill progressive electro or something in that matter, not annoying at all. Everybody was dancing and had a great time! I will definitely come back here next time Im visiting!", 
    "review_date": "2013-05-27"
  }, 
  "9Ppu7EL3F4gDC24QmKdcoA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna L.", 
    "review_text": "Tequila snobs, may your lips smack of agave and supreme satisfaction.   At first glance, I thought: of course, another downtown venue with ten brands of vodka and three kinds of tequila (oh, you know which three I'm referring to).  But what's this I see? Ocho, El Tesoro, Siete Leguas, Partida?  Monarch, you have my mad props.  Tips - Bring cash; there's a $20 minimum to use your credit card. - If you're driving there, I suggest parking in the 5th &amp; Mission garage; you won't regret it", 
    "review_date": "2012-01-25"
  }, 
  "fx4U_rUsSQfq0tpdPwLuKw": {
    "user_rating": 3.0, 
    "user_location": "Chamberí, Madrid, Spain", 
    "user_name": "Sergio L.", 
    "review_text": "This place is awesome, the decoration is really cool and downstairs is supposed to be fantastic (loud, electric music, although we didn't get inside since the entrance is 20$ and it was a bit late when we arrived). BUT at 2am it closes, and they mean it: we were practically kicked out by their REALLY RUDE STAFF, who forced us to finish fast our drinks or they would call security. It's such a pity that a club with such potential treats its customers with bad manners...  Una discoteca/garito muy guay, la decoración está muy trabajada y parece ser que en la sala de abajo la música es alucinante (no llegamos a entrar porque ya era tarde y no merecía la pena pagar los 20$ de entrada. Sin embargo, cierra a las 2 de la madrugada y prácticamente te echan a patadas, a nosotros nos obligaron a acabarnos las copas rápido o llamaban a seguridad y todo con muy malas maneras! Una pena que un garito con ese potencial se eche a perder por no saber tratar a los clientes (y también es una pena lo de cerrar a las 2, pero eso es otro tema y en casi todos los garitos de San Francisco es así)!", 
    "review_date": "2014-07-30"
  }, 
  "Uurxz2utWrvCSkK3XEuDpw": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "Lincy H.", 
    "review_text": "I came here on a Friday night around 11/11:30pm and it wasn't that crackin'.  The dance floor was pretty empty. My best friend and I were definitely way overdressed compared to some other people here. One girl was wearing a backpack! -_- If the place doesn't have that strict of a dress code, I don't think they should be charging $15-20 for cover. Thankfully the guy who took us there kindly paid for us.  Drinks are the same price as other places. It was $18 for two red bull vodkas before tipping. I told the bartender to surprise me for my other drink. They gave a moscow mule and it was not bad. I was hoping they would just create a random concoction for me haha, oh well!  The staff was cool though. After stepping outside for a bit, we were able to get back in with no problem. I was going to show my stamp and/or ID again but the bouncers said, \"How could we forget you?\" *Flattered* hahaha  The music was just eh for me. I'm more into songs with lyrics. This is probably a place for people who are more into trance. Since we weren't feeling the music, we weren't really dancing, so we ended up leaving to go to The Grand instead, which was way more fun. (Perhaps it was because the alcohol kicked in by the time we got there?)", 
    "review_date": "2014-05-13"
  }, 
  "9jnyhkS6wtstvDgN63YKUQ": {
    "user_rating": 2.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Max T.", 
    "review_text": "My wing lady and I came in here on Sunday. We're both young-uns when it comes to most bar scenes, being 22 and 21 but we're not dumb. We've both worked high end restaurant jobs with full bars for a few years now so we have an idea of what to expect.  After trolling all over SOMA for what seemed like an hour for a decent place that was actually open on a Sunday (dumb), we gave up and said what the hell to this place. We both wanted to dance and heard about the downstairs area. It was a ten dollar cover at this time but again, we just wanted to get down already. I asked how busy it was downstairs and the doorman said it was \"alright, tonight\". I should have asked what kind of music they had playing cause my friend did not like techno which turned out to be the selection of the night. Oh well. Our bad.   We suck it up because again, we wanted to dance. There was a decent crowd. Fairly mixed it seemed. We felt a bit younger than everyone else (mid twenties-early thirties). I wanted a drink so we hit the bar. This is where I get annoyed. We make ourselves visible in the very CENTER of the bar and try to get the bartenders attention. This dirty blonde-haired woman takes a few minutes before coming up and saying she'll be with us in a moment (we've been right in front of her the whole time). A moment passes, and another, and another. I notice she has taken up orders somewhere else with people who appeared after us. She is not busy at all. Just cruising through, making drinks. All I wanted was a friggin' beer. Just pop the cap so I get back to the floor, damnit. I ask this other guy (not sure if he was tending or was a barback) if I can get a beer and he just says. \"She'll be with you in a moment.\" Ultimately takes like 10 minutes to get a beer. I could see the fridge too. Just wanted to jump over and get it myself. Ridiculous.  We go back to dancing for another half an hour or so. Now we need to pee. I've been fairly buzzed since coming in as I was wise enough to prefunk at home before wasting too much cash on drinks. We got to the bathroom and notice the Mens bathroom has guys and girls in it and it's crowded. Don't know what they were doing but it seemed, well...a little more time consuming than just peeing or washing up. We decide to go to the ladies which is COMPLETELY empty. We both go to a different stall. A moment later the bouncer is banging on the stall door telling me to get out (I'm a guy). I come out with my fly still unzipped. It's the bouncer from the front door upstairs (not the one at the downstairs entrance). Tall black guy with glasses. He gives me a wave of sass and I tell him I'm sorry but I gotta pee and the other restroom had guys and girls in it just screwing around. He escorts me to the other bathroom and delivers the same treatment to the folks standing around doing whatever. I'm totally peeved at the attitude he gave me. My friend and I pee then bounce.   I'd just like to say that a small \"M\" for Men and \"W\" for women isn't the greatest for declaring the bathrooms in a dark club full of drunk people (drunk people in a club!? No shit!) This bouncer needs a spanking. If it's such a big deal, you don't need to be such a DICK Tracy about it. Go work at the DMV if you want to be that way to people. -1 star for slow service. -2 for the douchebag bouncer. Seriously, I came here to have fun. I didn't cause trouble so don't start it with me.", 
    "review_date": "2012-04-19"
  }, 
  "0jmzz_DzROs4UwEe63XAAQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "billy m.", 
    "review_text": "There's not much to say about this joint other than it's a crackhead block and some crack fiend staff, mostly the door guys of course. The layout is weird and despite the occasional cute chick this joint is the worst, nothing but bad vibes and dirtbags. Dont bother.", 
    "review_date": "2012-10-18"
  }, 
  "aKN3Fq2uaRJTwZRPlI5GcQ": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Alex S.", 
    "review_text": "As many people have pointed out before me, Monarch is hard to pin down. Is it a dive bar? A mini-circus with aerial acrobats above you? A classy cocktail concoctionary? A nightclub? Yes.  Depending on what day you walk in, it's all of those things and more. You may see acrobats above you. You may get a fantastic drink. You may hear loud pumping music or (like the last time I was there), a fantastic 90's soundtrack. You may see a dog walking around. You may get your photo taken in the photobooth. You may not know quite what is going on, but here you are.  I like this bar a lot, just because it is so weird. The bartenders know their stuff and will make you a fantastic drink. I ordered something with gin (basically I said, \"I would like a drink with gin. Bartender's choice.\") and he came back with a great cocktail.   There's a dance floor below if that's your thing. I happen to enjoy just sitting in their loungy-type areas in the back with a great cocktail in hand, talking to friends. And that can happen here for sure.", 
    "review_date": "2012-03-29"
  }, 
  "AxXF5D4_kDnerfSovqYv5Q": {
    "user_rating": 2.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Alyssa A.", 
    "review_text": "Dark dim lighting , dirty diwnstairs floors and basement, I went at 11 on a saturday and nobody was in there , this place is more of a quiet lounge with drunk awkward people, small. Rude bartender at the bar by the dj table. Forgot his name but he has blonde hair and a lot of people had same experience. Any way the security is very friendly though good guys they got out there but everyone else seems rude including the guy with the beard in the downstairs basement!", 
    "review_date": "2014-03-16"
  }, 
  "2MNuqIDGkjGz0w424USrgA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony K.", 
    "review_text": "Up until last weekend I thought this place was pretty good. The sound system is great,the clientele was okay, and the acts were sometimes stellar.  Last Saturday night, a group of my friends and I decided to see Jimmy Edgar. We expected to pay $10 at the door because the Facebook event and the flyers said it would be $10 after 10:30 pm.   When we arrived the door people said it would be $15. After a few moments of arguing about the price, it was only until I pulled out my smartphone to show them the event price that the door people would let us in at that price.  It seems incredibly SHADY that this would happen.  The door people said it was because the owner wanted to regulate the amount of people coming in - which is a poor way of covering their asses.", 
    "review_date": "2012-02-27"
  }, 
  "7cL0wq8QwMGlUQnG2ruLSA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casey U.", 
    "review_text": "I'm not the sort of person who goes to clubs.  Its not that I dislike the concept, but more that I can't dance, possess no sense of style whatsoever, have been cursed with a totally unwelcome case of male-pattern baldness, and (even worse), exhibit an extraordinarily high tolerance for alcohol while possessing very little money. I'm more of a dive bar guy; the dimly lit haunts of writers, grad students and other n'er-do-wells, where conversations flow as readily as boilermakers, a place with no cachet, few hipsters, even fewer North Face Jackets, and largely uncomplicated drinks. So, naturally the only thing that'll get me to go to a club is the promise of cheap beer, and this week the Monarch had that in spades, with a one dollar pint celebration of their new tap system.  Yelpers take note: If you want to pigeonhole me for whatever reason, I, like the spirit of Charles Bukowski, am wherever cheap beer can be found.  Monarch is a nice looking place. Redwood and pine meet in curlicues upon a crushed velvet backing behind the front bar (or is it the back bar? No matter). Lights spring out from a double-headed sousaphone chandelier complete with mouthpiece, stained glass windows illuminate models of spanish galleons and one of the ninety-nine luftballoons. The other bar features faux-books and Edison Bulbs (the decorative shorthand for hipness), and you can look back out through decorative windows to the silty grey light of the City.  Its pretty goddamned loud as the DJ spins through house music, R&amp;B, and whatever other selections he chooses, but that doesn't stop technocrati twentysomethings from congregating, playing board games ranging from \"Cards Against Humanity\" to an artesinal, hand-crafted \"Connect Four\". They drape themselves over lounge-chairs, and sofas, leaning in to speak, leaning out to laugh, exuding the intentionally unhip vibe crafted and seemingly designed by this city of upstarts.   The much-vaunted cryogenically cooled line system was just fine, the beers were properly-poured, and the thrill of a one dollar pint, of leaving a 100% tip on every drink were not lost to me. As I sat back with my fourth, I leaned back and looked around, realizing that Monarch is for the \"Woo\" people, for the Google crowd, for those who make more in a year than I will in my entire life what a dive bar is for me: a place for conversation, for drinks, for solace from the outside world. Testing this hypothesis, I turned to the man next to me, and asked him \"So, whats your story?\" a line which usually is the start of a friendly conversation in a dive bar. His response: \"I have no story, I work for tech\". I've been wrong before, but never that wrong.  Overall: Three Stars. Lovely place, but not my style.", 
    "review_date": "2014-07-29"
  }, 
  "4ZaqBJqt7laPPs8xfWvr6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina M.", 
    "review_text": "There is absolutely no need to pay a $21 cover to attend this downstairs club (upstairs lounge is free). It's not bad but it's also not superior to plenty of others that offer guest lists all over the city.   The ground level has interesting light installations and an overall trendy decor. However the downstairs dance floor is rather plain and VERY VERY HOT and stuffy. You don't even need to be dancing to start sweating bullets.  Tonight's DJs were deep house. It was nice but not terribly exciting to dance to. Overall, this was one of those rare times that I didn't enjoy dancing the night away.  I might pop in for a drink in the lounge if I am in the area but as long as there continues to be a cover and no guest list, my friends and I will not return for the club.  FUN FACT: There is a photo booth in the lounge but it was broken when I was there. Broken photobooth for young women is the equivalent of offering candy to a child and then withholding it. Ignorance is bliss my friends.   NOTE: If you aren't familiar with SF, this street has high crime levels (it's safe for you, just not your stuff). So if you happen to drive and park by the venue, don't be an idiot and leave nothing visible in your car or it WILL be broken into. I wouldn't lalagag on my smartphone either, it will get snatched.", 
    "review_date": "2014-09-21"
  }, 
  "Wc5L6iuvSNF5WGBlqIO8nw": {
    "user_rating": 4.0, 
    "user_location": "Montreal, Canada", 
    "user_name": "Risa D.", 
    "review_text": "Lord I love a dive bar. And give me a dive bar with aerialists above, a hot dance club below, and bartenders who care to mix a serious drink: I'm in happy dive bar heaven. I get a proximity high at Monarch like only brief, rare encounters with California and it's kind people can provide. I had excellent, audible conversation crammed against the bar while loving the music (electronic with a little softly beating indie heart, and a smirk of carnival.) This all combines to remind me of Montreal, in a strange sunny way, so I loved Monarch and felt right at home.", 
    "review_date": "2012-03-26"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "Still a great venue downstairs for parties (burning man or otherwise... Thank you Dusty Rhino btw!), good flow, good ventilation (somehow, can't figure out how though), water by the bar if you are dancing all night, great zones too.  Zone 1: the upstairs bar. meet, mingle, view of people coming in.  Zone 2: lounge behind the bar. talk, laugh, flirt, drink that drink you bought in Zone 1.  Zone 3: the downstairs dance floor. great sound (although also requires a good DJ so look ahead). great coat check, fast service at the bar downstairs, dark enough to feel like no one would 100% recognize you, but can still scope out your attempts at fly dance moves. (Gangnam not included)  FYI: cab it. don't park in the area or stroll too far in any one direction.", 
    "review_date": "2012-12-19"
  }, 
  "CSfjaTVpxugpRNEd0RtsxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria M.", 
    "review_text": "It's worth braving your way to Monarch, despite that not so ideal location, I really like this place.  It's a combination club and lounge.  The upstairs is the lounge decorated in a Victorian meets Punk Rock theme, art nouveau mural with looking glass frames that reveal a hidden lounge.   Downstairs, the club is packed with a wall of sound where local SF talent come to play.  It can get a bit crowded and hot downstairs, so its great that you can take a breather and relax in the lounge area. Reasonably priced drinks. Can get crowded and hard to get a drink but hey isn't it like that in any popular bar/club in any city. Place is small enough to not be too intimidating.  Love it!", 
    "review_date": "2013-05-13"
  }, 
  "GLqUg5nj2UxVtOZJJVmU9Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valentina C.", 
    "review_text": "I was harassed by the staff last night in the basement. The people that work there are animals.", 
    "review_date": "2014-07-27"
  }, 
  "OzyWzkcct7PXgkg4H1tDRQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Thuy H.", 
    "review_text": "Luckily my friends and I arrived early for the open bar 9:30p-10:30p.  I didn't realize this was in or near the TL area?  My friends were scared because we kept getting harassed on the two block walk to the lounge.  Lots of hobos and in such a dark neighborhood (they def need more lighting).  We arrived and it looked like somewhat of a decent nice looking lounge. There's two parts, so the top where the bar is with a small dance floor in another area and downstairs where the halloween party was supposed to be.  We were told by the guy in the front who was checking IDs that it was opened yet.  Hm...not opened and it was like 9:45p?    So my friends and I waited and we were like, let's check this out!  We walked down to the basement area to find out they WERE opened!!  With 10 minutes left of the open bar, we took about 5 shots back to back and ordered a drink to sip on for the rest of the night.  We were NOT going to be buying drinks tonight...  There were those that dressed up and those that did not.  You could order bottle service if you wanted and the crowd seemed to be enjoying their time.  People were really nice because they happily took our photos when we asked them too.  Coat check was only $3 bucks so that was cool!  I was praying that they would have a coat check.  Overall we had a lot of fun.  No creepy dudes were hitting on us, I didn't get my ass slapped by a stranger and we all kept it classy and danced to the music that was more techno....So if you want to party at a smaller location, this is for you!  No large over crowded bars and dance floors!  I wouldn't come back again simply because of the location...but on a plus note, they were only half a mile away from OSHA Thai!!!  My nights always end on a happy note when I get to eat there :)", 
    "review_date": "2013-10-28"
  }, 
  "jfRXIPZ4_5wtsXvRh5L0hA": {
    "user_rating": 4.0, 
    "user_location": "Chino Hills, CA", 
    "user_name": "Betty C.", 
    "review_text": "Lovely atmosphere, there are sexy ladies that spin on a bird's perch up above the bar. The music is a bit techno and it's downstairs. I like that you can drink without cover charge upstairs and if you want to dance you can pay to dance downstairs. It wasn't super packed on a friday night, but that's okay. We had a great time. Everyone was super friendly there.", 
    "review_date": "2013-08-04"
  }, 
  "Y3QU8Jj3lYuVa2LmunvnRg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen D.", 
    "review_text": "People that give this place anymore than 2 stars must be smoking some of the stuff being dealt around the corner. Seriously.   Came here on a Thursday with my girlfriends in hopes of getting a good drink and dancing off a little stress. When we first walked in, I was thought to myself, \"where's the rest of the place?\" The upstairs is tiny, offering a few bar top tables and a long bar. They did have a free photobooth in the back near the bathroom, but the camera position is weird and every shot came out bad. Plus, it has a green screen which the computer puts hideous backgrounds on. The printer wasn't working either, so we weren't able to get any printouts of our terrible pictures. Not really a bad thing I guess.   Finally I asked the bartender where the club was and he said it was downstairs. I looked over to see two people standing at the entrance to the stairs going down into the club. I walked over and asked the girl if I could just go check it out and she said that there was a $5 cover. Now, I'm certainly not cheap when it comes to clubbing, but since I couldn't hear anything coming from the \"club\", there's no way I would even pay $1 to go in. After trying a little harder, she let me go down and what did I find you ask?   AN EMPTY CLUB!   5 people total, including the \"dj\" who was either getting warmed up, or had a twisted idea of what type of music is acceptable for a club since the BPM was probably no higher than 70. As for size, Vessel, which I consider to be an extremely small club, is bigger than Monarch. The back room on the second floor of Ruby Skye is bigger than Monarch. No bueno my friend.   I won't even talk about the neighborhood. I actually don't hate the folks at Monarch for opening up on Skid Row. I'm sure that the Tenderloin will be a lovely place one day. Unfortunately, Monarch probably won't make it long enough to see that happen.", 
    "review_date": "2012-02-08"
  }
}