{
  "9S8xNEbgKcwlroLQTnCAkA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David N.", 
    "review_text": "F_ _ K this place!   Reasons why SF is such a great place : people are down to earth, chill and out to have a great time. Monroe has bouncers that simply think they're better than everyone and Dude, this is SF not VEGAS. Here's what happened:  My friends girlfriend decided to have her birthday there. I was not on the guestlist so I expected I would have to pay for their cover (and I'm ok with that). My friends and I took a cab there right at 10pm and there was NO one in line at all. There were a 2 white guys and a female that got in right before us. The bouncer (Russian guy with an accent) asks if we were on the guestlist. My two friends were and I was not. The Bouncer then says \" I just told the trio right before you that we're expecting to be over capacity and you can't get in if you're not on the guestlist\" . My friend then says well what if he pays cover (since I was willing to anyways). The bouncer then says ok, we can let you in if you pay $40.   Now this is Bullsh*t!  $40 for a dead ass lounge is downright highway robbery. Like I said, this ain't no Vegas. So my friend's girlfriend asked the bouncer \"I thought you said you're over capacity\" and the bouncer said well if he pays $40, I'll risk it and let him in. I said F*ck it and didn't pay the $40 (just so he can pocket the $$). I went to the other bars in the area and gave them my business.  I hope the Monroe management reads this review and fires that bouncer. I give this place ZERO stars!", 
    "review_date": "2011-08-28"
  }, 
  "gUhL_vkTY_zwrzT71a73Bw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kenny P.", 
    "review_text": "I went here for the first time a few months back during the summer; since my friend knew a club promoter who was working the event that night.  We easily got in on the guest list and saw just how cool the interior of this place really is.  From what I heard about the place, it is pretty new and is decorated with an old chic Hollywood theme inside.  Very cool.  They have  a full bar that can probably make just about any drink. The bartender or server had approached us to see what we wanted for our next drink.  She even asked if Ketel One Vokda was ok for the mixed drinks.  Not too many places on Broadway would ask that.  Apparently a friend of the club promoter was throwing her b-day party here that night which was cool.  Then again, I realized that his place is a lot more classy than the other clubs around the area.  You don't really realize how ghetto the other places are until you step into a place like this on the same street.  The music was excellent too... not sure if the DJ is a regular on the weekends but he spun a really great mix of hip hop tracks and new school stuff.  They do have a small dance floor area that works well and an additional bar on that side.  Ended up having some good ol' fun at this new venue.  I had been back once since then am really glad a place like this exists on Broadway.", 
    "review_date": "2011-11-07"
  }, 
  "JVpmdiQ5EpuPbqUrLmtHew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura L.", 
    "review_text": "I love this place!!  The space is really beautiful and the people involved with it are so amazingly nice and down to earth.   The location is different than where I'm used to going, but I think it's fair to say that we can all use some change from time to time.    They're really doing some interesting things with their line-up and themes- Battle of the Decades Wednesday party and so on.  Plus, if it's the best consistent Sunday morning house music party in town.  Thank god.  Come support this place- it's fantastic!", 
    "review_date": "2013-04-15"
  }, 
  "bSY04kIrbB3J9cyNBiKfcQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Paul C.", 
    "review_text": "I used to come here when it was the Dragon Bar.  I think there are new owners now and they have really made the place nicer.  I first came here for a friend's birthday and was impressed by how much better the decor looked inside - they've definitely classed up the place and I like it.  The nice thing is they have a free guest list you can sign up for and get in by 11pm without cover.  It's slower to start but people start to filter in around 11pm and later and then it gets packed.  The bartenders are pretty quick and the prices are reasonable - $5 for Blue Moon, $8 for Stoli cocktails.  The table service is reasonable too, from what I remember when sitting at the table with my friends, bottles of Grey Goose were $250 and Stoli was $225.  I also remembered their champagne prices being reasonable too.  It's kind of refreshing to find a place that's a little more modest and doesn't try to charge you Vegas prices for bottle service when they are not in Vegas.  Additionally, the DJ has been really good and plays a good mix of music throughout the night.  I've been here a couple of time and would go back.", 
    "review_date": "2011-10-29"
  }, 
  "hQpDYqpRKqCdGt18IR5jzQ": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "DJ F.", 
    "review_text": "This place is great... If your in the Broadway area and are looking for a place with some type of class check this place out. The decor is WOW to say the least. It gives off that vibe that you are in Vegas or LA and you totally forget you are in SF City. I have been here twice now and I must say I will be back, I don't make it out to the city much but when I do this place is a must stop off. The crowd is great and the services/management is very friendly. I love the fact that this place has an out door patio with overhead coverage so you can have some fresh air or enjoy a smoke in a covered area.   Other plus points are: Close to main st for quick freeway access and good pizza place across the street....", 
    "review_date": "2011-06-29"
  }, 
  "LPkXc94_xyRN09d8sXSR7Q": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Christine B.", 
    "review_text": "Background:  Small Club/Lounge located just moments from your favorite Broadway venues.   Details: Venue: $10 cover at 11:15 because we didn't make the 11pm guest list.  There are a few seats and tables outside of the front door. Inside, they have two bars. One large main bar, and one small bar. On a Saturday night when I went they only had the small side bar with 3 bartenders for the crowd. There are 4 tables for bottle service.  There is virtually no dancefloor and you end up with the house staff shining their flashlight all over the place in your eyes to get through but there isn't really a crowd. Oh and spilled drinks definitely DO NOT get wiped up. The side bar is located right by the entrance too, so there's a giant bottleneck when you get in.   Crowd: Hard to characterize the crowd because there weren't many people there and it felt borderline dead.  The girl to guy ratio was pretty good for the guys.   Music: Pop/Hip Hop. The DJ kept on only playing sniplets of songs and then zipping to another song. Barely any house/EDM. The highlight of the night was the backstreet boys and britney.   Drinks: If you really like ice, then the drinks here will satisfy you! Their main bar and bar area wasn't even open. I remember paying $17 for a midori sour and kamakazi shot, so their drink prices are pretty standard and not overwhelmingly ridiculous.  The bar itself is a mess, bartenders don't clear away empty cups fast enough, spilled drinks galore and napkins stuck to the bar.   Verdict: 2.5. I didn't have a horrible time here, just underwhelmed by the whole experience. The venue is poorly designed and not well kept by the staff.  I don't think it's impossible to have a good time here, and I'd give it another try on another night when there are more people, a better DJ and more of the venue open.", 
    "review_date": "2013-08-25"
  }, 
  "0dwddoD9iFETVKXZXZko3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly C.", 
    "review_text": "Great new lounge. The interior design is awesome, the Jessie James cocktail is delicious, and it's pretty close to some other cool spots like 15 Romolo and Comstock.  I'm a fan.", 
    "review_date": "2011-03-28"
  }, 
  "bRTU2t1JsOwfJSA10lUUIA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "margaret l.", 
    "review_text": "This is my second review on Yelp...and I've been a 'member' since 2007.  My experience at Monroe inspired me to get back on the ol' hog and memorialize this place in its infancy, marking the start of a place that will go down in history for priming the metamorphosis of Broadway as we currently know it.  My experience there a week ago was a welcomed surprise amidst my deep-seeded notions of the Broadway strip...I begrudgingly went on a Saturday night for a friend's going-away party that was executed by a promotional events company.  There was a solid crowd by 10pm, but drinks were still pretty easy to get at either of the two bars.  The signature cocktails are a must; made with all fresh ingredients and reasonably priced.  The music was bumpin' and just right for the scene...with a nice crescendo towards the sweet spot of the night.    The decor is fabulously \"hollywood glam\" but in a delightfully understated way.  The tables surrounding the dance floor look like they might be reserved for bottle service, but Monroe doesn't do bottle service.  I love this - they have not followed the typical club scene formula.  There are two bars, which is key because it helps to keep the crowd even throughout the venue.  And, there is also a semi-enclosed outdoor space for the smoking crowd that has plenty of seats and allows for conversation away from the loud music.    The best parts about Monroe are the owners' vision and execution.  They have created a classy haven that puts many of their neighbors to shame.  They serve delicious bars bites, unique wines on tap, and a memorable time for all.  Their dress code helps to filter the crowd and their service is spot on.  Nader, one of the owners, is approachable and attentive.  I had a bit of a mishap with my credit card and ID that was not at all Monroe's fault and when I returned to level with them, Nader was sympathetic and unbelievably responsive.  He more than made up for something that was the fault of another guest at his venue, which is something most lounges or clubs might try to skirt.    Bottom line: this is not your typical, run-of-the-mill club.  This is a gem that would turn any club or lounge hater into a loyal convert.    Here's to Monroe's success!", 
    "review_date": "2011-04-28"
  }, 
  "X3CI-u2Qyu6FpVyVn9whXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas W.", 
    "review_text": "LAME AND SKETCH! We called ahead and confirmed there would be no cover on a Saturday night. We get there and the bouncer tries to collect a $5 cover. We tell him we were told there was no cover, he checks with the manager, comes back and tells us its a $10 cover. We argue, and then pay the cover. Once we are in we over hear the bartender telling the bouncer there is no cover, so we complain, and the bouncer doesn't want to give us the cover back. The bartender argues with the bouncer for us, and finally gives everyone back the money. The bouncer Jack is a douchebag, and I will never go back to this place for there poor customer relations. Any place in North Beach is better than Monroe.", 
    "review_date": "2013-06-23"
  }, 
  "sXY8OxAQVjj3D6zVkX3Vhg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Travis B.", 
    "review_text": "The DJ was good and the setting was cool, but the general management here is horrible.  We had four tables/bottle service reserved and upon arriving were told that we needed to stand in line.  There was no preference or VIP treatment for already having dropped a couple grand - and the tables were empty the whole time!  Luckily, a nice bouncer saved the day and let us in the back door.  Looks like a couple reviews have similar stories..", 
    "review_date": "2011-05-22"
  }, 
  "E-UQHZiT2Sa2cA-Y6jhEaw": {
    "user_rating": 3.0, 
    "user_location": "Stockholm, Sweden", 
    "user_name": "Jesper H.", 
    "review_text": "I was at Monroe's on a Wednesday when it was drinks for $ 1 and tacobuffe for $ 1.50. Good cocktails, lovely room and fine furnishings. Unfortunately, the music was so high that I could barely talk to anyone, but the music was great.", 
    "review_date": "2013-03-14"
  }, 
  "5lXbY8XZ0-ZWFFMNFXcj2A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott S.", 
    "review_text": "One of my favorite new spots at which to dance, carouse, and just chill and grab a bite with friends. From the door staff to the bartenders to the owner, this place is truly a well run outfit in every respect. While I'm not normally a big fan of the nightlife on Broadway, Monroe has proven to be an exception to the rule, as it possesses a level of classiness and sophistication that the other establishments simply don't possess. Looking forward to the many more fun times to be had. Thanks Monroe!!  10/11/11 -- owner went out of his way to return something to me that I was sure I'd lost. bartender was quick &amp; friendly. security was cool, accomodating [looked after my friend who just got a sports injury.] really appreciate the fact that they got me a valuable item back tonight.", 
    "review_date": "2011-08-17"
  }, 
  "4CA-qAu_Pbyn84JcNZnN-g": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Samantha G.", 
    "review_text": "I only heard about Monroe because my friend saw a UYE for this place and they were featuring an open gin bar. So of course we HAD to check it out! To our surprise, the place was dead. I found that interesting...I mean first of all, free alcohol and a Wednesday night? Oh well, that didn't stop us from enjoying ourselves.  I thought this place looks swanky and the couches were comfy.  The dance floor was a decent size and the DJ was spinning mainly R&amp;B and hip hop cuts.  I would have love to see this place on one of their busier nights but thanks to the open bar, we had a great time.", 
    "review_date": "2012-03-21"
  }, 
  "QPpPIMxWWDAWP376voLWtw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Kim K.", 
    "review_text": "I love the juxtoposition of dives, strip bars, adult shows, speak easy, tiki and lounges on this little section of Broadway. With the arrival of Monroe, there is officially a place for all tastes in the hood.  Monroe's look?  Pretty slick. A trendy blue wall, massive mirrors, tasteful chandeliers delicately dropped from airy ceilings. Check out the photos.  The drinks? Ah, there's the bit of the rub. The brunette bartendress was awkward behind the bar, throwing together a sad version of a cocktail on their menu. She told me there's another bartender who is the mixologist. So, in the meantime, they have an inexperienced person manning that menu? tsk.   The vibe? It was pretty quiet at 7pm Wednesday so I can't say. A few ladies enjoying the half price wine and light bites at the bar, another suit sipping a cocktail at the end of the bar. It's a gorgeous venue though, I look forward to spending a night in one of the cozy booths!", 
    "review_date": "2011-05-11"
  }, 
  "hSE3_ZdkaILWxxVrw_mt9g": {
    "user_rating": 3.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Diana M.", 
    "review_text": "As mentioned, I hosted a birthday party at Monroe over the weekend. Here's my update:  1) I was not aware that your guests had to fill out web form that needed to be completed in order to get on the guest list.  On the form, the guest had to provide an email addy as well as a phone #.  I personally thought that was TMI just to get into a party (that I'm paying for) so that Monroe can solicit their events.  Your guests can bypass this altogether but be prepared to pay a cover charge.    2) Because of the size of my party, I requested to have at least 2 seasoned servers who can handle a big group. Emily was our main server for the entire night.  She was an absolute gem and worked well under pressure. But as I anticipated, she was not fast enough to serve my guests.  The other server  was no where to be found.  There was an Asian girl backing Emily up from time to time but she was NO HELP at all.  Of course you can order drinks at the bar and deal with the line, but I also had a bar tab minimum so every drink counted on my bill. If you're reserving a booth, the policy is that it's one bar tab on one credit card.  Meaning, I would get stuck figuring out who owes what at the end of the night. No one was allowed to pay cash or use their card, otherwise, it wouldn't be credited to my minimum. THAT WAS NOT GOING TO WORK...and THAT'S not good service.   3) I also ordered a number of appetizers that was suppose to be served before 10pm.  THAT didn't happen either.  I lucked out that DJ ROSS One and Chris Larot was spinning that night.  If you don't know who Chris Larot is....CHECK HIM OUT! That boy is HOT! =) ALTHOUGH, be weary of the crowd he brings in!  I swear, I felt like Vallejo was reppin!  The night ended early cuz two fights broke out. Entertaining but c'mon now...really???  Even though there were a couple of snafus along the way, the party  was a success! That big booth in the back served us well for a party of 50! It was comfortable enough for peeps to chat, dance, drink, and watch. The rest of the area was PACKED! It looked like everyone was having a great time, including the bday boy who was being served Manhattans all night long!  And I owe it to Rosana and Emily for being really flexible!  I know I had a lot of expectations and it was such a busy night.  So thank you again for making that night a great one!", 
    "review_date": "2011-05-20"
  }, 
  "5eLI-Lbjjy0lC2hABS32Sg": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Natasha H.", 
    "review_text": "I'm generally not a fan of Broadway clubs (looking at you Impala, Horizon, &amp; Sutra), but I'd heard some pretty good things about Monroe so we decided to ring in 2013 here.   Unlike its fellow Broadway counterparts, Monroe does indeed offer a classier atmosphere than its ghetto neighbors. Decor is interesting...there's a large mural of a chick with a super intense gaze that's a bit unsettling. Crowd here wasn't too rowdy and wasn't 99% Asian like many other SF venues either.   But, I still wouldn't say I exactly enjoyed myself. Between people spilling multiple drinks on me, stepping on/pushing me, and a security guard telling us there were too many ppl at our friend's table &amp; that a few of us would have to leave, I was kind of annoyed by the end of the night. Although I wouldn't say these are faults specific to Monroe, just general annoyances that would arise with any club. On a side note, the dj was also late doing the countdown to 2013. Per my iPhone, it was already 12:00 when he started counting and then he said \"Happy 2003\" at the end. Thought that was kind of amusing.   Maybe it's a sign I'm getting old, but I found myself irritated more than anything throughout the duration of the night. It didn't help that a drunk friend went missing too. Finally found her on the corner of Broadway &amp; Columbus semi passed-out on some sleezy looking dude who was trying to get them a taxi (thankfully it's a b*tch getting a taxi on NYE).   Needless to say, I think I'm more partial to spending NYE 2014 at home with friends in my sexiest pair of sweatpants. This is not all at the fault of Monroe though, so three stars!", 
    "review_date": "2013-01-06"
  }, 
  "EmizCaxieR0gMw0a2hBn6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yuki K.", 
    "review_text": "I love Miles Aldridge. Best photographer ever.", 
    "review_date": "2013-03-06"
  }, 
  "adKonsQWY64vJYglPotH5Q": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Stefanie C.", 
    "review_text": "I'm reviewing Monroe as an event venue since I held a private event there. Payam made sure logistics ran smoothly and provided everything we needed from registration table to microphone. Good music and strong drinks. Our attendees all had a great time.  I love all the different areas to lounge inside Monroe, and the whole venue is just so photogenic. Plenty of space to dance or just chill. I have not experienced Monroe on a regular night, but I can attest that this is a great venue to host your next private event!", 
    "review_date": "2014-10-25"
  }, 
  "VCoBNwAUSvo0Sz2ORszOOw": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Mariel F.", 
    "review_text": "Food Recommendations   - Cheese:   cyprus grove chevre, organic strawberries, walnuts, &amp; blueberries  manchego, black cherries, marcona almonds, &amp; pimenton  toma piedmontese, pistachios, &amp; honey comb   - Charcuterie with grissini, cornichons, &amp; grain mustard:  finnocciona salami &amp; columbus sf hot coppa, fiorucci, &amp; south sf  speck, ricardinarra, &amp; alto adige  - Flatbread:  smoked prosciutto tomato sauce, pecorino quadratto, &amp; arugula  shitake and crimini mushroom, herbs, mozzarella, &amp; parmigiano reggiano   Cocktail Recommendations  - Bubbly Sanchez: Cazadores Reposado, agave, lime, grapefruit, and served up with a champagne float  - Paloma: Tequila, Agave syrup, lime &amp; grapefruit juice, rocks, and salted rim  - Penelope's Mustache: Champagne, crème de cassis, &amp; grapefruit  - Rum-manhattan: Sailor Jerry, Sweet Vermouth, maraschino liqueur, and served up with an orange twist   Bottle Recommendation   - Veuve Clicquot Ponsardin, Brut France   I like the Decor.  I would come back.", 
    "review_date": "2011-08-08"
  }, 
  "59QzQ3-dmOD1USV2hQpwkw": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Leo K.", 
    "review_text": "The venue formerly known as Dragon Bar, one of the places I used to frequent when I first moved up to the Bay Area. Ah, nostalgia. That'll get you some stars.  The remodel is nice, but it's still a NB Broadway club. Monroe does what it can though and manages to keep away a larger percentage of the riff raff than neighboring places like Impala, Atmosphere, Sutra (is that place even still open?), etc. Worth something in my book.  3 stars. Maybe I'll add another if they figure out how to prevent the giant woman-face wall prints from freaking me out when I'm as blitzed as I usually have to be to tolerate North Beach at night.", 
    "review_date": "2011-08-30"
  }, 
  "CplgFVLfKNSVnLvI8iTvgg": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Raja D.", 
    "review_text": "Its a cool place, good music.  Good pours!  I like the atmosphere definitely.", 
    "review_date": "2014-03-07"
  }, 
  "MjBYg_yA1uX9RooTHW8aKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A J.", 
    "review_text": "Went here for a friend's birthday not too long ago and I find myself wishing to go back..  Monroe is dark, classy, romantic. Vintage-textured walls and decor, yet classy. I like how this place is small and intimate. I have yet to go during the evening or happy hour...but I really really hope this place doesn't become the next \"it\" spot, it would def lose all its charm. But then again, I'm selfish when it comes to the things I adore ;)", 
    "review_date": "2011-11-01"
  }, 
  "v0k97XEwlDWwUTt8M8CJ4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy J.", 
    "review_text": "Pretty chill spot. Came here with my friend to try to catch the battle of the decades, which is just a drink promotion: 6pm - 7pm: $1 drinks, 70's music 7pm - 8pm: $2 drinks, 80's music 8pm - 9pm: $3 drinks, 90's music 9pm - 10pm: $4 drinks, 00's music  Pretty empty when we got there at 7pm. Very few beers here! Servers were all very nice. Will definitely come again for the 70's music, because that is the best! Plus $1 drinks is something that I missed from MacDougal street in Manhattan, something that SF needs more of!", 
    "review_date": "2014-09-19"
  }, 
  "ll9zYdUHd3fw8R3zfWezfg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole S.", 
    "review_text": "Monroe is everything you expect from a club: 2 bars, DJ, crowded dance floor, and bottle service. The lounge is split up into two major sections with a DJ located in the center. Mirrors and large curtains cover the walls. The mirrors are somewhat distracting but made the club look more spacious and swanky. Booths are situated against two walls in the large room for reservation. I saw little available seating without reservation. We reserved two tables with booths ($200 each) with bottle service for a birthday. We had no problem getting all our guests in without a wait.  Near the end of the night security was stationed to keep randoms from lingering around our tables. The cocktail server was professional and attentive. The DJ played a combination of hip-hop and alternative mixed with house music. Everyone has different taste, but I would have appreciated less pop and more new music.", 
    "review_date": "2012-11-04"
  }, 
  "C7p4AojhkDK3f6hqPSHwfg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Colleen M.", 
    "review_text": "Swaaaaaaanky joint!       All I have to say is that I'm happy that I didn't have to wait in line and that I signed up on the guest list.       The interior of this place is very cool.  Canvases hanging down with images that seem to be from anotehr time- a guy in a library, horse racing pic, and a giant head.  The drink prices were decent- 14 bucks for a cocktail and a beer.  I actually think this is better pricing than most places in North Beach.  Servicve at the bar was pretty quick, which was nice.    I wasn't impressed with the music- too ultra lounge cool for me- techno elevator music.  I'd much rather hear something that I know and can sing along with.    I'd have to say my favorite part of the evening here was the people watching- some of the get-ups people wore were just down right hilarious.  There was a person in a Mr. Rogers style sweater and tie and another dude wearing a vest, pink shirt, and bow-tie.", 
    "review_date": "2011-05-22"
  }, 
  "EM5F_M0yf9xeHGDXlWN1JA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica B.", 
    "review_text": "Really beautiful, not that big, upscale in decor/expected attire. Was here for a post-Coachella electric party which might have affected the crowd (there were some hardcore fist pumpers in the building). The decor was definitely the best part -- bartenders were a little on the slow side and there didn't seem to be as much mingling as I usually see at venues of this size. Still, we had a great time dancing here and I'm definitely adding it to my list of SF faves.", 
    "review_date": "2011-04-23"
  }, 
  "y3p7QITLF0hIdXp8qlZqAQ": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Michael B.", 
    "review_text": "sheek, classy little spot on Broadway, always good music and good times.", 
    "review_date": "2012-12-18"
  }, 
  "jCINSw46iGNPIiewBAO_XQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jessica K.", 
    "review_text": "Went here a couple months ago for a friends party. It was pretty damn good. Drinks weren't expensive. No ghetto ass people. LoL. Great atmosphere. The music kept me dancing all night!!!  The only bad thing was that some guy kept trying to grope me. We went to tell security but he said \"theres nothing I can do now, but point him out to me, and i'll keep an eye on him\". So 5 minutes later, the same guy was doing the same shit to this other girl! We told the girl to go tell the security guard, and the guy got kicked out. HAHAHA!!!   So if anything like that happens to you, the guards deal with it pretty well :)", 
    "review_date": "2012-03-31"
  }, 
  "eyvN-3OaUqWxbQfbU4ZGaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie N.", 
    "review_text": "Hmm... Sadly, like most clubs in SF, the bar itself is cute, but the people are ghetto.", 
    "review_date": "2012-04-28"
  }, 
  "sYVSUgC_qpSCDAArS0aeXg": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Miriam U.", 
    "review_text": "Monroe is an awesome gem on Broadway!  The beautiful decor and friendly,  professional staff made it an easy decision for me to book for my private event. Thanks guys!!!!", 
    "review_date": "2014-10-08"
  }, 
  "NEOSYsubf7SVeVm8RytxYA": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Michelle T.", 
    "review_text": "O MY GOD!  THIS PLACE IS MY NEW FAVORITE SPOT IN SF!!!!!!!!  You cannot go wrong here!    Everyone's exceptionally nice.  Even the guys at the front door! (hey let's admit...sometimes they are jerks or on ego trips)  The dj that was there the last time I was there spun good music.    The seating area is very comfy and cozy.  The decor was superb!  Very VERY chic and CLASSY (although surround by less classier things)!  The ambiance.... j'dore!  I'm gonna have to come here for happy hour.  I actually secretly hope that not too many people find out about this place so it doesn't get too crowded.  :)  GO HERE!", 
    "review_date": "2011-07-05"
  }, 
  "8Hy9l6WQWaCdhWe5KYNgEQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg J.", 
    "review_text": "The more I drank, the better it got. Came here for the opening weekend and was pleased with the decor &amp; set up (cool patio for watching the major production of purse snatchers, skeezers and hoodrats that is Broadway), drink prices, but the music will test your capacity for how many times you can listen to that accordion song and that J.Lo \"On the Floor\" tune....", 
    "review_date": "2011-04-17"
  }, 
  "kR2VQr85IZzTIV6fMHuKzQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elle F.", 
    "review_text": "Nice low-key lounge. Located on Broadway next to a lot of pretty tacky places, so you wouldn't expect to see something as nice as this in the area.  I like this place! It's pretty nice inside and there are plenty of places to sit. The dance floor is a good for the size of the bar, and the DJ wasn't that bad! House and Top 40. What I enjoyed the most is the fact that he's actually DJ-ing. I requested a song and he mixed it in just a song later. Great job!!   Good mix of people. Although the second time I went, I wondered it was pretty empty at first.   Well, another pro is that there's no cover. At least we haven't had to pay cover so far. Drinks are fairly priced and good.   I guess just work on promo and this place will be even better! :)", 
    "review_date": "2011-07-16"
  }, 
  "PDzUw2i2147OJ5ZD4T5-sA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patricia L.", 
    "review_text": "Went here on a Sunday morning after after party.   Way to dark.  I get it, your trying to be cool and hip and also keep people from noticing that everyone in the club were  the ugliest people I have ever seen. Granted, most people had been up (with help) for the last 48 hours (myself included)  but the darkness kept people from even being inside and permanent damage to my retina. Turn the dimmer up  a notch at least enough so that I can at least see where the bar is so I can feel better about being in such a shitty club.   The music was Endupy trance music. Whatever, fine at this  hour of the night I really could care less about what the dj is  playing.   Bouncers were chill, but overall the people who go there think they are way too cool.   One extra star because most after hours spots don't have the balls   to be open past 4:00am.", 
    "review_date": "2013-03-09"
  }, 
  "G94JclI-VV2I3nsTGJsT7g": {
    "user_rating": 4.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Ace V.", 
    "review_text": "Good looking venue inside. Bartenders are great! The crowd ebbs and flows through the night (was here on Friday). Battle of the Decades is a cool theme.", 
    "review_date": "2014-03-08"
  }, 
  "F_lKut0ESwVJHEKYsOv71A": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "DECO D.", 
    "review_text": "I have a great time always when I go to Monroe, nice place, beautiful venue, great staff, and the music is good.  I always go there when I am in SF area.  Great place to enjoy some good music and drink.", 
    "review_date": "2014-03-16"
  }, 
  "Ma_gwnVShENgTuhHNpAvyQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David C.", 
    "review_text": "Small almost quaint bar / club / lounge in a very happening area.  Decent prices on bottles, great service, not pompous in any way.  Mixed crowd of people, so definitely appreciate the fact that its a melting pot instead of being all Asian or all Latino.", 
    "review_date": "2013-11-12"
  }, 
  "3HHLpfU7q4HoREEOXtt7pw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "It really doesn't matter if you sign up for the guest list because unless you get there before they actually open or you're a girl who's \"friends are waiting inside\", you're NOT getting in. Also, who has multiple guest lists and doesn't update them before you open? We were stuck outside waiting for what seemed like forever and the line hardly moved...what a great way to celebrate my boyfriend's birthday!  I think the right hand doesn't know what the left is doing. Monroe, get your sh*t together! It sucks because you are such a nice, little lounge in comparison to all the other cLuBs on Broadway, but your attitude is just as bad as theirs.", 
    "review_date": "2012-03-13"
  }, 
  "l-7EvDtzaTSyQcXFOIzr4Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria S.", 
    "review_text": "Negative! Douchebag doorman thinks he's in VIVA Las Vegas.   Douchebag doorman: \"Are you on the guest list?\" Me: \"No, but I called and ask if there was a guest list and I was told that it's free and $10 after 11pm\" Douchebag doorman: \"Not on the list, it's $40 per person!!!\"  With a huge group, really? $40!!! Get the F*** outta here!!!  What kind of lounge ask for cover fees... $40 fee! need I say more?!!!  OVERALL: location is definitely not the best in town. Rude doorman (Mr. \"fear the beard\"). Long line and a very very very long wait. SUCKS!", 
    "review_date": "2011-05-25"
  }, 
  "AI_uDW2ZCck4pM0aMuSauQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L. A.", 
    "review_text": "I had a great time here for Battle of the Decades. The music was great. The DJ was good. Drink prices were great. The bar itself looked really nice. My partner and I got there around 8:00 the dance floor didn't really start going until 9:00 and it was a full dance floor by 10. The outdoor patio looks nice but unfortunately people use it for smoking so I didn't spend any time there. The Bathroom was clean. Over all the club was clean and new looking. There was a diverse group of people there. I would guess 30's was the median age group. I would go back.", 
    "review_date": "2014-02-22"
  }, 
  "HM6cvh5A9LLBeb4Sca6fPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vic S.", 
    "review_text": "came here to check out the place last month.  they totally remodeled the place with beautiful chandeliers, luscious seating areas, grand paintings and more.  the food is isn't bad and they offer happy hour wine specials.  can't wait to check it out on a friday/saturday night.", 
    "review_date": "2011-05-04"
  }, 
  "TN-SMdPNdWv2gHSzGqGHzQ": {
    "user_rating": 3.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Aasim K.", 
    "review_text": "This place was super crowded when I went with a few friends last Friday. We get in line and are on the guestlist so we didnt think getting in would be an issue, but the bouncer asked (ever so subtly) to be greased (SF is not Vegas!!), so I was immediately turned off by that.    Once we got in, the place had a decent vibe, the DJ was adequate, but nothing crazy.  I thought the atmosphere would be more loungy and conducive to talking.  It was not.", 
    "review_date": "2011-05-18"
  }, 
  "muWo0gd3xEZHpq7Xty1-Dw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dan a.", 
    "review_text": "first off, i have to say that i hate the broadway crowd and bars/clubs on broadway.  BUT, this place is great.  the venue is awesome.  lots of open space, two bars, booth seating, and cool art on the walls.  i met one of the owners and she was super friendly and great to talk to.    i may just venture out through the broadway scum again to make it out to monroe!", 
    "review_date": "2011-04-06"
  }, 
  "hkEmdF3NXVS7H4CzSDlqkw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin B.", 
    "review_text": "How have I never heard about their Wednesday night battle of the decades?!  I've been to Monroe twice in two weeks for Wednesday nights, and if I wasn't working late tonight, I would probably be there again. This place is a great way to shake off a mid-week funk. First off, there are $1.50 street tacos being grilled out front, so you can head here right after work. This is key, get there early. Drink specials start with $2 wells, but they go up every hour. The dance floor starts with 80's at 8pm, 90's at 9pm, and so on.  Depending on your age, this means the music either gets progressively better or progressively worse as the night goes on. But you'll be so full of $2 cocktails by the time Ke$ha and 'Lil Wayne come on, you won't care.", 
    "review_date": "2013-07-10"
  }, 
  "fpYIJYF0nqOAYtuz5zZPfg": {
    "user_rating": 3.0, 
    "user_location": "Saint Louis, MO", 
    "user_name": "Karen D.", 
    "review_text": "I came here on Friday, after the Battle of the Decades, cover was $10. The vibe was super positive minus a few creepers here and there, the floor was extra sticky too.  I've never seen so many white people dance like they dont give a fuck before in one place. So bad dancing was totally accepted here. The dj was alright, the transitions could've made more sense but whatever. Theres an outside patio, mostly made for smokers and people who want to hold an actual conversation.  The girls restroom was pretty nice, but like the rest of the place, the floor was sticky. There were two stalls and a good sized mirror.  It was pretty fun from 10-12, but started to die down, too many white girl wasted girls.", 
    "review_date": "2014-03-15"
  }, 
  "QP5mx537MpW7a190MSTSJQ": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Marina N.", 
    "review_text": "I would give this place zero stars according to its zero customer tolerance. We were going to  celebrate my friend's birthday. We signed up into a guest list in advance and planned to be \"just in time\" before the guest list is closed. Unfortunately parking is not easy in this area so we showed up at 11.04. Apparently no verbal excuses for 4 minutes delay were accepted , but $20 charge per a person welcomed. The place was nor even close to being full... I hardly believe in any rationals of this restrictions and  would not pay a penny for such kind of attitude... The evening was ruined. It was not a bad luck but a bad service. I hope this plaice will disappear soon.", 
    "review_date": "2012-02-04"
  }, 
  "3Kez9bH-HpprpXbIpRWINA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Stacy P.", 
    "review_text": "I LOVE this venue! All of the owners and staff are super professional and accommodating.  Always feel at home here!  Sunday morning mimosas are fun there too:))) They have awesome VIP tables/booths that are perfect for a more private party for any occasion!  If your in to top 40 and mash ups then Friday and sat nights are for u.  If you like house, techhouse, techno, soulful house then Thursdays and Sunday's are for you!", 
    "review_date": "2012-01-25"
  }, 
  "hFuYtKcJKVLXLURJLx6DoQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina A.", 
    "review_text": "For starters it's in the touristy part of Broadway but close enough to the financial district that locals and professionals could frequent this place. The sign is very hard to read from the street, but maybe that is the intension.   I came here for the Grand Opening party and arrived at 7:30pm, so by that time it seems like people already came and went but there was still a crowd at the bar. Free cocktail offerings were nice but the music and the vibe seemed a bit off. Openings are always hard time to judge what the vibe is like without such an event.  Whatever \"appetizers\" were there they ran out of fast, I think I managed to get a cracker with some pâté' on it. For a \"Grand Opening\" the pâté' cracker seemed kind of weak.    It is possible that I could come back here and check it out on a normal night.", 
    "review_date": "2011-04-05"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "old dragon bar in younger days...new monroe...keeping the layout similar...outdoor caged patio...inside bars and small dance floor...double scotch, jack and coke and screwdriver $thirty....little wiggle and chat with the crowds...two jack and cokes, and rockstar vodka $twenty-six...sipping drinks outside...inside quite loud with music bump'in'...pictures and chat...cheers and drinks...haven't been to a club in years!...tired!", 
    "review_date": "2011-09-20"
  }, 
  "qAs0KtoGxJ2XMPKCLdZVmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lauren j.", 
    "review_text": "Everyone needs to come here before it succumbs to the \"broadway scene\".   Monroe took over the old Dragon Bar and it is AH-MAZE-ING. The venue was redone beautifully and gives off a great ambiance. In fact, once you're inside, you don't even know you're on Broadway, it feels almost Vegasy.   The venue is spacious, the booths are gorgeous, and the crowd is great. There has was no cover...not sure if this is to encourage patrons or if it's going to stay this way. The guys at the door were nice, the bartenders were fast, and the music was fun. Only odd thing about this place is that they do not offer table service. Instead, you can reserve booths w/ tab minimums (the one our friend had, was $250).   They were also picky about guys' dress code...if you don't have a booth or guestlist going, they may give you a hard time about sneakers.   Definitely going back.", 
    "review_date": "2011-05-09"
  }, 
  "5UDpc2CMOgbf3GePS6SGVA": {
    "user_rating": 4.0, 
    "user_location": "Larkspur, CA", 
    "user_name": "Christine R.", 
    "review_text": "Came here to celebrate its one-year Anniversary along with a friend's fashion launch party.  I arrived early to savor the complimentary treats i.e., drink samples, sushi, etc.  I wouldn't come to this part of town for the clubs/lounges if it wasn't to celebrate a friend's party.  It's classier than the others down the street.  This spot has changed its name several times.  Broadway is just too ghetto!  The interior is chic and the comfy couches are a nice touch.  As it got closer to \"club hour\", I had to leave, the crowd was getting younger and more rowdy.  The staff were super friendly and on top of their game.  The DJ was appreciative of his fans and security did a fine job; otherwise, the kids can get out of hand.  I act like I'm so old LOL!", 
    "review_date": "2012-05-12"
  }, 
  "QVAmRIrCxhYLqh7wl4Vlog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen D.", 
    "review_text": "At Monroe's bar: Bartender: \"That'll be $6 dollars.\"   Me: \"Oh, I'm actually going to be paying for both of these drinks.\"   B: \"Okay. $6 dollars please.\"   Me: \"Oh, sorry- I'm not sure if you can hear me. This one, too.\"   B: \"Ah! It's still happy hour. Drinks are $3 each!\"   My mind was blown.  Reflecting on last night's experience of $3 drinks, free cover, and very nice bartenders, I'm starting to think that it was all a dream. Speaking of great rappers, the DJ played a nice mix of Tupac, Michael Jackson, Robin Thicke, Usher, 112, and other great music from the 90's and early 00's that got my group movin and groovin.   Head over here if you want to experience the amazing feeling of getting to a good level with just a $20 bill and great music.", 
    "review_date": "2014-05-31"
  }, 
  "jbOV66secENSq6-optuNOA": {
    "user_rating": 3.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Yolanda M.", 
    "review_text": "Get on the guest list for free admission certain nights before 11pm!  Since my friends and I got here pretty early and there weren't that many people, they let us sit on the couches that are typically for bottle service. It got a bit more crowded as the night progressed but nothing too crazy. There was typically enough dancing space and the couches were available all night.   Atmosphere: classy feel to it but the people dressed pretty casual. Comfortable and inviting.   Music: mainly Hip Hop &amp; RnB, completely up my alley.   Overall: good experience but not dying to return. Would definitely return if free, wouldn't go out of my way for it either.", 
    "review_date": "2014-07-22"
  }, 
  "t9b4q8MlLzwbnsELTuvrEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittany T.", 
    "review_text": "Monroe is a gorgeous new lounge located in the heart of North Beach.  It is sophisticated, yet unpretentious, beautifully landscaped, has spectacular art work and architectural design, organic wines on tap (eco-friendly!), and lots of DJ entertainment.   They have a wonderful happy hour Monday-Friday from 5-7pm (Wine Down Happy Hour offers 1/2 off all wines.  You can text \"wine\"  to 545454 for additional happy hour specials.  Add an in-house kitchen serving up some delicious tapas including hot flat bread pizzas, and this makes Monroe a must-do detour after a hectic day in the office.   Chill on the week nights or dial it up for the weekend, Monroe really brings a fresh, bold energy to the neighborhood, a welcomed flavor for even the most refined palette.", 
    "review_date": "2011-05-12"
  }, 
  "R4Jif1Q7vseoA2TqfzeQPQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Marevie T.", 
    "review_text": "Such a beautiful classy bar on Broadway... of all places! I loved the vibe here as well as the music being played the time I went. I would have never thought a nice place like this would be on that street!", 
    "review_date": "2012-05-08"
  }, 
  "hy0Tkh7nFwZDxGu1j1_noQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Minesh P.", 
    "review_text": "I went here with a bunch of friends for New Years 2013 and was thoroughly disappointed.   First, the online photographs make the lounge seem rather spacious and extravagant. This is not the case. I understand since it was NYE you can expect every lounge, bar and club to be crowded but this was based on my perspective prior to the event starting.   Also, the bar tenders were horrible. Many of my friends, including myself, has issues with not only getting our drinks but closing out our tabs. One guy heard me ask him to close out my tab, acknowledged me and then walked away to help out someone else!  In all the confusion my girlfriend and I left our jackets in coat check and realized this the next day. My girlfriend called them and the lady on the other line said she would happily hold them until we can come by next time. She did not specify a time frame. We don't live locally so the next time we returned a week had gone by. I asked the manager for our coats and he said he didn't have them. Essentially, they lost them. I was furious and he offered to compensate me for the loss. When I told him what we paid for my  P-Coat and my girlfriend's jacket he laughed and said there was no way he would give me that much money. I walked out of their with half of the money that both mine and my girlfriend's coats were worth.   There was no ball drop, no TV's or anything really special about this place given it was an NYE event.   Pros:  -Music -outside smoking area -cover was reasonable for NYE ($25)  Cons:  -Everything else", 
    "review_date": "2013-01-24"
  }, 
  "w72KMWZ05NYbGh8MZQlUjg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Daniel A.", 
    "review_text": "I love LOVE love Monroe!  Celebrated my Birthday party here on 03/03/2012 and everyone had an amazing time!", 
    "review_date": "2012-03-06"
  }, 
  "jlY5DAtE9Q1YK-Bv4otOiw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mariah M.", 
    "review_text": "This review is long overdue, and is for the Sunday morning Sundazed party (6am-12pm) only.  There was a long stretch where we were coming here EVERY Sunday.  Don't be put off by the location (Broadway, aka strip club alley), it's a gorgeous, old Hollywood style club with ornate decor and amazing music.  As a huge fan of deep house and the SF after hours scene, this is a dream come true! The music is deep and soulful, and the crowd is always mellow and friendly.  Drinks are super cheap (they even do bottle service) and the staff is incredibly attentive and friendly.  From the security to the bartenders, they are always on top of things. When you are out in SF on a Sat night that turns into Sunday morning, and you don't want the party to end just because the sun is coming up, head to Monroe! It's kept so dark inside you won't even notice the time, and just get lost in the amazing music.", 
    "review_date": "2014-09-18"
  }, 
  "S5e6VBXRHpShI8Tv9tc8-A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sweet P.", 
    "review_text": "Came here for a friend's BDAY for the very first time because everyone wanted to try out the place. Each of us had to sign up on the MONROE website individually to get on the guest list. They asked a few questions and you have to enter a CODE. Too much work for me! :0/ For bottle services and big parties, most clubs ask one person for a VIP guest list and that's it.   I must say, I was super intoxicated that night. I can't even remember what songs were being played. All I recall is dancing the night away in a HOT, STUFFY, JAM PACKED place. Another thing, bartenders there are a bit SLOW. I understand they were busy, but still...SLOW!    The one star goes to the great company I had that night whom partied with me. Adding another number to my list of BLACKOUT nights! =O", 
    "review_date": "2011-05-19"
  }, 
  "D2b4DENpkezsw90fC2vWdw": {
    "user_rating": 3.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Kim-van T.", 
    "review_text": "Wow I can't believe this place used to be Dragon Bar! The space has been swankily redesigned with lots of lush seating and moody lighting.  Super crowded on a Friday night. The dance floor isn't that big so be prepared to be squished. DJ was playing top 40s - fun for dancing! I may have heard some Miley Cyrus at some point but I can't remember....  Free cover if you're on the guest list and in by 11pm.", 
    "review_date": "2012-02-21"
  }, 
  "oV6WViTd1JunfZWndkK1Hw": {
    "user_rating": 5.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Jacqueline P.", 
    "review_text": "Went there on Sat night- Sunday and the DJ JJ Flores was sooo good! Sexy sexy deep house music! Great place for an after hours..dim sexy lights, and the music was off the charts! Cool people there too! Had a great time!", 
    "review_date": "2013-09-23"
  }, 
  "hVyXowHxeHXoIZjctOmKJg": {
    "user_rating": 3.0, 
    "user_location": "Hollywood, FL", 
    "user_name": "Jo A.", 
    "review_text": "it's one of two afterhour places i know of in town.  really nice crowd to mix with, i was told there are usually more people there than when i was.  i'll write another review if i go again.", 
    "review_date": "2012-09-09"
  }, 
  "zT7bGn-kckdiAwS3NBQP7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jill P.", 
    "review_text": "Love this place and almost hesitate to tell you how wonderful it is because I want it to be my hidden secret. The décor is transporting - you will feel like an old Hollywood starlet the moment you walk in.  They have a great wine list, tried the Vermentino at the recommendation of the incredibly sweet and attentive owners, Rosana and Nader. Delish. The bar bites are very tasty and complement the wine list perfectly. We were a larger group and had the opportunity to try all of the cheese boards - great presentation and scrumptious. Asparagus flatbread is to die. A must-try.  One of the members of our party tried the Melon d'eau, and while I am typically only a wine drinker, I will be back to have that on a warm summer evening. Refreshing and just the right amount of flawlessly muddled cucumber.  The service is spot-on and not snooty like other highly styled and beautiful lounges around town. Get yourself on over to Monroe ... I suppose I can share!", 
    "review_date": "2011-03-26"
  }, 
  "8JhznjX1xLSYv0ClzBCK9A": {
    "user_rating": 3.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Stanley P.", 
    "review_text": "I wish I could be more helpful but unfortunately this was a black-out night for my bday celebration. Gotta admit, the guestlist sign up was a bit of a hassle. I never heard anywhere else that you got to text to put your names on. And I apologize for forgetting the cocktail girl's name, (she went to Aragon High school, if that helps) was very friendly and helpful.  The age group is mostly mid to late 20's with the exception of a few older gentlemen. At first it was pretty empty, but the dance floor was packed after 12:30. Oh speaking of which, there's no dance floor strictly speaking. People danced in the middle section of the corridor.  Nice decor but a bit hyped up to be what has been expected. Maybe I'll come back.", 
    "review_date": "2011-05-28"
  }, 
  "GApGB_4pDkJOzrdhbAV3RQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rany M.", 
    "review_text": "My friend Sambo is the host at this joint. I went last night for the first time. I was expecting to hear some hip hop or R&amp;B, but it was Vegas styled type of music. The place is not too diverse. However, this place was real nice on the inside (decor) and it was not crowded so no one was stepping on my shoes :) Another plus I got in for free.. So I might go again.", 
    "review_date": "2011-10-08"
  }, 
  "MTYHPbTSSEo95Q56Xy_xmA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chucky B.", 
    "review_text": "the happy hour -- Battle of the Decades on friday is a blast. it starts early so there is parking, 6pm. The drinks start at $1 and there is a taco truck. no cover most fridays. people start dancing around 8pm and it usually gets crazy by 9pm. super easy, no dress code, just fun thing to start the weekend. i recommend it!", 
    "review_date": "2014-02-08"
  }, 
  "YCiIa96Nb4HOUTgdAW1mIg": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Elle C.", 
    "review_text": "I work nearby and this is where we go for happy hour. (yup, we work at an agency) Monroe's decor is swanky and sexy- I *love* how the spaces are sectioned off with such different ambient vibes and colors. It's a great place to lounge and chat, and since we go for happy hour we get a super attentive staff that piles on the drinks + food quickly and cheerfully.  I'm a bit of an adventurous drinker, and I typically gauge a place by blind-boxing my drinks (requesting the bartender's signature cocktail- or to make something based on a mood/flavor notes).   I must've had 5-6 of what our bartender made because it tasted like a dream.  It was a muddled strawberry/vanilla bourbon vodka and one other spirit that I can't quite remember...  but you can be sure that I'll be back at Monroe with my glass drinking slipper until I can find that drink again~!", 
    "review_date": "2013-06-01"
  }, 
  "6vZiVk2vyOVqkeNpcGHxfA": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "Camille T.", 
    "review_text": "What a pretentious piece of *BLEEP* BLEEP* BLEEP*! No ins and outs. Power trip, much? They would lock people in this club to pretend the line is outrageous, and it's the \"spot\" on a saturday night. *BLEEP*ing ridiculous. Go *BLEEP* yourselves, Monroe.", 
    "review_date": "2011-05-23"
  }, 
  "OfT0-CyhUbvqh3RPdBjDLg": {
    "user_rating": 1.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Michelle R.", 
    "review_text": "If I could give no stars I would! This place has the worst bottle service/VIP ever!!! Do not have a birthday party here. My wife Joanna Reyes-Neil spent alot of money just for us to share our area, we didn't have enough seats for all the people we paid for and the service was the worst. Managers wouldn't even come to talk to us. It's like once they have your money your screwed! Almost ruined my bday :(", 
    "review_date": "2014-11-01"
  }, 
  "IkaZFgXvVgweDctGBi8SKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy R.", 
    "review_text": "I absolutely love Monroe. I happen to visit on nights that are a bit unusual, unusual in the sense that it is Sunday morning.  From 6am-12pm they hold one of the best after hours in the city with some of the best names in the game.   I can say I've been here after a grand all night dance escapade and was able to keep the legs alive long enough to enjoy my time at this space.   The half of the venue they use has a great dance floor and multiple booths and sitting areas to rest and chat with your friends. The sound system is excellent, allowing you to feel the music while being able to carry on a conversation with your friends. If you are like me, you enjoy that time to carry on between a song that grabs you by the hands and sends you to the dance floor.   The cover for Sunday morning's is 10 dollars. They have a patio you can smoke on and seating out there as well.  BOTH of the bartenders are great! The girl is always smiling and the guy is handsome and polite. Every once and a while you'll see the owner, Nader, helping out as well which speaks so much of the venue and himself.   I enjoy hearing Lisa Rose, Nikita, and other great names in the tech house/techno scene here. It is a refreshing change from the endless house or progressive house you'll hear elsewhere.   If you like after hours, get to Monroe on Sunday morning. You won't regret it!", 
    "review_date": "2013-08-21"
  }, 
  "mXr5yqXqEIF4bat_at3kjA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Brian b.", 
    "review_text": "Music is Dope. Staff is pretty awesome. We had a good time here every time. Wednesdays are really fun and weekends are just off the hook", 
    "review_date": "2013-11-17"
  }, 
  "iAZH8a5teELieRBV8Acb6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aimee B.", 
    "review_text": "I stopped by Monroe with Miss N. after work on Wednesday and loved the fact that we had the place to ourselves.  I guess it gets a lot more hoppin later in the evening, but that's not really my bag.  A nice quiet place to drink and chat is just what I like.  It's a big space and decor could be described posh vintage.  I would definitely consider having a group outing at this place.  There are 2 bars, which I'm sure come in handy when it is busy.  A cool thing about Monroe - they have wine (good wine) on tap, and happy hour specials at 1/2 off, which is really awesome.  And great food as well.  Tim, da friendly man behind the bar, hooked us up with a lovely charcuterie/cheese plate - loved the gherkins, honeycomb, fresh berries and nuts that accompanied it all.  I look forward to returning.", 
    "review_date": "2011-10-06"
  }, 
  "wpazdZ37epyyUslec-ujcg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jackie M.", 
    "review_text": "This classy lounge/club is located on Broadway next to some pretty sleezy strip clubs and ghetto dance clubs, but surprisingly Monroe was actually really elegant and trendy. The venue is pretty dark, but they have pretty cool light fixtures and paintings that help the place not seem so dark. The dj last Saturday night was awesome and played a mix of house and hip hop that I really enjoyed. He def kept the crowd movin all night. There's also two bars to help keep people having fun. The drinks are average here, about $10 a shot. They also have a semi-outdoor smoking area with seats. Although Monroe is relatively small it accommodated a lot of people and had about 3 tables beside the dance floor and also had a private table area. The dance floor is kind of small, but considering how nice and how good the music is here, who cares! I will definitely be coming again.", 
    "review_date": "2012-01-03"
  }, 
  "H9LVW5HzFvsLzUxC-0W4hA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tram N.", 
    "review_text": "First off, their customer service is mostly unavailable. This is frustrating when they are listed as open and do not pick up the phone or return messages during business hours. How inconvenient for people who need assistance ASAP.  On to the rest of my review...  I came here on a Friday night for my bff's birthday celebration two months ago. It was a little hard to find -- I mean, I almost walked right past it until my friend called my name. It was so dark and there were no lines.  Part of the lounge was closed, probably due to lack of people so it became a TINY, TINY lounge. Very small dance floor right in front of the DJ booth and even with the small space, it was still slightly empty! I HATE that the restrooms are downstairs. This is just asking for drunk people to break an ankle. We had bottle service and I remember the waitress frequently disappearing as I was pouring my own drinks for most of the night.  Music is okay; not my type of jam so I can't completely comment on it without being bias. If I ever come back here, I hope the other part of the lounge opens up.", 
    "review_date": "2012-12-17"
  }, 
  "8lG1Q7vy18sSVMb9K0xfuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jo S.", 
    "review_text": "Bridal/bach party cont.  Honestly...I don't remember much about Monroe because I was already wasted from the bridal dinner at Kokkari Estiatorio. My MOHs reserved a table/lounge area for us. The lounge area was spacious. The bathroom was clean which was surprisingly for a nightclub. I spent quite a few minutes there throwing up my booze :*) From then on the rest of the night was a blur. Thank goodness for cameras/pics...now I can see what happened the rest of the night. All my GFs had a great time and enjoyed the music.   Thanks to my MOHs for planning this bridal/bach party for me. I had a blast. Love you!!!  24 more days until my wedding!!! YIKES!!!", 
    "review_date": "2011-08-03"
  }, 
  "Rw5RFPbHG6YUjXpmz4bd4A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian Y.", 
    "review_text": "Sleek lounge with fairly priced drinks.  Love the interior design and atmosphere of this place. The music wasn't bad either, the DJ was mashing some top 40 on house beats. They have some good beer and wine selection.  They have a nice sound system, but the music was playing a tad bit too loud for me.  There is an outdoor smoking area for you smokers. Dress shoes required for guys.", 
    "review_date": "2011-07-10"
  }, 
  "swocJWD8R1iH20-lveXh0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosalind S.", 
    "review_text": "The good thing about attending a friend's birthday is that you sometimes find yourself at a place out of your element.  I found myself, on Broadway, across from the nudy bars, where your car will be towed at the stroke of 8pm.    This is the old Dragon Bar, the layout is apparently different, and so is the interior.  What a gem of a place, to be dropped in the middle of ghetto central and to find yourself in old Hollywood.  I like the theme but I didn't notice a cocktail list so I ordered my regular rum and diet coke with a lime.  It would have been nice if they tied in some Hollywood glamor into some signature cocktails.  I will note that they a good selection of Belgium Ales, like Leffe.  I also have to note the great location for the dj booth.  Some lounges get it all wrong and stick them in awkward spots.    Since I was at a private event, half the lounge was closed and the smaller bar was used.  The one bartender was great and funny and took care of all of us, probably at least 50 of us all together.", 
    "review_date": "2012-03-11"
  }, 
  "KdOirp3XTeMquB6s1BhZLw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Viola C.", 
    "review_text": "Beautiful lounge but played house music almost the entire night, maybe one top 40 after 30 mins or so. Don't think i'll go back here again.", 
    "review_date": "2011-07-07"
  }, 
  "1dW1kLdcKuQprnhi4pC_iQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Séamus C.", 
    "review_text": "Really great to see a new small business brave enough to open up on Broadway street. The venue itself has a very polished feel to it, Art work on the walls, exposed red brick true-out the space, marble bar counter tops, enclosed patio that one can smoke on A+, Cocktails are well priced (Average BTW $11-$13). Service was fast and friendly  Mixed crowd, age range late 20's-30\"s", 
    "review_date": "2011-05-26"
  }, 
  "uU7GIgzs4-5Dtp9Vuymb3A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nhung T.", 
    "review_text": "This place was small but plays pretty good music, think it was pop/hip hop. Oh boy it was packed on Saturday and no tennis shoes for the gentlemen....  The crowd was decent, couple of rude guys but hek they are everywhere. The drinks are good, well can't go wrong with vodka tonic.", 
    "review_date": "2011-05-06"
  }, 
  "DAIF6BwUEBCPqPvhNby9IQ": {
    "user_rating": 3.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Dorothy N.", 
    "review_text": "If you're planning to go out on Wednesdays, this is the perfect place to pre-game for CHEAP, and eat up some delicious tacos. $1 well cocktails and select beers (PBR, Coors Light, Rolling Rock and some others) before 9 and $2 before 10.  And, it doesn't get busy until 11pm anyway. That's when you can start heading out to the real party!   If you're here on the assumption that you'll get to bump and grind to all the old school jams from your childhood, think again. The Battle of the Decades on Wednesdays is WEAK and WHACK!  I came specifically for the 90s hour, and was very disappointed.  I liked Vanilla Ice and Salt and Pepa, but everything else was unrecognizable! According to the DJ, the owner doesn't like gangsta rap, but he assured me he would play it anyway.  He  didn't.  What a p*ssy!   As you can see from my quick tips, I spent most of the night in frustration writing quick tips and eating tacos, instead of dancing. We left around 11.   The decor is beautiful and very retro (which I LOVE), but when you get there it looks nothing like the pictures because they close off half of the club.  I guess it doesn't get too crowded, which could be attributed to the crappy DJ.", 
    "review_date": "2013-04-05"
  }, 
  "rIvBn_8Bj4BpAWu1PHr6xg": {
    "user_rating": 4.0, 
    "user_location": "Durham, NC", 
    "user_name": "Sophia N.", 
    "review_text": "Hopping place, but super crowded. No creeper guys, which is always a plus. Small dance floor but FANTASTIC DJ, Monroe got an extra star just for him. Coat check is behind the bar, and don't be intimidated by their dress code rules: just don't look like a bum. You don't need to wear four-inch heels.", 
    "review_date": "2012-12-07"
  }, 
  "bZidZJZq9Lf5WZMrmJLH3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice Y.", 
    "review_text": "LOVeeeEEE this place! I want to keep it all to myself :)  Monroe is such a well-rounded, beautiful, classy lounge. The music on the weekends is top 40 which is a great change from the usual broadway \"shake it like a salt shaker\" music. Great mixed crowd of class people, no super wankstas or skank h0es that want to throw down all night.   During the week, half off wine happy hour is amazing.. I recommend the rouge red wine.. my favorite. along with their flat breads and cheese plate is a MUST!!!  Managers Nader and Rosana are heaven sent people. Very genuine, friendly, great people.   Bartenders are really cool, friendly and talkative. Great cocktail list that changes with season.   All in all... amazing.. try it out! :)", 
    "review_date": "2011-08-03"
  }, 
  "HFkqjlom9cdUFC-2SHsrFA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kyle F.", 
    "review_text": "It is not just lounge and bars, there is as well a small dance floor and DJ to crank it up high!! met some cool friends there and had fun.", 
    "review_date": "2012-07-28"
  }, 
  "FpOste6Fh4ppO7jol-JlQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacqueline G.", 
    "review_text": "Quite the upscale place. I like the vibe, but it's a little too low key for me. The music can get really loud and because it's such a small place its hard to talk over it. I don't like how the bathroom is down some steep ass stairs. If you're drunk and wearing heels-BEWARE. In reading some of the reviews, I knew they had a guest list but no idea they had a cover! I think I have a little bit of an issue with the art... I like the idea of the female paintings but a random horse? It kinda threw me off. I love the outdoor patio though! It could be nice on a warm night.", 
    "review_date": "2011-05-29"
  }, 
  "imfGFZWKP2rdTh4Kx0mEJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniella S.", 
    "review_text": "This place was beautiful!  It was big and had a covered smoking area which is always convenient.  I wouldn't say that I loved the crowd......but there was good music and a good vibe.  I got in immediately even though there was a line, I'm not sure why, but apparently girls don't wait in line?  Somehow the guys that were with us got in immediately also but again, I'm not sure how/why.  The drinks were affordable but I think they could've used another bartender on staff because we waited for a long time at the main bar for drinks.  The back bar was fast though so as long as we ordered from there we were good to go.", 
    "review_date": "2011-05-14"
  }, 
  "CLkeY_rv2JUcfaf9UuVS7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thibaut L.", 
    "review_text": "Happy Hour! Monroe's best kept secret is their incredible happy hour offered on Fridays from 6 to 10PM!   The concept: *6PM-7PM: 70's music + beers &amp; well liquors prices_ $1 *7PM-8PM: 80's music + beers &amp; well liquors prices_ $2 *8PM-9PM: 90's music + beers &amp; well liquors prices_ $3 *9PM-10PM: 200's music + beers &amp; well liquors prices_ $4", 
    "review_date": "2014-09-22"
  }, 
  "Ftx7t5FJ3vvCj0GLSs5fCQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Piccolina P.", 
    "review_text": "My new favorite lounge to meet up with friends for drinks! Love the decor - classy and chic with plush booths.  For my friend's birthday I decided to invite our friends to meet us at Monroe for drinks &amp; chat session.  Wow - what a great place.  Music was just right.  Right volume so that we don't have to yell at each other.  Comfortable booths.  Our server was on point and friendly.  Fabulous happy hour specials until 9 pm. (Note - bubbles / champagne / prosecco are not on the happy hour list). Nibbles were just OK. Nothing great.  Can't wait to come back to Monroe.    .....I think Dragon Bar used to occupy the space.  Monroe is 100 times classier.", 
    "review_date": "2011-04-01"
  }, 
  "M0mONsg1ZJIKA30ad1qE1w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina A.", 
    "review_text": "Cover: free before 11 on guest list, line is short and moves quickly  Venue: fairly clean with fancy lights, small dance floor  Clientele: keep your hands on your wallets and phones people!!  the crowd is hella shady and walk right into you and feel up your pockets, even when you're standing in an open space!  also, be prepared to witness some ratchet hood rats who twerk.  this is the kind of place where people dance face down ass up.  mean age is around 30, FYI  Beverages: Tokyo Tea tasted like someone premixed it in a plastic bottle and let it sit out in the sun, then re-chilled it with all the plastic leeching and put it in a cup for me.  in other words, terrible.  none of the 5 people i went with seemed to be enjoying their drinks either.  Music: current hip hop, half of which was dancable  2 stars for the friendly bouncers and the DJ that actually used a turntable  needless to say, we were in and out within 20 minutes", 
    "review_date": "2013-12-09"
  }, 
  "O26RtdaE9MvexG96PPoxLQ": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Grace C.", 
    "review_text": "Classy decor but lacks class.   A couple of my friends paid in advance to reserve the back section and bottle service for a birthday bash. All of us guests signed up individually onto the party's guestlist ahead of time to ensure Monroe had our names. You would think that because the hosts provided the $$ upfront, they wouldn't have trouble getting into the club, right? UHHHHH, NO.  Everyone was being shooed to the back of the line because, according to \"God\" (aka the bouncer), there were too many private parties scheduled and he didn't care what reservation we were part of. What kind of excuse is that? Why overbook if you can't provide the service? Apparently, Mr. Power Hungry didn't like having his authority questioned and I almost didn't get in that night. Almost.  Finally, after the issue was brought up with the manager, the guests were allowed in. I felt bad for the others in line because security began charging $40 at the door.   The music was mainly house, which got old after 2 hours. Lots of bouncing, not enough dancing.   Interior decor was fabulous though, I must give them credit for that. Deceivingly awesome. Perhaps if we had a smaller group and no reservations were involved, the experience could have been incredible.  In conclusion, this place has potential. Management could use some work and that bouncer needs to get laid.", 
    "review_date": "2011-05-24"
  }, 
  "tTW7ILzRPcqDvJvqddlGVw": {
    "user_rating": 1.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Mandy R.", 
    "review_text": "Went here last Saturday, but oh geez where do I start?    Pros of this place: + replaced Dragon Lounge/Bar/whatever place before that sucked + the inside was very nice + sound system was good  Cons of this place....brace yourselves: - the worst house music I've heard in a looooong time, like seriously it was the same muthafreakin beat the entire night!  I like me some tiesto, benassi, swedish house mafia, and mashups but this dj was doo-doo playing monotonous beats - overpriced drinks galore-- good luck trying to get a cup of water for your drunk friend because the bartenders will ignore your request, hand you a dannon water bottle and $3 bill (to which I looked at them crazy and said I wanted a glass of water so my bf doesn't yack all over your stupid bar) - bartenders in the back take themselves waaay too seriously, calm down killer this isn't LA or Vegas - the bouncer(s) in the front are a JOKE.  My friends and I were on the guestlist and got there *just* after 10pm (literally 10:05pm) and he looks at us and goes \"$20 each\", I had to keep myself from laughing in his face but told him we were with a party inside that had bottle service (which was true) to which he says \"fine, you in for free, you two guys in for $10 each\".  Pfft whatever dude.  Mind you, the line was 4 people deep. - THE CROWD IS SOOOO NOT MIXED, all y'all who claimed this was a mixed crowd must have been schwasted lol.  I love every group of people, but this place was leanin HARD to a certain crowd (hint: I sincerely love the spicy and veg dishes these amazing people make).  Hold your comments, I don't like any places that are predominantly ANY crowd, so if this spot had been super Black, White, Latino, Asian, polka dot, or whatever I'd be irritated.  If the only \"off\" thing you notice about this place is that there's that random horse portrait, chances are you'd like this place because that horse was the least of my issues lol  Hint: If you get dragged here, there's hope, go a block down towards Impala (don't go in!) and visit the Vin Club.  Great wine, low key crowd, cool bartenders, and nice vibe.", 
    "review_date": "2011-06-09"
  }, 
  "zR_KgIE6woyAa_ffnGAJ2Q": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Corrie C.", 
    "review_text": "If I could give a negative review star I would. Sevep is the rudest person I have ever come in contact with!! He is the fake bouncer at the door who the club decided would determine If people are allowed in or not! We had a bachelorette party and he turned us away because of his ego. I wouldn't recommend anyone waste their money here.", 
    "review_date": "2013-05-10"
  }, 
  "qyUClLMSiIqXldzuKlUEyQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Thang H.", 
    "review_text": "Great NYE party! Great Bottle Service! Great DJ! Went here for the NYE Soiree party and me and my friends had a blast! thanks Monroe for doing such a great job!", 
    "review_date": "2013-01-02"
  }, 
  "naifXR01bJWOF1gsvp_ixw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anthony L.", 
    "review_text": "So Im not really one to write reviews but after last night I have to give my input.  1) The bouncers really pissed me off.  We had a large group of people coming from all different areas of the bay to celebrate two birthday.  All of us trickling in over the beginning of the night and the bouncer wouldn't let us in because our \"first group\"  that showed up was 4 guys.  We easily had a 1 to 1 guy/girl ratio for the entire group but because not everyone was there at once, he made us wait outside where it was cold and windy.  The place was pretty empty the entire night except for us and 3 other small groups and the bouncer acted as though they were full capacity.  The whole night he was walking by our group and harassing us.  And to to top it off, he kicked out two of my friends because he \"thought\"  he saw them having sex but i can tell you that they are not that type.  In my opinion that guy should be fired.  And if that is the kind of people they keep working there, I would say never go back to this place again.  2) On a positive note, the bartenders are all awesome and the DJ was hittin up good music.  Sucks that the first impression was the bouncer.", 
    "review_date": "2011-05-21"
  }, 
  "K2hRhu2g-LR4qpxDsaAtzQ": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Debra T.", 
    "review_text": "Monroe completed my birthday night. I got a table complimentary of Rosana and my friends and I had a fabulous time in the VIP lounge. My favorite part about this place is the decor and the interior design. It's very chic and contemporary. Drinks were delish and music was great.  The only thing I hated about this place was that it was infested with creepy ghetto asian guys. Several of them thought they were so cool to just plop into my lounge area... But I guess I can't blame Monroe for that infestation.", 
    "review_date": "2011-08-08"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "This place is good if you have a large group and you get here early.  We had a friend spinning so we enjoyed the night here and danced for three hours!  If they don't open up the other bar, it's kinda small but it's fine.  The crowd was very mixed in age and ethnicity.  In the beginning were more older people and towards the end there were a decade or two younger.  The taller, African American bartender with the newsboy cap was awesome and efficient.  The beers are $5 so people were drinking shocktops all night.", 
    "review_date": "2013-04-08"
  }, 
  "3cnIyELXdZa9C9nFH5NXtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veasna H.", 
    "review_text": "I haven't been to North Beach to go hit up a club/bar in a while.  I wasn't expecting much, but I was pleasantly surprised by Monroe.  I was expecting somewhat of a hassle over guestlist and stuff, but none of that.  The bouncer scanned my id and it verified I was on the guestlist...easy peasy.  The decor itself was okay.  I can see its trying to be more swanky than most of the place in North Beach.  I kinda like it, it was clean and not over done, somewhere in between Harlot and Manor West.    The music was decent.  Top 40 mash ups with some hip hop.  Good enough to keep people dancing and not getting too heavy on the house/rave side!!!    The only down side were the drinks.  Bartenders were compitent but a little slow and light handed. I didn't order anything too complicated (I usually drink whiskey and soda when in the club), but it wasn't even that busy and I felt I had to wait too long.  I would go back to Monroe if I was looking to party in North Beach.", 
    "review_date": "2012-01-16"
  }, 
  "_x6GOzt4OqSO5OeO6RExbA": {
    "user_rating": 4.0, 
    "user_location": "Eugene, OR", 
    "user_name": "Timorei A.", 
    "review_text": "Wednesday happy hour. Go. SUPER cheap drinks, awesome DJ, taco cart. Could use a bigger dance floor, but I still had enough space to bust a move or two. I can't speak for Monroe on regular nights, but it's happy hour gets 4 stars fo shooo.", 
    "review_date": "2013-02-25"
  }, 
  "r636kd302eGgDGuS-dR4bQ": {
    "user_rating": 3.0, 
    "user_location": "Brookline, MA", 
    "user_name": "Paran Y.", 
    "review_text": "the woman on the wall staring at the entire club scared me.  am i suppose to know her?    definitely an upgrade from dragon bar, which i have always equated as a venue where people go to get things stolen or molested.   monroe is new, fresh, and probably one of the more 'scene' places you can go currently.   however,  the fact that the bouncers thought they were doing us a 'favor' by letting us skip the line after we bought 5 booths didnt bode well with me.    oh yeah, and i hate house music.", 
    "review_date": "2011-05-22"
  }, 
  "Hjs3IOOMzXtom68wB4FC-A": {
    "user_rating": 1.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Robert G.", 
    "review_text": "I left a bad review and the owner emailed me.  So, I gave him my phone number and he called me to ARGUE?!?! That's all I have to say. Take your money some where else.....", 
    "review_date": "2014-11-04"
  }, 
  "XkLK2iBsgqF6mWwDfRgqqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seong P.", 
    "review_text": "I'm giving it 4 stars because my friend reserved the big booth in the back.  It was a very large and comfortable place to chat, dance, people watch and drink.  Our cocktail waitress was also a sweetheart, even though she was the only one working that night.  I was happy not to have to deal directly with the rather slow bartenders.  Without the booth, I don't think it would've been as cool though.", 
    "review_date": "2011-05-17"
  }, 
  "_Hv48mu_6lpOgo3edR3yaA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Szu H.", 
    "review_text": "Checked this place out on a Saturday night and really liked it.  Parking in the area is difficult so we ended up in the Columbus garage which is $2 bucks every half hr.    We got there at 11:30pm.  No line or cover charge.  Music was mostly top 40's.  Beautiful interior decor!  Almost surpringly nice for the area.  The place was crowded but not packed where there wasn't room to dance.  The music is especially loud so conversations are difficult.  But I guess you don't really go to a dance club to chat up a storm, right?!  Anyhow, they do have a covered outdoor patio area with a good amount of seating for smokers and those who actually want to converse so overall, a nice set up.    Met the owner who was really nice too.  She was behind the bar mixing up drinks!  Very cool.    I've added Monroe to my list of places to go and dance the night away!", 
    "review_date": "2011-04-25"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Swankyness on Broadway?!?!? YES SIREE!  To me Broadway is the epitome of ghetto nightlife. It just attracts swarms of rowdy people which is just drama waiting to happen, so I tend to avoid this area. However, after hearing how nice Monroe was, I really wanted to check it out.   Brought to you by the same designer as Gitane (prized as one of the most beautifully designed restaurant in SF) and Chambers Eat + Drink (new restaurant/lounge in TL), Monroe (formerly Dragon Bar) is the swankiest club/lounge that has ever set foot on Broadway...  On Friday, 8.5.11, my friends and I came to Monroe at about 10:40 PM for a party hosted by LevelSF/Synergy.   L I N E  One line for General Admission and Guest List. Though we came a bit later than anticipated, we were still able to make GL. To play it safe, I do suggest coming earlier though if you want to avoid paying cover.   C O V E R *Free if on GL (closed at 11 PM) *$20 General Admission  D R E S S  C O D E Club attire and dress shoes only (security was strict on this). The crowd was decked out in classy club attire; no ghetto hoochie mama attire here like at neighboring clubs.   C R O W D ASIAN INVASION in their early 20s but only because it was hosted by an Asian promotion company. I've heard on their regular in-house promoter nights, Monroe was a mixed crowd with people in their late 20s. I would definitely come back on their regular nights to check it out again.  M U S I C DJ Clinton Lee was spinning Top 40s, Hip Hop and Mash-Ups that night.  BAR/DRINKS Two bars; one in the main room and a smaller bar in the back room. Top shelf liquor drinks and shots were $10 each plus tax.  The bartenders were friendly, fast, and efficient especially the female brunette at the main bar. After the first round, she already knew our orders from heart.   A M B I A N C E / D E C O R AMAZING! The designer did an impeccable job transforming the previously cheezy Asian inspired Dragon Bar to a swanky lounge/small club that screams C-L-A-S-S! A modern twist to the roaring 20's, Monroe is decked out with custom light fixtures, plushy sofas, rustic brick walls and contemporary flapper paintings.   The main room houses the main bar and a partitioned bottle service area to the left.  The back room has a small dance floor and one of the most beautiful main bottle service areas I've ever seen. The w-shaped couch is massive and can hold a large party, so if you're throwing a big bash, definitely request bottle service in this area.   There's a small outdoor patio/smoking area with a communal table.   R E S T R O O M S We only stayed for an hour before hitting up Bubble so I didn't get a chance to use the restrooms. But when it was Dragon Bar, there were 2 stalls each for the men and women's restrooms.  P A R K I N G It's a complete nightmare trying to find street parking in the area. Do yourself a favor and just pay $20 to park in the lot 3 doors down next to A3/Atmosphere.  As a 1950's sex symbol, Marilyn Monroe leaves behind a legacy of sultry class, sophistication and simply exudes beauty. Monroe which I assume the lounge is named after is NO different.", 
    "review_date": "2011-08-08"
  }, 
  "Q8TGsARjdIfWsnXqgQYHhw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "Pretty classy-looking place. However it seems like even on a Saturday night it was a little dead.  I came here for a friend's birthday party and there was something like 80 people on her guest list.  Minus even half of that from the number of people inside and the place would be nearly empty.  What's up with that?  Also, waiting to get in, the line was pretty much full of dudes.  Not sure what was particularly wrong with Monroe that didn't keep it poppin' without my friend bringing the party, but I thought Monroe is a pretty good venue.  Bad promoting perhaps?  Beef up attendance and that fourth star is yours.  I'd definitely come back to see it!", 
    "review_date": "2011-07-10"
  }, 
  "VNkEB5PlrESiPP6-3JR-xg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janell D.", 
    "review_text": "I checked out Monroe on their grand opening and was treated better than ever with the tastiest drinks you can find.  The owners were really nice and took the time to chat with my group about the drinks they were providing.  The ambiance is really neat and the music was great!  Really good!! Loved this club and will certainly be back!!", 
    "review_date": "2011-04-02"
  }, 
  "lCkqOtZZ_Sz_WKThOjakMQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sunny D.", 
    "review_text": "Loved it here!!!  My exact words when walking in: \"its like harlot but better\".   I've come here a few times both with large groups and with just a few people.  In both circumstances we had a fantastic time!   Drinks are strong, and the music a good mix of fun dance songs. Good to know that there is lots of cute lounge area to sit at. My favorite part about Monroe is the decor, so nice and modern! Makes me feel like I'm back in so-cal ... definitely stuff to look at just in case the conversation runs dry ;)   Oh yeah there is a dress code, I had a friend complain about that. Weird. I could have sworn that half the fun of going out getting all dolled up!! Anyway if you haven't been definitely a place you need to check out :)", 
    "review_date": "2011-07-09"
  }, 
  "Mt0CBc2ExBfu9A8GnWlk4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren L.", 
    "review_text": "Came here for their weekly Wednesday night Battle of the Decades deal:  8-9pm $1 wells/beers, 80s music 9-10pm $2 wells/beers, 90s music 10-11pm $3 wells/beers, 00's music 11pm+ $4 wells/beers and current music also $1.50 tacos right out front!  The taco stand was right on their little front patio, decent amount of seating. ATM available outside. I enjoyed the 80s and 90s music portions. Got really excited when the DJ played Blur's Boys and Girls. They played some Prince, MJ, Madonna. they played that tootsie roll song. Attendance peaked at around 10pm? When my friends and I left around 11:30, it was kind of empty.  Met the friendliest Australian lady and her local Marin friend. Super nice, kept calling me gorgeous, and talked up my friend and I. Isn't it always fun to be drunk and be called gorgeous, repeatedly, by a fellow drunk person? Also told I could pass for Native American so that was interesting (I'm Filipino).  5+ dirty shirleys for --- $12 1 delicious pork taco at the end of the night --- $1.50 Embarrassingly recalling I was publicly air guitar-ing, tossing my hair around, headbanging, when the DJ played The Darkness' I Believe In a Thing Called Love --- priceless  good times", 
    "review_date": "2013-03-14"
  }, 
  "f9aIofvRra79gzbPf5ui4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James H.", 
    "review_text": "Prior to this trip I thought very little of SF clubbing. Sf clubbing tends to be one grundgy and two I just haven't seen very many cute girls in clubs in San Francisco. So coming into the night my expectations were at ground 0.   My friends were having their birthdays in San Francisco and decided to get the entire upper deck for bottle service. So that was probably the first indication of a soon to be amazing night. The tables were sweet and a little bit higher up so not every single clubber will intrude and get into your space.   Drinks were cheap comparatively to LA clubs (about 10 dollars a drink) The crowd is a little older and per usual a cockfest but HEY we had a fat group of over 50 people so it was still fun.   Music was housey hiphop and this was a saturday night with a mix of hiphop top 40s. Perfect mix so that your mind doesnt explode with too much trance. I don't know how it is on a normal basis but shoot this place is awesome and located near strip clubs... so if youre into that...   But defintiely show up early this place gets CROWDED.", 
    "review_date": "2012-01-25"
  }, 
  "-cyNZ1uyAaetmzya0meR4A": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jessica G.", 
    "review_text": "An absolutely beautiful space. The new owners have acheived a stunning remodel--I can't wait to come back with 25 friends and rule one of the sprawling booths!   Welcome to the neighborhood!", 
    "review_date": "2011-03-17"
  }, 
  "8DNiwBb0__aB3WehK4JYCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stefanie L.", 
    "review_text": "Full disclosure: I'm going to agree with Seong P. and say that I also had a great experience at this place, but that it's probably because I, too, attended a party for which the back booth was reserved. And I, too, could also see how a night at Monroe could suck without it. Word to the wise: If you attend a club like this, go all out.   Monroe is a really nice, new, clean club that will most likely be trashed the next time I come back--an inevitability in this city, unfortunately--but right now, it's great. The decor is fancy without being absurd, the bathroom was clean, and the booths are comfortable. Of course, it wasn't without its Line Drama--you know, people claiming they're on the list, people actually on the list, people straying from the queue, bouncers being hard-asses, all that crap that happens at any club in any city--but I learned that if you come by yourself (to join a group inside) it's quite simple to get in! Don't clump together, kids.  Also: the music is loud. Like, don't try to have a conversation. It's pointless. Just take a few shots, enjoy the abstract posters, dance the night away, and try to forget about the fact that the DJ just butchered a Michael Jackson song. (That last thing is unforgivable, by the way.)", 
    "review_date": "2011-05-22"
  }, 
  "rpaoPdFuyx0e2Z0D7gqCmg": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "brit i.", 
    "review_text": "Love this place!!! Always have the best experiences here! Good music, dancing, drinks. It's everything you could ask for.", 
    "review_date": "2013-10-15"
  }, 
  "OlPYG_Qmw-X-cxupPDF2Sg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Camery V.", 
    "review_text": "I came to Monroe on 10/19/12 Friday for my birthday celebration. Most of us arrived before 11 to make the guest list just in case there would be a line. Luckily, there was no line at all. I did get bottle service, but you're only allowed 8 guests per bottle (who are able to come at any time).   I was excited to see the lounge as the pictures on the website are beautiful. &amp; was upset when they closed off half the lounge with curtains. My guess is that it was a slower night so if the whole lounge was open, it'd look empty and may shy away potential patrons.   We had the W couches, and because no one else purchased bottle service in that section it was basically all our space. Plenty of room to sit and lounge around. They played EDM, not really sure how to dance to it so I stayed put at the couches. Our hostess came by every now and then to pour drinks for us. I couldn't find her anywhere when we wanted to order a second bottle. But the security went around and found her so she could finally take our order and allow 4 guests to come in for free after guest list ended. We figured if we buy another bottle, we should be allowed the \"8 guests/bottle rule\" and they obliged.   It wasn't the type of club where you can't breathe or walk around. I like being able to walk through the crowd without getting pushed or my foot stepped on. Although on a random note, I did find it weird that one of the bathroom stalls did not have a door (only two stalls in the bathroom). Other than that we had a great time partying at Monroe.", 
    "review_date": "2012-12-17"
  }, 
  "ZRPLaDjJJ3ebJFQL5MIO_g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalia K.", 
    "review_text": "I came back to Monroe last night for another BLAP Productions event and I have to say this time was even better than the last.  As opposed to my visit before, last night the bartenders were great and really friendly even though they were busy since the place was packed.  Definitely try to get here early (10ish) since the place really fills up. Also it's worth it to get on the guest list.  And guys, there is a dress code so leave your sneakers at home.", 
    "review_date": "2011-05-14"
  }, 
  "-LT26P5QMdadkD2sit_PaQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "grace l.", 
    "review_text": "I have never felt so strongly about a place to write a yelp review, so maybe you won't take anything i write to heart, but:  this place was ridiculous. management needs to rethink their policies. four tables reserved and bottle service for 3 peoples' joint birthdays. they were told they had an unlimited guestlist, which had a separate reservation code than the normal guestlist. What's the point when you won't let anyone in?   A group of us, including the bday girl who's card was down for all the tables got there about 11, and initially they were only going to let her in. The rest of us had to wait in line. Eventually they allowed ONLY the girls in, and the boys all had to wait in line. Anyone on our guestlist who wasn't with us at that time had to wait--to the point where half our party just gave up. i had separate friends who managed to get in and were wondering why the entire back section was open. seriously, who do you think you are? be warned anyone who's thinking about buying a table here, either get there early, or expect to be treated no differently than anyone else.  in their defense, it was fun once monroe took the stick out of their ass and let in a few more of our friends. it's pretty swank, and if it weren't for the absolutely stoOPid [lack-of] VIP service we received, i probably would've given it 4 stars.   i think the birthday kids deserve an apology.", 
    "review_date": "2011-05-23"
  }, 
  "cMSprRe3-eQREYOGCDmabQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Faye C.", 
    "review_text": "Thank God I yelped this place!  Spent my birthday here last night.  IT IS BY FAR THE CLEANEST LOUNGE IN SF I'VE EVER STEPPED FOOT IN. This place is pretty well kept. Music was awesome! Top 40/house. Crowd was sophisticated. None of the ghetto-fabNOT you will find next door. The decor was amazing. I thought it was just a bit too dark inside.   Now for bottle service, spent about $375 for one bottle of grey goose. That includes tax plus the 20% percent gratuity I have to include for our server. Which i am going to give - minus 1 star. She was hardly at our table. We pretty much had to pour our own drinks. She was basically MIA 90% of the night.  My sober friends can attest to that. And if I remember your service. It's either you did really great or you did really bad. So yeah, it was painful  to give 20% percent gratuity for a server who was barely there. *shrugs*  Other than that the bouncers were nice, it was a breeze getting in.  I had to put my guests names on the guest list and arrived there around 10:15 so line wasn't long YET.  Overall aside from the shitty server. This place deserves to be in the top lounges in SF to visit. My friends all had a good time", 
    "review_date": "2012-02-19"
  }, 
  "wwNlLUz1E4V2l37nmC_f9Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barbara M.", 
    "review_text": "As Far as Clubs in this area - definitely as good as it gets! Classy interior, reasonable drinks prices, enough room for everyone even though the place get's pretty busy so make sure to arrive early. I was very nicely surprised and would definitely recommend this place to everyone who wants to have fun int the city!", 
    "review_date": "2012-01-29"
  }, 
  "LGT35j0YvjsfRX09nJ3eWA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy M.", 
    "review_text": "i would still never go back here!", 
    "review_date": "2014-10-17"
  }, 
  "_-svlLztTUtuVQkh0TPSrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mathew C.", 
    "review_text": "I'm going to start off my review by being honest and revealing I might be a little biased, I am a DJ my crew and I have DJed here about 4 or 5 times so I will give more of behind the scenes review.        One of the biggest things I love about this club is the decor, Old Hollywood prohibition type setting with antique looking lighting (while the place is lit up) and awesome pictures/portraits hung up everywhere. Take one look at the gallery on their website, when you show up, you won't be disappointed.         From a DJ standpoint, the club is great, they have a super nice and clean sound system, people really don't know how big of a deal this is for a club, if they put the time to make sure their sound and DJ gear is top notch, then they obviously pay attention to detail and care about their club (I've spun at another bay area club [I won't name names] where their gear was super ghetto and another DJ admitted that someone probably spilled a beer into one of the turntables). They just got a few new LED lights that really highlight the VIP areas and they have a couple moving LED effects that hit the dancefloor as well. I'd say a few more LED's to highlight the booths and maybe a couple scanners or moving heads would really make this place come to life (not that our music doesn't do that already ;)      )             Drinks! The bartenders/staff I've dealt with are Payam and Ali. Both guys are cool and pour great drinks, the drinks are reasonably priced and it's nice not having to spend 5 minutes leaning across the bar trying to flag down the bartender, they're always really quick and attentive. As far as security guys, they are all really cool/chill, they are NOTHING like a lot of bouncers you will find at other clubs who are dudes on a power trip, one of the nights I was working here, some girl came up to me almost crying because some a-hole spilled a drink on her, I asked on of the security guys to come over, he talked to her, she pointed him out and they kept an eye on him, as soon as he was being belligerent and rude again, whoosh! They booted him, awesome.        Last but not least, the crowd. From the few different events here I've seen an eclectic mix of people, a good mix of mainly 20/30 somethings dressed up, or in nice jeans, and from what I've seen everyone seems very well behaved and non-ghetto compared to so many other establishments, a perfect combination of classy/non snobby/people who don't take themselves too seriously, it's very refreshing. The area is definitely an interesting place to park, as someone who's had my car stolen AND broken into in the last 2 years in SF, I always just drop $20 on the parking lot right across the street. If you stay till close to closing I'd recommend leaving maybe 20 minutes before the place shuts down, I'm usually the closing DJ and I end up being the DD who drives my friends home, I usually don't get to my car until 2:15, and by then it is a MAD HOUSE, tons of drunk crazy people out on the streets at the same time when all the bars close down, I always hate walking to my car/driving away through the crowds, so I would recommend leaving a lil early to avoid the craziness.  All in all Monroe is a newer lounge (they JUST had their 1 year weekend celebration) that is a really good blend of class and fun without the ghetto or pretentiousness of other places and worth checking out!", 
    "review_date": "2012-05-01"
  }, 
  "W1WQekJ9adEKBikkhCKayQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Pug C.", 
    "review_text": "If you want to go to a place where the bouncer attempts to bounce a birthday boy who reserved four tables to the back of the line, then come here.   If you want to go to a place where you expect to have fun because your friends dropped a lot of money to reserve the whole back space, but you end up having to wait outside for a good amount of time because of an incompetent bouncer, then come here.  If you want to go to a place that lacks good music and energy, then come here.  The night was tainted for a good number of our group because of terrible customer service experience and not-so-great music. You only have one chance to make a good first impression, and Monroe failed miserably. Never coming back here.", 
    "review_date": "2011-05-25"
  }, 
  "QjkYh8mqH43UkG51e58bUA": {
    "user_rating": 3.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Chris M.", 
    "review_text": "I went here for a friend's birthday celebration on a Friday night. The cover was free for everyone before 10 pm which is always good. The place was pretty small too and can get really crowded quickly as the night goes on. The bar was also decent sized and the bartender was really friendly. She was fun and gave us some great drinks! Also, happy hour lasts until 10 pm.   On this night, the DJ was whack! The music stopped completely on 4 different occasions and the variety was bad. At one point, it was all 90s R&amp;B, then to EDM, then to 70s music. For a crowd that's mostly young adults, the vibe was mixed as some people were liking the music or people were absolutely hating it. This was my first night here so maybe it was a one time thing.  This is a decent lounge. The music wasn't the greatest but I met some fun people and still had a great time! The decor was nice and the drinks were good. I had a decent experience and will give it another shot some time.", 
    "review_date": "2014-12-22"
  }, 
  "Ve6Yq7F9Chf8N0JuJ7cQ2g": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jocelyn C.", 
    "review_text": "Rosana showed me great customer service &amp; I want to thank her for a great time at Monroe for my birthday Oct 2012.  Few things I would like to say.  In the beginning  things were really confusing &amp; a little irritating.  At first when I got to the line, bouncers knew who I was &amp; my situation right away, which was great! Problem was just moving around from one booth to another &amp; not even having my own private space.  We had to share with another party.  I mean I guess it was fine, I just thought since I had 15 people come, we'd have a bigger spot, but I guess they did they're best.  Bottle service comes first &amp; I was one that didn't request it. Luckily, the party next to us knew we were sharing &amp; they were really nice about it. The place looks awesome &amp; I would definitely mark this club as one places I would come back to, because of nice staff &amp;  venue.  One more thing though, I wish there were seating for the public, if  people didn't have a booth.  I know some clubs don't do that, but it really would give more feedback to help the clubs.  Still a good place tough.", 
    "review_date": "2012-10-22"
  }, 
  "eKJgihPCWs1xyeKqn1a_2Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Linda L.", 
    "review_text": "I had a pretty good time at this venue(due to the overflowing booze), but there were some hiccups with communication along the way. It's stressful planning any party, esp a friend's surprise Bday party.  I contacted Monroe regarding bottle service on a Thursday and nobody got back to me until the following Tuesday. Even until then, it was extremely difficult getting a hold of my promoter(Rosanna) and nothing was set in stone until 2 days before the party.  But aside from that, the transaction went relatively smooth.  Now, onto the actual venue. We didn't have any trouble getting in through bottle service although everyone had to individually sign up on the Glist with the bottle service code. Once inside, we were greeted by a cute waitress(too faded to remember her name, sorry), who brought our drinks right away. There was also a wheelchair in front of our table. I thought: \"how thoughtful! It's for the drunk ppl who need to be wheeled out at the end of the night!\" Come to find out, it was for a disabled person next to our table. After a couple of drinks, our table started sitting in the wheelchair and rolling around in it ( including myself). Security guards got angry and took it away. Come on! Why put a wheel chair right IN FRONT of our table and expect drunk ppl to NOT play with it!  I got a few good wheelies in before they took it away though. ;)  So my friends and I are having a good time- we're drinking, dancing, laughing, talking, taking pics, the normal stuff you do at clubs. The security guard comes over TWICE to tell us to keep it down because we were drawing attention to ourselves. WTF?!?!  Don't you want people to see that your customers are having a GOOD time so more people will come to your venue?!  I will never understand the shush thing at a club, maybe the old disabled guy complained? I did see a couple of 70 year olds at this place though.....  Overall, I had a great time,with awesome company. One star for the cute bouncer, one star for the wheelchair, and one star for not losing my shoes. =)  HAPPY BDAY MARZ BARZ!!!", 
    "review_date": "2012-02-06"
  }, 
  "Eq3mNcLDCrlJrRqweLWL6A": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Logan The H.", 
    "review_text": "I stumbled (really, I did stumble as I was piss drunk) upon Monroe's after drinking way too many scorpion bowls at the Bamboo Hut right next door. As we were walking by, we saw a few posters that advertised a Battle of The Decades DJ battle which had the CHEAPEST drink prices I've ever seen for a Friday night. Basically, the drink prices are something like $1 for the 70s and then $2 for the 80s, $3 for the 90s, and it goes up like that every hour. By the time you reach the 'aughts, it's still cheaper than 99% of bars in this city. It was all free so we popped in and had ourselves a hell of a night reliving the decades.  Cheap booze aside, the atmosphere is surprisingly mellow and inviting. Lots of nice people on the Friday night we went. Given the cheap alcohol, you'd expect more drunk people falling all over themselves but everyone appeared to hold their liquor well. Biggest bonus: The bathrooms have more than 1 stall! Bathrooms are my thang and I like to have more than 1 stall as I have a tiny bladder and like to drink a lot so I was thrilled upon entering the bathroom and seeing stalls plural.  Security guards aren't too aggressive, everyone has a spot to dance. The club space is big enough but you won't get lost in it. The crowd was pretty diverse the night I went - it's nice to be in a San Francisco bar/club that isn't just white hipsters or techie nerds Google Glassing all over the damn place (sorry, but you know it's true). It did seem like a lot of out-of-towners but for the most part, people kept to themselves and enjoyed the music and cheap booze.  I'll be back for the 80's!", 
    "review_date": "2014-11-25"
  }, 
  "3qMnJT5k3sSA565d7N4r6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz H.", 
    "review_text": "I\"ve come here twice now and had a great time both nights!  They play great music to help you dance the night away!  I lot of hip-hop with some top 40/ dance songs mixed in.  The space is decently big but on slow nights they close half the place with a big velvet curtain.  This is my new go-to spot anytime I'm out in North Beach!", 
    "review_date": "2012-10-25"
  }, 
  "w7RP1MZad3YO7Vjgp3s3Dg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claudine V.", 
    "review_text": "This place is pretty spacious and play house music on the weekends. Cover is only 10 a night. Drinks are cheap.  Mixed crowd.", 
    "review_date": "2013-11-09"
  }, 
  "eSdQJJx3s-4uKS9ofr0zhw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice E.", 
    "review_text": "Try to rip us off?  PLEASE.  Okay well, you almost did.  Party group of 20 girls, we reserved a 2 tables.  There's a drink minimum of 2 bottles, no problem.  $350, sure okay,  no biggie.  When we get there we order 2 bottles of Grey Goose.  We were all chatting away, we didn't think much or even glance when they dropped off the bottles in the ice buckets.  The bartender/server girl poured us the first round we drink.. okay.  (I only drink 2-3x a year FYI).  My girlfriend asks me is that Grey Goose, I said yeah look at it.  She mentions it tastes fruity, different.  I don't pay attention too much since all alcohol tastes like crap to me.   The rest of the girls show up, and mind you these girls know their alcohol.  Immediately after tasting the \"Grey Goose\" they said.. \"This is NOT Grey Goose.\"  She brings it up to the server girl, and next thing you know it, was have 1 \"comped\" Grey Goose bottles, that were given to us sealed.  SEALED.  Shame on us for not asking for sealed bottles to begin with.  Other then this hiccup.. a HUGE hiccup I'd like to add, the place is cool.  Dance floor, mature adults.  Just make sure you get sealed bottles when getting table service, I don't even wanna think about the drinks at the bar.  If they are serving us water downed vodka, I imagine the same at the bar.  (Eeeek!)  The owner messaged me and in all fairness, this is his message.  Copy and pasted.   I would appreciate it if you would be truthful in your write up. There is not a two bottle minimum per table. You had two tables but decided to have both bottles on one table. We also did not comp both bottles for you. When there was a complaint about the taste I asked the waitress to switch the bottle out and make sure give you sealed one to prove it was Grey Goose. That is the only reason why it came to you sealed. We always put a pour spout on bottles for guests. The only thing that was comped was a smaller bottle of Grey Goose because I thought you were getting two bottles for one table and we usually discount the second bottle. I did not know you had both brown booths for your group. So to make sure you were getting a discount I comped the third small bottle. I hope I am not getting punished for making sure we give good customer service and being generous. All the actions we took was to make sure our guests were satisfied with their experience. I would appreciate it if you could take that into consideration. If you would like to talk about this directly please do not hesitate to call me.  Nonetheless, still request sealed bottles when receiving table service.", 
    "review_date": "2011-12-22"
  }, 
  "_UMTGara5YnzRIey3Mva0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark M.", 
    "review_text": "For us old timers...this used to be the famous \"Dragon Bar.\"  Now it is updated and renovated, with some cool walls, nicer floors, and much much nicer bars.  Very nice place for happy hour, and you won't feel like a skanky college student looking for the $5 admission and cheap drinks anymore...  Hey, we are all grown up now...and so is the Dragon Bar.  Tip: Go when DJ Carol C is spinning!!!  She plays great house music.", 
    "review_date": "2011-08-26"
  }, 
  "Rp0U_4jxK4dBAbeTmpT1Ug": {
    "user_rating": 4.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Britta F.", 
    "review_text": "I checked out Monroe last night during their \"soft opening\" just after work.  There were a few others in there excited to check out the new spot, but it certainly wasn't crowded.  Monroe is positioned on Broadway between stripclubs in the the FD/North Beach/Chinatown-ish district (the bartender said the area was \"up and coming\" for new bars/club - it's a stone's throw from 15 Romolo, BTW, for high-end bar-hopping).  The lounge area is lavishly decorated with plush booths that scream for a table tent reading: \"Reserved for Bottle Service.\" At least that's what popped into my mind as I walked through the space.    I sat at the bar with a friend to sample a couple of their specialty cocktails, all priced around $10.  I don't remember the names, but one was served up in a martini glass and had cucumber, watermelon and gin, and my second drink was some sort of tasty tequila concoction served on the rocks with a salt rim.  Following my two drinks, I had a decent buzz so while they tasted good, they were definitely strong too (no complaints here on that front!).  Both used super-fresh ingredients, too, which I always prefer and appreciate.   The bar was decorated with round leather bar stools and bowls filled with fresh fruit for garnishing and concocting cocktails.  One note for the ladies -- there are no under-the-bar-purse-hooks.  Management - this is a quick fix you could easily install for the ladies visiting your bar so we don't have to hold our purse or (worse) put it on the floor.   I can picture this place going off on a Saturday night and would be interested in checking it out again once traffic picks up following its grand opening.", 
    "review_date": "2011-03-16"
  }, 
  "BK3Jt6vp8iIxbX9Wl6YPeQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carrine J.", 
    "review_text": "Came here to celebrate my friend's 25th birthday.  The venue is a bit small, but nice vibe.  There is two bars and one smoke area which is handy if you decide that you need to take a smoke break. Being that I don't smoke, I used the area for some air b/c Monroe doesn't have amazing ventilation and it gets a bit hot after dancing.  Get on the guestlist b/c otherwise its a $20 cover which I am sure most would rather spend that on drinks. :) Overall, fun place to check out, just make sure to get here a bit earlier b/c parking is tricky since its in the north beach area.", 
    "review_date": "2011-07-30"
  }, 
  "nJ0hGm8V-vbIcCc9-NgzEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "omid a.", 
    "review_text": "definitely enjoyed this grand opening last night.  the vibe, music, and overall feel of the spot are all top notch.  this is the old dragon bar, but from what i can tell, the 4 walls are the only thing that still remain.  this new spot is great for a chill happy hour, night of drinking, celebrating, whatever! i'll definitely be back.", 
    "review_date": "2011-04-01"
  }, 
  "qKyIlflser6loAN-UpSmng": {
    "user_rating": 1.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Kristina C.", 
    "review_text": "A friend and I decided to be adventurous and try a new spot to grab drinks and maybe dance. We hung around Monroe from about 10:45 - 11:45pm on a Saturday night hoping for some fun, but it was totally dead. The DJ was actually playing some great music, but there were so few people there it would have felt a bit awkward to dance. The drinks were fine but nothing special.   If not for the fact that the ladies' room was missing a door on one of the stalls (forcing me to wait while a few ladies in the other stall finished doing something of questionable legality) and the fact that the sofas were very damp &amp; coming apart at the seams and the fact that it was totally dead yet somehow the people who were there tended toward the sleazy drunk hitting on you repeatedly types, I might deem this a decent place to meet up for drinks and dancing. Unfortunately, those things were all a part of my experience at Monroe, and I won't be going back.", 
    "review_date": "2013-06-16"
  }, 
  "PpNZuICTyx3DSH-v_zmbWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon G.", 
    "review_text": "oOooo.., fresh new lounge to hit the Broadway scene. It's all nice and done up. Word on the street is they just opened up earlier this year. It's definitely worth checking out. Synergy hosted a party there and we got in with no problems or anything. I like the inside feel of the place... very sleek and new. Not a huge dancefloor, but it's manageable.", 
    "review_date": "2011-12-13"
  }, 
  "CDZWiihsmtiP-cgBRSSljA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joe B.", 
    "review_text": "Just as we arrived for happy hour last Wednesday, they were out putting up a sign for a \"Private Event.\"  During Happy Hour. :(  We had just walked up from the FiDi to check it out, but it looks like it'll have to wait for another post-work night out on the town.", 
    "review_date": "2011-05-09"
  }, 
  "w0Qqa2YsjrW70u66d_sZiQ": {
    "user_rating": 3.0, 
    "user_location": "Newark, CA", 
    "user_name": "Kathleen N.", 
    "review_text": "Came here on Friday night to celebrate my sister's birthday! We got there at almost 10 and the place had a decent amount of people. Went up to the bar and ordered some drinks. They were very strong. Holy shit. Then we made our way to our table. We had an area roped off for us for bottle service and the set up is pretty nice! Wrap around couches, some tablesand some grehat wall decor. The girl that brought out the bottles was super fun and was great at pumping up everyone and she actually came back to check on us numerous times, which I totally appreciated. She even brought us water constantly. She was great! The club itself was fun! I actually think watching other people dance was more fun. Just imagine all of the world's most awkward dancers all on one dance floor. And they were all white. Like, I don't know how else to describe it. It was just so white. Not necessarily a bad thing, I'm just not used to it. Like imagine a club scene in a disneychannel movie. That was Monroe. It was fun but by 12:45, the club completely died out. Like there were maybe 20-30 people in the club total including our group of 12. So sad it died out so soon, the DJ was actually doing pretty good.  It was a decent experience.", 
    "review_date": "2014-10-18"
  }, 
  "ZhATZtcAivCoCVCup3VSeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca G.", 
    "review_text": "I attended the Grand Opening party with free cocktails and passed appetizers. It was a really nice party.  I like the vibe of this place.   The cocktails were really nice, but the bartenders were a little slow. It was opening night and it wasn't crowded, so I'm not sure what the deal was. Apparently they kept running out of the batches of ingredients they had prepared. It's okay; I'm sure they will get quicker. The bartenders were nice!  The appetizers were nice, but the servers weren't. They were a little rude and they kept dodging people, stepping on toes and throwing 'bows. I'm not sure if these ladies were bar staff or hired help for the night, but I overheard many different groups of people complaining about them. I surely hope they aren't affiliated with the bar. They were definitely the sour note of the night.    The decor was definitely the highlight! It is really nice! This place has a classy old Hollywood meets 50's pin-up feel. I love the portraits on the curtains that adorn the walls. There's also giant round booths that easily fit 8 people, which I'd have to see how they translate on a crowded night. There didn't seem to be much other seating besides the big booths. You'll definitely get to know your booth mates if you come in a small group.   There's a nice semi-private, elevated area with a few booths and tables by the DJ booth. This area would be ideal for a party!   There's also a covered, outdoor smoking patio with outdoors heaters. My friends enjoyed this patio; it was a little too smoky for me though. It sits on the street which makes for excellent people watching while you chill out for a sec.   I met one of the owners, and she was really nice as well. I wish them the best of luck on their new venture! I'll have to return to see what the ambiance and crowd is like on regular night.", 
    "review_date": "2011-04-05"
  }, 
  "JWQe8stuylRF5AG7gX4BxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "emily f.", 
    "review_text": "I've only been here for Happy Hour so this is what my review is based off of.   As a wine lover, this place was perfect for a glass. Me along with my two guests were the only ones in the joint. This made our exprience very one on one with the place as well as with the bartender. The Bartender helped me choose what was good, and also gave me a taste of some of the wines.   I loved the decor, absolutely chic. Will go back ASAP!", 
    "review_date": "2011-06-14"
  }, 
  "TPVYynTdO4Vs0d89kS5bXg": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "naomi b.", 
    "review_text": "I came here for my 31st bday and had such a blast.  The door guys are really cool and easy going.  The bartenders are fun, efficient and quick.  The crowd was perfect. 20's-mid 30's well dressed crowd.  Everyone was there to have a good time and that was all.  The decor is really nice and cozy chic.  Out of place among the surrounding establishments, but no biggie at all.", 
    "review_date": "2014-07-29"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "Friend and I stopped in post-run one Tuesday and it was pretty empty. Food took forever to come out (we just got a flatbread) and they seemed to be out of a lot of wines we asked for. The bartender was a bit standoff-ish at first and eventually warmed up. We ended up spending entirely too much money for what we got. Oh, and there were way too many creepy/sketchy potential strip club owners/goers that stopped in.  I will say the decor is awesome. That's about it.", 
    "review_date": "2011-07-30"
  }
}