{
  "DUNPDFkgSe3cVLFtihdn8g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jennifer d.", 
    "review_text": "I was actually inspired to join Yelp just to write this review. Mosto has potential to be a great spot, but our blonde waitress completely ruined my experience there. I met some friends at Mosto before having dinner nearby and we all ordered a drink and some tacos. After about 20 minutes everyone had gotten their drinks and tacos - I still hadn't gotten my beer. The waitress stopped by and said it was because they had to change the keg (understandable) so I cancelled the beer since we had to leave soon for dinner. Apparently the bartender didn't get the message and still poured the beer a few minutes later - another waitstaff brought it over to me and I told him I cancelled. He said oh ok, well you can still have it. I took the beer - not really even wanting it - and our blonde waitress came over and literally GRABBED the beer out of my hand and said in a horribly rude tone \"you cancelled that.\" Everyone at our table and nearby was pretty shocked by the incident and how loudly she yelled. I really want to like this place, but if their staff doesn't get a better attitude it will not survive.", 
    "review_date": "2012-02-21"
  }, 
  "wVv8-yw8wlzDyYJMDEXFVw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elise G.", 
    "review_text": "T-Lish on the right side had some killer guacamole.  The salsa was sweet and smokey and on the house and came with some thick, crunchy, restaurant style tortilla chips.  I think they were house made because they were warm.  My boyfriend described the michilada as one of the better ones that he's ever had.  My coconut water-pineapple cocktail was ok.  The mural of the cityscape on the outside patio was cool.", 
    "review_date": "2012-11-10"
  }, 
  "vq6ZyYZ3MnFLGUd_0-hTyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miss T.", 
    "review_text": "love tequila and mezcal and love this place! i always sit at the bar so i can chat with the bartender and ask questions about he gazillion tequilas they have. they always have a bartender's flight which i usually get so i can try new things :-) they have some pretty good snacks too, but i come for the tequila and mezcal, sip it neat, and enjoy. yes!", 
    "review_date": "2013-07-30"
  }, 
  "M6v37Q3fCL0rxUXT-pNvFQ": {
    "user_rating": 4.0, 
    "user_location": "Cleveland, OH", 
    "user_name": "Farren B.", 
    "review_text": "Composed tacos and inspired pitchers of margaritas!  I've been there a few times in the past year, and I will continue to patronize these guys. I've sampled all the tacos, the guacamole, and a smattering of the offer drinks, and it doesn't seem like you can go wrong with any of the choice. This is why it's popular, but I've lucked out and been able to get seated midday on a weekend as I walked in the door. The bartenders and staff are willing to engage and the availability of outdoor seating is a huge attraction!   Pluses: food, drinks, prices, location, space, staff Downs: popularity, and the noise level (sometimes)", 
    "review_date": "2013-05-30"
  }, 
  "oKEcgplgzi4Nid6bexXY9Q": {
    "user_rating": 5.0, 
    "user_location": "Nashville, TN", 
    "user_name": "Ashwin M.", 
    "review_text": "Sublime tequila and mezcal bar with great service and an impressive selection of libations. Well informed and hyper friendly bar tenders make sure that your drinking needs are taken care of. Like a Las Vegas casino, or unlike one, it's always dark inside, making you think that it's a perfect time to sip on a good tequila. Even if it's only 3 PM on a Wednesday!", 
    "review_date": "2014-06-06"
  }, 
  "AYw6cSfkF8L0YwzhPR1A9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan C.", 
    "review_text": "One of the coolest spots in the Mission.  They have an exceptional selection of Mezcal and Tequila.  It wouldn't be right to go and not order the al pastor tacos.  Make sure you do that!  The staff is super chill and can help you get the right drink.  Oh and look up at the ceiling, it's fun, trust me.", 
    "review_date": "2014-07-26"
  }, 
  "tXhscxwFTd-ayLTdPx_2yA": {
    "user_rating": 5.0, 
    "user_location": "Miami Beach, FL", 
    "user_name": "Jonah K.", 
    "review_text": "Excellent drinks, you have a different menu and you can get the same stuff they sell next door at tacolicious. The owners are excellent, and the staff is fantastic. I will be back for sure.", 
    "review_date": "2012-12-24"
  }, 
  "m2fb7CMKmA68HFkJGy3PCw": {
    "user_rating": 1.0, 
    "user_location": "East Village, San Diego, CA", 
    "user_name": "Kyle D.", 
    "review_text": "I write a lot of 5 star reviews and I really hate to write a 1 star review, but on occasion it's warranted. I suggested the server just put our appetizers in because our dinner order would be a lengthy one. She gave me a condescending look and said she would be fine without writing anything down. Well what do you know, she forgot 2 things on our order as well as an entire round of drinks later in the evening. Then didn't feel sorry apparently after I let her know. Will not be back :(", 
    "review_date": "2014-07-28"
  }, 
  "H8_WNsVhJsKexvqaV2Q6Rw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashlyn R.", 
    "review_text": "My favorite Mexican of all time. Skip Tacolicious and go here instead. Margaritas to die for and inexpensive tacos are where it's at! I always order like 15 tacos to myself ha, they're irresistible. I get the pastrami, cactus, el pastor, chorizo. El pastor and chorizo are my favorite tacos EVER there. I've been 7+ times and I will go back!", 
    "review_date": "2014-08-28"
  }, 
  "CSx5sxOQv2PlTWRVbrxkpQ": {
    "user_rating": 4.0, 
    "user_location": "Saint Louis, MO", 
    "user_name": "Amy X.", 
    "review_text": "so, the drink you gotta get here is the michelada.  apparently, they serve it here similarly to how it's dished up in tijuana -- beer, lime juice, and hot sauce.  you end up with something that's halfway crossed between a bloody mary and a bud light lime.    disgusting, i thought, the first time i had it.  disgusting!!! i thought, the SECOND time i had it.  the third time i ordered it, i thought, WHY DO I KEEP ORDERING THESE?!!  but then i finished mine and drank everyone's as well.  i suppose this may be a drink that you grow to like.", 
    "review_date": "2012-09-28"
  }, 
  "HLtc4cm9KbtwEtDyWaA0sw": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Mark M.", 
    "review_text": "Early on...drinks are amazing. Perfectly matched tequila and their choice of fruit. Margarita Picante has a splash of red chili pepper vinegar coursing through the el jimador. If I could only do this at home. Must try the albacore tuna tostada, a new favorite food. Super cool space outside on a sunny day. Rounding down to 4 stars. Maybe a 4.5 star lunch but will wait to try more local spots to be sure.", 
    "review_date": "2011-12-30"
  }, 
  "pHhx8EvrfNFQSLbM_p9_ZQ": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jen S.", 
    "review_text": "The service was great, but the food was awful. The two stars are for the great waitress.", 
    "review_date": "2014-09-30"
  }, 
  "JsjWPFIIAlKanb0AF3R9Xw": {
    "user_rating": 2.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Justin M.", 
    "review_text": "Bright sun in the Mission. Strolling south on Valencia. Obviously in the mood for Latin fare--I call it love, others call it a disease.   My partner and I happen upon Mosto--instantaneous curb appeal: gaping plate glass windows and simple, inviting gray-green earthen facade. Friendly greeting by the hostess, immediately seated at a two-top in the sun. Ambiance perfect so far--expansive mural with scrawled messages opposite us, wooden floorboards, lights strung above. So far, excellent.   Cute female hipster servers all about, but none come to our table right away...or within our first 5 minutes of being seated. Minus a few points. Finally, a busboy brings us water, chips and salsa. The chips house-made chips are salty, crunch and fresh. The salsa amazes us--light brown-orange, not your everyday pico- or tomatillo-style offerings.  Slight tang and spice complement the chips well. Points regained.  When our server finally arrives we decide on a pitcher of red sangria--a drink we both adore--for $26, which is standard for trendy Hispanic places. Another 5 minutes or so elapses before it arrives, served in a 1 liter carafe. Most of the volume is ice, which is disappointing. The disappointment deepens when the sangria tastes like watered-down kool aid, with barely any alcohol burn or spice notes. Big minus here. $3 Tecate cans are not bad, but I would like to see 21st Amendment cans for $3 or $4--something that is probably not fiscally appropriate in the Mission. Oh well!  We decide on the tilapia and shrimp ceviche. For $13, the portion is smallish. I think the chef was going for something audacious and interesting, but failed: the dish has nectarines, which is nice, but they are muted by the lime. In fact, the prevailing flavor is not of the seafood nor the nuances of the fruit and vegetable combination, but of the lime juice. The dearth of flavor is definitely not worth the money.  The decor and vibe of this place is decidedly rad if you enjoy the upscale, hip Mexican scene, which both of us certainly do; however, our experience with the food, albeit small, is a major turn off. Would I return? Probably, if only to hang at the bar or outside with some beer.", 
    "review_date": "2012-07-08"
  }, 
  "CLO6v5VzafvI4Oa0DpIAcQ": {
    "user_rating": 5.0, 
    "user_location": "Lahaina, HI", 
    "user_name": "Jennifer L.", 
    "review_text": "The drinks are perfectly crafted with all fresh ingredients. It's a little pricey but well worth it! Try the house margaritas -- they're super refreshing!!   Definitely one of my favorite bars in the area, as it is perfectly located in the heart of the Mission. Great spot to start your night off and jump to a nearby restaurant for some grinds.", 
    "review_date": "2014-07-19"
  }, 
  "z0ohSo1fRibYIW9kE-gXCg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liv S.", 
    "review_text": "Best tacos!!! We were so happy to find this place by chance, totally enjoyed our meal. We likely return more often with friends, I have no problem to give it a five stars.  -- I do have one concern: I saw waiters refill chip baskets by hand, I don't think they wash their hands when the place is busy. What happens if it is right after they take someone's money or credit card. So far, none of us got sick, it might not be very big concern. However, I hope staff at Mosto read this, and improve; then I have nothing to complain.", 
    "review_date": "2012-01-03"
  }, 
  "pOsSRzm0ZOXE9FcJ5pWxYg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy C.", 
    "review_text": "Why I Mosto-ly Liked Mosto:  1)  Plan B if you are not interested in waiting 45 min. for tacos at Tacolicious next door.  2)  Plan A if you want margaritas and tequila.  3)  Awesome, unbelievably attentive server.   4)  Groovy ambience with loud music, wall votive candles, and a quirky mason jars ceiling.  5)  Fabulous Mocktails  Because we had to work / fly the next day, we tried the Mia (a luscious OJ and lime concoction) and a Mexican Coke based drink ($5 each).  (Yes it's official, we're old!)   6)  Cheap Eats   The nopales taco and pork tacos were budget friendly ($1.50 each) but a bit bland and cold.  The tamale with chicken, green beans, and potatoes was ok flavorwise but very mushy in texture ($3).  (Next time would probably hit up El Toro instead.)  7)  M.W.A. (Menus With Attitude)  It warned us that \"Getting drunk will not get you laid\" and grouped the non tequila hard liquor options under \"Haters.\"  Haters gonna hate!", 
    "review_date": "2012-12-08"
  }, 
  "Cj5weEcAZKlBb4-4le2Xng": {
    "user_rating": 4.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Danielle L.", 
    "review_text": "This place is perfect if you're looking for a nice tequila fix. Their margaritas are bomb, especially if you like it spicy. They literally have every tequila you could come up with, its quite impressive. Their staff is super friendly and the environment is comfortable.They show the football games, which is a plus if you're into sports. It gets a little tight if they're busy but its great if you're feeling flirty. Their ceiling is my favorite accent, they have jars of random articles found at their bar, these also serve as great conversation starters if you're struggling with a line. Cheers!", 
    "review_date": "2013-10-01"
  }, 
  "WCoCQQKN5jfu731pfOt1oQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "NAEL K.", 
    "review_text": "so wish they opened later than 12 on weekends , very cheap tacos and the pastor is out of this world , burger were cooked just like they should be . amazing bread buns and  the waitress is the best part ,  here is a little conversation with her , standing by the bar where the food comes out i decided to be polite and asked her if i was in her way , she replies : don't worry if you were in the way i would have pushed you already  haha ain't she cute !!, can't wait to go back", 
    "review_date": "2013-05-12"
  }, 
  "r3UmPWmn_e62xJpEngrAxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Selina W.", 
    "review_text": "I was very impressed with the cocktails / small bites here!  Honestly - was not expecting much. Tacolicious next door was WAY too loud so my friend and I opted for Mosto which is right next door.  I got a tequila/pineapple/lime-y cocktail ( it's not as girly as it sounds...trust me ) Wow! it was sooo good. The perfect balance of all components and they don't jip you on the alcohol either.  We ordered tacos, tamales, a raw fish diesh and all 3 delivered. Very very yummy. Definitely more refined than Tacolicious ( and I'm a fan of Tacolicious! ).  Will definitely be back - drinks here were awesome! The wait staff was friendly and even though she was the only one on the floor, she handled everything with ease :)", 
    "review_date": "2014-12-01"
  }, 
  "QoKiW973uXNKUHRh2lvJxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N T.", 
    "review_text": "This review is long over due, as I've been frequenting Mosto for quite awhile now.  The drinks are good - little expensive though, by hey its Valencia so you can't complain too much. The burger is frickin amazing, not your typical so definitely give it a try.  Tacos are delicious as well, but the real standout here is the service; the cocktailer that is always working absolutely kills it no matter how packed it is!", 
    "review_date": "2014-09-28"
  }, 
  "Rop17Apd1lcEw39JiMp8Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alicia K.", 
    "review_text": "The place is small but the drinks are STRONG! Get a margarita and the fresh appetizers, they are delish! Be patient, it will be crowded, but that means it is worth it.", 
    "review_date": "2012-04-23"
  }, 
  "1p5ligeGUc7TEnZTt9g5NA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "STephanie S.", 
    "review_text": "Love this place.  Tacolicious minus the attitude.  The pastrami taco is out of this world, and their standard margarita is the best I've had in the city.", 
    "review_date": "2014-05-30"
  }, 
  "oll1HXY5AKFZebo_KBZ7xw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moe D.", 
    "review_text": "Delicious margaritas and tacos! A great place to start the night.", 
    "review_date": "2013-01-27"
  }, 
  "K9UCL5zroxiczuS4iZTSNw": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Audrey K.", 
    "review_text": "Mi Casa tequila!", 
    "review_date": "2012-10-05"
  }, 
  "ReDoGveUTyzlfC0bZOQ3bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Negien M.", 
    "review_text": "Sadly, I had eaten dinner beforehand, so I didn't take advantage of the cheap taco/tamale offerings, but I enjoyed my refreshing grapefruit-y paloma and my nine dollar shot ;)", 
    "review_date": "2012-02-05"
  }, 
  "cCPjASKs5YpMB4BmN2oSZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike H.", 
    "review_text": "I'll definitely come back for the food. The wall menu showed excellent deals, as laid out below, and they offer it until midnight when the liquor license also expires.  You'll find a fantastic list of tequilas, and yet most of the people there were drinking beer or mixed drinks. I'm looking at you, guys, learn how to drink your liquor, and drink it  neat....  The music went from loud to comically loud. I couldn't help but laugh, and the bass was nearly breaking up. Thought it was still at least 30min before last call.  Love the setup of the place: stools and small tables, with a high booth on one side and standing option on the other. Great feel for a small space.   Mejor tarde que nincun...better late than never. That would describe our server who was really enjoying spending time with another server and occasionally forgot about us. Regardless she wasn't just kind, but enthusiastic about sharing her love of tequila and letting my friend, who'd sworn it off since college, find one that was palatable.", 
    "review_date": "2011-12-28"
  }, 
  "2Qfa3o72sq04_MCUxy3Shg": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Emily D.", 
    "review_text": "$9 a shot. We aren't in Kansas anymore. But techate is 3.50... so maybe we are? Good for a date, because its a classy establishment. I liked the sexy candle-lit interior. But then again I don't really know how sexy 3.50 techate can get.   The whole thing smelled like tacos.", 
    "review_date": "2012-02-05"
  }, 
  "I_-WwimX3v7ZxP2CtdLuuQ": {
    "user_rating": 5.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Gabriel C.", 
    "review_text": "Top notch. Get the pastrami taco. The people and crowd who are here make this one of my favorite spots. I ledft a guitar pick in a jar in the ceiling.Great people,great food and tequila. $40 and my friend and I got loaded", 
    "review_date": "2014-02-20"
  }, 
  "gdTAebkameev_DQq_NCZzw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine W.", 
    "review_text": "crowded hipster bar... meh  came here for a friend's bday otherwise i wouldn't want to be here too crowded and the drinks are ok", 
    "review_date": "2012-05-29"
  }, 
  "y_jl-bErj1mnb4KF04F74Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "Fun vibe, great bartender, fab drinks and tasty tacos!", 
    "review_date": "2011-12-30"
  }, 
  "eMx5luVGcu_HvbODBFJ8Mg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A S.", 
    "review_text": "Tequila. Have I ever had a problem with you? No.  Will I now? Possibly, thanks to the addition of Mosto to the Mission.   Unfortunately, I apparently arrived on the later end of the night (their liquor license currently ends at 12 but they're trying for an extension) but with enough time to order the classic Mosto margarita and a few tacos.  They don't currently offer flights of tequila (a shame with the selection they have), but the waitress was willing to put one together for us. We just ran out of time.   Sat next to the owner who was keeping a good eye on everything but who definitely doesn't look like the owner of other Mission bars... for instance the new Dear Mom.  It's a little ironic, this whole Tacolicious / Mosto thing in the middle of the Mission. Why wouldn't I just go get tacos from a Mexican down the street? Definitely contributing to the Marina-fication of the Mission. Will be interesting to see how this \"chain\" does.", 
    "review_date": "2011-12-04"
  }, 
  "F3-Etluf7r4_1h651kvweg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ciara W.", 
    "review_text": "While I don't seek out tequila in general (it makes me craaaaaazy...), I stepped into this new neighborhood place the other night, and I'm so glad!  We've been watching the build-out of the new space, and were impressed with the developing ambiance, and happened to stroll by the \"soft\" opening on a Friday evening.  We were greeted enthusiastically by several staff and ushered through the T-Lish space, and found cozy seats at the Mosto bar.  While the wine pours could be more generous, the tequila-based Lil Devil was stiff and tasty.  There are at least 85 million kinds of tequila, and absolutely delicious little tacos with house-made spicy sauces.  The Valencia Street corridor gets thicker with great food every day...", 
    "review_date": "2011-11-26"
  }, 
  "KtYgR2xmlqFO_1w5VQTryw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ari s.", 
    "review_text": "Finally got to try this place - yummy food and a cozy environment. neat lights and modern decor that has a homey edge to it.  Got a cocktail that had a few things in it and it was very tasty - sorry but i can't remember the name and it's not because i had too much to drink!  we got the nopales taco - very small but full of flavor. Also the tuna plate which is only 4 small small pieces for $6 so be aware that's it's not a very inexpensive place but the quality is worth it.  the smells from the food next door are very very tempting so I look forward to trying that.  one suggestion - chips and salsa would be a nice addition to the bar menu!", 
    "review_date": "2012-06-06"
  }, 
  "AfmWxbn_qgIZEZYCVVnzow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tricia V.", 
    "review_text": "The best Margaritas in the City", 
    "review_date": "2013-07-03"
  }, 
  "1pTJ5btx5t6nVNkpC_4mNg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lorenza P.", 
    "review_text": "Really nice tacos!! also the michelada is great.", 
    "review_date": "2013-08-09"
  }, 
  "md6Fmsx5A3RvfAtVLqsTmw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SF U.", 
    "review_text": "Huge fan of mosto! The passion shot with chili infused tequila and passion fruit juice starts off fruity and finishes with a great kick of heat. Granted I have only been to drink, however I can't wait to go back for food.   Sexy establishment... Incredibly well designed.  Luv!", 
    "review_date": "2012-01-22"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 5.0, 
    "user_location": "South Bay, CA", 
    "user_name": "Kim N.", 
    "review_text": "Love tequila? This is the place for you. There are hundreds of selections here and the menu is dizzying. Can't decide? try one of the cocktails featuring said tequila, or a few that don't and some non  alcoholics. The El Mosto classic margarita on the rocks and the Ferro's Little Devil with ginger beer are blackout good. Not since the Cadillac Bar and Grill before the Metreon took over have I had such a good one. They also do the blended styles a la Baja which are also tasty. You can have the eats over next door at Tacolicious and then continue the drinking here or you can just come here for drinks in their low lit swanky bar and back lounge area. So many tequilas, so little time", 
    "review_date": "2011-11-26"
  }, 
  "cufhYFdyrUAt4SWe-m0grQ": {
    "user_rating": 4.0, 
    "user_location": "Nashville, TN", 
    "user_name": "Johnny T.", 
    "review_text": "3.5. It may come as a shock to most but I can't (and don't) eat/drink all the time. Well, let me rephrase: I can't (and don't) eat fatty food/drink booze all the time. There. Fixed. In my youth of board shorts, obliques and laughing in the face of age (not to mention running and a decent gym ethic), I ate and drank with reckless abandon and dared the universe to stop me.  Then I hit a certain age. Father Time, Mother Nature ain't got nothin' on you when it comes to being a [redacted]. For this reason, we thank the mocktail menu at Mosto. Yes, it's not as sexy as tossing back some craft cocktail and making cross-eyed googlies at the fine young thing in the painted-on jeans but after a while, a man gets tired of living that way. And as sung in 'The Lion King', the circle of life demands a return to that which was awesome as a child: grenadine. Yep, the stuff that Shirley Temples are made of are back and they're still delicious. I ordered the Moss Mocktail. It's a potent combo of Mexican Coke, lime and grenadine. Sounds simple. Tastes delicious. If the thought of one more ounce of poison floating through your liver makes you queasy, settle in for an expertly made craft mocktail, cool environment/vibe and decent playlist. Oh, and service. Attentive service that feels authentic is another reason to stop in... but first and foremost, get a mocktail. And call your mother. You never call.", 
    "review_date": "2013-07-16"
  }, 
  "z7VeJ_8UpCko230MXeLcZQ": {
    "user_rating": 4.0, 
    "user_location": "Little Rock, AR", 
    "user_name": "Noah H.", 
    "review_text": "$1.50 tacos, and remarkably good service considering the crowd The above is my tip, and it covers the review too!  The service (and food!) were so good, in fact, that that by itself gives this place four stars. It was super-loud, cramped, crowded and not terribly comfortable (hence the four stars) but the drinks, food, and top-notch bartenders made up for that in spades!", 
    "review_date": "2014-12-30"
  }, 
  "KjXID5UvwxS1-TRAsw2aYw": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Cathy B.", 
    "review_text": "first thing to do when you enter is look up... their ceiling is covered w mason jars!!! i think its a cool thing!   went there on a sunday night and of course they were pack. they have ten million tequilas and they are all displayed on the front bar. its def a place for tequila lovers!", 
    "review_date": "2011-12-08"
  }, 
  "C1gfXKh7AdCTqH4Ayz9maA": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Amie L.", 
    "review_text": "Had some friends fly in from Hawaii recently and we were in San Francisco looking for a place to have some margaritas. I actually found this place last minute on Yelp and decided to check it out. Id give their margaritas 5 stars! The drinks were a little expensive but definitely worth it. I really enjoyed the atmosphere as well. The entire ceiling was made out of jars which you can unscrew and put things in for fun. Our waitress jumped up on a table to get one down for us and she was really cool. I had a blast in here and really do wanna go back there sometime to try their grapefruit drink!", 
    "review_date": "2013-05-28"
  }, 
  "LAX-mM-cOJ2ownL-waC8ww": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Sean S.", 
    "review_text": "One of the many new breed of upscale bars and restos coming to the Mission.  Hey guys, the same thing is or has already happened to Bedford Brooklyn, just sayin.  Still having an El Mosto will definitely put you in a good mood.  The second one will do even better!  Delicious tequilla cocktails, to warmup our pre burn.  Sweet!", 
    "review_date": "2012-09-10"
  }, 
  "xHkYHJkZdx0FWSW64DKXHA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Betty R.", 
    "review_text": "Cute place. Good drinks, al pastor tacos were really good, small but good. Parking was killer but then again it always is in the city. Tab was about $45 for 3 drinks and 4 tacos. Not Bad.", 
    "review_date": "2015-01-28"
  }, 
  "l26TgP9ox03XRLDuG-9wvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annalise F.", 
    "review_text": "A family friend and I decided to meet for dinner in the Mission, quite honestly, this time last year. (Overdue! Overdue! Overdue. Thank god this isn't a library book- or I'd have some severe fees racked up.) While we had our hearts set on Tacolicious, Mosto next door was an amazing alternative. (Ok come on- they're practically the same restaurant.)   It's really dark...and loud, but was great for catching up over good drinks and small bites. I was stoked that the bartender was familiar with the Marina menu (NOT BECAUSE ITS THE MARINA...stop judging you!) but because the Tickle Me Telmo is one of my favorite margaritas- and not featured in the Mission location.   Totally a go to in a pinch...when Tacolicious is cray-cray...which is typically is.", 
    "review_date": "2015-01-02"
  }, 
  "l20MTXXZq6ydgig4cPBK3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn B.", 
    "review_text": "I love a late night lounge...I love bottles all over the ceiling...I love a menu with happy hour prices all day....Mosto is the know-it-all of tequila, I have yet to see a more expansive selection of tequila. I recommend the flight to get you started, four or five nice pours gives you a little taste of everything.   The cactus taco here is a little gem...At a buck fifty its a tasty little snack that will soften the tequila buzz that's about to hit ya hard. Hot sauce is an obsession of mine, and Mosto hooks it up with two very well made sauces to garnish your small bites.", 
    "review_date": "2012-03-16"
  }, 
  "Tyge1i73fYQnUMzItd7UPg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julissa J.", 
    "review_text": "I love the jars on the ceiling and the dark atmosphere. Tacos are real good &amp; the slices of pineapple that they add to it make them extra good. So many kinds of tequilas!! Who ever new that many existed hehe anyways I had the Paloma that night &amp; I have to admit it was delicious!! I'm not a fan of tequila but I don't mind having this drink anytime.", 
    "review_date": "2012-05-15"
  }, 
  "c8VzCYDzAsAFn0FgnIrE3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L M.", 
    "review_text": "ADORE THIS PLACE! Checked this place out over the holidays. Amazing tacos, queso &amp; tequila cocktails at the bar after a short wait. Servers &amp; bartenders were super, as was the food &amp; the drinks. I have been less than impressed with the fancy cocktails at some other spots, but Mosto's drinks floored me -- in a good way! If you like hot stuff (and I do!), try the Pasion drink. Best drink I've had, maybe ever and mos def best tacos i've had in the Bay Area.", 
    "review_date": "2012-01-04"
  }, 
  "dtiVg9IMFJ-i4KejIUlCsQ": {
    "user_rating": 4.0, 
    "user_location": "Vienna, VA", 
    "user_name": "Alyssa K.", 
    "review_text": "Big big fan. Dark and loud. needs more bar snacks. Yum", 
    "review_date": "2012-07-21"
  }, 
  "V35zyGd12-QLtnxIMUJzIQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn S.", 
    "review_text": "Tequila selection is great, but the margaritas and other mixed drinks were lack luster. Mixture was pretty off to the point that the sweet and sour or agave was over used. Go there for the tequila and carnitas. Leave if you want a mixed drink. Great music selection though.", 
    "review_date": "2013-06-03"
  }, 
  "bDcntKpOk1gQuq1-tx9l8A": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Ching-Yun L.", 
    "review_text": "They serve tacos here with meat cooked on a spit right in front of you. YES I SAID SPIT. Wait, Ching-Yun I thought you were reviewing a bar...why is there a spit?   Exactly. Why? Because they can. And they wanted to. Why not?!  Best. Idea. Ever. to whoever created the concept for this bar. I love it.  I was visiting SF that weekend to celebrate Yelp's 10th Anniversary and I ended up at Mosto b/c the wait at Tacolicious was too long. Maaaaaan. The tacos were priced right and were made well too. Fresh, cheap &amp; pretty flavorful and yes, this is coming from a girl living in Mexico, I mean, San Diego, home of pretty good Mexican food.  I did not drink here, so I can't review that, but yes to a \"TACO BAR!\" hehe. Awesome.", 
    "review_date": "2014-08-13"
  }, 
  "i0C4bhHjTVaAMKvz6G7fOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole O.", 
    "review_text": "Great place for a taco snack and drink while you're waiting an hour for a table at Tacolicious. Try the pastrami taco but don't watch the cook at the little window make it or you'll feel guilty for consuming all that delish fat.", 
    "review_date": "2015-01-04"
  }, 
  "MzXPOK2_T5O8GF-4qUVmGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica M.", 
    "review_text": "Oh how I LOVE Mosto!  It's a great space.  Tiny, cool, casual &amp; elegant.  Yes, elegant.  There's elegance in simplicity.  I've been to Mosto at least 20 times.  Every time I'm there the tunes are rockin.  Effin rockin.  Trust.    Service rocks.  Both at the bar, &amp; at the tables.    Tequila selection to impress even the most ardent tequila person.    They do just a portion of their Tacolicious menu; but no matter.  It's ALL deeffinlicious. Serious.  Get the tacos.  Any one of them.  Better yet, get all of them.  They're that good.  Al pastor tacos?  $1.50.  They rock, but so does everything.  The hot dog?  Fantastic.  Pastrami tacos?  These were so good, they should do pastrami sandwiches.  I say this because these tacos were way better than the pastrami sandwich I had from Wise Sons.   Serious.  I can't be on valencia when they're open &amp; not at least stop by here; I'm pretty sure that means success for any restaurant or bar.  In case the constant flow of customers was not enough indication.    Congrats Tacolicious Team.  On the restos, on the cookbook, on the success.  You're just crushin it.    You guys rock.", 
    "review_date": "2014-11-20"
  }, 
  "VqFxHPjA_VAEGb_QHVgFYA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Braden B.", 
    "review_text": "Mosto rocks!!! Best selection of tequila and margaritas to match in SF. Awesome music, great scene, great bartenders. Love this place!!!!   I'm not rating the food as we just drank and hung out, but everything I saw looked pretty amazing!", 
    "review_date": "2013-10-12"
  }, 
  "UiGjeRQyDE8rxgE-0hisaw": {
    "user_rating": 5.0, 
    "user_location": "Newark, CA", 
    "user_name": "Liv K.", 
    "review_text": "Delicious cocktails, friendly bartender and yummy food. We popped in around 9:45pm on New Year's day. It's got a cool vibe. Warm dim lighting with canning jars lining the ceiling. We sat at the bar and admired the numerous bottles of tequila. The tequila list is a pretty neat read, with witty descriptors such \"burly\" / \"mo-fo\". I'll stay away from the \"burly mo-fo\" type of tequilas...need something more tame such as \"pink bubblegum\". I ordered the La Paloma cocktail (made with Jarritos Toronja) $9 and an Al Pastor Taco $1.50 topped with a slice of pineapple. The food order arrived with miniature squeeze bottles of creamy chipotle and green sauces. I don't remember which cocktail my friend ordered but it was tasty like a margarita on the rocks $9, and he liked his tamale $3 enough to order a second one. I just needed a snack, and the little taco really hit the spot.The drinks and food came out quickly. The service was great. You look at the bartender like you need him, and he comes right over to assist you. Of course it helped that it wasn't busy. ;) The bartender was terrific with refilling our water glasses, too.", 
    "review_date": "2012-01-03"
  }, 
  "UJUji2Vv_2zs_xA2y04Ebg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice W.", 
    "review_text": "Came to this bar with my friends since Tacolicious next door had an hour wait, and I'm glad we did!  Love the tequila selection and the page long mezcals!    Had a mezcal flight for $20, the bartender chooses 3 for you.  The Al Pastor tacos were good.  Definitely coming back to try more tequilas and other items on the menu!", 
    "review_date": "2013-01-21"
  }, 
  "vi1Ta_3XtGTqkl4p83ZbEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Toby C.", 
    "review_text": "I'd say this is more of a 3.5 star place, but I will round up a bit as I'm feeling generous today.  The drinks are good (but about $1 overprice imho), the service is decent and the atmosphere is refined yet relaxed.  Great place to come when you actually want to have conversation with friends.  Love the mason jars on the ceiling.  Try La Paloma, the St Germain grapefruit tequila cocktail.  Despite the fact that it was likely a dumb idea to put a Tacolicious in the middle of the Mission (and it was super dead on a Sat night at 10:30pm), Mosto actually works.", 
    "review_date": "2011-12-19"
  }, 
  "RUdC9hsYQfOJRp2suOrjig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle M.", 
    "review_text": "Many things to LOVE about Mosto  -Taco, Beer and Tequila shot combo for $10 -Great decor with a cool alley patio -Normally I like carnita or beef tacos but at Mosto the fried fish taco and chicken taco....Bravo. -Great staff  It gets packed pretty quickly so get there early!", 
    "review_date": "2012-03-11"
  }, 
  "A28JSW8X2efZxfgiC6w_HQ": {
    "user_rating": 1.0, 
    "user_location": "Boston, MA", 
    "user_name": "Sasha K.", 
    "review_text": "Really bad drinks, that's all.  Great atmosphere, nice location, OK bar food, but bad drinks. (And pretty terrible service, too, if I'm honest).   My friends and I went here and sampled 6 different tequila drinks, and not one of them was good. One was way too sweet, one was really just stupidly spicy, one was way too acidic, etc. The three of us couldn't make it through a single one of their drinks, so we ended up ordering the plain-old-margarita as a control/last resort, and it too sucked and just tasted like sours mix, not lime.   I'm being a tad vindictive with the stars here, but frankly if the place identifies itself as a tequila bar and makes such godawful tequila drinks, it deserves it.", 
    "review_date": "2012-05-28"
  }, 
  "xnnk45c14oVOsBB7hn_r3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas K.", 
    "review_text": "Good margharitas at the bar, good tacos. Gets busy and loud.", 
    "review_date": "2012-12-09"
  }, 
  "3mmO9CsSqFIHsQGRqIClRA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joëlle M.", 
    "review_text": "My friend's father challenged him to a tequila vs. mezcal identification, so Mosto was the perfect place to go taste-testing.  They have a full menu of both, and while I don't know the first thing about either (I tend to select an alcoholic beverage based on a) color and b) price by the glass), it's a really fun place.  It's a small and narrow place, so if you can, go earlier in the evening--or on a weekday--to ensure a seat or space at the bar.  We showed up at about 6pm and had a table to ourselves for tasting and card-playing.  Waitress was super-friendly and indulged our experimentation.  As a bonus, you can get decent-sized mexican food for only $1.50 per portion!  Fun place to stop for drinks before or after dinner.  P.S.  Tequila won over mezcal, hands down.", 
    "review_date": "2014-02-26"
  }, 
  "m-q18lAVSe6rKVLCpmebSQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie P.", 
    "review_text": "After college, I thought I'd never be able to smell tequila again, let alone sip it. Turns out I just needed to find some of the good stuff. Thanks to Mosto for showing me the way... olé!  The tequila menu here will make your head spin with excitement. After reading all of the colorful and complex flavor notes listed, I want to try them all. At around $10 a swig though, I'll have to take my time. The flights are fun, but of all the tequilas I've tried here so far, my favorite is the Espolón blanco. To my surprise, it's not very expensive in stores (~$20), so I am excited to stock the ol' wet bar with it. Get ready: one tequila, two tequila, three tequila, floor!  The itty bitty, street-style tacos are much different than the ones served on the Tacolicious restaurant side, but just as t-lish. Though I would happily eat one million of both the bistec and cactus (with burnt cheese!), I usually settle for just a few. Each one is intended to be a bar snack, not a meal - but they will save your life as you're wasting away waiting for a table next door.  As seems to be the case for most Mission bars these days though, this place is shoulder-to-shoulder CROWDED on the weekends (primarily popped-collared and/or sloppily drunk in stilettos types), so don't even try on a Friday or Saturday night.", 
    "review_date": "2012-02-27"
  }, 
  "Lr2SitKX9IhGCqJWfUVWdg": {
    "user_rating": 1.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Brenton M.", 
    "review_text": "Terrible! The waitress was snotty and kept glaring at us because we sat down on our own. (There were no signs and no one at the front).  Then our server was no where to be found. (I think it took 20 minutes before we saw her again to get the check). to top it all off, manager informed us that he couldnt take anything off our bill because it would set a bad precedent. I wont be setting the precedent of giving this place my business again. Terrible.", 
    "review_date": "2012-05-24"
  }, 
  "x0uGTpxCLKqoDSHBmEek1Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James O.", 
    "review_text": "Cocktails and food might be good. But don't attempt to come here for beer or wine. Wine is awful not sure if open for long or just bad and beer selection is kinda poor. :)", 
    "review_date": "2014-09-13"
  }, 
  "MKrCIkMT8baMkATt4fmzag": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Alice C.", 
    "review_text": "Mosto/Tacolicious, I love your tiles! Yes, because of those nice old Spanish tiles you have in the main dining room, oh.. and the Paul Madonna's ink drawing of Delores Park, you got bump up from 4 to 5 stars.  Food: the appetizer are very generous in size, tacos are very large, two will be enough to fill me up, I don't think I can ever eat more than 3 in one sitting. The grilled squid Veracruz are so soft and juicy; the chicken enchilada are pretty good as well. The chip and salsa that they provided are good, the chips are thin which you can just nibble on all night long.   Drinks: Oh.. they have tequila. In fact, the tequila list is bigger than the food menu. I still think Tres Agave has a more comprehensive tequila list, still with just about 100 type of tequila on their list, they gave me another excuse to come down to Mission. Their margaritas are very good, not too sour, definitely recommended. $10 per cocktails and $30 for a small pitch of the same cocktails, as you can see, drinks are not cheap here, and it is where they will make their profit.  Decor: modest, comfortable. The only thing I didn't like is those metal stools. They have a few different spaces. As you come into the main dinning room through the courtyard space, you will see a small bar counter with a much larger open kitchen, high bench sitting along the glass window that open to the courtyard. There is a banquet room pass the bathrooms, and another parallel space to the main room that have a much better bar setup. I like the variety that it provides, also it just means the wait time is less. (I hope)  Service: Overall good. Food came really fast, and our drinks took a little while.  Just a couple of suggestions, if tequila will the be the premier alcohol, then maybe the wait staffs should be better trained about them. I asked for sangrita to come with my Herradura reposado, and our waitress didn't know what the heck I am talking about. Also the few tables next to the hostess has the most awkward set up, those short metal stools look so uncomfortable. They could easily do a couple of large communal table with bench seating.  By no mean, this is not a place that their food or drinks will blow your mind away, but they do have a winning combination of being well priced and exactly what I have in mind for a night out in the Mission.  Great new addition to the Mission casual fine dining scene.", 
    "review_date": "2011-12-08"
  }, 
  "p7PoKtHEQ0AeFxumvS8OMw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "james m.", 
    "review_text": "The place was jumping!! really busy but worth the wait . Great Tequila selection and the  Margaritas were very tasty!!. The service was really good. we had the taco platter and tried all of them. some were really good and some were a little bland . I will come back for sure. and try some of the other items on the menu.", 
    "review_date": "2012-02-21"
  }, 
  "Aejy-UW9HomNgh7da4C0sw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sarah E.", 
    "review_text": "I absolutely love this place. Yes, it's a little too hipster for my taste but that's true about most places in the Mission. The drinks are great! I highly recommend the tequila flight. I love tequila and mezcal and what I loved about the tequila flight is that comes with different chasers. One of the chasers was really spicy and it was a perfect compliment to the tequila.   But perhaps the greatest part about this bar is that it's right next to Tacolicious, which makes bomb tacos. You can order tacos from next door without ever having to get up from your seat!   Order some tacos while sipping on your tequila and you'll have an unforgettable night. This place is also pretty quiet so it makes for a good date night. :)", 
    "review_date": "2013-08-05"
  }, 
  "fmoh2nAEjqvFrnHj_NzrUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon H.", 
    "review_text": "Oh man, this was simply a fortuitous stumble upon experience on New Year's Eve that had my man and I back for more this evening. On NYE I was pleased to find it mellow and not so packed around 11:30pm, we grabbed the four window seats and went on a taco-ordering frenzy. Between the four of us I think we devoured close to 20 of their $1.50 pastor tacos. Tonight (Monday) it was the same vibe at 5pm, got a small table and went loco on 12 tacos. The pastor is really nicely seasoned and served with fresh pineapple..mmm. Their two house salsas are devine, an orange salsa (made with oranges?) is thick, citrus-y and mild and the green jalepeno salsa is killer, vinegar-y and with a bit of a kick. I had the nopale taco as well which said it came with queso, but not enough to comment. It was also very good, slow cooked, nice texture.   My boyfriend ordered their Agave flight which is a 2oz of tequila, mezcal and sotol each, bartender's selection. ya know. again, we were here for the tacos.   I've had the Mosto house margarita (on the rocks) and the Paloma which is a grapefruit based tequila coctail. Both good, fine...$9, maybe.   The ambiance is really chill, dim lighting wasn't so good for eating, but it makes everyone look good. I wouldn't try to roll through with a group larger than 4 to this place...if you get there early enough you can snag the 2 large top tables in the back of the bar, otherwise its tiny bar tables with a very narrow bench. Either way, don't get confused, you're here for that Pastor!  side: On NYE we did pop over to Tacolicious which I guess is an independent-ish venue (expanded menu, tacos are $3.95, taquitos for $9 etc), if I were just going out for drinks and a snack or a first time date I'd stick to Mosto.", 
    "review_date": "2012-01-02"
  }, 
  "AuRuLV2f1NaeFvuQu5iXKA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jay L.", 
    "review_text": "Had some dinner down the street and wandered in for some tequila on a chilly Wednesday.  Nice spot, with a dark long bar on the left and an open woody seating area to eat on the right.  Asked the bartender to make us things based on our likes and he came up strong.  Had a great mezcal drink which was sweet and smoky.    At $12 a drink it ain't cheap, but it's SF so what you gonna do?  Crowd was kinda date nightish with not many singles.", 
    "review_date": "2013-01-07"
  }, 
  "rVI5jj3iMOibqs_iVXZrOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cecilia M.", 
    "review_text": "Amazing Hamburgers, and tacos! What a gem! Seriously would rate this on my top five best hamburgers in the U.S. , and Ive traveled quite a bit. Great for a group. I would make reservations ahead of time for a large group.", 
    "review_date": "2013-04-29"
  }, 
  "U9yWtQO_0LPjtaU9jN0JsA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean K.", 
    "review_text": "Mosto is one of those places that always brings to mind the question, why do they bother having waitstaff serving the tables if they aren't actually going to help you?  At least it's not as bad as some places where they bark at you for going to get drinks at the bar.  The waitress was very good about bringing us drink menus and taking our first orders.  Afterwards we were only able to view her from a distance.  Yes, only a distance of a few feet but that's what made it even worse.  She was tantalizingly close yet just out of reach. And it was so loud it was hard to get a hold of her - no one really wants to shout down a waitress.  To get around this issue people chose to order drinks at the bar or would eye-stalk her and then jump up and grab her as soon as she got close.  Go to the bar.  It's hard to have a conversation with someone when they are eye-stalking the waitress.  The other annoying thing was that the waitress we had did not believe in bringing change.  Maybe she's used to a $5 tip on a $5 juice drink but that was not my intention.  Yes, I realize I could have asked for change.  But in the middle of catching up with friends, eye-stalking the table (thinking maybe she brought it and I just missed it) then eye-stalking the waitress who was never around it was half an hour before I got a chance then I felt like it was may be too late.  So lesson learned.  Leave exact change.  Other than the issues above, the place is nice.  Definitely a step up from the usual Mission bar.  I asked my friend, where did these people come here?  Where are the hipsters?  We came to the conclusion that after work Mosto draws the weekend/restaurant Mission crowd.  Older hipsters, better dressed.  Around 6 it's empty and easy to talk.  By 7 the place will be packed and you'll have to shout.", 
    "review_date": "2012-01-20"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "How many tequila shots do you need to feel tipsy? TWO!   How many shots of tequila do you need to get the party started? FIVE!   How many shots of tequila do you need to feel invincible?? A WHOLE BOTTLE!  ;D  I usually prefer my tequila in a margarita or plain in a shot glass with lime.  But Mosto is a place where you should do BOTH, not either.  Or you could just spend the extra $$ for a tequila flight -- 270+ tequila choices line up the wall and yes, you will have a hard time choosing so ask your bartender for recs.  We had the Fortaleza reposado and this is clearly top-quality tequila, it is spicy and rich, none of this Patron stuff.  Down that and follow it up with the housemade \"sangrita\" chaser or the escabeche \"pickle-back\" and you'll be saying: \"ay carumba! una mas por favor....\"  After you get the booze taken cared of, place an order for the $1.50 Al Pastor tacos. El senor will expertly carve the meat pieces off the rotating grill. He tops it off with grilled pineapple, radish and salsa. I realized that getting 4 isn't enough because they are so, so good! (but so, so TINY!)  Friday nights are packed! You'll be elbowing your way to the bar and fighting for the few coveted seats. But the drinks and bites are worth it. If you end up standing with your margarita in hand, look up at the ceiling and count the seemingly endless rows of mason jars that adorn it. There are 3000+ of 'em.  My number could be off.  You know, tequila shots and all.", 
    "review_date": "2012-03-30"
  }, 
  "EtvHt75xU6-jkhaHjvRZRg": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Mara M.", 
    "review_text": "AMAZING. Enough said. Best place for tacos and drinks. You'll get your money's worth.  I had two of the fried local rock cod cabbage, with tangy crema which was divine! Not too much fried and it was so light. It was so good it literally melted in my mouth, no joke. I also had two of the guajillo braised beef short rib which was really juicy and moist. All of the tacos were delicious, but I will say they are filling. Remember that they come with two tortillas and you can make four tacos out of two.  I don't like tequilla, but I had the best drink there called flor de Jamaica. It was delicious and EFFECTIVE. Even their guacamole is delicious, but its a little over priced.    Service is great, and people are friendly. The way wait can take a while, particulalry at night, so I would suggest eating there in the afternoon.  OVERALL great place and one of my favorites!", 
    "review_date": "2013-06-06"
  }, 
  "VmloJ_YR6WMPOrX1Lp8wtw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee D.", 
    "review_text": "We found this place on sosh concierge, thought it would b fun to try a new spot..we were handed menus fairly quickly and once we mentioned we had prepaid with sosh..our drinks came out the bartender was on point with the timing...then the food was good but the chips with the burger was terrible. How can a burger that great have chips next to it that bad..they we over seasoned and not crispy. Drinks were good so was the food but not sure if it's worth returning...please fix the chips!!", 
    "review_date": "2015-01-12"
  }, 
  "IBrL-6twlZmQBGLdV2DQiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie C.", 
    "review_text": "$1.50 mini-tacos, $3 tamales, $3 beers, super casual staff who're having fun (and doing shots!), and loungey cozy relaxed atmosphere.  And serving food til midnight?  Sweet.  I like it better than Tacolicious.  More civilized and cheaper...", 
    "review_date": "2012-08-05"
  }, 
  "DV-hhMWE0pXwq9wHOJr3Rg": {
    "user_rating": 2.0, 
    "user_location": "Paris, France", 
    "user_name": "Brienne P.", 
    "review_text": "Honestly, other than the adorable babies sitting adjacent my partner and I (who were diversified enough to be in a Gap commercial) my experience here was subpar. We chose to sit outside which on some aesthetic level was interesting with its softly etched mural of San Francisco including bits of inspiring and fragmented prose, long narrow channel flooded with cheap-looking, yet fun modern orange seats tucked under some industrial string lights. Let me belabor the point, that was the best part.   It took us a while to get greeted. The sangria was a glorified watered down icee with only enough alcohol to laugh at one of my partner's jokes (not okay). We split the ceviche which was just okay. It was bland with no complexity, the bits of nectarine added nothing-- it was overpowered by a wash of  lime juice. The chips and salsa were surprisingly the best part. The chips were perfectly salted and fresh with a golden hue that reminds me of the dried grass on Mt. Tamalpias. The salsa was fresh, tangy and had no chance in hell of staying full.  The food was overpriced for the quality and the service was slow. They did have a pretty nice tequila list-- expensive but good. So my suggestion would be come get a nice shot of tequila and eat some free chips and salsa.", 
    "review_date": "2012-07-08"
  }, 
  "XSCTp69qsTtQ-LYrS2bMOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Java Z.", 
    "review_text": "I was skeptical about this \"Mexican\" bar venue in my hood, but it was way better than expectations.  Great service, cool design, and fantastic tacos / bar bites.  Cocktails were good, great tequila selection.  A new neighborhood favorite!  Small space, lots of people, but worth a bit of a fight to the bad for the drinks", 
    "review_date": "2012-01-18"
  }, 
  "o-2Y0SZwkqn-z73K05ZR2w": {
    "user_rating": 5.0, 
    "user_location": "Chico, CA", 
    "user_name": "Alyssa H.", 
    "review_text": "We stopped in here while waiting for a table at Tacolicious, and they made our two hour wait FLY BY!  It was my sister's bachelorette party and they treated us great!  Our bartended Ryan was by far the nicest and most friendly we had encountered this weekend, and he made her feel very special. He was also great at helping us choose the drinks that each one of us would like. Not to mention the street tacos were to die for!  If i lived in SF I would visit this place very often, but it is definitely a go to spot everytime I visit now!", 
    "review_date": "2013-06-24"
  }, 
  "CCNT9Hx9E2iLoLQ3zT6Hxw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Reyana F.", 
    "review_text": "Cute! 4 stars for just Mosto, 5 stars for the Sosh Concierge experience.  I got a cocktail tasting and taco deal through Sosh here (and then ordered more tacos) so I got a pretty well rounded taste of the menu.  Yes: Al Pastor tacos. They are a little small and could be eaten in 2-3 bites, but the Chorizo thing was a bit bigger and quesadilla like and was also pretty good.  The house margs are tasty, and the tomato salad drink is definitely interesting, albeit good.   No: The grapefruit cocktail is just ok, refreshing but a bit bland.  I would suggest going the Sosh route and getting a reservation- it was really cool how they just booked a table for you, and you can walk by everyone waiting.  This place is really small and narrow, so it feels intimate and fun!", 
    "review_date": "2015-01-25"
  }, 
  "p9HuNM8TGS440oAkmy9nOg": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Raul S.", 
    "review_text": "First of all parking sucks!....food is not that great i had way better tacos al pastor, service is really bad and they take for ever to get u anything from either the bar or any simple task....and last but not least the salsa plastic bottles look like little happy meal toys.....", 
    "review_date": "2011-12-19"
  }, 
  "F3GmIRa7314VSaYkd1_dDA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ellie C.", 
    "review_text": "LOVE LOVE LOVE this place!!!   Great music, great drinks and great tacos.  It's one of those rare places I feel relaxed and can hang out, not minding the wait, listen to good music while waiting and checking out good looking people. The only thing is you do have to wait, a lot, but it feels faster.", 
    "review_date": "2013-03-14"
  }, 
  "xVocUszkZtAqCxgWak3xVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Furai X.", 
    "review_text": "Thank goodness for those pork tacos that cured my hanger at only $1.50 each. Seeing the cook slice the meat from the rotating meat stick thing (as often seem with shawarma) added at least 10 tasty points.   We took the corner booth next to the tv to watch the Cal vs. Stanfurd game and enjoyed excellent service. Our waitress was not only attentive, but also patient. Very, very patient.  Even though I'm not the biggest fan of Mexican food, I'd definitely be open to trying out the restaurant side of Mosto. From what I saw on the way to the (clean) restrooms, the other side looked classy and quaint. Especially the outdoor area with the mosaic/mural-y decor.", 
    "review_date": "2013-12-01"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Great little bar next to Tacolicious in the Mission.  Great spot to swing by for a beer, some tequila and an al pastor taco or 2.  Staff is awesome, knowledgeable and friendly.  This bar is tequila centric...so if you like the stuff, definitely go here.  Well done to the Tacolicious crew for a new cool spot.", 
    "review_date": "2011-12-17"
  }, 
  "X62Mnr3egMpL_0Lrhbed_Q": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "J G.", 
    "review_text": "Happened to come by accident. Heard of the bar by word of mouth earlier. Pleasantly surprised. Very light and airy. Serves my favorite Tequila. The \"Real\" Patron Siete Leguas. For those Tequila Aficionados. Siete Leguas was the Tequila in the Patron bottle until recently. Now it's just a blend of other Tequilas. Mixed drinks were done nicely I think the bartenders name was Jacob. Real nice guy. Anyway. ambiance is low key, but energetic at the same time. The food plates are good. Had the Posole, Ceviche, Camarones al Diablo and the Chilaquiles. All great for feeding the hunger pain. Everyone was very helpful and friendly. If I'm in the area, I will drop in again.", 
    "review_date": "2014-01-14"
  }, 
  "9GhiQOLaM6ZGrrFG-SppwQ": {
    "user_rating": 4.0, 
    "user_location": "Venice, CA", 
    "user_name": "Bryan W.", 
    "review_text": "For Tequila and Mezcal afficionados.  Please sip your Tequila please!  Knowledgeable bar tenders guided me to some great Blanco, Reposado, and Anejo pours.  I was astounded by the number of shots purchased by patrons that the bartenders take and remain functioning throughout the night.  I enjoy myself a good sipping tequila and this place delivers.", 
    "review_date": "2013-09-08"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Wonderful addition to the hood. Great margs. Great limited bites menu! Great service.", 
    "review_date": "2011-11-28"
  }, 
  "upRh352VwnipRRWsnJP8SA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlin F.", 
    "review_text": "I'm confused if Mosto and T-Lish are the same place, i think they are just t-lish is the restaurant side. Regardless, I can't stop eating their chips and amazing salsa. The tacos are my favorite and I have never tried anything else there, mostly because I LOVE THE BISTEC TACO. I think i've tried all of them now and their each delicious.   If you like a full bar (i do), gourmet mexican cuisine (i do) and a lively environment you'll love it here.   my boyfriend LOVES their flights of tequila, if that's you're drink you'll love their selection.", 
    "review_date": "2012-02-10"
  }, 
  "PQQRHNEwX6gn649d0-atiw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anthony W.", 
    "review_text": "Excellent margaritas!!!", 
    "review_date": "2014-06-21"
  }, 
  "g3qIsZz5e3-ohnqXH442ZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris S.", 
    "review_text": "We only had margaritas, which were quite good.  The music was obnoxiously loud for a Wednesday night at 7.", 
    "review_date": "2013-03-28"
  }, 
  "A28J_oTLxXup2wc3UNOXQQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Saloni H.", 
    "review_text": "The Tequilas were great - the hubby and I had a great time. The bartender knows his tequila stuff we think because he sure knew a lot - I don't. The blanco tequila was my favorite in the tequila flight. The food was OK - the menu seemed small and and could do with a few more choices. The service was good without being in your face.", 
    "review_date": "2012-06-04"
  }, 
  "PKUW9VOkdAs-FOFt0KlibA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexia A.", 
    "review_text": "This place is a party and you are invited!  Even if the food were bad, which it is not, just watching the employees is a show.  They either over-staff everyone, or everyone works off the clock to keep on chilling. I saw a waiter give someone a kiss, the guys in the kitchen would not stop laughing, the host was jumping all over the place, everyone had smiles on their face...well, I just felt so welcome. I love it when the kitchen kids look so radiant.  Who cares what you should order, pick randomly, everything is good. Not super expensive either. Not that there is something overly particular about chips, but I really like their chips.  Anyway, keep the great vibe.", 
    "review_date": "2013-07-05"
  }, 
  "gAYp-W4vcn2Fw3YIIlSh8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paula C.", 
    "review_text": "Yes, yes, yes!!!  Great spot!!!  All kinds of different tequilas if you like it... delicious tapas, delicious drinks, awesome atmosphere!  Been there twice, and I'm sure ill keep going.   Tapas are super good, I tried 3 and liked all of them. My drinks were very well done too, and the service is pretty good, so really nothing to complain.  Oh, if you wanna go on a date, might be a good spot for it, since is charming and a little dark.   Thumbs up up up to Mosto! :)", 
    "review_date": "2013-09-04"
  }, 
  "tuyr32-Drc86VsXdPZaBcQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laureli K.", 
    "review_text": "I'll admit, I was entertained for the first 5 minutes inside Mosto.  Ambiance, check.  Clever lighting scheme, sure.  Tall tables so people can sit/stand, yup.   Things got disappointing fast when we tried to get drinks from the bar.  I'm fine waiting to order, but am less fine with the bartender rolling his eyes and then having an extensive conversation with the two people who were eating at the bar next to me.  He took no action on making the cocktails or pouring the beer.  Just stood there chatting.  I stood there watching and, incidentally, learning more about those people than I wanted to know.  Thinking that I had committed some social faux pas, my fellow drinker ordered the next round from the bar on the other side.  Same thing.  Order got taken and then the bartender seemed to get distracting in the middle of the transaction.    Maybe service was just slow?  Apparently not once you get your drink!  My friend put her drink, 90% full, on the bar that runs along the front window.  She turned her back (but did not step away) to finish telling a story. In less than a minute, an employee nabbed the drink off the bar and was speed walking away with it.  This could have been an honest mistake, but the employee then proceeded to upbraid my friend about not putting her drink down unless she was done with it.  Really?  Maybe this would be okay if we were wasted, but it was our first drink of the evening.   Paying that much for a cocktail, you shouldn't have to fight the staff in order to get it or finish it.  Thanks, Mosto, for making it so easy for me to never come back here again.", 
    "review_date": "2012-07-06"
  }, 
  "rQ7oQ1mb7ecjZ_ZMboNMfQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben J.", 
    "review_text": "They wont let me eat salsa and chips in the bar food section of the restaraunt. What kind of fake mexican facade do you think you are? Salsa and chips. Will that ruin everything? Will your restaraunt be burdened by the extra work? Are you fucking kidding me?", 
    "review_date": "2012-09-11"
  }, 
  "lAt1wrWIJORfgx_wsM9nJQ": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "M S.", 
    "review_text": "This place is great! My hubs and I went here recently at the suggestion of a friend who lives in the area.  Everything tasted delicious and super fresh.  We had a pitcher of the house margaritas, which were perfect and not too sweet!  And split the kale salad, chicken and lime soup and the BYO taco special that night.  All were superb!  Only downfall was the server forgot our order of guacamole, but looking back now I don't think our bellies could have fit anymore food so it turned out for the best.  Can't wait to go back!", 
    "review_date": "2013-12-04"
  }, 
  "dYbIkLXPSXDpq8ZhKSmNeg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Stephen C.", 
    "review_text": "We showed up late on a Saturday night after they'd stopped serving alcohol but the food was outstanding!  Try the taco sampler. So many delicious choices.  Bonus: One of the servers looks really similar to Aubrey Plaza! Conversation starter.", 
    "review_date": "2013-07-30"
  }, 
  "HWpk6qCCyC0hoEomMtzuPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brandi v.", 
    "review_text": "Best bloody mary I have had in ages... Their house mix is so savory and spicy and yummy and like nothing I have ever tasted before... plus! pickled carrots and jalapeños as the garnish. I am in love.  As for food, I only had one short rib taco, but it arrived with a huge basket of lovely tortillas, a bowl of savory, medium spice salsa, and a trio of specific salsas for the taco ranging from a mild. green to a thin, gorgeous spicy-hot habanero.  I will go back again for brunch sometime soon and I look forward to sitting outside in their little side patio.", 
    "review_date": "2012-01-31"
  }, 
  "POmyqedLjt06Gfajf1of5Q": {
    "user_rating": 4.0, 
    "user_location": "Hoboken, NJ", 
    "user_name": "Nicole S.", 
    "review_text": "Came here for beers last Friday. only 4 beers on tap and everything else is Tequila. But they  had modelo so it was okay. They offer some snacks in Mosto as it is next to Tacolicious  but not as extensive of a menu. This place is super crowded pretty much all the time but we got a few stools at the bar. My only negative is they don't offer chips and salsa at the bar!! boo! their tacos are good but chips are always a great snack when you are at the bar. Otherwise great new addition to the mission.", 
    "review_date": "2012-09-10"
  }, 
  "JcocsjlqktULeWnyxzB-dQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jared S.", 
    "review_text": "I am a big tequila fan, and any place that can offer me new drinks at a reasonable per-cocktail price is going to get a bonus star from me. I did like their food, too--just make sure you take THEIR menu and not the menu from next door. They have separate registers and menus.  The place seems like a winner if you come at the right time of night, before it gets packed. Once the crowd fills the place up, you really feel the crunch as elbow room becomes a precious commodity. And I'm certainly not one to get in the way of people having a good time with liquor, but you will find it very difficult to eat anything if there or do a tasting if drunk people are bumping into your table or stool as they try to squeeze into the bar.  There is a TV on the back wall, but I wouldn't recommend this place for a baseball game on a Friday night. The high noise levels and tunnel-design of the bar will make following the action a bit difficult.  Nice bar though, I will be going back to do my tequila snob thing.", 
    "review_date": "2013-04-30"
  }, 
  "T1rP9rqslOh_72KI0IW7rQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia W.", 
    "review_text": "While Tacolicious can be crowded, loud, and hectic, Mosto is its quiet, chill, smaller counterpart right next door. The menu is very small, but they have $1.50 Al Pastor tacos with pineapples that are super good. You can see the meat slow cooking in the window. Unlike Tacolicious' huge portion sizes, though, these are normal-sized, and I ate like 4 of them.  Good place to chill with a friend, have a drink, and get some tacos if you guys aren't going to hardcore rage and black out later that night.", 
    "review_date": "2014-08-04"
  }, 
  "XI-XhKTPulrHZ1W5kWV6Rg": {
    "user_rating": 5.0, 
    "user_location": "La Crescenta, CA", 
    "user_name": "Ara A.", 
    "review_text": "Man, if I lived in the area this would totally be one of my regular spots. The ambiance of this place is great, really love the layout and the overall vibe from the decor to the lighting to the service.  I was in San Jose with a co-worker on business and on our last night we decided to drive over to SF and grab some drinks. Luckily I found this place on Yelp and I'm so glad we checked it out. The tacos I had were really great and the Long Island I ordered was perfect.   This is going to be one of the first places I stop at when I'm back in the SF area, for sure!", 
    "review_date": "2012-01-12"
  }, 
  "37HswRimgBEf7_US-c3CDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adrienne G.", 
    "review_text": "Darn fine margarita!  Godawful loud music!  After placing our names on the waitlist for Tacolicious, we moseyed next door to Mosto for drinkys to tide us over until our names were called  Plenty of open tables &amp; barstools but we chose a table that happened to be near 1 of the speakers.  Had to yell into each other's ears just to be heard.....boo  Waitress was nice as could be &amp; knew we were just waiting for a table so we were short-timers  2 Margaritas please!  Before the drinkys had been made, our table was ready &amp; the super-nice waitress said she'd be happy to bring them over to us - awesome!  Those drinks were salty &amp; tart &amp; all kinds of good!  BF said he could feel the tequila after about 1/2 of his drink.....I'll have what he's having!  Browsing their menu as we were deciding on our libation, looked like they had some notable munchies &amp; would definitely be worth a visit on their own.....getting the tacos to go from next door, of course!", 
    "review_date": "2012-07-12"
  }, 
  "lOz_XJN-61QV1jki7sQ1Sg": {
    "user_rating": 4.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Tiffany T.", 
    "review_text": "Went there with a group of friends as a belated birthday celebration for myself and instantly became a fan of Mosto.  Ordered the tickle me telmo (so good) and tacos (classic carnitas, beer and a shot chicken and forgot the last one) and both were very good.  Would come back again.   They don't do birthday celebrations but you can order a dessert and they will bring it with a candle to your table :)", 
    "review_date": "2012-02-06"
  }, 
  "yF22nN7Sh9WIcbyR-MRd2w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "MJ A.", 
    "review_text": "Hip and trendy scene... we sat in the bar section and munched on their tacos.  Was a good experience... just a bit too crowded for comfort.  Probably not a great idea to come here if you hate tequila.", 
    "review_date": "2012-06-26"
  }, 
  "KiiaeP1jVSKgNSXzHTZ5kw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolina S.", 
    "review_text": "Danger!!!! cheap delicious mini tacos and several tequilas to keep you entertained at the bar for hours! my first visit to Mosto quickly ensured a long time relationship to come. 2nd date butterflies!", 
    "review_date": "2012-01-19"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Tequila and I are NOT friends.  I don't trust him.  I think he gets a kick out of embarrassing me in public.  Friends just do NOT do that.  The first time tequila and I met, I belligerently chanted out loud (over and over again) how my friend was going to get some nookie nookie that morning...in front of the girl he just met....in front of table of 10+ people at 3 AM.  The second time at a Vegas Bachelorette party, my friend, the bride-to-be found me on the floor with two Palazzo security guards hovering over me snickering. Apparently, I was trying to get into our hotel room, gave up because I couldn't open the door so I ended up sprawled on the floor like a hobo. I think being on the right floor would have helped. FAIL. My friends now write \"Please Return to Palazzo Room #\" on my arm.\" No joke.  These days I avoid tequila like a plague. That was until hump day arrived. Looking for a post happy hour spot, Mosto was the closest place within walking distance to where we were according to my Yelp app. All I have to say is Yelp made me do it...again.  While sipping on my strong El Mosto ($9) margarita cocktail <a href=\"http://www.yelp.com/biz_photos/WMf6bHwvBftlZF-vUb6Cyw?select=9watN7YGQvcJu4XV6RT61A\">yelp.com/biz_photos/WMf6…</a>, we couldn't help but notice a couple next to us giggling, making out, groping and fondling each other like high schoolers in a backseat of a Chevy at the drive-thru movies. Go, Go, Get it, Get it!   Tequila may not be my friend but it was definitely someone's BFF that night. *wink wink*  OTHER NOTES: *Friendly, knowledgeable, and attentive staff *Long and very narrow space (seating for ~25 people) attached to Tacolicious *Over 300 kinds of tequila, mezcal (agave), and sotol (desert spoon plant) *Cocktails ($9) are made with house made syrups and sodas *Tacos ($1.50) and tamale ($3) are available for noshing *CC's accepted with no minimum *Parking blows", 
    "review_date": "2012-04-13"
  }, 
  "PYzWU5txGNFQpBTsNu3pRA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer O.", 
    "review_text": "I was led to mosto under the impression that they served sangria. apparently, its the restaurant next door (same owner) that has sangria as this is strictly a tequila bar. i actually hate tequila, but i could down a margarita. so my friend and I ended up staying and having a pretty good time. i also LOVE that they serve small bites.. i had a taco which was so delish! nice little spot in the mission, i'd definitely return!", 
    "review_date": "2013-04-04"
  }, 
  "pS-XrpL6uQsDKuaxw-2qjg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jose A I.", 
    "review_text": "Was just there yesterday for Lunch and it was amazing. We will return to enjoy the excellent Tacos and the many other dishes you have to offer.", 
    "review_date": "2012-01-29"
  }, 
  "zpMQ0SzeI0IXjs_e6JW-BA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyler M.", 
    "review_text": "This place is amazing. Pioneering tequila and tacos in the mission (ignore their marina location!). The staff know their sheisse and the food is top notch.   New mission hotspot no doubt.", 
    "review_date": "2011-11-30"
  }, 
  "oUis60pUmjPxa2Ienrj8aw": {
    "user_rating": 1.0, 
    "user_location": "Lake Elsinore, CA", 
    "user_name": "Mary C.", 
    "review_text": "Not impressed with the tacos, tortillas could have been a lot softer, presentation was great but the flavor and hardness of the tacos were extremely disappointing.  I will not be returning to this location.", 
    "review_date": "2014-01-08"
  }, 
  "EGvptPOz6SDKdxvbeqQ7Vw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc T.", 
    "review_text": "Probably the best gringo tacos I've ever had. Met up with Randy, Char, Elisa, and A.Lau while coincidentally running into Cat and Jor and their families.  7 dollars for a tequila shot and a tecate? Done deal, especially for a tough day of work  (all of us were having)  We ordered the 10 tacos special for 31 bucks. 3.10 a taco is pretty pricey for the Mission, but this is more of a fusion place. All tacos come with 3 sauces... spicy (habanero), medium (tamarind i think), and mild (green sauce). All sauces were good, and had different profiles so mix and match.  Short Ribs - these were cooked medium, and were super tender but you'd pretty much gobble up all the meat before even finishing the taco. The only thing that was bad about these were that they were under seasoned.  Carnitas - Surprisingly tender... closer to pulled pork though than carnitas. Not overly salty or crunchy, which was a bit disappointing, but the pulled pork flavor was great.  Beer/Tequila Chicken - amazingly flavorful. Almost like a mole taste to the beer/tequila chicken, but it had this nice sweetness from the beer and tequila. The chicken was ultra tender, and not overly salty.  Fish - this gives Nick's a run for its money. While this may be smaller, it is slightly cheaper than Nick's. It has a better batter flavor as well, though Nick's bests Mosto's with the guac and crispy tortilla.   Lengua - not one of the specials... but still amazing. Ultra tender cubes of beef tongue (don't worry, they shave off the taste buds), marinated so that it was slightly sweet but more salty. This was amazingly tender, as in yakitori japanese restaurant tender. You cannot get tongue cooked any better than Japanese style or Mosto style. My only gripe was the price tag (5 bucks). However, this is THE BEST lengua taco I've ever had... hands down... sadly its a weekly item only.  Choco Taco - pretty much a fancy choco taco... with the waffle being crispy and flavored similar to a Swedish pancake (vanilla flavored). The ice cream was deliciously creamy and dense (vanilla flavored as well) and the chocolate was dark chocolate. Almost tasted like a fancy Drumstick.  Overall an awesome place, with good deals. I would dock it 1 point for bringing tacos to the Mission but this place is different than your standard tacqueria. As many others have said, it does have a sexy atmosphere, and I would definitely recommend this place.", 
    "review_date": "2012-02-10"
  }, 
  "DpiMuxg2g4urzClzjykUHg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Em L.", 
    "review_text": "Tequila Bar? Yes. Yes. Yes.", 
    "review_date": "2013-02-21"
  }, 
  "IfBFgK8ZEIe3h5fBFLEJBA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J L.", 
    "review_text": "Disappointing. I was excited to try this place--a tequila bar in the mission with an outdoor patio. Decor was fun. Pricey drinks ($9 for a tequila drink, beer was less.) and not much space. It was a Marina meets hipster/dot-com type crowd. The biggest reason for my 1 star review was the service and closing time. Apparently, this bar closes at midnight?!--it's rather strange for a bar to close so early. Our friends had just ordered drinks 5 minutes ealier and the bartenders didn't warn them they were about to close--they just happily pocketed $20+. So we had to chug expensive drinks before they booted us out. Classy.", 
    "review_date": "2012-01-07"
  }, 
  "xQhtt0hfNV6UiVNNV53rNA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Martin B.", 
    "review_text": "I enjoyed their tequila selection. I admit I had a few too many but well worth it! My friends had a blast seeing my inner Mexican come out! Huge props to the workers...I'm sorry for being loud, its the Mexican in me.", 
    "review_date": "2014-04-01"
  }, 
  "M5NQ153RuP_3ebtRoZ4Z7w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel P.", 
    "review_text": "Love tequila. Love a tequila bar... but the staff here need some serious schooling. Our waitress sat 4 obnoxiously drunk fellas at our table who commenced to pound on it, yelling at the TV, the walls and each other. The wife and I opted for a quieter corner to finish our drinks. We paid the waitress on first sighting and she ran off with a significant chunk of change and disappeared. I eventually gave up the hunt, cut my losses and joined our friends for dinner across the street.  This proved to be a miserable place for a pre-dinner cocktail. It's more the kind of place to get your party on, Cabo style. With enough tequila, this place would be just fantastic!", 
    "review_date": "2013-09-09"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "This is a sexy place with a great floor plan. The left is the bar/lounge area and the right is the sit down restaurant. The bar patrons don't hover over the diners and dinner service doesn't interfere with the liquid dieters.   A great tequila menu with some excellent bottles and an even more solid selection of main wall tequilas which goes beyond the sub-par Patron. Friendly bar staff and helpful wait staff made the crowded bar area comfortable.   Nice work guys....I will be back to try the food and enjoy more amazing tequilas.   Cocktail of choice: La Paloma", 
    "review_date": "2011-12-18"
  }, 
  "zAxVTy0LH5QHxEQfzpk3sg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shelley M.", 
    "review_text": "I love love love this place..beautiful,fun,and delicious! Friendly,knowledgable service staff. Tacos al Pastor,the La Paloma,so many great tequilas on hand,and you can totally geek out on Mezcal. LOVE", 
    "review_date": "2012-05-24"
  }, 
  "YB_lLsvjmdhFF0XaryaydA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Leilani M.", 
    "review_text": "Ted and Harrison rock the bar on the weekends serving up some fine cocktails. Yes it's true, cheap mexican food and even the tacos are crafty.   My friend had a cocktail which had absinthe. I jokingly asked for a cocktail with beet juice, and we were given one which tasted like it.   Ted and Harrison are attentive, skilled, professional and totally approachable.   It's a cozy bar. It is connected to a restaurant next door.", 
    "review_date": "2015-01-11"
  }, 
  "Pe8YfzsRARvlAu4-0_DRtQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Christina L.", 
    "review_text": "Went here while my boyfriend and I were walking around the Mission, we were on a mission to find every delicious bar and restaurant on our last night in SF.   This place was fantastic!!!! Upon entering, it's a smaller space with a bar full of tequila and seemed a little intimidating. but the bartender and server were incredibly friendly. We ordered the paloma and two orders of the adobada tacos. The tacos were so good we had to get two orders. The meat so really well seasoned on a warm tortilla and the pineapple added the perfect sweetness. My mouth is watering just thinking about them.   The space also has an awesome ceiling installation. thousands of jars are screwed into the ceiling, some empty and some filled. We asked the bartender what it was for and were informed that people can fill a jar with whatever they feel like. he suggested 100$ bills. lol  We didn't have any of those lying around but decided to memorialize our trip with a picture of us and a coffee card with the dates of our trip.  HIGHLY recommend checking this place out.", 
    "review_date": "2014-04-04"
  }, 
  "xPd-lodXhvc6SHuUkfX3mQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audra S.", 
    "review_text": "Amazing tequila selection, awesome bartenders, delicious vegetarian tacos and plantains.  Who would have thought that St. Germain would blend so beautifully with tequila?  The bartenders at Mosto figured it out and it's amazing...if those are your two fav liquors.    The ceiling in the bar is made up of jars filled with mementos and if you are really nice to the waitress, she might let you put something in one.", 
    "review_date": "2012-07-23"
  }, 
  "MFOuCaxi1857wiPX2n3mRQ": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Monica S.", 
    "review_text": "PROS -  TEQUILAS!!   Service was personable and attentive Tacos  CONS -  The next day.....", 
    "review_date": "2012-02-27"
  }, 
  "p8VlaSVW1cLCNA9RHNP90w": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mars S.", 
    "review_text": "Mosto, soooo delicious!  El Pastor tacos are super cheap, only $1.50! They throw some pineapple in them which add a really nice sweet touch.  Pastrami taco was more expensive, but pretty fucking MIND BLOWING not going to lie.   Wash them all down with margaritas or mojitos and you're solid.   Only thing that threw my friends and I off was when they gave us sauce for our tacos (yknow typical green sauce and hot sauce) they gave it to us in super small squeeze bottles. I can understand their logic to some extent, it's a small restaurant and they don't want to lug around huge bottles. However, we ordered 20 tacos and needed more sauce than just a to-go hand sanitizer bottle worth :/   Overall, great little place with a nice ambience as well.", 
    "review_date": "2014-12-22"
  }, 
  "umsIG90wRX5RIXfMseNp_g": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Katrina W.", 
    "review_text": "I can't comment on price range, because I just assume that every meal I have in San Francisco is going to be 2x as much as Portland. My math on that may be a little skewed.   But you know what? Plug this into your spreadsheet:         |- - - - A  - - - - | - - - B - - - | - - C - - | - 1 -| - - FOOD - - | - - Yes! - - | - - 1 - - | - 2 -| - - DRINK -  | - - Yes! - - | - - 1 - - | - 3 -| - -SPACE- - | - - Yes! - - | - - 1 - - | - 4 -|  -SERVICE  | - - Yes! - - | - - 1 - - |  Column C logic: =IF($B:$B=\"Yes!\",1,0)  IF Statement Formula: =IF((SUM(C1:C4)[less than]4),\"Meh.\",\"WOOHOO!\")  Result: \"WOOHOO!\"  Notes: (1) House-made chips and salsa and flavorful fancy cuisine. (2) Unusual, memorable, and dare I say savory? cocktails. (3) Comfortable, clean and quaint environment. (4) Fast, friendly service, even when you're in a rush and need to catch a plane.  --- If you prefer a simpler equation:  MOSTO = GRANDIOSO.", 
    "review_date": "2012-11-07"
  }, 
  "lH7vh2NZkG36PLNcxpgZiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark C.", 
    "review_text": "A fine new addition to the mission - a bar with food + a very cool ceiling.", 
    "review_date": "2011-12-02"
  }, 
  "38zhUVIh6t_-mpcmbWYmiw": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Andrew L.", 
    "review_text": "The happy hour tacos and tequila selection are both top notch.   Love this place and can't wait to return for dinner.", 
    "review_date": "2012-02-20"
  }, 
  "OvteZk2gWKfIRAryq7T9KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda B.", 
    "review_text": "tacolicious! yummy trio tacos...  we had the pork ribs and steak tacos.. so mouth watering and the salsa hit the spot. 4 tacos for $14", 
    "review_date": "2013-07-27"
  }, 
  "t4ePmQZaKjlgRyd_WUztfA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Needles K.", 
    "review_text": "Went on a Sunday night.  The place was packed.  The cool Sunday evening vibe has been ruined.", 
    "review_date": "2013-01-28"
  }, 
  "891LuSKPz3Eq9vasWYeNjA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian P.", 
    "review_text": "We've been here more than once, with greater frequency, and love the cozy space with delicious drinks, food and waitress! Hard to say which taco or tamale is the best... You'll just have to sample one of each. That's the fun of it! Take the leftovers home - even better the next day! Powerful cocktail list that is updated often.  Very unpretentious, unlike its cousin next door (Tacolicious).", 
    "review_date": "2014-10-04"
  }, 
  "8QPTuks0e2jtKQgy-Jc7og": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sue T.", 
    "review_text": "Great great cocktails. Luv the idea of separate menus for the bar area to restaurant area which pretty much doubled my options for food n drinks to try. The ambiance is pretty phenomenal as well. Totally chill SF peeps all the way. Went to dinner without reservations but it worked out well cuz of the bar area. Ate a little and drank a little... just enough to make it to dinner and have a blast a little. Guess I had a good time :)", 
    "review_date": "2014-05-13"
  }, 
  "YFNAYiWUDuNqv57VS5tXPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T S.", 
    "review_text": "Good drinks, they aren't stingy on the alcohol. I also ordered the pork skins and ate them with lime and hot sauce as recommended by the server. They were cool, and kind of melt in your mouth (which I didn't really like).   I was disappointed that I couldn't order chips and guacamole, you can only order that at their sister restaurant in the next room.", 
    "review_date": "2012-02-08"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "A dark, noisy, well-decorated bar that's nice for a decent margarita.", 
    "review_date": "2011-12-18"
  }, 
  "7UuFJeZbZAcv2oeJ_-QcNw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Vina A.", 
    "review_text": "Mosto is a chill spot for a tequila cocktail and some small bites.  I am a fan of the pineapple on the 1.50 taco al pastor, but I'd like either a more tender pork or more pineapples. The tamale was light with fresh ingredients (ended up ordering another round) and the pastrami taco was surprisingly tasty - not too heavy at all.   Super friendly service.", 
    "review_date": "2014-01-06"
  }, 
  "gyvBwQPhZiJkND2tpjYz1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly C.", 
    "review_text": "Limited seating but what they lack in chairs they make up in tasty cocktails. I enjoy the vibe. Good energy, happy servers and interesting decor. Just stopped in while waiting for my table at Tacolicious and want to return now to try the food. Stay-tuned for that report.", 
    "review_date": "2014-01-06"
  }, 
  "3WyYrgDTTQ5Xh-2N9P1dgg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen R.", 
    "review_text": "Not only does Mosto have a wide variety of tequila, but the tacos al pastor and Ms. Reyes tamales are amazing.", 
    "review_date": "2011-11-26"
  }, 
  "a6FvAW6zLhx_B3fY5j3_gg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Griselda L.", 
    "review_text": "Refreshing michelada's, extensive tequila selection, friendly bartenders, and some of the tastiest $1.50 tacos! Seriously tasty tacos!", 
    "review_date": "2012-10-08"
  }, 
  "JWrONUccWS-RexScWSPWxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark N.", 
    "review_text": "quality drinks, knowledgeable staff, and vast selection. Let your bartender guide you through the extensive tequila list, complete with detailed flavor notes. The choices are every bit as nuanced as a wine list would be. And order food while you are here, the kitchen is top notch.", 
    "review_date": "2014-05-16"
  }, 
  "Ou6eJFvev_6yCXVMEhg1cQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mei F.", 
    "review_text": "Jaime the bartender was so helpful in concocting the perfect drink! You're one superb mixologist! Thank you for defining what the standard should be! A+++!", 
    "review_date": "2012-02-04"
  }, 
  "ykZYlsupNIPnwxZKEApPuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cheryl E.", 
    "review_text": "Mosto is great - the bartenders are friendly and helpful and had great recommendations.  The drinks rival Latin America Club as far as alcohol content...  we didn't eat here (ate at Tacolicious) but the small menu looked great.  Love the decor and feel of the bar; great tequila and anejo selections!", 
    "review_date": "2011-12-14"
  }, 
  "Mnc4UxKdlr9J0VSic9mpFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seghel Y.", 
    "review_text": "The cocktails here are delicious and innovative, if not a bit too pricey.", 
    "review_date": "2014-11-17"
  }, 
  "rVs5Ttf3TcjX952G289c9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina C.", 
    "review_text": "Fun place to be on a Friday night! It's quite intimate and small (thus hard to snag a table or bar seats), but worth the margaritas and many tequila drinks! The tacos are also cheap ($1.50) and they're also conveniently located right next to Tacolicious! Bartenders were also good at their skill and attentive with our needs.  The only drawback is that it does get quite loud sometime, but hey, what bar isn't on a Friday night in the Mission?", 
    "review_date": "2015-01-25"
  }, 
  "T0b4HcIjNyYnQxDoXqKWWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystle S.", 
    "review_text": "We and the besties came here on New Years Eve because we refuse to pay a $10 cover change for Casanova. This place is best described as a New York hipster style bar and restaurant. They make their own \"chicharron\", there tasty with chile lime salt packaged with in house label but they are really no what I consider \"chicharron\" because there is no crisp fat on the underside :(. But the al pastor tacos were on point! And the drinks were nice and strong. Definitely will be back to this place, to really check out the menu and entrees!", 
    "review_date": "2013-02-05"
  }, 
  "LKpd28drREu-cHwflED0TQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will D.", 
    "review_text": "Great for cocktails. Good recipes and good bartenders. However for $10 I expect them to be stiff and these were like koolaid (albeit dill lemon koolaid).", 
    "review_date": "2013-12-01"
  }, 
  "3lnkcquJAveiBQdTjIt4PQ": {
    "user_rating": 5.0, 
    "user_location": "Little Rock, AR", 
    "user_name": "Jensyn H.", 
    "review_text": "This place is such a hoppin' bar!  I love the taco-making window, where you can watch each taco being made.  We had some amazing tacos with great salsas--pineapple, grilled cheese, pork--so many choices!  The prices are amazing.  It's just what you need if you're looking for a quick bite while you're roaming the mission OR if you're looking for a spot to stop, chill and have some drinks!  Also, the scene is AMAZING!  The bottles in the ceiling are genius and inspiring for all of those San Francisco artists!  The music keeps ya going too.    I love this spot!", 
    "review_date": "2012-05-03"
  }, 
  "onpHlAZwvllYWlG3_pP6hA": {
    "user_rating": 3.0, 
    "user_location": "Eastside, Las Vegas, NV", 
    "user_name": "Linda V.", 
    "review_text": "This place was alright. People raved about this place, but it was nothing to really rave about. Customer service was not that great. We ran out of salsa and chips and we had to ask for refills. The set up of the good was nice. The look was better than the taste. Salsa was good though, but wouldn't come here again for over priced tacos.", 
    "review_date": "2014-01-18"
  }, 
  "cC3sH2M6aQ49NLTog0OW1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emma R.", 
    "review_text": "A perfect bar to start an evening or grab small bites and a drink. The margaritas are delicious and strong. The tacos are tiny but pack a lot of flavor, especially the pastor and chorizo. Lots of grilled queso fresco on the tacos, which makes you wonder why all food in life isn't topped with it. The menu changes a lot, but the specials, which vary from chicharones to ceviche, never fail to impress either. I only wish they offered happy hour.", 
    "review_date": "2014-11-15"
  }, 
  "dE9YaRaUtkDm-xJrW3BSPg": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Shane R.", 
    "review_text": "came here w jk and a couple of his friends from out of town.  contemporary ambiance.  enough light so you can actually see people.  and not too loud.  as a matter of fact, they turned the music down twice.  good prices too.  tacos al pastor and enchilada were quite good.  flavorful, meat was tender, and you could taste the pineapple.  one of the few establishments i've actually enjoyed in the mission.", 
    "review_date": "2013-12-17"
  }, 
  "inz8izVu0oSGeJJdY32zYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina L.", 
    "review_text": "The space is a little tight, so if you don't mind being in small spaces with strangers, the drinks were not too shabby, and the Al Pastor tacos at $1.50 were delicious and kept the hunger at bay until a late dinner, especially after a few cocktails!", 
    "review_date": "2012-06-20"
  }, 
  "nPcPMvJnidYfpXyEd1KLkA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Homer S.", 
    "review_text": "So far I've been to this place twice and I like the embiance a lot.    The have beers on tap and also have wine on tap I guess.   It's probably right now our go to bar in the area.     They also serve tacos which looked really good but didn't really try.   Maybe the next time we come over.    The wait staff was friendly and we never had issues getting a seat yet.   It has been fun.    Good times made here.", 
    "review_date": "2014-10-23"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "Tiny spot attached to Tacolicious with tasty tequila cocktails (la paloma gets a thumbs up from me) and a fun glass jar ceiling. If I didn't have plans to feast on some tasty roast pork later on that evening, I would have been all over the roasted meat twirling on a spit near the bar. Food smelled delish!", 
    "review_date": "2012-04-08"
  }, 
  "849a4nSS2LfwYtn9RxJovA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Erica R.", 
    "review_text": "Came to Mosto on NYE..food was delish..service was awesome and margaritas were a hit!  I am definitely a fan of Mosto and will be back.  El Pastor tacos with the pineapple got me..best I've had in SF.", 
    "review_date": "2013-01-02"
  }, 
  "jl79wBf7-2tmB3p_k9dFEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily C.", 
    "review_text": "Indulge in a Mezcal flight here! There are separate bar, dining and outdoor seating areas. The dining area is intimate yet spacious. The salsa and chips are extremely good so you might forget to leave room for the meal but please do - the bites are tasty.   The biggest obstacle you'll encounter here on your journey to happiness is the crowd. It gets thick and heavy and very loud so if you're planning a more intimate evening get savvy about when you're arriving or keep the group small.", 
    "review_date": "2013-11-30"
  }
}