{
  "UdDhIwPrEnDSLEBlR1sF0g": {
    "user_rating": 5.0, 
    "user_location": "Tenderloin, San Francisco, CA", 
    "user_name": "Mo H.", 
    "review_text": "Muka is filling a well needed niche in Hayes Valley.  Great wine, clever bites and an exceptional back bar. The polenta was rich and creamy and an excellent partner with a glass of Bordeaux. Definitely coming back.", 
    "review_date": "2013-08-14"
  }, 
  "4Y81J2Tdq5XAnkeYmCZ2ow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nique F.", 
    "review_text": "The wine + cheese + meat formula always works for me, and Muka does it expertly. They've got Frenchies backing the concept, so the provisions are well chosen and the wine menu written on a chalboard like the French are known to do.   The space has tons of light, the wall facing the street is all windows. For the \"see and be seen\" set, this is your spot. It's on the outskirts of Hayes Valley but makes a nice casual pit stop after a day of shopping/strolling/spending too much money. They offer happy hour 2PM to 6PM TOUS LES JOURS! with wine,  sangria, and bartender's beer choice all for $5. Sold.   We had some wine, cocktails, and a cheese plate, all solid. Asking for more bread is certainly no faux pas where the Frenchies are concerned (I know I love my stereotypes, but so many are true!) Service was friendly and chill in the afternoon -- I imagine the night time scene is a little more lively.   In fact, they promote their vibe as \"coffee by day, cocktails by night\", so you really can work and play your way through the day, right here.   Sexy, modern, casual spot for an afternoon apertif and some prime people watching, a la francaise.", 
    "review_date": "2015-01-29"
  }, 
  "rj6_HpGGcYrVPnErhWZqzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan M.", 
    "review_text": "A vast improvement than what has ever been in that location. The cocktails are very inventive however they are pricey.", 
    "review_date": "2013-08-22"
  }, 
  "vIbsjrNFccb-5BIMcytN-Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles S.", 
    "review_text": "We stopped here because they had a nice looking outdoor seating area (rare in SF). Bad coffee (their soy tastes funny and their chocolate is too sweet). Incompetent baristas that weren't friendly. They didn't even have any whipped cream, which we normally ask for in a small cup to give to our dog while we sip our coffee. Won't return.", 
    "review_date": "2014-12-13"
  }, 
  "dhpiYmhVJLNKxjgZeiHHaw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Sean P.", 
    "review_text": "Catching up on a past trip...came here on a recommendation and glad we did.  Sat at the bar with a friend, bartender let us try a bunch of different bourbon and scotch than ordered a bunch of plates.  The honey drum sticks were money as was everything else.  Bartender even hooked us up with a nice IPA on the house.", 
    "review_date": "2014-02-26"
  }, 
  "Vf3DJncooLUHWYele0Cxrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "I'm not sure what's going on here but it's super chill and the owners and staff are friendly and funny.  Gotta respect the chill yo.", 
    "review_date": "2013-09-29"
  }, 
  "2s_0rnDW6U8nyxCczpTvlw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen T.", 
    "review_text": "Love this place.   I went there on a late Saturday night with a friend wanting some dessert and booze. I was so surprised that they were not packed on a Saturday night, but hey I love it when a bar is not so crowded or loud.   While they ran out of my favorite cake, tiramisu, The waiter recommended the chocolate crunch and it was delicious. Later in the night we found out that the waiter, Jean Luke, is the owner of this bar. He is super friendly and so is his staff.   I will definitely go here again.", 
    "review_date": "2013-08-13"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "They've reopened.", 
    "review_date": "2014-04-23"
  }, 
  "LwQ4DJdwwSrBoKs1xSlPNA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna V.", 
    "review_text": "I was really excited about this place opening. Went for the great happy hour deal $10 for a sandwich and a beer. My sandwich came and it was cold and loaded with onions (allergic) instead of the description of sweet peppers. I asked the bartender about the sandwich and he told me he had no idea and to read the menu. I asked if I could get the honey BBQ chicken sandwich how it was listed without onions and his response was I dunno it's all premade. I then opted for the egg sandwich sandwich which came freezing cold right out of the fridge. Safeway has better sandwiches. I would go else where in the hood for HH and in general.", 
    "review_date": "2014-05-23"
  }, 
  "_07sX4FweeXddJifAVpKkg": {
    "user_rating": 4.0, 
    "user_location": "Göteborg, Sweden", 
    "user_name": "Pauline M.", 
    "review_text": "Me and 8 friends came here for happy hour on a friday and the place was really nice. The Flying dog double dog double IPA was 4$ on happy hour menu and the cocktails tasted amazing.  We where happy with everything we took. The ratatouille and fried polenta was really excellent, strongly recommend that. We also took a bunch of chicken wings and summer squash and liked it.  Great service and nice vibe, worth a visit!", 
    "review_date": "2013-09-19"
  }, 
  "4ObdanERzpWLiOeJ4Q_VrQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie R.", 
    "review_text": "Update:  Muka now is open during the day for breakfast and lunch as well (in addition to dinner).  Muka coffee is the best I've had in San Francisco - the beans come from Rwanda-Burundi Tanzania and are roasted in Oakland.    The menu is now deli style - fresh sandwiches with a Japanese flair such as Japanese style Roast Beef and Ham Katsu and salad choices including Freekah, Quinoa and Potato salad.  The soup is a curried lentil soup at this time.    The cocktail menu (bar is open from 7am until midnight or later) is still unique with boutique liquors and a great happy hour.   Service, taste and atmosphere...  Muka has it all.    Service:  Jean-luc, the owner is usually on hand with a big smile and welcoming attitude.  If you've visited more than once, a big hug may be included for the lucky ones.  Robert, the lead bartender, is quick with a smile and a story while he creates a specialty drink with fresh basil or pours your happy hour beer. The feel is family, and you're a part of it.    Taste:  The Japanese inspired selections are fresh, savory and affordable.   A selection of small plates that range from $4 to $8 will meet almost every need, from vegetables picked up in the am from the Farmer's Market to tasty chicken wings to fried polenta.  The entrees (lamb pot pie anyone?)  averaging $15 are perfect after a long day as well.  The desserts are delightful and evil temptations.   Atmosphere:  This is the perfect neighborhood bar.  Instead of focusing on trendy style or a modern theme, Jean-luc went with taste and old school.  I've stopped by for a drink in jeans and when dressed up for a night.  Music often has a beat to it but one can have a conversation without yelling.  The size is perfect for intimacy but large enough to not feel crowded.    Muka is my new favorite neighborhood spot in Hayes Valley.  But ssssshhhhh - don't tell anyone!!!", 
    "review_date": "2013-08-09"
  }, 
  "Ry0wikjG8QePQgciDmupfw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Danielle H.", 
    "review_text": "Just had my birthday party there last night.  Great place for drinks and small plates and worked really well for a party, as we pretty much took over about half of the back room.  Jean Luc and Russell took good care of us the the whole crew had a great time.  Will definitely be back!", 
    "review_date": "2014-05-04"
  }, 
  "zFPs9j4-lz5ze_IZGEoTYg": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Aurora F.", 
    "review_text": "Perfect for date night. This place is cozy and intimate. The drinks are awesome, as are the desserts! Highly recommend!", 
    "review_date": "2014-01-28"
  }, 
  "w7SGVC0-Cd2CWlc-jwDH2Q": {
    "user_rating": 1.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Nancy G.", 
    "review_text": "We can't speak to the quality of Muka's coffee or daytime service, but the Tuesday night we went after the opera -- Muka's location is great for an after-opera nightcap -- we had a terrible experience.  The place is very low-key, not very pretty in my opinion, but functional, at least, and the server came quickly to take our orders.  But apparently he knew nothing about mixed drinks, and it seemed as if the bartender didn't, either.   I asked for a greyhound up, and the bartender said he was out of grapefruit juice. OK. I could understand that, so I switched to vodka up with olives, and the server brought over a dish of olives and nuts because he thought that's what I'd asked for!!  I tried ordering a vodka with a twist instead (thinking it might be simpler).  What came was vodka with a lemon twist AND olives in the drink.  A friend's lime and soda was also some weird-tasting mixture. Maybe the bartender used Rose's lime. The rest of the group ordered wine.  Good choice. Maybe there's more than one bartender, and the other one knows what he's doing.  This bartender wasn't friendly, either.  Definitely makes us hesitate to go back.", 
    "review_date": "2014-12-03"
  }, 
  "AOFDB60pjiXby08lx5HHYQ": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Came here for cocktails. Looks like their menu changes everyday, but Sean, the bartender, was still able to make something for me off the menu that matched my palate. Tiny bar area, but place doesn't get too packed, which is nice. Good place to bring a date. Parking is hard because it's next to the ballet, but if you come after the ballet gets out, it's fine. Would definitely come back here again.", 
    "review_date": "2013-12-01"
  }, 
  "yqRH5qP5Vyakdped-QiPAA": {
    "user_rating": 3.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Vatsala G.", 
    "review_text": "Muka is Coffee Parlor by day and a full swing bar by night. Love the ambience at this place, beautiful big glass windows and skylights. Nestled right in the midst of the performing arts district of SF so good while you wait for the show or after. I had the pasta salad which was served cold (they said thats the norm) but it was kinda right out of the refrigerator. Upon request it was heated up and i was good to go. The waitress was very polite and friendly. Not exactly the place for bites, but it can rescue you on an odd day.", 
    "review_date": "2014-11-24"
  }, 
  "CRml_MPAzUNxNk74QidPLg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben C.", 
    "review_text": "Stopped in at noon on a saturday to grab a cup of tea and blast through a bunch of email.  sign out front says \"free wifi\" - which is true as long as you have a facebook account i guess.  i dont use FB so i was stuck with constant popup boxes asking me to log into facebook and like their page. Even though i was a paying customer i was not allowed the same clean wifi access as others.    completely dead when i was there, awesome looking space with great character.  looks like it would be a great night spot for cocktails/beer.  plan on coming back one evening to check it out, but unlikely for morning activities.  cant comment on food, just had a cup of tea, refills are free.  which is a positive.", 
    "review_date": "2014-12-27"
  }, 
  "AD9ya3kKX4njFBdL9qLd2w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monica K.", 
    "review_text": "Loved the ambiance and small plates, but the service was absolutely horrible. No one ever came by to check on our table after serving us and they were not even that busy! I'm hoping they'll work out the kinks after some time.", 
    "review_date": "2013-12-17"
  }, 
  "neNSB3Sly1wUS6HFHLMang": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "和子 Y.", 
    "review_text": "I had heard great things about this place, and the menu looked wonderful! I went with a friend for coffee. The coffee is apparently from the owner's plantation, and is generally prepared as a drip (AKA pour over) or French press. I prefer their coffee prepared in one of these two ways, but not the Americano, which is just blazing hot water from the espresso machine that just burns the coffee! The croissant sandwiches are tasty. Great shrimp and egg salad! I was not to thrilled with the soups, the Japanese curry (too salty and not served with rice--huh?). They have some homemade chips (lemon pepper potato chips, satsuma imo chips--which is like a japanese sweet potato), but they taste more 'dessicated' (dried out) than chippy. The service is efficient and the staff are always friendly and courteous. I can't speak for the evening service, though. I will come back for the coffee!", 
    "review_date": "2014-07-25"
  }, 
  "jlWa3n7ex4eJ0o5Ho164xw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Junko T.", 
    "review_text": "My husband and I visited the new Muka.  The location is convenient with the parking garage on the above. The place has a big picture window facing the street.  It was fun to watch the people walking on the street.  The interior creates warm and rustic ambience.  It was delightful.  I had a virgin cocktail which their bartender made it on the fly for me.  My husband had a glass of Cabernet Franc which he really liked. They serve small plates.  It would be fun to visit with a group of people to try many different dishes.  All of the dishes we tried had delicate and sophisticated feel in it.  My favorite was squash blossoms.  This is a must try!    We enjoyed our evening at Muka with good food and drinks.  We will definitely come back to try some more!", 
    "review_date": "2013-10-23"
  }, 
  "dqTyILFF-VBDlewosM7FkQ": {
    "user_rating": 4.0, 
    "user_location": "Silver Spring, MD", 
    "user_name": "Mark B.", 
    "review_text": "This is the second time here. I was here last night. Friendly crowed and delicious desert.", 
    "review_date": "2014-10-15"
  }, 
  "cCZXCeZC33l424pcnNvHQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nana A.", 
    "review_text": "Muka is by far my most favorite cafe/lounge/bar in the city. The decor is uniquely beautiful, the drinks are carefully and thoughtfully made, and the folks working there are super charismatic and sweet. The owner Jean-Luc and his staff are really invested in Muka and are constantly thinking of ways to make it more lively, delicious, and fun. The bartenders I've had the chance to get to know, Chelsea, Russell, and Sostrong, are wonderful and vivacious.    I even had my recent birthday party in the backroom at Muka where we put on the Giants game on the projector and played our own music with the back room's sound system.   If I were to ever open a lounge it would be just like Muka :)  Thank you, gracias, and merci!", 
    "review_date": "2014-11-06"
  }, 
  "MHLJxx7M9WJGUVhnU1ogtg": {
    "user_rating": 5.0, 
    "user_location": "Clinton Township, NJ", 
    "user_name": "Minty N.", 
    "review_text": "My husband and I were only in San Francisco for one night and we were very happy the night ended at Muka.  We went there in search of dessert. We were greeted by a very gracious bar tender/owner who apologetically explained they had just reopened and were all out of desserts. In return for this he gave us two croissants for the price of one. Apparently this place has a pastry chef from Paris which explains the amazing chocolate and almond croissants we had.  On top of the great service and grub, this place has the perfect mood lighting for a date with a charming French/Rustic decor.   When we are in the area again, I will certainly come back for more!", 
    "review_date": "2014-04-08"
  }, 
  "fhPlL3_kkywLzvimODRvjA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Landra S.", 
    "review_text": "Muka is such an inspiring place to be and work. Their coffee really puts a hop into my step and their drinks a blush in my cheeks! Definitely check it out!!", 
    "review_date": "2014-04-18"
  }, 
  "jipgimnSNp3qdK2dKUQvBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "Bf and I stopped by Saturday night around 11.  I've always wanted to try Muka when they opened up at their original location but never got to.  They just moved to Hayes Valley two weeks ago.  We walked in and some drunk people were blocking the walkway by the bar area.  There was no host to greet us or anything.  Several of the wait staff passed us several times and didn't say anything to us even though we looked confused.  They probably need an extra server or two, or at least a host/hostess as they looked a little frazzled.    We shared the fried zucchini ($8) and squash blossoms small plate and the bread pudding ($10).  We opted not to drink, but still got served very quickly with our food.  The fried zucchini &amp; squash blossoms were delicately fried &amp; not greasy.  The fried zucchinis were my favorite of the two.  The squash blossoms were stuffed with cheese, my guess is ricotta.  We also liked the aioli served alongside.  The bread pudding was a croissant stuffed with some custard and topped with fresh fruit.  OMG...it looked like it was going to be insanely sweet, but it was perfect.  So good..not too much custard and just enough glaze on top of it all.  And, how can you not love a croissant.    Muka has a full liquor license which is good if you come with those that like their hard liquor a lot more than a glass of wine.  They didn't have many appetizing small plates or large plates, so I'd come back definitely for another dessert and a wine when I want a date night with the bf.  Prices are a little on the higher side in my opinion, with the bread pudding being on the lower end for the dessert prices.  Candybar is my favorite dessert/wine bar in SF, but seems like we can get luckier with parking in Hayes Valley.  Muka, you'll be seeing us again.  3.5 rounded up.", 
    "review_date": "2013-07-29"
  }, 
  "Q2OqdQVwtQvTAidzheKk7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary M.", 
    "review_text": "Muka helped us organize a surprise bachelorette party that we couldn't have pulled off without them. Three cheers for Jean Luc and his team!  The staff graciously let me set up hours before the party and made sure that the tables I wanted were free and clear for the event. The drinks were great, the desserts were divine (that earl grey panna cotta!) and we had a blast. Thank you!", 
    "review_date": "2013-10-11"
  }, 
  "RMxi0Onb-PfMbLZsuxVFHA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Najla A.", 
    "review_text": "Meh. At best.   If you want a cocktail, stop by. If you're expecting a legitimate WINE BAR, GO ELSEWHERE. My friend and I we're served a bottle of house red riddled with so much sediment that it was almost chewy. When I asked for it to be filtered and decanted (as a reasonable wine bar would do), the bartender proceeded to pour our wine through a coffee filter. We are not camping; I am not paying you so that I can \"rough it\". I expect a wine bar to have a REAL DECANTER and a REAL WINE FILTER. This place is NOT A WINE BAR. On top of that, we had the cheese and charcuterie plate, and one of the meats on the plate had a bizarre green-ish tinge. Unsettling, to say the least. This is just a convenient place in Hayes to stop for a beverage. Don't expect much else.", 
    "review_date": "2014-08-07"
  }, 
  "0sQi4dU7h6xw7wwJg22EvA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jason M.", 
    "review_text": "What a pleasant surprise find just off Hayes st.! I walked into Muka to grab a coffee before dinner and fell in love. One of the best cold brewed coffees I've ever had. On tap I might add. The staff was friendly,  knowledgeable and very accommodating. Superb craft beer and cocktail selection,  warm atmosphere,  wonderful staff. 10 out of 10. Great job Muka!", 
    "review_date": "2014-08-15"
  }, 
  "OqH85SAF0oLijVY_SeAk8A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donna H.", 
    "review_text": "I love the new Muka. The ambiance is perfect. Modern and sophisticated, but warm and romantic. I used to walk by here every so often, and I know they did a lot to fix up the space.   I don't frequent wine bars usually, but their happy hour is great. House wines and sangria (excellent, btw) are $5. Great service, and big pours = awesome/me needing to eat. I ordered the brussels sprouts and bleu cheese potato gratin. Yum! I almost didn't want to share. I also tried the Kale Caesar Salad -- thank YOU for making the Caesar Salad nutritious, Fried Calamari, and Shishito Peppers. Those peppers.. So simple, perfectly spicy, but oh so good!  I can't wait until brunch is back. :D", 
    "review_date": "2013-10-27"
  }, 
  "sPqHcRC--tRanPC-g4pNwQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adele F.", 
    "review_text": "It's been a very very long time since I've doled out less than 3 stars. Unfortunately, Muka only earned 2 stars.  First was the horrible service. It seems our first waitress didn't communicate our order, so we were sitting there for a while, wondering what was taking so long in a place that was decently empty. Our second waitress didn't suffer from amnesia but did suffer from a stick-up-her-butt (which is worse? tough question). Not only was she snobbishly curt, but she swapped our check with that of table next to us (out of the 3 groups there, goodness) and gave us a look that made it seem as if it was OUR fault.  Second was the options. They have three desserts on their menu, but they only had two in stock. Really? Aren't you a drinks&amp;dessert venue? I will say that the MONT BLANC, $13, is fairly tasty. It's reminiscent of a Ferrero Rocher, though the macaron they put on top is yuckily soggy and tastes like egg.  Lastly, their last call for drinks was at 9:30 PM. Don't your hours say 1 AM?  Expectations not met. Adele not returning.", 
    "review_date": "2014-04-08"
  }, 
  "cxMcM-7kZj7sVqEefv2fhg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John T.", 
    "review_text": "Muka, what can I say!  Sometimes the stars align perfectly, I booked Muka for my company's holiday party, and it was my best decision of the year.  It's a lot of pressure to be responsible for the years most important event.  Needless to say, the staff at Muka were flawless.  The GM, Robert, directed the event with precision, and the staff were both gracious and fun.  The wines were wonderful and the martini's were simply delicious.   Now the food.  The food was delish,  I mean really delish!   Beautiful cheese and charcuterie platters.  The oyster were a hit. Trays if barbecue chicken, deliciously moist and tangy,   The chef sent out a gratin that melted my heart.  I felt like I was hugging my mom.  Yeah, it was that good! There are many factors that go into a a rating.  For this event, the only thing that mattered was that my coworkers had a blast.  I know, I'm gushing, but the entire staff at Muka has made me a rock star! Enough said.", 
    "review_date": "2013-12-15"
  }, 
  "x8K1ynWiL5z627ZykSGn6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shal J.", 
    "review_text": "Lost out drink order at the bar, were surly about it, finally got them and they were all average quality and taste. They charge mixology prices while using common liquor for lame overall effect. We ordered a variety of cocktails and nothing was worth ordering again.  Food took forever to come out (two slices of quiche), was then delivered without silverware so it got cold while we waited yet more.  Great location with so much potential. Bartender with the black hat and bartender with the slick hair, thank you for at least being nice and finally lining up our drinks. Other bartender, you were rude, pompous and just a general jerk. I won't see you again and you won't see my money. I win.", 
    "review_date": "2015-01-11"
  }, 
  "_JdQaOMc5q89DpTeMyc6Mg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aamir S.", 
    "review_text": "I've come here twice, and both times for he earl grey panna cotta. if it's on the menu, get it. now.", 
    "review_date": "2013-10-04"
  }, 
  "nGqmdnQb_xUHNcPheQbwtg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mihir M.", 
    "review_text": "Ate here with my wife once. Many small plates &amp; some entree size items as well. It is a \"cool\" place to eat &amp; is near the War Memorial Opera House &amp; a parking garage. The service was fast &amp; friendly. The staff worked to accommodate us for vegetarian &amp; eggless items. We enjoyed it! The fried polenta, shishito peppers, fall parsnips &amp; curry pot pie were all good, along with their non alcoholic drinks.", 
    "review_date": "2014-02-25"
  }, 
  "B1L60uYOxaSUg0xwokPV1w": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Krista C.", 
    "review_text": "The bartenders were super helpful about picking drinks to order and were patient with our indecisiveness. A friend of mine later wanted to order savory potato chips, but they only had sweet potato chips left, so we got it for free! I loved the red eye beer cocktail, sweet drink alcoholic with the bite of ginger beer. Laid back vibe. Great place to sit and chat over some drinks. Will come again!", 
    "review_date": "2014-12-21"
  }, 
  "QCTDMx5zXmu14JrZxbVhnQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber G.", 
    "review_text": "Muka is only a block and a half from my apartment. The staff are friendly and it's a really nice place to hang out and have some snacks and drink. I went here for the first time for a party, and was really impressed with the ambiance. It's a cozy oasis in the middle of my favorite neighborhood, and lacks the bro-factor slash pretension of other bars and restaurants in the area. I really want to go back and try the cheese and charcuterie plate, because CHEESE AND CHARCUTERIE PLATE, AM I RIGHT?!", 
    "review_date": "2014-12-19"
  }, 
  "X-iNmOHpM4Nq-tYyJV5k0Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erica M.", 
    "review_text": "About a week or two in advance, I made a reservation through Open Table for dinner at Muka on February 28 at 6:30 pm prior to the symphony. At around 4:00 pm that day, I picked up a voicemail from Muka acknowledging my reservation, and asking me to call and confirm. I called back shortly afterwards and left a message. When my husband and I showed up at 6:30 pm, however, the door was locked and there was a sign on taped to the door saying the restaurant was closed. We had to scramble to find dinner elsewhere before the concert. I received a message from Open Table later that night indicating that Muka had canceled the reservation. I called Muka a day or two later and left a message asking for an explanation and never heard back. What terrible customer service.", 
    "review_date": "2014-03-18"
  }, 
  "34f-x6qBLagUbN5KkOlxtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lori Y.", 
    "review_text": "Came here after work to meet a friend for a glass of wine.  Place was pretty empty,so it was easy to get a seat.  They had a lot of wine to choose from, so I had a rich and buttery Chardonnay (droool....) which the bartender recommended, and I was totally happy with.  I'd definitely come back and try more!", 
    "review_date": "2014-07-11"
  }, 
  "gXZDZZPqVdd1wwC2Ach8Fg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz G.", 
    "review_text": "I find that the best places I've been to happen to be ones that I've honestly stumbled upon while looking for something else.  Muka is one of those places. With a 45min-1hr wait at Patxi's we headed off for pre-bday dinner libations. This bar seriously turned up the cute-yet-refined hipster barn knotch to 100. Lots of Edison-bulb lighting, warm, wood features, wrought iron bar stools to sit your tush on whilst sipping a cocktail, craft beer, or my favorite: pink champagne, betches! Oh wait, yes, we are being \"refined\"...brut rosé for me, and Duvel for the guy.   Bartenders were relaxed and fun. Prices are on-point with most other bars/lounges in the City. This is a good place to meet up for a drink and talk, as it wasn't crazy loud when we were in there.", 
    "review_date": "2014-09-26"
  }, 
  "AaB92hs92ww5ILfZggEJEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roger W.", 
    "review_text": "The minute you walk into Muka, you are instantly transported to the sidewalks of Paris and you can imagine rain falling gently onto the slanted glass windows above Muka.  Grab a seat at the bar and let the friendly bartender serve you an ice cold beer (or coffee if it's earlier in the day). Take a look at the variety of cocktails or partake in house made sangria or a cider. Wine selection is small but well priced and I can't wait to try the coffee cocktails next time I come back.  Was nice finding a gem as our group wandered Hayes Valley and the friendly service, laid back atmosphere, and soft jazz soundtrack will definitely get me to come back again.", 
    "review_date": "2014-09-17"
  }, 
  "RelVOqg2KOKrSnT8Yia0dA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anthony R.", 
    "review_text": "A great gem along the Hayes Valley/Civic Center boarder.  Stopped by for dinner here before attending the symphony.  The setting and layout of the restaurant was intriguing.  Mixed seating and ample space provides a variety of places to sit and admire the pedestrians walking along Grove street.  Things were a little dysfunctional and chaotic when I got there, having made a reservation I was looking forward to getting a table promptly.  However the wait service seemed a little understaffed and unprepared upon my arrival (perhaps someone called in sick or someone new had recently started; I was willing to give them the benefit of the doubt, though I knocked them down a peg from a 5-star).  Almost every seat was taken and there was a large party gathering which required the attention of most of the wait staff.  While waiting for my table I grabbed a couple drinks at the bar with my date.  My Amazonian Potion was delicious from the very first to the last drop.  I therefore highly recommend it.  Her Doctor Peychaud was nice and strong and more to her liking.  If you can appreciate whiskey and a strong drink I would encourage you to try it.  We split the Ratatouille and Braised Pork.  The Ratatouille was made perfectly, not too dry or liquid-y.  The Braised Pork came with a significant amount of broth, but it didn't detract from the flavor of the dish.  In fact it soaked and mixed with the polenta quite nicely.  This place is a definite do-over.", 
    "review_date": "2013-10-28"
  }, 
  "eTrivTysbnhp0-K1Q-EP7Q": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Teri V.", 
    "review_text": "What a great way to spend a Sunday afternoon...chatting with the DJ's, listening to good music, watching old silent films on video, and sipping delicious coffee. The carrot cake is served in a jar...really clever...and delicious! Muka is a fun place!", 
    "review_date": "2014-05-27"
  }, 
  "ABG39upyRuVJ6mCS9wC7Hg": {
    "user_rating": 2.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Jae Y.", 
    "review_text": "Muka was an... interesting experience. Though there were definitely some redeeming qualities (friendliness, ambiance, cleanliness), everything else was so inept that it made me question how they even function as a business. Where to start?  I came on a weekend evening. After taking the place in, I found someone to confirm that they were indeed still serving coffee and our party ordered a drip and 2 cappuccinos. At which point things started to fall apart.  Baffling issue: they didn't know what a drip was. Lingo aside, the coffee is specifically listed as \"drip\" on their menu. The French manager had to be called over, consulted, and a confusing discussion ensued before we got our coffee (the coffee is a large urn dispenser coffee, refills being free).   Okay. We were then informed that the cappuccinos would be brought over. After 10 minutes (it was not a busy night), I walk over to check and find no one in sight while my cups are sitting under the espresso machine. Another 5 minutes before the guy comes over and asks if we're doing okay, at which point I had to remind him about my order. He apologized profusely and proceeded to bring me a drip. Huh? More confusion and apologizing. Another 5 minutes before our cappuccinos arrive... which looks and tastes like drip coffee with poured milk and foam stirred in. Uh? A few minutes later a group of 5 sits down and were promptly served their cappuccinos in a few minutes. Um?  Did I mention that during the 1.5 hours we were there the music was non-stop Daft Punk? I like Daft Punk. Except when the playlist jumps from TRON to Humans to covers/remixes to RAM to various ft. Daft Punk back to.... TRON. Every 3-5 minutes felt like a jarring change of pace. I could barely get my head around it and then all of a sudden they were closed. An hour early. Maybe Yelp error? Either way, they had pretty much finished closing up before realizing that ours and the other group were still in the back. A friend of the manager noticed us through the window, came back in, and loudly ushered us out between the upped chairs and barred entrance all while snapping her fingers at us (though in a playful kind of way).  Utterly. Bizarre. Experience.   I put off writing this review for a while because I wanted some time to think over it before leaving a 2-star review. Even after going over my review and noticing how whiny I come off mentioning my cappuccinos a dozen times and leaving a wall of complaints I'll still be going through with it because it's all true. I'm being brief and I still needed this many words to detail how many strange things I saw in the span of an hour or two. It only sucks because I WANT to like this place and it feels like there's so much potential.  Sorry?", 
    "review_date": "2015-01-28"
  }, 
  "quJRJcSI6d6cN7ynUinJlA": {
    "user_rating": 5.0, 
    "user_location": "Laguna Beach, CA", 
    "user_name": "Salma Z.", 
    "review_text": "My last trip to SF, I ended up in Hayes Valley. The vibe you get when walking into Muka is amazing!! Staff is friendly &amp; knowledgeable. The small plates &amp; sandwiches still makes my mouth water...Talk about leaving your heart in San Francisco!", 
    "review_date": "2014-04-14"
  }, 
  "XLpeJe2HV2jvFkyX-pAsIQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A S.", 
    "review_text": "Go for the wine and the atmosphere. Dimly lit lounge that's not too crowded where you can get a great glass of wine and converse with someone.  The food was pretty terrible. The kale salad was ok, good dressing but it just didn't work.  The calamari was bad. Small, frozen, deep fried, yuck. The pasta was horrible. I could make better pasta with a frozen entree. The shishito peppers were ok but not too crispy.  I had their chocolate mousse. Meh.  Meh, all around...", 
    "review_date": "2013-09-18"
  }, 
  "GPofl5-KBzdz5tt_jM152w": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Dana S.", 
    "review_text": "Jean-Luc immediately contacted me when I posted about the billing issue we had. He profusely apologized and explained that he has changed management because of various issues he was having. He gave us a refund of the erroneous charge and we are happy Muka customers again!  We are looking forward to visiting Muka again soon and hope the new changes will get them a five star review from us!", 
    "review_date": "2014-04-28"
  }, 
  "ZRvPkOOMp0pjM07ICKQswA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura M.", 
    "review_text": "A great little place to go and chill.. went on a Friday night, it was busy but not packed, got a seat at the bar and ordered a whiskey (great selection).     I want to go back and order food and hang a bit longer next time", 
    "review_date": "2013-08-26"
  }, 
  "qZmAcUcbp4Q9l7NO4IcGSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy S.", 
    "review_text": "Awesome place to chill with friends!  Spacious with nice ambient lighting as well.  Friendly staff and very willing to make customers happy.  My friend and I really wanted a cheese and charcuterie plate around 1130pm on Friday night, but they were sold out that night.  One of the waitstaff went back into the kitchen and turned on the meat slicer and made us a plate.  It made our day!  Thank you!", 
    "review_date": "2014-07-12"
  }, 
  "cX0b2iSZJzezEmmNgtMICA": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Phil Y.", 
    "review_text": "It's hard to find a drinking arena without bar scene in very late night, say after midnight. We happened to hit Muka after our late dinner and we felt like to have some chats and drinks. Muka is a neat place that serve variety of coffees to hard liquors and house cocktails, and even steamed soy milk. Those were what we ordered. Sitting on bar stools, or squeezing in the corner of a dark lounge, having a bite of pastry or sandwich. We enjoyed our sipping and gossiping until early morning. Go check it out.", 
    "review_date": "2014-07-27"
  }, 
  "9xsI_oDLj1cvtTWcvaBdgw": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Alexandra A.", 
    "review_text": "I've never really been a bar hopper but I wanted see what's out there. After checking yelp reviews we found this place...lucky for us. The sangria was delicious and the staff (Russ and Sostrong) where a wonderful.  Looking forward to going again soon!    P.S.I love the bathroom!", 
    "review_date": "2014-10-06"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "Sometimes you want to go where everybody knows your name. This is true with the exception of seedy movie theaters and police lineups. Muka is such a place where you can meet and befriend some of the coolest cats. I've thus far met numerous French people, Germans, a Swiss girl and a lost traveler from New Zealand.   The current casual menu is much more accessible, with charcuterie plates, salads, housemade chips, fresh squeezed juices, beers on tap (hello, Denogginizer!), tasty wines and signature cocktails. I'm here all the time, as my Yelp checkins will proclaim.  Hail to the mayor. (I... I'm the mayor.)", 
    "review_date": "2014-08-12"
  }, 
  "UHGit4H1BvKML6O1se29Bg": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Jeska B.", 
    "review_text": "Came in on a Saturday and it was such an awesome ambiance. The drinks were nice and strong (Russ knows his drinks) and the food was so yummy! I can't wait to come back.", 
    "review_date": "2014-05-25"
  }, 
  "Yl7huUKWWDWUnw3HevcxWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda A.", 
    "review_text": "Jean-luc has poured his heart and soul into this restaurant. His dedication to good food, good drinks, and community has made a lasting impression. Muka has everything it needs to be successful for many years.  Drinks by Robert are stellar. Drinks are rotated on and off the menu depending on how well they are liked. The small plates are out of this world! The blue cheese gratin and polenta with braised pork are my two favorites.  Soon to be added: live jazz in the back room!", 
    "review_date": "2013-08-21"
  }, 
  "UsXqCXRZwSCSw0AT7y1uBg": {
    "user_rating": 4.0, 
    "user_location": "Silicon Valley, CA", 
    "user_name": "Candice G.", 
    "review_text": "The cocktails here are great but the sangria is greater.  100% get that.   Go red or go home and you get a hefty serving in your glass to make for a nice little mid-day buzz.   My group cozied up by the bar with a mighty tasty cheese plate post-weekend workday and had ourselves a fine time amongst the almost empty bar. Service was great - super friendly and despite the craftiness of the cocktails, all the drinks came up lickety split.   Next time I'm going beyond the glass and getting a jug of that sangria though.", 
    "review_date": "2015-01-08"
  }, 
  "tpz0iEFgkdIm4c1fxBhkGw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William D.", 
    "review_text": "The bartender Mo H, of this place wrote me on Yelp and said the following..   \"You are exactly the overly judgmental fart stain that writes a one star review on a soft opening that the restaurant/bar industry makes fun of later when we read said review. Lemme guess you have some shit stain \"tech job\" and have never worked a service job, it's a soft opening dummy, it's how establishments work the kinks out. Sorry for the harsh words but c'mon man!\"  Followed by another message,   \"Oh and if you wanna come by on Mondays I am the bartender\"   At this point, I cant help but think he really wants me to come in because he wants to confront me on my valid review. Not to mention, admitting to me that they make fun of my review and opinion as well as name calling me (looks like name calling runs in this business) and basically slandering me only makes this place look super professional, NOT! In fact, MY opinion and MY review are based on my experiences. IF they had a problem with people reviewing and posting on Yelp, they should have selected another business to get into and not served the public.  I know based on this information, I am NEVER coming back, NEVER recommending this business to anyone, and reporting what I perceive as a threat invite to Yelp!", 
    "review_date": "2013-10-20"
  }, 
  "IUP6bL32O5Mp19cKw-0uLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Neal N.", 
    "review_text": "Excellent. Sat at the bar and had fried olives, parsnips, and polenta small plates - all delicious. Manhattan was one of the better ones I've had.  And the music worked perfectly...", 
    "review_date": "2013-12-28"
  }, 
  "gPigej-Ws7PaIseGwlla3w": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Amy L.", 
    "review_text": "I came here for a holiday party and everything was just spectacular! All the food was wonderful, but my absolute favorite was the polenta nuggets. I also enjoyed the potato gratin. I'm not a drinker, but their guava juice kept me happy. Their wait staff was prompt in bringing out more food and they were quick to take the empty platters and plates away. Definitely coming back to try other dishes.", 
    "review_date": "2013-12-16"
  }, 
  "IfHplx86fRtsyQiyELmo8Q": {
    "user_rating": 3.0, 
    "user_location": "Outer Sunset, San Francisco, CA", 
    "user_name": "Jessica S.", 
    "review_text": "Hmmm.  Well the food and drinks were good, the alcohol was strong and definitely a $10 drink quality.  The one bartender was friendly and solicitous, if quiet.  It was also cute that it was a coffee shop-cum-bar.  It gave it a nice vibe.  And for the bad.  The other bartender was unpleasant and standoffish even when we were ordering.  There were three of us - we sat at a 4 person table and got one drink each and food to split.  The second we finished she came over to hustle us out despite there still being empty tables - not appreciated.  The music was also incredibly strange.  It sounded like Halloween noises overlaid on an enya track. (The clientele is also very much self-important tech guy in an ill-fitting suit.)  It wasn't awful, but I don't know that I'd go back.", 
    "review_date": "2014-11-22"
  }, 
  "TpxpGgOwcJc_r69ug8dc7w": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Kris T.", 
    "review_text": "Pretty cool place.  The Mrs. and I were in the city a couple of weekends ago and had some time to kill, when we stumbled on Muka on Sunday afternoon. Service was friendly and very attentive.  My wife got the sandwich with the Gruyere cheese, simply delicious.  The also have decent selection of wines and beers on tap. One of my favorites, Sierra Nevada Kellerweis was one of them... Lets just say I enjoyed quite a few.  Overall, if i was in the area I would definitely go back.", 
    "review_date": "2015-01-20"
  }, 
  "9mqYS99trygCB9jgTF7M7w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea W.", 
    "review_text": "Made a reservation for two about a month out in order to dine here before the ballet.  Two weeks later I received a notice from Open Table that the restaurant had cancelled the reservation.  There was no reason or explanation given.  I left two messages with Muka hoping to gain some understanding but I never received a return call.", 
    "review_date": "2014-03-10"
  }, 
  "yrdLY5uX5GVesGh2SLYAdw": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "MaryFran L.", 
    "review_text": "Not sure that this place has it totally together yet. We sat at the bar, ordered two cocktails which were inventive and reasonably priced. We also ordered food More than a half hour later, the drinks were gone and still no food. Yelp lists this place as a bar. I guess I should have stopped there and not ordered food, since we ended up leaving never having got. I might have left a happier customer.", 
    "review_date": "2013-10-10"
  }, 
  "5DG_knQLSOLeKPOKD6un9A": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Jennifer F.", 
    "review_text": "Good coffee.  Got a simple Americano - piping hot, strong, and bitter enough to pair nicely with a cinnamon bun.  By itself the bun would be easily overly sweet....but that's why I'm such and avid coffee drinker.  The space and decor is great.  Just a bit loud if you go to the back in the AM - they clearly have a great speaker system but it's a bit much when I'm still half asleep.  I can see how it's great for the evening, not sure it's where I would meet up with a friend to chat or get some studying done.", 
    "review_date": "2014-07-05"
  }, 
  "wEOvyzYqy37DNlQc0gJN3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tu T.", 
    "review_text": "Had our holiday party here and it was amazing. The venue was cozy and intimate, but still allowed our sizable group to have plenty of elbow room to mingle and arm wrestle.  The staff and service were spectacular, making sure the food came out at a good pace so we weren't eating the same thing all night.  The food, oh the food. The polenta nuggets were ridiculous, whoever came up with that must be a god among men. The star of the night though, was that gratin. Ooey, gooey, cheesy and soaked up all that scotch really well.  I'm definitely coming back to try their dinner menu. If it's even 10% as good as what we had Friday night, I won't be disappointed.", 
    "review_date": "2013-12-16"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "I came for happy hour, but didn't get to experience it. Muka doesn't do their happy hour on nights their are performances. Good thing to know.  Although I didn't get happy hour, the staff at Muka was still more than accommodating. They still had some food and drink specials. Generous pours btw. Loved my wine.   Coworkers liked the some beer and chicken wing special they had. I can't recall since I only had my wine but it was a GREAT deal.   Definitely need to come back for more wine.", 
    "review_date": "2013-11-04"
  }, 
  "eFw7LTcK9BSqdn06hZL-5w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Giana C.", 
    "review_text": "Yeah, I'm kinda hooked on Muka now. I write for a living, and have been wanting a place like this for quite some time now. The atmosphere encompasses hard workers and those looking to have fun - which is insanely difficult. The staff is friendly and, not that it matters, good looking! Grabbing a drink (or four) is also surprisingly affordable given the quality.  As of right now I am sitting down with a cup of French pressed coffee typing away blissfully. Thank you for existing Muka!", 
    "review_date": "2014-04-17"
  }, 
  "PntyZIbRFFfw65Cwd8X1Sg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn B.", 
    "review_text": "We came here for late night drinks (and 2 small bites). We didn't really know what we wanted to drink, so we just told the waiter what was the main liquor we wanted used, and the bartenders did a pretty good job of mixing up a drink to our taste.  For the 2 small bites we got the small bean salad and the chocolate mousse. The bean salad fresh, and the beans was big and meaty, but were just the right tenderness. The chocolate mouse was so smooth, and just the right amount of richness. In terms of the price to plate size ratio, I would say it was pretty fair. I wish I was a little hungrier to check out the rest of the menu. I plan on doing that the next time I go there.  I loved the look of the space. It had a very cool and sexy vibe to it with all of the dark wood. I liked the music that they played - it was a good mix of pop and mainstream, hipster-ish type music.  Overall, I def. plan on coming back to this place to check out more of the food.", 
    "review_date": "2013-07-21"
  }, 
  "oA5wDgfK3jq3r88Dg8XSNw": {
    "user_rating": 4.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Karen J.", 
    "review_text": "We thoroughly enjoyed our dinner at Muka.  The cocktails and food were delicious.  The staff was courteous and attentive.  The restaurant was intimate but we were not crammed in.  And, when we were done we walked across the street to the symphony.", 
    "review_date": "2013-10-15"
  }, 
  "oKrct4Hc8hZNMYXecitLCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "InfodivaMLIS B.", 
    "review_text": "I  parked in the Performing Arts Garage and stopped in en route to the Davies Symphony Hall to have a beverage. I came back after the performance and stayed. I had come before in 2013 when I had a performance to attend at SF Jazz. I am so glad I came back.  Thank you Muka for such a fun and generous New Year's Eve. Merci beaucoup. Bonne année et bonne santé !   Given the position of this bar, they could have charged a pretty penny for entrance in and jacked up the prices of the drinks but they did not and that is classy.  They even gave us a free glass of champagne at midnight.    The bartenders were all so friendly. I love the look of this bar, it is clean and accessible. The liquor selection is superb. The bartender was telling me how the owner curates what liquor he offers and purchases for the bar. The gin choices are excellent. Uncle Val's was out of this world. There is no Patron tequila!   I will definitely be back!!  Happy 2015!", 
    "review_date": "2015-01-01"
  }, 
  "5XLvD41yZAIjCzo1a1ZjlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam R.", 
    "review_text": "Love this place. Sunday afternoon DJs, a great vibe, and probably the best cold brew coffee you can get in the area. Was genuinely impressed. Love this spot.", 
    "review_date": "2014-05-26"
  }, 
  "A1bBsh_tvnTlUlSKAu9bww": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Sans S.", 
    "review_text": "Went on a sunday afternoon for world cup. Lovely interior and great DJ. Will go back with a laptop :)", 
    "review_date": "2014-06-15"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "I liked the old Muka, but I really like the new Muka. So glad that they moved to a sunnier spot in a more recognizable location. Looks like business is doing well!  Surprisingly, there's not a TON of places to go have a drink in the middle of the afternoon on a Sunday in Hayes Valley. There's some, but a lot of 'em get crowded due to various sporting events. Totally fine if you're in the mood to have a beer and hot wings (yum!), but what if you just want a glass of wine and a cheese plate? Quite a few of the restaurants in the 'hood close between 2-5 pm, so it's a matter of wandering the streets, looking for booze. Sort of like a hobo, but way less stinky.  Muka is open in the middle of the afternoon. On a Sunday. And they serve lots of delicious wine. There's even happy hour pricing on the weekends, which is a wonderfully rare find. Even a sparkling vino on tap for $10, a steal in my book. Though bubbly sounded good, house sangria was on special and I couldn't resist. As soon as I made my selection, the bartender said \"Oooh, nice choice.\"   How special can sangria be? Let me tell you, they do it up at Muka. Served in a fancy Duvel glass and topped with mint sprig, this is not your typical sticky sangria in a cup. Worth every penny of that $6 drink. Also ordered a panini with mozzarella and tomato, which was a nice substitute for a cheese plate. Ooey, gooey and perfect for two people to split as a snack.  Bartenders were so nice, they kept refilling our water and letting us hang while watching football on mute. That's how most sports should be enjoyed, IMHO. A lovely Sunday funday afternoon adventure!", 
    "review_date": "2014-09-26"
  }, 
  "tgV6tsYQ66DZ3LQKvtC6cw": {
    "user_rating": 4.0, 
    "user_location": "Dublin, Ireland", 
    "user_name": "Jennie C.", 
    "review_text": "WHAT? Coffee on tap?! I'm there!!!   Love this place - great drink selection (they even have ginger beer for you designated drivers). Also, they have their coffee all night in case you need to stay up.   Everyone's super friendly and the atmosphere is nice and cozy. Definitely recommend this place!", 
    "review_date": "2014-08-20"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "This review is just for happy hour. I really want to give this place a chance for coffee and pastries next time.  Came here for happy hour and some bar bites. Ordered the sandwich and beer happy hour combo for $10. Got the honey BBQ sandwich and was really disappointed. Sandwiches are pre-made and cold. They also don't have a microwave to heat up the sandwiches and the bread wasn't crispy... Kind of a soggy/cold baguette.  The owner was super nice about it though and explained that they have someone come in the morning and make the sandwiches for the day. I totally understand but BUY A MICROWAVE OR TOASTER OVEN! Seems like a painfully cheap and simple solution.  The house made chips were delicious. Again, pre-packaged but tasted fresh.   There are so many options for happy hour and tasty bar food in the area. I think the concept could be great with some tweaking of the menu. The space is also really great and airy/lots of windows", 
    "review_date": "2014-06-08"
  }, 
  "Cgj-iIx0hLt9wJUWTKBU4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mister T.", 
    "review_text": "Top of the pile.  The best thing to happen to Hayes Valley in 2013, period.    The kindest , nicest owner who has created a world class atmosphere sporting a reasonably priced yet well thought out cocktail and beer selection, pop up restaurant food alongside their own organic cuisine, decadent desserts, chill out lounge spaces, and well thought out music.   Focusing on a local Hayes Valley crowd, this place is cool and classy without  the slightest bit of pretense.   I could go on and on and on, but get down here and see this place or yourself. I live on this block, so message me and I'll meet you there!", 
    "review_date": "2013-07-22"
  }, 
  "KQHVEx-YdIot8jekAM8q0A": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Anne B.", 
    "review_text": "This was my first time at the new location.  Really enjoyed the petit plates and we got to enjoy a full complement of flavors and textures.  Everything was fresh and delicious.  Really reflects care in preparation.    Service was extraordinary. Hot food was hot and cold plates were cold. Everyone showed that they cared about our experience there. My favorites were the lima bean salad and the delicate fried calamari. The squash blossom is to die for! There were lots of gluten-free offerings and vegan options.  Hats off to the chef!  The drinks were creative and fresh combining ingredients and creating flavors that were amazing. Many of the cocktails are original and truly exciting.  Love the use of the fresh ingredients in the drinks, all with crazy names that spark the imagination!  Great place to dine and I cannot wait until has live jazz!", 
    "review_date": "2013-08-23"
  }, 
  "Pp73PHewLqIY1mF_62ZFFw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nicole H.", 
    "review_text": "This place will be your new hangout after just stopping by for the first time. If you're not convinced by the modern, relaxing ambiance of the interior, the creatively talented bartender (Robert) who can concoct culinary tantalizing cocktails, and the menu's savoring dishes...then you're whack. Seriously.   I stopped by for happy hour and ended up staying for three hours because the drinks and the food were amazing! I had white and dark sangrias because the first one was delicious. The bartender really knows what he's doing with the racks of spices and herbs. I also had the Romano Beans and the cornbread with honey butter. The beans are seasoned to taste as if you're eating a new york steak, and the honey butter is like crack on the softly baked cornbread.   I would definitely come back every time I'm in town!!!!", 
    "review_date": "2013-07-24"
  }, 
  "7SBFcuKQc81gmGy4eIsX5w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Russell R.", 
    "review_text": "Was there for World Cup Final today. Place was jumping with a diverse, international crowd.  Keep working on Jean Luc to change/add menu items.  Vamos Argentina!", 
    "review_date": "2014-07-13"
  }, 
  "ejQYx8ui1kRKXkdhh7vnQw": {
    "user_rating": 5.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Erikamarie K.", 
    "review_text": "Came in on a Saturday night and had a blast! First time here and Russ and Sostrong treated my group and I like family. Never really in the city too often, but I'd definitely come back!   P. S. The nomz are amazing!! =]", 
    "review_date": "2014-05-25"
  }, 
  "3bNiBnHXlcZhdgW_3Kdp5w": {
    "user_rating": 5.0, 
    "user_location": "South Berkeley, Berkeley, CA", 
    "user_name": "Brittany M.", 
    "review_text": "Delicious small plates to go with outstanding cocktails and wine. Oh, and...dessert will blow your mind too. Being your friends and get comfortable!  Bartender came to our table and offered to make us drinks that fit our tastes. All 3 of us got a concoction that fit exactly what we said we liked!  Each small plate was better than the next. We stayed for several hours, so had room for dessert and I'm glad we did.", 
    "review_date": "2013-09-29"
  }, 
  "GFKQateLWplUBTqjstBnMg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan K.", 
    "review_text": "This is purely a review of their poor service and not the food.  I don't write reviews but appreciate all those that do as they are generally helpful.  I had reservations scheduled for this Friday December 13, 2013, to take my fiancé to our annual Nutcracker date with a fantastic meal to follow.  My reservation has been booked for well over a month on Open Table and I was called just today notifying me that my reservation would not be honored because they are now going to be closed for a private event.  Normally this would not cause such great frustration as I understand chasing the revenue guarantee of a private event, but cancelling 4 days before my reservation on a Nutcracker performance night shows a complete disregard for the customers.  This private event certainly did not get booked today.  Now I'm left scrambling for new reservations on this night and anybody familiar with show nights and Hayes Valley knows this isn't exactly an easy to task to get the time and place you want.  I certainly won't ever dine with this restaurant based purely on the poor form and service.  Not to mention the lucky gentleman who called to inform was less than apologetic and only cared to try and get off the phone with me with little explanation and zero attempt to offer a satisfactory solution.    Really pathetic customer mentality but oh well. I'm sure Jardiniere or Absinthe down the street will love my continued patronage which are both fantastic restaurants who go out of their way from a customer service standpoint.", 
    "review_date": "2013-12-09"
  }, 
  "ATvdj2Znnh_zcVyGkA0vAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priya S.", 
    "review_text": "Muka is an adorable spot in the hip and food-centric neighborhood, Hayes Valley. I personally choose Hayes Valley when dining because of the variety, quality and close proximity to me. Some of the best places and experiences I've had dining has been in Hayes Valley - so it's definitely a competitive neighborhood to be in as a food or bar. I came across Muka with a friend who had friends dining, drinking and spending the evening there. It had more charm than most places I've stepped into and right away you felt a familiar feeling - it  had that effect. It's small and cozy and had an old-time jazz-circa era feel that was both nostalgic and friendly. I was in for a special treat that night as there was live music and a very friendly crowd! It added to the throwback feeling. Myself and my friend ended up having some awesome drinks - handcrafted \"made with love\" cocktails. The bartender seemed more than knowledgable in mixology and the drinks were delicious and strong! The best treat of all was the dessert we indulged in as a post-dinner treat. It was decadent beyond words and even though I was beyond full we both couldn't help but basically scrape the plate. This was only a mere insight as to what the food, desserts and drinks are like. I would gladly dine here again and potentially have the opportunity to try appetizers and entrees. Definitely a great place to check out as it very much embodies a true \"SF\" nostalgic feeling for it's customers.", 
    "review_date": "2014-04-14"
  }, 
  "24xC4cRjN06RG4otKrQTJg": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Dan B.", 
    "review_text": "Very nice bar but also a sort of hidden late night coffee shop gem near Hayes Valley and Van Ness. Good food (+ asparagus and broccoli salad with mustard dressing) and quality macchiato (and I'm kinda picky on that front). Excellent service too. Very glad to find them. On a Monday night the place had a nice buzzy sound to it, but it was also fine for me to order cheese and salad and a few non-alcoholic drinks and ensconce myself in a corner with my laptop. Good stuff....", 
    "review_date": "2014-07-28"
  }, 
  "2TmPUEkk77H4PZG2lrVDOA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Asaf K.", 
    "review_text": "This review is for daytime Muka only.  I walked by yesterday, as I've seen the construction for a while now, and a staff member saw me and opened the door for me. Came in, ordered a french press coffee, and worked on my computer for a bit. The coffee was flavorful, the staff was friendly, and the ambiance was chill, with good music. A tiny note to ownership that having the volume just a bit lower would be better for daytime.  Grabbed a menu and was impressed by the selection/affordability of small bites/wine. Would definitely return.", 
    "review_date": "2014-05-21"
  }, 
  "wNwzOy1SEStED1mgcuCoBg": {
    "user_rating": 5.0, 
    "user_location": "El Cajon, CA", 
    "user_name": "Hailey A.", 
    "review_text": "Love this place! It definitely has it's own unique personality with it's: \"Coffee by day, Cocktails by night\" idea.  We came here for a friend's birthday and had reserved the back room. They were pretty busy the weeknight we were there and still took the time to explain the drinks and the beers on tap to me without making me feel rushed.The drinks are delicious and poured with a heavy hand.  All together the atmosphere was really cool, the staff was welcoming and informative and the drinks are great! Definitely a place I would recommend!", 
    "review_date": "2014-12-04"
  }, 
  "vvGHIcfCr2toX6Bts5W7ew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephenie S.", 
    "review_text": "Muka is a cute little spot, located in the always hip and trendy Hayes Valley. The décor is really great, it's clean, and it kinda makes you feel like you're in movie-San Francisco. The drinks are tasty (I had the sangria!) and the bartenders are super friendly. It seems like they get a lot of locals, which is cool and gives you a bit of the Cheers vibe that every borderline alcoholic wants.  I only have too measly, small complaints:   1. The place is a bit pricey. My atrocious San Francisco rent makes me poor, so I prefer to drink at places that are somewhat more affordable. Even their happy hour prices are not the happiest that they could be.   2. There's not much in the way of food here. My friends and I showed up at Muka on a Saturday evening to drink before our Weeknd concert, right at the tail end of happy hour only to find that we missed the boat and couldn't even order the cheese plates and other small appetizers that can be purchased earlier in the evening. Not a deal breaker, but it would be nice to be able to order munchies throughout the night as you sit and chat with your (presumably) fancy friends.  I would definitely recommend Muka, though, especially if you want to take out-of-towners to a cute and casual spot.", 
    "review_date": "2014-11-11"
  }, 
  "73CvH_zNRxhNrO1GN7jzGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G A.", 
    "review_text": "Pricey but amazing drinks, delicious food, and incredible service.  The drink menu is hilarious...anyone who gives props to Chappelle is a winner in my book (drinks named \"the Rick James\" and \"what did the five fingers say to the face\").    Really REALLY looking forward to going back.", 
    "review_date": "2013-11-10"
  }, 
  "cLiXlMD79HktYRCS0pTXug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casey N.", 
    "review_text": "MUKA is my favorite place in San Francisco by far! Coffee during the day and Cocktails at night can't be a bad premise and the wonderful staff at Muka definitely deliver.  I have been to Muka for coffee (ask for the Muka Mocha) and lunch (the beet salad is better than it sounds so combine it with a tasty sandwich) and cocktails (Russ (and Jean-Luc) can make some drank!).   There are many options to choose from in Hayes Valley but Muka just gets it right on so many different levels. It starts with the management being attentive to patrons and experienced at great customer service. JL is friendly, charismatic, and forward-thinking - always looking for details that would improve the customer experience. The staff members are not pretentious, work very well together, and lead with \"yes\" (so be nice (and tip often) to Chelsea, Russ, Ray and Sostrong (you gotta love it)). Which leads directly to tasty product - flavorful drinks made with care and from unique, purposefully selected ingredients and an international selection of bites (which fits the clientele).   Bottom line: Great Service + Fantastic Product = Success  I was introduced to Muka by a high school friend from NYC that I randomly ran into in the Mission and he invited me to a musical performance at Muka one Sunday evening. I came for the performance and stayed for the inviting environment. I have since been to Muka a few times a week and had a party and happy hour at Muka.   Thank you for the great memories, Muka! I look forward to many more.", 
    "review_date": "2014-06-22"
  }, 
  "EDnsz36ahIY0zi15SfxjkQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris K.", 
    "review_text": "We ate here before a performance at the Opera. I was aware that they had recently moved, which I assumed was the reason why I was able to get a reservation at short notice so close to the Opera. I guess moving also meant they had not had time to get service sorted out properly yet.   We were one of the first people in, but nevertheless it took almost 15 minutes for us to get water, another 10 to put in our orders. We waited around 45 minutes for our food to arrive, when I asked the waiter what happened they apparently had our order slip covered up by another order slip in the kitched, so they didn't see it. To their credit they did get the food on the table in the next 10 minutes, but we were already grumpy and we just left cash on the table when it took another 15 minutes to try to get the bill in vain. We were not the only ones visibly annoyed by the lack of service, maybe they were understaffed that night, but it made sure I'll never return again.  The food was okay, but quite overpriced for what you get. Nothing really special there. The wine was good though.", 
    "review_date": "2013-10-19"
  }, 
  "nEl2xgE6EBrIU9axpW_gmA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jerico P.", 
    "review_text": "Check it out now before everyone else hears about it!  This two month old spot is just getting warmed up. We stumbled upon it after a watching a show at the symphony hall near by and we were very pleasantly surprised.   No need for reservations just yet, there is plenty of seating in their elongated floor plan. The decor is sets up for a cozy lounge with black and white prints haning and diy tables for the walls lined with seats.   It's a place that suggest french to me but their drink specials are built with tequila or mezcal foundations. I was a little confused but quickly won over by how they tasted.  They are very attentive and service is quick, kind and generous. They gave us a complimentary glass of bourbon as an after dessert drink. Dessert btw is a fluffy and hazelnut delight. I'm a fan.  Until next time  Cheers", 
    "review_date": "2013-09-09"
  }, 
  "4d681x3sCw1Q9ySTyTYXlw": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Hilary S.", 
    "review_text": "Held my birthday gathering here a few weeks ago. I basically called in advance saying I'd have around 25 people coming, and they reserved off a few tables in the corner for us.  I love the interior, it's so cozy and woodsy. Candles make it classy, of course! Drinks were good, waitresses were really patient and nice given how many people were there.  I'd love to come back with a smaller group and just hang out and enjoy a night here. I can imagine it's a gorgeous date spot.", 
    "review_date": "2014-02-19"
  }, 
  "9UIghetMi_Ml0-6Pq1WRbw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan B.", 
    "review_text": "Husband and I were looking for someplace to chill out on a Friday evening. We stumbled upon Muka and we were pleasantly surprised - small, softly-lit, dark and practically empty. Great chill music, a super friendly staff, delicious cocktails and small bites. In short it was just what we needed. I understood that they just opened a couple months ago and we're looking forward to more clientele once the opera season began. I wish them luck and kind of hope that not too many people catch on to how great this little venue is.", 
    "review_date": "2013-10-05"
  }, 
  "aHzHbLernlzE2Yah-Ih-Dg": {
    "user_rating": 2.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Gary T.", 
    "review_text": "Food was pretty good but as a bar scene, lots to be desired... Had one of the worst martinis I've ever had..  They don't have a good selection of fine scotches, gins or vodkas.  They need a real bartender.  Service overall was less than desirable..", 
    "review_date": "2013-11-04"
  }, 
  "9i9M0OlJRATSEbCxSlFpwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rocio R.", 
    "review_text": "I love the vibe at Muka; in the morning it's mellow enough to sit with come coffee and wifi while evenings are more lively without being overwhelmingly crowded, perfect to come and hang out with some friends.   The drinks are amazing- sure it may seem pricey, but you're paying for great quality in a place that is impeccably clean AND getting service by very friendly bartenders (unlike the usual pretentious bartenders that seem so ubiquitous in SF). Would highly recommend the Maza- so delicious and gives you the perfect buzz.   Cheese and charcuterie plate is great to share with friends for your drunchies! They have a great selection of cheese and the bread is so good. Their soups blow my mind- beef stew, carrot, and split pea are rather common but Muka has a soup magician that somehow makes it so that after the first spoonful you're like \"WOAH, that's damn good.\"    Friendly staff, great quality, and diverse atmosphere- yeah, I'll definitely keep coming back!", 
    "review_date": "2014-12-15"
  }, 
  "rz98hK47Zpu0AgyLnBcHBQ": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Belle C.", 
    "review_text": "Went to the symphony on Friday and found Muka as we were leaving the public garage. What a surprise! We loved it - had  the Japanese cucumber fennel salad, so fresh and tasty. Followed by the organic burrata with brioche toasts and fruit motarda and their carbonara with applewood bacon.  So comforting. Had two glasses of wine, very generous pour. And for dessert, the Earl gray panna cotta w/ Earl gray gelee. Super yum! Great food, great prices and happy servers! Can't wait to go back! Wish them well though their success will mean less tables available as walk-ins but they deserve it.", 
    "review_date": "2013-09-28"
  }, 
  "1dhMYD2pJ19vPvADcpJe7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raj K.", 
    "review_text": "This place has the restaurant lounge ambiance done right. Candles on every table,  music in the background that does not dominate your conversation,  and food that seems ever so delicately prepared.  The drink menu is just a bonus,  with carefully chosen wines and cocktails. Will definitely return !", 
    "review_date": "2013-09-19"
  }, 
  "JR1MRsEXKOaU7iKrblSa1Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve N.", 
    "review_text": "I was curious to try their new location since I liked their previous one. We sat in the dining area for a good 15 minutes but no one ever came to take our order even though other patrons had been served. I walked up to the bar to order our drinks and after another 5 minutes of being ignored, I called it quits. It was a Monday night so there was no reason to wait that long to order a drink.", 
    "review_date": "2013-08-27"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "This place is one of Hayes Valley's best kept secrets!  I remember the old Muka located on Bush &amp; Polk. It was this cool, subterranean wine/dessert bar underneath a French school. And while I'll miss that off-the-beaten-path charm of their former space, I think this new Hayes Valley location is going to attract a lot more foot traffic for the owners.  My friends and I came in here a few Saturdays ago for their daily happy hour (2pm - 6pm!!). This place has the look and feel of a Parisian bistro. We saddled up at a 4-top by the window (perfect for people watching in the neighborhood), and indulged in adult beverages as well as tasty cheese and bread. I really enjoyed their cocktail called the Carre - which was like a tasty twist on a Manhatten. My friends swore by Muka's Sangria. They claimed it was the best one they've ever had in SF. That's high praise.  Service here is super casual. We ordered drinks at the bar, and then our friendly bartender delivered them to our table. If you're hungry, Muka also offers a variety of sandwiches and light bites. Don't come expecting a full-on restaurant experience. Muka 2.0 brands itself more as coffee by day/cocktails by night kind of place - which is totally fine by me.  If you don't want to spend an arm-and-a-leg at Jardiniere or Absinthe before or after a show, then put Muka on your radar. You'll be glad you did.", 
    "review_date": "2015-01-12"
  }, 
  "scIyLRiFryYbzCcJG5l1Fg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J. S.", 
    "review_text": "Didn't know that this place existed but went in on a Saturday. The bar was pretty cool and was kind of quiet. We had a great time.  The bartender and owner were super friendly and they did a great job choosing wines for us. Really enjoyed the personal touch. Got the chocolate mousse and it was delicious.  The decor is simple and nice. Seems like they have a lot of space to grow into as they also have a cool back (or is it side) room.", 
    "review_date": "2013-07-31"
  }, 
  "LdWIjNvjdaAoAfpQhT6F9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tinna H.", 
    "review_text": "Muka holds a special place in my heart because I loved its prior location in Nob Hill. The new Muka is conveniently located a block from the Symphony. The menu is new, and their cocktail list seems to change all the time, so I definitely never tire of stopping in and grabbing a seat and drink at the bar. A little sad that there isn't an array of macarons for dessert!  There's a great happy hour if you can get in before it's over. $5 house wine, sangria and other specials. One night we came in, it was beets and a glass of wine deal. The small plates are all very tasty, so definitely recommend going for drinks and bites, especially if you're heading to a show.   Also hosted a birthday party in the bar area on a Friday night. They were super accommodating and made sure that I had everything I wanted the night of.", 
    "review_date": "2013-11-16"
  }
}