{
  "-TtbBXTW_mCKdZ-mhqubTw": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Jennifer B.", 
    "review_text": "Late night pizza in the Castro. Pesto pizza was tasty. I wonder if it's better later at night and after hanging out in the Castro?", 
    "review_date": "2010-11-18"
  }, 
  "5Z-3tcM07Pyc4mOF2Rjt6Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "Every time I come here I get the pesto slice.  Yet, I'll be honest, my slice while doughy and delicious is never completely warm.  Yes, I'll say it.  The more I have imbibed, the less I care, but seriously, boys, heat those slices right.", 
    "review_date": "2012-05-08"
  }, 
  "uSmza_6teOYimimy4C9Bpw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Arnold Y.", 
    "review_text": "AWESOME pizza.  great for late night.  super fast. friendly warning, you'll be surrounded by a bunch of really drunk gays if you go there late night :)  it's in the castro, after all.", 
    "review_date": "2011-08-14"
  }, 
  "HYQoxBC1y1DGPq6pGP09Tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "Although I am not a pizza eater, my wife loves the infamous Hawaiian pizza (Ham,&amp; Pineapple) &amp; delivered to her close-by office. I don't do pizza at all. My last pizza slice was 1998.", 
    "review_date": "2006-06-27"
  }, 
  "VNR0wxYQhFufnPbqbAjfcw": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "michella s.", 
    "review_text": "great pizza - great selection and price. delivers so that's a plus cause when you want pizza you are usually too lazy to go get it. open late which is a huge plus.  also, the last time we went inside they had 40yr old virgin playing on the tv - good stuff.", 
    "review_date": "2006-12-16"
  }, 
  "ccTyIHhaG95AAv4EgBiowA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Len C.", 
    "review_text": "Dry bread with no sauce, cold greasy cheese. Ninja turtles not impressed. Go back to pizza class.", 
    "review_date": "2014-02-15"
  }, 
  "cAD_WIDhmIo_Jl-iTargRQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Andrew Christian C.", 
    "review_text": "There are a handful of places to grab a slice at the end of the night on the Castro.  This place should be your choice.  The line always goes by super fast and the boys working here are always patient.  I have dropped my can of soda more than once before opening it and they always swap it for a new one.  My clumsyness is always appreciated at Nizario's!", 
    "review_date": "2010-07-23"
  }, 
  "9gjay2ST755a-aSVccdSgQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "pascale p.", 
    "review_text": "I am very annoyed at his place. I love the pizza but am unable to get them to deliver to me. ( I am only 1.64 miles  or 8 minutes away according to yahoo maps) First the guy who was taking my order, after taking my address explains that the driver isn't in right at that moment.  I explained that I wasn't in a particular hurry and was told they wouldn't deliver to my area, that it was too far. i would figure being within a 2 mile radius would be suitable but, whatever. It was obviously clear that they didn't want to go to my street for whatever reason and the attempted to lie to me. I am really bummed because i really enjoy this pizza but won't be ordering from here again.", 
    "review_date": "2008-12-21"
  }, 
  "xGysD5oa9bJ5y1ZOYk1qjA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cooper's Uncle ..", 
    "review_text": "Nothing like a good slice of Nizario's pizza.  They do a great job of delivering pizzas too.  I've ordered many pizzas for our Monday Night Football poker parties and they always deliver quickly.", 
    "review_date": "2007-04-13"
  }, 
  "uDatnOyw3lvfkIofgdLU3w": {
    "user_rating": 2.0, 
    "user_location": "Portland, OR", 
    "user_name": "Richard J.", 
    "review_text": "Pizza is alright because is stoner pizza.  Price is average and the dough is puffy. Straight up little kids pizza.  Tastes exactly like Senoires pizza, no joke. Same pizza! Exactly the same.   looks good but tastes average. If I ever eat there again it would be becasuse I am drunk and hi and near.  Do you like the pics I uploaded? Thanks. All Pizza joints that are yelped need pics! Please, no dorky dude with a cell phone self portrait.", 
    "review_date": "2007-11-19"
  }, 
  "8nqcdY9b-zolA3DgfeHSxw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dick S.", 
    "review_text": "I cannot vouch for Nizario's before 10pm, but after a night at the Mix or Lookout, or a BART ride to those establishments, I always enjoy a slice.  Quick, not too pricey, and you can eat outside as you walk.  YAY NIZARIO'S!!!", 
    "review_date": "2014-04-17"
  }, 
  "UrGQ_W8HUGts4HQvVbybrQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Ryan G.", 
    "review_text": "I can't talk right now, as I burned my mouth on their volcanic cheese today.  This is not a bad thing (just a stupid thing on my part, really).  The ambience is terrible, but that's half the charm.  Today they were playing soccer on the tell (Man City vs Liverpool) and the place is littered with old flyers.   One thing I miss: The one in the Richmond has these aweful (ly good) home photographed pictures of the pizza.  Like if your blind uncle took photos with his 110 camera, blew them up to poster size and laminted them in grease.  Why aren't more resteraunts this honest with the food promotion?!", 
    "review_date": "2005-11-29"
  }, 
  "RPD2MK_RJbCY_GFsLAZjig": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teddy d.", 
    "review_text": "Nope...not ..no thanks ... just plain nasty...even at 2am.  I mean a kid can drum up a better slice... and I don't get why everyone tries to cram up in there like they got the best deal in town.  I will pass...Macello's to the rescue.", 
    "review_date": "2007-03-14"
  }, 
  "PwRsP8-0joFaprFxe8tXIQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Wendy M.", 
    "review_text": "One of my best friends kept raving about this \"Nizario's Pizza,\" but I never really took her seriously.   Then I tried their super combo pizza (Their version of supreme pizza). Hands down the best pizza I have ever had - no other pizza place compares! Weirdly enough, the other Nizarios in the richmond doesn't even compare.  The slice is pretty big and costs around $4.00  They once had chairs with their tables, but the last time I went (Feb 2011), there were only tables. So, you have to stand and eat your pizza (or take it out to the curb).  The lines can get pretty long when the bars let out so if you're one of those people who hit the bars and get a bite to eat afterwards, I would suggest leaving just a little before the bars close to beat the rush.", 
    "review_date": "2011-03-06"
  }, 
  "5Vy16zNn6b_U_rAX7cuisQ": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Heidi L.", 
    "review_text": "After much testing, I've come to the conclusion that Nizario's (particularly the Castro Special) is SPECTACULAR, beyond delicious, fulfiller of all cravings, smile and burp inducing....when I'm DRUNK.    However, when I'm sober, the pizza is disappointing and leaves me wondering if I just had a bad batch...but that happens every time I have a sober slice.  Am I just that delirious when I'm buzzin' that my taste buds are as weak as my hands' grips on my personal items?    Drunk score: 5 stars Sober score: 2 stars Overall: 3.5 (rounded down to 3 bc I can't do halfsies)", 
    "review_date": "2012-06-15"
  }, 
  "bUswYIqyNRSEvjXDACRg6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "haley d.", 
    "review_text": "Is a review for a slice of pizza void due to inebriation?  No?  Ok, then this was some damn good pizza! I got the Castro Special and was really excited by the warm, gooey cheese and bits of chicken and pesto. The crust wasn't soggy and it didn't fall apart when I picked it up (which is good because I was pretty foggy and clumsy).   So, here I am, enjoying my piza at Nizario's and then some big hulking pizza bouncer tells us we need to \"take the pizza outside!\" What the hell?! It's fucking freezing out! Shivering in the tundra of the Castro, I waited for a cab, fortunate for my warm mass of dough. The taxi cab wouldn't let me bring the pizza in so I really had to scarf it down, but it was well worth it.  Open late and cheap, this is where you ought to wear off some of that alcohol.", 
    "review_date": "2007-10-13"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "Located at the intersection of intoxicated and insobriety, Nizario's Pizza is a welcome rest stop amidst all the bars in Castro to sober up and get some much needed nosh. Oh and the slices are yummy too.   You can have your cheese or pepperoni slices but I really like The Castro slice - spinach, pesto, feta, and chicken. It's a delicious combination on a crispy crust. The Nizario's Special is a meaty slice if you so desire. On weekday vegetarian nights for me, a simple slice of pesto just hits the right comforting spots.   Nizario's Pizza is a welcome counterpoint to the heavy pours of Castro bartenders. For that, many a drinking night in the area probably warrants a quick pit stop here before heading home.", 
    "review_date": "2011-12-16"
  }, 
  "QqdgLBd3mqfj_Umh1JRl2A": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Devin P.", 
    "review_text": "Nothing better than Nizario's after a late night ... Castro Special or Pepperoni are my favorites. The service is incredibly quick &amp; the prices are fair. *AND* they deliver to our home! And as 'Alden C' noted, I love it even when I am not drunk!", 
    "review_date": "2006-07-19"
  }, 
  "fEsLMfdDyKNVzBt-hI-MPg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dania D.", 
    "review_text": "Just got done eating here for the first time. Wow is their pizza good! Found it by accident searching for something quick but filling to eat in between work appointments.   I ordered the San Francisco Special...I was so happy I didn't get just a slice! The pizza was full of flavor, fluffy and I even ate the crust, which I never do. Wish I had one where I live!", 
    "review_date": "2014-04-13"
  }, 
  "Wcksq23HgF45mPFZOUFy6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "I LOVE Nizarios's!! I think this is truly my favorite pizza place in the Bay (why? because I say so).  Soooo yummy. The Castro slice is the best, followed by the Hawaiian. Outside of that, I'm sure it's good, but I've never had any other slice.  Also, I love the staff - they care enough to flirt with me, and that is good customer service.", 
    "review_date": "2011-06-29"
  }, 
  "4HRyCRuXQxsOvCxVi2JWWw": {
    "user_rating": 1.0, 
    "user_location": "Towaco, NJ", 
    "user_name": "chris b.", 
    "review_text": "Is everyone crazy??? 4 Stars???    This is some of the worst pizza I have ever had.   Its more like bread sticks than pizza. Minimal Sauce. Minimal Cheese.   If your from CA maybe this is acceptable, but if  your from the east coast dont bother with this one.", 
    "review_date": "2010-04-03"
  }, 
  "niST1mgqgLdf7NNCGm1xWQ": {
    "user_rating": 4.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Tyler J.", 
    "review_text": "Castro Special, try it! Chicken, pesto, bell peppers and onions. As a Castro visitor we wanted to give it a shot and I'm glad we were feeling adventurous last night. I usually don't stray from my favorite ham and pineapple but this was a pleasant surprise.  Perfect way to end a late night of drinking in the neighborhood. Oh and while the loud club music may have irritated some of the guests, this queer didn't mind at all, hayyyy!", 
    "review_date": "2008-06-22"
  }, 
  "vHR6Nni-jSGI_rrJ2A7MQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew P.", 
    "review_text": "I'm gonna say that I would have given an additional half a star for Nizario's if it were an option. Can't believe it's taken me this long to really giving them a try, I guess because I've always favored Mozzarella di Buffala for home delivery pizza, but after taking the leap, I may have a new favorite! Ordered a Nizario's Special (but substituted the Green Pepper for Black Olive) and I swear it seemed like 15 minutes after I hung up my doorbell rang...like, was the guy already outside with my pizza when I phoned? Seriously though, the delivery was amazingly fast. The pizza was hot and looked great. It definitely hit all the buttons for me, not too much sauce (which yes had a little bit of sweetness to it, but wasn't 'sugary' as was mentioned in an earlier review. GREAT sourdough crust, just the right thickness. Lot's of good coverage with the pepperoni, sausage, mushrooms &amp; olives. (BTW, the sausage is more like the crumbled 'small chunk' variety, versus the bigger hunks. Great flavor, great fast delivery, great value - all good in my book. Would I consider it a 'gourmet' pie, like Pizzeria Delfina or Little Star? No, but that's not why you'd order from a place like this. If you want a good tasting, solid, quick, decent, affordable pizza - I highly recommend Nizario's", 
    "review_date": "2010-07-04"
  }, 
  "56I-v3n1u94MysqbPmhyNA": {
    "user_rating": 5.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Ryan B.", 
    "review_text": "my favorite pizza place in san francisco. nothing beats nizarios! maybe its because it is open so late, after drinking all night, or maybe its because the price, and quality is there. best pizza ever.", 
    "review_date": "2007-01-01"
  }, 
  "IB0_DRx-L8O1MtzwPF-lQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jon y.", 
    "review_text": "That's 4 drunken stars.  In reality/sobriety, I actually have no idea what the pizza here tastes like.  Jk!  It is sometimes the highlight of a night out.  Do I remember what song was played at a club we went to?  No.  Do I remember how delicious the melted cheese and pesto tasted at 2 in the morning?  I most certainly think I kind of do.  Their pizza is so drunk-good that my friend dropped it on the ground, picked it up, and almost ate it before we stopped him.  \"It was only one seccconnndddd,\" he said, but we knew that 1) it was more than a second and 2) gross regardless.  But anyway, THAT'S how drunk-good Nizario's is.", 
    "review_date": "2011-04-25"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "pretty good pizzas by the slice...cheap too!  the staff is very friendly as well.", 
    "review_date": "2008-09-05"
  }, 
  "RiPej859bUBnNTBlBU-XnA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Peyton C.", 
    "review_text": "THE BEST pizza in the Castro &amp; possibly San Fran in general. They're open late every night (2am or later) &amp; it is the hottest spot on the weekends for everyone to grab a slice. Free delivery too! It's a must go for anyone! P.S- Their pesto chicken is to die for.", 
    "review_date": "2013-07-25"
  }, 
  "jJjp2TFTE8iS7mGLqEReYA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Diane M.", 
    "review_text": "Awesome pizza and it's open late for all the drunk revelers.  The workers are generally pretty friendly.    My only thing is that I think pizza prices in general are a bit high.  Here, a piece of pesto pizza is around $4, while cheese is around $2.75, so it's not too bad.", 
    "review_date": "2009-10-18"
  }, 
  "O8UYGyFMXxq58htx4lqYzg": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Rene L.", 
    "review_text": "I like this place.... They tell you it will be ready in 45mins and it is never had any issues with delivery. I usually order there garlic chicken pesto that pizza is delicious very filling.", 
    "review_date": "2014-10-25"
  }, 
  "ZSretWXlve11q9hP6SrScQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex H.", 
    "review_text": "I'll never forget the first night I ate at Nizarios when the Mexican wait staff slowly dimmed the lights and put on some sultry music while they watched my girlfriends and I dine on a slice of pizza. Random, right? On the contrary, their pizza is delish. Thick crust, big slices, sooo good. And the best part of it all is that there's take out. Now I can eat yummy pizza and save myself any awkward run-ins.", 
    "review_date": "2009-07-25"
  }, 
  "0oEob8BaVSWIJrSkV8c4ZQ": {
    "user_rating": 1.0, 
    "user_location": "American Canyon, CA", 
    "user_name": "Dimplez D.", 
    "review_text": "i just recently went there..and I think they have new owners and/or changed the pizza...THEY SUCK!!!  They do no taste the same as they use to!  I'M PISSED!! Also want to add the service is not as friendly as the other owners!", 
    "review_date": "2009-11-29"
  }, 
  "6OZxY7Ui8JxHPxKuusoSEA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darren L.", 
    "review_text": "I have to admit I only drop by here after a long night of drinking. The pizza just hits the spot... but be prepared to wait a little bit and try to avoid getting into fights outside with the other drunk people.", 
    "review_date": "2010-03-19"
  }, 
  "0-SWXgkYQ1ezcY7wLJbz3w": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Diana V.", 
    "review_text": "They stay open late so i love stumbling in here (literally, sometimes) after a night of drinking with the girls. The pizza is really yummy with a crispy thin crust, and the size is pretty good, too. My favorite is the Hawaiian with crushed red pepper, even after it's heated it is still amazing, or is that the alcohol talking? either way I love coming here for a late night meal.", 
    "review_date": "2011-03-25"
  }, 
  "yZxRl6Wp2ZSLv0Eeu9favA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul L.", 
    "review_text": "The crust has the right \"chew\" to it, but (at least) the cheese pizza is completely flavorless. If a pizza place can't get a plain cheese pizza right, it doesn't bode well for others.  I don't know how this place stays in business given that there are two MUCH better pizza places within a block, namely Escape from New York (Castro/18th) and Marcello's (Castro/17th).", 
    "review_date": "2011-07-04"
  }, 
  "1ARD0462wLtliY5PJXay0Q": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "marisoL t.", 
    "review_text": "i'm yelpin` here because i'm feenin` for some nizario's pizza. it's been on my mind all day. their crust is the best. it's crunchy but not too hard like cardboard. i also like the fact that they actually put enough sauce for the pizza, so that i'm not only eating cheese bread.", 
    "review_date": "2010-02-02"
  }, 
  "LPfj5-UevdEz5Uvj6aElGg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan M.", 
    "review_text": "I usually order by the slice here, which is roughly $3-4 per slice. Its a pretty good sized slice, and quite tasty. Usually I venture here while out drinking, since they are open late. Actually, I only tend to go here when I'm drunk, but thats more because its conveniently located across from a bar. Still, when your out on the town, this is a good place to stop and put some food in your stomach.", 
    "review_date": "2013-01-31"
  }, 
  "aK4bx3iZKZuf3lgMKzpshA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saleema F.", 
    "review_text": "Nizarios, I thank you for having mastered the \"cheese to dough\" ratio. You pizza is cheesy but not greasy, doughy but not too \"crusty.\" I love you Nizarios, day or late late night. (They are open until 3 AM, I believe, and their line goes surprisingly fast.)", 
    "review_date": "2006-11-05"
  }, 
  "msfCLLzdLG6BEV6o1mvJ0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ricky M.", 
    "review_text": "Ever crave for a pizza slice.  Try the Castro Special.  It's excellent!", 
    "review_date": "2010-11-18"
  }, 
  "mBiSTelNacthpw9qJlRLxQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Matt W.", 
    "review_text": "I am originally from NJ, so I know my pizza.  This pizza is one stop above frozen pizza, it sucks. And if you are in a wheelchair, you can't use this establishment.", 
    "review_date": "2010-07-21"
  }, 
  "i9i497jdE4sn_MRqeE4Bfg": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Allison B.", 
    "review_text": "Is it sad that I have them programmed into my phone? At least they're not on my speed dial anymore, right? The only drawback to this place is that a line can form down the block when there's an event in the castro.", 
    "review_date": "2007-06-26"
  }, 
  "5z2nW6VytwdX3-aEpmTRTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis M.", 
    "review_text": "Shaking your butt all over the castro works up a girl's appetite.  And thankfully Nizario's makes a great after bar slice.  The kind of slice that after you have one you still want another.  The pizza is like a drug.  And then you get to feel guilty for the next two days, but it is worth it.", 
    "review_date": "2007-11-26"
  }, 
  "_SVfoi3YUFNHswsfZUO9mg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mikey U.", 
    "review_text": "3-star pizza joint by day, 4-star \"sober me up\" joint by night!  Open late!  Thank goodness!  I was fairly hammered walking in here after The Bar (<a href=\"http://www.yelp.com/biz/the-bar-on-castro-san-francisco#hrid:-mdv-OjmHLp-q49Tft859w\">yelp.com/biz/the-bar-on-…</a>) and it seemed everyone on Castro had the same idea.  Luckily we arrived just before the rush.  The place quickly got crowded and noisy, where this isn't so much a place to eat before going home as it was a last opportunity to make some magic happen!  The pizza is less than ideal; grease and a not-so-thin crust make for a saggy slice.  But for its lesser quality, it is cheap and does a grand job of coating the tummy and soaking up alcohol; I woke up this morning feeling like heck... but less like heck than I normally would.  Yet again, somewhere I need to try in a less inebriated state, but off the top of my head, its a decent slice with okay tastes...  plus I had already had a GREAT slice earlier in the night at Marcello's (<a href=\"http://www.yelp.com/biz/marcellos-pizza-san-francisco#hrid:FfqnMS16PhYcXucWnIscgA\">yelp.com/biz/marcellos-p…</a>) _____________________ Pizza... almost any pizza... is GOLDEN at 2:00 in the morning...", 
    "review_date": "2008-03-19"
  }, 
  "78uIWuEE98298tJPlcM7jw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich C.", 
    "review_text": "The pizza is fine but ordering over the phone is a nightmare.  The guy taking the call was clueless.  I had to repeat everything a few times and after he finally got it right, there was a \"computer error\" and we had to do the entire thing all over again.  Oh yeah, the greek salad pretty much sucked.", 
    "review_date": "2006-11-27"
  }, 
  "2MKav56rSYJXC14KqNHmbQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Daniel M.", 
    "review_text": "Castro Special is all you need to know. Every ingredient blends together perfectly to create this little slice of heaven in your mouth. The workers are friendly too! They let us in half an hour after closing because we looked hungry (which we were) and they still had pizza to sell. If you have a late night case of the after-clubbing munchies this place fits the bill.  Summary: 4/5 stars +Castro Special. +Friendly workers -Combo was nothing to write home about", 
    "review_date": "2010-01-23"
  }, 
  "f2_ORdto2MUlxp6-LlmKgg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Trav M.", 
    "review_text": "Here's the deal' this is where you go after shutting down the castro bars at 2am with all your friends on any given night. The food is pretty decent, the staff is fairly nice and the prices are fair.  Besides that though, this place is definitely something that can be looked over, I must say. If you aren't drunk off your ass at 2am, then you deserve better pizza, for sure. But for being conveniently placed in the heart of The Castro and having great hours AND (cute little side note) welcoming their after 2am guests with cranked up party music, this place gets three stars just for that.", 
    "review_date": "2010-12-22"
  }, 
  "b8hpsQAh7f54xcY5MIWI3Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ennis O.", 
    "review_text": "it's been years since i've stepped foot in here and was in a rush tonight with a group of friends with nizario's the only place on the way.  total disappointment yet again with bland, overcooked pizza that has been out far too long.  i honestly don't know how this place get's rated any better than 2 stars. marcello's and escape from new york offer far better options, flavor, crust, and overall atmosphere.  plus all their pizza sits in the back on the oven so you can't even get a look for the freshest slice.  if you offered me a carnivorous feast or nizario's cheese pizza - i'd still take the pizza, but i'd still have to pause and think about it a moment.", 
    "review_date": "2010-11-20"
  }, 
  "sSFgjECKS4NIw-e_Vx9UuA": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Castro G.", 
    "review_text": "I've had most of the flavors here and like their crust and sauce(es).  The Castro special, with spinach, chicken, and pesto sauce is the best in Eureka Valley. Friendly staff, grungy place, sometimes customers are wacked out (latenite).  Update:  they've freshened up the place -- far less grungy now...", 
    "review_date": "2009-04-12"
  }, 
  "xU7RA2axLBvMW3LV33O8vQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Alden C.", 
    "review_text": "Oddly enough, some of the best pizza I've found is at the hole in the wall known to all drunkards in the Castro! Nice big slices for cheap and served up almost instantly and fresh. Pizza with toppings like pesto, chicken and feta, or salami, pepperoni and mushroom are always top of my list even when not drunk.", 
    "review_date": "2005-05-23"
  }, 
  "gUe0MCt_Xeq7LbBBUQcYbg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul R.", 
    "review_text": "Let's be honest, if you going home from the bar three pints and a spliff and your conscious is impaired - go for it. The next morning your stomach will thank you for all the hard work it will have done digesting the thick (cheap) cheese and dough.   Don't get it twisted, I have probably eaten here more times than the next guy but in all honesty - this is not pizza.  This is Americanized, 2 a.m. slop, and I do I hate to admit I love it, but the city's best deserve 4 n 5 stars. no?", 
    "review_date": "2008-12-15"
  }, 
  "a713voEnFlKlIuhCCQ7XWA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregory W.", 
    "review_text": "Nizario's is one of my favorite pizza parlors in the city.  I find them to be very consistent.  The pizza is always hot n delicious.  I usually order by phone for delivery. . .it's always quick and easy, and the delivery people couldn't be nicer.  And it doesn't hurt my wallet either.  Very reasonably priced.", 
    "review_date": "2008-08-19"
  }, 
  "cdDOE6H_n8icnxijO-zc-Q": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Adrienne P.", 
    "review_text": "This is exactly what I needed after hanging out at the Cafe.  I was a little disappointed that they had run out of Italian sausage and so I asked for pepperoni.  They had run out of that too.  I will give them some leeway on this, as it was, 2 a.m. afterall.  So, I ended up chowing down on a veggie pizza slice.  Surprisingly enough, they didn't skimp on the veggies.  It was like a mini-salad on my pizza slice.  Plus, the slice itself was rather impressive.  I couldn't finish my slice and I'm a finisher.  That quick bite before heading back home was a great way to finish off a crazy night.  Plus, the people there are good enough to let you use the tiny bathroom in the back...that made me really happy.", 
    "review_date": "2007-08-01"
  }, 
  "mKMMiiegYGAHmjP4dnDQcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Av A.", 
    "review_text": "This may sound totally heffer status but BOY do I get tingles down my spine when I think of the Castro Special.  Granted I always seemed to have stumbled my way here with my buddies in my drunken stupor after a night of debauchery around the Castro.. but Seriously, with a capital S.. Castro Special is GREAT.  So great in fact that I bought a whole box as an impromptu birthday cake for my bff, also in my drunken stupor, and she said it was the best birthday cake she's ever had. Sincerely. *Aww*  And hey, I've had it sober alright? Sometimes I've managed to order 2 extra slices for myself for the following day.. OMG, now THAT is heffer status. -__-", 
    "review_date": "2009-01-05"
  }, 
  "7UGAhFL26kyuhJ9I21AVTA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "Nizario's is a hole-in-the-wall place with none of the gourmet-y pizza's I like... like potato garlic pesto.  But, I guess pizza is one of those subjective things -- everyone has their favorite types.    Maybe it doesn't help that pretty much the only times I've been here is at 3am when I'm intoxicated, about to pass out from hunger pangs, and practically crawling in the doors.  Good for those kind of late-night pizza EMERGENCIES, but when you have had one drink too many, it adds insult to injury that this place is small, super bright, and mirrored.  Total house of horrors.", 
    "review_date": "2005-11-26"
  }, 
  "2bpDONWWRGbTjsT6akeRrA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "wane a.", 
    "review_text": "Open late. Castro special is awesome! Try to get here before everyone else does after bar hopping otherwise they will run out of the good stuff.", 
    "review_date": "2010-03-15"
  }, 
  "ViL_qMtXxLcT8EddI-pkIA": {
    "user_rating": 4.0, 
    "user_location": "Gilroy, CA", 
    "user_name": "Faye F.", 
    "review_text": "AMAZING PIZZA!!! Friends and I walked over after hours of drinking and boy, this definitely satisfied our cravings. They close everyday at 2am and last night, we got there around 2:24 AM. One of the guys working there told us to just come in and we bought whatever was left: COMBO AND THE CASTRO SPECIAL.   I think I liked the castro special better than the combo. I loved the pesto and feta cheese mix. The crust was perfecto! Not too doughy and not super thin; it also had a great crunch factor. The combo was pretty okay (I think it got better tasting after awhile haha). The pepperonis were so good! I don't know why, but I felt as though that was best pepperoni I've had on a pizza HAHA. I actually don't remember what else was on the combo but it also had a pretty darn good crust.", 
    "review_date": "2010-01-23"
  }, 
  "2twfOpOzul0ggUgFpdDqaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason D.", 
    "review_text": "Yes, the pizza is great at 2am, in fact, it's great at 2pm too (and I am USUALLY sober at 2pm). I don't usually recall being there, but I always remember how good the pizza is. Two words of advice, first, get there before 1:45 or you have to wait when the bars close. Second, ask to use the bathroom...when you're wasted, it's a trip to walk through the kitchen and up these little stairs (at least it seemed strange to me, but I was drunk..)", 
    "review_date": "2005-11-01"
  }, 
  "VQG45LKVq2H_Owa7hnUV-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "P J.", 
    "review_text": "Nizario's is great, \"makes me think back to my college days,\" pizza.  HOWEVER, as much as Luke A loves Nizario's and as much as I love Luke A to cheesy pieces/slices, I think there's only one hour a day that you should eat your pre-hangover pizza at Nizario's.  Between 1-2:00 am Mon through Thursday after your vodka to air ratio has been inverted and Marcello's is closed.  I like Marcello's better, but Luke A is still the sauciest!", 
    "review_date": "2009-11-02"
  }, 
  "8Nvvqnb60aFlZutylZd-Aw": {
    "user_rating": 5.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Cynthia B.", 
    "review_text": "Best pizza in the world.", 
    "review_date": "2009-03-03"
  }, 
  "rlOVmdslwCGhl7zjMWdcRQ": {
    "user_rating": 2.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Matthew C.", 
    "review_text": "2 stars because already this pizza is only decent when you're hammered, but more so I'm giving 2 stars because last night the cashier deliberately gave my friend and I incorrect change - two separate transactions. I've worked registers in restaurants before and have seen this done , but have never had it done to me until last night. $7 for pizza.. I give you $20.. You confidently hand me a $5 and 3 singles.. Lets revisit that math considering you've shorted me $5. And had just done the same to my friend. Not cool my friend.", 
    "review_date": "2014-03-29"
  }, 
  "K4g2p31gIE392nZYtu0tAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa A.", 
    "review_text": "Fast, friendly, and open late! I'm usually not into pizza, but my friends and I always seem to find our way here after a night out. Hot, always fresh because of the quick customer turnover, and good selection of toppings. The line gets HUGE right at 2am so prepare to wait... It's worth it!", 
    "review_date": "2011-03-19"
  }, 
  "t-PmN1OFRTLE0B3xa20HXQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cassandra C.", 
    "review_text": "Came here after a night out in the Castro. The line was out the door and everyone outside had a pizza in their hand. The place is pretty small and cramped, but they pumped through the line and we were able to order really quickly. As soon as I ordered, my pizza was plopped on a plate, I paid and as I turned around a group left a table and we were able to sit and enjoy the food. Talk about perfect timing as there's only about 4 tables inside the restaurant.   The pizza itself was very good! For starters, its HUGE so I don't think you'd need two slices unless you're very hungry. I had the Castro special and it had chicken, spinach and feta cheese, I only wished I had a bigger appetite for a second slice since it was so good.   If you're coming here at night, expect a long line and many, many drunk people. Prices were reasonable and it was the perfect thing after a night of drinking.", 
    "review_date": "2013-07-29"
  }, 
  "gL-u2F1Dr7yKiSeqAAEO3A": {
    "user_rating": 2.0, 
    "user_location": "District of Columbia, DC", 
    "user_name": "Sudhir D.", 
    "review_text": "Salty pizza .. Even a drunk guy can tell. This place is empty. Why did I come here!", 
    "review_date": "2012-07-07"
  }, 
  "Nj76GCiNWOIsrldzsPrCYw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lucky M.", 
    "review_text": "I do like Nizario's Pizza and i love the fact that its open really late. If i had to pick between Nizario's or Marchello's I would pick Marchello's. Don't get me wrong but this place is great and what not but they don't have the premade slices of pizza i want. I do enjoy their pepperoni pizza and veggie pizza, their quick and friendly. You will def find me here when i wanna switch it up from my regular pizza joint!", 
    "review_date": "2008-11-02"
  }, 
  "LNGs8TR03Wc3faqWow7oow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason V.", 
    "review_text": "I like Nizario's even when I'm not falling down drunk, which is more often than not as of late. Unlike these children running around, I'm old and wise enough to remember the very first week Nizario's opened what must have been at least 9-10 years ago.  True, they're somewhere in-between the Soup Nazi on Seinfeld and the Pillsbury Dough Boy, but I don't care---just give me my goddamn pizza so I can get out of there. Who cares if they didn't hand you a gold crown to wear on your way out, most of the people in there are wasted and obnoxious.  The pizza is second to none, tasty, and I've been a loyal customer ever since I was a little twink. Go there, eat their delicious offerings, and then go stumble your way back home.  You'll be glad you did.  Jason", 
    "review_date": "2011-09-07"
  }, 
  "sqmmQuYf1aqmCUj3UmX70A": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Spookee X.", 
    "review_text": "Hell yes!!! i mean come on... who doesnt go there after bar hopping in the castro...   pizza is total fresh most of the times i have been there, long lines meaning everyone likes the food right? not 100% on the customer serivce, but come on thats expected at 130am .....   newest feature added is the high energy music playing while you grub on some fresh pizza!! LOL! luvs it!", 
    "review_date": "2009-11-04"
  }, 
  "pOBnHxFh4NbBTHdf3oWvdg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriel D.", 
    "review_text": "I don't understand the gushing.  Nizario's is fine, but all too often, you get a miserable partially reheated slice.  It is the best option in the area, but with so many drunks eating here, the quality must suffer.", 
    "review_date": "2006-11-14"
  }, 
  "WKu8N3wK9k1sRfXCA3SZ8Q": {
    "user_rating": 4.0, 
    "user_location": "Nice, France", 
    "user_name": "Stuart J.", 
    "review_text": "After a night's drinking there is really only one thing on anyone's mind and that is a good old greasy slice of pizza. This is _the_ hole in the wall place everyone comes to after a night out in the Castro. and frankly the eclectic mix here is way more fun than the late night hordes of drunken frat-kids at Orgasmica. Still not sure if the pizza really is that good or it just tastes that way at that time of night, but the pesto is quite excellent. The staff is friendly despite having to put up with a lot of shenanigans, and service is prompt.", 
    "review_date": "2005-06-22"
  }, 
  "e2MIDX_YWVVQl7-t-SJf-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittney B.", 
    "review_text": "Perfect on a Friday Nights... and Saturday Nights... after drinking mucho and needing a great slice of pizza to ward off a hangover.    Nizario's is delicious.  I like it because it is not thin crust.  It has got some substantial dough going on.  After trying all of them (I think) The Castro slice is the best!  It didn't seem like something I would like, but now I pay the 2 bucks (?) extra to get this big slice of heaven.    Now, besides the pizza, the place rocks, really.  They always have loud music on, you may think you are in a club, you may even see people dancing.  There are always great flyers on the wall letting you know what is happening in the Castro.  Finally, I have never had to wait more than 5 seconds for my piece.  Perfecto.  I have thought about trying the other pizza places on Castro, but I just can't pull myself away from Nazario's.", 
    "review_date": "2007-11-19"
  }, 
  "3HHLpfU7q4HoREEOXtt7pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "After a night of drinking, one thing was on our minds today: pizza...oh, and sleep...but pizza being the most important, of course ;P  Not too many pizza joints are open in the middle of the afternoon, so thanks to Yelp I stumbled upon Nizario's. It's probably been a good 3-4 years since I've had a slice of pizza from Nizario's and I was not disappointed!  We ordered the Nizario's special - pepperoni, sausage, mushrooms, onions &amp; bell peppers. We wanted delicious, no-frills pizza and that's exactly what we got! A 12 inch pie was $12.90 and they have free and fast delivery.  Definitely a great option whether you are in the Castro or craving pizza on a lazy Sunday afternoon.", 
    "review_date": "2011-08-28"
  }, 
  "jsRjSlPZ67OR4YEgoucbtg": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Rhia R.", 
    "review_text": "I simply CANNOT finish off a night of bar hopping without grub. Good thing about SF is that it's not very difficult to find a place to grab a late night bite, especially if it's a pizza place. This was just as crackin' as the clubs were. So much that I was a bit hesitant to go in at first, seeing that the line was right up to the door. My friend reassured me that the wait wouldn't be long. Yep! I was in and out in under 3 minutes. They handed out the slices to the customers like a well-oiled pizza making machine. I was a bit bummed that they were out of mushroom, so I opted for a pesto slice. It was friggen scrumptious. They aren't shady with the amount that they put on theirs, so I was one happy girl. More please! *burp* =P", 
    "review_date": "2009-08-23"
  }, 
  "K8nkgNBRnx7G7Umt-zmP9g": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "crystal e.", 
    "review_text": "Nizario's is one of the best pizza places in SF.  The Castro Special is delicious! I love that its open late. Its a nice little spot, especially after a night at the BAR.", 
    "review_date": "2008-10-03"
  }, 
  "eVzwz3TIVuXWZ7uum7kZRA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt P.", 
    "review_text": "Although I do not eat pizza here (cheese and meat)... I was here with a friend, and as he was sprinkling the parmesan on his pizza, he realized it was clogged and tried to take the lid off.  To our surprise, the elderly gentleman who owns the joint came from around the corner, grabbed the cheese out of his hand, yelled at both of us for attemping to take the lid off and told us to leave.  After this treatment he is lucky a report to the BBB was not filed, as this is a sure fire way of losing business premanently.  Shame on you, and your establishment. Learn how to deal with your temper or do not open up shop!    I would recommend a 'PASS' on this place.  :-(\"", 
    "review_date": "2009-04-12"
  }, 
  "cYyzYz8Lhp0KQmFOIt8D6g": {
    "user_rating": 1.0, 
    "user_location": "Portland, OR", 
    "user_name": "Kirby S.", 
    "review_text": "I'm really surprised by the positive reviews here.  I'm no pizza snob, but this place is awful.  The slices I got were chewy (not in a good way) and bland.  Unfriendly service.  Dirty.  Boring pizza.  It's cheap, I guess, but still not worth it.  This is my first one star review.  I really hope there is better pizza in SF, because that great city deserves better than Nizario's.", 
    "review_date": "2011-03-30"
  }, 
  "xyTgJUyW9nPV1wbnr9u-_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas L.", 
    "review_text": "Enjoy the drunk food! Nizarios is THE place to go for a snack to absorb all that alkie in your body. Bet. 3-4 bucks a slice, you consistently receive hot out of the oven pizza that makes you smile. Maybe other Yelpers visit the wrong part of the day, but at night, my slices were consistently piping hot- the cheese soft and gooey, the bacon and pineapple perfectly blending together in saltiness and sweetness. I will have to open my horizons to the other flavors, but the Hawaiian pizza is my #1. There will be a line, but they take orders efficiently, and you will need to stand and eat your pizza.", 
    "review_date": "2007-05-21"
  }, 
  "JFYBOeQCG7H93AvmYGhOEA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brad D.", 
    "review_text": "stay away! went here and got food poisoning from the pepperoni. Boo. Cheap ingredients. And no, it wasn't the alcohol!", 
    "review_date": "2011-06-19"
  }, 
  "CKE7bImVY81KJD8PiiuDPQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anita C.", 
    "review_text": "I'm seriously surprised! I was complaining that we weren't getting at Marcello's and then I had a bite. I wasn't drunk...so it wasn't just beer munchies. This pizza is GOOD. Not NY style, but still delicious. Lot's of people said Castro special is good. I'm a no-nonsense kind of person and prefer cheese...", 
    "review_date": "2008-05-28"
  }, 
  "AvM2GpjmOZf-h9rm2xkzzQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Isaac S.", 
    "review_text": "The pizza here is good even when you're not ordering a slice drunk off of your ass in the middle of the night. It was tasty even when I was a little tipsy in the middle of the afternoon. I had a piece of pepperoni. Can't go wrong right? It was great. A friend ordered a slice of the pesto pizza and made the mistake of offering me and our 3 other buddies a bite. We all ended up attacking it. The dining area is shit and the guys who work there aren't very friendly, but who gives a damn. Just hand the guy your money and walk out the door with a good slice.", 
    "review_date": "2011-09-29"
  }, 
  "yV1PN-KG7vMKV9xyM4JToQ": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Serena C.", 
    "review_text": "I called to see if they deliver to my boyfriend's house and they put me on hold. When he got back on the line, he asked for the address and phone number. I told him I wanted to make sure he delivers before I order. He yells and say \"we don't deliver to your area. Bye.'' Before I could ask why, he hangs up. How rude!!", 
    "review_date": "2011-07-05"
  }, 
  "RBvff___C2dOco--ZaxD2Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken W.", 
    "review_text": "I've heard wonderous things about this place, but I've tried calling in a delivery order a couple of times now. The first time, after like and hour and a half, they finally called to re-confirm my address. When I told them (again), they said, oh we don't deliver there, and hung up. I'm in the Castro, not on the moon! So I tried to give them another chance today... well, they are open, but their phone rang again and again, but nobody every picked up. I think I'm done trying with these folks.", 
    "review_date": "2008-06-23"
  }, 
  "RqUJo6tjD8m4JEuZ37VN5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roshni R.", 
    "review_text": "i never remember going here, i never remember leaving, but i'll never forget the pizza.... this is a great place to end up when drunk, and b/c somehow someone once remembered to order enough for leftovers, i've found that's a good enough to love when you wake the next morning with a whopping hangover!", 
    "review_date": "2005-09-07"
  }, 
  "mx-dFZZ75kGi9aQk0vY4Pw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan L.", 
    "review_text": "I'm torn on Nizario's.  It's like four steps from my apartment.  That means that I pretty much eat every single meal here.  What can I say?  I'm a lazy bitch.  But it isn't very good.  I'd venture to say that the other two places on Castro St. are better.  It's just that I hate those extra few steps it takes to get there.  Thus I go to Nizario's.  And you know what?  This bitch stays open LATE.  Seriously if you want to pick up a drunk gay boy or a tranny prostitute at 2 a.m. this is the place to be!!!!  Oh, actually I might have something positive to say.  A first, I know.  This pizza is the best in the Castro for soaking up alcohol because its hella greasy and like 99% bread.  Loves it.", 
    "review_date": "2008-01-30"
  }, 
  "xjYfn62dH2opwyhI5lEYVA": {
    "user_rating": 3.0, 
    "user_location": "Denver, CO", 
    "user_name": "Brian K.", 
    "review_text": "Trusty old Nizarios. It's hard to tell what you really taste like after my taste buds have been numbed senseless by gin, but you sure smell great.  Plus, kudos to any business that'll thrive off of drunk gays.", 
    "review_date": "2007-11-28"
  }, 
  "LyXvIE71cMeiBaPZI_Yq2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dixon T.", 
    "review_text": "Mushroom and spinach; not too hard of an order.  However, there must have been a cup of oregano sprinkled across it.   I like oregano. Yet, this was like someone dropped the shaker on the pizza and said \"oh well, they won't see it past the spinach anyways...\"", 
    "review_date": "2007-09-27"
  }, 
  "_BHTC7nyCBoZcfiiD5cOXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gourmet G.", 
    "review_text": "That it caters to drunks and the party-hard set late at night is hardly a glowing recommendation. That the pizza - with a nice, zesty sauce, ample cheese, and fresh toppings - is excellent is what draws me back, thankfully in the light of the day when the crowd is sober and apparently better behaved than the masses at midnight. Friendly service, good prices, and far better than Marcello's or Escape from New York.", 
    "review_date": "2005-07-23"
  }, 
  "1OocYCAZixwbAXueW75FMw": {
    "user_rating": 3.0, 
    "user_location": "Boston, MA", 
    "user_name": "Graceypoo M.", 
    "review_text": "The first time I went here after some late night struttin' at the Castro, it was during the spinach/e.coli controversy.  I was disappointed because I feared ordering the Castro Special slice (chicken, spinach, feta, pesto), so I opted for the traditional Pepperoni slice.    I was super satisfied with the pepperoni slice....  (fastforward 6 months)  Perhaps from my initial satiation with the Quickly fried foods, I was not too ecstatic about the Castro Special. I was already rather full, but it was still a good slice.  Not the greatest, but still a good slice.", 
    "review_date": "2007-09-03"
  }, 
  "Za8VyFxoPAnfYoMCjNrTxA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Alice X.", 
    "review_text": "Perfect way to end a clubbing night at The Cafe in The Castro. They are opened until 2am!  For $4 you can order the Castro and get a humongous slice of chicken and pesto pizza. It was gooood.", 
    "review_date": "2011-05-14"
  }, 
  "tg7ooPB8K7o7pQ44s9YYig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob P.", 
    "review_text": "Best pizza in SF after a long night partying!  I highly recommend it...it has dance music which makes it sound like a club from the outside lol", 
    "review_date": "2006-09-15"
  }, 
  "GEJYu1fDN358hCcKU9xxjg": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "May D.", 
    "review_text": "Hungry after a night of dancing your butt off at The Cafe, Badlands or QBar? Need something to fill your stomach up after indulging in some booze and beverages at Last Call?   If you answered yes to any or both of questions above, look no further! Nizario's Pizza parlor is thee spot to be! It's open til 2 in the morning to satisfy your hunger pains without any fuss...You just pay for the slice and stuff your face in the cheesy triangular piece of heaven.  The slices are huge and for about $3.50 - $4.00, you cannot go wrong here!  And it's only right because you're in the Castro to get \"The Castro\". It's absolutely delicious as it is is decked out with pesto, spinach, chicken and feta cheese. Peep the photo and if that doesn't leave you salivating, I don't know what's wrong!...ok maybe my photo skills, but without a doubt Nizario's serves some g double o d GOOD pizza.", 
    "review_date": "2013-01-15"
  }, 
  "HbJtkfXOqPvuYWlnP290xQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Erin O.", 
    "review_text": "This pizza place got me through many nights of studying while I was in college. The one on 19th avenue was the one I used to get it from, but I hear this one has the ?grecko? too!. By far one of  the best pizza joints!", 
    "review_date": "2006-03-21"
  }, 
  "CiYRhDyFbsDbWR45uv822w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fannie S.", 
    "review_text": "I love this place...especially after a night of drinking at the nearby bars/clubs.    Pizza = hot, tasty and a bit greasy (hey, it's the cheese, man!)  Service = get in and get out.", 
    "review_date": "2009-01-13"
  }, 
  "sv1U8FIWQ_FMswSLcpzE_g": {
    "user_rating": 2.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Eric P.", 
    "review_text": "Update '09: Man has this place gone down hill. The pizza is decent enough, though not as good as it used to be. But now it feels like a night club. REAL loud music, nothing but kids hanging out and acting out, super bright lights, none of the artwork, photography and community event lisitings on the walls any more. definitely not worth the hassle to go there anymore", 
    "review_date": "2005-09-12"
  }, 
  "6xH5ZQ80KWAJk81lLRI3HA": {
    "user_rating": 3.0, 
    "user_location": "St. Petersburg, FL", 
    "user_name": "Pierce B.", 
    "review_text": "Have to agree with Panthea on this one.......for taste, Marcellos is better, but when the alcohol is in your system and its after 1 this is the place to go cause its open till 2 AM unlike Marcellos. Decent variety of pizza, but is cash only. It definitely hits the spot when you need something to wake you up for that journey home or to a bed! Plus there are always a ton of cabs right out the door to take you to where ever your final destination may be.......", 
    "review_date": "2010-08-21"
  }, 
  "Qg_jjqPXov2KmSPSIypG2A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy D.", 
    "review_text": "They take visa over the phone but not inside.  They are friendly to you if you have big tits.  They aren't honest, and it's only good when you're drunk. Try going there when you're sober...its a sobering experience all in itself.", 
    "review_date": "2009-04-09"
  }, 
  "rDK6Rk-p90JlpUb0QrKVVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tofer M.", 
    "review_text": "what can i say? im not much of a big pizza eater, but whenever this place is around i must have a slice. i usually get the super combo and get the work of spicys and cheese powder. . .   perfect place to go for your after the fact drinking time - eating time haha. probabaly wanna get there a little before 1 cause once the after the bar crowd comes.....DAMN IT BE CRACKING!!!!   the only thing is if they run out of the pizza at that time then they wont make another one, but overall i love this place and can never complain hahah even eat the pizza off the floor if its falls thats how much i love this place haha.!!!", 
    "review_date": "2010-11-03"
  }, 
  "BupxMA1KZEV08MHfBD1EuQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Cesar E.", 
    "review_text": "another pzza in castro. well my hawaain pizza and pesto it was even better flavor or taste. just  $ 3.00 dlls. i was eating my pizza with my friends when i was watching Tv. I was in shock to heard Whitney Houston just die. Drugs I dont know. but  the its awesome  to meet people and mingle. this place its cheap. cheap. greaaaat.", 
    "review_date": "2012-02-12"
  }, 
  "0f_0XfO2qcgNwSJAHwfR9g": {
    "user_rating": 3.0, 
    "user_location": "Porter Ranch, Los Angeles, CA", 
    "user_name": "James B.", 
    "review_text": "If you're looking for a pizza place that's open late, then Nizario's is definitely a perfect place to eat. They don't have much of a selection, so nothing fancy.  Pros: 1) Open Late 2) Large pieces 3) Fresh. Sometimes so fresh from the oven that you'll burn your mouth. Could barely taste anything the next day. I couldn't even eat anything hot or crispy. 4) AMAZING late night  Cons: 1) Limited selection 2) Can be salty. 3) Not quite the same experience during the day and sober.", 
    "review_date": "2012-07-19"
  }, 
  "C9ijJDnBaaWNQD5tLcNBFQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Ryan T.", 
    "review_text": "After an evening of bar hopping and \"being gay\" as my friend put it, we needed a late night munchy break, and what better late night eats cuisine than pizza! So off we headed to Nizario's. The biggest impression I received from this place was whatever slice I ordered that evening was out to chase the vampires. Garlic, you want garlic? Omg, soo much graciously good garlic on my slice--was it the Greco? I failed at that part, failed to write this review soon enough. Oh, and they're pretty quick here too. And yes, for more garlic, I shall return!", 
    "review_date": "2009-07-25"
  }, 
  "_-TCT-1WsbHEjaSVz5_loA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Christine L.", 
    "review_text": "Nice hole in the wall pizza place after a hard night's work of clubbing in the Castro.. Prices are cheap (especially for the city) and the slices are huge!", 
    "review_date": "2012-08-24"
  }, 
  "abMIw41Injf2rIMzMRUm7g": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Lizzie C.", 
    "review_text": "Second favorite pizza place of all time.  Give me a slice of the Castro Special and I won't have a care in the world.  I always go here after drunken and even sober nights in the Castro.  I might've also thrown up in front of the place on an occassion or two.  I can't really remember.  I do remember, however, the guy who takes my order at this place is always, always nice.", 
    "review_date": "2008-02-19"
  }, 
  "XjgRM6a-GXYq7Mm8CwiLmw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alex Y.", 
    "review_text": "I went here on a rainy day, and this place made it all cozy. Anyway, the pizza here tastes surprisingly \"gourmet,\" even though it's kind of a chain. I had fun watching \"Rosie's Family Cruise\" while waiting for my pizza to arrive.", 
    "review_date": "2008-12-02"
  }, 
  "OxvcJp4fwAsL11kF3d_mEg": {
    "user_rating": 4.0, 
    "user_location": "West Covina, CA", 
    "user_name": "Thomas M.", 
    "review_text": "Came here after bar hopping. Pizza was good! Price was fine, and flavor was good.  They had a stereo playing some good house music.   I will definitely return when I go back to SF", 
    "review_date": "2009-05-18"
  }, 
  "F_5_UNX-wrAFCXuAkBZRDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rodney H.", 
    "review_text": "I just had a mad Pizza craving after having some bottomless mimosas at Bisou.  Ran my trusty yelp app on my phone and Nizario's was the closest spot near me.  Pretty much a no frills by-the-slice pizza joint which was exactly what I needed. Ordered two mushroom slices (<a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FVjmaJR&amp;s=238663c5ac6747e63ca9929595cea8086df5f9d6683f366ba60a3563e40c71ac\" rel=\"nofollow\" target=\"_blank\">bit.ly/VjmaJR</a>) and they definitely hit the spot.  Glad I found Nizario's and I would recommend coming by here for a quick pizza stop if you're roaming around the Castro.", 
    "review_date": "2012-12-01"
  }, 
  "sfQXLZGk6beiSuNZYb8iSQ": {
    "user_rating": 3.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Rob L.", 
    "review_text": "Simply, just good! And it works!", 
    "review_date": "2008-02-29"
  }, 
  "nGqmdnQb_xUHNcPheQbwtg": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mihir M.", 
    "review_text": "Pizza was not NY style, was thick &amp; mediocre in taste. Service was good. It is open late. I would still go to Arinell's.", 
    "review_date": "2012-02-29"
  }, 
  "eeFOn5GqkmGYuphzj6rkwQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Gordon E.", 
    "review_text": "There's a lot of fancy pizza places in this neighborhood, but sometimes you just want a slice of cheese before seeing a movie, y'know?  The pizza here always seems fresh, and the service is quick.  $3 for a cheese slice still seems like way too much to me, but I understand that this is the going rate these days.  Not the best pizza slice in town, but useful in a pinch.", 
    "review_date": "2009-03-08"
  }, 
  "w8pktEhLgXQOAonxrm7OkQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LIVE to E.", 
    "review_text": "Good, over-loaded pizza, and cool people!", 
    "review_date": "2010-12-24"
  }, 
  "KtT1hjoUE4OXPML5UsK2lA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marcelina B.", 
    "review_text": "Mmm, this is the best pizza in SF. I love stopping in to grab a slice for lunch. The pizza has a nice balance of sauce and toppings. My favorites are the pepperoni and mushroom slices. The cheese doesn't fall into my face and the sauce isn't too messy.  They don't open until 1 p.m., which can be a downer. Yet, they stay open late until around 3 a.m., which is most def. a picker upper after a rowdy night out. Parking can be tricky, but worth a slice.  The guys who work here are also pretty nice. This place can get busy late night and they manage to keep up the pace with the crowd.", 
    "review_date": "2006-09-12"
  }, 
  "QkQbwG06fELqsjB8fM70cA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael G.", 
    "review_text": "I LOVE THIS PLACE! Nothing tops off a night of drunken mayhem like stumbling in here and getting some fucking PIZZZZAAAAAA!!!!!!! It's relatively cheap and awesome, plus the staff is incredibly nice. I'm surprised they're not insane from having to deal with all us drunks. If I could give this place 6 stars, I would.", 
    "review_date": "2006-07-12"
  }, 
  "Su8wKxp4mAVR20DRVPhNVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Big Toe ..", 
    "review_text": "Best pizza slice option in the area.  Probably top 5 pizza slice places in the city overall.  Never a fail, always solid.  They deliver too.", 
    "review_date": "2010-06-21"
  }, 
  "xjR3gOr834aaKKZMlcnpFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B H.", 
    "review_text": "If there's a prevention for a hangover...Nizario's Pizza is thee preventative measure. I've stumbled in here many -o- times late at night after that last call for alcohol then the bars kicking you out into the street.  It's like routine to many as the line swarms out the door here.  That sidewalk sale that died down in front of the BOC or the Sadlands has magically reappeared at the foot of Nizario's Pizza.  No, not the greatest pizza in San Francisco, but with late night eateries a slim option within walking distance from where you just slammed that quart sized Long Island Iced Tea, it makes this place look like the nightingale of the neighborhood.    Thank you for serving the community...not sending drunks that don't need to be on the road right after last call, and preventing that room from spinning before you go to bed.  Oh, and to you skinny bitches in the Castro wedged in those skinny pegged jeans ...eat something!", 
    "review_date": "2007-11-27"
  }, 
  "VUza3cSokXp5iPZGqdaw2g": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Allison G.", 
    "review_text": "Dear Nizario's,  Why are you so addictingly delicious, so close to my house, and open on my way home from the bar? Did you read my mind? Did you think it was a great idea to serve pizza at all hours of the day and night that it was too high-quality to ever be eaten after a drunken night out? Because I thought so, and you heard my prayers. I love your Castro special, and I hope you never go away because your pizza is just as mouthwateringly satisfying when I'm sober during normal eating hours as it is at night when I need something to put my alcohol to bed.  I think I speak for all of us when I say thanks for existing.", 
    "review_date": "2008-07-15"
  }, 
  "nx10o8SCYiTn8KWhmM6l-w": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Minh V.", 
    "review_text": "I can't tell if I like it or not. I keep ordering the Castro slice because people tell me it's the best, but I am still on the fence. Chicken and pesto... Eh...   It's good when it's fresh, but not good if they are heating it up. I think the slices are a little on the small side for $4, but when you are drunk does it really matter...", 
    "review_date": "2011-03-10"
  }, 
  "88B6_gCnjJXuPPPC_dcJsA": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Denise L.", 
    "review_text": "Drunk pizza runs in the Castro.. Doesn't get any better!", 
    "review_date": "2014-10-08"
  }, 
  "Sikv8Qig5xOmDaGXIKtpDQ": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "Tammy Y.", 
    "review_text": "sooo this is our usual pit stop after a night of dancing/drinking at the cafe, buuuuut unlike most pit stops, this place is actual GOOD when ur sober!!  but i recommend buying only whole pies, so that u don't get stuck w/one of those pieces that could have been sitting around for a while...", 
    "review_date": "2007-07-18"
  }, 
  "DhGhhREJVotM-9hk7-7k7Q": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Ross M.", 
    "review_text": "Solid pizza. Got pepperoni straight out of the oven. It was plasma hot so I had to wait a bit for it to cool off. Good pepperoni, tasty cheese, decent sauce, and great crust. Price is a bit more expensive than Serrano's (takes 2 slices to equal their single,) but it's a completely different style and variety is nice and all. I'd seen the place long ago, but just not got around to trying it. Shouldn't of waited. I'll be going back.", 
    "review_date": "2009-04-29"
  }, 
  "2nwxOe7wlP9-dF5fEP63cw": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Erika A.", 
    "review_text": "Drunken debauchery in Castro makes anyone hungry at 3am. Good thing this place was open. It was delish.", 
    "review_date": "2010-10-20"
  }, 
  "Zhs0hBatjm8rG7TbvD6Hew": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Elena F.", 
    "review_text": "Maybe i was just drunk, but damn that pesto slice was delicious.", 
    "review_date": "2012-02-21"
  }, 
  "9RqlcXU6LnOk4SnMqiboJg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael T.", 
    "review_text": "I have to say, the pizza is good. What overshadows the quality, however, is the service. I noticed a discrepancy in their pricing, and what started out as a simple question turned into a huge argument. The entire crew started attacking me simply because I pointed out that the price listed on their menu didn't add up to what they were actually charging me. When the phone rang, both employees ran to answer it to avoid answering my question. I'm still shocked at what I saw- what should have been a simple explanation did not need to get so out of hand. The guy ended up yelling at me that he didn't need my gratuity (after saying math is hard). Sorry guys- pizza isn't that difficult; I'll take my business to someone that is honest and doesn't attack me when I ask a simple question.", 
    "review_date": "2010-04-11"
  }, 
  "WJnEifJRkI6bCH2iw8brFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nenette Y.", 
    "review_text": "2AM Friday night after a few drinks at the Elbo Room called for yummy greasy pizza... THANK YOU Nizario's for always coming through!  The workers are efficient and work quickly to ensure the line of hungry buzzed  patrons get their slices fast.  Funny, though... just realized I've usually been tipsy when wolfing down a slice... perhaps that's what makes it taste so good???", 
    "review_date": "2007-02-03"
  }, 
  "CVlGVvlR436OH8Q1pHfz-Q": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Darryl P.", 
    "review_text": "My friend wanted to grab a quick bite and said this pizza joint was good so we stopped by here after a night out on the town. We just got out of Badlands Bar and Nizario's was just across the street.  She ordered a cheese pizza for $2.75 which is a pretty good deal! We shared it and I usually don't do cheese pizzas but I enjoyed Nizario's. The pizza was nice and crisp. It was very tasty and cheesy as well!  Good stuff!", 
    "review_date": "2009-06-12"
  }, 
  "l-ECea3knk6W_euS6-dSag": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason I.", 
    "review_text": "When you are going bar hopping and stop in to get a slice, the pizza is pretty darn good.  When you order a pie over the phone for delivery, it doesn't taste the same.  ie:  Way Way Way too much cheese and not enough sauce.  Our bellies hurt after eating a couple of pieces it was so cheesy.  But again, the walk-in-grab-a-slice is pretty good.  2.5 stars", 
    "review_date": "2009-05-11"
  }, 
  "wZG2xlICfUkJiY1NdPJH2A": {
    "user_rating": 3.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Naomi K.", 
    "review_text": "And that's the way you end the night. Do you really care how it tastes? Probably won't remember in the morning anyway (unless you're the unfortunate role of the DD.) not bad not bad... service was quick, nothing to complain of. Other patrons were friendly and conversational.", 
    "review_date": "2010-08-30"
  }, 
  "TkQvq2fuLA5gcXN7AwZvCQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Juan V.", 
    "review_text": "I'll keep this short and sweet. Went on a Wednesday night, they're open till 2am so that's a plus. Ordered a medium pesto pizza, came out to 15.20, not a bad of a price. Was cooked faster than expected and was delicious.  Added some garlic and pepper and it was perfect.  A very tasty pizza at a decent price. Definitely recommend going if you're in the mood for a new pizza spot.", 
    "review_date": "2014-05-29"
  }, 
  "4PC5Oi3Z9j93kDs2hSBwYg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Leticia G.", 
    "review_text": "This is a sober review... LOL  the pizza selection was lacking, especially for a vegetarian, but I still enjoyed my cheese slice before heading out.  -the bread to cheese to sauce ration was good -cheese was gooey enough -crust had a little flavor -service was quick and with a smile  maybe if i was drunk i would have added another star... LOL", 
    "review_date": "2012-04-05"
  }, 
  "PKpK3d1z2VxOfXGpZ935qA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Liz A.", 
    "review_text": "Castro special and a soda after bar hopping will help with sobering one up to drive back home. Savory and cheesey, the slice of pizza was delish!!! My only regret was that I ate the pizza too quickly in my drunk stupor. Oh, and that they don't take cards after hours, and my friend wounldn't stop bitching about it afterwards...", 
    "review_date": "2010-03-12"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "3.5 stars  I'd hate to break the solid 4 star reviews here, but last night my pizza was just alright.  Their pizza by the slice ranges from $2.75 to $4.     My Combo pizza had salami, sausage and mushrooms.  I like the thick crust, although it was a bit chewy (must've been sitting a while), they didn't skimp on the toppings, definitely cheesy but not too much sauce.  On the other hand, the bf had the $4 Castro special (which came right out of the oven) was perfect!  Lots of cubed chicken, spinach, pesto and feta cheese.    If you've got the pizza cravings late at night, they are open until 2 am. You can't go wrong by ordering the Castro special and the service is quite fast here at Nizario's.", 
    "review_date": "2009-08-20"
  }, 
  "WALNtcSZlONK4Yj-o3pzKA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan B.", 
    "review_text": "You grew up with Mario. You played through the years and eventually met Wario. In unfathomable recesses of the Castro awaits... Nizario. He's gay. Are you surprised? He's black. Yeah. You're surprised. I made that up.  Went here years ago during a film festival and again during this past PRIDE Saturday. The PRIDE version had a security doorman controlling the flow of entry and notifying would-be eaters that it was cash-only.  $3-5ish per slice got us PEPPERONI, COMBO (standard meats &amp; vegetables), and CASTRO SPECIAL (spinach, pesto, feta, chicken). I recommend 2 slices because 1 isn't enough.", 
    "review_date": "2012-06-25"
  }, 
  "BAYRxyOA85kURkjNBVtWnw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darrin G.", 
    "review_text": "It works in a pinch and it's open late. Thank you. If you go there late at night, you have to battle 48 other people with the drunk munchies. One time, they even reopened just for me after they closed, that's good customer service.", 
    "review_date": "2008-03-14"
  }, 
  "2e2tFS_YWH6OxNaHsv5fdA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "GS M.", 
    "review_text": "I'm not much of a pizza connoisseur, but here goes... The crust was awesome (I am a carb addict) and there wasn't a crazy load of cheese on it to weigh it down. Delivery is fast!", 
    "review_date": "2007-10-29"
  }, 
  "kURCgNT_VnZ7P3TGqC8nsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe S.", 
    "review_text": "We would order a pie from this place and drive over to pick it up. Now that we are closer to the Geary location, we are sad. Geary has no green olives and I like to top my pizza with green olives. When we order for home we always get the \"Nizario's Special'  no onions + green olives.   In a state of cosmo-drunk'd-ness you can't beat a quick slice here. Ask them not to heat your slice since they tend to have plenty of still warm pies already resting on top of the oven. I sometimes forget and burn my tongue.", 
    "review_date": "2006-09-27"
  }, 
  "cjm-OLc-E0Z9qpQ8t7GDsw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Trick D.", 
    "review_text": "I love Nizario's because they have THE best crust and fresh ingredients. I've tried Marcello's, Escape From New York Pizza, Goathill, Extreme, Orgasmica, Mr. Pizza Man, Pizza Love, North Beach Pizza, Arinell, Cable Car, Cybelle's, Serranos, Pauline's...and some of those are really good but this one is my favorite. It's a family owned business and despite some reviewers opinions, I love these guys. I actually order from them when I'm sober contrary to the club goers in the Castro. I love Nizario's!", 
    "review_date": "2011-09-08"
  }, 
  "QKjzJglNMT_m4XK602WeSQ": {
    "user_rating": 5.0, 
    "user_location": "Larkspur, CA", 
    "user_name": "Andrew S.", 
    "review_text": "While it seems like they're skimping just a little bit on the tomato sauce these days, it's still my favorite pizza in town.  Great crust!  Best fresh out of the oven.    I've been to 3 different locations in SF, and the service is ALWAYS quick and accurate.  While they seem to be always task-focused, there is an underlying emphasis on customer service and customer appreciation.  They take pride in doing what they do well.  My office colleagues thanked me when I figured out the North Beach location will deliver to the financial district for lunch.  They all agree that Nizario's is way better than the other two places we used to order from for work lunches.  And even better, they really seemed to appreciate the extra business.", 
    "review_date": "2012-03-07"
  }, 
  "l0I8QAnHJoLhEozrFilONg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy W.", 
    "review_text": "In High School every Asian restaurant---OK, they were ALL Chinese. Bay Area suburbs had yet to find out about any Asian food that couldn't be consumed dripping in sweet and sour---was within one half block of a veterinary hospital. Either that or they shared a parking lot. Oh how we'd laugh. Actually we wouldn't. It's still a stupid joke, unworthy of even your last dust fart of a courtesy laugh.  But what would we have thought of a pizza place right next to stores where huge dildos, butt plugs, 2nd-hand gay porn (wow, THAT reads funny) and bulk lube were sold? Would our teenage heads have exploded? Can a line even be drawn here? Is there any connection?  Here's the thing. I've enjoyed other Nizario's slices. And by enjoyed I mean, I was tanked off of my ass. Juiced. Pixelated. Had you thrown me into a cab before a slice of Nizario's, the cabbie would have just slowed at the nearest corner and rolled me out, tiring of the 20 Questions \"Where The Fuck Do You Live Asshole\" game. But nibble a Nizario's slice and the two fingers of dough, veneer of cheese-like goo and coagulating orange stuff (seriously, I think the foundation is Fake Tan) all work in concert so you get your legs back under you. At least enough so you can stagger home to pass out face down over the covers with your boots on.   But eating this shit sober? I'm sorry. It makes no sense. Use it to patch a draft. Buy some stuff at a craft shop and turn two slices into a pair of groovy flip-flops.  Don't get me wrong, I've had worse and paid for it. But. No thank you.  That said, in true Castro style, tonight they were watching a movie in this dark pizza hole. It was a shirtless Russell Crowe beating the snot out of another shirtless guy in Cinderella Man. Poetry. Sweet man-poetry. One greasy freakin' Star for that.", 
    "review_date": "2007-02-01"
  }, 
  "Zl1fJNTzNULZiqBRShxUYA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John S.", 
    "review_text": "Dear Escape from New York Pizza on Castro Street,  I'm sorry it's been so long since I've come to see you.  I know we used to spend a lot of time together, but our relationship was beginning to have a deleterious effect on my health, and I found it impossible to spend less time with you, so I took a break.  Completely.  Cold turkey.  I saw you when I switched buses at Castro &amp; 18th, but how could I approach you?  What would I say?  We would just be up to no good like the old days, and I have my health to think about.  You might wonder why I'm writing you this letter.  Well, I have a confession to make.  I thought it had been a good long while since I had talked to you, so I was ready for that thing you do.  To my body.  But since we've slowed down, I've gotten addicted to this thing called Yelp.  Don't worry; it's not another pizza place.  But this Yelp makes me do things I normally wouldn't you.  You of all pizza places should know that when I find something I like, I stick with it.  Well, Escape from New York Pizza on Castro Street, I was at your corner last week--and I went to Nizario's instead.  Please don't cry.  I hate to see a pizza-by-the-slice place cry.  Yell at me, please.  That's good.  I don't know what to say.  It might be horrible, but I've been honest with you this whole time, and I want to keep being honest.  Nizario's sucked.  It's ugly.  You know I'm not that shallow.  It's what's inside a pizza place's oven that counts, but you're much more attractive than Nizario's.  And cleaner.  And you've got much bigger slices.  And your toppings--God I miss your toppings.  I even ordered delivery from Nizario's once and they got my order wrong.  They added pepperoni when I had asked for cheese.  I know you wouldn't make that mistake; you know I'm a vegetarian.  You know everything about me.  And you don't stop accepting credit cards thirty minutes before you close.  I promise never to go to Nizario's again.  Please take me back.  I love you.  UPDATE:  11/22/09 ===============  I just noticed that they have a front step, meaning Nizario's is inaccessible to wheelchair users.  It would be very easy for them to turn this step into a ramp.  Minus one star for discrimination.", 
    "review_date": "2008-07-08"
  }, 
  "NbdKctpJhm8iktZrrLpULg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Anna K.", 
    "review_text": "My Castro Crawl goes like this: The Edge, Badlands, and finally, Nizario's, I basically just go down the street. If I don't have Nizario's after a night in the Castro, there is something very wrong.   My friends and I just get a whole pie of the Castro. Done deal. Never remember how much it is, but who flippin' cares, it's very much worth it. The warmth, fluffiness, and awesome flavors soaking up all the drinks, which are just too cheap in the Castro. There is limited seating inside, so a lot of people stand and eat. In another case of a too drunk friend, we sit outside on the curb to eat. But never any judgement. Don't think and just Nizario.", 
    "review_date": "2014-11-27"
  }, 
  "Sp6j8NoyEEFrJ5XuDIabNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin B.", 
    "review_text": "Simply awesome pizza at a good price (very tasty)! If your in the Castro and want a slice of pizza this place is for you.   Only downside, is the place could use a renovation to update the sitting area, and expand their beverage selections.", 
    "review_date": "2012-12-24"
  }, 
  "JRwfZBgGZ3O7JYGTNIxeDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emm E.", 
    "review_text": "You HAVE.  to come to nizarios (preferably wasted) and get castro slice.   Srsly.", 
    "review_date": "2009-01-25"
  }, 
  "_g7HODSUCPsFNdkYJVAihQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "babsie g.", 
    "review_text": "Fluffy-crust, kid-friendly.", 
    "review_date": "2008-01-12"
  }, 
  "i8_CmYRkxXDWOEFzvrGL0w": {
    "user_rating": 5.0, 
    "user_location": "Santa Maria, CA", 
    "user_name": "Megan C.", 
    "review_text": "I'm vegan. Or at least, I'm normally vegan. And then I met Nizario's Pizza. And now, I'm vegan except for my once monthly splurge on their amazing pesto cheese pizza. I always take one slice home, and before I've finished my walk home I've eaten the massive slice and I'm upset I didn't either 1. savor it or 2. buy a second slice.", 
    "review_date": "2011-09-06"
  }, 
  "AQPMQsy5b3lJ5AucfNMltw": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Mimi T.", 
    "review_text": "Try the Castro Special, it's to die for... then again, I don't think I've had it while I was sober... But who cares!? My friends and I make an effort to eat here every time we come to the Castro after bar hopping or the Cafe. I've always had it when it comes right out of the oven, piping hot, and I burn the roof of my mouth, the crust is soooo crisp, and that's the way I like my pizza. It's the perfect ratio or sauce, to toppings, to crust... yummmmmmm!", 
    "review_date": "2007-07-23"
  }, 
  "E8SBgquFJ6rb6CZyvB0a3Q": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Bianca F.", 
    "review_text": "Pizza had serious potential but was so cold I felt like I was eating something from the Safeway frozen food isle.", 
    "review_date": "2012-02-22"
  }, 
  "oCKm9PazHLoc72UJJ_C62Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J U.", 
    "review_text": "Having lived in this neighborhood, I firmly believe that Nizario's is the worst of the three pizza-by-the-slice places all within a block of 18th and Castro. My main recollection is that their dough is incredibly boring: 'meh'. Marcello's and Escape from NY are much better, and both great at that.", 
    "review_date": "2010-07-31"
  }, 
  "_VGIPT2dDMJvAsRjjQcD-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pauline L.", 
    "review_text": "Following my friends' usual MO..it seems that after club hopping into the wee hours of the morning, we had to stop off and top our night with a hot slice of Nizario's Pizza.  Every drunk was weaving between us and the counter...which gave us plenty of time to decide our slice choices...actually it gave my booze hound friends more chances to hit on anything standing on 2 legs...be it guy or gal...  I chose the Castro special..which had feta cheese and spinach...you know it's good when I can't even remember if there's meat on it..or maybe I was too drunk to know what I was chewing on...it could have been a dishcloth and still tasted good ...however I got a chance to nibble off my friend's vegetarian slice...OOOOOOhhh..it was good...I love veggie pizza!   Still 3:00am and the place was stuffed with people, so make sure you know what you want to move the line along. The prices are cheap and the pizza's hot...actually be careful...it'll burn the roof of your mouth on your first bite.", 
    "review_date": "2007-04-13"
  }, 
  "hJU9mT65M--PA9gfWroViw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luis B.", 
    "review_text": "I'm giving this 5 STARS because it has never, ever failed me. Doesn't matter if it's after a night of drinking or a night of work or even just one of those nights when you just need a slice of pizza, this takes the crown of best Castro pizza.  CONSISTENTLY good crust, sauce, cheese, and toppings. My go to is the Super Combo and Castro but they are all bombskies. Service is quick and easy, they aren't storytellers, but they are nice people and they serve up killer pizza!! One of my absolute favorite by the slice joints in the whole city. No joke!", 
    "review_date": "2013-09-28"
  }, 
  "s9WBKx20hounkJtGztEGMA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael H.", 
    "review_text": "It's a pretty much mandatory late night stop after an evening out in the Castro. Their pizza is wonderful, and the line is long but moves quickly!", 
    "review_date": "2005-08-12"
  }, 
  "0MWPb0pwNEJBPaTIBGv8aA": {
    "user_rating": 4.0, 
    "user_location": "Breckenridge, TX", 
    "user_name": "Marie E.", 
    "review_text": "Many fond memories at Nizario's.  The crust is perfect...crispy and soft and very tasty.  My fav is the mushroom pizza with extra cheese, sauce and mushroom loaded with crushed pepper and garlic powder.", 
    "review_date": "2006-06-27"
  }, 
  "P3usQcIegPCl-cdH4IDirg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean B.", 
    "review_text": "Mikey U nailed it. Three stars by day, four stars by night. Maybe five. Sometimes, with a nice beer buzz, a slice of Nizario's is the best thing in the world.", 
    "review_date": "2012-05-30"
  }, 
  "5iCzdzUFqbwwjgYkfr2nhA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Mark L.", 
    "review_text": "If the hot dog lady ain't out on the street, this is the place to go. Hit up this pizza joint for all your drunk munchy needs.  This place has all types of pizzas to meet your needs, other than the super combo, the next best thing is the castro pizza.  Have munchies at the end of the night. Solve it with Nizario's!", 
    "review_date": "2010-09-12"
  }, 
  "cbFq5sKhOCgCIiRGgigbOg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Maurice S.", 
    "review_text": "I come here on a regular basis whether it's for a meal or a drunken hunger binge. Pizza is always Fresh and hottt! Simple easy to read menu and very reasonably priced. Highly recommend! Staff is friendly and makes you feel welcome!", 
    "review_date": "2013-12-16"
  }, 
  "jKjTC8f0sXiSaRt9qELVGg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Christine V.", 
    "review_text": "Amazing!! Get the Castro slice!!! It's packed with goodies. Opens late so you can get your grub on after hours.", 
    "review_date": "2008-11-09"
  }, 
  "eMpFQJIP7ItyGQeBtYmHyQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gavin M.", 
    "review_text": "A little bit breadier than i usually like, but thats about my only complaint. I use normal pepperoni as my yard stick for pizza places and this one is right on target. Always perfectly sauced, the sauce isn't too sweet either. But other than that the castro special is what you come here for. Creative flavors perfectly executed...yes it is possible to make better pizza but it would be like trying to tell the difference between a 60 dollar and 300 dollar bottle of wine, 99% of the world just cant do it.", 
    "review_date": "2008-02-12"
  }, 
  "2jvZHhzBAm35Yn1yX4RzsQ": {
    "user_rating": 5.0, 
    "user_location": "Downtown, Los Angeles, CA", 
    "user_name": "German S.", 
    "review_text": "Really good pizza", 
    "review_date": "2013-05-03"
  }, 
  "Ait8j0oq7PaifNuSsztTOg": {
    "user_rating": 2.0, 
    "user_location": "Boston, MA", 
    "user_name": "Nicole P.", 
    "review_text": "In a drunken haze, I was led to Nizario's in an attempt to \"sober up,\" whatever that is. Even in a stupor, I know what I like and Nizario's didn't quite meet that expectation.  First and foremost, when I pay $4.00 for a slice a pizza, I expect a rather large slice of pizza from a \"hole in the wall\" joint. You want to keep me as a customer, don't you? THEN FEED ME. My $4.00 slice was medium sized, but you would think that businesses would step up their game, especially in this economy. I am used to getting a 1/6 of a rather large pizza for around $2.00, so receiving an 1/8 of a pizza for double the cost seems like a rip off!  Whatever. I paid it. Time to sink my teeth into it.   Maybe it was the cold. Maybe it was my altered state. Maybe not many people were eating the same pizza as me (after all, I am a vegetarian and there were pretty much only men in the place, so you KNOW they were all eating the MEAT pizzas), but my pizza tasted like it was under a heat lamp for some time -- not fresh at all. I ate part of the crush of my friend's meat pizza (a part that was not contaminated), and I really tasted the difference between fresh and not-so-fresh. My veg combo pizza was the latter.  The crowd was consistent the whole 30 minutes I was there. There was a crowd of cute Filippino boys who will hella chismis-ing, and I totally entered their conversation and gave them some good comeback lines. Needless to say, they loved me. Duh.  Any who, the place was ok: not dirty nor clean -- it's a walk-thru pizzeria. There is a little area for the pizza sprinkles stuff (Parmesan cheese, chili, salt'n'pepper, whatever) right next to the register, so that made it really easy to decorate my pizza right when I got it -- not like it was fresh though... psh.  I would say something about Nizario's being open late, but I realized that I'm pretty much a grandma when it comes to staying out late, and what felt like 1 am, was really only 10 pm.", 
    "review_date": "2010-11-27"
  }, 
  "G_v57-C_ePnL-OCkrINUuw": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Monk R.", 
    "review_text": "pizza before beer, come here! i know, i'm backwards, but in anticipation for a night of heavy drinking, i like to coat my stomach with yummy melty greasy cheese from here.  it's the perfect gaysian pregame for a night in the castro!", 
    "review_date": "2007-03-26"
  }, 
  "WyMzo22yR3KGRo6IxhnPzA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Silvia S.", 
    "review_text": "Nizario's is a great place to have single sliced pizza. It beats greasy Blondies any day. It's cheap and fast when you're looking food after a drunken night out in The Castro. If you're looking for \"California\" style pizza with everything under the sun on it... then this place isn't for you. If you're looking for simple classic style pizza (ie. cheese, pep, combo, mushroom, pesto) then you've got a winner. Thanks for reading, Silvia.", 
    "review_date": "2007-06-23"
  }, 
  "w3HfQxcj_XkubBpmml71xA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jen p.", 
    "review_text": "i don't care for the crust too much, but the combo pizza was pretty good with big portions.", 
    "review_date": "2008-08-07"
  }, 
  "tpz0iEFgkdIm4c1fxBhkGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William D.", 
    "review_text": "Nizario's has been my FAVORITE - NON Pizza Hut place EVER.   While yes, I cant use my credit card usually, and while yes, they rarely have Pesto pizza when I want it, and while yes, I did get kicked the fuck out while I was drunk on Gay Pride 08 because I was making out with all the boys in there (and girls) - I STILL love this place.  I love greasy pizza, and I even more love the fact that the service is FAST, CONSISTENT, AND the people who work/own this place are SWEET! Sweet as in nice, and forward.  The Pesto is the BEST in the neighborhood, and the pepperoni isnt too bad in its own right. Its open late, and usually a line (while that line moves extremely fast) its all worth it if your coming out of Midnight Sun, The Mix, Badlands, or wanna walk a block from 440 Castro or \"The Bar\".  Take it from this zoftig San Franciscan - I LOVE PIZZA, and this really is the best.", 
    "review_date": "2008-08-25"
  }, 
  "sC1ON2nyQ6hDIKWOjQTprA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Jay S.", 
    "review_text": "One of the most delicious pizza's at 2:00am after a night of drinking. The only complaint is that the line is long, but its worth it! Whats good for my tummy is good for their business!", 
    "review_date": "2011-06-24"
  }, 
  "Of-owAFByl-3NWM8PTgjXg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jeanette S.", 
    "review_text": "Man, this place is awesome! Another SF establishment that did not disappoint me! :) Since my friend and I are Yelp obsessed, lol, he said one of his friends, and of course Yelp said this was one of the best pizza places in San Fran. Also, Nizario's is in the Castro District, so that's a plus already! How can you not love Castro, haha!  I ordered the Castro special which is chicken, feta cheese, spinach, and pesto. I almost didn't order it, because the spinach in the picture looked overpowering, but it was so delicious! It was also extra cheesy,  and you know how I love cheese, yyyyyyuuuuuummmmmmm!!!!!  My pizza slice did take sort of a long time to come out, and I was getting a little annoyed at the gentlemen working there, since I was freakin hungry! but overall delicious pizza, definitely worth the wait. :) They also gave us a free Coke, which was very nice.  You can't help but love the Castro district!", 
    "review_date": "2010-07-21"
  }, 
  "I2zcNlcm2YO5FuCiZbqMCQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Mohib Q.", 
    "review_text": "I had the fortune of trying this little hole-in-the-wall this past weekend. Located right in the heart of the Castro, you can find a line here on many weekends and few parking options. Many patrons, I'm sure, will find other options along with busy corridor of San Francisco, but Nizario's is at least worth one's curiosity.   Here, you have limited options for both meat and veggie lovers. For meat lovers you have your Hawaiian, pepperoni, and a few others. For veggie lovers, you have a cheese, mushroom, all-out veggie, and a pesto as well. The pizza's here are warmed up as you order, and ready-make from hours of prep to meet their peak periods. Please note their pizzas are pan-style, and not thin crust, or deep dish like your Dos Minos folks may push onto you. Here, you get what they have, and that's really it. What they have, however, is quite delicious and simple.   I tried the pesto pizza, which was cooked to perfection. The crust was buttery enough, and the cheese wasn't melting off my plate. I was able to bite in with ease, and taste the subtle flavors of pesto as cheese oozed between my bite and the remaining slice. It was so satisfying, somehow, that I went back for another slice.   If you're in the area, consider all the great options, but also consider Nizario's for their basic and cheap after hour eats.", 
    "review_date": "2014-07-14"
  }, 
  "JYQo-TooKW34TjH21N6r5A": {
    "user_rating": 4.0, 
    "user_location": "Newark, CA", 
    "user_name": "jen t.", 
    "review_text": "Mmm Are you drunk? Do you need Pizza? Try Not to J-Walk to get it ~ The pizza is good, and you get it fast so its great for those impatient people who need something other than alcohol in their bellies.", 
    "review_date": "2007-10-24"
  }, 
  "kZJWAY828P8QZTqVYzhTCg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fancypants X.", 
    "review_text": "There is absolutely nothing better than stumbling into Nizario's at 1:30 am with makeup smeared across my face from dancing my ass off all night. It's almost become a ritual to stop by and have a slice whenever my best friend and I are in the castro.   We went to the Castro Theater for the Sound of Music Sing-a-long and did not have time to sit down and eat. I grabbed a greko special slice(feta, garlic, pesto, olives) and the best friend got a california castro special slice(pesto, chicken, feta, spinach) and it was so comforting to stand in that cold, long line with our pizza. We washed in down with some root beer and was sat-is-fied.  After hitting The Cafe or Badlands, I am usually drunk, dehydrated and half asleep. On those nights, nothing hits the spot like their vegetarian special (mushrooms, bell peppers, onion, tomato.)", 
    "review_date": "2009-01-13"
  }, 
  "4r0m_cpf8kr3B3VDldHd7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lucky Lindy M.", 
    "review_text": "This is my drunk spot for a quick bite that is not too much and not too less. They know how to make a mean piece of pizza!", 
    "review_date": "2006-05-14"
  }, 
  "wzENY_T3jUPbYmPYkJfkNg": {
    "user_rating": 4.0, 
    "user_location": "Venice, CA", 
    "user_name": "Evan A.", 
    "review_text": "I stumbled in here one night, blindly drunk at 2 AM.  I ordered my two slices and stumbled back out bumping my pizza box into a guy walking in.  He turned and said something mildly antagonizing.  I took the bait and we soon found ourselves wrestling in the gutter in some drunken fight to the amazement of his friends.  He got up, apologized, gave me a hug, and walked back in.  A fight over a piece of pizza.  It's good pizza, though not worth fighting over.", 
    "review_date": "2007-01-28"
  }, 
  "nvXCx6Rk13ow0Osl2seEtQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan Beach, CA", 
    "user_name": "Adrienne F.", 
    "review_text": "Simply. The. Best. Better. Than. All. The. Rest.  Friday. Night. 2 am. Ill have the Castro.   Best Friend and I get a whole pizza. Must wait until home to eat. Start to run up the hill in high heels and short dress. Cab? ugh. no cash. Okay, takin the bus....  Finally.  Pesto. Cheese. Tomato. Garlic. Sauce. Puffy Dough. Deliciousness.", 
    "review_date": "2007-12-30"
  }, 
  "1m8KXeQLORJVdMv5LbXkEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasen L.", 
    "review_text": "The best pizza ever after drinking the night away in the castro! ive tried this place a few times sober... but its much tastier drunk!  I love the castro special and usually get that and a slice of pepperoni! Its great it stays open so late... I think it closes at 3am.  Weekends prepare for a line up out the door with the gays hungry for a slice of these pies!  Nizario's your fattening me up!    Ive come here so much that when I went to the Nizario's in North Beach... the guy taking my order says to me \"I know you, you always go to the castro location\"", 
    "review_date": "2010-01-08"
  }, 
  "4I9B7rQgxZPjxoSmSYJ8ew": {
    "user_rating": 5.0, 
    "user_location": "Wilsonville, OR", 
    "user_name": "Patrick M.", 
    "review_text": "THE place to get pizza in the Castro. Their slices are generous and the staff is efficient. It's not like you'll have a choice when you and your friends are stumbling down from Badlands, but these guys do you right.", 
    "review_date": "2014-03-23"
  }, 
  "a-CtXGkmHkaaXSvnOLFxOg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura W.", 
    "review_text": "MMmmm, okay so I was drunk, but this pizza was awesome!  I don't even know what I had... maybe the Hawaiin?  I know my roommate had the Castro special and then we had a loud drunken discussion about how \"fucking awesome\" our pizza slices were.  The parmesan cheese went missing, but there was a dirty paper plate with some cheese dumped on it, so we used that.  Then my friend Jose ran into the head cheerleader from his high school, and we laughed for awhile about how hillarious that was, for some reason.  It feels like a dream, but it was so real...", 
    "review_date": "2007-09-28"
  }, 
  "qVpl3pChUXCcXiUO-xX2mw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben T.", 
    "review_text": "i came here on a whim one hungry night and was expecting much better pizza considering the rave reviews people have given me.  i had two slices of the Castro and must say that it was decent (albeit a little on the cold side), but i've certainly had better and prefer marcellos or escape from ny pizza over nizarios any day.", 
    "review_date": "2010-11-24"
  }, 
  "p6DS-Bd_ygW3JKUTz31CPg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff J.", 
    "review_text": "Great name for a pizza place.  $3 for a pesto slice.  I usually have cheese but in this case I went with Pesto because pesto is my favorite.  It was a very good piece of pizza just too fat for a good score on my list though.", 
    "review_date": "2010-07-04"
  }, 
  "JgSMZ6MUZGf38cSBajknww": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Nina N.", 
    "review_text": "Are you drunk?  Hungry?  In the castro?  well I have found the perfect after clubbing dining place, and it is sooooooooooooooo tasty!!! I like cheese pizza, and their cheese pizza and veggie pizza were soooooooooo delicious!!!", 
    "review_date": "2009-07-17"
  }, 
  "YEKy3CEFI23R49tpqlMvbg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vikram A.", 
    "review_text": "We only had delivery from this place, so this review is about that and the food....  The delivery service was actually not that great. They came late, and they actually forgot part of our order. We didn't notice it at first. But, to the driver's credit, he did and called a few minutes after he left to say that he'd be back with the other part of our order.  We had ordered their Castro specialty pizza. Now, I'm a bit of a pizza snob, and I can be picky about what I consider pizza. I consider this to be a \"California-style\" pizza, which really is akin to how petite syrah isn't really a syrah. But, for what it was, it was damn tasty.", 
    "review_date": "2007-05-06"
  }, 
  "09T1oyi6c-9lvyt7gQCD2w": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Peter L.", 
    "review_text": "A slice of pepperoni ($2.75); a slice of Hawaiian ($3.00); a good Supercombo slice of pizza ($4) and I wasn't even that hungry. The toppings were more than the average drop-in pizzeria. The crust was not too thin nor thick, but just about right. Don't see why I wouldn't stop by here the next time in the area and without food plans. Barely half a block away from the BofA you can spot at the intersection of Market and Castro streets.  Bonus review: \"Halloween in the Castro\" is no longer the same as those from years ago. While it is still fun and was crowded with odd-costumed revelers, it's a bit different now - safer in a way. No more massive crowds - on the streets and sidewalks (now it's just on the sidewalks). No more blaring dance music/DJ stages in the middle of the streets (now it's just music coming from the bars). At least no more thugs and troublemakers (now it's just the SFPD).", 
    "review_date": "2009-11-01"
  }, 
  "2SdDjnA1-fWkzfSU9OUEkg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James J.", 
    "review_text": "Pros = Good to eat after a drunken night in the castro, despite long lines you get your food fast, castro special, cheap for slices.  Cons = Bad to eat if you are even remotely sober....in any neighborhood, when you are in a long line you have to wait especially if you are sober after a night of clubbing...you'd much rather be in bed with or without someone. Lastly, and I don't know if being sober is what makes me notice this but.....The guys who serve you seem more rude....is that possible.  Overall I think this is the perfect place to eat when you have consumed mass amounts of liquor....I've even ordered the castro special for a bunch of drunken friends kicking it at my place from the geary location. Liquor + Nizarios Pizza + friends = good times.", 
    "review_date": "2007-06-10"
  }, 
  "f7pSMOZKE3rCReyfjAv_uQ": {
    "user_rating": 5.0, 
    "user_location": "Covington, KY", 
    "user_name": "Steve P.", 
    "review_text": "I've lived in the Castro for over ten years now but used to visit the Avenues a lot and that is where I first got my taste for Nizario's pizza.  They were always open late and we would stumble there from the bars for some sliced goodness.  I had forgotten that they opened up one near my house in the Castro so I called one day and didn't know what to order so we got the Castro special.  Oh boy, we don't order anything else now.  Nizario's is one of the best and no snobby stoner kids running the registers.", 
    "review_date": "2008-01-27"
  }, 
  "rMNPcAVo5Jpm55Sm68eQ2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A P.", 
    "review_text": "Castro special please!...I heard the hell outta that!  this is where you have to come to get a slice of pizza to bring down the buzz after a night of drinking in the Stro!  Open late most nights.\n  Staying home? they deliver too!", 
    "review_date": "2006-10-08"
  }, 
  "pehdkxwE_uW-Bdf2ZxWsug": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "The drunken adventures I have to share from this shithole are endless.  Let me just say, kudos for being such smart business owners to stay open until after the bars close... Because this is really the only way and reason they get 99% of their business. Escape from new York around the corner which has WAY better pizza needs to open its eyes and realize they are making the dumbest business decision by closing so early in a neighborhood that breathers and lives during the after hours like Castro!  Nizario's pizza is absolutely gross. Just go during the day and you'll be able to tell why... it is dead. Queens who live in the Castro are sober and know better not to get anywhere near this shoebox hole in the wall during the daylight.  Service here is awful but the poor quality of the overpriced slice of pizza and expired rotten parmesan cheese on the side does it for me.  Alcohol intoxication is not a good enough reason for me to stumble upon this crack house... I must be on either crystal meth or crack to end up here..  Pepperoni pizza: awful Cheese pizza: couldn't be more blend Castro pizza: overpriced and always out  Do they have anything else on their menu? No  STAY AWAY!", 
    "review_date": "2012-02-14"
  }, 
  "clsUcSMUxmlpdcvnVPLeoQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kongie V.", 
    "review_text": "Awesome pizza! Cheap reasonable and absolutely delicious!  Damn good when you're drunk.. yum! Just go try it.", 
    "review_date": "2007-07-15"
  }, 
  "rSMTp4LuRd3dQP91AfDUVQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Shouka S.", 
    "review_text": "Order the Castro Special!  Enough said.  No but really the Castro Special is so delicious! It's a chicken, spinach, and feta cheese pizza.   I came here after a night of drinking with my friends. The pizza was flavorful, fluffy, and perfect amount of crust. Best part was that it wasn't super greasy!", 
    "review_date": "2014-04-28"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "We love to snack along wherever we are, especially in a neighborhood we have not visited in the past.  After a jerk took our space from behind, we drove around again and eventually found an even better space - that's karma.  Anyway, we were a little hungry but didn't want to commit to anywhere until we see what's available.  Well, a slice of pizza never hurts and we'll be sharing.  There was only one person there and the tv was on.  While we looked, somebody else came in and we let them go first since we were undecided.  We got the vegetarian slice ($3.50).  We waited a few minutes for it to be heated but wish they heated it just another minute or two more.  The crust was crispy and the flavor was good but it was just warm so the cheese didn't pull, which is always the best part.  Anyway, I'm glad they have everything I like to sprinkle on my pizza - garlic powder, pepper flakes, Italian herbs, parmesan cheese and even black pepper.", 
    "review_date": "2009-04-22"
  }, 
  "pkQMZfTnd8O0kP4FA-wogA": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Lexie L.", 
    "review_text": "yes yes yes! late, by the slice, delicious specials. I got the castro special. It was SO good. thin but not too crispy crust. Hot. but not too hot. The pizza I've been searching for the past few weeks, FINALLY was in my mouth. the. best. walking. discovery. ever.", 
    "review_date": "2010-02-19"
  }, 
  "08kuNTVgJ1UUZF7QziNSLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shayenne G.", 
    "review_text": "Next to Cheese Board Pizza in Berkeley, Nizario's houses my favorite SF pizza.... The Castro Special = Chicken Pesto Cheese (i think it also has spinach). Sober or not, this pizza is to die for (unless youre a vegan or something, then ok).  Everyone I have steered over to this place has become addicted to the Castro Special... I'm hungry now.", 
    "review_date": "2009-06-11"
  }, 
  "r_C9dbTsrHx4bJTUSmfPZw": {
    "user_rating": 5.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "Courtney S.", 
    "review_text": "I was stumbling around with my two friends, enduring a MAJOR case of the drunchies, and happened upon this. No need to get crappy Denny's or anything of the sort. Long line, yes, but it went very fast. The pizza slice was so good that I had a second one, then proceeded to inhale it while hanging around outside and talking to other drunks. I'll have to come back when I'm sober... or will I? To be continued.", 
    "review_date": "2009-06-20"
  }, 
  "uDYNXKTd_cixNNfsyWg57Q": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Rose A.", 
    "review_text": "The Castro slice is so good!  Chicken, feta, &amp; pesto...yum!  The crust was pretty crispy.    This location is kinda small...just a few tables and counter space.  Good for a quick bite.", 
    "review_date": "2011-10-23"
  }, 
  "7rZRJ39tnQJmM3qRJI-zPg": {
    "user_rating": 1.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Dave F.", 
    "review_text": "These clowns need a geography lesson.  Apparently they don't deliver to the Duboce Park area which is no more than 15 minutes walk away from their store.  They told us to order from the Geary store which is 2.5 miles away.  When we called Geary, they quickly sent us back to this store.  When we spoke to the same guy again he said \"uh - i just got here\".", 
    "review_date": "2010-01-19"
  }, 
  "xWmGF0FR454IyoinQT0ciA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "Hands down best pizza I have ever tasted, great for after the bars any night of the week.", 
    "review_date": "2009-07-07"
  }, 
  "gLke-4oih1t7urvoQAENcQ": {
    "user_rating": 2.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Kevin L.", 
    "review_text": "I know it's like the ritual place to go since it's right by Badlands, Toad Hall, and the Mix, but honestly Escape from New York blows this place out of the water. The pizza crust here is way drier than it should be and the crust/topping ratio is off. Always a fat line too.", 
    "review_date": "2010-12-26"
  }, 
  "TEKb4zOkXW3YWjrpaPim6Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean H.", 
    "review_text": "I think that in the Castro you're divided in 2 pizza camps: Nizario's or Escape from New York.  My vote is for Nizario's.  Although they're never the friendliest at this pizza palor, you truly can't beat one of their slices  (especially late night after a evening full of drinking)!", 
    "review_date": "2011-03-28"
  }, 
  "lGNr8HxAbHfdHQr5Zs5GGA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura g.", 
    "review_text": "two stars for delivering after 1 am.  0 stars for pizza.", 
    "review_date": "2007-06-16"
  }, 
  "VgMS2eqBsxf6rxZIdgBqzQ": {
    "user_rating": 1.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "T.l. J.", 
    "review_text": "This place is a joke... the pizza is ok but the service is trash!! customer service goes a long way... and the mexican/ latin guy the have preparing the pizza is nasty... he eats food, touches on everything, touches his hair, then touches your food with his bare nasty hands... very unsanitary this is a health issue... God knows what he is putting in the food... the health department meeds to be called there are so many violations going on in this place... if I could give no star I would", 
    "review_date": "2014-07-05"
  }, 
  "O9uxbf6uADlls0qKcVMDwA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Ruth R.", 
    "review_text": "When it's 2am, and you've just left the club and are still kind of drunk, it's delicious. In retrospect, I realized it was kind of pricey. It was really good pizza, I'm just not sure if it was worth 4 dollars a slice.  It was cool that the huge line formed after we were sitting enjoying our pizza, but that was just pure luck.", 
    "review_date": "2013-05-14"
  }, 
  "7lzBryLgYEnQjSVkOtWZqw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C N.", 
    "review_text": "Great to eat after hours , fast service..good staff too. No bathroom as far as I know about it.", 
    "review_date": "2010-07-07"
  }, 
  "isBwyi6IcrotFDPjAG-MkQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rv Andrew V.", 
    "review_text": "Oh this place is awesome, workers are very friendly, now when i go to this pizza place i always feel special wahahah but anyways they serve food very fast and very affordable. And here is the deal they have a rest room heheh so I reccomend this pizza place for everyone....", 
    "review_date": "2012-01-01"
  }, 
  "-9lPrsNaYcsDT6LlLhr9TQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "David C.", 
    "review_text": "i have to say this is some good ass pizza by the slice...love the GREKO but it make's your breath hummen and crackn there aint no gum or mouth wash that will help you to get laid that night lol", 
    "review_date": "2010-10-24"
  }, 
  "cNkOnQxtoPmyAerDB6tFHQ": {
    "user_rating": 1.0, 
    "user_location": "Pinole, CA", 
    "user_name": "Vincent S.", 
    "review_text": "I went to have a pizza at nazario's on a busy night. A pizza bouncer was filtering the people inside of the place. He was overwhelmed and rude pushing people. The pizza slide was reasonable. Too much cheese and not cooked enough.", 
    "review_date": "2010-07-15"
  }, 
  "o_Grh1LXeVHITZf-0ZIK3A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott L.", 
    "review_text": "After nearly 3 months in SF and not having a single good slice, I'm on a quest to find a slice that would be considered 'good' in NYC. First stop, Nizario's.  The joint itself is nothing special (though it doesn't need to be) with limited seating and one counter. They only offer a few types of slices, including a Castro Special. Generally I like a smaller selection, which implies mastery of those items.  I got a slice of mushroom, and was generally underwhelmed. The crust is french-bread style and the sauces/cheese was not memorable. The slice also wasn't re-heated to a good temperature, so it was cool by the time I finished.   Won't be returning, onto the next place.", 
    "review_date": "2013-07-31"
  }, 
  "QYUNetsQHuSapDl3ceJ2Wg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisbeth O.", 
    "review_text": "so this IS related to the Nizario's on Geary.  I always wondered.  They seemed too alike to not be related.  Anyway, yes, good basic choices, cheap, and FAST.  And there are always 3 dudes standing around at the register like the one on Geary, too.  This is basically a Castro version of the Geary NIzario's --- here, you'll find they play house music over the speakers, and they have a TV that plays movies that may possibly have a GLTB theme.    Just like the other Nizario's, this place has a giant mirrored wall on one side -- so you can drunkenly observe yourself and everyone else chowing down late at night.  Hot mess.  Love it.   This place could stand to have way more chairs and maybe one or two more tables.", 
    "review_date": "2009-05-19"
  }, 
  "RFTVBFlgM0cqvl1daywfjQ": {
    "user_rating": 5.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Danielle B.", 
    "review_text": "I'm gonna be honest when I say that I've only ever been here when extremely drunk, but who cares? Each and every time was memorable, and their Greko pizza is love, I can keep eating and eating... I've been meaning to go when sober, but then it may lose it's appeal.", 
    "review_date": "2007-12-24"
  }, 
  "VJHeIGEWeUEnnmDn6k3IXg": {
    "user_rating": 4.0, 
    "user_location": "Laguna Beach, CA", 
    "user_name": "Rico O.", 
    "review_text": "Nizario's is \"Old Reliable\"... always great slices of pizza (my favorite is The Castro Pizza) and open 'till late.  The style of pizza they serve definitely isn't Neapolitan, Chicago nor New York.  I guess they're better described as, for lack of a better description, \"Castro Style\".  The crust is technically a thin crust, but a bit on the thicker, breadier side.  The ingredients are top notch and the cheese doesn't run oily at all (a sign of good quality).  You know you just had a good slice of pizza when your paper plate isn't completely transparent at the end of the meal.", 
    "review_date": "2010-04-05"
  }, 
  "R5lhVvcJ7tNx9-Pe2-j8Pg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Brian S.", 
    "review_text": "A night of hella drinking and dancing in the Castro always ends with me at Nizario's eating hella pizza.   I love Nizario's. The Castro Special is definitely my favorite. Spinach, chicken and pesto never tasted so good (while drunk).  I love the crust, and I feel the amount of sauce and cheese is perfect.  This is such a dangerous place. First of all, I always manage to get too drunk when I'm in the Castro, and as soon as I see Nizario's I end up eating too much pizza, resulting in a very shitty morning.    I do have to admit my favorite thing about this place is the music. They're ALWAYS bumping some crazy ass house, techno and electro. The music here is better than at most of the clubs. I can't help but dance if I'm eating inside.   Oh, and if you're chilling at the Mix across the street, feel free to go across the street, get a slice of pizza and eat it at the Mix.", 
    "review_date": "2010-06-23"
  }, 
  "8Z9ugoA4MGwiJVh-CB8bhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Esther A.", 
    "review_text": "Both times my slices were fresh from the oven. I waited a bit as he was preparing the new pizza but the wait was worth it and quicker than I anticipated.   Pizzas by the slice is always great. Especially when you get the craving and the idea of ordering a whole pizza seems overwhelming because no one is there to share the pie with you.   The pizza is thicker than Marcello's which is more of the floppier NY style but I liked Nizario's crustier slices.   Stays opened LATE which is nice in a city where most everything closes up shop by 10-11pm.", 
    "review_date": "2014-02-06"
  }, 
  "qsPY-gad9ZN4_CaOf--RkA": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Christina G.", 
    "review_text": "CASTRO SPECIAL.    the perfect nightcap to hours of dancing your ass off.  the end.", 
    "review_date": "2009-01-06"
  }, 
  "7HOBCw1pTaZU5qcqwwNy3w": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Patrick T.", 
    "review_text": "Visiting family and in town for a couple days  Stopped by here on the way back to the hotel. Really good pizza and cheap too (considering how expensive SF is). Tried the pesto and pepperoni pizza. LOVED the pesto, wish there was a place in Vegas that had it. Great hole-in-the-wall vibe with partiers from the neighboring bars coming over to grab a slice. If I lived here I would be back often.", 
    "review_date": "2010-11-25"
  }, 
  "Hum8GWIBL9jOXWmwFgQghA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shane W.", 
    "review_text": "Best. Pizza. Ever. ... or at least my favourite. Always the place to go after all the bars close. The night is over once you have a slice of the The Castro Special... a night without it gives you the hangover, not the alcohol. You might have to dance a couple of hours beforehand to prepare for the calories, but who cares... it's like coke for your mouth... but it's not something you need rehab for (cuz I said: \"no, no, no\").", 
    "review_date": "2007-10-26"
  }, 
  "NXEb4010qAiLVEZj02PDGw": {
    "user_rating": 4.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Diego S.", 
    "review_text": "If you get drunk in Castro on a Fri/Sat night, your inner compass will point you towards Nizario's.  These guys get put through the ringer with people being MESSY so try to be nice to them when you go.    Good pepporoni pizza...avoid the hawaiian though.  Too many of my friends have gotten the runs from eating it. Not sure why.  Nizarios is also a good place to pull yourself together before going home (either alone or with that special friend you made an hour prior...the insanely bright lights can snap you back to reality).", 
    "review_date": "2007-07-22"
  }, 
  "9cZhf2e7TVQ9S5PC9itvzw": {
    "user_rating": 3.0, 
    "user_location": "Napa, CA", 
    "user_name": "Jeff P.", 
    "review_text": "Shortly after moving here from NY, I went bar hopping in the Castro with a friend who had moved here from NY less than a year prior.  When we left the last bar sometime after 1 am he turned to me and said \"Ok.  Now is when all the boys head over to Nizario's for a slice.  Their pizza's really good.  Just like home.  You'll like it.\"  Cool.  So we head over and get in line with hundreds of other homos needing a slice or two soak up the alcohol in our bellies.   After the first bite I turned to my friend and said, \"When was the last time you were home?  This doesn't taste anything like New York.\"  Basically, the dough is just really thick.    But, no, I am not going to write another \"why can't anyone make NY style pizza in SF?\" review.  I've given up and accepted it.  And its all good.  The same friend who introduced me to Nizario's also taught me this valuable lesson, \"Jeff, this is not New York and its never going to be New York.  So, the sooner you accept it, the happier you are going to be here.\"  He was so right.  And, now, I love it here in San Francisco and  no longer expect to find NY pizza here (although I feel that Arinell &amp; Marcello's are the closest).  And, that's okay.  What I do love about Nizario's is that their pepperoni is usually well done, just like I like it.", 
    "review_date": "2007-10-21"
  }, 
  "k3HW9bpJujFi8bdj2NFYBQ": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Geetika A.", 
    "review_text": "This place use to get 4 stars because it use to be open till 3 on weekends and 2 on weekdays, hence between 2-3 am on weekends it would  turn into club nizarios, and id always stumble home at the end of the night with a good story.  I haven't been back as much since they changed times, but they serve up a decent slice of pizza (ive been spoiled by NYC visits sadly). If you're in the neighborhood and craving pizza, this is the place to go....try the cheese/castro special.", 
    "review_date": "2007-10-31"
  }, 
  "S3gNrUh7N9oWoackKlHGMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marcus C.", 
    "review_text": "Because I try not to eat solid foods on weekends, I only ever end up eating the pizza here when I'm drunk.  I do enjoy the Castro Special!  The Castro IS special!  Special!  Special!  YAY!!!", 
    "review_date": "2006-09-21"
  }, 
  "dWeyBRKKcoY0pWqhwzXiGg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alo A.", 
    "review_text": "There is no better pizza then the Castro Special.  I will come here all the way from Oakland just to get my fix.  AND for entertainment purposes this is the place you will find all the skinny gays shovel food in their face at the end of a long night.  Gaurantee you will find all these skinny bitches eating like it was their last meal at 2am.  lol  It's definitely a site to see :)", 
    "review_date": "2010-10-08"
  }, 
  "AO21iJAApF7mIfB6YetjOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "eric i.", 
    "review_text": "best pizza in the castro, by far!  maybe best in the city after goat hill.", 
    "review_date": "2007-02-24"
  }, 
  "u8N1deNIiTm-dLJKf7oVDw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J D.", 
    "review_text": "Alright, the pizza is mediocre at best. I have definitely come here several times because my friend lives a couple of doors down and when you've had a few adult beverages, convenience is key. Meh...it's okay.", 
    "review_date": "2009-12-29"
  }, 
  "CDap0lATTsXsRzTe7HYK-g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "It was ok.   It is a very bready pizza without much sauce--not really my fav.   The pizza was also quite late. I was starving by the time it got here, but it still didn't make it a great pizza.", 
    "review_date": "2009-05-20"
  }, 
  "ggl6fl-PM5O1WrdReL0l4A": {
    "user_rating": 3.0, 
    "user_location": "Boston, MA", 
    "user_name": "Michael C.", 
    "review_text": "Stop by for a slice of drunk pizza on a Thursday night. This slice was different than the ones I usually find in New England. It wasn't quite thick crust but wasn't thin either. Solid slice if you are in the area.", 
    "review_date": "2013-09-08"
  }, 
  "eOVZKDzyFMDKWJnI45oWOg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "Really? 4 stars? I guess drunkies like anything you put in their mouths. Pizza here is A-okay. Wayyyy too oily for me. I 've soaked 4 napkins of oil from a slice of pizza.... I just ran out of napkins to soak some more.", 
    "review_date": "2009-11-04"
  }, 
  "x5VNOhKG-h7kraIPjwnAfw": {
    "user_rating": 4.0, 
    "user_location": "Studio City, CA", 
    "user_name": "Leslie K.", 
    "review_text": "Two words: Castro pizza. Yes please!  Okay so I guess more like four words.   This was the perfect end after a night of dancing at The Cafe. My friends got the Hawaiian pizza which was also pretty amazing. There weren't any chairs inside the restaurant and I didn't like the idea of standing after my feet were dying from my shoes, but i got over the pain pretty quickly cause the pizza was just that darn good.", 
    "review_date": "2011-04-17"
  }, 
  "GmqtrGT0VJV6vdicmy-qdA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jose R.", 
    "review_text": "I like the fact that it's open really late on any given night. The only pizza I would recommend here is the \"Castro\" pizza. If you want anything else, I'd recommend another pizzeria somewhere else.", 
    "review_date": "2010-12-13"
  }, 
  "Rl0dFlPpZCE0s7uOxJMEOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "Pizza pizza pizza pizzzzaaa awwwwyeah.  Despite the fact that I had already eaten dinner that night, my friends convinced me to indulge in some pre-drinking foodies. I just can't say no to pizza. Especially not Nizarios.  Mmm pesto.  And they have more than just the typical cheese and red pepper shaker.  They have garlic!  Noms.  Perfect thing to avoid drankin on an empty stomach, and also conveniently within stumbling distance of the bars of the 'stro for when you're not in the mood for a dirty dog at the end of the night.", 
    "review_date": "2014-02-02"
  }, 
  "dP2vQRFB0xK5bD-aCGZM1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda N.", 
    "review_text": "so good after a crazy night out...one slice is all you need. =)", 
    "review_date": "2010-05-02"
  }, 
  "Z4Fkz0ET2vqvjr-Cijo9Tg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "I don't know what it is about you Nazario's...I wish I could quit you. I really wish I could.  Actually, I don't. I love you too much. Always quick and tasty. Love me a Castro Special. And when I feel sassy, I'll add a slice of Greek pizza and have that. And once, when I was REALLY sassy (more like a fat-ass) I added a cheese slice to all that.  Pretty good pizza, always friendly folks. Never had any complaints with this place. :)", 
    "review_date": "2008-04-14"
  }, 
  "9Bq09meTAggWpjIsier7iQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Brian C.", 
    "review_text": "Not bad, and it's open way late which is great for the clubbers out in the neighborhood! The pizza was not bad, I had the Castro Special, definitely better with some alcohol on board.   Not a ton of seating, but it's great that you can take a slice, stuff it in your face, and head back out!", 
    "review_date": "2012-12-09"
  }, 
  "IH1iOatR3UkGxuiZVD4Xqg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron W.", 
    "review_text": "It's a pizza slice place, y'know? Kinda dirty, next to Midnight Sun. The Castro slice is the way to go. They are fast. The crust is on the thicker side. I think it rates up there with Marcello's. One slice will be enough.", 
    "review_date": "2013-07-01"
  }, 
  "0gEDwhSUIWIBz23MbLYMig": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Luis M.", 
    "review_text": "After the salty craving and after the sweet craving there is the *I durno but I just want to keep eating* craving.  Pizza was the food item of choice.  Our first choice, Little Star on Divisadero, was closed!  The runner up, Patxi's Chicago Pizza...CLOSED ALSO!  Oh lordy lordy.  And so it was that we ended up at Nizario's.  There is nothing wrong with Nizario's Pizza.  Nothing at all.  It's good pizza.  I mean, much like a blowjob, pizza can never be that bad even when it doesn't make your toes curl and eyes roll back into your head...", 
    "review_date": "2007-09-04"
  }, 
  "u6h6xb9_F8zWxQZfH14cKA": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Maybelline C.", 
    "review_text": "Best Late Night Pizza Ever!!!! I heart their Castro Special.  It's their signature with pesto, feta, spinach, and chicken.  It is delicious.  I've tried their other toppings, but the castro special is truly something unique.", 
    "review_date": "2009-02-08"
  }, 
  "iF-Nz3c7ickNeCBx0Ha8mA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "F B.", 
    "review_text": "Once I was drunk at Tacoria Cancon in the mission, and hopped a cab all the way to Nizarios for a slice.  I have a problem. I am in love with a pizza place. How am I going to break it to my parents?", 
    "review_date": "2007-02-03"
  }, 
  "yR-6YxGdgNJTBfJtQ5CmRw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "X X.", 
    "review_text": "I love this pizza when I am in the area. This place stays open late and is located in a busy area of the Castro.This place is very small if you plan on wanting a sit down probably not the best place, although there are two small bar tables inside. The guy in at the registar is usually nice, I am sure he has to deal with a lot of drunks and partiers at 1am from the local bars there. When I am in the mood for pizza after a night out I make my way here to Nazario's. I have been to the Geary location and did not like the pizza there nor the service. Hey it's open late night and they have decent pizza for both when your drinking or not.", 
    "review_date": "2012-05-21"
  }, 
  "xp4qD7Ol1vsS3BQdLwPMnw": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Ish A.", 
    "review_text": "The best pizza I've ever eaten. I drive all the way from the east bay just to eat here. Love their hawaiian pizza.", 
    "review_date": "2010-01-18"
  }, 
  "00xij_Pk8lDzaMubY7AxSQ": {
    "user_rating": 4.0, 
    "user_location": "Willits, CA", 
    "user_name": "Chi chi R.", 
    "review_text": "The go to pizza!  The Castro special is quite possibly one of my favorite pizzas!  Always consistent! Tons of spinach, pesto, feta, chicken, not too much cheese, solid crust! Open late,  free delivery!  Yum!", 
    "review_date": "2013-11-14"
  }, 
  "4Wgn81oVidD4puNDiqqN9A": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Wendy T.", 
    "review_text": "My stomach is growling just thinking about this place!! You gotta try the CASTRO SPECIAL!! Its a small little pizza joint not the cleanest place...but decent enough..the pizza is well worth it! Good place to go to after a night of dancing and drinkin!!", 
    "review_date": "2008-12-15"
  }, 
  "g8yxr3YCpoqK17n5gGjhFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erik N.", 
    "review_text": "great pizza by the slice!   I've lived in SF off and on since 1998.  Mostly in Castro and Haight so I've had my share of pizza by the slice places.  This is one of the best!  Def a fav of mine.  Open late.  Doesn't take long even when the line goes out the door!", 
    "review_date": "2010-05-25"
  }, 
  "76vIFZcC7owykCBjMfGVXg": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Amy D.", 
    "review_text": "3.5 stars but rounding down since they did NOT have sausage pizza available.. in the CASTRO!! However, the slice of Cheese Pizza ($3) I had was good- nice and cheesy, and still so hot it burned my mouth a bit despite giving it time to cool off. Service was also super quick. There are a few counter seats available inside, and plenty of sidewalk space to stand outside and eat as well.   Overall, a good spot to go after drinking in the Castro, but they need to add a sausage option! Parking is difficult in this area, but street parking is available.", 
    "review_date": "2014-06-27"
  }, 
  "eSdQJJx3s-4uKS9ofr0zhw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice E.", 
    "review_text": "I love you Nizaro's.  After a fancy shamncy meal across the street at Poesia.. in which I was not fully satisfied.  I ordered a slice of the veggie pizza to go.  The husband ordered a plain cheese.  It totally hit the spot.  It was only $6.25 for both slices..   The pizza at Nizaro's has the perfect amount of cheese, sauce, toppings and bread/crust.  If I could choose, I would guess Nizaro's would be better then Seniore's possibly because its healthier; less crust = less calories?  Not sure hahahaa.. but I'd pick Nizaro's regardless.  It was pretty tasty.", 
    "review_date": "2011-06-06"
  }, 
  "Q2Iest8oggBub6nVBFEcNw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes M.", 
    "review_text": "Castro has no shortage of grab'n'go pizza places, that's for sure.  Methinks it may have to do with providing fuel for the bargoers (the fact that Nizario's hours are 3 PM - 2 AM is another clue).  Of course, I'm unlikely to be drinking the night away in these parts anytime soon, so I stopped in on a weekend afternoon instead.  And boy is this place barebones, even by the standards of its kind (3 2-stool tables and a standing-only counter).  So while I prefer to eat sitting down, I think you'll really enjoy the pizza more while strolling down some victorian-lined street nearby.    But anyway, the important thing is the pizza itself.  First, kudos on the Castro Special--a chicken-pesto pizza that doesn't overdo it on the pesto.  Crust could've been pillowier, though.  Oh yeah, and it needed to be hotter.  Overall, it beats Marcello's but not Escape From New York, although if I'm going to EFNY might as well go to the Haight.  The real question is whether the Richmond Nizario's is any different--it's farther from home, but some of the reviews suggest the quality is better, and at any rate I'm far more likely to drunkenly stumble by it some night.", 
    "review_date": "2008-06-24"
  }, 
  "sslHnbTuz4wuzmr9wfHBaQ": {
    "user_rating": 1.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Bill L.", 
    "review_text": "Not sure what changed but I won't be coming here anymore. Was there an ownership change ?  Staff is different and not friendly. Never have the slices I want and  it doesn't taste as good. Good thing there are other options.", 
    "review_date": "2014-08-27"
  }, 
  "NllQTAcOxViUBQL-bIPGQg": {
    "user_rating": 3.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Kevin J.", 
    "review_text": ".", 
    "review_date": "2011-01-26"
  }, 
  "B-mbvdc8jAGMRJEJ088rzQ": {
    "user_rating": 2.0, 
    "user_location": "Brookline, MA", 
    "user_name": "Avi H.", 
    "review_text": "I was drunk and it was OK.  Marcello's and dare I say it Escape from NY are better.", 
    "review_date": "2007-09-30"
  }, 
  "bUgnpT487CPh3v2QUViAUg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "carlos f.", 
    "review_text": "It's a perfect place to get some pizza after leaving the bars on Castro late at night. Try the \"Castro Special\", you will not forget to order it again next time. Frindly staff; no snobby guys assisting you like the other pizzerias around the neighborhood.", 
    "review_date": "2008-07-06"
  }, 
  "vXrUBAIN4aoCt7F5p0kU_g": {
    "user_rating": 3.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Michelle C.", 
    "review_text": "This place is open almost like a 7-11.  I have no clue what time they close down?  But after going to the bars, my friends wanted to come here to have the pizza soak up the booze action.  Prices were about $2.75 and up per slice.  But I didn't think the pizza was all that great.  Kind of bland.  Oh well, good to know if you need to grab a bite to eat after getting your drink on in the Castro.  Ca$h only!", 
    "review_date": "2011-02-01"
  }, 
  "qkelo15wZAzyC_lPB5ODkQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kristina N.", 
    "review_text": "The pizza here is great! I had the Castro slice and it was very flavorful and greasy. I'm sure this place gets very busy during after hours.", 
    "review_date": "2013-01-03"
  }, 
  "pWl131xflJTixSc-q4tPZQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Toby V.", 
    "review_text": "We used to like Nizario's.  A lot.  Then they got rid of the combo that we liked the best, but worse yet they cut back on their pepperoni.  Nizario's is not the only guilty party here unfortunately.  Would it kill the 3 by-the-slice pizzerias in the Castro to put more than a hint of pepperoni on their pepperoni slices?  It's like a race to the bottom - each has less pepperoni per slice than the others.  I don't know yet if this is a San Francisco-wide phenomenon, or just collusion by the Castro by-the-slice pizzerias in wringing the last few pennies out of the Castro partiers and ignoring the people who live in the area who would gladly pay more to frequent a local establishment that puts more than just a courtesy dash of pepperoni on their individual slices.", 
    "review_date": "2011-12-30"
  }, 
  "26M4SlyVW9RCXuoWH8xJgg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon B.", 
    "review_text": "Ah yeah, pizza fan I am! There is nothing like a nice fat slice of pizza late at night after an evening of alcohol and music. Short and simply put, the crust was perfection: thick and doughy with a crisp crunch on the outside. The cheese ever so melty and gooey and what else can I say except I took that slice all the way into the emergency room, that the check in nurse looked at me all crazy. Yes, it was that good. About the e.r., that's ahem... another blog.", 
    "review_date": "2010-02-16"
  }, 
  "PadmV2GEoA6mWpQUpPh7Ig": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Monica F.", 
    "review_text": "For some reason..... Their greasy, big slice of pizza was suuuuuper duuuuper good after shots ot tequila. Yes.  My friend got a pepperoni, and i took a bite. I had no intentions of getting my own..but after that bite....i walked up to the counter right away and got my own slice of cheese pizza.  It was good. And cheap.", 
    "review_date": "2011-05-17"
  }, 
  "kf09a_ZEHAUNfj5eymRoVg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roman R.", 
    "review_text": "Delicious, open really late, kind of greasy but just the right amount, cheap and always an interesting crowd to watch -- what is not to like? afterhours pizza was made for Nizario's.", 
    "review_date": "2007-11-26"
  }, 
  "0K2eqWTbS-YevwvlJXTUzA": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "La H.", 
    "review_text": "OK . So walking into this place at 1 am with my Good friend Georgie after a crazy night on the Castro .. I have discovered one of the BEST slice of Pizza Ive ever Ate!!!  I ordered a CASTRO only in thru Frisco Fashion  and It was EFFIN perfect !  Sprinkled a lil Cheese and a lil Pepper and Bada Bing Bada boom!  It has Pesto Chicken and spinich and Hella cheese !  most defiantly going back REAL SOoOon! payed 9 bux 4 two Slices and 2 drinks Over all Very cheap!", 
    "review_date": "2010-07-30"
  }, 
  "CNw5B3BBhTbOlrOlS1meEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael R.", 
    "review_text": "This is the best pizza in the neighborhood even if you're not a drunk.", 
    "review_date": "2006-03-07"
  }, 
  "fVUQ985lDk6CDYMYioi7cw": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Sonny G.", 
    "review_text": "A great little hole in the wall pizza joint.  Fresh slices always ready and never more than a 2 minute wait.  Friendly staff and they are open hella late.", 
    "review_date": "2014-12-22"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "In the business world there is a saying:  \"Good, Fast, Cheap.  Pick two\"  Nizario's is fast and cheap.  I'll let you all figure it out.", 
    "review_date": "2006-01-11"
  }, 
  "Nj52Bnbar3NzZ10cgQnvWQ": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Jason M.", 
    "review_text": "If I could live anywhere in the world, it would be the Castro... at Nizario's Pizza!  This place is delicious and the guy who I order pizza from is always so nice and sweet.  The cheese pizza is good, but don't feel afraid to try their specials - I've had them before and they're pretty good.   Best to have when drunk. The grease and alcohol in your belly makes for a good combination.", 
    "review_date": "2010-07-11"
  }, 
  "1UvbpnVORMOEm4LJ194lMw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hope S.", 
    "review_text": "Ohhhh ,I can not pass by without going in &amp; getting a slice of pizza, delicious ,,,great staff good service.", 
    "review_date": "2013-06-15"
  }, 
  "fyTNJNGgCgn2fH3Tvr-YaQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alejandro M.", 
    "review_text": "I love the pizza here but the fact that the middle eastern dude keeps looking at me like s piece of meat...fuck himn", 
    "review_date": "2014-04-20"
  }, 
  "M0qZtwB55-0NsO805CHBrg": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Lucky M.", 
    "review_text": "I love this place!!! Was there at 1am still open. Pizza was hot and fresh.  Not many tables inside but that's ok I don't mind the fresh pizza scent :)", 
    "review_date": "2012-11-03"
  }, 
  "R6oLlIqXNjcwZVwNzSwp1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard C.", 
    "review_text": "Just moved back to the city and all I can say is \"YUM\"  Many times has this little joint been the after party of the midnight hour.  And after enough trips to the front of the line, i already know the drill... \"Castro Special!\" So Good, perhaps not the healthiest, but at that time of night, it's not like anyone is looking to watch their waist line. I'm a Fan!", 
    "review_date": "2009-01-21"
  }, 
  "frkxMUXg5xqGDPNZ8SaZjQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Napoleon R.", 
    "review_text": "This is one of my favorite pizza places in San Francisco, which is saying nothing since the pizza is so bad in this town.  My girlfriend says that it reminds her of the pizza you got in middle school.  I kind of like it though.", 
    "review_date": "2007-01-01"
  }, 
  "gBKyfG3Po3ZonmPv6ILldQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Torrnado T.", 
    "review_text": "what is delicious when you're stumbling drunk after a night of drinking and in search of something to coat your stomach and slow the absorption of alcohol does NOT translate to delicious, quality pizza when you're ordering for a party of 8.   i paid $43 for two large pizzas that you could easily count the sparse amount of toppings. i won't be making this mistake again.", 
    "review_date": "2011-09-14"
  }, 
  "Rihux4oGUzOq3LoCKwkgXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dylan D.", 
    "review_text": "I wont repeat what everyone else has said about this place as I concur, but this place is also good delivery!  For those who like one slice, imagine a couple large ones for a party.  SO goood!  Sometimes I wish I were sober when I eat there because then my taste buds would actually work!  Castro special all the way.", 
    "review_date": "2006-06-19"
  }, 
  "DZmO1K9s8ZaDiX1UHA8FwQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brad V.", 
    "review_text": "Slices in house are tasty-I ordered a family size super combo last night and recieved it within 15 min.- I tipped the driver $4.50 paid $28.50 for the pizza and ended up throwing away most of it. nothing like the in house. I will never order or go back to this pizza store!", 
    "review_date": "2014-04-06"
  }, 
  "Gl0F_kAfOamLtquy7P1hdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caleb D.", 
    "review_text": "I went there sober the other night for the first time and the pizza was STILL wonderful.  Also, the guy who works at the register said \"it's nice to see you again\" which i guess makes me a regular, and I'm totally into being a regular at a hole-in-the-wall pizza place.  However, one night last week some friends and I ordered a pizza for delivery and there was way too much sauce for my taste.", 
    "review_date": "2006-11-29"
  }, 
  "RFFPYEMmjWSyXgjVYU2kDw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ryan F.", 
    "review_text": "45 minutes exactly for delivery! At least for the past five years. Great group of real Earthy San Francisco style people running the joint. Nizario's Pizza is the place to be after the ugly lights come on in the Castro and alcohol has stopped flowing. Castro special is truly special.", 
    "review_date": "2008-01-24"
  }, 
  "_50qkmXiYpTILxH6gh4hOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mitch a.", 
    "review_text": "After a few drinks this place is perfect!  Awesome hot pizza and very reasonable.  Try the Castro Special Pesto pizza. It's Awesome!", 
    "review_date": "2007-12-20"
  }, 
  "q6J0RrdafRqkxR_ffONHcQ": {
    "user_rating": 3.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Mya M.", 
    "review_text": "Not much selection, but the pizza is good for the price. The Castro Special is probably the best thing to get, other than that the pizza is OK. Not somethig i would go out of my way for.", 
    "review_date": "2012-08-13"
  }, 
  "v1UYVpOeiMd4wWgD1Fu0Fw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maveric V.", 
    "review_text": "nizario's vs. marcello's.  the never ending battle of \"best pizza place in castro.\" (i'm not even acknowledging escape from new york. sorry guys.)  while this debate may never be settled, i personally have always preferred nizzy's. they just have better crust, toppings and marinara sauce. period period. and nothing in the area compares to nizzy's castro special.  now, if only i still allowed myself to eat carbs...", 
    "review_date": "2009-06-25"
  }, 
  "BVKJF0OYYy9uqOEmEL37bw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt V.", 
    "review_text": "I think I've been here...really...I mean, there are many fuzzy recollections of me walking through the doors...then leaving feeling totally full and happy.  I think I remember ordering the Castro Pizza...I think it was really good.", 
    "review_date": "2008-01-13"
  }, 
  "DObB0OeZFzTsYGpoB8ohQA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryna M.", 
    "review_text": "My search for good pizza in San Francisco continued at Nizario's, but alas has not ended at Nizario's.  Far and above Marcello's with a passable pizza crust and good topping combinations.  However they load up on the cheese, skimp on flavor in the sauce and just seem to be missing something else.  If memory serves, they also have a TV and that's a definite \"No No\" in my pizza prize criteria.", 
    "review_date": "2006-07-08"
  }, 
  "uQ4ukgdAE2Eg-IKwhUNMiw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian S.", 
    "review_text": "First off I will preface this with saying the only way to truly enjoy this pizza is when you are bombed and I have only had Nizario's when on booze control. I am afraid to try it when sober because I have a feeling I will realize that it really isn't that good and in fact might suck. So to prevent that from happening I will stick to my stopping by while drinking. So when in the Castro and drinking and you need a slice to help with the hangover looming on the horizon it is highly recommended. The service their is very appropriate for the neighborhood get-in get-out with a hot sticky something in between... the pizza silly", 
    "review_date": "2009-02-26"
  }, 
  "XD7g8XBBWEqk-m9eaUog2Q": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Veronica W.", 
    "review_text": "Suffice it to say, the majority of my experience with this place has been when I'm completely hammered off my ass. And every time I come, I have to wade through the sea other other drunkards only to stumble up to the counter and have the dilemma of my life in choosing what type of pizza I want. What I think is great about this place is that no matter what, they will always heat your pizza for you. This is in stark contrast to Pizza Orgasmica, where you have wait in an endless line in a super hot entry way only to be served a thin, cold slice of pizza where the cheese oils have created a congealed layer of disgustingness. (Side note I don't understand why every one raves about that place; the pizza is pretty crappy, particularly if you've had to endure the throngs of drunk, obnoxious Marina-ites in their infinite line). Nizario's is fast, their dough is good (doughy in the middle, slightly crisp on the bottom) and their prices are quite average, which is fine.   Now, I thought that this was simply a drunken revelation; warm, gooey pizza is always delicious when wasted. However, last night, I was shown that this place is pretty damn good sober. Maybe it was because I was starving and had had a really shitty day, but nevertheless, it was yum. And, for the first time in my experience, it was empty. I guess all the drunks were waiting until later to invade(although, it was already near 10). Try the Castro special: spinach, feta, chicken, and pesto. mmmmm. Or the super combo, which basically has everything on it. I'm not saying this is the best pizza in the world, but it hits the spot when you need it. Major plus: the people working there are super friendly, even when you're near belligerent.", 
    "review_date": "2007-09-27"
  }, 
  "qhGUtlMKxDkiNHg0xkkj3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adrian N.", 
    "review_text": "i'm drunk...and just had their combo slice.  FIVE stars.  greasy, salty, tasty, cheesy, and perfection.  I'm drunk.", 
    "review_date": "2006-11-03"
  }, 
  "4yPN4zgIGTtOT9EHXscEvg": {
    "user_rating": 4.0, 
    "user_location": "Lodi, CA", 
    "user_name": "shannon w.", 
    "review_text": "I love Nizario's Pizza Drunk, Sober, I love it! always yummy I've never had anything to complain about, well except for maybe the employees their not exactly \"friendly\" but then again they're also usually a little to busy to be up and personal with customers. I never really sat down and ate IN Nizario's, but during the day looks like they have a few places to sit and eat, night time always to crowded to tell, but loooove the pizza!", 
    "review_date": "2011-04-17"
  }, 
  "8FfjI-7L7lXYYL19mwV9IQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron L.", 
    "review_text": "Castro pizza is a very personal thing. Between Marcello's, Escape from NY and Nizario's, everyone has their favorite. (Guess which one isn't mine?)  Most of us eat it when we're blitzed in the wee hours of the morning, and Nizario's has the benefit (or rather, the strategy) of being open later than most. I've been here many times, and while the pizza is decent, it just isn't my favorite in the 'hood. The crust is so doughy, and the per-slice price isn't really that great of a deal.   Four drinks in I'll eat here in a pinch, but at that point it's not really about getting great pizza, is it?", 
    "review_date": "2011-01-04"
  }
}