{
  "ClfTr5vDDFPVzXv1OisH1g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy T.", 
    "review_text": "Came here with 3 friends on a Saturday night. Loved the look of the place when I walked in. We hadn't eaten dinner, so we each ordered a \"sharing\" plate as our entree, as well as a few smaller dishes as appetizers. They were sold out of brussel sprouts.   GOOD 1) DECOR: Retro/hipster vibe.  BAD (everything else) 1) AMBIANCE: Terrible acoustics and an awkwardly large 4-person table made it impossible to hear the person sitting across the table.  2) PORTIONS: Besides the poutine and the mac n cheese, the plates were not actually sharable. My husband could have eaten both the lobster empanadas and the pork belly by himself, in 2 bites each. Instead, to make the food last longer, we cut it into a million pieces. Yes, we could have ordered more, but see the next bullet.      3) PRICE: $18 for lobster empanadas, $16 for the pork belly, $12 for poutine (aka - fancy french fries).    4) FOOD:  * Lobster Empanadas: No flavor. Or perhaps there wasn't enough empanada for me to taste the flavor. Who knows?  * Pork Belly: Fine, but nothing special.  * Poutine: The \"cheese curds\" were like chopped chunks of supermarket cheese, and not a particularly tasty one at that.    5) SERVICE: Waitress took our food away without asking whether we were done. (I wasn't!)  Despite a hefty tab, we all left hungry, and I left vowing never to return.", 
    "review_date": "2013-11-19"
  }, 
  "4ayHp_rg2FVKpcl5FuTSWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie N.", 
    "review_text": "Atmosphere: small intimate, with lots of seating at the bar or on the couch.  Prices: great during happy hour, $6 beer &amp; $7 wine  Crowds: mixture of tourists and local  Hayes Valley is one of my fave parts in the city so of course I couldn't pass up a chance for happy hour here.  The lounge has a small intimate feeling which is great for conversations.  Our server was friendly and attentive but not overly annoying. Overall, great spot to come and unwind after a long work week!", 
    "review_date": "2013-07-21"
  }, 
  "8b9GJsvhIfbyLRyFTbIUqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Not what I was expecting - in a good way!  Film noir theme, but more old-timey and less gothy.  Great HH.", 
    "review_date": "2013-05-27"
  }, 
  "wA0LB_5VK1vCeanEp_xfNg": {
    "user_rating": 1.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Yodlee Y.", 
    "review_text": "Hi, I live so close but not a fan of them. Walked in to have a glass and then was ignored for so long I left.  Granted, I was not dressed to impress but I was just stopping in for happy hour which they proudly boast outside. I don't need their snobbishness for a glass of good wine. There are plenty of other places to satisfy my craving. Feel sorry for them because they won't be getting my business (and again, I live 2 blocks away and love wine:) )  Plus, they often close the whole place for private parties so you can't rely on them to be open to the public. Blah!", 
    "review_date": "2013-12-20"
  }, 
  "RCKdmKDZRd-RovZVtNSCLA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Garett T.", 
    "review_text": "Was very cool seeing a B&amp;W projection of \"The 39 Steps\" in the Film Lounge in back of this place tonight! Having a glass of Vouvrait bubble from France while discussing various topics with my other half was both refreshing and relaxing. Heard Coldplay in the background as our order of prosciutto and melons arrived.  Did see a piano in here -- would be lovely to hear it played. If young people shouting nearby would not be using the F-word so often tonight, I would be in heaven!", 
    "review_date": "2014-08-02"
  }, 
  "yxP4e2OmDG0B-m0DKRgQeA": {
    "user_rating": 2.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "April R.", 
    "review_text": "I love the ambiance, however, they will never close the doors so it is freezing inside.  All the patrons are in coats and scarves.  When I asked to close the door, one of the workers was super rude and wouldn't allow me to close it.  The bartender was nice though and switched the doors for me.  Cool bar, literally.", 
    "review_date": "2014-01-04"
  }, 
  "hLZhIcq9qupYTeW5FHInEA": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Ryan M.", 
    "review_text": "I'm probably a lot luckier than premiere Cherylynn N., when it came to checking this place out. *cue Pharrell's Get Lucky song*  Sure the spot represents the swanky digs of the Hayes Valley community. Think Piedmont with a little more hipster thrown around I guess?  Anyway, the lady wanted some wine and it just so happens the Yelp app suggested this was the only place open on a Saturday at 4pm (most places opened around 5pm).  Sitting down at the Bar we meet Chase, the guy that probably keeps all the H.V. ladies on their toes. A very personable guy who's coasting through life as a bartender in the industry. When I asked fellow waitresses their impression of him, a blush or two seems to be the response.  He admitted right off the back recently they acquired some new wines and in order for him to get back to his rhythm, he needed to sample a few before pouring our orders.  Our initial pours of wine were of the following: (<a href=\"/redir?url=http%3A%2F%2Finstagram.com%2Fp%2FhE3Op4Hh_7%2F&amp;s=2995daf884dff116e554330fc7610d321f63a8285a6acd430cacc12976174649\" rel=\"nofollow\" target=\"_blank\">instagram.com/p/hE3Op4Hh…</a>) Pinot Noir, Laurier Carneros 2009 and Chardonnay, Jeriko Estate, Russian River  Personally, I found the Pinot to be a bit too mellow for me. Whereas the Chardonnay had some nice buttery notes which would have complimented the Lobster Empanadas I hope to try in the near future. One by one, he kept uncorking and tasting some of the stuff. During his personal tasting, he allowed Jasmine and I to sample some of the Mediterranean stuff and get our personal view of things.  After those samples we wanted some munchies so we also ended up ordering some Brisket Poutine: (<a href=\"/redir?url=http%3A%2F%2Finstagram.com%2Fp%2FhFA-sjnhwj%2F&amp;s=d2c905743f313902fba860fe52b00a8bf6aef62f8e6b1f00dab1a5ce506cff83\" rel=\"nofollow\" target=\"_blank\">instagram.com/p/hFA-sjnh…</a>)  Now it's a bit unfair comparing this Brisket to my friend (and fellow Yelper) Dru C., who makes a real serious Brisket. The dish as a whole was nice, I get the purpose of the Petaluma cheese curds, hints of garlic, the fries and the gravy kind of all layer on top of one another without stealing the spotlight for too long. My only qualm with the dish is the gravy sort of gave the brisket a backseat.   When I think of well done brisket, I believe you should taste the moistness of the BBQ within the inner layers of the meat while enjoying a refined touch of smokiness. I also believe this dish could also be elevated if there were an addition of burnt ends (I know its more of a Kansas thing).   Anyway Chase and the rest of the crew made us feel apart of the Hayes neighborhood even though we were a bridge away. I look forward to going back and exploring more of the savory treats and wine in the future. Four stars for an initial rating, cheers!", 
    "review_date": "2013-11-24"
  }, 
  "PNVDZhitq6ardTHPIlyUiA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan M.", 
    "review_text": "Great place, great selection of wines but horrible service. The staff are rude and incompetent. The server didn't even take our order. We tried to call her but she didn't give a shit. She was texting all the time. The host had to come and take our order, which he messed up. He told us he would comp on of the three wines, but when the check arrived, nothing was comped. It's a pity because it is a wonderful place with great potential.", 
    "review_date": "2013-09-20"
  }, 
  "XrRbDfhofoq-Cys6oKXdJw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon H.", 
    "review_text": "Favorite new spot in Hayes... it just might be!  An abundant selection of wine, service always friendly and attentive. I love that they have internet - what's a better way to get work done than with a nice bottle of red on the side.   Self serve popcorn. Great tots (when I went they had gouda tots! so delightful)  The space is large with many seating options, at the bar, big comfy chairs, tables, and a large communal table where you are bound to meet new friends.   I pretty sure I'm on my way to becoming a regular :) Cheers!", 
    "review_date": "2013-04-21"
  }, 
  "qVCGzJCDnjwut1dnHef2Og": {
    "user_rating": 4.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Rew C.", 
    "review_text": "Stopped in here just a few minutes too late - they have an early license soon to be upgraded for later service but this evening they were forced to close at 10pm. Enjoyed a couple glasses of wine from a bright young lady named Katie - she was cool and their wine list is excellent!   Great variety and well priced - they have wines from $8 on up - I had a Lirac (think Chateauneuf du Pape Rhone styled Red with a blend of Grenache, Syrah, and Mourvedre). Absolutely delicious and my friend had a good HOPPY beer.   Looking forward to eating there next time I'm in the city - also met the owners, both fun entertaining couple with plenty to contribute to conversation.", 
    "review_date": "2014-06-08"
  }, 
  "F6hOzZYpj5gi00Bs7eJdxw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John M.", 
    "review_text": "I really dig this place! It's got a good rustic vibe to it. I went here last night for Microhood and people said the bar was more busy than usual. Fortunately my friends and I were able to snag the couch by the front entrance.   Very good beer selection, I had the Pilsner. And the tater tots, holy moly so good!", 
    "review_date": "2014-08-15"
  }, 
  "x4omxqHAFoVe2thnV-wANw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark G.", 
    "review_text": "Great place to get a glass of wine.  Make sure to have the white bordeaux, if you like crisp white wines.  The whole ambiance is unique and super.  Somehow putting a flat screen inside a painting frame and showing old films work for me.  Call me crazy.  :)", 
    "review_date": "2013-09-14"
  }, 
  "GfB6sC4NJQvSI2ewbQrDNA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitch A.", 
    "review_text": "I went here on a date last week on a Friday night.  The ambiance is a little strange.  I really wanted to like this place since it's situated perfectly in Hayes Valley and I came here on a non-crowded night and it's awesome.  As soon as it gets packed it kills the ambiance.  The waitress was running around, but she was really nice, she just didn't know what she was doing.  She kept asking how everything was, but our wine glasses were full.  Also, you can see that in the back they skipped some corners to save money.  You can see through the ceiling in the back, some of the furniture up front doesn't seem to match and the table we were sitting at was too tall.  Also, the back room seemed really cool, but of course since it's San Francisco it was full.  I can't wait for the day when you can make reservations at bars in this city as well, it's sorely needed.  The crowd wasn't Noir at all, it kind of reminded me of hanging out in the Marina and it was really loud.  I want to come back when it's mellow to check it out again.", 
    "review_date": "2013-04-24"
  }, 
  "Vv0Tl1k4ADaTg-CuIFY0lA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Belle A.", 
    "review_text": "Service lacking. Felt so unwelcome.", 
    "review_date": "2013-08-02"
  }, 
  "vLqbQkcSkvbWJRB96UTAsA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M. M.", 
    "review_text": "Service is not good. The male waiter seems upset and walks away... There was a newbie who seemed to try to be nice but I realized she overcharged me. There was no music or playlist... Just a piano which can be nice at 5 pm but not at 11. Overall given the overcharge on my open tab (how that happens when I'm sitting at the bar is beyond me) I'm not keen on going back.", 
    "review_date": "2014-11-14"
  }, 
  "d0xsgwc-7H5GyIPXiUBnDQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy L.", 
    "review_text": "Really cute old-fashioned looking lounge. Several rooms, each with cozy chairs and tables and a piano playing later in the night. The food was decent. Great place to grab drinks with friends.", 
    "review_date": "2014-05-31"
  }, 
  "9kSGEaVW0KCNNEVn9JzOgg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Dan A.", 
    "review_text": "My favorite spot in Hayes Valley whenever I'm visiting the City. The decor is beautiful and the wine selection is thoughtful (and impressive). A nice place to start the evening or stop in after a show. Service has always been good, which is hard for a newly opened place. Overall, a very unique and quality find.", 
    "review_date": "2013-08-26"
  }, 
  "wx5tAWoTb02kM-hG5Aer9A": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Tram P.", 
    "review_text": "We came here on a Saturday just an hour after they had open, so the atmosphere was sleepy with just 2 other guest. The lighting is soft and decore fits the name. Perfect date spot for those who wants some good beverages without having to yell over their environment. Friendly knowledgeable bartender, I will be coming back!", 
    "review_date": "2014-08-02"
  }, 
  "pqyokIQMWTudCnDBzVbN8Q": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "a f.", 
    "review_text": "I really liked this place. It's classy and the ambiance and decor are great, as are the drinks and appetizers. Great piano playing too.", 
    "review_date": "2014-12-13"
  }, 
  "1HKoA-39R3HgoGuk0nEfWg": {
    "user_rating": 4.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Lindsay M.", 
    "review_text": "Nice vibe, comfy chairs, decent list of beer and wine choices. I enjoyed my time there!", 
    "review_date": "2014-10-13"
  }, 
  "r3UmPWmn_e62xJpEngrAxg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Selina W.", 
    "review_text": "Slow Service...sit at the bar for better faster service.  Stood around for 5 minutes until a person/server told us it was first come first serve everywhere.   There was no cashier/bartender there when I walked in I could have literally robbed the place..... When she did show up she just stared at me...I should have read her mind and sat myself down Duh!! -_-  Hmm...they changed chefs so the food seen on yelp photos are different now. One of the servers told me since I asked why the chicken waffles were smaller/different. Food is a bit overpriced but is not horrible...but could get way better food and cheaper just down the street :(.... But still yummy! Would probably come back just because of the wine selection and intimate setting...but not dying to revisit!", 
    "review_date": "2014-03-06"
  }, 
  "Xq6sM8dg9-y-k2siiTcuWA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "Blind Tiger Tap Bar, where's my service?", 
    "review_date": "2013-07-31"
  }, 
  "bRHY80OHhmobT_GdnTAU-g": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "mary c.", 
    "review_text": "Very unique setting and lots of options for seating - want comfy chairs or a communal bar table or table for 4? They've got you covered. Cocktails are solid, but I was more impressed by the food. We ordered the fried chicken that came with broccoli florets (odd pairing) but the sauce...the sauce! A spicy maple concoction that paired very well with the friend chicken filets. Lamb sliders were also extremely delicious. Their flat bread was essentially a small round pizza that was kinda lack luster. Everything else was perfect!", 
    "review_date": "2015-01-07"
  }, 
  "NxxmeuEYqOp6459O6WmauQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Honor G.", 
    "review_text": "They totally deserved this rating as a full team from staff to bartender to owner.  They are a horrible establishment. I live in the neighborhood and I travel globally the service here ranks in the bottom 10% of the world including some 3rd world countries.  Don't let the decor fool you. Just because it looks cool shouldn't obligate you to bear with the low quality service.  I ordered sliders. I bought the beer from the bar. They said they would deliver it to the table. Essentially 6 feet away. I patiently and politely waited for half an hour. Nothing happened. I asked the two waitresses if I woukd get anything served soon. They ignored me. Then I asked again seriously I ordered food .. sliders.. is it coming? The waitress said you already ate it and you are asking for more? Your flickering eyes see not telling me the truth. And left.  Yeah I realized from a recent interview I was flickering my eyes too much but not much I can do about the fact that I spend too much time in front of the computer to earn a living. I realized she didnt symphatize with my foodlessness I approached the bartender woman again asking where my food is. She said it was delivered but that she can order it again if I want.... I said considering I never got it it would be inappropriate to say \"again\". she said to come back in 5 minutes to the bar.I waited 15 minutes went back nothing was there. She was totally annoyed that I came back. I said is it coming? She said in a few minutes. Gave them another 10 minutes went back again.. nothing. In the meantime their low class waitresses were serving some other people's dishes and when I looked their way wondering if that was my food, they reprimanded me saying not to touch that since it wasn't my food as if I was gonna steal the shitty food on the plate when I was just wondering where this oh-so-wonderful food was that I had been waiting for 1 hour.  I went back to the bar she got even more pissed dove into the kitchen and came out with two shitty looking biscuits on a plate. Tripped a bit. I said can I please have some water with that. She unwillingly went to the faucet grabbing a wine glass (they don't knkw how to serve water) and she filled it up with some shit colored tap water with no ice and handed the wine glass to me. I told her this is not potable water and refused the glass.  Went to the table to try the delicacy. Some clown showed up alerted about the situation. Asking if all was ok. Obviously it wasnt. I took a bite of the horrendous piece of shit slider and tried to eat a bit more. It was so spicy snd bad. It's the kind of food thst gives you heartburn afterwards. Unflavorful and overly spicy. I was so hungry I teied to finish 1 and left the second one. The owner came and asked if all was good I told him he should consult his staff. He is arrogant and obviously doesnt come from the service industry. I told him he might as wel shut down the place right away since its so bad. He didn't even know how to apoligize.. he left.. and 20 minutes passed as if he had practiced in front of the mirror finally came back and apologized posthumously in a very insincere manner. I told him whatever and he disappeared and reappeared agaib at 10 to take away a friend's leftover beer blaming the city about the liquor license policies without eveb allowing him to finish his beer. We left to place pigalle to never go back to the shittiest service I have ever seen in my life.  Avoid this piece or shit.the name noir means black in french, they should rename themselves as merde.", 
    "review_date": "2013-04-04"
  }, 
  "TLdtuZm6Ms0V22I6htXBaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K V.", 
    "review_text": "What a cute place, and bigger than we expected!  + Plenty of seating- couches, chairs, tables, coffee tables + Old black and white movies projected on the walls + Friendly service, knowledgeable staff + Not packed on a Sunday afternoon + Cute decor + Good music  - Food was lacking, but at least wine selection was good", 
    "review_date": "2013-07-29"
  }, 
  "BByY6TRXOpV99wJdMzNgfQ": {
    "user_rating": 3.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Carly C.", 
    "review_text": "I went here a couple weeks ago with a friend and everything was great. It is surprisingly large on the inside and there is live music. It does tend to get a little loud. The food was really good but the service was slightly slow. Overall the experience there was great. So why 3 stars? A few days later I checked my bank statement and they overcharged me. By almost $20! And I called and left a message and no one called me back. I called again and talked to someone and she promised she would get it taken care of and would call me back because \"something weird happened.\" But I never heard back from her...I am going to continue to call but am not holding my breath. So go and enjoy your time, just make sure you keep your receipt and that they don't try to charge you more than your bill!", 
    "review_date": "2014-03-04"
  }, 
  "_N--zSeYplWJyh-VHFWXdg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew D.", 
    "review_text": "Went there for brunch on a Saturday, arrived shortly after opening. Staff was super friendly and attentive. I had the Breakfast Sammy, my girlfriend had the Mushroom Crepe - both were very impressive and reasonably priced. Ambience is great - will be going back for an evening experience.", 
    "review_date": "2013-09-29"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Great spot for wine and beer, but they also have really good small plates of food. Been here a couple times now and the second time was after they added the bar in the back room. It's a nice idea in theory, but that area seems cramped and noisy now (especially if you are sitting at said back bar).", 
    "review_date": "2014-05-04"
  }, 
  "W-LMhcHsMwb8O3d2KRiW0Q": {
    "user_rating": 5.0, 
    "user_location": "Fisherman's Wharf, San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "One of my favorite spots to get a glass of wine in Hayes valley. Great small plates and fun vibe - haven't had a bad drink here yet!", 
    "review_date": "2014-07-24"
  }, 
  "fq5ChXmD-G4we1iIzrWC4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Skippy F.", 
    "review_text": "Thank you so much to Brian the owner and the wait staff at Noir Lounge / Lunchpad for your hospitality today. We held my BFFs graduation lunch there in their back room. We started planning two weeks ago and everyone was so hospitable, easy to work with, &amp; generous with us. They stayed open late, gave us extra waitstaff, made us a fresh pot of coffee (after they had already closed!) and all around, Noir &amp; Lunchpad went ABOVE and BEYOND to make us feel welcome. Thank you again.", 
    "review_date": "2014-05-15"
  }, 
  "MGxuBuCMXUvHR2u39TNRdQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabine K.", 
    "review_text": "The decor is well done, but for a lounge the place is too loud. Seems to be more of a wine bar with a small (very small) bar menu anyway, rather than a lounge.  Went there on a Saturday night.. hungry.. The menu was small to begin with. The only substantial items they had were meatballs and Risotto.. Everything else was salad, cheese plate etc. That in itself is not bad, however, we ordered Risotto and a salad, knowing already, that the meat balls were out..  Very late.. like a second before the non substantial salad arrived, they told us they were out of the Risotto, too, which left no more substantial food item on the menu to fill my belly..!   I'm very sorry, but a puppy eyed \"Sorry\" doesn't cut it. For such a screw up the waitress should have offered to bring any of the other non substantial food items for free, as I told her I was very hungry and had asked about other filling options..  Nothing like that, the bill came, all items on there, full price. That's not how you treat a sophisticated customer, but maybe that's not what they are looking for..?", 
    "review_date": "2013-08-12"
  }, 
  "oScR9Re-VqvqXAEKWf7Lxg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn U.", 
    "review_text": "The service at this place sucks. We waited for 15 minutes until someone brought us a menu. Then, the waitress brought us the wrong beer. When we asked for the check, the waitress told us she lost my boyfriend's credit card. Eventually they found it in the trash. They didn't even apologize. We asked to speak to the manger who did not apologize, but insisted she was \"good at her job.\" This place is not worth all the hype. Don't waste your time or money here.", 
    "review_date": "2014-02-14"
  }, 
  "knReN1F-2WbpQzyhElvnYQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Margaret I.", 
    "review_text": "TL;DR - Service was poor, food wasn't memorable, and being served right before they were going to kick us out (which we didn't know) was the breaking point.  Stopped by Noir for an evening/late snack and some wine with a friend.  The place is beautiful, the chairs are comfortable, and it has an overall nice vibe.  But I didn't come to the place to soak in the atmosphere.  The service, like so many other people have mentioned was not on point, not even really close.  We received our snack order before we received our wine, even though we'd ordered our wine first.  We ordered the blue cheese bites, deviled eggs, beet salad, and the johnny cakes.  (Okay, so a big snack.)  Blue cheese bites were underwhelming, the deviled eggs were good because of the siracha in them, beet salad was okay and the johnny cakes were tasteless and we didn't even finish them.  At 9:30pm we were asked if we'd like more wine, which yes we did.  After a long while we received our wine, and our check and were informed that we needed to be done and out of the restaurant by 10pm.  So after shot-gunning our wine we left.", 
    "review_date": "2013-05-12"
  }, 
  "CDtbuyJBYyDT21lJMod6OA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kitty O.", 
    "review_text": "Don't order food here its a rip off!!!  Drinks and mood are OK... but food is not worth the money...  We were out bar hopping, and this bar was my turn to pick up the tab... we were all getting snack-attacks, so we ordered the tater tots and the mini sandwiches... for $8 there were like... 5 taters in a teeny tiny bowl, and the sandwiches were thick bread with too much crust and the thinest layer of cheese you have ever seen, it was SAD!  It had tiny grapes CUT IN HALF and limp little pathetic greens all around it...  It was the low point of our night.  Thankfully.", 
    "review_date": "2013-08-07"
  }, 
  "zFuYISK9K9poVrS5rkNSAw": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Ines R.", 
    "review_text": "Perfect ambiance, great wines, delicious food, and wonderful service!", 
    "review_date": "2014-08-24"
  }, 
  "f-20PoobIoFSbqLtRcjPcw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonia D.", 
    "review_text": "This place screams \"date spot\".  My friends and I cozied up on the couches in the back section right in front of the movie screen.  Each person walked in and had an \"I love it in here! This place is so cool!\" reaction to the ambiance.  The decor is sophisticated but comfortable, lounge-y with a little glam.  I didn't have any of the dinner food, but we split a bunch of apps - all were tasty.  Took advantage of the Happy Hour specials while they lasted, which is always appreciated.  Impressively packed for a Tuesday night, and because of that I did feel like our service was a little spotty.  Everyone was super nice... but we had a few things get lost in translation -- either not come out as we ordered or not come out at all.  Overall I think we had at least 4 different people helping us so it was bound to happen.  They were clearly aiming to please but couldn't quite handle the crowd.  I think this place has a lot of potential.  I'll be going back for sure!", 
    "review_date": "2013-06-25"
  }, 
  "lFkaYOQn5HnkU-oFyccboQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "steve d.", 
    "review_text": "I like the place but had a bad experience last night. We ordered two drinks which came to about $20 and asked to split the check between two credit cards. The waiter brought back a bill of ~$20 on *each* of our cards. We asked them to correct this and they appeared to, but today I see in my bank history that they put though 2 more charges on *each* of our cards that added up to the same amount. I'm not sure how this could happen unintentionally.", 
    "review_date": "2014-03-15"
  }, 
  "zVo-J1QMEcaHfY0zBpN1mg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith B.", 
    "review_text": "thank you noir lounge. Great wine bar with a great selection.", 
    "review_date": "2014-08-03"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Nice place, good service, but i'm only giving it a 3 star since they charge $6 for a beer at happy hour. Why even have a happy hour?", 
    "review_date": "2013-07-24"
  }, 
  "eH034FAZ5xfMFl21yKnhcA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "masa s.", 
    "review_text": "After the misuse of the space that was Frjtz, they've transformed the space into a kind of a vintage speakeasy/lounge.  If you remember the old space, it goes back much further than some of the other storefronts, so it's much bigger than it looks from the outside.  It opens kind of early for a bar/lounge, but kind of late for a cafe.  But, if you're drinking beer, you probably shouldn't be doing that before then anyway.  Staff is helpful, and attentive.  Too early for me to pass any judgement on the food, but the wine/beer selection is pretty good.  Not massive, but \"good enough\".  Meaning, I think they have a good variety, but not too many selections that they end up with bottles or kegs sitting in the cellar for years.", 
    "review_date": "2013-08-29"
  }, 
  "Obc-VP99cOlLa0Z0tG_BPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna L.", 
    "review_text": "Went here to catch up with a friend on a week night after work, and it was such a nice place to unwind.  They have lots of options for seating: bar, communal table, cozy couch, tables for 2 or 4, etc.  The place was pleasantly full but not packed--perfect for people-watching, but no anxiety about having to balance a drink while staying out of the way of the servers (as with so many bars in SF).  The lighting wasn't too low, the music not too loud--again, very relaxing, and perfect for conversation.  The food is GREAT, especially if you like cheese: we had the johnnycakes, bleu cheese mini-grilled-cheese sandwiches, veggie chili, and smoked gouda tater tots (get these! delicious!! they reminded me of Spanish croquetas).  But be forewarned that the portions are a little small--more bar bites than dinner.  I'll leave the wine critiques to someone else, but the servers were great with suggestions, and we both wound up drinking a second glass.  Cheers!", 
    "review_date": "2013-04-16"
  }, 
  "PhheVnonXFv6SVGmAiipuw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Kevin I.", 
    "review_text": "Drinks were good, just had one red wine that was a little \"tasteless\". Other than that we ordered some olives, figs and sliders - all of which were delicious! Also the staff was fine, attentative and friendly.", 
    "review_date": "2014-09-29"
  }, 
  "Eypq5gLLjCapBVVnMw_MyA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Misha T.", 
    "review_text": "Besides the noir movies playing in the background, there isn't anything particularly noir-ish about this place. But really, I'm not sure what that would even mean. Femme fatale waitresses poisoning your drinks? Maltese falcons everywhere?  On the plus side, they have fine drinks and pretty decent, if not a bit expensive food. We had the mac and cheese, tater tots, and brussels sprouts. They do a good job of serving stuff that's easy to share.", 
    "review_date": "2014-11-30"
  }, 
  "3JbWovIQS68rkOhGRaI6yg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Weston K.", 
    "review_text": "Go. Just Go. It's one of the most amazing experiences you could ever have in this city. The food, the drinks, THE SERVICE all wonderful. These people have thoughtfully created an atmosphere that is comfortable, welcoming, and incredibly sexy.", 
    "review_date": "2014-09-04"
  }, 
  "yGcRDtBOpCYnEFooKOPUOA": {
    "user_rating": 2.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Kevin M.", 
    "review_text": "I don't understand the rave reviews about this place. Yes, the food is good and the service was thoughtful but that's all I can say. Do people actually think this mesh-mash of three or four smelly (really smelly), small rooms is elegant? If this is the best SF has to offer, I'd hate to see the worst. And then there is the piano at blast-off volume! The only excuse for thinking this place is designed elegantly or even uniquely is if you have never been anywhere truly elegant in New York, Paris or London. Sad.", 
    "review_date": "2014-08-26"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "UH-AMAZING Concept.  UH-AMAZING Ambiance.  UN-AMAZING Service.  Working nearby, I was excited to learn that a new wine bar would be opening in Hayes Valley at the old Fritz location. Uniquely San Francisco, Noir Lounge is an ultra-sexy wine bar with a 1940s vintage theme, sultry reds and golds, and plushy sofas and chairs. A total HOT DATE spot. What makes this an amazing lounge is its film noir theme. There's a huge ceiling to floor projection TV in the den area (there's also multiple flat screens around the lounge) that is set to play black and white movies. I adored the awesome shadow box of two silhouetted figures from The Big Combo (1955): <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F16syBHo&amp;s=ab97a054051dad95c20cd6b6c270789535f7c7402f625d7e36e360f4ace55618\" rel=\"nofollow\" target=\"_blank\">bit.ly/16syBHo</a>. If Foreign Cinema had a lounge this would be it.    After dinner last night, I decided to drag the bf to Noir Lounge for a night cap (soft opened on 3/29). We arrived at 6:45 pm (yes, we eat like old farts) and was easily able to find a table in the back area. There's a front bar area with lounge chairs and a communal table, a back bar area with more sit-down tables, and then the den area which houses the whole projection screen TV (come early and snag seats here!).   The cute menu was presented as a play bill: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F16z9Afy&amp;s=94a137e4413b1c9dc006d539f3aab1f1e4639ff2ed14ad57b1b370cf459fb46d\" rel=\"nofollow\" target=\"_blank\">bit.ly/16z9Afy</a> and featured about 10 wine by the glasses at $8-$14/glass and several pages of wines by the bottle at $31-$68/bottle. They also have a good selection of beers for $5-$7/glass.   While I understand that it's a wine bar and not everyone is a lush like me, it would be nice to see non-alcoholic drink(s) on the menu (every wine bar that I've been to does). There's a lot of people who can't drink wine or beer because of religious reasons, health reasons and/or maybe they're in AA. They may just be out to mingle and socialize with their friends so non-alcoholic option(s) should be available to them other than tap water.  Noir currently has a bar bite/snack menu from pop-up chef of Sweet Jo's Chili &amp; Biscuits with very enticing items like Smoked Gouda Tater Tots ($6), Ham &amp; Biscuit Sliders w/ Pulled Pork ($8) and Rock Shrimp Johnnycakes ($12). The menu: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FYykAIj&amp;s=0af52b82b5160e46e8b04f53e392e64f419415e17b0cb1852314c37c36975479\" rel=\"nofollow\" target=\"_blank\">bit.ly/YykAIj</a>.  Now onto the UN-AMAZING part of the review...  While they're still in a soft opening mode and still trying to figure things out, there were A LOT of major service issues that I couldn't overlook. I was teetering back and forth of whether to write this review but I think it would be beneficial to the owner(s) so they can iron our these major kinks before their grand opening.  (1) My drink took an excessively long time to arrive. We sat there as four of the surrounding tables received their drinks before us. Mind you, they arrived and ordered AFTER we had. It took 25 minutes to get my glass of wine: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FXSf57R&amp;s=2b9267d64920ae7bc5c8f90e784cccd9c26e5fd47346e2bef8e0367761184208\" rel=\"nofollow\" target=\"_blank\">bit.ly/XSf57R</a>.  **Note about the wine markup, my glass of wine was $14/glass but online, a bottle retails for $16.99!?!?! That's cray!  (2) The staff was confused, overwhelmed and clearly lacked training.  **While I was ordering a glass of the blend, I asked the waitress what was the correct pronunciation was to which she replied, \"I have no idea.\" I don't expect the staff to remember the menu like the back of their hand but they should have some basic understanding of it. If they don't know, a more appropriate answer would be: \"You know what, I'm not 100% sure but let me find out for you.\"  **We watched as wrong food orders were brought out to tables who never ordered to food to begin with. Even the chef came out and asked the back bar area if anyone had ordered sliders because they had been sitting in the kitchen for 15 minutes. Bless her heart but publicly announcing this in front of customers was unnecessary as it drew more attention to their service issues.  (3) The owner seemed like a really nice guy as he checked in with some tables several times but never checked in once with others. It's good business practice to be consistent especially IF you want return customers so he should of checked in with all customers and not just selective ones. We were not one of the selected tables.  (4) Even though we had just eaten dinner, I was adamant about ordering one thing off the food menu. It's a good thing we decided to eat dinner beforehand because our Smoked Gouda Tater Tots never came; rather it got mistakenly sent to the table in back of us. Our waitress saw this, apologized, and said that our order would be coming. Another 20 minutes passed and we never received it so I asked that she cancel our order. Sorry, we don't have all night to wait.  (5) When it came time to pay for our bill, we paid cash and never received our change. When my bf flagged down our waitress to ask for his change, he received our bill (again) but no change.  I absolutely love the venue so I'm hoping they work out these kinks out because I do wish them success.   Until then, come with a lot of patience and don't forget to nosh on the complimentary popcorn from the vintage popcorn maker.    À la prochaine, Noir Lounge...", 
    "review_date": "2013-04-04"
  }, 
  "KSWPvkvbHHQVspjlssh8IQ": {
    "user_rating": 2.0, 
    "user_location": "Cumming, GA", 
    "user_name": "Natasha H.", 
    "review_text": "Visiting San Francisco for the first time and looked up lounges to visit after dinner. We were looking for something fun for the older crowd. This place looked good on Yelp and the reviews were high.  Here's the real deal...the atmosphere is BORING! They just recently received their liquor license so their drink menu is very limited. The bartender is AWFUL! She didn't have the ingredients for an apple martini!! When I asked her to make me a martini ...I'm not sure what she made (tasted like a lemon drop). My boyfriend asked for a vodka, soda with a splash of orange juice and well...she poured the orange juice on ice, added the club soda and then the vodka...WTF??? Needless to say...it tasted awful!  No live music on a Friday??? YAWN!!! I won't be back and don't recommend it to visitors. This is a neighborhood bar...an that only!!!", 
    "review_date": "2014-11-14"
  }, 
  "WVeqSl23V90wHMPkGwyv5Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jas M.", 
    "review_text": "Came here with a few girlfriends after work. I immediately loved the ambiance, from the table seating out front to the more intimate seating in the back room. The window shutters on the ceiling and the chandelier are also a nice, romantic touch. As for wine, we ordered a rose, pinot, chardonnay, and sauvignon blanc. And for food, we had the brussel sprouts with bacon, mac n cheese, bruschetta, and gourmet tots - I loved the gourmet tots and bruschetta! Overall, good wine, pretty good food, and great ambiance.   They seemed a bit understaffed, though, and the place is a bit on the pricey side, but it's great for a small bite. The crowd also seems mostly local and young (20s, 30s). I'll definitely be back if I'm in the neighborhood!", 
    "review_date": "2014-12-10"
  }, 
  "w_xclw8POH9fuVW61XW_jw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emilie P.", 
    "review_text": "Horrible service. We had to wait 20 minutes for a rude waitress to come and take our oder. We ordered drinks and food. She forget the food! The place is very noisy. Prices are expensive. They sell a 6oz glass of champagne for $19. I work in a bar too, and I'm pretty sure they lie about the quantity. Same for the wine.", 
    "review_date": "2014-04-01"
  }, 
  "c24niAEMJmgne4UflTS_mA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel A.", 
    "review_text": "I love this place.  I love the decor, and the film noir movies that play in the background.  I have been here a few times and have always been very happy.  The people who work there are all really friendly.  The food is great for snack bites, and the bread pudding is to die for.  Good variety of wines, and a few on tap too.    Awesome place to sit and chill with friends, or show some out of town guests a great local place thats different, fun, inviting with great wine.  It's also right by the 21 so you don't have to walk far, only across the street.  I really don't have any complaints.  Defiantly a one of my favorites", 
    "review_date": "2014-03-12"
  }, 
  "WOlfaz4vzUNvNxCScXeYrg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kirsten V.", 
    "review_text": "Great wine bar in Hayes Valley if you're looking to grab a drink in that hood.  The place is super cute inside and feels small but it's actually a decent size.  I would say its a place you want to go with company you know because it is hard to hear people in there.  So if it's a first date probably not the best spot on a weekend.  The staff was very friendly and knowledgeable and they never forgot about us which was nice.  I would definitely go back there and recommend it for people looking for a spot before a show or just cruising Hayes Valley.", 
    "review_date": "2014-05-11"
  }, 
  "dW2uIz60INteoC5w1_k2aQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M P.", 
    "review_text": "Fun &amp; Chill. As well as unpretentious service. Also native owned.", 
    "review_date": "2014-08-25"
  }, 
  "7XwdplOp2UR3JWRkZQTkiw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ang D.", 
    "review_text": "This bar is so nice!! I loved the music they were playing. There were old black and white movies on the tv screens that are up around the lounge. There are a lot of places to sit and hang out and their wine selection is awesome! The service was so great and the place is so clean and easy to find. LOVED IT!!", 
    "review_date": "2013-09-28"
  }, 
  "MHLJxx7M9WJGUVhnU1ogtg": {
    "user_rating": 4.0, 
    "user_location": "Clinton Township, NJ", 
    "user_name": "Minty N.", 
    "review_text": "Came here for before dinner drinks and had a good time.  This wine bar has great ambiance for a date or small group gathering. I had a glass of Pinot noir and my husband had the house Sauvignon, both were good but nothing to rave about. Perhaps we picked the wrong wines or if we stayed longer we may have been able to try more. The bartender was very nice and attentive despite the fact that her friend came and sat next to us at the bar and was chatting her up the whole time.   Would definitely come here again to try more wines, if not just for the ambiance!", 
    "review_date": "2014-04-08"
  }, 
  "EQ-fPVMNGhwZOdB8PJ25ug": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bobby B.", 
    "review_text": "Fancy place with high def TVs and friendly staff. The cool dark ambience reflects a ironic light mood.  Spring time! 4-20", 
    "review_date": "2013-04-27"
  }, 
  "4T2uVlRjkl0eogswfL2bTA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie J.", 
    "review_text": "Nice wine bar! The service was impeccable (granted there were not a lot of customers late Sunday afternoon). The seating is all comfy couches and lounge chairs.   I tried their white wine on tap, tastes like white wine! We also got their tater tots, which were warm and tasty but nothing over the top.  Beer selection is not that great.   They play black and white movies against the wall, which was a fun touch!   Overall, not sure I would go out of my way to go back.", 
    "review_date": "2013-06-12"
  }, 
  "NP1Se0HF38cZoDwgNAASnw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric H.", 
    "review_text": "I love this place! Best wine bar in the city bar none! Please excuse the pun. :) Wow! Lets talk about the decor and ambiance, stellar! Then there is the service, our waitress couldn't have been nicer and more attentive. Her recommendations for the appetizers were paired perfectly with the Prosecco.  Finally the Pièce de résistance \"The Food\"! Again wow! None of that stuffy grub that \"The Other Wine Bars\" serve. Do you even know what Poutine is? Ok get your mind out of the gutter...you may not but I'm sure your French Canadian friends do. I will let you do your own research on that. Chicken and Waffles!  Damn! Blew my mind! Mushroom Crepe with an awesome cheese I cannot pronounce with truffle oil!  I'm still licking my fingers! :) Lastly can you have Lastly when following a Pièce de résistance? Anywho, the dessert is and now was incredible! Crème Brûlée crepe cake, a chocolate pudding with fresh &amp; puréed berries. Ok. I'm stuffed now I'm starting to doze off. I don't think I can finish Zzz...", 
    "review_date": "2013-09-01"
  }, 
  "bTFZ-cepM91pdS2PFpvJiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody T.", 
    "review_text": "Cute wine bar.   Fun decor.   We went Friday around 6 and got a table near the back - guy playing piano.   Nice spot with food options - we had the fry cone - enough for 4-6 people to have a good portion and the tots. Go with the fries.  The local Pinot noir was good and only $7-glass!   Service wasn't bad either. Must have improved since soft opening.  Vs. fig and thistle another wine bar in the area definitely more Intimate and romantic for a date with a lot more seating and food options from apps to small dinner plates.", 
    "review_date": "2014-08-01"
  }, 
  "cuobBbv5wi4wZckIl2mcQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa Z.", 
    "review_text": "Fabulous atmosphere, great wine, prime location!  The ambiance is seductive and the decor makes it feel like you've stepped back into another (super classy) era.    The screening room in the back is the prime spot.  The space is  filled with super-comfortable vintage-style couches and vintage black and white films are projected onto the screen, which looks like it's right out of old Hollywood, velvet curtains and all.  The wine list is spectacular and the new chef (as of several weeks ago we're told) serves up fabulous food to accompany whatever you're sipping.  Overall a great experience and a fantastic place for a first date or a \"let's leave the kids at home\" date.  We'll certainly be back to enjoy more of this fabulous vibe... and we also intend to check out their Sunday Brunch!", 
    "review_date": "2013-08-27"
  }, 
  "eTyCSfXXbfCT1nhGe7D2-A": {
    "user_rating": 5.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Xtine M.", 
    "review_text": "Cool little gem we found walking around Hayes valley! Great date spot, they play old movies and they have a person playing the piano sometimes. I'll be back for sure!", 
    "review_date": "2013-09-23"
  }, 
  "zosx5Budah5kpwUWtAI1OA": {
    "user_rating": 1.0, 
    "user_location": "Austin, TX", 
    "user_name": "BS W.", 
    "review_text": "Stopped by on Monday for a drink at the bar before going out to dinner.  The female bartender was rude and was not very attentive, like we were not even there.  She was more interested in her buddy/boyfriend sitting at the bar.  Finally flipped us a drink menu and took her sweet time to take our order of $18/glass of wine.  Too many other great places in the  neighborhood  to get drinks and have a good time.", 
    "review_date": "2014-11-02"
  }, 
  "vHD6gH1GU9-qtTP_b-hypg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheena N.", 
    "review_text": "Super cute place local spot to grab a drink with friends for happy hour. I loved the decor, very classy old school glam vibe with a hint of rock and roll. They have a decent draft beer selection along with wine on tap (I'm a beer drinker).  Definitely come for happy hour because you get $2 off wine/beer on tap and select bottled beers until 7pm.", 
    "review_date": "2014-05-10"
  }, 
  "tzmgs00mXlirutoEFEyljQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shari D.", 
    "review_text": "Best neighborhood spot in Hayes Valley.  Far and away the reason to come here is the staff. Michael, Brian, Jessica &amp; Chase always make you so welcome and give a true neighborhood feel to the bar. I was recognized on my 2nd visit and known by name on my 3rd. They work really hard to create a great atmosphere. This is a great compliment to the fantastic wine, beer and food. To me, it's the best of both worlds--an upscale yet comfortable atmosphere where you feel like a local, even if you aren't.   Go, sit at the bar and meet a neighbor.", 
    "review_date": "2014-08-18"
  }, 
  "HCtEYgABFgwGhHB3rPQeQQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coraly S.", 
    "review_text": "I visited when they first opened. Beautiful space, loved the ambiance, but wasn't impressed with the wine list considering it's a wine bar. Anyhow, service could be better but I have it a 2nd chance and I love it now!!!  It's super busy most of the time so be prepared to wait.", 
    "review_date": "2014-04-23"
  }, 
  "W0oVnuBraYNVi9JooT5kzQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David B.", 
    "review_text": "This is a sort of odd place: wine bar + sports bar.  I'm not sure it really excels at either.  Furthermore, our waitress pronounced the grape \"car-men-air-ee\".  Dude.", 
    "review_date": "2013-07-07"
  }, 
  "D7AnOsCJim2M7JJ500yQpg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leo T.", 
    "review_text": "I walked in with three friends, we just thought we would have a couple of snacks and a beer or two. 3 hours later we tried practically every dish noir had to offer!   The bartender, I forget her name but she was amazing. Outstanding recommendations, and she personally made sure I had a new and unique beer to try. She was awesome and made me feel at  home.   The food was ridiculously good. Tots were my favorite. The steak was very flavorful, and the chicken waffle spinoff was to die for.  This is my new place! Ill be back very soon, this time with more friends", 
    "review_date": "2014-06-06"
  }, 
  "Al2_PuJueQ1llSXu3CyhJQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ambrose A.", 
    "review_text": "Two words -- Absolutely Fabulous! A dinner for two or for a gang of girls. This is a lounge is that is super classy and truly speaks of San Francisco's elegance and international stature. A foodie heaven. From the menu, wine list to the desserts and pink champagne, Noir Lounge is a class act from the get go. The warmth is immediate as you stepped in and once inside, you can't help but to feel like you are in the company of the guys and girls of the 40s. Fashion wise? Fabulous! And the taste? Yummy! Go! And have a romantic good time!", 
    "review_date": "2013-12-13"
  }, 
  "QMcdzHEonGeATOaJqn1sXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalia N.", 
    "review_text": "Love this place. It's cool and sophisticated. I like the decor, as well as the idea of watching a black and white movie while having a great wine from the Old World.", 
    "review_date": "2013-06-24"
  }, 
  "adw3ntpQt8RNRv-DSsfkTQ": {
    "user_rating": 5.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Monique B.", 
    "review_text": "Wine beer and small plates", 
    "review_date": "2014-07-15"
  }, 
  "teiLGwYzSKXjCCk-PN0OnQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sumeena B.", 
    "review_text": "Came here on a Weds evening and it was pretty packed. They were out of practically everything (fries, some wines, etc) but we still got to try a bit of this and a bit of that.    The wines weren't anything impressive - the server wasn't very good at giving me a recommendation based on what I wanted but it wasn't that big of a deal cuz I just wanted a glass or two of something easily drinkable (basically that means any wine).  Service was otherwise very attentive and the staff is crazy sweet.    We tried the following: gourmet tots: taste like mashed potato fried balls.  They come with sriracha ketchup but it isn't really spicy.  peach bruschetta: decent.  The bread is actually very soft.  lamborghini: the lamb burger buns are good, the burger is cheesy, and the lamb is very soft.  A little messy.  I added sriracha to mine. mac and cheese: insanely cheesy.    This is a cute date night location and is also good for small groups.  The booths are cozy, they play black and white movies, and the decor is fun and a little different.  There are two bars - one large one in front and a smaller one in the back.  The bathroom is actually clean.", 
    "review_date": "2014-09-12"
  }, 
  "vi1Ta_3XtGTqkl4p83ZbEQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Toby C.", 
    "review_text": "Super packed and super noisy on a Friday night.  More of a party scene than a wine lounge.  Never been to a lounge this loud.  Did I mention it was very noisy?", 
    "review_date": "2013-08-19"
  }, 
  "wyob7airQM-DG7V8aPBZ1w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsey B.", 
    "review_text": "Terrible service. I don't think I've ever given a poor rating solely based on service before, because generally I don't care too much about it. As long as I'm in good company and have some food or drink (and it's tasty), then I'm a happy camper. But Noir Lounge really did us a doozy last night.  We came in and tried to order a glass of wine at the bar. It took awhile for me to catch the attention of the lady behind the bar, and when I finally did, she told us to sit down and a server would come to us. Okay fine, but it then took around 10 minutes for someone to show up. We ordered our glasses of wine and proceeded to wait about 30 minutes! How long does it take to pour some wine? It wasn't like they were meticulously mixing a fancy cocktail or something.  The original server who took our order never reappeared, but at one point another guy came by our table and hovered to the side - I wasn't sure if he was a server or not. My friend assumed he was (correctly) and told him we'd already put in an order, but could he bring us some water. The water never arrived, and neither did the wine. So at the end of 30 minutes, I stood up and caught the eye of the lady behind the bar. As soon as she saw me looking, she realized we didn't have our drinks, and went and poured them. Okay, fine. She then handed them to the guest at the bar she'd been flirting with for the last half hour (rather than pouring our drinks) and asked him to hand them over to us at our table. Really? I prefer not to have some random guy handling my glass of wine before it's delivered to me, and in addition to that, he started flirting with her about handing the glass of wine over, so that he didn't actually turn around and give it to us until after a long, weird and awkward delay.  We drank our wine and while my friend liked her glass of Barbera okay, mine was just \"meh\" (some weird varietal from Italy I hadn't heard of before but wanted to give a try). I can't really blame Noir for the fact I didn't love the wine though. The same male server came back to our table and asked if we wanted another round. We said yes, and that we'd also appreciate some water. We both ordered the Barbera this time. He came back and told us they were out of it, but maybe we'd like the Grenache (since it was also a Spanish wine). We said okay. He then came back and told us they were also out of the Grenache. Really? He was the one who recommended it! Finally we picked a wine they actually still had, a California Cab (which was actually pretty good) and enjoyed our second round. Thank god my friend is good company!  We gave them a 10% tip which was more than they deserved but I've never given less. Oh well. Based on the good reviews for this place, maybe they were just having an off night. Regardless, I don't think I'll be coming back to Noir Lounge and if I'm in the area, will just hit up Two Sisters next door instead.", 
    "review_date": "2014-12-10"
  }, 
  "YEKy3CEFI23R49tpqlMvbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vikram A.", 
    "review_text": "Been here twice, and both times were really great.  The seating isn't cramped, and it gives you and your group enough room to actually have a conversation. The wine list seems to have something for all pallets, and the servers are quite knowledgeable on the options presented.  In terms of food, they don't have any full meals, but their general appetizers menu should do quite well for you. I was a fan of their cheesy tater tots creation.", 
    "review_date": "2013-08-05"
  }, 
  "gji92ao5NAIrb3akKyqTZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "This place is pretty great. Tons of space, three seperate seating areas, standing table, multiple pieces of gorgeous furniture. Popcorn to snack on, great by the glass and bottle list. Service was pretty good. I'm looking forward to returning and trying out the food.", 
    "review_date": "2013-04-04"
  }, 
  "7rvHvqtLYXchl7xxwkv94A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie H.", 
    "review_text": "Noir Lounge is right in the heart of Hayes Valley, making it a good central meeting spot. The poutine packs a punch in the best way. The wine list is solid. The space is roomy with both bar seating, booths and tables. Most importantly, the service is stellar. The GM went out of his way to make sure all the tables were happy. And we were!", 
    "review_date": "2013-12-01"
  }, 
  "VcPj1gchy48KWnMk4kMI-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miss P.", 
    "review_text": "holy shmoley those meetinghouse biskits are good!  i had them at the Elite Cafe too, but never actually got to eat at the Meetinghouse.  not sure why i felt the need to tell you that.    anyway, this place is really good, and it's not because i have a crush on the British waitress.  she's freakishly pleasant to look at.  funny story: i asked a patron where the bathroom was, because i thought she worked there on the basis of the fact that she was sitting at the long table (with a glass of wine, no less) which i mistook for the bar.  i just had LASIK eye surgery, m'kay?  and i'm stupid.  okay, back to the waitress.  wait, i mean back to the food.  we had the tater tots, which were really good....not too overtly greasy, but i'm sure it wasn't low-fat.  the deviled eggs were excellent, and a great source of vitamin D.  the arugula salad with the fried pancetta was huge and awesome.  the salt cod potato puree was good....sorta random to be putting what is ostensibly mashed taters on crostini, but who am i to say \"no\" to carbs on carbs?", 
    "review_date": "2013-05-20"
  }, 
  "K6677dAZZIsf-OO8fKvIdQ": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Megan M.", 
    "review_text": "They had just gotten their liquor license a few days ago when I had visited. Limited cocktails listed on the menu so I tried to order two different cocktails neither of which they could make (a gin fizz I think is pretty standard). Martini was a shell of a real martini. Ended up having an old fashioned which had a minimal amount of whiskey and mostly tasted like watery orange juice. I pulled 5 ice cubes out of the glass trying to actually taste the drink. I would have paid $3 for it, not $10.  The service was great. The atmosphere was...trying too hard. Nice though. They had a variety of different kinds of tables. Seems like the place to go if you want wine. ordered a plate of olives. Gave us a ton for $5- impressed on that part definitely. Beers were crazy expensive for just a lagunitas. I feel like this is the place I would go if every other nice bar was packed or out of liquor. I don't know much about wines, but seems like their main thing is wine.", 
    "review_date": "2014-11-10"
  }, 
  "WJnEifJRkI6bCH2iw8brFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nenette Y.", 
    "review_text": "I've lived in Hayes for years and we *desperately* needed a place like this...   Went here today with my girlfriend and both enjoyed a couple glasses of wine and their food... everything from the knowledgable/professional bartenders, greetings from the owner, fast service from the server/chefs was just great. Prices very reasonable, too.   Have to admit I was skeptical about trying this place after reading a few of the negative reviews, but just goes to show it's so subjective and check it out for yourself to form your own opinion.  Very recommended, looking forward to returning. :)", 
    "review_date": "2013-04-05"
  }, 
  "rBRuie_HNzxCkMDF-ooRog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Myra M.", 
    "review_text": "OMG I absolutely love Noir! It's the epitome in my mind what a wine bar in the city should be. I was immediately enamored by the vintage yet modern decor with the cozy chairs / couches and the eclectic inviting bar. I absolutely love how the flat screen TVs were encased in a huge picture frame and was playing a black &amp; white old classic movie. Last night, I have no idea what the movie was, but when I was here the first time it was during the holidays and they were playing the Jimmy Stewart movie: \"It's a Wonderful Life\". But the movie was silent because they were playing music.   This is a great date place or to catch up with a group of friends. My girlfriend &amp; I just had light dinner @ Domo and I wanted her to check out the place before my date arrived. Thought for sure he would be running late since it was raining last night... Really wasn't planning to double book, but she travels a lot, so I wanted to see her before she left for DC this week. Ugh. Well Thank God my date was cool about it.  Oh and Jarek... Hope I didn't butcher our Irish sommelier's name... He was phenomenal. I enjoyed each &amp; every wine glass he suggested. My date ordered the meatballs &amp; flank steak..... OMG both were unbelievably delicious!  And an added plus was the bathrooms were not unisex; the women's bathroom was clean &amp; big for a wine bar! I'm guessing the men's were the same, but not for sure on that one.  I can't wait to come back:)", 
    "review_date": "2014-02-09"
  }, 
  "gXZDZZPqVdd1wwC2Ach8Fg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz G.", 
    "review_text": "My boyfriend and I came here to grab a quick drink before dinner and were impressed with the cherry cider we drank, but not as impressed with the service here!  We luckily found a small table to sit at and no one bothered to come by with drink menus for at least 5 minutes. When I finally made it up to the mini-bar area and bought our cider, the girl told me she was going away and to get my drink at the front bar? Like you really couldn't go grab it yourself for me and bring it over since it's your job? I passed my boyfriend at our table en route to pick up our drinks from the front bar and he was now magically given menus (???). I brought my receipt up to the bartender who then promptly told me that they \"usually don't do this\" and took my receipt. Cool. Now I don't have a receipt and was berated for doing what the girl behind the other bar told me to do.  Long story short, good drinks and terrible service.", 
    "review_date": "2014-02-17"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "I was really worried about another fancy ass wine bar in my 'hood. But Noir came along with it's big TVs (with Giants games &amp; classic films), fluffy chairs &amp; couches, many nooks &amp; good food. Oh, they have wine too. The only pratfall is they close early on weekends. Otherwise I just adore this new addition to Hayes.", 
    "review_date": "2013-09-06"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Meeoooww.  With its gold painted ceilings and leather armchairs, Noir is a hot little date spot. Seek out the quiet back salon where B&amp;W film plays on the wall, sit on the creamy vintage loveseat and curl up next to your gorgeous man.  The wine list is rich in California varietals and sprinkled with well picked European choices. We shared a bottle of white: crisp, light and a bit on the sweet side. Forgive me, I couldn't remember the name, my brain is still foggy from the luscious kisses on my lips. * Vesper fanning herself *  Thanks Noir for sexing up Hayes Valley.", 
    "review_date": "2014-10-15"
  }, 
  "IBrL-6twlZmQBGLdV2DQiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie C.", 
    "review_text": "Was great for brunch with girlfriends.  Check their menu out.  Crowd-pleaser dishes but made with some twist that make a lot of them just unctuous.  Pair that with their fun mimosas - like pomegranate or passionfruit - and their great service, and you don't mind that it's not that crowded....  Definitely sit by the front windows in the daytime.  It can be dark in the back...  Oh, Noir...  got it.", 
    "review_date": "2013-12-26"
  }, 
  "jkKYuWGmW6JYSQFhluKAfg": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Skyler R.", 
    "review_text": "Wish I could give Noir 10 stars! A group of friends and I went to Noir Saturday night and we had fantastic experience.  Noir is a perfect spot to enjoy a bottle of wine and some conversation - the atmosphere is comfortable, relaxed, and inviting.   We enjoyed two bottles of Alexandria Nicole Cabernet from Washington which was a classy, rich and layered red loaded with dark fruit.  Unbelievable Cabernet for the value and I'm excited to go back for more!  Great job and thank you Noir!", 
    "review_date": "2013-04-15"
  }, 
  "yjUFGJ-8MAqJS2GKUjWr1Q": {
    "user_rating": 2.0, 
    "user_location": "Harvard Square, Boston, MA", 
    "user_name": "Gui P.", 
    "review_text": "Atmosphere is nice but service is terrible.  You can easily wait more than 20 minutes for your drinks order.", 
    "review_date": "2014-07-21"
  }, 
  "P5O3WWL3tb-WKv-0D4UuMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew F.", 
    "review_text": "I really love this place, between bar-lounge and tapas-restaurant. Great ambiance with piano live, Lovely staff...  Good wine and tasty food make me happy. I definitly will come back again and again...", 
    "review_date": "2015-01-09"
  }, 
  "lLUoy7xdsiOCmyqgQG0o0Q": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Katie H.", 
    "review_text": "Went here with a few friends for a reunion. Atmosphere was lively but not too loud--perfect because we could still hold a conversation at only slightly above normal volume. None of us ventured into the wine list, we all stuck with beers (I know, I know) but they were all great and well-priced at $7 each.   Service was a touch on the slow side, but they were having some sort of computer issue, so definitely extenuating circumstances. What's more, because of aforementioned computer issue there was a bit of a long wait for our second round of beers, and as a result they comped the whole round for us. (This was a genuinely nice gesture, as we are all very easygoing, and it hadn't even been that long of a wait anyways.) Very appreciative.  Overall, a very pleasant evening and I'll definitely be back!", 
    "review_date": "2013-08-13"
  }, 
  "7qON9j4tjggvZpW7rrSxrg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chuck B.", 
    "review_text": "Beautiful bar, great service and a tantalizing menu! Love having this bar in my neighborhood. Great place to chill and play dice during the week. A must go!  Order the chicken and waffles and poutine with a session beer on the side.", 
    "review_date": "2013-08-27"
  }, 
  "Oq2dXkIJEjPLWpVQWI6EWg": {
    "user_rating": 5.0, 
    "user_location": "Melbourne, FL", 
    "user_name": "Danny S.", 
    "review_text": "Awesome, unique place that now has full bar so you can slow sip on some cocktails while kicking back and absorbing the scene. Great service, great beer (and wine) on tap, and just one of those unique places in SF that is great for locals or tourists. One of my top 5 places to go to in the city.", 
    "review_date": "2014-11-06"
  }, 
  "crxhOesQjRjlPr9tuqralA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey A.", 
    "review_text": "Love, love, love this spot! Obsessed with the atmosphere. Slightly dark, lounge-y, rich red furniture with a dainty twist. Hardwood floors, beautiful hardwood long community table, elegant chandelier. And...they have a movie theater in the back that plays classic films (a soundless tv plays them up front too). I've only stopped here for happy hour with friends (great prices on the menu) to grab a beer, but I look forward to coming back.", 
    "review_date": "2014-01-09"
  }, 
  "dXdXagdSU6od-w6TjBFKbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bri R.", 
    "review_text": "My girlfriend and I tried out this little lounge on a Wednesday night since the Biergarten's line was insane. It wasn't too packed at 6pm and the décor is lovely and homey. We had a great waitress and they play classic films in the background!! We both ordered the Prosecco and relaxed in the big red booths they have all around. Its so nice to have a few options in Hayes Valley now. Around 7:30pm it was packed so I suggested you get there early and don't leave your seat. I hear the food is great and the fries on the table next to us looked delish! If you don't find anything on the menu you like they have a self serve popcorn machine.", 
    "review_date": "2013-05-03"
  }, 
  "u58FjSNB9K9ST_FQ5SAT3g": {
    "user_rating": 5.0, 
    "user_location": "Sparks, NV", 
    "user_name": "Shelby B.", 
    "review_text": "Noir was exactly what my group needed.  We put in our order at Paxtis and headed over.  The bar had a couple of open tables and we were welcomed the moment we walked in.  Service was great and friendly, and everyone in our group enjoyed their wine or beer.  This would be a great date night place.  I thought it was beautifully decorated.  I would highly reccommend stopping by before or after a meal in the area, the volume is great for group or one on one conversation.", 
    "review_date": "2013-08-27"
  }, 
  "UyhnjAlyMXtbR-qB5kkhlQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean Y.", 
    "review_text": "Noir Lounge has a good layout and plenty of tables and seats for chilling with friends. Not too crowded or loud so we were actually able to hold conversations. Good service. Wine and beer only. Average prices. Last call before 11:30pm on Friday.   A huge drawback? It stank in here. The space reeked of some combination of spilled alcohol, vomit, and mold. It looked clean enough, so I am not sure where the odor came from. After over an hour there, I could still smell it, and it caused me mild nausea all night.", 
    "review_date": "2014-06-14"
  }, 
  "P_vMhoUEQjEwg8jQ5-XfgQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kidisgoat N.", 
    "review_text": "Great location for a low profile brunch. Do try chicken and waffles w/ a glass or two of Cab Franc Blanc.", 
    "review_date": "2013-09-29"
  }, 
  "qA9H_2ajSa7m2SckdsUb2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve Y.", 
    "review_text": "Just celebrated a friend's birthday here, we had a great time.  Good value for the money.  Great place for drinks and nibbles.  Service was pretty good, especially when you considered that they were absolutely full.  Two things to consider if you are thinking of this place: - It's really loud, we had to almost shout to carry a conversation. - If you are sitting in the back, you get almost no cell reception.  For me, this is usually a plus since I don't like phone conversations with dinner, but we were waiting for a couple of people who were running late, so we had to run outside a couple of times to get updates on their progress.  Really good selection of wines and beers, and at a fairly decent price.  The food menu was somewhat limited, so good for drinks and nibbles, but not a lot of choices if you want a full dinner.  We had the following: - Biscuits - good flaky biscuits with honey butter. - Tater tots - not your typical Orida tots.  The texture was a lot smoother (like mash potatoes) with a cheese in the middle.  Definitely very good. - Blue cheese sandwich bites - the blue cheese overpowers anything else, you can barely taste the grilled bread.  Not  that this is a bad thing, a definite plus if you like blue cheese. - Swedish meatballs with egg noodles - this was good, but I think it pales when compared to everything else that we had.  After having everything else, especially the blue cheese grilled cheese, the flavors on this dish just didn't stand out.   Service was pretty good.  Yes, sometimes we had to wait a little but they were really packed.  My one complaint is that based on their website, I thought that they would have more options for big plates/dinner.  I think only one of the large plates listed on their website was on the menu.  Yes, they had other large plates on the menu, but I am sorry, chili is not a dinner option for me.", 
    "review_date": "2013-07-27"
  }, 
  "eo0Eab67OD3oqcitIpX3HQ": {
    "user_rating": 4.0, 
    "user_location": "Bangor, CA", 
    "user_name": "bob b.", 
    "review_text": "Cool spot! I was there for a quick beer before heading back to Marin and had a lovely time, bartender was friendly,decor is cool and neat with lots of beautiful ladies...watching Casablanca in the background was inspiring and felt like I was in Paris! I will be back...", 
    "review_date": "2013-10-18"
  }, 
  "qsQ3_nPBgdmF6a_6lcsA6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Austin D.", 
    "review_text": "What an absolute treat this place is...it's got the right amount of everything. It has plenty of places to cozy up next to a date or commune as a group to let the day melt away. With a serpentine like lay out, even when it's packed, your section never feels too crowded. And having the back room showing old movies, with the bar showing Giants games/sports everyone is happy. The food is delicious and interesting, and the wine menu is fantastic, I've tried a handful of the wines by the glass and have been impressed by all of them.   The staff help enhance the whole experience, they are very accommodating and always brighten my mood.   It's fantastic to have such a great new spot around the corner from my office and I highly recommend it.", 
    "review_date": "2013-04-10"
  }, 
  "JseBksW8DVL596kJ18GGpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gretchen T.", 
    "review_text": "I may be bridge and tunnel now, but I still make it to Mommas Wine night once a month and August was Noir Lounge. There is something for every occasion here--tall, long communal table for happy hour-ers and small groups, lively bar by the front door, nice tables of different sizes further back for those who want to eat and talk, and the boudoir-ish back room with low tables and comfy chairs and a black and white film playing. I'd love to have an intimate birthday party on the back room.   The wine and service were excellent. Both of our servers read the vibe that we wanted good wine and snacks but mostly wanted to catch up, so they gave us quick, spot-on recommendations and checked on us just the right amount (well you could say I was over served b/c I had a 1.5-day hangover).   I'm recommending Noir to everyone right now. Well worth the Hayes Valley Parking drag.", 
    "review_date": "2013-09-05"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "meeting with the ladies...some casual tables and booths near entrance along wall..lighting through windows only...rest of the lounge dim...bar along other side...walking deeper and finding little more cozy and intimate tables in darker atmosphere...bottle of other people's pinot (o.p.p.) waiting along with a cone of fries...easy sipping wine..smooth aged wood with subtle fruity and flower sweetness..priced bit high...marking up to $52 a bottle for a roughly $20 market-price wine...enjoying company and ordering a 2nd with dinner orders...tasty cheesy tots and beet salad quite standard good...steak excellent and accompanying salad quite awesome...apple cider vinegar,  honey mustard, scallions,  salt and pepper dressing...so simple, yet so flavorful....requesting more salad and chase accommodating request with a salad for extra $5...atmosphere is quite comfortable....cinema room with sofa lounging if preferred...tables, bars or booths...perfect seating or atmosphere for drinks, talk and food...bit heavy mark-up on wine, but service and food was perfect....$210 total after tip for 3....", 
    "review_date": "2014-05-02"
  }, 
  "v4OqcE77gEAelwYU8lbP7w": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jay V.", 
    "review_text": "We've been looking forward to Noir opening in Hayes since Frijtz announced the closure and the Noir concept first started circulating on Grub Street. We lived two blocks away and were excited another cute wine bar would be opening. Due to the usual delays of inspections in the city of San Francisco we moved out to the East Bay. But we visited recently and had a mixed visit.  For starters: The interior is, dare I say, perfect. Absolutely beautiful and I love the flood of... well... noir. It feels like I'm stepping into an old movie. The lighting is so wonderfully textured and dramatic I'm just ready to sit down and enjoy our visit. The wines are good and the drink service is on top of their game. This is a great place for a drink and some small bites with friends. The biscuits were great, I only wish for more.  But... Our table ordered a pork entree that wasn't to our liking. It seemed to be more of a salad with a few potatoes tucked in and some pork with it. We didn't feel it lived up two the expectation of what a place like this would offer. A manager came to our table and graciously took it off of our bill and offered us something else.  One of my friends at the table asked for hot water for tea (since Noir didn't have tea at that time, our server offered to bring the hot water). They brought us a cup of hot water and a slice of lemon. So we made our own tea. No big deal. I don't hold that against them. My friend finished her tea and left the lemon untouched on her saucer. The cup was cleared and came back refilled with hot water! Nice. And two slices of lemon, debatably the first unused one and a fresh one. Not so nice. And the used tea bag. Awkward. I, not so graciously, point this out to our server. She takes care of it and returns later to check on us and is a little antagonistic about not \"knowing any better.\" That interaction really put me off.   All in all I think Noir is a beautiful location for a few small bites and wine with friends or a date. They should really focus on that.", 
    "review_date": "2013-06-27"
  }, 
  "NjSqtEFFkK49k2CZoyfY-Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annabelle K.", 
    "review_text": "Nice place for drinks.  WIne is pretty good.  But don't bother with the food.  The food is ok but waay overpriced.  And the service was really bad.  It took awhile for someone to come take our order even after asking at the bar about it several times.  Then our order was messed up not once but twice.", 
    "review_date": "2013-10-05"
  }, 
  "1cKbvepUTL5lZcC9odITUg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "karl r.", 
    "review_text": "What a cool place! Warm with a great layout, convenient location, wines at a Great price point. This place is beautiful wine bar!", 
    "review_date": "2013-12-22"
  }, 
  "ydQ8SD98-6XJ42-x52H8gg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ric S.", 
    "review_text": "I gave them  a very healthy tip. Why then did they feel a need to put my charge through as more than the signed for amount?", 
    "review_date": "2014-09-09"
  }, 
  "PPgyaeI9Y52VErV5uHTDYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clarice C.", 
    "review_text": "This is a super cute wine bar in Hayes Valley! But for a wine bar, i didn't feel that the selection of wines was that great.. I'm no sommelier so I'm not going to dock a bunch of stars off for that. I loved the decor and the food was actually very good! I'd actually probably come back for the food more than the wine!  We ordered around 8 dishes...all I remember was biscuits with honey butter and the risotto being amazing!", 
    "review_date": "2013-06-30"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "Good for a drink, especially in a smaller crowd. They have an almost cozy living-room like setup showing old movies in the back; a piano bar midway through; and a lounge/bar in the front. If I could, I'd draw out some ASCII dungeon diagram, but a quick walk will do it (better) justice.  I always forget that they close early, since they're not a spirits bar (or maybe, because it's Hayes Valley). As a result, I've been conditioned to avoid this place when it's dark out. NG.  Personally, I prefer a more intimate wine and beer bar -- it gives me the chance to talk to the owner/bartenders on their stock and why. In here, I feel hip and isolated in a roomful of people. Which is also cool, but not something I do every weekend.", 
    "review_date": "2014-07-07"
  }, 
  "570kiZ_3AyLYNKpihpA05A": {
    "user_rating": 4.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Amy C.", 
    "review_text": "Wound up here one evening and had a grand time! Among the group I was with, we split many different appetizers but just one bottle of champagne for celebration so... good review for food, lacking review for wine aspect:   APPETIZERS:  Gourmet Tots - GET THEM. I don't even like tots and I gobbled these up. They're liked Crispy-lined mashed potato cheese balls. Just get them. Trust me.   Beet Salad - Probably yummy on its own but really lacking in comparison to how flavorful and awesome everything else was.   Mac and Cheese  - Solid classic. Rich. Yummy.   Skillet Brussel Sprouts  - The BEST. A perfect blend of brussel sprouts and the remaining smorgasbord of ingredients. You'll want to lick the plate clean... just sayin...  SERVICE: Kind, attentive, fast.   ATMOSPHERE: Dark lighting - half macabre/half romantic. They have a room with a projector playing old films. Definitely a great place to chill and have good conversation, its not too loud AND you feel all classy because they have a piano player.", 
    "review_date": "2014-07-23"
  }, 
  "CyQlabNTX0OnnosYgkPKnA": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "D F.", 
    "review_text": "Excellent ambiance and beautiful place in a perfect location. But I am worried about the service. All 4 times I have been (because it is so beautiful and convenient and I want to support it) the service was less than ok. Some if the staff are actually nice but require some serious training, from making sure orders come to checking in often. Also, when it first opened, it had scrumptious little plates, but they already switched chefs and I thought that the food now, although still tasty, is not as delicious as before. I hope they figure out the service soon and continue to thrive.", 
    "review_date": "2013-09-26"
  }, 
  "3rBc0Y1AB3lmnbhxnTH88g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carl N.", 
    "review_text": "Sold ambience, great place for dates/small groups to talk, great wine selection!", 
    "review_date": "2014-12-13"
  }, 
  "HR1fzigQjYRvtSZGWOIN9Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin M.", 
    "review_text": "I thought this place would be classy, but really it's just a sports bar with a gaudy interior.  Clearly all these reviews are from friends of the owners.  I won't waste my time coming here again.", 
    "review_date": "2013-04-14"
  }, 
  "QFnNGxQVNf2OatvTLo5fbg": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "John K.", 
    "review_text": "Fantastic beer selection with rotating taps which gets it to 4 stars in if itself :). But then I began ordering the food and it blew away my expectations. At first reading, I was disappointed as it is heavy on fried foods.  I started with the baked gigs: the home made ricotta was sets this dish above others. Cheese and bread lovers understand the difference between fresh curdled cheese/hot out of the oven bread from store bought.  Next I had the lobster empanadas which were better than expected, but in the interest of time I will skip over. The pièce de résistance was was recommended by the bartender so I don't know how it is described on the menu, but it was crepe with something akin to crème fraiche with a side of fresh chantilly mushrooms, spinach and fried egg covering it all. A perfect blend for this noshing pallet.  Oh, and after I finished the guy next me had the chicken and waffles and looks to be eminently enjoying himself.  If fried food looks like this, then I am all in!!", 
    "review_date": "2013-09-13"
  }, 
  "qiPwKC0spUneRV74nxG9Xw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheryl F.", 
    "review_text": "I don't think there isn't anything we haven't tried off the menu. It's all fabulous. Been there with a large group and with just 2 people. The waitresses are all wonderful. The ambiance is beyond incredible - especially the back room. I feel like I get to have \"Midnight in Paris' moments. If this place were closer to home I'd be a regular. Right now I consider it a treat and go as much as I can. It's a gem.", 
    "review_date": "2013-12-21"
  }, 
  "51DacJvYh42ttaz53ofrWQ": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Tom W.", 
    "review_text": "Went here for the first time tonight and the food was really top-notch for bar appetizers.  Just a bunch of small dishes that were much better than similar fare I'd had at other restaurants/bars.  I had a great Imperial Porter (10% ABV) from a very curated list that rotates every few days (mostly very strong beers) and was impressed with the overall wine and beer selection on their static list.  It has a great vibe with noir films playing everywhere, but overall not a very loud place and much larger than it looks. If it's comfortably spacious on Memorial Day Weekend Saturday, I imagine it's probably never super packed or real loud.", 
    "review_date": "2013-05-25"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Entering Noir, made me feel like I was entering the 20s era!  I love the ambiance and dimly lit setting to this romantic wine venue!  They have a living room with luxurious cushioned lounge wear and a flat screen television that showcases black and white films.   It's a leisurely and enjoyable time spent here, while sipping on some wine and mini appetizers.  The lounge area, offers a bit of seclusion and intimacy that you just can't quite find elsewhere in the city from a wine venue.  I prefer reds over whites here!  Their Domestic Pinot Noir Oregogne 2010 was clean on tasting and Spain Garnacha Vina Alarba 2011, had hints of spices and flavor, if you prefer the non-subtleness of wine.  Noir offers a grand variety of wines to choose from and a marvelous dining decor.    Simply said, I love Noir.", 
    "review_date": "2014-03-04"
  }, 
  "g2hQYumU1nGsneneavMA1g": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Laina T.", 
    "review_text": "I came here after dinner for drinks and dessert.  I found a seat in the back room where it had a few small tables with chairs and a sofa. It kind of reminded me of someone's family room.     I heard that the bread pudding was good.  I love bread pudding!  I asked for coffee with my dessert not knowing that they would have it.  Sure enough, the waiter said they would make me a cup.  When the waiter brought my coffee, he said it would be on the house.  Apparently, the next day they were going to start serving brunch and they wanted my opinion of the coffee.  At that late hour, I thought the coffee was good.  It was very aromatic and on the lighter side.  I normally don't drink coffee after 6 pm because it keeps me awake, but I didn't have a problem going to bed.  On the other hand, I like my coffee stronger for brunch.  When the bread pudding came out, as it was set on the table, I saw it jiggle a bit.  That's a good sign.  When I dug into it, it was light and airy.  The flavors were really good.  It wasn't too sweet and it was served warm!  I'd have to say, it was one of the best bread pudding I have had!  I also had a sip of the Banchee Mordecai Red.  Yum!  Fruity and complex!  I asked the waiter if he could play a movie since the screen was in some standby mode.  A black and white Alfred Hitchcock played in the background as my friend and I chatted up a storm. The music didn't quite match the ambiance.  Hipster groups like Empire of the Sun was playing.  This is definitely a cool hangout spot for drinks and dessert.", 
    "review_date": "2013-07-11"
  }, 
  "6vnAwDEa66GB9-3P5wELZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon A.", 
    "review_text": "I came here for a drink with a date of mine before dinner.  I was surprised how large of a space this is and very tastefully decorated, the layout of the tables and chairs provides ample seating and its pretty easy to navigate.   The hostess Sara was absolutely fabulous, seated us promptly and was very attentive even if she wasn't our cocktail waitress.  I will definitely come again", 
    "review_date": "2013-04-17"
  }, 
  "dnGIi-OjEui4OSsmLQ2lPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sunny S.", 
    "review_text": "Ooh, I kind of love Noir Lounge.   I would go to NL solely for the Ambiance. It is all dark and a little sexy inside. The lighting is low and candlelit, which lends itself to making everyone look attractive. Even me. And I went dressed like Holly Hobby.   But before things get too sexy, there is a live pianist that bangs the bejesus out of them ivories. If you are sitting in the back, it's quite loud. If you don't like the company you're with, this is good times. Just nod and act like you can't hear. I quite liked the pianist's repertoire. He played Keane's \"Somewhere Only We Know,\" and Soundgarden's \"Black Hole Sun,\" among others. I got so excited when he played Soundgarden, I nearly fell out of my chair. That's just cool, you know?   I skipped the wine and got a beer-a Pilsner Urquell. My friend ordered a Scotch Ale from a Colorado brewery, which he didn't like. Score! I drank his too. I thought they had a nice beer list. I can't remember it very well now because of all that beer.   The food smelled so good and my stomach was eating itself, but I didn't stick around long, so I had to pass. Next time.   The parking around NL (Hayes Valley) will make you want to light yourself on fire. I parked in front of a church and defied them to have my vehicle towed. I was sweating it the whole time (another reason I had to peace out). Can you believe how terrible parking can be on a random Monday night?   Other than that, pretty cool. You'll look so hot here. First date central, for sure.", 
    "review_date": "2014-04-05"
  }, 
  "2h1B3IUp1TejELkxfffEkg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Giselle B.", 
    "review_text": "As a former SF chef &amp; restaurant manager I am always skeptical about a new neighborhood restaurant opening up in my community. While I've only lived in Hayes Valley for 3 years I'm very concerned about what new establishments are opening and what kind of impact they will have on the neighborhood.   Last night I visited Noir Lounge. I was very impressed with the overall look &amp; feel of the space. They completely transformed the old Frijtz location and it's a huge improvement. We sat in the back screening room and watched Vertigo on the big screen. The place was buzzing with patrons and the vibe was pleasant and relaxing.   Shortly after ordering a glass of wine (at 9:15 pm), we were greeted by the manager who very nicely informed us that they were closing at 10pm. We then learned that the neighborhood association when issuing their permit required them to close at 10pm daily. THIS IS ABSURD! Why would the neighborhood association do this? All of the other restaurants in Hayes Valley have licenses to stay open until after 11pm. The bars are licensed to stay open until 2am.   Noir Lounge is a nice addition to the neighborhood and I'm confident they will do well if the city will loosen restrictions to their operating hours. I'm not sure how a business can survive with such limitations and wish them great success.", 
    "review_date": "2013-04-19"
  }, 
  "LfnRtbyBps71jpojEPE3eA": {
    "user_rating": 5.0, 
    "user_location": "San Clemente, CA", 
    "user_name": "Lori L.", 
    "review_text": "What a fun place my daughter and I stumbled on when we were in SF for the weekend. We sat in the back room and had a couple glasses of wine, some appetizers and watched Casablanca.  A great way to spend a Sunday afternoon and a perfect end to a great weekend!", 
    "review_date": "2013-06-06"
  }, 
  "wiS1TMqEEIC1A3pmrPBSJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sea G.", 
    "review_text": "What a nice atmosphere!  We sat in the screening room and watched Casa Blanca.  Excellent selection of wines and draft beer.  The food is perfect to accompany a chat and drink.  Their small (not so small) plates are luscious.  A couple could share two plates and have a few drinks and easily be satisfied.  I love the selection of food, its eclectic, so there is something to please everyone, vegetarian and meat lover alike.  Trust the pleasant staff with your drink pairing.  Great service with out being overbearing, but there when you need them.", 
    "review_date": "2013-09-25"
  }, 
  "O13YdpM9qFqnp1NbjTBNsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy K.", 
    "review_text": "LOVED this place. Went for a drink with my boyfriend. We found a nice, quiet table but there were many larger tables with groups - this was around 9PM on a Friday. The ambiance and design of the bar are very cool. Lots of lounge/couch seating as well as big wooden chairs. The service was super fast for the amount of people there. The basket of fries were delicious!", 
    "review_date": "2013-10-07"
  }, 
  "pSms5uzIwl_eM6Gi7vVFYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin W.", 
    "review_text": "Great scene with a sense of intrigue created by the velvet chairs, draped curtains, romantic (read: low) lighting, etc. but unless you have a few hours to wait each time you want to have an exchange with the waitstaff, I'd recommend you go elsewhere. Case in point: the wine selection is nice and we wanted to order a second glass but by the time we were able to flag the waiter down, it was late so I just asked for the check. Oh and the good was good but not great - 2 Sisters (right next door) has better offerings!", 
    "review_date": "2013-10-29"
  }, 
  "vH-hR18SO5WL_HadjSXMmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ASIANDIVAH A.", 
    "review_text": "I have been to Noir twice..at night but never on b'fast or lunch. So when my friend told me they are open for Sunday brunch, I really wanted to give it a try. Honestly, I was just curious to see if this place is still beautiful at daytime. It is and some more...  The chicken &amp; waflles are amazing!!!! I even said theirs is better than FarmerBrown's! I feel like I betrayed a loyal friend just saying that!   My friend tried they mushroom omelette and it's yummy too! I like the rosted garlic on the omelette.   All in all, their b'fast menu is simple, unpretentious, short &amp; yummy. I will definitely go back &amp; try something else on the list.   Oh, the crew are as friendly as the people at night!   Kudos Noir!", 
    "review_date": "2013-11-19"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "Yum! Great ambiance and comfortable tables that aren't too close together. We stopped in here while waiting for a dinner table at Suppenkuche. The olive plate was good, although I wish there'd been a better black / green olive ratio, and the lamb sliders were nice and juicy. We tried their two sour beers. I liked the cherry one and my date didn't. The service was very nice, a little on the slow side (confusing bc they were fairly empty) but nothing major. I would definitely recommend this place if you're in the area!", 
    "review_date": "2014-01-06"
  }, 
  "rVA85dMsTw7B6v2opDuMuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa T.", 
    "review_text": "Whoa this place was REALLY COOL. Ambiance was very nice, and the place is deceptively large (a few quieter, private rooms, choice of tables, including a really long one toward the back). I loved it because I could actually have a conversation without having to yell, and the lighting was nice. Came here a little after New Years, when they still had winter decor up, which made the place EVEN CUTER.  Had a mushroom bruschetta, yum. Prices are high but oh well, it's Hayes Valley.", 
    "review_date": "2015-01-05"
  }, 
  "A8piN4-8W7hfxtDUVJEUDg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sue c.", 
    "review_text": "what a great find near the civic center/hayes valley area! great ambiance, classy and love the old school films. My friend and I grabbed a drink and the sweet potato tots which were delish. Couple of suggestions since they seem to still be tweaking 1) Please have a happy hour, love the fact you guys open early but why not have HH specials!! 2) you're one of the few bars that opens early so please keep that, it is awesome! 3) we had a female server, she was friendly but almost too intrusive, so let your guests chill out and have a great time   looking forward to coming back :)", 
    "review_date": "2013-05-30"
  }, 
  "_cUHHH6Qk8t6xTA-aMbMYA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R K.", 
    "review_text": "The place is very nice, beautiful decor, nice atmosphere. However the food is horrible. Re-heated pasta, overpriced and generally not good tasting.", 
    "review_date": "2013-07-25"
  }, 
  "FAbdbUdGEsahol2PVMrsAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eugene X.", 
    "review_text": "After a delicious dinner that knocked my date's socks off and me too full for dessert 'round the corner, we strolled down Hayes and looked into this spot.  Two empty glasses on the bar, two empty stools, no one smoking outside.  Glanced at my date, we both nodded as the slim well dressed male bartender cleared the glasses.  It was like fate had invited us in.   Maybe it was the great company, or the friendly female bartender with the most amazing red/white/blue earrings that knew when to pour another glass of wine, or the great weather, post Prop 8, post-DoMA joy of the Friday, whatever it was, it was terrific.  When the guy behind the bar asked me how my Friday was going, he threw me off because he just seemed so damn sincere that I answered honestly, \"Pretty fucking good!\"   Funky, conversation starting taps behind the bar, huge men's bathroom, big communal table, food too.  Self service popcorn by the bathrooms, but it was empty this particular night...and having seen it firsthand, there is NOTHING sadder than an empty old school popcorn cart on display. Stuck to the same glass of white all night long.   I'd cozy up to the bar after work or serves as a nice 1st/date/after date spot. Wonder what the weekend scene is like...potential to be great.", 
    "review_date": "2013-07-02"
  }, 
  "Lu3HIBJoGUAp-Gb3_a_elQ": {
    "user_rating": 4.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "David C.", 
    "review_text": "Classy wine bar. Super plush chairs. Lives up to the name. Feels like something out of a black-and-white gangster movie. Was playing some Hitchcock movie on the wall. Only had one dessert wine. Guess they are for real wine-snobs only =)", 
    "review_date": "2013-05-12"
  }, 
  "5-3b4IHx3EIMu-pX1cDHYQ": {
    "user_rating": 5.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Luke F.", 
    "review_text": "Great new bar.  Must try the chicken and waffles!", 
    "review_date": "2013-10-12"
  }, 
  "MtV_ehFusGwykpvlaKD-uQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meg G.", 
    "review_text": "I live in Hayes Valley and had stopped by for wine when they first opened and liked it but nothing moved me to come back. I yelped brunch places on my lazy Sunday and landed back at Noir. The service was over the top inviting warm and genuine. The food was perfect and the wine list fantastic!!!! My new neighborhood go to place. Well done!!!", 
    "review_date": "2013-10-27"
  }, 
  "innCVAQvYyduI7uHbV7ssQ": {
    "user_rating": 5.0, 
    "user_location": "Lincoln, CA", 
    "user_name": "Scott S.", 
    "review_text": "My wife and I came here before a show and we were very impressed.  The ambiance is fantastic!  Romantic, dimly lit, and very comfortable.  The service was amazing.  Both the waitstaff and the manager checked on us the perfect amount of times.  And last but certainly not least, the wine and food was great!  I had the steak and my wife had the chicken, each were delightful.  We shared a bottle of the OPP Pinot Noir, which was equally as fantastic.  When I am back in town, there is no doubt about where we'll  be headed.  Bravo Noir Lounge!", 
    "review_date": "2014-08-12"
  }, 
  "LTI86BSXBclY6UsZXqKYXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen C.", 
    "review_text": "MOVIE time with WINE.   This place is a recently opened wine lounge near Hayes Valley.  Ambiance: The restaurant offers an unique combination of wine lounge with a 1900's background theme. The restaurant has a cool projector in the back which shows classic cinemas. Additionally, there is a popcorn maker near the middle of the place where you can grab some while waiting for a table.  Food: There is a wide selection of food ranging from tater tots, smoked gouda cheese, to desserts such as bread budding. There is also a wide selection of wines around 50. The wines are great pairing with the food and definitely offers a different experience compared to other wine bars.  Service: The service at this establishment can definitely improve. We waited about 45 minutes to get a check, which I thought was quite long. The waiters seemed confused and disorganized and came by multiple times thinking they gave us our check. Besides the poor service, this is an interesting place to try out.  Overall: This place has a lot of potential to be a big hit in Hayes. Hope to come back again soon.", 
    "review_date": "2013-05-06"
  }, 
  "Skd2_Jiw4XAjbBBws3ia7w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter M.", 
    "review_text": "Good atmosphere, good food, good choice of alcohol and then boom!!! Loud music. Not like the radio is loud, but dude suddenly plays the grand piano in the corner. Not a random guy, but a designated guy. If he was good maybe it would be fine but he pounds on the piano really loud, and he makes so many mistakes, sometimes not even finishing songs. Didn't even have an extensive repertoire. People are yelling at each other to be heard at the tables next to me, I lost my will to talk. Good except the piano.", 
    "review_date": "2014-08-20"
  }, 
  "kN2HQbVCAB-XNRMXw861Vg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mac B.", 
    "review_text": "This is a gem for the neighborhood! I came here on a Sunday and claimed the couch by the front window for the afternoon with a Times Sunday crossword -- could not have found a better spot to pass the day. The wine and beer selection was great and pretty unique, and we were super pleasantly surprised with the crab fritters app, and then with the risotto and the chicken entrees. The ambiance is impeccable and the service was flawless. I already have my plans for the next rainy Sunday..", 
    "review_date": "2013-07-19"
  }, 
  "-HgGrg2UZgKA8iELR4rgEg": {
    "user_rating": 4.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Trisha S.", 
    "review_text": "A few friends were visiting from out of town so I wanted to show them Hayes Valley. We came across this wine bar and decided to share a bottle of wine after lunch at Arlequin.   We loved the decor and concept of the lounge, especially the back room with the comfy couches and projector on the back wall that plays old black and white movies.  We didn't try the food so I can't speak to the quality and the wine glasses had a funny smell inside... The service was also a little slow for the most part because it was one girl running around the busy bar. She was really friendly and recommended her favorite wine...  I just wish she had more help.   I'd definitely come back!", 
    "review_date": "2013-08-05"
  }, 
  "l-vxPfXBKA_LhkkBdM7rsw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah M.", 
    "review_text": "My fiancé and I hosted an event here this past Thursday, and the staff was so fabulously helpful. There had been a few email misses that made it a bit difficult to get hold of each other on both ends, but they were gracious about everything. They also worked to resolve any anxiety I had in response to missed emails. We reserved the back area and it was the perfect space to host 30-40 people. The ambiance was great for connecting with people as the dim lights and vintage couch invite you to linger. The old movie playing in the back room added some fun for everyone, including the 2 sweet children who were a bit bored while surrounded by adults. I also have to say, for a wine bar - they give excellent service to children. They poured them root beers in \"fancy\" glasses and were very welcoming. Considering the neighborhood and how elegant the space was I was a bit nervous that they would be a bit snobby about kids, but everything about this place is inviting. I wasn't sure what to order for people to nibble on, and they were very helpful. They talked to me about the menu so I could plan appropriate bites for our guests that would be both elegant and filling.  Through the night the service was impeccable, and even as we lingered in the back room and the place started filling up, they didn't rush us. I hope to host an event here again soon.", 
    "review_date": "2014-05-31"
  }, 
  "W7cXRCRMk7fV1HYEQhGYNQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cynthia M.", 
    "review_text": "Nice clean bar with a lot of different seating options depending on how big or small your group is.  Plasma TV's throughout the bar for your viewing pleasure.  Great wine selection. I didn't really look at the beer selection b/c I don't drink beer.  They have free popcorn (self service).", 
    "review_date": "2013-05-05"
  }, 
  "WnHR5MapKxVsBpog8hIvbw": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Dana B.", 
    "review_text": "Ornate, current, with screens on the wall playing films from a bygone era. A pianist hammers felt on steel strings to produce bebop fructose.  An inviting lounge in the back there, with a beautiful white tufted couch.  Drinks anyone?", 
    "review_date": "2014-05-06"
  }, 
  "brJDrKFzyIg3nP8gzH1Q2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ketan A.", 
    "review_text": "Excellent service, excellent food. Chicken is softer than a baby. Asparagus is crisp and garlicky. Lamb could use a bit more flavor but was very tender.", 
    "review_date": "2013-10-30"
  }, 
  "gq-APHARCChYnEBHRF1A1g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Evan B.", 
    "review_text": "So not sure where the flamers are coming from, but I also live in the hood, and this place is sexy, the servers are very approachable, responsive, and not difficult to look at! And there is free popcorn served on the old fritz French fry holders- nice touch. Wines on tap are surprisingly fresh and tasty and at least mildly interesting (for those who have wine on tap before, I was skeptical..).  To all the flamers: this place is still in its soft opening, and has been for less than a week. In fact, the varnish on the bar is still drying, literally!! Food is currently being served via pop-up kitchen....so to all the haters who are nit-picky complainers- chill out! Enjoy the extensive wine list and comfy and sexy decor!  I definitely enjoyed, and I will definitely be returning in short order.", 
    "review_date": "2013-04-05"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "This place was good the first week it opened, and now, well... the word \"great\" just doesn't suffice. Champagne and dessert... magical combination.  They rotate the desserts (please bring back that rhubarb ice cream thing!) so you can wear your big boy pants with a nice Cab or Malbec, and enjoy some milk and cookies for dessert like you know you want to.  Impeccable service, great advice from both the bartender and the manager.", 
    "review_date": "2013-12-02"
  }, 
  "ksRHD3gWsQGuK_r9GT-xKQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laima K.", 
    "review_text": "I liked noir lounge. Went there to work (I know work, right?). But really, went there to work and get a drink and it was great. Lots of comfy cool places to sit, dark mysterious atmosphere, noir movies playing in the background and a cool playlist of mellow jazz.   Internet is free and fast (15mbps!). Lots of outlets. And tasty drinks.  If you come here during their happy hour you can get the giantest glass of wine for only $7! It was unbelievable. Took me 3 hours to finish drinking it.   I will most definitely come back here again, if i need to get some work done or just to hang out maybe. I hear this place is a piano bar too.  Overall great experience. Fun cool spot. And not crowded or loud which is hard to believe especially in this neighborhood. Perhaps it's due to the size of this bar. It's huge. So it can feel intimate and spacious at the same time thanks to the adorable little nooks and booths and furnitured romantic corners.  Good for dates.", 
    "review_date": "2014-12-03"
  }, 
  "MxaaFrjsn3TWPbHhPey29g": {
    "user_rating": 1.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Ashlei S.", 
    "review_text": "Husband and I decided to leave after being ignored for 20 minutes.  We gave up after flagging down our server twice, once for menus and again to order.  Started to take it personally after we saw her spend several minutes with other tables.  Cant rate the food because we couldn't get service!   I thought about finding a manager to complain to; but thought better of it because I didnt want to ruin the evening waiting for them too!  Won't be returning.", 
    "review_date": "2013-08-21"
  }, 
  "tJNADammQ_Ia6xqKAbQgtw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nova P.", 
    "review_text": "The ambiance is cozy and laid back, but I was a little bit confused on the venue.    My friend said to meet at Noir Lounge, which I knew as Lunchpad.  Based on my experience I'm guessing the bar is known as Noir Lounge, and the kitchen as Lunchpad.  Service is generally friendly.  I've been twice and had a decent fried chicken lunch sandwich with a side of fresh Parmesan potato chips.  The second time I came I ordered a Pilsner and side order of potato chips (only $2-a delicious deal). You order food and drinks at the bar.  I asked to pay with cash, but the beer had to be on a separate tab and paying alcoholic beverage with a credit card is required due to technical equipment.  A little inconvenient to pay separate tabs for food and alcohol, perhaps they can work on making the check payment more seamless for the customer.", 
    "review_date": "2014-07-15"
  }, 
  "Z0u6nxfaHYeqdUnH_FnDiQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barry B.", 
    "review_text": "This place is ok. Good premise/theme for a wine bar with the black and white movies and all, but the service/experience is spotty.  1st visit - GREAT service. Super nice, personable server. Great suggestion for a moderately-priced bottle of wine. There was a weird bar/mildew smell in the back room where we were sitting though. This was during happy hour in the middle of the week.  2nd visit - we arrived at 9:30 on a Tuesday night. We weren't aware they closed at 10. We ordered a moderately-priced bottle of syrah, which they were out of. All good. We asked for a suggestion. She suggests another moderately-priced bottle and a nicer bottle. We order the nicer bottle. She brings the bottle back, opens it, then announces they will be closing in 20 minutes. GREAT. We just ordered a $60 bottle of wine and we have 20 minutes to suck it down. We would have just ordered glasses if we knew they were closing that soon. The server should have mentioned that BEFORE opening the bottle!  Whatevs. We probably won't be back. Peace.", 
    "review_date": "2014-07-10"
  }, 
  "J_1PrYg2sBg1lhAQnec40g": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Carissa Z.", 
    "review_text": "First time here tonight. Had a great time. Our waitress Katie is very friendly,  knowledgable and personal. She made good recommendations on wines based on my pallet. Thank you! Definitely coming back!", 
    "review_date": "2014-03-30"
  }, 
  "awmRirDC7WWig6R07XZ_oA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wakako U.", 
    "review_text": "LOVE at first sight, I feel like I'm in a library of my dreams (though there are no books) - I love love love the salad dressing for the salad that accompanies the steak and chase.", 
    "review_date": "2014-04-11"
  }, 
  "DrxGlDObuKcMb5y7OUJBWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marz G.", 
    "review_text": "It's always tough to review a place too early.  I think a rule of thumb should be that if you're checking it out in its first two months of being open - let alone the \"soft open\" phase - that you need to go easy on service criticism and focus on the material: food, drink, decor.  I'll break my own rule and talk briefly about service.  I went the past two Thursdays to Noir Lounge to meet friends in Hayes Valley for happy hour.  First Thursday, service was a little rough as was to be expected - I didn't have a problem with that.  Second Thursday - the service (with the same servers working) was vastly improved.  That's what you should hope for - to see improvement.  The second Thursday, they totally took care of us like I'd expect from a place that's in its prime.  I think the staff and management are well on their way to having this place running smoothly.  As for the material: food, drink, decor - they're great.  The place is very nicely done inside.  It's rare to totally overhaul a space as they did and have it feel comfortable.  These guys pulled it off.  The food so far has been excellent and should evolve - I read in the press release they lost their chef right before opening, so I bet this will only get better.  Drink menu - on both the wine and beer side - is well thought out with lots of options for different tastes.  I'm happy with pricing and also think the big screen is a plus for sports watching - will definitely catch a game here at some point.  I'll be coming back pretty regularly I think.  Definitely give this place a shot.", 
    "review_date": "2013-04-16"
  }, 
  "fyTNJNGgCgn2fH3Tvr-YaQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alejandro M.", 
    "review_text": "Great ambience and location!  Food menu is ok...what I have ordered has always been amazing.  The fried chicken is wicked good!  The staff including manager needs a redip in basic expectations of restaurant customer experience ASAP.  I do not how many times I have had to go to the bar myself for my drink refill.  When you ask for something, it is almost like you are bothering them. When they ask how things are going, they do not make eye contact - not genuine interaction what so ever.  I have also observed them leaving a table, and the facial expression confirms it all.    Overall, I really hope this place stays.  Owners need to be present to ensure customer experience and expectations are being met.  Cheers!", 
    "review_date": "2013-09-28"
  }, 
  "vRhya8Ig7llSdrvWrSuovw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Isabel P.", 
    "review_text": "The wine and food at this place both amazing.   The service is bad bad bad. They are incredibly snobby.  My partner and I used to like coming here while we wait for our table at Domo because we like a good glass of wine, but everytime we struggle to get the attention of the waiters. Finally, when we ask for what we would like to drink or munch on, the drinks take a long time. Come on it's just a glass of wine, should take 15 minutes to come to the table. Then the struggle to pay is another challenge.   Last time we decided to wait and order at the bar rather than sitting at a table, when we walked in and stood in front of the bar the bar tender told us that we could sit down anywhere in the place and a server would come (all the stools at the bar where taken). We smiled and told him we would rather order at the bar. He completely ignored us. We stood there for 10 minutes, no service, no engagement, nothing.   We decided to walk out and go to Two Sisters instead where service is way better and less snobby.   Will we come back? My man and I probably no. My girlfriends and I probably, but very probably.", 
    "review_date": "2015-01-13"
  }, 
  "9d9kgq7womnxi_NGKsJMEA": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Frank J.", 
    "review_text": "Noir Lounge is pretty good for what it is. They have a descent amount of wines available by the glass and a much larger selection available by the bottle. The beer list is not bad all things considered and the bar towards the back has rotating craft beers on tap.  The decor is dark and dimly lit and a bit on the fancier side, definitely not the scene for dive bar goers. The room in the back is pretty cool and has a large projection screen playing classic films which is a nice touch. The service when I came was acceptable but nothing to rate them well for.  The biggest downside here is the food, which was just bad. Their attempt of a modified \"grilled cheese\" was disgusting and was not grilled nor very cheesy. My wife and I played rock-paper-scissors and the loser had to finish off the sandwich as punishment (we don't waste food, even bad food). The meatballs were okay but a bit underwhelming and not worth the price. The only thing enjoyable to eat that we had were the potato tots, but they were also priced higher than they were worth.  Summary: Not a bad place to start off a night but that is it. Come here for a drink before heading somewhere else (some great restaurants in the area, and other watering holes have been popping up lately). Don't plan on staying long and definitely do not plan on eating here.", 
    "review_date": "2013-08-16"
  }, 
  "3sUh2Ok0GrAbO3Hd9f8csQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lisa t.", 
    "review_text": "$12 for a mediocre glass of wine is annoying.  Food was cold, even happy hour wasn't a good deal. Not impressed.", 
    "review_date": "2013-12-05"
  }, 
  "P1aS3PSrUqze_fpjAhHxSA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Matt K.", 
    "review_text": "This is a beautifully designed bar with a film noir theme. Worth going to check that out alone. Very good beer &amp; wine selection, and the food was excellent. Sounds like they just got a new chef who completely revamped the menu...not just small plates anymore. We had apps, salads, and entrees, all of which were delicious (Can't stop thinking about the poutine!). I see some past reviews had an issue with the food quality/portion size. If that's the case, go back, and try the new menu.", 
    "review_date": "2013-08-26"
  }, 
  "gzpBM2cLAojp8McEj4cx-A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel L.", 
    "review_text": "If you have a waitress actually come to you, you can order some of the overly expensive and not filling food.  The food really isn't worth it.  The wine selection is okay but once again, you have to hope the waitress will come to you to actually order. Or you can sit at the bar.  But this is supposed to be a lounge-feeling bar...Good luck ordering a 2nd glass if you liked the first class.  There are much better options in Hayes Valley for a drink and food!", 
    "review_date": "2013-11-14"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "I was lucky enough to be invited to a media reception for Noir Lounge - the sexy, new wine bar in Hayes Valley.  I really dug the vibe in this place. It's both modern and retro. The interior reminded me a little bit of the old Ambassador on Geary (kind of retro-chic). They have two bars for your wine/beer needs; a long communal table, and a V.I.P. room where they play classic films like \"Maltese Falcon\" on the wall while you sip the night away.   As part of the media event, we were treated to some bubbly and bites. Chef Joanna Karlinsky (formerly of Meetinghouse, Elite Cafe, and Sweet Jo's Cafe) has created an eclectic menu of gourmet movie theater snacks and shared plates to pair with your vino (everything from Swedish meatballs, deviled eggs, to Joanna's famous Meetinghouse Biscuits). There were also some tempting desserts floating around the room, but we left before I could try them.  In any case, I was definitely impressed with Noir Lounge. It's a wonderful, sophisticated addition to Hayes Street. I'm looking forward to returning here soon (preferably with a date), a pin-striped suit, and my fedora hat.  Somewhere out there, Humphrey Bogart is smiling.", 
    "review_date": "2013-04-30"
  }, 
  "l0ohqVeCYBC6Idb-bF8dRw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Steve G.", 
    "review_text": "I attended the soft opening at Noir Lounge the other night and I was very impressed by the quality of the food and wine! The atmosphere they've created with the space has a unique feel to it. A film lounge? Sign me up! Our server, Olivia, was also very attentive and made the entire night an enjoyable experience. I can easily see this place becoming my go-to spot for drinks with friends in Hayes Valley.", 
    "review_date": "2013-04-02"
  }, 
  "d4_dSGZ-Rqeo8c1PgsjtiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandre T.", 
    "review_text": "I feel shocked and saddened after reading a fellow Yelper's 1 star review. What makes me even more sad is that he appears to have been invited through friends of friend to the Happy Hour I helped organize at Noir Lounge last week (we go try new bars a couple of times a month).  Well let me tell you, Noir Lounge is AWESOME. Unlike this yelper who sounds like a whiny as$hole, I thought this place was great, along with the 20 or so other friends who joined us. Everyone seemed to highly enjoy the venue and the service was great.   I too, happen to travel all around the world and I can't even begin to understand this dude's comments about how this compares to the bottom 10% of the world. This dude is a wannabee critic and obviously knows nothing about anything he is talking about.   I ordered my drinks through the cocktail waitresses who were genuinely friendly (much more than what I am used to in the city's establishments) and delivered my drinks quickly. The manager and owner of the bar came to me multiple time to check how we were doing and seemed completely sincere.  They are really trying hard to make this place a great venue in Hayes Valley and I admire their effort.  As a new venue, there may be some small issues here and there at some points in time, but that should be expected from any new place (I personally didn't notice anything negative). Instead of smashing new business' reputation on Yelp and act likes entitled asses, people should  learn to support local businesses.   Noir Lounge, thank you for believing in Hayes Valley, you have our support!", 
    "review_date": "2013-04-06"
  }, 
  "sZsurHFiUbGQr3FB8sS27A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francesca H.", 
    "review_text": "Considering myself decently qualified to assess wine bars (I run/work in a few) this bar is stellar. The staff is so friendly; I was lucky enough to be taken care of by Jessica. The environment is quite breathtaking. I am such a sucker for deep, neutral colors and classic decor and this bar has it down.   During my time here, they got a decent amount of tables at the same time and my experience did not waiver. I will definitely be returning and encouraging others to.", 
    "review_date": "2013-09-03"
  }, 
  "VEOD6Y-w1UoRnxzJZjTI1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M S.", 
    "review_text": "This is exactly what you would expect of a Noir Lounge.  It is dark inside with rich sultry finishings and furniture.  A film noir, not surprisingly, plays on a wall.   Drinks are decent and some of the bar snacks are worth eating but many are fried or greasy.  The crowd is cool and eclectic.", 
    "review_date": "2014-02-15"
  }, 
  "5hCRkGLTSf8ax3Ck14WPiA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda S.", 
    "review_text": "Terrible service, good wine. I can handle the bad attitude, but the waiting time was unbelievably long... and they only had one other party of people there!", 
    "review_date": "2015-01-16"
  }, 
  "DlwexC7z88ymAzu45skODw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Terry N.", 
    "review_text": "Pricey, but good.  I came here with a couple friends for an early dinner on a Saturday night. It's a pretty new place so I wanted to check out what happened to the old Fritjzszs. The atmosphere's great- much bigger than it appears upon first glance, as it goes really far back in the building and has a lot of cool nooks. I particularly like the second bar area in the back. And the decor's great too.  The food was quite good, the chicken and waffles really stood out- juicy crispy fried chicken and fluffy waffles, paired with a duo of creamy gravy and a decadent maple sauce, and topped with candied pecans. Stellar. The poutine appetizer was also delicious.   So- overall a good place for a drink or snacks, just be prepared for the bill... Things add up quick!", 
    "review_date": "2013-11-17"
  }
}