{
  "lXJpiJHkIiLv4ntFmVhDvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Prima D.", 
    "review_text": "THE place to tip a few before dining in NB ! this is our absolut (vodka) fav stop before going to North Beach Restaurant, Wash B &amp; G, et. al. when the Gold Spike closed I didn't think we would frequent the Northstar as much, but we def do. what's not to like, the boys are cuuuute, boyfriend talks sports with the barkeeps (snore), and I can people-watch as the location is grand -- this corner is prime real estate. always friendly and not pretentious in the least. but we do avoid the late-night Friday/Saturday crowd . . . why in the world would I want Bud spilled all over my designer stilettos ?!", 
    "review_date": "2006-09-11"
  }, 
  "ofT4lkQV672sWzR6W1gz1w": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Jason F.", 
    "review_text": "Found the Northstar as we were walking through Northbeach, we ended up watching the Pats/Dolphins MNF game and had a GREAT time! If I lived in San Francisco this definitely would be a bar that would be a regular destination for me.", 
    "review_date": "2010-10-11"
  }, 
  "QCAJ7bRsCq40mQtdQeRiYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt A.", 
    "review_text": "4 years ago this would have been a 5 star place (God I am getting old), but then it became popular.  Good luck getting a beer or a game of pool, but if you want to come in and try, power to you.  It is still a pretty fun place to hang out...good music and the crowd gets pretty rowdy as the night moves on...", 
    "review_date": "2008-02-25"
  }, 
  "F01s5dK-Rit8g_SlSkJdTA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ava S.", 
    "review_text": "When I moved to SF right after college, my friends and I used to spend every Friday and Saturday night at Northstar. Utter craziness and debauchery. Lots of single people. Lots of drunk people. Lots of mornings regretting the happenings of the night before.  All in all, it was a good time. The staff is awesome (big shout-out to Hooks), they make a mean Cosmo, random \"famous\" people are always there (sports people, crazy reality show \"stars\"), you can always meet new people (their quality is questionable however), and no one cares if you're wild and crazy and silly.  I'm older and wiser now, so I haven't been back in a very long time. But I'll always have fond memories of my time spent at Northstar.", 
    "review_date": "2007-10-15"
  }, 
  "EQGGXZXuQ9oAO4lNbcTzEg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Leila V.", 
    "review_text": "Great local bar in a great location. I live nearby have a great time eveytime I go! Northstar is low key, lots of TVs and pool table in the back. They have reasonably priced drinks, good crowd and a great staff. The owners and staff are extremely welcoming and make it feel like a small town bar in the middle of a big city! I definitely recommend Northstar to anyone who is looking for a place to go in North Beach!", 
    "review_date": "2010-09-10"
  }, 
  "kyAo52QbL24HKgapfw1T_w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess W.", 
    "review_text": "Great dive bar if you like that sort of thing...lost one start for the inability to play any music on the jukebox (even though it will take your money..no one ver hears their song) but cheap, casual night with a tolerable crowd.", 
    "review_date": "2007-04-12"
  }, 
  "nYufXwZH9ooB_zjNJf8Xlg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Morris D.", 
    "review_text": "Pretty much my 2nd fav bar in North Beach after Columbus Cafe of course. Usually a fair amount of people here, but never packed sardine style. Never encountered any form of douchebaggery knock on wood.... never really had a hassle getting something to drink and they almost always have some sort of special going. Especially fun here during the day during football season. Seems like a big Michigan bar. One thing that's kind of a pain in the ass is there's a minimum for debit/CC's. Not that big a deal I guess because a lot of bars are cash only.", 
    "review_date": "2011-03-07"
  }, 
  "T6SuLkeGko0shJacHYWq6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate V.", 
    "review_text": "This is the first bar I went to when I moved to San Francisco.  Good sports crowd always watching a game.  It's a nice little neighborhood bar for sure.", 
    "review_date": "2007-06-16"
  }, 
  "NN5jldDW0Puf8E3ZZjKqsg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "megan w.", 
    "review_text": "Wednesday through Saturday night frat party from hell. One star.  Tuesday nights of bartender Erin's mai tais and G-Love's \"Cold Beverage\" on the jukebox. Five stars.  Annoying location. One star.   Naked lady art. Five stars.  Three stars.", 
    "review_date": "2005-09-14"
  }, 
  "b0p3fOxJcZjB3iTl7zoqTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rego S.", 
    "review_text": "This actually feels like two joints in one.  Up front it's a crowded lame dive bar, but in the back there's this elevated area with small tables, one of which is a pac-man table.  That's the place to be while waiting your turn at pool.", 
    "review_date": "2005-12-31"
  }, 
  "HXwc6YOOq6hcZl0ovFeHiQ": {
    "user_rating": 4.0, 
    "user_location": "Salt Lake City, UT", 
    "user_name": "Charles S.", 
    "review_text": "I don't know why this place is called a \"cafe.\" As for as I can tell, it's a BAR! And a great one, at that. It's a classic dive bar with friendly bartenders, cheap drinks and a phenomenal happy hour that goes from 1-7pm.  We spent a very memorable afternoon/evening here... it's just a shame I can't remember more of it.", 
    "review_date": "2013-07-03"
  }, 
  "SZ_mPPrzfwmsnIlMLED-5w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ash D.", 
    "review_text": "This place is great during the day. You can do whatever. Saturday nights get pretty rowdy and there are always more guys than girls. Go on off nights and they are usually the best nights. Its a good place to watch sports. I watched the bball playoffs here last year and it was grrrreaaaat! Warriors beating the MAVS!! Good times. Alot of interesting and diverse people comin in and out of this place. Just Saturday nights get a little Fratty.", 
    "review_date": "2007-12-13"
  }, 
  "PPEgF0ovu0ONQc55AklA9A": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "caley t.", 
    "review_text": "Bills backers bar.  Unlimited free popcorn.  Pool tables.  How can you go wrong?  Super friendly bartenders who are happy to turn on any game you want. Everyone seems to know each other, and you might even meet someone happy to buy a friendly stranger a shot or two.   Good beers, good people, check it out.", 
    "review_date": "2012-02-26"
  }, 
  "XgXeGLT_MXYVt9PoPtxr4g": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Meg M.", 
    "review_text": "#1 favorite bar in San Francisco - nay - the WORLD. The greatest combination you can get of low key, nothing fancy atmosphere, cheap good beer selection, lots of space, places to sit if you want, free pool, free popcorn, decent jukebox selection, and a great crowd - no cheesies allowed.", 
    "review_date": "2010-01-22"
  }, 
  "rbPJO1Mc5ddzgucXelSQ0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony L.", 
    "review_text": "One star off because they didn't Close Caption the High End Prostitution story on CNBC. I really wanted to know the ins and outs of being a high priced whore...I mean, call girl. You never know. This IS San Francisco, you know.  Great prices on Happy Hour drinks and how can you beat a 7 hour Happy Hour? Freaking A! That's almost as long as a whole shift at work! Think of the havoc I could wreak on this place if I were there all day. Think of all the pints I could drink...Hmmmmmmm......  Great bartender. Very friendly and will talk to you if you want someone to talk to. I think he is into FPS on the game consoles so you can open with that as a first topic. I had a wonderful companion to drink with and to try and educate about on hockey. You will succumb to the thrills of hockey. Yes, you will!!!", 
    "review_date": "2008-11-26"
  }, 
  "-Mn7rmabxBEB9nVIw44yZg": {
    "user_rating": 3.0, 
    "user_location": "Piedmont, Oakland, CA", 
    "user_name": "Conrad B.", 
    "review_text": "North Star Cafe is the least cafe Cafe I've ever been to. :)  No, but really, it's a cool place. Free pool and popcorn and happy hour til an undefined hour (some say 7, some say 7:30, some say 8, I don't think anybody really knows).  Lots of seating, bartenders impressively attentive for having a number of people in the \"cafe\" that would far and away surpass what the fire code would recommend as a maximum number of patrons at any one time.  Our bill wasn't what we expected, but I think it's because my friend's definition and their definition of \"well drink\" didn't jibe. And there were so many people in there, why bother.  I'd come back, why not?", 
    "review_date": "2012-10-23"
  }, 
  "2l0O1EI1m0yWjFo2zSt71w": {
    "user_rating": 4.0, 
    "user_location": "Carmel by the Sea, CA", 
    "user_name": "Shiho F.", 
    "review_text": "Northstar Cafe was kind of on my walk home from work.  We had many great work related happy hours here... big fan like ellyk E.  We used to live together, work together and frequent this old neighborhood divy but hip corner joint.", 
    "review_date": "2010-03-01"
  }, 
  "8d6Mdzh_GWk9gZTqrsGJrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica R.", 
    "review_text": "This place makes happy hour even more happy. I walk in and feel happy instantly. I leave feeling happy (and slightly buzzed), I remain happy for the rest of the night. Northstar Cafe, you make me happy. Thanks!   I have only been here for happy hour, not on a Friday or Saturday night, so I can not attest to the weekend crowd, during the week it is casual, laid back, local, and relaxed. Just the place you want to chill on a week night with friends.   I saw some pool tables, they have seats by the windows, full bar, attentive bar tenders (a requirement to make me happy). Can't wait to go back!", 
    "review_date": "2008-08-08"
  }, 
  "77yYWUD7hvvrHIXiGSR8yA": {
    "user_rating": 3.0, 
    "user_location": "St. Helena, CA", 
    "user_name": "Katie C.", 
    "review_text": "This is the perfect place to go if you're one of those  girls who thinks that true love can be found in a crowded, beer-soaked bar in North Beach on a Saturday night.  For those of you who are always asking your girlfriends, \"so where are all the single guys in San Francisco, anyhow?\"... let me tell you something, they're hanging out at the North Star Cafe.  Young and old, hipster and preppy, drunk and drunker, if you're looking to take home some digits (or, for the more adventuresome gal, the guy himself), it's like shooting fish in a barrel.  Oh, and the jukebox rocks.", 
    "review_date": "2005-05-08"
  }, 
  "j3HWFkN7AQUatCmVJkJxIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole A.", 
    "review_text": "So, they used to have a popcorn machine which would warrant 5 stars since access to these buttery morsels of goodness has been known to sway my good opinions to gross extremes.  I learned last night that the popcorn was attracting rats who were chewing through the electrical wiring, so until they get their doors sealed there will be no popcorn.  Booooo.    That said, there were a ridiculous number of dudes there and $1 Buds until 9:30.  I'm presuming the Buds attract the guys and the guys attract the Buds.    There's a pool table, semi-adequate seating, and a relatively good beer selection.  The bathrooms are tiny, though.  I have a feeling I will frequent this place again when it's the guys' night to choose.", 
    "review_date": "2007-01-20"
  }, 
  "JfBTrZokq2AkH-XrRdfDXw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "johnny t.", 
    "review_text": "This place is great.  I went to the OPD fundraising event where all the money from drinks went to the OPD Memorial Fund. The fund was established by Deputy Sheriffs' Association of Alameda County after four Oakland police officers were killed in the line of duty.", 
    "review_date": "2009-04-10"
  }, 
  "RnzQ_yhFl4Cqh8sIq7Oaow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan T.", 
    "review_text": "Best bar in the city and possibly the entire West coast....maybe even the world.", 
    "review_date": "2007-12-10"
  }, 
  "5O8fn99pTl2r72AfySA_9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsey K.", 
    "review_text": "This is a great neighborhood bar. The bartenders are all friendly, they offer free popcorn, the drinks are very affordable, and best of all, they play the LSU football games during the fall season! They are strictly a bar - so there is no kitchen, but during football season, they sell Louisiana style cajun food out of big soup kitchen containers. I think the food is prepared off-site so it is cash only. A nice touch!", 
    "review_date": "2014-09-08"
  }, 
  "ZObHXI05ILUFpDo_m7DjzQ": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Andrew D.", 
    "review_text": "Like a shiny beacon of tasty cocktails guiding you to a comfy bar stool.   The Yelp Elite event Drink &amp; Hunt began here. As usual, I arrived late and was unable to truly partake in this cozy little corner shop bar. I definitely could see myself frequenting this spot more. Not too big, they have very friendly bar staff, and a pool table in back. I think I'll challenge their Ol' fashion skills and order one next time I'm there.  After all our waivers were signed and teams divided, we set out upon the streets of Little Italy for the hunt.", 
    "review_date": "2011-12-12"
  }, 
  "TB5W28xzvfW0mjbbCvJUvw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric S.", 
    "review_text": "The US Naval Academy Alumni have chosen Northstar as our weekly watering-hole for the games.  It's a great place to watch a game (football or otherwise) and grab a drink.  The owner is great, and the staff are truly fun.  I feel like a regular just walking in.  There is no food, but they have many menus behind the bar to look at for ordering delivery.  If you want a fun local bar...this is it.", 
    "review_date": "2010-11-29"
  }, 
  "0E3zMPX6TWMUJ1NKkJNNBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacey L.", 
    "review_text": "Quaint little dive bar.  I broke $100 &amp; the bartender stiffed me $10 in change.   I only noticed after I had walked away from the bar with our first round of drinks.  Guess I should have paid more attention.", 
    "review_date": "2011-12-11"
  }, 
  "6ATfXxQLQuRAQ30-nLI6Yg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph F.", 
    "review_text": "OK I  don't get it.  Seriously...  Every female I know absolutely LOVES this place and insists on dragging me here.  Like no joke they always want to come.  What I don't get, is that if all women seem to love th eplace, how does it turn into a sausage fest every time!?!?!!    All the bartenders are pretty friendly and the vibe of the place is pretty chill on a weekday night.  Weekends get pretty crazy, and when it gets too crowded it loses it's allure pretty damn quick.    stays fun if you can get a table though, and the pool table in back is definately clutch.  Guys room has some great reading material for while you pee!!", 
    "review_date": "2009-06-10"
  }, 
  "cY2O_YfM_e45jkiYl4U3Sg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jordan S.", 
    "review_text": "We came here for the SDSU game because Shanghai Kelly's is always packed! I cannot say a bad thing about this place!   When we first got there most of the tables/bar stools were taken so we went into the back by the pool area which was fine. However, the owner came up to me and told me the game sound was going to be on in the front not the back. When I told him there were no seats left in the front for our party of 6, he left, came back and found us a table, gave us stools and put us in prime spot to watch the game! On top of that, he provided us with some snackified popcorn! He also took some complimentary shots with us :).  Such a nice guy!  The bartender was so nice and attentive. She knew exactly which group I was with and always got me a drink when I was out.   Seriously the best customer service I have ever received at a packed bar. On point.", 
    "review_date": "2014-03-31"
  }, 
  "l7V5w_vf9xv74As3abZukA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John Eric S.", 
    "review_text": "Great spot to meet up with old buddies, have a few beers &amp; shoot pool.  I remember this was one of the only places in North Beach that used to go off on Thursday nights, but that was a long time ago.  Only downside is how small (&amp; sometimes stinky) their bathrooms were.", 
    "review_date": "2008-05-22"
  }, 
  "piJBDHkAb3eBLBryJIwBtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bud L.", 
    "review_text": "Fun atmosphere, nice bartenders, and familiar faces.  I always have a good time here (sometimes a little too much of a good time).  And they have a pool table.", 
    "review_date": "2013-04-22"
  }, 
  "M7i_ayzVxB0MBZuxFSzdUA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Mike P.", 
    "review_text": "I basically lived in the Northstar for the summer of '03...and looking back, it's a glorious haze. Cheap beer, popcorn, solid juke box, Mrs. Pac Man (Pizza-Hut sit down style for you 80's revival folks), a pool table, and laugh out loud pictures in the men's bathroom...oh yeah, and the crowd is usually pretty rowdy and good looking. Get invovled.", 
    "review_date": "2005-08-18"
  }, 
  "pRBzWnFzaCEtqhYyJ2ZTDQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "This bar is by far the best in San Francisco. In case you hadn't guessed I already love this bar. But Caskey is amazing. Always pouring me the best drinks, the friendliest girl ever, and has an AMAZING body. Who could ask for more in a bartender.   Come here. Find Caskey, and tell her she looks gorgeous and then tip her damn well.", 
    "review_date": "2012-04-12"
  }, 
  "nbOYS_LPTy_d1UtC_B9fAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan C.", 
    "review_text": "guys....  you realize the ratio of men to women is something like 8 to 1, right?  I rememeber when this place was a divey little bar. Now it's one of the busiest meat markets in the city. If you're looking to just grab a beer, fuhgeddabout going on a weekend night.  However, what I can truly say about the place is that the bartenders are cool. If you happen to go on a slow night, ask them anything about sports. These guys are on top of it.   Tip for the guys: Stop talking about yourselves. Ask a lot of questions ABOUT HER and make sure her friends like you. Send your wing man to get the drinks because it might be a while before the drinks come back.", 
    "review_date": "2007-03-27"
  }, 
  "f2c0zHEZf64GPxAcjP6pzw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natasha P.", 
    "review_text": "It was pretty chill; me and my co-worker who was asking for the impossible (a pina colada in a little bar) one Friday evening when the city was on the brink of winter. We were talking about flat screen televisions when all of a sudden a bunch of people wearing silly Birthday hats skipped in and from that point on, all we were saying was \"HUH?\" and \"WHAT??\" From that point on people were doing what they were supposed to be doing: having a great time with their buddies. Me and the co-worker were a little miserable, even after three drinks. We really only stayed because we had to fulfill the $20 min to use our credit card. We shoulda just stuck with Red Jacks.", 
    "review_date": "2008-12-08"
  }, 
  "7OfrRi-xGESQsBpJFrlfLA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "jozilla w.", 
    "review_text": "the women's bathroom here is RIDICULOUSLY small!  i used the men's bathroom as well (as the single stall for the girls was taking way too long) and I'm appalled that the men's is actually bigger than the women's!  I went on a friday night and the place got packed, with all-american fraternity/sorority types drunkenly trying to make passes at each other (knocking me over in the process).  still, had a good time and the bartender made a pretty strong kamikaze...", 
    "review_date": "2007-04-30"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "When you need a taste of home (East Coast)..... Northstar When you are looking for a chill place..... Northstar When you want cool bartenders..... Sub at Northstar When you want to watch the Patriots or any team.... Northstar When you want to chill with Boston peps.... Northstar Where everyone knows your name..... Cheers When you just need the score of the game, but stay for drinks.... Northstar When you want a great time..... Northstar  $20 min charge for credit cards ATM's around the corner One Pool Table in the back Small Bathrooms No food is served here except POPCORN, but feel free to bring your own grub.", 
    "review_date": "2007-12-25"
  }, 
  "3x5lSl6hQfdmAzC_tQbslg": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Katie W.", 
    "review_text": "I like popcorn. And beer. And juke boxes with lots of Michael Jackson. Northstar has all these things. And to boot, my boyfriend lives across the street.  I watched a few football games here last season and they make a mean bloody mary which was good Sunday morning companion. Just don't expect to be at all productive after having two :)  Pretty bare bones and by no means fancy, but that is just how this girl rolls sometimes.", 
    "review_date": "2009-07-09"
  }, 
  "lF6EbR0ikhvegGdm4SetjA": {
    "user_rating": 4.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Lu G.", 
    "review_text": "Cool spot. Plus free popcorn.", 
    "review_date": "2013-07-12"
  }, 
  "UM6lDrQXW_S72t0x4mjDVQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristopher M.", 
    "review_text": "My friend said hey,lets go play pool,we got there,and its free pool! you have to love that,i been going there ever since,pool,good beer,and the locals are nice,and the bartenders are nice as well,very good bar to go chill,play pool or a casual date", 
    "review_date": "2012-04-13"
  }, 
  "kFreISml3LNEuczAkeeokA": {
    "user_rating": 5.0, 
    "user_location": "Washington D.C., DC", 
    "user_name": "Molly M.", 
    "review_text": "It doesn't get any better than the Northstar. Good people, pool, popcorn, all things Buffalo. My brother lives around the corner and I will be visiting for the weekend and look forward to spending my share of time at the NStar.", 
    "review_date": "2011-03-14"
  }, 
  "vJJaUSb4wTGXteeNI7wFBw": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Seila K.", 
    "review_text": "We came here on Saturday night, trying to get my Huskies game on TV. There were various college football games on TV saturday night including Cal, but UW was on one of the other TVs. The bartender was very happy to change one of the TVs in order to get the game on a TV where we could sit and watch the game.  The bar was pretty cool. Not too nice, but not too bad either. There was the main bar, then some tall tables and chairs with another room that had a few booths and a pool table in the middle with about 6 flat screens.   Great experience! I had someone yell \"Washington! Boo!\", but that's part of the fun of a sports bar. The bartender even introduced himself to me later and said that anytime I come in, he'll have the game on. Too bad I don't live in SF, or I'd be here for every Husky game. He even came by later when we made a good play and gave me the fist.  A fun bar that I'll definitely be hitting up when I'm in the city!", 
    "review_date": "2009-09-08"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "The corner bar is always a great place to have a beer while you are doing your laundry and watching the NCAA basketball tournament  . I tend to stay away on the weekends, but during the week you never know what you will find at the Northstar...", 
    "review_date": "2006-04-28"
  }, 
  "HmdrNBljnCLNr1yhBBfvQg": {
    "user_rating": 4.0, 
    "user_location": "Rochester, NY", 
    "user_name": "Michael B.", 
    "review_text": "I heard this was the Buffalo Bills bar in San Francisco, and I was not disappointed.  It was a great place to watch a game filled with quite a few foolish Bills fans.    The drinks were reasonably priced.  There was a drink with Sweet Tea Vodka and Lemonade that was too amazing; I had to stop after two or my day would have been short.   The beer selection was solid, and I know all the Western New Yorkers enjoyed having Labatt Blue on hand to watch their Bills.  If \"nice dive bar\" is a type of bar you enjoy or if you are a Buffalo Bills fan in San Francisco, you have to go Northstar.", 
    "review_date": "2015-01-08"
  }, 
  "WjvIGdLc7ZZpiux3P6xSEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina G.", 
    "review_text": "I've passed by this place a million times before but never ventured inside until a few nights ago. Ended up here randomly after midnight on a Friday night and it was packed until closing time. I think I will come back during a less busy time to play some pool next time I'm in the neighborhood.", 
    "review_date": "2013-08-26"
  }, 
  "N67UV9tXgKEqFINl1P2kQg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greenballoon X.", 
    "review_text": "I shudder with feelings of skeeziness upon contemplating the frat-party gone horribly wrong that is Northstar. I'm by no means anti-dive bar, but there had better be some compelling features to offset the grunge factor and Norhtstar just doesn't offer any redeeming qualities. The room in the back with the pool table is pretty cramped, if you're looking for a game or a place to sit down. The place has got a funk that's just not kosher and the night that I had to step over yakkage to get to the ladies room explained a lot of that. There are so many places to get a cheap beer in this city, I just wouldn't want any of my friends to waste their time here.", 
    "review_date": "2007-09-04"
  }, 
  "QzNHF6_loOyRZqdFRwBlJQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jay l.", 
    "review_text": "During happy hours, beer is only $3 a pint. Even though the small pool table isn't as nice as Columbus Cafe or Gino &amp; Carlo, free pool so no complains here. There's also free popcorn, and they have the NBA and NFL packages.  North Star Cafe is a dive bar with some middle-aged men. But, it's a good place to hang out if you love sports and pool.", 
    "review_date": "2008-09-19"
  }, 
  "sH_t9HCv3hIxVagul3J3gQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William B.", 
    "review_text": "Long happy hour, free popcorn, lots of tvs with sports on them.  If this is your thing, then you'll love this place.  We started out here before wandering elsewhere on a Friday and it fit the mold very well.    It wasn't crowded, music was decent, and the bill was miniature.  Nothing spectacular here, but everything was good.", 
    "review_date": "2009-11-16"
  }, 
  "t1xrp7wJvLs4i2dB9xxZIg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Morgan B.", 
    "review_text": "I love North Star! Discovered it a few months ago and have been OBSESSED with it ever since. All the employees are friendly, cheap drinks, free pool and popcorn from 1-7PM! What more do you need in life?!  Also, Molly the bartender is the best person you will ever meet in life. Enough said. If you don't go to this bar you're missing out on a great experience.", 
    "review_date": "2013-08-19"
  }, 
  "5Vb1p0MOnwm31HELXOf5jw": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Kayla M.", 
    "review_text": "Just popped in for a quick pre-show drink as I was dragged to Beach Blanket on a Sunday when the place was booze-free.  It seems like a really great neighborhood bar.", 
    "review_date": "2009-12-14"
  }, 
  "u0K-u-GQ7bOhe3HT00JmbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabor C.", 
    "review_text": "Friendly neighborhood bar during the week, meat market on weekends.  I enjoy going here. It's usually pretty crowded on Fridays and Saturdays. Like ourselves, everyone here is pretty. We take bets on which cuties will end up making out with which of the frat boys. A very entertaining place.", 
    "review_date": "2007-07-29"
  }, 
  "lnO0vGg4PgC2K9p_NBiQig": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Jonar A.", 
    "review_text": "The happiest of happy hours!", 
    "review_date": "2011-08-01"
  }, 
  "tGgTIueZy1JNTzQD9rkZLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "We stopped by Northstar one night before taking on the all you can eat sushi challenge at Sushi Hunter.  You would think we'd be smarter than filling our stomachs up with beer first...but we had time to kill.  Happy hour, M-F, 1-8.  Um, HELLO!  8!  We got a table in the back and immediately realized that everyone in the back room was already belligerent.  Resisting the urge to join the party (since we had dinner plans, after all), we kept to ourselves in our booth and goofed off on our own.  Will be back!", 
    "review_date": "2009-09-04"
  }, 
  "EUDuSd11Fhxm6ioLgvxFEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert R.", 
    "review_text": "This would be a full on 5 star if i could ever remember leaving this place.  Seriously.  The only downside is that it gets freakin packed in there.  The crowd is surprisingly non-homogeneous, and hammered.  Good times if you don't want the typical NB scene....", 
    "review_date": "2006-08-22"
  }, 
  "iD830SWH1YNrR8DipUe6Xw": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Marissa P.", 
    "review_text": "Not my favorite North Beach bar. Yes, the music is good and the drinks are reasonably price but really the bar itself is not really that exciting. Small bar in the North Beach neighborhood that is a good place to grab a drink but not much of a destination.", 
    "review_date": "2012-10-14"
  }, 
  "K4g2p31gIE392nZYtu0tAg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa A.", 
    "review_text": "All I can say is boo! HORRIBLE music all night! It sounded like cheesy alternative \"goodbye\" music you would hear at the end of a high school graduation. The bar was so unbelievably crowded I felt like a pinball being literally hit around as people tried to get past. The room is pretty small with little seating. There's only one girls bathroom stall which made for an uncomfortable long wait with some wasted girl locking herself in there for literally 20 minutes! All of us in line tried getting help from the bartenders and bouncers; all they said was \"sorry I can't help, you'll just have to wait\"!  Overall, bad experience and a place you will not see me going back to. There are better places in North Beach.", 
    "review_date": "2011-03-19"
  }, 
  "Q_8qAEFkzrzTVAJhLsxmBg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Kristin F.", 
    "review_text": "Hi, Northstar. I miss you- but guess what? PBR is $3 or less in Michigan, too! However, nothing can replace the wonderful bartenders, the pool crew, the regulars, or the fact Steve gave me a Snuggie.  What I find hard to believe is that I am still the Dutchess of Northstar, and I haven't been in San Francisco since June! Awesome.  \"Voted #1 Happy Hour by The Betty Ford Clinic\"  Totally worth coming here, even if it's for the free popcorn and a smile.", 
    "review_date": "2011-09-05"
  }, 
  "XP32BMm5JmcogLMTf-JUGg": {
    "user_rating": 3.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Helen V.", 
    "review_text": "Like the bar...but a grey goose and sprite is $10. Ouch.", 
    "review_date": "2010-08-16"
  }, 
  "Zm3vqDcEtPxc5pxfmpJGEg": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Chris E.", 
    "review_text": "My Uncle Walt (not a real uncle, but one of those family friend ones) owned this bar back in the 60s-70s. I logged a lot of hours here as a kid. Back then, women were only allowed in at lunchtime and had to sit in a booth and never at the bar. The cook was a Chinese guy named Fee, who made a wicked red sauce. He's the one who told me to always put a shot of vodka in.   The place hasn't physically changed all that much. Whenever I go in I feel five years old again. I think Walt and Ernie and Fee would be happy.", 
    "review_date": "2008-04-08"
  }, 
  "ZL4ozqMCOQs7sZO8aCcXTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David B.", 
    "review_text": "Bar, plain and simple. They serve booze and you drink it.\n  Place is usually packed on weekend nights, but push your way to the back. Somewhat near the pool tables and oddly painted, fake deck and you got some room. Just be mindfull of those playing pull or you might get an ass full of pool stick. \n  Place attracts the standard crowd, nothing special and no need for some dumb dress code. Bathrooms are easy to get to and very small. \n  Caution you can easily see into the bathrooms (*warning women*), so do not expect privacy from drunk men or women. Well that is what my friend told me!\n  Kind of place where you can kick back, very limited seating. And enjoy a classy Bud Light in the bootle or vodka tonic. Floor can get sticky from whatever combination of fluids (booze, saliva, etc.). ALmost to sticky, but hey it is fun to stick to bar floors!", 
    "review_date": "2006-10-02"
  }, 
  "xADAW32u15sgA18Hfy9PsQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin F.", 
    "review_text": "It's the holidays... let's start with the good.  a classic dive bar (although can you have 5 HD tv's and still be a dive bar?) with free pool til 8pm... and if you're lucky they'll probably forget to lock up the table and you can continue to save 75 cents at a time.  Oh, and there's free popcorn which goes well with all the carnies that frequent this spot.  But the rest of the evening it was like i was walking around with duct tape shoes.... adhesive out.  there is so much spilt beer here... unclear whether this is out of respect for fallen comrades (ie, like in compton when they pour out a little liquor for my homies) or if some of the patrons have tourettes.  or maybe beer is just too damn cheap here so they can just waste it.  blasphemy!  either way, it was great playing pool using a crutch instead of the pool cue.  at least i had an excuse for all the missed shots.", 
    "review_date": "2008-12-12"
  }, 
  "trhLQd15Tx_Wm3dyx0P1zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara F.", 
    "review_text": "This place kicks ass for the below reason.  1) Good Internet juke box 2) Cheap drinks (extended happy hour) 3) Great service (bartenders are always attentive) 4) Nice TVs to watch sports games 5) Local crowed  6) Extended happy hour (Rad enough to say twice) If your just looks for a place to listen to some music, have a beer with a friend and watch a game this is the bar for you !", 
    "review_date": "2008-03-14"
  }, 
  "O2qAlgUHKft3Lm-hPqO7rA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jessica C.", 
    "review_text": "Northstar is a Bills bar and is fun to go to on Sunday mornings- the Bloody Marys are pretty good and the people are rowdy! It's also great at night. The crowd is unpretentious and I always have a great time when I bring people here.  Give Northstar a try; it's a nice departure from the tourist areas of North Beach.", 
    "review_date": "2007-10-15"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "i usually stop in here when i've been over at o'reilleys (across the way) just to see who's hanging out. a nice little NB bar and very laid back. Usually a local crowd and more cute guys than any girl could ever need in just one bar. small and casual bar. Good place to watch sports too.", 
    "review_date": "2005-05-09"
  }, 
  "6_COF2MISlqZFno5b_HZSA": {
    "user_rating": 2.0, 
    "user_location": "Russian Hill, San Francisco, CA", 
    "user_name": "Mara H.", 
    "review_text": "I must say I'm luck y that this is my local watering hole but sometimes the crowd is just too much.  Like say for last Thurdsay when the spillover from O'Reilleys was a bit overwhelming (That's my guess based on the Irish lads hitting on me and my friends).  But mid-week is a calmer, more pleasurable experience.", 
    "review_date": "2005-09-07"
  }, 
  "mUkXysN1NOMWMaAm3hoybQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Elaine Y.", 
    "review_text": "M-F happy hour from 1-7 $4 well drinks and beer. Very chill laid back place. Bartender is very nice and the place has inexpensive drinks. A big plus in the city or anywhere for that matter  not fancy in the least but not dirty either (no sticky floors ) would come back if I was in the area and just want to chill for a few hours. They have free pool and popcorn!!", 
    "review_date": "2014-09-19"
  }, 
  "eurIEcpGa_tTi1LMWa1pUA": {
    "user_rating": 4.0, 
    "user_location": "Lufkin, TX", 
    "user_name": "Wes T.", 
    "review_text": "Came here on a Sunday to watch football with a friend. It was his suggestion, and after reviewing Yelp I was prepared for the worst. Luckily, I was pleasantly surprised and had a really great time.  For starters, the place was not packed. I suppose this was because it was Sunday afternoon and the local sports teams had been eliminated from competition, so that reduced the number of folks inside. In turn, we had a really great table against the wall, offering a great view of the TVs, with easy access to the bar. Score.  The location of this place is also a plus, as it is close to numerous pizza joints. This meant I was able to run out, grab a pie for my friends, and enjoy it at the bar. Nobody working there said anything, which is also nice. Pizza and beer at a bar with big screen TVs. Win.  Drinks were reasonable, but I don't like the $20 minimum credit charge. I'm surprised at how many establishments don't know that this is illegal and that it will get them punished by the credit card companies.", 
    "review_date": "2010-01-11"
  }, 
  "JNyLyXn-unUhJmiGJnI6tQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah J.", 
    "review_text": "Wow, Northstar Cafe, eh?  That's a pretty generous use of the term \"cafe.\"  Or is beer really a food group nowadays?  Northstar gets my five stars because the owner has been gracious enough to let my friend's charity organization host fundraisers here.  \"Gracious\" might not be the word I'm looking for, considering that I'm sure the events brought in a decent chunk of change for the Northstar, but still.  He's a do-gooder in my book.  (Oh, and Miranda M is spot-on when she writes that the girl-to-guy ratio is good--if you're a girl.)", 
    "review_date": "2007-01-30"
  }, 
  "RUcgk8QiOCwEgo3pkG5I8Q": {
    "user_rating": 5.0, 
    "user_location": "Pflugerville, TX", 
    "user_name": "Sam S.", 
    "review_text": "This place was awesome. Total dive bar but totally awesome, chill atmosphere.  My coworkers and I stopped in here for a quick drink whilst waiting for our table at the infamous Tony's Pizza - the bartender quickly picked up that we were out-of-towners and made us welcome, and we had some good, light conversation with him. It was a rather refreshing surprise, especially from a bartender!  The drinks were well-priced and everyone who was at the bar seemed to be enjoying themselves greatly. Lots of TVs and a pool table, so enough things to please everyone!  We didn't stay long but we enjoyed our time here. This would be one of those places I would seek out again, next time I'm in SF. Thanks Northstar!", 
    "review_date": "2014-05-29"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "My long Island Iced tea was good, but cost $9. The set-up was ok ($.25 Pac Man, but a more challenging than normal version)  -- filled with striped shirt frat boys and desperate young ladies. Whities galore. Not good.", 
    "review_date": "2006-05-20"
  }, 
  "TS2j_gt5qugbmQ1R_fq6TA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim B.", 
    "review_text": "Been coming here for a long time, not realizing they had a great happy hour. It is an old bar, but it doesn't have an old bar feel to it. Not my favorite place, but it is always a good pit stop in this part of town...", 
    "review_date": "2011-12-23"
  }, 
  "2ykdnAVEV2rPffr-q6ZFYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rikus L.", 
    "review_text": "Buffalo!!!!!! They're all about the Buffalo Bills here. 5 stars. Done.", 
    "review_date": "2012-10-20"
  }, 
  "rY_XlWkeE5GcudUFy9BPtA": {
    "user_rating": 4.0, 
    "user_location": "Gaithersburg, MD", 
    "user_name": "Chang W.", 
    "review_text": "Best happy hour deals I've seen. The non-stop Zepellin tracks were like icing.", 
    "review_date": "2006-08-11"
  }, 
  "jGkFr8zL96YfaPs4Eb960g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "Northstar is by far my favorite local bar. They have a great happy hour M-F and provide free pool and popcorn. It is also a great place to watch sporting events, especially if you are a Buffalo Bills or Sabres fan. Sunday mornings get crazy with Labatt drinking Bills fans spilling out of the bar. You can literally hear the crowd all over North Beach when the Bills score. Overall Northstar is everything you could want in a neighborhood bar... Great staff, great drinks and a fun crowd.", 
    "review_date": "2008-10-29"
  }, 
  "8Ly8g1yPzX18vxzqjlQtjA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cescilia A.", 
    "review_text": "I went here on a saterday and i must say it wasn't too over crowded and the staff was friendly and quick.  Pretty much the only downside to this place is that once you leave with the drunkin muchies it is a little hard to find some after bar food.", 
    "review_date": "2013-11-25"
  }, 
  "2_cvh63d0CM33n1cP-3YZA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "Its alright. There really wasn't anything special about it, and it was pretty empty. The bathroom is RIDICULOUSLY tiny, and really hard to even enter and exit. They were setting up an event in the backroom, and there wasn't much seating in the front. I'd see no reason to come here when Boardroom is right accross the street.", 
    "review_date": "2013-04-02"
  }, 
  "l26TgP9ox03XRLDuG-9wvA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annalise F.", 
    "review_text": "Whadda know? Another totally overdue review!  Came here at the end fo JANUARY to see a fellow UC Davis grad DJ. I'd never been to Northstar Cafe before, but thought it was a cool spot.  The place was packed, but seemed to be a good mix of people. Nobody overly boisterous, creepy, or whatever other negative word you want to go with!  Throughout the night, the line outside just continued to grow. I don't know if this this standard, or if it had to do with DJ Harrison...  Cool place, I'd go back.", 
    "review_date": "2013-04-08"
  }, 
  "JKADJTswQG0xMoNRyVkIWA": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Lorraine B.", 
    "review_text": "I came here on Oct. 28th after going to the niner game. Came to watch the world series, nice TV's for a dive bar I must say. I had a good time here. Free Popcorn and Pool. :) + the bartender was fast and courteous and not bad looking either. Good beer on tap. I would definitely come here again. Cheers!", 
    "review_date": "2007-11-01"
  }, 
  "_1zoBu8_XQ3P_BBChK3gFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suo L.", 
    "review_text": "The few things I miss about my hometown are as follows:  1) My folks 2) Chicken wings (you call them Buffalo Wings) 3) Cheering the Buffalo Bills and Buffalo Sabres as they invariably snatch defeat from the jaws of victory in dramatic fashion.  Well, here in SF, #3 is my only option, and I can take care of that at the North Star while drinking $3 Labatt's in the company of those who understand what I mean when I say \"The Bills are hot and the beers are cold.\"", 
    "review_date": "2007-05-15"
  }, 
  "Z9boj3QdTXyw4glpJ84Cog": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Glen S.", 
    "review_text": "Oh man, we had a freaking blast in at the Northstar Cafe.  Looking for a place that wasn't 'downtown' but was in a safer neighborhood, we ran into this place randomly (thanks to Yelp's app) and didn't find ourselves leaving for a while.  Prices were amazingly cheap and the service was amazing.  So you might ask yourself: why didn't you give this place 5 stars then? and to that, kind sir or ma'am, to that I would say, this is America and I can do what I want.  Oh, some tips: if you don't like REAL dive bars, find somewhere else.  If you don't like being around fun people: get out of America.  And if you're looking for some place classy: stop reading my reviews.", 
    "review_date": "2012-12-12"
  }, 
  "Uj4HTvelP7wnrAJOY803sQ": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jenny K.", 
    "review_text": "I'm always wasted by the time I get to Northstar and if I'm not, it's not too far off in the horizon.  This is a great bar off the beaten track in North Beach.  I have to agree with some of the earlier reviews on yes, it's mostly ex-frat guys and they're definitely cute and friendly.  It gets a little crowded here on some nights but the drinks are cheap, there's a pool table in the back and a fun jukebox with a good hip hop and rock selection.  This place is casual...feel free to wear your sweats/gym clothes.", 
    "review_date": "2007-08-22"
  }, 
  "xt8tqNaVPzgBhhftXBr-5A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven M.", 
    "review_text": "I hate to be one of those people who say things like \"I remember when...\" about places in San Francisco but I remember when North Star was a true dive bar back when Kaitie O used to live around the corner.  We would go there on a weekend night and play songs on the juke box and sometimes even pour our own drinks.  Over the last few years it has somehow turned into the cool dive bar and it's usually crowded and smells like old popcorn.  We went here last night after dinner and all of the girls looked like girls who want to hang out in the Marina but don't have the self esteem to do so and, as a result, say they \"prefer\" dive bars instead.", 
    "review_date": "2006-01-27"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "I like this little dive bar because it's not too crowded on a Thursday night, there's a pool table and a good amount of seating, they serve DEE-licious John Daly's (sweet tea vodka, odwalla lemonade), and have several beers on tap for a good price.  I don't see space for dancing, and I don't know why you would dance at this place unless you're completely plastered. On another note, the bouncer was very friendly unlike at many other dive bar places where they scowl at you when you enter.", 
    "review_date": "2010-07-19"
  }, 
  "BOlLYaVgKgu68jV-MSdZLg": {
    "user_rating": 5.0, 
    "user_location": "Midtown, Sacramento, CA", 
    "user_name": "Larry T.", 
    "review_text": "One of my favorite dives in San Francisco. Typically a friendly crowd, cool bar staff and inexpensive drinks. What's not to love!", 
    "review_date": "2014-07-06"
  }, 
  "zEarwErejqXmDol-gGXDkA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew E.", 
    "review_text": "Good neighborhood North Beach bar.  It's a few blocks away from the more popular haunts, so the crowd is more local.  It can get pretty packed, but not in the annoying way that other North Beach spots do.", 
    "review_date": "2006-11-25"
  }, 
  "EuuyiAuEa_s3VSS9i8okmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah F.", 
    "review_text": "I really like this little dive bar!  I have always had a great time here.    Pool (check) Juke Box (check) Movie Popcorn (check) Awesome beer (check) Non-pretentious atmosphere (check)", 
    "review_date": "2008-03-24"
  }, 
  "ckzzBbHPecpudAaAbX-_nA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Teo B.", 
    "review_text": "My favorite neibarhood bar. They have free pool and popcorn, happy hour drinks , and the bar stuff is really really friendly.", 
    "review_date": "2011-01-17"
  }, 
  "6RBr4PmeFkMhx2vnLKsxTw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christopher F.", 
    "review_text": "What can I say, this is my favorite bar, its a Buffalo Backers Bar, so they will always show Buffalo games, even if they don't have one on, just ask, and they'll quickly oblige. I'm sure everyone has said it here, but the bartenders are really great, and one of the owners Mark is amazing, they do a lot of fundraiser events, have parties, do pub crawls, get buses and tickets for sporting events. This bar is truly active and loves its regulars. I have been going to NS since 2006, and I don't see myself letting up anytime soon. So grab a shot of fernette and have fun!", 
    "review_date": "2010-12-27"
  }, 
  "ZIEZrBO3JLFuqhvmlk-eIw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suejung S.", 
    "review_text": "Decent bar. Friendly bartenders, chatty crowd, tiny bathroom, pool table, a good number of seating options, and lots of TVs. Pretty crowded on a Friday night, need to squeeze around to get to the bathroom or to the bartender. Darker in the bar area, more lighting in the pool table area. Cheers!", 
    "review_date": "2012-10-03"
  }, 
  "m6p5knAyIS79s6WNbeIdGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen E.", 
    "review_text": "Great happy hour. It lasts forever and it includes hot buttered popcorn. You can find me here quite frequently, except when the hardcore pool players take over the back room and get weird. If you bring your pool stick to happy hour, you came for the wrong reason.", 
    "review_date": "2010-01-18"
  }, 
  "vUFZcyFx-8Lt5cI-OZL3Ig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve H.", 
    "review_text": "Great bar to relax at early in the evening.  It tends to get too crowded later at night.  Claims the be the Buffalo Sports bar of  SF with its Bills and Sabers items on the wall.", 
    "review_date": "2008-05-26"
  }, 
  "mN1WgreTn_1Ltk0kHKUqdg": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Mark K.", 
    "review_text": "At first I wasn't a fan of this place, but having the chance to go there for a few week day sessions has greatly improved my opinion. It can get pretty crowded on weekend nights, so if that's what you're looking for you're in luck. It seems to be a good crowd pleaser, with spots at the bar near the action and a few booths toward the back by the pool table for when you don't want to be in the middle of it all. It's not too touristy, people here know each other and all tend to behave accordingly. It took me a while to come around, but now I'm a fan.", 
    "review_date": "2010-10-29"
  }, 
  "kXdq_tyzV1RbgsjRLyy_yA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kaity J.", 
    "review_text": "2012 Drunkcathlon: San Fran Edition. Review #3  Drink requirement: Order any 2 draft beers  Maybe next time we have a generic drink requirement like \"order 2 draft beers\", we won't leave the choice up to the bartenders.   The fact that they hooked us up with 2 IPAs made be love them and hate them in the same moment, the hate only coming from the fact that at this point in the competition we were pretty hammered and downing a few Bud Lights would have been a much wiser choice.   The atmosphere was really great - eclectic and semi-off beat. I can definitely see myself stopping by this place for a San Fran happy hour at some point in the future.", 
    "review_date": "2012-05-22"
  }, 
  "x08M5NBFY2I2G551KnG8Yg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Kristina M.", 
    "review_text": "I must admit that I LOVE the Northstar - great bartenders, hot ones!  I love Ed and Seb makes an awesome Bloody Mary.  A great drinking bar, guaranteed that you will get hammered when you come here.  The drinks are strong and the bartenders will buy you one if you are there for a while - that's the way it should be!  Better to come during the week than on the weekend when the Marina crowd invades.  A great place to watch sports, especially on a Sunday afternoon.  One of the best bars in the City!  Unfortunately I am not the only one who thinks so however.", 
    "review_date": "2008-03-31"
  }, 
  "mXInwpdyN0n6CFvAYopI2w": {
    "user_rating": 4.0, 
    "user_location": "Oxnard, CA", 
    "user_name": "Trina M.", 
    "review_text": "I heard about this place when I trained for Nike Women's Marathon through Team in Training through a friend that had did a previous fundraiser here. If your not familiar with Team in Training, its a non profit that raises money for the Leukemia and Lymphoma society by training participants for events while they fundraise for the society. I don't have a personal connection to the cause so raising $2500 was a difficult task. I called the place and got in touch with the owner. He was super friendly to assist me and make sure he gave me tons of help and resources to make my event night successful!  On the day of the fundraiser the staff was super friendly and helpful, they even provided me with a money box and raffle tickets to use during my fundraiser! I had a lot of fun and had even more fun later watching my friends hustle random drunk dudes for $10 for my fundraiser so they could get $2.50 pints! Very chill atmosphere.. would definitely come here again if I was closer to the city. 1 shot and 4 pints of Blue Moon later I left very drunk and with over $200 to donate to the society! GO TEAM!", 
    "review_date": "2009-03-03"
  }, 
  "KbaLzIBhLJZQ1HJbQXtKSw": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Ethan L.", 
    "review_text": "Stopped by Friday night at 6:45. It was at 80% capacity, but still plenty of room to walk, stretch, perfect. Really cool vibe here, friendly neighborhood bar. Non-douchey, non-pretentious, chill. Bartender was awesome, she is your friend right from the get-go. Bar crowd is friendly too, doesn't get too loud that you have to yell, was able to converse with a nice gal two barstools over.  Happy hour Mon-Fri ends at 7, with $3 wells and drafts, and free popcorn. That popcorn wasn't just stale stuff from a large carnival bag either, it was on par with fresh theater popcorn with a hint of butter, popped in an actual machine right by the door.   Wish I lived or worked nearby, honestly. This bar certainly has that potential for a HIMYM meetup. Can't wait to stop by on a Sunday to check out the football crowd!", 
    "review_date": "2013-10-25"
  }, 
  "16NGkckAeMM-OWlt9x3vAw": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Sean D.", 
    "review_text": "This place is awesome on Sundays during the NFL season. The front of the bar is represented by Buffalo Bills fans and the back is represented by the Philadelphia Eagles. I'm an Eagles fan and somehow this works. Everyone there is polite and relaxed.   Drinks are cheap? Check. The bartenders are cool, normal and serve you in a timely manner. It's everything you want in a 'dive' bar. It's a cool, incognito spot in a touristy area. There is no food but they occasionally do something on the weekend but it really doesn't matter because there are a ton of places in the area to grab a bite.   If you are a Bills fan or an Eagles fan I think you should definitely go there. Think the Kezar Pub without the prices or shitty beer (or service). It's a North Beach bar without the annoying bro's (didn't mean to offend anyone). There is always a friendly, laid back, knowledgeable sports crowd there. They have a pool table in the back.   If you want to just kick, watch sports, shoot darts or play pool in a relax atmosphere with cheap drinks - go here.", 
    "review_date": "2013-10-23"
  }, 
  "_lbgVbWTvxV9VTVWU0YnwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noneya B.", 
    "review_text": "It's a great lil dive bar.  I've been there a couple times and walk by it almost everyday.  It's fun!", 
    "review_date": "2007-10-18"
  }, 
  "VW4KVBkiB7eABL-hkZHcKw": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Patrick D.", 
    "review_text": "it's small, it's packed, it's fun. they serve alcohol too (wait this is a bar review - that's good right?).", 
    "review_date": "2008-02-13"
  }, 
  "Mp9gZsob8Hp7qzTh0vA4aA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace R.", 
    "review_text": "My favorite neighborhood destination (except on Friday and Saturday nights, when it fills with the young weekend party crowd).  On weeknights and earlier on weekends, it's just a great casual spot where locals gather to have a beer and watch sports.  The bartenders are very friendly, and a lot of fun.", 
    "review_date": "2009-01-18"
  }, 
  "LnZUtFx6qTWs8NV6lAARxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "For the locals of North Beach: This is the neighborhood watering hole! Cool bouncer/bartender. Fair size spot with pool table and great beer selection --- Poppy Jasper on tap folks!!!", 
    "review_date": "2006-07-19"
  }, 
  "5Tc0YXgYDvTTlps0e8xTNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jill D.", 
    "review_text": "Drinks are SOLID and so are the bartenders so I'll rate this place  4 stars although I haven't sampled the cuisine.  It's always a good sign when local restaurant servers, bartenders, managers, etc. frequent a locale and that's what Northstar is.  The place where the local \"help\" goes to help themselves.  I fully enjoyed my cider (Wydmer's) and shots and found their bathrooms clean as well.  Not certain about meals but the bartenders were cheery to the bitter end, and since I was my usual cracked out self, I appreciated it.", 
    "review_date": "2007-07-21"
  }, 
  "EjVRsZhNyG7vkCxVci7xHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theresa T.", 
    "review_text": "I've made it to Northstar a few times, and it's usually via O'Reilly's.  The bar tenders are nice and you can pick out a few songs on the jukebox if that's your thing. Beer and mixed drinks seem priced on par for a casual San Fran bar.  A no frills vibe minus the blinking distraction from the strip clubs on Columbus is a definite relief.  They recently hosted a nice event benefiting the Susan G. Komen Breast Cancer Foundation. They decorated, ran drink specials, and donated their proceeds from the night, very cool.", 
    "review_date": "2009-08-04"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Best bar to pull up a stool at the bar and hang out with the super cool bartenders and drunks who stay close to the bar for quick access to drinks? Northstar! Northstar! Northstar! Two weekends in a row I have tried this tactic and it guarantees extra Jaeger bombs and other excitement. Basically, if you are the closest girl at this bar, someone will buy you a shot and/or cocktail...   Halloween night, I decked myself out in Girl Scout attire complete with a box of Girl Scout cookies (they were actually Halloween cookies which I claimed were the Girl Scout Halloween special). I made quick friends with everyone by offering them the cookies including one of the bartenders. In exchange for a $.50 cookie, he offered me free drinks. Awesome! I had a lot of fun grabbing the huge fake boobs of one of my friends too...!", 
    "review_date": "2008-11-02"
  }, 
  "vYbkZwjGS2DJySnPZM_C1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C B.", 
    "review_text": "Friendly bartenders, cozy atmosphere, cheap drinks, free pool and popcorn. A bit divey, but thats where it gets its appeal.", 
    "review_date": "2010-03-28"
  }, 
  "PLXuHH8owd8jMGhB4uqjcA": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Katherine C.", 
    "review_text": "First off, this bar really isn't that divey...  We came here post-North Beach Festival, and it was jam packed.  I don't know how anyone was playing pool, there was barely enough room to stand.  Luckily enough though, it was also beautiful people central, so although you were being stepped on and manhandled, it was by really pretty people...which is always better, right?  And, everyone in the bar was making eyes, like \"hey sexy...\" eyes at everyone else.  It was ridiculous, I felt like every time I looked up I saw people undressing each other with their gazes...  Drinks aren't cheap, but it's ok...to get your money's worth you just need to order a Long Island...t's HUGE.  I got a Long Island and everyone else ordered Vodka Soda/Tonics and my drink totally dominated theirs, it was like 3x bigger...and for $9 instead of $6, it was a much better deal.    Soooo.............................................­................ 5 stars for everyone making sexy eyes at eachother.   4 stars for my monster Long Island.   1 star for the bar kinda smelling like bathroom.   2 stars for poor music choices and for playing Shakira twice in a row.", 
    "review_date": "2008-06-16"
  }, 
  "JQ472bHDvtNQLTKVzuswcw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael B.", 
    "review_text": "I can't remember much by the time I got here, but that must mean it was sensational. It definitely had beersies.", 
    "review_date": "2010-06-25"
  }, 
  "E7MMhHpEZntNtcnMtdNezQ": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Kendra P.", 
    "review_text": "This place is awesome. Just finished a fundraiser happy hour. Mark was very generous to allow us to do it on a Friday.   The service is great, the drinks are great, and the atmosphere is perfect. They play good music that's loud enough to enjoy but I'm still able to hold a conversion.  I will definitely be coming back.", 
    "review_date": "2014-02-28"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "really great place to hang out in...cute guys...pool table...good drinks...can get a little crowded but that's all good...usually the place i end up at after a long night and i wanna hook up", 
    "review_date": "2007-11-05"
  }, 
  "zpmViTr7g_1Ig8jPO0VNSQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynsey C.", 
    "review_text": "Northstar is the neighborhood spot. In fact I just flat out call it \"the Bar.\"  All the bartenders are super friendly and treat the regulars like family. Sub always greets me with a smile and smooch on the cheek. They have free pool, an amazing jukebox and a rowdy following of local peeps.  I don't recommend it on a Friday or Saturday night, happy hour or day time sports watching is the best. I mean, geez $3 pints and well drinks Mon-Fri from 1pm to 8pm??? AMAZING.  I heart the NStar", 
    "review_date": "2008-12-11"
  }, 
  "DHDPHDiEhivDWlVCR3bVPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin F.", 
    "review_text": "The Regal Beagle of North Beach.", 
    "review_date": "2006-01-03"
  }, 
  "Kq0rKktCLuOoG4_3PZ173g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David H.", 
    "review_text": "Great little bar in North Beach. Myself and a buddy were looking for a place to watch the 9:00 am UCLA v. Nebraska game. We were planning to go to the Boardroom across the street, but it was filled to capacity with a Stanford crowed watching their early game.  Northstar bartender was amazing. We had full volume for our game, and our  beers never dropped below 10% for the 5 hour duration we were there, a free shot on the house to celebrate a UCLA victory, can't really ask for more. I can't speak to the nighttime crowd here, but we really enjoyed watching a couple of early afternoon games at this place.   Pros: Plenty of TV's, great staff, great location, decent draft beer lineup.  Cons: Doesn't serve food (but were allowed to bring a sandwich in from a neighboring legitimate deli).", 
    "review_date": "2013-09-16"
  }, 
  "H4g9fbbMB9BVfbUDGSeTcA": {
    "user_rating": 4.0, 
    "user_location": "CA, CA", 
    "user_name": "Emily M.", 
    "review_text": "A great bar when you're looking for that local dive feel.  Takes me back to my college dive where everyone knew my name.  Crowd is actually hit or miss in my opinion.  Drinks are strong enough and cheap enough.  Love the doorman, especially on the slow weeknight when he let my friend bring his dog in.", 
    "review_date": "2007-01-28"
  }, 
  "TdT1NWvONMaLjnxwYbeZHg": {
    "user_rating": 5.0, 
    "user_location": "Mount Hamilton, CA", 
    "user_name": "Angie N.", 
    "review_text": "What have I found here, you ask?  A pig-skin and booze loving gem of a tavern thoughtfully situated on the corner of Powell and Green.  WAIT!  It's also an LSU football hub for alumni and fans on Saturdays?!?  Correction, I found a little piece of Tiger heaven that was cosmically placed in a consecrated spot in North Beach.  A divey atmosphere with spectacular service and a friendly crowd to boot.  The most popular tip I've read about this place was that it has free pool (one pool table) and free popcorn (you'll know when it's time for that).  This review will only recognize the Saturday festivities during football season when this establishment gets turned into a purple and gold affair.  Here's the magical part that will make even the biggest non-LSU and non-football fan a believer in Saturday as the new Funday: $3 domestics, $4 Blue Moon draft; $3 Tiger Claw (a shot consisting of vodka, cranberry &amp; razz-ma-tazz), $4 Abita Amber, $4 Abita Purple Haze.  My boyfriend and I drank for the entire LSU/Kent St. game for a whopping $40!  That's 3 hours of back-to-back brewskies into the empty abyss known as our guts.  An added loveliness, perhaps highlight to some, of Saturdays at Northstar is the appearance of Family Meal, a splendidly appetizing pop-up that does only bar food.  On Saturdays they bring out the southern hospitality as well as the culinary crafts of home town cooking to make you want to wrestle alligators while slurping down a dozen oysters.  These reminiscent dishes range from traditional red beans and rice, shrimp and okra gumbo, New Orleans style BBQ shrimp, bread pudding and more.  They update their twitter with locations and menu items for your perusing.    As much as I'm boasting about Northstar as my alma mater's stomping grounds, they also cater and welcome other teams and schools.  This is SF, so all your Cali teams are represented appropriately.  But, bear your purple and gold pride and you'll open your Saturdays to a life of worthwhile camaraderie.  #AllNewFriends.  Come experience some great football, great food and great service.  Don't be a Debbie Downer.  Side Note: Slowly solidifying Ryan L.'s (a Texan, born and bred - important if you know about the ongoing Texas/Louisiana battle of the football beasts) love for me and the Tigers, thanks to Northstar's sensationally spectacular Saturdays.  Deuces.", 
    "review_date": "2013-09-23"
  }, 
  "apX-FaMlzeBDx38Tba2nUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave L.", 
    "review_text": "It's a Buffalo bar, so it's got to be fun!  Free popcorn, pool, decent drinks, and overall a good place to hang out.    The plus and negative of this place is the same.  His name is Frank.  The old man must not have a job, because he is there all the time (ok, so maybe I'm jealous).  Frank will ask you the same sports trivia questions each time you meet him, so be prepared.  Here they are: 1) Name all of the sports teams that have the same name (ex. Arizona Cardinals and St. Louis Cardinals), and 2) How many ways are there for a baseball batter to get on base (hint, there are 10). Also watch out, Frank is a pool shark.  You have been warned.", 
    "review_date": "2006-10-21"
  }, 
  "mK5AdnJ9qRQIHbVw8IusAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cortney l.", 
    "review_text": "My Future 2nd Ex-husband works here! I Love the North Star boys. They always treat me well.  XXXXX!!!!", 
    "review_date": "2012-10-09"
  }, 
  "VOYvD-kerR204k0WrR0J3A": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Joe B.", 
    "review_text": "Stopped in yesterday for a Spanish themed event......  Had a great time.....  Lots of nice tv's, plenty of beers on tap, affordable prices, quick staff, daily specials, free pool, and clean bathroom.  It is tough finding parking, but it's worth it...  Good times all around.", 
    "review_date": "2011-07-10"
  }, 
  "yCIDLnM5petEyTacGU4CwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "peter v.", 
    "review_text": "This place is a good spot.  It is a no frills bar, with lots of TV's, a great juke box. Free pool most of the time, and free popcorn. The bar tenders are great dudes, they make good drinks, great happy hour from 1-8 every day 3 dollar pints and well drinks. They play lots of soccer, and hockey and a good place to chill with friends. Not mega babes hanging out but good girls and just a good spot to get drink any night of the week. You can get good and drunk here. It is a good time. They also have all packages so you can ask them to turn on your game if you got it like that.", 
    "review_date": "2009-03-01"
  }, 
  "mJEZ4UiEcfATIZtoyWhheg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Nani V.", 
    "review_text": "This place was pretty sweet! I came here with the guys and had tons of fun! I wasn't sure if this was actually the place until I read the review about the funny pics in the mens room. =) The people here were a mixture and pretty chill, surprisingly. There were guys in business suits playing pool and getting drunk. They were hilarious and friendly people. I like it when guys can actually get along at a bar. Drinks were awesome, although I don't remember what I drank.", 
    "review_date": "2009-11-17"
  }, 
  "fHnNpM0L4237GRIhidZm8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike J.", 
    "review_text": "I stopped by based on what i'd read on Yelp and thank you!  This place is great, and reminds me of the many neighborhood bars I like in Chicago.    good prices?  check (every day all drafts $2.50 from 1-8pm) Lots of sports and satellite?  check really cute girls (and friendly!)?  check good music?  check  The bartender Noel is great and knows his baseball.  Seemed like everyone in the bar knew him.    This place is a breath of fresh air.  We need something like this in SOMA.  I can imagine this place getting packed at night.", 
    "review_date": "2005-07-22"
  }, 
  "QpTb_y6EJ1A6HDXqAj-4CQ": {
    "user_rating": 4.0, 
    "user_location": "Wicker Park, Chicago, IL", 
    "user_name": "Miss O.", 
    "review_text": "how can anyone live in russian hill not like the northstar cafe.", 
    "review_date": "2008-12-08"
  }, 
  "rGdW50y9qjzvx2Zboyl9Mw": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Ed V.", 
    "review_text": "The sign outside says it all.......  Happy Hour Monday thru Friday  1p.m. - 7p.m  $3 all pints and well drinks  FREE pool and popcorn  Voted #1 Happy Hour by  The Betty Ford Clinic", 
    "review_date": "2010-11-01"
  }, 
  "VxjMTG4dWT26PGvruRrmKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan G.", 
    "review_text": "A no-nonsense, down-to-earth neighborhood bar that makes SF feel like Chicago or Minneapolis. Bring your friends, stay for hours, get there early, go back every day next week.", 
    "review_date": "2011-05-23"
  }, 
  "TMWgq3KNRDaESXs8ZCrRtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "Always a good go to.  Good sports bar, friendly bartenders, cheap drinks.  Also ladies, there is a picture of Joe Montana laying in a pool in the 80s and he's pretty much naked...pretty hot.  Reason enough to go right there.  The bathrooms are kinda yucky though.  Honestly, I don't have much to say about Northstar, just that I love it and I'm here a lot.  Keep up the good work.", 
    "review_date": "2008-10-24"
  }, 
  "evnyfXDWW39FI3NUYU1fFQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jenny C.", 
    "review_text": "found this place on yelp when looking for a good happy hour place. and this one has the latest happy hour (til 8pm)...took us FOREVER to find parking...so the late happy hour was perfect for us...  It's a really chill place with cheap drinks...i think draft was $3 during happy hour...we had 9 beers and it was only about 40 total? they played good music, the crowd seems really cool...and apparently they have free pool and popcorn during happy hour...wouldn't mind going back again whenever I'm in the area!", 
    "review_date": "2010-01-03"
  }, 
  "aVaa64zb_-d6VTY3XcXyIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane A.", 
    "review_text": "FREE POOL AND POPCORN!! (4 stars)  Although the popcorn was kind of stale, it was still addicting to keep munching on. This was the meet up spot before the Elite Yelpers started the Drink &amp; Hunt SF game through North Beach. The location was a bit off the side from the main bars, which was kind of nice. Drinks are dirty cheap for HH and if you were an elite yelper that evening, drinks were extra cheaper.   The venue was small, bartenders were friendly and always there to fill your glass up, TVs around to watch football, and the back area has a pool table. The place is kind of dark but i guess its good to taint the attractiveness of people around you! ha!  Will I be back? I'd actually can see myself grabing a drink or two here on a random day.", 
    "review_date": "2011-12-12"
  }, 
  "0ltmHwUQuQde4me8DII0sw": {
    "user_rating": 4.0, 
    "user_location": "Napa, CA", 
    "user_name": "Kenny R.", 
    "review_text": "It was the classiness of Girls Gone Wild meeting with the excitement of Mardi Gras.  If you showed your breasts to the oaf in the joker's hat, he would give you fifty dollars.  He was yelling at the sweaty slugs dancing to Brass Monkey.  His mic cut on and off, so all they could hear was: \"That's right, ...give you fif... bucks ... the sexiest pair of ... So, c'mon! ... them out and ..... them around. Yeahh!  It's st...... to get ... in here!  Whooo..ooo Hoo...oooo!\"      The ecstasy was working.  One bar stool was doing a handstand on another bar stool and begging someone to dance with.  The guy in the trenchcoat was impressed and threw his beads on them.  One of the stools must have said something sleazy, because Trenchcoat started swinging at it and his friend Mohawk had to hold him back.    The beer selection was super and you couldn't get kicked out of here if you tried.  Even the couch potatoes were there to order a Miller and lip read the television newscast off of the killer flat screen.  As you can imagine, it's more chill during the week.  But you would feel like you'd be missing out if you didn't check this out on a Saturday on your way to O'Reilly's.", 
    "review_date": "2009-02-25"
  }, 
  "_TzAVPPM0PG4X62iarVILQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel S.", 
    "review_text": "Fun bar to hang  out at with friends, especially on a Saturday afternoon.  Play some pool or Ms. PacMan, have a few beers and watch the afternoon disappear.  Wouldn't make a special trip to this bar, but would be a good neighborhood bar.", 
    "review_date": "2006-11-25"
  }, 
  "OZmtokMDUkol8x19D0sxwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tommy W.", 
    "review_text": "This place is a great neighborhood joint. Every time I'm in here the bartenders are incredible, Even if I can't understand them(Sub and Ellsy). Free popcorn, pool, and entertainment from Hooks for happy hour!", 
    "review_date": "2007-07-25"
  }, 
  "GTdwyr4LcxJQoi1YEhPc7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Ahhh, the Northstar, my favorite neighborhood bar.  The bartenders are awesome and you never have to wait for drinks.  Always a fun crowd at the Northstar!", 
    "review_date": "2005-03-14"
  }, 
  "5s-nynaYg4SUFiB0FS3bsw": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Eli B.", 
    "review_text": "First off this place has an awesome choice of music in the Juke-box. I love it. Then the random collection of pictures on the walls(i best is the one over the urinal of the skinny little soldier with the huge fat wife)  The staff was friendly and pretty open with the free drinks. Just send a hot girl up with big cans and you can get 10 free obamarama shots and a free mint julep.", 
    "review_date": "2009-05-05"
  }, 
  "of09yrA2xAGZJTbaPzgcvw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley R.", 
    "review_text": "Free popcorn and cute guys but the beer selection is so-so.", 
    "review_date": "2013-02-06"
  }, 
  "NC-hHs4nA7qoNZu2F3n2CA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "charlotte c.", 
    "review_text": "Some bro spilled beer on my shoes.", 
    "review_date": "2008-11-09"
  }, 
  "XVCrc1Unw0x1gtWKF8PUVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kailey C.", 
    "review_text": "Awesome dive bar. As a Buffalo Bills fan, I'm here every Sunday bright and early. They have cheap beer and, in my opinion, the best bartenders in SF. Friendly, accommodating, easy going... Always remember our name! Definitely would recommend this bar to any SF Bills fan on Sundays and to anyone else any other day I the week! :)", 
    "review_date": "2014-09-07"
  }, 
  "GXn4ZsasLKh0qZ5g3nIqcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "I have to agree with the other reviews on this one. Feels like a good ol' Midwestern bar with that type of crowd. Not too pretentious, just here for drinkin'. Just the kind of bar I like. Nothing special to this place, definitely no frills, but the bartenders are good and the music ain't bad. If I get dragged along up to North Beach, this is my preference.", 
    "review_date": "2005-08-05"
  }, 
  "KbZdafPefe2BEPeEfdomgw": {
    "user_rating": 2.0, 
    "user_location": "Towson, MD", 
    "user_name": "Kevin J.", 
    "review_text": "Cheap beer, strong drinks, good service. Why the 2 stars. Walk in to this place during the day and you will see. It is one of the dirtiest bars I have ever seen. I would not order a draft. I understand the whole run down type of beach shack theme they are trying to go for, but it is more of a dirty/run down look.", 
    "review_date": "2013-06-14"
  }, 
  "4UkA6Sjw-RE-RuZQ1MIcTA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tuesday C.", 
    "review_text": "Have been here twice. Most recently after a beach blanket babylon show.   Its ok. The prices are ok, the choices are ok. The most impressive thing is the free popcorn. The  ladies bathroom is smaller than most San Francisco closets.   Another patron got sick on part of my skirt and shoe which was really nasty and pissed me off. The guy was definitely over served. Likely will not go back here. I imagine though that if you are a guy coming here to watch a sports game it would be alright. Not the place to come with a bunch of girl friends to dance and drink though...", 
    "review_date": "2011-11-28"
  }, 
  "bA-nbi3A15By4oQd3S_jtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Norm U.", 
    "review_text": "Neighborhood gem.  That pretty much sums up everything the Northstar is.  It's just far enough off the beaten path that it's not a tourist trap and is frequented by locals.  It gets pretty crowded on the weekends, but hey, you can't keep this place a secret forever, right?  Besides, people who complain about a bar being crowded probably would have more fun sitting at home talking to their cats.    The bartenders are among the friendliest you'll find in the city.  The drinks are reasonably priced, if not downright cheap (for SF at least).  Hell, they even let me DJ on the back porch every once in a while.  What's not to love about this place?!?  Northstar, I dedicate my liver and disposable income to you!", 
    "review_date": "2008-04-23"
  }, 
  "7YPq1fvcv1JuEjTFLY0ARw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul R.", 
    "review_text": "go here on a regular basis and this place never disappoints!!!", 
    "review_date": "2011-08-21"
  }, 
  "pUopzKhcjsOALWhE2nbKbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey B.", 
    "review_text": "Awesome dive - good drinks, free popcorn (apparently), jukebox and pool table. Pretty chill crowd and very diverse scene. Good place to be super super drunk - after all, they are self-proclaimed \"drinking consultants....\"", 
    "review_date": "2007-02-14"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "evening pub crawl to northstar cafe...sunset and under night skies...quick identification check...raucous, rowdy and crowded...bar at night...crack of the pool table in back...sardine can crowds inching around...laughter and yelling drowning out the music...squeezing to the bar for a beer....$six guinness high priced for locals...taking one to sip...aged bar with little change from a decade past...same fraternity like crowds...noisy and having fun...", 
    "review_date": "2012-07-11"
  }, 
  "9tGzrAS-V4DQXnxOLwIumQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "linn c.", 
    "review_text": "i like sundays @ the 'star'. easy to get a pool table, relaxed time.", 
    "review_date": "2008-07-01"
  }, 
  "g7KxBjGsSUth0887PowAUA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arthur H.", 
    "review_text": "Awesome neighborhood bar with a great crowd and better staff.  Scheduled a birthday party there recently and couldn't have been happier.  The owner Mark was great about getting the section reserved and calling ahead of time to confirm the details.  Bartnenders Molly and Christian took great care of us throughout the night and even helped setup/decorate - cannot thank them both enough!", 
    "review_date": "2013-09-20"
  }, 
  "_Idlsaw2hXJN8NtNWamt2Q": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Meg W.", 
    "review_text": "I walk in.  I hear Jesse's Girl.  A bit later, I hear \"Josie's on a vacation far away....\"    Sold.  [but the covers I have of these are much more awesome.]    Friendly bartenders who, when I tried to do a blow job, studied my efforts, assured the jeering crowd, \"yes, her mouth does NOT fit around it.  She gets a pass.\" Umm, I'm talking about the shot... not THAT.  Pool table, divey bar.  Love it.", 
    "review_date": "2009-06-20"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Damn.  I was tempted to give this bar 3 stars because I was getting a little nauseous due to the really strong smell of urinal mixed with the overpowering smell of burnt popcorn.  BUT.  Our bartender was super friendly and the drinks were cheap ($3 between 1-8pm during the week).  I spent half the time I was there captivated by CNBC's special on \"High End Prostitution\" on one screen, hockey on another screen, and the Warriors game on another.  It was enough for me to tack on another star...but next time I will sit as far away from the bathrooms as possible.  (It was truly vomitous.)  I swear, between here and The Boardroom, I can get trashed for less than $20.  I mean...if I was into that.  Oh yes, avoid this place on weekend nights - it gets crowded and rowdy.", 
    "review_date": "2008-11-26"
  }, 
  "2Aj529Qci5qpI1FKC6V9Rg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ciera M.", 
    "review_text": "Nothin' but love for Northstar!  This place is literally stumbling distance from my apartment and many a night bar hopping around North Beach has ended here. My fav dive bar in SF for sure!  They have popcorn, cheap drinks and friendly staff. We hosted a North Beach pubcrawl and Northstar were super friendly, an ace night was had by all. Myself included, which entailed me abandoning my jacket here (oops). Shows how chill the clientele are, when I finally realized that I was sans jacket a couple of days later (I am a hot mess, I know), it was hanging up happily on the Northstar coat rack!  The barman here has also sheltered me from the rain and offered me a free drink whilst I was waiting to get my Zipcar out from the valet lot next door - awesome (although for purposes of not drink-driving I abstained!).   This place is also a sports mecca and they'll put anything on for you. I have even seen watched my English rugby team on TV in this place - love.  Only downside I could think of is the frequency with which my friends leave open tabs here and have to reclaim their cards in the morning - can't say this is Northstar's fault though!", 
    "review_date": "2011-04-28"
  }, 
  "BpjejosvmXXmbDUlTx3n3w": {
    "user_rating": 5.0, 
    "user_location": "Arlington, VA", 
    "user_name": "lars H.", 
    "review_text": "Great place for anyone from or around Buffalo.....  They serve blue, and it feels like a lot of buffalo bars.  The crowd tends to be a good mix of mid 20s-30s and pretty chill.  It does get packed some nights but well worth it.  Fellas, buying any female a blue who is not from buffalo is not a good way to pick them up.... trust me.", 
    "review_date": "2009-01-11"
  }, 
  "D9mgcl6MFE3vRKTVadFFdQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Britney C.", 
    "review_text": "Came here a few times when one of my good friends lived in the area.   Total dive bar but a great place to get sloshfaced! And it seemed like we were the only ladies in a bar full of middle-aged guys...", 
    "review_date": "2008-09-16"
  }, 
  "WaWuldRwynDNj1kRyY1ZgA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jax C.", 
    "review_text": "Greatest Bar Ever! The drinks are strong, the happy hour is long, and the bartenders are the greatest. I am a huge fan of this bar. On Sunday's it turns into the local Buffalo Bill's bar haven and the blue is flowing strong. They have free pool and popcorn and lots of memorabilia all over.  If you need a local place to hang out... this is the place to go.", 
    "review_date": "2009-09-29"
  }, 
  "yfG8hiLv0mA0ltTNXERuYQ": {
    "user_rating": 4.0, 
    "user_location": "McKinleyville, CA", 
    "user_name": "Roxanne S.", 
    "review_text": "Excellent choice for getting a nice cocktail during the day. At night it gets a bit crazy and packed. The drinks seem to become more expensive as the night goes on too.   If you're a rum drinker, I do NOT recommend their well rum choice. It was disgusting. I had never even heard of it and it didn't even taste like rum.   We've had some nice times here though, all during the day. Again, at night, especially if there is any game on, it just gets way too loud and packed with screaming people. So if you're not there to watch sports I wouldn't recommend it.", 
    "review_date": "2013-02-23"
  }, 
  "Tj-dZQNgz2pNpBGLvCkm6A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taylor C.", 
    "review_text": "Definitely part of the dive bar variety, and it may smell like foot and stale beer when you walk in, but don't  let that discourage you from making a visit. Like most places in San Francisco, this place has friendly bartenders and good happy hour deals (3 dollar drafts). Throw in free billiards and popcorn and you have a spot that's not that bad to get together at. Don't count on sitting down but the opening area is large enough to stand and hang out comfortably. Could see this place getting three and a half stars but it caters to Cal fans, so I round down in that case (not really... but seriously)", 
    "review_date": "2012-03-04"
  }, 
  "aIqtnxoopMTWARZNCqlY1w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eli B.", 
    "review_text": "This is not the place to stumble into in 5\" patent leather heels... but I unwittingly did anyway. It smells like the floorboards are soaked in beer but I'm a fan of the non-pretentious atmosphere, the music was fabulous (\"Shoop\"? Yes please!), the people were friendly and I got complimented on my heels and dancing skills by some lurpy old guy in the corner.   If that doesn't make your night, I don't know what will.", 
    "review_date": "2010-05-08"
  }, 
  "YmTS2FFbScIKrGNywXgkag": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Today Y.", 
    "review_text": "ehh. a busy, semi-trendy, dive bar - with a college-feeling, old-frat-kid, kinda-yuppy-crowd.", 
    "review_date": "2006-07-08"
  }, 
  "G1CjI71Agj4_Ew4CuVQIgQ": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "sierra s.", 
    "review_text": "Any bar can sell booze....but its really the company the bar keeps that makes it special.  Northstar is it. You don't get the yuppies or the pop'ed collars. You get genuine, real, people. And that's why I love it here. You can go straight from the office, or in jeans and a tshirt and no one really cares, but its always a really good time.  Another huge plus about Northstar, the owner Mark is always willing to support local charities and goes out of his way to make each event successful. Not only does he open his bar up for you to collect donations, he encourages everyone to participate in the fundraiser.  Mark is truly an amazing guy and I am so thankful to have an awesome bar in the neighborhood. Good people, good drinks and hot guys. (That's really why I love Northstar) Plus they have hot fresh popcorn, sports games on TV, and hot guys.  Cheers! and many thanks Northstar!", 
    "review_date": "2010-04-16"
  }, 
  "aK6jKRjd3MtwtAWIu5Fu9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priya N.", 
    "review_text": "Solid place. I don't go out in North Beach that often, but when I do this is probably my favorite destination. Earlier in the evening, it isn't too crowded, great vibe overall, a fun low-key scene. Past 10 or 11 it gets a little too crowded for my taste. Also, I couldn't help but notice the guy to girl ratio was about 10:1. This may or may not be a good thing depending on who you are, but I loved it!", 
    "review_date": "2010-02-26"
  }, 
  "UxJoHsSFqc3TcM6UkIPmeA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Patrick G.", 
    "review_text": "My mobile yelp checkin says I was here. So I must have had fun.", 
    "review_date": "2011-11-01"
  }, 
  "2RtSsuhYuFoy3444J1iJmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Massiex B.", 
    "review_text": "This place kick ass. Happy hour Racer 5s and free popcorn. Blackout central", 
    "review_date": "2009-11-13"
  }, 
  "JUcKPkZRza8i3n3qD1KbVQ": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Julia H.", 
    "review_text": "This is fun, local bar. We headed over this way after the Giants beat the Dodgers yesterday. The smell of popcorn lured me in as the skies opened up and began pouring rain.   There are tvs showing different games and a popcorn machine that kept many bowls full.   There's nothing fancy about this place but it's a great place to just chill and kickback with great friends and good alcohol.", 
    "review_date": "2009-09-14"
  }, 
  "rMsckQ35fAdzgYZQr7VPmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim Y.", 
    "review_text": "I like this place during the day on Saturday or Sunday. It's a great place to lounge, nurse a hang over, bring your own food (and dog if you like), and just watch sports. Total dive bar, and I can't quite understand how this place gets so packed at night, but it does. I would give it five if this place didn't resemble a solid brick of frat boys on Saturday night.", 
    "review_date": "2007-11-03"
  }, 
  "mqgRKOaVT_EJx-HZ0-8DvQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Caitlin J.", 
    "review_text": "As others have said, this place is often packed with cute young guys. It's not the place to go if you're looking for a gem of a conversation, but it's laid back and the bartenders know what's up.", 
    "review_date": "2007-10-07"
  }, 
  "x1NPxyVqmc5tOZJFDwLKVQ": {
    "user_rating": 5.0, 
    "user_location": "Richland, MI", 
    "user_name": "Karmene H.", 
    "review_text": "Love Molly the bartender ... love this place! Best spot in North Beach!", 
    "review_date": "2012-04-30"
  }, 
  "twP9mvIvMFDu_U2nynM8bg": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Nathan M.", 
    "review_text": "Great find! Bartender was great, atmosphere was awesome for a Saturday morning NCAA FB game; finally a sports bar that actually puts that game audio on.  We had a blast and drinks were well priced.this one stays in the rotation!", 
    "review_date": "2013-09-21"
  }, 
  "7mzACXQ5F4EduE9jF_tI-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hailey P.", 
    "review_text": "This bar has some versatility   What do I mean by that.. Well by first glance Northstar is a small little dive.. lots of TVs. You may say to your friends, hey lets go watch the game at Northstar.. and chill in our sweatshirts.  At second glance Northstar surprises all by turning into a dance party. They move the pool table in the back (and cover it nicely so drunk girls can dance on top of it when feeling up for the challenge) and pull out the giant speakers. The DJ this particular night graced us with \"I'm on a boat\" not once, but twice (If I hadn't been present the entire evening this replay would not have been an issue).   The crowd was great, a couple guys came up and danced with my girlfriends and I and they were so much fun (not those creepy I wanna be on you guys that you tend to find at a dance club).   Downfall: the tiny bathroom... wow.. seriously tiny.", 
    "review_date": "2009-03-03"
  }, 
  "Jl6NjfYElTTh-eXuT5L0Zg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allan R.", 
    "review_text": "The only other bar I trust other than the Tee Off Shanghai Kelly's (that's assumed) and The Buc to serve me stiff drinks and understand what being a bar is all about. I commend them for the great happy hour and free pool.  I would give them five stars but Frank scares me and the popcorn machine is gone.  EDIT- Popcorn machine is back! Fred is GONE. FIVE STARS", 
    "review_date": "2007-02-07"
  }, 
  "J5MJGJr939qH0XfBqEC81A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny S.", 
    "review_text": "Northstar does not disappoint. There's always a crowd brewing. I didn't say a good crowd, but a crowd. One of my favorite ways to end a Sunday Funday is with a brew and a game of pool at the Northstar.   I don't have much more to say about this place. It's doesn't have any outstanding features, but it does have a pool table, a juke box, Absolut Ruby Red and there's usually some football, I mean soccer on the tube. I love it! Bonus: I don't know his name, but he may be the owner...? Greasy dude always wearing the Brasil or Germany jersey. He's got a heavy pour and drinks quite frequently are on the house.", 
    "review_date": "2007-02-21"
  }, 
  "7qZQHm7PRYyTK8_Gvug3uw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dana G.", 
    "review_text": "I came here with friends to watch the World Cup Final.  It was a sad day for USA Women's Soccer but the bar was cool.  There were plenty of TVs and it was a very chilled environment.  We sat at one of the booths in the back and had a great view of the screen.  I had a Bloody Mary, a shot of Jameson and a Stella while I was there.  The Bloody Mary was nothing to brag about and as for the shot of Jameson, well, I really should have known better.  The Stella was good (obviously) and the prices were reasonable.  This may become one of my go to bars for sports!", 
    "review_date": "2011-07-18"
  }, 
  "dJGrifo5gUGKTOXc-WfjxA": {
    "user_rating": 5.0, 
    "user_location": "Waikapu, HI", 
    "user_name": "Jena M.", 
    "review_text": "The most awesome place to go for game day! The bartenders are super attentive and very nice! They have great specials. It was very packed but still fairly easy to get a drink and see the tv.", 
    "review_date": "2014-10-11"
  }, 
  "rXDDkSXbqjOYKSnxyi2nzA": {
    "user_rating": 4.0, 
    "user_location": "Lewes, DE", 
    "user_name": "Mary N.", 
    "review_text": "randomly walked in off the street after a nice dinner looking for some laid back fun and found it here. Came on a sunday night and the bar had some drink specials, fresh popcorn and large TVs ready to go.  It even came equipped with drunkies, a couple of people shooting pool and an overall diverse crowd. The bartender Mark was especially funny/nice and kept our drinks coming the whole time we were there. I would def come back if I'm around the area again", 
    "review_date": "2011-07-26"
  }, 
  "uincPZJfGJMM-6DtNwJLpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke G.", 
    "review_text": "Truly a great place to meet friends, enjoy after work drinks, watch great sports and have great service from one of the best bars in San Francisco. Once you walk in you will notice the BT's will see you, toss a napkin down and make sure they take care of you before they finish a conversation with another patron. Sign of excellence.  Great staff, great owners great patrons!", 
    "review_date": "2012-07-27"
  }, 
  "u5yILAWLQFYe2eewYxx4VQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Dione D.", 
    "review_text": "Love the North Star.  I visited San Fran this week, and after three hours of wandering around on Monday, I was in need of a seat and a drink.  All the happy hours started at 4 or 5... my watch said 2pm but my easy coast body knew it was time to get my drink on.  Well, when I passed by this place and saw the sign for a 1-7pm happy hour, I knew I was home.  When I sat down, the other patron Mike (a fisherman from WA who loves hanging out here when in SF) and bartender Molly immediately started chatting me up.  I enjoyed a beer and an Irish coffee over the next hour or so, and got some yummy hot popcorn once Molly got the machine going.  The drinks are so reasonably priced (cheap even, by my NYC standards), and still yummy and boozy.  I know this is known as a dive bar, but really it just seemed relaxed, open, cheery, and friendly.  While I was there (Monday afternoon), the pace was slow, but I can see how it'd fill up on a weekend evening.  When I told Mike + Molly that I'd just landed in San Francisco a couple of hours before, they said, \"You just got here and it didn't take you long to find the North Star.\"    *giggle.*", 
    "review_date": "2014-05-02"
  }, 
  "0niNpv8X_2I7wIWVWl3ZyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison E.", 
    "review_text": "Best happy hour for blocks-  Makers Manhattan + Stella for $7.00.    And I skyped my dad from a table in the back during a hockey game. I'm not saying that it's the preferable way to talk to your dad, but it was awesome nonetheless.  Will be back!", 
    "review_date": "2011-04-16"
  }, 
  "AtO1W65ZqJ2RVo3iMimd4Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily M.", 
    "review_text": "I had a friend in town who happens to be a fireman and wanted a t-shirt from the fire house in china town.  Unfortunately they were out on a run when we stopped by, so we wandered down the street to grab a drink until we tried again...  We stumbled on Northstar, basically because the doors were wide open and the music coming from the jukebox was fun.  As soon as we sat down, we made friends.  Partially because I ran into people I work with, but also because the bartenders and other patrons were super friendly!!  We ended up staying longer than planned, headed back to the firehouse, got a t-shirt and went back to have some more fun!!  It was a great way to start the night ($3 beers for happy hour) and more than likely a nice place to be later on also.    If it weren't for me moving in 3 weeks, I would definitely be making this a regular stop in my bar scene.  Enjoy!", 
    "review_date": "2009-05-18"
  }, 
  "eDGtkFsgG2dkr-JkDiNjgQ": {
    "user_rating": 5.0, 
    "user_location": "Russian Hill, San Francisco, CA", 
    "user_name": "Tom F.", 
    "review_text": "Best sports bar in the city. Really knowledgeable bartenders who know their sports. Go there enough and they'll remember your name and wont even hassle to check your ID, which is always nice. This was my neighborhood spot for several years.", 
    "review_date": "2009-05-28"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "Any place that spins good music.   Has a juke-box  Has friendly bar staff, that are quick to refill your water glass.  Has a kind bouncer - that allows you to bring in food.  Has free popcorn.  Has a pool table.  Has a dance floor (well once the pool table is moved...this place is fairly tiny)  Has a pool table that turns into a mini dance floor (not sure if this is customary) on the weekend.  Is a place worth visiting.  Trust.", 
    "review_date": "2009-03-02"
  }, 
  "b-1dsipvOL7X79xmUaz9QQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jsphn T.", 
    "review_text": "Best HH, free popcorn, free pool, TV's, Giants fan bar, great staff and packed with nice cool people!! Order pizza from NB pizza or Golden Boy and bring it in... Just make sure to buy booze and clean up after yourself! Cheers!", 
    "review_date": "2011-07-29"
  }, 
  "GgLb3_MNER5CufBt5Bgvsw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ferol G.", 
    "review_text": "Best bar in the city. Period.", 
    "review_date": "2006-02-01"
  }, 
  "eFmMHYI869hc80BmpdYZ1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice F.", 
    "review_text": "Okay, this is how I am starting off my review, Haha!  The bartender, I think was a hot tranny.  I was definitely jealous of her boobs, but any who.  I love the North Beach crowd.  They just seem real, and not your hipster, Marina, folky or wannabe crowd.  Just good ol' jeans and t-shirt crowd.  Its a full bar with pool tables in the back.  Popcorn machine and jukebox in the front and just a fun spot to hang with friends and good company.  Plus its on the same block as Beach Blanket Babylon so you get to watch the street performers dazzle the viewers standing in the ticket line.  You're also not far from an Irish pub, sports bar, brewery and diner.  Its a neighborhood, that guess what, i grew up at and hated.  I lived right across the street, above Capp's diner, and was annoyed with party animals, people passed out with vomit on my stairway and just craziness.  But I was a kid, and now that I'm older and wiser. . . .I LOVE IT HERE!  What was I thinking. . . duh Janice, its awesome.  So check it out. . .you might fall for it too.", 
    "review_date": "2010-08-15"
  }, 
  "pPe_Hsm44QOar_dYYFKy1A": {
    "user_rating": 4.0, 
    "user_location": "Tustin, CA", 
    "user_name": "Justin B.", 
    "review_text": "Pros: Chill dive bar Cons: Starts to get crowded as the night progresses  Stopped by here with some friends during my last trip to SF. Located in North Beach, it's a pretty chill dive bar. Not too big, but there's a couple of tables in the back. Drinks here are reasonable (about $7). There's a pool table in the back too.  We got here kinda early on a Saturday, but as the night went on it started to get obnoxiously crowded.  Other than that, cool spot.", 
    "review_date": "2012-10-31"
  }, 
  "z6T9WqrfaLCyKl4VDKgJUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noah P.", 
    "review_text": "Up there as favorite bars in Sf. Laid back, cheap drinks, diverse crowd. Pros: free pool before 8, free popcorn all night Add tobasco to your popcorn - find it above or next to the popcorn machine", 
    "review_date": "2011-05-04"
  }, 
  "moeMaMf1TeAXdVpbGNcqAA": {
    "user_rating": 3.0, 
    "user_location": "Sparks, NV", 
    "user_name": "William B.", 
    "review_text": "Every Wednesday Northstar Cafe is the start of Rock Paper Scissor pup crawl tournament. Pay $5 to enter the tournament and then draft beers are $2.50. There is also a pool table in the the back of the bar.", 
    "review_date": "2013-04-08"
  }, 
  "lK_32lYJ-p_fjc01G-DPLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eliza D.", 
    "review_text": "Came here the other night with one of my friends who love the local NB scene. A fundraiser for entrepreneurs in 3rd world countries was being held, and for a donation you could get happy hour prices all night. Definitely a chill place to hang out and see friends.", 
    "review_date": "2013-06-26"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "2:09am: Just got back from Northstar (walked home, only a few blocks away).  Still enjoying the drunken state.  Bottomless beers (FREE refills for me and my roommate) = Pure Happiness!  Yes, we had a never-ending glass of beer, when we were low, Marc (the bartender) will grab our glasses and refill it with beer... not once, not twice, but 4 times!  Marc is nice, not sleazy, but very friendly and many of the drinkers knew him.  He's super cool and complimented us about our  'lids' (roommate and I were both wearing unique Goorin hats).  When guys will come up to my friend and me to buy us drinks, Marc was there to tell them to leave us alone, plus we didn't need random men buying us drinks.  I hate standing up when I drink, so we were lucky that we scored prime real estate seats right by the bar.    The bar is small, good space though and pretty crowded.  First thing I thought of when I walked in... Marina, I thought I was in the Marina because of the frat boys and Blondies.  As the night went on, I started noticing that there was a good mix of people including college kids, locals and an older crowd.   $4 beers on tap and $3 for Pabst, why not call it PBR, I don't know...  I hear Northstar usually have free popcorn, but last night, there was none, therefore I was a bit disappointed.  At the end of the night, I didn't care about the popcorn anymore and just enjoyed my time by watching three different sports of television and checking out some of the cute boys -- great eye candy :-)!  WARNING:  One of the bartender is a Boston Redsox (Redsucks) fan... BOO!", 
    "review_date": "2007-04-15"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Cool neighborhood joint with a great Happy Hour.   Best seats are always at the bar but we decided to grab one of the tables next to the window this time because it was a very hot day.  Mind you it really didn't help but it was a cool spot to watch the actions.    We don't care for the popcorn smell but I guess it helps many to absorb the alcohol or prolong their thirst for more cold ones.  Many 20 something hang out here but there are few seasoned regulars as well.", 
    "review_date": "2008-11-28"
  }, 
  "AsjL5K34C7QgXiT3rCN_9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moe J.", 
    "review_text": "This place has a great beer happy hour. $3 pints until 8 Sunday through Thursday.  Also a great place to watch a hockey or football game.  They play the sound of the game which is really awesome!  For the Sharks and Sabers they had free Hot Wings and a great time was had by all.    This is a dive sports bar though so don't expect anything else.", 
    "review_date": "2009-02-16"
  }, 
  "aAoacHNwqlpjGGnS82LxMw": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kayan H.", 
    "review_text": "Holly the bartender is awesome! Place can get pretty packed in the front, but the back is very laid back and great to chill. Bathroom is ridiculously small but the men's room has some funny things on the walls. Music is a crazy variety and can range from pop to country to foreigner to rap in a 5 minute period. Pretty Fun.", 
    "review_date": "2011-07-10"
  }, 
  "Zn8tgekH0oCfyk4SUtygoA": {
    "user_rating": 3.0, 
    "user_location": "Safety Harbor, FL", 
    "user_name": "Dave W.", 
    "review_text": "This dive pretty much defines what a dive is, and shall always be. The drinks flow fast, strong, and cheap. It's small, crowded, and fun. The crowd is a smattering of all types from the area.  There is one free pool table in the back... If you see me there, let's play for shots!", 
    "review_date": "2011-12-22"
  }, 
  "6HfGx_gVu1IHFnPL66kAOQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jaime L.", 
    "review_text": "Popcorn pubs are my favorite. Northstar is a popcorn pub. As soon as you enter this cozy gem, hook a right to scoop a bowl of popcorn before placing your drink order. Slide down the long bar counter, sipping your beverage and sharing good conversation with inviting strangers. I love good conversation with inviting strangers. By the time you reach the end of this counter, it's time to order beverage number two from your friendly bartender. With drink in hand, make your way to the back where you'll be greeted by a pool table and booths. I didn't get a chance to get my pool on last time, but next time I definitely will.", 
    "review_date": "2011-12-15"
  }, 
  "O4JCYAe3AuOalyJ8lNL0DA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rhianna M.", 
    "review_text": "Pulled pork contest there yesterday = free food (by local chefs). Can't miss their John Daly concoction, sweet tea vodka + Odwalla lemonade, almost healthy drinking. Def worth the trek to North Beach.", 
    "review_date": "2011-02-21"
  }, 
  "JmE8GvepYDR_I0_8u337Tw": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Rachel W.", 
    "review_text": "My friend and I held a fundraiser at Northstar last night for Team in Training and it was AMAZING!  The staff, especially Mark, could not have been more helpful, friendly, and supportive.  We were treated like old friends and we were able to raise a lot of money for a great cause!  A huge thank you to the Northstar!  We will definitely be coming back for the great atmosphere, staff, and of course the cans of PBR!", 
    "review_date": "2010-09-10"
  }, 
  "-0Nvk7jIo79LaxChQtDyLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex G.", 
    "review_text": "Expect a good-sized crowd on Thursday nights, and on weekends. The prices for PBR and other selections are good, and they keep icecubes in the pint glasses for that frosty cold feel. Nothing worse than holding a lukewarm (or worse, just out of the dishwasher) glass.  The music they play is a good selection, last night they played pretty much every song on the Cure's \"Disintegration\" cd, and it just set the mood, such a great album. Nothing's better than being at a bar and noticing that others around you are enjoying the music, too.   Later, those same people kept it going on the dancefloor in back to the beats dropped by one of the resident DJs.   Minus one star for my experience here on St Patty's day, it was just too packed.   I got one drink, and then I had my bag of booze confiscated by the SFPD. Probably went into their after-hours pig roast or something, ha.", 
    "review_date": "2006-07-27"
  }, 
  "wxwUFeRenJ4HOPUymQ_xtA": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "Katie G.", 
    "review_text": "This is my favorite dive bar in North Beach. I have spent many Sunday afternoon's watching football and drinking more than my little liver can process. This place can get pretty crowded on the weekends, but totally worth it.   Be sure to hit up the popcorn machine that is in the corner of the bar, but beware, some pretty nasty fingers may have been diving into that popcorn. My tip to you is, catch the popcorn as it is flying out of the popper. Not only will it be nice and hot, but deliciously nasty-germ-bar hand free!   Also, they do have a special bar shot called the OBAMARAMA! It is $3, and beware, it may make you forget to catch your fresh popcorn.   Thanks Northstar for all the memories I don't remember.", 
    "review_date": "2010-10-12"
  }, 
  "NDk6PEv_rvLg0gkcw61r_w": {
    "user_rating": 4.0, 
    "user_location": "Bothell, WA", 
    "user_name": "Tera T.", 
    "review_text": "I stumbled into this bar as a tourist and it was great!  Great atmosphere, music, friendly, cool, &amp; safe vibe from the peeps.  I didn't try the food. They have a HH and free pool (think it was HH only), free wifi always, and I think it said free popcorn...not sure when on that.", 
    "review_date": "2012-08-25"
  }, 
  "QcPN-Dee_dU2IWno-f2oYA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Lindsay T.", 
    "review_text": "I like this place for being a bar-type bar.  The first night I moved to my neighborhood I came here in my sweat pants and sweatshirt, and felt totally comfortable.  That being said, I have showed up here after a nice dinner, and felt uncomfortable being so dressed up.  I do agree with Katie H., lots of single guys and a beer-soaked bar.", 
    "review_date": "2006-11-12"
  }, 
  "82dCHyU-ANOgdhxUgZsUeg": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marlon T.", 
    "review_text": "It's a straight up dive bar in North Beach that has free popcorn. There's really nothing else to say. It is what it is. I don't think it ever gets that busy so consider bringing a big group here for drinks to pre-party or for your actual party. Get some pizza down the street at Golden Boy when you get hungry.", 
    "review_date": "2013-07-23"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "I was very indifferent about this place.  Indifferent about the booze, the folks and the area.    It was just one big \"whatevs\" accompanied by a shoulder shrug.    Maybe I just wasn't in the mood to drink?   Shit...how'd that happen?  Is Satan putting on a sweater down in Hell?", 
    "review_date": "2006-06-23"
  }, 
  "Rgpxl8b2F1W5JaMfEPw5uA": {
    "user_rating": 3.0, 
    "user_location": "Montreal, Canada", 
    "user_name": "J-Pierre E.", 
    "review_text": "Locals say it isn't one of the niftiest lil' bars in North Beach, but to me it was great...I'd love to learn of a more enjoyable hang in the 'hood. No pretention, drink specials that won't put a hole in your pocket, and best of all, whether or not you're a regular, it feels like home.", 
    "review_date": "2012-10-14"
  }, 
  "eiTboCTfpX0t8mWXLwcwYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "I have been living in the city for 5 months now and it has become one of my favorite bars. The drinks are inexpensive and the bar tenders are awesome...AND THE POPCORN IS FREE!  It's a great place to watch college and nfl football on the weekends...", 
    "review_date": "2014-02-09"
  }, 
  "4b4tiC7hRPsLzfRZIAerVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh H.", 
    "review_text": "On the weekend this place will be packed with a bunch of yahoos, so if you're into that kind of crowd and don't mind not being able to hear your friend whose standing right next to you, then this is your place.  It's great for a watching football on a Sunday afternoon, not too busy then What I love about this place can be summed up in one word. Sub. Sub is hands down my favorite bartender. He make the best bloody mary I've ever had. Always a nice guy. All the staff here are.", 
    "review_date": "2009-01-11"
  }, 
  "ZJiThmCfWtJ1Gq78zg7ZlQ": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Mike C.", 
    "review_text": "This place has the best pint of Guinness in the city, hands down. I've been to Kell's (great friggin' bar), Irish Bank (great friggin' bar), Royal Exchange (great friggin' bar with hot secretaries) and numerous other bars with Guinness, but this place has the creamiest head and the smoothest draw. I don't know if it's the clean taps and lines, the right pressure of nitrogen (sans CO2) or the fact that their happy hour goes from 1pm to 7pm, but I love this place.Service can be a bit slow but that's fine when they serve the perfect pint. I'm willing to wait and will order well in advance so they can double pour a proper pint. It's just off the beaten path enough to  keep the flood of tourist away, but it always has a nice group of patrons until about 6pm when all the techie douchebags start filing in with their horn rimmed glasses and beards and J Crew shirts. That's when we head out...", 
    "review_date": "2014-06-27"
  }, 
  "BNIxv28B1MvjbEpaZrvVOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt J.", 
    "review_text": "What isn't there to love about Northstar.  Every bartender is great.  And you may even find the owners running around some nights.    Shanghai Kelly's is their sister bar.  And by that, i mean owned buy the same people.  You'll find the same great bartenders at both!", 
    "review_date": "2010-03-25"
  }, 
  "-uVneM9dPGbbbB3uBzPEtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "I immediately liked the unpretentious, casual divey feel and found the bouncers/bartenders really pleasant. My only complaints? The drinks were not dive-bar-cheap.", 
    "review_date": "2010-09-09"
  }, 
  "1ajfyNyf41CxS8doHEzmfw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darrell L.", 
    "review_text": "wasnt impressed with anything here. they do have a popcorn machine on one side of the bar, which delivers wafts of that theatre-butter smell - i.e. vomit.   mix of people here from white haired locals, striped-shirt frat boys, and your 30 something drunk making comments on the canucks' logo color scheme.  if its your local bar, go to - drink it up, but no reason to go out of your way to be here.", 
    "review_date": "2006-07-12"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "Northstar...  its where the ex-frat boys are!!!", 
    "review_date": "2007-03-02"
  }, 
  "FyjYGMVe7BNOpdVPpHnnmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan C.", 
    "review_text": "I tend to live here, sometimes. Plenty of reviews, but none are haikus.", 
    "review_date": "2010-06-25"
  }, 
  "3bPPhMoWH6AD5A5Im5u3WA": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Mike B.", 
    "review_text": "and on to the Star. we were stopping by to see if Sub was working. not sure if he was or not, but he was there.  fernet should be banned but is always passed out here.  very easy to meet people - friendly place provided you are just out to have a good time.  one friend met an austrian lad who followed us from here on out...", 
    "review_date": "2010-04-16"
  }, 
  "J7ka23aCUNK-v_yLB4AL1Q": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Justin C.", 
    "review_text": "What a great way to end Tony C,'s fantastical pub crawl. We showed up around 10:45 and were greeted with a full house of awesomely friendly patrons who were just as drunk as I was. It was great.  I had a couple of well made cocktails and a beer, and all were served by the energetic bartenders with great skills behind the bar.  I love this place and can't wait to return whether its due to watching sports or from an all night drunk.", 
    "review_date": "2011-11-10"
  }, 
  "5rK8eYZHUvugbVoAjvUX0g": {
    "user_rating": 5.0, 
    "user_location": "Point Richmond, CA", 
    "user_name": "Barbara C.", 
    "review_text": "hand down the best bar staff in sf, you could not get a better group of guys to set the mood for a bar. on top of that they have free pool, free popcorn, and they are a bills bar with a really fun group of regulars and events throughout the year. all around fun, easy going bar to watch a game or hang out at. see you there :)", 
    "review_date": "2012-02-15"
  }, 
  "8kgQupO4TS2bpCGSPhTTIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle L.", 
    "review_text": "5 Reason's why I like Northstar Cafe:  1. One of the bartenders here is AMAZING. So nice. Remembers names and faces of you and your friends. Cheers you on while you play pool. Why can't more bartenders be this friendly??  2. Saw a guy with a dog here. More dogs should go to bars. AKA more owners should bring their dogs to bars. I like dogs.  3. Learned what an Irish Drinking Cow is. Apparently if you carry around a Irish Drinking Cow, you (and anyone else the drinking cow blesses) will be hangover free the next morning. It worked. I felt amazing the next morning. Plus it's an awesome drinking game where you can throw a cow on the ground.  4. Saw a guy carrying around a bottle of wine. I don't know why I like this, but I do.  5. Co-Dominated the pool table with a friend for 4 rounds of pool. We both suck at pool, but something about the Northstar Cafe environment made us awesome.  Anyways, come here for drinks at night. Great, not overly crowded, environment where you can catch up with friends.", 
    "review_date": "2012-09-16"
  }, 
  "B8oano0xLoqG7P5XJhxjDg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura H.", 
    "review_text": "3 1/2 stars really.  This was one of the very first bars I hung out at when I first moved to San Fran and lived on Green Street. Just a great neighborhood bar that can draw a cool crowd and make a good night even better.  A good place to start or end your night if you're hitting up North Beach.", 
    "review_date": "2005-10-24"
  }, 
  "e0l_QaqN2DwxVrXwqFFV_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deb V.", 
    "review_text": "I love Northstar!  Some people here say it's a dive bar but it's really nice and cozy in there.  Great local feel where the bartenders know your name and your favorite drink.  I don't think it's divey at all.  It gets kind of loud during the weekends but the bartenders are all nice, it's clean, there's free popcorn, and best of all, they make the best cosmos!  Cheers!!!", 
    "review_date": "2010-08-11"
  }, 
  "lYKhgWhlr-JC1xeJ6qaigA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Allyson P.", 
    "review_text": "Happy hour starting really early in the afternoon with all draft beers for $3...of course I'm a fan!", 
    "review_date": "2011-07-01"
  }, 
  "_tnKQs9Z3mLu2y9el6v_4g": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Meg S.", 
    "review_text": "Smallish. Not bad not good. Teeny tiniest female bathroom in the world, def not accessible. Few tvs and seemingly ok price on booze. Yee ha.", 
    "review_date": "2011-10-17"
  }, 
  "BN7muEet62iKv1ieUNX6XQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "I can't even tell you how wonderful these guys are, everyone from the staff to the owners, every single one of them are as sweet as pie and more than willing to lend a helping had (or grab you a drink :). It's true, there are no yuppies or popped collars here, but that's what makes this place go great; its come as you are and you will always be treated like a king/queen.   I first heard about this place from a friend when I began my fundraising for Team in Training. I was so overwhelmed and didn't really know what to do or how to raise the $2100 I had promised to the Leukemia and Lymphoma Society. Prior to calling Northstar I had just had a Happy Hour at a newly opened cupcake shop. At the cupcake shop fundraiser we packed in about 50 people and everyone was drinking, eating, and ordering up a storm. I was guessing by the sheer numbers (even the owner said that they hadn't had that many people in the shop since they had opened, which was months ago). that I would get a hefty donation. Not so much. They gave me $50 and called it a day. Super disappointing! So, I gave Northstar a call and set up a Happy Hour. In four hours I raised a couple hundred dollars. It was AMAZING, especially since I only really had about 10 of my guests show up. I couldn't be happier with Northstar and will always give them my business and refer them to anyone looking for a great spot to hang out and have a beer (esp fundraisers!!!)", 
    "review_date": "2010-08-11"
  }, 
  "zpnd-D0-ahcfrYYLvt04oA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ellyk E.", 
    "review_text": "Even though it gets packed, for some reason the circulation of this bar seems to work.  The bartenders are efficient and friendly, music is fun and the crowd is friendly.", 
    "review_date": "2006-04-14"
  }, 
  "fx_oas0OGcUWsAF_jOCx0Q": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Paul A.", 
    "review_text": "Great Bar. Great Place to watch a game.", 
    "review_date": "2013-10-28"
  }, 
  "BwTPj8XS_iqdSTLPBVMs1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie Anne N.", 
    "review_text": "Very cool place to meet up with friends. A lot of regulars and people who are just lounging around, chatting it up with friends, or wanting to watch sports (not me). I've spent a many nights meeting up with dates here and every time I've been, its always been a blast. I'm probably the only Asian girl there most of the time, but hell, I like it that way =). Casual, fun, loud, great place to hang out in jeans and a tank. I wouldn't wear my stilettos here =)", 
    "review_date": "2007-01-09"
  }, 
  "aqQ0MR0a9Ht9srz7PTRE3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophie D.", 
    "review_text": "I really like Northstar ... it's fun because it usually gets pretty crowded and lively on a Saturday night.  It's small, but there is still a room in the back to play pool and a little porch-like area where people can sit and watch.   I can see why this bar would be perfect to watch a game in, and apparently the happy hour is great too.  Definitely a solid four stars for this neighborhood bar... very fun!", 
    "review_date": "2008-11-02"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "I don't usually like North Beach, but this bar is great.  Good happy hour, plenty of flat screens and a great juke box.  I hear it gets pretty crowded just like any other bar in town", 
    "review_date": "2008-03-28"
  }, 
  "vs7MuwvZyEDRRzKoeCyXzw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassie B.", 
    "review_text": "Used to like this place but the last 5 times or so that I've been there its waaaaaay to crowded.  I'm talking shoulder to shoulder and people get pushy and spill drinks everywhere.  I realize that most bars get crowded on weekends but when Northstar gets crowded, I never have a good time.  Its not a good kind of crowded.  Also - the door man accused my 24 year old friend of showing a fake ID and almost didn't let him in.  Not cool... I'm giving it an extra star because when you can actually walk in this place, it can be really fun and they play great music.", 
    "review_date": "2008-04-21"
  }, 
  "Ou0bxVnxl9m-7aK9GC6EAA": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jimmy J.", 
    "review_text": "If you're anything like me, you like to start drinking early in the day.  Take my advice and head on over to Northstar.   Happy Hour starts at 1:30 AND they have what is quite possibly the best jukebox in the City, if not the world.  I once popped in at the commencement of Happy Hour and what was on the TV but John Paul Jones jammin' Zeppelin tunes on a pedal steel with a hella clean back up band.  That's not the kind of thing one comes across too very often. It's also exactly the type of thing that a middle-aged suburban white boy like myself can truly appreciate.  And the cast of characters at that time of day!  I once unwittingly settled a high stakes bet (I believe it was $40, if memory serves) between an extremely interesting group of fellows regarding the definition of the word \"ennui\".  Glory was fleeting however, as moments later I was humiliated by the same bunch when asked to spell \"hors d' ouvres\". (My excuse? \"Hors d' ouvres\" can't be used in Scrabble.)  It must have been Bastille Day or something.  And of course it's always great to hear about Ed the bartender's most recent career choice and the latest fisticuffs in which he has been involved.  Did I mention the free pool and (delicious) popcorn?  Q:  Does it get any better than this?    A:  No.  No it does not.", 
    "review_date": "2009-05-12"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "If this isn't one of the niftiest lil' bars in North Beach, I'd love to learn of a more enjoyable hang in the 'hood. No pretention, daily drink specials that won't break the bank, and best of all, whether or not you're a regular, it feels like home.", 
    "review_date": "2011-12-08"
  }, 
  "xpRAjmgL-pIcIY_9iOpcQw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay W.", 
    "review_text": "I can't even stand to be in here anymore.\n  Last time I was there a bunch of frat guys (I think literally active fraternity members) were stomping their feet in time to Johnny Cash's Ring of Fire and encouraging the rest of the bar to \"stomp it up\"\n  I left...college pukes.\n  On weekdays when it doesn't get the USF undregrad crowd it's a solid \"quasi-dive\"", 
    "review_date": "2006-04-13"
  }, 
  "_8RdsTenycwauWFXIxpEaw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica B.", 
    "review_text": "This is my sports bar.  I love to watch football games here, the bartenders are great, the drinks are strong, and the Bloody Mary's are some of the best out there.  Oh yeah, and there's popcorn too!    And the most important thing... not too many a**holes go here to watch the games.  The crowd is a good natured for the most part and that makes screaming and yelling for your team even more fun.  Thanks guys!", 
    "review_date": "2007-10-16"
  }, 
  "wveSuWGNDD9H4g1h_0XGpA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Guida N.", 
    "review_text": "I have a weakness for a good dive bar... I'm not sure exactly what it is but I love a night out watching sports and chatting in a San Fran dive bar better than most other activities... and I'm pretty girly &amp; non-divey when it comes to most of my life!  A friend recommended this place as a good venue for watching games and possibly being able to tune into big matches from home (I'm Australian - it's really hard to find bars willing to show sport from that side of the Pacific!).... then I found out about the free popcorn. The rest is history!  Really good bar to relax, chat with a friend and have a few drinks. It's not bad for people-watching too! Looking forward to more nights under the dim lights of Northstar Cafe!", 
    "review_date": "2013-10-19"
  }, 
  "K1NLdTfT1IizE-6smhsSug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayrn H.", 
    "review_text": "First of all, how can a place so chill and so laid back charge $3.50 for the champagne of beer...MILLER HIGHLIFES?  Bus Stop is $2.00 and R Bar I think is $2.50 (but they have Olympia's in cans for $2.00 so you can't go wrong there).  Then they offer their drafts for $3.00 during happy hour?  I think I'd rather pay the extra $.50 for the happy tummy the next day as my trust in peoples taps and cleanliness lately has been diminished entirely.  Other then that and the nasty smell of cleaning supplies, dried up and fresh urine, old dirty guys' B.O., and the strange first impression attitude from the bartender, this place is \"A-OK\" with me.  I mean really...it's ain't that bad.  At least they always have plenty of TP in the women's bathroom in a nice pretty basket waiting for you!  Plus the patrons aren't so bad.  I mean, they all look like normal peeps rather then done up, made up, fake ass, pretenders.    I have been an occasional Northstar drinker, nothing consistent, but I don't mind catching a game, chatting with friends, or dancing and singing to the wonders of Boys Gone Wild whenever they make an appearance back in SF.", 
    "review_date": "2008-11-14"
  }, 
  "XnbGrJNw0wglmqXekW138Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn B.", 
    "review_text": "okay i will admit that there isnt really anything special about this bar, and sometimes its way too crowded, but i have had a lot of fun times here with my friends!  sometimes too fun... still dont know how i lost my wallet in the mensroom that time.  anyway, its just a great bar to hang out in, definitely try out the jukebox, its always fun to hear your  songs come on.", 
    "review_date": "2006-06-18"
  }, 
  "kk2oFTBSU9C2XshIVU7tXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassandra J.", 
    "review_text": "I've come by here for drinks a few times when wandering the area. Major bonus, they have a few awesome ciders (since I'm really not a fan of beer). The inside is kind of small, so it's not the best place to go if you have a large crowd, but it's friendly, has a great atmosphere, and a good range of drinks plus bar food.  I definitely enjoy stopping by here for a drink while out in the North Beach/Chinatown area.", 
    "review_date": "2013-04-21"
  }, 
  "xgzf0gPQAjZD2wMNY3679Q": {
    "user_rating": 2.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Katrina F.", 
    "review_text": "I think this bar would have been fun if you had just turned 21 and were hanging with your frat buddies. Otherwise, you will feel like you are hanging out at a dirty frat house. Super crowded at times, mostly young college looking kids. Average drinks", 
    "review_date": "2012-12-29"
  }, 
  "Rgxe6btTSPFvVVgLtaLncw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T T.", 
    "review_text": "I LOVE Northstar!  That's about the long and short of it. It's an awesome, casual neighborhood bar with great bartenders (go Sub!), great regulars, and on Sundays during football season it's where you'll find me, bar none, rooting on the Bills. We came here solely because it's the official, unofficial home to all things Buffalo (Bills, Sabres, etc), and ended up coming here on a regular basis for all sporting events (and also just for shits and giggles). Northstar kicks ass. If you think differently, I'll be the gal with the Black &amp; Tan. Come on down.", 
    "review_date": "2010-07-13"
  }, 
  "gjhzKWsqCIrpEd9pevbKZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miriam W.", 
    "review_text": "Came here to watch the USA get eliminated from the 2006 World Cup in the first round of play.  Seems like a friendly-enough place, just not sure what would bring me back. Americans playing great soccer?", 
    "review_date": "2006-07-03"
  }, 
  "znIeTtS3D1uoDIaZllVWbg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jonathan M.", 
    "review_text": "Northstar is a bar.  It serves drinks and plays music.  Don't touch the bug zapper in the back corner of the bar.", 
    "review_date": "2009-08-17"
  }, 
  "Fj5cMqRxXpfNo-4JVjDfeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason D.", 
    "review_text": "Sweet bar on the weekends.  Definitely my favorite bar in the city.  Free pool on the weekdays but amateurs need not to put their name on the board.", 
    "review_date": "2011-07-27"
  }, 
  "YXf5O6LPXvFQN2wjWIoo2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nosniv X.", 
    "review_text": "Update: They've raised their prices to $3.00 a pint.  Minus one more star. Happy hour $2.50 from 1-8, but beware, their clocks run 20 minutes fast and they'll try and charge you regular prices at 7:40.   If you're still sober enough, point out the time problem to them and they'll give you happy hour prices.  I'll volunteer on behalf of my fellow yelpers to see if happy hour actually starts 20 minutes early. The bathroom pictures are pretty entertaining too, although, I can't attest to what they have plastered up in the ladies room.  It might be possible to convince me to volunteer to find that out as well.", 
    "review_date": "2006-07-17"
  }, 
  "CBwPegIptHW0vwGsaxcfHQ": {
    "user_rating": 3.0, 
    "user_location": "Danvers, MA", 
    "user_name": "Chris B.", 
    "review_text": "$4.50 for a pint of Racer 5.  Thumbs up for the appearance of a complete dive sports bar.  Not much more to say.  Came here, dranked two beers, moved along.  This might be a fun place for Super Bowl...", 
    "review_date": "2010-01-20"
  }, 
  "dTcYw_RuYUm-j83emwDnUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee C.", 
    "review_text": "I found a place that airs, Aussie Rules Football!!! One of the fast pace exciting sports to watch.... If only I lived in OZ I wouldn't get so excited about a bar showing a stupid football game.   North Star has a lot of Character and the best bartenders in town!", 
    "review_date": "2009-03-13"
  }, 
  "355W7iKObLwu3greKAJcqQ": {
    "user_rating": 2.0, 
    "user_location": "West Village, Manhattan, NY", 
    "user_name": "Danielle J.", 
    "review_text": "I didn't have as good an experience here as others, maybe because we were looking for somewhere else, but then i recalled reading reviews about good bloodies so we stopped in...it was midnightish (we JUST left, and i'm sober enough to write a review, if thats an indication...but with only one drink i suppose that's ok..), after going out elsewhere since 9ish, and they were having some $4 flavored vodka specials (which obviously i didnt expect to be strong, but it wasnt bad...not something i'd order if not on special though)...it was totally divey as other reviews state, and maybe tonite was just a bad night, but it was an older, somewhat rude crowd (some guy came up to my boyfriend asking if hed 'seen his coat'--he must have been sitting there earlier--and when my boyfriend said no, but then found it on the floor the older man was like 'you knocked it onto the floor didnt you.' not in a kidding way, but in a rude way...which no, he didnt..) i would come back here for daytime bloodies (especially as ive yet to try one here and i love north beach!), but i dont think i'd come back for another night experience.... but again, from other reviews, i'm hoping this was just a bad night!", 
    "review_date": "2009-01-30"
  }, 
  "qLUkZ4vhK73qzjB3k8LKVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrey C.", 
    "review_text": "it's so nice to know there's a cozy place near work with a fun selection of cheap drink specials! a great place to just hang out, watch some sports and enjoy free popcorn and pool!", 
    "review_date": "2010-04-30"
  }, 
  "tivREil59K6jdZzrbbdf2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Orla P.", 
    "review_text": "I think it's only appropriate that my first review is of northstar, since i can usually be found there at least once a week!  It's a great local bar with free popcorn, free pool and a jukebox.  Love going there on off nights and agree that friday nights can be kinda fratish.  Mark the bartender is the best!!", 
    "review_date": "2008-01-24"
  }, 
  "bWxxfPP08zWJuM5wKG0LvQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cathy T.", 
    "review_text": "I came here like five times without even realizing what the name of the place was. Finally this weekend I found out the name of the place was Northstar. Every time I've been here it's been incredibly crowded and full of drunken ex frat boys. I think this may be where you go when you finally realize that you're too old for Bar None.  Plus one because the bartenders are pretty nice.", 
    "review_date": "2007-08-27"
  }, 
  "RZUGrWB5EiNwaXHi6ZH7fw": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Tony C.", 
    "review_text": "Awesome place! Went and watched Champion's League Final there yesterday and had a smashing good time. Guys running the place let us in early so we could yap about football an hour before the match and after my team, Inter Milan wrapped up their 3rd European Championship, the shots they were a flowing.   Thanks for the memory and the hospitality lads, I imagine I'll be spending some more early weekends there for matches.", 
    "review_date": "2010-05-23"
  }, 
  "j4ggBi1YEzehYgF6YMaebw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen S.", 
    "review_text": "Awesome place! fun bar to hang out with buddies and make new friends, the bartenders know what is up and are great,  plus free popcorn!", 
    "review_date": "2006-08-08"
  }, 
  "HH4JSXA8OB4kHPv37fnfdA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick C.", 
    "review_text": "By far my favorite North Beach Drinking establishment.    Lots of friendly people, free pool (except on Thurs, and Sat) and popcorn.  While it would be nice if they sold cans of PBR, $3 drafts isn't too shabby.  It's also the only bar in the City that serves Labatt Blue (for those who hail from the Great White North).  For people who want a loud rauckus bar go on Saturday nights or Sunday Mornings (they happen to serve the lovely patrons of Buffalo).  For those who are looking for something more low key, it's great on any other night.     While I wouldn't quite classify it as an oldman bar, it has many of the same benefits  without all the homeless people.  These include being able to bring in your dog, and you can bring in outside food.  The bartenders are nice and accomodating, and the bar is laid out well enough so that you shouldn't have trouble getting a drink.", 
    "review_date": "2008-11-18"
  }, 
  "V6MrNeOP8QkjawhnbGMU5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shell N.", 
    "review_text": "Love this bar- awesome bartenders-great location-laid back crowd- instant fan-- -Mustache's welcome", 
    "review_date": "2011-02-03"
  }, 
  "HdW_VZSVFiZTt7VcGIu52w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "frisco j.", 
    "review_text": "i've been here now three or four times on friday nights, but for whatever reasons, northstar doesn't get crowded. i suppose this is a good thing cuz north beach can get quite obnoxious on weekends. hence if you're in north beach, especially on weekends, leave the rowdiness to broadway and columbus and head to northstar. grab a drink and be thankful that northstar hasn't been discovered by the weekend crowd. i think you know what i'm talking about.", 
    "review_date": "2006-06-12"
  }, 
  "qTwLkE_tD0YCZURpQBw29Q": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Ryan B.", 
    "review_text": "Great neighborhood bar!", 
    "review_date": "2011-06-27"
  }, 
  "yzigFdxMCfJ6E5WqaQVbyQ": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Dan P.", 
    "review_text": "This is a good little place. I'd never been there before last night, and I'd definitely come back. It's a little smallish... more like narrow, but it's still not too bad. The bar staff was extremely quick taking orders, and everyone was in a pretty good mood there.   I guess since it was a Friday night, they were playing their own music off their sound system, but I flipped through the jukebox anyway, and it definitely looks promising. No Eddie Money or Rick Springfield, but hey, nobody's perfect.  Hilarious sign painted on the wall outside that says \"Voted #1 Happy Hour by Betty Ford Clinic\". Nice.  If I was a week boozer and I worked in the city, I'd definitely stop by this place after work for some $3.00 beers. Good scene overall.", 
    "review_date": "2009-04-11"
  }, 
  "UlLp3y4ZKq7BO1RqUFjCHA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina R.", 
    "review_text": "It's the Buffalo Bills bar! How can it not be full of fun!? Great place to watch a game. They have pool in the back and plenty TVs. In the morning, they have breakfast burritos outside. A couple years ago, we took a bus from here to Candlestick for a Bills vs 49ers game. It was so much fun even with the sad trip back. (Bills got KILLED by the 49ers) This place is super casual and has a good mix of people.", 
    "review_date": "2014-08-03"
  }, 
  "1w3brs6DYDuWbvSYFkzvPg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystha B.", 
    "review_text": "Came here already drunk, but it was totally great! Nice considering it's 4 blocks from my house and a pretty good low key crowd that is not fratty marinaish but not hipster missionish either.", 
    "review_date": "2009-05-03"
  }, 
  "IRsI8mkBLpJTMuYL2uz6vw": {
    "user_rating": 5.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Rachel F.", 
    "review_text": "LOVE this place. A group of friends and I came here on a detour during the lame San Francisco Urban Beer Hunt after the bartender up the street at The Boardroom threw a hissy fit (see other review).  Free popcorn and pool! A decent draft selection. Looks like they have a pretty good Happy Hour during the week. The bartender was very friendly. We were there mid-afternoon so the place was pretty chill with a good crowd. Needless to say, we didn't finish the beer hunt and closed out the day here instead. I would come back to this place if I find myself in the area.", 
    "review_date": "2012-05-14"
  }, 
  "GawyLibaMGt3PCsv-hI5sA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy C.", 
    "review_text": "Best thing about this place, is the sign outside that says, \"Voted best happy hour by the Betty Ford Clinic\".  lol.  Made me laugh.  Everyone loves this place.  I don't get it.", 
    "review_date": "2009-01-03"
  }, 
  "4dclJLG4cO_ACx2zkCbjag": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Esther K.", 
    "review_text": "I have loved this bar since I had my birthday party here and have taken every opportunity to make my friends come back with me. It's a casual dive bar with reasonably priced drinks, tons of TVs playing sports games, and free popcorn (with hot sauce...I swear, it's really good even though my friends hate it when I put it on the popcorn).  Anyway, the real reason I am breaking my Yelping hiatus is for their awesome owner, bartenders, and staff. We held our Team in Training fundraiser here and everyone was so helpful -- they set us up with a table, cash box, and wristbands. All we had to do was show up with my friend's beautifully made glittery poster and invite our friends to show up! All my friends had a great time at the bar too and we didn't even take advantage of their offer to use the iPod speakers to play Justin Bieber and Selena Gomez nonstop!", 
    "review_date": "2012-04-07"
  }, 
  "l36ud3agBxzBJ88zIeNVfA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline J.", 
    "review_text": "Great Bar!! Love the fun atmosphere and partying to the  jukebox. Young and chill crowd - I'm definitely coming back for another night of drinks at this dive :)", 
    "review_date": "2009-01-11"
  }, 
  "SKoMY7RhDCAvlqaYuaxEoQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren R.", 
    "review_text": "LABATT LABATT LABATT!!!  The only place where they play Bills games on Sundays during football season as well.  Plus they let you bring in outside food.  What better way to spend a Sunday during football season - get drunk, get breakfast food, watch the Bills game and get drunker!  Park in the garage around the corner on Vallejo next to the police station - not a bad price!", 
    "review_date": "2007-05-22"
  }, 
  "lI_BQEP8HctfwKQQc18EhQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Nate E.", 
    "review_text": "LOVE this place...so it smells like urine at times, but if you are in North Beach this is the best place to end your night. Good music, good drinks, and good crowd.   Hey I will trust any place that has \"Happy Hour Sponsored by Betty Ford Clinic\" any day. Best nights our Thursday - Saturday.", 
    "review_date": "2008-05-14"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "I have to give this place 5 stars for being my first bar ever in SF.  When I was 18.  Thank you for thinking that I was 32!  You started me on a long and happy road.  For that.  I owe you thanks....", 
    "review_date": "2005-12-06"
  }, 
  "YeNxJyvBdD5OIFC-rcSFXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K F.", 
    "review_text": "If someone called me and said: \"Look, I'm in search of the worst bar in San Francisco,\" I would likely know exactly where to turn.  Description: -Arrogant, dismissive and moronic bartenders -The absolute worst clientele you could possibly imagine (frat boys galore) -A jukebox that would fit a frat house, circa 1992  That about sums it up. You'd have to place a loaded revolver to my head to get me back into this dump.", 
    "review_date": "2009-11-20"
  }, 
  "arY2V-MtKksRAoqd-dVYOQ": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Yosie G.", 
    "review_text": "Good for a large group. Gets crowded on the weekends (what do you expect with bars). If you're holding a party there they let you bring your own food! Flat screen tvs with sports playing in the background and a pool table in the back room. Not bad..", 
    "review_date": "2008-04-20"
  }, 
  "7TfVV64bpESXSalEuVQurw": {
    "user_rating": 4.0, 
    "user_location": "Sebastopol, CA", 
    "user_name": "Whitney J.", 
    "review_text": "I was visiting SF one weekend when I realized that I was going to miss a LSU football game, which by the way, is not acceptable! After a mild freakout a fellow SF by way of NOLA friend informed me that I could check out the LSU Alumni page for spots to watch the game in other cities....BOOM! That's how I found out about Northstar!  All I can say about this gem is that they are so very, very NICE to us LSU alums... the employees were nothing short of AWESOME!  Thank you, thank you!!  I hope this spot gets to host every LSU game from here on out!", 
    "review_date": "2011-12-02"
  }, 
  "WnzRueYdRWNSbkXB0_0i4Q": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chuck N.", 
    "review_text": "I love this place. Happy hour every Mon through Fri between 3-7. Drinks are $3-7 and they have tons of specials, free hot popcorn, free pool, friendly locals, awesome bartenders, etc. Best happy hour spot in North Beach by far. And the drinks are stiff.", 
    "review_date": "2013-05-09"
  }, 
  "J1aurUGR360LS7GRnuW5PA": {
    "user_rating": 4.0, 
    "user_location": "Westchester, Los Angeles, CA", 
    "user_name": "Limzer L.", 
    "review_text": "This is my neighborhood Cheers!  I love this bar, the bartenders, the people who come here, the free pool, the free popcorn and their awesome drink specials they have during the week!  They show all the sports that are on that day and they have a huge fan base according to what sport is on.  You can hear screams coming from this place when their team scores!  The juke box is awesome as well!", 
    "review_date": "2009-12-08"
  }, 
  "3fw0ZRNoQNbyCxcmvazA_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael N.", 
    "review_text": "One of the best bars in the city.  Don't go unless you want to really step on the gas because you will just get annoyed.  But always a good crowd and they are a red sox bar which is a bonus.", 
    "review_date": "2007-07-25"
  }, 
  "OrnQ04JCGie8Q2ymFF97FA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michael C.", 
    "review_text": "My friend and I were on our way back to the police station garage (which isn't badly priced), and decided to grab a pint here. This is a solid dive bar on the edge of Chinatown with a friendly, local atmosphere. I definitely feel like I've been to similar in New York and elsewhere in the city.  The bar had a decent selection of California craft beers, a Jager and Fireball machine, and some solid Scotch selections. Plenty of TVs were playing the Giants and the Golf game, and the awesome British bartender was providing hilarious color commentary. Actually coming on a lazy Sunday to hear this guy in a cup match would be worth the trip alone.  Sadly we only came in for a pint, but looking around they definitely favor their patrons - along the walls are \"Customer of the Month\" signs, which is a great touch.", 
    "review_date": "2014-05-12"
  }, 
  "dE9YaRaUtkDm-xJrW3BSPg": {
    "user_rating": 3.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Shane R.", 
    "review_text": "pretty typical small sf dive bar.  i couldnt care less about beer so i cant really comment on that.  a couple midsize screens.  pool.  would be a chill place to watch a game with some friends.  too small for my taste and nowhere to sit if its even mildly crowded.", 
    "review_date": "2012-04-01"
  }, 
  "EjQdVKrGOE7oUz7kpBGv4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie J.", 
    "review_text": "First - who knew that there was a 'cafe' after Northstar? Though, i have been here on a weekend afternoon and had coffee as my beverage of choice, but that really isn't a typical northstar outing in my book. I come for the great vibe, jukebox selection, pool table and popcorn. The bartenders are great, and the whole bar is just a fun place to come before or after anything, or on a 'just because' kind of night. I love this bar, definitely a favorite.", 
    "review_date": "2010-02-05"
  }, 
  "e77JyltArqckcdBl13bVbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve C.", 
    "review_text": "Another solid, friendly neighborhood sports pub in North Beach.  Popcorn machine, good lineup of beers, cool bartenders, and TVs everywhere.  I came in for a Giants playoffs game and felt pretty welcome.  Would absolutely come back.", 
    "review_date": "2010-11-08"
  }, 
  "DB717wes6bHyiPq0oDl_3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Akshay S.", 
    "review_text": "I'm not a big fan of Sports Bars, but this one had a good crowd for a Saturday -- ie. lot's of friendly people having a great time.  Plus, they were smart enough to have a decent bartender to drinker ratio which meant that I didn't have to wait very long to get attention, despite how crowded it was.  That made for a good experience, as did the strong drinks.", 
    "review_date": "2007-06-16"
  }, 
  "xtZMctl7AQNspIL_SF3guA": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Chris B.", 
    "review_text": "Northstar is one of the few places in North Beach where there is a distinct lack of the B&amp;T crowd that populates the bars and clubs on Broadway. That being said, the crowd does tend to be fairly yuppie-ish in that  \"look at me, I work at an I-bank\" post-collegiate sort of way, but if you get there early enough and snag the little patio section by the pool table, you and your bros can drink there in peace. Bathrooms suck though.", 
    "review_date": "2006-06-08"
  }, 
  "DUD7JGCUF6WJtXhVX1B2BQ": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "PierLuigi G.", 
    "review_text": "By far the best bar in North Beach. Best bartenders (Sub, Mark, etc.) but the people that go there are cool too. Great for watching sports during the week, and a fun crowd on he weekends.", 
    "review_date": "2009-01-13"
  }, 
  "MmltA0DVXyvVQKFzoOXeFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer A.", 
    "review_text": "MARK AND MOLLY ARE THE MOST AWESOME GIANTS GAME HOSTS EVERRRRR!  Free popcorn. Free pool. Happy Hour prices were HAPPY Happy Hour prices.  Great people, crowd's super friendly, lively and welcoming. If I lived in the area, this would be my go-to bar, and once again, Mark and Molly ROCK!", 
    "review_date": "2012-10-16"
  }, 
  "Im-WVGnobeeN5EuLm10BpQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ka C.", 
    "review_text": "Great Bills bar in the city but warning it get crowded....and if they lose watch out!  Free popcorn and pool, who could ask for anything more?!?! oh yeah, I guess great bartenders-they have those too. The guys are always more then welcoming and even when my Vikings lost the bid to the super bowl (farve fail) I got a hug and a free beer...just the kinda bar I love in my neighborhood.  See you soon Northstar!", 
    "review_date": "2010-01-27"
  }, 
  "AL0_BZxfrdNlJht2mz3PGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trista G.", 
    "review_text": "In a neighborhood I hardly ever go to but one I probably will start to frequent solely because of this gem.  There is nothing foo foo here but it is fun, clean, and laid back. There seemed to me such a good mix of people their too. Also seemed to play a nice variety of music, and they kept it at a good volume so as to still be able to converse easily. Cheap drinks, free popcorn (with hot sauce), free pool.... whats there to complain about!?! :)", 
    "review_date": "2011-05-12"
  }, 
  "TVgDN-CZ0wdszYCFXDtOug": {
    "user_rating": 3.0, 
    "user_location": "Decatur, GA", 
    "user_name": "Alayne H.", 
    "review_text": "I was researching where the Bills Backers of San Francisco meet and that's how I found the Northstar Cafe.  I arrived early enough to get a seat at the bar and was glad I did as it filled up fast.    This place is fairly small with a room off the bar that has booth seating, a pool table and additional TVs.    The bartenders were efficient and friendly.  The popcorn was a bonus!  Loved the retro cash register and old school charge card machine used.  It's been awhile since I've signed off on a duplicate inked charge slip.  Lots of cool memorabilia and sports banners serve as decor.    The patrons were friendly and overall I thought this was a cool bar.  Based on the many reviews, it's a great place for happy hour - maybe next time.", 
    "review_date": "2011-10-25"
  }
}