{
  "9A8hDQj_GTULp3C5QjdtFQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Lori A.", 
    "review_text": "Two Words: Cocktail Heaven.   Despite being slightly skeptical of the location, I followed my friends into SRO at Oddjob and before I knew it was having the most enjoyable and entertaining night out in SF that I've ever had (which is saying a lot, especially since it was a Tuesday).   What makes this place work so well is 1.) Joey and 2.) his friends, friends of friends, and complete strangers that come together to let loose, joke around, and witness cocktail magic.   To put it simply, when it comes to crafting the perfect cocktail, Joey is a wizard. While he has an incredible array of ingredients to choose from--the thing that stands out the most is the level of imagination and heart that goes into creating them. He masterfully recreates any given mood or feeling perfectly. He also has a way of convincing you to trust him and try things you would have never considered. I specifically requested that he not use a particular ingredient, yet he insisted to use it and ended up creating one of the best drinks I've ever had.    In watching Joey create drinks for others, you end up befriending all of the people around you. Joey treats everyone like family, and before you know it you'll leave feeling like one. You may never know what kind of drink you'll get or the people you'll meet--but this place is guaranteed a great night out, any day of the week.", 
    "review_date": "2014-12-17"
  }, 
  "qVV7I9kqaEbass6LQ1RYgQ": {
    "user_rating": 1.0, 
    "user_location": "Western Addition/NOPA, San Francisco, CA", 
    "user_name": "Benn H.", 
    "review_text": "wish I could give a 0 star review. I'm not one to complain usually, and I understand the biz after being a bartender myself for 20 yrs., but the bartender I happened to get every time sucked. was not very attentive. he ignored me the first couple of times I went to order a drink until I got his attention and he didn't give me my change on the last round I bought (I think he expected it to be his tip), so I decided to walk away after a few minutes. like I said, I know the biz and would have tipped appropriately, had I been given the chance..", 
    "review_date": "2014-03-27"
  }, 
  "lkftxPLVTVs87yzlif2-fg": {
    "user_rating": 3.0, 
    "user_location": "Incline Village, NV", 
    "user_name": "M K.", 
    "review_text": "The 3 stars are all for the previous location \"Bigs\" which was 5 stars all the time. We sought out oddjob because bigs had the best most inventive cocktails and awesome bartenders. We came in about midnight on Saturday night and the bartender said she was backed up it would be a few minutes. No problem. 10 minutes later she says there are 4 drinks in front of ours. Still, no problem. 15 minutes later she actually comes out from behind the bar over to our table and tells us she still has 4 drinks in front of us and it's almost last call so we should go to the other bar. Not embellishing. African American female bartender should not be allowed to work with people. I've bartended for years and would be fired (and expect to be fired) if I ever did this. We went to the other bar and spoke to a bartender who said \"she's really sick\". Gross!  Extremely drunk manager (it was his birthday) offered to buy us drinks but by that point we were over it.  Based on how great the owners and previous bartenders were we hope to try it again and actually get a drink. Hopefully I can revise and give them 5 stars.", 
    "review_date": "2014-10-26"
  }, 
  "vvVJS7__C0KUiBeMYUnszw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sasha R.", 
    "review_text": "Joey made my visit to the oddjob. I just specified my liquor and he created personalized and amazing drinks. Fantastic and magical drinks. He is personable and amazing and the reason I would return.  Nothing but positive adjectives for the best.  I might be a wee bit drunk but it's all due to Joey.", 
    "review_date": "2014-01-18"
  }, 
  "xyqnCAQsARyayfkl0dSNKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey L.", 
    "review_text": "Aside from the sketchy location, this is a pretty good (albeit pricey) bar to chill with friends and drink some thoughtful / creative cocktails. It really is an odd bar with a mixture of decorations including tools and animals (weird combo, right). There's even an absinthe fountain (random)!   It wasn't too crowded here on a Saturday night, which was great, because I could actually hear people talk and felt like the place was a bit more private.  Cocktails run around $12-14 each. Some of the drink names were James Bond themed, and I tried the \"pussy galore.\"( Did they name it that just to hear you say it??) Careful,some of the drinks are quite strong, and others are more sweet. The pussy galore is a sweeter one.   The real gem of this place is the bar to the left of they alleyway entrance where the bartender will create made to order drinks on the fly based on your preferences. I asked for an herb infused drink on the sweet side, and he made a parsnip infused cocktail with absinthe. I actually don't like either ingredient all that much, but the drink itself was AMAZING. The ingredients just went really well together. He also has a wide selection of scotch and whisky. Drinks at that bar will run around $20 each, but it's worth it to try at least once.", 
    "review_date": "2014-04-21"
  }, 
  "L0tWZK4sZ9wIHl4weT-Ijg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shane M.", 
    "review_text": "I don't really drink but occasionally have the need to go out with co-workers for a drink near our office. This place was a total gem of a surprise. Great ambiance, good drinks and wasn't insanely loud. I'll try the absinthe next time though...", 
    "review_date": "2015-01-12"
  }, 
  "ZhltiCpjbVNWb3WRIGi9dg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan L.", 
    "review_text": "This bar is super unique and definitely one that takes the slice. If you're lucky you will get Joey as your bartender and this guy really knows how to entertain. The cool thing about this bar is that you won't get a menu. You won't even know what to order actually, but that's okay because you don't need to know.  All you have to do is tell a story about yourself and boom, he creates the drink of your dreams. So what if you don't like it? He'll make you something else that you will like, but it keeps going until you like it. It's an amazing atmosphere and one which you can just sit back, relax with some friends, and have a great conversation with the bartender. Definitely recommend this place to anyone who loves a speakeasy bar or just one that is a little bit different than the norm.", 
    "review_date": "2014-09-29"
  }, 
  "VVtaIyZH1Mpq7swC5lwWnQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sachin A.", 
    "review_text": "I really want to love Oddjob. They are super close to Twitter and I love the space.  But the drinks are hit or miss. I've had some great manhattans there, and some that taste awful.  The last time I was there I ordered a gimlet from a bartender who clearly didn't know how to make it. Came out way to sweet, on the rocks. I later avoided this bartender and ordered from another, but he asked the first to make it! doh. Awful.  If they want to be a cocktail place, they need to hire trained bartenders.", 
    "review_date": "2014-06-04"
  }, 
  "cexiILPg618hTP7Y3iGaWw": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Gregory L.", 
    "review_text": "Oddjob is always a good time. Friendly atmosphere coupled with interesting decor. I've been twice and have yet to try the same drink. Great value and friendly staff. Talk to Nate for a great group round, or Joey if you are feeling adventurous.   Bring a group and experience the best bar in soma.", 
    "review_date": "2014-03-05"
  }, 
  "rgfvK-9ynwLXE0ZJXdKYcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan F.", 
    "review_text": "Extremely friendly bar. Large space. Amazing drinks. Knowledgable staff. What's not to like?", 
    "review_date": "2014-03-14"
  }, 
  "HXfNW-cTsk9ec6Gtrr_QLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole H.", 
    "review_text": "Love this crafty cocktail bar.  Super cool industrial type decor/vibe and lots of booths to sit and get cozy.  I'm obseesed with this place bc the bartenders know exactly how to make me a delicious, refreshing and yet \"skinny\" Ketel One cocktail or a lovely champagne cocktail. yummy. The best spot for an after work cocktail with a buddy. I also love to come here after a nice dinner downtown for an end of the night cocktail too.  The manager Nate is very friendly and came over to introduce himself and make sure we were pleased with our cocktails and our experience.  Also, a great spot to host a private party.  Thinking about having my next bday party here :)  Highly recommend!", 
    "review_date": "2014-07-07"
  }, 
  "IupRFK42AiVuhbrE_c1vag": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "JJ M.", 
    "review_text": "This place doesn't look like much from the outside, but it is definitely a hidden gem once you manage to find the entrance. The girls that work there are extremely friendly and very easy on the eyes (go ahead and see for yourself). They have some amazing atmosphere and one of the coolest bar-tops I have ever seen (looks like a repurposed conveyor belt). The bartenders are down to earth and not pretentious like most of the downtown SF bar scene tends to be. The drinks are a little expensive, but its the SOMA so what do you want. You definitely get what you pay for. One of my favorite spots to get \"ODD\".", 
    "review_date": "2013-12-04"
  }, 
  "vbEaTIiGyx5w3kQa1HOCJA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "K H.", 
    "review_text": "You already know this but they have unique and delicious cocktails! Hard combo to do! Love the backroom and spending time drinking something that isn't (soda) + (hard liquor). I know what you're thinking, why not five stars? I took away one star because of two reasons: 1) $14 a cocktail gets a bit pricey for a gal who likes to have more than one drink and 2) they are cash only. It's nothing personal against them, I just have a 21st century pet peeve against cash only places and a personal vendetta against my bank's ATM fees (grr).  All in all, this will be my \"I want to impressive you\" spot for visitors or for friends that really freaking know their booze. Wish I knew how to make a cocktail even slightly as delicious as they do. Please teach classes! #praise", 
    "review_date": "2014-03-27"
  }, 
  "9FK5phTJPHO2aQYm40T-iw": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Candice B.", 
    "review_text": "If you find this gem, prepare to be pleased with creative cocktails and awesome service.  This review is for the smaller craft cocktail bar to the left that is expertly manned by Joey. Tell him what you like or don't like, the spirits you're into, and what kinds of flavors or other cocktails you're into and he'll whip you up some smooth libations with house infusions, homemade syrups, fresh garnishes, and more! I'm a fan of every drink I've had there (about a half dozen so far) and have introduced several friends to this spot.  I'll add that I met Joey when he was bar tending at my fave local restaurant down the Peninsula and have followed him up to SF to visit and enjoy not only cocktails, but rousing conversation and an all-around good time.  Check it out and bring a friend!", 
    "review_date": "2014-01-15"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "Given their street address number, naming the bar Oddjob seems like such a missed opportunity given SF's tech centric culture.  I went last Saturday night and it was packed with an incredibly mixed crowd.  The music was loud and I couldn't tell when one song ended and the next one began; it all sounded the same (no lyrics, not really danceable, dark).    Bottom line, it's a little too steam punk for my taste.  I half expected the bar tenders to be wearing aviator goggles.", 
    "review_date": "2013-11-12"
  }, 
  "OMd5KpyZTEcDvPOdySg2BA": {
    "user_rating": 5.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "Amy G.", 
    "review_text": "Incredible drinks. Great decor. Plus, they have the same bar here that used to be called Big (that sadly closed) where the mixologist/bartender asks you what flavors or concepts you like in a drink and then whips up the most incredible cocktail you've ever had. I do believe it was Joey who made our drinks last weekend: 5 out of 5 stars!   So glad this place is open!!! I will definitely be back as often as possible.", 
    "review_date": "2014-03-11"
  }, 
  "UNAhiFADve8iaZ5RsoVQQw": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Mark G.", 
    "review_text": "I should have listened to the reviews. The shots are less than they should be. My beer was warm and the bartender was being passive when he heard me complain. As he made a drink he kept \"coughing\" in my face as he was making my drink. Terrible place, wont be coming back here ever. Every drink is over priced and under delivered.", 
    "review_date": "2014-08-26"
  }, 
  "SRz0Q-tsPd1SU8bvFi_ToA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darin E.", 
    "review_text": "Joey &amp; SRO (bar within the bar) = Happy Darin  I love the concept and execution by Joey. If you like cocktails and have an open palate, you will never be disappointed. His experimentation with bitters, infusions, and spirits offer endless possibilities   Tip: don't stroll in here with a dozen of your neck beard sporting colleagues thinking this place is a great spot for an \"offsite\" or celebration of your latest product lunch. (This means you Square, Twitter, and Uber) The space is small, intimate and you basically screw everything up for everyone else (and yourself) when you do so.", 
    "review_date": "2014-07-17"
  }, 
  "jhPAC7UyPiRFNPlNQYMMXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kazu O.", 
    "review_text": "Most interesting bar, EVER!  Walk into an alleyway in what used to be a sketchy part of town, and you'll find the unmarked entrance for Oddjob. Enter the door, and turn left.  See that guy behind the bar? His name is Joey, and he'll make you some AMAZING drinks.  There's no cocktail menu, and don't even think about ordering a jack&amp;coke or a shot of fernet. Talk to Joey, and he'll ask you what kind of drinks you like. Give him some descriptions (fruity, smokey, boozey, etc) and he'll come up with a unique drink for you, on the spot.  What makes his drinks unique are the extremely interesting ingredients he uses. One of my drinks had a chantrelle mushroom-infused rye whiskey (along with a whole list of other ingredients that I can't remember now); another friend of ours had some tea-infused vodka, and so on.  $16 a drink is a bit pricey, but this place feels more like an \"experience\" and it's definitely worth the trip. Joey is quite an entertainer, as well... how often do you go to a bar and here lots of random chantings of people's names? JOEY JOEY JOEY!  I can't wait to go back and try some more drinks!", 
    "review_date": "2014-07-25"
  }, 
  "zkhPYVjTx9GTgpJP-fizYg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "JOEY'S SPECIAL!!!! There's no same here.. Every drink is SPECIAL and YUMMyYY! Can we give them a 5 stars sq!", 
    "review_date": "2014-05-24"
  }, 
  "uYQ-C0OdQU0HOUS1P3r4YA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia S.", 
    "review_text": "Tried booking an event here for 150-200 people since the bar is spacious and they are in the just-right-amount-of-gritty part of town. Everything was going great until the event manager went AWOL right before confirming the event - calls and emails went unreturned in the 11th hour, putting me in quite the pickle! The event manager had suggested the place as an alternative to Jones, which she also manages. There's a construction zone next to the space and there are no signs indicating there's a bar inside, so it might have all been for the better, as we wouldn't want guests getting harassed on the street trying to find the venue. I'm disappointed we couldn't work something out as it seemed very promising!", 
    "review_date": "2014-09-04"
  }, 
  "1UnHCkYb6rYwODO3qAL1rg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candace C.", 
    "review_text": "I have glitter on my face still.  Thanks Joey..", 
    "review_date": "2014-12-18"
  }, 
  "0hEXbAURBmmETEMkR7YTqw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon M.", 
    "review_text": "We sat at the tables across from the bar, and the waitress never came around so we had to order drinks from the bar. This place is cash only too, a little strange and cheap in my opinion. It's only 2-3% for business owners when a credit card is used. The interior was pretty decent, but there wasn't much a crown for a saturday.", 
    "review_date": "2014-04-05"
  }, 
  "Z19DVz61tCmLM2wrBFGC8w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anca R.", 
    "review_text": "I think this place is ok. I live right around the corner, so I'm happy this is in my neighborhood (even if it is sketchy, unlabeled and quirky). Honestly, I think the cocktails are not priced that highly for this city. And I think that they are very good as well. Customer service is always good too. Only thing I hate like many of you here is that it's cash only. This is my only deterrent -since they're also right round the corner from square- c'mon guys!", 
    "review_date": "2014-05-09"
  }, 
  "i2B6LFJ6sJGq03ooznvu8A": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Xander C.", 
    "review_text": "went to SRO (inside Oddjob, to the left) for the first time last weekend, and my usual red flags were tripping: pretentious atmosphere, arrogant bartender, slow service, and a healthy dose of hipsters. i ordered my first drink after specifying my mood and preferences, took a sip, and was seriously impressed. Joey, good sir, you deserve those piles of kudos being heaped on you.  bonus: Joey even made me a Zima inspired drink. how's that for hipster irony?", 
    "review_date": "2014-08-01"
  }, 
  "RndtjBHm41mIisU-oGeV1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie Z.", 
    "review_text": "Oddjob is actually 2 bars in one. Not sure if there's a separate yelp page for the bar to the left(SRO), but I think everyone refers to the location as \"oddjob.\"   I actually didn't get  chance to try oddjob, but I did go to the room on the left. This room has no menu and only has one bartender. You tell him some things you like and he makes a special cocktail just for you! This place is not as busy on saturday nights which worked out well since it takes the bartender some time to create each drink. The drinks are pretty expensive. They range from $15-18 and this side is cash only.   Joey was out sick the day we went but his substitute was also a seasoned bartender.   I feel like the left side may even be a bit too fancy for me since I'm still working on my cocktails knowledge-base. I'm still working on figuring out what spirits I like and what flavors they mix well with. If you're a cocktails connoisseur though, I think you'll love this bar.   still not as good as the aviary, but how can you compare any bar to the aviary! D:", 
    "review_date": "2014-09-15"
  }, 
  "GWNWYTXxTQa2xw5hqwcn7A": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Matthew D.", 
    "review_text": "Just going to keep it simple:  You tell them what flavors you like in your cocktail, and they make it a reality, but 10x better. Joey is seriously very talented, he made the best drinks I've ever had and exceeded all expectations with the flavors we described. Plus, he is very personable and likeable with all patrons. Thanks, man! Will definitely return and talk about more late 90s pop culture like the Verve and Cruel Intentions.", 
    "review_date": "2014-06-14"
  }, 
  "u58VDBejTDgClZQfZiFI7w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David G.", 
    "review_text": "Odd is the word for it. The strange pretension of the \"hidden\" location matched only by the lackluster and indifferent service. Please go out of business and be replaced by something better soon.", 
    "review_date": "2014-05-29"
  }, 
  "IhVGhDGF_-UjP9huKXDEuQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa D.", 
    "review_text": "This is the bar I keep coming back to because it is wonderful. Drinks at SRO are all custom-made based on your preferences. I think I've ordered everything from \"something with absinthe\" to \"redwood forest with a light rain\" -- Joey (and sometimes Crystal) delivers every time. Drinks are worthy of the price.", 
    "review_date": "2014-12-16"
  }, 
  "Ae6iNKubi-jFDa_LSeRwhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marineh B.", 
    "review_text": "Very pricy for each drink, but I guess you can't complain if its custom made for you. Dont even think about reaching for a cocktail menu, It doesn't exist here. Tell the bartender what flavor tickles your heart and the bartender will create an amazing drink for you. Hidden in an ally. No signage. CASH ONLY. Special place if its not crazy packed.", 
    "review_date": "2014-07-02"
  }, 
  "jBfMz5T5Qg9NkW3UdjD48A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dav Y.", 
    "review_text": "Worth a visit just to get a drink with Joey who commands the small bar in the back. He's a true master of the craft, from innovative drinks to charismatic banter.", 
    "review_date": "2015-01-10"
  }, 
  "sHScwaFVKAupTQLV9ECfjQ": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Garrett Z.", 
    "review_text": "Joey (bags/little bocker) is probably one of the best tenders in all of sf. A true mixer of magic. Literally the best I'll be back for sure.", 
    "review_date": "2014-01-18"
  }, 
  "syJlEIY-eolBt6r1XkmT4w": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Diem N.", 
    "review_text": "Review for the Standing Room.   Definitely different than most bars I've been to.   It was pretty empty for a Friday night, making the environment very intimate and relaxing. I like places this like because it is easier to make conversation with the bartender as well as random people.   The cool thing about this place is that there is no set menu of drinks or cocktails that you can choose from. You basically tell the bartender what you like as your alcohol base and what your preferences (sweet, tangy, etc.) are, and he creates a concoction that's just perfect for you. I forget what I got but I remember it was somewhat curry tasting but also very yummy... Weird, I know.     SIDE STORY:  My friend and I ended up talking to a bunch of Swedish guys about the most random things. One of which included me talking about my single French coworker - which really intrigued one of them. I got his business card because I apparently said I can introduce him to her?? SO FUNNY.", 
    "review_date": "2014-10-13"
  }, 
  "vgSiBVyjyfVSU0v7hHlcew": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "sonya h.", 
    "review_text": "Wow...the ginger beer was good...not like anything else I've tasted.", 
    "review_date": "2014-08-12"
  }, 
  "q2q0mZYs9c-iKU4pat31fQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany C.", 
    "review_text": "Joey! Joey! Joey!  This is probably the most unique bar experience one can have.  The drinks are amazing! Order your own since there's no menu but rather Joey just asks you for your preferences.  He has amazing bitters, infusions, and combinations of ingredients that you're probably never heard of.  This is what happens when you never make a drink twice.  What's even more impressive is that they are all amazing.  I think between mine, and all the ones my friends ordered I sampled quite a bit and they are all great!  The bar is also super small, and everyone sort of hangs out with each other.  Reminds me of Cheers!    Be advised though that this bar is cash only and drinks run you $16/each (which can get pricey).", 
    "review_date": "2014-07-20"
  }, 
  "ZfhA7ewaoypSgCCpKDXVOQ": {
    "user_rating": 4.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Israel M.", 
    "review_text": "Cool joint with great dranks. Thank lawd for Joey and his artistic drink making skills.", 
    "review_date": "2014-10-13"
  }, 
  "Orz_nUBJ8XtAQtysylgUcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christie S.", 
    "review_text": "Top notch mid Market/SOMA bar. Unique &amp; attention to detail in design. Excellent staff.", 
    "review_date": "2014-10-07"
  }, 
  "CwnTFDUKTMrVyknznFRbrw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Nishant B.", 
    "review_text": "This place is literally under-rated. Went with some friends on a Tuesday night and we were one of two groups there. The bartenders are true artists -- tell them what kind of flavors you like, and they'll make you something amazing.", 
    "review_date": "2013-11-20"
  }, 
  "nUUk8lzfBKlsQX81EzKlPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "It was a really awesome experience and the drinks were fantastic.  Had Crystal as the bartender and she knew how to make some really creative and delicious drinks!  Joey wasn't working the bar, but he was still there being ever friendly and entertaining!  Honestly a really great environment that I will definitely be going back to!", 
    "review_date": "2014-10-06"
  }, 
  "uKR7NYs4bQPJeI3P6guMkQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sylvia L.", 
    "review_text": "One of the most inventive bars out there.  I have requested and received pumpkin spice lattes, rice krispies, and chocolate/peanut butter inspired drinks.   Location: The bar is hard to spot because there isn't a sign (at least, not to my knowledge). Just look for the large windows and fluorescent lights trimming the windows. Don't look for an entrance through the main street... you have to go down the alleyway.  When you enter, bear left. There will be a small room with the owner there. Joey's Room. You tell him what flavor you want, and he makes it for you. The room is intimate and you are forced to talk to each other. It's a great way to meet locals and a very fun, casual vibe.", 
    "review_date": "2014-10-05"
  }, 
  "sBf5IfUPxTowTdUebPZVTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie K.", 
    "review_text": "Ca$h Only. Creative Cocktails.  Hipster Bartenders. Hipster Décor.  Large space. Little Crowd.  Good Music. Awesome Countertop. Awesome Chandeliers.   The only downside to this spot is that it is in a weird locale that I wouldn't normally venture to, but considering you can also hit up SRO in the same fell swoop, it is worth the trek.   What the bartenders are doing at Oddjob and SRO is not your normal bar where drinking is a sport, here they are making drinks that are meant to be enjoyed, not devoured.   Come one, Come all, drink some drinks, and have a ball. :)", 
    "review_date": "2014-12-15"
  }, 
  "p6giGtQoeZinByGLxy_pYQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt Z.", 
    "review_text": "I thought it would be a good idea to host my birthday party at OddJob soon after it opened (so soon that they didn't have a website or phone number).  Apparently, I was mistaken.    When 20+ of my friends and I showed up for our evening of fun, they informed us that they had been booked for private event (on a Friday night) in an hour.  Despite the fact that we had 20 people ready to buy drinks NOW, they corralled  us into a back room to their front room (and larger bar) could be available for the 4-5 people who showed up for the corporate event that was booked. On top of that, their door staff and security were so rude to the rest of our guests who arrived that we chose to move the party to a different location.  Aside from the rudeness of the staff, I was frustrated by the inaccessibility of the managerial staff and the lack of any email, phone, or website with which to arrange and accommodate events.  Their odd hours also made it impossible to visit in person to check the schedule.  The manager, in a half-hearted effort to keep our business, gave us mixed messages about whether or not they could accommodate us before we eventually gave up and found somewhere else.  While their drinks are delicious and the aesthetic of the joint is quite cool, the ineptitude of the staff and the poor business model of mistreating paying customers in favor of corporate customers who have yet to appear leads me to STRONGLY DISCOURAGE PATRONAGE AT THIS ESTABLISHMENT.  In short: OddJob ruined my birthday.", 
    "review_date": "2014-03-01"
  }, 
  "awjAmGK8hvxY_wYj7imLgw": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Daniel P.", 
    "review_text": "Here on New Year's. Chillest vibe. Girl DJing with a Macbook and a cocktail. Low key electronic music. They had free drinks from 9 to 10, including this delicious thing that's essentially an old fashioned with earl grey.", 
    "review_date": "2014-12-31"
  }, 
  "udjIUpEIygQXgypWmnIeHg": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Diana V.", 
    "review_text": "Grand opening tonight!   A cool bar with minimalist wood and metal decor is really sleek. There is seating at the bar on wooden stool with backs. It's so rare, and plus, to see backs on barstools.   If you prefer cushy seating, they have a lounge area with funky little tables. Everything in this place appears to be \"reclaimed.\"  And get this. They have a machine that makes Corpse Revivers. Seriously. If you don't know what that is, come here and get it.  Plus there's a side area just to the left of the door off the alley where you can order any drink you want (no menu) OR enjoy soft-serve from the machine. I especially like the leather wall covering and the velvet draping in that corner.  I also really liked the vibe in here. The bartenders are way cool and attentive, and happy to mix both alcoholic and non-alcoholic drinks. They make a mean cucumber water! My friend's Moscow Mule was also spot on.  They have a DJ situated right next to the lounge area, spinning all sorts of hip hits to keep in tune with the overall feeling of the bar.  NOTE: There are two entrances, one on Mission Street and one off the alley, Washburn Street.", 
    "review_date": "2013-11-08"
  }, 
  "SSXHbDQ7RoJMCdaQs7Ykiw": {
    "user_rating": 1.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Daniel D.", 
    "review_text": "Spend less $ on cheezy decorations &amp; more time/effort on staff training and better booze..... Use a jigger please. Cocktails were awful.", 
    "review_date": "2013-11-22"
  }, 
  "YAG90mceVFQLdvl4wndvQg": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Margaret R.", 
    "review_text": "+ low key vibe with plenty of seating though this may change because there wasn't a big crowd + fun, fancy contraption makes the specialty drink (too bad the drink tastes like black licorice)  - 4-5 drinks on the menu but the bartender can make you any drink  - specialty drink tastes like black licorice which I don't think many people like   Enter through the alleyway", 
    "review_date": "2013-11-08"
  }, 
  "-XDevzXYBNpdaWJnl5tGlQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Uri L.", 
    "review_text": "Get the pussy galore.  Really.", 
    "review_date": "2014-02-25"
  }, 
  "Q0qo1Gi99LihNjitnpfCAw": {
    "user_rating": 4.0, 
    "user_location": "Los Altos, CA", 
    "user_name": "Audrey C.", 
    "review_text": "Super delayed review...but a great bar, nonetheless. I would never have found this on my own, if it weren't for the fact that I was meeting up with a friend.  We hung out in the back corner, with Joey in SRO (Standing Room Only), and grabbed a drink before heading off to our event. Quaint. Kitchy. Cute (not sure if that's the right word to use, but the one that first comes to mind).  What stood out to me: * Vintage glasses * Handmade drinks * Housemade bitters and infused liquors  Worth checking out, if you're looking for a bar with personality!", 
    "review_date": "2014-05-20"
  }, 
  "xcrJb0e-K1yB1KQkhnfX0g": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Lois L.", 
    "review_text": "A group of brilliant  minds came together to create an innovative, contemporary drinking establishment in an up-and coming area of SF.  Visit the PlusPlus Cocktail Bar, and be greeted by enthusiastic Joey the bartender, who will astound you with one of his original infused cocktails! Friendly, professional service is what you'll experience here!", 
    "review_date": "2014-01-18"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "Definitely one of the better bars in SOMA", 
    "review_date": "2014-08-25"
  }, 
  "Gf2TQJyqxlXfFWF6FgzFyQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lotus C.", 
    "review_text": "Cool space. Good drinks. A welcome addition to the hood.", 
    "review_date": "2014-01-15"
  }, 
  "IcG-70wHwWTDPJl0Z5rCbg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Dominic O.", 
    "review_text": "Super cool and unique bar. Check out the bar counter top and the side cocktail room. Hand made cocktails. Yum!", 
    "review_date": "2014-04-17"
  }, 
  "m7ckHtVLFRtt3RpSZKCstQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Thomas M.", 
    "review_text": "Joey on the SRO side of the bar is the best they come and the crowd he draws is just as great. The rest of the bar isn't too bad either ;). Enjoy your stay, it's worth the trip.", 
    "review_date": "2014-06-21"
  }, 
  "nXYCJrYqAUpVNSTCR2OOLQ": {
    "user_rating": 5.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Noel M.", 
    "review_text": "Crystal is bomb and so is the bartender with the taste in metal, forgot his name. The drinks here are so good.", 
    "review_date": "2014-10-12"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "My new favorite bar! And it's less than a mile from my office (very walkable in my book), so I plan to visit often.  We came in tonight for a friend's birthday and we were all so impressed! I spent my whole time at the \"Plus Plus\" bar side and had a couple of the best cocktails I've ever tried. I loved Big before it closed and these are the same owners so no wonder the drinks and bartending are so perfect.   The bartender for Plus Plus, Joey, is so personable and remembered my name for the whole night (I'll be impressed if he still know it when I come back to visit). My first drink had mint and ginger per my preferences and my second drink was a bit crazier with lot of rosemary and egg whites (both had gin). The drinks were $12 each (less than Big's pricing I think) and so worth it.   Even the bathrooms are cool - 4 single toilet rooms for anyone to use and a beautiful communal sink. The bar is cash only but they have the fanciest ATM I've ever seen.  They are currently open Tuesday through Saturday and Joey will apparently be bartending at Plus Plus every night - yay! I can't wait to come back!", 
    "review_date": "2013-12-08"
  }, 
  "TmQaVo74SLxN22ewv2zuCg": {
    "user_rating": 5.0, 
    "user_location": "Hasselt, Belgium", 
    "user_name": "Jan B.", 
    "review_text": "I toured california all the way from Belgium and just happened to stumblr upon this bar. One night we did the regular part and it was great. Good music, relatively cheap drinks, beautifull staff members and comfortable interieur. The second night we tried the special cocktail part of the bar, with Bartender Joey, and he completely blew us away. For 16$ you'll probably have the best cocktail you've ever had.", 
    "review_date": "2014-09-07"
  }, 
  "DYXyc9SiYtnk54rg6NGTzg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kieran M.", 
    "review_text": "I'm amazed by this two bars concept. Rude service on one side, pretentious 'cocktail program' on the other. It's an awful bar experience in stereo. Nailed it, guys!", 
    "review_date": "2014-03-03"
  }, 
  "fEEU5SZpkI9FSXk0v4xgFw": {
    "user_rating": 4.0, 
    "user_location": "Madison, WI", 
    "user_name": "Dennis R.", 
    "review_text": "Odd, yet still quite a charming little bar.   I dropped by here because one of my friends knew a bartender there named Joey, and wanted to say hello...otherwise I would never have found it. There's currently construction taking place around it, and the windows are impenetrable from the outside, creating an establishment with an air of mystery and, to be honest, disrepair.  But step inside and you are greeted with a spacious, cleverly lit (dark in all the right places) and well decorated area. I went on a Saturday night and it wasn't very crowded at all - our group of six had no problem finding seating. Maybe Oddjob just haven't taken off yet as a prime SOMA watering hole.  Back to Joey...he makes some crazy delicious drinks. We could not stop consuming. The sad part is they are a bit on the pricier side (~$13 each) but definitely worth it.  I'm coming back.", 
    "review_date": "2014-11-06"
  }, 
  "eIa4QJXp5ZNmuFORnuPvDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ziyan C.", 
    "review_text": "Excellent, excellent drinks in the back room. No menu, tell the bartender what you like, and he'll whip you up something amazing. He makes use of really unique liquors, fresh herbs, and ingredients you'd never think would taste good in a cocktail (rhubarb..? Yes, and it was delicious).   When I had my drink, I thought it was the best of the night - I then said the same about every drink I tried afterwards! I think my favorite was one where my friend said she liked \"ginger and sour\". It was light, refreshing, herby, and had a twig of thyme sticking out of it. It's on the left in this photo: <a href=\"http://www.yelp.com/biz_photos/oddjob-san-francisco?select=sPU84NAWsijEhOUUTssu6Q#sPU84NAWsijEhOUUTssu6Q\">yelp.com/biz_photos/oddj…</a>  I also like that every single drink comes in its own unique cocktail glass! I don't think I saw a single glass repeated in my group that night, and between us we got maybe 9 or 10 drinks.  Be patient though - it's a pretty long wait to get your drink: there's one bartender serving a room full of eager customers. But it's only because he puts so much perfection into each drink. He's also really good at keeping track of who's been waiting the longest, so no need to jostle your way to the bar.  The bartender seemed to be friends with several customers, too. That, or he is just extra good with making friends! We caught him doing fun dance moves several times, and we made friends at the bar as well - everyone's just chill and in a good mood here.  At 8:15pm, the front room was very crowded. The back room (much smaller) had 10 or so people around the bar, and the small tables against the wall were empty so my group claimed them. We stayed until about 10:30pm - by then the front room was completely empty and the crowd had swelled and died to about 6-8 people in the back room.  Keep in mind the drinks are costly! $16 a pop, and cash only.", 
    "review_date": "2014-05-20"
  }, 
  "IBrL-6twlZmQBGLdV2DQiw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie C.", 
    "review_text": "Cool really big space with a small more cozy side bar by the entrance.  Love the theme of odd job random machinery.  Other than that, it's a bar with lots of room for milling and scoping.", 
    "review_date": "2014-06-30"
  }, 
  "RXHuqqw59JFsk1MKqiwrWQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Mekhala E.", 
    "review_text": "This review is for the bar inside the bar - Standing Room Only (SRO). I almost did not want to write this review because i don't want a lot of people to know about this place and crowd it up ;) but that would not be fair now would it, so here!  We went in on a Thursday night around 7pm to get a drink before dinner. It wasn't very crowded so we were able to sit at the bar and talk to Joey, the bartender. But I can see how things can get busy as the night goes by and there truly is only standing room for you. The SRO is tiny, very very tiny.  The Drinks - You tell Joey what you like/don't like and he will whip up a concoction for you. You will see herbs and some fruits on the counter that you can ask him to incorporate in the drink. I was feeling like dark rum and thats all i told him. He made a dark rum, almond something, ginger something, something else something else ( he told me there were a bunch of other things in there that i don't remember) drink for me which was perfect! It would have been a tad sweet for me on another day but i did not mind it that day. My colleagues were happy with their drinks as well. A drink will cost you $16, which some might think is a little expensive but you are paying for the experience and a drink that is custom made for you. I thinks it is worth it. Joey - We were lucky to be sitting at the bar and since it wasn't that crowded yet he was able to give us more attention. He is great at navigating you through the process if you are not sure what you want. If you don't like your drink, he will make another one for you, he did make another one for my friend when she did not like her original drink.  We were very pleased with our experience here, I cannot wait to go back and try more. Note - its a cash only bar but they do have one of those money vending machines ;) or commonly known as an ATM inside that charges you a $3 fee.", 
    "review_date": "2014-05-30"
  }, 
  "jQkE2tEpYA7tM6WHjyOF8g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victoria C.", 
    "review_text": "Bars always make me happy except for this one. The night started out great with Joey Picchi as the bartender (the bar to the left, called PlusPlus, SRO, Standing Room Only. Pick a name you guys! But it's a bar within a bar). I've never met a bartender as vain as Joey which is fine since his drinks are good, but lets lower the ego please. He kept asking me how his drinks were every few seconds, needing his ego to be fed. Kept on bragging how he never tries his drinks because he knows it's perfect (yeah right...saw him testing a few drinks..what a hypocrite). Anyway, I wouldn't have been so upset with all his annoying narcissistic self if he wasn't such a SNEAKY LITTLE RAT!   We were getting ready to go but we decided to have one more drink to share. Joey tried to convince us to drink more but we told him we had an early day tomorrow. Right before we were about to finish our drink Joey gives us another one and told us to try it. Once again we told him it was good since his ego was starving for attention. Once we finished we asked for the bill and the bill came out to be $64 for four drinks. I was in shock because I didn't expect to pay for four drinks when I ONLY ordered three. Also didn't expect his drinks to be $16 each since he just used Bulleit, which is an average whiskey and nothing special. On yelp everyone was saying the drinks were $12 (was there an inflation within a week time frame?!?!) Drinks were good but not $16 good. Drinks weren't as customized as he said. Joey made the exact duplicate for the person who came right after I finished my first drink and the same drink AGAIN for the next group that came in. He says it's a menu-less bar because he customizes everyone's drinks but everyone ends up with the SAME drink.   The price wasn't the kicker for me even though I thought it was ridiculously over priced. The thing that I was pissed off about was that Joey Picchi snuck a drink on us. We never ordered the extra drink and if your going to give us a drink we didn't ask for I am going to expect it's complimentary.  I didn't like his tactics and schemes. The main reason I came here was because I'm a fan of Big. I heard Big and Jones Bar teamed up to form Oddjob. Later I learned that Big isn't associated with this place. I wonder why...could be because of  dishonest people like Joey Picchi. I wouldn't want to work with shady people either.  Minus Joey Picchi  would have made this a great place.   FYI: this place is CASH ONLY and drinks are $16 each.", 
    "review_date": "2014-01-16"
  }, 
  "ImuiXgdeNUq-mjIZ_bIOag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Oddjob did a social event for a technical conference for me, and it was great. They catered some nice appetizer trays, poured some awesome cocktails, and generally looked after us perfectly. These are Nice People and they do a Quality Job. They had good music on, but not so loud as to stop conversation, and set the place up to be welcoming and intimate for us. Perfect.", 
    "review_date": "2014-08-08"
  }, 
  "ptEgB9I7kKtVaYN1PaFfiA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sheena J.", 
    "review_text": "Ok I really wanted to give this place a good rating but the manager/mixologist Joey is such a douche that I couldn't. So...there are 2 sides the bar - one is a typical bar the other, where Joey works, is no menu special made-to-order based on your mood &amp; preferences drinks (which I'm ok with if Joey wasn't so pompous and rude). He was so rude that after my first visit he came to the other side of the bar and found my group and brought us a free round of apology drinks (which were delish) but then on my return trip he has the same attitude... Outside of Joey the others are great bartenders and the bar has a very nice vibe.", 
    "review_date": "2014-12-31"
  }, 
  "azvfQkZ-6CkMjGYnsKdmTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura D.", 
    "review_text": "We live 1 block away from this place but didn't even know it existed until a friend referred us.  Finally got to try it out. The bar on the right does have a cocktail menu. Drinks were really good (and they even have a drink contraption that makes a different drink every night - pretty cool!). It's also not very busy even on a Saturday night (probably because of the location) which is nice.  The bar to the left.... Now this is 5 star worthy. Joey, the bartender, makes the most delicious and intricate custom drinks. Whatever he makes looks, sounds, and tastes so delicious. The bar area is small and intimate so really leads to mingling with other guests and enjoying Joey's entertaining personality.   Looking forward to becoming a regular :)", 
    "review_date": "2015-01-18"
  }, 
  "4xCliYvd6ymeUqgy_8MYsA": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Melissa Z.", 
    "review_text": "Joey. The bartender who made me the most incredible looking, incredible smelling, and incredible tasting cocktail I have ever had. He joked about using perfume to cover the true \"wet dog\" smell of his drinks but trust me he is lying. Just sit cozy, tell him what spin on a pina colada/strawberries/love triangle situation you want, and be ready for the magic he will deliver. Cash only.", 
    "review_date": "2014-07-20"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "This place is pretty alright. It's got a theme going on (Bond-ish, with a couple of red herrings). The decor is pretty cool, and it's spacious in the main bar area. I can imagine that the smaller bar area would be great for a private party, and I intend to try it out.  Three stars because drinks are pretty pricy (cocktails around 12-14) and I'm not a regular enough to appreciate it all. Also, the bartender made three cardinal sins on my Vesper (ratios, ingredients, manner of chilling), which I'd expect any Bond bartender aficionado to know well.", 
    "review_date": "2014-05-09"
  }, 
  "UE-rXhA8njNnADFkDA3EuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Inigo M.", 
    "review_text": "Joey the mixologist.", 
    "review_date": "2014-05-04"
  }, 
  "erEO0r8ByJbtxMdXnpwZGw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Turi F.", 
    "review_text": "I'm obsessed with Oddjob. How did I not know it existed? It's a quiet, secret little enclave with amazing decor, great service, and fantastic cocktails. The only annoying thing is that it's cash only, which makes purchasing the pricey drinks more painful.", 
    "review_date": "2014-09-18"
  }, 
  "0xEKvNlbiPjEpNXeX02LJA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg T.", 
    "review_text": "super yummy mixed drinks, great service, fun vibe.", 
    "review_date": "2014-09-17"
  }, 
  "OfAd0EGxK257AkP92MMT9A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis R.", 
    "review_text": "We walked in through the Mission Street entrance (that we were informed later was *not* the entrance despite the door being open--apparently they'd rather you enter on the piss-laden alley. This is SoMa, c'mon!) I had been curious about the spot because there is no signage, and yet could tell there were people inside upon multiple passings. So, when I noticed the door open as we were strolling by, I decided to duck in for a spot.   Normally, I would have taken at least the time to have a drinkipoo and survey the joint. Yeah. Let's just say that within seconds I felt completely alienated by the bartender. Beyond arrogant, he made us feel completely unwelcomed. So, out the 'wrong' door we went.", 
    "review_date": "2014-03-28"
  }, 
  "usYZ2EiQoIjqpLh2PJ08nQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandra M.", 
    "review_text": "This place is cool, not a place to go to if you're in a rush to be anywhere. The drinks are good, both bars are perfectly capable of creating something palatable. Although you will get a $16 drink and somewhat of a show from one bartender or a $12 drink and peace and quiet from the others. Just depends on what you're looking for.", 
    "review_date": "2014-06-15"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "This review is actually for the bar inside the bar, SRO. I only walked through Oddjob to get there, and it wasn't really my kind of scene. At least, on the night i was there.  Standing Room Only, the real jewel here,is destination worthy.  Joey is a master at his craft, and has an amazing talent and skill in putting together flavors most people would never think of.  I've had many ,many drinks from him, (we're regulars at the last bar he worked at.) His drinks are always totally  balanced, and his memory for faces and names is remarkable.  We miss him being in our 'hood, but he's so incredible, he needed to spread his wings.  He is a total sweetheart, even when he's slammed, he's still charming. His drinks never disappoint. He makes the best classic drinks, but at SRO leave yourself in his hands. You will be blown away by what he comes up with.  While we can't see him every week anymore, we definitely look forward to coming back.   ***The bar remains cash only, come prepared.**", 
    "review_date": "2014-03-27"
  }, 
  "XA6O4iTofM-6Y7Fyq135RQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Morris C.", 
    "review_text": "My friends and I were looking to change things up and go somewhere other than our usual watering holes, and this place came into the conversation. I'm glad we ended up dropping by.  We walked in sometime after 10pm, and had no problem finding an open booth in the larger seating area. Shortly after, a waitress came by with a beer, wine, and cocktail menu for each of us. We all ordered cocktails, which were brought relatively quickly. The waitress noticed that one of my friends didn't particularly enjoy theirs, and graciously offered to take it off the check and bring another drink instead!  Fantastic attentive staff here, and it's a breath of fresh air to be able to grab seats and not be shoulder to shoulder trying to order drinks. The only downsides I have to say about this place are that the cocktail are a little pricey ($12-16), and it is currently cash-only, though there is an ATM, and I believe the waitress mentioned they are working on getting their credit card system going. Maybe they're a new, undiscovered hidden gem, but as long as things are the way they are now, I would happily return here time and time again.", 
    "review_date": "2014-10-13"
  }, 
  "petE-PAP_UrWUKBvagl-1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eden F.", 
    "review_text": "A nice addition to the Soma/Middle market scene. Please visit the back bar for some epically created cocktails. No joke you will be blown away at the crafting ability of the resident bartender. It's almost like a personality profile in a drink.  Arrive and tell Joey your spirt of choice and your mood and he will craft the most accurate drink of this moment of your life you will ever experience. Much love to the back bar.", 
    "review_date": "2014-02-13"
  }, 
  "nta-hrZgYeDO1OmsBrUmrA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kris A.", 
    "review_text": "There is nothing here to justify the cost of their cocktails. $30 for 2 drinks at an out of the way location...not worth a 2nd trip", 
    "review_date": "2014-04-25"
  }, 
  "IxKVvGmFIEz77YYL-5_YxA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N S.", 
    "review_text": "While Oddjob has interesting decor and plenty of seating, I didn't find the place to be very exciting. The staff was...nice, but the drinks menu left much to be desired.   The drinks were definitely expensive for the area; the menu offered drinks $12+. However, their Happy Hour cocktail was $5.   They had this pretty neat contraption, like one of those vortex coin donation bins you see at museums. Except this one mixes three types of alcohols and pours through this funnel filled with small blocks of ice.   Lastly, this place DOES NOT take credit cards. I checked this very yelp page for that info and arrived without cash. There is an ATM machine with a $3 fee.", 
    "review_date": "2014-05-01"
  }, 
  "KteyfE9UD323MtZyei9fRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dustin F.", 
    "review_text": "Great people.  Great space.  Great drinks.  Great time.", 
    "review_date": "2014-03-03"
  }, 
  "vuzP1ts4XcxeoEE0vjJHLQ": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Alice H.", 
    "review_text": "One word: Joey.  Just go to Joey. Wait. Be amazed. Drink. Savor. Appreciate. Be happy.", 
    "review_date": "2014-07-04"
  }, 
  "F7Ka5l3DwtwHkPKl_X4eoA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Sonia P.", 
    "review_text": "Great fund!!! I especially liked the bartender working at room to the right... Didn't catch his name, but awesome guy!!! Love the ambiance. Only complaint is that it's cash only and a bit pricey.", 
    "review_date": "2014-09-28"
  }, 
  "H0KW4yccI3xqxUK8E1FLnw": {
    "user_rating": 1.0, 
    "user_location": "Vail, CO", 
    "user_name": "Jim S.", 
    "review_text": "We arrived last night at 12:30, took a cab special trip with four guests. We ordered four drinks from the female.bartender who was working the specialty custom drink bar. It was not busy only 6 people at the specialty bar besides us and open tables and two bartenders at the other regular bar and about 12 people there. We waited 35 minutes and she still hasn't prepared our drinks so we thought she forgot, reminded her and she said we were next as she said she had only two drinks to make. At 1:30am, 60 minutes after placing our drink order, the bartender said,\"it's last call and i won't have time to make your drinks\". We were at the bar observing her and she was super lazy and inefficient. We then presented this to the manager a male with bleached blonde hair who was intoxicated/high and he did not help us. The manager sad it's his birthday and was more interested in partying. He said the bartender was sick so perhaps we are lucky she didn't prepare our drinks as we all may have been sick too as we watched her prepare drinks and touch fruit and fresh ingredients with her hands. We used to go to this bar when it was at a different location called Big. The bartender and manager this night were apathetic and have a poor impression. I hope the owner reads this as its a great concept just poorly managed!!", 
    "review_date": "2014-10-26"
  }, 
  "q4lDOyEx5sYK2l8Kf_QT_w": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Taylor H.", 
    "review_text": "great bar!", 
    "review_date": "2014-05-11"
  }, 
  "9G71FMxVIDTpALU58x-FJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve D.", 
    "review_text": "Joey is an amazing mixologist.  Definitely go to the small room in the corner where he'll mix you a custom drink.  Came here with a friend on a Saturday night and was not disappointed.  It wasn't too crowded, and we were served within a couple minutes.  Both of the drinks we ordered we fantastic.  I asked for a fruity gin-based drink and I'm not sure what's in it, but it smells of sex panther (illegal in 9 countries) and tastes of deliciousness.", 
    "review_date": "2014-03-29"
  }, 
  "Kb4prI_ulN4UCi8sZfVDoA": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Alireza R.", 
    "review_text": "Pricy but very nice cocktails. Nice environment with not too much noise. We had bearcat, briar cliff sling and living day lights and we loved them. For sure, we are coming back but next time we bring cash.", 
    "review_date": "2014-08-08"
  }, 
  "_Lcz1K49tILtdfFXEqSq5w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan M.", 
    "review_text": "This is this the first Yelp post I have ever written and I will shamelessly plug that it is because of Joey, tender of the bar at SRO (Standing Room Only).   A friend and I started our night at the SF Ballet, where the kid sitting behind her kicked her chair through the entire first act. Needless to say, we were ready for a drink following the performance and I happened to recall Oddjob from searching for craft cocktail bars shortly after moving to San Francisco. Good food, drink and hospitality are like an art to me. I feel I can be both a fair and harsh critic.  Anyway, I was feeling like treating my friend to some craft cocktails so we ended up at Oddjob.   Firstly, It's important to note that you can only enter Oddjob from the door off of Washburn. The door off of Mission is always locked; exit only. I don't believe there is a sign noting that it is Oddjob, It's simply the first building on that corner at Washburn and Mission.  Secondly, it's CASH ONLY! Conveniently, there is an ATM inside on the way to the restrooms but if the three dollar service fee really grinds your gears then, sadly, this isn't the place for you. It's not cheap but you get what you give. Well worth any cost, in my opinion.  I immediately was taken in by the interior which is subtle, yet gorgeous. The cloth draped across the ceiling over the leftmost bar, the vintage lighting, and the paneled walls all make this place seem like a secretive speakeasy. I'm sure the unrevealing exterior helps, too.   I found the staff extremely friendly and approachable. If you want a personalized experience, don't come at a busy time. The staff has more time to make your experience shine this way and this really applies to any establishment.  This place actually has two bars: SRO and Oddjob.    Joey, who was bartending SRO, offered some craft cocktails my friend and I couldn't refuse. He challenged our palates with flavors we wouldn't normally choose and we had a riot forming sudden inside jokes with anyone in earshot. I would say \"chef de libations\" would be a more suiting title for Joey than \"bartender\". Maybe that sounds pretentious but I don't really care. :)  We'll certainly be coming back as we've had unforgettable drinks and even made some friends along the way.", 
    "review_date": "2014-01-30"
  }, 
  "Dn8NUrkkH_-3x_3MP1BeqQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Yen P.", 
    "review_text": "This is a review for the main bar.  Haven't tried the much vaunted SRO side.  Pluses -- this is always somewhat subjective:  cool decor (the slightly unfinished look accurately emulates the outer fringes of some Bond villain's HQ).  Relaxed vibe.    Minor UX faux pas in the restroom area:  the airplane themed stalls are cool, but the handwashing area with faucets tucked away was a bit too cool for me at first.  I was waving my newly soaped hands stupidly and just about to discover the foot pedals for turning on the water when somebody pointed it out for me, much to my chagrin.  Nerd points:  1337 is a pretty sweet street number.  Drinks good.  Ice cubes large.  That about sums it up.", 
    "review_date": "2014-08-20"
  }, 
  "jhZIiCWImrmjY6V47Uc-gA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Annie A.", 
    "review_text": "This place is amazing! It's a recreation of big in the back where an amazing bar tender will make you a specialized drink just to your taste and a second bar with a steam punk Rube Goldberg drink making machine called the corpse recover machine. So far this place has not blow up and it is still easy to get a drink on a Saturday night but there drinks are too good to stay that way for long. Try this place before it's too crowded to get into.", 
    "review_date": "2014-09-27"
  }, 
  "z8f97MvT-K4Wf4xSi0G2HQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben G.", 
    "review_text": "Private event at SRO, the bar -in-the- bar at Oddjob. The decor is gorgeous, drapery and an old-school chandelier; decent air-conditioning and plenty of room to perch around the bar.  They make decent cocktails. The drinks are somewhat -gimmicky foams with lots of arbitrary ingredients and pairings. (\"Have you *ever* had mint tea in Morocco? What about 'lapsang souchong' in Hong Kong? Well *I have* and it tastes like this...\" etc.) Under the veneer, the drinks were crowd-pleasing with a lot of forward sweetness and misbalance on those bitters he bought at Cask.  The drinks are four stars, but the service is generally poor. Joey is absolutely desperate to be at the center of attention, every moment you spend at SRO. He even interrupted our host's toast. Keep it classy, SRO.  Joey also intentionally \"challenges\" drinkers by pouring them precisely what they did not order. I would be more accommodating if we were in Topeka or The Marina, or even The Mission now-a-days... However this was a group of cocktail-knowers, which makes the pretense not just rude but a little pathetic. When my friend in the hospitality industry says \"no brown liquor,\" it is not because she lacks understanding. She has a plethora of reasons to prefer a clean, timely gin or white Irish whisky.  It's all a bit much, and there are a zillion places in town that do better cocktails without the pretense. (Third Rail, Trick Dog, Bourbon &amp; Branch, Range.) Sure, you might not get the quirky glassware -- but on the other hand, elsewhere you might end up with a balance of flavors, one that understands the customer and the underlying base liquor.", 
    "review_date": "2014-10-02"
  }, 
  "aI68EqCbSw4C-3Nda2PZNg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul H.", 
    "review_text": "Went to Oddjob last week and it is such a great bar!  Yes it is hidden away so you have to look for the secret entrance but its not too hard to find as long as you have the address. Having said that it did take me a minute but I was tired after a crazy day at work!  Once you enter the interior design is really quite stunning and it is a total transformation of what was there before. Filled with cool art and interesting furnishings. There is also a very unique set of toilets with a hallway next to it that also doubles as a photobooth. Hmm that sounds like it could be creepy but it is actually brilliant.  But what gets Oddjob 5 stars from me is the fact that everyone behind the bar has a really great attitude. Although it was my first time there it quickly felt like I was a regular! To top it off the barmaid (Cali was her name, not sure of spelling) gave my friend a free shot upon hearing that we were all there celebrating that he had finally beaten cancer.  We will definitely come back! Good as a hot date spot and good for large parties to warm up before heading to a club.", 
    "review_date": "2014-07-28"
  }, 
  "1ljLfQwW9E0M3zv6kW0Pmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett B.", 
    "review_text": "Not sure why this has a lower star rating, but OddJob is awesome.  I'm not a fan of SoMa bars, but this spot (albeit hella hipster) is friggen amazing.    2 bars.  The one to the right you can get whatever type of call drinks  or beer you'd like.  Bar to the left is where mixology goes down.  Tell them a spirit, maybe tell them the mood your in or maybe what you're looking for, and they'll create you an original drink.  They have original mixers too (random bitters, beet-root gin, etc) which make any experienced mixologist a little giddy to see what they can do.  I was fortunate to have Joey create my drinks.  \"Off-the-hook\" is an understatement.  If you're around this area, do yourself a favor and go to the bar on the left.", 
    "review_date": "2014-03-26"
  }, 
  "SxyL6RjT4F8qPUkucjq-wQ": {
    "user_rating": 5.0, 
    "user_location": "Petersburg, VA", 
    "user_name": "Wilburt C.", 
    "review_text": "You come here for the drinks, Joey, and the crowd. This place has by far the best cocktails I've ever had in life. Just mention anything you're in the mood for (alcohol types, seasons, moods, colors, emotions, etc) and Joey the bartender, mixologist, magician, or whatever you want to call him makes something that far exceeds any expectations. Every Time. In the past I've asked for anything from herbal &amp; smokey to warm &amp; Christmas. All have been amazing. That alone would make anyone enjoy their time and come back again to show friends.   However, what you think might be a quick trip becomes sitting for hours and being alarmed by \"last call.\" While making excellent drinks, Joey treats everyone as a personal friend and puts a bit of love into every drink and conversation. This becomes evident when you hear the remarks of the crowd and how people express their undying love for the place. Any other time this would be considered weird, but after taking in vibe and having a sip of your drink it all makes sense.   While the place is cash only with an entrance in a sketchy alley, I'd easily go every day of the week and spend any random ATM fee for a one of a kind speciality cocktail to enjoy with great people. It really is a place to unwind and just enjoy the moment.", 
    "review_date": "2014-12-17"
  }, 
  "Skd2_Jiw4XAjbBBws3ia7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter M.", 
    "review_text": "I've been to a lot of cocktail bars, but this has to be one of the top in SF. There's a lot of times I walk into a bar and I just don't want to order the usual, I've obviously gotten tired of it, but no worries, not at OddJob. Tell Joey your base alcohol, and the way you'd like it (spicy, sweet, etc...) and he'll create a concoction beyond your wildest imaginations. If you're like me, and you aren't the most educated cocktail drinker, Joey will make you look good in front of your date.  If you're tired of the same old same old, give Oddjob a chance. They don't even have a standard shape for their glasses! Ambience is great, Joey is great, drinks are great. What more do you need?", 
    "review_date": "2014-07-03"
  }, 
  "FCE6lwJBCsfR0y-z4MxAGw": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Andres J.", 
    "review_text": "Went to this bar and I have to say it is kinda hidden can't miss the big wooden door lol but the place is really unique and very Kool place I had couple drinks and was really good and bartender really friendly , if near area again I will def come by . If it's your first time your going to like it  I give it 5 stars and a quick heads up they only take cash only , there is a Atm available", 
    "review_date": "2015-01-21"
  }, 
  "4RlzFohEgBdFXUGoqvpZqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa N.", 
    "review_text": "I'm going to be a fan of any place that pops up in SOMA bc when I lived in this neighborhood from 2008-2009 there was nothing. The entrance is on the side off of an alley and when we walked in it was like 20 dudes. My first thought was is this a gay bar? Or a place for techy's to come after work? No joke my gf and I were the only ladies in there. We ordered the James Bond themed drinks and had the front room more or less to ourselves at 10:00pm on a Friday evening.Which is nice if you want to sit and chat and hold a conversation with out yelling.  But I think they're cash only- ugh.", 
    "review_date": "2014-03-31"
  }, 
  "zA4DmVQg3mpqmAHdn3IWuA": {
    "user_rating": 5.0, 
    "user_location": "Loleta, CA", 
    "user_name": "Dani W.", 
    "review_text": "Nothing I say here will adequately describe how badly you need to visit Joey at SRO in Oddjob.   If you tell him what you like, he'll make you a great drink, yes. But the real treat, I think, comes from letting him go wild. He'll muddle a yellow bell pepper, or sugar snap peas, or whatever fruit or vegetable called to him in the market that day. He'll add a dash of essential oil or a spritz of smokey single malt scotch that compliments the drink in a way you never thought possible. He'll make you a twist on a trinidad sour with hibiscus-infused vodka (that he made himself, by the way) and god knows what else that's so good you'll want to bathe in it. (Or maybe that's just me...)    What's more, Joey's a showman. His drinks take a few minutes to craft but the whole time he's chatting with customers, joking around, and he remembers everybody's name and what they like and don't like. He's fun to watch and a true artist with liquor.   And, to top it all off, his drinks are not only delicious but STRONG.   Bottom line: Joey is a national treasure and if you don't agree, I'm sorry friend, but you are wrong.", 
    "review_date": "2014-02-02"
  }, 
  "Nwakc9y3zFhs6Mljy3-iTw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "A N.", 
    "review_text": "Joey totally is a national treasure, if I could I would give him the Presidential Medal of Freedom, the Nobel Peace Prize, and make him the Chief Justice of the Supreme Court.  That dude is A+.", 
    "review_date": "2014-02-20"
  }, 
  "gH5anTZIj1B_6oG-B7etgw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen C.", 
    "review_text": "I was here last night with a friend because she wanted to check it out. We ordered 2 drinks, pussy galore and honey rider. When we got our drinks we were so disappointed. On the drink menu, it clearly stated that pussy galore contained Belvedere. But when our bartender was making it, we saw her using Ketel One instead. I don't know if this is a mix-up with what the bartenders were told to use and what was actually printed on the menu, but if it's not, the bartender should have asked if we were okay with Ketel One instead of Belvedere. Furthermore, one of our drinks tasted like sugar water with a hint of alcohol and the other one tasted like club soda with a tiny smidge of alcohol when you got to the end. I ended up wasting $24 for two drinks that were barely drinkable so I definitely won't be coming back.", 
    "review_date": "2013-11-17"
  }, 
  "fv6nbCokQ6o9HOrAygx63Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brandon D.", 
    "review_text": "This place is quintessential San Francisco. The entrance is around the corner from mission street and the second you walk in the dark lighting, the artwork, and the bar create a great environment.  This is a good place to chill out with some friends, I wouldn't say its a place to get wild and i wouldnt want to come here to dance.   UPDATE: Happy to hear they are open for happy hour, great option for after work.", 
    "review_date": "2013-11-29"
  }, 
  "2UX1zLil-rTq3k4Al8RzhQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "DJ P.", 
    "review_text": "Well, they got the name right least.  This place does an odd job of making you feel welcome.  I was completely shocked that the owners of such powerhouses like Mighty and Public Works would have such a terrible staff (especially management and security) working this bar.   The bartender in the smaller room was the only one that seemed to care about good service but he takes forever to make a round, and the bar gets backlogged quick.   Aside from that, they made a fundamental error trying to book a private event for Air BnB at peak hours on a Saturday night. We came with a group of over 20 people and picking Odd Job as a starting point for our night out was a big mistake.  They seem to have no idea how to run a bar and simultaneously have a private event. We kept getting herded around like cattle, interrupting our conversations, making us pick up all our jackets, drinks etc. to only move 4 feet, and be asked to move again in 5 minutes.  It was ridiculous.  The manager offered us the back booths in the room since we had such a large group, but he failed to communicate this to security and staff properly to avoid us constantly being ushered around while being verbally harassed. No matter where we stood, we were asked to move again. (Apparently we were still too close to the large room that was completely empty at this point and that was unacceptable). The door guy was a total as*hole to us, and after being continuously harassed by him and the hostess, we looked to the manager for help in stepping in to follow through with his promises. Instead he stood aside quietly letting this all go down.   We were not rowdy, or rude, and simply wanted to give them our MONEY. Instead, we rounded up everyone and left, feeling insulted and collectively agreed it's not worth the 20 minute wait each round for an \"artisan\" cocktail and crappy service to ever come back.    The cocky door guy dared me to leave a bad Yelp review, as he explained that the place was going to be a huge success--so here it is, jack-ass.", 
    "review_date": "2014-03-01"
  }, 
  "QHlhrBhkCvm7z-BxpB593Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arnaud B.", 
    "review_text": "Great place!", 
    "review_date": "2014-01-08"
  }, 
  "q9ZGJXkxkdiqNChZFfXLqQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan B.", 
    "review_text": "My high hopes were dashed when after barely 10 minutes of walking in, what promised to be a new chill fun space to hang with my peeps in soma went south fast. Staff had a stick up their ass and the manager and bouncer were legit frontin' some Vegas bullshit with no joke attitude and fuck off vibe. I'm not someone to boycott shit but this was not even funny - just lame and annoying.", 
    "review_date": "2014-03-01"
  }, 
  "NQ0REATs1_MehrNtnCaV2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela B.", 
    "review_text": "I was a big fan of Big before it closed, so hearing that they were involved with Oddjob was exciting news. Last Friday I finally got a chance to swing by, and the place has promise.  The space is actually divided into *two* bar areas: to the right, a pretty large one with several bartenders, a cocktail menu, and lots of little tables &amp; seating in the form of cushioned benches and also smaller chairs that can easily be moved around; and to the left, a much smaller bar with only one bartender &amp; a bunch of bar stools. This smaller area is supposed to be like Big was--ie, no menu; you just tell the bartender what kind of thing you want, and s/he creates it for you on the fly. (BTW, be prepared to wait at the smaller off-menu bar if it's even a little crowded; it's one guy/girl making individualized, custom drinks for like 20 people, so it's not really fair to complain about how long the drinks take. If you're in a rush, order off the menu at the larger bar.)  The Pros: * Easily walkable from BART * Spacious * Plenty of seating * Lots of bar space at the big bar * Interesting, well-made drinks * Options (nice, safe menu drinks or choose your own adventure) * Friendly bartenders who really, really want to make you something you'll enjoy  The Cons: * LOUD. Even sitting right next to my friends, we had to shout to hear each other. Maybe get some sound baffling going? It didn't seem like there was any, so that might help. * Cash only. Not a huge deal as there is an ATM, but just FYI. * All the drinks I tasted (four custom, two from the menu) were *ever* so slightly too sweet. This is a solvable problem at the off-menu bar; next time I'll just have to remember to emphasize that I like a dry, spirit-forward cocktail &amp; by &amp; large disdain the sweet ones.  Overall I was pleased &amp; enjoyed things, so I'll definitely be back.", 
    "review_date": "2014-01-20"
  }, 
  "DICLJDdq0HpvOVYR5mB4gA": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Eric F.", 
    "review_text": "Most impressive!  I was in the mood for some quality cocktails after dinner in the city and Oddjob killed it.  My bro and I ordered a couple rounds between us and every concoction blew me away.  From the balance in the Nolet's based Sassafras to our bartender's original Henchman that exploded on the palate with cola, mint, black licorice, orgeat, cedar, etc., it was a fine imbibing experience.  Our bartender, Anthony, was a pleasure to chat with as well and even hooked it up with some hummus to go with our drinks.  How beyond legit is that?  While the prices are certainly on the steeper side, the creativity and skill are there in spades and I'm already looking forward to my next visit.", 
    "review_date": "2014-03-29"
  }, 
  "-hSLnGKUJtshbOw7CUXJ-Q": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Brandy A.", 
    "review_text": "Small space but with great drinks and a very enthusiastic bartender (the night we went at least). He was the type to ask about flavor profiles and mix something up based on your response. That might be a hit-or-miss technique for some, but it really worked out for me. He whipped up a variation of an Old Fashioned that was really yummy. Unfortunately I forget the whiskey he used. My friend wanted protein and smokiness; the result was a smoky egg-white concoction that was absolutely delicious. My sister had a super light, refreshing, and citrus-y cocktail. She's hard to please when it comes to spirits, so that really says something. The fact that all our drinks were so customized and everyone was happy with them makes Oddjob worth checking out.  The ambiance was really chill and half the space was taken up by a private party; however since we were rather early (~10 pm) the bar area was not overly crowded and there were side tables for us to occupy. I noticed it getting more crowded as we were about to leave, so they definitely can generate an audience.  Overall my impression of Oddjob is positive. It's a great place to grab drinks with a group of friends in a non-pretentious environment. Plus the fact that it's in an area (SOMA) where the nightlife is not super concentrated makes it an underrated discovery.", 
    "review_date": "2014-12-20"
  }, 
  "ek75nusUO9kixAzoqmZ9Xw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teiki K.", 
    "review_text": "I love Oddjob, a new-ish hidden gem in SoMa.  The decor is unique and beautiful and the space is laid out really well.  Every time I've gone, the music's been perfect and most importantly, not loud enough that you have to shout your conversations.  Joey &amp; Taylor are awesome at what they do and I usually let them decide on my drink, having never left disappointed (nor sober).", 
    "review_date": "2014-05-10"
  }, 
  "MGPQVLsODMm9ZtYQW-g_OA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jelena Z.", 
    "review_text": "The name: curiously odd.  The bar (in terms of ambiance): not-so-odd.  The bar stools: reasonably odd. They have backs, which means you can comfortably sink in and drink for awhile. Indeed, I am a fan.  The cocktail program: deliciously odd. They're only featuring 4 or 5 cocktails at press time, but they can craft anything your palate desires.  My adventures: delightfully odd. Within two minutes of walking in, I was persuaded to take a shot of lower-grade whisky. I don't drink whisky straight, but this handsome patron was particularly convincing. Good crowd, well-mixed cocktails and a low-key atmosphere will beckon us back!", 
    "review_date": "2013-11-11"
  }, 
  "pudxkSYxLCQw7dhupri24g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shanee B.", 
    "review_text": "SRO review: I am a strong modern woman who is in charge all day, so when it comes to drinkin' time, I like it when someone else takes charge and tells me what I should drink.  Joey does just that. You say what you like. What you don't. What mood you're in. And then *poof* a magical concoction appears in front of you in beautiful glassware. He explains what unique drink he's created for you and it's like...drinks and a show. Plus he's hilarious. Like visiting a friend's house. A friend who can make a REALLY REALLY great drink.  This is a place where you taste the love and passion that was put into making the drink. You savor. You appreciate. And you think about what you want to try next.  Note, it's about $16 bucks a drink. So if you're just looking to get trashed, you can go to a place that's less good and less pricey. Also, that means you won't be taking up one of the precious seats. So more room for me!", 
    "review_date": "2014-06-10"
  }, 
  "e0zzk2kQHN2ghZHEGM-ytg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sherry W.", 
    "review_text": "Yes, Joey, I'm talking at you. Look at the abundance of shining red stars this review has! Not only have you changed my perception of the drink with my name, you've also realigned my streak of getting on yelp to write less than subpar reviews.  The concoctions you made last night had too many sophisticated ingredients for me to recall (mins the Mongolian horse wine which was elusive and surprisingly tasteful) but every step of your art was sprinkled with craftsmanship, precision, and love.   Only disclaimer- I forgot to look at the bottom of my chair for the number 3. I'll be back.", 
    "review_date": "2014-10-29"
  }, 
  "-njXz5nC63_7Eh0uxGA6cA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hyes W.", 
    "review_text": "Joey, the bartender at the private section was so awesome. I asked him to make my rum-based cocktail, not so sweet but refreshing. He made it darn good cocktail and he was so entertaining to be around.  I had a good time for sure on top of that fantastic cocktails.", 
    "review_date": "2015-01-11"
  }, 
  "lLptGOYUfQ-Ir47UYJv0dw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly G.", 
    "review_text": "The odd job is a gem in this part of Mission Street. Nestled in a unmarked building, it is rough to spot because there is no sign and the entrance is the side door. There are two bars, one is much smaller and intimate, great for small parties. The opposite side of the bar is the main space, dim lighting, craftsman style and a bar filled with a plethora of Whiskeys, Gin, and pretty good selection of unique tequilas.  The bartenders are friendly, attentive and willing to craft any cocktail to your pleasing. There is nothing I trust more then two dudes in plaid shirts with their sleeves rolled up. And bushy beards to shake up a tasty cocktail for me.   Downside of this bar is it is CASH ONLY, and for the times it is frustrating because who carries cash for cocktails that average $14?! It's understandable for divey bars with $7 cocktails but not a place with this type of class! They have an ATM available but you will be charged an extra fee to pull out cash.   Drink Highlights: Honey Rider: Bourbon, apreol, honey and lemon. This drink highlights the mix between sweet and sour, and is refreshing at the end. The Bourbon marries all the flavors to make this a tasty drink that satisfied the Bourbon/Whiskey lovers thirsty palate.", 
    "review_date": "2014-04-11"
  }, 
  "fM8qkbgA_7_j-XS6tR6N6g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JASON L.", 
    "review_text": "\"Old Fashion please...\"  Worst old fashion ever. Why is there ginger beer or soda water in my drink? Wtf!?!  It's the easiest drink to make next to a well drink. Keep it simple. $12 for bullsh!t Decor: trying too hard. Too many elements. Lighting is warm and cold...!?!?  Please do better. There's so many other awesome bars in the city.", 
    "review_date": "2013-11-08"
  }, 
  "AGraTma9eEgsiJFDIy6tbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maile N.", 
    "review_text": "You enter in from a side back alley, and there is no sign.  Mysterious!  We weren't sure what to expect but we went in anyway.  We entered and there is a nice bar to the right where they serve wine, beer and standard cocktails, plenty of space, and then to the left is a smaller bar with some seating where they (Joey was our bartender) make your cocktails special to order, where they take the time to ask you one by one what you like in a drink, what flavors you crave with whatever descriptives you can come up with that paints a picture of the perfect cocktail to you with liquor, infusions, spices and herbs.  Very charming and we loved the concept - a classy joint and lots of care is taken into the very last detail when making your drinks.  We can't wait to bring more people here!", 
    "review_date": "2014-05-26"
  }, 
  "dLFTMPQRUab_6kwJNJRx-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex P.", 
    "review_text": "SRO Review - this bar is within Oddjob, and not the same  I have come here twice looking for the famous Joey. You absolutely want Joey to make your drink, because let me tell you, it will be the best cocktail drink in SF.  Wait, am I exaggerating? No-I've lived in this city for several years and I've been to the bars around the city and none of the bartenders even come close (I wouldn't even call Joey a bartender, he's a master mixologist). This is my favorite bar in the city hands down.  The ambience, the personal attention, and how much Joey will make sure you like your drink is unparalleled to anything you've had before this in this city. Go for the drink, stay for the experience.", 
    "review_date": "2014-08-02"
  }
}