{
  "d9IjXlVZlrw1hKCj8wsZbg": {
    "user_rating": 5.0, 
    "user_location": "Denver, CO", 
    "user_name": "Betsy O.", 
    "review_text": "Paradise within the holiday season. Thank God for this bar! Great wine list, love the flatbread and Ben the bartender is fabulous!!! Hyatt did this lobby bar right!!! Don't miss this place!!", 
    "review_date": "2013-12-07"
  }, 
  "OTHpNoPhrywBFzgPDeCKPg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bee F.", 
    "review_text": "It has been awhile since I had been to the Grand Hyatt San Francisco and this was the first time I have seen the remodel. WOW the place looks amazing! Great art and a clean and comfortable modern sapce. It has to be the most beautiful hotel in the city. I met a client for lunch at One Up and we dined in the bar area. The place is a hidden gem! The food was fresh, creative and modern (am I really eating in a hotel?). Great cocktails and wine list. I had a glass of the Gun Bun Pinot which was excellent. Jaime was our server / bartender. He was very attentive with a great personality. The manager Josh stopped by to check in to make sure everything was to our liking. All and all the food, drinks and service were spot on! There are not alot of top tier places to entertain for lunch around Union Square so I will be back with more clients!", 
    "review_date": "2014-09-12"
  }, 
  "dbOrbdJyIsJEsyDYFYKNQQ": {
    "user_rating": 2.0, 
    "user_location": "Orlando, FL", 
    "user_name": "Amber H.", 
    "review_text": "Decent place for a drink before dinner. I don't particularly care for the super low seating options that keep you further from your friends and makes it difficult to hear in such a loud place.", 
    "review_date": "2014-05-11"
  }, 
  "DB3X1lNWOgJUELs0iQ9Qzg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JJ S.", 
    "review_text": "I had made reservations a few weeks in advance for my birthday on new years eve . I received a call the day before to change my reservation. I wasn't given an explanation as to why it was pushed back an hour. This place will not receive any n business from me or my friends.", 
    "review_date": "2013-12-30"
  }, 
  "8EzMNRqUDJlft_af9eQUsA": {
    "user_rating": 4.0, 
    "user_location": "Tiburon, CA", 
    "user_name": "Elie P.", 
    "review_text": "Boa makes great drinks.. friendly service..", 
    "review_date": "2014-02-08"
  }, 
  "jE-PzY7gBc_9pOJ_u0ZwtQ": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Xiao L.", 
    "review_text": "A bit stuffy bar and lounge.  Average tasting cocktails.  Pupus selection was limited.  It is located in one of the hotels in SF and mainly geared towards hotel patrons.   Most likely will jot repeat.", 
    "review_date": "2014-09-08"
  }, 
  "3KtVXemEbIdELcs5eT24pA": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Steve P.", 
    "review_text": "The bartenter Jaime was excellent very helpful courtesy! Food was amazing atmosphere was great! Ramen burger tasted so good with tender over easy egg and bacon together. Ramen was crispy crunchy gonna order another before r vacation is up see u soon one up.", 
    "review_date": "2013-10-18"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "The decor at OneUP is actually quite lovely. For a hotel restaurant it's classy and has a hip San Francisco edge to it.  I ordered their seasonal watermelon salad as well as the halibut.  The watermelon salad was extremely flavorful and fresh. The crisp of the watermelon paired with their light balsamic accent - was the perfect way to start a meal. It was definitely a seasonal dish and was evident in each bite.  My halibut was also delicious. It was buttery and the lemon brought out it's richness. I finished each morsel of it.  My only hesitation with OneUP is that they don't seem to be very consistent. My step-mom's soup was luke-warm and her salmon seemed a little dry. Also the service, though friendly - weren't very present throughout the meal - despite the place being slow. At the end of the meal  - I inquired in regards to their larger group capabilities and the staff also weren't very helpful.   I wouldn't go out of my way to eat at OneUP - but if you're staying at the hotel - or are looking for a decent meal in the area - it's definitely a solid contender. Their bar area is also quite formidable and worth checking out.  Trust.", 
    "review_date": "2013-09-26"
  }, 
  "fjSWLLrQyVKOw0Q6mGZ2KA": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Jens B.", 
    "review_text": "For a hotel lobby bar upstairs kind of thing, this fits the bill.  Danilo our bartender was genuinely nice and informative.  Being on the 10yr Yelp Anniversary party gig, this seemed like a decent place to calm down after a long day of traveling.  A cold beer sounded great and a nice glass of wine for the Suzie, seemed to be in order.  I was a little disappointed that the tap offerings were limited, Sam Adams Summer Ale was my first pick followed by Stella.  Was hoping they would carry more local stuff, especially since there is an Asian brewery a block or so away.  We were a pit peckish and the Gilmore Tater Tots sounded intriguing.  We ordered them and once they arrived you could smell the lovely aroma of garlic, wafting up our nostrils, filling our brains with the expectation of tastiness.  But, that was really not to be. The taste was actually pretty bland and one forgot quickly there was any garlic in these little bites at all.  Shame.  I think you could say, poor finish.  Still hungry, we opted for the meatballs.  Two to be precise, for 12 bucks.  Yikes.  They were very dense and a little void of flavor, however the tomato sauce which accompanied them was a nice rich flavorful pairing.  One item of note, apparently we had arrived between shift change and the meatballs took a little while to get to us.  The bartender mentioned that to us and comped us a round for waiting.  This was quite unexpected.  A very nice gesture.  The menu for the lounge was limited, but there were several offerings of some flat bread which looked intriguing if we find our way back there.  If you are a local Yelper, you get a 20% discount for checking in on the Yelp mobile app.", 
    "review_date": "2014-08-01"
  }, 
  "gYBTg9tJAIVmq6v7T1ML3w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "D C.", 
    "review_text": "We often come here for happy hour as it is close to work.  The decor is nice, the staff is friendly, food is good, and most importantly the drinks are excellent.", 
    "review_date": "2015-01-02"
  }, 
  "zRTEXOqDiYvq42kKtm0AFQ": {
    "user_rating": 1.0, 
    "user_location": "Alamo, CA", 
    "user_name": "Jana A.", 
    "review_text": "We had dinner here and closed out. I checked in and saw they have 20% off discount on Yelp. When I showed this offer to the server he asked the manager but it was denied. I would have given more stars but if you have a promotion going on you should honor it even if you close out. We checked in 1 min after the server took our check :-(", 
    "review_date": "2014-09-08"
  }, 
  "qZmAcUcbp4Q9l7NO4IcGSw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy S.", 
    "review_text": "A nice place to have some wine after a long day at work.  I like the Canvas Pinot Noir a lot, especially with the happy hour price tag!  Happy hour ends at 7pm.", 
    "review_date": "2014-06-07"
  }, 
  "f620AbaIIbUZkyb5gWSbpQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Omar A.", 
    "review_text": "They have one of the most delicious tomato soups I have ever had , simply amazing , food is very fresh and tasty .", 
    "review_date": "2014-12-18"
  }, 
  "NpCKcLnZ9KgSuMRXvURcYA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina W.", 
    "review_text": "I should have edited my rating of OneUp awhile ago for the restaurant's manager's effort to invite me back to their restaurant for a 2nd chance and to replace my last experience at OneUp with a hopefully better experience.  I still need to give them another try, but would like to give a slightly better rating for their customer service effort.  I will update again after giving their food another try.  I wish I can rate this place higher but the food was really bad in my opinion.    I ordered:  Mushroom, caramelized onion, blue cheese flatbread - the flat bread was stale, too much blue cheese that overpowered the caramelized onion and mushroom, made it salty as well.  Overall the proportions were off.  I tried to finish just the caramelized onion and the mushroom on the flat bread and left the flatbread on the plate.  I did not enjoy this entrée at all.  Pork belly - wow!  It was surprisingly disappointing. The pork belly slices were fried and dried, very chewy with excessive sweet and sour kind of BBQ sauce.  Aweful!  I liked the pickled mustard.  This dish reminded me Panda Express.  House Nuts - was considering ordering dessert but was afraid it will disappoint me more therefore ordered house nuts to compliment my martini.  Wow, even their house nuts disappointed me.  I had to forced myself to eat them to balance the alcohol so I wouldn't get drunk but they were horrible!  They were stale and with certain kind of taste that's not tasty nor fresh.  I didn't finish it.  I miss Waterbar's roasted pecans and Big 4's roasted nuts!  the drinks were fine - I had Chardonnay and vodka martini.  they were fine.  The service was wonderful!  Starting from the host stand when I entered, the two hosts said hi and welcomed me.  Then I walked through the hallway to get to the lounge, a few staffs said hi.  I asked the bartenders where the live music will be, they kindly informed.  They were attentive as well.  They immediately asked me if they could help me.  My Asian waitress and an Indian waiter were both very attentive and helpful.  I enjoyed the service at OneUp.  I wish the food can be better.    I like the newly renovated interior and ambiance.  I would go back for drinks but NEVER ever again for food unless they improve.", 
    "review_date": "2013-11-05"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "early evening at the lounge..happy hour starting 5pm and ending 7pm...seriously low sofa seating for group of four...interiors are modern and quite nice...garlic tator tots $8 and non-happy hour deal, but good...mound of garlic topping...wonder why it wasn't tossed and mixed...simple solution to muddle in garlic and dip in sauce...bear republic red rocket ale draft $7, but $5 for happy hour....very crisp and refreshing ale...clean with no aftertaste...repeat three times...had to order the 1/2 off flat bread originally $14, but $7 during happy hour...quite the tasty flat bread pizza...glass of white $11 for regular priced...taking full advantage of all discounts and getting 20% off on food for san francisco locals...but, realizing discount applies to food only...combine happy hour deals with san francisco locals food discount and it's decent...", 
    "review_date": "2014-11-12"
  }, 
  "c39IjlvLg0iReXsZTFJQbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria C.", 
    "review_text": "Also tried the Pork Adobo and the Seafood Bake.  The Seafood Bake included Shrimp, Scallops and veggies.  The scallops melt in your mouth and the shrimp are firm yet very flavorable.  The Pork Adobo was served with a Corn Masa Cake on top.  The pork in the Pork Adobo was flaky and tender, full of flavor and very colorful.  Great presentation as well!!!!", 
    "review_date": "2014-06-21"
  }, 
  "D6dCpfSnSv2waqnCaGlv_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charlie L.", 
    "review_text": "A handsome restaurant. That's the first thing that comes to my mind when dining here. Dark woods, modern lines, and bold furniture pieces make One Up a great place to have a relaxing meal.  Local comfort food with a flair is how I would describe the menu.  Went here for dine about town and a second time when they added the ramen burger on the menu.  The dine about town meal blew me away in value. They offered three courses for 17 bucks. It's typically just two courses for that price. I had the Lamb Burger with their tomato soup and chocolate dessert. I love lamb and try to order it when ever available on a menu. Perfectly cooked, cute vegetable garnishes, and crispy thin fries. The tomato soup was also delicious. It looked fancy and had a nice spice to it.   The Ramen burger is the talk of the town and One up is your opportunity to try it. Like the other reviews below the Ramen doesn't add anything special to the flavor of the dish. The meat itself is seasoned and cooked very well and is the star of the meal. Overall still a good burger. The special sauce and fried egg were a nice too. It's just disappointing that the ramen itself doesn't shine which makes you feel like it's all very novelty.   Great service, Love the decor, love the drinks, and yes... the bathroom is pretty nice too. It's a great spot for a late lunch after shopping in Union Square all day. Give it a try.", 
    "review_date": "2013-11-03"
  }, 
  "orGSgkvh83m1Xne99lB5Pg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nicolette C.", 
    "review_text": "Stopped in before our dinner reservations (which were 3 hours away) for a drink and small bite to eat. The prices were kind of high, but they have an ok selection of wines and the caprese flatbread was pretty tastey but not worth the $15 that it was. Bartenders and servers are super nice and friendly which is the main reason for the 3 stars, other than that this place is just a-ok", 
    "review_date": "2013-06-20"
  }, 
  "k0-JeLPVuBkQfu_MY_Oqww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregg M.", 
    "review_text": "Nice new lounge to hang or meet up w/friends. Got my \"Dirty Harry\" martinis here too!", 
    "review_date": "2012-12-22"
  }, 
  "c4CDRASAWhb4otOPSmZiZw": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Danielle M.", 
    "review_text": "Don't expect much help with the menu...the waitress didn't seem very knowledgable and had an attitude. She did redeam herself by being really sweet the whole time! I took a gamble on the pork belly and won the jackpot!The way they cooked it any fat was gone. See my photo! I also had a risotto that was good too. Great ambiance here!", 
    "review_date": "2014-01-07"
  }, 
  "hWLQPwgl99Q6VfXdRhMuiw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Grace C.", 
    "review_text": "I'm not gonna lie, the boyfriend and I came to check this place out following this ramen burger hype that's been going around ever since we first learned about the new food fad that started in New York. The thing is, based on this one ramen burger alone, I can't say I'd give the food very high ratings. The burger itself is on the sweet side, which already I find slightly strange. Then you supposedly have this bacon and cheese on top, which for some reason, I could barely taste. Also, overcooked sunny-side up egg? Not really cool but at least the texture of the egg wasn't rubbery. The buns made of ramen were easier to eat than i'd anticipated, a slight crunch on the outside but nice and soft and chewy on the inside. I supposed I wasn't sure what to expect so I wasn't really as upset with the burger as most people seemed to be, because in my head I didn't even know if I should compare it to flavors of ramen or flavors of a burger. If it had gone more towards either direction, I don't know that I would have liked it more anyways. I think this is one of those \"it seemed like a good idea at the time...\" things. On the upside, the fries were delicious, light, perfect crispness and saltiness. We chowed those down like we were snacking on chips.   Service here is excellent as well. All the staff seems very friendly and non-judgmental (the restaurant is located inside a pristine hotel after all) The ambiance is great, very relaxed and comfortable and quiet with light music playing in the background. The bar area seems very classy as well. I'd probably come back to hang out at the bar some time, as for the food, I could take it or leave it. It's probably pricier than some places for sure. All in all, service is great, ramen burger, it's not on the menu anymore but don't sweat it, you're not missing out on much.", 
    "review_date": "2013-10-06"
  }, 
  "cgDZVtYICeiK5t1rkesamg": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Hazel C.", 
    "review_text": "Abstaining from cocktails and wine just makes me so sad! My friend and I met up here for after dinner drinks and dessert the eve of the Nike Women's Half Marathon, but I could not order a glass of wine or a cocktail.  I didn't want to drink the night before our big race, especially since I did not train very much for it. I had to settle for Perrier. :(  My friend ordered the Vanilla Creme Brûlée and I ordered the Fruit Crisp.  She said the Crème brûlée was a little boring.  I was not able to try it because I was avoiding dairy products too. The fruit crisp was good.  A piece of browned and melted marshmallow was on top of the crisp. Thankfully, the nectarine slices weren't mushy.   We did go back to eat at the main restaurant, not the lounge/bar, after checking out of the hotel after our race and we had better food there. I needed coffee very badly after a night of fitful sleep and 4 hours of running and walking the NWHM.  Unfortunately, the coffee is your typical bitter coffee. There are so many good roasters in SF (Blue Bottle, Four Barrel, etc) and this being a nice hotel, you'd think they'd be more thoughtful about their coffee.  They need to serve better coffee. I ordered the Fork and Knife Dungeness Crab Melt. It was a really generous portion, but the crab mix needed more oomph! It was a little bland.  It needed more spices and herbs. The fries though were so good. They were long, skinny and crispy.  Yum! My husband had a bowl of the Clam Chowder and my friend had a cup of it, and they both liked the chowder.  My friend ordered the burger and she commented on how juicy it was.    The service was good. When the check came, I showed them the Yelp check in deal from my iPhone, and our server promptly changed our bill. Nice to get 20% off our bill!   I was a happy runner when I left. I was all caffeined up and my stomach finally had real food in it after the half marathon. Two mini Luna bars and a banana were all I had since waking up at 5:30 am for the half marathon and completing it!  It was nice not worrying about the calories for a change! I definitely earned that meal!", 
    "review_date": "2014-10-23"
  }, 
  "ibvH1Y7Rh_tstiWgH0OFTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica S.", 
    "review_text": "Highly impressed with their recent remodel. I went here for their Happy Hour and thoroughly enjoyed the experience - from the ambiance, to the top notch service, to the menu offerings... OneUP made for a great post-work experience.  Ordered beers on tap and wines for $5 each from their HH menu - was more than pleased with the qualify!   Great for happy hour, lounging around, a light dinner, or a pre-dinner meetup spot!", 
    "review_date": "2015-01-13"
  }, 
  "-EGLqDG8XpBP65jw9y-H0w": {
    "user_rating": 3.0, 
    "user_location": "Trinidad, CA", 
    "user_name": "Vanessa V.", 
    "review_text": "Friendly bartenders, nice big open space with a huge window and cool art. Just beware of the friendly ladies.... Just sayin", 
    "review_date": "2013-12-01"
  }, 
  "N3GFVXPZkodIg6zxYvYXbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M. M.", 
    "review_text": "Way better than I expected. I thought this place would be Hyatt's cheap immitation of the nicer hotel bars and restaurants in town. The drinks and food were not only thoughtfully crafted but they were actually really good.", 
    "review_date": "2013-02-03"
  }, 
  "xsdqxHaedH2J7_HuU3COuw": {
    "user_rating": 4.0, 
    "user_location": "Farmington, MI", 
    "user_name": "Sara R.", 
    "review_text": "Nice place for drink and bar bite We got s bottle of wine and a flat bread which both were good", 
    "review_date": "2014-12-26"
  }, 
  "aRfR610ybqzFbANhpFEwyQ": {
    "user_rating": 2.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Olivier R.", 
    "review_text": "Expensive. Crappy service. Flat bread was advertised as mushroom and cheese, but there was no cheese. In a nutshell, I won't come back. That's sad because this could be an awesome place.", 
    "review_date": "2013-11-23"
  }, 
  "0Cvgx6MKrSOTUxGoUpdaTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison T.", 
    "review_text": "Not sure why there are so many not so good reviews but I love this place.  Happy hour 7 days a week from 5-7pm and its across the street from my office...yep I love it here.  $4 beers and wine and half off the flat bread and they have wonderful staff there.  They are friendly and remember you and constantly checking on me to make sure I am ok.  Oh my gf also raves about the cucumber collins here....its steep at $14 a drink but seems to be well worth every penny!", 
    "review_date": "2013-06-25"
  }, 
  "A6e4f7Qgzn3EKNk3nMKpbw": {
    "user_rating": 5.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Ekaterina G.", 
    "review_text": "I really love this place. Honestly, each time I am in SF I go to this restaurant to eat their San Marzano Tomato Soup. I am a fan of tomato soups, so I tried it in a lot of restaurants around the world, but so far the tomato soup here is simply the best I have ever tried. The best. The perfect balance of sour and sweet. I really hope that they will never replace it on the menu", 
    "review_date": "2014-12-18"
  }, 
  "WQdu9gn9l3QNISGo9_s8bg": {
    "user_rating": 3.0, 
    "user_location": "Narberth, PA", 
    "user_name": "Stephanie H.", 
    "review_text": "Was tired and hungry so I decided to eat in the hotel. Had a very delicious glass of wine that was generously poured. The caesar and kale salad was over dressed and very light on the kale which was disappointing. The blt and avocado had too much mayo and the tomato wasn't fresh. Service was great. Waitstaff was attentive and courteous. Ok experience for a hotel lounge.", 
    "review_date": "2014-02-01"
  }, 
  "kx2FKclY3B7LSIizsNIyvA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Wade C.", 
    "review_text": "I am a fan of hotel bars. I love them. And Union Square is probably the best four square blocks of hotel bars around. This place is very cool. Design is fantastic, they have a happy hour, made an interesting negroni.  I shall return.", 
    "review_date": "2013-10-15"
  }, 
  "WZpsqI-O90locDkJ7-Nptw": {
    "user_rating": 1.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "Chicken G.", 
    "review_text": "Spent Christmas Eve at one up for dinner. Worst mistake ever!!!! Service was soo rude with manger and server!! And with all the great place sf has to offer, food was awe full!!!!! There were 4 of us, and bill for about $100 per head, and I would have rather gone to mcdonolds. Don't waste time or money. The food really was soo nasty, other than my clam chowder being the only thing we enjoyed.", 
    "review_date": "2013-12-25"
  }, 
  "LJzagp0ESF4qypFtYjuLqA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shelly R.", 
    "review_text": "Wow, the only way it could have been worse is if the drink had been undrinkable.  The bar itself is gorgeous but the staff, that's another story.  We waited at the bar and watched at least eight people run back and forth, seemingly doing nothing.  The bartender in front of us was too busy talking to the couple next to us to pay attention to potential paying customers.  We finally flagged someone down and while the drinks got there quickly enough they were overpriced.  ($11 for malibu and pineapple in a small glass?  Then again, it is a hotel.)  Trying to pay was an exercise in futility.  Once we finally got the bill, after asking for it and waiting, and waiting, we immediately put cash down and waited and waited some more.  We weren't at a table, we were standing at the bar.  We attempted repeatedly to get someone to take our money.  Apparently that is not high on their priority list.  Finally someone came over, picked it up, looked at the money, looked at the couple next to us who were waiting to order a drink, put our bill down and said \"I'll do this after I take care of them.\"  At that point we should have taken our cash and walked out but we fished through our money to find exact change so we could get the hell out of there.   We will most definitely NOT be back.", 
    "review_date": "2012-11-16"
  }, 
  "qS7Yq15oqMY5oIl1OI1vDQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy J.", 
    "review_text": "Great space/decor. Mediocre food. Abysmal astrocious service. Outrageously overpriced.", 
    "review_date": "2013-01-21"
  }, 
  "LC3iWVgqL5DniYDWUWC_Gg": {
    "user_rating": 2.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Robin R.", 
    "review_text": "Poor quality food and exceedingly underwhelming service just doesn't cut it in San Francisco, even for a hotel restaurant.  I had one (very standard) question about the specific shellfish contained in a food item and the waiter had to ask the manager to come over and answer, who provided me an answer that was completely wrong. He recommended a food entrée that wasn't on the menu, which had been the same for weeks (if not longer). My flatbread was barely edible.  Skip it unless you are a captive at the hotel.", 
    "review_date": "2014-09-08"
  }, 
  "pIWwy3tymXx2E5c8ynB__w": {
    "user_rating": 5.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Ryan T.", 
    "review_text": "The only thing better than the food, was the staff! Excellent customer service from Sergio, Dunetka, and Jaime. Jaime mixes an excellent Pisco sour! The best I've ever had! The Oven Roasted Wagyu Beef Tenderloin with bearnaise was cooked to perfection and the richness of the bearnaise sause complimented it nicely.  Highly recommend this resteraunt if you are in the downtown (Union Square Area).", 
    "review_date": "2013-09-19"
  }, 
  "nuIWZSQa8W1E-VLKUJlnQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "m K.", 
    "review_text": "Update from a few years back. OneUp has improved their staff recently and its starting to live up to it's looks. This is still a hotel bar, but it can provide a nice get away from some of the other bars in the area.  It's not the best, but worth a go if you're close by.", 
    "review_date": "2014-07-13"
  }, 
  "50cPMcyTi4af_3dmfMZ4Uw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Renee R.", 
    "review_text": "I am never disappointed when I come here. The food and cocktails are consistently delicious. The service is friendly and attentive. The atmosphere is warm and pleasant. I come here often and am never disappointed!", 
    "review_date": "2014-08-29"
  }, 
  "8u-peqj_rERHnmdclKVs7w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blair H.", 
    "review_text": "Well... I did have extremely high expectations of the ramen burger and was for sure let down... bummer! It had the potential to be SO good, and it could be if they got a couple things right..  1) DO NOT cook your eggs ahead of time in molds. No one likes room temperature/cold eggs in which the yolk is not runny. You can tell that the perfect sunny side up egg started off with a runny yolk, but because they leave the egg sitting out/ in a warming oven, it congeals and turns solid. FRESH EGGS people, it literally takes 1 minute to make a perfect sunny side up egg!  2) Ramen noodles suffered the same outcome. Made ahead of time, sitting out, room temperature to slightly chilly...   Otherwise, the ambiance was great, service was good, and I think that by reading the reviews that coming here for happy hour seems like the thing to do.", 
    "review_date": "2013-10-02"
  }, 
  "ItKjKPmzz5X36kgK1ZOjYw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "NM J.", 
    "review_text": "Delicious and beautifully presented food and drinks, and the service is fantastic (warm and friendly, with a good eye to detail when taking special requests on meal preparation). My husband and I were pleasantly surprised to find a restaurant of this caliber inside a Hyatt hotel! Looking forward to trying the lounge during our next visit, as thus far we have always stuck with the restaurant.", 
    "review_date": "2014-07-06"
  }, 
  "peuxbSQwXed-81cSqL7Ykw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Brittany F.", 
    "review_text": "This bar at the Grand Hyatt was quite pleasant. What really stood out to me was the incredible service. The bartender Boa went out of his way to be accommodating. We had a wonderful glass of Sonoma Pinot Noir and shared the pumpkin mousse dessert. It got rather lively around 9pm with what I assume were mostly hotel guests. Their food and wine is definitely above average for a hotel and the service was extraordinary. I would definitely come back to this bar again.", 
    "review_date": "2014-11-21"
  }, 
  "L4cICG5oygboGVWnAij1qw": {
    "user_rating": 3.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Elsa W.", 
    "review_text": "We came here for the RAMEN BURGER!! ):  Saw pictures on yelp of the ramen burger that they had for a limited time, and when we got there, we asked the conceirge guy in the lobby if they had ramen burgers. He said yes! So we walked up the stairs to the dining area.  Needless to say, there was no ramen burger on the menu and we cried. Justkidding. We still went ahead &amp; ate there anyway...  Meat &amp; Spicy Flatbread- was really good! I really enjoyed this!  Pork belly- was okay. I liked the bread &amp; the pickled cabbage...  Poutine Fries- wasn't for me, I didn't really like the gravy..  We also had this beef &amp; noodle soup broth entree, I forgot what it was called, but it was just \"meh\". I just didn't like it overall.. &amp; wasn't worth $30 for..  Overall, just average. I just really wanted to try the ramen burger....", 
    "review_date": "2014-04-19"
  }, 
  "nwKsR5_epCypSzGPsMn0HA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza T.", 
    "review_text": "Came here for the Valentine's day dinner.    My friend told me he was kinda worried about picking this restaurant.  First it was pretty new and second the reviews were pretty bad.  But he still wanted to give it a try.....  Since the hotel had recently completed a remodel, the restaurant itself was very nice.  Cozy and Comfortable.  The service was excellent here.  Everyone was so friendly, polite, professional and attentive there.  They gave you a lot of recommendation and very helpful.  The menu was pretty limited for dinner thou.  They had the prix fixe menu for Valentine's day but we decided to order the food from the regular menu.    We ordered:    Oven Roasted Cauliflower Gratin ($12) - It was pretty interesting.  They added Golden Raisins to it....sweet and salty at the same time.  It was flavorful but little  oily to me.    Oven Roasted Young Chicken ($27) - The chicken was white meat.  Kinda impressed that the meat was tender and juicy.    Olive Oil Poached Market Catch ($28) - The fish was very good.  Very buttery and not dry at all.    Cheesecake ($9) - The cheesecake was good.  The portion was perfect.  Not too sweet but very smooth.    Overall I had a good time here.  I would go back and check out the bar at another time.", 
    "review_date": "2013-02-15"
  }, 
  "NGrXFWek0XnCA0jbAbz7jQ": {
    "user_rating": 3.0, 
    "user_location": "Coarsegold, CA", 
    "user_name": "Joe R.", 
    "review_text": "I am not surprised this is 3.5 stars.  The bar is likely better than the restaurant.  The food was really good, but they do not have a kid's menu.  Odd for a Hyatt restaurant.", 
    "review_date": "2015-01-18"
  }, 
  "Srex-j9ahjTn-R4WPMhbgg": {
    "user_rating": 4.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Daphnie A.", 
    "review_text": "12/31/14 Always great wines and cocktails.  But no Happy Hour on NYE, why not?  I enjoy this lounge and been here a few times.  Happy Hour helps with the hotel prices and did not appreciate that a HH was not honored at 4P-6P on the weekday?  Besides, I paid $15 for a cheese platter that was on the skimpy side!", 
    "review_date": "2015-01-13"
  }, 
  "Pcip3xMbG9_yeAJQD23j2g": {
    "user_rating": 1.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Joseph B.", 
    "review_text": "We ordered drinks and sat at a long shared table.  One Pepsi and 2 beers.  The drinks came, and the waitress handed us a small sign.  After drinking our drinks, we read the small sign.  It informed us that we NOW MUST ORDER AN ENTREE OR ELSE THEY WILL CHARGE US $100 EACH!!.   I am not kidding.    We finished our drinks, and then asked for the bill.  The bill was $128.  This was $28 for the drinks, and $100 JUST FOR SITTING THERE.  WTF??  We refused to pay the $100 because they did not inform us of this policy until after the drinks arrived.   The manager came over to the table and scolded us and gave us a condescending lecture about the special rules during the \"JP Morgan conference\".  We were not part of a \"JP Morgan conference\".  We just wanted a drink.  After completing his rude lecture he informed us that he will drop the $100 charge (\"this time!...but next time please follow the rules so we can be fair to the other customers\").    My advice:  before you order a drink here, make sure you understand their draconian rules so they don't attempt to EXTORT you for $100.", 
    "review_date": "2015-01-13"
  }, 
  "iYcA4HdHZkKnr5qwBna33Q": {
    "user_rating": 3.0, 
    "user_location": "West Oaks, Houston, TX", 
    "user_name": "Krystal P.", 
    "review_text": "As far as hotel restaurants go this really wasnt to bad. We stayed at the Grand Hyatt and went down to OneUP the first night for dinner. We ordered Clam Chowder and Tomato Soup. The bowls were huge and the bread was warm and fresh. Our waiter was very attentive and made sure we constantly had water and anything else that we needed. I didnt try any of the entrees but I imagine it would be a decent lunch spot. Also they have Hppy Hour everyday so thats pretty nice.", 
    "review_date": "2013-06-11"
  }, 
  "yH4E7zen5rI-rRM2UeAFKA": {
    "user_rating": 4.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Ally M.", 
    "review_text": "loved the crab cakes", 
    "review_date": "2013-09-25"
  }, 
  "2x1oADPXPMJ_kKpzkRhq5A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Praveen S.", 
    "review_text": "Ok! Here's an update. Hyatt apparently read my Yelp feedback and next day when I came  back to my room from work, I saw a nice bottle of wine and a note from the manager apologising for the incident. Naomi ( manager) personally called to apologise and also understand the escalation. She promised to take action and I also got to try the bar again and this time it was totally different. I was well treated and was assured this is the standard.   For me, personally being an extensive traveller this incident was definitely annoying but the way Hyatt managed the situation deserves Kudos! They ensured im checking out a happy customer. I love Hyatt services and will come back to stay again.", 
    "review_date": "2014-08-09"
  }, 
  "cRymbgLkvcH9hWp2qV9UGg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jennifer K.", 
    "review_text": "We happened to stumble upon this place looking for a dinner spot while walking around union square. Located inside the Hyatt hotel. The decor and ambiance is pretty nice here. We got seated at a booth.   Ordered a glass of Zin, clam chowder soup, halibut, and scallops. The clam chowder was amazing! So flavorful. The halibut I ordered was alright, it was sitting on top of a bed of cucumbers, green apples, and bell peppers with some vinaigrette sweet and sour sauce. I felt like it wasn't the best halibut I've had. Scallop dish had like 3 scallops. My bf thought it was good.. It came with a siracha type chili sauce.   Service was good. They kept refilling our waters, and checking in on us. Bill came out to $100. Experience was good I just felt it was overpriced for the quality of food.", 
    "review_date": "2014-05-02"
  }, 
  "rYduaRSe23tF3_LvSYc0lA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sable M.", 
    "review_text": "Let me begin with the positive note: 1. Service was okay; eager to please yet lack of professional training. 2. Wine list was inadequate, inaccurate and not up to date. - We asked for three different bottles and they either did not have the bottle or did not have the vintage that was listed on their menu (e.g., listed for 2007 and only have 2009; listed for 2008 and only have 2010.)  - One 2009 Petite Sirah was listed with a price of $9,999. While they admitted that it must be a mistake, no one can find out the correct price. 3. Food was the biggest disappointment.   - Overall the salad (with raw beets and goat cheese) had no flavor except for one bite that tasted like soy sauce; poached salmon was mushy, scallops were over-cooked, bitter and way too salty.   - Duck-fat fries neither smell nor taste duck fat. - Panna cotta was tough and no trace of pepper or basil as described on the menu; chocolate cremeux was nothing to write home about.   The setting was nice, though.  At a night if you cannot get reservation anywhere else and your date does not care about food and wine, it's an acceptable choice.", 
    "review_date": "2013-01-22"
  }, 
  "BzLUyHSJrl-lUVWw9rqlvQ": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "George F.", 
    "review_text": "This review is only for the bar. A group of us stopped in for a night cap of beer and lattes. The restaurant is beautifully done. The seats and tables are not very comfortable though. It's located in the Mezzanine area of the Grand Hyatt. Service was fast and efficient. 20% off Yelp Check In on Happy Hour.", 
    "review_date": "2013-08-20"
  }, 
  "mQyoMQxBK-YeOYT_Uy_ZPg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle G.", 
    "review_text": "I came here for a couple drinks with a friend on a recent Thursday evening, so this review is for the lounge only.  As to be expected from a swanky downtown cocktail lounge, the decor is cool and trendy, the bar and lighting are eye-catching, and the cocktails are $14.  The layout is actually pretty neat too; you cross a \"bridge\" to get to the lounge, with shelves of spirits on either side.  It's a nice touch and if you get a seat on the side, you can people-watch (i.e. spy on those on the ground floor).  My Manhattan and Old Fashioned were made nicely and both were very tasty.  The waitress was also very attentive (perhaps too much).  For happy hour and the early evening, the place was pretty crowded and every seat was taken.  It felt like a lot of locals (mostly financial types), as opposed to tourists staying at the hotel.  By 7:30 or so, most of the people had cleared out, which was actually nice since I felt like we had some breathing room again.  Overall, I had a great time and would recommend this place to anyone whose in the mood for an upscale cocktail lounge.  I'm giving it five stars mainly because I feel the current rating is a bit undeserved.  Yes, it's still a new place, so there are some kinks to still be worked out, but definitely give it the old college try before writing it off.", 
    "review_date": "2013-01-18"
  }, 
  "z2qnBPRjUFgcspNzLkRpSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew G.", 
    "review_text": "I've had the opportunity to dine at the OneUp Restaurant and Lounge for both lunch and dinner.    If Union Square dining is on your radar, don't miss OneUp.  It's easy to miss as it's on the mezzanine level of the Grand Hyatt San Francisco.  The restaurant and bar is very modern and is very well appointed.  The bar is great, grab a cocktail before dinner and admire the artwork on the wall.  They display local artists' work.  One of my favorite things for lunch, although simple is the BLT &amp; A.  The last time I had it, tomatoes were in season.  Can't get anything better.  For dinner, don't miss their San Francisco Cioppino...a staple in SF.  Their executive chef does a fantastic job.    On both occasions, the service was great...from the moment we were greeted at the host stand to when we left, everything was A+.  Additionally, their restaurant manager, Josh Cilley, made his way to our table to make sure everything was great.  Always a nice touch when the manager comes over.  All in all, the OneUp restaurant does a great job.  Whether you're staying at the hotel or wandering around Union Square, stop in.", 
    "review_date": "2014-10-23"
  }, 
  "BTHM_fKbuVPFa-z7gK1gGg": {
    "user_rating": 3.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "Trey W.", 
    "review_text": "The bar is cozy and comfortable.  I like people watching the street below.  The drinks were tasty and refreshing, including the special.  The Old Fashioned had a spice to it - different and interesting.   The food is where they get the dings.  The meaty and spicy flatbread was super tasty and is my go-to grub every time I visit.  However, the various other meals I've had were mediocre at best.  Why serve clam chowder in San Francisco if it's not insanely good?  My steak was overcooked and my coworkers fish dish was bland.", 
    "review_date": "2014-04-06"
  }, 
  "ngsfCrpXBoqDsIpKQH2vWg": {
    "user_rating": 2.0, 
    "user_location": "Media, PA", 
    "user_name": "Norman F.", 
    "review_text": "This is for the dining room. I generally avoid hotel restaurants, but I was in a hurry. Place was empty, prices are high. The menu is random and uninspired. I was seated quickly, and seemed to have 3 servers. One was sort of pushy and annoying. Ordered the fennel halibut. Lame. Seriously, they didn't even season the fish! It wasn't over cooked, at least. The side tasted like celery and mayo. Desserts are really unimaginative, like stuff you get frozen at the grocery store. The fresh strawberries weren't very ripe.", 
    "review_date": "2014-06-03"
  }, 
  "Vx-l5rI0xAiN4SeBonrgkw": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Kevin L.", 
    "review_text": "Complimentary breakfast that came with our room at the Grand Hyatt (Thanks AAA membership!). Modern restaurant, one floor above the lobby. Beautiful decorations, chandeliers, wood everywhere. There was even this cute terrarium on our table.   Your standard continental breakfast: - eggs  - bacon - sausage - pancakes - toast, croissants, bagels, etc - yogurt - juices, coffee, milk - fruits   Nothing special, nothing fancy. The actual price is a whopping $25 for the buffet so if you're not getting this breakfast for free, skip it.", 
    "review_date": "2013-11-28"
  }, 
  "XCW5pJCDhvlW76XTSUEkIg": {
    "user_rating": 4.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Ivy R.", 
    "review_text": "After our lackluster shopping experience over at Niketown, we wanted to sit and have a drink and discuss what to do next for our SF outing.  I really needed to use the bathroom and that also a large motivating factor in us coming in here as well.   It was pretty much empty at around 1:30pm.  We sat at the bar that you can see the street from and people watched.  My husband ordered a custom cocktail called the Blueberry Ginger Cooler.  I had Water because I was 71/2 months pregnant.    This is a really beautifully decorated space.  Even in the bright light of day it just has this upscale ambiance.  The floor to ceiling windows also make you feel like the city is alive in the room with you.  I'm sure at night it's even more romantic and stunning.  My husband really enjoyed his drink.  How could you not?  It had a full days worth of antioxidants in it.  Of course I was really jealous.  If and when I'm ever in the neighborhood again is make this a quick stop for a cocktail and a nice relaxing view before more shopping and touristing.", 
    "review_date": "2014-02-10"
  }, 
  "c-FJsngyRP56jhkHJEdVpA": {
    "user_rating": 1.0, 
    "user_location": "Modesto, CA", 
    "user_name": "christian M.", 
    "review_text": "Talk about abismal service. Went there one night to check out the venus since I was looking for a place to hang out with friends and have a cocktail reception after my wedding ceromony.  I met the restaurant manager Max Johnson and inquire about the venus, he said to email him. Which I did but never heard back from him, so I decided to call and leave a message. Surprise, surprise, no response.... being busy is one thing but not having the courtesy to return a call or an email is unproffessional... just goes to show how this bar/restaurant doesn't value their customers... avoid it like the plague.", 
    "review_date": "2012-12-14"
  }, 
  "hIXbkTggwSsoubFi2EFJ4w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Princess J.", 
    "review_text": "We made reservations for lunch at 12:00 noon, then called to say that we'd be late, and arrived at 12:15. The restaurant was EMPTY! Not one single customer. They said that it would be HALF AN HOUR before we could be seated. Really?!?!? Wait, let me elbow my way through the crowds to get to the exit!   While the room is beautifully designed, when (and if) it's ever fully occupied, I have a sense that the noise will be deafening as everything was hard surfaces.  We left, and won't return. They're clearly not ready for prime  time.", 
    "review_date": "2012-11-19"
  }, 
  "HY5knLUYR7FxH-klCs_EbA": {
    "user_rating": 5.0, 
    "user_location": "Roseville, MN", 
    "user_name": "Steve T.", 
    "review_text": "I had a wonderful experience at this restaurant. The staff was exceptionally attentive and polite. The food was delicious and fresh. It wasn't overly busy like the nearby highly rated establishments. I recommend it.", 
    "review_date": "2014-11-14"
  }, 
  "Te18TxvzfLomGE56N7s3Dw": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Dean W.", 
    "review_text": "This review is purely for Dine About Town.  Came here for the lunch which is a great deal because normally it's $18.95 for two courses but they throw in the dessert as well.  I had the salad and the lamb burger which both were standard size.  My mom had the soup and the fish.  Food was good, nothing to rave about though.  The staff is trying.  It's not a five star restaurant so you can't expect them to be executing extremely well and it is a Hyatt hotel restaurant but they try to be friendly and strike a conversation with you.  They're also pretty attentive.  Come for Dine About Town, it's a great deal.", 
    "review_date": "2013-01-17"
  }, 
  "rEHMKpKYkW42ExQ3k-iEeg": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Julia P.", 
    "review_text": "My review is based solely on the breakfast buffet for the Grand Hyatt SF Union Square.  Pros: 6am-11am, you can come in super early or sleep in if you'd like Gourmet Hot breakfast items...not your regular scrambled eggs and toast Fresh &amp; Organic breakfast items (I saw them switch foods out that were sitting too long under the heat lamps for new ones, with not many people even getting food) Customer Service - the staff waiting on tables were excellent (got me anything I asked and things I didnt even ask for too!)  Cons: Pricing - IF I had to pay out of pocket for this breakfast buffet, it would've been $25/person.  Glad it was included in the Room reservation.  Next time I'm staying in town - I'd love to come back here!", 
    "review_date": "2012-11-27"
  }, 
  "XBiQVWlPhrhLh-rRLCZhyg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wilson T.", 
    "review_text": "The restaurant seems really sophisticated and the menu looked reasonable for such a fancy hotel. But we went here to drink and chill after hitting up a wine bar so can't really speak for the food. The drinks were fine, service was acceptable.", 
    "review_date": "2012-12-17"
  }, 
  "4JqEP5Wlmtvghj44y2iM3w": {
    "user_rating": 3.0, 
    "user_location": "Columbia, MO", 
    "user_name": "Michele N.", 
    "review_text": "Clam chowder was amazing. Very quiet during lunch on Sunday. Too much paprika in the scallops for my taste.", 
    "review_date": "2013-06-10"
  }, 
  "wGZcnMgcj6F-C1JsNClZPw": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alexa M.", 
    "review_text": "Man down at One Up! My parents ate exclusively at OneUp when they were in town for a conference at the Hyatt. They generally enjoyed their food, they did not find anything a distinct letdown neither anything to write home about.   This mediocrity suddenly took a turn for the worse when on the last morning my father ate a doomed dungeness crab omelet. I'm not sure the next time he'll be trying omelets again for the foreseeable future, as he spent the next night with his first, worst, and most painful experience of food poisoning.   Never. Again. Either for OneUp, or perhaps for dungeness crab/omelets which were their unwitting conspirators in a most unsavory crime.", 
    "review_date": "2014-07-02"
  }, 
  "ET8n-r7glWYqZhuR6GcdNw": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Michelle C.", 
    "review_text": "This is one of the better hotel bars I have come across. The bartender is the sweetest man imaginable, and he took care of me once while I was having drinks at the bar with a friend and again when my fiancé and I had some time to kill and decided to do it over a snack in the lounge.  I love the comfy seating in the bar area. It's perfect for lounging solo with a book or while hanging in a group.   A little more variety in the bar menu would be great. I ordered sliders on my visit with my fiancé and we had to place a separate order for some fries on the side. The sliders were juicy and quite tasty. The fries unfortunately didn't make it out at the same time as the sliders, but they were worth the wait - hot and crispy until the very last bite, thanks to the metal dish in which they were served. Nice work, Grand Hyatt.", 
    "review_date": "2014-12-03"
  }, 
  "7ttR3ZoBHRWHWAcw09-1fQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheena K.", 
    "review_text": "Too bad for the bad reviews.. I love this place.. it's mellow and perfect for a break from Union square shopping :)... And their bourbon based cocktails were just perfect!!", 
    "review_date": "2013-02-12"
  }, 
  "Vm1aUvzG3APDJW2JV6Ovmw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dwayne R.", 
    "review_text": "Bleah. Overcooked burger.  Precooked cold egg. Cold ramen buns. Never again.  Hotel restaurant. Hyped on Thrillist.   Great space and friendly and attentive staff.", 
    "review_date": "2013-09-24"
  }, 
  "TOzyMb15cu9hlhn8aPOQSg": {
    "user_rating": 4.0, 
    "user_location": "Camas, WA", 
    "user_name": "Bernadet R.", 
    "review_text": "Just stopped by for drinks, both at the end of happy hour, and again for a nightcap.  Courteously I was asked if I was in the mood for food, but declined on the menu.  The drink menu featured classics and some new ones with a twist.  My favorite was a vodka-lemon-mint concoction that had me ordering it in multiples.  All review-worthy areas from libations to seating, to atmosphere scored well for a bar hotel in Union Square - but what put me over the top was their attention to staffing.  As it turned out there was a large conference with many attendees that simultaneously converged at the bar, as attendees are wont to do in such a place.  Instead of leaving the non-badge wearing of us out in the cold, there was a barback for every bartender and they were all about service.  I love it when a place staff's up appropriately and service is as much part of the experience as the drink.", 
    "review_date": "2013-10-29"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Psst.  Let me tell you a secret.    I love frequenting hotel bars because ... it's empty. Ok, not really, BUT you can always find a seat. (see what I did there? I just did your feet a favor!)  Sure you'll run into the occasional tourist and/or convention goer, but if you find a hotel bar that can make a kick ass cocktail served by an awesome bartender, you keep it on your radar.   On chilly SF nights, I crave the bitter bite of Campari. That being said, the Negroni here is spot on. Head bartender Phil knows what's up and that seasonal cocktail menu? pretty exciting too.  If you don't know what you want, just tell him your preferences and he'll be sure to whip up the right concoction for you.  OneUP's soothing colors and minimalist vibe is a welcome sight amidst the holiday craziness of Union Square. Whether you opt for the low loungey seating or seats at the bar, you'll have a relaxing time here.", 
    "review_date": "2013-11-30"
  }, 
  "N8wEuTgwXvWw6MX9HEO87A": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "John K.", 
    "review_text": "I came to OneUp solely for the ramen burger, only to find out it had been taken off of the menu. My server, Evelin, who could not have been nicer, went in the back to see if they could make me one anyway.   Success!   I've been trying to find  the original ramen burger in New York and I have no idea how this compares, but I wasn't as blown away as I thought I might be. It seemed bland. I have to give the chef huge credit for even thinking to put this on the menu, BUT...when someone voluntarily offers to consume ramen noodles, ground beef, a fried egg, bacon, and whatever the hell else went into this thing, that's a free pass to toss in anything else that might make this delicious. Not that the flavor stopped me from finishing it, but it should not have been bland.   Ramen burger aside, the fries and the wine (Alexander Valley cab), and even the burger without the ramen were great, as was the service.   I have to say it was definitely novel to find one. Dump some salt on it and put it on the menu!", 
    "review_date": "2013-10-23"
  }, 
  "2bHSZhM0huV8LRh3YHaOSQ": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Ouch - $14 for a specialty cocktail.  It was a damn fine cocktail, but at that price, I'm really limited to one. I like the ambiance in the lounge, especially when they have live music.  The wings kept catching the attention of my scent receptors and I was totally wanting them, but alas, had already ordered something else. To that end - I had dinner over on the restaurant side in the private dining room.  Small, uninspired and dark, maybe it could feel intimate, but it felt kind of like we were in a very large broom closet. Service was great, wine was fab, but the food was just okay.  I had the spring salad which was light and fresh, but I was hoping for a little more strawberry I think. I also had the meaty and spicy flatbread, which was spicy, and while tasty, it was tasty in that \"hey - this is pretty good for a frozen pizza\" sort of way.  I wasn't super impressed. The tater tots however, are perfection!", 
    "review_date": "2014-05-08"
  }, 
  "xy0iXlNpFRLluPTgQvQT0Q": {
    "user_rating": 3.0, 
    "user_location": "Capitol Hill, Denver, CO", 
    "user_name": "Matt R.", 
    "review_text": "Staid at the Hyatt for a few days and LOVED the location. Swung into OnUp a few times and then killed time here before I had to fly home. Jaime is an awesome bartender. Personable, quick and efficient.   The late night bartender, I didn't catch his name, caucasian, possibly bald. Was a complete ass. I've never dealt with someone is the hospitality industry, or at least connected to it with such a terrible attitude. Love the Hyatt but doubt I'll be visiting OneUp again during evening hours.", 
    "review_date": "2014-10-10"
  }
}