{
  "OXYtOFX9xXukagW5Ku5dfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sofia R.", 
    "review_text": "Went to Origin for a friend's birthday. The line was SO LONG! They will cut off the line at a certain point once they reach a certain capacity.I was really close to the cut-off point.   Anyway, I got inside sometime past 10:30pm. If you're not on the guest list or if you get in past 10:30pm, you pay a fee. I paid $20.The place itself looks really nice although it was kind of small. I thought the interior was actually pretty nice. Place overall was really packed. TOO PACKED.  The bathroom was nice and clean because of staff being on duty pretty much the whole time, waiting for a mess to happen. They're also pretty nice and helpful. The line for the bathroom is also long but, as a girl, I had ample time to look at myself in all the mirrors they had lined up along the walls. The guys don't have the same luxury.   Bartenders are very attentive and nice. I got a Pineapple Malibu for $10 which is the usual expensive price paid at other clubs. The music of that night was mainly EDM. Some songs are cool but would have wanted more variety. The girls at the club are cute! They wore glittery leotard things that night and mostly hung around and brought sparklers and bottles for bottle service tables.   There is only really one dance floor. You can dance on the top floor but half of it is a smoking area and the other half is a balcony with little couches. Not much space there but not much space anywhere really.   Overall experience was okay. Everything was pretty cool but personally did not  like the playlist that night and hated how incredibly packed it was.", 
    "review_date": "2014-07-17"
  }, 
  "T0HWgeviH7722ZJpWFrB4Q": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Nina H.", 
    "review_text": "During my visit to SF last weekend, my friend told us that we should go clubbing... so we did. We put our names on the guestlist for the pre-launch party, and went in around 10:30 p.m. It was pretty empty because people don't usually go until 11 or 11:30 p.m., but it was fine. We got to see the whole club without having to trample over people.   The club is SUPER swanky inside with bunny go-go dancers and all, and they are all so gorgeous. The decor and lighting was very nice, and reminded me of a smaller version of a Vegas club. I'm not sure how much cover usually is, but try to get on the guestlist if you can.   Well drinks were like $12 and that blew my mind. So if that's any indication of what the prices are here, I'm guessing cover will be like $20 or so? But anyway, the bartender was super sweet and pretty as well. There are just a lot of attractive women in SF, and I kept thinking the whole time that my guy friends back in Seattle would LOVE this joint.  Crowd was pretty diverse: mostly Asian Americans though. This would be a nice place to celebrate someone's birthday because the booths/tables are very nice, and of course, they bring out your alcohol with sparklers.", 
    "review_date": "2014-05-15"
  }, 
  "OOQmg-zRIQCTwvIqLasc2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jasmin t.", 
    "review_text": "Location: easy parking, 6 mins from my place what more can I ask for.  Venue: Not super crowed, good decor, just like grand- wanna be la. But this time they got closer.   People: maybe I'm just old, but a lot of kids? so young... Lol. Other than that it's pretty diverse, which I like.   Music: edm/ top 40.   Dresscode: there's none?   We got a table on the floor right behind the JD that was nice. Had our own little dance area thank god since it was decently packed.  The servers were good for the most part nothing to compliant about.   Simple easy fun night with no hassle oh and the place is clean!!!!!!", 
    "review_date": "2014-05-31"
  }, 
  "BXFQgBfrEBDI3QTTnDtRVw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JOSE Z.", 
    "review_text": "Low class club. I heard this place is own by the same people from The Grand. Do a San Francisco a favor and stay away from us. Security guys: ZERO! attitude. Because you are a security doesn't mean you are going to treat people aggressively;  you use your manners to deal with it. You can get easily sue, believe me you will be not the only one. No in and outs... So can you explain me why the heck you stamp my freaking wrist? I think this place lacks on common sense. It is the law to identify yourself if a costumer demands it, of course they wouldn't do it because the costumer has the right to complain about  your unnecessary childish ignorant behavior, mister security guy.  Bartenders: One of the bartenders at the entry should learn that to serve a beer you don't need to make acrobatic moves, nice try but you look ridiculous.  Beer: $12 ( Stella),  Sure not problem. Take $20.", 
    "review_date": "2014-08-17"
  }, 
  "2zoE5Mkh1QCW2aPmEXu1UA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris C.", 
    "review_text": "got bottle service here 3 times in a row due to birthday parties. the third was the worse we had a birthday party and we decided to come early to get in by guest list line.  Line was super long and by the time we got in front bouncers asked if we wanted bottle service. For my curiosity i ask how much it was so maybe we can grab two tables with my friends table.  Bouncer told us the price, we asked each other about it and literally ten seconds later they say if you don't want it you can go home.  Bouncer quote \"I CAN MAKE THIS THE WORST NIGHT YOU EVER HAD, OR YOU CAN GO HOME\". i would of went home if it wasn't for a friends birthday.  There are bouncers there that are power hungry. From this experience i will not go here and tell all my other friends not to go here.  And club a lot and get bottle service.   I DO NOT RECOMMEND. Ruined my night", 
    "review_date": "2014-06-04"
  }, 
  "qWt2sjvEi_BoollBcpvXCg": {
    "user_rating": 2.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "SK Y.", 
    "review_text": "Pros: Nice interior, convenient location  Cons: They need better DJs...seriously, replaying the same song 3 times...  In my opinion, there are some older nightclubs that can do a better job than this. I might go back again for a second chance.", 
    "review_date": "2014-08-10"
  }, 
  "As71uCzIDIwkZ8s1p40cmQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria Gracielle Y.", 
    "review_text": "This place is OK, it's a good comparison to The Grand but a little smaller. It gets really packed by 11:45pm and a lot of asians party here. We went on a Saturday night and they played mostly EDM music. They would play a few hip hop songs then it would mix into EDM. Our group would be dancing and then go \"wtf\" lol... I remembered they played one slow song.. Had to rethink where I was again. Lol The bathrooms for the ladies was cool, since they had walls of mirrors while you wait in line. I give this place 3 stars for getting my girls and I on the all night guest list for free and no waiting in line and for the mirrors by the bathroom. Lol... Other than that I probably would not go back here again. Unless, it was a special occasion or something.", 
    "review_date": "2014-05-27"
  }, 
  "yxKUsyzGRXd-HItD2d4ouw": {
    "user_rating": 3.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Justin S.", 
    "review_text": "I had heard about Origin's opening and how the owners also own The Grand, but haven't gotten a chance to check it out until this past weekend.  Initial impressions of the place were good. Numerous Armand de Brignac displayed prominently on the foyer bar, great decorations and decor. However, as I walked around I noticed a few things lacking: You could see into the men's restroom, and with that -- the mirror which reflected the backs of the gentlemens peeing @ the urinals. You could see some of the unpainted plasterboard in the ceiling. I did enjoy that we could sit around at the foyer area though.   Guys and girls situation is pretty much similar to The Grand. They probably have the same criteria to let people in.   The music was good, but not spectacular.  Prediction? They will ride the hype train and either Origin or The Grand will change management within the year, probably for a hefty sum.", 
    "review_date": "2014-06-09"
  }, 
  "V30Fh9_4AdsLdnl44GUg3A": {
    "user_rating": 1.0, 
    "user_location": "Sterling, VA", 
    "user_name": "Jennifer M.", 
    "review_text": "Sooooo never again. They are unbelievably rude here. When you are inside, the staff will literally shove you. SHOVE. This happened multiple times.... And when you have to escort someone out at their request, they won't let you back in apparently unless you are one of the select few.  Even if you paid for an unreasonably expensive table. They lie and change their story to ask you for money to get back in . The full $20 cover that is more expensive than DC or NYC...... SERIOUSLY. They asked us to escort someone out and no way were we going to make the person leave by themself... They tried to blame my sober companion for his behavior when that was not the reason. Then they said it was me.... I had drank nothing zilch Zippo that night..... Yeah..... No. Niet. Never. Nein. I'd rather die first than come here again. Zero stars if I could.  PS Water is $5", 
    "review_date": "2014-06-22"
  }, 
  "w3iChbP_eECDwP4ar-zORA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lilly L.", 
    "review_text": "MM mm mm RATCHET. Capital R, capital A, tchet, RAtchet. Everyone who rates this place 4-5 stars are the people those who rate it lower are complaining about... LOL.  I think maybe this club is rated low is probably because people weren't expecting an AZN club. I don't mean Asian, I mean AZN! Aka dudes who drive souped up Hondas with fancy rims, loud bass, and dragon tattoos and girls with eyeshadow as dark as their soul and fake lashes that reach to the skyyy. Ain't nothing wrong with that! It's fun when you want to have the kind of night where you make iffy decisions and lament it the next day.  I'm rating low because $20 is a stupidly expensive cover charge for shitty/unknown DJs ie. glorified iTunes Player.", 
    "review_date": "2014-10-15"
  }, 
  "oCK1HfD_HXsMMN1mHaB5-g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh S.", 
    "review_text": "If you take a cookie cutter Hollywood nightclub and transplant it right into the city of SF, it would be Origin.  Overly enthusiastic barking bouncers included!  The interior was warm and inviting with dark blue hues, silver accents, and a couple fireplaces.  There is an upstairs that has a bar and mainly used for bottle service.  Downstairs is where you'll find the fifteen minute lines to use the toilet (this includes guys!), as well as the elbow-to-elbow dance floor.  By the way, the line to use the men's bathroom got so long that it started to take up the stairway.  Going up and downstairs was made pretty difficult.  At one point a girl was too drunk and ended up falling down a couple steps, because it was so crowded.  Hazard for sure.    The music played was what could be expected.  A lot of hip hop hits with some pop strewn about for good measure.  The EDM wasn't bad though and I was even surprised that some old school Tiesto was played.  The drinks and ventilation were pretty poor.  The drinks tasted like they were watered down.  Perhaps it was just me, but I swore they were.  As for the ventilation, I questioned if the AC, fans, whatever were even on.  It was extremely hot in the club.  It was so bad in fact, that my friend needed to be taken outside to get some fresh air where she ended up throwing up.  She left shortly thereafter.    I am not sure I would go back to Origin again and I hope that they really do something about their ventilation.  No patron should ever feel so hot that they end up throwing up.", 
    "review_date": "2014-08-24"
  }, 
  "Wh2Y4k8MPPvBAGoRu4WCNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connie Y.", 
    "review_text": "I can see myself going to Origin SF a lot more often. Why?  1. The music is on point! They play top 40.  2. The location is great because it's closer to home for me.  3. The decor is real nice! It may be smaller than The Grand but it looks great. When you enter, there's a bar to your right and scattered couches to your left. There's bottle service tables upstairs and downstairs. The dance floor is a decent size. There's also an additional bar upstairs.  4. It is open until 2:30AM.  5. The staff was great and generally pretty friendly.   With guest list, it's free before 10:30PM and after that I assume is $20. There was no line at 10:00PM when we arrived on a Saturday but of course, it's new still.   Throughout the course of the night, it got pretty packed, but not to the point where you can't move. The crowd is mainly Asian, which is similar to The Grand.", 
    "review_date": "2014-05-20"
  }, 
  "s4RAHE6Ve7uiRWHRFYe-3A": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Jess L.", 
    "review_text": "one star because this place is new, still fresh and good looking.  bottle service area WAY TOO SMALL. paying over thousand of dollars to get a small little space where people can get in and out..  club was too bright.   bathroom. good luck. long line.  music wasnt that great the night i went.  bouncer was WAY TO FREAKING COCKY.... not only the boucer disrespected us he kept talking shyt.. not friendly at all.. its stupid that we paying all that money to have someone give us shyt.  we paid for bottle service to have a good time and not to deal with ur bs. if you say you are doing ur job then u are not doing a pretty good job cuz hella people cut in line and u didnt even catch them because u were too busy talking shyt to us..  you know what origin its fine i will take my money to some other clubs.", 
    "review_date": "2014-05-22"
  }, 
  "r3UmPWmn_e62xJpEngrAxg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Selina W.", 
    "review_text": "Save your plane ticket to Asia and just come here....  ZERO diversity. I can't.  Music was horrible.  Luckily I didn't have to wait in a crazy long line - got here around 10:30pm on a Friday night...  Never again.", 
    "review_date": "2014-07-26"
  }, 
  "Qi1AuyRjI8_2Fq0swFUGAQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie M.", 
    "review_text": "This club is pretty cool besides that yesterday night I was having an awesome night just dancing and I was near the stage and I had my hand on the glass wall in the front of the club. THE DJ WAS A FREAKING DOUCHEBAG. He literally grabs my hand off the glass and flings it away HARD. I believe he said something about not f'ing being near his equipment. I was not drunk. I was not being a ratchet hoe who's falling all over the place. I was just dancing. My hand was no where near his equipment.   Next time you guys should think about who you hire cause obviously this guy does not care about your patrons.", 
    "review_date": "2014-08-03"
  }, 
  "IwReuuhmq5zVa_wXCGJ7tg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abigail E.", 
    "review_text": "This place is Ok. I would not pay cover for this place so I recommend getting on the guest list and getting in for free before 10:30. The dance floor is pretty small in the center and the drinks are expensive. This place is mostly an asian club. Nothing else really stands out to me about this place", 
    "review_date": "2014-11-23"
  }, 
  "ZSUg9VNz150bLHEYGc6GQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ringo M.", 
    "review_text": "(...Sing along to 'If I Were a Boy' by Queen Bey...)  If I were a girl Even just for a night I'd roll outta bed to Origin And throw on something skimpy and go.  Drink shots with the guys Then gossip with girls I'd get smashed with who I wanted And I'd never get charged cover for it Cause they'd pay up for me  (chorus) If I were a girllll I think I could comprehend How it feels to love a boyyy I swear I'd never zone a frienddd. I'd listen to himmm Cause I've seen all the memes When you lose the girl you wanted Cause she took your drink for granted And the limit on your card got destroyed.  If I were a girl I might just lose my phone  Tell everyone to find it So then I can go off dancing alone. I'd dance myself first And make the steps as I go Cause I know that he'd be thirsty Waiting for me to come close, to come closeee  (chorus) If I were a girllll I think I could comprehend How it feels to love a boyyy I swear I'd never zone a frienddd. I'd listen to himmm Cause I've seen all the memes When you lose the girl you wanted Cause she took your drink for granted And the debit on your card got destroooooyed  (BOUNCER's bridge) It's a little too late for you to come here See the guestlist is fake Cause I'm the bully right here If you thought I'd be nice to you Pay me offffff  But you're just a girl You don't comprehend Yeah you don't comprehendd ohhh How it feels to love a boy sometimes you wish they were playing Tranceee. You don't listen to himmm You don't careeee bout his rims. Thats why you lose the one you wanted Cause you took his song for granted And everything you drannnnk just got hurled.  But you're just a girl.  lawlz  just kidding ladies! but forreal beware them bouncers", 
    "review_date": "2014-08-24"
  }, 
  "W67qcTCAN5a6JxUJqo-zZw": {
    "user_rating": 3.0, 
    "user_location": "Elk Grove, CA", 
    "user_name": "Aline N.", 
    "review_text": "A haven for those with yellow fever...  ...I have never seen so many aZn ppl in my lyfe, under one roof, at a club. Well actually, I immediately saw all that once I step foot outside the cab like holy moly Miss Saigon.  I need and love diversity in my life so that was a shocker personally, but other then my ppl... It's a nice looking club. Two story and spacious. Music was coo, I kinda dig it. Women's bathroom was beautiful. Bartender that served me was nice; made me my LC and my buddy a Black Superman like a pro lol.  So yeah... *goes bar hoppin' instead*", 
    "review_date": "2015-01-29"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 3.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "I went here on 7-24-14 7:50pm'sh, it's an Asian American Donor Program (AADP) charity event, $5 for admission because of facebook sign up.  It's a very presentable venue, good music, however, the drinks are expensive. $7 Stella beer (borderline expensive beer), $14 long island, $11 cold kettle one, club soda $3.  There is a fair size dance floor, with a 2nd floor. Well I did meet my current and  some new friends on this event, so it's cool.", 
    "review_date": "2014-07-24"
  }, 
  "ntTwbVLW5aeQrtrafjBghg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony T.", 
    "review_text": "Worse clubbing experience ever.  1. Intentionally restrict the line when the club is near empty inside to make people pay cover. We put our name on the guest list which supposedly gets you in free before 10:30. We got there at 10 pm and the line was around the corner, but our friend inside said it was empty. Line moved incredibly slow, so we waited an hour to get in an had to pay the $20 cover.  2. Drinks were way over priced. $14 for a mixed drink. $7 beer.  3. DJ was terrible. Kept switching the songs very 15 seconds with abrupt crappy transitions.  4. Lied to us about in-and-outs and wouldn't let us back in after we took 2 steps out the door to look for our friend.   Pretty much terrible in every way. The only up side was there was no wait I get drinks because people didn't want to pay insane prices.", 
    "review_date": "2014-06-09"
  }, 
  "MBFoFh4KynlDZ6l1rMjp1Q": {
    "user_rating": 1.0, 
    "user_location": "Chino Hills, CA", 
    "user_name": "Stephanie W.", 
    "review_text": "If you want to listen to a pathetic commoner's review of Origin then you've reached that review. Yes, I must be a no class hood ratchet because I am not classy enough for this place. I came here with a huge group at 9:30ish and there was already a huge line out the door. This must be the newest poppin' place right? ... WRONG. They have terrible service. They denied some members of our group for wearing a tshirt and white soled shoes. They are terribly inconsistent about it and also rude as well.   They let in some guys ahead of us even though they weren't dressed as fancy as they should have been, they got in... and the bouncer denied us?? Wow, what is the fairness in that? And when we asked the bouncer why, he said it's because he knew them. OKAY. So that guy has connections?? Well.... I may not have any connections but...I HAVE MONEY (not that balla tho)...AND I LOVE ALCOHOL !!! But never again! not at this club... I'll just take my peasant self with my alcoholic tendencies and find some other place to party!!  Sorry Origin, you lost the patronage of a bunch of people, including me. AND I'm never suggesting this place to my friends..", 
    "review_date": "2014-07-02"
  }, 
  "xPLe-lgQOYoLz37wv76OnQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy C.", 
    "review_text": "Love the music! The dance floor is a bit small. My friends and I got bottle service and was seated in a nicer area. Bathroom lines are long (but expected). We got there early so parking was pretty easy. Got there at 10pm and the lines were pretty short (Saturday  night). $14 for amf.", 
    "review_date": "2014-05-25"
  }, 
  "gZmEZvZwLJH7JiQfIdbkRQ": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Joe N.", 
    "review_text": "5 stars because every time I go here I am perfectly wasted and don't come home until at least 6 in the morning. If that doesn't mean I had a good time, then I don't know what does.", 
    "review_date": "2014-06-15"
  }, 
  "h5_2StCQBGs4PmYuM5OzaA": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michelle G.", 
    "review_text": "I've been here a few times on break to meet up with my friends from home. Honestly, this place is nothing special. Yes they have a foam machine and confetti but nothing that really WOWS me. The crowd is mostly Asian dude sausage fest grabbing on you every chance you're on the dance floor. Music is a mix of EDM and old hip hop songs from like 2013 plus a little bit of Top 40. You get a decent section if you have bottle service, otherwise you will get trampled on the dance floor.", 
    "review_date": "2015-01-06"
  }, 
  "ZGmwGfbDDgnTFnZyOlRxVA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "I'm going to address the elephant in the room here: this club is SUPER Asian.   Now now, I celebrate diversity. In fact, its one of the things that makes the bay area as fantastic as it is. But, this club lacks diversity; as an Asian girl friend of mine said, origin is \"fob central\".... She even refuses to step foot in.  A group of friends and I were down the street at boom boom room when one of them mentioned coming into origin because he wanted a change of scenery... and boy, did we get that. We, group of 6 all not Asian but diverse, walk over and stand in line; immediate turn off. Once in, after $20!, a friend grabs me and whispers \"bruh, we are the minority\".   Literally, a sea of Asian people.... I felt like I was in japan or Vietnam again. I had only been to origin twice (once for the grand opening) and it was somewhat diverse but we literally made a game of it. We, buzzed not drunk yet, scanned the room to find out we were the only non-asians in the club.  Rumor has it that origin is the same owner as the grand, which now makes sense, but not my cup of tea. My friends are about as diverse and eclectic as it comes but we straight up felt like black sheep.  Note: drinks will run you about $10 each and bottle service is about a G.... a little higher than most places in SF without the crowd to justify it.  Aside from the obvious, staff/bartenders were nice and I found out a few friends of mine are gogo dancers... but never, ever again.  I wont fault you on the star rating since you did nothing wrong, but sorry origin, just not my cup of (jasmine) tea.", 
    "review_date": "2015-01-14"
  }, 
  "Ae1atVuqSF8r5QkchacXVg": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Samir K.", 
    "review_text": "I'm not much of a club guy, but this seemed like a pretty standard SF club to me. Seems to be an Asian hotspot. the dance floor is a little small, but the staff is pretty efficient. The line didn't take as long as I thought, but still had to pay 20 dollar cover, even with a bunch of girls. Also a minor complaint- plastic glassware, and no pint glasses. I like to get my doubles in a pint glass so I'm not sipping pure alcohol but that was not possible here", 
    "review_date": "2014-06-22"
  }, 
  "Ma_gwnVShENgTuhHNpAvyQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David C.", 
    "review_text": "The Good: -  jam packed -  fun crowd -  good music if you're looking top 40 / house bangers  The Bad: -  pompous service -  expensive drinks -  moderately small venue -  line wraps around the block by 9.45PM but the club is empty when you finally get in  PROTIP:  This place attracts a good number of Asian people.", 
    "review_date": "2014-06-15"
  }, 
  "l-7EvDtzaTSyQcXFOIzr4Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria S.", 
    "review_text": "Had the worst experience last night! I've never felt so violated and harassed.   The lady security working last night in this club is very disrespectful. I was minding my own business- using the ladies room and all of sudden she barged in my stall and dragged me out twisting my arm. I fell on the floor and was not done doing my business.  I have not done anything wrong or even get in anyone's way.   This was a terrifying experience and I hope that security gets fired!", 
    "review_date": "2014-11-02"
  }, 
  "zDu_wCx09BcbXVj0LOCYdg": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Toni C.", 
    "review_text": "Well it was my birthday, and they wouldn't let 2 of my friends in. Let me just say this: This is not Las Vegas. Enforcing such a strict dress code, especially when you first open your doors, isn't going to get you anywhere fast. So, it was my birthday celebration, and we called ahead to make sure about the dress code.  They said nothing about \"white-bottom\" sneakers being non-dress code compliant. So we go in line, and we see some guy in front of us with \"white-bottom\" sneakers go in ahead of us. Ok, cool, no sweat. The bouncers let that guy in, one more guy with \"white-bottom\" sneakers shouldn't hurt, right? Wroonnnng.  They told one of the guys in our group to step of line because of the white on his shoes. Are you fucking kidding me?! We noted that, \"hey, you just let in someone with these same shoes, wtf.\" And the bouncer responded, \"Oh well, I have something with him.\" The fuck is that supposed to mean. Blatant favoritism? Yeah, I get it, maybe you're friends with that guy. Special exceptions happen, but how do you think that reflects on other customers when you deny them something so small? Who the fuck looks at shoes in a dark club anyways!? It's not like his shoes were grotesque or something the city gutter expelled.  In fact, they were new. They weren't athletic sneakers, or some dorky running sneakers.   The thing that gets me most is that we even called ahead to make sure about the dress code. So the customer service on this end is pretty shitty- despite explaining that it was my birthday and we all came here- for this club- all the way from Newark/Castro Valley.  In my experienced, the people make a place. We all decided to ditch this place and go to Ruby Skye. Because Ruby Skye doesn't treat people like this, and they even gave me earplugs and wished me a happy birthday.   Note to Origin: This is San Francisco. You're leasing this place right next to a produce market. What sense do you have trying to enforce Las Vegas Club standards on us? What sense do you have being so rude to your own customers? If you really want to be successful, I'd take a look at Ruby Skye. They let almost everyone in because they understand good vibes come with good attitude and happy people. Origin, you should change your mannerisms, because the weight of 1 bad review isn't something you'd want on your yelp page- and you just upset about 15 people that night.", 
    "review_date": "2014-06-30"
  }, 
  "vOp_YBC6Hb2-L-4NeT5sGg": {
    "user_rating": 1.0, 
    "user_location": "Chinatown, San Francisco, CA", 
    "user_name": "Julia Q.", 
    "review_text": "There is a reason this place is rated two and a half stars. I almost had my phone stolen last night. The security couldn't find anything and had to let the thief get back into the club again, I just don't feel safe here anymore.   Tip: Girls, pls watch your belongings!!", 
    "review_date": "2014-10-18"
  }, 
  "Ic6Y8b-kqo3XBj0nAwXDgA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Frank L.", 
    "review_text": "Dont really get wut all the hype is cept i guess its the new spot in town. Its crowded as eff in there cept for maybe certain spots like the main lobby and the upstairs.  The dance floor is pretty small tho theres hella ppl bumpin u left n rite. If you wanna be near the crowd, get a table on the dance floor. If you wanna be somewhere a lil more chill than maybe get a table upstairs otherwise the main lounge where u first enter is probably the least crowded.  If ur jus tryna go in line then be prepared to wait or get there mad early...its a long ass line  If you wanted to compare to the grand, id say everythin bout the grand is better...the parking...a lil less crowded...larger venue...easier to get drinks at the bar...smaller line for bathrooms (origin only has one friggin bathroom...even the guys line is long so pray that u never hafta take a dump...not that ud ever wanna take one in a club)  Overall the club is jus aite to me. Its nice but everythin overpriced as usual and they seriously should get another bathroom.", 
    "review_date": "2014-06-17"
  }, 
  "uXPpR4TIgwJv_ywPWCuFBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay G.", 
    "review_text": "The new spot to kick it in SF. Good music mix between hip hop and edm.  They play hip hop till 11 ish then transition into Edm.   Before their grand opening the tables were around $400 now they are around $700 to $1500.   They have a parking garage right across the street so that's easy. And a Sunway right next door for after clubbing eating.   I've had a blast every time we came with our crew. Cheers to many fun nights here in the future!", 
    "review_date": "2014-07-05"
  }, 
  "Ka2VMEwLf_uZuRAxGSRZlg": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mike T.", 
    "review_text": "Went to this Club on Saturday and overall we had a good time however there could be some improvements.   Dropped a lot of money on bottles behind the DJ. The bottle girls are cool but they do a very subpar job of actually pouring drinks and making sure that the guests are taken care of. Also when other people are crowding your table they don't do much about It. As for the crowd everyone knows it's all Asians. I thought this was an exaggeration but sadly it's true there are lots of very fobby Asians at this club.   The positives Nice setup and sound system Fast VIP entrance  Good house music   Negatives No diversity in crowd Lack of AC even in VIP section Lack of customer service for bottle guests", 
    "review_date": "2014-07-27"
  }, 
  "UK_-podnDLO6WCM4C3a58A": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Stephanie N.", 
    "review_text": "I actually had a lot of fun here! I definitely like this place better than the Grand! I came here on a Friday night with a group of friends and luckily, we found a parking spot right across the street! There was no line at all cause we were early so we just pre-gamed before heading in.   I thought the security guards were really friendly! One of them even said \"hope you have a good time\" to me :) The bartenders were also very nice and friendly when my friends and I were buying drinks   The interior was really nice but the dance floor was kind of small. The mingling area has a lot of couches which I like cause if you're dancing in heels all night, it's nice to have a place to sit and rest. It's also not too loud so you can actually hear the conversation you're having with someone.   Music is a mix of EDM and top 40. I wish they'd play more hip hop tho!", 
    "review_date": "2014-06-07"
  }, 
  "lvMF9nlFqlwVqZihKbIw7A": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jorge Y.", 
    "review_text": "I've been to Origin about 5 times since its first grand opening and the club has been a major disappointment. The only reason why I come here is because my girlfriend and her friends do. This is because I have been witness to immense amounts of sketchy behavior that the club owners have perpetrated. The most recent was when I signed up for the Saturday guestlist a day in advance and was told by the Asian bouncer that my name was not on the list. My male friend who signed up next to me also was told his name was not on the list. So therefore we were gyped out of $20 each even though we were at the front of the line 45 min before guestlist closed.  Additionally, the crowd at this place sucks. I'm talking about ratchet people. Twice already dudes I didn't know have wanted to fight me for no reason (probably cause girls they are interested in approach me). One of the times I told the security guard about a guy who keeps talking shit to me and the guard just laughed it off and continued flirting with one of the hired dancers.  The music here is not good. It's the worst combination of EDM and top 40 possible by Djs that don't know how to mix. The drinks are watered down and overpriced. The bathrooms are spilling with urine on every surface and the dance floor is sticky and grimey.  Origin, I am extremely disappointed of your staff for its shady tactics and for management for not doing a better job. Hopefully I will never have to come here again. Stay far away from this place and go to Raven.", 
    "review_date": "2014-07-07"
  }, 
  "GlzEisPTg8oPSGi80iKnXg": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Marttie W.", 
    "review_text": "Just went with friends past Saturday night and find out this is a total low low low class club and those security and employees are either rude or have attitudes. Long line waiting outside and security don't care if people cuts in front of others.  The music is very loud everywhere, you can't even chat with your friends in the lounge area. DJ really sucks because the music had no rhythms. It's the type of go-go dancing.  I don't know about the drinks, but I took a slip of my friend's drink it's so plain. I know this will be my first and last time there. I rather go somewhere else that may cost more but with class.", 
    "review_date": "2014-08-20"
  }, 
  "WKWdht0hmpSKHWvtZ9Syog": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Jack Z.", 
    "review_text": "So my friends and I came here on a Saturday. The first thing I noticed was that the line leading to the door was INCREDIBLY long. We waited for about 30 minutes and still couldn't get in before 10:30 so we paid. I'm not sure if it is everyday but the dresscode was definitely strictly enforced so gentlemen be sure to wear DRESS SHOES nothing with sports logos or casual logos. I guess since it was a saturday it was more packed than usual but it was so full that they started giving out vouchers to the grand so people would leave and allow them to let more people in.   Once we got inside, the interior is definitely very nice and I really liked it. However, the size of the floor is small. It was so packed that people couldn't get onto the dance floor.   Drinks are pretty expensive so I recommend pre gaming at least a little before you go in. Crowd is pretty much 90% asian and probably still in college so keep that in mind.   If you are planning to come to this club be sure to dress to impress and probably consider going on a friday when there is less people. If you are not arriving at least 10 minutes before 10 you probably won't be getting in through the guestlist.", 
    "review_date": "2014-06-06"
  }, 
  "Ssgm3CcDKmI-WM6F-ZSvCg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clifford T.", 
    "review_text": "This place is called the new 'boutique' club in SF. That would be pretty accurate if boutique is short for small and crappy.   The layout might have seemed cool when they were drawing things up but is just impractical - a bunch of randomly placed stairs, too small of a dance floor, wasted 'lounge' space, and bathrooms in the middle of everything.   Go see for yourself but don't say I didn't tell you so. Most importantly, if must go, head over in the next month or so when everyone is talking about it because this place won't be around in 6 months.   I would have given this place a 1-star rating but the drinks weren't too pricey ($6 for a beer) and the bouncers were actually pretty nice. Cover was $20 which was totally not worth it, but this place just opened up so I'm ok with that", 
    "review_date": "2014-05-23"
  }, 
  "LPkXc94_xyRN09d8sXSR7Q": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Christine B.", 
    "review_text": "This is supposed to be the new \"hot\" club in town -- I would just say lukewarm at best.    Here are some things to consider before you come and waste a Saturday night:  Line: the bouncers intentionally hold the line - I got there at ~10 and wasted at least 30-40 minutes in line and paid $20 in cover. If you want to make guest list, I would suggest you get there at 9:15. Based on the novelty of this club, the line will go well down the street.  Dress Code: Dress to impress. DO NOT wear white soled tennis shoes. It's better to not risk it and wear nicer shoes, boys. The bouncers are incredibly inconsistent regarding this policy because my friend got turned away and then I saw a bunch of guys in the club wearing tennis shoes with white soles.   Bouncers/staff: Overall I thought the staff at Origin was pretty lousy. It started off with bouncers hassling my friend for wearing tennis shoes with white soles. I tried to remedy the situation and actually have a conversation with the bouncers -- they blew me off even when I was on the verge of tears. The staff that was supposed to clean up the place really shove their way through, unfortunately. Bartenders make drinks wrong.   Bathrooms: The lines are ridiculous, even for men. It's nice because the women's bathroom has a line and there's a lady there to clean up any trashy barfing action. But really 4 stalls for a club, isn't enough. Also the bathrooms are really in an awkward position underneath the second floor/balcony right before the entrance to the dance floor.   Music: Pure EDM - no hip hop, top 40. If you don't like EDM - stay at home.  Venue:  The venue itself is in Japan town, bordering the Western Addition - which isn't the greatest part of town. The club is oddly designed -- one front lounge/bottle service area, two bars, small dance floor, and an upstairs area with standing room and tables. It felt that they spent more than 50% of their club space to dedicate to high dollar bottle service. But the majority of the tables were empty on a Saturday night -- which is a really bad sign.    Dance Floor: Small. People are especially pushy and the dance floor is surrounded by empty tables. I got stepped on multiple times throughout the night.  They like to blast foam / confetti, which just turns into a giant mess. The lighting on the dance floor is seizure worthy.   Crowd: Asian, enough said.   Drinks: They don't own shot glasses because all your shots and chases come in little plastic cups. You know the kid you drank out of when you were 17 and excited to drink underage at a frat party. Bartenders are medicore and the bars could be better staffed. 2 bars - one in front when you come in which clogs the incoming traffic and then one on the dance floor.   In summary, Origin is well below mediocre and needs much improvement regarding how they manage their line, music, and ambiance. They call themselves a boutique nightclub, but fail to be elite or fashionable.", 
    "review_date": "2014-06-25"
  }, 
  "OVm-rsZF3aKn-DZ-fjxF5w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "amelia g.", 
    "review_text": "I was going to give them an even lower rating but I just found out that the owners of The Grand owned this establishment as well. So now I'm just more disappointed than anything, because I actually like frequenting The Grand. They've always treated me and my group well.   The level of \"service\" here at this establishment however, is definitely not a priority to them. I was in line with my friends from out of town, checking out this new spot for the first time, only to be embarrassed. I understand the guestlist ends at 10:30, most do. But I was let in at exactly at 10:32pm and didn't make the cut, even though I was in line way before the cut off. I had to apologize to my friends because that's just not how you want to start of the night! Then when we got in to use the ATM to get cash, the man at the door was beyond rude. He made me and my friends answer all these questions before giving me my ID back, which I get... but sheesh.. THAT many questions? He even asked me for my driver's license weight. RUDE. But that wasn't even the worst of it. He held my friend's ID above his head, out of her reach and said, you can have it back if you can reach it. WTF!? Maybe it was a joke... but we just stared at him in disbelieft until he just said, \"fine.. here\"  Then at the bar with their overpriced drinks, which is whatever because that is to be expected, they didnt have apple juice!? It wasn't like I was asking for something ridiculous like blueberry soda! This normally wouldnt be a big deal.. but it just kept adding up and I kept feeling bad that I suggested this place to my friends.  Another little tidbit that I feel like they should be aware of is their consistency. In the bathroom, I noticed that the attendant would let some girls into the bathroom together and some she wouldnt. My friend was wearing a jumpsuit and needed help taking it off so I was going in with her but wasn't allowed at first. I had to explain that in front of all these strangers that I had to help her undress to urinate! At least she let me in afterwards....   Sorry for the rant yelpers... but I just feel like there are better places to go in the city and in the Bay Area for that matter. For a new establishment to treat their guests this way is just ludacris. Don't they want business? All I'm saying is.. if you want to impress your friends or if you want to take them out for a good time.. try another place.", 
    "review_date": "2014-07-07"
  }, 
  "22kX05A_TNhMuet3_4qfBw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michele L.", 
    "review_text": "Venue definitely looks nice, but it is very small. It's pretty new, so a lot of people have been checking this place out. Guestlist to get in for free lasts until 10:30, so if you don't want to pay cover, you better come early or else you'll be paying $20 for cover! They definitely hold up the line, too. I went here twice and got lucky to get in for free the first time by barelyyy making it to 1030, but the other time, we didn't show up early enough.   Like I said, place is small so it gets hellaaaaa crowded. There's two floors, but the second floor isn't much -- just a couple of tables and a bar. Dance floor is on the first floor, and it gets so crowded that you can't even move that much. Crowd is also definitely Asian, haha, just sayinnn! Girl bathrooms are clean and there's mirrors along the hallway, which is nice.   I do like the music here, though. A lot of top 40/hip hop/bit of edm. Good mix. I'm not huge on EDM, so that's why I like it here. Bit more of everything. I just dislike how small this place is, because it gets SO crowded. Maybe the hype will die down later.", 
    "review_date": "2014-10-15"
  }, 
  "JHVHE3O4VkI6XXhL7H4uXA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Tristan B.", 
    "review_text": "I went here a couple weeks back and got a table with some of the boys.  This particular occasion was for a girls birthday and so we took her and some of her girlfriends out and chose Origins because it was (is?) the newest place in town.    We show up (just the boys) and their is the classic mile long line of Asians.  Make our way to the VIP line and are at security within 45 seconds max.  Security was kurt but polite and got us in quick.  Enter the club and literally have never seen more of an asian demographic in one establishment in my life (and thats making a statement being that I've grown up in the Bay Area).  Btw NOT SAYING THATS A BAD THING AT ALL!  In fact the girls we were meeting up with were mostly asian anyways...again not a bad thing! Just an observation, and a very accurate one at that.    In case you haven't put it together yet, me and the two guys I was with are white.  Very white.  Also I have to add that I have worked in this club/bar industry so I am aware of the asian population, I'm just simply stating how my first experience is.    So were met by our hostess and she shows us to our table which is basically right to the left of the entrance, one of the tables right in the middle of the lounge area in front of the bar, so we were surrounded by people all night.  Great seating and was very satisfied with the seating.  Hostess brought us our bottles of vodka (girls choice) and a couple buckets of beer to quench our thirst (not to mention the fifth of Jack we cashed on the way in on bart) while we waited for the girls.  The hostess was very tentative and the bartender (asian chick) was very kind and quick w some more shots (Jack....c'mon now, obviously).  Girls FINALLY showed up.  (JK Jane  don't kill me if your reading this).  They ended up showing up with more girls than I expected, exceeding the number of ppl i put down for our table but since they were girls I think security said 'Fuck It', as they usually do in an instance such as this, at least with me its always like that.  Cashed most of the bottles (mostly us guys) and basically had a great night, don't remember the last two hours really but the music was good and dance floor was packed.  DJ mostly played the typical EDM pop hiphop mashup thing, which you should expect at most SF clubs unless they specify that they play serious house or only hip hop.  Giant sea of black hair and even made some new friends in the dance floor.  I just have to say one last time .  Me and my boys were the ONLY WHITE PEOPLE (blonde for that matter) in the club apart from I think all the hostesses, a bartender and maybe a couple of the security.  So if your looking for a club that is very mixed or any other particular race/demographic then go elsewhere.  However I don't think you should go elsewhere cause the place was poppin.  Overall my experience was great, table price was very fair and I will definitely be back very very soon.", 
    "review_date": "2014-08-24"
  }, 
  "4-ONzI4ZwwfqdawKoDEoTw": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Alvin T.", 
    "review_text": "Pretty chill spot. All Asian for the most part, pretty 1:1 ratio like a previous reviewer said. Pretty pretentious for the most part, but saw some cool pretty girls there. Drinks are really pricy and seem kind of shady for the amounts. People at front seem kind of shady as well. A bit unnecessarily expensive overall, but a kind of decent time. Wouldn't go there again on my own, but maybe with friends. 2.5 stars", 
    "review_date": "2014-12-28"
  }, 
  "JfPEau5lI9x_xLi8AQBpXA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miki H.", 
    "review_text": "About a year ago, Origin used to be a different nightclub (Rasselas), yet they seemed to have things under better control than things now.  If the overall class of the crowd of people who come to this club could go any lower, it would blow my mind.  As someone who lives across the street from this god-awful night club, I can tell you that weekends here are a nightmare.  Tons of over served, wasted club goers puking on sidewalks, stumbling out in the street, fighting each other, and yelling excessively? Sorry, but Origin needs to keep it's crowd under control and STOP OVER SERVING!! They literally have to bring buckets of water outside to \"wash\" away everyone's puke.  The bouncers there are total dicks who seem to think they are working at some posh nightclub in LA.  They address their customers with so much disrespect, it's a wonder they ever got jobs there. You work at a nightclub located between a Korean grocery store and nail salon, in Western Addition. GET OVER YOURSELVES! Stop overserving, treat your customers with a little respect and have some responsibility for the amount of bs that goes on here every weekend.", 
    "review_date": "2014-11-22"
  }, 
  "HTNJA0GtPSx0XbOOS7zzjg": {
    "user_rating": 2.0, 
    "user_location": "Garden Grove, CA", 
    "user_name": "Claudyne T.", 
    "review_text": "Oh, Origin. For being a swanky new up and coming club in SF, it does live up to its title. And it's being built up to have a good reputation for the layout and service of it. Everything is brand new, modern, and sleek. The interior design creates a nice ambience similar to Vegas, which I think they were aiming for. However, this is NOT Vegas, so the guards should stop acting like it is.   Before coming to Origin I read up on the reviews of the place. New club, gorgeous, diverse/good music, prices are okay, staff was friendly, especially the guards. That's definitely a plus for any club. If the service was anywhere near fantastic then any business would flourish with a good reputation. That reeled me right in. I thought this club might be different with some good mixed reviews stating the same positive things. However, when I got there, that picture completely shattered.   1. The demographic consisted mainly of Asians this night. There was a group of guys ahead of us that had problems with the bouncers and got pulled out of the line. After a couple of minutes, the guard comes up to us and takes 3 of my guys harassing them outside of the line. Seriously? We were 2 separate groups. The other guys even said they didn't know my friends. One of the guards had the audacity to come up and tell me, \"If you have something to say then step out of line because you won't be getting back in.\" Origin's 15 minutes of fame with me just went out the window. Strike 1, Origin.  2. The club is still brand new, opening just 6 weeks ago. For some reason this meant their website was still being built up. As a business, if you're going to have a grand opening everything should be ready to go. Especially your website where guests can find important information! Like the dress code for instance. The reviews on Yelp said that the dress code was not that strict or there wasn't one that was enforced. Okay, good to know especially if you're a guy. Four of our guy friends could not get in because of their shoes. From the reviews I've read people have went in with sneakers and super casual clothing. I guess they decided to change it for this weekend and NOT inform anyone because their website is \"coming soon\".  There is no honor system here. We informed the guard that there is no dress code information on their website and reviews have said it was not enforced. With a sassy attitude he replied, \"For sure it's on there\". Strike 2, Origin.   3. Someone didn't thoroughly think through the interior design when planning this. One word: tiles. A lot of the flooring has tiles. This is a club. People get drunk. People spill shit on the floor. There are girls in heels. They will slip and fall and if one of them is sober enough to remember...can you say lawsuit? Seriously, I saw 4 girls slip and fall all in the same spot within 30 mins. One poor girl fell so hard that she had to ice her knee the whole night. I hope Origin was able to compensate her with something. Maybe a drink to get her more drunk to forget the whole incident, dodging any legalities, or a lap dance to numb her knee pain. Strike 3, Origin.   In conclusion...this is an unorganized new club with abrasive guards who have no idea what they're doing. Even if the inside is a walking death trap for ladies in heels, it's still gorgeous with a nice ambience. And that is the only reason why I gave it 2 stars.   PS. Did I mention coat check is $5 per item? Yes, per.", 
    "review_date": "2014-06-01"
  }, 
  "UVO0vrdc8Jfm00p7ixuf7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nolan V.", 
    "review_text": "Wow! Gorgeous venue! Purple/blue lights!  Upstairs has the pricier bottle service.  Downstairs have few tables too.  Dance floor is downstairs.   Bar is VERY expensive. Let's say Vegas prices. $15 per drink or something, that's what all my guy friends were telling me.   Had a ton of fun. Bathroom is nicely laid out too.", 
    "review_date": "2014-10-08"
  }, 
  "d1VXeXMq67_QgdvWY1tcKQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark A.", 
    "review_text": "it's basically a smaller version of the grand (same owners) with ruder staff. except the best thing the grand has going for it is its size (plenty of room to dance, can let lots of people in, very easy to get a drink, etc.). nothing terrible, but really doesn't give me a reason to go back, unless i'm in that area.  and while i don't hold it against the club, and i understand the need to snatch up club space when it becomes available, it's a little sad to see this neighborhood further breakaway from its jazz routes. was really hoping rassela's would be replaced with more jazz.", 
    "review_date": "2014-05-21"
  }, 
  "KmqivnDXe3mVjBtp9ZxkOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley H.", 
    "review_text": "Wow it has been years since I wrote a review about a nightclub... Must be because I don't go anymore? But it was new and my friends birthday so why not.  This place is the old rasazales(sp) which was my spot because it played really good live jazz and had a great wine selection...can you see me getting old that i prefer a jazz club over a night club? But still decided to give this place a chance.  The decor is beautiful. It looks like a great new venue. Two stories and the main dancefloor is in the back. I was really impressed. The drinks are $12...for well or grey goose....guess what i was drinking? But really $12 for a drink? I was expecting $9-10 but $12....well that set me back a little bit. So now being older and wiser, with older and wiser friends we decided to get a bottle...because with 5 seasoned alcoholics...a bottle makes more sense economically. upstairs are $300, the ones on the side are $500, and the ones closest the entrance are $1000... We wanted the $300 table but they were sold out...  The music started off really really really good. Lots of old school hip hop...a few \"thats my jam!!!\" came out...then they switched it up to house...i love a little house now and then...but when 3/4 of your crowd stops dancing...its time to go back to hip hop. As a sign of my age...when #selfie came on and those young girls screamed like they just saw Justin Bieber walked in...it took a lot for me not vomit. But i took a deep breathe and realized that i am on their territory. I did my time as a 23 club hopper in short skirts and 4 inche heels, a half a pound of make up and about 2 AMF's deep.   Things I have learned as i get ready to exit my 20's Pay the $20, pre game, and forget the free entry If there are 4+ adults...get a bottle . Its more comfortable to dance all night if you are not wearing sky high stiletos.  This place is actually a lot of fun and i would not mind going back on another night...", 
    "review_date": "2014-05-12"
  }, 
  "ScJC187aYJe8iUwcp-kTww": {
    "user_rating": 3.0, 
    "user_location": "Garden Grove, CA", 
    "user_name": "Ariana M.", 
    "review_text": "Compared to other clubs I've been to in the city (which isn't many), I liked the overall venue here a lot.  However, as it got later into the night, the dance floor was way too crowded, and I felt like a sardine. Needless to say, it was very difficult to dance!  That being said, the bartenders were very nice, and make sure to RSVP for their guest list to get in free before 10:30pm (both guys and gals!) My group decided last minute to get a table and they were able to accommodate us without any issues.   The crowd was mostly Asian, and they played mostly hip hop the whole night.", 
    "review_date": "2014-08-19"
  }, 
  "p8Yjo6D63wkw5Wwr-Mxv6A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fabien R.", 
    "review_text": "I wish I could put a 0 to this club. 1) entrance is $20 2) drinks are overpriced and small. $14 for a AMF that tastes bad tequila and is twice smaller than any other AMF I get for $13 in other clubs in SF. 3) I know bouncers need to be tough, but the guy seemed to be rude and despising. 4) the music is the worst if its kind... Like anyone could be a dj at this place. The dj played the worst kind of rap/rnb there is. 5) it's super crowed at 11:30... You won't even want to go on the dancefloor when you'll see how compact the crowd is (unless you are in Vegas, but in SF you can easily find clubs with room to dance)  I spent 15 minutes and that club and left because of how horrible it is. Worst $35 spent in the night.  Not a negative point, just as a FYI: it's full of Asians. Dress code: collar / suit", 
    "review_date": "2014-09-07"
  }, 
  "fEnMiH-zX-DRzRPGEWrzbw": {
    "user_rating": 1.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Yinan L.", 
    "review_text": "This club is the worst ever. Rude staff and bad crowd. Next time you walk by it say hi to the little asian man who looks like a cia wannabe and his fatass goons guarding the entrance into hell.", 
    "review_date": "2015-01-04"
  }, 
  "kKSdriMwhHVoQkWjcZnwkQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fanny W.", 
    "review_text": "Asian. Vegas of SF (but I've never been to Vegas post 21). $20 cover. Fights. So much EDM, I could cry. Slippery floors upstairs and downstairs leading to the bathrooms. Yes, I've slipped two or three times now. Enough times to get back up and not feel awkward. That's how pros do it. Carrying on. Nice and clean bathrooms (how rare!). Generous seating areas in the lobby. Parking's not hard, but that might just be me - lucky and local.  After several nights out at Origin, one time sober, one time not buzzing enough, several times a mess, it's safe to say the crowd is great but the music...this thing called EDM plays all night and it sounds like noise, noise and more noise. Like I mentioned in my TIP, this is not EDC. As for Asian boys with spiked hair? I haven't really noticed. But Asian guys with the comb over look or new mainstream hipster cut, they're around. The older guys dress nicer, the younger guys dress more casual (IMO). Bartenders are fast with the drinks, but we all know shots are the way to go.  I am absolutely a fan of the interior and the vibe this place is going for, but I think they might need to work on those lines and how they decide to charge. We rolled in here at 1AM and they still held up the $20 cover. No comment on the security guards so far. 6 shots in 45 minutes. Holding onto our youth! If you've never been, it's worth checking out. Fingers crossed for hip-hop the next time I visit!", 
    "review_date": "2014-10-23"
  }, 
  "xie4mBJQr78_eRSENLXNkg": {
    "user_rating": 2.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Debbie C.", 
    "review_text": "I arrived around 12pm. Since I'm on the VIP list, so I don't really care. They do a quick ID check and let you in. There is a $5 coat check. The VIP floor was super slippery and the vip on the lower floor was so cramp! Don't even bother to pay for VIP because there's a lot of people just slide under the rail, it's not like the security guards care anyway. The DJ played EDM the whole night -__-  it felt like a rave instead of a nightclub. But the Dj was cool for letting my friends and I to dance on top of the speakers.But I have to say tho, there ladies restroom was so clean and nice. Most of the clubs have nasty restrooms.   Oh,street parking is available or you might be able to find a nearby parking garage. But if you do park in the garage, make sure to read when it closes. My friend park at the garage and she couldn't get her car til the next day because the garage is closes at midnight.", 
    "review_date": "2014-08-05"
  }, 
  "MKqv8jfab89t4KK-SAECSw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristi T.", 
    "review_text": "I'm not too sure why this place has such low ratings. My friend and I went on a Friday night and had an absolute blast!  We arrived around 10pm. We had put ourselves on the guestlist, but weren't sure if we were actually on since we never received a confirmation email. They do a quick ID and bag check, see if your name is on the list, and in you go. There is a $5 locker option. No re-entry even if you got in earlier with a stamp. Makes sense since the club got pretty crowded around midnight. Drinks/shots are about $10-$15. Typical prices in the city. The bartenders are extremely nice! They definitely deserve a nice, big tip.   There are multiple lit mirrors leading into the women's restroom. The dance floor was spacious and there was plenty of seating area if you got tired. My friend and I went upstairs at some point to rest and observe others.  All in all, great club that I would definitely return to. Definitely is majority Asian, but the Asian guys were FINE! Street parking is available or you might be able to find a nearby parking garage.", 
    "review_date": "2014-08-02"
  }, 
  "4GZJpiiPJmCu-5PWlc1YSQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathy Z.", 
    "review_text": "This is my first low rating on Yelp, I wish I could go negative.  My review is just about the beginning of the night..while waiting in line to get into Origin, one of the African Amercian bouncers sporting glasses told a friend to \"fix her face\" because she didn't hear him the first time he was telling the crowd to move the line closer to the wall.  When she understandably said \"excuse me?\", he became very aggressive and had a disgusting attitude, saying that he was telling her to \"fix her face because you need to fix your attitude\", further going on to say that he is being absolutely sincere because he is smiling at her. The entire crowd was shocked at this point, but of course no one does anything because people don't stand up for strangers these days.  You do NOT tell ANYONE that his/her face is messed up, especially for such a small offense. This angered me so, that a little bit of power can turn a guy into an asshole and misogynist.   He has NO respect for girls, telling all the girls who stood up for my friend that they can leave if they weren't okay with what he said.   There was no apology and in fact, he became ruder and ruder the more support she got.   I refuse to support a nightclub or business that allows this type of OFFENSIVE, IMMATURE, LOATHING man to mistreat guests and disrespect people in this way without remorse or apology. I am never coming back here, and would tell my friends the same. It doesn't matter how nice the club may be on the interior or what kind of company it attracts if its bouncers are ABSOLUTE SCUM and willing to hurt others for their own ego.  Never got a chance to go in, don't care.  One of my other friends, a guy, also got his face destroyed by the bouncers here. He was pinned down while his face was being smashed by another bouncer. What the hell kind of place is this? Do the owners even care?", 
    "review_date": "2014-07-27"
  }, 
  "dZYc2mD4nGGGCeY41HMDYw": {
    "user_rating": 1.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Nathan C.", 
    "review_text": "What can I say? Rude ppl. Rude DJ. nicest person was the bouncer in the bathroom. Peace.", 
    "review_date": "2014-10-04"
  }, 
  "VhPfxOvySbtuZeBO-JheeA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa H.", 
    "review_text": "I really don't know what the hype is all about. The line is ridiculously long, like ridiculouslyyyyy long.  Today,  7/12/14,  the line was about a block and half long... Arrived before 10, cut some friends in line and still couldn't get in before guest list closed. Also, pretty pathetic but, it was a $20 cover for some god awful repetitive 2000 and late music..  Don't get me wrong, I love edm. But it was sounded like it was off of someones itunes most played list. Let's just say, everyone knew every word to every song. -____- and the dj? Never even saw anyone on the stage..   The club itself is okay. It is a pretty decent size club with two floors and a small lounge and small dance area.  But the owner better be prepared to get his club shut down. The amount of people inside far exceeds the capacity limit. There is absolutely no room to walk, dance, move and barely enough room for you to turn around. I hear this is the \"it\" club but I have no idea why. This place is full of ratchet activities and everyone comes out drunk either with throw up on their clothes or are laying on the sidewalk because they're too drunk to walk. The crowd was really disappointing despite the fact that we're all asian... But really, no f**** given. They push and shove and there's no apologies....    There are so many other options for a night out in the city, even if you have nothing else to go do, don't bother coming here.", 
    "review_date": "2014-07-13"
  }, 
  "pRrfEXsV1WK-a3kv_JfMQg": {
    "user_rating": 2.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Milton F.", 
    "review_text": "I've been to Origins twice now and what can I say about this place that has not already been said? I've been a club goer in SF since the early 2000's (Yea I'm old). It's been a while since I've been clubbing on a weekly basis so I don't know any of the newer clubs that have been around since 2008. A buddy of mine suggested I throw a joint bday here this year with our mutual friend, so I agreed. There was probably about 20 of us and we decided to get a few bottles upstairs.   Note that this was before the grand opening, so we showed up around 10:10pm and got in with guestlist. People started showing up later on and it got pretty crowded, but honestly I was pretty drunk and did not remember too much. I just remembered there being a lot of Asians and young ones at that. The table upstairs was located on a walkway, so we had a lot of people trying to walk by which was annoying. Bottles cost anywhere from $350-$500 for the normal stuff (Jameson, Fireball, Greygoose, etc). The nice part is the bottles are pretty big. The Grey Goose bottle was Costco sized.  My second time to Origin was also for a bday party. This time it was the grand opening and by 10pm the line was down the block. Luckily, we had bottle service again so we walked right in. Even though the line was outrageous, the club itself was completely empty. They were obviously holding the line so people would have to fork up cover. Our table this time was by the dance floor, which was horrible. The space was tiny and fits 6-8 comfortably but we had about triple the amount of people. I was sober enough this time to speculate the crowd and music. They play a lot of EDM and some hiphop. There were a lot of guys looking like they wanted to start trouble and girls pushing their way through the crowds. It was VERY crowded and a lot of the club goers were just rude.   With that said, the club itself is very nice. They try to make it like a Vegas club, having foam come down from the ceiling and the wide array of disco lights. They claim to keep up classy by making guys dress in collared shirts, no sneakers, baseball caps... but it doesn't really seem to do the trick as the crowd is far from classy. Drinks are pricey as expected. I have not been back since and did not plan to until this weekend since I have another bday to go to. I'm kind of dreading it already...  2 stars mainly because of the crowd and the fact that they hold up the line so no one gets in free unless you get there at 9. Drinks are overpriced. Nice club atmosphere, but not enough to make me want to go back.", 
    "review_date": "2014-08-28"
  }, 
  "JwG9ZkBKEwnBupWd2TOzmw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A D.", 
    "review_text": "Too crowded, there was no room to dance.  The floor upstairs is VERY slippery.  Horrible music. Homogeneous crowd, I felt like I had stepped into an Asian club.   I won't be returning.", 
    "review_date": "2014-07-31"
  }, 
  "EFbo9h4pzuoDkJG8xJcEQg": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Tina K.", 
    "review_text": "I personally really like this club. I've gone to this club already twice and anticipating on coming here again!   I've had a ton of fun. It's kind of an Asian fest here though with really short little men.   The drinks are expensive and just ridiculous. But, go upstairs to avoid the busy crowd downstairs. Parking is also really convenient too.", 
    "review_date": "2014-09-14"
  }, 
  "UyhnjAlyMXtbR-qB5kkhlQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean Y.", 
    "review_text": "Based on a single night at Origin, I thought the space was promising, but some things could be done to improve the experience.  Things that stood out to me:  * WAY too bright. If I can see the facial expressions of people at the other end of the room, the lights need to be dimmed.  * The music was garbage. Heavy focus on top 40s and overplayed hits, some rather outdated. \"Call Me Maybe\"... so 2012. \"Levels\" may have been the best song played all night.  * The female servers were all very attractive and very exposed in their Playboyesque outfits (fishnets, black leotards, and black bunny ears). However, at least one of them had a serious attitude problem. Our server seemed irritated all night. She shoved past people rather than asking them to step aside. She bumped into my friend and caused him to spill his drink all over my foot either. She either didn't notice or didn't care and definetely didn't apologize.  * The table area was not regulated at all. It was only elevated half a foot above the dance floor, so it was really easy for people to duck under the railing and climb up. Great if you want more friends to join. Bad if you don't want randos encroaching on your space.   * Nobody controlling who danced on the podiums by the DJ. No one wants to watch creepy underdressed guys getting all handsy with girls or girls in super loose rompers shake their asses. At least no one I know. Letting guys sit on the podium doesn't make the club look bumping either. IMHO, save it for club-employed dancers.  * Dress code not enforced. A lot of people were in sneakers, T-shirts, and daytime clothing.   * The foam was gross.   * The confetti kept falling into the carafes at the table.  * The floor in the hallways and at the table areas was covered in small bumpy tiles. Very uncomfortable under heels.", 
    "review_date": "2014-05-12"
  }, 
  "URWpOVK9fAmpQvntMa9LOQ": {
    "user_rating": 3.0, 
    "user_location": "Durham, NC", 
    "user_name": "Christina L.", 
    "review_text": "1. Get in before 10:30pm if you want to make the guest list. 2. Go-go dancers can't dance. They're best at bringing out sparklers and drinks to the VIP tables, but even that's not very exciting - the sparklers are more entertaining than the so-called \"dancers.\" 3. Venue looks great! There are 3 main areas with a bar in each. Upstairs overlooks both the dance floor as well as the entrance. It's also where the VIP tables are at, but seems like anybody can go up there. 4. Bathroom stalls are arranged in an oddly cramped fashion, but they're kept very clean. Plus, the waiting area for the bathroom is full of mirrors and lights that make it look Hollywood-esque. 5. Crowd: ASIAN. Mind as well call this the Asian club.", 
    "review_date": "2014-12-29"
  }, 
  "uCHi-qeQXR4lYyCFPWQdZw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Keith C.", 
    "review_text": "Surprisingly alright for a nightclub, but maybe that's just 'cause our party happened to get a table... personally I'm not a huge fan of going out clubbing, but I've been to Temple, The Grand, etc. around SF.  Origin felt pretty similar to The Grand (I've heard they're owned by the same people?) full of asians, EDM music, expensive drinks... but overall it seemed alright.   Table service was awesome (and expensive of course).  Our waitress would come by and take away our used glasses and pour us our next round of shots constantly, and even though we had too many people, the bouncer let pretty much everyone in our party up to the table that night.    I'm still not a huge fan of clubbing, but this place is alright and I'd probably come back again if we got a table.", 
    "review_date": "2015-01-12"
  }, 
  "31d4d1tVHxT_8LfPvGlzYQ": {
    "user_rating": 5.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Nic C.", 
    "review_text": "New Nightclub in The City.  Real Nice.  Spacious and Big.  You can tell alot of money was put into the remodeling of this building.  Everything is new, the floors, chairs.  Ambiance was good.  Located in the Fillmore District.  Parking garage is around the corner.  VIP tables are in abundance, your area is spacious, not cramped in.  VIP section upstairs and downstairs.  There are 3 bars in here.  The dance floor is big, there is also a bar on the floor.  Soft opening was last night, so there are a few kinks that need to be worked out.  But I do see this as a happening club in the Bay Area.  Bathrooms are up to date.   The music selection was good, normal club music: Top 40, Rap/Hip Hop, EDM.  Sound system was good.  I would definitely recommend and visit.", 
    "review_date": "2014-04-18"
  }, 
  "BbBzub67X5sAHHTEtk2GAA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "It's true. You've probably heard from your friends already. Don't get here past 9:45. The line is crazy (as the venue is crazy small). I'm really hoping the hype/line dies down after it's not the 'new-kid-on-the-block' anymore.  I've never ever left the house while it was still light out for a club. LOL. Left the house around 8:45 (to be safe and make it before 9:30). Needless to stay, I was really early there are other bars you can hit up and pregame before heading here though.  Line was set up and 9:30 and the line grows crazy fast after that. Their online guestlist is a little wonky. I signed up and didn't get an email confirmation (I doublechecked it was the right date and everything!). The bouncer wasn't gonna let me in, but it was still so early (9:45) and I was one of the very few girls lining up so early, so he gave us a ticket. Talked to a few other people and they ran into the same issue. Fix your damn site! Woulda been stupid if we had to pay to get in even though we signed up and it was before 10.  THIS CLUB IS THE MOST ASIAN CLUB I'VE EVER BEEN TO. It's a pro or con depending on what you prefer but there was seriously ZERO diversity, it was mind-boggling. Drinks are $12 each. They are fast though and there isn't really a line for the bar.  I like the half lounge, half club set up. Plenty of seating for the old and tired. The dance floor is small as EFF- literally packed like sardines. Sweaty.  Overall as a club I like this place because 1) there's plenty of seating, 2) bathroom line wasn't ridiculous and kept clean (and lighted)!, 3) it's really pretty inside, 4) they had good music (mostly EDM), 5) their security was on point. I saw three people getting kicked out and I left at 1 AM.  **If you're a noob to the city don't park towards the Western Addition side, it gets sketch within like 3 blocks of here. There IS a parking lot a Japantown like 2-3 blocks away, though it's far for a girl in heels, it's better to not deal with sketchiness at the end of your night. OR BETTER YET, call a taxi.", 
    "review_date": "2014-07-08"
  }, 
  "40yLxxoCJo-Sci83gvGGvQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah T.", 
    "review_text": "I love EDM and had hella fun at the Grand the one time I went there which was why I dragged all my girlfriends out on a Friday night to check Origin out.  To be fair, Origin is really nice. The interior is new and they have a ton of couches for you to lounge around and hang out in. The dancefloor is also pretty big and the servers are nice, the drinks are really good and the security guards were awesome and friendly.   The crowd though was awful which kind of ruined the night. Tons of weirdo fobby guys who are really awkward and creepily dance on you when your back is turned. Tons of (okay, I exaggerate) weirdo white guys who are desperate and really terrible at small talk. And tons of drunk girls who are pushy and flail and elbow their way around the dance floor. Overall even though the music was okay, I didn't have any fun. :(   Is it too much to ask to want to party with non creepy people who actually love music/dancing and are out to have fun? Apparently at Origin it is.", 
    "review_date": "2015-01-19"
  }, 
  "xHIIy7ECkEhF_u05opKKAg": {
    "user_rating": 1.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jon L.", 
    "review_text": "1. This place intentionally holds the guest list line (got there at 9:15 and could not make guest list. The line moved EXTREMELY slow) I do not recommend patronizing a business with this type of practice. This should be more than enough to NOT spend hard earned money here.   2. I was there with two friends and we happen to be in between two groups of large groups of guys in line. The bouncer pulled everyone out of line and said there was too many guys. We were with neither group and still got forcibly removed. Again I do not recommend patronizing a place with this type of shady business practices.   Overall recommendation: OVER RATED AND NOT WORTH IT.", 
    "review_date": "2014-06-08"
  }, 
  "yeHwHdDcTtTDMbv79_OXfQ": {
    "user_rating": 1.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Eric A.", 
    "review_text": "All I have to say is that even if you get there at 9:30 for the guest list free entry, they will hold the line until 10:30 so you end up paying 20 bucks. Shady stuff...", 
    "review_date": "2014-07-13"
  }, 
  "XeWHIlbSLndm6tqyMnZG_A": {
    "user_rating": 3.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Eric C.", 
    "review_text": "It's like I never left UCI", 
    "review_date": "2015-01-22"
  }, 
  "bBRPy8zUvNc0NGbGmkjrZg": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jan P.", 
    "review_text": "This is a new swanky club in SF! I don't see why reviewers are giving such low ratings on this place. I think this place deserves a 3 star. I arrived by midnight to avoid the lines (yes, there's a cover charge for $20 a person). As you walk in, there are fancy furniture and couches to chill/socialize with friends over a martini.   They make their drinks pretty strong, just the way I like 'em! The music totally hits the spot... EDM &amp; top hip hop songs! I felt like I am in a rave, at the same time in the club.   There's a second story where you can see people dancing on the first floor with cool light strobes across the room with fogs and bubbles bursting in the air. Pretty fun.   The bathroom lines are insane. There was an incident where my friend left the bathroom and this drunk Asian dude just pushed him for no apparent reason and next thing you know he wanted to start a fight. I broke them off to prevent more conflicts then the security guard kicked out my friend out of the club (wtf??). We explained what happened and then he apologize for kicking him out when it wasn't his fault The guard was nice and apologetic, though.   Overall, good club despite of what happened near the end.", 
    "review_date": "2014-07-16"
  }, 
  "SPc-Xgt4S9ZMm5Rnk-qEvg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David B.", 
    "review_text": "I've got to hand it to the owners of The Grand, they know what asians love.  They've taken the same concept, faux-Vegas, complete with ridiculous bouncers and overpriced drinks, and injected some botox into The Grand's aging street cred, because it's heading the way of Temple and Slide.    So put on your vegas clothes and head straight into the western addition (lol), where you'll be able to buy AMF's and dance to generic EDM until 2am.   Who wants to take bets on where the next hottest club is going to be?  Tenderloin?", 
    "review_date": "2014-07-06"
  }, 
  "pX0kmrKJSD8Rj9YxbMgdwg": {
    "user_rating": 1.0, 
    "user_location": "Serramonte, CA", 
    "user_name": "Melissa T.", 
    "review_text": "Good music. Asian persuasion.", 
    "review_date": "2014-11-16"
  }, 
  "WxxIai_66B_hriV24UTDbA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Acdc L.", 
    "review_text": "Best place to party at if you like to party  Hella asian people  Loud rap dance music Hella lights and sparkly things  Lots of alcohol Great dance floor Hella more lights Hella more Asian people  Glass everything Party themed atmosphere  Drinks are free if your drinking cheap I've been here and partied and got it off my check list    go to if you like nightclubin in SF", 
    "review_date": "2015-01-14"
  }, 
  "wHKKrMLePVASxx6V3iDRVQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "David C.", 
    "review_text": "You know there are way too many guys in the club, when the male bathroom line is twice as long as the female bathroom line.         The girls were wearing their Vegas \"butt dresses\" and the every other Asian guy looked the same with their black dress shirt and gelled spiky hair, me included.  Actually I lied,  I was rocking the Ryan Gosling side part, but so were many others. Originality Fail!   It was my first time here on 10/18. The venue is small and it gets pretty crowded pretty quickly.  The DJ was okay.  The group was entirely Asian.     This place is exactly what you expect it to be.  You will not be blown away or be disappointed.  It delivers the typical SF clubbing experience. Go once at the least. Go with a friend.  If you meet a girl or a guy, remember to tell them you never go out and someone dragged you out for a birthday. #thegame", 
    "review_date": "2014-10-20"
  }, 
  "fCpniKsfDPBjKagpCGHMZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy N.", 
    "review_text": "Had a great time at opening night. Love the layout, music (mix of top 40s, rap/hip hop, EDM), and the ambiance. Bartenders were fast and drinks were decently strong. Hopefully it will remain that way. One recommendation is to take out the foam machine! White foam on dark Asian hair just looks like massive dandruff.", 
    "review_date": "2014-04-18"
  }, 
  "lY-syfurx6QF8iXr1C3RHg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine C.", 
    "review_text": "This club is OKAY.   Easy to get drinks. There's two bars (one located right when you get in and one next to the dance floor)  Pretty fast with the bathroom lines. There's full length mirrors while lining up :)  Majority of the people there were Asian and around the same age (?)  There are actually couches and places to sit!   The music that night was pretty good. All I heard was EDM that night :P  HOWEVER... LONG line to get inside the club! I came at 10:00 and there was a super long line already. I thought less people would be here that night (6/21) because it was EDC weekend haha. The line also moves REALLY slow too! Oh yeah. I was standing in line when a bouncer was offering free tickets/vouchers to get in The Grand (another nightclub in sf) for free.   SUPER small dance floor. Either there was A LOT OF PEOPLE that night or it was the small dance floor. Yeah... it was the dance floor. I could barely dance, yet alone stand without people trying to get through.   Oh yeah... IT IS WAY TOOOOOO BRIGHT IN THERE!! :(  Overall, okay experience and would come earlier next time! I would rather get in through guestlist and stand inside an empty club to wait for people to get in than pay $20 and stand outside in the cold.", 
    "review_date": "2014-06-22"
  }, 
  "Ar2aFhvx5pG1Gmzm7uZ59Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becca T.", 
    "review_text": "Just. No. No no no. You'd think after running The Grand, they'd have learned a thing or two.  Went to Origin for the second time on a Saturday night and got in line at 9:20 to make the 10:30 guestlist. Nope. Was still standing in a ridiculously slow and long line at 10:30, and at 11:30, my friends and I were told the club was at capacity. We were at the front of the line, but there was still a huge line behind us.  Yup, stood in line for 2 hours to get into a club (and didn't get in). Never had any club experience like this anywhere.  Either you need to let people in at an appropriate time or make sure people make the guestlist.  If you're gonna make people wait in line and pay a $20 cover I hope it's worth it. For a club with mediocre DJs, poor service, and awful management, the cover and intentionally slow-moving line are ridiculous. And free tickets to The Grand if we don't make capacity? PLEASE, girlfriend. Needless to say, by that point, Origin was clearly not worth the wait or the cover. Headed to Bootie instead, where it is always a hit, even with a $15 cover.  Only giving this place 2 stars because the first time I went I had such a fun night. The EDM was alright, drinks were alright, atmosphere was great.  Really had nothing to complain about other than the ridiculous cover. It was a Friday night, the line to get in took a few minutes and the place wasn't too packed.  Unfortunately, it really doesn't make up for anything.  Tip: if you really need to see what the (over)hype is about, get there before 9:20 on a Saturday or go on a Friday.", 
    "review_date": "2014-07-13"
  }, 
  "H33RofPs39Qa01MrmfIDZQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Foodie D.", 
    "review_text": "tiny dance floor  overpriced drinks  rude bouncers  long line to an empty club.   that's cute but people will catch on soon!!  It's in the middle of western addition charging vegas prices.  Are you serious??  I've gone once and never again!!!  Once is enough for me!", 
    "review_date": "2014-06-16"
  }, 
  "pvi_baolWn7mrtcb9rWAEw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joyce L.", 
    "review_text": "Truth: I struggle with 'clubs' that try to merchandise exclusivity with guest lists, table/ bottle service w/ four-figure starting price and servers in leotards... especially when you're standing in Western Addition, San Francisco.  Yes, that is indeed a very personal statement but if there is one silver lining, I'd say Origin's bouncers are polite and considerate. Other than that, I am so not target audience for this place and it'll be a miracle for me to come back (Mighty, Monarch and Public Works are top of mind if I want to dance).  In conclusion;  If you consider 'clubbing' as paying $20 cover to dance to Top 40 remixes, this place is for you.  If you like dance floors surrounded by a balcony full of men starring down at you, perhaps seeking their next prey, this place is for you.  If you like being told a table is $1,000 (which is maybe ok in LV or Miami) - and only find out that you can get a table for substantially less once inside - this place is for you.  If you like your shots of vodka to come with two ice cubes - this place is for you (and kudos have better shot handling skills than me, my throat just don't swallow with chunks of ice while doing shots).  If you have good enough balance to not fall ass up on wet fake stone tile floors, while rocking 4in Malonos, then this place is for you.  If you like being surrounded by a barely-old-enough-to-drink crowd dry humping like they have no where else to take it to 3rd base, this place is for you.", 
    "review_date": "2014-06-01"
  }, 
  "kK0QDyfeSwcZl4gGilnW7w": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Amy H.", 
    "review_text": "Alright. I have been wanting to go here so I can write a review haha. What I do for Yelp. I just like writing a thorough review because I hate searching through incomplete ones. Here is what you have to know.  Guestlist You can guestlist online on their website and get in for free before 10:30pm. I got there around 10:15pm and there was already a huge line of cheap asians and I knew we werent gonna get it. My friend got there a bit before 10 and was able to get in but the line was not moving. It was amazing how after 10:30 the line started to pick up again...well it is $20 for cover and luckily I had some cash. If you dont, well it looks like you are buying someone drinks at the bar to make up for it. So if you really want to get in for free, be in line at 10. If you know you are coming later, might as well show up like a cool person at midnight.  Parking Parking is pretty tough around Japantown. As you drive toward the area, it actually gets pretty ghetto. We parked a few streets down because anything closer, we would be circling for days. Since I get there \"early\" parking wasnt that bad but if you wearing them heels, hope you work them.  Attire Girls dress up here. It is like the Grand and you will see girls in tight dresses and heels and full on hair and makeup. Man brings me back to me younger years haha. Guys all dress the same and I bet they enforce the no sneaker whatever policy. It gets hot in there when you dance so dress skimpy I suppose. They have a coat check and I believe it is free. If not, well pay for it or have fun holding it.  Crowd Yes the crowd is practically all Asian. I am totally fine with that haha. Actually all the dudes look the same. The classic spiky hair tall face. I did feel like a grandma since they seem like they just turned 21. I swear if you are a girl and is older than 25, you will feel like a massive cougar and you shouldnt be here. Luckily I am 24 and I am still hip with it and can hang with these kids. No but seriously, dont come here if you already feel oldl. The dudes look young and are probably older but I saw so many young scrawny faces haha  Music Ok so I got in around 10:45 and I had a good 45 minutes of pure awesome legit ass music. They were playing my hip hop with Lil Jon and Chris Brown Loyal. Man I was soooo damn happy I couldnt believe this place was doing it for me. I knew that it would play edm so this was a pleasant surprise. Then when 11:30 came on, my face died and it was edm the rest of the night. A few rare times they remixed a song I knew but the night of music could not be salvaged. It is ok, it was time for me to go home anyway haha.  Club So it is pretty small in here. I expected it to be bigger but I guess the smaller it is, the better so it looks packed and poppin. When you enter, there is a bar with tables but most of the time they are empty since no one gets service. I ended up sitting here throughout the night and if they kicked me out, I sat right back in cuz grandma was tired. There is another small bar on the right of the dance floor. The floor is small and you will see a repeat of the dudes. You can go upstairs where there are more tables and a bar. You will also see a line of creeper dudes looking down and spying on their prey. Overall the place looks nice and it is just fun to dress up and have fun. People dont creep here as much I dont believe so that's cool. Im not sure if I would come back since I just wanted to experience it.", 
    "review_date": "2014-10-18"
  }, 
  "3cnIyELXdZa9C9nFH5NXtg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veasna H.", 
    "review_text": "I went to their soft opening a little over a month ago and a couple \"Special Prevew\" events that last few weeks and I think the place is pretty solid.  Haven't had line issues, which is always a plus for any club, although I hear that the line can be long, but I've been getting in late on bottle service.  I like the layout a lot, it flows well.  When you first come it, it feels like a lounge.  A bar awaits you to the right as you walk in and there are couches set up to the left.  If you want to just hangout and enjoy the bar, you can do that hear.  Upstairs is table service.  In the middle there is a hallway that takes you the back room, where the action is.    The dance floor is a decent sized in an open space so it feels roomy, unlike other clubs in SF. VIP tables surround the dance floor with one bar the left.  A large LED screen is directly in front of you over the DJ.  The sound system is good, and they have lights, lasers, confetti drops, foam drops, the works...  Music is top 40, so not too EDM heavy, and not too Gangsta, just right.   Bottle service is always fun and honestly they do it right here, well other than the high bottle prices...even for SF standards, over $800 for 2 bottles of Jameson, liter size.    It is the HOT SPOT right now and its been pretty packed.  Hopefully they can maintain this buzz until the actually really open! haha", 
    "review_date": "2014-05-30"
  }, 
  "zLiMsSMhcr_lVXdmDy7_NA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Carena N.", 
    "review_text": "Can you NOT play Thiiis Is How We Doooo It three times in the span of 1.5 hours PUHHHHHLEASE?!  I mean Montell Jordan is cool and all, and I'm down for this song ONE time, but not THREE times.  I almost wanted to step up there and DJ myself.  DJ RENA, nom' 'tom 'bout.  Haha, kidding.  No, but really, come on now, I know the first two hours you played hip hop, but you gotttttttttttta have more on your playlist than that.  JAYSUS... let's get some diversity up in here.  Speaking of diversity, don't expect to see anything but aZns everywhere.  95% of the club was all Asians.  v^o^v  I had a decently good time here.  We easily found street parking further down Fillmore, so parking was a breeze.  Yay for easy parking! The bouncers were friendly, I got in line at 10:05/10:10 PM on a Saturday night and the line moved pretty quickly.  Made it in time for the free guestlist no problem.  Yay for no cover!  Walked in and was impressed by the venue.  Not MAJORLY Vegas-y, but better than the Grand.  Yay for pretty!  Plenty of seating in the first room throughout the whole night.  Yay for not having to stand/dance the whole time and having a place to sit!  So I guess why 3 and not 4/5 stars?  The music selection.  The DJ could've done a way better job with his first two hours of hip hop.  The last half of the night was all EDM and he played bangers.  I'm cool with that.  Aside from the music, there are some THIRSTY AF dudes here.  This group of guys proclaimed my best friend and I as their wives within the first 5 minutes of talking to them, were overly persistent and insistent on taking us out on dates, and kept aggressively trying to pull us over to dance with them.  No, means no sir.  Dudes, please take no for an answer.  Thank you for the flattery, but I just want to have fun with mahhh girlfriends without being badgered.", 
    "review_date": "2014-12-15"
  }, 
  "jVm2pVdvcp6VcNK4Mu7_zg": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Michael F.", 
    "review_text": "Why is this place more popular than The Grand nowadays?  It's probably 2-3 times smaller, and nothing special at all. I don't even like The Grand but at least it has space...This club is tiny and overcrowded. Theres no where to even stand at if you don't have a table.", 
    "review_date": "2014-10-14"
  }, 
  "-izWrQAWYQ5LJbRMhnWNIg": {
    "user_rating": 1.0, 
    "user_location": "Colma, CA", 
    "user_name": "Loren H.", 
    "review_text": "My friend had a party set for this weekend, but the ownership decided to bump all reservation this weekend in favor of a corporate party.  BS!  So be forewarned that you could be screwed over too.", 
    "review_date": "2014-12-12"
  }, 
  "Axb1N61w703gNeaKsKNUZA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miri L.", 
    "review_text": "It was my first time here and I did have fun. The only thing I'm concern is my health. The security that works here are super violent. I don't get why do you need to rush and stick out your elbow for? Like they were doing it on purpose. You can say excuse me or try to walk through but you don't need to hit someone hard to get through. No one wants to go to a club and end up with bruises by the security guard here. Now I see why this club has the worst star ratings. The owner hires the worst ppl to work here. I been to The Grand and is own by the same owner. I never had to worry about being hit by the security peeps there. I been to Infusion, Temple, Sloanes and etc. This is far the worst club I ever been too. My first time here and my last time as well.", 
    "review_date": "2015-01-13"
  }, 
  "VB2FbK8dq9Poz-ZPGXgmeg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "ED L.", 
    "review_text": "Origin is a pretty nice place to go in San Francisco.  It's new, has a good sound system, and it seems a little more spacious compared to other SF clubs and lounges.  It looks hip, as the bar is nicely decorated with ambiance lights, while the stage nicely flashes with LED lights as it's sink'd with the rhythm. I like the set up, and the ambiance of the place. There is a second level with a bar and tables for table service, and the entrance area also consist of a bar with a small seating area with nice couches and table service.  The bad part is the ratio is really bad.  I believe there's probably seven guys for every one gal.  OMG.  So, if you're a gal seeking attention, and want to meet a ton of guys with testosterone raging, then you have come to the right place.  If you're a girl, you will feel on top of the world here... regardless of your size and physique.    The music started off a bit slow in the beginning.  It was hip hop and lounge music... which is fine.  Then the EDM stuff starts off at around midnight just when everybody is drunk.  The good thing good about Origin is the music stops at 2am, compared to other places that stops at 1:30am.  As usual, you will see a bunch of knuckle heads, and angry drunks as the night progresses. Boys will be boys pretending to be on top of the world, and girls pretending to be beauty queens will seek all the attention they can get.   What a comic strip!   Anyhow, the bartenders are nice along with the cocktail waitresses.  I usually tip according to their professionalism.  Yup, I guess I must have tipped quite a bit that night. Yes, I was light headed too.  The shots are about $10-12 each, and the cocktails is around $14.  Yes, some of the security guards have power trips.  But I learn to just ignore them and do whatever they say with a smile. They'll see that you're a nicer person and maybe you'll get in quicker.  No guest list necessary!  I feel for them and their jobs because of all the knuckle heads.  Origin is a nice place.  I don't mind checking it out again. Be cool, and be yourself to make the experience more enjoyable.", 
    "review_date": "2014-08-02"
  }, 
  "cqKMpi-j32YJ-bvBsbjJVw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tiffany T.", 
    "review_text": "So my friends and I got table service here this past weekend and we spent ~$700 on bottles. When we got our receipt, it showed a total of ~$1300...so of course we asked for the itemized receipt. Turns out they switched our silver patron bottle with some other fancier patron. We had to argue for awhile before they went back and checked our table for what we actually ordered. Not sure if this was an intentional mix up to trick drunk patrons or if it was an honest $600 mistake...but either way it seems pretty irresponsible and unacceptable to me. Especially with the hard time they were giving us about getting an itemized receipt, and then arguing with us about what we ordered.  I guess the take away is to make sure if you get table service, that even in your drunk state, be careful what you sign at the end of the night because mistakes do happen.", 
    "review_date": "2014-07-28"
  }, 
  "Vkf4e4SLFm3gApONFnWk7Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rachel C.", 
    "review_text": "I would give this place a 3.5 lolll.  Why? Everything was great, but the drinks, taste like doodoo.  My boyfriend got me something he claims was an AMF, but other than the color being blue. I SAY IT WAS LIES! the only good thing I can say about it was that it was SUPER strong and there was definitely enough alcohol in it to make it worth the $15 it was to buy it.... -_-   Anyways, all other aspects of the club were great! Of course the line is long... because its a poppin club! duh! don't complain. if you don't wanna wait.. go to a lame/ not as popular club. bai.  I would recommend getting there around 9:15. When we drove by at 9, no line, all the guys laughed and said I was stupid so I said alright pregame in the car! Get to the door at 9:30/9:40.... all the guys: \"@%@#$!!\" ... yea... RAGRETS! lol told ya so! luckily we still got in because we got tickets from this kind man ;) but the guys behind us didn't get in :(  Inside: Super new and pretty, theres a front area with a bar and tables. Very mirror-y decor but I liked it!  Dance floor: loll crowded as usual for most clubs but one thing is I'm a little OCD and they blew like foam/ bubbles every once in awhile and it got all up in my hurr and pretty sure in my mouth. loll.   I didn't get a chance to make it to the upstairs but there are more tables there at it overlooks the dance floor.  Overall fun and its the new place to go I guess. I would reccommend tables:  table tiers: $800 minimum $1000??? not sure about this one $1500 minimum  I think when I asked a bottle of grey was about $350. Numbers might not be super accurate though because we were talking over the phone and I have bad memory.", 
    "review_date": "2014-06-10"
  }, 
  "EolFJIil4F70YkpeW5VNfQ": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Kevin Z.", 
    "review_text": "I love this place, I really do. Unfortunately, this is like that one girlfriend you have that all your friends just hate. They just don't understand you like I do, Origin. You're something special, and I'll keep loving you no matter what.   Origin is half lounge, half dance club, and 100% asian paradise. This is my weekend mecca, where I drag my friends to the line at 10:00 to get through free at 10:30 just so I can fist pump to some EDM. The first half of the club has some nice couches, and a fireplace where people can chill. The next half of the club is a big dance floor, with a second level for more table service. The bartenders are pretty awesome too, always hooking it up with strong drinks and are super quick getting the drinks out. I don't necessarily remember paying more for drinks here than other clubs in SF.   I'm really not sure why people don't like this place, I think it's because of the wanna-be Vegas vibe that it gives off. My only complaints are that the place is become too popular, which means that I have to wait longer in line to get in, and that because it's getting more popular, it attracts more and more guys. Whatever, I still have fun.", 
    "review_date": "2014-07-08"
  }, 
  "EcNS3VUpK_PcO0vpz5P0_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda T.", 
    "review_text": "Origin never fails! I adore this place! Even though it may be considered small, It's still at the top of my list. The interior is very classy and cozy! Also, I love the fact that we have a plethora of couches to sit on, even if we don't have bottle service. The fireplace also adds a nice elegant touch to the whole place. Now, onto my favorite part -the music! I'm here for the music and to dance and Origin, in my opinion, plays the kind of stuff that I want to groove to. It's a mix of edm and hip hop, which are two of my favorite genres! And what makes this place even better is getting in for free with being on the guest list! It can't get any better than this =)", 
    "review_date": "2014-09-22"
  }, 
  "6creXKXZFVAV8abDvuz3Qw": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Alan B.", 
    "review_text": "I go clubbing in Sacramento too much and I came to SF looking to have a good time with old friends, and I was very disappointing with my experience at Origin.  I had high expectations for this place, but it's pretty mediocre. First off, the crowd is not diverse whatsoever, it's literally ALL ASIANS, most of them being FOBs to no disrespect. The crowd just sucks. I got there at 10 which is pretty early, but the guest list closes a 1030, so I didn't want to have to pay for this club and I'm glad I didn't. There was nobody here at 10pm on a Friday, the weekend after finals. I'e girld thought I'd allow this place some time to fill up a little bit, but people didn't start getting here till midnight, and same goes to the dance floor,  no one starting dancing till 12.  The girls. They don't dance. They just like stay in their group of 3-5 and just bob up and down. Girls here are super lame. I was talking to this girl for like 30 min, she was feelin me, I asked her to dance. She said she didn't know how to dance, #dealbreaker, and to my credit although I was drunk I didn't see her on the dance floor for the night (update for my fans)  The venue. Compared to most clubs, this place is pretty small. You walk in, there's a small lounge area with couches, then a hallway with the bathrooms that leads to the dance floor. It's a simple setup, but it's just too small for me. There's a upstairs overlooking the dance floor that is small and has booths only, for the chumps that wanna waste their money on that. There's a small outside area where you can smoke which is the same area of the guest list line there may not even be space.  The music, was actually super poppin. They had a mix of EDM as well hip hop, both the DJs were really great. If it weren't for the crowd, I would possibly come here all the time. For example, that \"i'm in love with the coco\" song, he just played that part of the song because the rest of it is bad. And then he transitioned to some EDM.   2/5, #notgoodenoughtocomeback", 
    "review_date": "2014-12-20"
  }, 
  "ltb_FEBEf2-PuPqQQ4aSHg": {
    "user_rating": 2.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Tina T.", 
    "review_text": "Really nice club layout, really fast bartenders, really aware security, really nice bathroom lighting.  Really crap music.  If you love dancing to Krewella all night, come here.", 
    "review_date": "2014-07-07"
  }, 
  "x1paA3aUHJTurbtFkBSOGg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiff C.", 
    "review_text": "Long, ridiculous line but the interior is really modern and nice. I can't wait until it becomes any other club in the city and it won't be hard to get in and be enjoyable because it has so much potential. Half lounge/ half club. Cheers to the owner for a great idea.", 
    "review_date": "2014-06-16"
  }, 
  "JZrsMlE3biNrsjTPXkPimw": {
    "user_rating": 2.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Katie T.", 
    "review_text": "So this is the new thing in SF... ok so I haven't gone to the club in a while and was expecting something better.  Got here on 10/18/14 for my friend's bday. This venue may look pretty nice as you walk in but damn it is pretty small on the dance floor.  $20 to get in after 10:30? hmmm I def don't think this was worth it.    I liked that there was a lot of seatings at the front next to the brightly lit bar.   We walked with the crowd down this small hallway that led us to the dance floor.  OMG it was like crazy packed... like I would get shoved because people were trying to get to the other side.  Maybe it's been a while since I've been to the club but I thought there should be more moving room.  There was also a big bar area on the left of the dance area so that is nice to not have to go to the front again.    I was able to just walk upstairs, I guess it wasn't just VIP?  Or they just dont care, but that was a breather, not having as many people upstairs.  Got boring, went back down.  There's just too many guys at this club. I mean that would be great if you are looking for one.  I was able to dance on top of a box next to the dj, woulda been cool if they got more of these, although, keep in mind, you shouldn't go up if you are drunk as hell. This girl fell right next to me.  Likes: -Pretty - lots of seats (although I hardly sat) - nice brightly lit bathroom with lots of mirrors  Dislikes: - Pricey - Too crowded - Too many guys - Dj/song sucked..idk what he was playing but I heard the same song like 3 times...-_- really now, you're out of songs already?  It was an experience...just to say I went there but I wouldn't go back.", 
    "review_date": "2014-10-24"
  }, 
  "N9gcGZI9bxNHj9UIrZUeMQ": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Da X.", 
    "review_text": "Came here for NYE, entered around 11pm, no lines. Price was $15 because we bought early.  Music: I don't usually listen to hip hop/edm but that's 100% of the stuff they play here. I looked at other reviews where they said they played 100% EDM after midnight but that was not true. Perhaps it was NYE's DJ, but he was great, he mixed hip hop and EDM non stop. This was one of the best club nights I've had where every song was good. And I was sober btw.  Coat check: $5? Come on, that's just mean, but still, supply and demand baby.  Decor/Size: The entire dance floor was a little small for NYE, but that's expected, I'm sure it wouldn't be so crowded on a normal night. The 2nd floor area seems to be a hangout area as there isn't really much room to dance. Caution: The glass+metal frame fence seems sketchy, don't twerk on it ladies.  Crowd: If you don't like Asians or you'd prefer a club filled with caucasians and blacks, you've come to the wrong neighborhood. But for my NYE expereince, it was about 20% caucasian with maybe 5% black/indian/middle eastern  The floor: This is why I'm rating this place 3 stars. While dancing on the 2nd floor I noticed parts of the floor were made of this bubbly and shiny white surface. and what do you know? It's slippery, like REALLY slippery. I didn't fall, but I slipped and almost did. I did see another person fall though. If you look at the club's entrance to the dance floor, you'll see it is covered with floor mats. Why? Because under it is the same material. The club knows this is a problem but has not yet put out the money to fix the problem. I really wanted to give this place 2 stars to grab their attention but because everything else was great, here's 3 stars.  Drink prices: $14 for patron shots, that is all I got that night", 
    "review_date": "2015-01-08"
  }, 
  "8nZ3Ku4yC5HJxY_m0WFsGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "I went here last night (Sat, 10/18) and I must admit that I had low expectations. San Francisco clubbing generally disappoints me - Booty SF, The Grand, etc. I got there around 10pm and there was already a HUGE long line stretching around the side of the building. Sorry, are we at XS or Hakkasan in Vegas?? Nope, actually we are in the Fillmore on a semi sketch block...anyway....  Luckily our group had a table so we only waited outside about 30 minutes before getting in without cover. I'm not sure if this place is worth it for a $20 cover as I believe girls have to pay that in addition to guys. The guest list gets in free before 10:30 but that means you probably need to be in line at least by 9:30. My backup plan for the evening was to go to 1300 Fillmore just down the block for some cocktails.  Once I got inside I was pleasantly surprised - the interior is really nice and trendy and more reminiscent of something you'd see in Vegas versus anything in SF. There are A LOT of tables in here both on the upper and lower floor. Despite the huge line outside the inside wasn't that crowded minus the dance floor. The DJ was ok, nothing special...not sure if they have better DJs on other days.   Overall, this was definitely one of the classier groups of people I've seen in SF. All the girls were dressed up nice in clubbing dresses; I saw very few people dressed inappropriately. And then there was a sea of guys in light blue button up shirts. I think they enforce some sort of a dress code so no sneakers or hoodies allowed.   And, oh yeah, this is definitely an Asian club so if you aren't Asian under age 28 or with Asians you'll probably feel just a tad out of place.", 
    "review_date": "2014-10-19"
  }, 
  "txrANKGe5_pxA9vw4XqyTA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex G.", 
    "review_text": "Same owners as \"The (not so) Grand\", what else would you expect?  Went on opening night at 10pm (big mistake) and the line was literally around the corner.  What made it worse was that they weren't even letting people in so everyone would have to pay cover.    We ended up waiting an HOUR in line just to get to the very front and be the first ones to be DENIED.  They said they hit capacity and told my group and the 100+ people behind me to go to \"The (not so) Grand\".    Final Word:     Same owners, same shit", 
    "review_date": "2014-06-12"
  }, 
  "ZZlylZYQK2YgkugH42ieOQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan L.", 
    "review_text": "Venue is nice, atmosphere and overall aesthetic is pleasing. That's basically all it has going for it. They hold up the line so if you're trying to do guestlist, before 10pm is a good time to come because the line moves slowly. $20 after 10:30pm. The dancefloor was small and hardly contained any dancing. The ratio wasn't bad but the crowd was just awful. As a fellow asian, this place was 95% asian and you know what we're really good at? Pushing and shoving. I had an awkward time, the DJ music selection was pretty poor, he just played Top 40 which doesn't always translate to dance-able music. No, playing the theme song to fresh prince of bel air was not a good idea. After midnight, they switch it up to EDM but the crowd remained motionless for the most part. My friend got bottle service and his table was at the front of the club where there is no dancing or view of the DJ booth and light fixtures. Pretty lame. The club caters to the bottle service customers but even so, they do a poor job. So I also made the mistake of leaving the club before I intended - I assumed I could get back in because I had a stamp on my wrist. Nope, the stamp on your wrist just means that you paid to get in. Fantastic.   Would not recommend.", 
    "review_date": "2015-01-25"
  }, 
  "gjQ00L18PvAV450ZOfqYng": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Braden K.", 
    "review_text": "figured we would stop by Origin and grab a bottle the day after 4th of July..   Newer spot in the city, hadnt been there before. Parking was a breeze and theres a safeway a few blocks down the street for that prefade madness. Inside the decor is beautifully set, the chairs were comfortable and the hostesses were super cute and friendly.  cant review the drink prices or strength, our bottles of goose got it loose though!  the crowd reminded me of my middle school days when I used to play Dynasty Warriors on the playstation. I felt like we were partying in asia all over again. not complaining, im 5\"11 so i felt uber tall but it was both literally and legitimately an asian invasion haha  I was super faded, they probably already added gratuity into our tab but when I signed for it I may have added additional. our hostess earned it, she was the sweetest!", 
    "review_date": "2014-08-27"
  }, 
  "h47LFVk-RzMJGqzcRgwHOg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen A.", 
    "review_text": "Thank you for making me feel what it is like to be a hot mess again.   Anyways, Origin is located near the Safeway plaza on Webster but don't park in that plaza! You might/will get towed. There's street parking or a garage two blocks down thats $3 bucks an hour. Pretty cheap if you're driving with a lot of friends.  If you go early, the line isn't that long and it's free guest list till 10:30 or else a cover of $20. The interior is nice/chic with comfy couches at the front next to the bar near the entrance.   The drinks are kinda pricey. $14 for an AMF that tastes watered down + $12 shots. But the bartenders are really nice! You should pre-game or go bar-hopping in the Fillmore beforehand if you don't wanna spend a ton of  money on some dranks.  The first two hours played top hip-hop songs and then some good ol' edm bangers like Calvin Harris, Alesso, etc. The crowd is pretty Asian, it was a lot of guys the night I went, they all came outta nowhere. 80% Asian crowd,  I would say. If that's your type, you would be in le heaven.  It gets pretty crowded later through the night that makes it a little harder to walk/dance through the dance floor.   Anyways, I had more fun here than I thought I would. It's not the best club I've been too but it isn't the worst. Go with good friends + good vibes, and it'll be fine lol.", 
    "review_date": "2014-09-28"
  }, 
  "HksMj2RBkQmaDTLaYML3BQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Lisa L.", 
    "review_text": "Don't let the other negative reviews of long lines deter you. I came here on a Friday night a little after 10, and got inside within 15 minutes just in time for guestlist.  I'm not sure what night other reviewers have gone but I guess it really depends on which night you go. Yes, the bouncers will embarrass you if you try to cut the line even if you step out for a few seconds.  The club itself is small but there's an upstairs so it doesn't get too crazy. I love the lounge area, there's ample seating for you and your friends to chill and sip on your drinks with your pinkys up. The dance floor is remeniscent of The Grand, sort of a circular layout with the the upstairs balcony overview of the crowd.   My not so favorite feature of this club is the tile flooring upstairs for the bottle service area. Extremely slippery especially since spilled drinks and party fouls bound to happen. So all you ladies in those 5 inches heels, be warned!   The crowd is pretty chill, of course mostly asian pursuassion, and plethora of guys. All the single ladies, now put your hands up! And head to origin. :P", 
    "review_date": "2014-07-21"
  }, 
  "6JeTaXe3rtyvoPQP71IbKg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Geo D.", 
    "review_text": "Newer clubs seem to always have it good.    Origin is well maintained and organized by the owners and curators of The Grand.   The venue itself also hires well seasoned DJ's (just like the Grand)....so yes, EDC is not happening at 10pm when doors open.    Although EDM is properly inserted close to midnight (just when the alcohol kicks in)  Unlike the Grand and it's \"two beer option\" at the bar, the Origin comes stocked with variety.  Not to mention, their bartenders are also trained   The crowd tends to get a bit asian- if you're not comfortable with that, just a drive up the street is the Marina, home of  tech bros and Lulemon.   There you have it,. Awesome music, awesome crowd.  Check it out, son.", 
    "review_date": "2014-11-18"
  }, 
  "b2DVw6kWq5QdQJRRVS1ayg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Thu N.", 
    "review_text": "Parking is fairly easy for SF at night on the street for free. We came at 945 and no line, on a Saturday. Coat check: $5/coat.   There are many couches to sit. Not many people did bottle service and they don't kick you out if the bottle service area is empty and you just wanna sit. But god, it's crazily packed because its soooo small. Like at 11 you cannot even dance anymore, it's just going to be standing next to each other. Total of 3 bars.   Music was ok. Didn't impress me. Ratio of girls:guys is almost 1:1. That's pretty good for guys. All asian guys and they do all have the same look.", 
    "review_date": "2014-11-23"
  }, 
  "_fysG2M3W_6UZNkAuqiZ9g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Solongo B.", 
    "review_text": "Your experience will definitely depend on the day you go and the crowd! And I recommend a Friday. On a Saturday, I did not really like the crowd. Disclaimer: I have not been to that many clubs in SF. Def not a club-goer. Yet.  The line and the security: The line can be really long. But if you are coming with your girlfriends, you might get lucky and skip the line! Otherwise, expect to be in the line around 20-30mins? From my experience, the security guys were really chill, friendly and helpful.   The place itself: relatively new, and has a decent size dance floor (but it can get really crowded) and  lots of space to just chill with your friends! At the end, there is some foam or confetti falling down as you dance. pretty cool.  The crowd: pretty chill 20 somethings and few in their early 30s? Not too many creepers. I haven't seen any fights inside or outside, so that's good. Also hot girls.  Drinks: pretty pricey as you would expect from SF clubs, but they are pretty strong though. Do pre-game. Downstairs bar can get really crowded, so go to the upstairs one to get your drinks.  Music: I think it was decent. I honestly do not remember what was playing. Too gone, but definitely had fun dancing to their music!  And of course, if you want to avoid the $20 charge, sign up for guestlist and come around 10. If you come before that, it will be really empty obviously. (but on a Friday, the line was really really long around 10:15pm @@)  To the guys who come here: No means no. We are not trying to play hard to get. lol.", 
    "review_date": "2014-09-04"
  }, 
  "jvq8XqWYOYnG075_ZWbjwA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cori N.", 
    "review_text": "If you're a girl, you will spend more time waiting in line for the bathroom than on the dance floor. If you're a guy, you will spend more time waiting for the girl who is in the bathroom. Venue is smaller than I expected. Good music tho but please fix the bathroom issue.", 
    "review_date": "2014-09-14"
  }, 
  "FmZTX66c7cEuxqyw_lcYkA": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Kevin W.", 
    "review_text": "I'm just going to start off by letting everyone know that this is the WORST FREAKEN CLUB IN SAN FRANCSICO AND THE WHOLE BAY AREA!   STAY AWAY AND GO BACK TO THE OTHER CLUBS YOU THINK THEY ARE CRAP CAUSE THEY WILL BE BETTER....  And here i'll tell you why in a list of many reasons  1) They purposely hold the line so you cannot make guest list (why have it if you're not going to let people in?)  2) They tell you the club is over capacity to keep you out but when you walk in it is not even packed. This is just so they can charge you cover 3) If you are in line and in the front by the door and it's 10:25, don't expect to get in, they will keep you out till 10:30 and you will have to pay $20  4) I went in to pay, they required an ID to use the ATM so you don't sneak in, I paid got my stamp and the guy had no interest in giving me my ID back, instead was just ignoring me the whole time 5) Bottles are over-priced but the thing that gets you even more mad is that you don't have your own space, instead you get a little corner and they rush you to leave the table (i thought bottle service is all night?) so it's open area, 2 hours, a bottle of cheap vodka, $600-$800 and perks of being bugged to leave 6) One male and one female bathroom downstairs  7) This place is owned by the same owners as grand (dying now) and they close the line at like 11:30 so people cant get in anymore whether you are paying or on guestlist, so they send you off to grand to help their other businesss...shady! 8) Security guys are on a power trip, thinking they can anything. They don't let you in, and they DONT LET YOU OUT! When you try to leave ,they put you in a line and let you out one by one. WTF, I want to leave, let me out!  9) Alcohol is pricey but its a club, nothing different.   Anyways,  I want to go on, but because this can go on forever...I will let you decide whether you want to go. This place is a joke. If you read this and you are trying to find another place to go to replace the usual Sloane, Raven, Grand, Temple, etc. I'd suggest going back to your original places, because this is not the place to go to.   Writing this review angers me and ruins my day. I am off to write a better review for better places.   This place is not going to last long.", 
    "review_date": "2014-08-19"
  }, 
  "Wc6zMTQP1JoVZpVOddlAHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Malori M.", 
    "review_text": "Feeling those Vegas withdrawals? This place is the cure to all of your turnt up needs.   The newly opened boutique nightclub is a self-proclaimed little sister of The Grand. For those of you who want to skip the long cab ride into the SOMA -- this is the perfect place to get the job done.   First  rule of clubbing -- always get on guestlist and make it in time for it. Otherwise you're stuck paying the ridiculous $20 cover. Get in line early to secure your spot. After you're in -- it's smooth drinking from there on. The venue itself is clean, new and has that Vegas feel. The best thing about this place is the mix of hip-hop and EDM. It's a healthy alternative between full blown EDC and ghetto ass grabbing pervert dancing (aka Sloane) scenes.   Drinks are medium priced ($10) but well worth the alcohol content. There are two bars and tons of bottle service. For now, this place is classy enough for most -- I just hope it doesn't turn into too trashy (as most nightclubs in SF do).", 
    "review_date": "2014-07-29"
  }, 
  "xon12FQ3dQY_xM6NK_2fig": {
    "user_rating": 2.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Amanda K.", 
    "review_text": "As the \"newest\" club in SF I was ready to experience what it was all about! I live in socal, so I'm accustomed to clubs like Create, Metro, Sutra etc.  I went on a somewhat dead night so the bouncer let my girlfriends and I in for free even though we missed the 10:30 guestlist. (my friend bf still had to pay of course, $20 lol)  The venue itself is nice and has the glamorous clubbing factor but much of the space is dedicated to tables (by the entrance and also the entire upper floor), leaving a rather small dance floor.  It would have been fun if it WEREN'T FOR THE CROWD. The amount of creepers were endless and the thirst has never. been. so. real.   I felt so uncomfortable at every angle with guys trying to grab us, dance awkwardly close to us, linger around or hover.  And just as an observation, some guys looked way too old to be clubbing, other guys were really FOB and the rest looked like underage babies. I think i just went on a bad night...it was so bad lol  And several of the girls drank way too much and were really sloppy, flailing their arms everywhere or stumbling.  The music wasn't too impressive either. If i ever go clubbing again, def would rather go to Ruby Skye.", 
    "review_date": "2014-12-08"
  }, 
  "1XMjbZCLHk0BtdZRCvixHQ": {
    "user_rating": 2.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Marco M.", 
    "review_text": "Came here for a friend's birthday on Saturday and I'm not sure if I'd be back.....there's just too many negative aspects to this club as mentioned by other yelpers.  First off......ridiculously long lines. Second.......rude ass bouncers. Third....... $20 cover which you'd most likely have to pay because you won't make the glist. Fourth........ that $20 spent on mediocre EDM/Top 40 shit. Fifth......... even the bathroom line is pretty crazy. etc.............  One thing that was nice though was fast drink service...but other than that, it's all pretty negative.", 
    "review_date": "2014-07-15"
  }, 
  "ZfxqsSShveh-VGV19t7ghw": {
    "user_rating": 4.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Mily W.", 
    "review_text": "I was here yesterday at their opening night hosted by MetroWize.   I loved it. The design was modern/upscale. Drinks were good, standard club prices, and the music was a variety of top hits and edm.  Right when you walk in there's a full bar and a couch area. There is a small hallway that leads you to the dancefloor which is pretty spacious. The bathroom is located in that hallway and its pretty small, so I am expecting a lot of crowding around that area.  I believe there is a second floor, although I did not make it there for various reasons....  Hopefully this club will bring a lot of business to the restaurants around the area! There is a korean place right in front (opens late) , and safeway, panda express and subway are a couple blocks away ( although they close pretty early).  Surrounding area: no parking, but its ok ! no drinking and driving please.  I dont recommend walking past geary and fillmore near the 22 bus stop. It can get pretty dangerous, and if you are thinking about the McDonalds near by... I am telling you now its a terrible idea. The bf walked past a gun shooting the other day.. imagine how it can get at night.", 
    "review_date": "2014-04-18"
  }, 
  "clxuY9ht3KWNtOhslz2MNA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Irene C.", 
    "review_text": "Bartender hooked me up with a free round of shots. Awesome. Perfect sized club. EDM. Awesome. Just smile and people will be nice to you. Stop complaining. Life is good.", 
    "review_date": "2014-10-04"
  }, 
  "OzyWzkcct7PXgkg4H1tDRQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Thuy H.", 
    "review_text": "Came here for the first time last night.  Parking garage one block away cost $1 an hour.   That in itself was purely awesome.  Something unheard of in SF. Arrived around 9:50p and wait to get in was 5 minutes and guestlist = free admission.  Hecka awesome.  Ed the bartender gave me a round of free shots when I got to the empty bar. Freaking awesome.  The dance floor was spacious.  Rediculously awesome.  Bathroom line was never long.  Unbelievably awesome.    Crowd was like 95% Asian.  In my opinion, not so awesome.  However, I brought my own white boy to throw in the mix just to diversify the party goers.  A previous review I read said there were a lot of seating.  True,but they are reserved for bottle service only.  Kudos for having fun at this place!", 
    "review_date": "2014-09-28"
  }, 
  "4jPsIgMZT4_Ks5-myaW9Bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Edna C.", 
    "review_text": "Disclaimer: This is my first time writing a review for a club!  It probably won't be as nice and flowy as my food reviews, but fragmented like all the half-memories.  Jk, I remember enough to write a legit review.  Tip: Get there early!!!  The line is super long and hardly moves at all.  We got there around 10 and had to pay cover, $20 cash only.   Music: Mostly EDM, none of those super girly pop songs :D  Space: Tiny dance floor, though I've been in more packed discomfort at the Grand before.  There's a pretty cool staircase to an upstairs area, but everyone up there looks like lame spectators when you're on the dance floor.    Ambiance: I am not a fan of their soap bubbles and confetti because the soap sticks to your hair and it makes the confetti stick too, so everyone always ends up looking kind of ridiculous after these showers.  The lighting is good, with lots of strobe lights and color, though sometimes it's a bit too bright (and you know, everyone always looks better in shadowy lighting)  Crowd: Interesting that it's right next to J-town and close to a Panda Express--crowd is very Asian, fairly good-looking, creepers are neither touchy nor tenacious (they go away if you ignore them; no need to run away and bury yourself in your group of friends)  Dranks: It's still very noisy at the bar area, but the drinks are good.  For the high-dose alcohol, I'm sure it was worth whatever it cost.  Conclusion: Not bad!  Recommended if you like Asian people and don't mind brushing off the soap and static-y confetti.", 
    "review_date": "2014-06-23"
  }, 
  "qIDy9zJfCuqxy6A3exPe_w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne C.", 
    "review_text": "Pass.   There is no diversity in crowd, everyone skews pretty young, long lines for the bathroom, you can't dance to the constant EDM music.  I did not like the place beyond spaciousness. Don't think I'll be coming back here.", 
    "review_date": "2014-06-01"
  }, 
  "Rlna6g4jezXFfSvERvSa-Q": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Roxy B.", 
    "review_text": "Worst club I have ever been to, save your time and money. All fob Asian crowd, cramped together, with little to no AC. Made the mistake of getting bottle service. The bottle girls did not do anything and took forever when we asked for additional bottles. Go anywhere but here.", 
    "review_date": "2014-07-27"
  }, 
  "GepUW7JMa963ZL9FMdTnyA": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Saram L.", 
    "review_text": "Got kicked out the line at 10:30 cause they were \"at capacity.\" Friends inside said it was dead. #whacksauce", 
    "review_date": "2014-05-31"
  }, 
  "2fN8mN7uUjOw-QqtcgYqXQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "Drinks: 3 Decor: 4 Service: 3  Came here for a startup party a while back when they had the entire upper level reserved. Line was pretty long, but we managed to get in after waiting about 10 min since we were in a special line.  $20 cover, and the drinks were somewhat pricey (around $13 for a cocktail). Music was largely EDM, and the restroom lines weren't too long. Way too many people on the dance floor though.", 
    "review_date": "2014-09-07"
  }
}