{
  "K1NLdTfT1IizE-6smhsSug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayrn H.", 
    "review_text": "Great drinks at reasonable prices.  As for the food, we have only had appetizers and they were decent and pretty inexpensive.  I used to like to sit at the bar, sip on a drink and peacefully watch a game...but they have now covered up the tv as \"so many bars in SF have tvs, we don't need one\".  Thumbs down for that move.  May come back if in the area, but not as much as I would if they still had that tv!", 
    "review_date": "2014-06-04"
  }, 
  "T1rP9rqslOh_72KI0IW7rQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia W.", 
    "review_text": "I came here with a little hesitation because of the Yelp reviews, but we needed a place for a birthday dinner for a party of 6, so we headed our way up Fillmore. Restaurants everywhere seemed crowded and had wait times, and Palmer's doesn't take reservations, but luckily they were able to take us right away when we arrived, so in we went.  And I am so glad we did! From the outside, Palmer's is nondescript and very easy to miss among all the other shops and restaurants. On the inside, it's classy, intimate, and even a little historic, with deer heads and lots of photo frames mounted all over wooden walls. There is also a bar area, which makes it more comfortable. I ordered the entree special, which was a shortrib served on pappardelle and vegetables (25), and the shortrib was super duper tender. Other people got the steak (35), gnocchi (20), trout (24), salmon (25), and lamb (27 and massive), and everyone really liked their food.  To top it off, the waitress overhead us talking about our friend's birthday, and surprised her at the end with ice cream and a candle!  Next time I'll try getting that curtained little table in the back corner. Scandalous.", 
    "review_date": "2014-12-31"
  }, 
  "lgxCzB0bmI7G6Q43hrxESg": {
    "user_rating": 5.0, 
    "user_location": "Santa Clarita, CA", 
    "user_name": "James C.", 
    "review_text": "So I ride my bike by here almost daily on my way to work and always see it packed with people. Finally got a chance to step inside last Saturday afternoon and what can I say, I was wowed!  So it's pretty fancy schmansy, perfect for a date night/couples, but since I came alone decided to have a seat at the bar. The bartender, Erin, was incredibly sweet/personable and made me feel like not such a loser for having come to the bar completely alone. She was super knowledgeable about the menu and was also a very pretty face to look at (hope that doesn't come off creepy).   Anyway, definitely planning on stopping by again soon (perhaps with a chica). In short: 1. Great vibe/atmosphere; lighting was good, lots of couples 2. Amazing and inviting staff 3. Food looked good (I just had a drink, it was fantasmic)", 
    "review_date": "2013-10-21"
  }, 
  "mBliQ3YX0wj1zuwaP8TQgg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen H.", 
    "review_text": "If my other half saw I gave three stars, he'd urge me to bring it down to two, but there were aspects of Palmer's that I really liked on our recent visit.  Spoiler alert: the food was not one of them.  SERVICE: very attentive; the food came out quickly, and we also didn't wait long for our drinks.  Because it's a new restaurant, we were given a survey at the end to help them gauge how well they were doing so far.  I really appreciated the fact that they were open to taking feedback and making Palmer's a long-term success.  DRINKS: The drink selection is great and not *too* outrageously priced.  I'd come back here for drinks if I want a bar option in Pac Heights that isn't Harry's.   FOOD: This is where I don't have a lot of positive things to say, and I was really surprised at the quality of the food given that I've always had great meals at Leopold's (owners' other restaurant).  The food just seemed a notch below everything else at Palmer's; my green beans looked/tasted like they were of the frozen variety, my fries were salted beyond repair, and the steak, while cooked to the correct temperature, didn't seem to be a high-quality cut of meat.  DECOR: I see other reviews think the antlers/animals on the walls are weird, but I think it gives off a cool, Italian-mob-in-a-bar kind of vibe.  I like it.  OTHER PATRONS: meh.  Someone who knew the owner sat next to us and were disgusted to (over)hear that we didn't love our food when we filled out our post-meal survey.  They then proceeded to insult us for a good five minutes, calling us \"ignorant young people\".  That wasn't a direct factor in the score since Palmers didn't choose to plant them next to us, but it certainly didn't help the overall experience.", 
    "review_date": "2013-10-29"
  }, 
  "JK4xhJNBMoPpkzIJuLw9kg": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Andrew F.", 
    "review_text": "5 Stars = Atmosphere 3 Stars = Food 2 Stars = Value  Palmers is a great bar trying to be a great restruant.  They had great bones to work with from Long Bar, the previous occupier of the space, and they seem to have made some nice touch upgrades.  I'll probably be back for drinks regularly.  The food is mediocre.  I had the Wagyu Beef entree, which was bad.  I wasn't expecting fillet mignon for $23, but it was the toughest cut of meat I've ever had.  One of my friends tried a bite and couldnt even swallow it.  We sent it back.  Also had a burger, which was solid in and of itself, but kind of a let down at $13.  The bun was buttered.  The cheese was okay.  lettuce, peppers and pickles came on the side, but no tomato or onion.  IMO, highend bars, should focus on top quality beef, prepared simply, for burgers.    Great bar with mediocre food that is over priced.  My overall sense is that Palmers is trying to be a little too fancy and that if they focused on doing a few simple dishes really well, it could be one of the best hangout spots in Lower Pac Heights.", 
    "review_date": "2013-09-02"
  }, 
  "gaN7Lr9QsWFc-sw-uTmQ7A": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Linda L.", 
    "review_text": "I found PALMER just by accident. Had a friend visiting. We had Francine for our server in the bar. She was fabulous. The hostess was also very nice &amp; professional. I was there the Sunday of Presidents' Day weekend. The place was packed. Loved the food. The trout was a culinary delight. Bravo to the chef. Give the place a try. I will be a returning customer!", 
    "review_date": "2014-02-20"
  }, 
  "HzbgWfNKb9fcqAd2TvHstw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "I haven't been in here in a while and when i did recently i was sad to find that Eric was no longer around. Off to greener pastures i suppose but either way,your mark was left. Gone but not forgotten. This place attracts a Douchy crowd. Not their fault,  it just goes to show the marina is expanding at an incredible rate.  The food was good(better than it needed to be actually), our waitress hot, and the germans were friendly.  Ill be back. for 4 beer or whatever", 
    "review_date": "2014-06-19"
  }, 
  "isFER3WMkZHI0OYgh70sqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grant K.", 
    "review_text": "I brought my family on a whim, but ended up actually really liking the restaurant. I had the sage gnocchi with bolognese sauce and it is now one of my go-to favorites. Our waitress, Molly, gave some solid recommendations on which which appetizers to start off with and the staff as a whole seemed extremely knowledgeable and pleasant. I would highly recommend the flatbread and spicy meatballs. Some of the best I've ever had in the city!", 
    "review_date": "2014-12-23"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "good happy hour w/ some cocktail specials.  i did not like the deviled egg though, b/c it was overcooked.", 
    "review_date": "2014-04-29"
  }, 
  "cX-AD3Ul6CaSLU3T1Pe4TQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emilia G.", 
    "review_text": "It was tooooooo noisy.  However it was fun.  Cocktails so so, food so so, just average. Was expecting better quality food, though the salad was excellent.  The wine was excellent too.  Had the special of that night and somehow it missed it by a little. I was actually served old burnt coffee.", 
    "review_date": "2015-01-17"
  }, 
  "jiXRSdyBkNkfJIvD4vjfyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian P.", 
    "review_text": "A friendly, civilized place. The barfood menu rocks &amp; the bartenders take pride in their craft.   The joint is usually jumpin' but I've rarely had to wait for a comfortable corner or a seat at the bar. A perfect place to meet for cocktails after work.", 
    "review_date": "2014-06-05"
  }, 
  "wzfu2O9xb71fP0GkSJ8U5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe Z.", 
    "review_text": "All I have to say is \"wow!\"   I hadn't been to Palmers in about 5 months and decided to stop in the other day.   Fantastic!!   They had obviously made a lot of changes to the menu and they were all home runs.   Starting at the bar I had two drinks that were made exactly the way I wanted.   Old school cocktails that have been bastardized at other places are made with the attention to detail they deserve.  Thanks Doug for a geat old fashioned.     Sat down for dinner and our server was Brian.  Great service and extremely knowledgeable about everything on the menu.  Kept it simple on this trip and got deviled eggs and the burger.   I'm a fanatic for deviled eggs and these delivered big time.   Burger was excellent.  Classic with some nice twists.   Definitely jumped up on the list as one of my favorites in SF.     Overall a great experience.  They've made some really nice changes and improvements since the last time I was in.  Good job!!   I'll be back in force and with friends.", 
    "review_date": "2014-07-03"
  }, 
  "44c0SsYBiYrI9wORvae2Qg": {
    "user_rating": 1.0, 
    "user_location": "Tybee Island, GA", 
    "user_name": "Stephen S.", 
    "review_text": "We waited 40 minutes for one round of drinks. They messed up the order. Cool looking place but we will never be back.", 
    "review_date": "2013-10-05"
  }, 
  "OEh2jml5aUM3v_KqCPGkRw": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "ems k.", 
    "review_text": "UPDATE: The owner is a lovely guy who made certain to contact me right away to let me know that they are installing a changing unit. Thanks on behalf of all the SF mamas!   We have been here for dinner so many times. Tonight we arrived with our new baby (who sleeps soundly in her car seat the entire time she's out). It was time to change her diaper and I went to the (very large) handicapped bathroom. It had no public changing table that just about every restaurant has these days. (This restaurant is brand new.) I went out and asked the manager about it. His response? \"It's not required.\" ...that's it? I cannot believe this lack of customer service &amp; absolutely zero concern on the manager's behalf.  It could have been so simple. He could have a least showed a bit of concern regarding his patron's comfort. My issue is not whether a changing table will or will not be installed in that huge restroom. It was the manager's entire lack of concern.", 
    "review_date": "2014-04-30"
  }, 
  "2R6Oz4D4PxkMbKMJr-qRXw": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Patrick L.", 
    "review_text": "The Gnocchi. Little clouds sent straight from heaven and into my mouth. What did I do to deserve this?  Went into the city for a day trip with my family and happened up on this little gem. I loved my experience at Palmer's from the moment I stepped in to the moment I food coma'd. Great vibe, great food (hearty portions!), great classic cocktails, and amazing service! Definitely coming back here next time I'm in the city.  Things you CANNOT pass up:      -the gnocchi: best gnocchi I have ever had     -the burger: incredibly juicy and well seasoned     -the mussels: woooooow that sauce+bread=gold  Good to know that amazing food in the city doesn't have to come in tiny portions/be overpriced.", 
    "review_date": "2014-07-25"
  }, 
  "VX6Oeymu8LQb3qDf10dc2Q": {
    "user_rating": 5.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Alex K.", 
    "review_text": "This place was great! Went for happy hour and was pleasantly surprised. Started off ordering some food followed up by a few drinks.   The food: The burger was amazing cooked just right with a side of curry fries (get the curry fires!!!!). It was medium well and still juicy not dry at all. I was impressed by the portions too.  The drinks: The cocktails were on par served up by mad scientist looking bartenders rocking lab coats. I only had a few but they were masterfully done.  The atmosphere: Very chill old school vibe with comfy booths, a nice sized bar, and deer heads on the high ceilings. Enough room to bring a party and intimate enough to meet people when alone.  Overall I liked it a lot and would recommend it to anybody. Will be coming back soon to explore the rest of the menu. Top notch and five stars!", 
    "review_date": "2015-01-22"
  }, 
  "Jiptar-MXhgKnJ5VLetieQ": {
    "user_rating": 5.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Eve F.", 
    "review_text": "We just tried their new happy hour specials. A perfect nosh or early meal. We had two of the $5 apps: meatballs and bacon-wrapped prawns, and delicious deviled eggs for $1.50. We also had $7 drinks. I think these prices are good from 4-6 pm. Will definitely be back!", 
    "review_date": "2014-03-05"
  }, 
  "fXxC_j-a0VhTbFapCLY82g": {
    "user_rating": 2.0, 
    "user_location": "Portland, OR", 
    "user_name": "Bailey D.", 
    "review_text": "Ambience- Corner location with awnings and warm lighting make for an inviting vibe. Food- ok to very good among the five items we ordered. Drinks- lots of choices; good atmosphere  Service- What is there to say?? Waiter slipped a second bottle of wine onto our bill, not just any bottle, but one that increased the bill by 50%. I caught it as he was walking away and he instantly grinned saying \"Oh you probably want that removed from your bill\" as though it was a joke. Guess my sense of humor is impaired...  The place is attractive from the street and interesting inside... A mistake? A cabal of thieves? The one bad apple? In this neighborhood I won't need to sort that out any time soon.", 
    "review_date": "2014-06-21"
  }, 
  "aUjQXEAvwTeukRsMznK0bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leslie L.", 
    "review_text": "Went in the other night with my fiancé. Tried the ribs and tartar as starters and they tasted great. I had the filet mignon and it was cooked to perfection. My fiancé had the trout and he loved it. It is covered with pancetta which gives it a great taste. The service was great and the drinks were really good. Overall a great experience will definitely come back again.", 
    "review_date": "2014-08-20"
  }, 
  "68G4Ffm7YiDJAQT1q4ZjwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyoko T.", 
    "review_text": "Great place to get a bite to eat and some beers/cocktails! So much fun to sit by the window or at the bar. They have a nice selection of beer, wine, and cocktails. The French fries with the curry spice was so delicious. It went perfectly with a cold draft beer. :)", 
    "review_date": "2014-07-28"
  }, 
  "QusshY1Z8tTr94rxXnsfZg": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Jake E.", 
    "review_text": "I had the gnochi which was good. Wife had the pork sliders which were really good. Good service and outstanding selection of Islay scotch which is very important", 
    "review_date": "2014-11-18"
  }, 
  "sbjh8QwOtTkFUkwp9hNpBQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "emily b.", 
    "review_text": "I really like Palmer's especially for happy hour.  The Pimm's cup is excellent and they have Alagash on tap.  The deviled eggs and burrata are both nice and only $5 at happy hour.  The burger is tasty on a brioche bun.  Fries, `extra crispy' are amazing.  My only complaint is that the restrooms are disgusting.  They are old and look like something out of a gas station/or old school.  The worst thing about them is the horrible gas station smelling air freshener.  So strong it hits you when you walk in so much so you can taste it.  The paper towel dispenser is the type that you wave your hand in front of a sensor and one tiny strip comes out so you have to wave a few more times to get another square(s).  They were not remodeled when the restaurant re-opened as Palmer's :(  I also prefer not to walk by an exposed kitchen on my way to the restroom, knowing all of the food is being prepared within 8ft. of the bathroom.  I know this might sound nit picky to some but they are terrible.  Every time I go to Palmer's I cringe at the thought of having to use them and am tempted to head next door to Via Venneto.  So the food and ambiance, decor, booths, outdoor tables are really nice.  The bartenders and wait staff are very chill but attentive and 'real' people.  I recommend Palmers but if nasty bathrooms  are a deal breaker for you or your loved ones, you might think twice before heading to Palmer's.", 
    "review_date": "2014-07-05"
  }, 
  "I1gwUsHt50OvBdQJzYZWXQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul W.", 
    "review_text": "Great decor and beer variety but marginal service. Crowded sitting area for drinks and the waitress seemed annoyed that I was interfering with her work flow. When she asked me to move so she could plug in her iPhone I left. Not a good place to get casual drinks with a group.", 
    "review_date": "2014-05-29"
  }, 
  "Vw2j3AV6kJ5uXHsR0sVgmg": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "Louis A.", 
    "review_text": "TL;DR good value but service is not 100% there.   Pretty good (and apparently pretty new) spot in Pac Heights. Prices are not as inflated as most places are in this neighborhood (8 dollar cocktails, 20 dollar entrees). Wait staff was not very familiar with the menu, which was slightly annoying. Ordered the trout, which was done very well.", 
    "review_date": "2013-11-18"
  }, 
  "_SR0as81zMwfIBh_CNN3lw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theresa M.", 
    "review_text": "My husband and I were very excited to try the \"new place\" on Fillmore St. Loved the decor,  but lose the dead animal heads... Spouse enjoyed the skirt steak, spinach a little too garlicky; on recommendation of bartender, I ordered the burger. I don't mind paying 13$ for a burger, but they don't have mustard???? That's a standard American condiment.  How do you have a kitchen sans mustard?  Curry fries were curiously tasty,service from Maricur excellent.", 
    "review_date": "2014-07-31"
  }, 
  "voQ1xg-MJVaXy4edStC6gQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg C.", 
    "review_text": "We had a great dinner.  Food was excellent and service very attentive and knowledgeable.  Enjoyed the ambiance, despite the mounted animal heads on the wall.", 
    "review_date": "2014-01-14"
  }, 
  "Bafm9tlAPQywXNexcfDSwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "Classic bar and grill.  Great afternoon and early evening sunshine, given their western exposure.  Fantastic happy hour.  Great neighborhood place, fantastic bar and good service.  Oh, and get this:  the food is fantastic!", 
    "review_date": "2014-08-05"
  }, 
  "SCRJV6R3dXfV3Hd_WrMA0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe M.", 
    "review_text": "Great addition to the neighborhood. I've been in for cocktails a few times and they don't disappoint. Food is great too. Try the deviled eggs and bone marrow.", 
    "review_date": "2013-10-11"
  }, 
  "PGLF8LbYUrnKBIUE95F42g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristin G.", 
    "review_text": "Was very excited for this place to open and the drinks/ambiance did not disappoint. I loved the attention to detail from the sconces,old photographs to the mounted animal heads and swordfish. The jazz was the perfect accompaniment to my classic cocktail. The owner was also very attentive - without me having to ask, he closed the front door to keep me from getting too chilly from the breeze. Cant comment on the food, since I didn't try but I hope they focus on adjusting that based on the reviews below. Super excited that I don't have to go to Harry's anymore!", 
    "review_date": "2013-09-04"
  }, 
  "x8Kxh4hpzrJ0Bez8GwGuRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robin W.", 
    "review_text": "I wish this was better, as I like the looks, the location (near my house) and the no-reservations policy.  My BF and I went for the first time on a Saturday night, arriving just before 7 and were promptly seated.  Good service.  Mediocre cocktails.  My tequila diablo was (predictably, my Bf informed me) too sweet; his old fashioned was okay.  None of the dishes were standouts: the deviled eggs, roasted beet salad, caesar salad (my entree) or pasta (his).  Nothing bad, just not as good as you can get elsewhere in San Francisco.", 
    "review_date": "2013-09-28"
  }, 
  "b7YbANxm_0ETB3ioOLF32A": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Joaquin A.", 
    "review_text": "Looking for a chill place to hang out and grab some cocktails, look no further... This place is great!   Drinks are on point, I personally thought it was strong. Bees knees was doing it for me... Penicillin wasn't that bad either.   Great bartenders.   I'd come back!", 
    "review_date": "2014-04-06"
  }, 
  "fPQYDJwPaz42Uf3WGk3NZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Harry B.", 
    "review_text": "2nd best burger in San Francisco.  Good go-to neighborhood spot for a few apps, a burger, and some cocktails with friends.   Only negative is they don't take Amex.", 
    "review_date": "2014-07-21"
  }, 
  "JG2-Z87cVoVQRiCaTtc7jw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison S.", 
    "review_text": "I really, really like this spot, and I'm a little bit surprised by that!  I've walked by a bunch of times, and always figured the crowd was kinda, well, not my scene. I figured it was bros journeying up the hill from the Marina, and older, richer folks from Pac Heights. And you know, maybe that's true on some nights, but it wasn't the night my lady and I ended up at Palmer's after our own little Fillmore cocktail crawl.   And what a great place to end up. We sat at the bar, and enjoyed watching the bartender (a big, tattooed gent bedecked in a strong beard and a classic white barkeeper jacket), lovingly create each cocktail. He and the other keep were nice guys--friendly and talkative, but not so talkative as to be annoying.   I don't remember which cocktails we ordered, but they were served in the old-timey glasses. In general, I'd say Palmer's is paying homage to the 1920s Jazz-era Fillmore Street: a vintage feel with lots of solid wood and incandescent lighting. I like it a lot--it's speakeasy-ish without the pretense.  We also had some food: the burger and the side of brussel sprouts. Both were well-priced, largely portioned, and delicious. Particular shout out for the brussel sprouts, which were cooked in balsamic, and cost only four dollars, for as many veges as you normally be able to buy for $4. Impressive.   Great place, will return. Holding off on the fifth star for now, as we didn't have dinner proper there, but I expect they'll be able to get it.", 
    "review_date": "2014-09-12"
  }, 
  "qz_WUffh8rk5ZXh4vZXz4A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin B.", 
    "review_text": "I've missed Long Bar since it closed several years ago and was looking forward to finally trying out the new replacement. Overall the atmosphere is appealing and seating comfortable. However, the service is severely lacking -- our waitress, while pleasant, was consistently slow to return to our table.  As for the food and drinks: the french fries are terrific, but everything else we tried was mediocre. They have a decent selection of beers, wine, and liquors, but the pours are small.", 
    "review_date": "2013-09-18"
  }, 
  "-6KYwjbTX4hu9pxrFxnTFw": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "kevin a.", 
    "review_text": "good ambience, great burger and nice cocktails.  it is balboa on filmore of sorts. I would highly recommend this place for dinner or just drinks!", 
    "review_date": "2013-12-31"
  }, 
  "8mmm9niIUOsTUELGY-gciw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shireen K.", 
    "review_text": "The location is great and so was the ambiance with dim lighting (but not so dark that you can't read the menu, similar to most steak houses) and room for sitting and standing. Started with the curry fries which I don't regret at all. Crispy and coated in curry seasoning with some ketchup on the side. The gnocchi was excellent, slightly crisped but soft on the inside sitting on top of duck bolognese. I got full about halfway through but it tasted so good I forced myself to eat the rest. My husband ordered the salmon which was also cooked to perfection. If you're in the mood for something light but flavorful this is the dish for you. It came with some crunchy vegetables which was a great touch if you're able to include some in every bite.   Unfortunately the dessert was nothing like the entrees. We ordered two vanilla bean creme burlees for a table of 6 to share and we ended up sending both back. The entire thing (both of them) were freezing cold and gelatinous, the caramel on top tasted burnt and was crunchy only in the center and not on the sides. If you enjoy creme burlee I advise you not to try it at Palmer's - give something else a try.   Overall, I enjoyed 80% of my experience there. Service and dessert were not notable.", 
    "review_date": "2014-08-17"
  }, 
  "PUpRwp4zz0jh0X46XEsIaA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Debi D.", 
    "review_text": "We had such a great experience at Palmer's Tavern. We started with the Shrimp appetizer, the shrimp were so large they were the size of lobsters. We then had the Trout wrapped in pancetta, which was to die for. I'm a huge fan of trout, and this was by far the best! Our waiter Eric was fantastic, our entire dinner went so smoothly even on a very busy night. After talking with him we learned that he used to wait tables at the Slanted Door, so I'm sure he's accustomed to high volume restaurants. The entire staff was just so wonderful, including the owner, Albert, who stopped by to greet us. We will certainly be going back!", 
    "review_date": "2013-10-08"
  }, 
  "c1i8I3EsfXJifzM4ST8RQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew E.", 
    "review_text": "Palmer's has a bit of an identity crisis.  Is it an upscale bar with good food or is it an upscale restaurant with a bar area?  It seems they are trying to be the latter, which is a problem, because the food was average-to-bad at a premium price.  My burger was just ok; I expected a lot more for $13  Just down the street you could do a lot better at Harry's or Roam.  My friend got the wagyu beef, which he dared me to try, and it was so rubbery that I couldn't swallow it and had to spit it out.  The atmosphere however was great.  They retained the charm of Long Bar.  They took away a TV or two along with a communal bar stool table which was above the bar area, so it is no longer a good place to watch a sporting event.  I think everyone in Pac Heights was sad to see Long Bar go and are excited to see Palmer's do well.  I just don't see how it will with overpriced, unsatisfactory food in a city like SF, where everyone knows good food.  Honestly, to draw customers from Harry's or Elite Cafe (both a few blocks down on Fillmore), Palmer's is going to have to do a lot better.", 
    "review_date": "2013-09-05"
  }, 
  "2LIyCjlMc7C8bHdj12-lMQ": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Jessica M.", 
    "review_text": "Nice neighborhood restaurant. We ate at the bar. I had a burger which was cooked just right. Added blue cheese and bacon to my burger which they accommodated.   They have an assortment of New Zealand wines which is very unusual in San Francisco. Overall, the service was good and the location is great and very vintage atmosphere. It just lended to the areas charm. I will be eating here again.", 
    "review_date": "2014-10-25"
  }, 
  "wUVQ_V2m9nEHgfwEon6ADw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lettisha M.", 
    "review_text": "Love this place it is very welcoming and has a great  vibe. The bar is a great place to sit have a drink and eat your meal. The food is tasty the  curry dusty fries are delicious. The drinks are great I love the penicillin. I would definitely  visit this place over and over again.", 
    "review_date": "2014-11-01"
  }, 
  "aNgxZSpmADUPn1pCfPC4Cg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin K.", 
    "review_text": "This place is great!  I love the food (especially the ribs), the staff is really nice and friendly, and the drinks are great. First Bloody Mary I had after coming back to the States this month and it was superb! Plus I got the one that came with bacon-how can one argue?", 
    "review_date": "2015-01-19"
  }, 
  "oGS1E_z61JpTwB_z7S1Vhw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff C.", 
    "review_text": "Stopped in the other night, sat at the bar for some drinks and food.  Great tasty drinks served up by the friendly barkeep, Doug who also had perfect food suggestions.  Amazing service, great drinks &amp; food, nice adult atmosphere, will definitely return.", 
    "review_date": "2014-05-08"
  }, 
  "4VP9fogz6Cqvx_rMFjYsaA": {
    "user_rating": 5.0, 
    "user_location": "Portola, CA", 
    "user_name": "Marcus S.", 
    "review_text": "The fifth star is for the best trout preparation ever (and I came from Trout Land before I came from the Cool Grey City of Love, and my trout-loving lover has even deeper exposure to the mountain-farmed fish), which is what got us into the restaurant in the first place.  Our experience actually started in my old neighborhood, on Polk just north of Union, where I wanted to try the replacement for an Italian place that I had liked there.  Leopold's is Austrian, with an impressive beer list, and a group of noisy techies playing mating games at the window table.  My companion's eyes lit upon a trout wrapped in pancetta; it is rare that she passes a trout dish on a restaurant menu. I had  the pappardelle, and we shared a beet and endive salad.  Had I done my Yelp duty then, I would have given Leopold's 5 stars.  Alas, I no longer can.    So a few weeks later we were back in the City, and I asked, back to Leopold's whose menu I want to explore further, or (since we were in a pet-friendly motel near the west end of Lombard) take the 22 up and check out the lower-Pacific-Heights restaurants?  Long pause.  The trout sounded good. But, being born to be wild, we went out in search of Adventure, and headed for the best bus line in San Francisco.   The last place we looked at had the appearance of a youth-oriented meat market, but we are rather pretty for old people and I lack the shame gene, so we dared to approach the entry-way menu.  The first thing my eye saw?  Pancetta-wrapped trout.  In we went.  It is indeed an attractive, well-designed restaurant with a classic dark-wood look appropriate for the concept.  The animal heads, well, read on.  My partner's choice being already made, I dug into the menu.  Hey, look, roast-beet salad, the last one we had at Leopold's was awesome.  Wait a minute...pappardelle, with parsnips?  I mean, it was really good at Leopold's, but this is supposed to be a New American place, the other restaurant with the same interesting menu has Austrian heraldry  all over the walls, along with a truly impressive collection of ungulate heads.  So yes, Palmers is owned by a man who came to San Francisco 20 years ago from Salzburg,  opened in a primo Russian Hill location a few years ago, and now has a hot spot on Fillmore.  Congratulations.  I ended up with the lamb shank, which was just as good as everything else.  Then after Christmas we took my sisters and brother-in-law for a reunion dinner (all of us now from out of town), because my elder sister has as long and deep a love affair with the trout of our home mountains as does my companion.  So more samples were made of the trout (and I got my tastes in), and we got a wide exploration of appetizers (roast marrow!  Yum!) and main courses.  Every single dish was interesting and done well.  The food really is based on the somewhat rural tastes of  Mountain Austria.  I can only imagine what they would do with venison.  That means somewhat less gimcrackery around bizarre high-tech preparations of food ingredients.  At both Leopolds and Palmers, you can recognize what you are eating.  The kitchen celebrates the ingredients, which drives this reviewer to celebrate the kitchen.  This is one busy place, and new.  I see that Dr. I had a dinner from hell.  It may be that his server recognized a diner from hell.  I can say that the servers were very busy, but I thought handled the press (we were there at prime time on a Friday night) very well.  If Palmer's is not yet at the top of its game, (1) I did not see it, the place was ticking beautifully, and (2) it has only been open a few months, there may still be some glitches which will undoubtedly be identified and worked out.  If it continues on track it is a hit restaurant.    So about the trout.  It is served apparently whole, wrapped in pancetta and pan-fried, with fixin's. Raised on trout that is pan-fried and served whole, with the diner carefully lifting the tail to leave one cooked filet behind then flipping the carcass and repeating (a process that removes most but never all of the skeleton), we approached the fish with care.  The pancette tied everything together:  our at-table filet technique would not work.  So we dove in with a sharp knife, and found:  No bones.  Flesh still moist, some of it due no doubt to the basting of the surrounding pancetta.  Still no bones.  That was at Leopold's.  What was it about the Palmer's prep that made it slightly better than what I had declared, 6 weeks earlier \"the best trout preparation ever\"? It is the reason I couldn't 5-star Leopold's.  I should have said \"best trout yet,\" then repeated that pronouncement  the next time we had the dish, and then again the time after that.  This is a not-uncommon preparation for trout in Salzburger Province,  enjoyed by a native of that beautiful mountainous region who has brought his skills, drive, and favorite dishes to a new home in California.  We are lucky to have him.", 
    "review_date": "2014-01-04"
  }, 
  "Qp5thevA8KSYsKKpugQWeg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dr I.", 
    "review_text": "Thoughts for my experience: You are kidding me right?    Before I say anything else and describe our (disgusting) experience I must state the good.  The Hostesses and our bartenders were outstanding, OUTSTANDING.   Our amazing hostess saved us from who I am guessing is the owner (obnoxious German(?) guy with the filthy rag hanging out of his pants), She looked mortified about how he carried himself and profusely apologized for his actions which I will get into later.  Our bartenders made an impeccable old fashioned, my favorite.  The bar staff were knowledgeable, fast and skilled.  It truly is a good looking bar.  My coworker and I have been on a Gastropub kick lately and wanted to check out the new place on Fillmore.  Note: website is under construction and Facebook goes to a German Lingerie company (I will expand later).  So based on yelp I left my Amex card at home (Lame business practice; considering our corporate cards are all Amex) and we took a cab on up the hill.  From the outside the place looks great, but it got creepy the moment we hit the door.  We walked in planning on having a drink or two then dinner, per the norm.  The instant we enter I see this larger fellow charging straight for us wiping his hands on some filthy rag hanging out of his pants, before we can breathe he puts his hand on my coworkers shoulder (the one that was just wiped on the disgusting rag) and shouts in what we both guess is a German accent \"Table for two?\" Normally I would be happy for prompt service however, we did not have a chance to look or breathe before he tried to usher us off, and he almost knocked the hostess down while interrupting her.  Very rude.    We steer for the bar after putting our name in for dinner.  The bar has a great selection of elixirs and the drinks are a reasonable price.  After a libation we smile at the hostess and she carts us off to a table.  I sit down and Thomas decides to go wash his hands (still grossed out about the rag), it is during this time that our waiter swings by the table and informs me he is not serving an incomplete party, before I can say a word.  When he is done filling me in on the rules I reply: \"That's nice my guest is in the restroom I know what he would like to ..\" and he walks off in the middle of my sentence.  Did we offend the service gods?  I worked in a restaurant in college so I doubt it.  Thomas returns and so does our waiter, \"Hi my name is Erick, I will be taking care of you tonight.\"  I had told Thomas about the incomplete party bit and we both chuckled, Erick, your authority trip must be a great ride.  Our drinks show up and they are outstanding, we order the chicken and the steak for dinner.    I have lived in San Francisco since 2003 and I should tell you the city is known for great food and drink.  Palmers, your food is terrible for the level of restaurant you want to be.  If we were in some dive bar it would be fine, but when I want frozen food I will go to a dive bar.  The chicken was rubber dry and tasted like dirt, have your chef season his food.  The steak was a steak, tough and over cooked, I am guessing it was a lower quality beef then you have written on the menu.  The sides with the steak were offensive, both the fries and the greens must have come out of the frozen foods section at Safeway then microwaved to limp mediocrity.  Palmers perhaps use quality ingredients like the other taverns in town, something fresh perhaps.  When our waiter asked we mentioned that the chicken and the steak were tough and both overcooked, he informed us that the chef had studied in France and blah blah, not offering to correct the problem.  I stopped listening, and asked for the check.  I am guessing that Erick does not realize we can hear him when he is speaking next to the computer, because guess what, we did hear you.  Thanks for calling us assholes and mentioning that we know nothing about food.  I have not had an experience like this and I had to think on it for about a week or so before writing this review.  How are you employed is a puzzle I will never solve.  Of course The Chronicles food critic reviews the place the Sunday after we go and his review was spot on, if not a little generous.  The one thing we saw he might be wrong about, my coworker has been living in Sweden and noticed that the name of the restaurant, font and logo are the EXACT same as a German Lingerie company.  It is one of the top searches when you look up PALMERS on FB.  So the little story I read about a family friends place in Canada has to be nonsense.  This place is either owned by a German company that produces (Very Hot) ladies underwear or the owner has zero creativity and just copied everything down to the color of the lettering.  It is somewhat sad.  To see for yourself:  <a href=\"/redir?url=http%3A%2F%2Fwww.palmers.at&amp;s=4ba20eec0fe8e629ac6186fd2ddd22c3c52178e15d70aac9293d06a4ac27aba5\" rel=\"nofollow\" target=\"_blank\">palmers.at</a>", 
    "review_date": "2013-12-17"
  }, 
  "tsqChEfgHb6QE--MFDqWnQ": {
    "user_rating": 1.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Herb S.", 
    "review_text": "Cool decor, hopping bar do not eat here! The service is atrocious and the food practically inedible.   Limited menu and the wait for a table is no where worth it. Sorry but the management does not have a handle on customer service. Fun area but there are so many other options on Filmore.", 
    "review_date": "2015-01-17"
  }, 
  "Ia9dHPdj_sDNDEL_zMUO5A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patricia M.", 
    "review_text": "This is a great place for a cocktail.  I really liked the bar scene.  If you decide to order food, think twice about what you order.  We had a family dinner at Palmers.  The chef really let me down with the $37 steak.  I ordered it medium/medium rare.  It arrived overcooked and this seems to be a repeated complaint in the reviews.     Instead of sending it back to the kitchen, I decided to eat it because I was very hungry.  I also thought it was the nice thing to do and I thought that the manager would take note of this in the final bill (I made sure management knew about the situation).  I was so disappointed when I saw that they took only $5.00 off our bill ($167.00).  When you pay $37 for a steak, it should be cooked to your liking.    The kale salad was pretty good.  My fellow diners generally liked the food, though my daughter complained that the trout was rather tasteless in spite of the fact that it was wrapped in bacon.  My mother enjoyed the wedge salad and mussels.  My son enjoyed his burger, though he told me  that one of the cooks was out on his cell phone while my steak was in the kitchen cooking.", 
    "review_date": "2015-01-27"
  }, 
  "cdJ2NJKOUhEHdHJ8vsUmpQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark H.", 
    "review_text": "Had a delightful bar dinner and would be recommending if I hadn't discovered the next day they had charged me twice, but for a slightly different amount.  Called and spoke to a manager who said she would get back to me after the weekend.  That was a week ago - no call - but they charged me AGAIN the day she was supposed to call.  Three times!  Card has been cancelled and fraud investigation started.", 
    "review_date": "2014-08-25"
  }, 
  "I5T0OU5zYFJvWN_mEr08vw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pamela R.", 
    "review_text": "Worst service ever!! When we sat down at the bar there was hardly anyone else there so we got our drinks quickly. Very overpriced, small drinks that are not even strong. The bar got slightly more crowded, it was a Tuesday night so nothing like a weekend. We asked for our tab at least 6 times. The TWO bartenders on kept looking at us so confused. It took getting angry before one just said umm three drinks $33. I don't think they were entering anyone's orders into the computer which is why they were ignoring our request for the tab. It appeared they were trying to get drinks made then enter them. Very poor customer service and clearly can't handle a tue crowd. Will never go back, plenty of bars in the area that could handle such a simple request.", 
    "review_date": "2014-11-06"
  }, 
  "TNo1aPj4p9mXkHBR0uHfEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nilu r.", 
    "review_text": "Since it's very close to my house, I come here pretty often. The cocktails are delicious, creative and strong. The food is good, somehow always better than I expect it will be even though the menu is sort of typical American cuisine.  I always get the deviled eggs...always really good.  Perhaps it is because I usually end up drinking several of the above mentioned strong and delicious cocktails before the food.  The service has always been super friendly. When it gets crowded you might get a bit less attention but I've never had an issue here.", 
    "review_date": "2014-04-28"
  }, 
  "1vZ3p3ZG-SOXzcqEftD0pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert F.", 
    "review_text": "Ambiance is really cool. They make some ver interesting drinks. Location is great for me, not for from my house. The bar area is a little small, but plenty of seating throughout the place.", 
    "review_date": "2014-06-08"
  }, 
  "DjYZxlkMa6eFmE6gBCh6bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa B.", 
    "review_text": "I am happy to have a bar in the neighborhood to meet friends after work. Their beer choices are very good and priced well.  The cocktails looks good nd are priced fairly too.  I tried the brown beer, which was very smooth. The best seats are at the bar and tables close to the windows. They have a food menu, which offers basics like salmon, burger, salad, squash blossoms, and more. I was hoping for a few more veggie choices or sides, so I can have a drink and a snack after work. There is a plasma TV behind the bar for viewing sporting events.  The Clay movie theater is across the street and Alta Park is on Steiner and Clay (1 block away) for a romantic stroll before or after drinks.  To the owners, please include more snacks like cheese and crackers, nuts, veggie sides to have with drinks. I have not try the food yet.", 
    "review_date": "2013-08-30"
  }, 
  "EZ-37xNczhXqNWLWFUQGwg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brandie y.", 
    "review_text": "I'd actually put it somewhere between 3 and 4 stars.  This opening was forever in the making, yet it still has the same creepy dead animal heads up on the walls.... but that's ok.   As the new kid on the block the place is always packed.  Good for them.  Let's just hope it doesn't bring too much Fri/Sat night douche-ness to the area.  On the plus side the staff was very friendly.  They seemed committed to making certain the service was good.  And, let's be real, it takes some time for a new staff in a new restaurant to gel.  We were seated quickly, and our food server was very cool.    On the downside is the menu.  It really was developed for a man.  Big heavy portions of big heavy food.  I think they'd do well to have a more robust appetizer menu and more salads, fish and pasta dishes, etc. to be more \"girl-friendly.\"  I'd go back for cocktails, but not so much for meals.", 
    "review_date": "2013-09-21"
  }, 
  "5ig5NtsBtn78Hrka_pVNkw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Siobhan V.", 
    "review_text": "I went last week with a group of friends and had a great time at this restaurant !  Between us all we ordered and shared a bunch of dishes - butter lettuce w/ heirloom tomatoes, steak tartare, caesar salad, burger, steak frites, halibut to name a few.  Everything was delice !  We were stuffed but found room for their yummy dessert.  The staff were all super friendly and welcoming.  I'll be back next week !", 
    "review_date": "2013-09-26"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "I want to like it, but it's really nothing exciting so far.  Went for a drink around 6pm on a Wed or Thurs. Bar was full so asked the bartender if we could sit at a table and order drinks only (mind you the restaurant part was empty), no that was not allowed. You had to order food to sit at a table, fine. Order a beer, friends arrived. We got one seat at the bar and chatted.  Friends were hungry so they asked the bartender for a menu, well apparently you couldn't eat at the bar.  Was just odd...seems like there are to many rules here. These guys own Leipold's and that place is fun, this place, so far is depressing.", 
    "review_date": "2013-09-22"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "This is a really nice spot - beautiful masculine decor - and a great place for a drink.  I started with a Four Roses single barrel and was quite pleased.  Then we got food - lots of it: deviled eggs (meh) kale salad (so-so) trout (pretty good) filet mignon with chimichurri (overcooked)  I'd go back for a drink and maybe appetizers, but skip the food.", 
    "review_date": "2014-05-20"
  }, 
  "dRX7bJ5OGGnflhzzt4muLw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gordon L.", 
    "review_text": "I was very pleasantly surprised by how far Palmer's has come since first opening.  The beer list is very good (particularly the bottle list if you like Belgian beers) and the wine list has improved as well.  Both the appetizers at the bar &amp; the dinner food were simple and fresh.  My salmon was hot, but not-overcooked, and thank God prepared without a sauce that overwhelmed the course itself.  Our waitress was attentive on a busy night.  You can't beat the owner/host Klaus for conviviality and concern.  I'm very pleased to see this long-vacant spot busy with Palmer's!", 
    "review_date": "2014-07-04"
  }, 
  "t6HyxS-IsymCbfwzLXJCiw": {
    "user_rating": 5.0, 
    "user_location": "Portsmouth, NH", 
    "user_name": "Liz D.", 
    "review_text": "A great spot to meet up with friends. The decor is classic and there is something to capture your eye wherever you look. Great bar too!", 
    "review_date": "2013-08-31"
  }, 
  "KEE5x6yfH_5eC-aWn_J9AA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Randy M.", 
    "review_text": "I want so much to Like this place.  Here's a brief description of my twice experience.  You enter to a great bar/restaurant with a flat screen over the bar showing sports highlights.  Then you look around and listen...it's a sandbox of lonely Pac-Heights \"girls\" that sit at the bar talking smack about their \"friends\" in shrill voices!  If they could hear themselves they would be embarrassed...or I would hope!  Such a sad experience for a great location.", 
    "review_date": "2014-12-13"
  }, 
  "ZkzY4qNI9tGXyqYwHrWWuA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt L.", 
    "review_text": "I hate to do this.  I really do.  But this experience is like poison that I have to get out of me by telling someone.  My experience is solely with the bartenders/drinks.  I can't comment on food.  My story begins with a perfectly reasonable cocktail, Diablo something, ordered from a friendly bartender at a reasonable $8.50.  I went back and wanted something a little stiffer.  This is where my tale begins.    I asked for a double Makers on the the rocks.  The bartender types in a Makers into the POS.  Its $9.  I can SEE this with the EYES I have on my head.  He then clearly is puzzled as to how to put a double Makers into the system.  He heads off to my right to speak with what must have been the manager.  He comes back with my drink and my receipt.  \"$27 dollars.\"  Im rather surprised that a double makers cost $18 more than a single.  \"27 dollars?\", I say.  \"So you are telling me a single cost $14.50.\"  Looking me right in the eye - \"Yes.\"    I don't argue with restaurants, I don't send food back, and I never complain to anyone.    I wasn't about to start here.  I sign the check, even give a tip.  The point here is instead of checking on something that seemed wrong, ie a $27 dollar drink, he looks me in the face and charges me that amount.  Screw you dude.  Check on that.    I wish my story ends there.  However after drinking my cocktail I want just one more.  I head back to the bar and avoid eye contact with previous bartender.  I don't want to complain, I don't want him to comp anything, I just want to avoid the situation and get charged properly.  I also don't want to order a single Makers and seem like I am \"testing\" the price on him.  Just trying not to be a jerk here.    To avoid any confusion and keep the price down, I order a \"whiskey on the rocks\".  When asked \"What kind of whiskey would you like,\" I respond \"whatever is fine\".  Mind you today is not my first rodeo - I have ordered drinks before.  Generally, when a patron does not specify the type of drink they would like, they want the cheapest you have because they are indifferent.  However, the bartender elected to serve me a $10 whiskey.  My bill was $10.  The brand was 4 shamrocks or something like that.  Again, possibly i should have specified that I would in fact not like your most expensive whiskey, but rather the cheapest.  So maybe its on me. But I don't think so.   Either way, this is my experience, and my tale.  Screw you bartenders at Palmers.  I wish the same fate as Long Bar upon your establishment.", 
    "review_date": "2013-09-02"
  }, 
  "dTR3Ii657BHLKUBvpzKTPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deirdre R.", 
    "review_text": "I love a good cocktail and Palmer's has it dialed in on this front.  The décor is very 1940's with plush red leather booths, animal trophy heads on the walls and lovely vintage looking lighting fixtures... love it!  All the meals I've had are excellent and their curry fries are stellar. They serve them in a tall narrow glass wrapped in paper which keeps them hot for a very long time... how clever is that? Get yourself into Palmer's soon and enjoy a stylish night at a fine dining establishment!", 
    "review_date": "2014-12-11"
  }, 
  "9bg4bapICoXy_gENRMOoDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa C.", 
    "review_text": "Palmer's has become my new favorite neighborhood haunt. Great drinks, classy, retro ambiance, and really tasty food. I tried several dishes the other day and was pleasantly surprised - the salmon was flavorful and moist, the potato gratin tasted straight out of Paris, and the fries were crispy and well-spiced with a slight hint of curry. The drinks are also consistently good and thoughtfully made (the bartenders are white-coated mixologist extraordinaires!). They have a nice selection of European beers, as well (I believe the owner is the same Austrian gentleman who runs Leopold's on Polk St?). Overall, Palmer's is a great spot worth checking out on Fillmore St.", 
    "review_date": "2014-07-26"
  }, 
  "df8OiJq0pcaj7qyD6zB_yA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Arash H.", 
    "review_text": "I went in expecting an average bar food but I was pleasantly surprised. we were group of 8 trying to make reservations on Friday for same day and lucked out!  we started out with Devil eggs, mussels and macaroni and cheese all of which were good but spicy meat balls was awesome! I got the ribeye which was good but my Friends got other dishes that I tried all, so I can say with confidence get the braised lamb shank it is by far the best dish on the menu, after that sage gnocchi and ribeye are good. the trout and salmon were good as well... but the burger was awful! (burnt). overall the place has great atmosphere, service and food. I will go back...  Totally forgot to mention the fries!!! the curry fries at this place is to die for!!!", 
    "review_date": "2014-04-14"
  }, 
  "gmva_eeWbLm74SzIbqTYTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina R.", 
    "review_text": "My husband and I read all these reviews and it was a mixed bag!  Big time!  So we set out to find out for ourselves.  Sunday evening.  We usually do not get the best of anything in a restaurant on a Sunday evening, so this was a real good test for Palmer's.  Delightful surprise!  The drinks, cocktails and wine were great and reasonable!  Service just right and the food as good as we hoped to be and then some!, Creative, tasty, well priced!  So, we are going back, bring friends and recommend this neighborhood gem!", 
    "review_date": "2014-03-10"
  }, 
  "Tj1HV3On6Zy-Qgxc7s8Ugg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sfgal S.", 
    "review_text": "Came here during the week about 8pm. Had to wait a while for the bartender to talk to us, had to ask for water, then never got it refilled until dessert time. Very annoying. It wasn't that busy &amp; they just weren't attentive. Wine was great. Food was meh. Chicken was salty &amp; the Mac n cheese on the menu doesn't mention that it has bacon in it, which I don't like.  We ordered dessert-butterscotch creme pot. It was the smallest dessert I've ever had &amp; 1/2 of it was whip cream. For $100 for 2 people, there are tons of other places to go!!! Tried it, not impressed, won't be back:(", 
    "review_date": "2013-11-12"
  }, 
  "rsmX4xMkWsC5g2OmrKYNOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L V.", 
    "review_text": "The best part about Palmers is the service, particularly the dinning room. I was provided with 5 star service which was thoughtful and prompt, better than any I've had in SF. The food: Not very impressed. The wedge was lackluster and missing more of everything. The burger would have been good if it weren't so charred. The mussels were GREAT and so were the fries!!!!! The decor and ambiance are also great! Very charming 20's vibe and huge bar, If you are meeting up for drinks &amp; appetizers this is the place to do it. On our way out we got a thank you from 4 people including a bar tender, That was impressive!", 
    "review_date": "2014-05-24"
  }, 
  "IvNPmDMMYwLwYN5vbHpAGw": {
    "user_rating": 1.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "MARTIN B.", 
    "review_text": "Watch out for Eric, he was such an @ss.  I asked him if we could get drink service and he ignored me and I was right next to him! I waited for 2 mins before he even acknowledged me! Rude!! Then after he was done he said he wasn't taking orders when I asked what were you doing and he walked off!!! Right in front me! I had to ask another waitress his name and took a picture for everyone to know who he is. Watch out and go to Harry's!", 
    "review_date": "2013-11-21"
  }, 
  "wECOzXh2P2wnnSIdfoYLuA": {
    "user_rating": 1.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Adam J.", 
    "review_text": "Disappointed is the most friendly yet comprehensive adjective that can describe our evening at Palmers. We left discussing whether we were more disappointed with the food or the size of the bill. I have paid parking tickets that felt like a better use of my money than our dinner bill. Our bread order should have been a clear signal of where our meal was headed. For $4.75 we got 2 defrosted dinner roles with butter (in most cases I would not admit that I paid nearly $5 for bread, but because we had never seen bread cost so much on a menu we had to try it).  It is not worth getting in to a discussion of our entrees, but I will say I wish I had a camera to capture the look on my wife's face when she saw her plate of hen sausage meatballs.   On a somewhat positive note, aesthetically the restaurant looked great with the exception of the animal heads and marlin on the wall (very confusing decor given the theme in the restaurant).  To sum it up, Palmers needs to step their game up big time before everybody starts wanting their money back, which I do.", 
    "review_date": "2013-09-01"
  }, 
  "8JgjwNRLiEnXaowKINRxDA": {
    "user_rating": 3.0, 
    "user_location": "Woodland, CA", 
    "user_name": "Jacque Y.", 
    "review_text": "I realize it's Halloween and you've been harassed by drunk people all night, but you work in a bar. Put a smile on your face and get over it. I would like to try this place on a regular night and give them a chance but first impression was not positive.", 
    "review_date": "2013-11-01"
  }, 
  "q96K7euyznvFTAxb3SRi1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crina R.", 
    "review_text": "Love the food, ambiance, service!!! Very east coast, fun place and everyone is super friendly!", 
    "review_date": "2015-01-17"
  }, 
  "WWpIMF3Wu6xyYvHlKlCtDg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susanne W.", 
    "review_text": "The last thing the Filmore street area needs is a pretentious bar.  Unfortunately, that describes Palmer's all too well. My friends and I have been waiting for months (literally) to try Palmer's.  We live very close and were excited for a new neighborhood watering hole.  Excitement has now turned to extreme disappointment.   Here is my Palmer's story:  The first thing I notice is that we are the ONLY people under age 35 at this place.  So if you are looking to meet \"young\" individuals, this is not the right place. Upon walking in, I was forced to keep my sunglasses on due to sun rays blazing into the bar.  Apparently blinds were never discussed during the years of renovations.    There was ONE table occupied and everyone else was standing in the bar area. After asking the hostess for a table, she rudely (this is a common theme) tells us that you must order food to sit down.  After little discussion, we decide to order an appetizer so that we can sit down at a table.  We inform the hostess that there will be four people total, although only 3 are present.  She, once again, rudely tells us that everyone must be present in order to be sat at a table--we quickly changed our magic number to three and figured our friend could squeeze in when she arrived.  I understand the not-seated-until-entire-party-is-here rule, but this is not Nick's Tacos on a Tuesday night--this is a brand new bar with one table occupied.  Give me a God-damn break!  On our way to the table in the back, I am beyond puzzled as to why this \"tavern\" is so un-accomodating  This hostess must have missed the training day about being polite to customers, in addition to lacking common manners.    The menu was less-than impressive, but I was willing to try something in order to avoid getting sunburned inside. After sitting at the table for what seemed like 15 minutes without seeing a server, we decided to leave.  And never come back.", 
    "review_date": "2013-09-16"
  }, 
  "fGufoIb1xuK1pXNysJA-pA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "4 Stars: service, ambiance, drinks Negative 2 stars for the food. Ordered ribeye for two- Within what was definitely the non-ribeye'est cut of meat was every thing except flavor- from bloody to very well done all within one steak. And the sides tasted like nothing (gratin potato) or salt (spinach).   Step it up Palmers. I eat a lot and know what I'm saying.", 
    "review_date": "2014-01-18"
  }, 
  "gd4MJcHnaGSTlJ0Q8N68QA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael M.", 
    "review_text": "Great food and a clean friendly atmosphere. The pork chop was excellent. Server was friendly. Cocktails were awful, just off in every way. Advice to Palmers: Don't put cocktails on your sign if you guys can't make them! If you're heading here, just order a beer and enjoy the food instead!", 
    "review_date": "2013-11-29"
  }, 
  "upLpscmqwr7_rhcd1n92xQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna E.", 
    "review_text": "Service was awful, food was sub par. Not worth your time - better places on Fillmore and in SF.", 
    "review_date": "2013-09-20"
  }, 
  "MNpxiH7Ugg-WPD9QwiJILw": {
    "user_rating": 4.0, 
    "user_location": "Glendale, CA", 
    "user_name": "Marion E.", 
    "review_text": "I tried this restaurant on the recommendation of a friend and loved it from the moment I walked in.  Their choice of music (20's, 30's, 40's) and the gleaming wood bar packed with people were perfect.  Bartenders were all vey friendly and efficient.  Dinner was excellent (heirloom tomato salad, shared aged beef, and coconut cake dessert) .  Portions are on the small side but I thought reasonably priced..... And nice not to get portions where I either have to leave half of it behind, or take it home and then never eat it.  The prime rib was exceptional and cooked perfectly.  My only complaint was the potato bread...... Undercooked and over priced.  If I hadn't ordered this starter I would have given them a 5 star rating!    All in all, I am sorry this isn't my local restaurant.", 
    "review_date": "2013-09-02"
  }, 
  "9-GvWmtgo_n_n6E0V85X6w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cristelle J.", 
    "review_text": "I'm on a deviled eggs hype, which really translates too I like high cholesterol and boy do these suckers not disappoint!  Food was mediocre at best, nothing really wowed me.  Drinks, I got the spicy tequila based drink and I loved it! Its a new dining establishment for my friends and I, I like the atmosphere, the waiters, bartenders the pretentious douches you know the pac heights crowd..i kid i kid.", 
    "review_date": "2014-02-21"
  }, 
  "yOlmBn-fjbGWdfVdMgR-Uw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel S.", 
    "review_text": "Came here on a weeknight with my boyfriend to grab a few drinks after dinner. It was surprisingly crowded for a Tuesday night, but yet it only took a few minutes for two seats to free up at the  bar.  I'd been drawn to Palmer's after walking by a handful of times and noticing the dark wood, leather booths, and warm lighting. The decor and atmosphere lived up to exactly what I had hoped for, but the drinks fell a little short. The cocktail list was reasonably priced by SF standards ($8.75 for all drinks on their menu), yet the list was a bit weak, lacking a good variety of drinks or anything very unique. I got the Pimm's cup which was fine, but just went for a gin and tonic after. The bar had a great variety of liquors though, so I think they have the potential to expand their list.   I wouldn't go out of my way to come here, but while in the area it made for a nice end to the night.", 
    "review_date": "2013-11-07"
  }, 
  "mz1n4fPSYNzX57Mvdvnjzg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris N.", 
    "review_text": "Agreed. Eric was a bit obnoxious. I don't post much but what he did was uncalled for.   The bartendress was great but I'm not happy about Eric.", 
    "review_date": "2013-11-21"
  }, 
  "3eE2rdWBtgR9sHTADEga3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon B.", 
    "review_text": "OK - we are happy!  We are thrilled Palmer's finally opened and I have to say the wait was worth it.  No publicity and they obviously did not need it!  We decided to walk down around 5:15 to see if by chance they were opened and Yay!  They were!  We sat at the bar and Erin, Brittany and Will were awesome!  So friendly and for just their second night - they opened around 7 last night - service and drinks were great and very reasonably priced.  At 6:30 we asked for a table and our waiter Trey was on top of everything.  He knew the menu and was able to answer our questions.    We split the bean salad with Macorna almonds and it did not disappoint.  Tommy had the Pork Belly and I had the Cornbread Crusted Chicken with these scrumptious little sausage meatballs - pure heaven.  One of the brother's, Klaus, was warm and welcoming just like his brother Albert who we met at Leopold's a couple weeks ago!  So Palmers, we are so happy you have opened up and there's a very good chance we will visit you at least once a week.  Sharon and Tommy!", 
    "review_date": "2013-08-29"
  }, 
  "hea4v7BtCo8WsZlTsCQUGA": {
    "user_rating": 2.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Robert P.", 
    "review_text": "Management inefficiencies affects this place.  If you have a busy restaurant then have your bus people set the tables.  The tables are empty so the waiters have to bring napkins and silverware. They forget or bring it after your food. The waiter was serving tables on the other side - he walked here. Got a glass. Walked there. Filled it with water.  Then walked to the table. It was like 1 minute of wasted time for him. It's obvious that there is a dining room mgmt problem.  We sat at 6:20 and at 6:35 we order and 6:40 the utensils. It's just amazing how amateur the dining room management was.    Menu is cool.  Yes.  Could use some lighter portions for women or light eaters.  Good bar menu.  Cleanliness score of 96 in the kitchen means very clean!!  Ok.  The frittas (fries) were BEYOND salty.  The meal was so salty. The other person with me said his meal was very salty.  They heavily salt their meals.    The frittas (fries) sitting on same plate as the steak = soggy from steak juice!     A nice fancy restaurant - they don't take American Express.  Good lord!  I wouldn't go back because there are plenty of better options.  I just felt that I needed to get a cholesterol / heart check after this salty meal.    Oh well. C-", 
    "review_date": "2013-10-12"
  }, 
  "aOQHgnLpAstXVzc2GqKzFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy B.", 
    "review_text": "My husband and I came upon Palmer's by chance yesterday afternoon when we mistakenly went north instead of south when looking for a particular shop on Fillmore. What a happy accident! The beautiful Palmer's sign drew us in. We were seated immediately in the gorgeous, high-ceilinged dining room. It was brunch time. The menu was fairly small, but everything on it was interesting. I had the grilled flat-bread with bresaola, gruyere, fried eggs (cooked perfectly) arugula and - wait for it - onion confit. It was a rather massive portion for only 12 bucks - hubby had to help me finish it, despite having polished of the vegetarian frittata on his own plate. We were not going to waste a bite of this dish.  I also had a glass of excellent grenache rose - just delicious. And I would be remiss if I did not mention the excellent service. The host, the server and the owner were all smiling, attentive and genuinely kind. The whole experience was a total mood-elevator. We'll be back!", 
    "review_date": "2015-01-12"
  }, 
  "RhUQ1Vz3-bDMLbIGlcyzfA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CJ G.", 
    "review_text": "Palmer's Tavern disappoints on so many levels.  The menu at Palmer's Tavern centers on more substantial dishes and could use the addition of some lighter selections for women or those who are less hungry.  The roasted beet salad was rather small and only average.  Ordered medium-rare, the Wagyu beef entrée ($23) was overcooked and tough.  Served with cheese, lettuce, and pickle on a plump bun, the burger ($13) was OK, but nothing special.  French fries were so salty that they were almost inedible.  While service at the bar was slow, the cocktails ($8.75) that were finally served were well made.  Service in the dining room is disorganized at best and haphazard at worst.  There seems to have been no planning to the waitstaff's workflow, and there is a great deal of wasted effort, resulting in slow, inefficient service.  A surprising disappointment from Albert and Klaus Rainer of the wonderful Leopold's on Polk Street, Palmer's Tavern is trying hard, but failing miserably.", 
    "review_date": "2014-01-07"
  }, 
  "SW6W00tD4zWHwpPkaUmtPg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Neil M.", 
    "review_text": "Very cool bar/restaurant.  I have been there three times for drinks and each time the clientele were different (one night mostly guys, second time mostly women and third was mostly couples).  Bartenders were knowledgeable and attentive.  Drinks are pricey.  I will avoid for dinner until they refine their food/service based on other reviews.  There are many other food choices in the neighborhood and it is always more enjoyable to have dinner and after dinner drinks at different places.", 
    "review_date": "2013-11-13"
  }, 
  "4fBnfGalnmU2g2rXnekL-Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Clearly this place is a bar that just happens to serve food.  So I didn't have super high expectations as to the menu.  Being this was my first visit I was unaware that a megaphone was necessary to communicate with others in our party.  EXTREMELY LOUD!  Like 1st row at a rock concert loud.  Not sure why they don't opt for some sound boards strategically placed to cut down on the decimals.  It was a Friday night but really it was totally ridiculously loud. Our server was really nice but didn't mention the specials, I just happen to over hear her  yell to the table next to us they had specials.  I was bummed because the Burrata starter sounded so much better than the salad I ordered.  Our wedge salad arrived shortly and it was truly terrible. Soaked with vinegar dressing and little to no blue cheese which is just weird.  My husband thought it was ok but I couldn't eat it so I ordered the Burrata which was just ok. We had the hamburger which was nicely prepared and the fries were good, but they never did bring us ketchup which would have been nice.  At the end of the day the food was just ok at best.  I will say this we were surprised at how reasonable the price of the bill was.  One of our less expensive dinners in the city to date.  In my opinion if you serve food in this city you better get it right and it better be great. Too much competition. I can't see myself going back for anything else other than an early afternoon quick drink with friends then move on to any number or restaurants in the neighborhood that offer amazing cuisine and allow you to actually hear what others have to say in your party.", 
    "review_date": "2014-09-06"
  }, 
  "smopSnmeEzhRU34cans8Cg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sarah G.", 
    "review_text": "A new fave! Recently moved here and this has become our go-to spot for sitting at the bar and having drinks/small bites. The bartenders are fun and super knowledgeable. A classy bar/restaurant with an upscale decor.", 
    "review_date": "2014-09-23"
  }, 
  "5ZEjQxRel2whvf4Nn7kpkQ": {
    "user_rating": 5.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "Marc H.", 
    "review_text": "Absolutely love this place. Just discovered it last night, came back again tonight. If you're looking for a great east coast gastro pub or european brasserie, this is your place. Lively atmosphere, great service, superb food - had the pork chop two nights in a row - and incredible attention and friendliness from the owner, Albert... I've finally found a place in SF that I'll be coming back to again and again and.... :)  PROS: food, small outside seating areas, service, cocktails, ambience  CONS: It is a bit TOO loud, but they're going to address that with some acoustic modifications", 
    "review_date": "2015-01-17"
  }, 
  "EMDcAZbDIaVMB0T90eW_ew": {
    "user_rating": 5.0, 
    "user_location": "Albany, CA", 
    "user_name": "Rebecca S.", 
    "review_text": "Went to Palmer's Tavern the other night with the beau. He got lucky, I was planning on breaking up with him this night, but he scored big with the dinner so I let it go.   The re-done restaurant is beautiful inside and I really loved the music, not too loud but I couldn't hear the people next to me either.   The bartender made me one of the signature cocktails with whiskey. They had some other cool signature drinks I would try, like the Fillmore Fizz or something like that. Yum!   Our server Eric was knowledgeable about the menu and suggested a couple of his favorites, which the beau and I shared. We are big foodies so I was excited. We had the rolls, and the chilled corn soup to start. Fan-freakin-tastic. Then we shared a couple other appetizers, the quail and oysters. NOM!  nom  1) The act of eating  2) An act of affection  3) A sound to express satisfaction through eating   The reviews below seem a litter hater-esque. Who freakin judges restaurant based on one interaction with a bartender who clearly doesn't know the register yet?", 
    "review_date": "2013-09-03"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "Parking is hard but this place is cute.  The bar area is pretty popular and gets loud.", 
    "review_date": "2013-12-09"
  }, 
  "unNFZ4PjCpXoqCQGi-jmlw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jared G.", 
    "review_text": "Shot of Fortaleza anejo at nopa $12 Shot of Fortaleza anejo at madrone $12 Shot of Fortaleza anejo anywhere else $12  Shot of Fortaleza anejo at palmers $19  Do some market research when pricing your bar.    Also, when this is brought to your attention and you take the bill and offer to adjust it...actually adjusting it would be appreciated. Having it brought back the exact same as it was taken from the table only adds to the original frustration.", 
    "review_date": "2013-10-22"
  }, 
  "V7O8r83H45YaSflGZuLJrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony B.", 
    "review_text": "Had dinner tonight at Palmer's.  The food was excellent!  Atmosphere and staff made the dinner even more enjoyable.  I highly recommend the steak tartar!", 
    "review_date": "2014-05-10"
  }, 
  "JXAgq5D-Zcmo1YEFoZhe5A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becky K.", 
    "review_text": "My husband and I really enjoy this place. It becomes one of our regular place to go for a relaxing happy hour.  We loved to sit at the bar and mingle with the bartenders.  We definitely enjoyed their mixed cocktails. My husband current favorite is their Vieux Carree.  They also gave a great happy hour food menu.  We always order their fries, mussels and ribs. Nice drinks, great foods and awesome atmosphere. I highly recommend this place if you don't know where to stop for a drink and bit to eat on Fillmore.", 
    "review_date": "2015-01-07"
  }, 
  "VlMsavF4v8k1_G3qrgeXsQ": {
    "user_rating": 5.0, 
    "user_location": "Orange, CA", 
    "user_name": "Michael C.", 
    "review_text": "There isn't quite a restaurant like Palmers in the classy and quaint neighborhood of Pacific Heights. Right when you walk in, you notice the upbeat environment and multiple animal head decors on the walls. The dim lighting, detailed architecture, and hip music give it a fancy yet casual modern feel that sets the mood for a perfect dinner. If the people working there aren't enough to make you stay(the customer service is amazing!) then the food sure is. I ordered the famous Palmer burger with a side of Mac and Cheese and was I impressed! The burger was cooked to perfection and the Mac and Cheese was nothing short of the best that I've ever had! I would definitely recommend this restaurant to anyone who wants to have a fun night out with their friends just to grab a drink, or for a nice family dinner with very healthy portions. Last but not least, the prices are unbeatable!", 
    "review_date": "2014-07-14"
  }, 
  "W_OiWgYFSilgmOlhJPPumg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jennifer r.", 
    "review_text": "I'm a bit surprised by the negative reviews. I had a lovely experience. My waiter Eric was totally on top of things even though I was dining solo. Very attentive, timely, responsive, friendly. My sole with potatoes was delicious. The spanish olives in the martinis are amazing, and my new friend Eric brought me an entire toothpick full of them after I polished off the first couple. All in all a good, solid experience. Happy to have this location back in business.   I am bothered by the dead animals on the wall (this is san francisco, people, not Texas... really?) but tried to avoid looking at them.", 
    "review_date": "2013-10-23"
  }, 
  "skxsYqnjKmAlwPQ8o7uwww": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "alex v.", 
    "review_text": "First glance, not THAT much different looking from long bar. Unclear why it took something like 2 years to open something here. Warning: the heirloom tomato salad is quite frankly a scam. When I have had a dish named like this elsewhere it is a salad almost totally made of chopped tomatos, think Italian or middle eastern style.  This dish was $11.50 for butter lettuce with 5-6 approx 0.75\" cube tomato chunks on top -- almost a joke. Cocktail was fine. Scene was nice. But overall this place is a disappointment, though I am sure I will give it another chance. Food was real amateur hour and they set expectations way too high for a long bar lookalike.", 
    "review_date": "2013-09-06"
  }, 
  "Iu4M7_XF7ww9Knq84hptlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristian H.", 
    "review_text": "As a neighbor, I have been waiting for this space to have a decent bar/restaurant in it for the 7 years I've lived in the area.  Finally!  I love the decor, and am thrilled to have Palmer's in the neighborhood.    My fiance and I ate dinner here, both having the burger.  I had a similar experience to the other posts here in that the portions were small.  The burger could have had a better bun, and the patty could have had the same size diameter as the burger (i.e it was small).  So I'm a little worried the food won't live up to the decor, although the former is certainly easier to change.  Regardless I'm going to spend a bunch of time here.", 
    "review_date": "2013-08-31"
  }, 
  "thbKQ1nSXKBq0KPXB0KPgw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kenric S.", 
    "review_text": "This place is going to be happening pretty fast!  I came in here around 530p and there were a lot of people in the bar area and some people already seated.  I took a seat at the bar and ordered a", 
    "review_date": "2013-10-24"
  }, 
  "prHi7n-HtPURT2TGfk6zVg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nel M.", 
    "review_text": "Have only been to Palmers once before. It was on a very busy Friday nite. Only complaint was they couldn't find the peppermill to give us fresh ground pepper. Decided to try it tonite on a Sunday.  I sat down to get a drink while waiting on a friend. 5 minutes went by.  A girl and a guy bartender, no one made eye contact. Finally got a glass of wine. Then my friend came in, she sat there for at least 10 minutes, when she finally got the bartenders attention he bought her drink because she was obviously upset.  Just got worse. We had one appetizer and another drink. We sat there with empty glasses while no one made eye contact once again. We left and went down the street to the Elite where we got good service and food.  No more Palmer's for me. Sorry Long Bar went away.", 
    "review_date": "2014-03-30"
  }, 
  "SMaeMOmF5O3k92p_aGXgmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francis B.", 
    "review_text": "attentive service, consistent food quality but the place is really, really noisy on saturday night. I remain a fan and like the wine too.", 
    "review_date": "2014-11-15"
  }, 
  "P_8KFAuJFtoSS1HLcWkX6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick M.", 
    "review_text": "This review is based solely on drinks.  I stopped by this place for the first time last after after dinner down the street.  Only stayed for an hour or so, and had a few drinks and checked out the atmosphere.    Good drinks and a cool space with a manly old school feel and vibe.  Only negative thing I can say is the website said they close of 1:30am, but last call was around 12.", 
    "review_date": "2014-04-20"
  }, 
  "gEDZ76uYpzgd5Vd4-47TNw": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Chuckster S.", 
    "review_text": "Nice setting!  I could do without the dead animals staring ahead of themselves.    I had the burger - fabulous and very high quality!", 
    "review_date": "2014-01-02"
  }, 
  "On3Janj_qyaY_mi6SNyeBA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SY K.", 
    "review_text": "We live in the neighborhood and have been anxious to try this spot, since it would be so convenient and also because we could use another great local place.  On the plus side, special cocktails were $8.75 which are a bargain. Also, our waiter was responsive especially when I didn't actually like the cocktail that I ordered.  When our filet arrived done versus medium rare, he also didn't skip a beat to return it.  Portion sizes were actually quite large as well - the flatbread could have worked for 3-4 people. Unfortunately, I would agree with a lot of the other comments - service is not pro-active. Water glasses continued to sit empty even when the tables next to us had their water refilled. Silverware would disappear and we would have to ask for more. The food was also not remarkable - the flatbread was the best part of the meal. The pappardelle with mushrooms was very gummy - which we felt must have meant that it was sitting for a while. The spinach side dish was very runny and had no flavor. The decor was very odd with the deer heads, and some decor reminiscent of the 30s or 40s but the menu didn't quite go and neither did some of the other decor on the walls. All in all, it felt very disjointed. We won't return as there are too many other great restaurants in the city - and even in the 'hood.", 
    "review_date": "2013-10-19"
  }, 
  "XMvEGq01mJmrbDGl17EP9Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arya S.", 
    "review_text": "Had dinner here. Not vegetarian friendly at all - 2 stars for the food, but 4 stars for amazing cocktails and good service! I love the vibe this place has but will stick to cocktails next time!", 
    "review_date": "2014-05-23"
  }, 
  "QmFelWYM9eBrt_wwJySFTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BRENT P.", 
    "review_text": "Fantastic electric and eclectic atmosphere!!  Great wine and beverage list and good food items.  I particularly like that I can get an early dinner on those \"school\" nights and have a raucous time on Thursdays or weekends.  The owners Klaus and Albert are very hands on and keep the quality of the place in check.  And they are great personalities in their own rite!! Staff is very professional without being to stoic.  A definite \"must go to\" restaurant in San Francisco.  BTW, the Devil eggs are to die for; also the trout and pork chop!!", 
    "review_date": "2014-08-12"
  }, 
  "34aSlaIJpDxF936gdLlMIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse H.", 
    "review_text": "Service is always great at this place.  Space is awesome, drinks are good.  Food had been lacking in previous experiences, but recently had the mussels and they were some of the best I've had in SF.  The steaks at the bottom of the menu (I'd overlooked them previously) are great, too.  Pair that with a martini and boom goes the dynamite.", 
    "review_date": "2014-03-12"
  }, 
  "oBNyoIPlltkGrTV027YaJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie C.", 
    "review_text": "Loved my first dinner at Palmer's and look forward to many more.   I tried it out with a group of five foodie friends and we all loved it.  The ambiance is romantic, old style SF -- makes a lady want to wear fishnets and a gardenia in her hair and snuggle with a beau in those red leather booths.   My perfect Manhattan was perfect and everyone else loved their house specialty cocktails  -- also high marks for the delicious dry Riesling.  Everything we ate was superb -- standouts were the just right meaty, meaty burger with divine housemade chips, squash blossoms and farro, kobe beef, roast chicken and we all loved the heirloom tomato salad.  Service was sassy and friendly -- just as it should be in a retro tavern.   Can't wait to go back!!!", 
    "review_date": "2013-09-11"
  }, 
  "qIF3QULFvc8077KIAlzrqw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sofia F.", 
    "review_text": "Palmer's confuses me.   For a while my husband and I were going to Palmer's for dinner pretty often. Most of the food we've had there was delicious. The lamb was incredibly tender and flavorful. The pork chop was incredibly moist. The gnocchi with duck bolognese was to die for.   And then I had the steak. It was not only overcooked (I got medium instead of medium rare) but it was also completely unseasoned. Not a dash of salt or pepper. It must have been a fluke, right?  A few months later I decided to try the steak again. This time it came medium-well so I didn't even try it, I cut into it and sent it back. My new steak came undercooked (which I prefer but still, not what I asked for) and again it was completely unseasoned. The mushroom sauce it came with was also completely unseasoned. My husband's burger, on the other hand, was perfectly cooked and seasoned.   I don't know how they can get their steaks so wrong and everything else so right.", 
    "review_date": "2014-09-30"
  }, 
  "8AqIUVxErDCsopqxmrxKbA": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dagmar H.", 
    "review_text": "Paid a five star price for a 3 star meal.   The portions were ridiculously small--two plops of rubbery pork that combined for a golf ball sized dinner. $47 for a teensy of steak. The sides were about nonexistent.   All this would've been forgiven, had everything not been overcooked and bland.", 
    "review_date": "2013-09-01"
  }, 
  "MhZPgthtiMeHv9vQs2ezzw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather P.", 
    "review_text": "(from a 10/27 dinner) I haven't written a review in YEARS but thought our experience there warranted one. Sat at a big booth near the bar and ordered drinks and appetizers. I ordered a second glass of wine. Now Palmer's has the wine glasses with lines on them to ensure the bar staff doesn't over pour and they get an even amount out of a bottle of wine. Mixed feelings on it but...Fine. However, we sat there and watched the bartender pouring out my wine from the glass into a tumbler to get to that perfect pour. Spent a bit of time pouring little bit out by little bit...then when he thought he got it to the exact line...chugged the tumbler of extra wine!!! Defeats the whole purpose of it AND heaven forbid you pass along your generous mistake to the customer! Our waitress did get word of my shock from the server and brought over a tiny bit more wine for me, but the damage was done. Wish I could say the food made up for it but the meal was nothing great and the mac and cheese lacked flavor. Really sad to write this review but have given this place a few chances and each time they fall down. Too bad, would love to have a great go-to place in the neighborhood but sadly this is not it.", 
    "review_date": "2014-11-17"
  }, 
  "6p8Qe2wHqlkgDDah7cCjOA": {
    "user_rating": 2.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ani N.", 
    "review_text": "It took 2 years to reopen but not worth the wait! Terrible service, mediocre food and filled with rowdy and obnoxious guests. Don't waste your time.", 
    "review_date": "2013-10-19"
  }, 
  "P70jH_h6a1z562L8thbkgg": {
    "user_rating": 5.0, 
    "user_location": "Downtown, Seattle, WA", 
    "user_name": "José A.", 
    "review_text": "Came in for dinner on a Friday night. Had as started the ceviche and meatballs. Both were wonderful. I enjoyed the freshness in the ceviche. As main dishes we had the gnocchi which was perfectly cooked and well accompanied with the bolognese sauce. We also had the skirt steak with chiles. As a dessert we ended with Chocolate cake which had berries and whip cream. Overall a great dining experience definitely will go back and recommended.", 
    "review_date": "2014-09-25"
  }, 
  "1nfWHE7Gn0a_ymSH0jQUFA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "Good bartender.  An original Joes wannabe. New York Steak was a breakfast steak. Denny's may be a little better.", 
    "review_date": "2013-10-27"
  }, 
  "pNeKYqlB67ZioV2kkQDPyg": {
    "user_rating": 3.0, 
    "user_location": "PACIFIC PALISADES, CA", 
    "user_name": "Alexander J.", 
    "review_text": "Just very average. Had the burger which LOOKED great on paper but came out so mediocre. There's so many phenomenal burgers in the city, really sucks to pay $14 for one this sub par. Server was really nice though.", 
    "review_date": "2015-01-09"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 3.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "Came here for happy hour the other day. It was my first time here since they switched ownership from the Long Bar. Back when I lived in the city, my friends and I would frequent the Long Bar at least once a week. It was a convenient neighborhood watering hole that attracted a more mature clientele than Harry's Bar down the street. Best of all, it was stumbling distance from my apartment.  In any case, Long Bar never really found its footing. Fortunately, the owners of Palmer's seemed to have figured out a way to make this place work. By 5:30pm, the bar was hoppin'!  My friend and I ordered a few drinks from the happy hour menu. I had the Persephone (which was like a pomegranate version of a Cosmo). Although it was only $5, it really wasn't that well balanced of a drink. I kind of gave up on it after a few sips and then ordered a Fernet. Since we were kind of hungry, we split an order of the Spicy Meatballs with Gruyere Mashed Potatoes. For $5, this dish was quite a steal! Some of the other $5 happy hour bites looked delicious as well (especially the ribs with cole slaw).  The bartender was extremely friendly. And what she lacked in mixology skills, she certainly more than made up for with personality. Over all, I really enjoyed the vibe of the space. It's a lot less stuffy compared to the Long Bar days. Plus, they now have outdoor seating (which is perfect for September/October - SF's real summer!). While the Palmer's didn't exactly bowl me over, I think it's a nice addition to the Fillmore neighborhood. I'll certainly be back if I'm in the hood.", 
    "review_date": "2014-09-05"
  }, 
  "xeEHLV1pKMWn4mHqX7RXUA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MJ P.", 
    "review_text": "I can hardly describe how nice my experience at Palmers was - the staff were wonderful, the craft cocktails enticing.  I plan on testing out more of them soon (and by \"more\" I really mean ALL).  Sometimes you'll chat with a nice bartender but I spoke with six employees, all of whom were friendly and accommodating!  (Three barmen, two servers and the hostess.)  I asked one of the servers about a cocktail ingredient, she wasn't really sure but then lo and behold, a sample showed up so we could taste it.  Later, a different employee offered another sample when perusing the gin options.  With poor service the San Francisco norm, it was lovely to feel taken care of and be surrounded by professionals who enjoy what they do.    Kudos (and thanks) to the Palmer's crew!  I'm sold.", 
    "review_date": "2014-06-08"
  }, 
  "0SGLIKAxew4PLsY4TZMWww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich L.", 
    "review_text": "Drinks only review.  Love the atmosphere, very lively and feels like a restaurant out of the past.  We sat in a red vinyl booth, open on both sides, and enjoyed a cocktail with friends.  Can't speak to the food but very solid option for a drink.", 
    "review_date": "2013-09-21"
  }
}