{
  "eI3kJVBJ4NOKspdwylj7UQ": {
    "user_rating": 5.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Rob S.", 
    "review_text": "Free cover charge if you're military. Staff is real friendly. Mixed drinks start at $9. Best strip club in San Francisco!!", 
    "review_date": "2014-09-21"
  }, 
  "yHaKyHVTuOZiWPKj7nqiPQ": {
    "user_rating": 3.0, 
    "user_location": "Miami, FL", 
    "user_name": "Jacqueline A.", 
    "review_text": "One of the better strip clubs in SF. It doesn't come close to LA, let alone Vegas, but the girls here are usually decent looking.", 
    "review_date": "2013-01-29"
  }, 
  "tXBNDhXwhJWyM_mYEtFjbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna V.", 
    "review_text": "Too much $$$$$$", 
    "review_date": "2013-01-05"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "PENTHOUSE, WHERE THE MAGAZINE COMES ALIVE...   Every wo(man)'s fantasy is to devour an epicurean meal while watching beautiful feminine curves with twin peaks and bountiful hind mounds swing gracefully around an elongated pole. Ok, maybe just my fantasy (along with millions of guys) but if anyone could make that happen, I thought the posh Penthouse Club &amp; Steakhouse could.   Gnawing on sub-par food while botox-injected females BOOTY SLAP the floor like they're tenderizing a piece of meat was neither classy nor appetizing. I'm sorry but are we auditioning for a Yay Area rap video?  Self-taught, Chef Mike Ellis comes from the one Michelin starred Dry Creek Kitchen (Healdsburg) and is hoping to gain a Michelin star for Penthouse. From the pedestrian presentation, the lukewarm food, mismatched ingredients and flavors, and poor execution, it looks like they have a LONG way before they can even be considered a contender for that highly coveted star.  F O O D *FOIE GRAS TERRINE w/ Sweet Potato Preserve, Brioche &amp; Fleur de Sel ($24) - 2 STARS <a href=\"http://www.yelp.com/biz_photos/DV1b8JEtcwLz_rXiEBwpag?select=JJlk1VIASpp3yM7gg_EwJg\">yelp.com/biz_photos/DV1b…</a> Failing in both presentation and execution, the foie gras terrine lacked a luxurious buttery mouth-feel. The out of place sweet potato preserve gave an odd, unappetizing sweetness when paired with the foie gras.   *MASAMI WAGYU TRIO: Pork Belly, Sirloin &amp; Cheek ($69) - 2 STARS <a href=\"http://www.yelp.com/biz_photos/DV1b8JEtcwLz_rXiEBwpag?select=eFuTva0KfoNmvDn6wbntOg\">yelp.com/biz_photos/DV1b…</a> A special of the night, Masami wagyu beef is a Japanese wagyu and American angus crossbreed. Being free-range, Masami has less marbling but still possesses full on wagyu flavor.  --PORK BELLY: The best part of the tepid trio but not a success. The pork belly had a good meat to fat ratio, however, was NOT braised long enough to achieve that melt-in-your-mouth texture. An acid should have been used to balance the richness not a sweet pea puree.    --SIRLOIN: Underseasoned, the Masami was nothing like the ones I've had. It was slightly tough and very chewy reminiscent to sirloins I've had at middle of the road restaurants.  --WAGYU CHEEKS: Properly cooked cheeks should be like butter on your tongue. These under braised cheeks were like a brisket and beef shank hybrid. Lacquering the cheeks was an overwhelmingly salty wine reduction making them even more unpalatable.  *BLACK TRUFFLED CREAMED SPINACH ($8) - 4 STARS <a href=\"http://www.yelp.com/biz_photos/DV1b8JEtcwLz_rXiEBwpag?select=AbUhz2XRg7Yig1DAbzHkbg\">yelp.com/biz_photos/DV1b…</a> The best part of the meal, the creamed spinach was decadent and sinfully good with the crown of crisp melted cheese.  *PARMESAN &amp; BLACK TRUFFLE FRIES ($8) - 2 STARS <a href=\"http://www.yelp.com/biz_photos/DV1b8JEtcwLz_rXiEBwpag?select=qvINDMhGg9rRkdej353vDQ\">yelp.com/biz_photos/DV1b…</a> Arriving lukewarm, the fries lacked a crisp throughout and the earthy truffle essence was nonexistent.  S E R V I C E From the cute Asian doorman (Hi, Andy!) to the wait service to the managers, everyone was welcoming and had a smile on their face. Although green and unpolished, the dining wait staff was friendly, attentive, and eager to please (may change if busy).  * * *CREDIT CARD USERS BEWARE* * *   Per our waiter, it's \"company policy\" to take (not look but TAKE) your ID when paying with a credit card. This made me very weary especially when our waiter was gone for a good 10 minutes with my credit card and ID. Additionally, I checked my online account activity this morning and found I was charged $3.67 MORE than what I signed for. Not a big amount but nonetheless SHADY!!! MINUS ONE WHOLE STAR.   T H E  G I R L S (not as pictured in promotional pics online) Nothing extraordinary that can't be found in a SF dance club (average was 6/10) but we had our favorites. Naomi, the ebony beauty had a banging body with a personality to boot; she can definitely work that pole. The engaging Cameron made my friend's bf weak in the knees with her alluring brown eyes. As for the other girls...let's just say, Joan Rivers inspired face lifts, awesomely bad frizzy hair, termite infested thigh high stockings and booty munching butt floss did not help their cause.  A M B I A N C E / D E C O R Elegance meets trendy nightclub (like Gold Club), the key imprinted carpets and trio keyhole door takes you into the main entry way with a beautiful cascading diamond chandelier and luminous lighting.  Dine upstairs in their 60 seat dining room with beautiful white draped booths with a stripper adorned pole (no bare boobies upstairs). Then, go downstairs to the main floor for more booty popping action while popping bottles ($295-$21,000) and making it rain with your life savings. If you come from Generation (Y) Broke like myself, you can make it rain with your lunch money.  P A R K I N G Difficult street parking but valet parking is available.   Penthouse: Where the magazine comes alive? Sadly, I wish my fantasy REMAINED a fantasy...", 
    "review_date": "2012-03-28"
  }, 
  "nh6mz0rxuGu3SAyf5ij-sA": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Anna R.", 
    "review_text": "We decided to try the food before the Grand Opening and came in to enjoy Executive Chef Mike Ellis' food creations on Tuesday evening. The space is nicely remodeled and looks very modern. Penthouse is definitely not your average dark &amp; dingy strip club. This place screams luxury and fun, and this is coming from a woman!  The kitchen is open and has bar stools situated right at the open counter, so you can watch some of the creative cook work while also enjoying the entertainment on the main stage. We were mainly there for the food, but I have to say, the entertainment does not hurt in between courses!  Mike started us out with some oysters topped with caviar. They were refreshing, delicious, and a great beginning course with our glass of bubbles. We then had a trio of seafood appetizer. A perfectly cooked shrimp topped with a slice of tangerine, succulent crab meat topped with avocado puree, and fresh diced hamachi with tomato. Each component had very nice subtle flavors that didn't overpower the other two.   Our first main course was uni crusted cod topped with a curry coconut emulsion and ginger carrot puree on the side. The fish was executed to perfection and all the flavors together worked up a culinary storm in my mouth. This was hands-down my favorite dish of the evening and my boyfriend concurred.   The second main course was black truffle roasted chicken with fresh corn grits and chipotle jus. It was served with three different cuts from the chicken. The skin was super crunchy and the meat was juicy. I don't like grits, but I loved these! It was a very hearty, homestyle cooked dish that went great with the paired chardonnay that the chef suggested.   For the third main course (yes, we ate a lot that night) we each got the duo of Rosen Colorado lamb - a rosemary roasted bone-in chop and a 36-hour sous vied shoulder with fava beans and carrots in an orange black currant sauce. Both cuts of lamb were tender tender tender. They were to tender that I even ate all the fatty parts, which were absolutely delicious! Second favorite dish for the night! I'd order this again anytime. Lamb gets executed well in few restaurants - hats off to the executive chef at Penthouse! This dish paired very nicely with the A by Acacia Pinot Noir.  My boyfriend got the 28-day dry aged bone-in ribeye with chimichurri sauce and I got the grass fed filet mignon with shallot confit and sauce Diane. We were both getting full at this point, but not full enough to not devour both of these beef dishes. The chimichurri sauce was the best we have ever had and really enhanced the juicy ribeye. My filet mignon was tasty and rich and the shallot confit added a nice sweet touch to the dish. We had the Jordan Cab with the meat dishes.  This was one of the best food experiences I have had in a long time! Every single dish was eaten in its entirety and the bits were scraped off the plate with our forks. I would have licked the plate had I been at home. Executive Chef Mike Ellis has created an amazing and versatile menu that is guaranteed to please anyone's palate.", 
    "review_date": "2012-03-15"
  }, 
  "IZuhpzctXozb30ZGNx2PwQ": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Nikki M.", 
    "review_text": "Good lord if I could give zero stars I would, ouch this place was really that bad I'm sorry. It was forty bucks a piece to get in at 10 o'clock. Yes you read that right. Most expensive cover I've ever paid. But we thought hey lets give it a shot we always pass this place and have never gone in.  The place was dead. Bad sign. My bf and I got some drinks and sat stage side.   The first couple girls were thin, I mean realllll thin, like anorexic thin, like anorexic and a meth problem thin. The last girl was so hideous I just didn't know what to do. My bf and I were in shock and we just kept looking down or away. You know it's bad then cuz I will typically look at any naked woman and be appreciative, but this, this was just horrible. I'm not trying to talk shit or be mean but I was seriously just completely shocked at this last dancer. Such masculine jaw and frame, I just couldn't believe my eyes, it was painful to watch, she was trying hard and the other two people sitting stage side were completely ignoring her as well. I normally always tip at least a buck or two out of courtesy because I mean these girls are getting nude for your entertainment but good lord!! I was resolving to at least throw out a single when she just up and ran off stage.  At this point I just felt bad and we tried to slurp down our drinks as quickly as we could so we could leave. An Indian girl tried to get us to get a couples dance. She was pushy and totally uninterested. We tried to decline politely but she persisted ad we finally just up and left.  Do yourself a favor and walk 5 mins down the street to Hustler. Prettier girls by far, better and more enticing environment. You'll be much more pleased.", 
    "review_date": "2013-12-10"
  }, 
  "9yPITTB_nUpXkau8IqfPqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raquel T.", 
    "review_text": "last yr for the bday boy we had dinner and strippers in vegas.. this yr it was the same except in the city..  they had a few cute girls and a friend bought me my second ever lap dance (the first was in vegas).. i originally wanted a different girl but the bday boy disappeared getting his own private lap dance for 2 hrs! the cute asian girl i was trying to wait for was named joi.. she's really good and made a few mental notes watching her perform..   penthouse is pretty spacious and the decor is pretty nice..i'd come back again if someone asked me to", 
    "review_date": "2013-03-07"
  }, 
  "zvQ6LxcUXF8spDIa5u4TdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rhys P.", 
    "review_text": "Dinner was absolutely amazing.  Steaks were just as good as any top steakhouse in SF.   Our hostess Thalia was the best and I would definitely recommend to anyone that's looking for a nice spot to dine and enjoy beautiful entertainment.", 
    "review_date": "2014-06-07"
  }, 
  "XRpS6Jj0TPHo_P7y_xIVOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "flip f.", 
    "review_text": "Awesome place to eat. The filet is off the hook. Management is top notch and knows how to show their customers a great time. I'm going to frequent this place more. The Girls are cherry on top.", 
    "review_date": "2014-06-07"
  }, 
  "QURPCNf0VbBjkSvcItZUPA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yuliya L.", 
    "review_text": "This a great place to perform and show my art, dancing. I like the clientele type and their generous tips. Older men rock! I like the opportunity that it offers to a girl like me from Ukraine who is trying to make it in a foreign land away from my family and best men.  I give 100% every night; right on the floor and pole.   See you there ;-)", 
    "review_date": "2014-03-11"
  }, 
  "Vg8OKgQlscRizL9haLEYYA": {
    "user_rating": 1.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "joey k.", 
    "review_text": "Place was horrible. Rat was found and we caught it for them. Customer service sucked as they didnt help with anything. Oh and i posted this before but someone deleted that review.", 
    "review_date": "2014-09-27"
  }, 
  "XCHojR367vKiXvIF-Z7sAQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Anonymous G.", 
    "review_text": "As I am not a wanna be food critic i will not go on and on detailing every feeling i got from each bite. I will however mention my 13 course birthday dinner was awesome. Both my fiance and i were blown away. My personal fav courses were buttermilk fried chicken and mushroom gravy, crab cake and kumquats, kobe trio, butter poached lobster in passionfruit and the porkbelly/poached egg.   Killer baller bubbly list. Ace of Spades? Really? Awesome.  Want a fun date? Come here with your significant other. My gf loved it.  Sexy girls and great food make for a great time.", 
    "review_date": "2012-04-16"
  }, 
  "TPN1HK1GrOqCK5yKhsPgww": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Isabella T.", 
    "review_text": "want to find the sexiest asain bartender in sf? here it is, Justina is super friendly and beautiful ;)", 
    "review_date": "2014-12-23"
  }, 
  "IWgBt5RMGIeLECqlNv996w": {
    "user_rating": 2.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Jam H.", 
    "review_text": "They said I could order food and they closed the damn kitchen 5 seconds later!! The girls are ok, but the actual club is super cute. The scheme is set up just right, and for $800 an hour you can get a basic chic to grind on you. The stars are for the bartender Elena... she was great!", 
    "review_date": "2013-09-26"
  }, 
  "pn47jqUxe_BgzetnTGyojg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Philip W.", 
    "review_text": "4 stars for the food order the dry age steak with the fries 3 stars for the ladies some were hot but a lot look like average 1 stars for the drinks because i had 3 drinks vodka tonic and I wasn't even buzz, you would think they wanna get you drunk to spent money.overall it was okay I'm surprise it wasn't pack considered its the grand opening weekend.", 
    "review_date": "2012-03-17"
  }, 
  "tGjRQesCrkscTbB16IwkRw": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "V W.", 
    "review_text": "Loved it. The food was pretty good and the show was fun. I've been to the Sapphire in vegas and this was def much more fun! The drinks there are a bit on the traditional side being not too many exotic/innovative drinks. The service is great. (Could also be that my bf &amp; I got there around 9/9:30 so it's a bit early). Loved the ambience. It's kinda hip ...though on the sleazy side. lol The canopies are a fun touch. Tip: get there a bit early...we got seated right by the pole (literately like 10 ft away on the 2nd floor w/ the downstair stage right there... The food/drinks are a bit on the expensive side...at least no admission fee if u eat at the restaurant", 
    "review_date": "2013-06-15"
  }, 
  "n9BEmvzdSeM8WVAwanyaow": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K L.", 
    "review_text": "Overpriced beer, drinks and food. Below average dancers...I thought you had to be sexually attractive to be a stripper? I guess anything with girl parts and a bad weave can get hired here.  I really, really wanted to like renovation they did when it went from Showgirls to Penthouse. But all they did was jack up the prices and change the interior to distract you from the fact you are now paying more money to look at the old lineup from Showgirls. Yawn.   Two stars only because they got rid of the horrible mismatched decor from Showgirls.", 
    "review_date": "2012-07-25"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "I said I wasn't going to do it, but oh well. I'm writing a review on Penthouse. Here we go.  We had a large group dinner her for a birthday. Reservations were made, so it wasn't like they didn't know we were coming. So what happens?  30 minutes to come around and take  our order. 30 minutes after the order was taken, we're told they don't have enough meat to make burgers. 8 of us ordered burgers (but only because they didn't have filet mignon) and they only had enough beef for 4 orders. good grief. an hour later our food came out. I had ordered my burger RARE because I was warned they overcook things. it was way over well done and salty as hell. I barely touched my burger. good thing I ordered a side of jalapeno mac &amp; cheese! It was edible, even though it tasted like jalapeno cheddar Cheetos.   Here's the kicker.  On a Thursday night, the restaurant empty and only our group (keep in mind we had a reservation!) dining... THEY RAN OUT OF UTENSILS.   They gave someone in our group PLASTIC UTENSILS to eat a rib eye.  5 stars for Gidget though, she's hot.", 
    "review_date": "2014-09-26"
  }, 
  "pDfL8xt8F8ls0-kQIG_ADg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Earl G.", 
    "review_text": "Came as a group of 10 guys for a friends birthday dinner and have to say this is instantly THE spot for SF bachelor parties or a special guys night out.   Their entire staff was classy and casual.   I never went when it was previously old Boys Toys but inside it looks/feels Vegas-y. Some friends said they haven't seen a place like this every since their return from Miami.   There's two levels. A dining area upstairs and the main floor downstars. Along with a 2 story pole. A two story pole. During dinner, some girls would climb up and the birthday boy would go over there and give them high 5's. Plus, the girls below liked it when we made it rain from upstairs on to the stage below.   * 28 DAY DRY AGED 16oz BONE-OUT RIBEYE ($58) As fitting as the NY Strip sounded, you can't go wrong with ribeyes. Fancy for being topped with a chimichurri sauce and an onion confit. The broiler it was cooked in didn't get hot enough to create that addictive char. Not the best steak in SF but given the amenities better than I expected.   Thumbs up on the corn grits, roasted mushrooms, black truffle fries, and black truffle creamed spinach sides.   The joint is trying be fancy but for what it is, the food ain't that bad. SF hasn't had anything like this before. Say bye bye GC.", 
    "review_date": "2012-05-15"
  }, 
  "UlmI0daX0yMiIa_jhAWwSw": {
    "user_rating": 5.0, 
    "user_location": "Hubert, NC", 
    "user_name": "Brook K.", 
    "review_text": "The steak is out of this world. If you go just for a great meal you won't be disappointed.", 
    "review_date": "2012-05-21"
  }, 
  "Dussqojz-FcaO6QkkQ2g6Q": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michelle C.", 
    "review_text": "When I first heard of this place, I thought to myself -- a Michelin chef at a gentleman's club? I must give it a whirl! So, 3 weeks after they opened I headed up with a few friends for dinner &amp; entertainment.   This review will encompass 2 aspects: DINNER and DANCING.   DINNER - 4.5 stars Our server, Mike, was phenomenal.  He had a ton of personality and was quite attentive.    Between the four of us, we each chose different dishes and tried each others. I'm very pleased that we did too - because this improved my opinion on the dinner.    *grilled marinated asparagus - REALLY good.  The meyer lemon &amp; poppyseed dressing (dollops on the side of the plate) paired really well with the egg, manchego and asparagus.  I'm not sure how I feel about this as a starter (because it's not a salad) - but would make an excellent side.   *flash seared hamachi - delicious. The hamachi nigiri comes on top of a spooned out portion of avocado adorned with julienne jalapenos and a tiny boxed bowl of ponzu on the side.   *terrine of Sonoma foie gras - quite good. The brioche looks more like texas toast than anything but the sweet potato, fleur del sel and foie gras marry nicely. In fact, after reading the other reviews before going - we had to laugh (while enjoying this) at the girl who said the sweet potatoes added an unappetizing sweetness.  Foie gras is usually paired with something sweet...  *lamb - WOW.  This was the star of the entrees as far as I'm concerned.  I only wish I'd ordered it for myself! flavorful, juicy, delicious...   *buttermilk fried chicken (special) - moist on the inside, flavorful on the outside though not very crispy.  Mind you, I only had a bite of this.   *pork belly (special) - perfect.  *trio of beef ($69) - This is what I chose and would never choose again. Well, maybe the beef cheeks - those were suuuuuuuuper tasty.  It reminded me of eating my mom's stew though, which given the location, was slightly odd.  ;)   The second part of this trio was the sirloin.  I asked the sirloin be cooked medium rare.  When Mike came over to see how we all were doing I had to point out that it wasn't medium rare, but medium well.  (<a href=\"/redir?url=http%3A%2F%2F1.bp.blogspot.com%2F-G8GPQA8Ha7w%2FTdWmrZzk9sI%2FAAAAAAAAAI4%2FXKnNSSqOMuA%2Fs1600%2Fsteak_doneness.jpg&amp;s=4dac8218c3b873f5869f0d833f1fe2c77a4f7dc59aae5e21adb1731e65e36c92\" rel=\"nofollow\" target=\"_blank\">1.bp.blogspot.com/-G8GPQ…</a>) I felt awful sending it back but when you're paying $70 for 9 oz. total of meat... it ought to be perfect, right?  He brings it back and asks me to check -- this time it's just medium, but you know that?  I'm certainly not going to send it back a second time - so I take a couple bites and then pass it along.  After going downstairs, I realized the cooks in their open kitchen must've been distracted by the ladies on stage. ;)  Finally, the beef belly with celery &amp; broccoli purree &amp; crispy rice left me wishing I'd requested the pork belly instead.  The beef belly was just not my thing.  My girlfriend and I both thought it was just way too fat.  The boys on the other hand seemed to like it.  I did manage to eat one piece that had some meat on it and was REALLY good.   *fresh corn grits - OMG --- best I've ever had.   *truffle fries - calling them truffle fries is generous; There just wasn't a strong truffle presence.    *mushrooms - This was the one thing on the table I didn't try because i became full.    *espresso -- it's espresso -- it was good.  Although, my friend had to ask for a zest of lemon and they don't have raw sugar or even cubes.    We all were drinking Jameson that night and let me tell you -- weakest pours ever.  The Jameson/rocks were so watered down a child might've mistaken it for apple juice.   I recommend you order it neat so you can properly gauge what you're drinking.    DANCING - 3 stars Before paying for dinner and leaving, we were asked if we wanted a table downstairs, so I said yes.  What was nice was that it wasn't some scheme where you say yes and then you're stuck with some mandatory minimum or bottle service.  It just meant we had a table reserved for us.   We were greeted by a really pretty girl in a green dress whose name escapes me -- but that could very well be due to how quiet she was talking.  It's quite loud in there - so use your big girl voice!  The table they reserved was near the main stage and met with your typical, comfortable chairs and a tiny table. Behind this main are and near the bar was a smaller second stage where girls just looked like they were practicing. There's also a third \"stage\" on the 2nd level w a glass floor.   Each girl took their turn with 1-3 songs and only a few of them even used the pole.  Even less had any enthusiasm which was highly disappointing. Possibly more disappointing than the dancing, and perhaps a reason for it - the music was AWFUL.  It's not a club - I don't want to hear high energy music or see them try to dance to that.  Are you kidding me? Lame.  AMBIANCE The place is beautiful - there's no doubt about that.   I look forward to seeing how the Penthouse Club &amp; Steakhouse progresses especially as a restaurant.", 
    "review_date": "2012-04-09"
  }, 
  "nHz03u8w0mSsstyqO5V4Rg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Emma G.", 
    "review_text": "by far this is the best club in the city!!! upscale, great customer service from everyone, the women that i spoke with all had wonderful attitudes and great smiles. I will defiantly come here for dinner, a great place to lounge and have a good time with classy people!!! love it!", 
    "review_date": "2012-12-11"
  }, 
  "LOi1qbpl2hTP0cwSDDuyBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirley N.", 
    "review_text": "Adult entertainment.  Located on the Broadway strip.  Pretty decent food tonight also .  Great sliders. Here at the preview tonight.  Lots of entertainers = scantily clad girls.  And a couple of poles.  Two levels with a VIP section and a see thru floor.", 
    "review_date": "2012-03-12"
  }, 
  "yzOeHaHGNpo-So2O2zVCYg": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Khaled A.", 
    "review_text": "Boring place... only topless! Service isn't that good..... Pretty gurls.... prices are very high comparing to LA.", 
    "review_date": "2014-03-26"
  }, 
  "zChnY-VI-vx_Hs3ol4xR7Q": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Daniel O.", 
    "review_text": "Suzy is the best . She is the only reason I come here. Best bartender in sf :) and the strippers are nice too", 
    "review_date": "2014-06-20"
  }, 
  "AIaegsReyPT1j66wRyQHCQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave L.", 
    "review_text": "I'm not going to lie.....I like coming here.....  I remember losing my house keys here once and the ladies were kind enough to not only find it for me but to also make sure I get it back when I came roaring back to the club looking for my house keys.  Try out there $10 Burgers on Tuesdays...it's surprisingly really good. (just don't expect the $10 dances though, the girls will rip you a new one)  Bartenders and waitresses there are also awesome. It is a bad sign though if they know your drink of choice and will have it ready for you before you get to the table....just saying....", 
    "review_date": "2013-04-22"
  }, 
  "IEVcPC_-fr0_165VAYNuDQ": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Don A.", 
    "review_text": "The place is nice, the girls were cool and the steak wasn't bad.  It's expensive to eat or play but it's free to watch! haha", 
    "review_date": "2012-09-27"
  }, 
  "5v6juPIOisfmogp7QSso-A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "The girls were not very attractive or engaging. And they only get topless. Not very exciting.", 
    "review_date": "2015-01-24"
  }, 
  "K4mollfuSh6gXNqStVagPw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Wayne H.", 
    "review_text": "Unlike other  reviewers I do not go to a place called the Penthouse for the food. I did go during the recent ( Nov. 21, 2014) toys for children drive put on with the SF Fire Dept.  The girls circulated around the customers were very pretty , friendly and not pushy. You could leave a dollar or more in their little box. They all took turns dancing.  I asked for a beer expecting to get ripped off so I gave the bartender a twenty and , to my surprise, he gave me back 20 singles whch I used for tipping.  The place was clean, dimly lit and not too noisy. I will be back.", 
    "review_date": "2014-11-29"
  }, 
  "YAG90mceVFQLdvl4wndvQg": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Margaret R.", 
    "review_text": "I came here for a bday dinner. The food was good, but pricey. I expected the food to be better since the chef comes from a michelin restaurant.   The strippers are pretty. The place doesn't feel as sleazy as other strip joints.", 
    "review_date": "2012-09-10"
  }, 
  "GeBDMbEgZMcN03Dy5g6jTA": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Seymour D.", 
    "review_text": "pretty girls, tall pole, good pizza.  kinda pretentious, but that's how all the corporate-run clubs are in this city.  at least there wasn't a $20 cover, like at gold club.", 
    "review_date": "2013-08-01"
  }, 
  "INZ0UAW9xrHTcYpDv_4kog": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sherkane D.", 
    "review_text": "Just passing by on a random tuesday night while visiting the city. The club looked so great from the outside that I decided to go see what was in there. Surprise, it actually was a stripclub (I didn't know about the famous Penthouse...) and it looked even greater inside! The host was so beautiful that I asked her if she was that girl on the cover of their Penthouse Magazine haha, true story! I only paid a $10 cover charge because tuesday apparently is their \"perfect 10's\" day. Drank their $5 belvedere drinks, tried their $10 big ass burger and had a great time! I'd definitely go back asap with all my boyfriends!", 
    "review_date": "2012-12-12"
  }, 
  "N3GFVXPZkodIg6zxYvYXbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M. M.", 
    "review_text": "Best happy hour in city! I can't believe there is still a place that serves $2 drinks till 7pm in San Francisco! Kind of dark inside (duh, I guess), but staff was nice and like I said, $2 drinks.", 
    "review_date": "2013-02-03"
  }, 
  "ouXD5thJgXxP0e7Ldw4Ozw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan B.", 
    "review_text": "not a fan", 
    "review_date": "2013-07-30"
  }, 
  "RR6chkvedisFnKmo8eu65g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa Z.", 
    "review_text": "What can I say when I have a friend who spends like a boss there? Who has bottle service all the time and gets me dances too? That girl was hot and sexy too bad I forgot her name. It's one of the biggest strip clubs in sf and it's nice. So many selections of bottles just in case you want to spend like a bolla. I also tried their finger food which wasn't bad at all :)  I was also there for the annual Christmas party for all the people working for that entertainment. Had a great time!! Def recommend its a classy affair", 
    "review_date": "2012-12-23"
  }, 
  "PxHpCoMbipzo2hIZo69ICw": {
    "user_rating": 1.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "David A.", 
    "review_text": "What a rip off.  U want the real thing contact me. I'll show you. These guys are fakes and stiffs", 
    "review_date": "2013-01-17"
  }, 
  "D8JswSWcY-fznIm05Y3WZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marlon R.", 
    "review_text": "OK...had a friend who worked here...it was better when she was there.", 
    "review_date": "2013-04-16"
  }, 
  "xC7eE7ef4wl74kFegWbSkQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren J.", 
    "review_text": "I had a great time out with the fellows at Penthouse. This is the nicest club in the area by far. The women there are beautiful and incredibly talented. The stage has a two story pole and its quite remarkable to check out the acrobatic feats these women pull off seamlessly and effortlessly. The club is ultra high-end and I really liked how friendly and attentive the staff was. I was especially impressed with Jonny, the club manager. He made sure our party got a great table and made a point to check in to see how we were doing. I'm pretty sure everyone in my party was thoroughly entertained. Looking forward to checking out their Happy Hour soon.", 
    "review_date": "2014-03-30"
  }, 
  "qXPXW-0HQtnydQiC6ejOkg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monica M.", 
    "review_text": "I came here for my birthday and the place is absolutely gorgeous! It's what you would imagine a super high-end club in Vegas to look like. For anyone doubting that a strip club can be classy, one night in here will change your mind. The entire staff was excellent: our host was such a gentleman and I loved our cocktail waitress Erica! All in all I had an amazing night. I'd recommend this place for bachelor parties, guys night out, girls night out...any event really. Oh, and 2 story stripper pole = awesome.", 
    "review_date": "2012-09-14"
  }, 
  "q3xc5_Ku7NZEVw2u42gjhw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cilla B.", 
    "review_text": "So much fun", 
    "review_date": "2014-06-30"
  }, 
  "7QEjPfRJu4-ctV-MOxNWdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda A.", 
    "review_text": "Johnny the manager treated us like royalty!! Thanks Johnny. Great night celebrating a birthday with these pretty ladies and nice gentlemen. Totally better than the manager at McDonalds in Vallejo!!!", 
    "review_date": "2014-02-02"
  }, 
  "V_A_V9-DFi3g1kSaOmbQ2g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cameron S.", 
    "review_text": "Call to make a reservation for 12 guys- I am advised to go to <a href=\"/redir?url=http%3A%2F%2Fopentable.com&amp;s=897c359bd752b4f5407d5ea86453c82be2d1913c8d0b51b18d81fc58f52a6497\" rel=\"nofollow\" target=\"_blank\">opentable.com</a> bc \"that is the only way to make a reservation.\" Strangely, in this operation, the person who is at the actual location is unable to place reservations in the system. Furthermore, <a href=\"/redir?url=http%3A%2F%2FOpentable.com&amp;s=e2215de09505b8fbf3a047b68af38708cbc8b52c843ab34faaecc46b3704d557\" rel=\"nofollow\" target=\"_blank\">Opentable.com</a> does not have any record of the restaurant- nor does google. I then call back- at this point I am greeted as if in a confrontation as if I did something wrong. Again advised to open table. I was wondering why the prices came down but now I is obvious- HELLO PEOPLE- YOU DONT HAVE ANY RESERVATIONS BECAUSE YOU DONT HAVE ANY WAY TO MAKE THEM!!!!!!!!!!!!!!!!!!!!!!! Hmmm...... Trying to think of the last \"Michelin Star\" restaurant I called that referred me to \"open table.\" Are you guys joking??", 
    "review_date": "2013-12-01"
  }, 
  "zCdPZHfJk5fwYtf9V_E1hA": {
    "user_rating": 1.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Ryan C.", 
    "review_text": "One word, RATS! Do not go. Owner didnt comp anything horrible management  we asked for a round of drinks and he said no, that's too expensive for him! His argument was that nobody got hurt.... We were the biggest party there. Highly disappointed.", 
    "review_date": "2013-12-15"
  }, 
  "ty-OlvcgAykAM8Es4REs9w": {
    "user_rating": 2.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Dreamer L.", 
    "review_text": "Food came out extremely late. Steak wasn't cook to med rare like I asked. But it was kinda fun watching people strip while eating haha", 
    "review_date": "2012-12-15"
  }, 
  "UwhGIbPgHd2SbPnTC27UNg": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Tess K.", 
    "review_text": "My first experience at a gentleman's club was here. It was awesome. I never thought I'd use strip club and  classy in the same sentence. This place was very nice and eclectic inside, newly remodeled. Something even better than their facility was their service. We had dinner there and I had the lobster risotto, very good! The chicken and chocolate covered strawberries are also very good! All the staff there are very professional and outstandingly NICE. Edmar is great and made sure my whole party of 10 was well taken care of. Great experience. Will definitely come back for dinner and big events.", 
    "review_date": "2012-06-26"
  }, 
  "FC5FkBm-EaT8x1XOAw24xw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BigArm K.", 
    "review_text": "Wow, went here on a Friday night, and my first thought was \"Why are all the B girls here?\"   Not one hot girl the entire night. It was pitiful. The venue itself is amazing, which is what makes the lack of talent even worse. I'm going to need some time before I give this place another shot.", 
    "review_date": "2013-04-30"
  }, 
  "ajbeG9fl21brNOAbXlIIcQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Neil P.", 
    "review_text": "First and foremost I'd give this place a 5/5 but the dancers are the only ones who really stopped me to be honest. I had heard about this place from a good friend of mind and decided to head out with some others to check it out. From the outside your automatically going to thing that it's your typical dirty strip club but wow when I stepped in I felt like I was in an episode of Miami Vice.   The interior is very fresh, the hosts and hostesses are very friendly as well as the kitchen staff. Went upstairs and had dinner, I had the beef carpachio? (Sorry I can't spell but it's yelp who gives a F on spelling haha) Anyway went down stairs to have some of fun and boy did we ever. Let me put it this way if any of you are champagne fans these guys have an excellent selection...from middle class to I'm an ignorant FFF and I'm buying out the bar! From a cheap bottle of rose' to Ace Of Spades..(Including MAGNUM size) they can convene to your champagne wishes. The hostesses are hotter than the dancers that's why I gave it a 4/5.   The service here though is top notch..I wont go into detail but let's just say I had some cups of the rose and lost a $500+ car remote to my vehicle. The next morning when I realized what had happened I called up and they said they had the keys and they'd place them in their valet box and that I could pick them up anytime. These guys saved me hundreds! which is totally the opposite when you think of a strip club but it was true! Anyway came down picked up my keys and still chopped it up with all of the staff great great people ladies and gents please come check this place out. To be honest this is my favorite spot to eat I really don't consider this a strip club. I'd honestly take a first date here because it's THAT CLASSY!", 
    "review_date": "2012-06-11"
  }, 
  "Yj1a3IApDb8hhl_5TSmUdg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "R. G.", 
    "review_text": "Went to the grand opening- LOVE this place!  The highlights: Service was over the top friendly and my drink was never empty, Floor to ceiling glass Champagne case, glass upper level stage(peeka-boo), white leather dinner booth that was like sitting inside a genie bottle, bar is tiled in Rolex watch bands-  It's all so over the top- what else could you want out of a gentleman's club?  Honestly, I came for the g.o party with my bf but I think that next time I'll go back for girls night out!!!", 
    "review_date": "2012-03-29"
  }, 
  "RQWI-qBuhKGGAf76czrFTA": {
    "user_rating": 1.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Greg S.", 
    "review_text": "As a man, I am inclined to write this as a 5 star raving review.  As a person that experienced shady service and complete disregard of courtesy, this will not be a flattering review.  The story:  Large group of us (17-18 or so) booked a 3 course dinner and bottle service.  The email and phone-call exchanges occurred for several weeks prior to our event.  We finally chose the menu, paid a deposit and proceeded to get everyone amped up for a fun night on Broadway.  The Drinks &amp; Dinner:  Drinks were on par price wise, my bill was over $200 and I thought that was generous given that we ordered several shots and drinks (just on my tab).  So the bartender should get 5 stars.  ---The Food: First Course was lobster bisque, decent.  2nd Course was Steak, pretty normal tasting, not too flavorful and certainly not worth the price.  The dessert was some chocolate cake that was okay but tasted as if it were store bought.  The Service from Management:  I understand it was a Friday night in the City, but it was completely empty when we were eating and we wanted to make our way downstairs for our bottle service to watch the show.  Management disagreed with allowing us to bring our group downstairs!  They said that they could provide our bottle service upstairs only, where there is no action, no dancing, and even LESS PEOPLE!!!  There was a manager that could pass for an awful Robert Downey jr look-alike; and he  was a jerk to keep this PG if you know what I mean.  Key Points:  --Not willing to work with us at all --Their club was super empty at 11:30pm  --We had been told that we could go downstairs and then the one manager said no it was just super lame sauce.  Why have one manager say one thing and another says no?  HELLO!!! COMMUNICATION ISSUES MUCH?  Anyways, we were not impressed and Ill never go back.", 
    "review_date": "2014-06-11"
  }, 
  "64o6vJrByaGTStMvvU45JQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan M.", 
    "review_text": "Where else can you meet a dancer who forages for mushrooms and knows about copyright law? Seriously. Yes, I know I'm supposed to go in and be simply tantalized by sculpted bodies and ample breasts. And it is true that I do find that titillating. But someone who has an opinion on open data? That moves me from lust to smitten.  So any club that hires that kind of dancer wins my support. Plus the space is clean, modern and friendly. Only occasionally do they have one of those announcer fellows who sounds like he came right out of a bad movie (Let's here it for Caannnndy). The bottles are expensive, but not much more than bottle service at a bar. The patrons, for the most part, aren't that kind of gross sleazy variety you sometimes see in some clubs.  And if you show up when the place isn't fully packed, you might find yourself talking to someone who is not only beautiful, but actually can hold their own in a conversation. That's worth something.", 
    "review_date": "2013-03-03"
  }, 
  "8QznvBIK03NtvXjxesVMLw": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jesse L.", 
    "review_text": "STOLE FROM US!!  SKETCHY PLACE AND OPERATORS  They quoted us $200 a bottle for patron and then charged us $400 a bottle... It's listed as $260(I think), so either way they straight up robbed us and threatened to have us arrested if we didn't pay the $400 rate.    There were more awkward guys that work there than there were chicks...   It's a pretentious and really not that great a club.   Being from Portland I have a great deal of experience with gentleman's clubs...This is no place for gentlemen.  Go at your own risk, they may fleece you, and you prolly will just feel akward with the like 10 guys in suits staring at you the whole time.", 
    "review_date": "2013-05-12"
  }, 
  "FDRlrLDhgaQJ7Y0HwJypKg": {
    "user_rating": 1.0, 
    "user_location": "Davis, CA", 
    "user_name": "Jennifer Y.", 
    "review_text": "Came here for New Years and it was one of the most disappointing experiences I've ever had. No open bar, and the environment didn't feel very \"moulin rouge\" like they advertised. There was a photographer, but none of my friends (in total a party of eight) had our pictures taken ever. The guests were all trashy (a couple grinding heavily at 8pm), practically no one was dancing, a couple of old guys (read: 60) fist-pumping around young women. And there was no champagne toast like they promised in their advertisement. Lesson learned: don't pay $50 for a NYE party without an open bar.", 
    "review_date": "2013-02-09"
  }, 
  "YFpIbSmPxZK5LWjWnf_INg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cordane C.", 
    "review_text": "Would you believe   the best Happy Hour and the best looking bar in North Beach is in The Penthouse on Broadway and Montgomery.  With $2 import beer, well drinks and no cover Monday through Friday before 5pm (they open at 4pm), you really can't go wrong.  The scantily clad smoking Hotties strutting around doesn't hurt either.  The Penthouse has, without  a doubt, THE nicest bar/club in North Beach.  I've been a customer of this location since back in the Boy's Toys days and it's never looked better than it does now.    The decor is immaculate along with the staff from the 1st person you meet at the door to the last person you meet when you're leaving - everyone is a consummate professional.  Whenever my friends arrive, we feel like Royalty being welcomed home.  When we leave we're already planning on when we're coming back.    Women enjoy this place. It's such an amazingly nice and inviting atmosphere that my friend, his wife and all of her friends enjoy coming over for happy hour.  I have other friends who bring their girlfriends (it was their GF's idea) and everyone has a great time.    The Penthouse hits the top mark by simultaneously being classy 'and' comfortable whether you want to drink, eat dinner or just lounge (or a combination of all 3) but don't get me wrong.  If you want to enjoy more than just the happy hour drinks and the amazing food and ambiance, the Penthouse women are drop-dead gorgeous and Smokin' Hot.  Whether you stay after happy hour or not, The Penthouse is the best place to get your night started and if you're lucky enough to chat with Jonny, Akio or any of the other managers, bartenders or staff that make this place amazing, you're probably going to end up staying.  You'll certainly choose to come back for more!", 
    "review_date": "2014-03-14"
  }, 
  "Sn7HFeUz_5S1JfK_FhBRpA": {
    "user_rating": 5.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Pat B.", 
    "review_text": "WHAT A GREAT TIME!!  My boyfriend and I ventured to the brand-new Penthouse Club &amp; Steakhouse a few Saturdays ago and we had a really, really great time!  Not only was Glen, the GM and the entire staff super friendly but it was the absolute perfect place for our date to end!  From the moment we were greeted by the doorman and the hottie British hostess we knew we were in the right spot.  We were escorted to a VIP table, had some yummy drinks and enjoyed the variety of dancers who happily entertained us.  The club is swanky and brand-new, the girls are talented (I especially liked Justice), the drinks are yummy and we are making plans to head back to try the steak!  I was surprised to see how many couples were there with us.  I highly recommend Penthouse Club &amp; Steakhouse whether you are heading out with your girls, for a special occasion or looking for a sexy spot to end a date with your man...Penthouse is the place to go!!", 
    "review_date": "2012-04-05"
  }, 
  "09T1oyi6c-9lvyt7gQCD2w": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Peter L.", 
    "review_text": "Definitely a good place for a guys night. The dancers here sure are fit and healthy looking, and more attractive. And, they seemed to enjoy working there, more often than not.  The DJ could tone down the overenthusiastic announcements but that's a minor gripe as the music he plays/chooses is my type (house, dance, upbeat, even some foreign tunes). It's like a club at times.  There is a bar if you prefer sitting there, and a few TVs usually showing some sporting event. The waitresses are friendly too. Shots all around is the norm. Downstairs snack foods were only okay and is on the saltier side. I will return to try the regular food upstairs.  When leaving, a poet's words always resonate, \"Excuse me (excuse me), But I might drink a little bit more than I should tonight, And I might take you home with me if I could tonight...\"", 
    "review_date": "2013-06-15"
  }, 
  "NpCKcLnZ9KgSuMRXvURcYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina W.", 
    "review_text": "My friend and I went to their grand opening on Thursday.  My friend purchased her advance ticket online for $25 + the eventbrite fee.  I was not sure if I could join her therefore didn't purchase the advance ticket.  We waited in line for about 10 minutes and found out from the concierge at the door that they were not selling tickets at the door, advance tickets and invitation guests only.  I was shocked.  I informed him that it's not mentioned on their website's event page.  He still kindly refused to let me pay at the door.  I tried purchasing a ticket online, but the sale ended.  I requested to speak with a manager.  After I spoke with the manager (dark hair, stocky build, approx. 5'10\" tall) and explained the situation, he kindly let me in to pay for the event!  My friend and I had a great time at Thursday's opening, thanks to this manager!!  Sorry, I forgot to get your name.    There were sooooooo many girls working the floor.  They look like the girls I normally see at dance clubs therefore I'm taking 1/2 star off this review.    I only tried 3 types of hor devours they served at the event and they were ok, a bit dry.  I wanted to order something from their bar menu, but was informed not available until 9pm.  (:(  Taking another 1/2 star off for this reason.  Our waitress (the ground level near the bar) was very friendly, attentive and professional!  We had two rounds of drinks and both times didn't wait long for them.  She was great and her smile was a big plus!  All the performances were entertaining.  The interior design of the club is trendy, but the tables seemed small to serve large steak entrees.  I will update my review after going back to try their lunch and dinner.", 
    "review_date": "2012-03-18"
  }, 
  "tZVUdlql8vTfMyTDY8OZXA": {
    "user_rating": 5.0, 
    "user_location": "American Canyon, CA", 
    "user_name": "Otto P.", 
    "review_text": "Angel, the hostess was freaking awesome. Food was good and the managers took care of us. Girls are freaking hot!", 
    "review_date": "2014-06-07"
  }, 
  "a699W_uzM2CUteHZqpDeLg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie Y.", 
    "review_text": "Mehh... I came here for a friends birthday.. Party of 30 people so we had the whole upstairs to ourselves. I mean I guess it would be a different experience if it wasn't such a big party.. the food was... bleh. It took forever to come out and I CANT EVEN SEE WHAT IM EATING. One server for ONE WHOLE PARTY? They were screaming out our food and how on earth are we suppose to know whose is whose! Well anyways, lets get to the strippers , they were pretty and had nice bodies and also very fun ! So there goes the two stars for HOT and FUN strippers! Will I be back..? eh.. I doubt it.", 
    "review_date": "2013-08-28"
  }, 
  "oh2J59Y1sVdmySZ_Q93ebQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony L.", 
    "review_text": "Dear Michael Ellis,  After trying Dry Creek I thought to myself, \"why not.  It's not your traditional environment, but good food is good food.\"  While I realize that most chefs have many helpers under them, as the head chef, everything that comes out of the kitchen represents you as a Chef!  -The matradee was the only bright spot of the night..  He was attentive and supremely helpful.  -You can't take the meal seriously when there's constantly girls walking around soliciting dances. -The food was overpriced and subpar all across the board.  I asked for medium rare and got well done.  The Cheese Tots just tasted like giant balls of blue-cheese and nothing else.  The mushrooms were greasy and the spinach was a joke.  I tell people to think outside the box.  The only problem is that sometimes you're so far out,  you forget what the box is suppose to look like.  Stick to what you know, good food.  This establishment is a giant leap back from the quality we expect from you.  Sincerely, A saddened fan", 
    "review_date": "2012-12-22"
  }, 
  "1Oa4dj8Bcmtf5178NO7U8Q": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy H.", 
    "review_text": "It's Grand Opening Night on Thurs, March 15th   A great friend of my boyfriend's, who owns a few night clubs in SF, gave us an invitation VIP pass to Penthouse Club. Sure, why not when it's free. And of course, the boyfriend would love to go especially when it's a strip club. I was kind of sketchy at first, but hey, why not enjoy the night and make him happy.   We did not come for the food. We just wanted to check out the place. The invitation on the pass says it starts from 9pm. We got there right at 9pm. There were two lines to get inside - paid tickets &amp; VIP passes. We were a few heads near the front entrance. The lines got longer &amp; longer. The security/bouncers did not let anyone in until after 9:30pm'ish; because there was also a '7pm' invitation for dinner. It was already packed inside. They let you in, only if you have a bottle/table reserved. Why did they make two events from 7pm &amp; 9pm. Very unorganized. The staff manager &amp; security were very apologetic for the people waiting in line. It's nice of them to apologize in person. We didn't mind because we got a free VIP pass anyways. 2-star for the wait.   We finally got inside. The interior looks nice, modern &amp; upscale. It was my first time here. There are two floors. The first floor is where all the action entertainment is at. The second floor is the dinner area with a little action. My bf says this place used to be \"Showgirls\" and it still looks the same to him. They did no renovations to the place except for new furnitures, accessories &amp; lighting. It still looks great to me. 4-star for the interior.  There were a lot of girls working. Mostly average. Some pretty. Some skinny. Some short. Some with thickness (but not too thick). The girls really work you to give them money. Outfits were mostly lingerie. Some scandalous. Some club-ey. A few sexy dresses. This is only top-less. Not all-the-way. 3 stars for the girls.   My bf &amp; I walked around and got bored. The cranberry-vodka was too weak. Decided to get a table in the front where all the action was at. We were lucky to get a table right after a group left. A couple of our friends joined us. We got a champagne bottle service. It did took awhile for us to get our champagne. They did add in the tip &amp; taxes to the bill. We also ordered a bar menu item. It's some kind of bbq chicken wings/drummettes appetizer. Boy, that was awful. It was cold &amp; dry. Yuck. Do not order this plate unless you're super drunk for food. 3-star for the bottle service. 1-star for the the chicken wings.  Our host, Andy, who works on the floor was awesome. Very top notch service it seemed. 5-star for him. My bf tip him good. A couple girls came to our table. Mostly just all conversations. They were cool &amp; sweet. And yes, I got a lap dance right at our table because of my bf!! He enjoyed it a lot, but the girl didn't really give me a good lap dance. Had better =)   Overall, it was okay. Not a fan yet. We actually did enjoyed our time. It wasn't bad nor great. We would come back again. My bf wants to try their dinner...but since we didn't like the chicken wings bar menu item, I wonder if it's any good...we shall see. If we come back for the food, my next review will be about the food :)", 
    "review_date": "2012-03-20"
  }, 
  "45zJIjqsoAOXOOZq6NRmig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alix L.", 
    "review_text": "For any of you who saw this club before the remodel, you will not believe that it is the same place. Without a doubt, this is the sexiest club in all of San Francisco. Or, as I overheard another patron say during one of the soft openings, \"This is more Vegas than Vegas.\"  The Penthouse Club and Steakhouse has created a space that is enticing, welcoming and comfortable for women. The grand opening was spectacular, and I would say at least half of the people in attendance were women. This club has succeeded in creating a sexualized space where those who would not normally frequent a gentleman's club feel comfortable.  The upstairs VIP and dining area is stunning. Sitting at one of the enclosed dining booths offers an intimate dining experience. Depending on your preference you can adjust the curtains for more or less privacy. And, here comes the big shocker, the food is fantastic. Who knew that a gentleman's club could offer such a great menu, and one that pays attention to the importance of supporting local farmers? I don't eat much red meat, and fortunately this menu has a lot to offer for the non-steak eaters. I had the hamachi starter, the corn grits, and uni crusted black cod, They were all fabulous. As a Kentuckian, I am particular about my grits, and am thrilled to have found a place in SF that does corn grits their due justice.  As for the performers, in my opinion the Penthouse and the Gold Club have the best looking performers in all of San Francisco. As the new club in town, I have a feeling that the Penthouse is going to be the place that pulls the best exotic dancers as they will want to be a part of this incredible space.", 
    "review_date": "2012-04-08"
  }, 
  "RR8WmI4aN5EWWWXX_5WSgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty I.", 
    "review_text": "Nice, fun place with beautiful girls! I been there with my boyfriend and we had a great time! The staff was friendly,they were checking on us to make sure that we're doing ok and we have a good time!  We decided to sit at the bar and have couple drinks! Eleina, the bartender was taking care of us and give us a five star service!  We had a great time! We will definitely go back!", 
    "review_date": "2014-03-06"
  }, 
  "mKDrBsSOpoPJ8KXP0dhcUA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allie B.", 
    "review_text": "Worst customer service of any bar/strip club in SF on Broadway. Bartender tried to rip us off and short changed us $20 for our $45 drink order. When we spoke with the manager regarding the issue he simply walked away mid-sentence. Very unprofessional and had no care towards customer service or the mistake they made. Yes, it is a strip club, but they should still treat customers as if they are at a regular bar.", 
    "review_date": "2014-06-29"
  }, 
  "vR3viZ9hsFNDnX03aGRMGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samu S.", 
    "review_text": "My review is probably a bit generous due to going on the free night, heavily inebriated.  I will update on a subsequent visit.  Swanky decor. I've never been to Vegas, but I imagine it's like this. Lots of blue and purple uplighting and shit. Free food. Can't complain about some smoked salmon crostini, oysters, and sushi on the reg. $8 Coors Light bottles. This is actually a detriment, and my homie's purchase elicited a disappointed *smh* response. You get stamped for re-entry, just go to one of the many neighborhood liquor stores. Photo op with pornstar. Nicole Aniston was hosting. Make your profile pic the envy of every furry-palmed neckbeard on your friend's list. Even better, have your photographer friend pretend there's a camera malfunction so you can go supercreep and cop a longer feel. Good-looking dancers. Less variety than some places. Seems like the club is  concentrating on that \"tallish skinny girl with c cups\" look. You can grab some ass for a dollar (I grabbed four by my count).  I'm pretty sure the club \"makes it rain\" to encourage similar behavior. I'd advise against following suit.  It was cool. Oh, and the lusty lady is just down the street if you don't feel like wanking it in the men's room like a normal person.", 
    "review_date": "2013-03-25"
  }, 
  "iljY-n1ftHBJRqXbruZS4Q": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Edmar C.", 
    "review_text": "Amazed by the Girls! Amazed by the host! Amazed by the bartenders.... From the moment i walk in i was greeted by sooooo many handshakes.  \"Welcome\" i didnt believe at one point that this place was a strip club...  One of the asian host sat me down and took care of me from beg to the end of my stay.  I was so amazed by the hospitality that this place have given me..  I will return and bring some of my friends for a marvelous night.", 
    "review_date": "2012-11-19"
  }, 
  "YZM3Vx5VH76BBJu1Tm9cJQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pamela I.", 
    "review_text": "Went on a Tuesday for a Coworker's bachelor party. I don't know much about strip clubs but I have been taking pole dancing classes for a few months now and the dancers were a bit disappointing. The majority of the dancers were doing moves that we learned in day one of my pole dancing class. There was only one that I was impressed with and gave her money which was exhilarating.  Otherwise I wasn't impressed.   I don't know maybe because it was a Tuesday night and the real entertainers come on the weekends or it could be that I'm not impressed by half naked girls two stepping around a pole.   All and all, after splitting the bill, with food and shots etc it came out to be $135 each for a party of 7. This did not include a lap dance for the groom which was $30 for a performance that lasted less that a minute. This was incredibly disappointing because, after months of learning similar dancing techniques, I feel like I get a better show of dance skill and polemanship at a $35 dance class that last 1 hour and a half and is only a few blocks away.  This all seems like a big rip off to me but maybe I'm not thinking about it correctly or maybe I just need a penis to do the thinking for me to make this place seem like it's money well spent. I will never know.", 
    "review_date": "2013-04-26"
  }, 
  "YOChRzTztTL_KooP9wEtSQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole S.", 
    "review_text": "The topping on the cake is seeing my credit card was overcharged nearly $40 on last night's meal...Sorry Penthouse, because of that you're being dropped a star.     After seeing pictures and reading articles about the newly designed Penthouse Club and Restaurant, it left me eager to see the place and get a chance to try the foods of a Michelin rated chef (yes, I was really here for only the food).  I made reservations for our party of four through <a href=\"/redir?url=http%3A%2F%2Fopentable.com&amp;s=897c359bd752b4f5407d5ea86453c82be2d1913c8d0b51b18d81fc58f52a6497\" rel=\"nofollow\" target=\"_blank\">opentable.com</a> for 6:30pm last night.  Verdict?  Penthouse failed.    FOOD: *American Kobe Beef Carpaccio ($15) -  Pass!  Thin slices of beef were topped off with deep fried capers, onions, and a horseradish gremolata and accompanied with toast points.  The dish had very little taste, the gremolata tasted as if it was simply garnish, but for once I enjoyed capers (probably because it was deep fried and I thought it was bacon).  The toast points?  They were simply toasted halves of white bread.  *Kobe Beef Trio Special ($69) - The way the dish was described and my grumbling stomach led me in the wrong direction ordering this dish.  The trio included 3 oz. of beef cheeks topped off with a baby carrot, 3 oz. of sirloin topped off with an onion, and 3 oz. of belly sprinkled with a rice crisp and topped off with a celery/broccoli puree.  The dish came out at best warm, but was more along the lines of room temperature.  The meat contained little flavor and lacked the kobe tenderness I was expecting.   *Black Truffle Creamed Spinach ($8) - Delicious and the BEST part of my meal.  The creamed spinach was creamy with a crispy top layer.  Definitely recommended!  *Parmesan &amp; Black Truffle Fries ($8) - Ok, but yet another dish that didn't come out hot.  The fries tasted like traditional fat fries with parmesan shavings.  SERVICE: The staff was nice and hospitable. From the door guy, to the hostesses, to our waiters, everyone was great.  We were constantly checked up on, our glasses were topped off with water, and even the restaurant manager came over to say hi.  It does make me wonder if service was so great because we were the only party in the restaurant for a long period of time.  The only flag?  Our waiter took my friend's ID with her credit card while he ran the transaction. Why? I'm not sure, but he was gone for almost 10 minutes.  LAYOUT: Beautifully done! As you walk into Penthouse, you are greeted by ladies at the podium asking if you're there for the club or the restaurant.  The restaurant is located upstairs in which you're led up by an elevator (I wish there was a stairs option).  There is a bar and a pole in the middle of the area for all to see.  Do note, the dancers do not go topless in the restaurant area, only downstairs.  The club is located to the hallway down the left.  The club has two areas: *an upper area which has a bar, cage, and area we were told is for bottle service *lower level is closest to the stage with a 40 foot pole  PARKING: Somewhat difficult to find, but valet or a paid lot across the street is available.    If you get easily offended, you should stop reading now...  TALENT: By using the word \"talent\", do note, I'm using that word lightly.  With the exception of a few, they were below average.  During dinner, the girls were C/D grade talent, but as the night progressed it got a tad better.    Most girls didn't know how to work it and underutilized the pole (cmmon, you ladies are stippers!).  During dinner, we watched how LITTLE effort the girls were putting into dancing.  To many of the girls, it wouldn't hurt to live at the gym a couple days a week.  If you put your bodies out there, please, give us something we WANT to look at.", 
    "review_date": "2012-03-28"
  }, 
  "4iOoiRItUp9Y1HEDKhWuXg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Juan F.", 
    "review_text": "I'm a relative fan of this place for quasi-work dinners. The food is pretty good and the girls are very polite if you're having dinner- they don't bombard you with lap dance requests until you finish your main. My concern is the new anti-privacy device they installed at the front door. If you don't relinquish all of your personal data ie- government issued driver license or passport for scanning and storage of your personally identifiable information data for 90 days minimum, you don't get in. I'll find other places to take my dinner guests now that identity theft is the first course on the menu...", 
    "review_date": "2012-05-18"
  }, 
  "RijSBF9fop9LOmH7fftbBg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Maria V.", 
    "review_text": "My man and I went to this amenity some time ago to enjoy our time together. It's nice and clean but it was empty, the girls were ok. I personally didn't like any of them, but it's fun to watch and it's fun to be there in general. We got several lp dances and drinks as well. The drinks are way over priced but it s what it is.", 
    "review_date": "2013-04-17"
  }, 
  "u6puaK9L3Yav_46NW26ieg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mindy C.", 
    "review_text": "Who wouldn't wanna have their birthday at a strip club?!! So for my 25th birthday (2days ago), I decided to stay away from the club scenes and do something completely different and amazing...STRIP CLUB! All my friends love the idea and we were all super duper excited about it!  Little did we know.... the only reason why i give it 2 stars - at least we got in for free.  None of us had a good time at all. Now here is why:  There's nowhere to sit! Maybe it's my inexperience in strip clubs, I had no idea that UNLESS you get bottle service or dine with them, you won't get a seat. Now how am I supposed to get a lap dance if I cant sit! I had a party of 7 people so we were just walking around, standing by the bar, getting sent upstairs for \"upstairs seating\". But when we went upstairs, we were told that unless we dine with them, we can't sit either! wth? Thank god one of the guys (maybe a manager) let us sit at a small area... it was already a buzz kill at that time. My other group of friends hadn't had dinner yet, so they were seated to have dinner. 2 of them planned on eating, the other two were trying to get a drink. When the waitress was trying to take down their orders, one of my friends told her he wanted to get a \"makers mark\", the waitress said \"ok, I'll be right back\" and never came back. Later when my friends were checking on the order, they were told that the order was never put in and the kitchen was closed! WHAT? my friends were really upset because they paid to get in to have dinner and they were told the kitchen was closed when they already ordered!   Girls - no disrespect but 6/10. There were only 5 of them walking around and 1 on stage.   We wanted to come here and have a good time, have some drinks, have gorgeous females sit on our laps and motor boat us in the face (rated R). Instead, we were pissed off, tired of complaining and ready to go home.... It was NOT a great birthday, by the time we realize we might've made the wrong choice, it was already 1am. DAMN IT! Will I ever come here again? ummmmm.... no.", 
    "review_date": "2013-08-13"
  }, 
  "PFi8NPmAhBJqf4_C4F0ZJQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "R G.", 
    "review_text": "Came in for a peak and spent the nite!!! Had an awesome time with great company!! The bartender was certainly beautiful as sport smart!!  She kept me on my toes with fun convo!! And little Chelsie , the cocktail waitress also kept me full with the delicious beef springrollz!!! And lets not forget the acrobatic cirque de soleil, miss joy, for finishing the night with an awesome experience!! Lived in vegas for 18 yrs, this felt like home!! Happy hour beer was at $2 a bottle...can't pass that up if ur in the hood just wanting great company n ambiance!!! Definitely will keep coming back!!", 
    "review_date": "2013-01-28"
  }, 
  "noGH3E3iwGKYjaCVOzlhkg": {
    "user_rating": 5.0, 
    "user_location": "Marina, CA", 
    "user_name": "Meme M.", 
    "review_text": "I am setting up a birthday event here and so far the employees have been very attentive. Brian and Johnny are the general managers and they both have been very helpful, very friendly,and make sure your accommodated. The place looks really nice, I can't wait to bring my group and enjoy the entertainment/vibe.", 
    "review_date": "2014-11-03"
  }
}