{
  "4lWnLmNdW3mAOIMgxqqyPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raoul D.", 
    "review_text": "I go here for the Boddington's. They know how to pour them. I've been tempted by the wine list on occasion, but have never faltered. Stay the course!  Very comfortable and down to earth place nestled in amongst the boutiques and galleries of Hayes Valley. One of the friendliest bars in SF. I only miss the dart board.", 
    "review_date": "2006-12-07"
  }, 
  "k3mYPM2ek4if5bvsP7q8LQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan M.", 
    "review_text": "Its nice that my local neighborhood bar has such delicious beers (decent assortment of local/regional microbrews, plus the standbys of fat tire and chimay and guinness and such), and plays such good music (usually high-quality upbeat hip hop, not the dancing type but the chilling and nodding your head type).   And now its smoke-free!", 
    "review_date": "2007-04-08"
  }, 
  "cvcxw3BFhcotP9lSF_xHVg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris M.", 
    "review_text": "Now here's a nice little bar on Hayes St -- very mellow and chill, with enough chairs and couches to make lounging extremely accessible for all. It's beer and wine only but there's a good selection on tap, and you can always... uh... pregame it somewhere else.  There also have foosball table in back, but you gotta bring your quarters -- and your game.", 
    "review_date": "2008-06-06"
  }, 
  "rMNPcAVo5Jpm55Sm68eQ2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A P.", 
    "review_text": "It's a dive and kick back local hang out.  No frills kinda place.", 
    "review_date": "2007-12-01"
  }, 
  "WI9UJah3bVB258wzEIh34A": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kate K.", 
    "review_text": "I just can't respect a bar that doesn't serve vodka.  That and it smells like a foot inside this bar.  Me not likey.", 
    "review_date": "2009-02-21"
  }, 
  "qUg4PXAT42bxV48CqPaUwQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnny C.", 
    "review_text": "Chimay, Hoegaarden, dog friendly (You'd think it was Rocket Dog here), people friendly.  Who could ask for anything more? But wait there's more. Pool table and Foosball table. Yeah Baby. Friendly bartender who offers liquid refreshment advice and great conversation. Joint seems to be jumping any night of the week. Tuesday is the new Friday at Pigalle.", 
    "review_date": "2007-11-08"
  }, 
  "XbxaaX2uwi84gcVoXSnPKA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jackie M.", 
    "review_text": "My favorite watering hole in Hayes Valley. Sure there are bums chilling in the back room, stray dogs roaming around like they own the place, and a gnar bathroom that makes you really worry about catching something....but hell, this is just the way of the pig!   Bartenders are always friendly here. They have a myriad of couches. Good music. Laidback vibe. No pretentious shmucks here (so far...I think). Place Pigalle, you are swell.", 
    "review_date": "2009-03-19"
  }, 
  "sR0I3N5q58Ne5EysyvZkPw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin C.", 
    "review_text": "The only reason why I would stick around in Hayes Valley after 11pm.", 
    "review_date": "2007-08-08"
  }, 
  "L-GQph-9IrXoKbvGJgz3uw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary V.", 
    "review_text": "i like this place for the following reasons: great lil selection of red wines (la crema pinot = yummers) awesome variety of beers on tap dogs allowed! pool window seating fun, unpretentious vibe and i heard it was haunted. awesome!!! 4.5 stars for that.", 
    "review_date": "2008-02-23"
  }, 
  "K9_ag_YzqTMhWu51HMrcrg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Freddy F.", 
    "review_text": "Stopped by here recently to meet up with old friends back in town for the holidays.  We had a great night to ourselves fines selection of beers on tap. OK maybe i had 3 too many of The Dogfish Head 90min IPA but what the hell it's not every bar you can grab a few pints of this. I think they had 20 beers on tap total all craft beers. Something for everyones taste my buddies made there way through most of them with no complaints ;) Overall a great bar for those who enjoy the finer beers in life and a laid back atmosphere. Music was spot on and oh yeah a free pool table. Can't be bad at that", 
    "review_date": "2011-12-01"
  }, 
  "4yUd-vuVC6Tcp7wsS6uTyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David R.", 
    "review_text": "Place Pigalle is Pleasant  I've only been to this joint twice even though it's right up the street from my house.  Just got back tonight from a couple of happy hour beers with my buddy Michael.   Yeah, the joint isn't sophisticated or necessarily clean, but that's the charm of it. It's simple, fun, has pool and fooze ball and a great variety of beers on tap. . .I even saw people ordering wine, though that's one thing I wouldn't do at a neighborhood bar---they seemed to be fine with it.  The bartender was sweet and helpful. . . very apologetic when she accidentally sprayed me with Guinness (damn! I should have asked for a free pint, huh?). . . And! $6.50 for a couple of pints of Boddingtons--NOT BAD, eh?   Anyway, I'll definitely be back . . . at least I can crawl home afterward.", 
    "review_date": "2007-03-21"
  }, 
  "YbsBsaNKi2TwbVCZkuqrqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cara S.", 
    "review_text": "This is like the least divey-est \"dive bar\" I have ever been to. The Place has a decent beer selection, pool, foosball, plus great tunes, and it's in Hayes Valley, which is super cute. It's not dirty or douchey. Came here to meet some friends and in turn met their coworkers and good times were had by all. I would definitely visit again.", 
    "review_date": "2013-04-28"
  }, 
  "4Po_4vgdBFk2GPeKfJqVww": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan L.", 
    "review_text": "Martin's new to the hood.  He needed some support in trying it all on for size.  Dinner at Bar Jules and a beer later, somewhere, anywhere.  And that's exactly what we found.  Anywhere.    Place Pigalle could be any bar on any street in any neighborhood.  But that's what makes it awesome.  Not flashy.  Just good beers, 1 single pool table, a chill \"local\" crowd, and a cool bartender.  Its your first stop before going out; your last stop after a rowdy night; your stop for a whisky after a rough day at work; your stop for a beer on a warm Saturday afternoon.    But, you lose 1 star for serving jello shots.  I know, I know...you all want to think its cool.  I just think its lame.  Let's all grow up, shall we?", 
    "review_date": "2009-05-06"
  }, 
  "dQrYvQv-2amtchPF2V0K8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eugene F.", 
    "review_text": "A pretty average bar with one exception -- they have a great wine selection for a dive bar.  None of the wines are particularly nice (probably all stuff you find at Trader Joe's), but being able to choose from over a dozen wines is nice.  That said -- most people probably choose one of over a dozen beers while they're waiting to get plastered on Optimator at Suppenkuche next door.", 
    "review_date": "2007-12-20"
  }, 
  "vTugBdYg34rX4KvGpzBrNA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Sonya D.", 
    "review_text": "I'm going to have to say that I really enjoyed my time here. It's a cozy, comfortable bar with comfy couches and nice local patrons. How can you go wrong with that? It also had a pool table, which is always fun! It's pretty close to my place and it's in a cute little neighborhood. It's basically just a simple but fun and relaxing dive, which is good for conversation and meeting new people!", 
    "review_date": "2010-04-28"
  }, 
  "4Y81J2Tdq5XAnkeYmCZ2ow": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nique F.", 
    "review_text": "You simply can't come to Place Pigalle expecting it to be like other bars. It's a dump. You really might as well stay home and drink on your own couch, rather than drink on Pigalle's filthy furniture and have to pay for stale beer (seriously, EVERY beer on tap was FLAT. Gross.) I understand how certain people would adore this place for it's comfortable simplicity, but if you want to feel like you're \"going out\" vs. chilling in your basement, you should look elsewhere. Pigalle is just not my thing, but maybe it's yours...?", 
    "review_date": "2011-04-14"
  }, 
  "zaz_5qYy3DSr-W8312PCiA": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Alex R.", 
    "review_text": "I love this place. Moderately price beer, nice bartender with an attitude. Foosball. Nice foosball table, at that. They also have the most awesome selection of music of any bar I have ever been to. It went from Weezer to Wu-tang. Awesome.", 
    "review_date": "2010-10-01"
  }, 
  "QtQrPd6YPJKNC7YG7G0LLQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew R.", 
    "review_text": "Good local bar.  Pool tables in the back, but they only serve beer and wine.  No cocktails.", 
    "review_date": "2007-04-24"
  }, 
  "-eVlHbM2KRZQnBqfTXtDvw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joc V.", 
    "review_text": "The guy out front carded me.  Me.  Way past my prime, suburb living, SUV driving, eyebag having, mother of a 3 year old whose boobs are in a race to see which one reaches my waist first.*  I was in awe and said, \"Dude!  I'm 40!\"  \"You don't look it.\"  !!!  5-stars forever for Place Pigalle and bouncer dude.  *TM, Maya Angelou", 
    "review_date": "2012-03-25"
  }, 
  "6RJBeJlbDGrZO91Qc2NG9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A W.", 
    "review_text": "Since there is a dirth of small, privately owned AFFORDABLE and quaint places to go in Hayes Valley that doesn't cater to the theatre &amp; symphony 6pm rush, this place is it.  With the exception of Sugar down the street, you won't find a more relaxed, casual, easygoing place for locals to grab a beer or wine (no hard liquor license).", 
    "review_date": "2012-06-15"
  }, 
  "NN5jldDW0Puf8E3ZZjKqsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "megan w.", 
    "review_text": "Place Pigalle was my happy hour destination of choice for several years, since I worked at nearby City Hall, and toyed with being a smoker for a while. It's a good place to be a smoker. And those places are necessary and I'm glad they exist; I'm not really on board with the anti-smoking crusade thing. I mean if we're fighting a war on corporate carcinogens, I would love to see a major ad budget allocated to dry cleaning, but that's a separate rant.   Anyway, Place Pigalle. It's a chill ass place to run through a bottle of cheap red and a pack of Export-A's with a couple of good friends.   Good times, good times.  I also feel compelled to add that Place Pigalle has been unfairly persecuted, and thus I feel compelled to add a possibly-excessive fifth star.   FOR GOD'S SAKE PEOPLE STOP BITCHING ABOUT SOJU. Do you even understand why so many places have it!? It's not, contrary to popular opinion, because the nightlife mafia is in cahoots with the Koreans, or because they want you to think it's the trendy new thing, or that it's some bullshit copout cheap subsitute for vodka. It's not, like, a CHOICE bars make when they're opening up, like \"Should we serve just beer &amp; wine, or liquor too? What shall we do?\"  There are LICENSES required to sell alcohol. There are DIFFERENT TYPES of licenses within the broader license category; for example, a place that has a kitchen and serves food concurrent with booze has a different license type (a Type 47) than a bar with no food (a Type 48). Similarly, a microbrewery (Type 23), winery (Type 02), and corner liquor store (Type 21) all have different classifications based on what types of alcohol they sell, when, how, and to whom. This is all regulated at the STATE LEVEL.  It's an incredibly arduous, expensive, hard as fuck process to obtain the kind of license that allows a bar to serve hard alcohol without a restaurant component (48), and city neighborhoods often have tighter controls on such licenses. (For example, the Lower Haight has per-block restrictions on hard alcohol. Think about how many beer/wine bars there are on the Lower Haight. Now you know why.)   But because San Franciscans love our nightlife and there's a market to support multiple bars in every neighborhood, many bars do what they can to simply exist, and that often means a license permitting beer &amp; wine only.  Place Pigalle has a Type 42 (Beer &amp; Wine, On Sale, which means drinking ON the premises versus taking it off, like a liquor store.) And they do what they can within the confines of their license and the regulatory environment to offer you a variety of beverage options. And that's how you should think of soju: as a bonus third option beyond simply beer and wine. Because it's a clear spirit and mixes well but is technically (percentage-wise) a wine, Soju allows bars a workaround to provide you with a cocktail where there would have been none before. I appreciate that.  And just so you know, most of the RESTRICTIONS on hard alcohol licenses (Type 48 \"On Sale General, Public Premises\" no food required) grew out of NIMBYist fear and paranoia that booze = higher crime rate. And maybe it does. But if you think that's a bullshit generalization, as I do, and you would really like to sway our public policy in a more tolerant direction, get educated about the issues and get active!", 
    "review_date": "2005-09-12"
  }, 
  "VFbXrRqfuWnCnK4gSv51vA": {
    "user_rating": 2.0, 
    "user_location": "Austin, TX", 
    "user_name": "saru s.", 
    "review_text": "something about this place rubs me the wrong way,  a cozy neighborhood bar that isn't cozy a hipster zone that isn't hip i don't get it,  to each their own i suppose.", 
    "review_date": "2007-06-06"
  }, 
  "q6mKVMvmhhbJU_YcfqXyMg": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Esther H.", 
    "review_text": "Smoky, hipsters, but there are some interesting 'characters' that give the joint 'flavor.'", 
    "review_date": "2006-12-13"
  }, 
  "K-NT_xHy7q779oSPLCyvNQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Place Pigalle is the kind of bar I would be enamored of if it...  -- Was in the Mission or Inner Richmond instead of Hayes Valley..  -- Had sexy punk rockers with sweet arm tats hanging out at the bar instead of Hayes Valley yuppies...  -- Had a name that I wasn't embarrassed to say because I'm a Francophobe (I KNOW I come off sounding like a hater, 'kay?)...  -- Had cheap food like sloppy burritos or crappy late night Thai within a block instead of over-priced Middle Eastern where the falafel has SHREDDED LETTUCE AND TOMATOES in it (I'm not gonna knock Frijtz, though -- Frijtz is heaven with dipping sauce).  In short, if it was the 540 Club or the Attic.  You are not punk rock, Place Pigalle! You are a poser. But, you're the best thing in the neighborhood.", 
    "review_date": "2007-08-02"
  }, 
  "dym7k3h_wqBiJcXVu6WKuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ramon S.", 
    "review_text": "This place is underrated and under appreciated. I am fine with that. I heard that it legitimately wasn't so great a few years back. What it does well now is straddle the line between being divey and loungy. It has a pool and foosball table, but awesome, edgy art on the walls. It has nice leather couches, but the walls and floors look stressed. The crowd is a mixture of riffraff and hipsters, but also locals and trendy Hayes Valley wanderers. It's open really late. The beer and wine are really cheap and yet (gasp) they accept credit cards. This is the definition of a good neighborhood watering hole. If I need a drink on my way home or am just catching up with a friend this is where I go.", 
    "review_date": "2012-12-17"
  }, 
  "rwP2ALojVp2t6LrT7vlViQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "The prices were average, but the bartender was so rude that I decided not to give them any money. It was good for a group though, because it was fairly empty.  Also, the music was AWFUL.", 
    "review_date": "2010-10-24"
  }, 
  "oPW-LM0pXja0lDwZybXd9g": {
    "user_rating": 2.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Dmytro A.", 
    "review_text": "This place SHOULD perform better.  They serve Guinness, have a pool table, comfy chairs, and a good location.  But the beer tastes funny, the furniture is dirty as $#!+, the bathroom is - well, use your imagination, and the bartenders are as friendly as a skunk's ass.  Unless I'm perfectly desperate to get out and my friends have resolved to come here, I would rather drink at home.  Still, they serve Guinness and have a good location.", 
    "review_date": "2010-10-21"
  }, 
  "eSd1vgu3JIIJluhEK2Em3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tatiana J.", 
    "review_text": "For a dive bar, I thought this place was pretty great. The beer is decently priced ($4.25 for Fat Tire, not bad), the bartender was really nice (and nice to look at *wink*), the music was perfect, and AND there were COUCHES in this bar. I will definitely be back.", 
    "review_date": "2009-09-27"
  }, 
  "OMwf9XKXdtd_77Fa2bcPzQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay W.", 
    "review_text": "Went here for the first time on a Wednesday night, and even then, it was decently packed. Not quite sure what to think yet. I will probably go again to write a better review later. But first impressions:  1.) Laid back / very chill vibe. 2.) Diverse crowd (hipsters, yuppies, older people in their 40's??) 3.) Large selection of beer and wine only (no hard stuff). But that's cool with me since I usually just drink beer. PBR is only $2.75 here.  4.) 1 pool table and 1 foosball table. 5.) Lotsa comfy couches 6.) Hip hop music (the latest Common CD and an old school Digable Planets CD was playing). A bit too loud though. 7.) Someone mentioned this earlier, but I must concur. Not a very attractive crowd. And my presence doesn't make it any better either.  Will write more later.", 
    "review_date": "2007-12-21"
  }, 
  "yl6XMllhyZGKA9qKNLYK4Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nick a.", 
    "review_text": "I used to love Place Pigalle, but the smoke and irritating hipsters have finally got the best of me.", 
    "review_date": "2006-05-11"
  }, 
  "n7O0f4CHUtw5B3ldoKY_RA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adriene C.", 
    "review_text": "I love to go to \"the pig\" on tuesdays and saturdays because the bartender is fabulous. they have soju jello shots on saturdays and sometimes they have a \"play your ipod\" evening (not sure when but I see the sign up whenever I'm there). it's dingy and lit in the back, which is strange and wonderful. sometimes they have popcorn.  they always have art on the walls from local artists. their beer selection is pretty rockin' and i had this really yummy sweet red porto last time I was there that I was really surprised about. dive bar porto that was actually relatively yummy (it wasn't any late harvest zinfindel from rutherford hill, but it did the job when I wanted sweet and warm!) some may not like it that dogs are allowed but I figure, some bar's gotta do it so if you don't like dogs, don't go - that easy. :)", 
    "review_date": "2007-10-30"
  }, 
  "GVwIu4a2OEJ4SvllFHoNCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will C.", 
    "review_text": "Any place with a pool table and a fuseball table automatically scores high.  This place wins for it's low key feel and low comfy couches.  A good dive bar, but the smoke can sometimes be a drag.", 
    "review_date": "2009-12-10"
  }, 
  "GqAWZId7sUGylHljDFbe2A": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "kiki b.", 
    "review_text": "for hanging out, pitchers of beer, pool and fuse ball. it's a good time", 
    "review_date": "2006-12-25"
  }, 
  "wbAnJpZ0Lmj3LeXg4pmq_w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ELIZABETH W.", 
    "review_text": "$10 pitcher of PBR!  Bar tenders are always friendly and remember the regulars!  I live a half block down, so I end up here way too often and normally end up having a good time here! Foosball tables add to the FUN!", 
    "review_date": "2007-03-10"
  }, 
  "Nsr2JEsYP7kxKOaUz-2T5w": {
    "user_rating": 1.0, 
    "user_location": "Montclair Village, Oakland, CA", 
    "user_name": "Nathaniel G.", 
    "review_text": "The manager of this place came out and started harassing my friend just for standing in front of the store front. He was angry because he believed her being there was keeping people from coming inside his bar however this happened at 2pm and the posted hours are 5pm- 2am so I don't understand why he was giving her attitude. RUDE!", 
    "review_date": "2013-11-27"
  }, 
  "w7CvXX2dtmPCm67TRJw7kQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel F.", 
    "review_text": "I have a soft spot in my heart for this little bar in Hayes Valley. As well, I have a standing date every Thursday with this bar, Anye the bartender, one of my gal pals, and a couple of glasses of pinot noir.   I'm not big into cocktails unless I'm watching live music, so a no-spirit bar like this one suits me fine. Particularly when Anye keeps the wine a-comin'.  The unisex bathroom has dilapidated greatly over the past few years, but the graffiti is, at times, entertaining. I really wish it could be done-over, but it's not bad enough to keep me from coming back.   The music is random but entertaining. I don't agree with those who say it's too loud, but I only go on Thursdays, so I can't speak for the other nights. I'm sure Mr. or Miss Bartender wouldn't mind turning it down if they're asked nicely, though. Just an idea.  It sports interesting and changing artwork. The couches are comfortable and reminiscent of basement rec rooms, but I never find myself in the back unless I'm waiting to brave the bathroom.   The clientele runs the gamut from yuppies to dirty hippies to symphony/ballet goers to hipsters to dogs. It's a comfy place and I always meet interesting (or at least entertaining) people there.", 
    "review_date": "2008-03-30"
  }, 
  "qAJqfV-sLU3nYatpOXjExA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan S.", 
    "review_text": "Why is this place always so packed?  I always have wine spilled on me or get humped by a random dog when I'm here.  Of course, if I was a beer-o-phile, I'd probably have to give it another star because they apparently have a good beer selection.", 
    "review_date": "2007-06-03"
  }, 
  "BzsL4Un6x4_zNq3CXA71Tg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle O.", 
    "review_text": "My local watering hole. Perfect for grabbing a drink and catching up with friends. Place Pigalle is a staple in my social diet. It is a reasonably large space, filled with lots of comfy couches and local art. Friendly locals, good music, and a pool table mean you're always apt to be entertained.", 
    "review_date": "2005-07-20"
  }, 
  "RVEo3hKrwSglj1vc6vu5SA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Benji T.", 
    "review_text": "This is a solid place to grab a drink. I never really go into Hayes Valley and the last time I was here was St. patrick's Day '03. That afternoon went something like this: \"Arrgggh. Woo-hoo. Weeee. Chug It! Yeah. Yeah! So much. Dude, I'm having so much fun right now! Weeee\". Anyway, \"Graphic D.L.\" and I stopped by last night to grab a drink and catch up. Perfect for an early Tuesday because it wasn't crowded in the slightest and we had a very friendly bartender and the music was pretty good. The drinks are expensive though. I mean, ouch! At any rate, I'm sure I'll be back now that I have a new appreciation for this place and that bartender who I didn't care for socially back in '03 is now gone. So long, sucka'.", 
    "review_date": "2007-06-06"
  }, 
  "PauNerg-kHRpoqLwB6F5CQ": {
    "user_rating": 3.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Bill B.", 
    "review_text": "My first thought was that this Place was way too nice to be classified as a dive bar, and the prices agree with me. (~$5/beer, which isn't bad overall) There are several leather loveseats if you want to cuddle up with a date, or sit at the copper-topped bar and peruse the extensive beer list chalked on the overhead board. The back section, with the pool table, can apparently be reserved for parties. All in all, a decent choice in this neighborhood.", 
    "review_date": "2012-05-20"
  }, 
  "DGlEpdOgkK8B4bJ3QUtd1A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Avery G.", 
    "review_text": "A great beer selection, a $2.75 draft happy hour and a policy of accepting credit cards for even small bar tabs... I used to love this place until tonight, when I had to deal with at least four people smoking cigarettes (and there were probably more in the back based on the amount of smoke in the bar).  I used to be a strong advocate of smokers' rights at the turn of the millenium, but since then I have grown to appreciate not having to scrub the smoke off of me after a night of drinking. It's not even like the bartender was a smoker, he just had a \"well, I'm not a smoker but I guess I am tonight\" attitude.  A dozen beers on tap, soju cocktails, and credit cards accepted. The bar can keep one point for my history with them. That's it. With much better places to drink without the airborne carcinogens, this rainy Friday night will be my last time there.", 
    "review_date": "2006-03-24"
  }, 
  "JDn2ZLcWDx8BNv70Of-g3A": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jerkey J.", 
    "review_text": "Back in the day I used to be extremely depressed and lonely so after work I would go home, drop my shit off, and walk around the corner to the bar.  I'd order a Lagunitas, get out my crossword puzzle, sit on an old couch, and smoke several cigarettes through the course of the evening.  Then I'd watch the ugly neighborhood girls flirt with the uglier douchebag neighborhood guys.  One time, I was sitting at the bar, and this seemingly normal woman who owns some gift card shop in the Marina sat next to me and was chatting  me up.  Then I felt like she was going to hit on me or something and it made me want to throw up.  So no. I don't go there any more.  But it's really great if you're depressed and don't mind smoking a lot and sitting on a really gross couch.", 
    "review_date": "2007-01-19"
  }, 
  "a8wKua129w25q4wtP26p2g": {
    "user_rating": 1.0, 
    "user_location": "Covina, CA", 
    "user_name": "Vanessa F.", 
    "review_text": "Decent beer selection. That's about it. Not very inviting/welcoming. Not impressed.", 
    "review_date": "2008-05-15"
  }, 
  "B7ecAeAIrXg7sgmabS38pg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephy S.", 
    "review_text": "Full bodied spicy wine... CHECK  Full bodied spicy wine by the bottle for a reasonable price... CHECK  Full bodied entertainment in the form of Marina guys with popped collars wearing Nylon tennis shorts and tennies on a Saturday night in Hayes Valley... CHECK  Full bodied run in with a blind date turned positive encounter vs. awkward hello... CHECK  Full bodied good time and new favorite within stumbling distance of the humble abode bar... CHECK.  Oh yes, I'll be back!", 
    "review_date": "2009-01-26"
  }, 
  "a682iLOKBLSwOojw9O9XYg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "josue p.", 
    "review_text": "Just ok. Great beer selection BUT the service so-so. We were unlucky to have a horrible bartender who was more concern with having a conversation with a fellow customer than helping and waiting on the rest of us. You would think that sitting at the bar would bring faster service .....however not the case. My girlfriend litterly had to go and grab him from across the way in order to get another beer/ wine refill.", 
    "review_date": "2008-08-29"
  }, 
  "h3Yg3OE9uD6XEAPyEm3qEQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "Place Pigalle could easily be found in Austin (that is the highest compliment I can give a dive bar).  Good variety of draft beers, though there were more hefeweizens than I would expect. Prices were incredibly reasonable.  Good variety of patrons. Anyone could fit in here.   Good place to meet up before heading somewhere else.  Pool and foos ball in the back.", 
    "review_date": "2010-11-07"
  }, 
  "IWal1ziP1AlfcgDJj5CKFw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron T.", 
    "review_text": "Had a group of friends meet there on Friday night - full of folks but mellow. not jam packed.  only drawback can be too many dogs, some of which fight with each other.  foosball is a big bonus points getter in the back.  sofas comfy.  saturday bartender daniel was there on friday as a customer and he was sloshy!", 
    "review_date": "2009-10-28"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "So I've made out with a few too many randoms after too many soju cocktails at this HV gem, but that's not the bar's fault.  I love Place Pigalle because the bartender is hot, the cocktails actually get me buzzed, and I can smoke (my #1 priority after two drinks)! \n Also, the crowd is NOT snobby, frat-boyish, or yucky, a rare find in our fair city. Be warned: NO real booze; just beer, wine, and soju. So get your ass to Pigalle, order a flirtini or a soju lemmon drop, flirt with the bartender or the cute Hayes Valley hipster boys, and stumble home, feeling all boozey and beautiful.  \n WARNING: it can get a little smokey. If you're allergic or just generally health conscious, you may want to pass.", 
    "review_date": "2006-09-25"
  }, 
  "XMeRHjiLhA9cv3BsSOazCA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trey F.", 
    "review_text": "What happened to Place Pigalle?  I'd have given it 5 stars a month ago, but recently this Place (ha ha) has been plagued by a bunch of middle-aged Johnsons.  What happened to all the hipsters? Why all the faded ill-fitting Gap chinos now?  Oh right, the recent smoking ban... Pros and cons, pros and cons...  And why oh why is there just one bathroom?", 
    "review_date": "2007-01-24"
  }, 
  "A7FNqfL30IjpcQ6fQffoOQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bourbon Explorer R.", 
    "review_text": "This is a case of one of those spots that is cool but goes wrong somewhere along the way. First off people can smoke in there, the beer selection though decent is poorly maintained. The tap lines are not clean resulting in that oxidized taste ( kinda like wet cardboard). For me that is more than enough to stay away. If you are fine with their assortment of soju cocktails head on down but their are places that have well kept beer which look just as cool.", 
    "review_date": "2011-05-08"
  }, 
  "JySeqsQuAgrNRJpyRsxqOA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "J o.", 
    "review_text": "Amazing. I love this bar and am so happy it's on my street. It's your typical dive bar with dim lighting, good music and mismatched, craigslisted couches....but it works.  Only complaint - atrocious bathroom. 5 stars if they fixed/cleaned it up a bit.", 
    "review_date": "2009-08-13"
  }, 
  "Rylpa0IwBOBOL-idN-QpwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "liesl k.", 
    "review_text": "look, i'm a lush, ok?  i know it.  my friends know it.  my mom knows it.  ok, my boss doesn't know it, at least not yet, but i've only been at my gig three weeks so the truth will come out sooner or later.  my point is this.  i spend a lot of time in bars.  i spend a lot of time at pigalle.  i don't miss being able to smoke inside, the bathroom is as nasty as everyone says and lindsey, i love you, but please turn the music down, i should not have to shout at my friends at 7pm on a tuesday night.  yes, i will have another house red, thanks.", 
    "review_date": "2008-02-18"
  }, 
  "_SVAW_bwFx3G2tDqmsmOBw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven R.", 
    "review_text": "I'm giving this place three stars mostly because its my neighborhood bar, they have an excellent beer selection and I've had good times here but its changed for the worst.  It used to be a great low-key hipster bar.  It used to take cash only and smoking was allowed inside which wasn't great but it added to the atmosphere.  Lastly you could have a good conversation despite the fact that there might be a decent amount of groups hanging around the place and you might even start chatting with a few people you didn't know because you saw them here 3 or 4 nights a week.    Fast forward to Place Pigalle no longer allowing smoking.  Now its become overrun with marina types and others who mainly communicate to each other by yelling \"WOOOOOOOOO!\".  You can't even play foosball anymore without running into a gang of douchebags who mastered it while living at the frat house.  It seems people choose to travel there in groups of 8 or more so usually all the seats are taken or being used to hold people's jackets.  Now you can't even have a conversation because the bartenders crank up the music to drown out all the idiots.  It used to be my great kickback neighborhood bar but now the place just reeks of designer jeans, expensive dresses and post-birthday dinner balloons.  But lets look at the bright side, their soju and wine sales have gone through the roof.  Oh yeah, did I mention there is a lone bathroom and this place sells primarily beer?  At least get a coffee can out back to alleviate some of the line...", 
    "review_date": "2006-12-11"
  }, 
  "IUBTHEaCm-1xcv1lT99eWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve B.", 
    "review_text": "Real chill spot in Hayes Valley.Its very comfortable with many couches and tables and also has a pool table, foosball, and darts. Its got a very social atmosphere, great place to come with a group or by yourself. You can pretty much guarantee to see some really shitfaced people if its after 12 but they're the friendly drunk type, not the aggressive kind.   Also, they're pretty chill about dogs as long as they're friendly. My dog Edgar plays great with the resident drunk dog Sancho so its fun to bring him down there.  One of the best things about this place is the music. They don't have a jukebox but the bartenders have great taste, especially Lindsay (my former roommate who updates her ipod off my computer so obviously her music selection is great). They lose one star because they don't serve hard booze and you can smoke in there so it can get kinda nasty.", 
    "review_date": "2006-06-29"
  }, 
  "WtARDTeVa3r8mLx6d4iLxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aimee M.", 
    "review_text": "I love this neighborhood bar so much that even though it's not in MY neighborhood, I'll take a cab to hang out here. It's a wine/beer/sake bar that has super nice bartenders, comfy couches and a pool table. The music is always great, although it can be a little bit loud for intimate conversations. There are awesome restaurants nearby (Frites, Suppenkuche, Absinthe to name just a few) and Place Pigalle is a great stop after one of them, before heading home.", 
    "review_date": "2007-08-13"
  }, 
  "7LxY5qFm8xYAq91LoSmq-Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily M.", 
    "review_text": "I was just thinking about how I hate this place because generally that's how I believe I feel about it...but I was just now really giving it a good few minutes of brain power when I realized this place isn't all that bad.   The things is, this place only serves beer and wine, and, in my opinion, beer and wine bars are really just a huge joke. Its like going to a steakhouse that only serves grilled chicken. Plus, I looooooooove vodka.  You can't smoke inside anymore, which is fine. I'm a pretty chill smoker when it comes to non-smoking. Happy hour, from what I recall, is really weak and there's a slight possibility that one of the bar backs stole Joshua's phone off the ground under his feet.  The thing is, every time I've been I've enjoyed myself. So maybe I should stop hating this bar and start drinking there after work. And maybe you should too.  Oh. BTW, the bathroom is HELLA gross. Save it for later, dudes.", 
    "review_date": "2007-07-16"
  }, 
  "-r7eyvyw0wnGOv6kV7Q6nA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dennis Y.", 
    "review_text": "when you step into place pigalle it really does feel like you're stepping into some artsy, bohemian neighborhood joint.. hipsters gather around pool tables, foosball and darts waxing poetic about varies sundry topics surrounding our metaphysical existence or whatsoever...  smokers brazenly light up their cigarettes right in front of a large \"no smoking\" sign in the middle of the bar, adding to the hazy ambiance of the place...  bar staff is friendly and attentive, and this beer and wine bar has a nice full list of beers for my liking.  the next morning, you wonder how it is that you were able to stumble home, and are reminded of pre-smoking-ban days since your clothes kinda stink like an ashtray.  i like place pigalle, i like that it has a neighborhoody feel even on the weekends.. so that's ok if i have to do laundry now.", 
    "review_date": "2006-05-06"
  }, 
  "CDtbuyJBYyDT21lJMod6OA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kitty O.", 
    "review_text": "This place was awesome!  And the funnest part of my Hayes Valley bar hopping night... I came here in that buzzed haze, it was kinda crowded but we snagged a couch in the back.  I love how spacious this place is... it reminds me of like... a living room/rec room in a dorm... if that helps your imagination?  PLUS THEY HAVE MBC RASPBERRY BEER!  I have never seen this at any bar EVER besides MBC and I was so happy...   If I can drag all my friends down that far again, I definitely would love to hang here.  Too bad I don't live in Hayes Valley.  :(", 
    "review_date": "2013-08-07"
  }, 
  "quQ5DemjP-buwKXrhAlefQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jordan V.", 
    "review_text": "This place is divey and sometimes smells a little funky, but I still like because its a block from my house.  Pool tables are a PLUS Loungey couches are a PLUS Big Pours on the wine glasses are a BIG PLUS  One time I came here and they were out of wine (gasp!). I had to go to Sugar Lounge (double gasp!!). Another time or two they were out on all wines except one kind. Its a freakin beer and wine bar so get it together people. Gross gross bathrooms are a big neg, but they come with the territory.   I really like to come here and chill with friends to just catch up, its always a mixed crowd too so you never really know what to expect.", 
    "review_date": "2010-01-19"
  }, 
  "1m4Hmm7IbgGjVupM7CQSMw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki M.", 
    "review_text": "So the hipsters can tell me this is dark and moody place to chat when they're over the crowd at the Rickshaw, but if you have had a hole in your lungs and aren't a fan of smoking, this place may almost kill you.", 
    "review_date": "2007-01-31"
  }, 
  "RAPbrD1BndCQNgkncd1-kA": {
    "user_rating": 5.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Matt D.", 
    "review_text": "This place is just right.  It's got a cool and calm crowd, with people who know how to play pool, fooseball, and smoking.", 
    "review_date": "2006-01-04"
  }, 
  "EC9M2c7CDBaACDnn3Rtzgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tristan H.", 
    "review_text": "mmm chimay", 
    "review_date": "2007-08-22"
  }, 
  "hj7U5xIeohSoryeV2yVvRA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "allegra f.", 
    "review_text": "I don't know, it's very close to me which makes it convenient but it just is kinda off in my experience.   They have a great selection of beers, but are usually out of at least half of them.   They have some comfy looking couches, but they are right by the speaker that is playing way too loud music.  I'd say that i'm just too old, except that there are much older people there.  Service is hit or miss. I will go here but I'd much rather be somewhere else.", 
    "review_date": "2008-08-23"
  }, 
  "icK0fkhTkPWvRmOhFUINfA": {
    "user_rating": 2.0, 
    "user_location": "Novato, CA", 
    "user_name": "Vic A.", 
    "review_text": "this had the potential for being my neighborhood bar, as it apparently is for many.  a good place to catch up with friends, drink, relax, play pool and hang out. unfortunately, my body has become spoiled and accustomed to california no smoking laws that i can't spend more than 15 minutes in the place before feeling like an ashtray was dumped on top of me.", 
    "review_date": "2005-05-10"
  }, 
  "thY4tADfgZPJwySQmRkG9g": {
    "user_rating": 4.0, 
    "user_location": "Melrose Park, PA", 
    "user_name": "Alexandra M.", 
    "review_text": "I don't really think this qualifies as a dive bar. It's too pretty. You might call it a dive bar, because it's quirky, but that connection is a bit far fetched. It has a comfortable, laid back feel. But it lacks the uber cheap prices of the common dive bar - forgive them, they are located in Hayes Valley after all.   What I like most are the variety of seating options. There are couches, from the front to back of the bar, which is rather large. There is a pull table in the middle of the back room. My friend and I sat in a booth in the back which felt very private.   The drink options aren't amaaazing. The wine I had was good, but rather pricey. They serve La Crema wine, which I think tastes just like grape juice. So all and all, you can easily purchase some of the wine they serve in a corner store in the mission paying the same price for the bottle as you do for a glass at Place Pigalle. This is in no way unique to PP. This is done virtually everywhere in the city. I just happened to know the wines at PP. Thus, I am not taking a star off for that. What you're paying for, in my opinion, is the atmosphere, and I like the atmosphere at PP a lot.   The other patrons are young for the area, which made me feel more at ease. Different age groups mix together though, so it's not like a young mission bar.   I look forward to coming back here.", 
    "review_date": "2009-03-19"
  }, 
  "b0lXNnfnZpKPv7xNwpG3Ig": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jen C.", 
    "review_text": "Decided to give this place another go after stopping by earlier in the year to find it closed.  I think I might have given it 4 stars if the back area didn't have a weird smell.  And it was really empty when we got there yesterday which made the big open back space seem kind of depressing.   The pluses are that there are lots of tasty beers on tap and $1 off during happy hours which goes until 7 I think.  The booths in the front are comfy and great for lounging around and catching up with friends.  When we first go there didn't see a bartender behind the bar and finally after a few minutes he pops over.  There aren't a ton of bar options on Hayes so I'm glad that this place opened up again.  Casual place to grab a drink if you are waiting to eat at Suppenkuche or have dinner plans nearby.", 
    "review_date": "2011-10-19"
  }, 
  "ppkBNgjuAwNsoiddIt3mzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "chandra g.", 
    "review_text": "I'm not a violent person  I don't like to see blood, I don't (usually) like to see people get hurt but... a bar fight at 7:30pm on a Monday night?! that's comedy! (considering the douchebag that got socked deserved it)  The place has everything a local pub should have, (a little too loud) music, bar-seating, several tables, a big booth seat for a large party and some couches you can even let your dog nap on.  Speaking of dogs...  My dog has devoured many beer coasters here and the barkeep just chuckles.  I like it for what it is...just a regular pit stop for us lazy folks who don't have the energy to leave the block.", 
    "review_date": "2007-05-10"
  }, 
  "MhVvtOGpFbJ1w-fIWB7z7w": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alexander R.", 
    "review_text": "Beer and wine is what they serve in this Hayes Valley bar. Place Pigalle is alright because it's chill and they have a pool table. Come for the chill, stay for the vibe. I gotta whole lotta waves of friendliness when I came here. The front was light and the back was dark. I don't know if I was blind.", 
    "review_date": "2012-04-03"
  }, 
  "WFRWsmj5YWH_p665GvaNIg": {
    "user_rating": 4.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Megan V.", 
    "review_text": "I used to live around the corner from this place and it was a regular post-work/pre-party stop for beers with my favorite humans.  Although it's full of out-of-neighborhooders on the weekends, I think it's a much better backdrop for casual shit. They don't have a full liquor license but this isn't where you'd go to get fucked up in the first place.", 
    "review_date": "2007-04-24"
  }, 
  "YznzHIJw2FH8RfkAF9-svg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa R.", 
    "review_text": "Great spot. I'm new to San Fran and this was a great suggestion from friends. A cozy bar area in the front, pool table in the middle, and nice open airy plush couch seating in the back. It was a perfect place to meet up after the baseball game, they have tvs for those who don't make it to the ballpark and plenty of restos nearby if you wanna bring in a late night bite. Pssst... Don't get food from the Mediterranean places closest by, Hayes &amp; Kebab, it's no bueno! With only one pool table be prepared for the take turns :) however, with ample space in the back of the establishment, you will have no problem grabbing a seat, standing around a seating area, or making your way to the bar and back. There are also a great deal of boutiques nearby, so be sure to check out this area in the day time!", 
    "review_date": "2014-07-07"
  }, 
  "5jLkKtE4HPlrbjw-0w9lvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon T.", 
    "review_text": "Very good beer selection in the heart of Hayes Valley. Whether you're taking a break from shopping, or on your way home from work, Place Pigalle is a cool place to hang out and grab a pint.  Bonus: it's across from Paxti's!", 
    "review_date": "2013-10-03"
  }, 
  "iYeOigbzvpgtCfr_wbOawQ": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Miel H.", 
    "review_text": "Tonight I discovered that I like Hayes Valley. Oh, let the fusspots begin their comments on snobbery and affluenza, it's cozy. AND this bar was a great find. The red wine prices - lowest glass is $6.50, highest is $10.50.  They got pool tables, they got foozball. They got a great seating options. It doesn't smell like old beer on the floor and the bartender shared his pizza break with a homeless guy. That's downright sweet.  Nice atmosphere in a nice little spot. I found it on a Sunday night so the parking wasn't a nightmare and you know, I might just have to recommend this as a regular Sunday night haunt.", 
    "review_date": "2008-12-21"
  }, 
  "1z5LVnZhXrWgsQgMDpIIzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suzanne A.", 
    "review_text": "how could you not like a place that's named after the red light district in Paris's Montmartre neighborhood (remember Moulin Rouge?  the Muse de l'rotisme?), as well as where some of the most famous artists lived and worked (Van Gogh, Dali, Toulouse-Lautrec, Picasso and Pigalle himself)?  my first trip to Paris, when i was 15, we stayed in an apartment in this area, right above le sex shoppe....quite an experience, i must say...coming to this bar takes me back there...  i love that this slightly dive-y, crusty bar is in such a hipster neighborhood.  it has such character.  and my doggy is welcome there.  and i like electronica, so the music doesn't bother me one bit, nor does the fact that there are more men in there than women (good odds for me : ).  and it's walking distance from my house, and the bartenders are cool.  i had such a blast there last night, talking to a sister of perpetual indulgence and his dog...  sitting on one of their couches, beer in hand, yogi the dog sitting in my lap snoozing, i feel at home...", 
    "review_date": "2007-10-21"
  }, 
  "GfB6sC4NJQvSI2ewbQrDNA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitch A.", 
    "review_text": "I really want to like this place but every time I go I just can't feel the vibe.  I don't like smoke so the smoking kills me.  I also like my beer in cold glasses, especially if the beer isn't that cold.  It seems to me that every time I go here the glasses are luke-warm which to me makes the beer taste funny.  The last time they cleaned their couches seems like 1990. I give it 3 stars because it's one of the only decent bars in Hayes Valley.  The bartenders aren't too friendly either.", 
    "review_date": "2006-09-18"
  }, 
  "BUdazFZ3cs-CVKqnLgJKPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamara S.", 
    "review_text": "what's not to love? it's a dive, it's a block from my pad, and (some) people there know my name. in addition, its many couches (shabby chic?!) and welcoming bartenders hosted me upon my arrival in the nabe, quickly making me feel right at home.", 
    "review_date": "2009-05-27"
  }, 
  "Yx93cixWqq_DZZqIX2WXuQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David H.", 
    "review_text": "Ok, let me start out by saying I can't believe I have to give this place a 2 star review.  They have great beer, nice atmosphere and they let some people bring their dogs ins which was awesome.  The music selection on the Juke Box is the good kind of eclectic.  Only one toilet though for the whole place though...  On to why I had a bad experience.  So this bar tender who kinda looks like Robert Downey Jr was terrible.  1.) It took him like 3 - 5 min to finally come to the bar so I could get my first drink even though there were like 10 people in the whole establishment, none of whom were ordering drinks.  (apparently this is normal since I heard the same complaint from other patrons) 2.) I asked if they took credit card and he just kinda looked at me and nodded in a pompous manner.  3.) He gave me a glass which was chipped and when I showed it to him he feels the chip and instead of throwing away the glass he just puts it back in the dish washer.  The guy was just an overall d-bag and really put a damper on my experience.", 
    "review_date": "2012-01-16"
  }, 
  "XnBflxEeUp0C-MefpSSTMg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Him S.", 
    "review_text": "Home of the 12 oz pint.....   I have been a patron of Place Pigalle for more than a decade. It/s nice now, stil trying to find it's stride. One thing that REALLY disapoints are the 12 oz pints ( we checked / verified with a 12oz empty beer bottle).   If you're going to charge a preimum price for beer why not give us a full pint like they do elsewhere in SF.   It's offensive when bars think they're patrons are not smart enough to figure this out - it's sad that we have to.  A pint is a pint but not at place pigalle", 
    "review_date": "2012-01-25"
  }, 
  "R4DVayqiW63jHle7AG_NXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samantha M.", 
    "review_text": "Came here with my couchsurfing group last night and I  loved this place...a plethora of comfy couches, pool, and foosball! They played Gipsy Kings on the radio so that made it all the better for me. Large back area that is wonderful for groups, and I love their Wyder's pear cider! I think it's so much sweeter and easier to drink than Magners/Bulmers, however I did not like having to pay like $4.50 (or so) for it.  They do not have a full bar, so don't expect to get your mixed drink fix here. It's mostly beer and wine.   The only thing that left something to be desired was the bathroom. They have only one (huge bummer as there were long lines yesterday) and it is unisex, and 99% of the time that means it's not well attended and not clean. This one wasn't filthy, but it could definitely have been better.  But overall, I loved Place Pigalle and I will definitely be coming back if nothing but for the pear cider!", 
    "review_date": "2009-10-08"
  }, 
  "hP8by2q4mgfQEvvhfChcbQ": {
    "user_rating": 4.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Alicia J.", 
    "review_text": "I like it, I love it, I want some more of it. Great couch seating, friendly bartenders, pool tables, and foosball leads to way too much fun. I love that they do not serve all the hard stuff, leading me too often into shots of soju. It always seems like such a good idea at the time.", 
    "review_date": "2008-02-13"
  }, 
  "KKdBQXnUlVUZ0ZNTfMQoEA": {
    "user_rating": 2.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Tolga E.", 
    "review_text": "I kinda hate this place. Sort of. It's great that it's a local bar and that they have a pretty decent beer selection. But everything else about it...pretty much sucks.  The space is dimly lit, but cold. The walls are barren and reflect sound way too much. The music of often too loud and displays any lack of creativity whatsoever. The bar is too high for the stools! Even though its the only \"neighborhood bar\" in Hayes Valley (a neighborhood I love), it doesn't really feel like one. You can't have a decent conversation in there either.  The incessant smoking of people either inside, or right outside the door adds to the problem. Also, there is a decided, if unintentional feeling that nobody attractive goes to this bar. I don't know how that's been decided, it just seems to be the case. I feel like Jeremy Clarkson in Top Gear when he describes an Audi or other german car. It has all the elements of a pretty nice place, but it just feels soul-less and dull.  Place Pigalle is only good if you are meeting up with 2-3 good friends and want to have a beer in an unpretentious setting. But...this definitely doesn't fill Hayes Valley's desperate need for a solid and reliable neighborhood hangout.", 
    "review_date": "2008-06-10"
  }, 
  "ZJyPAb6K6GNjG83fs5nDkw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nono A.", 
    "review_text": "Cool, cozy place.  The drinks are not that expensive and the crowd's always fun.  Been here with my friends 3 or 4 times already.  No bad experience here.  Just that the whole look of the place could be a lot better.  (And I love the pool table!)", 
    "review_date": "2007-08-01"
  }, 
  "-pvKGlb04e8brYqsXGteQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin R.", 
    "review_text": "If I were to describe Place Pigalle as a dive bar, it would only be said with fondness. This bar boasts a surprisingly diverse set of regulars, is comfortable yet quirky, and has a good selection of foreign beers.   Talking is easy here, and you can easily find yourself meeting new people. It's also one of the few places in SF where you can smoke in the bar (or at least one of the few places that doesn't throw you out for it). Lastly, it is the most unlikely place in the world to find Sake being served up, but there it is.   There are better places to go out in Hayes Valley, but Place Pigalle manages to remain a place you'd come back to.", 
    "review_date": "2006-09-18"
  }, 
  "Xorep_PXj9XQH3UVquaZAA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather L.", 
    "review_text": "This place is definitely the diviest (is that even a word?) bar that I have been to in a while. Great drink menu in theory. Although they didn't seem to have any of the white wines or champagne that they listed. They do have Blue Moon beer and that is a HUGE plus in my book.   Pool table in the back. Lots of couches. They tended to look a little run down but again, this is a dive bar. Cute little bartender. They need to give her a step stool though. It was really difficult for her to pass the pints over the beer taps. Management, do you think you could help a girl out?  Anyway, have to give them a star off for the tool that wouldn't leave me alone from the time I walked in. Group of about 5 or 6 dressed in what looked like Asian Army uniforms completely wasted at 5pm on a Sunday afternoon. Apparently their most suave seemed to think that I was dying to make conversation with him. The guy clearly had an alcohol induced speech impediment. It was funny in the beginning but started to make me anxious when he kept touching me. No one seemed terribly concerned but I also wasn't making a scene about it. I would not recommend this place for females going by themselves. Go with a girlfriend, go with a boyfriend but don't go alone. Don't get me wrong it's a cool place to hang out but when you don't feel completely safe on a Sunday afternoon...well ladies you know what I mean.", 
    "review_date": "2007-12-03"
  }, 
  "fzwx-6P-uGbowzFWycjPbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay M.", 
    "review_text": "Cheap, dark, decent music depending on the night, chilled out crowd, good couches, and a list of fine beers available by the pitcher.  What else could you ask for if you're looking for an on-the-way-home-from-dinner beer or 5?", 
    "review_date": "2010-03-26"
  }, 
  "PWohtvH6nTdvGCGeRzoUuQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph N.", 
    "review_text": "Some of my friends love Place Pigalle for its foosball, but I'm not really a fan.  I don't like the ambiance and in the few times I've gone have thought mean thoughts about the other patrons.  The bathroom is nasty, and there's only one, which is bullshit.  The good thing is they have a pretty good beer selection and the service is fine.", 
    "review_date": "2009-06-17"
  }, 
  "yiDwlpEVrxw-pc2DTInPsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rusty O.", 
    "review_text": "This dimly lit gem on Hayes serves a decent selection of Beer and Soju cocktails.  The staff is friendly and you can catch a dog or two roaming the bar on most nights...They have pool table and foosball, but the wait can sometimes suck.  Comfy couches and quiet-ish music make it great to meet some friends and share a few pitchers.  Smoking was recently banned in the bar (for what it's worth)", 
    "review_date": "2006-12-27"
  }, 
  "BRh5hZvTU-xYXux5WnjBMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "Great little dive bar in Hayes Valley.  The remodeling definitely change it, but not too much to kill it's great reputation already.  Only beer and wine, so I'd give another star if it had liquor.  However, if you like beer and great selection of music, check it out.  You could do way worse in this area.", 
    "review_date": "2012-01-30"
  }, 
  "cz76cbJvk-ZLVTofNff0XA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shira O.", 
    "review_text": "Cool bar in Hayes. Not somewhere I'd go out of the way to go to, but the beers were good and cheap ($4-$6), there was a juke box, a pool table and seats. The music was a bit loud for it to be the  kind of bar you'd have a conversation in, but if you're looking to drink, chill and keep the talking to a minimum, then this may be the bar for you.", 
    "review_date": "2011-10-27"
  }, 
  "rshFnj9YqfmO5Yp2jsPjrA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben R.", 
    "review_text": "BYOW- Bring Your Own Women.  This place was a complete dick farm when I went there last. I'm not much for beer and wine bars, either... I like the option to go liquor. The hip-hop was REAL loud, too.", 
    "review_date": "2007-09-05"
  }, 
  "Z9lfqMy5ZgZDig1uQCVt9Q": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "K O.", 
    "review_text": "Not so bad. I've had some good and some boring nights here. Having a pool table is a plus. I can always find my friend throwing one back and chatting it up with his favorite bartender. He wants her badly. Applause him on his tenacity.  Other then that I am always impressed and I actually like the art on the wall. They even change it every month. Look on the table next to the couch that looks like its been used and abused for a decade and you'll find a nicely typed price list. And very affordable for artwork these days.", 
    "review_date": "2007-02-15"
  }, 
  "xW1VyqqsoASlUCMa7qjpXA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "I'm moving to the neighborhood shortly and am in need of a new home-away-from-home. And it looks like Place Pigalle will do rather nicely!  Great relaxed atmosphere, good selection of beers (Chimay? Yes, please!), dog-friendly (I have none, but just try and tear me away from yours...), and an exceedingly courteous staff.   The first time I visited was a Sunday afternoon with the parents. The girl behind the bar was so welcoming and put up with dad's silly jokes and sarcasm. I think she even bought him a drink. Maybe she thinks he's as charming as I do!  Another giant plus: the ever-crowded Patxi's delivers from across the street.    Oh - and great tunes!  I plan to while away many happy hours on their bar stools over the next few years. If they'll have me.", 
    "review_date": "2009-09-02"
  }, 
  "hKozw4Wo1DAXtBomsqRCxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tatjana G.", 
    "review_text": "Met the ex there in line to the unisex bathroom - which, despite everything, is still a good memory, so I definitely have a soft spot for this place.  Comfy, dilapidated sofas, puppies allowed inside, a good beer selection, pool AND foosball, relaxed, cool people. Prices could be a bit cheaper for what you're getting, but hey, being in Hayes Valley, I'm sure their rent ain't cheap.  4 hipster stars for being an oasis of laid-back, divey relaxation amongst the yuppie madness that is the valley.", 
    "review_date": "2007-12-27"
  }, 
  "OFi92Xc2QyIr787GNKtgZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "My FAVORITE neighborhood dive bar. Given its Hayes &amp; there's no other dive joints nearby so by default, its my favorite! But seriously, I enjoy it here. It's far from being divey at all, given that its more of an artsy lounge in the back. Nothing sleazy &amp; trashy going on besides maybe the bathroom.  With the laid back vibe in general, you can always find a very mixed crowd on any night. There's plenty of seating along with several comfy couches and a pool table in the back, making Pigalle a relaxed bar fitting for its neighborhood.  The best part of Pigalle is actually the wide selection of craft beers offered on tap at prices equal to Lower Haight bars. There's plenty of IPAs and other ales all the time so it saves me a trip uphill to Haight, and if you prefer wine they also carry that. Chill bartenders.", 
    "review_date": "2013-01-08"
  }, 
  "Cx2E56zbHsxa6NE1Gdn_dQ": {
    "user_rating": 3.0, 
    "user_location": "Dublin, Ireland", 
    "user_name": "Linn L.", 
    "review_text": "Smells beer and always filled with people. It has a nice and friendly vibe and is perfect for a beer a weekday night with friends. Unpretentious. They don't serve food but they have a menu for some pizza place with delivery if you're starving.", 
    "review_date": "2010-02-28"
  }, 
  "fHnAHkd0rNscAXlWpy7M9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "I find that my habit is to go from Biergarten to Place Pigalle as the sun starts to go down.   This bar is pretty chill. There's some nice window seating for you to gawk and shit talk about the passersby. The back room also has a pool table and more chill couches to lounge on.   Another plus is that it's a dog-friendly establishment, so I've seen a few canines hogging a seat every now and then. That's a good thing.", 
    "review_date": "2013-04-24"
  }, 
  "rCAIpsUDyknZBIctrSe9Cg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David Z.", 
    "review_text": "Not at all what I expected in this neighborhood. Billiards for a buck, weird drunk people (it *was* Friday night) and generally friendly folks. The bartenders were super fast and very nice. Bar up front and couches/pool table in the back. I found it very easy to strike up conversations here and the layout of the place is favorable for small to large groups. Yes, yes, yes it's a gentrified neighborhood so if you're looking for faux attitude you can go to Lucky 13 or Zeitgeist. Screw that, though, it's so totally last year; nice is the new black.! (that being said, nothing beats Zeitgeist on a warm summer evening). This place just is what it is. Not really lower haight, not really Marina. But I like it and I think I'd definitely go back. Oh yeah, and dogs. Not sure how I feel about that.", 
    "review_date": "2007-09-22"
  }, 
  "vODeKrgSvJt7Kr_cJTxohg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C. C.", 
    "review_text": "This is my favorite bar in my hood.  Allegash White? Check. Awesome friendly bartenders and lady's drink specials? Check. Pool table? Check. Dude, once the African American bartender (I don't know his name but he's my favorite fav) ordered a Paxti's pizza for the bar.  Sometimes the music gets waytoofuckingloud for conversation but eh. I love it.", 
    "review_date": "2012-02-02"
  }, 
  "LEXK_zrIgJyDw6xY8a1eGA": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Christina S.", 
    "review_text": "Now this is a dive bar I can dig. There's a pretty good wine and beer selection, and there are lots of couches and chairs that make for perfect \"let's stick around for a while, bitch about life, and have another Stella\" seating arrangements. There are few things that make me more uncomfortable than cigarette smoke and small yappy dogs, and I have to admit that both were on display tonight at Place Pigalle, but I think three stars fits the bill.", 
    "review_date": "2007-06-22"
  }, 
  "bk3LC4qjyk3VEVtpP4P68w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kierstan G.", 
    "review_text": "I love this place so much...so much in fact that I am using this for my 200th review.  Enough said.  Ha! gotcha! ...This place is my absolute hands down, one in a million, favorite dive bar.  (maybe not even a dive bar) Its in hayes valley, you can bring in pizza from across the street,  it serves mostly beer (with a few wine and sangria choices) and has a ton of awesome choices, has a decent juke box, a pool table, a ton of space...and wait for it......its DOG friendly!   Now, yes, its true, it took me like five times to actually learn the name of the place.  And its almost impossible to be a regular here because there are so many bartenders even the bartenders don't know each other...but its so chill and in walking distance form my place.   I have gone here dressed up from the opera and the following week dressed from a giants ball game.  Either way, it worked.  I've gone here after work on a Tuesday (lets not judge), and stayed until last call on a Saturday.    You often see the same people every time you go, so even though its in Hayes valley it seems very much a neighborhood bar...and on my birthday we were able to grab a few tables in the back, convince a few poor unassuming souls enjoying a beer to join, and we played cranium until the wee hours.   This really is my favorite place.", 
    "review_date": "2012-09-08"
  }, 
  "L2uIVVgoODNLj16V2U1eCg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aiden B.", 
    "review_text": "Place Pigalle is really the only bar in Hayes Valley, which is a shame because it's either not trying very hard or it's seen seriously better days.   They have an excellent draught beer selection, but that's about it. The pool table is typically broken and/or missing one of the balls. The bathroom is terrifying--sometimes flooded--albeit with excellent graffiti. The bartenders are nice and, depending on which one is working, have good taste in music--which is key because they're in control of the iPod in the back room.  If you're in Hayes, it's a nice place to get a beer, but not really destination-worthy.", 
    "review_date": "2007-02-11"
  }, 
  "M4ZvZMlOCWO86i7vY_aPlQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashleigh K.", 
    "review_text": "Dudes, one word:  foosball.  Oh, and they have Chimay and sake!  And darts.  And pool.  The pool table is always bogarted though because of that lame chalk board they have with names on it that somehow magically appear in front of yours when you're not looking.  A little loud for me and the lighting is strange.  Kind of like entering a cave at the front and coming out the other happy side with a drink in your hand...but hey what could be better than leaving a cave WITH a drink?  Sweet.  Good bar for the area since everything else is shi-shi minus Marlena's.", 
    "review_date": "2007-09-03"
  }, 
  "bA6sFAZTIc5ddwpnB_WJUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gil S.", 
    "review_text": "Decent, large, unpretentious two room bar with friendly no-attitude bartenders, haphazard tables and benches, a pool table, large ecclectic draft beer selection, and a foosball table.  A favorite of neighborhood locals in the 25-35 age range.  Dark and red.  Quiet until 10 or 11 weeknights then it gets packed.  Prices are about average, wine list is expensive but reasonable given the selections.  It used to be known as a place to smoke.  They got busted and now it's smoke free.  The vibe is still smoky but not a dive.", 
    "review_date": "2007-05-31"
  }, 
  "ra3OzaxpILytSjHRRKoT8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel B.", 
    "review_text": "Low-key Hayes Valley joint that's relaxing and cool.  Sometimes I get tired of places that are all that, and this is all normal.", 
    "review_date": "2007-02-10"
  }, 
  "KdC7iPZxcArSX9VERfbGPA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike W.", 
    "review_text": "Grunge decor tries hard. Pac Heights types look out of place. Count the striped shirts!", 
    "review_date": "2008-08-03"
  }, 
  "cmAHVj0b5Wz5Tun6Op0ksw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Skye W.", 
    "review_text": "I would highly recommend this place for a low key dive bar in hayes valley.  This is a great place to wait for a table at suppenkuche and they even have happy hour prices. I was there from about 630-8 on a Friday night and there were couches and table available and even a pool table that was unfortunately occupied.", 
    "review_date": "2010-08-11"
  }, 
  "tx407EtvKoXXEZqYQFQVJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff M.", 
    "review_text": "\"No really Jeff, Place Pigalle is a really good dive!\"  Dude, I get free drinks at Zeitgeist.  The bartender at Lucky 13 pours me a Prohibition when he sees me walk in the door.  I refuse to go to the Haight without stopping by the Trophy Room.  I grew up half a block from Trad'r Sam.  I know \"good dives,\" and those are \"good dives.\"  So do NOT try to tell me that *Ha-YES Valley* of all places has a good dive bar.  This is one of the most gentrified strips in the City.  There's a Palo Alto restaurant across the street.  Hayes &amp; Octavia?  \"Dive\" anything?  Please.  Holy crapcakes was I wrong.  Place Pigalle, frou-frou name and all, is a fucking awesome dive.  With a fantastic beer selection.  And a pool table.  And foosball.  And window seating.  And like, eleventy-three couches strewn about.  I knew I was completely wrong about PP when a dog wandered in, and the bartender invited him up onto a barstool.  You can't fake that, kids.  I have to take a star off for the listed prices.  Four bucks &amp; change for a Prohibition is high.  $6.25 for a Hoegaarten is silly.  And $4.25 for a bottle of Corona is highway robbery (however, with a beer selection like PP's, you deserve what you get for ordering Corona).  These are not dive prices.  However, when you buy three drinks, and one is on the house, this pretty much ceases to be a problem.  Four-and-a-half stars.  Also of note, last night- a Sunday- everyone went outside to smoke, including the bartender.  So NYAH, you smelly bastards.", 
    "review_date": "2007-09-10"
  }, 
  "RQl9gX49kyXskpMvydzSwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "s d.", 
    "review_text": "One of the best dive bars in SF, and really the only legit spot to hang out at in Hayes Valley.", 
    "review_date": "2009-11-21"
  }, 
  "djwgcGrEb7kFxvVcjNjivg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "RahBurt B.", 
    "review_text": "Four stars for everything a dive bar should have...good beer selection, solid staff and non-annoying customers.  Bonus star because I was lucky enough to be there when David Byrne showed up after his show with the Extra Action Marching Band who took over the place and rocked out.  I'll be a fan for life after that night.", 
    "review_date": "2008-10-12"
  }, 
  "NeHxrGuSN_Ktq498F6k2MA": {
    "user_rating": 4.0, 
    "user_location": "Round Lake, IL", 
    "user_name": "Shannel G.", 
    "review_text": "Went here after a bday dinner at Suppenkuche, and had a great time. They have a couple couches at the front end, which we gathered around. It was comfy, cheap and had good bar service.  It wasn't crazy crowded, which is what we enjoyed about it. We could all sit comfortably and talk (without yelling) and drink together. They had some good dance music playing even though there wasn't a dance floor (at least not that I saw, but I didn't wander past the bar), which just kinda made the place perfect for that relaxing, but fun atmosphere our group was after.  I would def go again.", 
    "review_date": "2010-04-12"
  }, 
  "pPC2m5MZMf0u1BlHjT4CMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clare E.", 
    "review_text": "Overall this place was a great meeting spot for a big group for a Birthday.  We had never been before so were not sure what to expect.   My two complaints are that the bathroom is ridiculously gross (but after a few beers, not so bad) but apparently I had more than a few beers...the tab for my husband and I was $80 which does not seem in line with the atmosphere and the disgusting bathroom.  I would go back but keep a closer watch on my tab next time.", 
    "review_date": "2008-01-29"
  }, 
  "tGgTIueZy1JNTzQD9rkZLQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "05.05.10  Don't ask me how I ended up here Cinco de Mayo with three boys.  I can't tell you even if I tried.  Neighborhood dive bar, good draft beer selection, red cup on beer = tapped out.  Very reasonably priced, which leads to more beer consumption than one should have on a Wednesday night.  Good times.", 
    "review_date": "2010-05-06"
  }, 
  "mROok9JZx19AwvOJlI8FHQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art O.", 
    "review_text": "Not sure why some of these reviews refer to this place as a dive. I think that term is way over-used these days. This is definitely a neighborhood bar and a cool one at that. There's a pool table in the back and the locals seemed mellow. The bartender was low-key and quick. I liked the overall vibe and the beer selection was pretty solid.  If people want to try some real dive bars I got a few recommendations for them. In the mean time try not to describe any you bar you go to that isn't a lounge as a dive.", 
    "review_date": "2013-04-03"
  }, 
  "TWMn0oA1G00m1gDNOHMTOQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah L.", 
    "review_text": "I have to say, I used to come in here quite a bit back in the day. It used to be a great dive bar with a good crowd, friendly bartenders, in a great hood. And then I kind of stopped going....a year later I've come back and found a bar filled with douchey-mcfrat-boys. The vibe of the bar has completely changed. If I wanted to hang out in the Marina, I would. AKA. Not. Into. It. At. All.", 
    "review_date": "2009-05-24"
  }, 
  "qlJVwqTNPKDv91NOfi0k9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheri N.", 
    "review_text": "low key dive bar.  it's dimly lit, kinda like a dungeon, and just how i like my bars.  people of all walks of life come around during happy hour.  you can't beat their happy hour deals!  they have a great selection of beers, and wines of all sorts.", 
    "review_date": "2009-07-24"
  }, 
  "brTYfgAc0uD7fiT8arLqIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nori H.", 
    "review_text": "I rolled in here last night when my friend &amp; I discovered that neither Absinthe nor Sugar were open at 1 AM on a Monday night.  (I mean, dude!)  I'm not sure what's up with people calling this a \"dive,\" unless that means to them any bar with a pool table in it.  Comfy sofas (and plenty of space on 'em at 1 AM on a Monday, let me tell you!); good beers on tap (Racer 5; Black Butte Porter; Leffe (*swoon*); &amp;c.); pleasant people working there.  Why have I not discovered this place before?  Hayes Valley suddenly looks so much more chill -- and I mean that only in the best way.", 
    "review_date": "2008-04-15"
  }, 
  "GZgM5M0O7NtLV8xSIjuIQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "joolia f.", 
    "review_text": "I never really can remember the name of this place. In spite of this, my friends still know what I am referring to when I say let's meet up at that place Pascalls, Pagals, Place Piscalls.", 
    "review_date": "2009-06-03"
  }, 
  "MFZAJCjeogRcavL7pvU6yQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth W.", 
    "review_text": "Aside from smelling like au du lemon scented Lysol, this dive bar on Hayes isn't half bad!  Decent draft beer selection, and a pool table so one can only criticize so much.  Not sure if I'd hang out on the couches....", 
    "review_date": "2012-12-08"
  }, 
  "_lbgVbWTvxV9VTVWU0YnwA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noneya B.", 
    "review_text": "Wow... what a dump - and I'm not saying because it's a dive bar, I'm saying it because of the crowd this bar keeps.  We came into this place on a random Sunday afternoon for a day drinking session after a mediocre breakfast at Stacks.  At first, we were having a great time: drinking beer, playing Foosball, and just lounging on one of the back sofas.  Well, shortly after a few rounds of kicking ass on the foosball table (as I normally do!) these guys kept bugging to play me.  So, I played - I lost.  Well, what do you expect?  I haven't played in quite some time and this dude looked like he plays all day every day at this bar!  So, after giving them the table, we went to the pool table.  The guys followed saying \"oh, you think we're good at foosball, just watch us play pool!\"  Look buddy, I don't give a $hit about how you play.  I'm here to hang out with my friends, not be harassed by some loser who hangs out here as if it were home.  So, after patiently waiting for our turn on the pool table, some chick runs over and starts racking the balls.  My boyfriends said \"oh, that's my name as the next player on the chalkboard, actually.\" Instead gracefully apologizing and moving aside to wait her turn, she says - \"WELL MY NAME WAS ON THERE BEFORE AND NOW ITS NOT.\"  So, what in the hell does that mean??? Instead of getting in an argument, my boyfriend says - ok no problem, I'll just wait and go next (he's so sweet!)  He leaves for the restroom and she starts laughing with the guy who was playing the last game.  So I guess they were friends and lying so they could squeeze another game in?  WTH?!  It's not that big of a deal people!  If you wanted to play again, you could have just said so - we didn't care that much,  LOSERS!  At the same moment my bf is walking to the restroom, some drunk lady with her dogs starts pointing at him saying \"that's him, that's him!\"  I look at her and asked her if there was something wrong (in a very nice manner) and she says \"YEAH THAT GUY KICKED MY DOG AND LAUGHED!\"  With a bit of a laugh that I really couldn't hold, I said WHAT?  No he didn't - when did he do that?  She said, oh maybe it wasn't him.  I said um, ok and walked away.  No need for a useless argument.  My boyfriend steps out of the bathroom and she runs to him \"YOU KICKED MY DOG AND LAUGHED!! YOU KICKED MY DOG!!!\" My boyfriend half laughs and asks WHAT???? When did I do that?  She says \"LIKE AN HOUR AGO!\" I then walk up because I'm not having any of this and say \"LOOK LADY, WE JUST GOT HERE LESS THAN 30 MINUTES AGO AND HAVE BEEN IN THE BACK PLAYING FOOSBALL!\"  Eventually she calmed the hell down and went back to her seat - but kept staring at us and talking about us with her friend.  Seriously, why are you even bringing your big ass dogs (YES MORE THAN ONE) to a bar anyway?  We are actually VERY pet friendly people but this was too much.    We finished our ONE beer and proceeded to the next bar without all the drama.  This place was WHACK!  Too bad for the bartender as well - we all work or have worked in the bar business and are great tippers.  Sorry your bar groupies sucks!", 
    "review_date": "2012-02-23"
  }, 
  "jX52sZoojxyYV2viWNyO7A": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "David O.", 
    "review_text": "Place Pigalle, you're nothing like your Parisian namesake, except for the dirt and grunge.  I'd come here and order a few beers (really nice selection on tap) when I had nothing better to do... nice bonus: you can smoke inside, for those of you that smoke, that is.", 
    "review_date": "2006-11-01"
  }, 
  "Ct456aEICzDfn03MHZCzsw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miriam b.", 
    "review_text": "compromised wid my fauxfemme Innes and went here first before we headed towards different 2nd parties and got a quickie. humm, cuties wid da grunge works for s'him too. that couch looks like one found on the street wid da um....large sticky stain?", 
    "review_date": "2006-03-14"
  }, 
  "FVWL31cQvOp3mO2fi5WlOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy K.", 
    "review_text": "I'd like the place even if it wasn't so close to my apartment. It's like being at home, what with all the beaten-up couches, except all nice and social. Their beer and wine selection is great, the bartenders are super friendly, and the pool and foosball keeps everyone entertained. Personally, I'm not a fan of the smoking that happens in the bar, but that's my only real complaint. It's a neighborhood place, not a destination location, and I always leave with a smile on my face. Oh, and they usually have jello shots on the weekend. Like I said, always a good time.", 
    "review_date": "2006-08-23"
  }, 
  "LnZUtFx6qTWs8NV6lAARxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "A nice, dark and cozy place to have drinks.  I love the great selection of beers on tap (including Racer 5 IPA, Hoegaarten, Bodingtons, etc).  They have something for everyone - that likes beer.  The couches were a real nice addition to the place.  As for those that don't drink beer, you're only options are wine and soju cocktails.  We went here on Saturday and encountered a very mellow crowd.  I can't wait until my next visit!", 
    "review_date": "2008-05-19"
  }, 
  "sCpQ4H_lKHXTLpo4rUu1RQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul K.", 
    "review_text": "I'm typically a fan of quirky dive bars, but this place misses for some reason.  Perhaps it was the broken traffic cone hanging from the gaping-covered hole in the roof which passes as a \"skylight.\"  That being said, it provides the standard assortment of beers one finds at these sorts of places in SF (you know the ones).  The crowd was nicely mellow as well.  I would stop in for a drink if I'm in the area, but probably wouldn't stay that long.", 
    "review_date": "2009-03-18"
  }, 
  "sXLAy83l7EwdZjsYFbaq0A": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kara B.", 
    "review_text": "Yay! I had a hot soda here (because they didn't have any ice!), and I probably got hepatitis upon entering that bathroom... naaaasty, nasty-ass bathroom. I give this place one star because the resident dog is cute, and the other star because I haven't seen a real Lite-Brite since I was a kid... yes, there was a community Lite-Brite for one's light-therapy needs.", 
    "review_date": "2009-06-18"
  }, 
  "o9Ez0unDH1XninHhs3h2Fw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ali R.", 
    "review_text": "Nice quiet dive bar in Hayes Valley. If in the area and looking for a casual place to hang out with your friends, I recommend Place Pigalle. Diverse beer selection, pool table, hooks under the bar. No complaints but nothing to write home about.", 
    "review_date": "2009-07-24"
  }, 
  "QOlY5FYliVVvkgqgtjdP_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim G.", 
    "review_text": "it has a little something for everyone: comfy couches, artwork, pool, foosball, etc.  my only caveat is that my clothes absolutely wreak of smoke the next day.  the bartenders are always super nice, and be sure to say hi to jackie -- she's always helping out over there (and is quite the pool shark).", 
    "review_date": "2006-02-26"
  }, 
  "MDmNN2laCuXHrfc04COMCQ": {
    "user_rating": 4.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Charlene P.", 
    "review_text": "cool place to hang. this place serves lots of beer on tap, good choices of wine by the glass, soju and sake cocktails. there's obviously a bar with stools to sit at, but there are also couches and round tables.  they also allow dogs in here! that was funny! dogs at bars.. i have never experienced that b4 till last night. case in point, the shih tzu in the bar decided to roll up next to us on the couch. cute! went here after work one day and threw back a couple of blue moons. bartender gave me orange slices and said \"this is how we do\". yay!  they also played good music while i was there - a mixture of old school hip hop and a few red hot chili pepper songs.  i would have given it 5 stars, but someone had BO and the stank was wafting in and out of the place.", 
    "review_date": "2008-10-31"
  }, 
  "bG6DkJKwhKMMQ0Z3GSOpmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pete J.", 
    "review_text": "Ah, Place Pigalle. I've never been there for a non-birthday, but everyone has gotta be born sometime, &amp; I've noticed that friends who go here for birthday parties tend to later make this their bar of choice for their own birthday party. It's spacious, unpretentious, centrally located, moderately priced, &amp; you can smoke indoors there (a source of contention for some...okay, most). But smoking-quandary aside, this place is pretty sweet, &amp; I'd go there anytime there's a birthday to meet up for.", 
    "review_date": "2006-11-29"
  }, 
  "hp4EfXvHbwFLyczlFz9WlQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rachael S.", 
    "review_text": "It's a tough town.  There are loads of pubs, but in neighborhoods afar, and there are loads of stylish over-priced scenes, but I'd rather stay home and watch the Warriors try to make the playoffs.   So it's hard to find what I'm looking for (which seemed so abundant back in grad school).  But if what you happen to be seeking is a low-key, comfortable place to grab a beer with your friends after dinner, or to chat with a date and actually hear what he or she has to say, Place Pigalle is a fine stop.  They've got a solid beer selection, though they don't have enough exotic ones on tap (particularly for a bar that focuses on beer and wine), and happened to be out of innocuous things like Stella.  But it was a really pleasant surprise to find a place that actually has sufficient seating.   I probably wouldn't go there to meet people you don't already know, but it's the first bar I've found in awhile in which I could enjoy a beer, and enjoy the good company of friends.  But maybe I just had a fun night out . . .", 
    "review_date": "2008-03-29"
  }, 
  "XHuNSjrPA3Vyi7n4iVhZaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "There are times when you don't know where life will take you. It's good to know there will always be a glass of cheap wine, comfortable couches, a dirty graffiti filled bathroom (my favorite, because it reminds me I don't live in Bergenfield, New Jersey and I sure as hell don't want to) and gigantic windows waiting for you here at Place Pigalle.", 
    "review_date": "2007-08-14"
  }, 
  "nd1Z0OCN5H6BaEr77HMLuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "vlad k.", 
    "review_text": "It's gonna be very hard for me to write a review of this bar because of how my night started. yan was in town from prague, so a few of us went to a german restaurant called Suppenkuche to have dinner. the food there was pretty good and they had a ton of different beers to choose from that you could get in all sorts of sizes ranging from small glasses all the way up to huge *4 liter* containers. yes, you could definitely drink a serious amount of beer in this place. yan and kevin got a huge 2 liter beer that came in a monstrous glass that was shaped like a boot. it was hillarious. erica and i each got 1 liter beers. as the night wore on, we each got another order, so by the time we left the restaurant, we had each drank 2 liters a piece.  we left Suppenkuche and stumbled off to Place Pigalle. the rest of the night is a bit of a blur. somehow i lost my debit card and also my paycheck. somehow i got into Popscene without paying. somehow we ended up being driven around in a Lincoln Towncar. somehow we ended up on some girl's balcony. the night ended at Sparky's, yet i dont recall anything about a very expensive milkshake, nor how we got home. ahh yes... another classic night.  so, what does this review actually say about Place Pigalle? well, pretty much nothing really. all i know about that place is that it has a pool table and looks kind of run down inside... and i only know that cause i had to come back a few days later to pick up my missing debit card.  ***edit*** ok, i've been back to place pigalle a bunch of times now.  i really dig the place and it's become my local bar of choice on many nights.  chill atmosphere, good beers, and they used to allow smoking inside which was really cool... but sadly, they can't allow it anymore.  (my resolution this year is to visit 50 new bars in SF.  read about it at: <a href=\"/redir?url=http%3A%2F%2Ffiftybars.thisisvlad.com&amp;s=90470ef2a294ec5a8b83db337f40edb798ccaa93834eb5d3cc4e655df9ffd07a\" rel=\"nofollow\" target=\"_blank\">fiftybars.thisisvlad.com</a> )", 
    "review_date": "2006-06-21"
  }, 
  "_wgezevSyzQiLuvaNlKJqA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anjelika P.", 
    "review_text": "Nice beers, shitty cheap wines, moderately disgusting bathroom. I do like the juke box though and the pool table is nice. This is the cheapest place in the hood with Marlena's gone,  $7 for 2buck chuck or whatever they pour there.", 
    "review_date": "2013-07-30"
  }, 
  "qD51vvp5Zf5DgPEGy7yfDQ": {
    "user_rating": 3.0, 
    "user_location": "Ocala, FL", 
    "user_name": "Marsha Z.", 
    "review_text": "Place proved to be a good bar to continue our libations after hitting Suppenkuche.  And it's a cool spot to kick back and relax.  Smoking is allowed, but while the smoke didn't bother me, I can see it being a problem for some people.  The bar's a fine place to stop in if you find yourself in Hayes Valley.", 
    "review_date": "2006-04-19"
  }, 
  "LtVyiNyp26ikDf-aJULqzQ": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "David S.", 
    "review_text": "I used to hate this place.  Why would I go to some straight dive artsy hipster bar when there are so many other places to go?  Then I found out why.  1. The bartenders remember me   2. The place is totally local (except on the weekends, you've been warned)  3. Cheap beer and reasonable wine  4. No meat market  Oh, and one of my BFF's practically lives in the bar.", 
    "review_date": "2007-05-31"
  }, 
  "Zqu-tMR9CHjA44sU7I5bXA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Viv C.", 
    "review_text": "It's a good place to grab a beer for happy hour and chat with old friends. Definitely a dive-locals feel. The music is generally hip hop but I haven't seen anyone dancing. It seems like people just congregate here to throw back a couple of cold ones on some comfortable but worn couches.  They get points for having Chimay!  Smokers are welcome to smoke inside here. I'm not a smoker so I'm not too excited about that but, eh, whatever floats your boat.  Overall, I'd go here on a whim but not as a determined destination. It's good for what it is. A place to get a drink. Utilitarian.", 
    "review_date": "2006-08-04"
  }, 
  "WYJCG3mlZC_xePoDLxVCFQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stef A.", 
    "review_text": "A couple of blocks from home or I probably would never have gone in.  It's a decent kinda-divey-but-not-really place.  I prefer a real dive.  I also prefer a full bar.  It is a good place to sit back and have a beer and be able to talk--a quality a lot of bars lack.  This makes me wonder: why are there so few good places to just chill over a drink?  Rock shows and headphones have pretty much made me incapable of being able to pick out voices in a loud environment, so I've gotta give some props there.  But it stays at three stars.", 
    "review_date": "2008-08-07"
  }, 
  "szhitaiKPsjC15bveyXRzA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G R.", 
    "review_text": "WARNING: do not go to this dive bar wearing a suit.    I know, I know, I know, I should have taken the tie off before I walked in here (its not like I just stumbled in (well I did stumble since it was after a few)) but the point is that I walk up to the bar order my Chmay and sit down on the couch minding my own business when a local comes over to complain that I am bringing the vibe down by walking in with a suit on.  I look over at the dude who is clearly annoyed and probably thinks I drove an SUV and parked it outside and tell him I dont speak English.  I burst his bubble, he fell off his soap box but after a little back and forth he gave up, reached into his pocket pulled out a fifth of Jamos took a swig and offered me some.  So the lesson learned: DONT WALK INTO THIS PLACE WITH A SUIT UNLESS YOU CAN SPEAK ANOTHER LANGUAGE", 
    "review_date": "2008-04-10"
  }, 
  "deq1UGZFqd4mmb1b5-9qWw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "heather C.", 
    "review_text": "I always end up crying here. Usually, it's my own fault for falling over or falling in love with someone. But last Friday, it was Place Pigalle's fault - they ran out of pint glasses at 11pm on Friday night. No back-up plan.  Boooo-hooooo.", 
    "review_date": "2010-04-03"
  }, 
  "8AKkzhyzq8UVzQ8WuGoFlA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JIll H.", 
    "review_text": "I have a friend that lives just a couple doors down from here, so when I see him we normlly go here. It's a comfy place with couches and a pool table, good people, good times. It can get quite crowded on the weekend, so get there early to get a good spot", 
    "review_date": "2006-07-13"
  }, 
  "VPINiUt71jfnBkGcf-XX_A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lula Mae W.", 
    "review_text": "They have Chimay on tap, and that's worth at least two stars.   Probably not going to hang out here all night, especially since they don't have hard booze and it can be misty with marlboro haze, but is a good place to grab a beer or a glass of wine.  I have to admit to not really getting the whole soju/sake cocktail thing, but I don't tend toward the sweet end of the cocktail spectrum.", 
    "review_date": "2005-06-20"
  }, 
  "Pgp3ujphDzRjYTGJFGnP8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Howard g.", 
    "review_text": "My friend and I went to Pigalles Thursday St. Patricks Day, after not going there for a year. I was happy to see it open again because the neighborhood doesn't have many choices for bars.   Of course the lack of beer was annoying but I did find the new girl likable. Outside of being nice and on her first day, she was comfortable enough to engage my friend and I, and others, in conversation which I liked. Honestly we went back last night because of her service (nothing against the other bartenders who are good)...and are happy with her addition.   I do like the feel of a \"down home\" bar but the place really needs some focused attention on the decor without affecting the local or typical customer base. Hopefully good things are in store for this place.", 
    "review_date": "2011-03-20"
  }, 
  "c9m5WYY6KysAtyo5-ngvYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Olga R.", 
    "review_text": "No one has mentioned the Place Pigalle bartenders and they MAKE this place. I stop in to PP on my way home almost everyday. This is definitely a locals spot during the week. You can get to know your bartenders there and they aren't pushy like other \"hipster\" places where they just don't give a shit about your order. Daniel is super friendly (and from Boston) and always happy to listen. Everyone is really hot! I don't know what happened to Lindsay, she is a sweetheart, but Anthony is very cool and is a good story teller.  I love their foosball table and the fact that I can get a pitcher of beer and not have to deal with the smell of pot and cigarettes the way I sometimes do at zeitgeist. If only they did bloody marys...  I love that you can bring in your dog and there are always dog treats on the counter. The couches are comfy and the bathroom is...well, unique.  Cheers!", 
    "review_date": "2009-08-17"
  }, 
  "5Tc0YXgYDvTTlps0e8xTNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jill D.", 
    "review_text": "I went here last night with a couple of courageous friends who were not afraid to hang out with me after a Yelp Elite event.  This should earn them a place in the Guinness Book of World Records because I was definitely feeling F-I-N-E!  As in \"no pain\" because I'd drunk my weight in alcoholic beverages.  I think Kevin actually attempted to engage me in some serious conversation regarding Salvador Dali and his place in the artistic world.  Now THAT'S goddamn commendable!  Several of my friends knew the bartender there and she hooked me up with a delightful glass of prosecco.  I love me some prosecco and I love me a place that appreciates serving it instead of some foul, cheap swill masquerading as sparkling wine.  Extra kudos to the two cute pooches snoozing on the sofa.", 
    "review_date": "2007-09-20"
  }, 
  "G1DM_OyYFb32QylgvQGrGQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "regina k.", 
    "review_text": "It's a dive bar with couches, lots of \"found object\" art, a huge back space that holds a pool table and more couches.  Seems like a lot of couples come here.  A nice retreat from window shopping, this dive serves only beer, some good jams, and has a friendly and upbeat vibe.", 
    "review_date": "2008-12-31"
  }, 
  "UuM7grHT7EKz3f2rF3wJVg": {
    "user_rating": 4.0, 
    "user_location": "New Berlin, WI", 
    "user_name": "Amy S.", 
    "review_text": "This wine  bar was  the perfect atmosphere of  lounging  around  and interesting artsy people  to talk to.  A little  too  smokey in the back but me and my friends sat near the door so we good  access to the fresh air.", 
    "review_date": "2006-04-23"
  }, 
  "6x3qPM172G0_Ba5jFlTwLA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "systems e.", 
    "review_text": "This place is pretty laid back - there's nothing hard here, but if you like beer and smokey bars, check it out.", 
    "review_date": "2006-03-27"
  }, 
  "DiAUiaoDKFlifJK0FCkEWg": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "danny e.", 
    "review_text": "I am friendly with the bar tenders... I am friendly with the patrons, I wish i was friendly with Sancho, the resident alcoholic dog. He wears a bandanna and drinks all the beer he is given. This is a great little dive bar with foozball tables and the occasional competitions. They always have local artists have their work on display. They only server sake, wine, and beer. If you want well drinks you can walk on down to Marlena's and enjoy a drag show while your at it.", 
    "review_date": "2008-01-23"
  }, 
  "XHvfw3UU2YtvvKMLV_oWSg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara M.", 
    "review_text": "Cool little dive bar-When we walked in they were playing Daft Punk- then continued on to play Notorious BIG, Decent selection of draft beers and a pool table in the back.", 
    "review_date": "2010-04-11"
  }, 
  "4ylPZeW-5QZhCD8yMztp8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kirsten S.", 
    "review_text": "Again, this is another one of those situatutions where I'm surprised I'm even allowed within 50 yards of the premises.  I mean, the amount of jackassery I have performed here over the past 2 years of my life is unheard of.  But they actually enjoy it or at least pretend to and keep welcoming me me back in with open arms - thats the messed up thing!  Its a beautiful thing in my eyes and this is a beautiful dive bar.  The bartenders here are the best in the city - i cant say enough about how fucking awesome they all are.  This place is like a second home to me.  I love the neighborhood crowd - alot of the people i met here have become great friends.  Kind of like the abusive alcoholic family i never had.    Oh and i totally kicked so much ass at foosball here about 2 weeks ago - seriously i was on fire, you shoulda seen it", 
    "review_date": "2007-09-26"
  }, 
  "quFKdGPaL_JHdXwqwHNm4w": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Liz J.", 
    "review_text": "I came here a week or so ago and what everyone has said is true: pretty typical dive-y bar with an excellent and varied beer selection. The bar itself is fairly large, with multiple different seating/standing options. They don't take cards unless you hit a certain dollar amount (can't remember what exactly).  But it's key selling point, which not enough people have mentioned: DOGS. The night I came to this place, there were not one, not two, but THREE dogs running around and hanging out. They were the cutest.  If you're dog-deprived living in your tiny city apartment, it's great to get to go hang out with other people's dogs in a situation where you don't have to ask \"do you mind if I pet your dog?\" as you awkwardly lurch towards a dog on a leash.   So yeah, go here because you want your three different types of Allagash on tap for less than $6---stay here because you want to hang with the dogs!", 
    "review_date": "2013-01-08"
  }, 
  "MWoE80sT-6QU3hO2PBHGzg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene M.", 
    "review_text": "When you first walk into Place Pigalle, you would think you're in the Haight or the Mission, not Hayes Valley. Not exactly known for having a series of no frills bars, Place Pigalle manages to solidify itself as the neighborhood's bona fide dive.   Nice by dive bar standards, it's definitely the place to hangout for the locals who just need a place to grab a beer, shoot some pool, and hang out when they don't feel like dropping some serious coin at one of the many fancy restaurants and bars that are scattered around the neighborhood.  This place is definitely \"what you see is what you get.\" When you walk in, you'll find a few small tables and seats, as well as a small bar. They only serve beer, wine, and sake, so if you need some hard liquor, you'd best be going elsewhere. Thankfully, their beer selection is top notch, featuring over 20 domestic, import, and micro brew beers on tap. Good news for the beer drinkers out there, you can order anything on tap by the pitcher. They also have plenty of bottled beers, including one of my personal favorites, Chimay. Check out the full review on my blog, see profile.", 
    "review_date": "2009-04-16"
  }, 
  "Ip8ztdExo0hy_ErKr9WoNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza B.", 
    "review_text": "I love this place. super chill, great beer and ambiance.  It has become one of my favorite places to hang out on a weekend or happy hour.", 
    "review_date": "2013-05-28"
  }, 
  "60BRzMurKxXAkp798XtC7A": {
    "user_rating": 4.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Gabriella P.", 
    "review_text": "Chill little dive bar with a really good beer selection and bartender!  My friends and I were exploring this neighborhood a couple Saturdays ago  and stumbled in here for a few beers.  We aren't exactly hipsters, and yes we are older than most of the people in here, but we were made to feel totally welcome here by the bartender.  He recommended beers to us and let us try a couple before we decided which to order.  I'm probably twice his age but he was super relaxed and friendly with us.  Not like, \"Why are you people in this bar?\"  lol  Will definitely drop in again when I'm in the area.", 
    "review_date": "2014-08-18"
  }, 
  "8NVYA1Jbp4Wj70g_WdCXAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CNine H.", 
    "review_text": "For you elitists out there, consider this: Every time you write a gripe and call it a review, you are doing a disservice to not only the business, it is also to the staff that relies on tips. To Kate K, you went into a bar that on it's yelp review says beer and wine only and expected vodka, then gave 1 star to the establishment, which to me speaks to your integrity. Do you have an agenda with Place Pigalle? You evidently drink beer, you're holding one in your profile picture and there is another photo of you and a Tecate on the beach. You state that you \"can't respect a bar that doesn't serve vodka. That and it smells like foot...\" did you go in on one of the nights when we had huge downpours and the whole town smells like foot because of the dampness? How did the bartender treat you, were the drinks cold? Was the pool table functioning? These are the things of a review, yours is a rant. So next time you want to up your review count, do us all a favor, you elitists, write a real review. And when you're called out on your poor writing skills don't respond with \"It's just a fucking Yelp review, relax.\" no it is not just that or you wouldn't be writing hundreds of reviews. And for the people that work in these places and feel the hit from these poor excuses of a review , it's not just a fucking review.", 
    "review_date": "2009-02-23"
  }, 
  "KcHGO-5qw03HYjtk5k3CzA": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Peter M.", 
    "review_text": "It's a decent beer/wine dive-y bar.  I certainly don't know how to rank it (or others like it) in the Canon of SF Dive Bars, but it's fine.  Nice place to grab a beer.", 
    "review_date": "2008-12-23"
  }, 
  "bPLL3tqfwBrRX0K5dwgONw": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "S L.", 
    "review_text": "You can't smoke in here anymore so what's the point.", 
    "review_date": "2006-12-28"
  }, 
  "CgHbSPnkpCBn-EJkwJeghA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Catrinel A.", 
    "review_text": "When you want to get everyone out of your house and grab some pitchers o'beer, where do you go? PLACE Pigalle (or da pig as we have called it from the get go)!  This is just the perfect neighborhood bar in terms of convenience and the fact that I actually like it.  The staff is mellow, I know each one by name as they do me - hey that's gotta count for something, right?  It does in my book!  I've met some interesting folks here too, some I'd like to forget and others I don't remember.  But the real reason we starting posting up at Da Pig is for their foosball!  Boy is it a fun game especially when you are not very good but love it just the same.    I suppose my tagline could be \"When the going get tough I go to da pig\"!", 
    "review_date": "2007-04-14"
  }, 
  "SMfq-__aZWg_YEWhrgwgFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "This place is great for sitting with friends. If you can snag one of the tables (esp. in the back), the music isn't too loud that you can all talk and enjoy their selection of beers and wines. I've had a lot of fun here and the bartenders are great.  In Hayes Valley? Definitely stop by and get a pint or two!", 
    "review_date": "2009-02-23"
  }, 
  "v8ipAh_tNQovfD5LcaDlKw": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Matt R.", 
    "review_text": "This place has the can-can do spirit of dive bars.  After I'm done shopping for 200 dollar vegan shoes for my dog at one of the Hayes Valley boutiques, I like to come here. This bar is really a neighborhood watering hole.  This is usually a good place to find a pool game or meet a friend for a drink. I like the style of the furniture. The art on the wall changes often.   This place isn't too much fun when it's crowded. There is only one bathroom and you can wait a while to play pool. Drink service seems to scale well with the amount of people though.", 
    "review_date": "2009-06-25"
  }, 
  "oQhZez4nAwXH0kutnpULfg": {
    "user_rating": 3.0, 
    "user_location": "Bothell, WA", 
    "user_name": "Lou T.", 
    "review_text": "Chill hole-in-a-wall bar with a good selection of beers on draft. Beware of your belongings because there are some suspect bums in this area.  Once we had to slap a bum for reaching into my friend's bag!", 
    "review_date": "2010-07-26"
  }, 
  "mW8fvDQ3JAtzeLjU--CjTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rowena L.", 
    "review_text": "Came by with a birthday group last week and thought it was a nice place. Nothing special, but it's not pretentious at all  and the drink prices are reasonable. Got the Bourbon Barrel Stout, which was delicious.", 
    "review_date": "2014-04-22"
  }, 
  "o24hAvq77K5csF5z4UbURg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dishar R.", 
    "review_text": "I go here for happy hour alot cause my co-workers pick it alot.  If it were up to me, I would pick other places in Hayes Valley.  But, its got a lot of space, cheap happy hour, good location. so I don't complain that much.", 
    "review_date": "2008-01-09"
  }, 
  "CFL1vDhDfriHesGPJX09tg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anne Marie M.", 
    "review_text": "I've been dragged to this place twice now and can't say it's my favorite. The name is also incredibly misleading. The only similarity between Place Pigalle in Paris and this place is that both are messy and dirty. Like Place Pigalle, in my year living in Paris, I only managed to visit there twice. It was fun taking pictures in front of the Moulin Rouge and yuccking it up but at the end of the day, like the bar, there were places I liked a lot more than Place Pigalle.  The beer selection is pretty good--there's some 15 or so beers on tap. I slugged through my allagash white and the boyfriend liked his west coast IPA and our trooper of a third wheel Colbert T. said his anchor steam was just fine. My beer was kinda tepid--I enjoy a good frosty glass or at least the beer cold and Place Pigalle doesn't offer that.   There's a bunch of couches that are great for sitting but also, in my opinion, kind of dirty. Not my cup of tea but not the worst place to be dragged on a slow Friday night. It was super packed which made for some good hipster watching. It took me a second to realize I had been there before but for a very dead happy hour.", 
    "review_date": "2012-01-28"
  }, 
  "7A5lajj4qvHSDM97Kg-x4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karsten P.", 
    "review_text": "Good place for a drink and a game of pool while you're waiting for your people to collect. Every time I've been there (about twice a year for the past few), they've been playing good mixes and the crowd has been hipster but pleasant. Great beer and good wine selection.", 
    "review_date": "2006-07-01"
  }, 
  "HdW_VZSVFiZTt7VcGIu52w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "frisco j.", 
    "review_text": "there's nothing parisian or sexy about place pigalle. it's actually a dark and smoky bar with a pool table. i see a whole lot of hipsters here trying to get in touch with their rougher side, but please, we all know the hipsters aren't very tough at all. if the hipsters were indeed tough, they would walk up a few blocks to the low income housing on hayes street in the middle of the night.  one recommendation. don't wear your good clothes here, unless you don't mind smelling like my dad who happens to be a chain smoker. oh, and if you're a regular here, i suggest that you check your lung regularly. yes, even if you don't smoke, second hand smoking is alive and well at place pigalle. now if you don't mind the smoking, place pigalle is a decent place to hang out, drink and shoot pool. if there's a waiting list for the pool table, that's ok. just start playing anyway. if the hipsters get mad, let them get mad. i mean, they're just hipsters. it's not like they can fight or anything.  * i think this is my most macho review to date. i kinda like it. or not.", 
    "review_date": "2006-12-12"
  }, 
  "KeZjKwMbqPU2qQO7oGgWLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie I.", 
    "review_text": "Your standard arty neighborhood bar. Good selection of beer, lots of seating, local artwork and a pool table. Last time I went there on a Saturday they closed at midnight?\n  One thing that can be gross is the smoking inside. I sat at the bar and when I crossed my legs something fell from underneath - makeshift ashtrays filled with cigarette butts. Yup, all over my legs and purse. Yyyyeeck!", 
    "review_date": "2005-07-01"
  }, 
  "YGvtTweRXu-fcjaNRVJALw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul M.", 
    "review_text": "This place is a blemish on the face of San Francisco. We sat at the bar for a solid ten minutes- not to even be acknowledged by the way too desperately hipster lackey bartender, so after being very obviously (and purposefully) ignored we left. There was all of seven patrons at the bar- not even remotely busy. Dirty, horrible decor, bad lighting, deafening jukebox and abysmal service- or lack thereof in this case. Do yourself a favor and go elsewhere- there are many other bars in the immediate area that will welcome your business.", 
    "review_date": "2011-10-15"
  }, 
  "_StgklibYb1J2IJOaPMJqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mercedes T.", 
    "review_text": "Daniel is the BEST bartender.  He's really nice and always has a smile on his face.  My friends and I used to come here weekly about a year ago and when we stop in sporadically, he still remembers our names and what we want.  I also like that there are often dogs in here.   Great bar, great jams, great prices and good people.", 
    "review_date": "2009-02-09"
  }, 
  "A0_AQYOXtytaRbl-yHcpaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vannessa G.", 
    "review_text": "Great neighborhood bar with a babe working behind the counter! Decent beer selection and some wine too. nice and dark with a pool table juke box. best part is it hasn't been over run by suits...", 
    "review_date": "2014-05-01"
  }, 
  "v6BwXWTmUyRKYch-pnzAiw": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "jack w.", 
    "review_text": "Johnny Pyle!!! Yum Yum dive bar  It's raw,  it's got a hot layout,  it's in perfect neighborhood.", 
    "review_date": "2009-05-05"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "Divy and good. Get my magnars fix here. Will come back and reevaluate when it's busier. Got a pool table in back and ample standing room.", 
    "review_date": "2014-04-09"
  }, 
  "1R25AVXTD2sQgNNN6z0PFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marcelo P.", 
    "review_text": "Low key, roomy place with a large selection of beers on tap.  Good happy hour  (I believe its $2.75 per pint) and close to lots of tasty eats In Hayes Valley if you get the beer munchies.", 
    "review_date": "2007-05-01"
  }, 
  "fQuLe-KuojSco4DRbcFpGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa D.", 
    "review_text": "this is a 4 star dive bar.  DIVE, being the operative word.   it's grimy, unpretentious, jolly drunks meet downtrodden sales execs clearly done kissing ass for the day. it's a good place to unwind and relax. i love their music mixes, cool bartenders, and foosball and pool table tourneys.  they have a beer and wine license only, but they have hot/cold sake and soju. i wouldn't recommend this place to non-smokers, as it's impossible to come out of there not smelling like an ashtray.  it's in a great neighborhood and decent parking. check it out if you're looking for an easy getaway from cover charges and dress-to-impress places. good people, good vibe all around.", 
    "review_date": "2007-06-15"
  }, 
  "3tJcTVPckkv7ZOrn1EcqPg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Patrick P.", 
    "review_text": "Place Pigalle is a go-to spot for friendly bartenders, good beer, and decent prices.  The happy hour is especially welcoming in that regard.  Don't expect a chill, scenestery, bar.  To me this place defines what a good bar should be:  The music is always loud, there often a lot of pretty drunk people, there's comfy seating, and there are lots of smokers on the curb.  Maybe it's not everyone's scene, but I like having it in my neighborhood.  Oh yeah, and we share initials!", 
    "review_date": "2007-03-15"
  }, 
  "OaRk-RwFEzfOtc45ff0fGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "I went here to get a beer while waiting for a friend (Biergarten was packed) so we could go to Loving Cup/Schulzie's Bread Pudding for dessert.  One beer turned into five and we never made it to dessert.  Oops.  Had a great time.  The bartender was friendly and attentive, it wasn't loud, they had good beers on tap, and it wasn't difficult to find a place to sit and hang out. Doesn't hurt that they're next to Timbuktu and there's a bike corral nearby.", 
    "review_date": "2014-09-07"
  }, 
  "YlJNqoHqIssCHP25h2sUFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie N.", 
    "review_text": "Am I in Paris....I've been to Pigalle, but this doesn't look like it...there aren't enough hookers around!  But it is a great bar.  Nestled in the thick of Hayes Valley, this is a dive bar with \"class\" (if such a thing exists).  Comfortable couches, pool tables...and friendly clientele.  I've heard you can smoke here which gets the one star mark off....luckily the night I was here there was no smoking.  Definitely will check it out again as it's close to home!", 
    "review_date": "2007-12-21"
  }, 
  "zEarwErejqXmDol-gGXDkA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew E.", 
    "review_text": "A grungy Bohemian hipster joint, with a French twist. The bar has some old couches to sit on and some interesting local art on the walls.  Place Pigalle has an interesting selection of beer and some good wines by the glass (be aware that beer and wine is ALL they serve; no liquor on the menu).  They also look the other way if you want to smoke... but if smoke bothers you, you should probably go somewhere else.", 
    "review_date": "2006-09-28"
  }, 
  "eRHBKd719ydDbH6n37wAcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shane P.", 
    "review_text": "Go ahead, prop yourself up on a red velvet sofa!  Not a bad little dive if ya ask me.  They have Blue Moon here on tap...SWEET!  It smells a little like Clorox when you walk in, but it goes away with time as you start to feel a little high from the fumes.  :o)  Just kidding!  Three red couches adorn the entrance where a good group of people can chill-ax and talk.  There's also a nice sized round table that can easily seat 6 people at the front.  The bar is suuuuuuper long so you should have no problem finding a place to sit your badunka dunk.  Pool tables are located in the back (and yes I said tables...I think there were two maybe three).  Myself and three other peeps walked in here on a Sunday evening to grab a pint after putting our name in at Patxi's across the street (also reviewed).  This is a great place to just hang back and enjoy the evening.", 
    "review_date": "2008-04-15"
  }, 
  "8MeD1D70MC-0dIK2Lr11WQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richa A.", 
    "review_text": "Love the couches / plethora of seating options.   Cheap drinks.  Interesting music/ decor combo.  Fun place to lounge around with friends, but probably not where you want to end your night.", 
    "review_date": "2010-12-28"
  }, 
  "3OtmrtS2sXiBHUQ1m6owCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jen m.", 
    "review_text": "Dark, comfy bars with pool tables always work for me. It's not Paris like the name implies- but there's a touch of bohemia and i guess, euro flavor, what with all the smoke... Nice bartenders, nice priced drinks!", 
    "review_date": "2007-04-02"
  }, 
  "DTWtZJAIPMrZJwUJV0DJmQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Njon W.", 
    "review_text": "Shatangi was brought to Place Pigalle by out-of-towners who had been there on a previous trip.  A great mix of mostly trendy but very laid back and unpretentious 20-30 somethings in a bring-your-dog and smoke cigarettes, hipster SF kinda way.  Pleasant staff and good music.  Shatangi told you...", 
    "review_date": "2009-07-30"
  }, 
  "_XFhTYX3wS0ftGc9u4pLqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roxane W.", 
    "review_text": "I love this place! It has a Foosball table, a pool table, funky couches, cheap drinks, lots of space, and great music. Seriously.  It's a very chill bar.  Only downside is the grungy bathroom, but it makes me feel like more of a hipster for frequenting this bar.", 
    "review_date": "2010-12-29"
  }, 
  "rX96zl-3HodtewDdiFzhgw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "andrew s.", 
    "review_text": "this place is okay.  but kind of only because hayes valley severely lacks a just easy go-to bar.  this place could be it, but not in its present incarnation.  1.  get a real liquor license.  i'm sure this is much more complicated than i am making it out to be, but it'd seriously up the awesomeness.    2.  be a little nicer.  i get it, you're going for the hipster-don't-give-a-shit thing, but when you're kind of a dick to my friend's girlfriend and no one in the group can figure out why (and she's like the last person you could imagine being a dick to, just a really nice person) it kind of really sucks.  this was last fall; i've been back there a few times since then and the dude in comment hasn't been around so hey maybe it's bygones.    i kind of like this place, and really want to like it more.", 
    "review_date": "2011-04-06"
  }, 
  "V2NgfYGt3mYFVVyYMoWbFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lou M.", 
    "review_text": "My new neighborhood bar. Cool atmosphere, lotsa beers, pool, foosball, lotsa beers. Also always a few dogs running around. Allows smoking which can be a huge plus or minus depending.", 
    "review_date": "2005-09-26"
  }, 
  "e9tRaGle0R48BOaIgEZMyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Napoleon C.", 
    "review_text": "Want some alone time with a date or is the result of a crappy day at work forcing you to seek isolation...with good beer?Well if that isn't enough of a vague description than use the excuse \"the weather is simply shitty!\". Regardless this is the place to go. They have a good beer selection and quite the atmosphere to make for a fun destination. Parking is quite the challenge but as my most of my reviews are proving, parking sucks in San Francisco.", 
    "review_date": "2012-04-15"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "It seems as if this bar lounge has been through a lot over the years.  It looks run down, but offers the standard seating area as well a full bar and one unisex restroom.  I couldn't tell if the door to the restroom was closed or occupied because when you lock it, the door is left slightly opened and not closed entirely.  Besides that, there is a pool table to entertain and an open area that reminded me of a dimly lit dining room.  I've just seen better bars and been to better ones, however.", 
    "review_date": "2013-11-07"
  }, 
  "3TXNWQ-x98YphuVy2HegJA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa D.", 
    "review_text": "Nice random place I came to with Kevin and Ajay this past Thursday after work. I was amazed at how large the space was, especially in the back. When I came, the back was completely empty, including the pool table. My friends and I decided to play a bit of pool. A drunk, much older, gentleman came by and decided he wanted to hang out with us. I guess that was okay but he kept touching us, mainly Kevin, then Ajay. They joked that he wasn't into me, but you know what, I'm not complaining!  Beers were nice and cheap(er) than other places in the area. They have this special $9 beer that you should take a sample sip of. The boys convinced me to try it, saying, \"It smells like ass, but tastes really good!\" It wasn't too bad. Just don't smell, haha.  I feel like the bar would have a much nicer feel to it if the furniture in the back was arranged in some better way. Maybe get someone in to feng shui it? It did feel a bit recreation-room-like (as someone stated in a previous review).", 
    "review_date": "2011-11-19"
  }, 
  "PAuzCcKBzwRkiQhdqS0ftA": {
    "user_rating": 3.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Papandreou A.", 
    "review_text": "Sweet neighborhood bar.  Good atmosphere, great lighting and cheap drinks.  Not  a pick-up joint, not a sceney trend zone.  Just a great place to have a drink with a friend and relax.", 
    "review_date": "2007-01-01"
  }, 
  "56vERWd2VPTfjytCQlSc6g": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Cathleya G.", 
    "review_text": "Great day bar spot (think hole in the wall type), especially to drop your boyfriend off at while you go shopping.  Pool, darts, foozball and comfy couches keep you entertained, really sweet girl behind the bar.", 
    "review_date": "2006-03-04"
  }, 
  "-vss4j7XXTWUWyKV2gWlNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clark M.", 
    "review_text": "It was a good suprirse; dive bars can be that way sometimes...and being SF; it's not uncommon for that little touch of something to make it more than just a dive bar", 
    "review_date": "2013-05-13"
  }, 
  "6p3bSON7IBTS4AG4IFZG8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "An u.", 
    "review_text": "Great bar, I like to go here often, though not as often as I would like. right up there with Lone Palms for me.", 
    "review_date": "2007-04-12"
  }, 
  "ZvtIMylao3fzsiT2G8AJ3A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wayne F.", 
    "review_text": "Wandered in here while waiting for a table at Patxi's with my ball and chain. I appreciated the low-key vibe and the vast selection of beers. I actually didn't realize it was beer and wine only until coming to yelp to write my review -- good thing I had wanted beer that night! If I had ordered a cocktail and been refused, this review would probably look a lot different.  I enjoyed the sofa-seating... there's something magical about sitting on a sofa and drinking beer... in public.", 
    "review_date": "2009-08-05"
  }, 
  "OnMRLZ5Qalb01iMjyL80Ew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caryn K.", 
    "review_text": "The good: -Not one, but *two* Tornado tables that are kept in good condition. -Foosball tournaments -Big open windows at the front -Hoegaarden on tap  The bad: -Smoking inside (YUCK!)", 
    "review_date": "2006-09-23"
  }, 
  "uYs60IPTrCFXOrq7dUq0_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trev C.", 
    "review_text": "I love this little spot named after Picasso's old stomping ground. I started coming here when I moved to the area last year and can't break the habit. The bartenders are the best and there are always friendly dogs hanging out with great people.  It's a beer and wine joint but its not uncommon to see people grab shots at Marlena's a block away and stumble back for more. You can even sip on business juice after work and keep on going with the recent addition of free WiFi.", 
    "review_date": "2008-05-27"
  }, 
  "8JabhfiPNpyTLV2pYDBrDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "erica u.", 
    "review_text": "YAY, pretty cool place to chill with great music.  its a very neighborly atmosphere and casually \"funkdafied\".", 
    "review_date": "2008-02-07"
  }, 
  "w55vztPPofeXLhKJLSMeGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sam l.", 
    "review_text": "So bummed to hear about Hayes valley Prop. Trying to shut down this neighborhood bar! This place has been here for years and it's always been a huge contribution with the neighborhood, they support local artists and are great people. If there's a petition let me know, I'll sign it!", 
    "review_date": "2014-05-23"
  }, 
  "2Sf58ceaNru-RFabRtUvvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "neil c.", 
    "review_text": "Dive bar? Really. Ok. It's awfully nice for a dive bar.   3 dollar Racer 5 pints at happy hour make me happy. Friendly bartenders, and interesting seating are nice too. They have a decent selection of beer on tap, and some decent look wine choices (and that's why it's NOT a dive bar!). They also have sake.   Nice little spot in an area of the city I don't frequent, but if you're in the area, it's a nice place to grab a drink.", 
    "review_date": "2008-02-29"
  }, 
  "Z4n5CnqKECsNWT5oJTNsMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff G.", 
    "review_text": "Read the reviews for Place Pigalle and you'll get a sense of the great atmosphere, awesome selection of beer and wine, wonderful local art and fun bar games. What doesn't come through enough is how nice and truly inviting the people that work there are.  We recently hosted a party for my wife's birthday at Place Pigalle. When we arrived we were greeted by Terry, the bar manager, and Samantha who helped serve our party. Terry was a gem, making sure we had everything we needed and helping us to get everything setup. Samantha worked her ass off. I mean seriously, she was amazing. She always had a smile and no one ever had to ask twice for anything, which was a tremendous feet considering we were about 40 at the high point. I honestly don't know how she did it.  If you're looking for a chill place to unwind (solo or with friends) Place Pigalle is hands down the best spot in Hayes Valley and one of the city's best!", 
    "review_date": "2012-09-24"
  }, 
  "lJmQg9UC_J8UGxmtd-Pi2A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Megan G.", 
    "review_text": "I think I may have found my go-to bar. After months of San Francisco bar-hopping Ive found a bar whose vibe I just get. It feels comfy and friendly- from the bartenders to the regulars to the couches on the side of the room. Best on a low key weeknight. Solid and reasonably priced beer selection. Pool tables in the back. No muss, no fuss, just a good solid bar. Good choice for those of us who inhabit that ambiguous zone between hipsters and yuppies.", 
    "review_date": "2008-01-04"
  }, 
  "9GCCoFw_UHiAHjZ4kygHgw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren V.", 
    "review_text": "can you still smoke inside here?if so thats where my two stars come from.other than that, its not that cool of a spot.", 
    "review_date": "2008-08-06"
  }, 
  "XnFbxNCucA_IWQY3hkDOJg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John K.", 
    "review_text": "I am still on the fence about Place Pigalle so, for now, they get three stars. I don't really understand hipsters and so I feel slightly out of place but the bar staff always treats me well and they have a good selection of beer. You might see me here at the bar with a wrap from Hayes &amp; Kebab or a \"thin crust\" pizza from Patxi's.", 
    "review_date": "2007-12-31"
  }, 
  "2xLEMsSeCSsk8hnfw_bg1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "eeeee d.", 
    "review_text": "great beer and wine selection, no hard alcohol, not open early enough (not til 5), good mellow vibe, smoking is a plus, especially when the bf smokes and doesn't have to go outside every 15 minutes.", 
    "review_date": "2006-03-11"
  }, 
  "wZ13br0UIvwn_txbZ1vRvg": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Veronica V.", 
    "review_text": "After dinner at Domo and a quick pass by Smuggler's Cove,  (who would wait in line early on a Friday night to go to a tiki bar?) we head back to Hayes and stop by Place Pigalle.  We had been here once before during the day and it was average, close to the apt. and had an inviting couch up front by the window. Well this time the couch was full and bad music was blaring and the crowd was a yucky combo of post work late 30's, 100% anglo drunk desperation.   It was not average.   It sucked. It could have been me.  I have a high standards for bars, divey or not, I like my crowd mixed, my music either great or nondescript and the majority of the patrons have to be collarless.   Though there is a death of bars in Hayes Valley I wont be back. Plus when I walk by Into Video to and from and I think about my 140 dollar late fees and I feel guilty.", 
    "review_date": "2010-02-13"
  }, 
  "GXn4ZsasLKh0qZ5g3nIqcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "Not exactly the place you'd think you'd find a smoking bar, but sure enough, there one is. Amidst all the closed little posh Hayes Valley shops lies this smoking bar. It's like the little rich kid who's parents don't know he's off having cigarettes during study hall. I love it. Good beer on tap, pool tables and an interesting atmosphere. It seemed like a designated couples bar, as if you couldn't come in unless you were swooning over someone. Cool bar, I just have absolutely no idea when I'll be back over in this direction...", 
    "review_date": "2005-09-30"
  }, 
  "D0ty0wxjQLhQR9GjhMSLXA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasmine B.", 
    "review_text": "I'm a little late to the train, but one of my new favorites. I walked by this place for ages before I actually decided to go inside. It's very much a place to chill with your friends, or significant other than trying to pick up people. Props for the comfy couches, and their happy hour, the darker atmosphere makes for a nice date bar.    I don't know if it's the namesake, but every time I go I seem to run into the staff who work at the french school down the way (and the owners of cafe tartine), and they're perfectly happy to let me bum cigarettes from them in an attempt to actually have people to speak French with. The downside is I'm a little sad that I never came during the time in which smoking inside was allowed...Le sigh.", 
    "review_date": "2006-12-23"
  }, 
  "VQoFQ8225ZeSplagU0nE4g": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "S C.", 
    "review_text": "Love the atmosphere: dark, relaxed with a great selection of beer and wine.  My only complaint is that sometimes it's SOOO LOUD YOU CAN'T HEAR YOURSELF THINK!", 
    "review_date": "2010-08-01"
  }, 
  "qqKddLtLxbPnTf6c7yqS3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "around town e.", 
    "review_text": "good neighborhood bar in hayes", 
    "review_date": "2012-04-09"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "Place Pigalle is the red light district in Paris. When I'm old and rich I'm going to move to Paris and open a bar called 'Capp Street' and it'll be off the hook.  Despite the name, this spot struck me as unpretentious and fun. beer &amp; wine only (which is fine with me; the crowds at these places tend to be much less obnoxious), a few pool &amp; foosball tables, loud music. The bartender on thursday night was cool enough to down a shot of soju with us and let me slide a little on the $10 minimum for credit cards (Please don't abuse this.) I'm gonna come back.  There is only one bathroom here for both genders. There is often a line. This is the only reason this isn't a five star spot, in my opinion.  And while the soju isn't particularly strong by itself, it carries some bad hoodoo. We found ourselves wandering up the embarcadero at 5:00 the next morning and I think those shots had something to do with it somehow.", 
    "review_date": "2007-06-17"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "if you want to slum it in a hayes valley bar, this is the place to go.  not a full service bar but has a very relax atmosphere.", 
    "review_date": "2009-02-23"
  }, 
  "KeZmfAGKpXJhhEt6j8kZjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barbs J.", 
    "review_text": "I really enjoy this bar, especially at happy hour with a group of friends. It's a relaxed atmosphere, nice and laid back, with some interesting local art displayed. The smoking is a drawback though, but it doesn't seem to get that bad....", 
    "review_date": "2005-09-27"
  }, 
  "xnlVxgrLP5HgaKZobRuHZA": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "Hello, my new neighborhood dive bar, good to meet you. Living and playing around Hayes Valley, Place Pigalle has become the bar to go to when we're waiting for a table to open up at a nearby restaurant, when we're meeting people on the way to some event, or when we just need to go get a beer.   I'll admit it's not the NICEST of bars, but what neighborhood dive bar would be? They have a huge variety of imported beers, local beers, and a lot of beers on tap. They also have wine on tap (When asked how that works--Is it pressurized? Can't be, right?--the bartender replied \"I don't know the SCIENCE behind it, I know it just works.) The wine it limited, just red and white blends, but I get it embarrassingly often, considering all the awesome beers here.  They don't keeps tabs and they don't take credit cards for orders less than $12. There are pool tables in the back but I've never played because I'm intimidated by the riff raff that's always back there. Also, this place is dog friendly, so bring the pooch.", 
    "review_date": "2012-06-18"
  }, 
  "q4yMVuGp1JZW1n2eSleEvw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heidi P.", 
    "review_text": "On the expensive side for a dive bar, but with a pool table and a good amount of seating and some good beer choices.  Yes, I will be going back.  In fact I'm kind of shocked that it took me so long to go there in the first place.", 
    "review_date": "2007-11-15"
  }, 
  "CKE7bImVY81KJD8PiiuDPQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anita C.", 
    "review_text": "Great Happy Hour! Interesting array of beers on tap too. I liked it!", 
    "review_date": "2007-05-15"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "upscale dive vibe with plenty of seating - thank you SF god - &amp; nice beer selection + pool table. unexpectedly down to earth for this part of hayes ;)", 
    "review_date": "2014-06-19"
  }, 
  "Ad9CVmXNegnsfYZWBYKoxw": {
    "user_rating": 4.0, 
    "user_location": "Bronx, NY", 
    "user_name": "Edgar E.", 
    "review_text": "This bar has become one of our favorites. The beer selection gets an A+ with all of their high content of delicious alcohol :) (I really need to get back to my AA meetings after this place) I highly recomend their choices of Ipas. I still havent had the opportunity to make it to one of their happy hrs. Yet I'm still willing to spend 6 bucks for a decent pour of beer here. Only reason I don't give it 5 stars is due to the lack of food. Other than that I highly recommend trying out this place.", 
    "review_date": "2013-01-18"
  }, 
  "BiRLsPNxF7Do5H6j9NYPdg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mike And Theresa C.", 
    "review_text": "A good chill spot that's great for hanging out with friends. Not much going on in the way of decor but it's a dive bar, so who cares. Laid-back vibe with the customers and the bartenders. The bartender has a lovely black dog that's very calm and friendly, we petted him all night. But he tends to break wind when relaxed. Large dogs make large smells! You've been warned. Pluses: nice selection of craft beers on tap, prices reasonable, large space with plenty of seating, pool table in back.", 
    "review_date": "2013-03-13"
  }, 
  "3uWP6jEI099DTgtRxFU2cA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess R.", 
    "review_text": "Living in Hayes Valley, I have to walk by this place almost daily. The stench of stale beer permeates the sidewalk from 10 feet away. The sofas are literally full of fleas! The bathroom is disgusting, the toilet doesn't even work half the time. The only plus this place has is a friendly and responsive bar staff. If you can manage to go in and sit at the bar, get your drink and get out, you'll do okay.", 
    "review_date": "2008-07-13"
  }, 
  "e2prQn9FpEaeLkEKT0A30A": {
    "user_rating": 3.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Giselle U.", 
    "review_text": "When I'm in town, sometimes I'll drop by here with my best friend for a beer or two. I like the music they play...I heard an MF Doom song once..surprise.   The restroom is a no go...unless you really really gotta go.", 
    "review_date": "2006-09-17"
  }, 
  "Bc_hZIB-Yhorc1ZjLYZKOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole K.", 
    "review_text": "I went here once with my crazy ex-roommate and she somehow managed to spill beer in her eye.  I love you Place Pigalle- you made my year!", 
    "review_date": "2008-02-07"
  }, 
  "SLOmbZq9IlzNHgXr6p-ZdQ": {
    "user_rating": 5.0, 
    "user_location": "Tara Hills, CA", 
    "user_name": "Jack W.", 
    "review_text": "Awesome.", 
    "review_date": "2012-03-25"
  }, 
  "zAxVTy0LH5QHxEQfzpk3sg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shelley M.", 
    "review_text": "Nice chill spot I found after getting off work early.It was raining outside and I was waiting for the bus,so ducked in.Good beer selection..10 on tap,and a few bottled. Allagash Curieux! Pool table,tv with the game on,open space in back with couches. And they allow dogs,very cool! I will def be back in with my lab,and def be back after work,especially if it is raining and I don't have my bike.No bike=more beers.", 
    "review_date": "2011-11-21"
  }, 
  "oOE6GdVb_4aTC2oufln8WQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zoe s.", 
    "review_text": "Years ago I worked for a company that decided to name all it's conference rooms after places loved by the senior staff, one of which was Place Pigalle. Now being that I worked for a Medical Device Company I thought of Place Pigalle as some stuffy high-end bar, the likes of which my four-inch heels would never see the inside of.   I was wrong on both accounts.   I have been to Place Pigalle several times - last night being the most recent. It is dark, a little dirty, and the music was way to loud. However, they have a pool table and a decent selection of beer, wine, and even sake, which is a nice offering. I don't think they serve anything 'harder'.  The place seems to attract a very local crowd, so it gets 'stars' for that..especially since I feel like all of my standard places in the Mission have been invaded by the under 25 crowd. Plus, the bartender was really cute (if you are reading this I was the girl in yellow and the guy I was with is NOT my boyfriend). An extra star for the eye candy.   Still, I can't imagine my former group of senior staffers visiting this place since it was full of greasy-haired tight jeans wearing boys who were bopping along to the Janet Jackson that was blaring out of the stereo. Come to think of it maybe that conference room was named after the 'red-light' district in Paris. Ewww, gross! Dirty bastards.  If I was in the area I would go back, but no special trips.", 
    "review_date": "2007-06-13"
  }, 
  "MizlaDrXhL99TrWWXXkO5Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josua P.", 
    "review_text": "The couches are nice. It makes me feel like I'm in my living room. Except for all the beer stains...and cigarette smoke...oh, and I probably can't take off my pants.", 
    "review_date": "2006-07-13"
  }, 
  "QocP49nZ7Fo-4Rp_QxPuDQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura F.", 
    "review_text": "I was pleased to see the big red couches are still here..fyi like carousing in your living room but instead in a bar!", 
    "review_date": "2010-12-15"
  }, 
  "2iVXoaHBKlQPEtMkwaQvpQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles L.", 
    "review_text": "Cool psuedo-dive bar in Hayes Valley. They've got a great beer selection, and enough little nooks and craney's to allow you and your 7 other friends to all hang and socialize.  There's a foosball and pool table too, in case the conversations get dry. Because of its location, and the way Hayes Valley has become very up and coming, you can get a good mix of people here.  I'd recommend it for anyone who wanted to \"get their drink on\" in this part of San Fran. Its probably not half bad for random socializing either, as most of the people popping in there are from the neighborhood.", 
    "review_date": "2008-07-30"
  }, 
  "1ajfyNyf41CxS8doHEzmfw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darrell L.", 
    "review_text": "great feel of this place, and a wide array of beer to choose from. deep in wine, sake, and soju too. definitely a locals bar where regulars are plentiful and outsiders can feel a bit like the nudist at the wedding dinner. pool table, foosball, and pretty damn big for a local spot.\n  if you smoke, youll love it here, if not, you may end up leaving after just a few minutes. if i lived in the neighborhood, id be at this spot all the time.\n  oh, and dogs are welcome, kick ass.", 
    "review_date": "2006-08-14"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "Place Pigalle in Paris has a nice representation of three things I like a lot, or so I have been told and so history dictates.   This is the location of Moulin Rouge and countless sex shops. If a little TB, a few whips and dildos as well as some side alley prostitution don't scare you then this area represents sex, and I, personally, like sex (though as a disclaimer I must say I am not a huge fan of TB nor side alley prostitutes who, in times past, were proud carriers of the TB).  This area is said to carry some of the best musical instrument shops in the world. Now, this doesn't help me much since, aside from some brief success with the Violin that I wasn't motivated enough to pursue, I am a complete wreck at playing any instrument. However, I like music and admire greatly anyone who can master an instrument.   Place Pigalle was once also home to the studios of many of the Modern Art Masters; Toulouse-Lautrec, Picasso, Van Gogh all painted here to name just a few, and if you know anything about me you know I would cut my left ear off to own something by any of these artists.   So, Place Pigalle, the little bar in Hayes Valley, has a lot to live up to.   Yes, they have music, but it has never struck me as mindblowingly good, its just there drowning out the chatter of a mellow crowd of beer and wine drinkers (No hard alcohol here).   They have artwork, which is constantly rotating, but I have yet to see any pieces that have inspired me to even trim a fingernail for, let alone cut off an appendage.   They have sex. Oh, wait, not they don't. In fact the only logical place for a quickie in any bar would be the restroom, and since the entire damn bar has to share one single bathroom sex is most definitely out.   Sorry Place Pigalle, I know you try hard and you are okay to pop into for a beer, but the name is all wrong. I think you ought to leave this one to the French.", 
    "review_date": "2008-04-04"
  }, 
  "uMIppVwGLc8oYKkvtqndGQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Crattus M.", 
    "review_text": "Open Letter to Whomever It Applies:  You slam Pigalle and complain that you should be able to go to a bar that serves drinks you like to drink.  Well, guess what?  You are.  Jade Bar is right in the 'hood and Marlena's is just a few doors down.  How is it the fault of the bartender or the establishment that you chose to stay and drink beer you don't care for in lieu of the hard stuff?   Pigalle is a great neighborhood beer and wine bar with incredible bartenders and colorful patrons but, clearly, it's not for everyone.  Thus said, might I suggest that, should you again find yourself in a similar situation, you save your time, money and vitriol and just leave.  It's a big, big City.", 
    "review_date": "2007-11-11"
  }, 
  "JJIJImbqqXXH6sk93yH7hw": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Roni L.", 
    "review_text": "I liked it here.  Wasn't too busy when we were there, okay selection of beers for okay prices. It has a darn good wine list for a dive bar.", 
    "review_date": "2009-04-11"
  }, 
  "aEKUC4oQg2CokbwyW_CXSg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah R.", 
    "review_text": "I like this place. Hipster feel, great tunes, good vibe. If they had liquor I'd come more often, but good spot for a glass of wine or a brewski!", 
    "review_date": "2006-09-01"
  }, 
  "OqlcSakW1xxCBONdE9Mwlg": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Justine K.", 
    "review_text": "good selection of beer, but can anyone tell me why the music is ALWAYS so loud?", 
    "review_date": "2007-06-19"
  }, 
  "GSA18YuTR5Eb84Asb_wK1w": {
    "user_rating": 4.0, 
    "user_location": "Trenton, NJ", 
    "user_name": "Emily D.", 
    "review_text": "I came here with a large group of friends.  At first, I thought the place was small, because there seemed to be a lot of people crowded around the front. However, once I moved through the crowd, there was a back room with a pool table and many couches. Good for groups of people.  This bar has a great selection of beers and wines and a friendly bartender who joked with us about moving the furniture around. Would definitely recommend.", 
    "review_date": "2013-07-08"
  }, 
  "9hu2xk15wtF6Lh1H4xGBdw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg D.", 
    "review_text": "Eff this bar.  On Thursday 05/15/08, I opened a tab at this bar.  The tab was opened to purchase 2 beers. Upon leaving the bar, I forgot to close my tab. I called the next day and asked if I could wait to close it for a few days, to which they agreed.  On Monday 05/19/08, I came to the bar to close my tab. They told me their card reader was down, so I paid cash for the bill, including a hefty tip since they had obliged me in letting me close the tab 4 days late.  Today I look at my bank account and see that they decided to run my tab WHICH I ALREADY PAID IN CASH. They also decided to tip themselves a generous 8 DOLLARS!!!! which seems a wee bit high for a tab that was $9.50.  So, I've basically paid 33 dollars for two beers at this POS dive.  Eff 'em.  Greedy bitches!!!!!!!", 
    "review_date": "2008-05-22"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "When I'm looking for professional drunks, this is where I go. It's not that bad, really, but I think some of the people who hang out here like to at least pose as such.", 
    "review_date": "2005-01-06"
  }, 
  "G8iMlPG06HfxoXXSpX3vYw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steph-a-saurus, Grr. J.", 
    "review_text": "Aw man. I remember the good old days when I lived at Eddy and Laguna, gun shots popping off daily, living with the female version of The Dude with an unfortunate and uncontrollable rage disorder...   It was such a quick stroll down to Hayes St to grab one of many yummy on tap beers here. It was always the favorite go-to spot on the way home if I wasn't quite trashed enough and needed a few more beers to finish off the night.  But of course, some lurker had to creep into the picture and crap all over my sweet spot.   The place has just the right mix of toothless daytime drunks and hipster kids chaffing their balls with their tight tight pants so you always have tomething fun to look at, and laid back neighborhood types to offer some palatable happy hour company. But unfortunately  it turned into dank and musty cavern harboring would-be date rapists and leg humpers.  Ugh. Tell me why a girl cannot go into a dive bar in the middle of the afternoon by herself without being chatted up by the most desperate and socially awkward guy in the place.   I mean admittedly one night I was that girl with a long trail of toilet paper flying freely off my shoe after breaking the seal in the unisex pisshole placed unfortunately in pool cue range, and maybe I did take a quick second to nibble at a hang nail that was bothering me all day, but that does not give your pit-stained and greasy self permission to get all up in my personal space, make a drunken yet failed attempt at eye contact, and try to whisper in my ear that you really like nail biters. Especially when I happen to be on a date at the time. Gross.  And tell me why said awkarkd guy has to be there each and every time I went back in hoping to make equally intrusive and unenjoyable conversation with me regardless of whether or not I was there with someone else. FOR THE NEXT TWO MONTHS.  Ew. And that was just the worst of them. For some reason Place Pigalle attracted more than their fair share of creepers. And these creepers just can't get enough of me when I'm two beers deep and grinning uncontrollably with that post-work warm belly fulla beer feeling.   No I'm not flirting with you, I'm trying to get drunk... Lay off chester.  So until that dude finds a new place to socially infect I'm staying away.   But I'll miss you Place Pigalle, you and your yummy beer, furry dogs, and pleasant service. I'll always keep a little piece of you with me.", 
    "review_date": "2009-02-10"
  }, 
  "prXdLYDt5ZFE4pG03Z9N0A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes F.", 
    "review_text": "The bartenders were friendly, service was fast, they have a pool table and a good selection of cheap to good beer. The only downside was that some clown bumped into me and then acted like it was my fault, but I didn't let that ruin an otherwise pleasant experience.  They allow dogs too, which is pretty cool I guess.", 
    "review_date": "2008-02-09"
  }, 
  "Vgh-CjwAl4tFleP39OdzaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "linda t.", 
    "review_text": "$9 pitchers? Word. Pool table &amp; Foodball table? Yes! Large bar, a lot of seating &amp; chill vibe. In a great location (need food? Paxti's is across the street). It's all you really need in a bar. Will return fo sho.", 
    "review_date": "2009-06-24"
  }, 
  "29X3khrCfdHbFz0JNdY6-g": {
    "user_rating": 4.0, 
    "user_location": "Melbourne, Australia", 
    "user_name": "Lulu W.", 
    "review_text": "Place Pigalle is my go-to local watering hole and I spend an embarrassing amount of time here.  it has my full endorsement as a neighborhood bar, nasty-ass bathroom (it's a hover situation, ladies) notwithstanding.    during the week the scene is local and low-key; come here on the weekend, and you're spinning the roulette.  bartenders are friendly, the selection of beer and wine (only) is excellent (Leffe on tap!) and the happy hour is great (the $3 house wine isn't some crappy Cabernet-Merlot blend but whatever they have open and need to get rid of -- make sure you ask).    there's a ton of space, too, all rec-room style with assorted tables and couches, so it's great for those nights when you've been hiving for weeks and want to invite everyone you know out (and they might all actually show up, possibly with everyone they know.)  oh, and s'il vous plait, people, it's not \"plAYs\" but \"plAHs.\"  you know, like the red light district in Paris.  yep, THAT Pigalle (\"PEE-gall,\" even.)", 
    "review_date": "2009-07-09"
  }, 
  "epIp3mfCqrtGGsKAcbsdBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anny P.", 
    "review_text": "Probably my initial go-to bar in the area. Great selection of pints...and the service can be quirky in the positive sense ;-)", 
    "review_date": "2012-01-15"
  }, 
  "H4k1YJ6Aqpv9yfk9EQlorw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Krystal F.", 
    "review_text": "Place Pigalle was my jam when I used to live in the neighborhood!  I was lucky enough to stop in for a trip down memory lane when I was last visiting San Francisco.    I'm not sure what else one could ask for in a San Francisco dive bar.  This place has lots of seating.  Tons of beers on tap and even hard cider for those of us who don't care for beer.   They have a pool table as well as a nice couch area in the front right near the windows. Perfect for some Hayes Valley people watching!", 
    "review_date": "2014-09-11"
  }, 
  "7nUIDRxi7o50agPP3Wo1FA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "James M.", 
    "review_text": "Thank goodness for old places like Place Pigalle in Hayes Valley.  \n  The neighborhood sure has changed in the past ten years, and it's all good really.  It's still nice to see the old haunts remain open and rough around the edges. \n  Place Pigalle is dirty in an indie-brit-boy-rocker type of way. . .you know, it works and is sort of attractive even though they could stand a good wash!  \n  Pool table in the back, art on the walls, smoking okay (but doesn't get too smoky) if that's your thing.  A good place for a drink and conversation.  This is a very laid back place and I like it.  \n  Beer and wine only.", 
    "review_date": "2006-09-18"
  }, 
  "ca0N3Fl3FckAWyupp6sDgQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art D.", 
    "review_text": "This bar has a cool feel and an interesting crowd, but the fact that patrons are allowed to smoke definitely takes its toll on you after some time (brought back memories of the late 80s when I used to go to clubs and bars before the anti-smoking law was passed).  The drinks were a bit pricey, and it's too bad that they only serve beer and wine (although they have a pretty good selection of beer).  The smoke is what keeps this review at two stars. If the bar were smoke-free I'd be dropping 3-4 stars on this place. Of course, if you like to smoke this place would definitely work for you!", 
    "review_date": "2006-04-10"
  }, 
  "KCaOZUnCx25FJhFr_lKsEg": {
    "user_rating": 4.0, 
    "user_location": "Mill Creek, WA", 
    "user_name": "Heidi M.", 
    "review_text": "Okay place. I'm a fan of Allagash White on tap, and the comfy couches in the back.", 
    "review_date": "2012-02-23"
  }, 
  "3KqBf9avm_5e9wwodmudvQ": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Nick L.", 
    "review_text": "This beer snob approves of the tap selection. They have quite a few beers on tap. Nothing too crazy but lately they have been dabbling in sours, saisons, and some obscure beers. Tasty coconut porter, Maui Brewing I believe, and the elusive Moose Drool, which isn't really elusive but not too many bars in the city have it on tap. Pool table, small bar area, couches and a nice open back area with couches in every corner. Not one bad thing to say about this hipster haven and it's a few blocks from my work! Hooray for beer!", 
    "review_date": "2014-05-28"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "I've been here twice, one time it was nearly empty. I like the music, back room and comfortable seating, the staff was nice to us and there was a dog lazing on the floor, probably my #1 barometer for a bar's awesomeness is if there are dogs allowed. Then we went back, it was crowded, everyone was smoking, girls were dancing on the bar (I think they work there too). So, it was too Coyote Ugly for me. Also, I'm pretty sure half this bar ends up next door to my house dancing to some crappy techno until 6am every other weekend.", 
    "review_date": "2006-02-21"
  }, 
  "gjZp61JZaqcLrKjEDVSPIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T-Bone L.", 
    "review_text": "Easily one of my favorite spots for a drink.  It's a good conversation place because you can actually hear.  It's dark in a good way.  They have artwork and couches for lounging.", 
    "review_date": "2005-04-09"
  }, 
  "H5zNEMUfGMRE6O51hHoirw": {
    "user_rating": 4.0, 
    "user_location": "Durham, NC", 
    "user_name": "Andy G.", 
    "review_text": "I love this place as a neighborhood bar.  Yes, it's a bit smoky, but being from Ohio, I'm used to that.  I love the pool/darts/foosball atmosphere, and I always meet interesting people here.  There are certainly some regulars, especially the happy hour crowd, but there are always some people there for the first time, too.  The pool table is not quite level, and the cues aren't straight, but the competition is only semi-serious, anyway.  It's a great place to just put your name on the chalkboard and then chat with everyone in line to play.  Time passes, beer flows, good times are had by all.  I've been here at least a dozen times, and never a bad experience.", 
    "review_date": "2006-08-05"
  }, 
  "MSkN2ieSx3uu6WH728KriA": {
    "user_rating": 3.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Nicole S.", 
    "review_text": "Great little dive bar in Hayes Valley. Foosball, pool and a great selection of beer. The bathroom (yes singular) is kinda funky, but is to be expected in this type of bar. Definitely recommend!", 
    "review_date": "2009-03-02"
  }, 
  "kS0_x2hYMot2MWE80TB0cA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah M.", 
    "review_text": "Casual, divey, and close to home. 3 things that are essential for a bar I want to hang out at. Place Pigalle is all of those things.   As you walk in, that yummy smell of beer overwhelms your nostrils, and your eyes get drawn to the free (YES FREE) pool table in the room just past the bar.   Wooden cafe tables and chairs line the walls in the front room, with some cozy group seating by the windows. Tables, upholstered ottomans, vintage chests and couches fill the back room -- reminiscent of your friends basement in high school. PLUS they play the best tunes in town. I don't know how they do it, but their shuffle on that old school jukebox of theirs is ON POINT.   If you're looking for somewhere comfortable, affordable, and easy -- do yourself a favor, and go here.", 
    "review_date": "2014-06-25"
  }, 
  "KUtiiZtdY9ofO4ejDKWK6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne Marie M.", 
    "review_text": "They held on to my phone &amp; had a good chuckle when I had to ask behind which bar my phone was being held.  Mighty human!", 
    "review_date": "2009-05-26"
  }, 
  "oAz4s21FA2QjE0kCNIDxOg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianne K.", 
    "review_text": "Not sure if I'm quite \"hip\" enough for Place Pigalle, but I do appreciate the foosball and pool tables. Makes it a nice, chill place to hang out. I think I'd be a little more into it if they had more than beer and wine, but hey, I can make a little vino into quite a night out!", 
    "review_date": "2008-01-14"
  }, 
  "2uM3O9Qy4vxvITAfke7_4g": {
    "user_rating": 4.0, 
    "user_location": "Utrecht, The Netherlands", 
    "user_name": "Helen D.", 
    "review_text": "A good dive-bar with a nice selection of beer and a Fussball table!  Nice loungey-area, good for groups. Spacious, yet not too big.   All of these things combined are just a guarantee for a fun night.  I love Hayes Valley, so many fun bars to choose from on any given night.", 
    "review_date": "2012-09-25"
  }, 
  "dJAoG82CBmiKc3Nb2YfQdw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex C.", 
    "review_text": "The lack of hard liquor is a bummer ... it's almost made up by the fact you can order pitchers and smoke. At least you used to be able to, you can't smoke there any more (for now)  Damn ... well, at least it's cozy and gritty at the same time.", 
    "review_date": "2006-12-10"
  }, 
  "XMb6fW9oGXTXl1b15wGoBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle D.", 
    "review_text": "This place is great in my book. Beer and wine only, but they have a cool laid back vibe, and there were cute dogs running around. love it. the bartender is super nice, and drinks are cheap for the most part. Cool spot to hang out.", 
    "review_date": "2009-04-10"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "Nice tap selection at this oddly named bar. Couches and pool!", 
    "review_date": "2013-07-14"
  }, 
  "GMiMXVIv9y5gpF95WCBZEQ": {
    "user_rating": 3.0, 
    "user_location": "Piedmont, CA", 
    "user_name": "Douggers M.", 
    "review_text": "It's smells funny and it's loud! There is also a resident crazy who apparently hangs out there.   Seriously,  how did I get stuck talking to the CRAZY? She claimed to be a ex hooker, actress, healer, producer, band manager................. She also liked to drink a lot and take off her clothes. Oh, yeah she did! Definitely ruined it for me.  **************Update ****************** One more star for a fab birthday for Lisel and free jello shots! ****But, the bathroom is one Hot, Stinky MESS!", 
    "review_date": "2007-09-17"
  }, 
  "4rscUhRnHPie0Uv3VEcoOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith R.", 
    "review_text": "Super cozy, great tunes, drink specials, beer/wine to everyone's liking, dogs chillin', people chillin', happy bartenders, happy patrons, great area, all sorts of people walkin' in/out - diverse in age/culture and drum roll, please...  One of the most memorable bar bathrooms in San Francisco.", 
    "review_date": "2008-11-20"
  }, 
  "J5rxPAMYjlpuKoCcC_z47Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary C.", 
    "review_text": "Stopped by during a one hour wait for dinner at the nearby Suppenkuche.  It wasn't ultra crowded for a Friday night at 7, and there was plenty of seating for our party of 10. Interesting art work, Lots of comfy couches, and a good selection of beers. Nice people working there, and there's a pool table too!  I'm a little surprised that this is classified as a dive bar too! It looks way too nice!", 
    "review_date": "2012-07-23"
  }, 
  "B7wbZOogh9FbxLv-hK2I4A": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Scott H.", 
    "review_text": "I love dive bars, but this one rubbed me the wrong way.  I felt it had bad energy and a weird vibe to it.  Despite it being a Fri night there was only one person seeming to be working.  Took forever to get drinks.  The front area is semi-comfy.  The back area has a weird divey-yet-sterile feel to it.  Old grungy couches which are nice, but uncomfortable little stools.  And while I usually love light, the skylight makes the grunginess look strangely sterile or austere. The place made me anxious and I will never be back.", 
    "review_date": "2013-03-23"
  }, 
  "NDdAkv3Ygc30PcPw7zg5kQ": {
    "user_rating": 4.0, 
    "user_location": "Bordeaux, France", 
    "user_name": "Shari Z.", 
    "review_text": "Minus the star for having only one bathroom. Miss Bartender was a. great to look at and b. totally sweet.  Mr. Bartender who took the next shift (no, I was not there all day, simply happened to be there at the time of the shift change. no really!)  ...Mr. Bartender was rockin his ipod over the bar speakers and made my night with new rockin tunes for my out of touch ears.  It's been a long while, Place P, but you did right by me this weekend.  The perfect combination of rockin out, having a conversation I can hear, drinking 'a couple' of glasses of wine, and if I got the notion, I could have shown you how much of a badass I am at pool.", 
    "review_date": "2008-03-09"
  }, 
  "Z2PISdtGHThSUUbFccGkrA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Scott G.", 
    "review_text": "An unbeatable happy hour in a relaxing and spacious bar with sofas, couches, tables, billiards, and more.  Let me start with their happy hour - it goes on from 4pm - 7pm and draft beers are $3.  Racer 5 IPA is your best bet here if you enjoy a good beer.  \"P.P\" would be my \"go-to\" bar if I lived in the area, no doubt.  I really like the non-pretentious crowd, too.  I have yet to experience the place during the wee hours of the night, but I'm certainly a fan.  Let the romance begin!", 
    "review_date": "2008-06-27"
  }, 
  "ksRHD3gWsQGuK_r9GT-xKQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laima K.", 
    "review_text": "A cool dive bar. Good selection of beers on tap, lots of seating. Good if you have lots of friends, also the free pool table is pretty cool. However its pretty loud if you try to hold a conversation. Prices are good.   If i was in the neighborhood again i guess i'd come back but i wouldn't go out of my way. In general, the place is ok.", 
    "review_date": "2014-06-10"
  }, 
  "iI5hC_uNUBGkkvtWrBIaZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joey S.", 
    "review_text": "I kind of want to give this place a bad review so that I can have it all to myself.  But, I have to be honest and say this may be my new unknown happy hour spot.    This is a fun \"dive bar\" with a very fun happy hour (this may actually be on the edge of the dive bar category since due to the nicer area and Hayes Valley crowd).  It is very spacious and you can sit down in privacy with all of your friends.  The happy hour is M-F 4-7pm with $3-$3.50 pints and $3 wine... and of course the PBR pints are $2 (but they are normally cheap @ $2.75).  All the pints here are very \"fresh\" as the kegs are not old or stale.  They have a great selection of beers and you can sip on it while hustling people in foosball and pool.", 
    "review_date": "2009-03-25"
  }, 
  "E_9WOCYIGHtT2nbcY4_t4w": {
    "user_rating": 3.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Vanessa H.", 
    "review_text": "Good casual spot for beer or wine.  Foosball and pool, plenty of couches. However, one star off for no hard liquor and only one single stall bathroom, for men and women -- there's always a line.  Dogs running around -- nice!  Not so nice: Drunks dropping a full glass of beer on the ground, staring as it spilled, then continuing to play foosball.", 
    "review_date": "2007-01-06"
  }, 
  "MF6Cpfd-NexbRNyaIo_DVw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex W.", 
    "review_text": "trully....what makes the place for me....is the convinience since the neighborhood has so many sheeshy yuppie bars....this bar is the only relaxed one.....and the service.....Daniel the bartender is great....He's always very nice....and no....not nice cause he just wants you to buy rounds like many bars in the city, doesn't throw attitude...he's just nice....he can actually have a cool descent conversation with you.....Well....what else can you say about the bar....? I ONLY GO there ON WKDAYS...", 
    "review_date": "2009-01-29"
  }, 
  "RyWKKwLzLSWi_8bZd1QWYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh M.", 
    "review_text": "Although when I first went to Place Pigalle, I was haten on it right off the bat - because of smoke.  I still can get frustrated with the amount of smoke, but I still for some reason still make my way back.     One thing that helps is that they keep their foosball table in great shape - nothing like having fun playing a bit of foose.  They even have tournaments every other Wednesdays.    One other thing I really like about this bar is the consistant quality of the music being played.  There usually is a variety of reggae, soul, hip-hop, ect - and always something I enjoy nodding my head.    They only have beer, wine, soju - and the prices are a bit more than other bars, but hey - it's Hayes Valley, what do you expect?  Wish I could give it 3.5 stars based on the prices and smoke, but still think it deserves better than 3 stars.", 
    "review_date": "2006-10-18"
  }, 
  "38zhUVIh6t_-mpcmbWYmiw": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Andrew L.", 
    "review_text": "Good place to come to if you want to feel like you're in Europe. The dark atmosphere, smokey room and candles give the place a great spooky feel. Drinks aren't anything special here, but it's a nice place to start off.", 
    "review_date": "2006-05-17"
  }, 
  "FlwHQJ_xfEE2yut2g1RX4Q": {
    "user_rating": 5.0, 
    "user_location": "Embarcadero, San Francisco, CA", 
    "user_name": "Ian K.", 
    "review_text": "Hands down, one of my favorite little bars in SF and its only beer and wine! Great selection and awesome bar keeps.. friendly local family vibe. Cheers!", 
    "review_date": "2014-03-19"
  }, 
  "fS9vRXSmi6IW8ULnUMgrFw": {
    "user_rating": 5.0, 
    "user_location": "Chula Vista, CA", 
    "user_name": "Berenice D.", 
    "review_text": "This place is definitely my favorite bar in Hayes Valley. I got to know the bartenders ( daniel- my favorite) and you will have an amazing time. They have couches, pool table and it is just a nice place to kick back at. Not at all fancy. You can just walk in and start drinking. And if I remember tuesdays are- Jello Shots. Unfortunately you can not smoke indoors no more, you have to walk out. Although, the bar is great. Good music, good people, good atmosphere.", 
    "review_date": "2007-12-29"
  }, 
  "_HVQorAvXWMwJ0cxwDp7Zg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna H.", 
    "review_text": "My neighborhood dive bar! Beer and wine only, so makes for a more mellow drinking night than cheapass vodka cranberries at my other fav bar in the Haight. But, they have many extremely comfy couches scattered throughout. I was there on Halloween night at 11pm, and it was full, but not packed. Just the way I like it!  Music can run the gamut depending on who's bartending. I've heard neo-soul/R&amp;B and hard rock on different days of the week. Keeps you on your toes though.", 
    "review_date": "2009-11-02"
  }, 
  "4W1D-dUW7bC_CJYgslzUqA": {
    "user_rating": 3.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Guillermo K.", 
    "review_text": "It's fine, I guess. Sufficiently chill, decent place to burn a little time enjoyably. Majority of clientele got hit with the ugly stick. Hard.", 
    "review_date": "2011-11-27"
  }, 
  "OZKtRnaNCIHuc44hgnzfNA": {
    "user_rating": 2.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Ben S.", 
    "review_text": "Has a lot of potential, but it's way too loud all the time. The crowd doesn't seem to appreciate or benefit from the music being so loud either. Even when there are only 3-5 couples in the entire bar, they're blasting music to a point where you have to scream to each other (while the sun is still out no less).  A tad too filthy for me to call my regular dive bar.", 
    "review_date": "2009-08-24"
  }, 
  "eXt9426w2kE65rUMhKb4Cg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Max M.", 
    "review_text": "Reasons I like Place: Smoke inside. Two pool Tables FOOSEBALL TABLE (although competition is tough) Big and roomy. Good price on drinks.  Reasons I DON'T like Place: One co-ed bathroom with a line around the corner.   Drafty and chilly at times. Fooseball challengers are TOO DAMN GOOD!", 
    "review_date": "2006-07-11"
  }, 
  "fsSqdAkSK2Zgx-Pcey1yOA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "rob w.", 
    "review_text": "when french people say \"pas mal\" (not bad) they mean that something kind of sucks but not enough to offend them so much as to actually say that it sucks. that's kind of my impression of this place. it's average enough to neither offend nor arouse. and a good bar should arouse. if you see me walking around in a bar with full-on pants-tentage, you know it's a worthy spot.   the bartender seemed to be into the music, which is kind of cool but meant that he was occasionally AWOL because he was messing with the music.   1 star for accepting a credit card. 1 star for not forcibly ejecting me when my \"date\" (dear god that was a mistake) knocked over an almost full glass of red wine, both breaking the glass and spilling all over the place, and loudly proclaimed \"i don't give a fuck\" repeatedly rather than say, apologizing, or attempting to clean it up.   this incident caused me to seriously consider j-date for the first time in my life.", 
    "review_date": "2007-03-05"
  }, 
  "TnqdV1STYPdj7BgBzECJ4A": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Heather S.", 
    "review_text": "My friends and I stumbled upon this spot, and immediately wanted to go in.  This is a Just Right bar.  Tidy and interesting, not expensive, good variety of beer, plenty of spots to sit, nice crowd of friendlies, and clean-enough bathroom (other reviews suggest this might have been mere luck).  If you find yourself needing something to take the edge off the week, stop in.", 
    "review_date": "2009-04-05"
  }, 
  "lOMM7HTHhabi1qofd-w7zw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle S.", 
    "review_text": "It took me years to really enjoy a good beer. I always liked my mixed drinks, and was a snob for a good martini, but a beer, that takes a palate in my opinion like wine. You have to weed out all of the piss water and really get to the good stuff. Leffe blonde, Chimay red label (or blue as well), Newcastle brown, and a good Hefe. Place Pigalle offers a variety on tap, minus the Newcastle, but tonight they were out of my three top picks, which left me with nothing too exciting to choose from. This didn't help me, for the fact that I was going to be enjoying my marginal fourth choice beer on a couch with a rip in the middle, where I couldn't even seen my feet it was so dark. I was lost in a midst of hipsters in hoodies, dirty cons and bad thick rimmed glasses. Instead of being trapped in a Gap ad, I felt like I was standing next to one of the most recent covers of Adbusters, where a hipster, classically dressed in the garb described above graced the cover. Offering their recycled clothing options as fresh and new instead of the regurgitated used clothing fronting as \"underground\" that it really is. Nothing beats American Apparel, Parliaments, and PBR, right guys!!!!  Don't get me wrong now, I do like myself a good dirty dive bar here and there. My bartender was great, and my bro I was kickin' it with made me laugh my ass of, of course, otherwise I wouldn't have two stars up in those boxes above. For a local night, pool and a few beers wouldn't be too bad, but the back space where it's located along with some foose ball isn't really personal at all. It's almost like the back of my high school gym where we hung at theatre class in between production set changes.   The major bonus of the evening was when I got hungry at an unmentionable hour, I was able to walk right out the door and go down the street to Absinthe, where Brad, my wonderfully helpful manager, was there smiling to greet me, and feed my sorry ass. All dressed up and no where to go.", 
    "review_date": "2008-10-19"
  }, 
  "ZrsryCGYEQfkhLyXXsP_EA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Revvv G.", 
    "review_text": "I have lived nearby and loved it for oh sooo long. (Too long perhaps?)  The owner has LET IT GO.  I was shocked when the health inspector came in and let sooo much slip by.  The bathroom is constantly foul and filthy.  More often than not these days they are out of most of their beers and wines.  (Empty or covered taps are the saddest sight a person can see.)   The only plus: the bartenders are all pretty good: friendly, making the best of a crappy situation.", 
    "review_date": "2009-05-24"
  }, 
  "KM5eYS2_77ECMfoncjIB4g": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Amanda C.", 
    "review_text": "Great atmosphere, free pool table?! Kind and helpful people. Tristan really helped me feel welcomed and helped me find the right drink for me. It made a big difference in my day and my over all experience. Thanx Trisran!", 
    "review_date": "2014-12-27"
  }, 
  "tGkfSO_bRpXsSI1JYv1wQQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy T.", 
    "review_text": "Okay, let's pretend that the REAL way to rate a bar is based on two merits: the strength-price ratio of the drinks and how cute the patrons are.  Since Place Pigalle doesn't serve hard alcohol (liquor) here, the strength factor is out.  They do, however, have a pretty excellent selection of beer priced happily in a way I do not understand.  I used to be a picky beer drinker, but after making myself broke, I have begun to drink PBRs exclusively.  So $9 pitcher of PBR?  Good in my book for a cheap date.  How cute the patrons are?  Let's start with the bartenders.  Little blonde Lindsay is the CUTEST thing in the world.  Also a great dancer.  The Friday and Saturday night crowds bring in a good mix of yuppie/hipster, but mostly coupled up cuties.  Not sure what's going on with that.  Maybe it's the neighborhood.  The regulars are not attractive (myself included), so don't bother any other night of the week.  Still, Place Pigalle is awesome because it's my neighborhood \"dive\" and everyone there is my friend [after a few drinks]!", 
    "review_date": "2007-12-10"
  }, 
  "MWVvKb3-u-AWlXobkb4i-g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ash A.", 
    "review_text": "If I'm hanging out at Place Pigalle, it's because someone dragged me here. The only charm this place ever held for me was that for a while it was an unofficial smoking refuge, but now that the flame's been put out, there's no reason I'd ever choose to go here on my own.  Meh. Now if I can only convince my friends that this place is as lame as I think it is...", 
    "review_date": "2007-05-15"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "I feel like every time I come here I am in some dilapidated (sp?) house.  The floors are fucked up, the chairs are always strewn about the room and there is a motley assortment of people hanging out.  You would think that for a guy like me that would be great right?  I mean, I can smoke here too. Fuck!  The problem is that this is a little too much of a locals place.  You don't get service unless you are here EVERYDAY.  I mean, I know, those people keep the lights on but do the bar keeps really need to stand there and talk to their buddies for 10 minutes while I stand 6 feet away waiting for a beer?  Really?  Also, every time I come here at least 50% of the taps don't work or are out.  For a beer and wine spot this is just ridiculous.", 
    "review_date": "2006-07-31"
  }, 
  "ym91NK9QMPDU2g00zEuLIg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nora S.", 
    "review_text": "Cool place right in the heart of Hayes Valley.  Came here with a large group for an after work happy hour and space was most certainly not an issue.  Would return!", 
    "review_date": "2012-03-22"
  }, 
  "ZM3Y7pPuKu67Q_FOLqGx7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lou Z.", 
    "review_text": "I'm so glad I live just a stone's throw from this joint. My only gruff with he spot is not hard booze. BUT, that's a good thing also for nights when I say \" Let's go get a beer\" and that's all that happens. Otherwise, a beer would turn in to a beer then a mass of Jamies and soda. Then comes the stumbles and the yelling and the thrown of whatever is not too heavy to lift or bolted to the ground. Good times!", 
    "review_date": "2008-11-18"
  }, 
  "3X8nPqq5b-VItOiWdn73jw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike C.", 
    "review_text": "Like your favorite pair of boxers or that tshirt you've worn so much it has holes.  One of my favorite places to frequent for a few pints, if not my favorite when the time is right. The people, the beer and tornado tables - keeping the fun alive.", 
    "review_date": "2007-05-04"
  }, 
  "6tgKc3hK1qi1l3SFE1DTug": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindy P.", 
    "review_text": "$3 jello shots on Saturday nights...  I think it was the jello shot that put me over the top this weekend. So tasty. So evil. Sunday morning was painful.  It was a friend's birthday that night and we were having a girl's night out. After dinner nearby, we headed to Jade--too crowded. We headed to Sugar--too crowded. Dammit. We just want to drink!  One of the girls used to live in the neighborhood so she took us to Place Pigalle. It was pretty dead for a Saturday night. Then again, it's probably hard to fill such a big bar. It was perfect for us though since we took up almost half the bar. We stayed for a few rounds before heading out to Rickshaw Stop. I never knew about this place but it's nice to know there is a bar where you can easily get a drink and within walking distance to so many other places. I'd come back but I don't see it becoming a regular place for me.", 
    "review_date": "2007-01-22"
  }, 
  "5_gbaJzM9w_oAvLf7ARBWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick T.", 
    "review_text": "The bar substitute for your best friend's basement, replete with second hand couches and free pool table. The only exception is the beer is colder and costs you moneys.   BEER:  Good, nice selection on taps, and $2 Tecate's during happy hour.   ENVIRONMENT:  As stated above, super chill. The best thing is probably the  pool table, which is free. Watch out for sharks though, there are regulars who come through exclusively to whoop on young whipper snappers.  Lots of room in the back, nice during the day,they have a frosted skylight which brings in a lot of light to the area.", 
    "review_date": "2014-05-22"
  }, 
  "IBrL-6twlZmQBGLdV2DQiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie C.", 
    "review_text": "cool divey bar. good beer, decent wines by the glass, good people-watching.", 
    "review_date": "2006-02-19"
  }, 
  "1adKO0SWcnUGi54jBTSc0w": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Mustafa S.", 
    "review_text": "It is what it is. Nothing too special. Solid selection of beers. A place you start your night at.", 
    "review_date": "2013-01-14"
  }, 
  "5pBi1CSpm9467jh7PSBDkA": {
    "user_rating": 3.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Mary R.", 
    "review_text": "First impression, bartender was sorta a weenie.  He didn't seem very polite and had a \"I'm too cool to even work here\" attitude.  We got some sake which was nice.  It's my good friends local bar so I'll end up here again I'm sure.  Just didn't seem like much was going on.  Tad boring.", 
    "review_date": "2006-10-17"
  }, 
  "zF_unBFpdWMY6el-B7wO8A": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jessica H.", 
    "review_text": "I agree with other reviews, this is a chill neighborhood bar with comfy seating. To me it's always been my go-to location for meet ups with friends before dining. However, I've experienced several nights here talking late into the night with friends. It provides a nice atmosphere with often times interesting artwork, a cool pool table and nice bartenders.", 
    "review_date": "2013-08-04"
  }, 
  "rDTr5r0xEMpQpkPphe66KQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick A.", 
    "review_text": "Went here last night.  Big mistake.  They play their bullshit electronica so goddamn loud it gives you a headache; forget about having a conversation.  We, being everyone at the bar, ask the guy tending bar to turn it down.    This DoucheTard goes the cdplayer, and turns the knob .5 degrees counterclockwise!  We keep asking and he pretends that it's a huge inconvenience.  Half a degree at a time.  Well done fuckers.    (I couldn't wait to write this)", 
    "review_date": "2007-10-07"
  }, 
  "eu19K9KfnvvubzWuv4l6Wg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lauren F.", 
    "review_text": "One star...you can smoke inside (i dont love this always, but every once in a while its cool)  two stars... its a great place to have a birthday party.  Ive been to a few, and with the comfy couches it makes for a great social time.  three stars...no one ever gets way too sloppy cuz of shots of booze, cuz its just beer, wine and soju  four stars...pool table.  always a plus  could have a fifth star if it had more than one bathroom", 
    "review_date": "2006-12-13"
  }, 
  "rNbX2MdVf07a37YKNezAcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy S.", 
    "review_text": "I love this bar, and it has more to do with close proximity to my apt. Free foosball and a pool table, what else could you want from a local dive bar? Decent prices, friendly bar staff, great ambiance.", 
    "review_date": "2012-06-21"
  }, 
  "LahgT0Dec0B6NSws7VHiJQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matt m.", 
    "review_text": "Racer 5 IPA?             Check. Foosball Table?             Check. Free Wireless Internet?            Check!  Really...what more could a man ask for? Ok...well maybe some tacos or a cheesesteak...but  Place Pigalle was still pretty awesome.  Decent music, down to earth people &amp; comfy furniture make this spot top notch. If I lived in the neighborhood, this place would definitely be a haunt of mine.", 
    "review_date": "2007-12-09"
  }, 
  "2bHSZhM0huV8LRh3YHaOSQ": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Three and a half stars, but only because I was only here for one drink. I was killing time before dinner, and since all the effing shops in HV close at SEVEN, I needed some way to kill that time.  A drink sounded ideal, so I parked myself at an empty barstool at Place Pigalle. Of course, being a solo drinker, I immediately attracted the attention of Lonely, Alone At The Bar Guy.  We chatted a bit about things far too intimate to have shared with someone you've known for seven minutes, I drank my $7.50 Chimay, and I left. The music was awesome, the bartender was sweet and I really liked the space.  It looks smallish up front, but there is a large back room with pool tables and foosball and stuff. I saw folks have food delivered too, which is always a plus if the place doesn't have a kitchen.   As for the smoking, I don't know if something has changed, but all the hipsters I spotted were smoking out front, and not inside. I'd definitely come back and give it another shot for more than one spendy beer.", 
    "review_date": "2007-08-21"
  }, 
  "oyalAv5PbFc4czFuxdEspg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A S.", 
    "review_text": "i agree with ash a. it should be good.. they have wide selection of beer/wine, pool, comfy sofas, and i like it when the bartender brings his dog. but i dunno man, it has no SOUL.  every single time i go there i wonder why i keep making the same mistake. i've never made it past one beer.", 
    "review_date": "2007-05-18"
  }, 
  "tSKGejZuR8E7OGLckX4-8Q": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "E W.", 
    "review_text": "It's NOT 'divey' - OK? Really, it's not.   It IS sort if like partying circa 6th grade getting drunk in your friend's parents house. Setting: the basement rec room, dirty poofy couches everywhere outnumber the kids, games, and no hard stuff just beer and wine. You are learning to drink. Boys on one side girls on the other. Occasional overhead lighting.  Pluses are big space and mostly dark. Chill on weeknights and sometimes good music. Oh, it's relatively intimate as well. So plus 3.     Sometimes they don't have orange slices for blue moon, or play crappy music....  Minus 3 stars for no liquor and \"divey\" reputation (faux faux faux. don't believe. do not)", 
    "review_date": "2010-11-09"
  }, 
  "582iTyqKkoHeBFPMJuQEJw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris D.", 
    "review_text": "I really don't know what I was thinking when i gave it four stars.  It is as if the bar was made for me...well at at least the part of me that wants just a chill bar with no frills, with good music, beer, and opportunity to talk with the people you're with.  They have a great beer selection.  Leffes and Chimays were the orders of my last night...  It is as if I brought in my own playlist every time I'm there...seriously who makes these playlists?  I'm starting to think I may be blacking out and doing their music and then come home because it is so on point.  Any bar who puts out the Pharcyde, Quannum, Tribe, and Poets of Rhythm in an hour span has earned my money...  Foosball and a decent pool table.  Fucking foosball.  Pitchers.  Couches..couches...and more couches.  Thus allowing one to get uber comfortable as if the two of you were were just getting as trashed in your own living room...cue in occasional inappropriate PDA.   Seriously 5 stars.  Actually a head above 500 Club and The Page for my favorite bar...thank goodness it is within stumbling distance...just barely!", 
    "review_date": "2009-07-12"
  }, 
  "bAMtsU124oLgeAgi3gMNig": {
    "user_rating": 3.0, 
    "user_location": "Cincinnati, OH", 
    "user_name": "George M.", 
    "review_text": "I live so close to Place Pigalle that I can fall through the door and into bed.   The beer selection is good. Playing pool at place pigalle is the best because there's a wide range of players from suckers to league hustlers.  The people who come here are mixed. The regulars are nice, the hayes valley shopping squad can get annoying. They are almost always there and typically have gone out of their way to drive to my neighborhood to spend money. I guess I should be grateful; Better than crackheads.   The music is almost always too loud but the bartenders are so nice I never tell them.", 
    "review_date": "2007-12-06"
  }, 
  "VEOD6Y-w1UoRnxzJZjTI1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M S.", 
    "review_text": "Beer &amp; wine only.  No spirits or mixed drinks. They have a nice pear ale for gluten free folks, nice and tangy and sweet.  Pool table and couch in the back.    A bit funky but a nice place to hang out with a group.", 
    "review_date": "2014-06-14"
  }, 
  "hdQddcET45ejf7UMYQr2cg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett B.", 
    "review_text": "They have cheap PBR, and uh, that's about their only saving grace.  I hate to give places bad reviews, but man, yuppie-city and only soju cocktails/no hard liquor? There's no excuse in this day and age to be serving soju in an alleged \"bar\" in the city.  Sorry folks, just not my cup o' tea.", 
    "review_date": "2007-01-20"
  }, 
  "p-rz5nElTuSyUV1Dzui6Yg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marz W.", 
    "review_text": "Not knowing where I was setting out to meet my friends, I found the place and discovered I've been here once before and liked it.   Its a good dark place to meet. Its a great place if you smoke because you can smoke inside. I suspect though that if it got really crowded with smokers I wouldn't be so blase about it.  The happy hour drinks are a good deal and the bartender was a nice guy. I also found some of the patrons there to be really nice people.  You can play pool in the back where its better lit.   I plan to drink there again.", 
    "review_date": "2006-07-30"
  }, 
  "36LgEtwt6ROhrCtuPjfRmQ": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Shayna N.", 
    "review_text": "This used to be my neighborhood bar (before I moved). It's a great place to chill with friends or meet the neighbors.  There's a pool table and lots of room to lounge on all the comfy, ratty couches. LOVE the couches... Last time I checked you could still smoke inside. There's no hard liquor only beer, wine and sake.  It's dark and can get noisy and busy the later it gets, but it's still comfortable.   You're usually guaranteed to run into someone you know.  It doesn't cater to a particular crowd, just folks from the 'hood.", 
    "review_date": "2007-01-12"
  }, 
  "kjpkYNKTOOcmvMDKkZsO1Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A. A.", 
    "review_text": "Nice vibe coming from this place. I came here randomly with a group of friends on a Sunday afternoon. The bartender is odd, the art work awesome, bathroom clean.  I'd come back if I were in the area.", 
    "review_date": "2012-05-13"
  }
}