{
  "33OzyvMjDhGTUJubr4CWIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine N.", 
    "review_text": "Finding a place to dine in SF can be a challenge on the weekend, but somehow managed to find this place for an early dinner reservation.   We arrived fashionably early for dinner and had plenty of space before the crowd started rolling in.   Starter: Wagyu Beef Tartare was excellent!   Main:   - Liberty Valley Duck = I had to ordered this because one can never get tired of duck meat.   - Chef's Special Pork = took a bite from my partner who ordered this, but I can't quite remembered if I liked it or not.   Dessert: Banana Cream Pie Sundae = the banana pudding was impeccable! This was probably my favorite dish throughout the night.  Overall, I enjoyed my dinner with great company. Service was on point and attentive.   p.s. The restroom seem like a mile walk away from the restaurant...why?", 
    "review_date": "2013-07-08"
  }, 
  "xwy_ojOciOXo1DQyE7Uyng": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Huy V.", 
    "review_text": "Prospect is a classy place. Most people are dressed pretty nicely. You see people celebrating birthdays and other special occasions because every once in awhile it's ok to eat somewhere really nice and spend all your money.    We ordered the scallops and quail as starters. I thought the scallops were cooked perfectly, seared just enough so it was still soft and succulent. Quail was breaded so it had a nice crispy crust. I generally don't like quail because it's lean and often dry but it was juicy and delicious here.   For entrees we went with the New York strip and the pork chop. The steak was cooked medium when my date wanted it medium rare and it was on the salty side.  The pork chop was perfect.  It was a thick cut and so even though the crust was a bit salty it was a balanced bite.   We also ordered a few drinks. One was a tea infused bourbon which I thought was delicious.  I also tried the brandy and apple cocktail which I thought was a bit sweet.  Service was great.  Food was great.  Ambience was great. It was a really nice evening. The portions were a bit small given the price. 4.5 stars.", 
    "review_date": "2014-12-22"
  }, 
  "-ZQknHztP6Kpf2DKtCF51w": {
    "user_rating": 4.0, 
    "user_location": "Malibu, CA", 
    "user_name": "Nava N.", 
    "review_text": "I came here for a dinner with a huge group of people. The service was excellent, the staff was very sweet, and the food was pretty amazing.  The whole staff made sure that we all enjoyed ourselves and even made special ordered dinners for some of our guests who were vegetarians.  Our party basically tried everything on the menu from starters to dessert and everything in between.   Overall, the ambiance, service, staff, and food were very good and worth another visit.", 
    "review_date": "2012-06-22"
  }, 
  "dZQ8Mc6f2E7X7lLldtn4Vw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mihae T.", 
    "review_text": "Great attentive staff ... nice selection of wine.  Crab soup was AMAZING.", 
    "review_date": "2014-04-09"
  }, 
  "p08F3g2_lSSdzyjnVcvt4w": {
    "user_rating": 3.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Byron L.", 
    "review_text": "$100 for 2 people including spirits.  The pisco here has a taste of beets.  The seared scallops were done right.  The wagyu was alright.  They have a nice high ceiling with big windows.  And the seats are sparsely set apart.", 
    "review_date": "2014-09-30"
  }, 
  "4LSF_BgZdsNTWr-nqHBeow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carlos S.", 
    "review_text": "Food is so-so, came for a business lunch. Thank you Johnson!", 
    "review_date": "2014-04-26"
  }, 
  "t9yOQFJfg08RoLAJqYdaNA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick M.", 
    "review_text": "Do yourself a favor and don't go. Service was horrible and the staff had no knowledge of the menu. The cocktails we ordered were under par and the food had no seasonings and bland. I would gladly pay more for a better experience.", 
    "review_date": "2014-04-02"
  }, 
  "N2afn9jS641QTZa56DoVcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Morgan C.", 
    "review_text": "Good food and nice atmosphere for lunch meetings (not too crowded), so you can talk easily.", 
    "review_date": "2014-02-05"
  }, 
  "atLR8iRGw_j0lb3fNC0ZQg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C. R.", 
    "review_text": "I'm shocked at the number of people that indicated they've received good service at Prospect. I visited last night for my birthday dinner and our waiter was borderline rude and ignored us for most of the meal. As soon as we indicated we wouldn't be ordering drinks, he figured we wouldn't be racking up a large bill and diverted his attention to his other tables. I don't often complain about service... but this was bad.   The food was actually delicious, but I won't go back to Prospect -- there are far too many high end restaurants in SF where you can get good food and service to match.", 
    "review_date": "2014-09-20"
  }, 
  "KiEjCfiiFOB7hEFEGWmOXg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bert C.", 
    "review_text": "I have been here at least 10 times. My go to restaurant when I have friends in town. Had a reservation for four, one couple couldn't make it. The hostess flipped attitude And tried to seat me at a small table. I stated I wanted the original table as we did not change reservation she argued with me.  Took me back up front then seated me in a slightly larger table right next yo the bar, very noisy. I will be complaining to the mSnager and I may cancel the three other reservations I have for this restaurAnt in March.  The food is great as always.", 
    "review_date": "2014-03-04"
  }, 
  "Nfw6KZys6dVXnB5oiuZPdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex D.", 
    "review_text": "Can't believe I haven't eaten here sooner.  Pros: Old Fashioned was made well, crab salad was clean and refreshing, black cod melted in my mouth.  Service was excellent as well.  Cons: Weird location and a little on the older, mature, clientele side...hotelish decor with no warmth but good food won't keep me away!", 
    "review_date": "2013-12-12"
  }, 
  "tXhscxwFTd-ayLTdPx_2yA": {
    "user_rating": 4.0, 
    "user_location": "Miami Beach, FL", 
    "user_name": "Jonah K.", 
    "review_text": "Came here after a hard day at work. There was a Giants game that night, hence the bar was jammed when we arrived. Really nice decor and a large expansive bar (even though it was jammed).  We promptly sat down and had some excellent service. The wine list is expansive and we opted for a mix of wines from Cali including a great Pinot and a decent Cab.   Food wise it was excellent. I read on chefsfeed that we should try the fries, which are only on the bar menu. The server said she could sub them in.  I started with a buffalo mozzarella ravioli appetizer with tomatoes and such on it. It was a special, but it was very well executed. Highly recommend it! The main I got a skirt steak, which normally can be a bit tough but it was perfectly cooked and really excellent. The fries were actually not all that, but I would still come back.  Good spot.", 
    "review_date": "2014-04-16"
  }, 
  "kp1SDNjwwBPFmdF1kadRmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sherry L.", 
    "review_text": "++ Food is awesome. The liberty duck is a must-have. It's basically duck three ways (thigh, neck, breast) and kumquat is a nice touch as it cuts the fattiness of the duck with its tartness. Strawberries n' cream dessert is yummy! Also, the green goddess salad is one of the best salads I've had in a long time! + Good cocktails. + Nice modern decor. - Saturday night is really empty, which could be good if you're looking for a quiet dinner. - Bartenders are sorta jerks... - Tables and ambiance not great for a first date.  Definitely coming back for the food (heard brunch is good), but not for the bar.", 
    "review_date": "2012-04-06"
  }, 
  "Mx6HfWgVl8th3MuGG3POaw": {
    "user_rating": 1.0, 
    "user_location": "Park City, UT", 
    "user_name": "James S.", 
    "review_text": "Fire the staff! This restaurant and bar has a decent atmosphere and we were attracted to the general vibe and proximity to where we were. But the staff was so rude and judgmental!!!  They had an awful attitude and did not correctly handle a situation. I would not recommend this place to anyone. And I would recommend the management firing the host for the terrible service. DO NOT GO TO THIS PLACE!!!", 
    "review_date": "2014-12-18"
  }, 
  "VHsSa5poLclVNcC0uZ9iEw": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Soniya V.", 
    "review_text": "Nice place for a nightcap! Haven't tried the food but given the price tag and hotel-like ambiance, the sister-restaurant boulevard is a better deal", 
    "review_date": "2014-10-13"
  }, 
  "3EB1rpwKqdSC-yGliLByHA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana T.", 
    "review_text": "Came here with my parents and the experience was awesome! We were treated incredibly well by the waiters, who were super duper nice and the food was some of the best I'd ever had in the city. We had a few appetizers, one of which was the quail - to die for!! and also the steak was perfectly cooked - they didn't ask how I wanted it done, and they didn't have to...because they definitely knew what they were doing, so I let that one slide ;) haha. The swordfish was also a winner. I'm not even going to get into the sides because they were all WOW! Yes, the food is a bit saltier than other places, but we happen to like it that way. It wasn't overly salty, just probably a bit more than what other places would serve. The desserts were beautiful and delicious, as well!", 
    "review_date": "2014-12-11"
  }, 
  "_6zCLeCIlG8N8xGJvGWKaA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Nick K.", 
    "review_text": "Phenomenal service. Very friendly staff. Amazing food. We had the Heirloom tomato salad, market stone fruit salad, cashew crusted sea scallops, Alaskan Halibut and King salmon, all were delicious. Presentation of the dishes were works of art. Highly recommended Prospect for a date night or to celebrate any occasion.", 
    "review_date": "2014-07-30"
  }, 
  "kDS9_oPT-K6XkgkCp7zc1g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Deborah D.", 
    "review_text": "Perfect date night spot! Good ambiance and excellent food and drinks!", 
    "review_date": "2014-09-16"
  }, 
  "fiXJuggGwAzNGrxp_jxnVQ": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Anthea S.", 
    "review_text": "We have loved this place having gone two or three times before and once hosting a dinner for 50/60 clients in their private dining room so when friends asked us to join them Saturday night we jumped on the chance.    Our experience was a disappointment and not what we're used to from this restaurant.  Cocktails were fabulous though our waitress forgot to put one order in so timing was off.  Two of us had the burrata salad appetizer which was amazing. The calamari was tiny portions and skimpy for what it was and left us wanting more.   I had a tough time finding a vegetarian plate that was appealing for a main and the risotto with truffle butter was amazing and the chef was kind enough to make me a side dish of brussel sprouts that were delicious.    Our friend had the chicken and sausage which was ample portioned and he loved it.  Two of us had the black bass and lobster special which was really over priced for the portion - 3oz of fish and a nugget of lobster about an inch or two long. My girlfriend is teeny tiny and isn't a huge eater and she was left feeling unsatisfied - as in still a bit hungry.  My husband felt same.  We had a great bottle of wine and split one dessert.    The bill game and it was way over what you'd expect for what we ordered and what we received.  In other words - value for price, way way off.  What made it worse was our server couldn't have been bothered.  She never came back to ask how we liked our dishes - not once, after any course, didn't make eye contact and was just off her game; perhaps we should have known once the cocktail order got forgotten.    We are foodies, eat out a lot, eat all over the world and have no problem paying amply for a great meal. It's not the dollars - it's when the dollars don't feel like they delivered what you paid for.  Service was a 1; meal was good but portions off - it felt like Prospect was more about hip vibe which is icing on the cake - the restaurant fundamentals need to be there and they were off last night. We won't write this place off and will go back but with all the options n SF we were bummed by the experience.  I agree w/ Jay C. that this place is way better than Boulevard whose menu got too complex and didn't deliver.  Nadeem says it best though when she says 'it's just sort of there.'", 
    "review_date": "2014-11-23"
  }, 
  "afWN1xuh28vTr4pN9n5UmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin C.", 
    "review_text": "Excellent service, tasty food but lunch portions are small.  I had the sole and it was cooked well but I walked away a little hungry.", 
    "review_date": "2015-01-12"
  }, 
  "RkfQX8dSJNzkAAItX326Og": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Celine L.", 
    "review_text": "The first night in SF, we tried eating at Hogs. However, because of parking issues, we gave up and on a whim decided to come here instead. We were super lucky to get a table for 5 as the restaurant was packed, but we were seated immediately after our full party arrived on a friday night.  After sitting down, we waited on my friend before ordering. The menu is pretty small, only one page and straight to the point. We ended up getting a bunch of appetizers and a few entrees to share, and the server was very insistent that we got two of everything. It was to the point where we felt like she was pushy.... was not too happy about that. We had told her we wanted to just order first and get more if we were still hungry, but she didn't really give us that option. Anyways, on to the food.  Half Dozen Shigoku Oysters, 21- The oysters were very fresh and had a light marination. It was a great start.   Belgian Endive &amp; Roquefort Cheese Salad, pears, pomegranate seeds, hazelnut brittle, pickled herbs, charred pear vinaigrette, 14- the salad was interesting yet good. The hazelnut brittle was my favorite part, and it was slightly fruity which was a great combination.  Maine Lobster Pyramid Ravioli, golden chanterelle mushrooms, melted leeks, lobster nage, 17- this was one of my favorites. Loved the foam sauce, it really added a lightness to the ravioli. The put the chanterelle mushrooms on the side of the dish, which I thought was kind of random.  American Kobe Zabuton Carpaccio, shaved perigot truffles, pntarelle, peccorino, lemon aioli, baby greens, 18- this was my absolute favorite. The meat was marbled and super tender, and the truffles on top of the meat was amazing. Definitely recommend this dish!   Roasted Berkshire Pork Chop, cabbage, baked potato puree, marble potatoes, apple and quince relish, pork jus 32- The pork was very succulent and tender; it was definitely one of the better pork chops I've had. Great entree.  Pan Roasted Organic Chicken Breast &amp; House Made Chicken Sausage, lentils, foie gras,winter mirepoix, nettles, celery root puree, and rich chicken jus. 25- I dont know what's up with organic and not being as good, but this chicken was not that good. Kind of dry and bland. I didn't even taste the foie gras (maybe I didnt get it because it was a shared dish), but after eating one bite of the dish, I was like uhhhh... no. Stay away from this dish.  We also ordered a few drinks; I got the barrel-aged chocolate spiced negroni, which was too strong for my taste, but it was made well.  Overall, our bill came out to be around $240. The food for the most part was delicious, and the service was good (besides the pushy incident). Very glad I got to try this place while in SF, thanks to the really nice hostess!", 
    "review_date": "2015-01-16"
  }, 
  "1msi6Jx7PshfHtnfyRhcoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "The beef carpaccio was tasty and came with fried egg yolks. Kind of mind blowing how that is even done, but they were great. Crab salad was very fresh and very good. For entrées we had the duck, pork chop and bavette steak. All three were top notch, but the steak was standout. Great flavor, perfectly cooked, and the mushrooms it came with were meaty and fantastic.  Service was on top of things. Classy ambiance, great martinis, Laguiole knives. Would definitely come back again.", 
    "review_date": "2014-02-01"
  }, 
  "itxtvwU0cJNU7oZRvl1jsA": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Shirley C.", 
    "review_text": "Great service, lovely atmosphere, and delicious food.  Love that the bar is open for HH before the restaurant opens for dinner. Kimchi deviled eggs are tasty, but nothing super special.  Our Kobe beef and crispy pork belly entrees were delicious. Didn't have time for dessert since we were headed to a concert, but will be back to try their selection.", 
    "review_date": "2014-08-05"
  }, 
  "pDfL8xt8F8ls0-kQIG_ADg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Earl G.", 
    "review_text": "Professional well dressed crowd, 30-50's. With corp offices of Google and Gap  literally next door, Prospect is a good spot to meet FiDi and SOMA friends for a \"Power happy hour\".   Lucky they were able to get their early since the place was packed by 5:30 on a Thursday. Nice little bar crawl with Palomino and Americano within walking distance.   *Signature PROSPECTOR cocktail - $12 The blend of scotch, burnt orange, bitters, and madeira was smooth sippin' while talking TPS reports.   *WHALER - $12  Really liked the flavors of the Jamaican rum, sparkling wine, grapefruit, and blackberry honey mint. The froth from the fresh egg white was icing.  (<a href=\"http://www.yelp.com/biz_photos/0Sh-XNVgGDRwiN4K3UEQJA?select=E8G69sKvjprGIsKxwhE_hg#E8G69sKvjprGIsKxwhE_hg\">yelp.com/biz_photos/0Sh-…</a>)  I can't wait to bring Mrs G here for a date night.   Cocktail menu - (<a href=\"http://www.yelp.com/biz_photos/0Sh-XNVgGDRwiN4K3UEQJA?select=ElWZ7iKfRqpR9yQMw4J5Rg#ElWZ7iKfRqpR9yQMw4J5Rg\">yelp.com/biz_photos/0Sh-…</a>)", 
    "review_date": "2012-08-30"
  }, 
  "bTFZ-cepM91pdS2PFpvJiA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody T.", 
    "review_text": "We went for Sunday brunch.  The place is definitely \"fidi\" upscale decor/overall feel.  Service was not great, too few staff for the number of tables - almost all filled up by the time we were done. A bit of a stuffy feel - we were 3 young females and sort of felt out of place...too fancy/bouche.  Was not blown away by anything we had, but dinner could be another story...might return to give that a whirl but doubt anytime soon.  I think I will stick to my mission-y hipster brunch spots ..  The one thing I will say is that the sausage was very flavorful.  The beignets weren't memorable - BRENDAS instead!!  Coffee was average.. fried chicken sandwich left me wondering why we chose this place?", 
    "review_date": "2012-12-30"
  }, 
  "IprKHet03baoU8heBOYuwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "Upscale Sunday brunch with attentive service (multiple waiters checking to make sure we had forks? How unheard of for a yummy brunch place in SF!).  FOOD:  Pumpkin beignets ($8): 4 little beignets with warm spiced pumpkin (I don't really like pumpkin, but this was actually really good) and fudge &amp; carmel dipping sauce.   Baked pancake ($12): One thick pancake (about the thickness of 2 pancakes) with apple &amp; crumble on top along with apple cider syrup. This was really good and definitely unique &amp; highly recommended.   NOTES: - The crowd is FiDi-esque. - Location is very close to the Embarcadaro muni. Take a stroll along the Embarcadaro &amp; enjoy the sailboats &amp; Bay Bridge views afterwards.", 
    "review_date": "2012-11-04"
  }, 
  "N9c02sQJDTvVUkCPhq-6fg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen S.", 
    "review_text": "We loved Prospect! The food was absolutely phenomenal and our waiter could not have been more fun! It was a truly enjoyable experience from start to finish and we'll definitely be coming back in the near future. What we ordered:  -Maine Lobster Tagliatelle -Seared Day Boat Sea Scallops -Liberty Valley Duck (Breast &amp; Lightly Smoked Sausage) -The special, which was a NY strip steak  Cocktails: -Manhattan Project and the Prospector  Everything we ordered was cooked to perfection and had great flavor. The cocktails were innovative and strong! While my husband and I aren't exceptionally picky, we do eat out a lot and try to frequent as many of the Chronicle Top 100 restaurants as we can. Prospect did not disappoint. From the food, to the service, to the overall ambiance-this restaurant is superb.", 
    "review_date": "2013-10-07"
  }, 
  "yNOP89A38ijXk2_DTzB3wA": {
    "user_rating": 5.0, 
    "user_location": "Brookline, MA", 
    "user_name": "Henry S.", 
    "review_text": "Delighted  Food:  Simple, creative, fresh and delicious.  A pleasure to eat. Service:  Excellent  Best of all - we ordered a Sancerre. I thought it was a little tart.  Since I'm the farthest thing from a wine expert, we talked about it with the sommelier to get educated.  It's San Francisco after all, what better place to learn?  He told us Vouvray would probably have more of the apple sweetness I was looking for.  Then he gave us a sample to try.  Then he switched the bottle for us on the house.    Amazing.  One of the very best restaurant experiences of my life", 
    "review_date": "2014-05-08"
  }, 
  "EMKlg2QZCx9jWmFve3_y6w": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Becky L.", 
    "review_text": "lovely dinner - attentive wait staff along with deliciously prepared food made for a fabulous dining experience. highly recommended!", 
    "review_date": "2015-01-27"
  }, 
  "9U30DANobkrn3Zlu6T9p6Q": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Jeff F.", 
    "review_text": "This is a great place to post up at the bar and have dinner. Rundown:  - Tuna Tartare: excellent  - Grilled Calamari: good  - Japanese Scallops: perfect  Great bar scene.", 
    "review_date": "2014-09-13"
  }, 
  "biNk2izKRsujpMUT-0WKLg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris S.", 
    "review_text": "For the price the food was nothing special and on the small plates side. The special cocktails were good but also on the nothing special side. Lastly, the service was on the not so attentive and slow side, especially given that we dropped $90 per person. For example, we had to ask for bread 3 times and even then took around 15min. There are too many great restaurants near by so will not be coming back.", 
    "review_date": "2014-12-20"
  }, 
  "HSFXuYnNMGCJuRu_DvzLRg": {
    "user_rating": 3.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Candice B.", 
    "review_text": "Another girls night out, this time to Prospect, a place that has been bookmarked and waiting to be tried for a while. Atmosphere is nice more on the professional side I felt, so definitely a place to take a client or have a lunch meeting . We were greeted at the front by a very smiley hostess, then were seated to the main dining room where we were handed the menu. I already had my eyes set on several items when checking the website, however it was on the Bar Menu, which is only available at yes, the bar. The bar menu is a specific menu filled with small plate items and only available at the bar from 5pm - close, this is not the Happy Hour Menu, although they do have that at a set time as well. The main dining room menu had great choices for main dishes, but we were more interested in trying several different dishes to share instead of eating one big dish each. So we politely asked if it was ok to move to the bar area and was replied with, \"It is your dining experience so feel free to sit wherever you would like\". We were pleased and very thankful of his response, cause in all honesty we felt very naggy at that point. We were moved over to the bar area, which wasn't bad, had a roomy table with view of the dining room. The only thing we found weird is that the bar area was not as loud as the dining area, where as typically it would be vice versa.   Started off with the drinks, found the drink choices to be more on the manly side; no cosmos, mojitos, or anything girly. One of my girlfirends even said that their drinks seem like it would put some hair on your chest. After eying the cocktail menu, decided on the Il Terranova: Botanical Vodka, Cynar, Cucumber, Agave Nectar, and Lime. Thought it would be refreshing and light, however it came out to taste somewhat like I was drinking whisky. Then we ordered, and ordered a lot and to be honest it was really hit or miss and to the extreme. Some dishes were either really good or really ehhhh.   To the food:  Ahi Tuna Tartare - Hit: This was one of the faves of the table, fresh with a little kick due to Jalapeno and Black Siracha Pork Belly Fries - Miss: Not what we expected coming out. We ordered thinking it would be sliced pork belly, mocking the shape of fries or pork belly w/a side of fries. It was actually minced pork belly and kimchee sprinkled on top of thick cut fries. This was disappointing because the fries were the main attraction but the least wanted. What we did try of the pork belly was really good, however not enough of.  Crispy Squash Blossoms - Hit: 2 squash blossoms with a couple fried green beans. Squash blossoms were light, yet very crispy which I liked.  Mushroom Arancini - Miss: We were told they were out of, so asked if we would like to opt for the crab cakes. Sure!!! The server brought it out.. Wow someone said, and a giggle came another. Is this what they feed the crabs that they are using to make the actual crab cakes?!?! They were tiny, good but way to tiny..  Duck Liver Mousse - Hit: This had to be my favorite. Very smooth texture, not overly mineral in taste, and paired with the pickled rhubarb and shallots, mmmmmmmmmm.. The best thing I had there.  Smoked Halibut Brandade - Miss: Texture was nice and smooth, but flavor was bland. So it made me feel like I was smearing seasoned mashed potatoes on a crostini Cheese Plate - Hit: But I mean how can you get cheese wrong Steak Frites: Kobe Bavette was tender and flavorful. Then had another serving of those really thick cut fries.   Overall, nice filling meal. However, was maybe looking for a better dining experience.", 
    "review_date": "2014-04-22"
  }, 
  "nW7kOwA42JlgOufVxprPZw": {
    "user_rating": 4.0, 
    "user_location": "Danville, CA", 
    "user_name": "Alexis M.", 
    "review_text": "I came to Prospect with a group of 6 to celebrate one of my co-workers birthdays.   The décor is SO different than Boulevard. It's very sleek and modern looking, Very nice.  We were quickly seated towards the back of the restaurant, which was fine, in a round booth, which I hate. Seriously, booths sucks. No one wants to be shoved in the middle. When someone needs to use the restroom everyone has to get up to let them out. It's like being in the middle seat in an airplane.  Despite being shoved in the middle (can you tell I'm biter?), I survived, due in part to the amazing cocktails! I love the use of bitters and rye in so many of the drinks. I wish I could remember the name of the drink I had, because it really was like drinking Autumn.  Our waitress was great. Our meals were divine. They were very accommodating to both me and a coworker who are both gluten free, and the bathrooms were beautifully done.  We were there on a Thursday night and it was packed. From the bar to the private rooms, there wasn't an empty spot in the house.", 
    "review_date": "2013-11-25"
  }, 
  "VwzQRCOr0Hg-vwTJ55kkuQ": {
    "user_rating": 5.0, 
    "user_location": "Monrovia, CA", 
    "user_name": "Wendy H.", 
    "review_text": "Since my last review, I have decided to give prospect 5 stars because of the following:  The manager Callie contacted me about my first visit to Prospect and apologized for the service the night I went with my girlfriends. That impressed me and showed me they truly value taking care of their customers.  In addition to that, she sent me a few drink coupons to make up for it. That was so sweet of her and she really didn't have to do that especially since I said I'd still return after my last visit.   So I wanted my family to try it, i gave the drink coupons to my brother and he brought my dad and step mom. I was receiving live feed on their enjoyable time there. They got to meet Callie and thought she was wonderful. They all enjoyed their food and drinks.  My dad loved everything from the appetizer, the main and the dessert!  Overall they said they would definitely return as well.  Looking forward to going with my family and bringing my husband this time!", 
    "review_date": "2013-02-07"
  }, 
  "lDEOHHYD8fJYKXFdV5UOoA": {
    "user_rating": 4.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "Christina C.", 
    "review_text": "I've always been a fan of dinner here. We came here for team lunch today and the food was excellent. Okay. Don't get the salad unless you really want a small overpriced salad. But oh man, the ramen was so really good.", 
    "review_date": "2014-10-22"
  }, 
  "Qi1AuyRjI8_2Fq0swFUGAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie M.", 
    "review_text": "I want to cheat and give this place a four and a half stars! Prospect is upscale without the snottiness. The staff is attentive and accommodating. We ran a little late to dinner and the hostess was super super nice about it.   As for the food it's pretty good. I got the seared scallops which came with the strangest enoki mushrooms. I was not feeling the sauce. So the seared scallops were not for me. I also got the calamari and the ravioli. The calamari was BOMB DOT COM. I loved how it came with this sauce that had a spicy kick! The ravioli was a little bit overcooked but the filling..drools. The entree I ordered was the chicken...YES. GET THIS. So tender. So juicy. It laid delicately on a beautiful bed of spinach and mashed potatoes. Dessert was the ice box cake and they aren't lying when they say split this! It's super filling and really rich! The peanut brittle on the bottom adds a nice crunch.   All in all worth the price. Good atmosphere. Good staff. Good food. Which all equates to a pretty darn good time!", 
    "review_date": "2014-08-27"
  }, 
  "YxG7Pg1vifo7qCjg42smew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donald W.", 
    "review_text": "When I first heard about Prospect from friends, I wasn't sure what to think because I had never actually been to this restaurant before. But it's located in the heart of downtown San Francisco with wonderful views of the bridge and the pier. Well it does depending on where you actually sit in the restaurant. This place serves many options for lunch &amp; dinner with an ambience &amp; decor that I loved and I think everyone can appreciate.   One of the things that stand out is their amazing wine selection. It's incredibly large and takes up and entire wall. The staff is very professional &amp; make you feel so welcome. The food is amazing and even the lighting is set to a perfect selection for that romantic occasion. I suggest taking your significant other on a romantic date here, they will not be disappointed.", 
    "review_date": "2014-02-13"
  }, 
  "1odp6al7Uz4dkg_dvKQfMw": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Pompy B.", 
    "review_text": "If it wasn't for the COLD service Prospect would be way up there. The waiter couldn't wait to get rid of us even though we had almost $200 bill for 2! My to-be-daughter-in-law and I were getting to know each other so maybe we overstayed our welcome on a non-busy Monday night. So much for all the hype and recommendations we chose this.", 
    "review_date": "2014-07-14"
  }, 
  "LM5JaVmOd02ZMkWDIchtog": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mary Ann A.", 
    "review_text": "It was a perfect evening.  The food and the service were great.  We were a party of 6 and they did not rush us at all.  Everybody enjoyed the food and the wine.  My husband ordered some chicken wings from the bar and they did not complain.  It took longer than the rest of the appetizers but at least they did not say \"no\".", 
    "review_date": "2014-07-30"
  }, 
  "VubKBg5Mcj_TcB-KSRn_jw": {
    "user_rating": 5.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "beth s.", 
    "review_text": "Yum yum. So far the royal treatment drink was delicious and so fragrant with the sprig of lavender in it.  The morel mushroom and  corn ravioli w/blueberries is the bomb! Make that an entree when in season!", 
    "review_date": "2014-05-16"
  }, 
  "wM6ivcWBQNhKm4IurI2w5g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle K.", 
    "review_text": "Great for business lunch. Took clients out to lunch and they loved it. Tuna tartar and anchovy caesar salad were both great. The risotto was a bit too heavy for an appetizer.   Really enjoyed their desserts. DELICIOUS ice cream sandwiches (they don't usually have them during lunch time, but they made a special request for us!) -- cinnamon ice cream with snicker doodle cookies. Yum!", 
    "review_date": "2014-02-09"
  }, 
  "lBJgYM7FYtaN3Yteyqr2iw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Pamela C.", 
    "review_text": "Had lunch here today with a party of 11, a going away lunch for a co-worker. The food was incredible. My entree was the Char Rare Local Albacore - it was fantastic. Also the basil pesto deviled eggs were killer!  The ice cream sandwich dessert was good too, although I like my cookie a little less fudge-like. But the dark chocolate flavor made up for the texture. Even the espresso was 5-star. Definitely recommend this place.", 
    "review_date": "2014-09-03"
  }, 
  "sR8Z2WcpPW9gwQPa4l2kkQ": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michael L.", 
    "review_text": "Good food, drinks and a lot of seating with an awesome staff.", 
    "review_date": "2014-06-02"
  }, 
  "PIP_TJh951GOuo1jiQTRwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam O.", 
    "review_text": "Very good,  Also very Expensive.  So bring a wallet... or a Good friend, and order wine... lot's of wine. Also be very demanding of the service... They perhaps need a nudge that you want to be pampered. Then leave an appropriate sized tip... I would think 20-25 percent.", 
    "review_date": "2014-01-26"
  }, 
  "fpotsL9JJJUzFb8A4_ewZQ": {
    "user_rating": 2.0, 
    "user_location": "CA, CA", 
    "user_name": "Nancy G.", 
    "review_text": "2nd time eating here.  Very salty food, some kind of seafood taste happened in a dish that didn't say there was any seafood. People with allergies beware.  Rushed service. Clearing plates before others finished eating.", 
    "review_date": "2014-12-04"
  }, 
  "Fa92SSc9sZAUFlkCeIPsIw": {
    "user_rating": 4.0, 
    "user_location": "La Habra, CA", 
    "user_name": "Michael R.", 
    "review_text": "Group of twelve dudes for dinner before a night of debauchery...check Helpful wait staff...check Equally impressive food...check  Prospect being first-rate...check  From the moment I walked in, I knew I was in for a treat.  The staff at Prospect did a great job of accommodating a bachelor party of twelve.  I could tell our waitress was a vet in the service industry.  She oozed confidence and charisma.  Normally I would pick and choose from the menu, we opted to go with her recommendations.  She hit a home run.  Apps: -Lobster and sweetbreads...delicious -Kumamoto Oysters...sweet, briny, and exceptionally fresh -Wagyu Beef Tartare...the plate was licked clean  Entree: Kobe Bavette...simply prepared and cooked to perfection. Berkshire Pork...the star of the night.  Moist, tender and packed huge flavor.  If I could only choose one dish, this would be it.  Definitely a fan of this place and will recommend to others when they're in the bay area.", 
    "review_date": "2013-02-26"
  }, 
  "Dh3eLWmrb37T4JFNKtXAWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jo L.", 
    "review_text": "The sister restaurant of Boulevard! I came here for a team dinner and maaan was it good! The bar service was pretty great while waiting for my coworkers. I had the Crispy Skin Local King Salmon (say that 10x fast) and it was divine! Heavy on the beans which personally, I'm not the biggest fan of but the skin was literally crispy like the name says. The salmon was definitely freshly caught and not overcooked. Entire dish was DELISH!   For dessert, I had the Straus Greek Yogurt Panna Cotta and it was pure bliss. Light and tart with the sweet compliments from the fruit. Not too heavy like typical American desserts. Mmmm.. *yoda voice* rumbling, my tummy is...", 
    "review_date": "2014-08-25"
  }, 
  "tz4_ohXM2UIohvruLU49PA": {
    "user_rating": 5.0, 
    "user_location": "Citrus Heights, CA", 
    "user_name": "Douglas L.", 
    "review_text": "Outstanding in all respects. Well... except the service was a bit slow on this Monday for lunch. They apparently had more business than they planned for, as they were a bit understaffed. The slack was picked up by one of the managers who was most pleasant. He really took his time to welcome us (our first visit) and to explain several of the wines that we might like.... he brought us taste samples of two wines to help us make a decision. The food was excellent! Our server, Elizabeth, had only been there for a couple of weeks, but it was obvious that she was a very good, polished server with plenty of experience.  All the food coming out of the kitchen looked good. The interior of the restaurant is well done... modern and very clean. The lunch menu doesn't have too many items, but they have a good cross section of choices.  And get this.... it wasn't any more expensive than what we paid the previous day at a terrible restaurant in North Beach.", 
    "review_date": "2014-10-29"
  }, 
  "Fn5tCTyNNmvkUzfR_h3K2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anaheli D.", 
    "review_text": "Just OK! It wasn't bad but it wasn't amazing. My girlfriend took me out for dinner that night. I was coming back from a 2 months business trip in Mexico City, so I was hella excited and so was my girlfriend.   I had a martini, asparagus and a steak. It was definitely good, although,  there was something with the ambiance of this place that I didn't fully enjoy.  To be honest, this place seems like the perfect spot for a business dinner, not so much for a romantic date, so I guess that's our bad.", 
    "review_date": "2014-01-10"
  }, 
  "-g3XIcCb2b-BD0QBCcq2Sw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa I.", 
    "review_text": "I don't say this very often, mostly because I can never decide on what I feel to be the \"best\" of anything, but Prospect has THE best brunch in San Francisco.  Brunch is always such a weird meal for me since I can never decide if I want breakfast and start the day off with a normal meal, or skip straight to lunch and enjoy something more savory.  Anyway, I took my parents here for brunch since a) I heard some fantastic things about the place, and b) it's close to where I live.  Anyway, I made a reservation for 12pm on a Sunday but it didn't seem necessary.  After perusing the menu (and Yelp) for appetizers, we came up with the following:  - Monkey Bread - Deviled Eggs  Two very distinct dishes, but two OUTSTANDING ways to start off brunch.  The Monkey Bread, which has nothing to do with monkeys, was one of the most decadent things I've had.  It was like a cinnamon bun that got fluffed up to be the same texture as a cloud.  It took all restraint to not eat half the pan and then some.  The deviled eggs were highly touted on Yelp, so being that this is one of my favorite hors d'oeuvres, I had to get it.  The tiny plate of deviled eggs came out with a tiny sliver of jalapeno and bacon on top of it.  The texture of the filling was nothing I had ever had.  The jalapeno was also mixed into the filling of the egg and combined perfectly with the bacon garnish.  Yeah, I ate half the plate.  Moving onto the dishes, we all got something different, which translates into a sampler platter for me:  - Me: The Prospector - Mom: Huevos Rancheros - Dad: Braised Short Rib &amp; Smoked Potato Hash - Greg: Buttermilk Waffle  So, to start. My dish, The Prospector, was your standard eggs, bacon, sausage plate...except that it came with AMAZING corn skillet cakes which came off as pure tasty cornbread which was my favorite part of the dish.  I had a small bite of Greg's waffle, which was awesome, but I had to give up a piece of bacon and sausage.  We decided that it was probably best to stock to our own dishes after that.  My parents loved their dishes and at the end, and there were absolutely no leftovers.  Our server was great, and everyone always made sure we had enough coffee in our cups.  I absolutely loved Prospect and can't wait to go back and try something new!", 
    "review_date": "2012-08-13"
  }, 
  "DFENl5W4GgwGshWSgP3vbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather S.", 
    "review_text": "Absolutely delicious food and gluten-free!  However, the portions were small and the very expensive.  The server did a great job.  He was knowledgeable about what was gluten-free and easily answered questions about all the dishes.  Thre architecture was modern and because the restaurant itself was cold it made the decor feel cold too.   We started with 1/2 dozen oysters that were sweet and plump and $18.  That is a bit much, in my opinion.  I ordered lobster and scallops over a black (squid ink) risotto with a foam.  Divine!  The shellfish was cooked perfectly as was the risotto and the foam added a little citrus.  There were three pieces of scallop and lobster each.  For my entree I had the duck three ways.  Unfortunately the chef wasn't satisfied with the presse so he didn't want to serve it so I got an extra half piece of duck sausage making it only duck two ways.  That said, I appreciate a chef who will not send out subpar food.  The duck breast was fantastic.  The skin was crispy and the meat tender.  The sauces were a carrot puree and something savory.  They were wonderful.  The duck sausage was was also quite tasty.  I wish the presse had been up to par.  Dessert was caramel popcorn with cacao nibs.  It was a perfect ending for me.", 
    "review_date": "2014-01-18"
  }, 
  "HB0OEby4sXYE8hUqYY5Blw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emmy P.", 
    "review_text": "Prospect is a sibling restaurant of Boulevard. Boulevard is one of my favorite restaurants in SF. So I came here with high expectation, and it did not disappoint me: Deco is modern, warm and sleek. Food is great. And service is impeccable!  We split the following:   Spring Garlic Deviled Eggs  Maryland Soft Shell Crab: Crispy outside and tender inside. Kimchi is put on the bottom, it is a surprise, but all the favors mingle very well.    Gulf White Prawn Salad: Bruno tomato is fruity, Taggiasca olive is a small, dark red color olive with rich favors. All ingredients are artistically arranged, adds appeal to the salad.  Fresh Porcini Mushroom &amp; Braised Duck Pasta: this is simply the best. Duck is a little salty, but oh-boy, it is so tasty, makes you want more....   Pork Loin: was not impressed at first bite, but it came with a mouthful aftertaste, a wonderful experience!  We also ordered two ice cream deserts, they are not very memorable.  Compared with Boulevard, I think Prospect is more contemporary and fusion, less expensive. Total damage: $46 per person.", 
    "review_date": "2014-05-30"
  }, 
  "S4032uQdfzn8S6ketY6uPw": {
    "user_rating": 2.0, 
    "user_location": "Boston, MA", 
    "user_name": "Megan G.", 
    "review_text": "Great food, experience ruined by blatantly, obnoxiously indifferent service. Won't be back.", 
    "review_date": "2014-12-05"
  }, 
  "O3slQM5zE77Ga6qrxfpKoQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Faith Y.", 
    "review_text": "It felt a bit like walking into Wall Street except all the blue pinstriped shirts were sitting down and dining. This is a hardcore FiDi after-work crowd and I have to say, predominately male, on a random Tuesday night. Aside from the \"bizness\" atmosphere, the food and drinks were merry and mighty delicious.   The summer dinner menu skews towards seafood lovers but there was something that appealed to everyone in my group including a vegan. We split the ultra-fresh Heirloom Tomato Salad and battled over the creamy pieces of Burrata. The Seared Sea Scallops were accompanied by long beech mushrooms and okra, swimming in a surprising Thai curry broth. Prospect also had a daily special: a lovely risotto served with a fresh farm egg. Don't let the visuals fool you, it looked a bit like bland oatmeal but tasted far from it.   After devouring the bread plate, I decided to order two appetizers for my main course. If you know me, that's a rare moment of restraint. The Monterey Calamari and Potato Ravioli were of course, appy-sized, but it was creamy and decadent. The Heirloom Tomato Gazpacho was definitely the star of the show. It arrives dotted with prawns, peppers and avocado mousse and they make a light show of it by pouring the chilled gapacho tableside. It also comes topped with uni (sea urchin) that you can request with or without. Plus, it is SPICY as all get out.   All in all, I was pleasantly surprised by the fare and our NYC guests couldn't stop raving about the dishes so chalk another one up for the SF food scene!", 
    "review_date": "2014-08-23"
  }, 
  "9GOk4F9pcO6Q8E2OTD5zrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linh V.", 
    "review_text": "I've been a bad Yelper... I've been eating a lot but not writing a lot. Hence, this review is months late. Nonetheless, I feel their service and quality of food is worth talking about.  Before I begin, you should know that Prospect is one of those restaurants where you should be ready to dish out a good amount of $ for a meal. Yet, I'm often surprised when people complain about price, as if they just popped into the restaurant during a stroll around the neighborhood. The menu is available online and the decor is swanky enough so that you know you're not going to get dollar tacos here.   We had a party of over 20 for a birthday party and they were able to accommodate all of us, albeit it took a while for us to get seated even with reservations. Once we were seated, I dived into the menu and ordered a couple appetizers that I cannot remember. This only means that I didn't think they were that great. Another person at our table however ordered the gnocchi which was excellent - warm, soft, delicious.   For the entree, I ordered the special for that night, which was goat. Half our party ordered the same thing and I, along with everyone else, thought it was an excellent dish. We enjoyed it so much that the people who didn't order goat was regretting their choice. Hehehe. I love it when that happens.  Next, we had dessert, my favorite part of a meal. I ordered a caramel cake of some sort that I no longer can find on their menu. Amazing. Best caramel cake I have ever had. I was practically melting on my seat. And this is coming from someone who has a major sweet tooth.  Finally, I'd like to give thanks to the waiter who helped us. I didn't catch his name but he was so attentive and helpful with his recommendations. Definitely one of the best waiters I've ever had.", 
    "review_date": "2012-08-16"
  }, 
  "tj2GPWuaJsTbR2YwP6Yd7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa L.", 
    "review_text": "My first visit to Prospect was within one year of their opening.  I'll be honest and say that I left less than pleased.  The portions were very small, the food was overpriced and the service was less than stellar.     However, on a recent visit, I'm happy to report that I was very pleased with the entire dining experience.  I started off the the meal with an appetizer of scallops, which were  fresh, sweet and seared to perfection.  For my entree I ordered chicken that was prepared several ways including one piece that was sous-vide and then wrapped in bacon (<a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=ZiVsUtPCllBRroSwqFJr6Q#Eq_AmvDlcOOWuH8EDsH4Mw\">yelp.com/biz_photos/pros…</a>).  It didn't seem like it was a huge portion, but for whatever reason I was barely able to finish my dish (even after a 7+ mile hike earlier that day).  It was some of the best chicken I've had in awhile.  One of my friends ordered the goat dish that was the special that evening.  It was tender and flavorful, but  not gamey in the least.  It had the texture of pork but looked like beef.  I like that Prospect changes it menu constantly and prepares its dishes in a manner different from what I typically see.  For dessert my friends and I split a dessert. If memory serves, it included a semi-freddo and a black velvet cake with meringue (<a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=ZiVsUtPCllBRroSwqFJr6Q#gS4RpSEwvnKVzAjXuuHCTg\">yelp.com/biz_photos/pros…</a>).  It wasn't too heavy or too sweet and a great ending to our meal.  On my prior visit, I had tried the ice cream sandwiches and the caramel popcorn and they are worth trying as well.  The service we received on this visit was excellent.  The wait staff was top notch, professional, friendly and helpful.   I would recommend Prospect to others without hesitation.", 
    "review_date": "2013-06-29"
  }, 
  "pNDsq4v56zTT2xhyYvUMQQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene C.", 
    "review_text": "I've been here twice, once during a first date gone horribly awry and another for dinner with friends from out of town. I feel that this must be where all the old money in SF must come, as I don't think I've ever seen as many patrons over the age of 60 eating in one place, with most of the men in sports jackets or suits. (I swear one of them was Aaron Spelling...) Eating here reminded me of being back in NY, as the high ceilings and tasteful shades of tan/gold and greys/black made this place seem regal and sophisticated. That being said, this is not a particularly quiet restaurant.  From the date experience, I had the duck liver mousse which was served with rectangular logs of toasted potato bread(?), which was not surprisingly a great vehicle for delivering the rich and creamy concoction. The sticky chicken wings are reminiscent of Bonchon or any other decently-spiced Korean fried chicken. From the cocktail menu, the Domino Effect is like a slightly spicy spiked apple cider, a great choice when chilled to the bone but not so wise an option immediately after working out and on a first date.  From dining in the main room, we shared a bottle of wine that I sampled and was not particularly keen on but felt somewhat pressured by the sommelier to accept. (Never again!) A friend and I shared the seared abolone which would've been better if there was more of it to go around; the tomatillo puree and gin &amp; cucumber emulsion helped make this a fresher and lighter dish than it otherwise would've been. Our other friends shared the burrata, which is hard to mess up. I had the skate wing, which was cooked perfectly but over-salted (is it just me, or does everyone over-salt skate?!) over a celery root puree that needed some salt for itself.  I'd be willing to give this place a second chance as a dinner option, but overall I'm much more interested in ordering everything from the bar and people-watching for the rare SF celebrity sighting.", 
    "review_date": "2013-10-24"
  }, 
  "eZbasrlXt0lQni8aj8k8NA": {
    "user_rating": 5.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Shahram M.", 
    "review_text": "Food at this place is fantastic. My starter was their heirloom tomato salad with burrata cheese and croutons. So much taste.  My main course was the swordfish. With calamari. First time swordfish melted in my mouth.  Paired with their pegato white wine which was so so.", 
    "review_date": "2014-09-22"
  }, 
  "KI7gPbRvdngGcgq3-RD7Gw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kendra W.", 
    "review_text": "The venue is great for brunch -- upscale and brightly lit, as was the service (despite some mishaps).  The food is good, but nothing life changing (especially with that price tag)...so 3.5 stars it is.  We ordered: --Prospect Eggs Benedict ($14.5) -- a pretty decent benedict but served with 2 pieces of SUPER YUMMY pork belly.  I also appreciated that it came w/ lots of cream spinach and not too much hollandaise sauce.  Felt slightly healthier -- thought can't be quite sure... --Prospector ($16) -- basically a big breakfast platter - 1 pork apple sausage, few strips of bacon, eggs, 2 corn cakes, and home fries.  Eggs were very tasty and bacon was of good quality -- but nothing call home about...  I think corn-cake lovers would appreciate Prospect's version as my bf loved it -- but I'm not big on corn meal treats so can't judge. --Monkey Bread ($8) -- it's their signature.  Kind of like 7 super-doughy donut holes wedged in a circle pan, and drizzled with cinnamon-butter-sticky-goodness.  It's definitely a treat if you've never had it.  The waitress looked like Rachel Weiss and was the nicest.  Only problem was that we waited a good 45 mins for our food, gave us the wrong check, and told us \"good night\" as we left at 2pm -- but they were very very apologetic with the wait and gave us zucchini bread on the house. Ms. Weiss must have just had an off day --so I forgive and forget!    All in all, it won't make my top 10 list given SF is brunch haven, but it's a solid place for brunch if you are in the SOMA area.", 
    "review_date": "2012-11-06"
  }, 
  "egJD2P1OgfS2JyHu7uVP1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany L.", 
    "review_text": "Came here to celebrate my husband's 30th. I made reservations in opentable with a note that it was his birthday. We arrived and after letting the hostess know the name which our reservation was under, she wished him a happy birthday. The server who greeted us also did the same. They even made a special menu for him and gave us a copy to bring home. They did a wonderful job making him feel special!  The wine list was extensive and our server did a great job recommending wines that matched each of our palettes.  The food was delicious and portions were more generous than expected of a place like this. We ordered the heirloom cucumber and avocado salad which was very light and had layers of flavors which prepared us for the next dish, wagyu beef tartare. It was AMAZING. It melted in our mouths. A must if you ever go. We shared the petrale sole which was like a seafood black rice paella. Very tasty and the foam was a nice touch. We also had the snake river farm Kobe with fingerling potatoes. The beef was cooked perfectly medium rare. We finished out meal with some chocolate bon bons. This was a bit too much for two people. The chocolate mousse was very rich and sweet. Perhaps better to be shared with a group.   Overall, a wonderful experience. Can't wait to return!", 
    "review_date": "2013-09-22"
  }, 
  "afczTxVxwBJ7whOgADs1NQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Max V.", 
    "review_text": "Best meal at a place we'll never go back to...  Let's start with every dish we tasted was excellent. The sommelier was knowledgeable and attentive. The service was generally good - but this place needs to \"get over itself\".   One of our party is vegan and ordered the radish salad without the bread crumbles. Seems pretty simple...not so simple. What followed was a litany of excuses ranging from the pretentious to the absurd.  First the server returned saying the Chef would not do the dish without the crumbles because it ruined the presentation. We decided to risk the aesthetic trauma.  Then the manager came out and brought a picture to show us how integral the crumbles were to the dish. Seriously how could we be so gauche. When we explained that the request was based on a wheat allergy we were told to order something else, but we were never brought a menu. Apparently we were suppose to memorize the menu.  Then the same dish was actually brought to another person in our party. The crumbles were just added on top. Not rocket science to skip the crumbles.   When we pointed this out to the manager she then said that they misunderstood and could make it without the crumbles. Wait, not done yet.   Then Chef came out and explained that the radish salad had radishes sautéed with bread.  Ok, the fourth version of why we couldn't get this salad made some sense, and finally the Chef did offer to make a gluten free salad. It's really too bad they didn't start this way, because at this point the vegan diner was so put off she didn't eat at all.  Moral of the story. Come here to eat and be grateful. Don't speak. Don't question and above all don't even think about altering the perfection that they place on a plate. Anaphylaxis is preferred to adulteration of any food combination. You're only the customer and in the relative scheme of things that's not worth much here.", 
    "review_date": "2014-11-15"
  }, 
  "JZfhVkNljM4H8WbsEpWzHg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alastair G.", 
    "review_text": "Being that Prospect is the sister restaurant to Boulevard I thought I'd be debating on a 4/5 star review, not a 2/3 star review. Well, to explain briefly Boulevard won the James Beard award in 2012 for outstanding restaurant which in the culinary world is top honors for a restaurant to achieve. Also, being that I've dined at Boulevard and was thoroughly impressed I thought it was a \"no-brainer\" to dine at Prospect for I thought the entire experience would be equally impressive.  How times have changed....  Upon arriving at Prospect for a 7:35pm dinner reservation I was told that our table would be available momentarily. Roughly ten minutes later we were seated. During the five minutes it took to be seated by the hostess to the time I was greeted by our server I had a chance to admire the decor and overall layout of Prospect. Tall glass windows with visual access to Spear St. surrounds the restaurant.  Designer went the hip, trendy route while incorporating soft, subtle, warm tones to give the restaurant a modern feel.   After meeting our server and receiving our standard bread and water,  I ordered the Garden Of The Infinity Cocktail. (Square One Botanical Vodka, Cucumber, Lavender, Aperol Foam). Drink was ok but somewhat of a girly drink in my opinion. Not willing to make the same mistake twice I had to just stick with thee 'ol faithful  \"Goose Cranberry\" or in bartending lingo \"Cape Cod\".    Appetizers were the Monterey Calamari &amp; Chili Glazed Pork Belly.(Bonito Aioli, Pickled Daikon Salad, House Made Kimchi). Calamari was tasty and delightful with spicy ingredients to really engage your pallet.   Entree consisted of Brandt Farm Ribeye. (Roasted Whole Baby Cauliflower, Bandage Cheddar Sauce, Heirloom Potatoes, Sauteed Bloomsdale Spinach, Baby onions, Beef Jus). Ribeye was juicy and flavorful. Prepared, seasoned, and cooked well. Potatoes, Spinach, and onions together with the Ribeye was quite delicious.   For desert, House Made Sorbets. Sangria &amp; Mango Sorbets. The Sangria Sorbet taste exactly like a glass of Sangria. Very pronounced aftertaste. Well crafted Sangria Sorbet. The Mango Sorbet was good but a little off. Had good Mango flavor but the aftertaste tasted a bit processed. I had a taste of the Strawberry Rhubarb Crepes (Yerena Farms Strawberries, French Vanilla Ice Cream, Oat &amp; Almond Streusel) which were absolutely incredible. The whole concept of Crepe, Strawberry, French Vanilla Ice Cream &amp; Oat is a masterpiece.    In conclusion, Appetizers and desert were great while the drinks and entree were good. What really swayed my decision to give Prospect a three star review versus a 4 star review and occasionally a two star review was something so very basic and crucial. Service! Service was hit or miss, delayed, and somewhat shotty at times. Our server didn't seem too enthusiastic and at times I got the vibe that she was just \"going through the motions\". In any event service is something that should never be overlooked. Without quality service a restaurant cannot function properly. I would come back but I have other restaurants to visit. By the way the restrooms are quite far if you have a table in the front of the house.", 
    "review_date": "2013-05-10"
  }, 
  "6ukaJ8F5c0hMvEgD8us8Uw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace Y.", 
    "review_text": "Love brunch in the city. Came here on Sunday and was stoked that there was no wait. The ambiance was awesome, tons of windows and natural sunlight. The restaurant was really spacious and the hostess was super bubbly &amp; friendly.  Here's what we had: - Strawberry Shortcake Scone: w/ creme fraiche &amp; fresh strawberries. (P.S. Creme fraiche will always remind me of Southpark) The shortcake scone tasted like a huge snicker-doodle. The scone was fluffy and crispy at the same time. I also loved the fresh strawberries! - Short Rib &amp; Smoked Potato Hash: Short ribs were tender, the hash was super flavorful but could have been a tad bit crispier. I'm also a huge fan of shishito peppers so that was icing on the cake. - Tomato &amp; Burrata Tartine: The Burrata, basil, tomato reminded me of a caprese salad. The prosciutto was delish and the italian batard was crispy and perfect. The confit garlic scramble was great on flavor but so-so on consistency.  Each dish was ~ $14, which is pretty reasonable. Would definitely come here again!", 
    "review_date": "2013-05-06"
  }, 
  "76vIFZcC7owykCBjMfGVXg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Amy D.", 
    "review_text": "This was my second time dining at Prospect, but my first time for dinner. I've also had brunch here a couple of years ago, and really enjoyed that. I made my reservations a week or so in advance, and we were seated right when we arrived. The lighting inside is very dim, which makes for an intimate setting. We ordered:  -Tuna Tartare w/Taro Chips (<a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=pa-jJPSfDrYYrLkp-M2stw#pa-jJPSfDrYYrLkp-M2stw\">yelp.com/biz_photos/pros…</a>): Yum! The tuna was really fresh, and I loved how all the different flavors worked together for the tartare. My only complaint is that the taro chips break apart really easily, and they didn't give you enough initially. Our server let us know we could've ordered extra, but we didn't want to have to wait longer for them to arrive. However, I still really enjoyed this dish! -Green Goddess Salad (Mixed lettuces, Cucumbers, Avocado, <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=pa-jJPSfDrYYrLkp-M2stw#vo4HuugO8TN1ZJNfVkJzuA\">yelp.com/biz_photos/pros…</a>): This dish was on the 7x7 2012 Big Eat List, and I loved this salad! It was a smaller portion for the price, so I wished they could've given you more lettuce/vegetables, but the cucumbers in it were super fresh and crispy, and I liked the taste of the dressing. Recommended! -Mushroom Soup w/Braised Pork Belly, Soft Cooked Egg (<a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=pa-jJPSfDrYYrLkp-M2stw#X8sZ-oqAbCR13tiTlJ1XLA\">yelp.com/biz_photos/pros…</a>): Deliciously rich! I had to share with the bf and didn't want to part with it. A must order if you love pork belly and soft cooked egg. -Snake River Farms Kobe Bavette (<a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=pa-jJPSfDrYYrLkp-M2stw#DWNEpfqclUkz9WwWe4cxYg\">yelp.com/biz_photos/pros…</a>): Pretty good. The bavette was tender, but this dish wasn't anything spectacular or different like some of the other dishes.   Overall, Prospect has some great food. You are definitely paying for that quality, but I think it's worth the cost. Parking in the Financial District can be difficult to find, but there is some street parking around this area. They also offer a valet service convenience. Service here is attentive but not suffocating.", 
    "review_date": "2013-03-21"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "** Review is for BRUNCH ONLY **  To be honest, it took me a really long time to decide on how many stars to give Prospect.  Heck, even as I type this, weeks after I went there, I'm still not quite sure what to give.  Three?  Four?  Ugh.  I guess that's what happens when hopes/expectations aren't quite met.  After hearing plenty of good things about Prospect, I was pretty stoked to finally check them out with a couple of friends.  Admittedly, I was a little disappointed we weren't going for dinner, but it didn't matter once I got a look at their brunch menu.  Since I've been on a bit of a potato hash kick lately, I went with the Braised Short Rib and Smoked Potato Hash (with Soft Cooked Eggs, Hollandaise with Beef Jus, Shisito Peppers, and Toasted Epi).  On their own, each individual part wasn't anything to write home about.  Combined, the dish wasn't bad (<a href=\"http://www.yelp.com/biz_photos/0Sh-XNVgGDRwiN4K3UEQJA?select=ZiVsUtPCllBRroSwqFJr6Q#H8Eiw39uQHdvtpTfm5AE4A\">yelp.com/biz_photos/0Sh-…</a>).  The chunks of short rib were pretty large (albeit a little dry) and the hash itself was seasoned and flavorful.  At the same time, it didn't enough to set itself apart from other hashes I've tried, and it was really the hollandaise sauce that tied everything together.  Not bad overall, just that it doesn't compare to my favorite short rib hash so far (Mission Beach Cafe).  While my dish might have been more like THREE AND A HALF STARS, I rounded up because my friends were fans of their dishes and I liked the great ambiance and the friendly service.  Between the giant windows and the modern decor, I really liked the vibe of the place - nice, but not stuffy.  Even though I may not have been blown away by the brunch menu in the end, it was still a decent meal, and I'm still curious about checking out that dinner menu!", 
    "review_date": "2012-06-21"
  }, 
  "qqbqyV2zzDRFRhrhOeNvog": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Don A.", 
    "review_text": "Average food. Average service. Beautiful room.   About half way through the meal that feeling comes over you, just like on a date, when you realize you are never coming back, but you might stick around for dessert.", 
    "review_date": "2013-10-26"
  }, 
  "HM6cvh5A9LLBeb4Sca6fPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vic S.", 
    "review_text": "I called ahead and made a reservation with the reservationist, however upon arrival, they did not have my reservation down. We ended up having to wait 20-25 min only to be seated in the bistro part of the restaurant. I was more than annoyed. What's the point of calling ahead to make a reservation if the reservationist was going to mess it up? The manager came over several minutes after we were seated and was very apologetic for the mistake. He offered us drinks and a couple of appetizers on the house. They brought us house made chips and deviled eggs and a couple glasses of bubbly. We ordered a 1/2 dz Kushi Oysters, Roasted Organic Baby Beets &amp; Mountain Gorgonzola Cheese, Whole Roasted Quail &amp; Crispy Pork Trotters, Petrale Sole a la Plancha and the Angus New York Strip Steak. Everything was pretty tasty, especially the quail &amp; pork trotters and sole. My friend thought the steak was ok, liked the one we'd had the night before better. I am changing my rating and giving Prospect an additional star since they made up for the reservation mess up and for a more than friendly wait staff.", 
    "review_date": "2014-08-07"
  }, 
  "xRbBt5MVKZ5-_8HhhfI26g": {
    "user_rating": 4.0, 
    "user_location": "Naperville, IL", 
    "user_name": "Rosemary T.", 
    "review_text": "High class, gorgeous, modern ambiance with a slight twist of classic taste. It's a little hideaway near the bottom of bay bridge. Of course, as expected, the price tag is high, but what else can you expect from any restaurant in SF.   Ordered;  1. Calamari with squid ink pasta - creative Japanese Italian fusion creation, but the pasta is a little taste less while the calamari on top is too salty. I don't think this would be an appetizer to order if you want something to start with.   2. Grill swordfish - perfectly cooked, perfectly season, and the grill taste is profound. It's paired with dirty rice, which adds a perfect texture to the dish. There's also brocollini on the side; my favorite vegetables.   3. Duck - the duck is cooked medium, just the way I like it. Duck sausage came on the side; I like any kind of sausage. The crunchy brussels sprouts pairs perfectly with the texture of the duck. The brussels sprouts has no bitter taste which will change the way you think about this vegetable ever again.   Tip: Make sure you make reservation or there will be no chance for you to get a seat on a Friday or Saturday night; weekdays will be based on luck.", 
    "review_date": "2013-11-09"
  }, 
  "lnisijp0YlSDOty3ywZsvA": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jeri T.", 
    "review_text": "When I'm feeling fat I eat. I make no apologies for my actions and put the blame squarely on my boyfriend who decided to bolt his pretty face out of town. Leaving me to fend for myself I called my long lost gal pal and BARTED my blubberous butt to San Francisco for an early night on the town.  My BFF made dinner reservations which meant we had a table reserved. I arrived early and waited in the bar from my skinny ass bitch friend to walk in wearing her slutty short dress and high heels. This meant I could start ordering every fucking thing on the menu and get a head start on adding more pounds for my boyfriend to love.  The Beef Tartare sounded highly caloric and went with that. BRING ME MORE OF THOSE CRACKER THINGS. I said this in a very nice way to my waiter who was more than happy to indulge.  Finally skinny bitch friend showed up (on time) and looked down at the nearly empty plate of Beef Tartare. YES BITCH I WAS HUNGRY. I do love my friend but she is fucking beautiful and did I mention I am feeling fat?  I was already seated at a nice quiet corner of the bar facing the street so my SKINNY BITCH friend asked if we could just have dinner here instead of the douche-filled dinning room. Though let me add, the douche count was much higher in the bar.  The dinner menu is not offered in the bar for whatever the hell reason but I didn't care and asked the waiter for the highest calorie item the kitchen could throw my way. It was a burger, which are you fucking kidding me it was the size of a fucking slider. Bring me six BITCH. The French fries were served fancy and shit and each time my skinny bitch friend tried to take one I nearly ripped her arm from her socket. STAY SKINNY BITCH.  The burger (though small) was good and still feel bad the bar patrons had to witness me finish it off in two bites. AGAIN BLAME MY BOYFRIEND FOR LEAVING ME THIS WEEKEND. I'll show him by cleaning out his frig. The French fries were a nice complement and a classic one.  This place reminds me of some place Carrie Bradshaw would come to. Loving me some of this.", 
    "review_date": "2013-06-01"
  }, 
  "Ka2VMEwLf_uZuRAxGSRZlg": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mike T.", 
    "review_text": "Went to prospect for happy hour and there were a few things I just wasn't feeling. I felt like the people working here and eating here were very snobby. I ignored it as I was so excited to finally try their food. After pretty much ordering one of everything on the happy hour menu I can say I wasn't very impressed. The fries were probably the best thing so we got two orders. The portions are very small for happy hour so you will need to order multiple if with a group. I would love to give this place a higher review so I might be back to give it another shot.", 
    "review_date": "2014-08-25"
  }, 
  "2EwKOQ_RiypNWM6pUiLfiA": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Kay W.", 
    "review_text": "Read the introduction from The Michelin Guide 2013 and wanted to give it a try. Made our reservation with Open Table and finally tried the restaurant last Saturday. Prospect is a very elegant restaurant with awesome services. We ordered 2 appetizers and split an entrée and a bottle of Haut-Medoc Chateau Larose-Trintaudom 2009.  This place is extremely amazing so I have to write reviews for each of the plates we ordered.  Seared Day Boat Sea Scallops (Charred Eggplant Puree, Tomato Jam, Basil) - Total three scallops with light basil and tomato jam on top and side. It also had a sprinkle of EXPRESSO powder which give that little bit of bitter taste.  Extremely creative and unique.   Wagyu Beef Tartare (Hot Mustard Ice Cream, Capers, Cornichons, Assorted Pickles, Soft Pretzel Bread) - Instand of corn chip, the chef replaced it with his creative recipe \"Soft Pretzel Bread\" with bit of light mustard + the capers and pickles.  I was able to taste the light sourness and it brought out the freshness and tenderness of the raw beef.    Snake River Farm Kobe Bavette (Potato Galette, Buttered Peas &amp; Maitake Mushrooms, Cippolini Onions, Smoked Shallot Puree, Beef) - Steak was sliced in pieces with onions and smoked shallot that makes the dish with a bit of light sweetness.  OMG ..... the potato galette was my favorite because it came in round stacked slices, I'm not sure what the chef puts in there but every bite I took, I could taste the layers of differences.  I don't quite know how to explain this very special taste but you just have to try it yourself.    Bordeaux Haut-Medoc Chateau Larose-Trintaudom 2009 - This bottle was introduced to us by the sommelier, great French wine.", 
    "review_date": "2013-07-26"
  }, 
  "1weX1NNnTFjaRzQHJKhCuw": {
    "user_rating": 5.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Karen M.", 
    "review_text": "I've been here twice now and WOW! Once with co-workers for a work dinner and another time with some friends.  Hands-down one of the best dining experiences!  The ambience is beautiful: the lighting is just right (sensual but not too moody), the design is grand and sleek but not overdone.  The staff is incredible nice and helpful. They also seem honest and are very attentive and have their timing down.  The food: omg. Just incredible. Lamb tenderloin was amazing, the salads are so fresh and interesting but not too busy, the beef I heard was ridiculous, and the fish choices are really right. The drink menu is robust and has personality.  I love this spot. Definitely worth a visit. And the price is right!", 
    "review_date": "2014-02-01"
  }, 
  "C1ccV5ednpSJSL5NKibCOw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "Had the salmon on there lunch menu. It was well cooked prepared well. In retrospect, I think I should have gotten the burger.", 
    "review_date": "2014-09-10"
  }, 
  "XLmCXdAuKhm105fOIc71hw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sandy N.", 
    "review_text": "We couldn't get reservations at Gary Danko so Prospect was our second option.  We left quite disappointed and so did the couples to the left and right of us...  The food wasn't memorable in terms of taste.  The only thing that stood out was how perfectly fried the soft shell crab appetizer was.  The couple next to us thought the portions were too small, and the other couple thought their pork dish was so dry.  I asked for more bread to the bus boy and he acted like I was being a burden to him. He eventually brought more bread but it seemed like it was leftover bread.  They were already cut up and spread apart rather than how it first comes when they bring it to you.  one felt awffully cold and old.  I informed the waitress and she brought more, but still it wasn't the same when they first bring you bread.  Then to top it off, we waited forever for our dessert.  Then finally it arrives, but the ice cream was melted, so I asked whether the ice cream is supposed to be melted.  Obviously it was because it was just sitting at the kitchen waiting for someone to bring it to us.  My fiance was already impatient and said he's not waiting for another dessert.  So we cancelled that order.  At the end the waitress was apologetic and nice enough to give us popcorn to take home.    Unfortunately I will not be recommending or returning to this restaurant.", 
    "review_date": "2014-06-29"
  }, 
  "ZMocFA2lNMJeiKjguUKu7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack R.", 
    "review_text": "The \"prospect\" of going on a date with blue eyes has got me seeing those cartoon bubble hearts.  By date I mean coffee next week, confirmed on calendar, and if you're thinking it's completely one sided then you're right. But I can dream right?  So, I came here to Prospect to splurge on some good food, and to psych myself up.  When I saw the menu, almost all the appetizers seemed to jump out at me, so I decided to make my meal out of a bunch of appetizers.  --Black Truffle Beet Risotto (Creamy, and delicious texture, and not too much dark or sour beet flavor, very mild)  ---Seared Sea Scallops (Overcooked in my opinion but the cashews and eggplant really brought out the flavor of the dish)  ---Sweetbread and Bone Marrow Ravioli (decadent and delicious, one large ravioli)  ---Italian White Truffle Gnocchi (my favorite, very light cream, and a nice helping on mild white truffles to bring out a crunchy texture)  --Chocolate Pistachio Ice Cream for Dessert (Like a nice Chocolate Malt in ice-cream form)  The service was great, and the food was stellar. I really enjoyed their use of truffles and how they combined them with your not so average pasta dishes. The dishes were not overly salty which is always a plus in my book, and all in all, I would like the \"prospect' of returning again.", 
    "review_date": "2014-10-13"
  }, 
  "xOsWBKJeDboYuThphwvSFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis V.", 
    "review_text": "Honestly superb food and service, I had the oysters, beef capriccio, lamb, and duck... every bite was incredibly savory... drinks are fabulous, and the environment is perfect for business to chic date night. Highly recommend going to this sweet spot.", 
    "review_date": "2014-01-10"
  }, 
  "c_eaBRemg6P4eQJlHGQLFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tergel P.", 
    "review_text": "I LOVE THIS PLACE!!   From the outstanding service Down to the fabulous doors that you enter through, this place is five stars all the way. The staff are very nice and attractive and smartly dressed. The food is meticulously prepared. The burger is to DIE for. I had become quite a regular here before I move out of the neighborhood so I will miss it. The vibe at the bar is fun but nice sit down dinners will not disappoint!   Just fantastic.  One thing to mention: if you get cold easily, be sure the sit far away from the door because as amazing the door looks, it is one large piece of wood and closes EXTREMELY slowly. The wind sweeps in and brings a cold chill into the entrance and the bar. So if you plan on staying at the bar, bring a jacket.", 
    "review_date": "2014-01-31"
  }, 
  "JoSzj9gd56zXaIORM7TbJA": {
    "user_rating": 5.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Chris P.", 
    "review_text": "This place is awesome.  Aside from the already incredible food the service you receive here is excellent.  I are here for lunch and sat at the bar.  The restaurant is very clean and the wait staff is well trained and very professional.  If you want great food and superior service come here.", 
    "review_date": "2014-03-28"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "This was my pick for our small holiday team dinner.  FIrst let me warn you NOT to try and have a cocktail at the bar durning the holidays - nightmare crowded, while the dining room took a while to fill up.  This was being paid for by the company - so I was all in for \"full ordering\" app, entree &amp; dessert.  I love scallops - that was my app, good, but served too cool. I got the most expensive entree, the steak, which was cooked to my liking but frankly a little tough, the potatoes with the melted cheese were great - but not enough of them, The waiter came by about 5 minutes in and gave me 2 small potato skins, said the chef had forgotten them.  We spilt 3 desserts, the snikerdoodle Ice cream sandwich ( the best) the egg nog ice cream profiteroles, and the warn sticky toffee pudding cake (which was oddly served with clementine segments and granola - which I just thought was a bit odd.  All in all - glad I came - but not nearly as good as its mothership - Boulevard.", 
    "review_date": "2014-12-21"
  }, 
  "c-pnORQO-uUnab-j4clObw": {
    "user_rating": 3.0, 
    "user_location": "Frankfurt, Germany", 
    "user_name": "Evelyn C.", 
    "review_text": "Let's say 3.5 stars.   Stellar service, both at the bar and at the table. Appetizers were good; my friend and I shared a seared mushroom appetizer (I forget which kind of mushrooms) and the California burrata.   Entrees, she had the Bavette, which was a skirt steak, and it was perfectly seasoned and cooked. In fact, I preferred her dish to mine.... I ordered the pork chop, which our server recommended, but I thought it was meh. Didn't finish my dish.  We then figured might as well try the dessert too because, well, it's dessert and we both love eating. Ordered the banana ice cream sundae because the description reminded me of banoffee pie I had in London five years ago that I still dream about once in a while. It was good, but wasn't amazing. We also ordered the house-made caramel popcorn--also good, but not amazing.   I've had better food for the price we paid. So, in conclusion, great place to grab a drink after work but food-wise, I'd recommend going elsewhere.", 
    "review_date": "2013-06-21"
  }, 
  "151vkMhsCv6GD30To2Rn-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul R.", 
    "review_text": "Prospect  I had dinner with my lady there a week or two ago. The food was delicious and the ambience was perfect.  Our server, Jason, was what made the night special.  (keep in mind, I did not know Jason before this night, and I work in the biz, so I know a good server from a bad one) ... Jason knew every detail about our food and our wine.  He was johnny-on-the-spot and we never had to wait for ANYTHING.  His suggestions were perfect, and the combinations were stunning.  Terrific choice is you are into flavor and romance.  Thanks Jason!  Thanks Prospect.    PS:  They even had a custom menu for my girlfriend waiting on her, since it was her birthday!!!   She is still talking about it.", 
    "review_date": "2014-06-16"
  }, 
  "D-rKFBb1s4_4vpDA9Wjiog": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "Went here on a business lunch and was pretty impressed.  I got a bisque, and a fried chicken sandwich.   The fried chicken. Sandwich was really good.  I hope to go back here sometime soon.", 
    "review_date": "2014-03-22"
  }, 
  "kZzwW0hGHZo00PS2gWFmYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick C.", 
    "review_text": "Came here expecting good food and service.  Came here and got great food and awesome service.  The staff was very attentive with attention detail.    Food wise...  Wagyu tartar and kona sashimi to start....but what really knocked my socks off was their filet mignon.  WOW!  Just amazingly cooked with great seasoning.  It was just a well cooked steak that tops probably one of the top steaks I've had...enough said...I think I may go back tonight just to have it again...I think it was $50...well spent...", 
    "review_date": "2014-01-09"
  }, 
  "sC8a0ed-IMHmN92ik9psXQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ellen F.", 
    "review_text": "My friends and I went to Prospect last night for dinner.  While I absolutely loved the Heirloom tomato Gazpacho and the ravioli with truffles and hazelnuts, the service was so slow.   Whether I am at the bar, having brunch or dinner at Prospect, consistently, the service drags.  Ironically, when it was time to remove our dishware and utensils from the table, the service was very prompt.  The servers could take a few lessons from the pick up crew.   Also, the acoustics are pretty bad.  If you are intending to have an intimate discussion with someone, this probably is not your place.   We arrived during rush hour.  Thankfully, they have valet parking taking the stress out of finding a parking spot battling a bunch of harried commuters.", 
    "review_date": "2014-08-06"
  }, 
  "o3XBMn3b0KUg97qJ5-Q8aA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Nguyen L.", 
    "review_text": "Thank goodness Prospect came through. Otherwise my weekend of eating would have been ruined. Great cozy atmosphere. This restaurant has longed been on my list to try by I finally got a chance to try it now.  DRINKS:   Spicy Margarita (off the menu) - It was SPICY and just what I needed.  Wines by the glass are very reasonably priced.  STARTERS:  Baby Beets, Peach Farm Figs &amp; House Cured Duck Prosciutto - Fresh beets with light flavors of manchego cheese sprinkled on top. The one thing that made the plate was the pistachio brittle. I am used to a fig, beets and prosciutto combination but the brittle added a nice sweet flavor and texture to balance the salt of the prosciutto.   Monterey Calamari &amp; Potato Ravioli Nero- Slightly sweet but perfectly flavored calamari. The Ravioli  added a nice touch to the dish.  Seared Sea Scallops- Perfectly seared and salted scallops. The citrus from the vinaigrette complimented the ssubtleness of the thai curry broth.  Poached Local Petrale Sole- great piece of fish. They couldn't have cooked sole any better. Wasn't chewy and tough as most places and the flavor was on point.  Crispy Skin Local King Salmon (Wild) -  Probably one of the best cooked piece of Salmon I've ever eaten. That's saying a lot since I don't order fish very often at restaurants because most of them cook it wrong. I could eat this dish over and over again. You can taste ever flavor of the fish without any of the fishy smell.  Snake River Farms Kobe Bavette \"au Poivre\"- Just a good piece of meat cooked medium rare. Crusted with peppercorns \"au poire\" and plated with broccoli rabe. Put the rabe, meat and mushroom and you have the perfect bite.  DESSERT:   Butter Brickle Icebox Cake - very rich and I figured out why when I asked the waitress. It's because it's made with cream cheese. It was slightly on the rich side. I could only eat a couple of pieces.  OVERALL:   Great restaurant with good service. It was quite busy that night so I had to search for the waiter a couple of times to get a drink order or to order my dessert. Wait staff was really friendly and helpful. If you aren't sure which wine to get the sommelier is very helpful and will suggest a great wine that won't break the bank, like some other places.  PARKING:  Valet or there's is also metered street parking.", 
    "review_date": "2014-08-20"
  }, 
  "c37-gTr0L0SytSlAuYOjKg": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Jay C.", 
    "review_text": "Contemporary Californian restaurant in SoMa. Vibe is modern and hip. Many diners were young people out having fun. Much cooler than the old Boulevard. Overall, portions are small and it is encouraged to order 2 or 3 dishes (appetizer, main, and something else) to get a taste of what Propsect offers.  Bread service: nice crunchy bread with butter. bread was delicious.  Here are the dishes that we tried:  Local sand dab [$15]: it was stuffed with dungeness crab, upon crispy fiorelli squash blossoms, and sweet red pepper puree. Presentation was superb (see pictures). It was like a painting. Fish was crispy and had much flavor. Surprised that it was stuffed so cleanly with crab meat. Red pepper puree offered a tinge of sweetness and the kick that the sand dab needed.  Ahi tuna tartare [$15.5]: came with miso aioli, ginger, radish pickles, and spicy tiny popcorn with furikake. A Japanese inspired dish, furikake usually goes over fish as a natural flavor enhancer. The popcorns, which came at the end of the meal, were sweet, crunchy, and surprisingly good. It was fresh and gave the tuna a dessert-like quality. An excellent dish.  Maine lobster &amp; prawn salad [$17.5]: came with lobster aioli, lemon cucumber, brokaw avocado, sungold tomatoes, and watercress  Seared day boat scallops [$16.5]: immersed in a spicy coconut lime soup (tasted like a tom khar from a Thai restaurant), shiitake mushrooms, basil, and cilantro. Really impressed by the flavors in this dish and the freshness of the scallops, which were bouncy and seared perfectly. I just wish they didn't use day boat ones, which were small. At the end, I sipped up the soup, which was smooth and hearty. Recommended.  Caña de cabra goat cheese, truffle and beet ravioli [$16]: came with shaved summer truffles, parmesan, and chioggia beet relish. This dish was good. The texture of the ravioli was al dentea and firm. I wish the immersion of flavors into the pasta came through more. The inside was filled with goat cheese, while the outside had beets to provide some contrast.  Snake river farm kobe bavette [$30]: great slices of beef, though not worth ordering, in favor for ordering a variety of small dishes  Dessert course:  Dirty girl strawberry and pistachio tart [$9.5]: came with balsamic strawberries, almond cake pistachio mousseline, and frozen sour cream. This was amazing. The frozen sour cream which was creme fraiche went well with the crunchy, sweet, slightly sour strawberries. The tart was delicious, gritty, mildly sweet and toasty.  Chocolate mousse: great rendition and nice end to the meal.  It's restaurants like these that create an impression upon someone to make them return soon. At the end of the meal, we got those bags of popcorns as physical evidence and reminder of the great meal and experience.", 
    "review_date": "2014-11-05"
  }, 
  "jqNc2uvQlpbsxNn2dt2TpQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "E S.", 
    "review_text": "The food and service was solid! Portions are good. Not mind blowing but definitely a place I would go again and again.", 
    "review_date": "2015-02-01"
  }, 
  "SI0B9MRW_x3O9ua-L3gvPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stella J.", 
    "review_text": "I had dinner here for my friends graduation dinner and it was fantastic! Serve was impeccable and the food was amazing!  Berkshire pork hop: 5/5: this was my bf entree but I had some and I have to say it was one of the best pork chops I've ever had! It was incredibly juicy, well seasoned and delicious! I could've eaten his pork chop and given my entree to him. So good, it's a must try!  Black bass and lobster: 4/5: this was delicious! I loved that it came with a sauce on the side and it enchanted the flavor of the dish. The lobster was perfectly cooked and tasted sweet! The bass tasted a little fishy but was ok. The portion felt small for an entree. I would have preferred the pork chop over this.   Total for 4: $150", 
    "review_date": "2015-01-05"
  }, 
  "2Q8Mm4ZMCV_fw-mWJ72ZQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Snuffles B.", 
    "review_text": "Boulevard was a wah-waaaahhhh letdown, but this was not. Lets face it, sometimes younger siblings just do it better - inheriting the lessons learned from mistakes and the tools of how to succeed, but without the growing pains - and with a fresher perspective.   Atmosphere - So much less stuffy (both spatially and atmospherically) than Boulevard, a bit businessy to cater to the SOMA/FiDi crowd, but by no means too sterile.   Service - Under the radar = very good. Stealthy.  Food - Artichoke Truffle Risotto, Fennel Blood Orange Salad, Petrale Sole, Duck/Farro - TASTY, all of it. Good lookin' to boot.  Damage - ~$60-80/person  I know the neighborhood is Le Snore, but its worth the visit.", 
    "review_date": "2014-05-07"
  }, 
  "1ziPC7yx27Ps_m0MzN2OxQ": {
    "user_rating": 3.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Cindy C.", 
    "review_text": "The service is GREAT.  I would say, 5 stars all the way.  The food is pretty good, but don't order the chicken ~ it was dry.   Definitely would be 4 stars level if each dish was just a few dollars less...   The drinks though... Well, I had the Prospector... and what a disappointment!  I felt that it was very watered down.  You would think that the namesake drink would be a nice one... We stuck to wine for the rest of the night.   Overall, love the ambiance... So, 3 solid A-OK stars!", 
    "review_date": "2012-11-29"
  }, 
  "CEZba-8-dLW5z0DsjhUwzw": {
    "user_rating": 4.0, 
    "user_location": "Napa, CA", 
    "user_name": "Brianna H.", 
    "review_text": "The husband and I dined here last Saturday. They're doing it right at this casual version of Boulevard (Nancy Oakes powerhouse of a restaurant). The local and fresh ingredients impressed me- just as they do at Boulevard.   The service was great and friendly. The food was well-executed. The interior is modern, tasteful, and the vibe was great. We enjoyed drinks and small plates- sharing each to ensure we could try a little bit of everything.   The boy loved the Calamari but the Scallops stole my heart. Abalone was delicious- the salsa really brought out the flavor. The bread pudding was SO good, highly recommend.   We liked this trendy but unpretentious spot. Definitely heading back with some friends in the next few months.", 
    "review_date": "2013-10-31"
  }, 
  "Er0kE7OHyO5GxeKWthYlCA": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Celia K.", 
    "review_text": "A group of friends and I had very last-minute plans to come here on a Friday night and were still able to make a same-day reservation through oh-so-convenient OpenTable. Having lived in the Bay Area for all of my life (excluding college) and having never heard of Prospect, I wasn't expecting much from this place. I honestly thought that it would be just another expensive but satisfactory restaurant in downtown San Francisco. Wow, I was so wrong.  The inside of the restaurant is really modern, with tall ceilings and glass walls facing the street. Ambiance here is dim and feels a little luxurious while not overly fancy; it's great place for any occasion, whether it be an intimate date or a social get-together with a group of friends.  APPETIZERS - Wagyu Beef Tartare: This was surprisingly different from other tartares I've had before; it kind of reminded me of an ahi tuna poke, except with wagyu beef. Pretty refreshing. - Seared Day Boat Sea Scallop: Mmmm the scallops were cooked perfectly--crispy on the top, and soft and tender on the inside--paired with a nice flavorful sauce. - Seared Monterey Abalone with Crispy Pig Trotters: I still have no idea what a pig trotter is, and I don't care. This appetizer was my favorite. It comes with this green foamy soapy-looking sauce, which is also a mystery to me, but it pairs very well with the abalone and pig trotter. My only gripe is that it's so good yet the portion is too small to share amongst 4 people!  MAIN ENTREES We ordered the following entrees:    - Berkshire Pork Chop    - Snake River Farm Kobe Bavette    - Liberty Valley Duck &amp; Lightly Smoked Sausage    - NY Strip Steak All of the entrees were dressed with various vegetables and sides, and each component of all the dishes was packed with flavor. The stand-outs to me were the kobe bavette (partly because it comes with barley, yum!), and the pork chop, which was surprisingly moist and tender.  DESSERTS At first I was a little disappointed because I wanted to try the ice cream sandwiches mentioned in a lot of Yelp reviews, but I'm so glad we decided to order desserts anyways because we discovered something pretty great here, which is... - Chocolate Praline Bonbons with Valrhona Fudgesicle: I think this was one of the best desserts I've ever had because it has so many different components, all of which were spectacular. So many different textures--crunchy, crispy, soft, icy--like my cousin would say, it's like a party in my mouth! - Salted Chocolate Caramel Tart: This dessert was also really good, especially the soft, warm cookie, but unfortunately the chocolate bonbons and fudgesicle dessert stole the show. Still, this one is definitely worth getting.  DRINKS On top of all the great food and desserts, Prospect also makes really good drinks! Among us, we had the Il Terranova (mild and great for people with low alcohol-taste tolerance), I Am D.B. Cooper (super spirited!), Prospector, and Domino Effect. My friends and I ended up liking our first round of drinks so much that we ordered 2 more rounds, and each of us stuck to our original picks!  Prospect completely exceeded my expectations, and I would definitely recommend giving this place a try. The tab can rack up pretty quickly especially if you also order drinks, appetizers, and desserts, but it's absolutely worth it. I can't wait to come back, and I'm constantly trying to find an excuse to dine here again.", 
    "review_date": "2013-11-19"
  }, 
  "NDw3ViA756mSTMV2HQeobQ": {
    "user_rating": 2.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Alex B.", 
    "review_text": "the food is totally disappointing, especially given its credentials and the lofty price. even with the straightforward menu the dishes still fail. from the apps to dessert, the quality was on a downward spiral, capped off by a watery espresso. yech! any restaurant of this caliber should know how to serve proper coffee. the only saving grace is the friendly and efficient service, plus the venue is superb, modern, spacious, and comfortable. I really want to like this place but it didn't happen. the kitchen badly needs an overhaul to do justice to this restaurant.", 
    "review_date": "2014-11-06"
  }, 
  "qurv1eJZswxUZaZqN53Meg": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Kristie C.", 
    "review_text": "Yummy food with good service, couldn't ask for more:  Main:  * Grilled endive + burrata salad: perfect texture, perfectly marinated endive. went super well with the hazelnuts * Grilled swordfish: perfectly tender and perfectly marinated. wasn't dry or fishy at all, very moist and delicious with the wild rice pilaf on the bottom  Dessert: * Chocolate caramel tart: a bit too sweet for me, caramel was too soft * Concord grape sorbet: too sweet as well, wasn't a very light dessert. not enough rich grape flavor unfortunately  Great place for a kinda fancy but not too fancy dinner, would definitely come back.", 
    "review_date": "2013-11-11"
  }, 
  "i8f4xCY6YCXhziG-6JEJlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carrie Y.", 
    "review_text": "This is one of my favorite spots for happy hour and brunch. Tasty drinks at great prices. I've also come here for dinner a few times.  I've had:   - Crispy pig trotters: delicious! I ALWAYS order this every time I'm here.  - Pork Chop: Loved it. I've ordered this 3 times. It's always juicy and flavorful.  - Deviled eggs: always good - Duck liver mousse: great if you're a fan of pate  -  Wings: there ok - Fries: Can never get enough - Ice cream sandwiches: Not a fan because I do not like peppermint in my dessert.   And a bunch of other things that I can't remember. But, I've never been disappointed with anything I've ordered there (except for the ice cream sandwiches)", 
    "review_date": "2013-10-05"
  }, 
  "TTFRSSq3rpEyNMVJOafpew": {
    "user_rating": 1.0, 
    "user_location": "Glen Ellen, CA", 
    "user_name": "Lanya Z.", 
    "review_text": "I have been a customer for years and even had our company party at Prospect three years ago in the private dining area. It WAS a great place, incredible staff and so welcoming.  THAT CHANGED two days ago, Thursday 12/18 around 9:20pm.... We went there with a group of 10 people, I had called Amanda to reserve a table in advance. Then when we arrived, we asked to sit in the bar area, have drinks and apps. When the gentlemen came to offer us menus he promptly said, 'I will serve you food but not alcohol,' What? Are you serious? I was completely dumbfounded. What transpired after that is beyond comprehension. I have NEVER seen such incompetence from the manager/GM. They said to our friend, who lives next door and frequents this place regularly, that they wouldn't serve us because someone smelled like alcohol. What? What does that mean and no one was intoxicated, perhaps 1 or 2 had a couple drinks, call that buzzed but not drunk. We left, of course. We were all beyond livid. Then as if that wasn't enough...the minute we left I looked in the window and the GM WAS LAUGHING, laughing with her staff. Prospect has not only lost a long-term customer, I will make it my mission to let others know the kind of treatment you can expect. I'm sad to see such a great place become my least favorite in SF.  AND...all you had to do was show some decency and respect, seemed relatively simple, no?", 
    "review_date": "2014-12-21"
  }, 
  "VTzxYNnfZYSisfkv05JMsg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cameron S.", 
    "review_text": "I'm torn on this one. The service was excellent, as was the ambiance and really the whole experience. Each bite of the well-prepared food was delicious and a treat. However, we spent a ton of cash and left hungry. That's kind of hard to reconcile. I get that you don't want to stuff yourself in fine dining, but dang. The tater tots and tacos we had about two hours later tasted pretty good, too, and didn't make me worry about my budget for the rest of the month. Try filling up on the bread?", 
    "review_date": "2014-12-03"
  }, 
  "F_5_UNX-wrAFCXuAkBZRDw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rodney H.", 
    "review_text": "If it wasn't for One Market being fully booked on the last night of Dine About Town, then I probably wouldn't have dined at Prospect which was right around the corner.  After walking around SOMA browsing at menus from other restaurants in the area, Prospect had one thing that caught my eye and was also something I would've ordered at One Market - Liberty Valley Duck Breast.  Because I was dining solo, it was somewhat easier for me to get seated right away.  I loved how the hostess was able to accommodate me by having me sit at one of their small bistro tables by the window.  It made for great people watching while enjoying my meal.  So let's get to the food.   Liberty Valley Duck Breast ($31)  w/ added Pan Seared Foie Gras (+$15) Black &amp; Red Quinoa, Chard, Pickled Baby Turnips, Bing Cherries Walnut Brittle, Cherry Infused Duck Jus. (<a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1dj3OFa&amp;s=059eb6cb120092d44bff0510e756888212521dfd49ec87cf96db82ffa5ee3167\" rel=\"nofollow\" target=\"_blank\">bit.ly/1dj3OFa</a>) The entree was art indeed.  When it was brought to my table I didn't know where to start because it looked spectacular!  And since the California ban on Foie Gras was closely approaching (two weeks later), I decided to splurge a little and added it to my Duck.  And they gave a very generous portion of it and it was very good and complimented the Duck Breast very well.  The Duck Breast itself was very tender and had a lot of flavor, especially when put together with the walnut brittle, black &amp; red quinoa, and cherry infused duck jus.  It was definitely was a carousel of flavors!  After my dinner entree, I really was done but then Katie, my waitress, showed me the dessert menu, I figured \"what the hell\" and decided to satisfy my sweet tooth.  Apricot Cake ($9) (<a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F16vnXAf&amp;s=f262721ab386237fd98324681ab8273bb8d3315dc1ed3c729bbaaf97b98c2b2c\" rel=\"nofollow\" target=\"_blank\">bit.ly/16vnXAf</a>) This particular dessert was chosen by Katie, my waitress.  I can't remember off hand what the ingredients were, but I can tell you this......with the cake, berries, and ice cream, the whole thing tasted like a glorified Twinkie!!  Service couldn't have been any better.  Katie was exceptional and very friendly!  And she was always there to check on me even on a busy Friday night.  Overall, I'm so glad that I was able to dine here instead of One Market.  According to my friend, it was a huge upgrade in terms of food, service, and atmosphere, and he was right.  I would dine here again for any occasion whether it be for happy hour, date night, or just for solo dining.  And If you know me from my reviews, I'm huge burger fan and I heard their \"Secret Burger\" is a definite must-try.  So that will probably be what I'll be ordering on my next visit.  I'll be looking forward to it!", 
    "review_date": "2012-07-24"
  }, 
  "0gUPvQ4NZmIHKghEXIBp9w": {
    "user_rating": 5.0, 
    "user_location": "Evansville, IN", 
    "user_name": "Destini M.", 
    "review_text": "My new favorite in San Francisco. :) It's pretty much everything you'd want and expect from an upscale restaurant and I seeing as I usually rate restaurants by how well they cook their scallops, they get a Michelin star from me as they were the best I'd had in a while.  I ordered a Kobe steak medium rare which was cooked perfectly if not necessarily substantial, but everything served with the dish complimented it beautifully.  Also, can I just say the tall windows in the dining area get me every time I look at them? Such a lovely nighttime view of the city!", 
    "review_date": "2014-10-16"
  }, 
  "51p6NYvYdMEVZpt2opPtQA": {
    "user_rating": 1.0, 
    "user_location": "Novato, CA", 
    "user_name": "Kim D.", 
    "review_text": "First, let me start by saying I book A LOT of reservations, so I'm pretty familiar with good customer service vs poor customer service.  There are plenty of great restaurants in this city, so there is no need to settle for less than standard service.  I made a reservation for a party of 7 for a business dinner to be held this week.  The restaurant called 2 days before my reservation to confirm, and since not everyone in my party could make it, I communicated that a reservation for 4 was only needed.  Less than 24 hours later and 24 hours before my reservation, one of my guests changed his plans so he could make dinner. Great!  Except for when I called the restaurant, they could no longer take my party at the scheduled time and then said it \"would be tight\".    The hostess tried telling me that I didn't understand...I replied that I was being penalized for telling the truth when they confirmed my reservation the previous day.  I could have just left it and had the restaurant sort it out upon our arrival...I told her I would be looking for another place...her response?  \"that's probably for the best.\"  Wow!  This place has got to be one of the most arrogant in the City!  Apparently, they don't need business. A party of 5 at that!    Do NOT book a reservation here.  There are too many great place to settle for an obnoxious, arrogant restaurant who doesn't care about accommodating customers.  I was a fan of Prospect, but I won't be coming back and I sincerely hope the owners and GM read this post.  You should be aware of how your guests are treated.  Poor taste, Prospect!!", 
    "review_date": "2013-04-24"
  }, 
  "ZS3rm1oEBemg9-5o2sjauQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria C.", 
    "review_text": "Happy Hour from 12-6 is always a great time with many small bites to choose from: spiced dusted fries, brussels sprouts, deviled eggs, ahi tuna tartare, wings, and hummus &amp; crackers to name a few. Bar food service begins at 4:30 but drinks are always available.   Having been here at least two dozen times I can attest that the service is consistently accommodating and timely. It's usually packed with business folk on weekdays and weekends are a bit more relaxed. One thing is for certain; the food and service are consistent, innovative, and fresh with a modern twist;)", 
    "review_date": "2013-12-04"
  }, 
  "IlPijYQmsU_kkdcYs3Ajug": {
    "user_rating": 5.0, 
    "user_location": "Union City, CA", 
    "user_name": "Riz P.", 
    "review_text": "My husband took me to Prospect in celebration of my __th birthday.   This place was AMAZING...  1. They greeted me HBD when I walked in. 2. I had a custom menu that said Happy Birthday. 3. Everyone that waited on us knew it was my birthday and ALWAYS said HBD. 4. Waitress was very knowledgeable of food and drinks and gave great recommendations. 5. The Prospector $12 was super strong, but REALLY REALLY GOOD. I killed it. 6. Ahi Tuna Carpaccio was so delicious... Wish there was more of it! 7. Salmon with crispy skin was TO DIE FOR! Hubby had the steak and he said it was done perfectly. 8. Clean bathrooms. 9. Great ambiance and vibe all around.  I'll definitely be back!!!", 
    "review_date": "2014-06-24"
  }, 
  "hl6oVSJSnxu8Ni6TPxcuyA": {
    "user_rating": 4.0, 
    "user_location": "Bay Area", 
    "user_name": "Jamie Y.", 
    "review_text": "Great food, great atmosphere and would definitely hit up the happy hour!  I had a great valentine's dinner here - tried the Sea Scallops and Dungeness crab salad for appetizers.  The scallop was seared perfectly. Perfectly seasoned and is totally to die for.  For entree, I had the free range chicken with truffle and mashed potatoes on the side. This was also delicious!  Topped it off with 2 glasses of wine ;) Perfect night!", 
    "review_date": "2013-03-01"
  }, 
  "md4PajIMvEOV5kMZFciIvQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Amanda G.", 
    "review_text": "I've heard great things about Prospect from my friends and family up in San Francisco, so when my dad asked if I wanted to head over for a family brunch I couldn't say yes fast enough!  One of my favorite things is the proximity to our spot up in the city - places in walking distance get brownie points with me for sure :)  I tried the waffles topped with berries, and of course - a bloody mary (very, very hard to say no to something so yummy!).  The waffles were light and fluffy, and for once I actually managed to eat all of them off my plate!  The fruit was fresh - not too squishy and full of flavor.  The staff were quick and kind the venue itself is great!  I absolutely loved looking at their pieces of art; but the bill is a little steep and the portions can be a little smaller than expected (not for me, but on other dishes I saw).  I'll definitely be going back, but most likely just with the family.", 
    "review_date": "2011-07-08"
  }, 
  "cz9gAFAcXbcjkBSrNbGEXw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Keith L.", 
    "review_text": "Nice modern space.  Definitely an older crowd, which was kind of surprising, given the area.  The food was hit or miss.  Don't bother if you're vegetarian.   I called ahead to make sure that there would be vegetarian option.  The hostess said that would be no problem, and that she would alert our server who would then list their vegetarian options.  When we got there, the server had no clue and said the chef could \"though throw something together.\"  Well, he wasn't joking.  What came out for an entree was a plate of vegetables priced at -- get this -- $22.  Just vegetables.  Nothing else.  The next day or so, I called the speak to the manager and left a very polite message, but never heard back from him/her.  Lame.  The other five diners were carnivores, and the overall consensus was that their food was decent but that they wouldn't come back.", 
    "review_date": "2014-09-12"
  }, 
  "3PThFhwBwI8xnGCrFQ467g": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Aparna R.", 
    "review_text": "My husband took me here for our anniversary. simple loved the food and we were lucky to get some chefs sample. I ordered duck meat and was blown away with how well the food was made and served. Excellent service and we were so happy to have made this choice", 
    "review_date": "2014-05-15"
  }, 
  "E-wZHRXJbHFgjraopz-1LA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zeenat H.", 
    "review_text": "Great food. Great cocktails.   It definitely has an interesting vibe- not your typical SF restaurant. First of all, it's huge. Secondly, it has that hotel restaurant feel ... but somehow I don't mean that in a bad way. It just seems very corporate for SF. The crowd seemed a bit older and more monied, but plenty of younger couples as well. But like I said, the food and the drinks speak for themselves. Service was excellent. Overall, an amazing experience.  Definitely pricey. Be prepared. I think worth the money though.", 
    "review_date": "2014-02-20"
  }, 
  "tUyfzOVZ8L1myTmQFYfxFA": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Kim L.", 
    "review_text": "I had made an 8:45 reservation here for a party of 10 for my friend's bachelorette dinner on a Friday night.  We weren't seated until 9:20 due to an earlier party that was finished but was still sitting at the table.  I understand that things like this happen, and the restaurant certainly can't ask paying patrons to leave, but we were all a little grumpy (and hungry) before being seated.  Thankfully, the food, drinks, and service after we were seated made up for the poor first impression.  DRINKS -Cocktails are all $12.  Expensive, but expected. -My hands down favorite drink of the night was the \"I Am D.B. Cooper\".  If you're a fan of Old Fashioneds, it's a nice and very drinkable twist on a favorite!  FOOD -We ordered the Green Goddess salad (simple, but delicious) and a morel mushroom special as appetizers.  It was my first time having morel mushrooms and it won't be my last... they were rich and absolutely delicious! -For my entree, I had the duck breast served with braised duck-stuffed cabbage and smoked oat risotto.  I'm a huge fan of duck, so the fact that I got to have it twice on one plate was amazing!  Other than our table, the crowd was a bit on the older side, and the atmosphere is definitely upscale and a smidge stuffy.  The food is just amazing and was definitely the highlight of our experience.  I'd definitely recommend Prospect for a special occasion or a date - but maybe not for a girl's night out.", 
    "review_date": "2014-05-14"
  }, 
  "gfyW0vuJls8ARoHmogfcmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marilyn T.", 
    "review_text": "I've been wanting to come here for a while.  The space is beautiful with simple neutral colors, high ceilings, large windows.  The restaurant itself is actually pretty low key.  As for the menu, it's more Californian with no tasting option.  We ended up with a bottle of wine, but the cocktail list looked really appealing.  We started with a wagyu beef tartare that was probably one of the most creative ones I've had, served with a spicy mustard ice cream, which mixes in really well.  There was crunch and tartness from the cornichons and capers, and it's all spread on warm pretzel bread.  There was also a truffle tagliatelle with light summer flavors (squash blossom pesto), but it was under-seasoned for my tastes.  As for the special roasted chicken breast of the day, it was cooked just right without being dry.  The beans underneath were a nice accompaniment, and it was presented nicely.  The highlight of the main courses was definitely the pork chop - well seasoned, topped an apricot relish to make it a lighter dish. The okra croquette was also creative and just the right amount of fried goodness. This would definitely be my recommendation for the night.  As for dessert, we had a strawberry and pistachio tart with creme fraiche ice cream and strawberry ice cream.  It's a good, lighter dessert for summer, and there are lots of textures with the nuts and other crunchy bits.  It goes well with espresso.  Overall, food was awesome (wagyu tartare and pork chop).  Pacing was good.  Prices are reasonable, and it's not stuffy at all despite that most of the crowd was on the older side on a Monday night.  Warning: the area is not ghetto, but my car was parked right outside on Spear near Folsom around 7:30-9pm, and the back window of my SUV was smashed (I had the trunk cover on covering the contents, and no I did not place anything in the trunk after I parked).  There are plenty of people walking around, and it wasn't that late, but you never know in SF :(", 
    "review_date": "2013-08-08"
  }, 
  "5aCEquYmXUIsWmpUp1gqxA": {
    "user_rating": 2.0, 
    "user_location": "Albany, CA", 
    "user_name": "Kathleen W.", 
    "review_text": "I've been here several times because my friend lives in the high rises around the corner ... when I need a late night bite, I hit up a taco truck, he comes here and throws down $25 on a burger.    We gathered here the other night with a friend in town for drinks and eventually dinner.  Service was a bit scatter brained and inconsistent (a few of us got plates ... the rest of us didn't until 10 minutes later).  Some of the appetizers they ordered didn't seem right (much too spicy to be the peppers the menu claimed them to be).  We ordered desserts and all of them were just put in the middle of the table (i don't like sharing my dessert!)  But boo boo boo to getting food poisoning from the burger.  I ordered medium, got medium rare and couldn't even return it b/c the lady never came back to check on us.  I felt so sick that night and the next day ... and it was validated that it was the food here b/c 3 other friends also got sick.  Luckily the one that lives around the corner didn't, so he will be back ... but not with me.", 
    "review_date": "2013-10-04"
  }, 
  "4wooaHkthPXYPektXIPkBg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate M.", 
    "review_text": "Had a girls dinner here that I planned and was SUPER excited to try this place. The pre-dinner cocktails were nice and holiday themed which was a lovely start to the meal. The service was pretty good - but the server did seem to hate her job. The wine was top notch. The food had some issues, some of which I will list here: 1. Apps came in all different sizes so one salad served one and the other salad was for like three people. This is fine but we had no idea so ended up with a lot. The polenta truffle app was possibly the best thing. Devine! 2. Some of the food was cold and it was all very salty. 3. Generally, components of the meal were great but overall it fell flat. 4. The lobster was perfect, the bass was meh. We were there on a Thursday, so I assume that would be the A team in the kitchen. I was a disappointed.", 
    "review_date": "2014-12-20"
  }, 
  "ai_QVBxHzT2nqnGN6IpEAA": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "Cara D.", 
    "review_text": "This meal was amazing!!  We brought a very nice bottle of wine from Napa to share and it accompanied the meal very well.  We shared appetizers and mains - mine was the duck three ways and it was superb!  Cooked perfectly medium with greens that played perfectly with the flavors.  The service was good.  I like the European way of dining where your meal is drawn out and you get to take your time, but our server took very good care of us and once we expressed our need to relax and go slow, she accommodated us.  I would love to go back to Prospect for the brunch menu - oh, and dessert!!", 
    "review_date": "2014-07-12"
  }, 
  "9vXS2ZxfQDHmDRerQ-l9vA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn M.", 
    "review_text": "This is my last review for Prospect and the last time I will ever step foot in what I would classify as one of the worst restaurants in San Francisco.  I have already written one review and seriously question the ownership and hiring of the incapable staff I ran into on thursday night (12/18). We showed up with a group of 10 people for dinner and have never been treated so poorly in my life. We had reservations for 10 and waited in the bar where we were informed we could not be served due to some people being \"intoxicated\" by Kaeka who was one of the top 10 worst service workers I have ever seen. Our situation was then escalated to the manager, Cathy, who tried but was so indecisive and turned it back on me saying I \"smelled like alcohol\". Hmmm, I told her I just had a holiday cocktail party at my place next door...so of course I did (a few glasses of wine now gets you on the do not serve list??).  Most of us had a couple glasses of wine and were refused service!!!!   Yes, at 9pm, after a couple glasses of wine, we were refused.  Not one person acted out.  I can't say again how pathetic both Cathy and Kaeka were.  Smelling my breath and refusing to serve our entire group???  Are you kidding???  ....at 9pm during the holidays?  I think she needs to get off her pedestal and stop playing GOD!!!!  Cathy, you don't deserve to be in the service business!!!  The group of 10 of us walked to Ozumo and ended up taking out $1500 tab elsewhere.  I can't stress enough....STAY AWAY!!!!!!   There are way better places in SF.  They only reason I went back is the convenience of being next door...not any more.  I will put in the extra effort to avoid ever having to speak to people like Cathy and Kaeka.  Happy Holidays to us :)  Here's to hoping Prospect changes ownership and hires a real staff.  The last time I wrote a review, they fired the employee in question....lets hope that happens again.", 
    "review_date": "2014-12-20"
  }, 
  "OqAQxKyjVZwHChV2uDVttg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Larry G.", 
    "review_text": "Overall this place left me feeling meh.. I don't know what all the hype was about. Yes, the restaurant was beautiful but the food lacked flavor. Prospect is a fine dining restaurant with your typical tiny portions.. I'm fine with expensive tiny portions but the food should at least taste good, not bland. I went with a group of people from work so we basically ordered everything. The only thing that tasted good was the pork belly. My main entree was the steak which left me feeling disappointed. I dont think I would go back.  On the bright side the drinks were good... kinda.", 
    "review_date": "2013-08-22"
  }, 
  "EndlF1Hp-EhxoQ3ClNA_ZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessie W.", 
    "review_text": "Very glad to have a neighborhood restaurant, especially one that does quality food.  Have been here a few times for drinks at the bar and also for dinner.  The bar can get really crowded but there are some nice, cozy sitting areas if you're lucky enough to snatch them.    My critique with this restaurant is with their dinner.  In a city with outstanding restaurants, I feel like the food quality really needs to be high in order to charge high prices.  Don't get me wrong, they have good food but it's nothing mind-blowing and therefore does not command the prices they charge.      All in all, if you're ok spending the money, check this place out.", 
    "review_date": "2015-01-01"
  }, 
  "zcyQ6gmNuePZjnT3e_ndlw": {
    "user_rating": 3.0, 
    "user_location": "Moraga, CA", 
    "user_name": "Toni L.", 
    "review_text": "Had reservation at 8:30 but they were way behind, we had to keep checking back with our host and finally got seated 45 minutes later. Right of the batch that was a bad start.  If I would have known that we have to wait that long I can order some appetizers to munch on, we were hungry and didn't anticipated the long wait.  One star off for that. Although the food was good, the service was rather slow also.  So late start and slow service, sorry I have to deduct points for that .  I am very big on service. Our favite of the night was the lobster soup, the dungeness crab salad,  and the duck breast. 3 and a half star for my overall experience.   Interior decor was nice, large dining room and a nice bar area.  I did enjoy the cocktail selection as well. Also kudos for the coat check at reception desk, a nice touch. I hope to have a better service next time, as I will give it one more try just to try other dishes in the menu.  Hopefully I can give them more star on the next visit.", 
    "review_date": "2014-06-05"
  }, 
  "Cx99NSVDZqgdIh73bw26yw": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Michelle C.", 
    "review_text": "Made reservations for a friends birthday. Food and service were both great. One friend went to wash her hands as the entrees came out and server covered her food with a cloche. It's all in the details... :)  The heirloom tomato salad was a great starter - very refreshing - and the best entree was probably the halibut although the berkshire pork was great too.", 
    "review_date": "2014-09-02"
  }, 
  "addFMW60hnUvayu7ynh_xg": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Sin-Yaw W.", 
    "review_text": "The bar was busting at the seam. The huge sized sketch drawings on the wall were very eye catching.  There were lots of business people and that got me a bit worried.  The waiter mentioned zip that I was the worst dress person on premise.  For that, he got extra tips.  The chef was daring. The flavors were pushed and I like his/her adventurous mood.  The appetizers beets and lobster gazpacho (a soup) were sharply acid and brought up the appetite and opened up the wine (house red, a Rhone blend).  The chicken was to die for and made the seabass (very good) felt a bit bland.  The chocolate ice cream sandwich use real and fresh mints, instead of using those green dye and synthesized mint flavor.  The apple toffee cake has some kind of oriental aroma that I still cannot place.  Everything was intriguing , flavorful, well presented.  Services were excellent (they wipe clean the table after each course) even the restaurant was sold out and teeming with loud activities.  Only thing.  It ain't cheap.", 
    "review_date": "2014-09-09"
  }, 
  "RGrDTsVmcUBCOUOn49y-wg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric S.", 
    "review_text": "I'm liking this place. Definitely a prospect for a nice dinner -- if you're feeling adventurous enough to spend $$$, or if you're going out for a team dinner on the company, like I was the first (and so far only) time I have been here :D  Since the whole menu is in fancy restaurant language, let me break it down for commoners like myself based on what my classy, sophisticated co-workers ordered, since they know this place and it totally worked well for us.  The warm-ups: McCormack Ranch Goat \"Bolognese\" - Not bad, but this one was passed around a few times during it's life cycle, if you know what I mean. Wagyu Beef Tartare - Very nice. Shaved Burgundian Truffles - Yum.  The goods: Local King Salmon - Teach me please. I want to make salmon like this. Snake River Farm Kobe Bavette - Oh my beefy goodness. So tender, so juicy, and relatively decently sized. Others: Didn't try them but they are all probably comparably delish.  The finishers: Peach \"Melba\" Strude - Ay que fabulosa. Me gusta! I'm so useless but the dessert wine menu looked like a load of gibberish to me so I just ordered what my co-workers ordered. It was some light red wine and it was some sweet goodness, just how I like it.  As expected in a $$$ restaurant with 4 stars, Prospect did not disappoint. The food was good, the service was swift, efficient, and polite, and the dessert was a very satisfying finisher. Maybe it was the 4 glasses of wine that the waiter just kept refilling as soon as the fill line dropped, but I'm really feeling the classy atmosphere and everything about this place. And it is actually totally reasonably priced for everything you get. If I somehow decide to become fancy in the future, I'd totally come back often. Love it.", 
    "review_date": "2013-09-15"
  }, 
  "RlpHzq3cHW6M_Y6VB4S0GQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie C.", 
    "review_text": "The cocktails are delish and dinner was great. The main reason I'm writing this review is because the snicker doodle ice cream sandwiches are to die for! I've been dreaming about them ever since.", 
    "review_date": "2014-03-29"
  }, 
  "O8RYLkWNmZYr2HgKWsmwiQ": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Rene C.", 
    "review_text": "The secret is out!  There is a \"secret burger\" at Prospect and if you are in the \"know\" you too can score one of their coveted secret burgers.  On my most recent visit to Prospect, I already knew even before setting foot in the restaurant that I would be ordering the burger. But not just any burger, the \"Secret Burger\". Both the regular burger and \"secret burger\" can only be found in the bar, so upon arriving my wife and I scored two seats overlooking the hard working bartenders.   Now how about to a bar menu dammit!   True to their word, the secret burger cannot be found listed anywhere. So I leaned over and whispered to our bartender \"pssst, hey\" \"how about that secret burger?\"  Our bartender nodded and said he would go find out what tonights offering would be. See the secret burger changes nightly. Sometimes it isn't a burger at all and can be pork or a piece of fish, so knowing what's on it before ordering is of the upmost importance.  He returned with the good news. The burger tonight is actually a burger! And it came with foie gras, sliced pineapple and caramelized onions on a toasted brioche bun. I must admit, I wasn't super excited at the \"prospect\" of pineapple on my burger but I went with it anyway.  The burger finally arrived and now I know why sometimes you find stupid pineapple on burgers! It works! The sliced pineapple help cut down the richness of the foie gras and added a slight tang and sweetness to each bite. If you are into large portions, this burger isn't for you. It's definitely on the smallish side, if you have been to Unami Burger then you  would know what to compare it to. But honestly I am more about quality than quantity and the burger size was A OK with me. And this is without a doubt a quality burger. But it is pricey. My wife and I each had a cocktail, one glass of wine, split a salad and one burger and bill still came out to over $80 (pre tip). But again, for the quality and the venue I was ok with it.   In the end, good burger but not great. Better than Burger Bar but not up to Unami, nopa or Bix Standards. But worth giving a try anyway.  I've dined at both the bar and the main dining room and both times treated to a fantastic experience. There is plenty of free parking after six and if you don't want to deal with this at all, they offer valet parking at a reasonable price.", 
    "review_date": "2012-01-09"
  }, 
  "-Hxvjz-t5ttsuH6H1osA4A": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Susanna W.", 
    "review_text": "***DESSERT &amp; DRINKS REVIEW ONLY***  3.5 stars.  We stopped by Prospect after being unimpressed with the dessert offerings at La Briciola.    AMBIANCE: Sleek and modern interior; very chic.  We arrived around 7:45PM on a Saturday, and while the bar area was fairly quiet (I felt like it was the perfect number of guests to keep an intimate vibe), the dining space towards the back was POPPIN'.  Majority of the tables were filled, and the entire room was filled with buzzing conversation.  I preferred the bar area atmosphere.  SERVICE: I was impressed with the courteousness of the hostess.  Our waitress was friendly, and the busboys made sure our water glasses were always full.  FOOD: - Pumpkin bread pudding cake ($10): Delightful flavors.  I thought the pairing of the pumpkin bread spices with the orange white chocolate ganache was unique and delicious, especially when paired with the salted caramel sauce (yay sweet &amp; savory!).  I was a little leery of the pomegranate sorbet, but it actually worked very well.  Bonus points for having the slightly brulee'd bread pudding cake tops.  YUM!  - Domino Effect ($11.50): The autumn spice syrup made this drink taste like a sophisticated version of Thanksgiving.  Slightly sweet/girly, but that's the way I like my cocktails.  I also got to sample the Blood &amp; Sand (VERY good), and the Il Terranova (also quite good, but sweeter than the Domino Effect... which was a nice balance for the bitterness of the Cynar).  OVERALL: A nice place to grab dessert and drinks, though I do find it to be on the pricey side (hence 3.5 stars).  I'll be back if I ever find myself in the area.", 
    "review_date": "2013-10-27"
  }, 
  "ffaF5LnL7Y5tG1SvyNBAyQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dorothy L.", 
    "review_text": "We had a reservation for 7 at 6pm. We were very late and they wouldn't seat the entire party until we got there.   Ordered a few drinks. I went with the Royal Treatment. It was a bit strong for me, but I'm not much of a drinker! I loved that there was a sprig of lavender. Made me feel fancy! :P  Appetizers We shared this among the party so we each got a small taste of each.   SEA SCALLOPS - Delicious! Perfectly cooked.  HAWAIIAN KAMPACHI SASHIMI - So refreshing with cucumber and citrus notes. SOFT SHELL CRAB - Very tasty. The breading was light and airy.  I would order all of these again!  Entrees PORK LOIN &amp; PORK BELLY - Both were very good. I would have liked more of the pork belly..hehe. This dish also included two very yummy chickpea fries.  HALIBUT - This wasn't very memorable for me.  QUAIL - The quail was good, but the bacon stuffing was even better!!   Dessert MINT CHIP ICE CREAM SANDWICH - A lot of people in my group didn't like the real mint taste, but I loved it. Very refreshing and was heavenly with the chocolate!  CARAMEL POPCORN - Yum yum yum! This is totally on my list of favorite popcorn.  CAPPUCCINO - Perfect way to finish off the meal and pair with the desserts.   Overall, we had a great time. The staff were attentive and the decor was lovely. I always appreciate restaurants with large windows. They let in so much light and give the illusion of spaciousness. This is perfect for special occasions or if you want to impress that special someone!", 
    "review_date": "2014-07-01"
  }, 
  "RGDyPqmNLKPdZ4VBf-6UKQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy Z.", 
    "review_text": "I have been here for both weekend happy hour and dinner service. They have a nice selection for food and cocktails for their happy hour. I loved their spicy soy glazed brussels sprouts, although it was more tangy than spicy.  As for their dinner service: the waiters were very attentive, with appetizer and entrees timed perfectly. Food was prepared well, with good balance of flavors while focusing on fresh, seasonal ingredients. Their black cod was buttery yet still had a perfect charred top that gave each bite a light crunch. I loved their little gem with endive and radicchio salad...light yet satisfying at the same time. I could eat that every day.", 
    "review_date": "2013-12-26"
  }, 
  "rtTpEZSTIDSurdw12xZK1Q": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "LOVE coming here for dinner and happy hour.  GREAT craft cocktails, happy hour menu is good.  MUST try their deviled eggs.  Great place to go for brunch also!", 
    "review_date": "2013-12-27"
  }, 
  "divy5fTOdpxCy6SHsYDbYQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Chris H.", 
    "review_text": "So good. Went here with the parents (which helped on the price aspect) and the food was fantastic. Definitely would recommend for a special occasion.", 
    "review_date": "2014-03-02"
  }, 
  "WD6DfjcDmTRpGOjMaVczjw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sharanya A.", 
    "review_text": "We loved dining here. Great Food, service and Ambience.", 
    "review_date": "2015-01-12"
  }, 
  "YeFjxtgDfHjGqO8MdJ9yrQ": {
    "user_rating": 5.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Jack H.", 
    "review_text": "Came here for my birthday. Tall ceilings, perfect ambiance, loved the wall colors.  We did 4 apps in total  Seared Day Boat Scallop- perfectly seared and basted with nutty brown butter with the nettles sauce..highlight of the evening. and the soft tender gnocchi with chanterelles!  Monterey Calamari - wasn't fried more like blanched. Milk powder sauce was too strong but the squid ink spaghetti good texture underneath!  Seared Abalone. the Artichoke puree tasted like the pulp mash after you get juicing 5 ribs of celery. very raw vegetable foam taste.   Wagyu Tartare- good fine dice but too much cornichons made it taste like tartar sauce tartare.  Service was impeccable and attentive!", 
    "review_date": "2013-10-27"
  }, 
  "48Meg9CLWgkJhqQRQhlEaw": {
    "user_rating": 5.0, 
    "user_location": "Mercer Island, WA", 
    "user_name": "Gordon C.", 
    "review_text": "Last night was the third time I have been to Prospect.  Every meal I have had was great.  The food is well prepared, well presented and full of flavor.  The scallops are especially delicious.  They had a special last night of black squid in pasta with calamari that was spectacular.  The cod is perfectly cooked and served in a light broth was some pasta-- really excellent.   The service has been excellent each time we were there.  Despite being busy they are very attentive and friendly.  Prices are reasonable for San Francisco.  The environment is great.  It can get a bit noisy and some of the tables are too close together.  Overall a great experience and would highly recommend.  My wife loved it as well.  One tip, if you go late, avoid the valet.  They charge you 15  dollars to park your car on the street and then hand your keys to the bartender.  MIght as well park your own car and hold on to the keys.", 
    "review_date": "2014-04-27"
  }, 
  "4kkh2SKkT5EPz2QByPTrFw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bebe W.", 
    "review_text": "Great decor and ambiance.  Came here for a work lunch and the place was NOT busy at all. Food and service was decent, although the waiters were auctioning off food instead of knowing who ordered what. I ordered the petrale sole which was on a yellow tomato and edamame and other beans.  I liked the petrale sole I had at leatherneck last week much better.  This entree was around $18.  For dessert I had the tres leches brule cake and it was definitely the highlight of the lunch.  The portions are small - you definitely need to get entree and salad or entree and dessert to feel full.  Also bread is available but you have to ask for it.  we didn't.  One lunch companion got little gem salad and the other got the mushroom fettucine without the pork belly.  I'd heard a lot of great reviews about this place and glad to try it.  I'll add it to my list for good corporate or celebration places.", 
    "review_date": "2014-06-24"
  }, 
  "_uSe94nOZLPK8Eub3qK3ew": {
    "user_rating": 3.0, 
    "user_location": "Emerald Hills, CA", 
    "user_name": "Aim M.", 
    "review_text": "We got there very early, before going to the theatre.  It was a bit strange that they would not seat my wife while I was parking. They said our entire party must be present in order to be seated. Strange, given that the place was empty. The food wound up being very good!  And our waiter was fantastic.", 
    "review_date": "2014-05-21"
  }, 
  "H6TkbbCuXZS8VyB5QjL1mw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Craig G.", 
    "review_text": "The food was good, but not memorable....the service was competent, but hardly what I'd call personable....and the atmosphere felt more like a place big companies hold their events than an intimate SF restaurant.", 
    "review_date": "2014-12-07"
  }, 
  "WGykF4RN67Wt4wajb-wAHg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "TheGay Z.", 
    "review_text": "This review is for their \"Grab &amp; Go\" lunch only which they started along with lunch service last Tuesday, 9/17.   Since they started opening for lunch, I've been a frequent patron of their Grab &amp; Go lunch as I work 2 blocks away and food options are limited. The quality of their lunch is excellent. Some may say that $8.50 for a sandwich and $12.50 to make it a meal (add chips and soda) is a bit on the pricey side, but I disagree. It is a great value for a no-wait lunch in downtown San Francisco, prepared by a chef at an upscale venue like Prospect.    That said, there are definite drawbacks. I've been back three times since their grand opening and every time the selection is extremely limited. For instance, there has never been a pre-packaged salad. Sorry light eaters!   Also, of the three times I've been there, they've only ever had two lunch options. The first time there was an option of two sandwiches Ham &amp; Brie or Chicken &amp; Tomato, but as of this week, the second and third time I've been there, there's only been one option: the Chicken &amp; Tomato sandwich. Sorry vegetarians!  Granted, this sandwich is delicious with its butter poached or gently pan-seared chicken breast, herb jam, heirloom tomatoes, and variation of cheese (usually Burrata or today Ricotta Salata, yippee!) -- but give me a break! It's only a matter of time before I get bored of this. For a first timer, yes this is exciting, but seeing as their patrons are likely going to be the same recurring office workers day after day, let's try to add in some variety. Maybe try a salad or if that's too much change, maybe chicken salad (no grapes please).   The point is if they're not growing, they're dying. And I don't want to see this fledgling Grab &amp; Go operation die because I love their $8.50 Chicken &amp; Tomato sandwich! Here's hoping there will be a new $8.50 option soon.", 
    "review_date": "2013-09-26"
  }, 
  "mW8fvDQ3JAtzeLjU--CjTg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rowena L.", 
    "review_text": "Just wasn't for me. The crowd was very much suits - bankers, corporate peeps, etc. and the atmosphere is a bit stiff. Maybe in like 30 years.   Service was slow but drinks weren't half bad.", 
    "review_date": "2014-08-29"
  }, 
  "2qj4WaAULhSt7fld8mLMMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carson R.", 
    "review_text": "Hit here for Happy Hour last Friday. Easily got a seat at the bar at 4:07 pm. Ambiance and décor were a little dull for me. T  Bartender wasn't overly friendly - but not unfriendly. The HH cocktails my pal and I ordered were both just Ok. Mine had too much agave syrup in it making it hecka sweet. My friend's was rather small compared to the other girl that ordered the same pop. The mixologists didn't seem seasoned or too anxious to fix things - There were many guys working the bar. Only one really stood out as someone that was happy w/ life, his job.  He had a beard and glasses - and was very enthusiastic about the snack menu and his recommendations.  Fortunately, most of the snacks were the bomb. Ceviche  - excellent portion, super citrus flavor, and fresh, fresh fish.  Squash blossoms were equally good - a little zest in ricotta stuffing made them worth the calories. And my friend had the chicken liver which she said was spot-on.  The special starter, parmigiano risotto w/ truffles and egg was a bust.  Bland, undercooked, overpriced.  Overall  - I might return for HH. Stick to the wine and HH snacks - but I wouldn't seek it out again.", 
    "review_date": "2014-08-27"
  }, 
  "9cjEizJw3BAkUWzJ2BCJag": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mary L.", 
    "review_text": "Had dinner here Saturday night, first time.  Really GREAT.  Decor, modern, understated, lovely.  Not loud (serious bonus points for this).    Started at the bar with the best Raspberry Lemon drop I've ever had.  The BEST cocktail ever consumed.  Dinner was amazing.  Appetizers of pressed raviolis, squash blossoms and heirloom tomato salad.  Ravioli dish was to die for.  Main course, pork loin with pork belly - do not get the appeal of pork belly at all, but the pork loin was perfectly cooked and the perfect portion.  Came over a bed of sweet/nutty faro + black mission fig.  Really excellent.    My mom had Snake River Farms Kobe Bavette steak...hands down BEST steak ever eaten. Perfect in every way.  My sister had the halibut.  great crust, perfectly cooked, but could have used more lemon and salt (which she added herself and then was very happy).  Only reason I am not giving 5 stars is the service.  Our server was Gabriella.  She was lovely, very competent, really knew the menu, the wine list, etc. very well spoken and obviously pro.  The problem was she kept running away from the table and we were struggling over wine choices and had to ask several times for help.  It shouldn't have been that hard to order wine, and we're wine drinkers!  Also we were told that two wines we wanted to try were not available for tastes.  This is a no no in my book.  It's not like these were $1,000 bottles, not even $100 bottles, so that should never be a no...just my personal opinion.  If you have clients sitting at your table ordering dinner, let them try what they want.  95% certainty they will order what you just poured them.  Also when ordering our food, we requested the squash blossom appetizer and were promptly told that it was only available at the bar (we had been sitting at the bar and looking at that menu) but that she would check with the kitchen.  Really?  That was annoying.  Again, clients at your table, get them what they want.  Does the world end if you run out of squash blossoms at the bar?  No.  All in all, I would HIGHLY recommend.  The meal was fantastic and the ambiance is perfect.", 
    "review_date": "2014-07-07"
  }, 
  "IfHo9BPvVpeuzY8lnJjN-A": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Emm C.", 
    "review_text": "sadly this place isn't doing brunch anymore but now they're catering to the hungry lunch crowd in this corner of SoMA. They open at 11:30am now and offer grab n go sandwiches along with a sit-down menu. now if they'd only offer more than a to-go sandwich, and if they'd open for barista-style espresso drinks in the AM, I would LOVE this place even more than i already do.  This place is great because in some ways it has become my go-to lunch place. Now if only they would carry top-notch coffee and make latter art from 7-10am! Maybe bake some croissant and scones, i would just live there and keep a running tab.", 
    "review_date": "2013-10-23"
  }, 
  "HMswU1MJgim7fxr6m1FyAQ": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Maria K.", 
    "review_text": "I wanted to catch up with a friend over drinks one Sunday night, and this was one of the few places open in the area.  The evening vibe was great, the space is beautifully decorated, our server was attentive and they have great handcrafted cocktails and appetizers, so it was an absolutely fabulous option.    I loved the Il Terranova house created cocktail that I had.  It featured botanical, fruit and cucumber flavors and was not too sweet or sour and very refreshing.  We also shared some spiced warm nuts that had a delicious rosemary covering and some hummus, which were both very good and presented beautifully.     Next time I will be back for dinner since I can only imagine how delicious their entrees must be!", 
    "review_date": "2013-09-02"
  }, 
  "Wez_YoTdzSxsBWPvx-leaA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie K.", 
    "review_text": "Food is underwhelming. It's very expensive for the taste. Almost everything I ate was either too salty or too rich - just not enough subtlety. They had a special (truffle ravioli) that was crazy expensive, but just kind of meh. At least the service was attentive.   Clientel is very white and very old. Think power business suits. I went for dinner and didn't see anyone under 50 dining here.   Happy hour bar time is good. The drinks are decent and the decor is nice. Actually, drinks anytime of the day would be nice here.", 
    "review_date": "2014-06-05"
  }, 
  "5YUfy39pMeDI_ZNuAj2Iig": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Mocha G.", 
    "review_text": "I love the ambiance in this restaurant. I don't like being seated so close to the next table that we could eavesdrop on the conversation.    The food is fabulous good local farm ingredients.  Presentation was beautiful. How fun to offer caromel corn for dessert!", 
    "review_date": "2013-08-12"
  }, 
  "pDN6COKeBY1D2kzYDRu7Fg": {
    "user_rating": 5.0, 
    "user_location": "Newark, CA", 
    "user_name": "Livy G.", 
    "review_text": "AMAZING FOOD! Pam Mazzola uses a variety of ingredients to create a unique flavor in each dish. If i could eat here everyday. i would", 
    "review_date": "2014-06-10"
  }, 
  "R7oAgr6j6SlOfpgByy4Xtw": {
    "user_rating": 2.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Laura G.", 
    "review_text": "Attended a dinner meeting here with colleagues last week.  We started in the bar with cocktails.  I had the wine.  The server was short with us and wasn't very friendly.  Maybe she was having a bad day, I'm not sure.    For dinner, we were seated in the main room at a long table, which is what I expected for a group of 12+.  The atmosphere was very nice.  The service wasn't what I was expecting for a place at this price point.  The entrees came out more that 2 minutes apart.    We shared the Foie Gras to start.  It was very good and the portion was great.  That's where the praise ends for me.  I ordered the steak medium rare.  It was served medium and stood before it made its way to my table.   The meat itself wasn't very good.  I could have had better by buying from Whole Foods and cooking at home myself.  At this price point, I would expect a perfectly cooked steak :/  I don't think I'll be back.  There are too many other choices in San Francisco.", 
    "review_date": "2015-02-02"
  }, 
  "IucvvxdQXXhjQ4z6Or6Nrw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sunil R.", 
    "review_text": "I was here for a work thing and we got a nice big room in the back. Service was excellent. The food was just OK IMHO. The salad was with fresh mozarella was my favorite. The grilled chicken was ok. The chocolate mousse looked great but the taste was meh.  I really enjoyed the McCallan  18 but not sure how much credit I can give Prospect for that.", 
    "review_date": "2014-02-22"
  }, 
  "uvjtp5PVn2-1mINYfge-dw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nina r.", 
    "review_text": "My partner and I decided to spend a night out at a place that we have never been. I had heard about Prospect from a friend so we decided to give it a try. We made reservations on a Wednesday night on the later side 9:00. We were greeted at the door by a very nice host who pointed us to the bar to grab a drink before our table was ready.  The bartender said he would be right with us. We weren't sure what to order so he guided us through their specials. I had a prospector and my partner had a rye Manhattan. Great drinks! The host came and got us at the bar so they could seat us. We were walked in to a large dinning room with beautiful hanging iron chandeliers with Edison bulbs. We were seated by the window banquets. Our server came over and introduced herself to us and then left us to look at the menu. We decided to pick a few dishes to share. We decided on the Maine lobster ravioli and the Ahi tuna tartare. Both dishes arrived at the  table with amazing plating the pyramid ravioli was delicious and the tartare was great the had dried and shaved a ahi jerky over The top of the ahi and the puffed rice cracker was a fun way to interact with the dish. For our main courses we ordered the quail and the NY steak. Cutting in to the quail was a treat with the wild rice and mushrooms each bite was heaven. My partners steak was cooked to perfection and the twice baked potato covered in dripping Gruyere and crispy potato skins.  Our server was great always close by to see if we needed anything and steered us on to the amazing snickerdoodle  ice cream sandwiches. We weren't going to have anything because we were so full but I am glad our server had us order them.  We had such a great time we will bring friends with us the next time as well as enjoy it on our own.", 
    "review_date": "2015-01-07"
  }, 
  "pI15RINDqpXIk5492xx7PA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel R.", 
    "review_text": "Brought my team and a group of clients here and was able to successfully arrange a nice night with the reservations' folks at Prospect.  Definitely not inexpensive, this place will run you at least $60 a person if you're doing it correctly. Speaking of doing it correctly, make sure to get:  -Ahi Tuna Tartare starter -Ranch Beef &amp; Short Rib entree -Beignets for dessert  Now, I just need to come back here for the breakfast; it looks to die for!", 
    "review_date": "2012-08-05"
  }, 
  "U4INQZOPSUaj8hMjLlZ3KA": {
    "user_rating": 2.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Michael U.", 
    "review_text": "Items selected:  Monkey Bread Cinnamon Butter Strawberry Shortcake Scone Sweetened Crème Fraiche, Fresh Strawberries &amp; Demerara Sugar Peaches &amp; Cream Pancakes - Cream Cheese Pancakes, Peach Syrup, Bruléed Peaches, Whipped Mascarpone, Honeycomb  When the team behind Boulevard opened Prospect it quickly went on the list of places to visit whenever I next visited San Francisco and with the debut of a brunch menu plus convenient location to the Moscone Center it seemed a perfect choice for Sunday Brunch during ENDO2013...at least until I arrived, the following 75 minutes consisting of being wedged into a small table between ladies who lunch (and drink...a lot,) having my main course entirely forgotten by \"Jason,\" and receiving underwhelming, undersized, and overpriced plates including a scone so dry that no amount of berries or cream could help and pancakes closely approximating rubber accompanied with perhaps 1/3 of a peach for $15.  A nice space, very clean and modern, perhaps my visit was an anomaly...but at $50 including tax and tip I'm not willing to go back and find out.", 
    "review_date": "2013-10-15"
  }, 
  "lrukUtbe3G2wiIR8t9E2vA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shala M.", 
    "review_text": "I live a block away from this restaurant and I always walk by it so I decided to give it a try.  I was way too young to be here -- it's definitely more of a 40+ crowd.  I give the restaurant 0 stars on the ambiance because I am all about sexy vibes when I go out.  This place had bright lights and no music, which in my opinion is the worst way to spend a Saturday night.   I rarely eat meat and I decided to splurge on halibut since it's an expensive restaurant.  It was so buttery and salty, I couldn't even finish it.  Good chefs can spice their food to make it taste out of this world -- butter and salt could not be more obvious!    I did like the bar decor and loved the way my cocktail was presented, but again, everyone was twice my age so I just felt out of place.  It's great if you're eating with your parents or like hanging out with an older crowd, but there is absolutely no way I would recommend Prospect to health conscious people in their late 20s to early 30s.  Probably the worst date night my fiance and I have had in San Francisco (and we go out a lot).", 
    "review_date": "2013-12-11"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Forgot about how I rated it before, but I've changed my mind.  I have come here twice again - once for dinner and one for the bar menu.  EAT AT THE BAR MENU.  Seriously!!  Food is cheaper, but still filling!  I really enjoyed the Prospect Burger, which came with delicious cajuny fries.  I also really loved the foie gras, which didn't look that good, but definitely tasted the part!  Their chicken wings were good, but I just don't like fried chicken wings that much to begin with.", 
    "review_date": "2012-05-29"
  }, 
  "1tJiuiIWiBWYcPyllDY8KA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Diane G.", 
    "review_text": "We had a lovely dinner with great service.  Our starters were salads (crab, avocado ) which was delicious.  Entrees were a delicious salmon and a steak that were both prepared perfectly.  The wine that our servers suggested was equally as wonderful as the rest of the meal.  Prospect knows what it is and how to provide a great dinner experience.  We will be back.", 
    "review_date": "2014-10-23"
  }, 
  "3zER5vjbHUdHHqGsR482Vg": {
    "user_rating": 2.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Paul S.", 
    "review_text": "Dinner Review  Summary: Very mixed feelings about the restaurant and our experience. Some things were great, others were poor at best.  Rating per Area: Service - 2 Stars - Inconsistent Timing Decor and Atmosphere - 5 Stars - Modern Elegant Cocktails - 5 Stars - Excellent Food Ingredients - 4 Stars - Fresh and good quality Food Flavors - 4 Stars - Nice combinations of flavors Food Preparations - 1 Star - Inconsistent...Perfect, to Overdone, to Underdone Dessert - 3 Stars - Just So So  Seating was prompt and professional We ordered cocktails. They were inventive and excellent quality  Wine list was impressive. Many nice wines by the glass as well  Pre Appetizer:  We asked if we could order the Cesar Salad Deviled Eggs from the bar menu. Our server had to ask permission from the manager, since they do not allow these items in the dining room. He returned and let us know that they would allow it. They were Very Good  Appetizers: Timing was great Abalone was very good. Only issue was too much pork to abalone. Once you separated the two you could taste the abalone. Perfect preparation.  Scallops were inconsistent in preparation. The first one was way overcooked (rubber), the next two were Perfect. Flavor combination was very nice  Entrees: Timing was horrible, waited almost 30 minutes. Server came to apologize. Risotto (off appetizer menu). Very good. Personally don't care for foam, but it worked. Preparation was perfect.  Pork Chop started off great. First 3 bits were absolutely incredible. Then I made my way towards the center. Grossly undercooked and I like my pork medium rare. Center was cool and chewy. Sent it back.  I will say that the gentleman next to me had the same thing and his was perfect. I noticed that my cut was much thicker than his, which may explain the difference.  Dessert: Timing was poor again Ordered dessert, coffee and after dinner drinks Chocolate Bonbons were OK, Nothing to write home about Coffee did not arrive until Dessert was almost finished. Just bad form...  Bill was incorrect. They charged me for the Pork Chop. Server got it fixed though.  The server also brought us a to-go bag of Chocolate Caramel Popcorn. It was a nice gesture. I will say it was good. Had a few while walking down the waterfront to view the bay bridge lights.   Overall I thought that the food ingredients were great, but preparation was lacking.   I really want to like this place. It has all the right parts and pieces. They just need to get the service timing and food preparation down.", 
    "review_date": "2013-09-29"
  }, 
  "6_nD6_NSkSy-taHb5HZd4g": {
    "user_rating": 4.0, 
    "user_location": "Corvallis, OR", 
    "user_name": "M H.", 
    "review_text": "I had a family dinner at prospect several days ago. Overall it was a wondeful experience. The ambiance is warm and inviting, and the service was outstanding. Our table was probably a server's nightmare because no one was drinking alcohol and almost everyone modified their selections to accommodate various dietary restrictions. Despite this, our server was unfailingly gracious and was able to help everyone find delicious dishes to suit their needs.   The food: I had the lobster chowder which was exquisite, and the liberty duck entree which had a sweet potato purée and house made marshmallows. For dessert we had the caramel popcorn which was a perfect treat at the end of a wonderful meal. I look forward to going back again and enjoying their amazing food and service with some wine!", 
    "review_date": "2013-12-23"
  }, 
  "CCXOOovxll8yVBakBcIt3g": {
    "user_rating": 4.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Jennifer I.", 
    "review_text": "Ordered drinks at the lounge while we waited to be seated.  We got the happy hour prices too!  The gin/honey cocktail was great.   Appetizers won me over!  The scallops were perfectly cooked. The California quail was juicy and had a delicious savory sauce that we sopped up with bread. The beet and avocado salad was wonderfully refreshing with fun texture from the quinoa.   Our entrees were the duck, pork chop and Kobe beef.  The pork chop was the standout for me - nice thick, juicy cut.  The duck was okay. I was disappointed in the Kobe beef, which was a little chewy. The wild grain risotto tasted undercooked (although I suspect that it was by design).  Overall, I loved the appetizers. And although I probably would not order the Kobe or duck again, I would want to go back and try something new!", 
    "review_date": "2013-11-18"
  }, 
  "h0jCr72NLkdGTNQmPuWp0A": {
    "user_rating": 3.0, 
    "user_location": "Davis, CA", 
    "user_name": "Christopher L.", 
    "review_text": "TLDR: - Usually a good Liberty duck dish. - Appetizers are haphazard. - Fish usually too thin and dry. - Can find better food for same price.", 
    "review_date": "2013-12-24"
  }, 
  "qQu-7rmF-Ml3xI0XgbNlXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ash S.", 
    "review_text": "Awesome brunch, quality food for great value. Highly recommend everything we ordered, I had the following:  Ricotta Doughnuts Peaches &amp; Cream Pancakes  Short Rib &amp; Smoked Potato Hash", 
    "review_date": "2013-07-29"
  }, 
  "qwjuG4jhXWsYJrucomBMxA": {
    "user_rating": 1.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Sidnei D.", 
    "review_text": "I have to give one star because I can't give zero stars. We ordered the organic chicken breast, which came with a larvae :( The person in charge said that because it's organic so it's \"fresh\" and these things happen. Furthermore, they told us that this had happened other times. Really, so it's not the first time and won't be the last.  This is unacceptable for an upscale  restaurant like this.  Disappointed to say the least.", 
    "review_date": "2014-12-24"
  }, 
  "_sPJLbG6BGMmpnzJcOI_KA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sasha V.", 
    "review_text": "Lunch on Friday at bar... Walk up w/ no reservations: * Burger was very flavorful but slightly overcooked (no sign of pink and I asked for Medium Rare). Home made bun. Very good but slight deduction for not cooked to specifications. * Fries were thick, sprinkled with sea salt. Very good  I would recommend to a friend.  4  1/2 stars.", 
    "review_date": "2014-09-12"
  }, 
  "MO-fTZwzQn8J7XHYTCQ8qw": {
    "user_rating": 4.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Ali A.", 
    "review_text": "Great food. I've never had black cod cooked to perfection they way they did. Moist, flakey, unbelievably flavorful.   Good service, even though we waited almost 45 min after our reservation time because the people at the table stayed long after they paid. Recommend to the resto: find a diplomatic way to usher guests from the table to the bar when they've overstayed.   Ambiance was more formal--a tad stuffy--than I expected.", 
    "review_date": "2014-11-10"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "This is surely a Prospect that is up for being modern, chic and contemporary in terms of the dining ambiance.  Their happy hour specials are great for an after work relief or a daytime getaway.    Their taste of their IPAs are surely refined.  Their Red Garnacha and White Riesling Wine was clean and not overpoweringly strong.  It was a pleasant drink for a leisurely outing.    I like their crisp Brussel Sprouts as well as their French Onion Dip.  Both are recommended as starters.  Their Kale was too steamed and overcooked for my liking.  As for their Deviled Eggs, it was nicely creamy and topped with garnishing.   The bartender recommended the Braised Liberty Duck Pasta that was delightfully different, but not something I would be yearning to order up again.    This place offers the norm of American cuisine, such as burgers and sandwiches, but on a more progressive outlook on it.  If you are looking for a happy hour place to bring your group or a simple leisure outing to bring someone, this is a Prospect for that!", 
    "review_date": "2013-11-30"
  }, 
  "g4cpkJaxeVIINVSzvJNxzQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lana T.", 
    "review_text": "I was here on New Year's Eve with some friends and the ambiance is lovely!  I personally think the lighting and romantic atmosphere is pretty on point for dates.  We started off with red wine I believe it was a Barolo (excellent) and had a complimentary started from the chef which I believe was some sort of squash dish.  It was an interesting taste and not something I would've chosen myself so it just adds to the new experience.  I had the crab salad, scallops and sea urchin which was fantastic (creamy and very flavorful), and finished off with the tropical baked Alaska.  That wasn't my favorite it was a bit too sweet for me who normally loves dessert!  Overall I had a pleasant experience although our main course took it's time getting there I understand since it was nye!", 
    "review_date": "2014-01-06"
  }, 
  "ZuCP8O71LHKl6tlXkS7Ziw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine C.", 
    "review_text": "once in awhile, my friends and i love to splurge on a nice dinner and i could not have been happier that we came to prospect for our latest get together dinner experience.  for appetizers, we shared the wagyu tartare, the stuffed quail, and squid ink pasta with uni.  for our entrees, we tried the steak, the pork chop, and seared duck. lastly, we got the salted carmel tarte with ice cream for dessert  wagyu tartare - great flavor! probably one of the best tartare ive had  stuffed quail - nothing exactly special but im a big fan of quail, especially when its boneless and I have just eat the tender meat without worrying about any bones.  squid ink pasta with uni - im still trying to decide if i like uni. for the most part, it's a tad too fishy for me but we split the uni into 3 pieces and i ate it with the pasta and calamari so it wasn't too bad  special of the night, steak - the steak was cooked perfectly, super tender and full of flavor and i loved the green sauce it came with.  pork chop - i was debating between the pork chop and the short ribs and our waiter highly recommended the pork chop. i was a tad disappointed because while it was a very tender pork chop, i felt it lacked a lot of flavor  seared duck breast - i loveee duck but the duck was too rare for me and a bit chewy. it came with some kind of sweet potato cornbread type sides with some kind of fluffy herb marshmallow that I really enjoyed.  salted caramel tarte - it was very rich and too sweet for me.  overall i had a fantastic meal! i loved the atmosphere of the restaurant and everyone was very friendly. i would defeinitely recommend this place for anyone that wants a treat and I will be back myself sooner or later!", 
    "review_date": "2013-12-09"
  }, 
  "gl2RLPcruk_vKXWta0mSyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sadia A.", 
    "review_text": "I had the swordfish and it was very nicely done.  This is a place for large parties as the place is large wih very few quiet corners for date nights.  Food is very tastefully presented.  Good wine selection, limited on the french however.  Well staffed and there was a photo shoot because the interior is beautifully decorated.  Recommended for families and large parties.", 
    "review_date": "2015-01-02"
  }, 
  "kYddxyOJD_vELH6Vr_ytyw": {
    "user_rating": 4.0, 
    "user_location": "Westminster, CA", 
    "user_name": "Elise V.", 
    "review_text": "Prospect was definitely one of the highlights of my SF trip back in December. My cousin's new in-laws chose this restaurant to host the post-nuptial Sunday brunch.  It's located right on the corner of Spear St. and Folsom, pretty much in the Financial District of SF. Walking in, you'll notice how sleek and modern the decor looks like. The restaurant itself is pretty big. Our brunch was actually in the private room towards the back of the restaurant. The room itself was large enough to fit about 50 people, about 5 large tables. It had its own private bar in the room, as well as someone asking for coat check. The room was really nice and decorated with pretty lights. There was a ton of room for guests to mingle around while drinking delicious mimosas.  While we waited for our servers to come around and take our orders, we had these donut like items as appetizers. We actually had a set menu of four items to choose from: - Smoked Salmon &amp; Everything Bagel - Warm French Toast - Today's Omelette - Egg Sandwich  The smoked salmon and egg sandwich were calling out my name, so the best friend and I decided that she would get the smoked salmon bagel and I would get the egg sandwich and we would split it so we could try some of each. Not gonna lie, I was a little disappointed to see that the portions weren't that big, but surprisingly enough, they were very filling and pretty damn good! The main courses came with some potato pieces as sides, so while we split our meals, the best friend and I were well-fed. Afterwards, we were given salted-caramel popcorn! They were so addicting! You couldn't just get one handful - you just kept reaching for more. And for dessert, servers passed around these peppermint ice cream sandwiches. They were AMAZING. I've never had anything like it. Like you could actually taste the peppermint pieces in them. So good!  Service here is amazing. There was always someone coming around to see if we needed refills on our drinks or whatever else we needed. Overall, I had a wonderful time here. I would very much come back again during my next SF trip to have dinner or lunch.", 
    "review_date": "2012-02-04"
  }, 
  "-slK6EpqPvmjnG8eQNRTsQ": {
    "user_rating": 4.0, 
    "user_location": "Englewood, CO", 
    "user_name": "Robert C.", 
    "review_text": "Enjoyed this one. Part of the charm is to utilize the grand sommelier. He chose a very inexpensive Hungarian wine with a mint essence. Amazing.   Like many other yelpers I had to try the ice cream sandwiches for dessert. Very good. I was disappointed they did not have duck on the menu when I was there. Atmosphere is busy and slightly loud, but not overwhelming.", 
    "review_date": "2014-08-17"
  }, 
  "NP-675YVy9URhNmdQdnWsQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa K.", 
    "review_text": "I found the service to be more impressive than the food. It was easy to make a reservation for 2 on a friday night, which I appreciated. Our waiter was considerate about us splitting an appetizer and a main dish after cocktails and wine. I was quite surprised at the lack of subtlety in our food. The belgian endive &amp; burrata salad was fine (a little hard to go wrong with a nice glop of burrata on a salad!), and the accompanying flavors were interesting, but the whole dish did not come together very well to me. I liked the swordfish, but again, the various surrounding items did not add a lot. Maybe my expectations were too high, but I was not overwhelmed. I would come back for a different meal - and, to be fair, would love to come back to try dessert.", 
    "review_date": "2013-11-19"
  }, 
  "EVfNM3vsq_zWvR4dI5Qytw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victory V.", 
    "review_text": "Food was very good but not memorable at all. It feels a bit corporate from the crowd, too.", 
    "review_date": "2014-09-26"
  }, 
  "pBNqvV5IkldL24s418ZzRw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shadi N.", 
    "review_text": "Oh my god the goat IS SO GOOD! I have to say I was nervous about eating dinner at prospect. The general experience I had had with the bar food was below average. But the dining room stepped it up more than a couple notches and proved worthy of a great review. The service was OK, nothing special but the food was great and I really recommend the goat its fantastic.", 
    "review_date": "2014-11-06"
  }, 
  "Jldzk3pQnaang4nhTQsGzg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy H.", 
    "review_text": "this review is only for their happy hour - which is mm mmm goood  i tried their happy hour for the first time last night (but forgot to check in on yelp...) and this restaurant itself is super classy/fancy/a little bougie. it's located right across from google so expect to see a lot of google folks pass through here. The happy hour menu isn't robust but it does the job. I went with a few coworkers so i was able to try most of the items on the menu.   My favorite: LA LAVANDA this is the perfect girly drink with a piece of lavender as garnish. you can't taste the vodka at all, which is a little dangerous because my coworker and i downed 3 of those like it was water and all of  a sudden, i was dropping my bag and laughing at every little thing. bad sign.  all the men in my group ordered the the whiskey sling. it looked really strong but it was pretty well received from the guys. I also tried the rum drink - which was a little on the sweet side, but not bad overall.  we ordered some finger foods as well, the only thing that stood out were the fries.  note: this place gets pretty packed for happy hour so i would recommend coming a little early if you want to grab a table.", 
    "review_date": "2013-02-22"
  }, 
  "cQCNoZnQWQ_Lz8uojk9EXQ": {
    "user_rating": 5.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Shanna N.", 
    "review_text": "I'm all about the ice cream sandwich.   Everything we had was delicious, service was great, but the dessert was stellar.   I wonder if I can get it for takeout...   Don't leave without getting the strawberr ice cream sandwich! The banana doughnuts were incredible too  What else...The duck and swordfish entrees were awesome plus all the different Appetizers we ordered - pretty much licked our plates clean...   Would definitely come back here ... Even just for champagne and desserts!   I also remember a fantastic lavender cocktail I had at the start.. Loved it all :-)", 
    "review_date": "2014-05-21"
  }, 
  "07kcxECcz4g1NYXVzkgW1Q": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Max M.", 
    "review_text": "What is the 4% of surcharge? I am local, but never heard of it. Is this another name of \"Health care tax for employees\" after Obama care is implemented?", 
    "review_date": "2015-02-03"
  }, 
  "OeWgkeEytk5DSfO0nLB89g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tomomi K.", 
    "review_text": "5 stars for Prospect! Delicious food, great ambience, and excellent service!  I have been there a couple times and every time I go there, I finish my dinner happy:) The first time I had dinner here was a couple month ago, and on the next day, they called me to make sure we enjoyed dinner there.  How many restaurants have this kind of heartfelt services?  Very impressive!  Some dishes I had last week were:   Soft Shell Crab and Kimichi Pork belly - Softshell crab was just good, but Kimichi Pork Belly was delicious. Northern Halibut  - Amazing!  Sweet and flavorful halibut with lots of vegetables arranged colorfully.  My favorite dish here.  Beautifully done. Prather Ranch Pork - Scrumptious.  The pork is brilliantly cooked in pink color and tender.  The portion is just perfect for me.  Not too big or small.  All the dishes are delicately flavored.  I love their modern and chic décor with the glass walls, which makes it look very spacious and  I feel very comfortable there with the great atmosphere.  Again, service is topnotch!  They are always helpful when I ask for the advice on my food and wine choice, furthermore, they are so friendly.  Their bar looks very cool as well and their happy hour is very appealing, which I want to go back for next time.  I highly recommend Prospect if you like to enjoy sophisticated dining experience.", 
    "review_date": "2013-06-12"
  }, 
  "w1lHu6I_xLDKHMXc4Cv5ig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taylor L.", 
    "review_text": "I have been coming here quite frequently because I live upstairs.   Josh, the sommelier, has helped us a few times and recognized us when we came in the other week!  We asked him for a recommendation on champagne, and of course, he didn't disappoint! He asked what we were celebrating (my boyfriend's belated 30th), and he sent us a complimentary dessert!  We got the : Meyer Lemon Ice Box Cake served with Ginger Snaps, Blackberry Preserves, Pink Peppercorns and a Ginger Beer &amp; Lime Sorbet.  Wow it was awesome. Thanks Josh for great service, recommendations &amp; a wonderful experience, as always.", 
    "review_date": "2014-01-17"
  }, 
  "HylGr2mRKE9CCC9KvdvCoQ": {
    "user_rating": 4.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Kelly R.", 
    "review_text": "I really liked Prospect!  I ordered The Prospector, and it was incredibly filling. It came with three corn cakes, two pieces of bacon, a pork apple sausage, and eggs (I got mine scrambled). The dish was nothing inventive, but everything was pretty tasty, and I enjoyed it. My roommate had the crispy duck, which she seemed to really love.  The restaurant was clean and classy, and I love that it lets in so much light. Waiters were very sweet and accommodating. Prospect was a great way to spend my last Sunday brunch in San Francisco for awhile!", 
    "review_date": "2013-08-11"
  }, 
  "eZNhFI6m07dvu1zfLfJc-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy N.", 
    "review_text": "Lucky me! We came to Prospect on their 3rd year anniversary celebration. They celebrated by offering each person a glass of champagne, chick pea soup, and whiskey tasting along with hor d'oeurves. Great start!  Our server took VERY good care of my party and I. Very attentive and gave great recommendations on their dishes. Everything on their menu sounds very delicious, and I can say you can't go wrong with ordering anything on it. The seared scallops and pork belly appetizer was really good. I had their pork chop for my entree and it was very tender. I enjoyed every bite of it.  Great list of drinks, wine, and cocktails as well.  Will be back!", 
    "review_date": "2013-07-08"
  }, 
  "7QhdBy475-dT4NQUu701Ng": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kvatch K.", 
    "review_text": "Planned a 50th birthday party for a large group at Prospect and for the most part it came off without a hitch.  We were given a table at the back of the restaurant which got us away from most of the noise in Prospect's cavernous space.  Our waiter was calm, professional, and good humored...taking our tendency to talk with our friends--rather than pay attention to our menus--in stride.  The food was delicious and, important for large parties, well timed.  The kitchen was obviously working hard to ensure that all the food was hot and that nobody got left behind.  The only aspect of our dinner where Prospect dropped the ball was in our attempt to connect with the sommelier to pre-arrange the wine selections.  After an initial contact, our email with some initial thoughts and selections was ignored.  A request to have the sommelier contact us by phone?  Likewise ignored.  So, on the evening of the party, we were left to fend for ourselves.  Consequently, two of three selections, a total of four bottles, were big hits.  The third, the most expensive bottle we chose, a roaring dud!  And, had Prospect's sommelier deigned to work with us, we might have avoided an expensive mistake.  On the whole though...great food, pleasant atmosphere, an extensive wine selection, contributed to a wonderful, if not quite perfect evening at Prospect.", 
    "review_date": "2014-03-20"
  }, 
  "5pOXfsd9vmRZWzxzW3aZGg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Don W.", 
    "review_text": "I'd rate Prospect 3.5 stars if I could.   I was generally pleased with my meal, but my steak was just a bit overcooked. I was also a little disappointed that they didn't offer a substitution for the potatoes that I asked they hold, because of my sensitivity to dairy - which had my plate come to me looking pitifully bare.   What I was actually most impressed with was the space. The decor is contemporary, and lots of windows help create a nice open feeling.  The service was prompt and professional, if not overly friendly.   Overall the experience was a positive one, and I'll likely return at some point, but probably not for awhile. There are too many comparable restaurants to explore first.", 
    "review_date": "2014-01-23"
  }, 
  "xoOVvRGOFG3hwzz19F3Y9w": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "Nadeem A.", 
    "review_text": "Prospect is the perfect place for work lunches where you want to impress colleagues with a nice, non-adventurous experience. Everything about this place is just sort of there. The service is fine, the menu is fine, the location, you guessed it, fine.  The menu changes every few weeks and consists mostly of upscale American'ish food. Scallops over risotto, fried chicken sandwiches, salmon, you get the picture.   The last time I was there, I had the salmon over a bed of shaved brussels sprouts. The food is good but nothing really stood out.   No wait, something did stand out. The tiny portions. In all honesty, I have never seen such a small amount of food on such a giant plate. I was starving twenty minutes after lunch. In the past, I've had the steak and the hamburger and so I can honestly attest to the tiny portions.  The starters and the dessert are actually more innovative than the food. The last time I was there, they had an eggplant dip with miso, served with toasted nori chips that was quite tasty. And for dessert, their homemade caramel corn can't be beat.  As a final point of note, you have to request bread before the meal if you want it and in light of the doll-sized food that's to follow, my most helpful advice is, \"Get the bread.\"", 
    "review_date": "2014-11-10"
  }, 
  "J5O2GUImvlA2Ll3TisJQRw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin C.", 
    "review_text": "STILL REELING... This is a mixed review, as my actual meal and the table service was lovely. Spectacular, really. But the nausea set in before I even had a chance to order a cocktail. I had brought in a beautiful chocolate cake for my dear friend's birthday, which we were celebrating at Prospect.  Upon my arrival I asked the hostess if she knew who our server would be for the meal (we came early for drinks and the group was still at the bar), as I wanted to be sure the cake got into the correct hands. She then asked me if I was aware of their cakeage fee (yes, that is a real thing in case you are wondering). I said I was not (as it is not listed anywhere on their website), but that I understand some restaurants do charge for bringing in an outside cake. At which point I said, \"No problem, do you mind me asking how much your cakeage fee is?\" - to which she answered, \"It's eight dollars a slice.\" $8 a SLICE!?!?! You must be joking! That is the most obscene fee I have ever heard. She assured me that it was a great presentation, with ice cream. EIGHT DOLLARS????? No way. I have heard of $2, at the absolutely max $4. But what are my options? I am standing there with a cake for the birthday girl, so I said fine, but be sure to put it on a separate check and present it to me only.  There were 14 people in our party, so in the end, my cakeage bill came to $115 - yep,  they taxed it.  Not to mention they botched the cake presentation as well.   My beautiful dinner with wine service was only $89 before gratuity, so color me confused.     All in all, I would have rated the dinner and service quite high, but I just can't do it due to the ridiculousness of the cakeage fee.    To boot, I also happen to book high-end group dinners for a living, but I certainly won't be booking them at Prospect any longer.  In conclusion, please PLEASE don't bring in a special cake to Prospect, it's literally not worth it.", 
    "review_date": "2014-06-19"
  }, 
  "NoBP3EXm1CHCIIeC16Mgpw": {
    "user_rating": 1.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Molly M.", 
    "review_text": "I'd give this place zero stars if I could.  The food is mediocre at best (think Denny's with attitude) and the wait staff unprofessional.  Our server kept belittling the other staff saying \"it's just common sense\".  When she found out we were from the east bay, all she could do was talk about how horrible Oakland is. To top it off, the guy who cleared our table called us fags (mericones) as he walked away.  I will never set foot in this place again and will make a point of letting everyone I know how awful this place is.", 
    "review_date": "2014-11-21"
  }, 
  "DTvJeEbcUsHEamwTgyXvTw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Masafumi H.", 
    "review_text": "Beautiful colors and good flavors. Some people say portion is small but it was nice portion to my wife and me. Services were excellent too.", 
    "review_date": "2014-07-31"
  }, 
  "pDkNgTbXxwWK4ykRjmy3mw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jarlin S.", 
    "review_text": "Beautiful modern space.   The food is not super innovative in terms of technique or ingredient combinations, but most dishes are delicious and well balanced in flavor.   My favorites: seared scallops, duck three ways, house-made caramel popcorn.  It was also one of my favorite brunch spots, but looks like brunch is no longer available. Bummer.", 
    "review_date": "2014-03-27"
  }, 
  "gDxvsE2SAEm3AzXTTtlEZw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John D.", 
    "review_text": "If you're a dude bro, his trampy girlfriend, or aging Eurotrash, Prospect is the place for you. Everyone else should go someplace that knows how to manage their reservations better.   Service has gone seriously downhill since our last meal here a year ago. After waiting for 35 minutes past an 8:45 reservation, and after being seated without an apology for the long wait, no one bothered to show up for another 5 minutes. No water, no server, no greeting. So we walked out and got some takeout from Little Star.   There are too many good restaurants in the city to waste your time with Prospect.", 
    "review_date": "2014-02-23"
  }, 
  "Fvx_gzLiexmSlJiRUvnFEQ": {
    "user_rating": 4.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Alfred K.", 
    "review_text": "Came here for dinner and was very impressed with the service and food. I ordered the Berkshire Pork Loin &amp; Braised Pork Cheek entree and the Baked Alaska for dessert. Both were delicious. The ambience was great. Of course, you get what you pay for. The prices were a little high but definitely worth it. Definitely coming back.", 
    "review_date": "2014-04-04"
  }, 
  "LPS3YJZik6UURsnTTYkhXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anya C.", 
    "review_text": "Salad was good. duck, scallop, lamp are all good. Lemon ice cream is good, too. The chocolate sandwich ice cream was too sweet.", 
    "review_date": "2014-03-07"
  }, 
  "CMdFQ0y0zvzBS2x6tjZcWA": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Elizabeth S.", 
    "review_text": "I was here a couple years back when they first opened.  This culinary locale is no longer a neighborhood secret.  On a Wednesday night, the place was packed wall to wall!  People don't want to get up and leave, but I can understand why!  Prospect is a swanky, modern upscale restaurant with oak and walnut colored interiors and a sumptuous lighting scheme to bring a dramatic ambiance throughout the restaurant.  There is a resident pizazz in the air, the sounds of multiple conversations ensuing and joyous laughter over exquisite food and drink.  -no long faces here!  Despite being seated an hour over our reservation time, our party's disappointment quickly dissipated with gracious personal attention from the manager who brought out some sort of potato dumplings for our party of five and a sample of their creamy cauliflower soup.  As expected, the service was impeccable throughout the night.  I ended up ordering the Liberty Duck Breast with crispy duck fat potatoes, shaved brussels sprouts, baby white turnips, pickled quince (small yellowish fruit) in foie gras sauce.  Although small in portion, it was a finely herbed, zestful indulgence.  The only thing here I find disappointing are their dirty martinis.  Even with top shelf vodka, their dirty martinis will never be up to par with the vapid, flat olives they use which is confirmed when taking a bite into them.  Maybe, they were old that night. Who knows.  I've never tasted such awful bland green olives.  Other than that, Prospect is top notch.", 
    "review_date": "2012-01-21"
  }, 
  "gx2vvZQMlouMMytATpZhhw": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "James G.", 
    "review_text": "Made a late reservation here for this past Sunday night. Ended up going for a late dinner at 845p. We arrived and we instructed to go to the bar and our table would be ready shortly (from the looks there were MULTIPLE tables open in the main dining room). This is really the ONLY bad thing I can say about Prospect. Had an absolutely delicious cocktail at the bar (granted it took a few minutes to be served).   When seated, we looked at the wine list, and were instructed it was 1/2 price bottle night (hostess was supposed to inform us of this). We ended up talking to the sommelier and she recommended a Merlot blend that phenomenal. Would not have ordered it had it not beed for the 1/2 price night, but still, well worth it. It paired perfectly with every dish we had.  Ordered the Lobster and cauliflower annolloti, which was buttery, had a great sauce, and was just really solid.  Coupled that with the candied walnut and blue cheese salad, which was also outstanding.  We proceeded to order dinner (we were informed b our server that they were running low on certain menu items, so we ordered and then had them hold the order) -- the special was goat which was fabulous, and my girlfriend ordered the sole which was good, but not great (not much taste).  Overall Prospect was very good. Would definitely go back, especially on Sunday for 1/2 price bottles of wine!", 
    "review_date": "2013-09-05"
  }, 
  "89dX_yDmaRKVz_xrRIvNzA": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Wendy N.", 
    "review_text": "A group of eight of us came here for Sunday brunch. Prospect is located in the Financial District and the setting is elegant and modern. It's very spacious so ideal for large groups. The service was great and they kept my coffee filled to the rim (much needed after a late night out).   We ordered Monkey Bread for a starter, which was basically a cinnamon roll. Didn't try it but apparently gauging from the \"oohs\" and \"ahhs\" emitting from my friends, it was delicious. I learned what \"epi\" is: a type of artisan bread that's often made at French-style bakeries. They have toasted epi accompanying many of their brunch items but I gave mine to a friend since I'm on the Paleo regime. My Short Rib &amp; Smoked Potato Hash was very flavorful and the eggs were perfectly poached. Everyone else commented that their food was yummy and we had an enjoyable time.  I would recommend Prospect highly for brunch!", 
    "review_date": "2013-10-14"
  }, 
  "va4_CZ534zTT7FZ25udaZw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Charles B.", 
    "review_text": "I was not going to give prospect a good review for my last visit on NYE... However I received a call from the GM Scott and he made everything right! It's important to run a business like this! And go above and beyond for your guests...   I have eaten at prospect many times and I love the food and drinks!! They are always top notch! Although NYE was a little rocky it is all fixed now!!   Thanks for reaching out Scott!", 
    "review_date": "2014-01-04"
  }, 
  "bDMQ-LHxF9ki3QvXAAr7og": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nico T.", 
    "review_text": "I made a reservation here for a nice weeknight dinner mostly because of location, the fact that they still had openings 2 days in advance (most of highly-rated places in the area were already booked! on a Wednesday!), and the overall good reviews on Yelp.   I've lived in Portland and NYC, both very much foodie heavens, and expected this to be a good inventive foodie place based on their menu, but was fairly disappointed. The ambiance was lovely, but a bit loud with some loud groups seated nearby. For drinks, my dad got a chocolate-based cocktail that was too bitter and not very exciting, but my husband and I got good glasses of wine. They had a pretty good selection of wines and dessert wines. The food itself was ok, some better than others (the pork chop was our best dish and the closest to an inventive/foodie dish as I expected), but the chicken and steak weren't especially exciting. All the dishes seemed to have high-quality ingredients but the pairing of sauces, side dishes, and flavors could have been better. Service was on the slow side too, and not very friendly wait staff.  I think this is a good place to go to if you want a decent fancy/expensive meal in a nice location but don't care much about exciting or inventive dishes. Or just go for a glass of wine and a dessert!", 
    "review_date": "2014-11-06"
  }, 
  "f2AEnBSEBk0kq5L4J8hygw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H. S.", 
    "review_text": "Great variety of starters, entrees, and desserts, all well prepared and beautifully presented. I also liked the decor and the ambience. Our waiter was friendly and well prepared to answer our questions.", 
    "review_date": "2014-09-29"
  }, 
  "eKle85qSKmeTAw4DuVA8Tg": {
    "user_rating": 1.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Richard I.", 
    "review_text": "Very dissappointing.   Our tortelini appetizer, while tasty, was luke warm, and my petrale sole was ice cold.   It took about 10 minutes for our waitress to re-appear, and even longer for her to replace my meal.    Even then, the fish was pasty and tasteless, and by the time I received it, my wife had finished her meal.   By way of apology, we were given a small bag of carmel corn.   It turned out to be the only good food of the evening.", 
    "review_date": "2014-12-08"
  }, 
  "B6xxXHebsWphZe4_uXi3pw": {
    "user_rating": 5.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Jon H.", 
    "review_text": "The whole chicken salad was fantastic, and this coming from somebody who doesn't like dark meat (the salad had both white and dark meat).  My friend got the chicken sandwich, and he really enjoyed it.  The tomato salad with burrata was really good.   The wine was very pricey, but really good.   Service was good, very professional.  Very much looking forward to go back.", 
    "review_date": "2014-10-01"
  }, 
  "lXTo1RQzzZvoERKWOUclmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tanya G.", 
    "review_text": "Everything from cocktails, wines, appetizers, entres and deserts were perfect. It was an experience of a lifetime.", 
    "review_date": "2014-05-01"
  }, 
  "c918DZaM-XxnPv2CcGzJHA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Raymond M.", 
    "review_text": "We had a company lunch here with approximately 20 of us.  The staff pretty much nailed it, and we all had a great experience.  We had a limited menu because of our group size, but the quality was outstanding.  The timing was good, the portion sizes were good, food was delicious, and our wine glasses were never empty.  I would definitely recommend.", 
    "review_date": "2014-12-17"
  }, 
  "e9c_1Ly9d3BrCMbTYllpeg": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Jacqueline W.", 
    "review_text": "Service was excellent and they didn't even have white table clothes!  They cleared and poured right on cue.  They gently wipe down your space after a course.  Felt like old town upscale.  Half expected Deano to walk in for his martini.  I love mixed crowds and this was definitely a place for the young the old and the hipsters in between.   From the heirloom tomatoes fresh from the Saturday market and melt in your mouth burrata to the perfectly panfried sole, you will be smiling.    I would skip dessert though.  We had the peach sundae with brown butter bourbon ice cream.  Too many flavors going on there.  Peaches were undercooked and spices did not compliment the i.c.  Other desserts looked a little either too standard or also too confused.  Definitely would dine here again!", 
    "review_date": "2014-07-07"
  }, 
  "_nEoolMSiaTUwwzrfdpwzA": {
    "user_rating": 1.0, 
    "user_location": "Austin, TX", 
    "user_name": "Mick J.", 
    "review_text": "I think most of us know that Prospect isn't exactly cheap dining. I don't mind paying money but I can't tolerate waitstaff who think I should be thankful they're serving me. It's your job, the one you chose to do, so don't have a sloppy attitude. The food was probably not indelible but the service was either negligent or overbearing, never normal. I will most certainly take my business to more pleasant environs like Sens which simply never fails to please.", 
    "review_date": "2014-10-22"
  }, 
  "O95S2epsG-ho2eADuaHz0Q": {
    "user_rating": 2.0, 
    "user_location": "Homewood, CA", 
    "user_name": "Webster P.", 
    "review_text": "Last night was probably the 5th or 6th time I have eaten here. Dining room was very busy, plus there was large a private party in the back room. Perhaps as a result, service was intolerably slow. No apology from server, however. Then, this was the first bad meal that I have had here. My swordfish tasted rancid, colleague's steak was sub-par. We both left most of our portions on the plate. Waiter did not even ask why we had eaten less than half our food. If the kitchen can't handle such a large private party without impacting the dining room, then they shouldn't schedule them. For this money, I don't need poor food and perfunctory service. Bye-bye, Prospect for me for a while.", 
    "review_date": "2014-10-24"
  }, 
  "bjIrCWKOVwiWAbBXnL2GjA": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Justine C.", 
    "review_text": "Amazing dinner! Went there with my boyfriend and had the heirloom salad, the oysters, And the Kobe has my entree ... All supreme dishes! The sundae for dessert was also wonderful!", 
    "review_date": "2014-09-21"
  }, 
  "DXEk34ZJiLBFTIVv1e90YA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel K.", 
    "review_text": "Came for Sunday brunch with a party of 6. Not many people at the restaurant - quite empty for a brunch spot in San Francisco.   Service was slow - ordered coffees and juice and took more than 15 minutes to arrive. Last time I checked coffee takes only a couple minutes to make and I'm sure they aren't squeezing their own juices.   Food was decent - started off with the deviled eggs (not bad) and monkey bread (pretty much a regular cinnamon roll). Entree- the short rib was a bit dry and salty. The chicken sandwich was well made but I have had better.   Overall, I guess this would be a convenient spot for brunch for us who live in soma (and want to avoid long lines everywhere else).", 
    "review_date": "2013-09-16"
  }, 
  "WA7RbqRyZsGE9j-E6bzWpw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamil M.", 
    "review_text": "Modern California cuisine, that's really good. I work nearby, and this is my go-to place for business lunches. Palomino was a frequent choice, but I generally steer the conversation to Prospect. The roast chicken salad is very tasty, as is their burger. My favorite appetizer is the kobe beef tartare with shaved black truffle, and the scallops with risotto is wonderfully buttery. Only three scallops, but a little portion control never hurts.", 
    "review_date": "2014-11-08"
  }, 
  "4RUXeyp_Af2C5t9JFyJlBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina Y.", 
    "review_text": "Seriously I came here twice in one day.   Lunch: I ordered the soup (delicious lobster bisque) and the chicken roulade. The soup was so warm and inviting. The chicken was very moist and risotto that came with the dish was so delicious as well. The mushrooms (and I don't even like mushrooms) were good. Dessert was the best one I've had in a LONG time. The salted caramel chocolate tart. That was amazing. I loved the caramel and the chocolate ganache covering the entire tart. The ice cream was good and complemented the tart very well.   Dinner: Now for dinner (which was only about 3 hours later), I ordered the scallops and the duck. Whenever I go out I like to look on yelp and see what everyone else loves, and they suggested these two. The scallops were delicious. Cooked amazingly with a great caramelization on them. The duck was fatty, but oh so good. I mean the fattiness is part of eating duck really.  I went with a lighter dessert the sorbet. I wanted to try the honey ice cream, but they ran out, so I just went the apple sorbet.   Overall, I had a great time both times and definitely would go back - especially for recruiting.", 
    "review_date": "2013-11-19"
  }, 
  "H5EY1CeIx4m_pNChKZkq7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathy V.", 
    "review_text": "Got Foie Gras? Ever since Foie Gras has been un-banned, I have been on the hunt. Kudos to SF eatery for publicizing a list of the top notch places to go.   I've heard so many good things about Prospect in the past and til today I can it lives up to its name, but more than a Prospect. Came around 530p and the place was packed. We sat in the bar area, lucky enough to grab a table were we can actually have dinner, since the next seating available was at 8p.   Just in time for HH which is from 4p-6p Prospect Fries- 4 stars Jalapeno Deviled Eggs -5 stars Shigoku Oysters-5 stars Ahi Tuna Tartare-5 stars Crispy Pork Riblets-1 star  Entree: Black Bass &amp; Salt Spring Mussels-Black Rice, Cliantro, Heriloom Carrots, Gai lan, Vanilla Coconut Curry-cook to perfection-5 stars  Seared Hudson Valley Foie Gras-Toasted Brioche, Pickled Huckleberries, Fuji Apple &amp; Java long pepper reduction and Wild pecans. -Died and gone to heaven. -5 stars  Service was Impeccable even then it was crazy busy. My friends and I had a great evening with a belly full of delicious eats.  Thank you again!!", 
    "review_date": "2015-01-20"
  }, 
  "u9KhzES5reUljwccEyFdJw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "NATASHA F.", 
    "review_text": "Oh man I came here like almost 3 years ago and can't believe I haven't posted a review.  I have no clue what I ordered BUT I remember realllly enjoying my experience/dishes here!", 
    "review_date": "2014-02-14"
  }, 
  "4InFkxzE3nxy5hd5IfLSFw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Patty O.", 
    "review_text": "Nice little bar area for FiDi happy hours. Service is pretty attentive. A colleague had bags for his flight and he was able to check the bags in prior to having drinks over at the bar.  Waiters served us waters along with our alcohol without us having to ask.  Drink menu features assorted wines, cocktails, and beers.  Not to mention this place is within very close distance to my clients and the Embaracdero bart station which allows for convenience.", 
    "review_date": "2012-11-10"
  }, 
  "Ap9LaMbl1hJX0c7q3m9hAw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wells Y.", 
    "review_text": "Really just ehhhh. The food is really nothing to rave about. Food was average but cost a lot of money for each dish. The appetizers were also very bland and un flavorful. I had a flank steak and Brussel sprouts and it was really not something I would go back for or even mention to people. It did not taste bad but it did not taste good, if that makes any sense. None of the people who work there ever smile either.   Meh place, Bland Food, competent to just work kind of staff.", 
    "review_date": "2014-03-13"
  }, 
  "AqwTAjoyG5HfhQi2-ab4cw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice W.", 
    "review_text": "First, the good:  The cocktails here are yummy (especially the earth angel) and the service is attentive. We came here for a late birthday dinner for my fiance and the waiter took the dessert off of our bill.   Aside from the libations and service, the food is uneven (at best) and the portions are very small. We ordered three appetizers (squid stuffed with shredded pork, tuna tartar and scallops) and an entree (the duck). The scallops were overcooked; the squid was a bit rubbery, especially combined with the stringy pulled pork, the tuna tartar was the best of the three, but there was barely any of it! The duck was well cooked, with crispy skin and nice medium rare center.   We shared the ice cream sandwich for dessert. It was good, but unspectacular.   Overall, I was disappointed by my dinner at Prospect. The bar menu actually looked pretty promising so we might go back for dinner at the bar/lounge area. Definitely not worth the money.", 
    "review_date": "2013-07-01"
  }, 
  "AjHFgLursLNKyzsqG_Y4VA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linus W.", 
    "review_text": "Excellent fancy pricey dinners here that attract a business casual or better crowd, but this review is for brunch.  Prospect is actually reasonably priced for brunch! But I suppose it's also due to all the decent to great brunch competition in SF and that corner of the city alone. The crowd was decidedly younger and more casual dressed; the restaurant was maybe half full at any given time. Brunch seems like a good ploy to lure in the younger crowd, and get them more intrigued about the pricier dinners. At least our super talkative waiter really hyped dinners up. On to the food:  The pumpkin beignets were pretty good, but I wish they tasted fresher. They weren't as warm as you'd expect if it came recently out of the fryer and into the sugar; oh wait, it may have been our over-caffeinated waiter being a tad extra enthusiastic about his accent and us not wanting to be too rude by stuffing our faces while he spoke, haha (he was cool though; just wish that if our food doesn't need a little cooling down when it's served, I'd love the friendly banter more during order/dessert taking ;). I'm guessing they also prep batches in advance given the volume, so they can squeeze in a little of the pumpkin sauce filling more efficiently. They come with a ton of chocolate and bourbon caramel sauces, but they can be overpowering relative to the pumpkin flavor if you use too much.  Pork cheek cassoulet was very tasty; get it. Heard they have a similar version using swordfish for dinner. The omelete of the day (chard and goat cheese) was a healthy portioned size, not overly huge like say, Stacks. That was good as well, although I most enjoyed their slice of their perfectly toasted buttery epi baguette, so simple and so good... It also came with roasted potatoes, but eh nothing special there.  Lastly, we topped it off with a bag of their cacao nib carmel popcorn. They gave it to us in a cute little Prospect brown bag, which was great for taking to go and munching along the bay. Hooray for brunch!", 
    "review_date": "2013-01-09"
  }, 
  "8nZ3Ku4yC5HJxY_m0WFsGQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "I've only been here for happy hour and the main reason that I come here is for the FRIES. I'm not sure why these are so good but they are thick steak fries that are perfectly cut and seasoned.   I'm not overly impressed with their happy hour drinks. They generally have three wines, three beers, and three cocktails for $6-$7.   Prospect is right across the street from Google so expect the HH each night to be comprised of roughly 50% Googlers.", 
    "review_date": "2014-10-22"
  }, 
  "OgG8rL8f--5RFsQreU6M3g": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "David C.", 
    "review_text": "Went for lunch! had Wagyu Bravette. 1st mistake was ording it medium. it came out well done. I shoulda said smtg. The french onion dip tasted old and refrigerated. had to ask for bread 2x. the waiter was bad. didn't know anything about the food even though he's probably been there for years! asked him about the fried squash blossom and the cheese. he gave me the wrong info. the blossoms were nothing special as well.  U can tell u put on a fake smile and got away with bullshitting to get his tips. the other server bringing the food was alot better. he deserves a tip.  only thing good about this place is the high ceilings and clean \"upscale\" feel. But there's def tons of restos with better food and ambiance. so skip this joint!!!", 
    "review_date": "2014-08-25"
  }, 
  "aTcai7UJqimgBFR8cxsj6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vee V.", 
    "review_text": "I really really adore Prospect!!!  Just the building itself was a piece of art from the windows to the entrance of the restaurant. Loved it. The many stewardess were pleasant and sat us at 7:45pm for our 8pm reservation, without hesitation. The place was packed on Christmas eve but it was a friendly environment. It's a huge place and i just love the color sequence, all the drawings, the huge tree branches and the hanging lightings: Superb on the little details!!!  Servers were friendly and quick to help with the ordering process, never pushy.  We ordered: Aviation/Mimosa and the King (something cocktail on their menu) Wagyu Tartare, Sashimi of Kona, and for entree, we had the filet mignon (really??? is it possible to be THAT perfectly cooked and seasoned!!!!) and lastly, the sea bass...perfectly flakey, veggies were not bland. We were still able to order dessert =) so we picked the ice-cream sandwich topped with toffee....YUUUUM  This place tops my expectation. WILL come back for another special occassion.", 
    "review_date": "2012-12-26"
  }, 
  "ryii9dUgHXDWeedJy-JNLQ": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Johnny A.", 
    "review_text": "Over rated restaurant , after hearing a lot about it we decided to give it a try,the food was ok and we got rushed so they can seat others and on top of that we paid over $250.", 
    "review_date": "2014-04-26"
  }, 
  "JwlHgkZuXS6rNE9Za2IVMA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin M.", 
    "review_text": "My chauffeur, Alfred, pulled up along the curb right in front of Prospect.  He opened my door... and as I stepped out with my beautiful wife, I made sure to put my elegantly carved wooden cane to use for my bad right knee.  To be sure I was on time for happy hour, I pulled out my Audemars Piguet classic pocket watch from my charcoal grey n textured custom tailored Zegna sports coat.  Ah... perfect 3:51pm.  9 minutes until happy hour menu would start.  I started to make my way to the entrance while Alfred closed my Bentley door behind me.  Before I even made it to the door, their entire staff including their chef, manager, and owners quickly gathered to greet me.  Swell.  My love and I made ourselves comfortable on their sofa while we thoroughly enjoyed their wood grains and contemporary decor throughout the restaurant... what grandeur.  We got things started with a happy hour sparkling for my lady... it was very acidic and sour as if it were a pure sparkling lemonade with no sugar.  To our luck, it was a very warm weekend so the sparkling turned out to be quite refreshing.  We most likely won't be ordering that again.  For a more substantial cocktail, I had the Booker's Old Fashioned, a very attractive mix of Booker's gin, agave nectar, prospect bitters, on 3 cubes of ice and lemon rind.  Quite the sipper... but they must've thought I couldn't hold my liquor because it was a small cocktail filling about less than a third of the rock glass maybe even a fourth if it wasn't for the ice.  A few happy hour snacks before our fancy and lavish dinner to seduce our appetite for the night.  My palate danced with their devils of basil pesto and cherry tomatoes... egg? basil? pesto? devils?  Some of my favorite things in life all in one.  Exquisite.  Fried Shishito and Jimmy Nardell Peppers... accompanied by a wonderfully crispy pork belly and wasabi breadcrumbs.  Peppers and pork belly... mouthwatering.  Wasabi... irrelevant although the breadcrumbs were a nice light crunch.  The Saffron Arancini were fried to crispy golden little spheres with a fluffy risotto-like filling.  What was not to love?  Last, the Chicken Liver Mousse with dates and pickled shallots on crostini.  A little too sweet for my tastes but was enjoyable nonetheless.  I'd say that was a successful happy hour...  HOWEVER... Let's straighten out some fibs and confirm some truths to my story.  I don't have a chauffeur and I drive a toyota.  The only Bentley I can afford at the moment is the one in my dreams.  I am not married... but I very well should be because my gf is just amazing.  I don't have expensive fancy Zegna tailored suits, a luxurious Audemars Piguet pocket watch, or a rich man's cane.  I had my cap on with blue jeans and a t-shirt.  My knee isn't in its best shape... that is true.  I wasn't headed to an extravagant dinner, rather it was going to be some quick home cooking.   I'm gonna go out on a limb here and say that my beautiful gf and my bad knee wasn't enough to get any greeting whatsoever at the door.  We sat ourselves without being greeted even though they saw us walk in.  Maybe if I had a Bentley or a nice designer suit, then that server I approached would have perhaps given me better help with my questions about their happy hour.  No smile, no eye contact WHILE we were having a quick Q&amp;A.  He looked rather flustered with wiping down the happy hour leather padded menus I so desperate wanted to look at.  10 minutes before happy hour would start, I asked the bartender if there was a happy hour drink menu I could see... he says it's not 4pm yet.  That was it... that was all to his answer.  I think it wouldn't hurt to let me see the menu though.  Funny because the server said the same thing when I asked to see the happy hour food menu while he was wiping them down but he didn't let me see a menu until I insisted he hand me one just so I know what I would want to order once their kitchen opens at 4.  They weren't mean about it or anything but the air about the whole place and the staff was a little snooty and arrogant.  Just stating the obvious.  Their happy hour menu is pretty tasty and pricing is very reasonable.  I've been here quite a few times for dinner and it's delicious!  Normally it'd be a 4+ at my dinners but 3.5 this time and I will have to round down on this one for a 3.", 
    "review_date": "2014-09-11"
  }, 
  "mXZB1UNfg-o22aKtogsXqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott S.", 
    "review_text": "We were 30 minutes late to our reservation, but because we called ahead, they held our table for us. In addition, we were running so behind that we had to get in and out of there in a very short period of time to catch a show. Not only did they jump to the task, they did it with the friendliest attitudes and smiles one could hope for. They offered to hang our coats for us; they got us a great table, the food was superb and came out lightening fast. A huge thanks to the team at Prospect for making what could have been a much more difficult evening a really lovely one. We had just enough time to walk from Prospect to YBCA, use the loo, and be seated just before curtain call. Perfect.", 
    "review_date": "2014-05-27"
  }, 
  "Ev_amBB89kBOEkEWgnXBHA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "we ate here for the second time on Sunday night, for our anniversary - we were impressed but not awed the first time around, but Sunday was a home run  FOOD:  SCALLOPS were ridiculously good - best Ive ever had - seriously; BEEF TARTARE was a nice portion, super fresh, and came with a great sauce and tiny egg to flavor with; DUCK breast was perfectly cooked and the sausage was packed w/ flavor w/out being too fatty; SALMON was on the small side but so fresh and expertly cooked.   SERVICE:  we were late, then later, and they moved our rezy time w/ a smile, 2x; when we arrived they seated us promptly; during the meal 3 different waiters tended to us w/out delays or being over-bearing; dietary restrictions were met; special requests were accommodated - we felt special.    we'll be back again, for sure - its worth the extra $$$", 
    "review_date": "2013-10-29"
  }, 
  "YGqZcpWFm-VLujusKRRrPQ": {
    "user_rating": 3.0, 
    "user_location": "Lodi, CA", 
    "user_name": "Carma W.", 
    "review_text": "I wish I could give them 4 stars. The food was good but the service was horrible. They didn't attend to us unless we flagged someone down. You would think high price comes with excellent service.   I had the pork belly and it was cooked to perfection.", 
    "review_date": "2014-08-12"
  }, 
  "IuiiFNh3ATUTWy-p8EiQyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard K.", 
    "review_text": "Fine dining.  Open for lunch now and crowded during dinner and the workweek.  Great service, great food.  The main menu is a little limited, but if you ask for the bar menu as well there's actually more options on there to supplement your meal.  The cuisine is straight American.  Nothing out of the ordinary.  The patrons are generally older types ... not a very young crowd.  You are near the Financial District after all.", 
    "review_date": "2013-12-12"
  }, 
  "TFG9is4PkeHzo0iwilsX3g": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Amelia C.", 
    "review_text": "Delicious food and lovely location for a private party. Room was large, quiet, and felt warm.", 
    "review_date": "2014-09-20"
  }, 
  "w7RP1MZad3YO7Vjgp3s3Dg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claudine V.", 
    "review_text": "Came here for a business dinner and had a really great time. Well especially if you are not paying and only ordering anything that your eyes sees on the menu.  Reco: 1) Ribeye - ask for brussel sprouts or any other greens because this is a big plate of protein. Comes with bone marrow, so for all the meat lovers and carnivores, I highly recommend this. This is big enough for two or even 3 people.  2) Berkshire Pork- YUM!!!! Succulent, melts in your mouth and again potatoes can be replaced with greens, get the Brussel sprouts.  3) Halibut- cooked to perfection.   4) Kale and Radicchio salad with goat cheese- GET IT! Do I need to say more?  5) Hawaiian Kampachi- LOVE THIS ONE. This dish has an array of flavors that just plays so well in your mouth.   6) California Burrata- just okay. Had better one somewhere in the Mission. Comes with pork belly and sundried tomatoes.   7) Strawberry Rhubarb Crepes- delicious and not overly sweet. Perfect pairing with a Red port wine.  8) Caramel popcorn - Delicious!!!   9) Ice Cream Sandwhiches- aacording to my team- tasty!!  10) For the Gin lovers like me, ask them to make the High Thyme with Gin instead of Vodka. Luv it!!!! Can have 4 or 5 of this.   Service is excellent and our server made really great recommendations.  Great place for Happy Hour because the place is packed on a Thursday evening!!  Well done Prospect!!! I will be back yet again...", 
    "review_date": "2013-04-07"
  }, 
  "3j62QQ6WDT_M6KbOtgw2ZQ": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Cindy L.", 
    "review_text": "UPDATE:  Sadface.  Major sadface.  They no longer serve brunch on the weekends.  I'm devastated.  If I had known, I would've ordered the entire brunch menu and camped out there every weekend until they no longer served it.  On the bright side, I do get to explore other brunch options in the city.    I love brunch. It is my favorite meal because it's breakfast and you don't have to wake up early for it. And it's also a good excuse to start drinking early in the day, if you need one.   This place does a superb brunch. With a partially rotating menu due to its use of seasonal ingredients, it offers a nice selection of both sweet and savory fare. The ricotta doughnuts are a must try...it's like a beignet, but levels better.   Today, I got the Peaches and Cream pancakes: cream cheese pancakes, peach syrup, bruléed peaches, whipped mascarpone, and honeycomb. (I added a side of bacon.) Mmm.  And to drink, the Spring to Life: Gin, Raspberry Gum, Grapefruit, Soda, and Rhubarb bitters. Need I say more?  The service here is beyond excellent. The staff is always courteous and helpful. I rarely find myself in need of anything. The ambience is one of modern decadence with a bit of a hipster touch. In other words, \"it's fancy!\"   I've tried to go to other brunch places in the area but their appetizing menu and my subsequently happy stomach always pulls me back here. Must be love. ;)", 
    "review_date": "2013-08-18"
  }, 
  "q_cYc9EJN1fzV7zwzc6MkA": {
    "user_rating": 2.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Analisa S.", 
    "review_text": "I don't know why, but I really want to like Prospect so I gave it 2 shots. And both times I was pissed I spent the money.   The first time I went, I ordered the Lobster gnocchi, its a $25 entree, but I figured no big deal, its a nice place and I am eating lobster even though its shredded into little balls mixed with potato. There were 5 of those teeny tiny gnocchi on my plate. 5! I couldnt believe it, I ate them and paid my $30 bill went home and grabbed an In &amp; Out Burger. I couldn't believe I was left starving after a $30 meal.   I tried it one more time but was smart to go for the happy hour this time. Got some deviled eggs and the french onion dip - still wasn't impressed (especially for the cost). The french onion dip is a half of cup of a recipe I make off Bon Appetit for caramelized onion dip.   Its not worth it - at least not for me. I gave it enough chances, Prospect is officially off my list of places to eat.", 
    "review_date": "2013-06-10"
  }, 
  "25EV693IB3n1q6hqshgALA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Iris H.", 
    "review_text": "Came here for dinner with three others last night and it did not disappoint. It's been a while since I've been back so I was nervous whether it was still as good as before (since it was one of the suggestions that I thrown out to my friends when deciding on places to go). Service was great and the food was delicious. The food took a little longer to come out but we had drinks in hand and one of my friends brought props to take photos with so we were occupied/entertained. After our meal and dessert, we asked the hostess to help us take a picture and she was so nice and friendly, she even suggested us to go to another wall for better lighting!  Food/drink- I ordered the pork chop ($33.5) and it was pretty huge and cooked perfectly, it came with purple sweet potato gnocchi and endive which were good and the dish was nicely seasoned with asian pear, pomegranate relish and escarole cream (that I had asked to be served on the side and they did). I had a class of Sancerre ($14), recommended by the waiter when I asked for dry wine and it was sooo good! I chose their house made pear sorbet ($4.5) for dessert and it tasted like a really ripe pear, it also came with an almond biscotti cookie that was light and yum.  I've dined here previously for dinners and brunch as well. Never disappointed. I remembered their duck being delicious (but it wasn't on the menu last night), their tartines being light and fresh and their monkey bread being sweet/rich but perfect with a cup of coffee for appetizer to share for brunch.", 
    "review_date": "2014-10-18"
  }, 
  "2t2HCw37rOKKWnT8C_yDng": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Candice H.", 
    "review_text": "We came on a Sunday evening to celebrate my mom's birthday.  When we arrived, it was still pretty empty in the dining area and bar.  However, maybe an hour later, the place was filled up.  We were given our menus and some time to look through it.  When our waiter came back, we told him we wanted the spiced fries and foie gras to start.  He told us that the spiced fries were only available at the bar.  We told them it was on the menu, which he pointed out the bar menu was inserted into a few of our menus by mistake.  We were a bit disappointed we couldn't order the fries, but our waiter made an exception.   We ordered the following apps/entrees:  -Prospect Spiced Fries,   Aioli - <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=BP3q6sfToMw7Kd8nyghWeA#BP3q6sfToMw7Kd8nyghWeA\">yelp.com/biz_photos/pros…</a>  -Foie Gras - <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=sBeE3zeJ2RDkpLPXXtNA6g#sBeE3zeJ2RDkpLPXXtNA6g\">yelp.com/biz_photos/pros…</a>  -Snake River Farms Kobe Bavette  -Pork Chop (don't remember the name) - <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=Fefjiqp88VZ8kybp0S7t_w#Fefjiqp88VZ8kybp0S7t_w\">yelp.com/biz_photos/pros…</a>  -Liberty Valley Duck Breast - <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=5jkN59MfSXIoF8tX0m3X4Q#5jkN59MfSXIoF8tX0m3X4Q\">yelp.com/biz_photos/pros…</a>  -Grilled Local Swordfish - <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=VNYPynfldAwxyNtgTKv-Og#VNYPynfldAwxyNtgTKv-Og\">yelp.com/biz_photos/pros…</a>  -Short-Ribs (don't remember the name as it was a special) - <a href=\"http://www.yelp.com/biz_photos/prospect-san-francisco?select=or4mchzA1Bz7KhyGEMo5Bw#or4mchzA1Bz7KhyGEMo5Bw\">yelp.com/biz_photos/pros…</a>  The fries were served with an aioli sauce.  It was pretty tasty, but a bit too crunchy (I think it may have been a little burnt).    The duck liver pate was decent, but I had better in France.   Everyone seemed to enjoy their entree as I didn't hear any complaints.  I ordered the pork chop, which I thought was DELICIOUS.  It was very juicy  and nicely brined, which was a plus.  It's probably one of the best pork chops I've ever eaten at a restaurant as usually pork chops come out dry.  I really enjoyed this dish.  Dessert:  -Ice Cream Sandwiches - must order!  this was DELICIOUS! -Beignets - not memorable  Wrap Up:   Prospect is Boulevard's spin-off.  Prior to coming here, I had heard mixed reviews about the place so I didn't know what to expect.  I was skeptical of trying Prospect as I wasn't a fan of Boulevard at all.  However, I'm glad I ate here as the food was great.  The service is definitely better here than Boulevard.", 
    "review_date": "2013-04-04"
  }, 
  "8JVOK2VhNikjbmFdEdYPqQ": {
    "user_rating": 5.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Mindy S.", 
    "review_text": "I am pleased to tell you that my friends and I decided to dine at your restaurant for a special Birthday. The entire Restaurant was phenomenon and not a single detail was left unfinished; from the French doors to the silver ware to the art work all around. We were really impressed. We were quickly seated after valet and coat check-in - major plus. After some time looking over the thought-out menu, we decided to go with a couple bottles of wine, appetizers and dinner choice. The presentation of each meal was set to perfection. The taste of each bite was orgasmic. We had a good time, chattering, laughing, drinking and it felt nice.   Unfortunately, I have to report that there was a couple disappointing factors that would prevent us from returning or recommending your restaurant to others. Please hear me out and let me know your thoughts:  1.) Our server, Gregory, seems extremely busy during his attendance with us. He seemed rushed and flustered when prompted with questions about the wine options. He failed to check on us during dinner time. We scanned for him in the vicinity of our table and when we found him, he was so busy; we could not get eye contact. We ended up flagging another server to request for more wine and water. This is very disappointing as this made the experience less enjoyable considering the stature of the restaurant.  2.) After our plates have been cleared from our tables, we were left unattended for about 15 minutes. I was very annoyed by this point so I asked another employee to grab our server. When Greg arrived, I asked him what kind of desert is available for birthdays since he did not give us a desert Menu. He answered with \"Ice cream sundae but we have other options\". Seeing that he failed to even offer one desert menu, we just went ahead with the Ice cream option. After what it seems like poor customer service, we decided to just ask for the check.  3.) Greg brought our check over; we gave him a couple cards in addition to cash as we split up the bill. . He brought back our cards to sign but failed to bring back any change. We were hoping to get some change back since we wanted to tip the Valet guy. I was really surprise and for the first time, the server doesn't return my change. What if I wanted to tip from my Card and Keep some cash for our next endeavor?  Overall, I can not recommend this place whether it's a birthday, meeting or just a hang out. Not sure how to qualify to get better service as I see others on here giving them 4-5 stars.  10/23/14 - After having a horrible experience the first time, I got in touch with management. Quickly Cathy turned things around for me. She convinced me to try again and apologize for my first experience. I brought my boyfriend to try it for himself and we were very pleased. The Staff were extremely professional, warm and helpful. Each made our dining experience a 5 Star. I was thrilled to meet Cathy as she was such a kind and sincere person. I'm glad she is part of Management because she truly handled this kind of problem very well. BTW, besides knowing how to fix a problem and providing great customer service, the food was amazing. My taste buds were going crazy with each bite. The Steak was cook to perfection. I'm definitely coming back.", 
    "review_date": "2014-08-13"
  }, 
  "WV2Ftwop83phWoT_uJVptg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Tim E.", 
    "review_text": "Solid place for an after work drink and a snack.  Service can be a bit spotty, but great location and really good happy hour options.  Also a surprisingly good lunch option when you sit at the bar.", 
    "review_date": "2014-09-24"
  }, 
  "YGEQoYKCs0nJ05VRAKShSg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zelda Z.", 
    "review_text": "I made a reservation through Open Table.   This does not mean that it is appropriate for the restaurant staff to call me the day after I ate there to ask about my experience. It is intrusive, off-putting, and a misuse of personal information. By the way, they called on a Sunday afternoon -- i.e. sacrosanct relaxation time in all meanings of the word.   I doubt anyone calling on weekend has purely innocent motives. Just a word of warning to people thinking to make a reservation -- this restaurant thinks it's okay to call you AFTER you've eaten and paid them.", 
    "review_date": "2013-04-08"
  }, 
  "Yhg6xrt66dck2JnVCCC2JA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie F.", 
    "review_text": "I came here for lunch this week and was very satisfied. So many wonderful options on the menu, my friend and I couldn't decide so we got some things to share:  Ahi Tuna Tartare French Onion Dip with House Made Potato Chips Meatballs al Forno  WOW! Everything was so good. Some of the best french onion dip I've ever had. The star of the show were the meatballs. You get two of them, but these things are huge. They are served wading in a pool of yummy polenta.   The place is very nice inside and host to many professionals in the area. The staff is friendly, attentive and quick.   Great dining experience!", 
    "review_date": "2014-04-11"
  }, 
  "9IR0hSwtnffo8rBxDX-40g": {
    "user_rating": 4.0, 
    "user_location": "West Hartford, CT", 
    "user_name": "Ashley N.", 
    "review_text": "Other than us not being seated at our reservation time and had to wait a good 30 minutes, the service was phenomenal (at the table) and the food was amazing! I had the duck which was cooked to perfection and I practically licked the plate clean. The mushroom appetizer was also delicious and the perfect amount of food right before my meal. Wine, also amazing! Really can't complain about this place other than it was disappointing that we had to wait even with a reservation but understand things happen and people get caught up in their conversations. When I'm back in SF, I'll be sure to come back to this place and try the salmon dish, which a friend ordered and looked heavenly.", 
    "review_date": "2014-05-19"
  }, 
  "J4woGS9cTpxZuApy5TAkVQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "paul u.", 
    "review_text": "Prospect is amazing! The service and food was absolutely stellar! From walking in and being greeted with friendly hospitality to our final drinks after desserts. Everyone from the host,server etc was fantastic. Nothing but the best! Definitely recommended and look forward to dining there again.", 
    "review_date": "2013-10-19"
  }, 
  "bo0Y9zIl-uP_UqQ6og8cHA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lucy H.", 
    "review_text": "Love this place.  Great food and service!", 
    "review_date": "2014-06-25"
  }, 
  "funoDDGxT_eqmdVgaSRarA": {
    "user_rating": 4.0, 
    "user_location": "Riverside, CA", 
    "user_name": "Michael P.", 
    "review_text": "Started with the white truffle risotto which was incredible.  My wife had the beet, burrata and truffles salad that was great.  I got the scallops with heirloom carrots.  The scallops were done perfectly,  the carrots were charred as intended but it was more like charcoal. I don't like carrots anyway so it was no loss,  The service was fine.", 
    "review_date": "2014-11-23"
  }, 
  "f92md2NWsZTEUjI7Fr3tHw": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Claire W.", 
    "review_text": "Good place for a date night or if you are feeling a little luxurious and want to try some California style new American cuisine that uses a variety fresh ingredients to create dishes that are both pleasing to the eyes and chuck full of surprising flavors combo.   It's of a higher end restaurant so both the ambiance and services are great. Went there on a Monday evening and it was so \"happening\" and busy and since we had made reservation we didn't have to wait.   I enjoyed everything we ordered, including beef ribeye, salmon, ahi tuna tartar and a bread and salad dish. Loved the beets that came with the salmon dish, and the arugula that came with the burrata dish. The ingredients were fresh and the flavors were great and the portions were just right for the two of us to share. The dark chocolate ganache cake was also great, not overly sweet.  If you like Boulevard, you would also like Prospect as they are sister restaurants.", 
    "review_date": "2013-06-27"
  }, 
  "-SngsZESdOsuzzII_kZQqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christiane V.", 
    "review_text": "Oh. My. God.  Last night 3 friends and I had dinner at Prospect after not feeling Waterbar post a few drinks in the cold...we wanted something hearty and warming and boy did we pick the right spot!  We started with the white truffle gnocchi (2 orders), seared scallops, and cucumber avocado crab salad. The white truffle gnocchi is a game changer, I could literally eat pounds of it. And then probably succumb to heart failure, but it would be well worth it. The scallops were also delightful and perfectly prepared, and the avo crab salad was fresh and delicious, seasoned perfectly with a Thai flair.  Two of us then had the Kobe bavette- so good. Whatever that sauce is...it is like crack! I couldn't stop scraping my plate to get one last taste! Another friend ordered the halibut which was also delicious, perfectly flaky and tender, not over seasoned so as to mask the fish. Wonderful. The last member of our party had the swordfish. Wow. This dish was killer! So much flavor, nice and steaky as swordfish should be, but tender as all hell. Just amazing.  We didn't stop there. Of course not- how could we neglect desert?!?! We got the bon bons, the mint ice cream sandwich, and the cheese plate. All were incredible beyond measure, but the mint ice cream sandwich really resonated with me. The mint in the ice cream was fresh and bursting with organic flavor, no mint syrup used here! So good. I am depressed that this meal is over.  Service was also amazing. Our server Anson was friendly, super helpful, and made legit suggestions without seeming to push anything. In a city where bad servers abound, Anson really shines! The Sommelier was excellent as well; the first bottle we ordered had oxidized a bit and thus I regretfully had to send it back. He was extremely accommodating, as was his assistant, and cruised right on over to help me select a replacement. The replacement, by the way, was such a great bottle of wine I wanted to drown in it!   Overall this place is awesome! I have come for lunch a lot, but the dinner menu is absolutely worth testing out! Woohoo Prospect!!", 
    "review_date": "2014-10-10"
  }, 
  "yTSn0--Ztk32qfqEXrSYTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dylan T.", 
    "review_text": "Went here for my mom's birthday and was not disappointed.  Walking in, you are greeted with the modern looking bar with glass windows looking out onto the streets. Go back a bit more, and you enter the dining room with their nice pieces of artwork and table set ups.  Choice of Water: Tap or Sparkling, complimentary for both.  What I had the privilege try:  Seared Day Boat Scallops with truffle shavings and potato Gnochi: The scallop was cooked perfectly on this dish and its flavored enhanced by the truffle sauce and the truffle shavings. Not to mention the potato gnochi was nice and fluffy and soaked up the truffle sauce to top it off.  Seared Monterey Abalone with Crispy Pig Trotters: The highlight of the dish was truly the crispy pig trotters. If they made a dish of that alone, I'd be all over it. The trotters were nice and crispy and was a mountain of flavor in your mouth. The abalone wasn't too bad either, but it was overshadowed by the trotters. Still a solid dish nonetheless.  Snake Rivver Farm Kobe Bavette: This was my first time having bavette but I am a true believer now. The meat was so tender and juicy that it really melted in my mouth. Along with the mushrooms and potatos, it made for a well prepared dish.  Local King Salmon with Crispy Skin. The salmon was well cooked and full of flavor and was only made better with the addition of the nice and crispy skin.  Liberty Valley Duck breast: the duck was cooked just the way i like it with the fat and nice tender bites. The flavor was all soaked into it and every bite released the juices of satisfaction.  Dessert: Unfortunately they just stopped serving the ice cream sandwiches the week before so we tried the Chocolate Praline Bonbons with Valrhona Fudgesicle, Caramel Cream, candied rice crispies, and chocolate sabayon  I enjoyed the dessert very much. The rice crispies went great with the caramel cream and sauces on the plate. The bonbons themselves were deliciously chocalatey (emphasis on the chocolate part) and would satisfy any chocolate lover. Although i was looking for a softer middle (like vanilla ice cream filled bon bons), the more solid chocolate middle wasn't too bad either.  Although the food was all fine and dandy, my only qualm was the plates weren't warm coming out and the food on the dish was at best luke warm. Otherwise, I really enjoyed my experience here.", 
    "review_date": "2013-10-21"
  }, 
  "C69qzK8C7cxntmdSALgrAQ": {
    "user_rating": 3.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Janet L.", 
    "review_text": "NOT CONSISTENT.  I would've given them a SOLID 5+ stars for my first visit.  Food was great, service was OUTSTANDING...  2nd time, food was sub-par, service was annoyingly below par....especially when we had had such a great experience prior.  I'll wait for them to open for lunch and try them again...  *sigh*", 
    "review_date": "2012-11-06"
  }, 
  "P561nJlF8nDFzyHgrWkARA": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Shirley H.", 
    "review_text": "Would have been 4 stars but service needs improvement.  The bus was a little too efficient in collecting our plates even though we weren't finished.  I asked the server for two bowls and spoons and she whisked by, dropped off two spoons, didn't say a word letting us know she will return with the bowls, instead left then returned with the bowls.    The duck mousse and calamari appetizers were excellent.  Don't bother with the lobster bisque.  It was way too runny and lack of lobster flavor.  The short ribs were very tender but you only get about four slices.  My companions said the special of the day oyster po boy was good but not the fried chicken ramen.  She said she had it better elsewhere.  Ordered the apple pie sundae and came to my shocking surprise that the small cup of sundae cost $11!! The sundae had two small scoops of ice cream, one small scoop of whipped cream and about a table spoon of Apple meat with cookie crust.)   It's part my fault that I didn't pay attention on the price on the menu.  The point is I'd pay for a $11 dessert if it's worth the price but this sundae completely not worth the price.  It's not very often I felt ripped off but this sundae definitely was one so be warned.  Overall, price is on the higher side comparing the portion that was given.  Quality of food was a hit and miss but on the above average rating.  Will return for lunch but will skip some dishes and watch out for the prices on the menu next time.", 
    "review_date": "2014-11-30"
  }, 
  "DRM1tk2QLcTc4duoXKwprw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony B.", 
    "review_text": "The food and environment was great. I sat at the bar, and had great service from the bartenders. Would def come back!", 
    "review_date": "2014-11-15"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "Came here recently for a friend's birthday, and it's a really solid place to go. If I were making a bit more per year, I'd come here much more frequently. BUT. Not making THAT much, I still didn't feel awkward, so bonus points to you, Prospect!  Scallops: Pretty nicely done. It was just a TOUCH less seared than I'd like (I kind of like that nice brown crust you get from a hard sear in contrast with the soft scallops), but the taste was really good.  Soft Shelled Crab: This...had the crisp I was missing a bit from the scallops. It was to a point of overly crispy, but it might have to do with the fact that I only had a claw/leg of the appetizer.   Stuffed Quail: Only had a bite of this off my friend's plate. It was good, albeit a bit overly salty. The stuffing was the salty part, and it was SO good, but my friends couldn't finish the stuffing because it was overly salted. Maybe if they paired some bread...but I feel like that might be blasphemous. The quail was done very well and was super tasty. Lots of rosemary taste, so if you like that, it's a winner.  Pork: I had a bite of this as well, and it was good. Almost made me wish I ordered this instead.  The pork was done perfectly - just a touch pink in the center, which always makes me happy. It's terrible to overcook pork, and if you have good quality meat (which, I assume Prospect does), it's nice to highlight the meat. Juicy. Yum!  Swordfish: This is what I decided on, and it was pretty solid. It came with some potatoes (papas = fried potatoes), which were good with the sauce it came in (aioli maybe?). The swordfish was cooked very nicely. I've had overcooked swordfish which is not good. This one was juicy, and cut like a fish steak. It was so good.   Our service was good, until about the end. Our waiter was very nice and friendly, but near the end, he inadvertently became part of the table conversation. One friend mentioned something about hitting the table, and our waiter banged the water carafe on the table...which made my other friend laugh (with a full mouth). She couldn't explain, and he seemed to get a bit upset. Our service went from warm to cool, and there's no blaming him for that. Overall though, the service and staff were very good and on point. They were present when we needed them without being overbearing.", 
    "review_date": "2014-06-10"
  }, 
  "WebwMMfCSe587Xn0aewTFg": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Rose B.", 
    "review_text": "This place is in the neighbrohood of my work and I was so excited when it opened, I went twice - once for dinner and once for lunch. Both times there were problems with the kitchen and the speed an accuracy of service, so I though, I'll just let them get through their growing pains. And I haven't thought of going again based on those poor experiences.  Yesterday I was invited to a business lunch with two colleagues.  We ordered an appetizer to share, then each of us ordered a salad an an entree. We were just finishing the appetizer when a back waiter appeared with what seemed to be our first course. No, he had in hand the entrees ordered by my two friends, and a salad for me that was not the salad I (or any of us) had ordered. We told him it was wrong, he took all three plates away and our main waitress came over. She seemed to have a hard time understanding what had happened but said she'd fix it.  Then the back waiter returned with my colleague's same main course (the same dish, stone cold) AND her salad, my other colleague's main dish again (no salad), and nothing for me.  I told my friends to please start eating without me, and they did. By the time my salad arrived, they were basically done. It was at least 15 minutes. very awkward.  Then they rushed my entree out and the back waiter plonked it on the table in front of me while I was still eating my salad. Literally mid-bite. BY the way, my entree (risotto with a poached egg) was so rushed that the egg was badly undercooked - the white was still basically liquid. I feel sick thinking of it.  The waitress offered by way of apology to take my salad off the bill, which was a nice touch, but when the bill came, it was still there. The manager came over with little baggies of sweet popcorn for us as an apology and we had to remind her that the waitress forgot to take off the item.  All in all it was a cluster-&amp;*^% and a waste of time and money. The waitress and manager both seemed nice, but honestly, this place just can't get it together after all this time.  Spend your money elsewhere.", 
    "review_date": "2014-05-20"
  }, 
  "z9xeaGNs4VyiKomb5GTBGw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua P.", 
    "review_text": "Though the interior design did not put me off particularly, my more-travelled girlfriend couldn't help but liken it to a hotel bar in a nice airport Marriott in Kansas City or Atlanta. I was last here closer to its opening, a time when the décor might have seemed fresher than it does now.  House cocktails were interesting but generally too sweet. We had the Anti-Hero, an almost candy-like drink where the sharpness of white rye is completely lost, and the D.B. Cooper, a much better concoction with good mouthfeel that just didn't quite make it from \"interesting\" to \"delicious.\" I would never complain about such a drink, though: I love trying interesting cocktails even if I might not choose to order one again. I wonder, though, how far the program must have strayed from Brooke Arthur's original vision to arrive where it is now.  House olives were tasty.  Oysters (six for $21) were a variety I wasn't familiar with but which did have a surprising complexity. Some were so creamy the finish couldn't quite cleanse but overall I did enjoy them.  Green Goddess salad had great flavor and texture. The presentation was confusing -- with all the green goddess hidden inside a shell of lettuces we thought we might have gotten the wrong dish. In the end, though, we wished the chef had stuck with little gems; the baby lettuces added more bitterness than the dish called for.  Burger was above average though the bun had no structure. The fries were disappointing (too fat and starchy) but accompanied by outstanding aioli.  Later we asked for a dry Manhattan with Rendezvous Rye and got one made with dry vermouth. When questioned the bartender said, \"oh you meant dry like a dry martini.\" At least he made us a new one, but no color of Dolin vermouth is going to make a Manhattan worth paying $14 for. (We asked but no other variety of vermouth was available. What fancy bar in SF does't have Carpano or Punt y Mes?)   By the end of our time at the bar the bartender had apparently decided we weren't worth the trouble as we had to ask the barback for our check. After I placed the card in the presenter, another long wait was broken by the barback taking the check presenter and placing it into the bartender's field of view.  Later that night as we got ready for bed, I couldn't help but compare two receipts in my wallet from this week: one from Wexler's ($106) where we'd just days ago had a truly wonderful and memorable meal and the one from Prospect ($112) where the experience dripped with disappointment.", 
    "review_date": "2014-05-31"
  }, 
  "cMNtJKUqbcdy8yncszdWRg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Michelle S.", 
    "review_text": "I would give this place 5 stars, but the service is a bit lagging.  With that said, everything else at Prospect is memorable. The decor is modern and inviting and the menu is tastefully appointed with incredible dishes.   We dined with a party of 14 so we were able to try many dishes. What I LOVED the most was the truffle risotto with egg special. It was so good, we ordered 5 plates for the table. The kobe beef tartar was also fresh and tasty. My organic chicken entree was tender, juicy and unforgettable. The halibut entree was also fantastic. For desserts, I highly recommend the almond cake. Every bite was orgasmic.   Overall a great dinner spot, they even have valet!", 
    "review_date": "2014-08-08"
  }, 
  "oLhwobzfPUI4F2pJtdADlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi F.", 
    "review_text": "I wasn't blown away by the food...but service was AMAZING! The entire staff were on point.", 
    "review_date": "2014-09-24"
  }
}