{
  "7-n8imiEmYNrgpUzckiKmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlyn C.", 
    "review_text": "Place is Closed Temporarily Now.  -Great Service -Cool Decor -Comfy Seating -Large Screens -Bottomless Snacks  It was such a great place to sing and/or chill that I didn't want to leave..", 
    "review_date": "2012-07-09"
  }, 
  "YxlDkpO1MlR1LJiU0OtGJQ": {
    "user_rating": 5.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "A hip little \"fobby\" lounge, hidden in an upstairs venue in the middle of Union Square.  Here's why this place is awesome:  -Kareoke!  English &amp; Asian songs.  Grab the mic and sing in front of the whole crowd -Bottomless (free) chex mix and Asian rice cracker snacks at every table. -Cups of dice to play Chinese drinking games -Decently priced drinks (2 shots of vodka and a beer for $25 pre-tip). -Comfy booths and tables. -Great service from bartenders and wait staff -Cozy and comfortable. Not crowded at all. -Very chill place to hang out if you just want a relaxing night out.", 
    "review_date": "2012-07-09"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 3.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "My friends and I went here 3-24-12 9:50pm, and noticed that we arrived here fairly early.  We went up to the 2nd floor and sat at the far end of this bar next to the dj booth.  Initially my friend and I ordered a blue moon beer each ($6 per bottle), afterwards received two complimentary bottles of champaign for the b-day boy (those were gone fairly quick),then my friends +I ordered one bottle of grey goose vodka with coke, cranberry and water chasers. The music was a mixture of rap,pop, etc so that was cool.  I saw this girl from doorway, and she looked familiar, as I called her name, she recognized me--I haven't seen her in over 14 years, we chatted for awhile.  There was a strange occurence, as I walked into the lounge, this girl grabbed my hand, I didn't even know her--eventually made more friends and bought some drinks for them.", 
    "review_date": "2012-03-25"
  }, 
  "w8jvE9soF4xDqyprpUUgjA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Playground C.", 
    "review_text": "This hidden lounge is right across the street from Tory Burch.  They call this place the \"high-end\" of Lot46 because its right above lot46.   they open from mon.-fri and sun. close on sat  their bartenders make awesome drinks, the place has decent decor but has a very comfort and homey yet modern feel to it. This is more of a infusion lounge, there are plenty tables available. They do karaoke from sun-thurs. they have a DJ night on every friday.their prices are slightly cheaper than anywhere else in the city. Its differently a spot to go to kick it with your friends or throw parties at!", 
    "review_date": "2012-05-05"
  }
}