{
  "Eypq5gLLjCapBVVnMw_MyA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Misha T.", 
    "review_text": "I like that you can tell this place has been a bar forever, and while the current iteration is new, it's managed to accumulate enough character over the long years. The music is kinda hit or miss and they play a lot of noise at louder volumes than probably necessary. I was also there on \"copy night\" where someone brought three copiers and a lot of paper and put them on the pool table to let people play. And play they did. Take that trees!", 
    "review_date": "2014-07-30"
  }, 
  "zHJ1pvgp4bT3OICbFXkK0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N B.", 
    "review_text": "Solid ($10-15) cocktails and comfortable mining-themed atmosphere, booths, and a pool table.  Suggestion: put a divider in the men's urinal. Peeing in a horse-trough isn't as much nostalgic as it is awkward.", 
    "review_date": "2014-03-21"
  }, 
  "5Z-3tcM07Pyc4mOF2Rjt6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "I haven't been here in a while, but I think it's a solid bar in a location that I don't often get to.", 
    "review_date": "2012-12-17"
  }, 
  "K9E4zQSmE9KguCxCQZ42Kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "I lpve this place! Cozy, dark, and not do loud it's not talk-able with a group of girls on a Friday night. Also they had Abita Purple Haze which I don't see often out of the South. Cash only.", 
    "review_date": "2012-11-11"
  }, 
  "11XoIrUVyolyZFoni-KdLg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tia B.", 
    "review_text": "Fantastic cocktails. Comfortable decor.   Friendly bartenders.   Unusual, and entertaining bathroom decor. Clientele with an average age 30-something, and mostly local. The only complaint I have is the place has bad acoustics, so it can get loud.", 
    "review_date": "2012-11-27"
  }, 
  "ZhkOEkOPN3p6O1uOkbMytg": {
    "user_rating": 2.0, 
    "user_location": "Concord, CA", 
    "user_name": "Jim Z.", 
    "review_text": "There is nothing remarkable about this place. You can throw a bunch of old-ish looking things on the wall and keep the place as dimly lit as possible, it doesn't give a bar personality. It's in a great location and the prices are pretty comparable to most Deep Mission spots. So it's got that going for it.", 
    "review_date": "2014-03-20"
  }, 
  "LTWUnGE5dCVGFsKuwuWV9A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom P.", 
    "review_text": "Oh Lordy, I thought the only cash-only bars in SF were the gay bars. But this one is cash-only, so think about stopping by the ATM on the way.   OK, the first three stars are because the drinks were tasty and the location is close to me.   But otherwise, the bar is a bit of a disappointment. It's already too-cool-for-school. I just know this bar is going to be the next mini-El Rio. It's going to be swarmed with hipsters smoking their American Spirits and drinking their PBRs.  That said, the drinks were tasty. But in a city filled with awesome mixologists, this bar falls short. It's not hipster-y enough to be a real dive bar. But the cocktails aren't good enough to make it a Churchill or Blackbird or even Royal Cuckoo. So it's just fair-to-middling on all fronts. Sad.", 
    "review_date": "2012-03-11"
  }, 
  "rWDZ20zpA6S5MmfZ2gVuiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandi L.", 
    "review_text": "I came here for my company holiday party so it was closed to the public for a good part of the evening.  Butttttt, drinks were stiff, I like the booths, bathrooms were clean, and Front Porch is across the street...  They're cash only, and there's a cat there but I'm supppper allergic to cats and I was completely fine.", 
    "review_date": "2015-01-04"
  }, 
  "jeG667lpQ2YwvLZDsy-zzQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Karen M.", 
    "review_text": "Really cool space. And Rock Bar makes the best Greyhounds in town. Fresh squeezed grapefruit juice! Absolute yum. Treat yourself to this sweet secret.", 
    "review_date": "2013-06-15"
  }, 
  "6Efvx9BcrKAE9GQckjN7yw": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Ran M.", 
    "review_text": "My kind of place.", 
    "review_date": "2012-11-04"
  }, 
  "Ytq1HaAK4Dc84UnShCnI6g": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Kristin G.", 
    "review_text": "I've been a fan of the Front Porch for a while now.  Boyfriend and I were freezing our asses off after waiting for 45 minutes in the rain to get into a roller derby match without jackets.  We were cold and hungry.  We went to Front Porch, but there was a wait.  So while we waited we crossed the street and went to the Rock Bar.  The service was fast and good.  The waiter made me something warm and boyfriend ordered off of the menu.  Great place to wait for a table, that doesn't feel like a place to wait for a table.  A few weeks later we went there for a pre dinner drink, the bartender remembered us from the prior visit.  It was lots of fun.  **the drinks are strong.  going here for a pre-drink may make you not care about eating and you just drink more.  Fun night but the next day sucked, through no fault of Rock Bar.", 
    "review_date": "2012-04-11"
  }, 
  "GAKaFWOx7uWu-VUniZ11Ow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "donkey d.", 
    "review_text": "This bar kicks A$$ and I mean the donkey kind of way. Super cute interior, great drinks &amp; friendly, knowledgeable staff. This is definitely gonna be my new place to hang. Dad's fire in the hole has a piece of meat coming out of a beer bottle my dad would for sure order this. Pool table and jukebox that is in transition, but I'm sure will be great. This place has a  really nice vibe everyone seemed to be having a good time. Now if there's a wait at the porch it won't be so bad I hear that you can order to go and bring it over also heard the chef is starting up a bar snack program that will hold you over till you get some of that delicious fried chicken. You guys ROCK", 
    "review_date": "2012-02-27"
  }, 
  "-LreZDddVAhDNR0T2M7A8w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob G.", 
    "review_text": "This is a great neighborhood bar. The atmosphere is fun, walking distance from my pad and really nice folks that work there. The only reason I give it 3 stars in they don't have Happy Hour on the weekends? Don't they know right around the corner on Mission Street, a good handful of bars have Happy Hour everyday and some that last 'til 9PM. Anyway, my friends &amp; I will still go in there, but we go elsewhere on the weekends to drink for Happy Hour. Cheers!", 
    "review_date": "2014-02-01"
  }, 
  "ilRlp7psk41wnWAAuhzw1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tara C.", 
    "review_text": "I am head over heels in love with this bar. Our bartender (Ryan?) was awesome and we stayed here way longer than expected because it was just that great! And the Front Porch is across the street! Win win!", 
    "review_date": "2012-07-18"
  }, 
  "YgPjk2Mjq3Uo7LGyQ12koQ": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Marc L.", 
    "review_text": "Great atmosphere, good cocktail and beer selection. We went and ordered from Front Porch across the street. We were able to enjoy our meals and have good conversation. Good option if the restaurant is packed. Which I hear it usually is", 
    "review_date": "2013-08-22"
  }, 
  "moS16ShDlZIMuT_0Lb38gA": {
    "user_rating": 5.0, 
    "user_location": "Bradyville, TN", 
    "user_name": "Susan B.", 
    "review_text": "Fat pours on a delicious version of a Manhattan as well as a house beverage called an Ichi Rock, a gin and yuzu cocktail.", 
    "review_date": "2013-10-29"
  }, 
  "GXQobSAaAxRap5g1cif6Jg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Z Z.", 
    "review_text": "Cozy teetering on the edge of pretty. Warm lighting that makes everyone look good. Close to home. Pool. Great music. Solid drinks. Cute boys and girls.  xoxo", 
    "review_date": "2013-03-17"
  }, 
  "Vf3DJncooLUHWYele0Cxrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "There's a drink here named after Ichi Sushi down the street.  Well played.  Bonus points for the old school bowling machine.", 
    "review_date": "2012-06-04"
  }, 
  "638Y_ympLejLaUsjnbjUZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alan M.", 
    "review_text": "They continue to update the bar and someone painted gold all over the gum stains in the front. I feel like digging for some gold and getting a cold liberty ale!", 
    "review_date": "2012-05-10"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "I never had a chance to hit the International Club when it occupied this space for eons, but the birth of the new Rock Bar across from Front Porch had me wanting to smell what these cats were cookin' as soon as they broke ground (WWE reference, my friends).  It's no secret that I love a good dive bar with a quirky theme, and when you throw in a gaggle of handcrafted cocktails into the mix, it makes it even better.   Not only can you get down on cheap, shitty American beers and craft variations from breweries all around the Bay Area, but you can sip on their version of a martini (Dirty Metamorphic - Dirty Tito's martini with muddled Fresno chilies), something strong, yet delicate for the ladies (Basil Mudstone - Templeton Rye, Pineau, basil, lemon, and white tea), and something noteworthy that'll go viral among your circle of friends (Fire in the Hole - The above-referenced shot-and-a-beer special with Schlitz, Bulleit bourbon and complimentary charcuterie). All of their signature elixirs are quite tasty ( and named after gemstones), but if you want something a bit more traditional, they'll be happy to whip up a classic Manhattan or a Sazerac as well.  If your'e feeling hungry, word is you can order fried chicken from Front Porch right across the street (they own the bar). Talk about the best bar bites ever, huh? If you've yet to enjoy a greasy piece of their renowned fried chicken, you haven't lived!", 
    "review_date": "2012-03-13"
  }, 
  "UfD-8oRn37N290UGx0B8xQ": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Rebecca N.", 
    "review_text": "such alcohol, much delicious  First reason why I knew I was going to like this place? The guy checking our ID was extremely friendly and courteous. I'm a waitress and I deal a lot with people who talk at you, not to you. Half my customers don't even make eye contact with me, they're just enveloped in whatever it is that they're doing. Everyone here was really attentive, and it was just home-y. (while I hung with the homies)  My drinks ruled, hard. I got the Ichi Rock which is a gin and yuzu cocktail, and then their play on a whiskey sour, the winter sour. The sour was so warming and spiced, I felt like I should have been sitting by a fire.   Idk, it was a Saturday night and it was chill as hell. I'm smitten.   By the way, I walked in and a cat greeted me and proceeded to steal my heart. And also a bar stool. Maybe she wanted to try the Ichi Rock too.", 
    "review_date": "2014-01-19"
  }, 
  "ZmVgmEnz8X-m2M8zCd6lkg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt B.", 
    "review_text": "Hipsters. Boring. They have alcohol, so that's good.  I ran into a gaggle of neck beards and my friend and I pretended we were new in town, so they explained that all the cool bars were in the mission on Valencia and on, \"what's that street? A couple blocks over? Mission? Yeah, Mission street.\" Gotta love 'em.", 
    "review_date": "2014-10-15"
  }, 
  "UkBodgI02y5cd8cIaS0cWg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "OhTheRogue S.", 
    "review_text": "$6 for a pint of Speakeasy Prohibition?  This is 29th Street, not downtown, I call BS!", 
    "review_date": "2012-03-03"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Powerful, tasty cocktails. Having tried most all of their menu, their most artfully crafted cocktail is the blood and sand which I would return for in a heartbeat. The others were not made to the caliber I am used to at Bourbon and Branch, my gold standard for cocktail making. I love the vibe, ample seating, and friendly bartenders. I heard you can order bites, and they will deliver from Front Porch across the street.  A few of the drinks I tried...  *Gold Digger ($11) - 3.5 STARS: London Gin, Pear Liqueur, Champagne, ginger, peach. Reminds me of a Mike's Hard Lemonade. Very tasty, a bit sweet. Refreshing.   * Real Thunderberg ($9) - 1 STAR: Four Roses, Bunderberg Ginger, Underberg. Tastes like medicine.  * Rhuby Mule ($10?) - 3 STARS: Vodka, Cherry Heering, ginger ale, rhubarb bitters. Love moscow mules but this cherry version was way too sweet for me.   * Soft Rock ($10?) - 3.5 STARS: Lillet Blanc, soda, lemon, cucmber. Refreshing and tasty.   * ICHI Rock ($10) - 3.5 STARS: London Gin, St. Germain, Yuzu, grapefruit bitters. This was another one that reminded me of Mike's Hard Lemonade. Super refreshing and tasty but not the type of cocktail I gravitate towards. Too frou frou for me.  They also have a decent list of special cocktails listed on their board, which includes my favorite - Blood and Sand.   Tip: Cash Only.", 
    "review_date": "2013-09-03"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "This is the bar that is owned by the same owner as Front Porch.  They serve inventive cocktails (albeit kinda pricy) in a funky old bar atmosphere.    We arrived at 6pm on a rainy Friday night and it was still pretty empty.  The cocktail I enjoy is the one with the vodka, cherry liquer, and rhubarb bitters, YUM.  One friend got a negroni -which was also fantastic.  This is the perfect place to catch a quick buzz before the incredible fried chicken across the street.", 
    "review_date": "2014-02-09"
  }, 
  "Ra6SLcUu--eJ1grdDhaZHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin M.", 
    "review_text": "Great new bar right across from the Front Porch. The interior has nice touches of old mining equipment here and there and it kind of makes you feel like you are in a little miner bar back in the gold rush. House specialty cocktails are poured by bartenders that know what they are doing (try the sazerac) and cost $9 each. Wasn't overly crowded on Sunday and Monday night when we went back-to-back. This is definitely looking like it will become our local bar!", 
    "review_date": "2012-02-20"
  }, 
  "tEaM1ztkCR2YvE4zNz_gTA": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Xenia L.", 
    "review_text": "Delicious, strong, cheap cocktails. Really friendly, attentive staff and generally laid-back clientele. Lots of neat knickknacks, a comfortable space, and some of the more interesting bar bathroom decor I've seen in a while. (Yes, I'm reviewing the bathroom. Seriously, it's kinda great.) I'll definitely be back.", 
    "review_date": "2012-12-30"
  }, 
  "mROok9JZx19AwvOJlI8FHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art O.", 
    "review_text": "I really dig the vibe of this bar. We stopped in here for a couple of drinks while waiting for our reservation up the street at La Ciccia.  It was nice and toasty when we stepped in from out of the cold downpour outside.  At first , I expected a Rock and Roll bar and then I looked around and noticed the rocks - a Eureka moment! The atmosphere was chill and mostly people in their 30's were around which is quite fine by me.  The bartender came over and told us about the mixed drinks. Somehow he appropriately mentioned that there's a discount if it happens to be your birthday and lo and behold it was the lady's B-day (hence the dinner at La Ciccia).  The drinks were expertly done and the bartender kept coming back to see if we were ok which I appreciated. There was only one of the TVs playing quietly in the corner which was perfect. The rain and the atmosphere didn't really call for a bunch of big screens blasting. Just a really cozy bar.  I lamented to the lady that I wish we had something exactly like this in our neighborhood and she agreed.  We'll try to make a special stop for this place in the future.", 
    "review_date": "2013-01-03"
  }, 
  "1meR0R9hm9sSKAyEOhMiWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wen S.", 
    "review_text": "This may seem crazy, but I've never been a big bar-scene fan.  In all honesty, I just went by because I'm a geologist and, hey...it's a geology themed bar (which is freaking awesome).  But man, was I in for a surprise...the drinks are fabulous, the staff is great, and it's a nice place to go chill out for a bit and talk to some fellow bar-goers.  You won't go wrong with the Rock Bar.  Someone mentioned that it's cash only, which is fine - since there's an ATM in the corner.", 
    "review_date": "2012-03-30"
  }, 
  "UAMd72chc72WmhGJYuvJFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gary N.", 
    "review_text": "Another to 5 stars today.  The Niners lost, but everyone who showed up here today, regulars and newbies, won. Drew was rocking out burgers and dogs (and even veggy pads) from the grill to order and to perfection while Adam slung perfect craft cocktails and beers and shots behind the bar.   Maximum effort and maximum effect achieved by both.  Well done. Love this place. You will too.", 
    "review_date": "2013-11-18"
  }, 
  "-v8HOwloL99xoho6sRuzeA": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Krystal A.", 
    "review_text": "I asked the bartender to mix me something up delightful made of clear alcohol. I ended up with a Yuzu Fizz... a citrus drink served in a mason jar garnished with orange peel. Very cool and it tasted great!   There were many tables to enjoy with company and the lighting in the place is great... lots of candles in mason jars along the bar and at the tables.   I think it would be perfect for happy hour and a date night ;)", 
    "review_date": "2014-01-24"
  }, 
  "w67IJw6DQVzhKq4pMc3LlQ": {
    "user_rating": 5.0, 
    "user_location": "Boyes Hot Springs, CA", 
    "user_name": "Locel Y.", 
    "review_text": "if you love the front porch and Emmys you will feel rich at home. It is very spacious with excellent drinks. Just be careful this is the real mission!! LOL", 
    "review_date": "2012-02-27"
  }, 
  "ZXAdoww6OLJArJeQbriYdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin C.", 
    "review_text": "Great bar and cool cats.  Insider tip... douse your smart phone while cooling your heels at the bar.  You'll be surprised by what happens.  If you're lucky, you'll get too meet the coolest cat of them all.", 
    "review_date": "2014-11-17"
  }, 
  "L8Om2473wuZK4LTxLL6RUg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christina R.", 
    "review_text": "I went for my love of sediment, I stayed for the most rockin' jukebox in SF (no pun intended).  Seriously, a collection of psych from around the world? Definitely rad.   Also, there's a pretty plastic pony in the ladies bathroom. In other words, this place has everything.", 
    "review_date": "2012-07-24"
  }, 
  "3FAb-ch2K3K9uQz7N49ITA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Light Bulb J.", 
    "review_text": "Feels like a dive bar, but they make fancy house cocktails for $7 .  They have a drink menu and a list on the wall.  I like the miner theme.  They have a pool table.  Ryan likes the all-alcohol cocktails here.", 
    "review_date": "2012-06-06"
  }, 
  "LTDsWgETDSa1ypOXDCRRvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "david c.", 
    "review_text": "A lovely miner-themed bar in a great spot. It's ideal for hitting up pre and post dinner at The Front Porch or for getting out of the heart of the Mission scene (but not too far out).   The drink menu is a mix of some well-done classics (e.g., Vieux Carre) and some inventive house-made concoctions. Great location, great drink selection, great neighborly vibe and super friendly and attentive staff. Go get you a drink.", 
    "review_date": "2012-02-20"
  }, 
  "DCDvxSJAGXDkTq_kObVi1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stell T.", 
    "review_text": "Dive bar feel with premium cocktails and an ability to order southern food from Front Porch.  What's not to like?", 
    "review_date": "2012-11-03"
  }, 
  "rHoANKeN6KRqxl63Mk948g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brad G.", 
    "review_text": "This place is interesting to say the least.  Wannabe poser hipsters. Pretty hilarious. The guys from Front Porch own it, they're cool. But they seem to have taken on the \"Benji\" crowd in this bar. Go for a drink then have a plan B.", 
    "review_date": "2012-09-21"
  }, 
  "zH-wrE_Gf44Dffm4XPiXZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan W.", 
    "review_text": "Some of the best bartenders around. Keeps it weird.", 
    "review_date": "2014-09-04"
  }, 
  "CvuuFNXA6ykfZSM7fdU_fQ": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "MyShawn C.", 
    "review_text": "Very nice little dive bar.  I really enjoyed the reggae music is the background but wish they would turn it up just a bit.  The cowboy shaped shot glasses were cool, drink special was awesome and the service was nice.  If I'm ever in the neighborhood again, I'd stop in.", 
    "review_date": "2012-04-02"
  }, 
  "dpEtyfB2o7MH1Mc_Ygoolg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron V.", 
    "review_text": "You wouldn't believe me if you were standing outside this place but Rock Bar is one of the top ten cocktail bars in the city. It still scarcely makes sense to me as I'm walking into a building that probably served up about a million fifty-cent Budweisers in a past life. Once you're inside, though, it's clear that you're about to tangle (or tango) with a legitimate establishment.  The manhattans are great. The negronis are great. Weird stuff that they made up (like the Donkey Show) are, surprisingly, also great. Definitely worth checking out if you like expertly made cocktails or a laid-back atmosphere.", 
    "review_date": "2014-01-07"
  }, 
  "vTbQZNz8FH4jcrni7Vkl1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oleg H.", 
    "review_text": "I'm not certain if Rock Bars Negroni is (ready for this?) proper sbagliato*  negroni but it is possibly the best negroni in the city.   First it comes in a fitting rocks glass and not in a foofy martini contraption thats both uncomfortable and looks decidedly uncool, unless you're doing the whole secret agent thing.  Second its served on the rocks - which is what makes it sbagliato - and may cause a purist to take away points, but in this reviewer's opinion - actually enhances the original drink.  Third RB's negroni has a subtle yet distinct smokey fragrance and flavor which takes already properly tasting (neither at all sweet nor harshly bitter) negroni to the next level.   ** proper sbagliato = proper broken/bungled/wrong/incorrect. Not sure that its proper because in Negroni follows the formula of gin, sweet vermouth and Campari, with an orange peel garnish. Negroni Spagliato replaces the gin with a dry sparkling wine, and requires to be served on the rocks, according to some sources, but according to others - all it takes is addition of ice.  PS i dont remember the last bar where music was (forget good) not annoying - but at RB it is decidedly awesome (in both selection, and perfectly not imposing volume) at least it was on one Thursday night 4/9/14. This little detail is what brings this gem of a bar over to the 5 star level", 
    "review_date": "2014-04-10"
  }, 
  "9GCCoFw_UHiAHjZ4kygHgw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren V.", 
    "review_text": "eh.", 
    "review_date": "2012-07-05"
  }, 
  "qwfQNmn8BlM5uoHNIp3Q0A": {
    "user_rating": 2.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Nick O.", 
    "review_text": "So my fiancée  and 2 friends came into this bar, had some delicious drinks, but then came the ketchup/cooking porn on all the screens. We all felt extremely  uncomfortable. I do not recommend for whenever they decide to play stuff like this. Uncomfortable... but decent drinks.", 
    "review_date": "2014-08-22"
  }, 
  "CHd0w17BZ-C0k1yO9lAueA": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Karl Sterling H.", 
    "review_text": "Cocktails are solid. Delicious originals with some great classics. Decor is enough to keep my attention. Also, the bar cat is awesome. Damnit. Great drinks, great cat.", 
    "review_date": "2014-08-15"
  }, 
  "ghaEnX_Wzc8Vfc1kVm_NAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie B.", 
    "review_text": "My neighborhood bar is The Page (love), but I sure wouldn't mind having Rock Bar.  Don't let the dive-y ambiance fool you.  They make some MEAN cocktails!  I had the $8 Rhuby Mule, thinking it would be an interesting twist on the Moscow Mule and hoping it wouldn't be too sweet.  Oh my god!  Sooo good!  Totally different from the M.M. but definitely not too sweet.  Good service, great drinks, local clientele, and favorable ambiance.  Yes, this place is cash only.  Welcome to San Francisco!  You should expect that.", 
    "review_date": "2012-10-10"
  }, 
  "wsi1YboQkG4KZSK7r2pCHA": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Spoo K.", 
    "review_text": "Very dark bar, it was so warm inside. Cash only but they have an ATM inside. Isn't that a side business cuz you get commision for having one?  Nothing exciting here. We just happen to eat our dessert here from the Front Porch.   Drinks were decent. My friend loved the apple beer of some sort.   Quirky toilet. It had a dresser like if you were gonna put your make up, that kind of table. It was fully dressed with fake flowers collecting dust so I was sneezing from that.   I'd be fine if I never discovered this place. I couldn't connect to it.", 
    "review_date": "2014-08-25"
  }, 
  "3HbZDOG3InQCNqKD4hcsxw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Benjamin R.", 
    "review_text": "Went once and won't go back because it's cash only. Pay your taxes like everyone else and stop trying to make extra money off your customers with the egregious ATM fees.", 
    "review_date": "2014-08-01"
  }, 
  "t7g2fD48YrEpxK8K1LyIRw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jade W.", 
    "review_text": "Solid dive bar even though I wasn't a big fan of the Thanksgiving cocktail. Should have ordered a beer. Lots of interesting folks and even some single straight dudes (that's a rarity). Across the street from Front Porch and there are some rocks just laying about that can be used as weapons if need be.   check it out!  Ca$h only", 
    "review_date": "2012-08-25"
  }, 
  "ovG0XGTarNURYK62cMRfEQ": {
    "user_rating": 2.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "Scott L.", 
    "review_text": "I was excited to hang here pre-Front Porch but then was charged $13 for a Michter's Rye ($43 retail for a bottle)--after the bartender measured out the ounce. Drink beer or ask the prices before you glance at the bottles behind the bar.", 
    "review_date": "2014-01-25"
  }, 
  "CR9A6bAPCcHThkAt5kTtmQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth P.", 
    "review_text": "Enjoyed a well-made spicy olive-y martini-like cocktail for a darn reasonable price at this clean, down-to-earth, hip but not full of itself friendly neighborhood bar. Cheers!", 
    "review_date": "2012-04-15"
  }, 
  "Rv_5-ue4omk9xfmZRdnGaw": {
    "user_rating": 1.0, 
    "user_location": "UC Campus Area, Berkeley, CA", 
    "user_name": "Sonny D.", 
    "review_text": "Bartender was an asshole. No pineapple juice or red bull. Otherwise a great experience.", 
    "review_date": "2014-02-08"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "When I knew we were going to be having dinner somewhat nearby, I remembered this was a bar my hubby and I had thought sounded interesting . We had both read about them when they first opened.  When we got there it was packed, (it's pretty small, with limited seating.) We managed to squeeze in at the end of the bar, and snag the last two seats.  Even though it was busy, and there was only 1 bartender, drinks came quickly.His efficiency was pretty amazing to watch. He also managed to be pleasant and friendly, despite being slammed.He even checked to see if we liked our drinks.  After it cleared out a bit, the bartender came over, and we asked for recommendations. Based on what we said we liked ,he made us both some interesting cocktails. My drink was perfect, and highlighted the ginger flavor I'm into right now. It had some unique ingredients in it, and I was really happy with it. My husband liked his, but not as much as I liked mine. Their cocktail menu seems well thought out and definitely has some different drinks than I've seen.  This is a great bar, but be advised, it's ***CASH ONLY.*** Not a fan of that.", 
    "review_date": "2013-04-15"
  }, 
  "1b3o6URSdsIZ5cyvARh-SQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anastasia C.", 
    "review_text": "I've walked by Rock Bar for the past two years and have always thought \"I need to go there!\" Well, I finally did.  Walked in, sat at the bar and ordered a Rum &amp; Ginger Ale - $7 and it was a strong drink, so no issues on the price considering.  After getting my drink, the bartender introduced himself, shook my hand and said it was a pleasure to meet me and checked in, made small talk, etc. The two flat screens had the A's &amp; Giants games on, the Giants game being on farthest from where I chose to sit, the bartender noticed my Giants jacket and offered to switch the game to the TV closest to me, I didn't even have to ask!  My friend joined me and ordered a Jack &amp; Coke - heads up, they use Mexican Coke for their drinks...bonus points for this!  In the 1 1/2 hours I was there Rock Bar quickly became my new neighborhood favorite and I'm kicking myself for not going there sooner!", 
    "review_date": "2014-06-04"
  }, 
  "MKrCIkMT8baMkATt4fmzag": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Alice C.", 
    "review_text": "The Rock Bar?! I think they really got the idea to have a miner themed place when they took over the International Club, and didn't know what to do with all those tacky rock veneer on the outside: hey, we have all these rocks, and let's name it the Rock Bar!  Okay, back to the real business. It is a new bar that is not quite swarmped with hipster yet, and it should stay that way. A short list of special cocktails at $9 each, this place is following the cocktail trend. Most of those cocktails are good, not spectacular, but my boyfriend didn't really like one of the drink and the bartender gladly replaced it with a beer. They have Abita on tap, out of 8 that were availible.  There is a pool table, and if it is not crowded, you can squeeze in a game or two. It is not a really big bar.  Over all, it is a good place to chilled with friends if you are in this part of town. Nothing worth traveling to.", 
    "review_date": "2012-03-26"
  }, 
  "MGPQVLsODMm9ZtYQW-g_OA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jelena Z.", 
    "review_text": "The secret is out about the bar that feels like a secret lovers' haunt.   It's brazenly dim. Elegantly divey. Small but not snobbish. And it's exactly the kind of spot you seek for a clandestine late-night tête-à-tête.  On the heels of a dashing dinner at nearby ICHI, we made our way to Rock Bar for that one last cocktail. He drank a Manhattan, she sipped on the Earnest Diamond, and both shared the same small bench.   There's a certain aesthetic that keeps me in a bar longer than I'd usually stay - an arcane coziness; a strange brand of delicious anticipation (maybe this night could be the best one yet?). Mismatched glassware. Delicately vintage votive holders cradling subdued punctuations of light. Whispers and secret smiles and a room full of beginnings. Rock Bar brings together an attractive collection of irregularities yet somehow, it's such a harmonious space. Really lovely.  Maybe most importantly, the cocktails are good... very good, even! Give me exactly what I want to hear musically and I'll stick around for even longer next time.", 
    "review_date": "2013-11-14"
  }, 
  "yL1SHtUrwMzAVu7CbYKl5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lee R.", 
    "review_text": "Best bar on Tiffany! ;-p  Pong, pool, movies, food. Great creative cocktails without Union Square prices. They still got your $2 PBR here. My latest favorite is the Ruby Mule.   Friendly staff and great atmosphere. Usually dim lit. Wants to be divey but has more class. Very neighborhoody. Often a last stop and/or first stop for locals. Has special nights of the week including Teacher Tuesday which gives all teachers a discount.", 
    "review_date": "2013-09-02"
  }, 
  "kroQYWSj-BhIEXT4VwLRHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David G.", 
    "review_text": "Great little corner bar that I would have never found if not for a bartender friend's recommendation after eating at El Faralito. I had two mountain cocktails and they were good...albeit an acquired taste.   Nice pool table. Nice bartender. Nice patrons and vibe.  Cheesy bowling game", 
    "review_date": "2014-02-20"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "One *Rocking Star* for an alkie ménage a trois; carrying BOTH Fernet Branca and R. Jelinek Fernet. *Double fists* (NOT that kind, you pervs)  One *Rocking Star* for  strong AND cheap cocktails.  One *Rocking Star* for delivering food from Front Porch across the street (same owners).  One *Rocking Star* for a girly Victorian-ish themed bathroom for the ladies.   One *Rocking Star* for premium chasers a la hand squeezed orange juice. YES! Hand squeezed orange juice!  Who does that? Rock Bar does...   5 ROCKING STARS!  OTHER NOTES: *Friendly and efficient bartender. It was packed on a Tuesday night but the female bartender held down the fort.  *Happy Hour Specials (everyday 4 pm - 7:30 pm): $1 off draft beers, wells, and specialty cocktails.   *Specialty cocktails are $7-$9. Wanna get faded? Get the Power's based Dark Crystal cocktail.  *Lo-key hipster crowd.  *Divey and dark ambiance with several flat screen TVs, a pool table, and a juke box. *Order food at Front Porch (<a href=\"http://www.yelp.com/biz/the-front-porch-san-francisco#hrid:KrYMXbOPqNmKUOKYioSZtg\">yelp.com/biz/the-front-p…</a>) across the street and they will deliver it to your seat/table at Rock Bar. *Midnight Chicken Wing delivery on the weekends from Front for $5 an order. *Semi-difficult street parking.  *CASH ONLY. There's an ATM near the pool table.", 
    "review_date": "2013-02-15"
  }, 
  "AJQ9yWbDO_8j8A3Nbw-QsQ": {
    "user_rating": 3.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Sam G.", 
    "review_text": "eh", 
    "review_date": "2013-01-07"
  }, 
  "ZcAYyiUSWzD0Xe-djRGxZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "Have been frequenting its' across-the-street sibling, Front Porch, for a while and have been meaning to try this place.  Impromptu walk-in this afternoon and glad we did.    Bartender, Ryan I believe, is a great guy.  Quietly engaging and reads his customers well;  highly knowledgeable about the craft without being booze nerdy.  Bar is cocktail-centric but half a dozen or so beers on tap.  Didn't see any wine but it must be lurking there somewhere. Daily special cocktails on the chalk board and also on a bar cocktail menu.    Not too pricey - thinking $6 - $9 for well prepared cocktails utilizing some rare ingredients.  Best Old Fashioned I've had in a while, followed by a St George's Rye Gin cocktail, then I asked for a cocktail of Ryan's own choosing and had a great Rum drink.  So a fun hour or so breezing around some of the spirit staples..!  Mid/late afternoon for this first visit so pretty quiet.  We are a 40/50 something male couple &amp; rest of bar a 20-30 something mix.  No attitude.  Great to be able to call across to the always excellent Front Porch for refueling.   In summary, a great little bar.", 
    "review_date": "2012-05-12"
  }, 
  "eSYmBVh5MxkAP7DvYGQWZQ": {
    "user_rating": 5.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "Loretta M.", 
    "review_text": "This bar just opened, may I say great addition. I like the old school style of cocktails, the staff is really friendly, and the crowd really had a great vibe going. I will be back.  They even had stone coasters, and a victorian gas fire place ( well it looked like it from far away so not really sure?)", 
    "review_date": "2012-03-12"
  }, 
  "T4CSDrFyaYYUdmApp3uh8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marni S.", 
    "review_text": "They have a nice selection of drinks.  The staff is great and it's a nice mellow fun vibe, very relaxed and welcoming.  It's casual but on the nicer side.  The decorations are unique and interesting, cute and kinda funky.", 
    "review_date": "2012-04-20"
  }, 
  "E7TmkMd9vnSHymK3irlKmA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zach G.", 
    "review_text": "Classy and not pretentious.  A pretty great bar with a really good selection of beer and liquor.", 
    "review_date": "2013-04-12"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "Wow! A dive bar that isn't super grimy, is a nice level of noise, has a good amount of chairs for the floor space, has a pool table, clean bathrooms, nice bouncers, AND attentive bartenders?!   I'm so lucky to live a mile from here.", 
    "review_date": "2013-11-18"
  }, 
  "qJaBubcxoyYbnnFrieOd6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S K.", 
    "review_text": "welcome addition to the area. across the street from Front Porch in the old international club.  This bar is a definite improvement from its predecessor, focusing on simple cocktails and local craft beers.  Pick up a bucket from Front Porch and head over to the Rock Bar", 
    "review_date": "2012-02-12"
  }, 
  "BJAWJI9CJjb85Jvb5z5bhA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Antonia T.", 
    "review_text": "I love Front Porch, so had high hopes, but honestly, kinda meh. The scene was chill. My beer wasn't all that chill, which is unforgivable.", 
    "review_date": "2013-07-02"
  }, 
  "Ae6iNKubi-jFDa_LSeRwhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marineh B.", 
    "review_text": "Im not a moscow mule fan at all, but the rhuby mule is so very good. Service very friendly.  Owned by same people across the street at front porch.", 
    "review_date": "2014-07-30"
  }, 
  "ysCBsXWPB-LAiewVS3jZfQ": {
    "user_rating": 4.0, 
    "user_location": "Queens, NY", 
    "user_name": "Jando S.", 
    "review_text": "A nice departure from the usual bar scene I'm entrenched in while visiting SF, Rock Bar might be a place I'd call myself a regular at if I lived in the area. On a weeknight when it's got just enough folks without being crowded it becomes an easy place to mingle and sip on something strong. Date night or pick up night, you make the call.  There is a dive bar element interiorly speaking, but there is something about the tranquility that lends itself to a steady and easy ambiance. This doesn't feel like a place I'd bring 20 of my friends to, but rather a spot where I'd catch up on some conversation with close ones while imbibing with the best of them.  Speaking of drinks, the Manhattan is the real deal. Strong without squinted reactions, potent enough to keep the flow and the vibe going. The Winter Sour also gets a nod in the grand scheme of drinks in their lineup, and the Ichi Rock also has me smitten. Whether it's bourbon, gin, vodka, or tequila based, there is a little something in it for everyone.  The prices aren't as steep as the rest of San Francisco cocktail spots. Friendly bartenders and a seasonal selection of cocktails means I'll be back soon enough for more. Bringing good company while thirsty is highly encouraged.", 
    "review_date": "2014-05-28"
  }, 
  "e3jZlDU64kVllOXkIfPW6Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ken H.", 
    "review_text": "Great place, good vibe, friendly staff and owners.  Great beer selection and cool theme.  Vintage stuff on the walls, in the theme of miners and the old West with more to come.  bring it...and getcha some!", 
    "review_date": "2012-02-28"
  }
}