{
  "B5KtTABTJTPHST6pLEtIBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serge S.", 
    "review_text": "It's a nice place.  Their backroom is hidden from the rest of the lounge, which is a nice little touch for private parties.  The first time I went there was on a regular Saturday night and it was quite small and crampt, which I didn't particularly enjoy.  The last time however, I went for a private party where the entire location was rented out.  With only a limited number of people it is much easier to enjoy the lounge.  The back room had a small bar which lets you grab a limited assortment of drinks without leaving to the main room, and the full bar upfront offers a large selection of booze for those that desire it.    Prices are good, not too cheap, not too pricy.  Parking sucks of course, but there is a parking garage on the other side of that same block (next to the police station, so I guess it's safe?).", 
    "review_date": "2007-04-09"
  }, 
  "HFECrzYDpgbS5EmTBtj2zQ": {
    "user_rating": 5.0, 
    "user_location": "Albany, CA", 
    "user_name": "Eric B.", 
    "review_text": "When I first mapped Rosewood on Google, it initially struck me odd that it's located in the part of Chinatown that has spilled over into North Beach. I also knew that parking was going to be a challenge. Luckily, the Parking Karma that I learned as a previous City resident came back, and I ended up on Green at a 90 degree slope spot. From there, I enjoyed the walk around, even though Rosewood is almost as hard to find in person.   What brought me to the City from the Burbs on a Week Day? Was I trying to escape the bar fights in Walnut Creek or the Oakland Occupy scene? The real answer is that my OCD-fueled fondness of writing reviews has a few privileges, even though I'm older and uglier than the target demographic. I was in fact honored to be at Rosewood as part of the inaugural Gogobot Pro class. And when you consider that there were lots of fellow Yelpers and least 2 past or current CMs at the party, its a small world for Real People and Real Reviews.®   There's lots of interesting twists and turns to Rosewood and what initially looks like a small venue has lots of room. During this party, the drinks and too loud music were up front, the photo \"booth\" was off to the side, while Pizza, Milk and Cookies, and a chance for quieter conversation was available out back. And when you put all this together, the party had a pleasant energy and flow.   I had a very nice time. Connie was back from Loopt and did a smashing job organizing the party and in her usual hard working and classy way. I spent my time nursing a gin-based \"Martinez in Bloom\" drink (courtesy of a friendly and very hard working Bar Keep), munching on square slices of Golden Boy Pizza, and chatting up travel adventures with various folks. One fascinating conversation addressed the \"spiritual work\" aspects of walking the Camino de Santiago for non-Catholics. Later on and as long as folks would listen, I enthusiastically promoted my ongoing participation in Climate Change-related volunteer trips with Earthwatch. Many thanks to Travis K. and his Gogobot Team for making all this possible!  The Highlight of the party however was the presence of Rene C., his wife Erica, and Joanna M. Only his MC was missing, of which Rene's lovely bride has graciously opted to let him dream and maybe sometimes make an ASS of himself. We had a great conversation which continued into the evening (with Joanna's friend MM joining us) at Park Tavern. It was one of those few times during the week when I wasn't in any hurry to have the evening end.   Gayle will sometimes ask: Who are these virtual friends of yours? Are they really friends? Have you actually met any of them? My answer is Yes and often involving very enjoyable situations both within and separate from a special event.", 
    "review_date": "2012-02-03"
  }, 
  "Sg_BvnTHsbc1AABiJjaiPA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian H.", 
    "review_text": "Small bar with a dance floor, good music. Too bad no one was dancing and the place was pretty much empty. What..? On a Friday night?", 
    "review_date": "2013-06-27"
  }, 
  "tQqIEVhLWOr02cmJ6NpamA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lawrence A.", 
    "review_text": "Rosewood, oh Rosewood. I how can I count the ways!  We had our WEDDING at Rosewood on July 9th and it was amazing. I know Rosewood doesn't necessarily seem like the best spot for a wedding venue, but it was PERFECT! First of all Toni and her staff met with us about 10 times before the wedding. Then they totally accomodated a bunch of our wedding worries and requests.   The space is so unique with all the little rooms and the outside patio. Our guests had so many little areas to interact, meet new people, and mingle. It was great. We added a bit of mood lighting and some wall decorations and Rosewood turned in to our hip wedding oasis.  The drinks were strong and everyone felt very well taken care of. The service was friendly and top notch.   We can't thank Toni and her staff enough for making our wedding one of a kind and soooooo great!", 
    "review_date": "2011-07-18"
  }, 
  "zTE8KUu2ukFQZ67fZypLtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christy I.", 
    "review_text": "i like this place because it's got a little bit of everything.  a place to sit and chill, a bar, a dance floor, a patio.  decent hip hop that often reverts back to the 80's and 90's, which makes me nostalgic, and makes dancing more fun since i've grown up with this kind of music.   i prefer it to clubs because it's laid back.  a bit of a yuppie crowd, in my opinion...that may be your thing, or not.", 
    "review_date": "2007-07-19"
  }, 
  "4glia_ud1LJzXCGnGy3xWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay P.", 
    "review_text": "Wow, I really like this place -- nice decor, not too crowded, feels like a neighborhood bar in NYC to me.  Music was on the hip-hop/R&amp;B side which is just fine by me.   In my continuing search for a reasonable lounge in this town, this is a pretty good stop -- will definitely go again soon", 
    "review_date": "2008-07-06"
  }, 
  "HYQoxBC1y1DGPq6pGP09Tw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "Every time when Matt walks up and down the busy Broadway St., this bar is always deserted and appears to be dull and haunted. Until this day, when Yelp held its encounter of the DJ's between Yelpers. Many of the coolest Yelpers displayed their prized skills on how to spin a record and amaze the Chinatown neighborhood.   Matt came here after his breakfast, (working graveyard) and passed by this bar for a short visit and surprised many Yelpers, that Matt still has a little life and heart in attending to these awesome events.  With the tainted stench of Curry Beef lingering in his breath, Matt did his best to conceal his Curry breath and chatted with more yelper. (wanna kiss?) But with the interference of work, Matt's stay was very brief, but fun.", 
    "review_date": "2007-07-12"
  }, 
  "8Q0xnxT-KrvCl2pQF1qsFQ": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "omar b.", 
    "review_text": "came here for the DJ soiree organized by Jing Tao Fuckface.  i was kind of nervous as it has been a while since being around a horde of sweaty, horny yelpers-- but i was ahead of schedule on my Summer reading list and needed a break from organizing my stamp collection.  on approaching the spot i hugged it out with Special K and after we made out i was persuaded to let Omid T. give me his signature \"dirty sanchez.\"  all of this took place outside and we received applause from on-lookers.  as entering and making way for a refreshment a big-man with big-muscles mauled me from behind just as i made it to the bar...thankfully it was just my bud luis m. as i was sure i was about to have my \"salad tossed.\"  ordered a healthy, yummy round of greyhound (greygoose) and gin&amp;tonic (sapphire) to cool down from an attractive bartender...chatted a bit with Pookie W who explained the mystery of the \"nappy dugout\" which i was thankful for.    after chatting a bit in the cozy, bamboo-infested patio watching euge I show off his six-pack to the smoking crowd he began to contemplate with us on his theory \"game of inches.\"  Supposedly turtles are a sexual beast.  i was immediately mauled by Durian Loving Steph P as i crossed the dancefloor to make way to the head and well...she picked me up and rampantly \"McQ'd\" me against the wall to the juicy dancehall cooked-up by Selecta Ben.  I immediately ran to the restroom to \"dance with the captain.\"  a dance cypher started brewing which involved A J, myself, Bucky K, and JT F...Bucky was the clear winner with his robot and pop-locking.  Rosewood is the kinda romper-room designed perfectly for the intimate yelp gathering we had which was full of liquid and acts that can only be explained through sex lex-icon-- <a href=\"/redir?url=http%3A%2F%2Fwww.sex-lexis.com&amp;s=67bba4d7b9b505381a3e8c24a559b3591689ef587b584f05123b98b6453523ca\" rel=\"nofollow\" target=\"_blank\">sex-lexis.com</a>", 
    "review_date": "2007-07-13"
  }, 
  "3ybJXMA4RarhAqtO8Dv6MA": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Lara W.", 
    "review_text": "By no means a destination for the dance-inclined. There was a ghost DJ... that turned out to just be a playlist on a laptop somewhere! Reveling in that 4 second pause between songs, I looked around and asked myself, \"Really?\"   This question popped into my mind more than once, actually:  - when they played \"teach me how to dougie\"  - when they played \"call me maybe\"  - when I took a sip of my Gimlet and I discovered that it was literally only gin and lime. I guess that is all it takes to be a Gimlet, but without simple syrup, it tastes sad. Good to know next time I order it anywhere else, to make sure theres something sweet in there.  I remember reading that the bartenders were top notch on Yelp - and I would only go back to try something more complicated/interesting to see them really show off. But alcohol to me isn't as important as a great DJ. I don't want to drink to distract myself from the bad music - I want to drink to enhance something that is already bumpin'.  I can't say anything about the back patio because it was booked for a private party.   Not my type.", 
    "review_date": "2013-02-03"
  }, 
  "g2YnG8VUb9opaWF6fx6viQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phil M.", 
    "review_text": "This NB bar is a hip and stylish hip hop club. The music is always bumpin and the girls are always dancing. I haven't been here on a weekend and on the weekdays it starts to pick up around 10pm. The sound system is very impressive, maybe a bit too loud for my tastes. I woke up with a hoarse voice from shouting.", 
    "review_date": "2005-05-05"
  }, 
  "EVfNM3vsq_zWvR4dI5Qytw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victory V.", 
    "review_text": "hire another bartender for the main room along with a beer booth in your empty coat room, and this rating might be five stars.  otherwise, another good night at rosewood.", 
    "review_date": "2008-06-29"
  }, 
  "OcUC2eFhJJK9mG6K4abmXA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vandana M.", 
    "review_text": "I went to Rosewood last night for a birthday party. What a great spot! You can rent out the back room, which is spacious AND provides access to the back porch area.  We had our own private bartender, great drinks (the lemon chiffon was fab), and could play our own music.  Even though it's in North Beach, Rosewood seems low-key and chill. Great find, birthday girl!", 
    "review_date": "2007-09-30"
  }, 
  "l52adgx4Kd_5Wap-0K7Bkw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "Went here on a Saturday night. This place was packed, but there was one bartender working the main bar, and one bartender working the back bar. Absolutely impossible to get a drink, and everyone waiting around seemed to have the same problem. After waiting for about 30 minutes and not being served, we left and went to another bar without spending a dollar.   Nice layout and the place has potential. Not sure who runs this joint, but its a joke.", 
    "review_date": "2010-10-03"
  }, 
  "hc4FcL3cdt0I_IvrDMhp2A": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jaimie M.", 
    "review_text": "Popped in here after a nearby gallery opening on Friday night and was pleasantly surprised.  I walk by here all the time and they sadly seem to follow dance club rather than bar hours (only seem to be open past 10 pm on weekends, which is totally counter to the 5 pm - 2 am hours I just noticed they have listed on here.)  I always think it looks like a cute spot, so would love it if they were open more often.    Anyway, we grabbed a couple of drinks and explored the rabbit warren of rooms that make up Rosewood.  Decor is cute, a little bit unfinished (laminate veneer everywhere, peeling off the wall in places) but nice overal aesthetic and really cute couches/seating clusters throughout.  I especially like the bar and outdoor area towards the back - very nice!  I think this would be a great spot for a large group and/or birthday party too.", 
    "review_date": "2009-11-23"
  }, 
  "4IjzfbO7XKFNWWVufHNhww": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalie N.", 
    "review_text": "A friend and I were looking for the perfect place to throw a surprise birthday party for our pal. Everything went off without a hitch. The emails with Toni were really helpful and she was so nice the night of and very organized. We were able to bring in some balloons, a cake, and they did a specialized cocktail menu based on the birthday girl's love - bourbon! They also have nice touches like a coat rack for the party and a live dj, which was nice for special requests!  The night of the party the bartenders were great, really made the drinks special, and were nice to all the guests. The back patio was rented out, but we were able to get fresh air out there which was nice. We needed a little help getting one tipsy guest home and the bouncer went out of his way to help us till we were in the cab safe.   Overall, this is the perfect hidden gem to rent out for a private party, I would use it or go here again in a heartbeat.", 
    "review_date": "2012-02-23"
  }, 
  "RPD2MK_RJbCY_GFsLAZjig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teddy d.", 
    "review_text": "Rosewood is a treat...I will definitely have my BIRTHDAY MONTH  kickoff here and ALL OF my special Yelp friends  (anyone that is on my friends list )will be invited. \n  but I have to share a story.... \n  Circa 2003  ... Bambi hooks up with 2 fabulous chicks at The Redwood room (back when it was cute and it was the place to be at)and decides to take the pretty ladies to make the rounds in North Beach. So after a few stops one of the ladies decides to call her boyfriend who by the way claimed to be a COP from Oakland ... really?more like a drug dealer... and decides that we all head to ROSEWOOD. \n  Now am a small guy and can't really take on a 6'2 giant by myself ... and really don't have much interest in making out with girls unless am drunk and the Manny in me comes out (that's the male Bambi... watch out ladies). So here we are waiting for the BF sitting and chatting it up maybe a bit too close when the BF walks in... no hello, no my name is blah blah..nothing Nada... all I got was ARE YOU MAKING OUT WITH MY GF... IF SO AM GOING TO CUT YOU RIGHT NOW...and pulls out a pocket knife pointing it on my chest and poking me...and of course the GF jumps in between... and Bambi is up and running to the door... without finishing the cocktail. \n  Now every time I go  to ROSEWOOD I get a flashback of that incident and I now I know what the ladies mean about very jealous obsessive,controlling, freaky boyfriends that they can't get rid off. I HAVE HAD AN ENCOUNTER WITH THIS MAN... \n  Funny thing ...I never saw this couple again.", 
    "review_date": "2006-08-17"
  }, 
  "aIk07jxkia9izLMKRbaHHw": {
    "user_rating": 3.0, 
    "user_location": "Columbia, MO", 
    "user_name": "Max C.", 
    "review_text": "Great tunes, well stocked bar, nice, soothing interior, somewhat hidden from the rest of north beach.  Grab a couch/chair and listen to some hip hop.", 
    "review_date": "2005-03-15"
  }, 
  "FoZ6QIJGbd-2DZ12f34FtQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina C.", 
    "review_text": "Like Jennifer Y. and Jennifer S., I was also there for Jennifer M.'s birthday party (and it was our friend Sonja's party too but she's not a yelper.)  Anyhoo, I won't repeat what Jennifer squared mentioned but I did really enjoy this place. Let me get the \"hmpf\" parts about the night:  took a while to get a drink a little small in the private room very smokey outside (totally craved a cigarette but didn't have one) a bit pricey  but there's an upside to all that:  the drinks were very strong and the shots were huge could take a break from the small room in the in front of the place didn't smoke a cigarette! totally worth the money, especially since we had to cover $850 or so  I was impressed and enjoyed the party!", 
    "review_date": "2008-09-23"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "A little zen oasis away from the rowdiness that is North Beach nightlife, Rosewood is a great spot to have a drink just on the outskirts of Chinatown.   To be fair, it does get pretty crowded later in the night and honestly, I don't really care for it that much then. But anytime before 10 is normally a great time to grab a beer here and have conversations with friends. Grab a hoegarden or any other great beers on tap, and head on out to the patio. The patio is truly where it's at. It feels like you are having a drink on a patio between Brooklyn brownstones. It's intimate and cozy plus the bamboo creates a very tranquil and chill vibe.   For decent conversation and drinks before 10pm, Rosewood is pretty tough to beat. It's typically not too crowded then so you'll have space even for a larger group. Plus the friendly and attentive bartenders will take great care of you here.", 
    "review_date": "2011-05-27"
  }, 
  "KeZjKwMbqPU2qQO7oGgWLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie I.", 
    "review_text": "I was debating whether to give this a 3 or 4 star rating as there were good and bad characteristics. The decor is attractive, the DJ rocked (DJ Satva), the doormen were friendly, the crowd was fun and good ratio of men:women (although I was there for a special event in the back area so I was not sure if it was the crowd from that or the normal clientele). We got our drinks quickly and the prices weren't outrageous.  But at 1am, the staff was turning out lights, blowing out candles, turning down the music, and closing down the bar. What the?!! Come on! SF already closes their bars wayyyy to early, can't they at least give us until 1:30am? We all thought it was a buzz kill.", 
    "review_date": "2005-07-10"
  }, 
  "8hvXl0oJmU61l17LG9aDag": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Euge L.", 
    "review_text": "the euge is happy. hes found another bar/lounge he can call home besides dragon lounge in the sunset.   the parking sucks here but ehhh whatever.   jt f, yous badass, that shit last night was awesome.  the bar itself, well, hoegarden on tap. nuff said.   i LOVE this space, a litte dance floor to get yo freak on, awesome patio area, cool vip private back bar....  now if i can only get them to name a drink after me here too......", 
    "review_date": "2007-07-13"
  }, 
  "eeI4DVW43NLBlo6nFkcANw": {
    "user_rating": 3.0, 
    "user_location": "Novato, CA", 
    "user_name": "Eric L.", 
    "review_text": "Interesting bar and cool outside patio area, loungy vibe.  Nice little dance floor with some nice beats.  Ordered a Greyhound, White Wine, and a Pint.  The bill was $21.00 which is pretty high for a beer, a well and a glass of wine.", 
    "review_date": "2008-07-15"
  }, 
  "k3wjSI44_hXgqMiYHqah7g": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "Sasha B.", 
    "review_text": "This place is completely hidden and even with google maps in hand we still missed it the first time.   The place is a great secret gem and is a fab place to come if you want to have some drinks and hang out with your friends. There's a sweet spot in the back outside that is great for sitting. The dance floor is small but does the job.   Don't expect it to be crowded but if you're coming with a crowd this place is great. It's small, intimate without feeling stuffy and sweaty.   Bottoms up.", 
    "review_date": "2010-10-12"
  }, 
  "K_hCqC-OASPb22AEgOSGjQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melinda C.", 
    "review_text": "Rosewood is kind of funny because it's hidden away in Chinatown close-ish to North Beach but far enough away that randoms don't stumble upon it.  As a result, it's pretty relaxed and chill inside.  I've been here multiple times over the last few years and have never seen this place completely packed ... which can be both a blessing and a curse depending on what you're in the mood for.  I like the small dance floor in the back, and the music is pretty decent.  Again, though, based on the crowd, people may or may not be dancing so you really have to bring the party yourself sometimes.", 
    "review_date": "2009-01-08"
  }, 
  "3F7xpiGrF-4gxzsKzIFhrw": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Franklin H.", 
    "review_text": "Toni is the sweetest bar manager I have ever met. Every time we go there she ends up giving us hugs and making us feel welcome at the bar.  The interior is really nicely decorated, and on a nice night it's great to just chill in the bamboo garden in the back.  Just a warning, the drinks are strong, so be prepared to have a good night when you come here.", 
    "review_date": "2012-12-15"
  }, 
  "pDfL8xt8F8ls0-kQIG_ADg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Earl G.", 
    "review_text": "Me and my friends have a saying, \"Up to no good at Rosewood...\"  Have a few Hoegaardens from their tap and do the same.", 
    "review_date": "2009-03-12"
  }, 
  "rbPJO1Mc5ddzgucXelSQ0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony L.", 
    "review_text": "Five stars because of the music and the people that were there to share a lovely night together. Great drinks, great atmosphere, great beats by the great Yelp DJs, and great people.  Nice try to the ladies that tried to get me to dance...*coughAimeecough* *achooprincessooo* Like I said, I may have rhythm because I love music but that doesn't mean I have rhythm in my feet. But apart from that, awesome night. The bartenders were cool and were on top of the drink orders unlike other places that are bigger and have more staffers. Maybe it's because we didn't order mojitos. At least I didn't see anyone with mojitos.  And I love the ass grabbing. YAY!!! I just pray to God they were all from women. Not that I am a homophobe, it's just that I like the ladies more. Sorry guys. I wish all DYLs will be like this. This was fun! YAY!!! AGAIN! AGAIN!!!", 
    "review_date": "2008-06-19"
  }, 
  "I1dKh4olStlU7i-hEi4_TQ": {
    "user_rating": 2.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Irene L.", 
    "review_text": "Great place for small private parties and I had fun celebrating my sis's bf birthday, BUT the music was not good at all and bathrooms were disgusting. They played the same 7 songs over and over again! Wasn't packed at all on a Sat (Thanksgiving wknd) night. No cover and the dance floor isn't crowded so yay!", 
    "review_date": "2012-11-25"
  }, 
  "swocJWD8R1iH20-lveXh0Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosalind S.", 
    "review_text": "Not my neighborhood of choice but a small group came here for some bday drinks because the bday girl had dinner relatively near by.  The clientele was very North Beach and the music, hip hop.  The drinks were good, the decor great, like something you would see in SOMA.  The dance floor looked out of place but I guess that's the kind of vibe there were going for.  I probably wouldn't come back since I don't find myself in the Chinatown area very often.  Cute venue though.", 
    "review_date": "2013-03-12"
  }, 
  "Tdsd6ojiId3tgJsBBQz4NA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Danielle B.", 
    "review_text": "I've had a few fun nights at this place.  My favorite memory from Rosewood is this random dude essentially pinning my friend against a wall to dance with her; I think he later posted a \"missed connections\" ad on craigslist talking about the amazing chemistry they had, or something like that.  If by chemistry, he meant that he almost made her vomit, then he was correct.  I had my 30th birthday here last year and had an awesome time.  The private area in the back with the outdoor tables is pretty cool.  Overall, this place seems like the antithesis of North Beach---minimalist but elegant.", 
    "review_date": "2009-03-07"
  }, 
  "mFt934crYEVqfAfCzR9olw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Naseem K.", 
    "review_text": "One of the best birthday experiences I could ask for. Note, Rosewood isn't by any means the most luxe bar or anything.. In fact it's almost easy to miss because it's right in the middle of Chinatown, but the experience I had there last night by far deserves a 5 star rating.  First off, I worked with Toni over email 2-3 weeks before my party and she reserved the front section of the bar completely free for my party of 20-25. We had complete access to the music so all my friends were taking turns plugging in their iPhone and playing fun tunes.   Toni had the place all set up with flowers, candles, and signs for my party when I walked in. In addition, the bar does something special where you're allowed to name 5 of the cocktails for the night and they change the menus for the night. I chose my 5 favorite male TV characters and it turned out to be such a hit... Especially walking around hearing people say, \"I'm having a Pacey Witter\" or \"What's in the Jesse Pinkman?\" ;)  By the middle of the night, the other private event that was going on in the back patio area ended early and the bouncers gave us access to the entire place. It was so nice -- a really cute outdoor patio with lights and seating, as well as another mini dance floor.   Everyone was so nice and warm, which is one of the best experiences you can ask for on your birthday. The bar was still open to visitors so that was also fun to get to know other passerbys who walked in and wanted to know what was going on. Hands down, one of the best spots to have a birthday. Not to mention, a spacious dance floor. (Note: the place is much more of a bar feel and not dance club so don't expect a packed dance floor but even 10 of us on the floor tearing it up made an amazing experience I won't forget).  Thank you Toni SO much for your sweetness! Best night ever :)", 
    "review_date": "2013-11-23"
  }, 
  "yh8_9Ix1wp9dekvyOZbilQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Christina P.", 
    "review_text": "Should I be embarrassed to be a fan of Rosewood? Well,  I'm not. When I was a  young lass living on her own in SF, Rosewood provided my friends and I with countless birthday parties, random Friday nights out, and just about any other celebration you can think of. Now that I'm older and don't live in the area anymore, I thought I'd be over it, or that it'd be different somehow. But I recently stopped in for a lark with some friends on a Friday night and guess what... it's EXACTLY the same. That's good and bad. The drinks are still good, the music's still good, and it's still easy peasy to get in. The only problem is that this place is completely dead. Why?? Don't people realize how rare it is to find a place like this without a line snaking down the block?! Add to that the large number of late night Chinese and pizza places within stumbling distance, and it's nearly perfect in my untrendy eyes. Oh well, more Rosewood for me!", 
    "review_date": "2012-12-19"
  }, 
  "_8smAJ_NSJow6xiaKz4mPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yuffie G.", 
    "review_text": "I think they could use some better signage. My bf and I drove passed it a couple times and couldn't figure out where it was.", 
    "review_date": "2008-06-12"
  }, 
  "7A5lajj4qvHSDM97Kg-x4g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karsten P.", 
    "review_text": "I wanted to give this place three stars, but if I did I'd be rating what I want it to be, and what it isn't anymore. I still like it, still think when it's not too crowded and the lighting's right, that it's a cool place to swizzle a drink, but frankly, it's fallen a bit since the first time I went.\n  This place was initially as sleek as the gorgeous photo spread a local paper devoted to it in their sunday supplement -- the one that made me decide on the spot that I had to check the place out. The sleek chrome beer taps and the 007-style furnishings gave you something to check out while you settled into a nice Vodka Martini, and the bamboo/pebble garden, when open to the public, was awesome.\n  But now wear and tear, like holes in the walls, show even in the dim orange light, and put a 'never' in front of the 'open to the public' -- 'cause you're pretty much going to have to rent the back room to get out to that garden.\n  Also, the place used to have this really cool cross-cultural feeling, with a sprinkling of everyone coming in -- this has been less the case the last few times I've been, which ups the blandness factor.", 
    "review_date": "2006-07-07"
  }, 
  "GpZpKakwykH-Gsw-1LpLHg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan B.", 
    "review_text": "Last night I went to Rosewood for the first time in about five years and I'm annoyed at myself for not going back sooner. It's easily one of the best options in North Beach for a Friday or Saturday night, it's so good that it's actually made me consider going out in North Beach more often. it's far enough from Columbus that you don't get the tourist crowd but close enough that you feel like you're in a happening neighborhood.  The music last night was a bit cheesy, lots of Michael Jackson but there's really nothing wrong with that. The dance floor is on the smaller side but a lot of people weren't up for dancing last night so it didn't cause a problem. I've heard there's an amazing outdoor area in the back but didn't get to check it out due to a private event going on.  As Sonia S. pointed out, they need more restrooms. There are currently only two shared between men and women and the line can get ridiculously long. The management should really just invest in a bit of a remodel, can't imagine it'd cost that much when the benefits are considered.  I'm sure I'll be back, hopefully within the next few months rather than waiting another 5 years to return.", 
    "review_date": "2008-07-13"
  }, 
  "jXIJnnyxXxizxNYEo2ze-A": {
    "user_rating": 4.0, 
    "user_location": "Glendale, CA", 
    "user_name": "Clara K.", 
    "review_text": "nice wood-heavy decor, friendly bartenders that hook you up with strong drinks, and cushy seating along the walls make rosewood a pleasant place to hang. the back room turns into a dance floor eventually (when it gets late and peeps get drunk). it's a little small but i'd definitely go back if i want a low-key lounging experience in the city.", 
    "review_date": "2007-02-19"
  }, 
  "SHBoA7pdjy5Etsl2gAovJw": {
    "user_rating": 3.0, 
    "user_location": "Denver, CO", 
    "user_name": "Adam Z.", 
    "review_text": "I ordered a Redbull Vodka, and watched the bartender pour a Rockstar Vodka.  When I asked if Rockstar Vodka cost the same, the bartender replied \"They're the same thing.\" and charged me $7 for it.  Not my usual drink, but this stuff will get you bad reviews.", 
    "review_date": "2006-11-07"
  }, 
  "5IX9FOesKrLRyz618xc6tw": {
    "user_rating": 3.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Helen Y.", 
    "review_text": "For a Saturday nite, it wasn't too crowded but the place is tiny and the music is loud and that makes it really difficult to have conversations with friends. Plus I was starving since I hadn't had dinner other than snacking on some wheat thins at a friend's place prior to coming here. Good thing Rosewood is in the heart of Chinatown. We walked down the street to grab some good grub before coming back to the bar. The doorman even remembered us so that was another plus.", 
    "review_date": "2007-06-18"
  }, 
  "uXSVu2ldBncOGMcvI9SW2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noelle Q.", 
    "review_text": "The fabulously adorable bartender taught me how to like Fernet. You, sir, have done the impossible.", 
    "review_date": "2006-12-04"
  }, 
  "DQj7DnJiDV9TAxS0ott-3g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon N.", 
    "review_text": "I recommended a friend have her birthday here solely based on all of the reviews here. The party was fun, but this place was highly disappointing. It was on a Saturday night - the DJ sucked hardcore - it was like top 40 hip hop with super bad transitions... I mean BAD. The bar was crazy crowded, and only one bartender... so that meant wait a while. And there is an incredibly long line for the bathroom - even if you're a guy! I don't know... I don't get why everybody loves this place. I've been to so many better venues around... oh yea, not to mention it's on a pretty shady block of Broadway.", 
    "review_date": "2005-09-01"
  }, 
  "zpXqbJQ2CT4PsUBTy30DbQ": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jenny W.", 
    "review_text": "Ok, so I came here for a birthday party on Friday night.  This place is pretty swanky, although not in a great part of town.  I guess it's still considered North Beach, yet it's in the middle of a bunch of Chinese markets on Broadway and Powell-ish.  Dark inside and SO hot.  It took me AT LEAST 15 minutes each time I went to get a drink.  I don't think they were prepared (even though they knew about the birthday party beforehand) and staffed adequately for the number of people that were there.  The drinks were also not very strong and the bathroom line was ridiculous.  One stall in each bathroom is not enough.  Eh, I probably won't be back. At least not for a birthday party.", 
    "review_date": "2008-11-16"
  }, 
  "Ey7u10UjOz7Urroq4J0a4Q": {
    "user_rating": 3.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Marjie T.", 
    "review_text": "one of the hardest places to find. seriously, the windows are tinted limo black and it's in between asian shops...it just seems a tad out of place.  aside from your chances of seeing it, it's not bad inside. if we worked close enough, i'd go here for happy hour, but it seems to be the place for parties. there's a back room/area that has a separate bar from the main one and is definitely sets a great ambience for a par-tay!", 
    "review_date": "2010-01-16"
  }, 
  "DAf3UOAONCpgETWlNTERKg": {
    "user_rating": 5.0, 
    "user_location": "Saint Paul, MN", 
    "user_name": "Steph P.", 
    "review_text": "I love lounges and bars with a little something for everybody. At Rosewood, one can:  - Sit...in or outdoors!  - Stand  - Smoke  - Drink  - Dance  - Take off your clothes  - Lock yourself in the bathroom  - Have a kickass event/birthday party/general coming together of friends  - Forget to close your tab and have the amazing owner, Greg, kindly arrange delivery   ...all the elements for a memorable *laughs at the irony* night.   *There's only one thing on that list that I have not done at Rosewood, but I wouldn't be surprised to hear that someone else did it...*cough*euge*cough*salty*cough.*", 
    "review_date": "2007-07-13"
  }, 
  "PauNerg-kHRpoqLwB6F5CQ": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Bill B.", 
    "review_text": "I definitely enjoyed this place and could certainly see coming back. Owned by the same people who run Rye and 15 Romolo, the bar staff know their stuff - Toni didn't pause or flinch when I asked about a sazerac and whipped up a fairly good one about as quickly as you can say it. The atmosphere in the main bar is warm though the private 2-room back area is rather stark. The good news is that means you have a fairly blank slate for decorating for your event. There's also a nice patio area with both wooden picnic tables and upholstered settees. Music was playing at a good volume throughout - easily heard but not interfering with conversation. Win.", 
    "review_date": "2011-03-14"
  }, 
  "vLfRgjVHw4zSiKOmM7XvqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marjorie B.", 
    "review_text": "Kinda small, pretty loud \"meh\" beats from the dj behind the bar.  I was pretty concerned for him getting his tables wet from all the drink swilling and spilling going on from the drunks with wildly flailing moves on his end of the bar.  I think they left early for a short walk to the other bars down the main street because it was too crowded and understaffed to get a drink in every 15 minutes.  However, I'd have to say they pour pretty well from the drinks that I ordered, which is to say they poured pretty heavily, which is to say \"Yay!\"  It got pretty hot in the bar after a while and as soon as we left an almost-fight broke out between a little guy with 2 friends and a larger guy with about 10.  The parking wasn't bad for Broadway on a Saturday night, then again, it was the dark quiet side of Broadway that becomes part of Chinatown whose little shops and markets close down at about 6pm.", 
    "review_date": "2006-07-04"
  }, 
  "v3FadeRQY05oyNU2ergoQw": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "jenn h.", 
    "review_text": "This is one of my favorite bars in North Beach. It has a good vibe, and no one will look at you strangely if you start dancing in the back room. (At least I haven't noticed anyone giving me funny looks, but maybe I'm just in denial.)\n  The last time I was there, the last two songs of the night had that Indian dance beat which has been so hot over the last few years. A group next to me (I forget which kind of Indian - one of my friends explained this whole thing to me, and I can't remember right now, so please excuse my ignorance) went CRAZY with the dancing! One of the guys accidentally stepped on my foot, and after apologizing, he showed me how to \"unscrew the light bulb... UNSCREW THE LIGHT BULB...\" (Imagine putting both hands up and \"unscrewing\" to the beat of the music.)\n  I was so excited I got to learn this dance from a legit source! Well, as legit as he can be, considering we were at Rosewood. I love this place because stuff like this happens here. If only parking were easier...", 
    "review_date": "2006-03-22"
  }, 
  "wpI3AQvA5kxp-moP46m8NA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda P.", 
    "review_text": "I had heard about this place for sometime.  Finally checked it out a couple of weeks ago, and it left me going \"ehh it's alright\".  Then just a week after that, I was invited to a birthday party at Rosewood.  Second time was a charm.  The place had a way better vibe going on, the wine was tasting pretty good for bar wine , and the music was lots of fun. The piece de resistance was the back room.  So cool and beautiful.  Now that's what I want my apartment to look like :).  If North Beach had more bars/lounges like this,  and not like Fuse (eww), I would be there all the time.", 
    "review_date": "2008-05-12"
  }, 
  "p05BaSFza5U8MRUXAciB2Q": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "JeFF T.", 
    "review_text": "3.5 stars  Rosewood is a hip and stylish little lounge located almost on the outskirts of North Beach.  Face it, it's Chinatown.  It's away from the tourist traps that is Broadway/Columbus, but still accessible.  It's an odd spot for a lounge, but it satisfies the soul.  The space itself is spacious and comforting, with a green feel to it, thanks to the wood walls, concrete floors, metal doors, sliding glass doors, and tranquil bamboo lounge garden in the back.  There's ample space for lounging either up in the front, along the side in the bench seats, or out back amidst the garden.  The back area serves as the mini dance floor, if you're so inclined to get up off your ass.  Candles are strategically placed throughout the venue.  And if you're a really special customer, they open up the private room with a separate bar to take care of everyone there.  The owner of Rosewood is cool, as he's allowed Yelpers to overtake his lounge for the past 3 Yelper DJ events, which have been way hot experiences.  My only peeve has been that their drinks are overpriced and the bartenders are a little slow.  The only time that I've seen the place busy is when Yelpers hold parties here.  You'd think they'd offer some drink specials to us by now.  An $8 Ketel One greyhound seems more fitting at Ruby Skye or something like that. Trying to get a drink from them also seems to be a chore to them.  I was waiting for someone to come by and take my order, all the while I noticed 2 of them standing around, waiting for the other to react.  And just because a glass is on the counter half-empty, it does not mean you remove it without asking if it belongs to someone.  I really hope they take heed and address these issues somehow.  It's a great lounge space, but it could use some work.", 
    "review_date": "2008-02-29"
  }, 
  "7OfrRi-xGESQsBpJFrlfLA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "jozilla w.", 
    "review_text": "enh...the decor is sort of nice with their woody exterior (rosewood..woody.  get it?  get it??  harrrrdy har har, i am such a comedic genius) but the space is small and the music was lame the night i was there.    there are only two unisex bathrooms and the light switch for both of them are outside the door.  I was in the midst of happily peeing when I was plunged into darkness by another patron who was accidentally leaning on the wall!", 
    "review_date": "2007-09-24"
  }, 
  "PLdNNcecADe4Mt9V9d9J4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen K.", 
    "review_text": "Came here for Jennifer M's bday. Bartender hooked it up, bouncer did his job, ambiance in the back room was fantastic, and it was dark enough to grope people and then casually dance away. My kind of party.", 
    "review_date": "2008-09-22"
  }, 
  "H08G-D5HVDl0rpGethUc8Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Ajay G.", 
    "review_text": "really awesome place...good music and great crowd reminds me of my old hangout in cambridge: <a href=\"/redir?url=http%3A%2F%2Fwww.middlesexlounge.com%2F&amp;s=a9e9bca06e42c1f59f894a356675277adda1376ee74ff7208b502c7bcfd1d263\" rel=\"nofollow\" target=\"_blank\">middlesexlounge.com</a>", 
    "review_date": "2008-06-02"
  }, 
  "8pONVRF4HDD9ynt5lCynTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Autumn K.", 
    "review_text": "This is a 4-star bar in a neighborhood where most of the bars get 3 stars max from me. Why? The patrons are less drunk, less obnoxious, and less handsy than patrons at, say, Dragon Bar or 443. The bar staff is more cordial and professional than the barstaff at, say, Dragon Bar or 443. The douchebag quotient is significantly lower than you'll find just down the street, too. Maybe it's because Rosewood is a little further from the action of North Beach. I don't know...  What I do know is that there is limited but comfortable seating for the lucky few who get there early, there is a smoking patio out back where I can smoke to my heart's content, and they have bubbly by the glass. These things are all pluses in my book. The man says the drinks were a little pricey. I say I'm worth it and so is Rosewood. Nice, minimalist decor without any gimmicks (ahem, Dragon Bar), a large dance floor area, low sexy lighting, and dj's nightly, coupled with what appears to be a chill crowd and good bar staff makes Rosewood a place I'm likely to return to.", 
    "review_date": "2007-10-28"
  }, 
  "ksonr4xKjpmznXtf_rB2jg": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Kevo M.", 
    "review_text": "It's Friday night and the weekends here  I need to unwindwith the party Mr DJ, DJ  I am ready to call my friends so we can boogie down with a party  heey heeeey Mr DJ  Hey Mr. DJ you can get this started,  Everybodys ready to party all night all night  all the girls are ready so we can all get to it,  so we can party till the break of dawn  Everybody move your body now do it Here is somethin thats gonna make you move and groove Hey DJ keep playin that song all night on and on and on....  ---  That was the mood last night as I shook my groove thang to many of Yelp's talented DJs.   Do you remember in Footloose how dancing was a sin? That's what was drilled in to me at the Southern Baptist school I attended in my youth. It's kinda funny to think how all my teachers must be turning over in their grave if they knew of my night at Rosewood.   The service was excellent considering how we filled the bar. There's a cool little atrium in the back where you can hang out and still hear the music while enjoying the fresh North Beach air. But in reality we all went outside to smoke cigarettes and cool off on the picnic bench.   There's a couple of parking lots/garages in the area, so we had no parking issues. Remember, these are cash only and by the hour. 4 hours or so is $12. If the parking gods are with you, you'll find street parking right in front.  The unisex bathrooms are a great idea! Although they could have used a little more... um..... paper towels. But that's ok. It all worked out. At the beginning of the night, it was so crowded that none of my friends noticed I wiped my freshly washed hands on them. By the end of the night, they were too faded to notice. Thank god there was TP. I don't know how I'd pull that one off.   Good times! Even better friends!", 
    "review_date": "2007-07-13"
  }, 
  "G6YyktEV8cPywmLSyOj0Ng": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Joann B.", 
    "review_text": "Yah private parties. Uh huh, right.  We rented out the back room and patio for my going away party plus 3 friends' birthdays. We booked the place with plenty of lead time and stayed in contact with the club to make sure we still had the space. We then proceeded to invite 100 of our closest friends.   The morning of the event the club calls us to say that they had double booked the back room but that there was nothing to worry about. They offered to waive the deposit and bar minimum. Uh. WHA?  We get to the club and it is packed to capacity. Not only had they double booked the back room. They had also booked the front space. Three big ass parties in a tiny club.  Good idea guys.   It was impossible to get drinks. People were turned away at the door. They were not allowed into the backroom where the rest of our party was. They ran out of mixers and alcohol. They had promised the other party 4 hours of their own music. (Even after they had told us that we could bring music.) You could barely hear the music on the dance floor or the backroom. They lost my friend's credit card.   Thanks Rosewood for jacking up my last party the Bay Area! How big is this club that you can't figure out that you overbooked the damn place.", 
    "review_date": "2008-06-29"
  }, 
  "Ui0A8-hrpEPuEUG8EGBNaw": {
    "user_rating": 3.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ellie P.", 
    "review_text": "On a Saturday, this place seemed like it could have been cool but it was totally not what we were looking for. The music was really bad -- poor choice of songs and bad transitions. This was strike two of the night of bad music. The interior is cool-looking: a smaller, much less pretentious relative of the all-wood interior at the Redwood Room.", 
    "review_date": "2006-06-20"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "The location and convenience factor alone are enough for me to continue to frequent this place. The music is also a good reason. On the downside, the drinks are a little pricey, especially at $6 a beer. But hey, sometimes you gotta say what the $!@*...", 
    "review_date": "2006-05-28"
  }, 
  "8PB-hO5VwLY3pqJcZ9d9JQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Holly P.", 
    "review_text": "I researched and contacted over 10 bars for my BF's 30th before my friend recommended Rosewood.  I wasted my time with the other places because Rosewood was exactly what I was looking for!!  Toni was a complete doll to work with, she was always quick to respond to my emails/texts and she was so flexible. She accommodated every request and went above and beyond.  She even offered to pick up my BF's birthday cake! So sweet!   We reserved the front part of the bar with no minimum or fees.  We also got to bring in decorations/food and Tony made special drinks just for our party.  It's really a no brainer, if you want to host an event you should do it at Rosewood.  Toni also makes hands down the best drinks in SF.  All you have to do is tell her what you like and she'll make something totally unique and incredible for you!", 
    "review_date": "2013-09-11"
  }, 
  "dcxKyRz1QryZUrUnlWQfeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki H.", 
    "review_text": "I was there for my school event who had rented out the bar. They had made special drinks for our event which where awesome! So good. My favorite part was the patio. It was a nice area with plenty of seating. I don't have anything really significant to say about it but that I was a nice venue for our group and I would probably go back.", 
    "review_date": "2014-07-12"
  }, 
  "-g3XIcCb2b-BD0QBCcq2Sw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa I.", 
    "review_text": "Stopped in at Rosewood for a private birthday party last night and this bar's location and decor absolutely DOES NOT match where it's located.  From the street, this place looks like it's a quiet cocktail bar that's dimly lit.  False. This place opens up into the back with various areas set up with private parties with a small bar area.  The decor of this place is somewhat of a take on super trendy, Asian, and modern on the outside, but on the inside it's Prohibition-style with a dance floor. There wasn't a DJ, just a set speakers with music coming out of it in the patio area either.  Anyway, not a terrible place for a party, and we definitely had fun, so all of it just came off as \"meh\".", 
    "review_date": "2013-10-06"
  }, 
  "ixAzWY0pBHd-1P0gUPFcTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn D.", 
    "review_text": "If you are lucky enough to get in when its open, you are lucky.  It is a fun and fire-lit cozy meets chic bar.  And, Toni is the bomb.", 
    "review_date": "2013-07-28"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "great little bar... i've been here tons of times and i still have a problem trying to find it! very hidden, but since only the locals really know about it, the crowd is usually good. i have to admit i didn't know about that outdoor patio... i always congregate towards the front. i'll have to check that out next time", 
    "review_date": "2005-04-22"
  }, 
  "kS1MQHYwIfD0462PE61IBw": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Rob C.", 
    "review_text": "feels like a meetup place--locals from work come together, friends hang out...can be crowded since it's just one side along a bar with no real flow, but also can clear out quickly.  so can be up or down.  unassuming entrance, ambiance is ok but not ultra.  low key, i.e. flip flops ok, no cover.", 
    "review_date": "2007-10-27"
  }, 
  "eyjhVMPb-jzshQVJ5YB-6g": {
    "user_rating": 3.0, 
    "user_location": "Frankfurt, Germany", 
    "user_name": "Anika K.", 
    "review_text": "Definitely gets crowded, and the dance floor gets crazy. If you like that sort of thing, you will love this place. Not such a good fit for me... and I'm still not completely clear on the need to charge a $5 cover. Nice wood paneling though- makes for a cool atmosphere.", 
    "review_date": "2005-08-23"
  }, 
  "XUEx8hrvhPd7vrzmSHbduw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "April M.", 
    "review_text": "My favorite bar in North Beach, so smooth. With the weather getting nice, make sure to check out their outside patio area.", 
    "review_date": "2005-03-25"
  }, 
  "TWhypn1bLKnkWUSm6MKDrQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bj S.", 
    "review_text": "Nice decor....Awesome patio and private room for a party. But it was super crowded the night I went that I had to squeeze my way through the the bar to order a drink. After finally getting our drinks we were stuck standing in the middle trying to protect our drinks from spilling over. Yes it was that crowded. Overall I think the place is pretty.  I would go back for a drink someday.", 
    "review_date": "2007-03-30"
  }, 
  "l0uRV3nGEroXqsPypD4qdQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Robert S.", 
    "review_text": "Came here a couple weeks ago for Kim-Van T's birthday.  It was a cool looking place, with a good looking selection of beers on tap.  And the bartender definitely knew their biz, coming at me with the real deal Dark and Stormy's.  Much love and appreciation for those.  Music started really late.  Have you ever been to a bar/lounge where it's living room quiet?  It's really...bizarre.  It didn't last long, but I can't recall the last time I ran into that scenario.  Anyway, we were able to kick it, have some drinks, and relax.  Music was good when it was on.  I enjoyed it.  A good place with good drinks.  I don't frequent the neighborhood much, but I hope to stop by again.", 
    "review_date": "2010-01-07"
  }, 
  "jUFPpK5fASii8kOaSLHTPg": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Mandy B.", 
    "review_text": "I held a surprise birthday party for my boyfriend here for 60+ people, and one of the biggest pieces of feedback I got from guests was how AMAZING the venue is. I could not agree more! For a very reasonable fee + extremely doable bar tab minimum, we were given a beautiful outdoor patio, our own bartender, our own dance floor/control of music, and a smaller indoor room to keep the cake/coats/etc.   Antonia was a pleasure to work with - she got as excited as I did about the party, and I really appreciated the smaller touches she put together (for example, stringing nice lights throughout the patio area, lighting candles all over, etc.). She also made a great effort to make sure the party remained a surprise, and work with us to make sure the party went exactly how we wanted it to. One of the biggest draws to the space was that we could choose five drinks to name after the guest of honor for our bartender to pour all night, which added a great touch (and they were pretty creative and tasty, too!).   This would have been five stars, except at some point in the night our bouncer (who was supposed to be keeping non-guests out and making sure the party remained private) ended up slacking on the job somehow. We started to notice a lot of people that no one knew on the patio, and had to get the manager/bouncer to ask them to leave. Minor snafu that was taken care of quickly, but still kind of annoying considering the party was supposed to be private!   All in all, I'd definitely recommend this spot to ANYONE looking to throw any kind of private/semi-private party in SF - such a fun and seamless night, and I hope to return soon!", 
    "review_date": "2014-09-29"
  }, 
  "bA6sFAZTIc5ddwpnB_WJUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gil S.", 
    "review_text": "Nifty upscale but lowkey little bar on Broadway, halfway between the tunnel and the mad-ass intersection with Columbus.  As the name implies, there is a lot of wood here.  Some tables, a back dance room, a long, well-provisioned bar with a dj at the far end and a delicious and ever-evolving handmade signature drinks.  You have to know it's here, it's behind a heavy unmarked and barely lit door and even if you know exactly where it is, it's easy to miss.  Because it's on the Chinatown side of life  you can usually find street parking and you can mostly avoid the drunk drivers, boys causing trouble, aggressive cops, gangsters, muggers and panhandlers that plague the rest of North Beach.  Music varies with the DJ of course, there's a little dancing but overall it's a style I think of as tunes for white people to nod and shuffle by.  Also a Yelp favorite, so it's a good place to spot Yelp regulars.  There are many decent, cheap restaurants open late around here so it's a nice place to mix in with some good Italian or Chinese.", 
    "review_date": "2006-09-10"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "greg the owner and doug, the manager makes this place tick.  the queue for the pisser is a bit ridiculous though, hence more pissers please!", 
    "review_date": "2009-01-10"
  }, 
  "9rslkoEuINWodU8H0UNA6g": {
    "user_rating": 4.0, 
    "user_location": "Folsom, CA", 
    "user_name": "Abby M.", 
    "review_text": "One of my best friends had her 25th birthday here. She reserved the back room, which was pretty awesome because we were able to use the back room + the patio all to ourselves. The decor was cute, she was able to name her own drinks with our own bartender, and have control of her own music as well. It was an all around fun night!  As we were leaving, I had forgotten my jacket inside by the back room. I went back in to get it to find that it was gone. Checked the front and it was gone. And then all of a sudden one of the bartenders came up to me and described my jacket and then she bolted out of the bar onto the street. A couple of minutes later, she came back with it!! Haha.. I was sooooo thankful! That would've bummed me out for the night so I really appreciated it!!", 
    "review_date": "2014-10-21"
  }, 
  "ra3OzaxpILytSjHRRKoT8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel B.", 
    "review_text": "A great place for an early cocktail with a group, even on a Friday, because it doesn't heat up until late!  Perfect for me.  I like to hang out with my friends, not scope a crazy crowd.", 
    "review_date": "2007-02-10"
  }, 
  "JNyAX0DHDIkVUCTinuevFw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Laura S.", 
    "review_text": "For a private event, this place is awesome!  It does not look like much from the outside (almost walked by it had I not known the exact address), but once you get in, it has a great ambience.  They have several small cozy rooms, each with a different vibe.    I did not spend time in the front, as we had rented out the back.  Then there was a dark room that kind of had the feeling of a vampire movie.  In here was also a rack that you could hang your coat on.  No attendant, but it was nice that there was a place.  Right after that was the private party bar and a small dance floor.  The walls of that room were all white and they showed surfing movies on the wall.    The outside was the coolest part.  It was a small bamboo garden with sofas and a picnic table to relax in.  It felt like a true respite from the hustle of city life.    There was only one bartender for a private party, which stunk, but the prices were reasonable.  I definitely liked the vibe.", 
    "review_date": "2011-01-15"
  }, 
  "b1TLsiRhQdfbbXahqFkVtg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thadd L.", 
    "review_text": "I don't know much about 'fancy bars' but I know what I like and I didn't like this place at all.  A few years ago a close friend would try and get me into this place every other week.  I went twice.... it was never good.  It wasn't even close to good.  The bartenders were totally inept, they took too long slapping each others asses and not enough time getting booze to the people waiting 3 deep at the bar. Also, why do the bar tenders need about 8 feet from the wall to the well?  Seems like the place wouldn't be packed nuts to butts if this was designed better.  Then there is the crowd of young people. Fine, I know, you are young... just get some act right.  Don't mean mug everyone that accidentally bumps into you... the place is packed, get used to it. Sorry, this place is too bad to discuss any more than this.", 
    "review_date": "2006-07-03"
  }, 
  "0V4Ra6jCmSAgFtCiORr4QA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Megan C.", 
    "review_text": "I think Nish helped us crash a private party here.  (shhhh...)  LOVE the interior, love the drinks, laughed at whatever catering company hired the crazy sexy waiters and served up scrumptious bites to set the mood. Brilliant.  I couldn't help but chuckle underneath my breath when one of the model-esq waiters walked up and wanted us to eat his chocolate balls.  The platter was filled with hundreds of little battered marble sized chocolate balls.  Nice dessert if you ask me but unfortunately I did not feel the need to indulge.  *smirks*   I wonder how many I would have been able to fit in my mouth at one time.  \"Chubby Bunny?\" :o)  Not sure what a normal night it like here but really enjoyed the event.  Would definitely come back again!  Date Rating: 6 Pick up scale: N/A (not sure it was a private party doesn't count)  Strong Suggestions: I know it seems tempting but the weirder the drink sounds on the menu the stranger it tastes... stick to something basic the bartender seems to have a decent pour.", 
    "review_date": "2007-06-26"
  }, 
  "ZL4ozqMCOQs7sZO8aCcXTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David B.", 
    "review_text": "Where the fvck is this place! I walked by trying to find it.   Rosewood is like the pot of gold at the end of the rainbow. Except their is not leprachaun bouncer and it is a great find of a place. Dimly light lounge that serves up great drinks and has an even better crowd. Which seems to be nice transition from all the knuckleheads on Broadway.  Remember folks there is a back room! and to find this pot of gold:  It is located near the Broadway tunnel about two blocks as you go towards the intersection of Columbus and Broadway. Once you", 
    "review_date": "2006-10-27"
  }, 
  "s3kRi7b8t2sdtYcsMbqlJA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jazzy l.", 
    "review_text": "I came here last year and I enjoyed it better.    This time around the DJ played some funky mix's which I couldnt dance to at all.  I like the ambience, a little small for the dance floor and the cover was $5 for ladies and $10 for males?", 
    "review_date": "2007-02-26"
  }, 
  "KlC5BtqRxfRlY7OgTtPgoQ": {
    "user_rating": 4.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Diane I.", 
    "review_text": "A nice place to dance or just hang out with friends.  It's a hidden gem by being on the otherside Columbus so you don't have to worry about the crazy clubbers on Broadway.", 
    "review_date": "2006-09-05"
  }, 
  "ZbOK_2m4kifew3lzTep1yQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Jaime L.", 
    "review_text": "Despite only having three beers, I managed to:  1. Dance until I had to warn people around me that I wasn't wearing deodorant. 2. Drunk dial a friend to ask them to come out, even though there was like, 20 minutes of the event left.  3. Bump into at LEAST three people and accidently make them spill their drinks all over me. It's ok, I don't waste. I licked that shit off (thank goodness it was only on my arm, that would have been awkward/difficult). 4. Meet some really cool friends of Emily X.'s from Seattle and danced with them the rest of the evening. 5. Drop half my pack on the ground because I opened it in the wrong direction. 6. \"Give\" OUT half my pack, you bastards!  7. Check out what was truly upstairs--nothing.  8. Met up with some really, really awesome friends 9. Made fun of JTF (---best part of night) 10. Went home with a smile on my face  Oh and it's not like it was awkward or anything, when I started squealing, that Beau started asking about Ana and Ria.   \"Oh that was DEFINITELY Ana!\"  5 stars for being a crazy person(s)", 
    "review_date": "2008-06-20"
  }, 
  "oAz4s21FA2QjE0kCNIDxOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianne K.", 
    "review_text": "Excellent drinks, great atmosphere. That is, if you can find it! Glad that it's hidden though...it keeps some of the Broadway riff-raff out.", 
    "review_date": "2006-09-07"
  }, 
  "QRHS2i4DWS6R0fpkCalvaQ": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Margaux N.", 
    "review_text": "Cute back patio and back bar that would be really adorable for private parties.", 
    "review_date": "2009-09-24"
  }, 
  "q0HDybhT0V9dXrs63_WqWQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa G.", 
    "review_text": "I'd bump them up a star if it were easy to find Rosewood. It took us about 2-3 minutes to find the place, and we were right across the street! Maybe that says more about us than it does about Rosewood, though. The doorman is cool. I mean like jazz and blues cool. Wearing a fedora, sun glasses, and just all-around smooth. The drinks are good, their beer selection is alright....meaning they admittedly have good variety but unfortunately I didn't really like any of the choices they offered. The DJ though (Satva?) I have to say was very good. He did a good job of keeping the crowd moving, and had my taste in good dance music (not prepared to share those to the public just yet). I liked the fact that there were a lot of people, however it wasn't packed to the point that I felt I was in a mosh pit. I like my space.", 
    "review_date": "2010-02-20"
  }, 
  "SEkY-jnn6FB8dCCl5lMhWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayse B.", 
    "review_text": "I don't have anything amazing to say about this place, but it had a classy vibe, no cover, and not too many sweaty people trying to cut between me and my friends on the dance floor. At the same time, there is nothing about it that would make me drag my ass out to North Beach just to go here. Gin and tonics are the same everywhere.", 
    "review_date": "2007-07-30"
  }, 
  "GfB6sC4NJQvSI2ewbQrDNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitch A.", 
    "review_text": "A cool bar tucked away in the outskirts of North Beach.  I love the back patio.  It definitely has a cool vibe with the wooden walls.  Here's the link if you want to check out my photos from the Yelp party here last night: <a href=\"/redir?url=http%3A%2F%2Fwww.flickr.com%2Fphotos%2Fmaidelba%2Fsets%2F72157594239557038%2F&amp;s=7bdd714f2bd1a5ab7fa4234a2fc6dce0f1aa578703fb9bc3e59193ca5b405d98\" rel=\"nofollow\" target=\"_blank\">flickr.com/photos/maidel…</a>", 
    "review_date": "2006-08-16"
  }, 
  "ioLQrCvCBz3HmlKZeFxbJQ": {
    "user_rating": 3.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Karen W.", 
    "review_text": "I'm not sure why other Yelpers keep describing the dark sexiness of this club. It was pretty dark, but not noticeably sexy to me. The stand-out of this bar is their ball-shaped speakers that hang down like disco balls.  The music was ok, not too dancey...lots of R&amp;B. Pretty much no one was dancing. I noticed a long line to the restroom.  I did not try any drinks here, but really just stood around, so I can't rate the drinks. Unfortunately, I can't rate the attractiveness of the men or women either as I didn't check anyone out. Maybe that in itself is telling. There wasn't much seating, and the bar quickly became PACKED on a Saturday night. It was an arduous journey back outside to freedom...", 
    "review_date": "2008-06-29"
  }, 
  "ob0N8eC4293FUWljILXW-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mikey B W.", 
    "review_text": "Whoa where did this place come from!?!?  I love the outdoor space and back area dance floor. we really got this place goin on fri night.. but mini size ipod sittin on the stool as the dj? i'm not sure what was goin on with that but nonetheless we had a great time dancing and chattin outside.  i'd def go back again, with a group of friends, as i think it would be boring and dead otherwise", 
    "review_date": "2010-08-01"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "I had no idea I could like a North Beach bar this much.  Maybe it was the hidden entrance.  Or the swank and sophisticated interior.  Or the good beats.  Or the good conversation.  Or the party hosted by SF's premier foodie, the tablehopper.  Whatever it was, everything was working for Rosewood last night. I'd totally come back, and highly recommend.", 
    "review_date": "2008-12-10"
  }, 
  "kK996Gx3ZoR7Avd5WILFEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "matthew r.", 
    "review_text": "Two things come to mind when someone says 'rosewood' to me:  1. A variety of wood commonly used in asian furniture and musical instruments  2. A town in central florida where mass lynchings took place in the 1920's.  I don't think of a small bar in north beach that looks kind of like a Design Within Reach showroom and has a decent sized dance floor, turntables behind the bar, a nice patio out back, comfortable seats and kind of pricy drinks. Maybe you do though though and that's ok because one ontology is as good as another as far as I'm concerned.  Oh, and the patio appears to have another secret bar connected to it. Does anyone know when that one is open?", 
    "review_date": "2007-10-27"
  }, 
  "P6HVUJ7VbFjYeAKtYPt38w": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Johnny G.", 
    "review_text": "This place is in the cuts in china town. Didnt really recognize it, no lights inside just a huge metal door. walk in and the bar area is nice. The \"dance floor\" is pretty tiny but I see people workin it. ALL GOOD. you can walk out to the back patio and the place is very nice. We had a birthday party there and it was cool. The bouncer.. (only saw one) was super chill and nice.  -1 only two unisex bathroom stalls -1 only one bartender in the back so its a solid while to get drinks.", 
    "review_date": "2014-02-02"
  }, 
  "peXWpBYKrFs0h7HzFgkUTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geoff K.", 
    "review_text": "I heart this bar.  First, it's off the beaten path of North Beach so it's not too inundated with B&amp;T.  Second, they have a great selection of draft beers.    But more importantly, as Vanessa G. noted, it's the best place in town to plan a party for 40-50 people.  For $200 and a reasonable bar minimum, you can rent out the back room and patio and have your own bartender.  And they actually enforce a guest list, so you can keep the gathering to your friends.  There are no hoops to jump through in making the reservation, and you can do everything over email.  This is a far cry from most venues in the city that hit you with BS fees and surcharges.  Our bartender, Aliza, was really accomodating and put up with my drunk ass, which says a lot.  All that said, I had my farewell party here last Friday and it went off without a hitch, and all my friends had a great time.  I took a shot of well vodka at 1am and that was not so great, but hey it's a great near-to-last memory of SF.  Docked one star because they said we could bring an ipod, but the speakers weren't working so we were stuck with whatever the DJ was spinning in the main room as opposed to the mix my buddy put together.", 
    "review_date": "2007-09-16"
  }, 
  "PqgrXIi2Mko8uAGQLp6Hsg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "YC L.", 
    "review_text": "Interesting set up but in need of people.... This is a off the track interesting bar with a nice outside area... Would have never know of this place if it weren't for a friend's party.... We had the back room with the patio area to our group....  The rest of the place did look quite empty on a Friday night.... Not sure if the drinks are what's usually available on the menu or especially for the party.....  I guess I would only come here to host parties but it seem to be a bit empty for drinks and hang outs.....", 
    "review_date": "2013-02-19"
  }, 
  "h3KpLypa9SZEw2ydFNC19Q": {
    "user_rating": 3.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Alvin D.", 
    "review_text": "3/5 dope music  seems like a cool venue, though i was here for a backroom birthday event. there's a patio out there, and you can get a private bartender, and i believe you pay for the space, then the drinks are consumable against the bartender's time.  drinks were okay, always seemed to come out on the sweet side. the crowd i wasn't very thrilled to be around either...i get that we all want to unwind on a friday night, but your celebration shouldn't burden mine, and ladies, belligerence is never in style. take that to ke$ha or leave it at home with yo mama.   highlight though, was the dj. in the earlier hours he was playing all the right throwbacks! i was in north beach, but felt like it was LBC.", 
    "review_date": "2011-03-06"
  }, 
  "JE2pyEew6XtQxZojRNmbKA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Janani S.", 
    "review_text": "I'm disappointed. I want to rate this place but I can't.   Courtesy of the extremely helpful Greg Lindgren, I set up a guestlist for Friday night. Granted, our list was 100+, so we had a fairly large crowd coming.   But as early as 10:30, I got a call saying that the bar was WAY too packed and there was no room to really move around. I was still at dinner at this point, handling the check slash hailing taxis to head over to Rosewood.   When we got the call, we moved our entire party to Medjool. We were told by the 20 people who had already made it to Rosewood that there wasn't even a DJ playing -- although I'm not sure if one showed up later that night.   I wanted so badly to love this place. Maybe I will go back one day without an entourage of 100+. I've heard such good things, the only downside is that it does get crowded pretty quickly on weekends. Which is to be expected when a bar is good.   So, just a warning to all though, it does get packed quickly. Maybe it's our own fault -- we were offered the opportunity to book the private room for $200 + $850 bar guarantee (it houses 40-80 people comfortably) but we declined that chance. Maybe if we'd just done that, we could have fit in a little more comfortably since our area would have been roped off for sure.   Oh well, there's always next time. Thanks anyhow, Greg! :)   3 Stars for now only because I'm a little bitter I had to relocate an entire party of 100+ when the bar hit max capacity as early as 10:30pm. I'm sure after I actually enjoy myself there, the rating will go up.", 
    "review_date": "2007-08-13"
  }, 
  "5iK4kSWPOKsB78s02S13fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony P.", 
    "review_text": "This place is awesome for private events since, for a reasonable deposit and minimum bar guarantee, you can have the entire private VIP bar and patio to yourself. None of that you only get x people on the list with bottle service junk here.   Especially during warm weather, it's the perfect combination of indoor and outdoor space. Ideally suited for around 100 people, there's a lounge room with couches, a private bar area and the patio that is accessible through sliding glass doors. The staff, from the bartender to the doorman, was super friendly too.   I would definitely recommend contacting Jon (one of the owners) the next time you want to plan a party! Rosewood is an upscale standout among the over-crowded generic club scene in North Beach.", 
    "review_date": "2008-06-11"
  }, 
  "J_ZY3YDkAVzEEYxvthozCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah C.", 
    "review_text": "Everyone here is extremely friendly.  Its a chill spot to grab drinks and start the night out.  The bartenders are amazing and shout out to TONI! She made a good night fantastic.", 
    "review_date": "2011-06-21"
  }, 
  "l26TgP9ox03XRLDuG-9wvA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annalise F.", 
    "review_text": "Oh Rosewood. Where to begin? First of all, a big thank you, from the bottom of my heart, for putting up with me, my friends, and the Entourage that refuses to leave at 2a, even when you told us countless times you were closed. (I sincerely apologize- really!)  Rosewood is not what I think of when I think of North Beach. In fact, is this really even considered North Beach? I'm going to agree with my fellow Yelpers who addressed the layout of this place. The bar area is narrow and crammed, but beyond the bar lays a cute back patio, dance floor, and separate bar for private events. (At least I think this is the purpose of this bar- I don't know, I ventured back and forth between the two!) It's entirely possible to be in one place but have no idea where the rest of your group could possibly be. This place has the wackiest layout ever!  The bartenders and bouncer were nice enough- they don't particularly stand out to me, which could be a good thing, depending on how you look at it!  I do agree that they could use some additional bathrooms...as well as someone to make sure the inebriated men can figure out how to close a door. (Though this did make for a great photo!)  Not sure I'll be back, but I'll certainly remember you Rosewood!", 
    "review_date": "2011-09-18"
  }, 
  "QXAYZBYuZ1NbygFKvynnJQ": {
    "user_rating": 3.0, 
    "user_location": "Pinole, CA", 
    "user_name": "Jenna T.", 
    "review_text": "Came here for a birthday and it was  a nice venue.  Old school hip hop, somewhat good amount of seating, nice wooden walls and light structures. Bouncer was nowhere insight after 1130pm. There's a self help coat check and supplies scattered in the open counter, which can be used as a bar extension.   There was 2 or 3 bartenders moving as fast as they can. They all had the square so they didn't have to leave with your card to the cashier - very convenient. However, I had two very different drinks when different bartenders made them. Boo for inconsistency.  A lady bartender had the nerve to ask if it was okay that a piece of strawberry was in my drink?!? She then proceeded to say that it was in the ice bucket so it should be good. Are you kidding me?!? It's too difficult to make me a new, clean drink?!? DISGUSTED!   Besides this mishap, the venue was a decent discovery. I'd still come here but with caution.", 
    "review_date": "2014-09-27"
  }, 
  "qethMNVnmuHd1I4on52Hhw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon R.", 
    "review_text": "I came here on a saturday night for a friend's birthday. Compared to the rest of north beach, this is a great choice if you want to stay away from obnoxious drunken maddness and just chill. They have an amazing drink: the mango gimlet...give it a whirl, you will not be disappointed...and the DJ played pretty fun tunes the majority of the night. It takes a lot to even get me to leave the mission on a weekend evening in the first place but I'm willing to put aside my skeptisim for other hoods when I encounter places like this.", 
    "review_date": "2009-06-15"
  }, 
  "8wNfJCqBYC_8xMDZjnMyuw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sarah a.", 
    "review_text": "My experience here was for a good friend's wedding reception. I don't know what Rosewood is like at other times, as the wedding was my first!   That said, I would do a private event here in a heartbeat! The manager (I want to say Toni? I remember her like it was yesterday, but it was a GOOD party, so some details may be fuzzy) was A-MA-ZING. She took a vested personal interest in making the whole thing great, going well above and beyond the call of duty with details most venue managers would not even think of helping with.   Lovely space with lots of varied nooks and corners for a variety of moods and roaming. Beautiful with nice lighting. Solid drinks and all. Found it fine by the address and I liked that there was no super loud signage.", 
    "review_date": "2010-12-28"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "a small bar/mini club...no sign out front....good for few drinks while bar hopping through north beach...a hit or miss..sometimes dead...sometimes packed....indoor seating...outdoor patio....wanting a small party?...private parties to be arranged at rosewood...", 
    "review_date": "2006-04-24"
  }, 
  "pRBzWnFzaCEtqhYyJ2ZTDQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "5 stars for rosewood. -1 for it being in north beach.", 
    "review_date": "2007-09-30"
  }, 
  "rd7GDLBPC3dGMhV6Yk0otg": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Melissa W.", 
    "review_text": "I had my birthday here this past weekend and it was absolutely perfect. The setup is great- big front room with couches and room to stand near the bar, then there's a dance area towards the back and also a cool outdoor/backroom area. It has a loungey feel but not super dressy. The best part was the staff. Toni the bartender reserved the front room for me and my group and also put together a list of drink specials customized for me. The DJ took our requests all night long and got everyone dancing. I had one of the best birthdays here thanks to them and definitely plan to go back soon! Highly recommend checking it out for a private event or just an average Saturday.", 
    "review_date": "2011-05-24"
  }, 
  "LkdQzmGlgR_7pr0gKWKZjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charlene L.", 
    "review_text": "A fun place to hang out, listen to a pretty decent DJ, but getting through to the bar can be a drag. I send my little homies from out of town here to have a good time.  The dance floor is probably the best place to watch some drunken stylings and you best learn how to hold your bladder because the line to the can is a pain in the butt.  Park on Stockton Street and walk up, you shouldn't have a problem finding one on the south side of broadway.", 
    "review_date": "2007-01-28"
  }, 
  "23z4cqOIsR1umG0xCtPH8g": {
    "user_rating": 1.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Bill C.", 
    "review_text": "$18 for a jack and coke after paying a cover charge to get it.    Service was OK but given the price it was appalling.  Obviously there's a reason why I never knew this bar existed...", 
    "review_date": "2014-06-29"
  }, 
  "qPGhjScyxtuHrWXN4A8VXg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Loli L.", 
    "review_text": "Contrary to the name, there is not a lot of wood here. The main wall appears to be wood, but it is an illusion. A farce, if you will.   The bar is wooden and the comfy (non-wood) stools have backs to them. I had a hard time deciding whether I preferred the stools to the lounge-y couch-things. I opted to half lean/half stand when I wasn't performing interpretive dance moves on the dance floor.   It's dim and cozy, providing just enough light to spot new people to hug, and cast a glittery shine on Dan's blingy-new necklace.   Decent selection of beers on tap and generous pours of Scotch.   Even though it didn't have the gobs of wood that I particularly enjoy, I still liked it.", 
    "review_date": "2011-01-21"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "One of two bars I will willingly visit in North Beach, Rosewood is sleek without being pretentious. I've met people who have gone to this bar many times without realizing there is a back room and outdoor patio. Don't be one of those people.", 
    "review_date": "2005-01-17"
  }, 
  "OFi92Xc2QyIr787GNKtgZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "Had no idea this place existed, hidden behind all the fuss that's further down on Broadway and Columbus. Really enjoyed the decor, it's a great event space for those looking to hold a private party or a chill night out. The back outdoor patio is definitely the highlight of the place, with the bamboo pairing nicely with the chic modern decor. Reminded me of a smaller place you'd find in LA.  Can't say much for the sound system in the front room but it's certainly really loud in the back patio area, think it's escalated since the buildings surrounding Rosewood are all taller.  Friendly bartenders, I'd come back to grab a drink before the start of a crazy night.", 
    "review_date": "2014-01-02"
  }, 
  "EuuyiAuEa_s3VSS9i8okmg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah F.", 
    "review_text": "Small bar, good times.  If you want a smallish bar to have a mellow but fun night, come here.  They have a small dance floor/room, but it's really small.  I enjoy coming here before going somewhere else.  It's a nice place to grab a drink and congregate with friends.  Pretty good drinks too, and cute-ish boy bartenders.  Crowd is interesting; a mixed crowd, but sometimes seems a little bridge and tunnel-ish.  I guess it depends on what night you go, and your frame of mind.", 
    "review_date": "2008-01-29"
  }, 
  "Rm0Jy8gbj5_zFs-SY5ZIkw": {
    "user_rating": 5.0, 
    "user_location": "Signal Hill, CA", 
    "user_name": "Kanara T.", 
    "review_text": "Toni is the best. Her Basil Gimlet is the best in this city! That's right, I'm looking at you, Rye!  In addition, the spot makes reasonably priced drinks and the bartenders know exactly what they're doing, unlike a lot of other places in this city.   There's a dance floor, PLUS I was extremely happy when the DJ was playing 90s RnB and hip-hop.   In addition, it makes a great space for bdays or other celebrations. :)", 
    "review_date": "2011-04-11"
  }, 
  "A5sEtzjzUWBVcr3w_pY2Mw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassio P.", 
    "review_text": "I'm super sleepy and running on about 750 ml of expresso so I'm gonna make this quick...\n  \"Let's have a charity party on Tuesday!\" Julio said.\n  \"Dude, no one's going to party on Tuesday.  It's a ridiculous day to party.  People work for a living.\" I said.\n  \"Rosewood is awesome, no one else will have a party on Tuesday, and think of the starving children, you selfish bastard!\" Julio said.\n  So with barely a week to spare, we went to work.  I gathered the power of Berkeley and Yelp, and Julio, the power of Stanford. (boooo)\n  Yelpers are such party animals.  Everyone got their friends to come over and hang.  The eVite guest list swelled to 50, then 100, then 200 RSVPs.  Emboldened by this massive following, I was driven to invite every cool and attractive stranger I ran into.  I invited a Starbucks barista, three Brazilian girls I met at 111 Minna, and some chick I was chatting with in a hot tub.  I was hitting up party-friendly Yelpers I had never seen and telling them they had to come to this thing (Thanks Nirav and Anne Marie!)  The Brazilians made it, and the hot tub girl turned out to be Kelly E's friend.  Dude, the Yelp has eyes everywhere.  All witness its mighty outreach, yea.\n  So I arrive at the place and prepare for the onslaught.  A steady stream of awesome company arrives and takes is position in the lounge, on the dance floor, at the bar, and in the candlelit Japanese garden yonder.  Mitch dutifully documents their fine looking selves as only Mitch can.  Everyone is having a good time, even if they do have to work the next day.  At night, never think of the morning.\n  Wow, there are so many people here... I guess some people do like to party on a Tuesday after all.  Score one for Julio and Stanford.\n  Greg was a trooper behind the bar, the guy obviously hasn't let the fact that he runs the place go to his head.  Service was effective and polite.\n  It's an awesome venue, good folks run it, and it's remarkably accommodating for all sizes of groups.  I recommend it highly for those nights when your friends have dragged you out to North Beach and you're wondering where you can go to escape the tourists and bask in the loungey coolness.  Well look no further!", 
    "review_date": "2006-08-16"
  }, 
  "m-2lsMLw6H140wVhGCa-Tw": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mike C.", 
    "review_text": "Good place, good music. Close to the usual Broadway spots but kind of a few blocks away. I think it's worth the walk if you have a group of friends and want something less dangerous.", 
    "review_date": "2006-11-10"
  }, 
  "0Cvgx6MKrSOTUxGoUpdaTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison T.", 
    "review_text": "Rosewood is usually my first stop when going down Broadway.  The times that I have been there it wasn't overly crowded.  A bit loud there so if you're wanting to just hang out and chat...ummmm...not a chance.  My favorite drink here is the Orange ROY-al...it's not on the menu and I had the bartender make it.  Since his name was Roy and it tasted like Orangina but there was absolutely nothing citrus in here...we named it the orange royal.  I had 2 of those one night on top of all the other drinks that I had I ended up pretty damn tipsy.  This place is kinda small but overall not too bad.", 
    "review_date": "2008-06-30"
  }, 
  "BGHdDra4uLCpIqTLOorNRw": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Nicole S.", 
    "review_text": "This place is my favorite bar in the city. Its mellow but fun, the DJ's usually spinning some great hip-hop and the bartenders are cool and non-pretentious. Don't get scared off by the fact that it's in north beach. it's enough off the beaten path that it's usually just SF locals, not the raucous san jose crowd that takes over the rest of the neighborhood on saturday nights. It doesn't get going until late so it's best to roll in by 11 or so.", 
    "review_date": "2005-07-20"
  }, 
  "3yF53JSiDZNeA1qnSipkgg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julio V.", 
    "review_text": "by far my favorite place in the city. Great decor, good staff, and different ambients - including nice outdoor space. The music is also great, and when the crowd gets dancing, this place is unbeatable.", 
    "review_date": "2006-08-06"
  }, 
  "52O5yB6JxzqxssUy7qEtrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica S.", 
    "review_text": "I wound up here after waiting in line at a poorly organized club (Embarcadero Four?) for almost an hour in the safty weather on Saturday night.  The bouncers were polite in letting us in, and we waited for some of our other friends to show up, without too many stares at our diverse crowd in this otherwise pretty trendy, Caucasian bar. The bartender was nice, and my drink was appropriately drink-y. We snuck into the back room (which was apparently being rented out for a party, but nobody was using it, save this couple that was making out in the corner) and sat there to chill, and nobody from the bar bothered us or asked us to leave.  The bathrooms were relatively clean, and the vibe was nice. I was too cold to venture out onto the back patio, but from glancing out the door, it seemed nice and clean, and not too smoky, which is a welcome change from some of the other clubs/bars out there which have smoking areas cloaked in a haze of smoke.  I'd go back with friends, the music was pretty chill also. minus one star for the people hogging the lounge benches  in the main area.", 
    "review_date": "2006-09-11"
  }, 
  "qo8hQwnxnvY04rENn3gssg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elaine S.", 
    "review_text": "This bar is pretty much hidden between Chinese restaurants in Chinatown...  From the pictures it looked like it has a good atmosphere and was quite cute! When I arrived I was in total chaos ... The bar was so full there was barely room to stand without being pushed along a sea of people.  The drinks are alright .. I just wish there was more room to breathe.", 
    "review_date": "2012-04-09"
  }, 
  "lV_lTwqdvBpp95SFO5yfbQ": {
    "user_rating": 4.0, 
    "user_location": "Garden Grove, CA", 
    "user_name": "Tracy N.", 
    "review_text": "Went here for a friend's going away thing on a Friday night. Forgot when we got there... maybe 11? 1130? And got in without a cover charge. Bouncer was nice. In fact my bf kind of snuck past behind him while he was checking our IDs and he didn't really mind haha. I started laughing really hard bc my bf is a little naive and doesn't go to bars/lounges/clubs much so he didn't realize they needed to check his ID and the bouncer simply asked, \"why are you laughing at me??.\"  Plenty of seating. Crowded so a little hard to move through to get to the dance floor but I guess that means this place is happening. There is a back seating area and also an outdoor area and another bar/room outside. I liked the music a lot better out there, but I don't think it was a DJ. A lot of songs repeated haha. But it was much more to my preference--upbeat/dance music not hip hop like inside.  Didn't notice much else about this place but it was a good night ^^ I think at some point a line formed outside and they really regulating who came in or not, but don't know what was going on.  Would definitely come back and finding parking was easy.", 
    "review_date": "2012-03-20"
  }, 
  "w72KMWZ05NYbGh8MZQlUjg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Daniel A.", 
    "review_text": "Held my 30th Birthday here and I couldn't have asked for a better time!    Toni was amazing at helping coordinate everything. She helped the DJ set up, the photo booth and cake. When I got there everything was ready and set.   All my guests enjoyed themselves, I woke up to numerous texts saying how much fun they had!!  Thanks to Toni and the Rosewood staff for such a great time!", 
    "review_date": "2014-03-03"
  }, 
  "-pvKGlb04e8brYqsXGteQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin R.", 
    "review_text": "Ah, Rosewood; So easily confused with plot elements from Orson Welles films, yet so very different in character. Welles was a man to stand alone, to take a stand... but in Rosewood one can never stand alone. One can only stand in a crowd. In fact, it's less like you're standing, and more like you're suspended in the crowd and a moved around BY them rather than of your own accord...  The music is good, but you're never more than a part of the crowd here. Maybe I'll come back some day when trashed :-)", 
    "review_date": "2007-03-09"
  }, 
  "HAu5OgbkLGsmLhKBJ2RR1g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joyce C.", 
    "review_text": "My friend decided to celebrate his birthday at Rosewood for a few reasons - diverse crowd and non EDM music.  Sounds good to me.  The bar is pretty small.  When you walk in, theres the bar on the left and seating areas on the right.  The walkway in the middle was packed.  In the back, there was a small dancefloor.  Half of the dance floor is occupied with people waiting for the bathroom.  There's also a patio area in the back with a smaller bar.  The bar service is EXTREMELY slow.  I think there was one bartender working it?  EXTREMELY SLOW.  But, she was really nice.  Many of us got free drinks from her.  SCORE!  BUT REALLY, SO SLOW.    The crowd was not really that diverse - perhaps its because my friend's birthday brought in 30+ Asian kids?  Probably not like that normally?  No clue.    The bathroom line was impossible.  There's 2 stalls for everyone.  And the inside was disgusting.  But if you gotta go, you gotta go.  Overall, this is a good place to hang out.  No cover.  Just casual and fun :)", 
    "review_date": "2012-02-25"
  }, 
  "in68cnbJN1AQ6FMpuloXXA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shahed T.", 
    "review_text": "I have been trying every day for over a week to reach this lounge to plan a large party, yet the number posted here isn't working, and I have emailed then event email listed on the website now 4 times without a response :(. Given that my hopeful birthday party was supposed to be next month, I'm quite disappointed... Anyone else know how contact this venue???", 
    "review_date": "2014-11-09"
  }, 
  "dh2fVHvb9EC9uJVjD2_DCA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim K.", 
    "review_text": "This is to specifically review Rosewood as a place for private events.   I recommend Rosewood Bar very highly for private events. I just hosted a surprise party for my husband, and everyone at the party was really impressed by the private party space (which for my party included the entire outdoor patio space), the bartender and the rest of the staff. Several of my friends told me that they would definitely consider using Rosewood Bar for their future events.   The manager of the place, Doug, is very cool and very accommodating - during the planning stages he was available in the afternoons for walk-throughs for me and for my friend who was helping me decorate and during the evening he really helped with keeping track of the bar bill, helping with the AV, helping with clean up and making sure everything was OK.   My party had about 50 people at the peak time, and there was PLENTY of room including room for people to dance. You could probably go as high as 70 people without too much crowding.   The price was reasonable for such a great space and they did not throw in any extra fees or charges even though we had the sole use of a bartender and a door guy.   They were really good people and definitely contributed to the overall success of my party!", 
    "review_date": "2009-04-06"
  }, 
  "lpAM2-TTc4I_vB-hedQgWA": {
    "user_rating": 5.0, 
    "user_location": "Benicia, CA", 
    "user_name": "April D.", 
    "review_text": "It was my boyfriend's 28th birthday...the night was young and our bellies were full...  A group of us, 5 couples, went to Rosewood by recommendation of one of our fellow homies.   Guess what? It was a great spot! It was a Friday night, about 11:30 pm and it was not packed. We were able to get a table while the guys hung out at the bar.  The best part - Great music - from N.E.R.D to Common to Mos Def...great lounging hits!!!  We will return!", 
    "review_date": "2007-05-28"
  }, 
  "2p6iEFExhzppPDr7UDWS7w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brian w.", 
    "review_text": "to me, rosewood's been a bit like the pair of ferragamo loafers i bought in italy.  first time i wore them, walking through the streets of venice, i got a blister. if you've ever been to venice, you know that's the last place in the world you want to get a blister.  as for rosewood, first time there everything about it rubbed me the wrong way - impossible to find, impossible to find parking, packed to the gills, hotter than crap inside, hard to get drinks.  second time i wore them in vegas, i swapped out the inserts, and they felt much much better.  no blisters after a night of partying and walking up and down the strip.  second time at rosewood, it's still packed and hot as hell, but the vibe is good.  i guess when your friends are having fun it's hard not to have a good time as well (unless you're the debbie downer of the group but just don't know it yet).  third time was this past saturday night, wearing said loafters at rosewood. i had a great time, as did all of my friends.  we discovered that if you sit your attractive girlfriend (or date) at the bar when a seat opens up, the drink flow is steady and hassle-free.  by now the shoes fit me like a pair of loafers should - and so did rosewood.    i guess it just took a little bit of breaking in.", 
    "review_date": "2007-10-01"
  }, 
  "mROok9JZx19AwvOJlI8FHQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art O.", 
    "review_text": "I've been to Rosewood about a half dozen times now (most of the them for the Yelp DJ Events) and I've had fun on each visit.   The modern decor, patio, and extra rooms in the back make for a lively place to have drinks, mingle, and dance.   The sound system was able to accommodate all the different types of music that I've heard too.  One star taken off for the pricey drinks but overall, a great place to have fun if you're on the Chinatown/North Beach border.", 
    "review_date": "2009-06-21"
  }, 
  "DiCBpb_hyNy2150fGAbEug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tan E.", 
    "review_text": "Rosewood was the very first bar I went to when I moved to the city. I literally jumped off the plane, my fellow Texas girlfriend picked me up, and drove me to Rosewood where I had my first drink as an SF immigrant. For a while, this place became the Wednesday night hangout for my friends and I, until it gort\"discovered\" by a sheeshier crowd. Nonetheless, the Wood has been able to maintain it's underground vibe, that allows me to sip to decent drinks and dance to its fun old school hip hop beats.  Me likey!", 
    "review_date": "2006-12-09"
  }, 
  "KQcGQ_djMNa1t0OLkQseKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate B.", 
    "review_text": "Rosewood, where did you go?  You used to be my favorite place in the city but now so empty.  Everyone, go to this bar!  There's couches, good drinks, great hip hop, and a dance floor that's perfect size for a fun night with friends.  There's even a back room for private parties.  Bring back the fun!", 
    "review_date": "2006-01-10"
  }, 
  "GmN6Qwo9aK803f7PLH6dVw": {
    "user_rating": 4.0, 
    "user_location": "Hawthorne, CA", 
    "user_name": "Ali B.", 
    "review_text": "Oh wow, what fun! Even though there was a party that packed the whole place it was a blast. Music, a little interesting at times, but for the most part was good. Dance floor! Woo! Sleek look but cozy too. Would certainly come back.", 
    "review_date": "2011-02-27"
  }, 
  "uZKLg2RRJfAbKFo_hldn6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura q.", 
    "review_text": "I've never been a big fan of anything on Broadway as a place to hit up at night so I was surprised to find such a cool place here.  The decor is on the nicer side for the area with a random little dj booth set up right next to the bar.  Theres also a back area that you can dance in if you feel like gettin your groove on. Unfortunately, it takes a while to get a drink here; it seems as though theres only one guy who pours beer and another bartender who actually makes drinks (although she was sweet enough to give me all of my drinks on the house because I waited  a while.)  Aside from the skeezies who decided to follow me around all night, Id have to say that this is a pretty decent place if you're looking for a nice laid back spot in North Beach.  But ladies, be forewarned, this is not a very big space and duck and hide tactics don't work very well here.", 
    "review_date": "2009-01-15"
  }, 
  "M9PmJw0TBs4cueJp75dvGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A W.", 
    "review_text": "Came here again recently for an annual party.   My experience was great because of the: a. fun people b. photobooth c. free food &amp; grey goose cosmos (holler.)  I STILL have yet to come on a normal day, but Rosewood seems to have kind of a weird feel.... Feels like it's someone's old flat (main room in front, kitchen &amp; bedroom in back.)  Bartenders were talented but not as friendly as the last time I was there.  Great venue for hosting a party but it does seem a bit \"cold.\"", 
    "review_date": "2008-12-18"
  }, 
  "JNyLyXn-unUhJmiGJnI6tQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hannah J.", 
    "review_text": "Rosewood was my New Year's Eve destination, in part because my friends were going (lemming!), in part because of the cool space, with outdoor patio, and in part because of its proximity to the Broadway Tunnel (a favorite late night walking route of mine--so safe and sanitary).    Having witnessed much of the party planning preparations, I was well aware that the owner and staff were exceedingly easy to work with.  The night of, they proved themselves just as friendly and festive, going above and beyond our expectations.", 
    "review_date": "2007-01-28"
  }, 
  "NU9DwKAg9SShW9jIy2AnfA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "April Z.", 
    "review_text": "Bad idea #1 - going on a Saturday night.  Bad idea #2 - not having a back-up place in case there was someone holding a birthday party there (there was.)  Bad idea #3 - Going with a (scattered) group of 30+ people.   Basically what I'm trying to say is that Rosewood's a bit on the small side. Sure there's a dance room in the back...but if you're going there to get some drinks and chill, there's not enough space for you to just stand somewhere and not get squished and/or pushed around. I made countless 360 degrees turns because people around me were trying to go in different directions and trying to not spell liquor on other people.   On the upside, the drinks were pretty good. Decently priced, a bit on the expensive side. Bartenders are fast and efficient, but you can't escape the wait since there's ten other people telling one bartender what they want. They also allow you to use credit card / and open a tab, which made paying easier.   I would be open to try this place again, probably on a weekday night, and see how that goes. :)", 
    "review_date": "2009-07-19"
  }, 
  "BrgUPuFlkmt_r6vMSvn2hA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seda B.", 
    "review_text": "This place is a hidden gem!  I had the chance to host many great company events here and the venue is aazing. Especially loveee loveee their patio area :)  The staff is very friendly, Kudos to Antonia! They are very helpful, hardworking and look happy all the time. I love Rosewood Bar and everyone should definitely check it out!", 
    "review_date": "2014-09-20"
  }, 
  "5Ap91V6vM4wgxgJeCu68-Q": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Joanne T.", 
    "review_text": "The bar is pretty small, but there's this nice little intimate seating area outside, in the back. If it hadn't been so cold that night, I probably would have enjoyed it more...   Rosewood is more of a really really relaxed bar in a convenient location. Not a see and be seen place...", 
    "review_date": "2008-12-03"
  }, 
  "8ozxJndeMSqObxZc4xDsbg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anoo L.", 
    "review_text": "I really like this place, but what's up with the timings?    I've been here once before for a private party, it's a cute spot with an outdoor patio in the back. A lot cuter than the divey North Beach bars.  But every time I've been here since, it looks like its being renovated or it's not open for some reason.  I recently tried to go here Saturday evening, I checked the website, and it said it's open at 5pm on Saturdays (considering they do have a patio, they should be open during the day, SF is known for day drinking)...When I got here at 6:30PM, they were still getting ready for the night.  The guy cleaning asked me to come in 30 mins, and I reminded him that the website said 5PM, and he said no we are not ready.  I mean c'mon!  I recommend calling before you go.", 
    "review_date": "2013-08-06"
  }, 
  "dim5Svrt-B1jvvQsOIX22A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Z.", 
    "review_text": "This place is really cool (yes, lame intro) and I think it's kind of a hidden gem among the crappy looking Chinese restaraunts on Broadway and I think its the perfect venue for closing out your Friday/Saturday night if you live in the vicinity.  Nick H. warned me about the bouncer who is a real smartass so most of the reason that I would come back is to annoy him and so that he would be forced to give me more than a C+ for my comebacks.  They play hip hop and some hip hop holla backs, which definitely put me in the mood to shake my bootay...but I was really afrraid that the bouncer would tell me that I dance like a typical white girl.  So I didn't dance...one of these weekend nights I'll work up the courage...", 
    "review_date": "2007-04-09"
  }, 
  "ELc2M96tMEomAhPz23zH9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alicia A.", 
    "review_text": "I can't believe that we missed the patio!  We did get the awesome seat by the window though.  Great drinks and not too crowded on a Saturday night.", 
    "review_date": "2006-08-21"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "I attended a private party on Saturday night for my friend Glynis M who will be embarking on a new chapter of life in London later this year, lucky lady. My friend and I could hardly find the place as we walked up from a birthday party we attended at Kell's. It's super incognito, and the street is pretty dark, but the bouncer was friendly and showed us where the party was.  The bar itself was pretty standard, and I've actually been there before but I didn't realzie they had a backyard area that could be pimped out to look super classy. Gold string lights, plants, wood benches, and a private bar with Glynis-themed cocktails were among the amenitites. It didn't hurt that a ton of friends were there too. Really a nice spot, I hope to be back soon, but management should consider some signage or lights on the dark street in front so people can actually find it.", 
    "review_date": "2014-08-26"
  }, 
  "2l0O1EI1m0yWjFo2zSt71w": {
    "user_rating": 3.0, 
    "user_location": "Carmel by the Sea, CA", 
    "user_name": "Shiho F.", 
    "review_text": "Pretty sweet space in a convenient location.  I really liked the bar in the back but I got kicked out (more like not let back in even though my friend just started a tab back there).  The vibe in the back was super mellow and would serve as a good venue for an intimate gathering of friends (for drinking purposes).", 
    "review_date": "2008-11-21"
  }, 
  "w1GTxc6VqJTG57tpO8ZoxA": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Laura S.", 
    "review_text": "i attended a private party here. The private room leads to the patio and the back patio is super cute. The place is tucked in between a bunch of visually unappealling stores.  it was hard to find.", 
    "review_date": "2014-01-15"
  }, 
  "9CWr1HukCWdjW-5zTCXVIA": {
    "user_rating": 4.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Gracie B.", 
    "review_text": "The place is just as fabulous as our very fabulous Angelo. The back room - guarded by a bouncer - had just enough space to fit in his many friends, but still look full.  The bar tender was great and the music was a mix of that horrible popular stuff that you (ok...Joyita and I) can't help dancing to.", 
    "review_date": "2008-10-24"
  }, 
  "-revik7E7JG7umKzU_OLAA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Kaio T.", 
    "review_text": "Pretty cool place.. i would give it 5 stars.. but the lack of space makes me feel claustrophopbic...  In the end the bar peeps are friendly.. and if there exist a drink.. you can slurp it up here.  I will have to say though i give props to the boys outside.. when its past midnight.. just tell them you want to go in to drink it up.. and they will probably let you in..  It also helps to have some hot chicks on your arm as well!!", 
    "review_date": "2006-08-16"
  }, 
  "6barujjst79kB-Jsg9092g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy N.", 
    "review_text": "literally a watering hole with really loud music...if you drove by it, you'd probably miss this tiny sign.  i've only been really late in the evenings, so can't attest to a whole night experience there...but i'd go back.", 
    "review_date": "2008-10-22"
  }, 
  "khFA0eLpu7H08JOWtiVF8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa B.", 
    "review_text": "Yeah, I've been giving a lot of 5-star reviews lately...but I guess things have just been good for awhile. Thanks to Yelp, I stay away from the crappy places and only frequent the good! This is the power of the INTERNET! Thanks Al!   Anyhoo, I'm a little late writing my review of Rosewood after the DJ Battlefield Earth event organized by douchebag numero uno, Jing Tao Fuckface aka JT F. But...  Quite honestly...I love you all.  This was so much fun - such great music, such ridiculous fun on the dancefloor. Rachel, Karen, Sammy, AJ, Omid, Graceypoo...you all can DANCE! And everyone else I forgot...please forgive me, not surprisingly, I was drinking. I loved the layout of this place - as Steph was saying, there are all these different zones. It really made for a great experience and I am definitely planning on going back and checking it out on a regular night.   Sadly, they ran out of grapefruit juice by the end of the night, but that's not very surprising considering the disproportionate love of Greyhounds among the crowd present.   Also, thanks so much to Greg at Rosewood for letting us take over and being so gracious about it.", 
    "review_date": "2007-07-15"
  }, 
  "Fo4dF9tzghnMBCTm_8W-Jg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jake R.", 
    "review_text": "I didn't really see too much of this place since I just stopped in with Rob and Angelo for a minute before closing on Saturday, but it seemed nice enough. I hear the best part is the patio out back, but when we tried to head back there we were told it's only open for private parties, which was lame.   They did have a cool little dance floor and non-bottle-required tables and benches you could sit at which I always appreciate. It shouldn't cost me 400$ and up to have a seat at your drinking establishment.   I hear the back is really where it's at, so hopefully I'll see it someday.", 
    "review_date": "2008-04-13"
  }, 
  "BKxQJJAh_0Jtv4MqxbjkMA": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ian M.", 
    "review_text": "I went to a super fun private party in the back room here last Friday.  I was impressed by the place.  The front bar was really nice with a warm modern wood decor.  I didn't pause to enjoy the scene there but as I passed through the music was fun and the crowd seemed to have dressed up for the night.  The party in the back was great.  Super packed with some dancing here and there and a chill patio scene.  The bouncer watching the list at the private party door was nice and mellow and didn't have any problem recognizing us as we came and went.  I'd go back, private party or not.", 
    "review_date": "2006-12-04"
  }, 
  "HC3cKhfMkHFSDe8L9Y7UsA": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "F M.", 
    "review_text": "Rosewood is an amazing venue for private parties. Toni who helped us plan the event was amazing! We even got to name our own drinks. I loved the layout, there is plenty of room on the dance floor and the outside patio is a nice place to take a break.   The only reason the place gets 4 rather than 5 stars is the DJ. The DJ was supposed to have top 40, but I don't know what he was playing. I tired to make requests for popular songs and he didn't have the music requests I wanted : (", 
    "review_date": "2011-12-19"
  }, 
  "GpXHZzZXfAL6u6beIC0cIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marina K.", 
    "review_text": "I love the new addition to the back room. They have a really nice outdoor patio now. well... it's not really \"new\", but newer compared to the rest of the place. Fav night to go is Wednesday. They play a great variety of euro hip hop and underground us hiphop. Great crowd, very eclectic. totally different from the rest of North Beach. Wish that they had more space to dance, but it's really beautiful inside. The back room can be rented out at a reasonable price too for private parties. complete with your own bouncer too :)", 
    "review_date": "2005-05-26"
  }, 
  "hVY5dJtw_B3zdAYN4V7I0A": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brian H.", 
    "review_text": "I've never been able to figure out why, but I've been to bars in the Castro with a better female to male ratio than Rosewood.", 
    "review_date": "2005-05-24"
  }, 
  "0nwGxhxTX_1l0zchn5PBJw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe C.", 
    "review_text": "Two beers.  I said I would drink only two beers.  TWO!  But inside Rosewood, with chatty Yelpers everywhere, Bill's bad ass platters spinning beats that bounce around the room like superballs, Jaime's bajingo in the house . . . somehow it becomes impossible to perform basic math.   \"ok - so, I've now had 3 beers in the first 60 minutes, so if I am planning to have only two beers while at Rosewood, I had better start catching up!  Bartender!\"  2 hours, 5 beers, and I bowled like a stud last night.  Sadly, I missed the dancing.  Next time.  As for the place - nice bar, nice patio, snappy bartenders, no complaints.  5 stars.", 
    "review_date": "2008-06-20"
  }, 
  "VOlSQPbMKt8OTbRYrFyJYw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt W.", 
    "review_text": "Underrated - my buddy Julio throws great parties there.", 
    "review_date": "2007-12-06"
  }, 
  "zpWizDgUk4-rQJXdjiBY1w": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Christina L.", 
    "review_text": "Private party here? YES PLEASE!!  WOW, what an amazing experience at the Rosewood. I held my 25th birthday here and Toni, the event coordinator/bar manager, worked with us to reserve the front part of the bar for my party. For my semi-private party, we were allowed to customize the drinks with ingredients and names, control the music via Spotify, and provide my guests with a passcode to get into the event to ensure we had a closed guest list. This place has a dance floor and a pretty decent amount of seating if you feel like chilling on the side. Also although the guests from the other party had to walk through our party, I didn't feel like the guests from the other party invaded our event too much - or maybe they just blended well and I didn't notice! We had ~40 guests, and the place didn't feel crowded at all.   You're also allowed to bring in your own food! That's a pretty sweet deal.   If you're looking for a venue that isn't overly priced and has great service, look no further! The only caveat is that my friends had to taxi or drive to the location, but at least it prevented a lot of them from leaving before 12:30am, when the party was just getting started!  Kudos to the bar tender who immediately handed a towel to me when a drink spilled on the entire back of my dress.  Five stars for this location/bar, I would definitely recommend this place for future events.", 
    "review_date": "2013-05-01"
  }, 
  "NpU44ANnUUNQWY4U0eUGvA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "claudia y.", 
    "review_text": "not a bad place to hang out for drinks.  a dancefloor in the back.  never been on the patio.  can get crowded.  music is good.  long bathroom lines though.  no cover.  is far away from all other northbeach bars.  but close to sip.  and yuet lee.", 
    "review_date": "2008-09-08"
  }, 
  "zpip_kWCOda43ZCWk0BFmQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace Y.", 
    "review_text": "Looking through the reviews - it is no surprise that most people who gave Rosewood 4-star or 5-star reviews held an event in the back patio.  Every time I've gone to Rosewood, the back patio is being used for a private party. I've come to just expect that from Rosewood and this is quite disappointing.  Pluses: - Friendly staff - GREAT music (they will also change it to what you request if you ask nicely) - Fun dance bar/dancing space - Variety of drinks - Close to other bars and late night food (Golden Boy)  Minuses: - Back patio is basically not open to the public because there are always events going on  - The front of the place also gets used for private parties sometimes, which puts non-private party people somewhere in the middle  I want to go back but only if I can access the back patio - please Rosewood?", 
    "review_date": "2014-07-06"
  }, 
  "vjLPc9nYPkZNLX4ulBeTCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kiki D.", 
    "review_text": "Good music, cool crowd, &amp; fun night!", 
    "review_date": "2009-07-07"
  }, 
  "A6cnSgLx01w67iJweLjmuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna R.", 
    "review_text": "I like this place. I haven't had a bad experience the few times I've been here.  Drinks are good. Staff is good. Parking, haven't had trouble.  Also, it's close to golden boy pizza. :)", 
    "review_date": "2014-02-27"
  }, 
  "FKyQWTe-yrm1tRTRveurkA": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Linda C.", 
    "review_text": "Cute little bar nestled in Chinatown with an unassuming back room for private parties.  Actually really really cute, with a nice outdoor patio as well.  It's pretty chill but later the girls and dudes dressed to the nines roll in and scoff at you in your cute tee, ripped jeans, and chucks...wth, I'm stylin' too!  Whatever, sit there drink a beer or a cocktail, chat with the people that stop in, it's all good in the 'hood (of chinatown! ;D)  drinks were okay, but the ambiance was nice, I would come here again for the sheer fact that a homeboy lives across the way! :)  And because I had fun with my friends here! :)", 
    "review_date": "2007-04-02"
  }, 
  "QxPxxPjgcQ-MDM6OMYMFCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pelle Y.", 
    "review_text": "Thoughts running through my head at Rosewood last night.  - Where the hell is it?  It can't be INSIDE the Broadway Tunnel. - Oh here it is, the place is so unmarked.  That's okay, keeps out the riff raff. - It's fireplace orange and brown inside.  So warm and home-y, just the way I like it. - Hey, the light fixtures look like martini olives.  Martini, yes, drink, yes. - Ooh, the bar stool is pretty comfy. - Yes, Roy, the bartender with the Irish (no, not Scottish) accent is making my drink good and strong. - It's only 9pm and not crowded yet.  I think I need to walk around, check out the place. - Hey, nice wine display in front of the dance floor.  This place isn't just for hard stiff drinks. - Hmm, it says private party.  You know I'm New Yorker nosy.  It won't matter if I take a little peek.  Hey, it's a cool little space in the back. - Okay, I should get back to our little group.  I'm already dizzy. - Why is that dude wearing shades in here?  He says he's from Brooklyn.  Correct me.  He said he was only born in Brooklyn.  There is a difference. - Thirsty thirsty.  I need another one. - And another one. - And another one. - Happy.", 
    "review_date": "2007-04-14"
  }, 
  "G9Vb6yQ047TC3O_-GG4WZA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Connie C.", 
    "review_text": "One of my favorite bars in North Beach to lounge at and have a couple lychee martinis. When I used to live nearby, I'd come here pretty often because it's pretty hidden on the far end of Broadway, so not many people knew about it. I really like the small space, and it's great for private parties. When you're with friends dancing on the small dance floor or squeezing into the little couches with each other, it's a lot more fun. You'll probably want to ask your own DJ friends to spin too.", 
    "review_date": "2006-01-16"
  }, 
  "b0lXNnfnZpKPv7xNwpG3Ig": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jen C.", 
    "review_text": "It's a nice little lounge on the border of Chinatown/NorthBeach.  11PM on a Saturday night and no bouncer and no cover...score!  Only minus was the bartender didn't know what a Woohoo was and we ended up having cough medicine shots.", 
    "review_date": "2008-02-19"
  }, 
  "4BEsDcvJZf0reK3yQdgu5Q": {
    "user_rating": 3.0, 
    "user_location": "Hermosa Beach, CA", 
    "user_name": "Barry Z.", 
    "review_text": "I researched and contracted ovet ten bar for my girl friend's 30th before I was in the recommendation as the rosewood. Toni was a complete doll to work with this and at the time she is so quick to respond you and here all you have to do is tell her what you like and she will make something totally as the unique one to me.", 
    "review_date": "2014-01-10"
  }, 
  "ZtmeHAQyNFku338dJMIfTg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "3 stars with the potential to grow.  Went here for the first time and unfortunately didn't feel the love that most others here did.  When I walked in at around 11:00 on a Friday night I was one of three people in the whole place.  I was meeting up with a big group and oddly enough when they showed up, so did about 20 other people.  So it did crowd up rather quickly but it was an odd crowd regardless.  Quality over quantity I always say.  Drinks were ok, not that strong and average priced.  The music was nothing to yelp about.  The ambiance was actually great, perhaps one of my favorite \"looking\" and \"feeling\" bars in North Beach, even though this place really is in Chinatown...   I'll give it another chance sometime but until then I'm stuck at 3 stars.  P.S. I had no idea there was a patio, will definitely have to check that out next time.", 
    "review_date": "2007-09-01"
  }, 
  "zpb17M4OG4Agjn3dK32CEw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelo F.", 
    "review_text": "Dick bouncer lecturing me about bringing a backpack into a bar. So I'm supposed to go halfway across the city to leave it at home? It would be a 2 star loss just for that if he hadn't let me in. Just -1 star for the lecture. But that mojito was pretty bad. I ordered a mojito because I have been drinking all day and needed a light drink. It was simple syrup w/ a splash of soda instead of the other way around. Way too sweet -1 star.   What happened to this place? I remember when I would consider having another private event here but the quality of customer has fallen off a cliff. The first thing greeting me is a dumb-ass at the door accusing me of tagging up the bathroom w/ sharpies in my bag? STFU", 
    "review_date": "2011-05-22"
  }, 
  "UnvwodJKxqXn6Bhhcm1Amg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kari L.", 
    "review_text": "This place has a great vibe, an outdoor patio, fun music/dj, and friendly bartenders and bouncers...you can either just hang out and chat with friends over drinks, or go wild on the dance floor.  It's hidden away in between a few chinese stores and restaurants.   Apparently, you can rent out the back room for a private party, and have access to the back outdoor area.  The owner was kind enough to open up the place when it was closed so I could get my jacket that I had left there!", 
    "review_date": "2008-09-22"
  }, 
  "bkT1wsuQkOyOVk0eOFM_8Q": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Tracy M.", 
    "review_text": "It seems as though years ago, rosewood was hot, then not, and now over the past year or so, it seems like it is hot again.  The parties have generally been fun, the place loud and cramped, the crowd sometimes too \"marina\" sometimes not...just depends.  Anyway, my most recent experience there was great as far as company goes and just decent as far as service.  I have a little bit of a hard time with places that have a capacity for 200 people only having 2  bathrooms (meaning stalls) in the entire establishment.    The service, just average....I had to wait 10 minutes in an empty bar (I got there early) for a drink.  Overall, had a great time, until I HAD to leave because I was getting harassed by a friend of a friend...in this case persistence only led to annoyance.....def did not pay off.", 
    "review_date": "2006-03-06"
  }, 
  "aVaa64zb_-d6VTY3XcXyIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane A.", 
    "review_text": "I've been here a few times before we start our drunk rendevous bar hopping on Broadway. I love the atmosphere of this place, dark, sexie, and cute. The music and drinks are always a nice add on when kicking back here with friends.", 
    "review_date": "2008-06-03"
  }, 
  "tbYCj_yUXd0kjdipFJs2iA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Monica N.", 
    "review_text": "Nice little break from the madness that can be North Beach. Enjoy it because the DJ (most of the time) will spin hiphop- but the speaker system needs to be upgraded for a better effect. It doesn't get crowded until later on in the night (11-12am), but when it does, good luck trying to get a drink!", 
    "review_date": "2006-02-03"
  }, 
  "iKgxE370H8mjNpCITtXujw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sati l.", 
    "review_text": "Hey All you Rosewood fans check out this funny video which involves an escaped Alcatraz prisoner who ends up at Rosewood. Created by Rosewood's DJ Satva and Thomas Mich:  Escape to the Barbary Coast <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DyvSkRL0-d6E&amp;s=24b2c6479e3ba9761605af7fb8e0cdbc4c1e388c99d139259ad69cad98ce1e86\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=yvSk…</a>", 
    "review_date": "2010-10-07"
  }, 
  "nqb5kKa4nHQtVq6zQZtnxg": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Charm N.", 
    "review_text": "This place sucks! I went here because everyone raved about this place, but the DJs can't mix beats, the sound was terrible with cheap speakers blaring in one corner, the bar was crowded w/people just standing around, the bathroom lines were long, and the dance floor was wet and sticky! I know the Peninsula peeps might go down to NB's main strip, but damn this place was filled with people who thought they were too cool for school. I'd rather go hang out elsewhere where the DJs can spin and the crowd acts like they're having fun!", 
    "review_date": "2005-08-29"
  }, 
  "ChKHMb5xCCjO99vac3MhnQ": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Scott Y.", 
    "review_text": "The perfect blend of good music, flavorful drinks, plenty of seating, and booty everywhere (i mean, dancing).  Really good staff and I had no idea but there is a private room in the back that is pretty spacious with private bar.  I really hope this place never gets too trendy.", 
    "review_date": "2007-03-04"
  }, 
  "i8L_pnkXcJQ8VyApK_3_mw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Juv C.", 
    "review_text": "Went for the Yelp DJ event 3 The Hard Way.  Cool spot and nice layout.  I liked that it was dimly lit with candles lining the bar and lounge tables.  A nice comfortable bar you can hit up after work and not worry about it being too packed.    There was open space for what seemed like dancing but im not sure i would come here to dance.  Although when Aaron I. played Debbie Gibson, i admit, i got off my stool wanting to bring it back to the 80s, but refrained and instead just smiled and bobbed my head.  Him and AJ did an awesome job at playing good tunes.  I really liked the outdoor patio with the bamboo surrounding.  It made me want to smoke though.  Damn.   The bartender/owner was extremely nice.  When i didn't like a drink i ordered he gladly replaced it with another, no charge.  He also made a special drink a couple friends of mine had that i wanted to try but didnt get to.  Special thanks to JT for buying my first round.  Arigato my friend!  Guess i'll have to come back to see what special concoction the bartender came up with.", 
    "review_date": "2009-06-23"
  }, 
  "zGOXKICJ-X6tcoIHaGaITg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kia B.", 
    "review_text": "Cassio P. made me drink an insane amount of alcohol \n here on a recent Tuesday night.\n Well, he didn't \"make\" me, but it was all for charity-\n so how the hell could I say NO?\n Great space, very sexy with low-lighting and wood paneled walls.\n Dianna D. was hold'n it down behind the bar with her sexy self.\n She hooked up my caipirinhas(4 to be exact), got me buzzed \n &amp; in my bootylicious mode.\n I even danced with Gil S.(what a lucky girl)\n But I only award 4 stars.\n Why? because of the pretty-boy DJ.\n Sure, your fly and all with your cocoa skin tone  &amp; perky pecs.\n But, how dare you refuse to submit to the\n big butt &amp; a smile that is Pookie W. &amp; myself. \n You didn't even look us in the eye when \n we tried to make a request.\n AS IF!!\n All I wanted was to here a lil' Tribe Called Quest, but you chose to play\n  \"Lovely Lady Lumps\" instead-Jigga what?\n Didn't you see that NO ONe was dancing??\n You Sir, get the gas-face. . .", 
    "review_date": "2006-08-25"
  }, 
  "jkr3YVCEoRNKkxinUZpW6A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanne G.", 
    "review_text": "This was my second visit to Rosewood, and I'm still none the impressed.    The back area seems cool for hosting a party, or so I've heard...I haven't been able to see since it's always been reserved.  So what about the rest of us?  There really needs to be more seating up front.  And more bartenders would be great too- people in my group waited forever to get drinks.  And I didn't even get a drink, thanks to the solo bartender on a Saturday night.  Maybe that's why I left so grumpy.    +3 for the awesome dj spinning behind the bar.", 
    "review_date": "2008-11-30"
  }, 
  "1dW1kLdcKuQprnhi4pC_iQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Séamus C.", 
    "review_text": "Wow, its been here for 10yrs already...1st time for me. Great layout, outside patio is fantastic. Great Dj spinning the night we were here. Drinks prices are average for the area, besure and tip your bartenders folks!! :-)", 
    "review_date": "2013-12-10"
  }, 
  "sRVGewx--HgwwlKwAfCO9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz S.", 
    "review_text": "I tend to like cool bars in unusual places.  Rosewood resides on a pretty colorless part of the Chinatown/North Beach merge, and you could easily miss it if you didn't know where to look.  The decor is masculine, clean &amp; modern with an really nice back room that is great for private parties.  I attended a Christmas party here a couple of years ago that was oh so much fun, and the indoor/outdoor aspect of the space was nice.  The layout goes front room/bathroom hallway/sharp right/back room - easy to miss if you're not paying attention. It's almost like having two bars in one - no complaints here!  Good cocktails, good service.  Friendly staff that held on to my suede jacket for almost a month when I left it there after previously mentioned Christmas party.  Recent night out here left me in a euphoric blur - after recovery, I will be back again.  Update 12/06:  Attended another Christmas party here, and I have to say, it is one of the best private-party venues in the city.  The staff is accomodating, the space is big enough but still personal, and the 2 rooms plus the outdoor area makes it feel like you're at someone's home.  Someone's home with a bar staff.  Kudos to this bar, once again.", 
    "review_date": "2006-08-17"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "one of the more laid back places to grab a drink in n. beach.  you can avoid the under 25 crowd here.", 
    "review_date": "2008-04-19"
  }, 
  "BMALCmkPgIbqAXzqxhRvLQ": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Kimberly B.", 
    "review_text": "So I just had an event over the weekend on a friday night and it was absolutely amazing! Amazing venue, amazing staff and big kudos to Toni who I think is the GM but helped me plan out the event.  I had my 30th private party there.  I used the back rooms including the patio.  The patio has beautiful lights decorated around and they also light up tea lights around the space so it really sets the ambiance.  I had a 1920's theme and it worked out perfect with the venue.  You can use their dvd projector so i had b&amp;w pictures of the '20's playing.  They also have an ipod hookup so I had jazz playing.  You have your own personal bartender which is awesome.  There was no rental fee but you did need to meet the bar minimum.   Toni was so helpful!! She created a 1920's cocktail menu for me.  She reminds me of a wedding planner that is always at your side.  She returns my calls/emails. Seriously funny and so much fun.  So overall, highly recommend this place.  It's very private perfect for parties which means you won't be having people that you don't know in your private space.  You really have control of the event.  Dopest place. People had so much fun and this place was getting really good hits from my guests.  THANK YOU TO THE STAFF AT ROSEWOOD AND ESP TONI!!! Really made my 30th memorable!", 
    "review_date": "2013-03-11"
  }, 
  "W9PUOzPRRXqSrN-sBEZogA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike O.", 
    "review_text": "Generally laid-back, good drinks. There's a DJ (or at least a guy with a laptop and a good itunes library) jammed in the corner, and an open space big enough to be used as a dance floor. The back patio area is what sets Rosewood apart from other bars; it's a quiet little oasis where you can actually have a conversation.   I've noticed that Rosewood has a very odd density distribution: there's usually a huge area in the front that's completely empty, then a cramped bottleneck going by the bar, then an oft-empty dance floor, leading back to the spacious back patio.", 
    "review_date": "2012-01-18"
  }, 
  "XnbGrJNw0wglmqXekW138Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn B.", 
    "review_text": "i have always been a fan of rosewood (in fact i am surprised that i havent reviewed it already!) - i really like the ambiance in this bar and the owners are really nice.  in fact all of the bars that they have are great - 15 romolo and rye as well.  hmmm - do they have a thing for bars that start with R??  anyway, i like the low lighting and nice seating that they have.  and since the music is usually great, they do have a small dancefloor where i can enjoy the beat.  not sure if they still have it, but they used to have a house drink which was some delicious concoction called a lemon chiffon.  soooo good! most recently i also went to a private b-day party in the backroom which rocked!  its a great space - small bar back there, a few couches, and leads to a little outdoor area that has some tables too.  i would definitely rent it out for a party.  i never even knew it was back there before!  rosewood is definitely one of my favorite go-to bars!", 
    "review_date": "2007-06-03"
  }, 
  "cs1GMqTt5eGmLqQyPijYcw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jen S.", 
    "review_text": "I like this place.  I don't like that I've never been able to find the patio.  If it is through the door that is on the right after you walk into that room right beyond the bar, then it was closed last time I went.  It is frustrating, I just want to find the patio.  Freaking out.  Where is the patio????", 
    "review_date": "2007-02-01"
  }, 
  "7d6LQAxkLO8Y5EfviOgs3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa P.", 
    "review_text": "So far so good! Such a cute place with an awesome patio area. Great space/ layout for private parties (separate room with a dedicated bartender and all) with reasonable minimums and even better fees (you won't find a nice place with a great minimum anywhere in SF). Working with Toni on planning an event here and she's been super helpful. So glad I found this place!  More details to come after the event!", 
    "review_date": "2013-03-11"
  }, 
  "ONDMgVKfQ9W1IDxfUuSDmA": {
    "user_rating": 3.0, 
    "user_location": "Hinsdale, IL", 
    "user_name": "Jenn C.", 
    "review_text": "Another hot date place or even to hang out with friends.  The seating is cool and there is a backroom where you can dance.  If you want to have a private party there's also a private room including a seperate bar area for that too!  It's a pretty good looking crowd, so if you want to just be surrounded by cool hip people, this place seems to fit the mark. But it is small so as it gets late, it gets VERY crowded!", 
    "review_date": "2006-03-22"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "UPDATE (6/12/07):  Came here for Jill K.'s awesome birthday party and had an absolute blast. The service was good, the drinks were spot-on (albeit somewhat pricey), and there was hardly a line for the bathroom. Also, the back room and patio are gorgeous.  I left my card there on Friday. Greg, the owner, had it delivered to Rye (his other bar), and I was able to pick it up on my way home from work. If that isn't genuine hospitality, I don't know what is...  ---  OLD REVIEW:  At Voda:  Stanley K.: Hey, are you coming to Rosewood with us after? Keane L.: I guess so. Is everyone else going? Stanley K.: Just us. Ed M. doesn't do Rosewood. Keane L.: Why not? Stanley K.: *shrugs*  At Chinese restaurant:  Sav B.: I can get us into Rosewood for free. Keane L.: How? Do you know a guy who knows a guy who killed some guy? Sav B.: I know the owner. It'll be good. Keane L.: I think everyone is there by now. Ed coming? Sav B.: Ed M. doesn't do Rosewood. Keane L.: Why not? Sav B.: *shrugs*  At Rosewood:  Keane L.: This place is packed. I can't even move. Kristine J.: Yeah, I'm not feeling this place. Keane L.: Lame. I'm going to take off now. Kristine J.: Calling it a night? Keane L.: Yeah... Keane L. doesn't do Rosewood.", 
    "review_date": "2007-01-16"
  }, 
  "vRziAXWI72nOFWNml4ldMA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hyung L.", 
    "review_text": "I like this bar. The DJ was really good. Played a bunch of tracks that are normally sampled so we could look at each other and go \"man I remember that track\". The bar is cool and staff really friendly. Small place but its a cool space. Would have given it more stars had the promotions guy Doug not been such a douche. My gf spent days on end trying to get a hold of this joker about reserving some space for a birthday for her friend. We had like 40 people coming and wanted to see about cover etc. He assures my gf no cover as long as we send a list and that he would reserve a bunch of booths.   Guess what asshole your fucking bar doesn't have any booths. Just a bunch of couches along the wall. Also there is no cover charge. If that's the case why string her along like that stupid ass. Anyways the bartendar was good and it's cool spot. They actually have a nice space in the back which you can actually rent out apparently, since there was another birthday in the back which would have been nice to know. It's off the strip but the DJ makes it worth going. Hopefully he's the house DJ so you guys can enjoy the music like I did.", 
    "review_date": "2009-03-18"
  }, 
  "IllQaEa35pICenTvtvmJPA": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Nirav K.", 
    "review_text": "I just threw a party last Saturday night for 100 people at Rosewood, and from A to Z, this place exudes pure class. The bar owner was extremely helpful and prompt in setting up a guest list for the night and the staff was SUPER nice to all of my guests. I'm from LA, so I'm not used to this good treatment from a bar. Usually, in Los Angeles guest lists mean nothing, and doormen give you so much attitude that you never want to come back, let alone throw a party at the venue. The experience at Rosewood  was the antithesis to the \"so LA\" attitude - it was fantastic.  The bar is perfect size to have a chill spot in the front where people can talk, and a small dance floor in the back where others can shake their asses. The night starts with really chill music that is not too loud so as to let your friends talk, mingle and sip martinis. Then by 10:45 PM, the DJ shows up and plays some fantastic hip-hop - both old-school classic Dre to the stuff they play on the radio today. You get 40 of your friends in this place, and you feel that the bar is entirely your own party. Thus, when we had over a 100, the place felt like it was totally styling. Rosewood is a perfect size to keep the crowd personal and comfortable, as well as allowing people to dance it up in the back.  I had such a good time that the event last night will be one of many at Rosewood. Thanks, Greg, for maintaining such a classy place from your venue to your wonderful staff. I'm sure that your vision for comfortable bars will make Rye just as fantastic as Rosewood. I'm looking forward to check out Rye as wee as your future bars.", 
    "review_date": "2006-02-26"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "Me likey - a lot!  Not just cause I got a chance to DJ here for a little bit, but because the drinks were good, the space is nice, and the owner is hella cool (and he's a Yelper).  I love the outdoor patio area - great so us smokers don't have to hang out in front and get weird stares from all the Chinatown locals - and the little dance floor area.  I may have to rent that back bar out one day.  The only problem with this place is that parking is a bitch....but you'd be best off taking a cab, cause you'll probably be three sheets to the wind when you leave!", 
    "review_date": "2007-07-15"
  }, 
  "D2b4DENpkezsw90fC2vWdw": {
    "user_rating": 3.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Kim-van T.", 
    "review_text": "Rosewood was the post-dinner destination for my birthday.  We thought parking would be ridiculous but it actually ended up being okay. =)  It's easy to miss as there's not really a sign outside.    When I first walked in I was really confused.  There were people just standing around in the back room area and I kept looking for the \"private room\" area because they sometimes open it up when there isn't a private party going on.  The decor of the main bar area is cute and cozy.  There was a mixup in table reservations and the owner/manager ended up giving our table away to some other girls but they very nicely rearranged furniture to make space for us.  The dj got started kind of late and the music wasn't really dance-y music. Yummy strong drinks though!  There's no dresscode but the bouncer still hassled my friend for wearing flip flops.   It was nice to finally check Rosewood out but I wouldn't go out of my way to come back.", 
    "review_date": "2010-01-06"
  }, 
  "ZeIDWs_A7cDWbbglRdOjeg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jose S.", 
    "review_text": "I went here on a Friday night and it was blah...  normal bland and was dead. I mean don't get me wrong, the place is had a nice ambiance to it. Very loungey, acid jazz music in the back ground, good drinks, but i was just wasn't impressed. Oh yeah long line for the guys bathroom, which is un-heard off... so minus 1 star.  I thought maybe it was just that night but when i tried coming here another night, it was closed off for a private party. So maybe if i go here another time i can change my rating but for now it gets a 2.", 
    "review_date": "2007-02-24"
  }, 
  "1oesrOIBYtaJUr2Ug5aioQ": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Jill K.", 
    "review_text": "A great spot off of the heavily-trodden part of Broadway. If you aren't looking for it, you might never notice it's even there due to the unassuming facade of the entrance.  Beautiful decor -- almost slightly retro with all the wood paneling, yet also hip and modern. I love how the DJ is positioned behind the bar, next to the bartenders. The tunes are always fun, often lots of hip hop.  The outdoor patio is a beautiful respite from a crazy evening -- HIGHLY recommended. It has a peaceful zen feel (tons of bamboo, gravel surrounding the cement path) with tons of candles, and plenty of nooks for stolen kisses... :-D  Major props to Greg L. for making Cassio and Julio's party such a success last week. He kept the tasty drinks flowing all night!", 
    "review_date": "2006-08-21"
  }, 
  "ujQai0f4PD10CwqNUG5DUQ": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jerry G.", 
    "review_text": "Definitely not thrilled with this place. Headed to Rosewood for my friend's going-away party and found that the place had been triple booked and was PACKED!  We had to wait in not one but TWO lines in order to get to the back room where our party was and it was so packed that we were near fire code capacity. Couldn't dance, couldn't hear the music, and wasn't allowed to use the restroom because I'd have to wait in line again in order to get back to the back room.  At the end of the night I found out that they had lost my best friend's debit card---really now, really?  Head out to this spot at your own risk!", 
    "review_date": "2008-06-29"
  }, 
  "jeokFgURb-_Yo_McZFBS0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex C.", 
    "review_text": "This place has a few options for you and your friends: the front area by the bar, some tables, a (very) modest dance floor, a small atrium, and a back room.  The music is varied, but there's always a strong, hype beat.  Bring a party with you if you like; it doesn't get obnoxiously crowded like some other places.  A fine choice for mingling and drunken revelry.  The decor is nice, the lighting is just right, and the drinks are reasonably priced.  It's also nice that it's somewhat removed from the commotion and crowd of Broadway and Kearny.", 
    "review_date": "2010-11-07"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Small bar, cheap drinks, not many people in this place expect for short asians trying to get laid in suits.  Sip is a better choice up the street.", 
    "review_date": "2012-04-22"
  }, 
  "G2FVUXuLEGc2fDTWFaQplw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charmian D.", 
    "review_text": "Now this was one of the bars that I'd want to parlay in order to get away from the die-hard party animals and packed places in and around North Beach.   Because I am a big fan of smooth R&amp;B, Soul...I loved the music when i stepped in here. The music complemented the ambiance of the bar. The color theme indicated deep reds, dark browns...very sexy and appealing...makes you want to let your hair down and sway to the beat of the music. Though the 2 bathrooms were an issue because none of them indicated if they were for men or women...which in my opinion, seemed kind of weird and towards the end of the night both bathrooms were too nasty to enter into.", 
    "review_date": "2008-04-13"
  }, 
  "Q6T_qAMidIemQlINLwDDeQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Antara B.", 
    "review_text": "I liked this random little place ... we went with a group of 10 people, so it was nice that we had enough space to sit and get a drink, or go to the dance floor and dance. They played good hip hop, some old school stuff ... I would go there again if I had a group of people.", 
    "review_date": "2007-09-21"
  }, 
  "6CTaoiEgAX2WRobPgKIx4g": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Alex Y.", 
    "review_text": "really nice place to hang out.. the crowd is pretty nice .. good DJ to pick some really good songs to play and not just your typical top 40s.. but they can do a lil bit better on decor.. definitely come back for more though.", 
    "review_date": "2009-07-18"
  }, 
  "j45PuQ1uZeljOh4vCmwi3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyler W.", 
    "review_text": "Went here with the new roomies and their friends. Almost missed it walking by but 3 lovely ladies were visible just inside and that usually gets my attention. So after suggesting we go check it out, I had to do a little explaining (a quick scan for ratio was all the convincing they needed).  Small place, wouldn't want to have to wait in the bathroom line, but drink selection and people looked good. Surprisingly quiet for a saturday. Enough people for fun but not so many you couldn't move.", 
    "review_date": "2008-03-11"
  }, 
  "LNz5NSoV8XVZhxIp5wYh3Q": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jason W.", 
    "review_text": "This is a pretty cool spot which is hidden in the mist of China Town. I liked how it reminded me of a pimped out 70's crib. I donno maybe it was the wood panel and neat speakers built into the beams. I loved the outside section too, that was was dapper biz right there! They also carry a nice selection of Beer. I will diff party here again.", 
    "review_date": "2007-10-31"
  }, 
  "Tb2PI_4eQw5cq5gpeSkqqA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "M C.", 
    "review_text": "Good ambience.  As for music, it was a good mix of old school and today's hip hop.  Bouncer was quiet friendly.  The crowd was cool.  The only somewhat negative thing that I can say about this place was that the bartender was not consistent in term of mixing the drinks.  But a great time overall.   I highly recommend this place.  Definitely a nice change of pace from your typical Hollywood bars or clubs.", 
    "review_date": "2006-09-13"
  }, 
  "FdQZxULvI4GT0-1meVap7w": {
    "user_rating": 3.0, 
    "user_location": "Placentia, CA", 
    "user_name": "Kenny L.", 
    "review_text": "Rosewood has lots of potential.   And by potential I mean that they need to decorate this place a bit more (less fake wood and more rose?) and make the place more visible. It's no wonder that by 10pm on a Friday, this place was barely packed.   The private room and outdoor patio was spacious especially for birthdays and other special events. I really like the bamboo and the lounge couches. There was even a separate bar area for the room.   There's really people living on the top?   I know this is the City, but the pour prices make Oakland a better bargain drinking spot.   Happy birthday Kristina A!", 
    "review_date": "2011-03-27"
  }, 
  "5bgsQymr8HDT3tyC1N3Uhg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sara C.", 
    "review_text": "this was our first bar of the night and it was still quite early so it was kinda empty. as an out of towner, i certainly wouldnt have found this cute little spot.   the bouncers and bartenders were very friendly here. drinks are pretty strong which is good, less cringe knowing how much we pay for it  =) the music was pretty good too, the DJ played dance hip hop songs. i'm sure this place gets pretty crowded becuz its not very big and there's only a small little dance floor area towards the back.  they have these really cute.....contemporary style tables and chairs in mahogany (i think).....i already had a few drinks by then and it was dark so i can't remember exactly. but ya, this place was very cute. i wish we could have stayed longer but it was too dead for us and we wanted to try other bars too.", 
    "review_date": "2008-05-02"
  }, 
  "D2setZ2_pKZ9CWEb0IgrOQ": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Rachel N.", 
    "review_text": "Not a totally fair 4 star review, given that I was here for a private party so I have zero idea what the regular crowd is -- but it's pretty lovely -- clean, sleek, modern -- ample dancy dance space, and an adorable outdoor back patio.   Only gripe is that one of the bartenders is drink sexist -- a friend of mine asked for whiskey on the rocks -- and assuming that b/c she was a girl, she didn't really mean just whiskey, so he made her a whiskey cocktail w/ abt 1/4 cup of agave syrup and a bit of orange juice....which is kind of different  -- and he continued to just say \"it'll be great\", even after she protested...by the time she got it, it was functionally just a glass of sugar on the rocks, so yes, it was tasty, but not a glass of whiskey.   Despite this slight snafu, if you have to go to North Beach, which I would always advise against, this isn't a bad place to get your drink on -- lots of seating, good music, though it can be hard to get the attn of the bartender when it gets hoppin.  Oh, and if you need to take a cig break outside, it's amazing people watching -- so many tiny girls in such tiny clothing!  It's kind of like watching a continual walk of shame...except for it's the beginning of the night?", 
    "review_date": "2011-10-23"
  }, 
  "Ct456aEICzDfn03MHZCzsw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miriam b.", 
    "review_text": "no longer enticing. just sad.", 
    "review_date": "2006-07-28"
  }, 
  "JxEgmwYM4qRB-Z7uKeVy6w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa G.", 
    "review_text": "Just rang in our 26th year of life at the best bar ever!  Toni was the perfect host from start to finish.  Made the planning process easier than ever and even asked about special requests we might have in regards to alcohol or anything we wanted to have available at the bar.  Music was easy to manage and the set up was effortless.  Love the lights and outdoor area - tables were perfect for cupcakes and purse/jacket storage for all of my girls!  Highly recommend this spot for birthdays or any party planning where you need a rad venue to bring all of your friends!  Thank you again for making Saturday night one for the books.  Looking forward to the next! :)", 
    "review_date": "2014-02-03"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "I want to come back again!!  I had just taken an 8 hour law school final, and was dying to get out of the house, even for an hour.  I decided not to drink because I had to get up early to study for my next final!  We got there around 12:30 on a Friday night and surprisingly, I found parking right across the street!  The bouncer was SO friendly and joked with me about how we tooottallllyyyyy need more lawyers... not!  I looked kind of out of place because I had borrowed my friend's maxi dress + sandals.  Everyone else was dressed much more nicely, some on the sluttier end, some not.  Overall the crowd was super classy and pretty young (23, 24, 25)... and attractive!  I want to come back :)", 
    "review_date": "2012-05-05"
  }, 
  "B-Dhfu42z8Ak4BYaS1xpsA": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jen T.", 
    "review_text": "Update 10/16/07 I'll have to increase the rating to 2 stars for now to give props to the owner of Rosewood for good customer service.   He read my yelp review and supposedly was going to fire the rude door man who DID work there.  I haven't been back since, but maybe on my next visit it'll earn an upgrade.  My first experience at Rosewood was a good one.  I walked in thinking, \"wood walls with built-in speakers and records? -- nice!\"  The music was okay if you like mainstream \"hip hop,\" but no one was dancing.  At such a small venue, everyone stood crowded around the bar area making it impossible to get a drink, not realizing there was so much space on the dance floor.   Well I guess it was okay enough to give it another shot.  BAD IDEA!!! My friends and I walk up to the door at around 11:30 p.m. and are asked to pay $5.00 cover charge.  There's practically no one inside on a Wednesday night and I had not paid cover before, but we shrug and comply.  Five minutes into the bar we get our beers and turn around to see people freely walking in and out of the bar.  The \"door man\" is now inside talking with the bar tender, and no one else is getting charged for cover.  Five dollars really isn't a lot of money, but it just seemed so strange to my friends and I that we had to pay cover and 5 minutes later there wasn't any.   My girl friend and I decided to ask the door man why there was no longer a cover, and he stated with a nasty tone, \"you assumed I worked here.\"  He went on to say, \"you girls must have been out of the game for too long.  See, I'm a hustler and that's what we do.  Maybe I work here and maybe I don't, but you gave me your money. \" Shocked, we just walked away before I punched him.   Back with my group of friends, I see the \"door man\" talking with the bar tender and giving him \"daps.\"  A few minutes later the \"door man\" walks towards us and I hear him point toward us and say \"bitches.\" WTF?!?!?! We just left because it wouldn't have been worth it.  Whether he worked there or not, he was friends with the people that worked there, and if they are okay with their friends or workers \"hustling\" the customers,  it's not a place for me.", 
    "review_date": "2007-09-15"
  }, 
  "2O-9NlmZr0cvGAKs30_CLQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Farid K.", 
    "review_text": "The venue itself is clean and gives off a good vibe. What lacks though is their ability to call you back. Even though they have contact information their not very good or pleasant at getting back to you.", 
    "review_date": "2012-05-07"
  }, 
  "3tJcTVPckkv7ZOrn1EcqPg": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Patrick P.", 
    "review_text": "A distinctive \"you wouldn't know it was there\" vibe on the outside keeps this place pretty under cover.  I had a good time here at a buddy's birthday party where he had rented the back room, but in general the main lounge (both in crowd and in decor) was a little too slick for me.  Think Marina via North Beach, and you kind of get the idea.", 
    "review_date": "2008-10-06"
  }, 
  "9KIPXfx757As4CFAh1EZVg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leanne V.", 
    "review_text": "not too shabby. some pals and i were looking to boogie down after grabbing drinks at 15 romolo, and rosewood was the closest bar with potential. (thank you, yelp app!)  housed in between pet stores and dim sum on broadway, the front end of rosewood was deader than dead on this particular saturday night. i mean, one or two other people at the bar. and for such a well-lit space, it seemed awkward. and, it didn't bode well for our impending dance party.  as we went in search of the bathroom, we found a secret passageway to the back of the bar that led us to a thriving soiree. clearly, a private party. folks were mingling out on the patio and roofdeck (nice touch!) and chatting it up inside a beautiful little mid-century space where the dj was spinning some great funky tunes. we took it upon ourselves to start a dance party going, which, given the stares from the guest of honor, was so not cool. i mean, loosen up, girl! we met a couple other party crashers who were also freeloading off the vibe. not gonna lie, we had a great time.  i suppose this review reflects more on the snotty party girl than the bar itself, but if a party is truly a \"private party,\" they should make sure there's fun available for the non-partygoing patrons as well.", 
    "review_date": "2009-11-10"
  }, 
  "hSD2Lu8Z_62klnMDND5sSg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "This place is really nice.  Not to big not to small.  It's dim and warm (I think sometimes they charge to get in although we've never paid), the drinks are good, there's a nice sized dance floor towards the back, and I think a private room as well.", 
    "review_date": "2007-06-27"
  }, 
  "AGjL2Ow20VNxqKHVfT1hdQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Benson C.", 
    "review_text": "The last time I was here (years ago), it was packed and hot and sweaty but fun!  Because Sip across the street was so dead, I headed over to Rosewood.  It was worse! Near empty!  What happened!?!  I must be out of the scene for too long.  Grabbed a few shots, chatted a bit and decided to go back to Sip thinking it would get better (it didnt, read my Sip review). Oh well.", 
    "review_date": "2007-06-26"
  }, 
  "TVJoa1isoHj02_iToGaXcA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shreya C.", 
    "review_text": "Alright, I will say this, it's a nice place. Does it live up to all the hype, no. But then most bars in the city never do. I know I've b*tched about this before and I'll do it again, most bars in SF suck. The city has no ingenuity or imagination when it comes to bars. And if you can name the 5 you know that are cool you're only proving that the number of good ones can be counted. Not a good sign.   Anyway, this place IN Comparison, is decent. I do like the outdoor patio though SF nights are hardly ever warm enough to accommodate an outdoor venture. Another plus - the music is phenomenal. Wish people were dancing.. though that didn't stop us. So, will you be impressed with the décor? No. Will you like the music and will it, overall, pass muster? Yes.   While you won't be disappointed by this venue, there's no rush to check it out.", 
    "review_date": "2009-03-11"
  }, 
  "uJhbNOl2HaZ9yH5MlHurhQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah L.", 
    "review_text": "I would give this place 0 stars if Yelp would allow. A friend of mine rented out a room for his birthday. At first all seemed great. Later on in the night when everyone was trying to close out their credit card on file the woman working the bar had NO idea how to do so or what to charge people. At one point she even handed the box full of cards to a group of people waiting to close out and said \"grab your card\".   That is so incredibly stupid and inappropriate for a bartender to do I couldn't believe it. People were literally passing around a box of cards and taking cards. When I complained to management after they lost my friends card they reacted horribly and proceeded to threaten to kick us out. In fact, a woman (presumably management) with short blonde hair referred to my boyfriend as a \"faggot\" and told us to leave.  I am not exaggerating when I say we were only trying to get our cards back amid the disorganization of the bar. I will NEVER go back to this bar. I cannot believe how we were treated and how they passed around all the credit cards for anyones taking to a bar full of people.   I would not recommend this bar to anyone and I will never return. This bar is HORRIBLE.", 
    "review_date": "2014-01-05"
  }, 
  "DgjHA9zexvzZgyHO_GZjLw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne A.", 
    "review_text": "The thing this bar really has going for it is the layout. I came here for a trunk show, which had some spectacular vendors. The bar itself extends completely into a back area, complete with a decent-sized room and two really neat patios with picnic tables and flowers everywhere. However, the drinks weren't that great (neither super tasty or strong) and they were expensive. The bartenders weren't the friendly or eager to help anyone, despite the large-ish crowd there for the trunk show. One bartender made a mistake to my friends credit-card tab, charging her $18 for one drink. None of the bartenders apparently knew how to do a refund on the register, which was odd, but they did give us two shots for free to compensate so it was cool they amended their error.", 
    "review_date": "2009-10-19"
  }, 
  "QJ3t1d_-9wIjMi1S58_ivw": {
    "user_rating": 4.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Caroline F.", 
    "review_text": "Although we were there early in the night and it didn't yet have many people, it gave me a chance to just pull up to the bar and chat with the staff.  They were very cool and friendly (even though my friends tried their patience).  The music was good and they took some requests which is always great.  Chris was really nice and even made me a nice drink concoction.", 
    "review_date": "2008-11-10"
  }, 
  "mj2wCBzx7RtoL4J2m0xu4Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "shadi m.", 
    "review_text": "I've only been here for private parties and I think its a great space to have a smaller group of people. One where I can actually hear myself and meet others. I don't go out in North Beach that often and this place is kinda randomly located by itself but its close enough to Russian Hill where you can just swing somewhere else before or after. My favorite part of the bar though is def. the back patio area. It's super cute and nicely decorated. Just be careful walking around back there. It's uneven and after a couple of drinks, you see a lot of people stumbling into walls after missing steps :)", 
    "review_date": "2008-10-17"
  }, 
  "IHMo9oNV6Z2G9Jny0vblGg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan M.", 
    "review_text": "If you're sick of the typical North Beach Broadway scene, venture into the over-closing in China Town area for Rosewood. I don't think I'd be able to find this place again without friends, but it's truly worth a visit if you're in North Beach area. The bar itself is minimalistic - kinda Scandinavian in design. The drinks are good, but the scene can be fairly Marina-ish, so be prepared.", 
    "review_date": "2006-09-02"
  }, 
  "XcXLEu9DSCOmieLSyyRN8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "david f.", 
    "review_text": "I'm reviewing this place so I can remember what it's called and where it is since I always forget...been there once or twice...think they had a film night ...anywayze it's not bad...but of course too much bouncer visibility...is all this bouncer action really necessary?", 
    "review_date": "2008-09-16"
  }, 
  "57OpG6QjpQjVXjjQQxA_Og": {
    "user_rating": 3.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "James Y.", 
    "review_text": "Went here for a dual-birthday party on a Friday night. Nice lookin' place, chill crowd, no cover, relaxed dress code, nice outdoor patio area., DJ was pumpin't out some top 40's and some 90's rap.  Unfortunately, some group had paid to reserve the patio and the front got way too crowded.  Definitely willing to come back and give this place another chance.", 
    "review_date": "2009-07-22"
  }, 
  "oA4ompknoW6XrONKYXQ_jQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel G.", 
    "review_text": "Maniac, maniac on the floor... and she's dancing like she's never danced before...  For serious,  when I get into the groove, you best get out of my way, because I might hurt somebody (SORRY if it was you!!!) or myself -- goddamn shoes of sexy destruction.  I was the hottest of sweaty messes after a night at Rosewood.  But so were all of you, so I was in the best of company.  5 stars for excellence in bartending (Hi Remy!!).  5 stars for excellence in decor (Candlelight is most flattering).  5 stars for excellence in music (Hi Yelper who spun Dancehall.  I heart you).  5 stars for excellence in  sarcastic quips (Hi Bucky!  I do admit I dance like a stripper.  You owe me $60 bucks.).  5 stars for excellence in organizational skills (Hi Jing Tao.  You're a D-Bag.  And I mean that in the nicest way possible!).   And of course 5 stars for excellence in hangover remedies (Hi Sammy.  Pickles and Grapefruit Airborne!!!).  Good shit, y'all.  Good shit.", 
    "review_date": "2007-07-15"
  }, 
  "0Tv2dl2O0TEQD-VGbPqwug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty J.", 
    "review_text": "This place is great. I was here at one stop on a friend's party bus. I vaguely remember dancing quite a bit on the dance floor. I was told we ended up at McTeague's after. Anyhow, after a crazy night I woke up and noticed my credit card missing. Anyhow, I checked my credit card and the last charge was here at Rosewood. I called the place and a lady there texted me there was a fashion show tonight and I could pick it up then.  I needed my card before a weekend at Tahoe so I swung by after dinner to pick it up. It's hard to find when it's dark but a woman outside asked me if I was looking for the fashion show. So, I went in and asked the bartender if my card was there. While he was looking the women who texted me overhead and introduced herself. She offered me a shot and I accepted. I gave her 5 bucks for being so nice, took a shot, and bounced. I'd love to come back with customer service like this!", 
    "review_date": "2012-09-19"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "I didn't know a bar this secluded, but was very happening, existed in Chinatown!  This spot is great for a private event, that is held in the back! It's like a mini version of high rise residential buildings surrounding a glowing nightlife, outdoor patio bar!    Bring an entertaining crowd and you'll have a fun night!", 
    "review_date": "2014-01-16"
  }, 
  "AAI8mmWem4zQU7qanPrOmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nance W.", 
    "review_text": "HAPPY BIRTHDAY JILL K.!!  1.) I realized I've been here before.  2.) Me A. tried to strip me.  3.) Anne Marie touched my boobs and bought me a drink.  4.) Cassio P. and his Brazillian wax stories.  5.) Stepping all over urine in the restroom.  6.) Connie C... Total sweetheart.  7.) Tripping and falling TWO TIMES in front of the Fongz L. and A.J.  Wearing my four-inch heels was worth it.  HAYYYY BABYYYYY!! HOW MUCH?!!!", 
    "review_date": "2007-06-09"
  }, 
  "zQvBRYbPrRA4WWcIDMocUg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany N.", 
    "review_text": "EASILY became one of my favorite bars.  Toni is AMAZING!! I contacted the Rosewood to inquire about celebrating my birthday there and it was such a great decision! Toni responded back almost immediately and addressed any questions I had. She was extremely accommodating and seriously, the sweetest thing! She went beyond my expectations to make my celebration at Rosewood so much more memorable (or as much as I could remember ;) haha).  Rosewood is on Broadway, but basically in the heart of Chinatown - walking distance to the Broadway strip - so it's not far off at all. When you walk in, there's the full bar and the main room is narrow and long, set plenty plush black, leather seating. This main area can be reserve for your private party as I did. In the back, there are private rooms, the outdoor patio and also the dance area. I loved the music selection here. Unfortunately, at the time of my event there could not be a DJ physically spinning but Toni was sweet enough to have the DJ create a pre-set playlist for the night! Normally, they'll be a live DJ spinning old school hip hop, r&amp;b, top 40s.. all the good, funky stuff!  The drinks were good and the bartenders were all super friendly! All in all, if you're here.. you'll have a great time!  DEFINITELY COMING BACK!", 
    "review_date": "2012-12-29"
  }, 
  "DB717wes6bHyiPq0oDl_3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Akshay S.", 
    "review_text": "This is a great little lounge near North Beach/Edge of China Town.  Around 12:30am on Saturday there was actually a line of about 15 people, but it moved quickly and I was in before I knew it.  I felt like they were understaffed on bartenders, but the crowd was easygoing and nothing seemed like a chore.  I'll definitely go back.  Especially since I waited until 1:30 to check out the back patio and they closed it as soon as I got there.  Bummer.", 
    "review_date": "2008-06-30"
  }, 
  "y2XPvYkAIZWxyknRQYM_EA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "NaNa M.", 
    "review_text": "Ok yelpers, I feel a bit let down here. Don't get me wrong, this is a chill, cozy and stylish little lounge, but for a Friday night, this place was sparsely populated with mostly couples. So if you're on the prowl and lookin' for some dance-your-ass off fun on the dance floor and a happenin' joint, this is not the place for the weekends. The music was your pretty standard fare-- the cosmos were a bit diluted, and the bartender wasn't all that friendly, he was more, well accommodating. My friends and I wanted a fun, yet not flash the crowd scene--however, I think we may have scared this timid little \"lovers only crowd\" Verdict-- come here for a couples or quaint mellow weekend evening out, or for weekly happy hour...other than that, I wasn't terribly impressed.", 
    "review_date": "2006-08-26"
  }, 
  "iKuGWNG9rPtiDhDd7UPRJw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica L.", 
    "review_text": "Came here for a private party, and while the back patio is rly nice, the bartender (there were only two), Joe was insanely rude. I went to the back to ask if they had seen my friend's phone and he screamed at me to get out from the back, and then proceeded to say, \"FUCK YOU!\" ... To a customer. Are you kidding? I was appalled.", 
    "review_date": "2013-09-21"
  }, 
  "qUg4PXAT42bxV48CqPaUwQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnny C.", 
    "review_text": "Nevermind the crap-ass parking. Fagettabout the weekend freaks that all come out to pah-tay. Never mind that you'll get drinks spilled all over you just like every other place (more actually!). Nevermind that my friend had her leather jacket and cell phone stolen there. Nevermind that the dj thinks he's Grandmaster Flash (Not! or at least NOT YET!) Nevermind the crowd, the sweat and heat! Nevermind all that y'all! What's left you ask? Well, bartenders are nice. Interesting interior!...at least for the first 5 minutes. But that's like saying, \"Apart from that Mrs. Lincoln, how did you enjoy the play?\"\n  Giving it 3 duckets because they try hard. It's one of the better lounges in NB. Mix a strong drinky.", 
    "review_date": "2006-03-22"
  }, 
  "kDfU-S_-MXk8yaUfM6xUyA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny H.", 
    "review_text": "Ambiance: This is one of the nicest bar/lounges I've been to. Dark, dim, classy, romantic. I had an attentive and nice bartender. Very modern. It's also a very clean place. Few seating chairs inside, small dancing area with a DJ. Another section of the place is in the back. It has 2 rooms, 1 standing room with a bar and another small separate seating area. Can definitely hold a private party back there. Outside of that has a lot of bamboos surrounding the seating area with dim lights and 2 picnic table style seating area. Felt like a tropical little corner. Wasn't too crowded which I liked. Mixed crowd in late 20's. I bought some shots for a friend's birthday and it costed me $9 a shot.   Parking: Street parking is sometimes hard to find around that Chinatown area but if you're patient, you'll be lucky. I drove around the block just once and got lucky finding parking just half a block up. But there is a parking garage behind that block, so it's very convenient too if you don't want to look for street parking.  Set back: Only thing I noticed was the flooring separating from the inside to the outside. Wearing heels, it can be a bit dangerous since there's an unpaved step. Someone can easily trip if they were drunk and all over the place.  Definitely going back there again!", 
    "review_date": "2009-11-15"
  }, 
  "IoCecWMuJWVLfJAyggwY1A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A C.", 
    "review_text": "Good place to hang out with friends, but found other places much better. The dance floor was mucho weak. The drinks were ok. It was pretty empty but sometimes that does suit my fancy.  It's actually probably a good spot for a first or second date if you want to get drinks after dinner. Except it's in the Broadway strip of you know what.  I'd probably come back if someone else suggested it but not sure if I'd go there on my own instinct.", 
    "review_date": "2009-02-01"
  }, 
  "qzu4UQbwcqdTQte0PccVvA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yup S.", 
    "review_text": "I feel like this place can be a hit or miss.  Sometimes it can be very quiet on certain nights..and other times you'll try to roll in and it's poppin' like it's everyone's bday in there!  I like the decor a lot.  It gives you this dark, intimate, musky feeling..but yet casual feeling at all?  I'm not sure if that makes any sense whatsoever.  A lot of woody, brown / candles-like environment with a slight twist of modern.  I feel like on slow nights couples can be there after a nice dinner and enjoy themselves.  On the other hand, I've been to bdays in there where everyone is bunched up like sardine cans!  I do wish they had more seats in there, but I suppose when they fill to capacity who needs seats when you can sit on someone's lap.  Ya heard!", 
    "review_date": "2009-10-20"
  }, 
  "27En0DDgdf0_0qK_hjXcLQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Yasya G.", 
    "review_text": "I've been here for two private events and loved it!   PROs:  -never got too crowded, even with another event going on in the adjacent room -great DJ that took all my annoying requests -plenty of seating  CONs: -not enough bathrooms -expensive drinks -awkward layout (very narrow walkway near the bar, have to push through to get to the restrooms) -location  All in all, the pros outweigh the cons. Not sure how this bar is on regular nights, but it's a great place to hold a private event with all your friends!", 
    "review_date": "2011-08-31"
  }, 
  "ZnBTVsQMCuHdp4qmwrZNeQ": {
    "user_rating": 5.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "J A.", 
    "review_text": "Happy Happy Joy Joy. I love the outdoor seating. But more so,  I love the wall that you can wall dance like you are in a music video. I especially like it when Graceypoo is doing the dancing.  If that wall were a man, it would be very happy. Oh, and the DJs? All yelpers! Sooooo good. You wanna see Joy dance?? Throw on some old school hip hop or some gritty dance hall  and you gotta nice girl twisting and turning hips.  Yes..... I love to dance.", 
    "review_date": "2007-07-13"
  }, 
  "BMI8iYCk3DxSsbxFTVoq4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer S.", 
    "review_text": "I came here Friday night for Jennifer M's and Sonja's birthday.  We had our own space in the back reserved for our group.   They had a bouncer posted at the entrance to the back so we felt pretty V.I.P.  There were couches and little tables, and there was plenty of room for all of us to hang out.  The bar area was a bit more narrow, so it felt like we were packed in tight and you feel like you are in every body's way. The bar in the back wasn't a full bar, but they all the stuff for our staple drinks so it didn't really matter.  The bartender was pretty cool.  There was a continuous line at the bar so he was pretty busy and he handled it well.  There was also a side patio with tables where all of the smokers gathered, and the bathrooms were big but they only had two of them!  Overall it was a nice bar, and you can be really dressed up or dressed casual and still feel comfortable.  I usually try to stay away from the north beach/chinatown area at night because it's usually a lot of out of towners and assholes, but Friday was definitely an exception!  I would come back here again, but probably only for a big event.", 
    "review_date": "2008-09-22"
  }, 
  "B33KEetBrqpnJbQZetY3sQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beau G.", 
    "review_text": "You don't happen on Rosewood randomly.   It's on a block in Chinatown, not North Beach, that is almost completely shuttered up at night.  The block is exceptionally dark in comparison to the bright lights of the strip clubs across Columbus.    There is no big bright sign announcing the presence of a bar, nor are there many lights inside that shine out to the street.   I had to wander around for a bit to find it on a Wednesday night.  That said, this may be the best functionally designed bar I've ever seen.  There's a great semi-hidden patio area with lots of little nooks to hang in when commotion inside requires a respite.   The interior is filled with tasteful wood panelling and couches.   My only complaint is the high price of beer (count on over $5 before tip), but I should not have been drinking beer here anyway.", 
    "review_date": "2007-10-27"
  }, 
  "S5WQcThM04eH7Eu0YJ1a1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicole G.", 
    "review_text": "This review is for the back room of Rosewood only. And no, this review is not about a make-out session, it's about their private party room. Get your mind out of the gutter, will ya?  I've come to the conclusion that Rosewood is really the best deal in town for a birthday party. For only $200, you can rent the whole back space, which includes a full bar, dance floor, lounge, a bamboo garden and outdoor patio to accommodate up to 100 of your peeps.  I love that this space is swanky, yet spare enough to turn it into whatever you want with the right party props. Richard T had a fabulous OMGYG party with flashing lights, paparazzi and cupcakes. Ligaya T did it up for her man Russ S with an ice luge and tequila shots. Mmmmm.  Ain't no party like a Yelp par-tay. Woot!", 
    "review_date": "2008-09-06"
  }, 
  "uVYUAiqgCqs2xAGpYb0LgQ": {
    "user_rating": 4.0, 
    "user_location": "Twin Peaks, San Francisco, CA", 
    "user_name": "Cindy T.", 
    "review_text": "Great service for private party. Had a nice outdoor space in the back and we're very accommodating", 
    "review_date": "2014-03-23"
  }, 
  "JSeew6ZpwPpz5QjvnHNcIw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Cin H.", 
    "review_text": "I like it here.  Its SOOOOOOOO nice to go to a place where the DJ actually has some taste in music. And who would've of thought? Located in North Beach.   I like that its not crazy crowded. Some reviews below mentioned there were hardly anyone there and its funny, some nights,even friday nights,  thats exactly what I look for.", 
    "review_date": "2008-10-18"
  }, 
  "a9gIpre7NPS_CMqNxHU6lQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew D.", 
    "review_text": "well i guess im going to have to start off by stating that i myself have rarely been known as a sharp dresser when in the bay area... wait scratch that, i've NEVER been known as a sharp dresser anywhere. now i could bring out the whole excuse of how i always end up going out after i get off of work and that it would take me an hour to go home and shower and make myself look spiffy, but i dont really feel like saying any of that. but whats ironic about all of this is that i HATE feeling underdressed. im sure some of us can recall those times when you walk up in to a spot and absolutely everybody is wearing their $80 button down shirts with the smooth slacks and the gelled hair giving me dirty looks (LA flashbacks! LA flashbacks!) but how this all comes together is that when at the rosewood anything goes!  You can take a quick look around the place an notice that everyone is doing their own thing and that somehow it all comes together perfectly. The jean and t-shirt crowd mixes well with people decked out to the fullest.   The place itself is very well put together with a bit of an upscale touch. the bar puts out some great drinks and i've never not seen a plethora of good looking women (on weekends at least). which in SF can be hard to find sometimes. i've always gotten the impression that you can go to this place at times and quickly realize that some 22 year old girl from san jose is having her \"big birthday night in the city\". so if you happen to be a person who finds those crowds to be annoying maybe this isnt the spot for you. but all in all ive never had a bad time here...", 
    "review_date": "2009-10-13"
  }, 
  "A1fZP8vgbXjNcCJ2pAzQDg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candace F.", 
    "review_text": "Came here for a friend's birthday. My friends didn't end up getting drinks from the bar. It was a busy Saturday night and there was only one bartender who knew how to mix drinks. The other guy was just pouring from the tap or wine bottle. The wait for cocktails was long. I ended up trying 2 drinks: Midori sour and vodka tonic. The Midori sour was average and it was mostly watered down. The vodka tonic was really gross - the lime didn't help.   The atmosphere was chill. It was crowded but there was plenty of places to sit - tables are chairs in towards the back. My group decided to sit by window in the front. As the night progressed, it got really hot and stuffy inside. So it was a relief to be sitting by the door where we had some fresh air. There was a small group of people dancing in the back.   The place is small and I would never know that it was there unless I was actually looking for it. A place to chill if there's nowhere else to go.", 
    "review_date": "2008-11-28"
  }, 
  "07Dq64NelrtSGRnhnou6Ig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Javier O.", 
    "review_text": "I came here with no expectations and left with a big smile on my face.  My friend Darien celebrated his b-day here last saturday night.  As usual I drove to avoid having to fight for cabs after hours.  I am glad I did because there was a parking garage about a block away.  The lounge was pretty accommodating.  two separate rooms with a bar in each and a cozy little out door where people were not afraid to light up,  Not loud like a club but the bar was stacked like one.  Normally I take pictures of the the food or the decorations or the building, this time I decide to post photos of some of the birthday party attendees and other folks who happened to be there that night. Enjoy!", 
    "review_date": "2008-04-14"
  }, 
  "pJHjKQSRu4ziGIEk9mx5WA": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Patricia G.", 
    "review_text": "Rosewood was referred to me by a great friend as I researched for affordable, private, classy and overall comfortable location for a birthday party.   My contact Toni was hard to reach at times but we managed after some email phone tag and such. Overall, Toni is extremely accommodating to your needs as a host. It was a pleasure to work with her.   Venue is located in the least expecting area. \"Don't judge a book by its cover\" clearly qualifies here. The interior is updated and classy. We reserved the two private rooms and the patio which was a bit large for our group but who doesn't appreciate room to breathe? Private bar to avoid wait lines was definitely a plus. We had a bar tab to meet ($1000) but that's cake when there's 40 people drinking in celebration. Outdoor patio sold me. It was lit up with lights on the bamboo and made it very classy and welcoming. Awesome set up!   Eric, our personal bar tender was outstanding. Lawrence our \"security\" is the friendliest security guy I've ever met; he tells you to get out of the private area with a charming smile. lol  Overall, I would definitely recommend Rosewood for a weekend bar stop and a great private party location.   Thank you for such a pleasant experience, Rosewood!", 
    "review_date": "2012-09-24"
  }, 
  "aREzu8wiB_1NYMzi_TgN0A": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "Came here for a private party. Nice, dark, and warm atmosphere at the same time. Music was great. There were couple rooms that one can maneuver around with an outdoor patio. The bar had the standard drinks. We didn't have trouble with getting drinks or getting weak drinks. So, either way, we had a great time.", 
    "review_date": "2011-12-04"
  }, 
  "qWOqPXPcaz_vz_ki2n1I8A": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kat H.", 
    "review_text": "Okay, I'm a bit faded right now but didn't want to forget the good stuff so gotta Yelp! now!  Our bomb ass company had our annual prom here this year and we had a great time. Good dj and excellent drinks! We also had tacos catered by Tacolicious and that's in another review--delicious.  Anyway, drinks were flowing and strong. My favorite bartender, Venise? (V with Denise?) made up a beautiful concoction when I asked for Blood Orange. It is now called the \"Elixir\" -- you HAVE to try it if you go. Very tasty alcohol of blood orange, pomegranate, ginger and vodka. Yum!  The space is pretty great with a patio and also a small dance floor. Lots of places to lounge as well.  Thanks for having us, it was EPIC!", 
    "review_date": "2009-09-03"
  }, 
  "aqWXHhcR_CdmKmxggFOlEA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy L.", 
    "review_text": "Until Saturday night, I hadn't been to this bar in...almost four years.  Wow.  I remember the layout being much better then than it is now.  It's about the same size as my thumb - this bar/lounge/club (whatever you want to call it) is the size of my thumb, and they seem to let in way too many people for the size of the space.  Even early in the night, it was packed but it's primarily because the layout of the bar is just tough - there are barstools and just opposite those are low tables and loveseats; so the area where people wait to try to get drinks is the same area that is the main thoroughfare between the front of the club and the back with the dance floor and bathrooms.  It is way too crowded making it nearly impossible to move throughout the bar or to get a drink.    The music is pretty good and lots of fun - mostly old school hip hop and pop.  The dance floor area seems to just become an extension of the bar since there isn't much room to stand; so while there are people dancing, there are also a number of people milling around the dance floor with drinks.  There are only two (unisex) bathrooms, and I was surprised to consistently see more men in line than women.  Ladies, don't break the seal early in the night - the bathroom line is long...    They charge $5 cover.  I know it's only $5, but I just don't think it's worth it because you won't be able to get a drink and will barely be able to move.    Rye is soooo much better.", 
    "review_date": "2007-08-09"
  }, 
  "SQIl43bNVRme0dvCFL7T4A": {
    "user_rating": 5.0, 
    "user_location": "Bay Area", 
    "user_name": "Robert A.", 
    "review_text": "We held our 10 year high school reunion at rosewood in last November, and Toni and her gang were amazingly hospitably awesome!!! She took care of us every step of the way, as we booked our private event at Rosewood. She constantly updated us on details and options on how to book the bar, and it turned out to be a huge success!   We would like to say a big thank you to Rosewood, from Pinole Valley High school c/o 2000 10 year reunion organizers. THANKS A BUNCH!", 
    "review_date": "2011-05-03"
  }, 
  "7n1Q3Z_Yp_7xNaky6CUS6w": {
    "user_rating": 5.0, 
    "user_location": "Newark, CA", 
    "user_name": "Eakta M.", 
    "review_text": "I had a great time celebrating my 25th birthday here. Toni was an absolute wonderful person to work with. She always responded to my emails in a timely manner. Everyone loved the code word to enter the party and the specialized drinks for my party. I had a \"Mean Girls\" themed party and it was so fetch!", 
    "review_date": "2014-03-10"
  }, 
  "tpjZkjtPVjowW_EGlOO1lQ": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Adrianna G.", 
    "review_text": "After going out to Rosewood on a Saturday night, I'd definitely recommend if you are in North Beach.  No cost to hang coat, nice coat rack provided for self-service Drinks are reasonable - $7 for a Kamikaze Drinks are excellent - they actually use fresh lime and lemons, which goes a long way Swanky lounge feeling, a nice place to bring upscale friends. Dress to impress. Dance floor - pretty fun, nice soundsystem, pretty good dj playing all the top 40 overplayed songs.", 
    "review_date": "2011-04-03"
  }, 
  "aea3PTk1cMMV7UTh9HXINA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sammy S.", 
    "review_text": "Unfortunately I'm not a big fan of shelling out $6 for one beer. But on the plus side I have big teeth, semi-long eyelashes, and a pretty healthy chestal region, which when I sadly ask the bartender at Rosewood if there are any cheaper beers gets me a sympathy drink, for free.   Although I really appreciate the sympathy drink, I don't appreciate spending $4 on a PBR. Sorry about all the \"poor me\" talk, but I'm unemployed ya'll. I can barely afford to buy Ramen  noodles, so cheap beer has become seriously important to me. Because unemployed people have nothing better to do then drink...a lot...alone...while watching hours of America's Next Top Model reruns.  Yelp DJ Battleship 2.0 got my slowly plumping ass out of my apartment for a night to bump a little, grind a little, sweat a little, and have JT's bacon dog pressed against my back a little. It was all in good fun though. The staff are friendly...get it? staff? I mean, what?  The dance floor is slamming, and by slamming I mean drunk bitches body slam you into the walls, which I guess I don't really mind, because the wall just happens to be the most cooperative and unskevy dance partner there is.  And the candle light and woody surroundings=a butt-load of sexy...except when it includes candid photographs of yours truly.", 
    "review_date": "2007-10-28"
  }, 
  "PyItxzr83FRB3h5Plws3EQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Mitty C.", 
    "review_text": "Had a wonderful night at Rosewood bar for a friend's private birthday party in the back private room. I was surprised to hear that there was no cover charge or rental fee associated with reserving the private room in the back. Sure, their drinks weren't exactly cheap (average of about $8 to $12 per drink), but they were tasty and the ambience was wonderful.   I will admit though, I thought that the location of this bar was a little bit weird. I mean, it's on the edge of Chinatown. At night, nothing next to it is open at all. In fact, it's not exactly the best neighborhood to be walking around at night. That being said, also be very cautious of the main intersection there, as I encountered a major police trap there for no left turns, among other things.  Overall though, this is a great location to have a private party. I'm not sure if I would necessarily come all the way out here just for a drink since it's out of the way for me, and there are plenty of other choices. But definitely a good location for a private party. Would recommend if you're looking to entertain.", 
    "review_date": "2013-12-31"
  }, 
  "KHJMzJTXayOwyBxSWLWCQg": {
    "user_rating": 1.0, 
    "user_location": "Statesville, NC", 
    "user_name": "Ros S.", 
    "review_text": "Terrible!!! Avoid at all costs!!  My Friends surprised me by hosting my bday party at this place. Located at a terrible neighborhood it looked good at the beginning. I went to the back (patio) at some point with my friends and suddenly  some guy appeared and asked me : \"what the f*** are you doing here\"?\" I replied this is my bday party. Soon enough I was being escorted to the exit of the bar with 20 of my friends. When I complained to the \"manager\" (a blonde waitress) I was treated extremely rude. She  said, I still find this hard to believe, if you don't like it just bail. On my birthday !! Incredible !!  Lessons learned: STAY AWAY!!!!  If you have to go: do not make the mistake of planning your bday party there!  Terrible!", 
    "review_date": "2013-01-26"
  }, 
  "MnCteyXrn2d1qFygzgh4mA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karl L.", 
    "review_text": "Wow, nice bar, hardly notice it from the street, but nice design and layout, although strange seats at the bar, a dance floor, and even a nice little garden for all you folks still addicted to your smoky treats. The night I went there they had a few DJ's and a grand time was had by all. It seemed to close a little early, but that was probably for the best.   Drinks, they have a good selection of beers on tap, and a full bar, but they don't make Mojitos (which if I was a bar tender I would probably refuse to make as well as their a pain in the  ass)", 
    "review_date": "2008-02-29"
  }, 
  "whfjd0gIdtPXLTZKmNYqZQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Stellah D.", 
    "review_text": "Reminiscent of a Scandinavian designed ski chalet, Rosewood (named for the rosewood paneling that adorns it)  is one of my favorite bars in North beach. The boys behind the bar know how to mix a drink, and the lighting is very flattering. It can get a bit hectic with Marina types at times, but you can always escape to the patio :).", 
    "review_date": "2005-03-11"
  }, 
  "S3gNrUh7N9oWoackKlHGMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marcus C.", 
    "review_text": "It should come as no surprise that this place was completely empty when my cousins and I waltzed in at 8pm on a Saturday, after a very filling dinner with extended family members.  That said, the bartender was very kind and helped us explore the different vodka options behind the bar.  I tried a cinnamon vodka, which was nice and SPICY and we enjoyed running our hands along the smooth wall.", 
    "review_date": "2009-01-09"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "You know what....this place is random.    No sign, no indication of it's existence beside smokers on the outside.   Still...it was a blast to be there with Yelp folks.  A random night with random folks resulted in a random night of dancing.  It's pretty cool...or maybe it isn't....it is in North Beach.  EVERY bar in North Beach is known somehow and crowded like mad on Fri&amp;Sat.  I can't imagine this place being comfortable with a crowd. Regardless.... I had fun here.", 
    "review_date": "2007-10-26"
  }, 
  "lXKjU1d7uy4aG0c5dNTATw": {
    "user_rating": 4.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Mika D.", 
    "review_text": "definitely one of the best places to hit up in north beach so you get the jump-off for the night. i feel sexy when i kick it here for a round or two. eargasms while listening to mash-ups and soulful house. you know i could work it.   i love how this place is dimlit, dark and lovely. guys know how to dress here. ahh the days when i was single, blood. ahaha", 
    "review_date": "2008-06-06"
  }, 
  "4XpBOUei-QLDrMfvf03wkg": {
    "user_rating": 3.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Susan L.", 
    "review_text": "The place is nice, good place to hang out with friends, meet a few people, hang out. The music was half good half not, the dj would play a good song for every few bad songs. The night I went there weren't enough bartenders. The lighting is decent but I think they could do a lot better. Overall this place is ok for a chill low-key night.", 
    "review_date": "2007-10-10"
  }, 
  "bWvELivVIa81tFEqiLxS4A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel L.", 
    "review_text": "I came here for a friend's birthday party on a Friday night.  Somewhat of a very random lounge in the middle of a street that seems to have nothing else.  The backroom that many reviewers seem to rave about was blocked off for a private party, so I was disappointed I never got to check it out.  The front area got crowded later at night, and it was annoying that my bartender kept on disappearing for extended times of the night (I realize there are other bartenders, but I usually pick one in the beginning and tip initially to get better service).  The lounge minus the backrooms is pretty small, so I don't suggest having a huge birthday party here.  But for a small gathering, it seems to be a very chill place to hang out.", 
    "review_date": "2008-10-28"
  }, 
  "dlAxvWcrqZJPkhFTWru6Ew": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Liz W.", 
    "review_text": "Great place for private parties! I had my \"goodbye SF because I'm moving to Portland\" party here and they made a special drink menu for me (with Oregon-themed drinks) and decorated the bar with Oregon maps. And we had our own dedicated bartender! Seriously, call Toni and book it for all your private parties.", 
    "review_date": "2011-12-04"
  }, 
  "KURUGmYN2kwDpr6BcEcrRA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carol L.", 
    "review_text": "I came here last night with a whole bunch of friends for a 3 person bday celebration. My first impression was that they didn't have enough lounge chairs, but by the end of the night...I didn't want to sit down anyway, so I guess it didn't really matter. We had called in a few weeks ago to \"reserve\" an area, and sure enough, the entire place was pretty much ours. I'm not sure of what exactly happened, but by the end of the night, only our friends were inside. I wonder if they kicked non-party ppl out?  Anyways, drinks are strong. Bartender lady was really nice. She made the bday girls a shot of \"strawberry shortcake\". SO GOOD. The bathroom is actually decent and not gross. Music was good. Not too hot, but yes, quite small. Great for a gathering like the one we had last night. The dancing area is in the back, and quite small. But it was a great set-up - you can talk/drink, or walk a few feet and dance. I would highly recommend this place for a bday gathering.", 
    "review_date": "2009-12-12"
  }, 
  "mr2Xey5LnT6xJJeNuh0oKg": {
    "user_rating": 5.0, 
    "user_location": "Encinitas, CA", 
    "user_name": "Joe K.", 
    "review_text": "One of my all time hidden gems in the city. I know, I know--not so hidden but seriously this place is great. 90's hip hop--check. Endless Summer playing on the back wall--check. Good drinks--check. Cool people--yep. Place is always poppin. Has a good crowd and a great place to chill before a big night or just hang for the night. Highly recommended.", 
    "review_date": "2012-08-30"
  }, 
  "p7yKeDEv6EXT_OEZBgIJjQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dro r.", 
    "review_text": "This place could be a hit. The bartender was nice and speedy. The drinks were neat and tasty. The door guy was a foul mouth jerk. The African American guy within the door was nasty and disrespectful. He made some pretty tacky and racy comment at one of the ladies in out group. We were there celebrating a friends birthday and he single handedly ruined our night. So, if you like to be disrespected by the help, this is your bar!", 
    "review_date": "2011-03-26"
  }, 
  "wT78sHs-9lhLretYlpx7UA": {
    "user_rating": 1.0, 
    "user_location": "Truckee, CA", 
    "user_name": "Patti C.", 
    "review_text": "I attended a private party here.  Here are my observations: RATING SHOULD BE ZERO!!!!!' 1. Setting wasn't set up for the party as requested by people renting venue. 2. Main bar was not able to serve any drinks other than beer, wine &amp; was not set up yet for hard liquor drinks 3. Party was set up in back where there was an outside courtyard adjacent to a room with open sliding glass doors which had a track that people could trip over.  There were no propane heaters in the outside courtyard in San Francisco in February!! Unbelievable!   4. Room where we were setting up food was sooooo dark you could barely see what you were doing. 5. Only two unisex bathrooms.  One backed up around 10 pm into the evening, with 100+ people in the private party &amp; then the bar was opened to the public so there was an additional 100+ people with one unisex bathroom!!  Long lines &amp; long wait to use the bathroom!!  None of the management tried to call a plumber or fix the situation.  When asked about the bathroom predicament, they said it happens all the time!!!! 6.  Finally got in the only bathroom &amp; then realized there was NO toilet paper or paper towels.  Ugh :(. When I left the bathroom, I went to the bar, as a courtesy to the bar, to let them know they were out of toilet paper &amp; paper towels to dry my hands.  Joe, the bartender, who was also very impersonable &amp; smug said to me \"at this point, I really don't care!\" 7.  I then found Toni, the manager and told her about the lack of toilet paper &amp; paper towels.  I told her what Joe said that he really didn't care &amp; she said \"you must be confused\"!!  Confused about what - that I couldn't wipe or dry my hands!.  She basically called me a liar!!  What happened to customer service!! 8.  Isn't not having adequate bathrooms and toilet paper &amp; paper towels, a health violation especially with the flu epidemic going on right now with people dying from it!!!   9.  Start caring about your customers!!!! 10.  On a positive note, the security staff was great - Malcolm, Lawrence and a third guy from Memphis were very pleasant, helpful &amp; provided great customer service!  Toni &amp; Joe should take lessons from them!!", 
    "review_date": "2014-02-25"
  }, 
  "OniLiyqsK0qKv4kptqzipg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Isaac L.", 
    "review_text": "Real cool off scene joint with good hip hop, full bar, intimate dance floor, and friendly people.  It's really more than a lounge than anything.  Lot of modern but simple decor, dim, and super cozy.  There have been some celebrity sightings in here, it's rumored.  I wouldn't say the place would get really jumpin', but it's a great spot to cool out with someone special or perhaps to start the night off as a meeting point.   It's real low key, no TV, full staff, high ceilings, and even a private room for rent in the rear.  I will say that it sometimes gets packed, but never for really long.  I think a lot of people end up heading down to the 5 or 6 major clubs down the street.  Great place to host a small get together where you only want to mingle with your own crew.    The place is small but mysteriously inviting.", 
    "review_date": "2007-07-19"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "Rosewood I love you.  Your outdoor patio.  Your elegant bamboo.  The skinny mirror in front of the bathrooms.  Your quick friendly bartenders.  Your chic black leather seats.  Your ability to hold two completely different parties at once.  Your ability to bring down the house with Whitney Houston's 'I Want to Dance with Somebody.'  Fabulous  - usually does the trick for most places. But you surpass fabulousness. You are like Tom Jones, overalls, mango and sticky rice, Whitney Houston - all rolled into one discreet North Beach package.  I love you.  That is all.", 
    "review_date": "2008-09-06"
  }, 
  "dTcYw_RuYUm-j83emwDnUQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee C.", 
    "review_text": "I'm on an in between scale on this one...  This place has left me looking back with a mysterious feeling... What is up those stairs, what is behind that wall, what else does this place have to offer besides beautiful, people easy access bars, room after room of loungey vibe to dancing vibe, to both, to outdoor dinning? I don't know, what else is there? I want to know more. Alright so, I'm intrigued... But not completely satisfied.   We came here on a whim. I was tired ready to hop in bed when my friend talked me into checking this place out. When you are in the mood I was in, no place is cool and desirable to be at besides your warm bed. But this place pleasantly surprised me. I am looking forward to going back and partying it up.   For this night, I was only the sober observer, which in case normally would get a less than positive review from me, accept in this case.", 
    "review_date": "2007-08-13"
  }, 
  "4XpJ4HKD5OQ3H5Gy330CkA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marie B.", 
    "review_text": "Have been to Rosewood a handful of times ranging from 2003 to 2009. I have to admit, I want to like the venue more than I do, but it falls short of my expectations every time. Here's why:   * while the venue is quaint and classic, it's narrow and the back room lacks seating and tables.  * or maybe that back area was meant to be the dance floor, but it wasn't very well thought out.  * music is hit or miss, but no real mixing beats.  * crowded, and takes a lil while to get your drink order in. (Having said that, the bartenders are friendly and have a good attitude in serving the masses.)   But here's what I do like about the venue:  * chill location, where it's not so loud you have to scream to be heard.  * no cover  * as mentioned above, good bartenders (at least at my last 2009 visit)  * very unlike the rest of North Beach's drunken debauchery even though it's just blocks away from it all.   Despite it all, it's still worth returning for a chill evening out with a somewhat mixed crowd and decent ambiance.", 
    "review_date": "2009-08-17"
  }, 
  "zy2cNfG4lLE3SlY9p2OL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aspasia S.", 
    "review_text": "i love this hidden gem in north beach ... it is literally hidden, i found myself lost walking up and down broadway the first time i tried to find rosewood ...\n  during early happy hours, it's the best place to organize a fun get2gether with friends, no crowd, while u have all its hip ambience, rosewood finish, and narrow space all to yourselves ... a nice patio area, and a second bar for private parties ... i love early cocktails during thurs and even friday nights, before the primetime nights ...\n  have been here too during primetime nights, hiphop deejay is hit or miss, crowd can be unpredictable, sometimes the bridge and tunnel crowd, sometimes some locals from all flavors of SF neighborhood ... it is also a great venue to do a for the girls (or boys) night out ... \n  while, last friday this was my last stop for the night;  sometimes, you'll meet that hot stud (or studette for the male readers out there) ... that will make you smile for the rest of the weekend, until the next ephemeral encounter .. ;-)\n  it's a fun joint, it's unpredictable ... i've always perceived the bartending staff to be consistently friendly and seemingly able to withstand the pressure of the crowd.", 
    "review_date": "2006-02-05"
  }, 
  "I5ctrq9WNVNir8GlATNYkw": {
    "user_rating": 2.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Eli Z.", 
    "review_text": "After reading all the positive reviews I was shocked in how bad of an experience I had at this place.  Decor wise, its pretty nice but let me tell you my gripes.  Cover charge; uncrowded at the time and there was no special DJ or anything else to legitimize $10 entry.  It was a friends birthday so I had to pay otherwise no way.  I walk in, and the place is nice, very odd location though, but there is one bartender.  Yep, on a friday night.  So I am like great, drink service is going to take forever, and it did.  As the place filled up, I noticed a complete lack of diversity in the clientle.   Besides me and my group of friends and maybe 5 other people the place was entirely Asian.   I typically don't notice things like this especially in The City, but it was honestly a little awkward for me.    I probably won't return since I hate paying cover to drink overpriced booze and that area is not my typical cup of tea.  Maybe I was just there on an off night, who knows....", 
    "review_date": "2007-07-19"
  }, 
  "yTNuMXKuqbgrn88Q-iwIlw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "flo t.", 
    "review_text": "Been one of my neighborhood go to bars for awhile now. If you ever want to throw a bday party it's an awesome place to get friends together in the background and with a beautiful patio (especially in the summer time). They were great with us bringing in food, playing our own iPod &amp; they had a personal bartender for us in the back that took care of all of us! So there's always a line for the bathroom, it's a small place and that's why it attracts folks especially in the heart of all that mayhem in n.beach. I still enjoy this place but I second the DJ reviews it's been given. Give it a try. ;)", 
    "review_date": "2006-02-13"
  }, 
  "aiENR_tVypxkpRky5H7gvQ": {
    "user_rating": 5.0, 
    "user_location": "Lakeside, San Francisco, CA", 
    "user_name": "Robin D.", 
    "review_text": "I almost  hesitate to write a review because this place is so fantastic I want to keep it as my little secret.   I held my wedding reception here a few weeks ago in the private back area.    The space is beautiful, inside and outside , with a bar area and plenty of lounge seating, as well as space for a DJ and dance floor.  I was able to bring in decorations to fully realize the 60s mod vibe and the space really provided all of the city chic I wanted and Toni was fantastic helping make it all happen.  Rosewood was really the cherry on top of my dream day", 
    "review_date": "2014-06-28"
  }, 
  "dDF1wdIsZsWQon1ZwgSGsg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin M.", 
    "review_text": "I was presently surprised by Rosewood. I came here for a friend's birthday party and had no idea what to expect.  Another friend helpfully warned that the entrance is very nondescript, and it is. To find it, look for a place with no signage on a block without anything else open, but a bouncer out front.  Entering the bar it wasn't too crowded, maybe just about right. After saying hello to my friend I went to get my first drink, a gin martini, naturally. The wait was a typical for a bar, which is to say, too long. While waiting though I got to see several cocktails made, with more care than most places will put in, someone here is clearly making an effort at high-quality drinks. Everything is made with fresh juice and real mixers. My gin martini was correctly *stirred* and came with the twist I asked for cut right there from a lemon.  The interior is nicely done and the DJ was pretty good. The music was a little louder than I would have liked though, making it a bit hard to talk.   The only real downside is the crowd. It was a little too business school for my tastes, Marina-lite perhaps. But really this wasn't a serious detractor. On the up side of this downside, at least that crowd will actually dress up to go out. It was nice to be in an SF bar where 90% of the people *weren't* just in T-shirt and jeans.  OH, I almost forgot. They take credit cards, although no AMEX. I was in a bar where I actually opened a tab, that part was heaven. Note to bars: if you let me open a tab, I'm far more likely to start ordering rounds of shots (which I did).", 
    "review_date": "2009-06-01"
  }, 
  "v5xfQidWLPrRx87tx0dDDg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Daneca V.", 
    "review_text": "Just had girls' night out here this past Friday and we LOVED this place! Cute, little intimate bar with a dance floor in the back and a patio out back (didn't get a chance to check it out) for all you smokers or couples who just want some \"alone time\" ;-).  It's very easy to walk past, so count the building numbers as you're walking up Broadway. Great music, (mostly hip hop on a Friday night) and there was a birthday group there too that gave me and my friends free cake and ice cream! The bartenders are super friendly (my friend left her iPhone sitting out in plain view on our table and Toni (high energy female bartender with a blonde pixie cut) picked it up and gave it to me, saying she didn't want us calling the bar the next morning, crying over a stolen/lost iPhone).  They seem to have specialty drinks that rotate on some sort of basis and lots of other enticing libations to loosen you up. Free coat check too!", 
    "review_date": "2012-01-12"
  }, 
  "7z-Crwkwo3wyngtjFhdJ9A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kat C.", 
    "review_text": "Got lucky with parking but not with reservations..  I had been in contact with someone from Rosewood regarding reservations and the process was very easy.  She reserved us two couches in the main bar for free and there was no cover.  We got there around 10:30 and the place was DEAD quiet.... like pin-drop status.  (The DJ was setting up....late...)  So, I met the person who helped me with my reservations... to find out she accidentally gave up our couches (on the better side of the bar) to another group of asians who didn't have a ressie but said they did?  But she didn't ask for their party name?  .........................  She did make up for it by grabbing us a 3rd couch and setting us up on the other side.  PLUS, she made some stiff drinks and even re-made drinks that we didn't like.  We got to see the private back room, which was cool but I thought it was alot bigger?  Apparently, it can fit up to 100 people and the bar min. is $1000.  dizams....  I think we spent a good amount before bouncing... but it was definitely not the experience I was hoping for.    Hope to update my review in the future, tho... the private room in the back seems awesome.", 
    "review_date": "2009-12-22"
  }, 
  "eBnToKDLoXxQvpwY6s5UdQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joy Y.", 
    "review_text": "almost missed the bar....but it was a very nice laid back bar...  nice bartenders and great drinks....and they put up with indecisive girls =)", 
    "review_date": "2006-08-20"
  }, 
  "kYBV4bJd4aoXqwpsVTpAGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew B.", 
    "review_text": "Takes forever to get a drink, but they're good.  Cool place with a dance floor, bar, lounge and patio.", 
    "review_date": "2012-08-19"
  }, 
  "hdAyZnCKfLB7Tm1b9skyfQ": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Lyla R.", 
    "review_text": "We had a private party at Rosewood the other night and it could not have been more perfect. The place is just beautiful!! Greg Lindgren, one of the owners was super accommodating, and helped make the event stress-free. We used the back-room to have a movie screening, and there was comfortable seating for all of us (about 30 people). Plus, we are a smoking crowd, so the patio area was a great bonus. Tom the bartender makes a mean drink!!  :)", 
    "review_date": "2009-09-29"
  }, 
  "pQMbjcDfr7A1aKtU_ls00w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer M.", 
    "review_text": "Yeah...so this place pretty much kicks a$$ for private parties.", 
    "review_date": "2008-09-22"
  }, 
  "ca0N3Fl3FckAWyupp6sDgQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art D.", 
    "review_text": "Who would think that a spot like this would be just outside the Broadway tunnel, hidden amongst the Chinese restaurants and shops of North Beach? Not me, at least until I went here for the first time as part of Julio's and Cassio's fundraiser event for the Starfish Greathearts Foundation (<a href=\"/redir?url=http%3A%2F%2Fwww.starfishcharity.org&amp;s=172ce9c294f329afd3be69dffd7517506278074c87907cfcd4b9a49537693384\" rel=\"nofollow\" target=\"_blank\">starfishcharity.org</a>).  I had heard mixed things about Rosewood before going here, but really enjoyed myself when I finally went. I totally dug the feel of this place, and loved the fact that they had so many rooms where one could hang out...I didn't make it into the back room (because it was closed) but the outdoor patio was cool.  The drinks were fairly priced, the staff was awesome and the clientele (all my fellow Yelpers, as well as a bunch of friends of Julio and Cassio) were cool and a blast to hang with. The DJ was mixing some good stuff that night, and the dance floor (which is a bit small) was generally crowded with people shaking what their mommas gave them...  I'll definitely make it back here, and am curious to see what Rosewood is like on a regular night...", 
    "review_date": "2006-08-19"
  }, 
  "0RwIQ8MU-VEsYmZpT_v1VQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel V.", 
    "review_text": "So I'm a benevolent guy...first time going here and I gotta say...THANK GOODNESS SIP WAS ACCROSS THE STREET...  Givin the spot 3 stars and I think that is pretty liberal, but I'm going to give it the benefit of a doubt and try it again some time soon..here's why  It was 10:30 PM and just as we left the pizza parlor, filling our stomaches with alcohol absorbing bread ammunition, we were all ready to grab some drinks and lose ourselves...but when we got there, the place was somewhat crowded, but the DJ was playing some crappy music.  It was as if it was a Monday night at 8 PM and he was mixing whatever he likes for shitz and giggles...the rest of our party were thinking that it was still too early and maybe the better music would play later. 45 minutes later, with drinks in our hands from a very serious bartender, the music was still not poppin, and I think there was something wrong with the audio system.  So we all decided to be like nomads and travel to the next lounge...SIP...which was more what we were looking for... a great dj spinning good music, a good crowd, and fun bartenders...I will definitely give Rosewood another shot...maybe it was just an off night...but how could Saturday be an off night...I Don't know....we will see in the near future...", 
    "review_date": "2008-09-16"
  }, 
  "byUZpVzun-vVMMCFMXvdXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriel R.", 
    "review_text": "After a few recommendations by some fellow Yelpers, I finally checked out Rosewood. My date and I arrived to find out that there was a private party going on. However, a gentleman that seemed to be an owner or manager, very graciously let us in after speaking to us for a few moments. We were greeted by a very attractive interior and bar on the left side that included a dj at the far end. The outdoor area is small but perfect for better weather when smokers want to get their fix. The music, much to my delight, was mainly east coast hip-hop and rap that night. It's great that they're open to playing that out here...you know, that whole east coast - west coast rivalry thang... The place was full of well-dressed, attractive and approachable people, although my date and I pretty much spent most of our time getting to know each other. We also agreed that it was a place to revisit as the party that night was mainly woman who were about 5'10\" and taller and the men were freakishly tall as well. Perhaps a party for really hot tall people in town! Who knows?  I will go back to see what it's like on a different night and share my final thoughts.", 
    "review_date": "2006-12-17"
  }, 
  "txrANKGe5_pxA9vw4XqyTA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex G.", 
    "review_text": "D-bag bouncer says it's a private party and asks me who i know there.  I said i didn't know it was a private party.  He then says \"can you read?!\" and points to a small, unassuming sign. Then he says \"i'ma be nice to you just this once but i want you to learn your lesson.\"   Dude, you're a bouncer, get a real job.", 
    "review_date": "2013-10-14"
  }, 
  "_S5tB9stFX3YKLBPVoEjqA": {
    "user_rating": 4.0, 
    "user_location": "Rome, Italy", 
    "user_name": "Andrew T.", 
    "review_text": "went here for angelo's 50th bday. we had the backroom and patio to ourselves. we also had our own bartender, although i was too hungover from the previous night to actually order anything. scratch that---i ordered a diet coke and downed it in 3 seconds which caused somebody's jaw to drop, thinking i had just downed a mixed drink that quickly. they had little snacks for us, but i think i ate too much of the spicy cheese because i was shitting bricks all day on sunday. the patio was cool, although there was a creepy alley-way that smelled like a dead body. i wasnt about to check up on it...good experience, maybe we can celebrate your 51st here next year, angelo.", 
    "review_date": "2008-10-26"
  }, 
  "nlOxarS20luHkAloH5YyzA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Vanessa G.", 
    "review_text": "I really like this bar.  It's the kind of place that's very middle of the ground.  Your yuppie friends that like fancy places and dressing up will like it and come here and your dirty friends that like dive bars where you wear tennis shoes and t-shirts will like it and come here.  It's the ultimate please everyone type of place.    Without a doubt this is the least stressful venue in the city for planning a party.  I planned a party here and they were very clear and straightforward about the terms.  I highly recommend this place for birthday parties, bon voyage parties, etc. because there is an extra room in the back and patio outside.", 
    "review_date": "2007-09-13"
  }, 
  "5HEbeSrj8CJxw1VGNXV4KA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jew M.", 
    "review_text": "I am not sure what everyone else is crying about, but this place is great!  I had no problem with the service, the most friendly bartenders in SF!!  The drinks were AMAZING, some of the best that I have had seriously!  The music was great, and it was an awesome night.  Everyone was in a good mood, dancing the night away.  Thank you Rosewood!!! I am def. coming here again as this is a hidden gem in SF.", 
    "review_date": "2014-01-14"
  }, 
  "FP6C8cb-9riK10ONRNARsg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Tom K.", 
    "review_text": "I have headed to this place a couple of times over the past few weeks and had good times.  Its been hit or miss in terms of the crowd but DJ Satva plays there on Friday nights and I like to go listen to him.    If you're in North Beach give this place a shot, especially for Friday nights.", 
    "review_date": "2008-04-29"
  }, 
  "Er0hnraJKQ8qpWOHg_iYVA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Todd E.", 
    "review_text": "A cool little bar in North Beach that I never would have made it except for last nights event charity event...I'm not sure if last night was indicative of the usual crowd at the bar but I doubt it since it was rife with Yelpsters. Definitely worth a trip back to see what the place is like on a normal night.", 
    "review_date": "2006-08-16"
  }, 
  "dP2vQRFB0xK5bD-aCGZM1w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda N.", 
    "review_text": "Cute place. A bit small though and it gets hot as hell especially on the dance floor. Wasn't there long enough to really give it a proper review, I'll definitely go back and check it out again.", 
    "review_date": "2008-07-26"
  }, 
  "EJIeL4LkaXPkv5cQV6cQOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elena S.", 
    "review_text": "I love the inside of this place with the beautiful rosewood paneling.  I couldn't stop staring and I wasn't stoned or drunk!  The space was cozy and intimate and the extra garden in back was very cute minus gurgling sounds coming from the water attractions.  Nice little dance floor!", 
    "review_date": "2006-08-28"
  }, 
  "9mr1YgKEKOD0Si4v46nqNA": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Hayley W.", 
    "review_text": "We were all set to have a Hayley and Ting date night.  The music was great, yelpers were out and havin' fun, the bar looked purty, but after an hour something was wrong.  I had had 3 drinks and was not buzzed in the slightest.  Ting looked at me aghast as she is used to getting me embarrassingly sloppy after 2 drinks.  I am ALWAYS a cheap date (It is a great thing).  After 4 drinks and $40 later we left with only a buzz. On our way to Golden Boy the realization hit me that I hadn't even had dinner!  4 drinks on an empty stomach and all I get was a tiny buzz!  No good Rosewood.", 
    "review_date": "2008-02-29"
  }, 
  "uSCYNal_CJDPGBYUAenyoA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke M.", 
    "review_text": "Decent sort of event space surfing the line between Chinatown and North Beach. Nice wood interior as the name implies, sweet patio, a couple bars.   A good place to host a nondescript event for sure, but it's location probably ensures that not much is going on on any sort of regular night.   I'm going to review it as a bar and call it a three. I'd give it 4 stars as an event space as long as you are bringing your own crowd.", 
    "review_date": "2012-02-07"
  }, 
  "0gEDwhSUIWIBz23MbLYMig": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Luis M.", 
    "review_text": "One year ago my friend Pookie asked me if I wanted to come to Rosewood for some type of party being thrown by a fellow Yelper and his friends.  Being a school night I was hesitant but by this time I was deep into the Yelp pudding and mid-week outings were becoming a regular part of my life.  We walk in and as the name suggests Rosewood is plentiful here, lining almost all of the walls.  It was a great night of drinking and dancing.  The narrow layout made it a bit difficult to navigate to the bar when the place got packed, and the place was like a furnace unless you went out back to the very nice bamboo garden.  Being from the East Bay it came time for Pookie and myself to leave if she was going to be able to get me to a BART station in time for me to get home.  So I walked up to the bar to close out my tab.  While waiting for them to return my card I spotted a gorgeous freckle faced girl with two of her friends standing next to me.  Wow.  I mean...WOW.  I can hardly ever express my *type*.  Maybe I don't have a *type*.  I know what I like when I see it and I was seeing something that I most definitely liked, even if she had way too much (     o     Y     o     ) on display for my taste.  I wanted to buy her and her friends a drink before closing out my tab just so I could talk to her...but I really had to get home.  So without saying a word to her I closed out my tab and went home.  She thinks I didn't notice her that night.  She's wrong.  I fell hard that night, and I'm still falling.  I have no shame whatsoever in saying this.  It's crazy how much can happen in one year.  How fast things can change.  The highs and lows you can experience with one person in such a short period of time.", 
    "review_date": "2007-08-15"
  }, 
  "OKwe2-BIm20cnZmhC0HqaQ": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Stephanie S.", 
    "review_text": "I really loved this place.  It was small, not crowded and really chill.  I celebrated my sister's birthday earlier this year and am happy to report that we had SUCH a great time.  The music was alright, the drinks were great, and the atmosphere was perfect.  I saw reviews that this place is hit or miss, but the night that we went, it was a complete hit.  Love it, and would love to go again.  So please keep in mind that I went only once for a full night and once before that just to check it out (near closing though).", 
    "review_date": "2009-11-10"
  }, 
  "UzG5IHFUu6H1UyCRbqHHZw": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Ting A.", 
    "review_text": "2 drinks = sloppy Hayley W.  however, at rosewood,  4 drinks (totaling $40) = sober Hayley W.  happy hour w/Hayley usually means that i'll have a front seat to hilarity, however, rosewood definitely let me down.  it was great to be among fellow yelpers (thanks for helping put the event together, JT F!) and listen to old school hip hop, but the lack of drink-making skills soured the evening.  fyi, rosewood:  decent drinks = more patrons = better business.", 
    "review_date": "2008-03-01"
  }, 
  "V2I8XzyjgEU0y0coLov5sQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaime T.", 
    "review_text": "I came here about three weeks ago for a friend's birthday party.  Like some of the other people I thought the bartenders and the DJ were cool.  I enjoyed the music, or at least what I remember was playing.  The bartenders made me some strong tequila gimlets, with tequila and real lime juice over ice.  This is a plus because I hate it when bartenders used bottled lime juice to make drinks.  I thought the decor was nice and the crowd was stylish.  Even though the bar  is a little on the narrow side, it didn't feel like it.    So why only three stars, just because it is not a place I think I would go to on my own if I was not invited to a celebration.", 
    "review_date": "2009-03-19"
  }, 
  "IkFjRnnI5trMcwHHl_1Vrg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonia S.", 
    "review_text": "Rosewood is the only place in North Beach that has stuck around and hasn't gotten too cheesy (perhaps due to size constraints)... I was there for a private party in the back room and would definitely go back for another private party but would be more hesitant on a regular night as the dance floor is ridiculously tiny and the bathroom line is ridiculously long as is the wait for a drink. The back room, however, is perfect. Lots of space to socialize, dance and get a drink while not being shoved around. The outdoor space makes the back room that much better (more ventilation, makes the place seem bigger than it is) as you wouldn't expect a bamboo courtyard on Broadway. The dj this past saturday was spinning some good stuff- I was definitely pleasantly surprised.", 
    "review_date": "2008-03-30"
  }, 
  "dyLZYEJ93cLl6sL_bUOPtQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cliff C.", 
    "review_text": "Never too empty, never too crowded (at least when I've been there) which is good with me...plus, Hoegaarden and Chimay, son!", 
    "review_date": "2007-06-13"
  }, 
  "jYyDRSVxLgZrAL8ecd9sPQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Carey M.", 
    "review_text": "If you're looking to have a private party, do it here. The back area is great and so are the people that work there.", 
    "review_date": "2011-08-16"
  }, 
  "RCmp-pCAkdAiAcMa2BXwDg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandra D.", 
    "review_text": "I have come here only on occasions when either our company or friends rented the place or the back room. The back patio is a cute little hideaway and when it's warm outside, it's the best place to hang out and celebrate. The staff is friendly and knowledgeable and the location is great. Don't know about the prices since it was always open bar when I was here. I heard it's really reasonable price to rent though, compared to a lot of other SF bars. Plus, Julia Allison celebrated her birthday here a couple weeks ago. (Gotta add a fun fact, sometimes...)", 
    "review_date": "2009-03-13"
  }, 
  "EzaSJNXzr-RWWFb96Yt2wQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Adrianne B.", 
    "review_text": "I absolutely LOVEDDDDDDDDD this place! I'm from LA (ughk) and I made a trip up north last week and luckily, stumbled upon this amazingggg place on Friday!   We had no idea where we were gonna go, but we found parking nearby and walked down and this happened to be the first place I saw.. Their bar looked so cute from the window, so we decided to go inside. The guy at the door was so nice! We walked inside and it was pretty empty, but the venue was adorable!! They had a private event going on, which wasn't very private at all, but it was set up with candles and roses. And the outside patio with the lights and trees is just so amazingly romantic!  I absolutely fell in loveee with this place. My birthday's next week and all I kept thinking about was, \"Damn! I wish a place like this existed in LA so I could do my birthday here!!\"   ROSEWOOD PEOPLE, PLEASE, PLEASEEEEEEE MAKE ANOTHER BAR IN THE LA AREA!! I think Silverlake would be a great location. PLEASE!!!  PS. I'm still looking for a place down in LA to do my birthday, if anyone has any suggestions of places that are similar to Rosewood, please let me know! Thanks!  PPS. One bad thing though, there wasn't a live DJ and there were breaks in between songs where the music completely stopped and everyone on the dance floor stopped dancing.  I still had fun and danced my ass off, but a live DJ or a better playlist would've been nice.", 
    "review_date": "2013-02-23"
  }, 
  "OnagJ2dnPjfRRT4a_CgKCw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi T.", 
    "review_text": "This place stinks. My girlfriend and I went there recently for a few drinks. We knew the crowd would be mainly B&amp;T since it was a Friday night...so no compaints there. My wine was bad so after two sips I moved onto Kettel Soda.. The bartender gave us Kettle Tonic. When I asked him whether he had given us Tonic or Soda he insisted that it was Soda.. SODA WATER IS NOT SWEET...maybe the if bartender was not so distracted with mixing CD's he may have made some decent drinks...overall...the drinks, the music, the crowd STINKS.", 
    "review_date": "2006-05-22"
  }, 
  "XFFCSts3EYKwSZdHZQ4wew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine R.", 
    "review_text": "Held a bridal shower here and it could not have been a better experience.  Toni coordinates all private parties here, and she was the best. I've thrown a lot of private parties at bars/restaurants and this was the most seamless ever. By far!  Highlights: -Toni has a great attitude and gets as pumped for your party as you -She supplied beautiful flowers for the event, completely free of charge! -You are allowed to bring in outside food, for FREE! -We told her we were going to put on a quick fashion show, and she went above and beyond by buying expensive lights just for this! -At one point in the party, she even let us all eat a pizza she had ordered! Ha! -Towards the end of the bridal shower, yes, this was a bridal shower, people started getting into it. It turned into a full on dance party until like 1am, with Toni out there dancing with us!  Hold a party here, you will not be dissapointed! It was too good to be true.", 
    "review_date": "2013-11-08"
  }, 
  "TAw9a920VeW1Jw892jvfqA": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "James F.", 
    "review_text": "This place looks cool. Nice decor. Bouncer/door guy was friendly enough. Bartenders -  a little slow but it was moderately busy.  I just couldn't get into it.  I was bored. While drinking? Bored??   Had 2 drinks and went back to hotel and slept.", 
    "review_date": "2008-09-17"
  }, 
  "yfy3v_n7BWiGs6pTf58i6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey J.", 
    "review_text": "Rosewood, your dim lighting and wood themes, which include wood walls and hollowed-out wooden pendant lamps, manage to create an intimate feel in spite of the heavy Broadway Tunnel traffic outdoors and the blasting Tupac inside. (Note: Tupac = good thing. I'm not complaining about the music in any way; in fact, it was perfect for a little groovin'-in-your-seat chair dancing.) Anyway, continuing... Rosewood, somehow you manage to do wood-paneling in a hip, trendy, non-70s-porno way. Your drinks are strong, and your decor is understated and chic. Your crowd is chill and non-sketchy despite your proximity to the strip clubs -- *ahem* -- \"dance\" revues two blocks away.\n  However, Rosewood, how in the name of all that's antibacterial can you NOT have soap in your bathroom?! My hands, my hands!!! *looks down in horror* My haaaaaaands!", 
    "review_date": "2006-08-27"
  }, 
  "y9-bfJEhXvU98vwt5UejuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron W.", 
    "review_text": "I agree with the other reviews here in that it's a smaller bar with a little dance floor that is usually no hassles to get in.  It has a simmering hip vibe to it, but when we went last night it was a bit more packed than I remember it being previously.  After about 1230 a bunch of people left (maybe a big party was there) and it returned to a more relaxed uncrowded atmosphere.    My biggest issue with Rosewood is that they have this gigantic bar and the bartenders only work half of it.  So instead of being able to get a drink easily you have to fight through all the idiots who buy a drink and don't clear the F out of the way and the whole time you're left wondering why when there's an empty bar section steps away.  The end result is overcrowding at one end of the bar and a lot of spilled drinks as you make your way back to the other parts of the bar.  I'd still go back, but hopefully someone at Rosewood sees this and makes a simple change to fix it.", 
    "review_date": "2008-02-24"
  }, 
  "h5qf9owtv9q8HjaNcrz3OQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ken L.", 
    "review_text": "Maybe a cursory review, but I stopped by briefly at a private party and really liked the ambiance.  Very dark wood, with an outdoor component.  If only it wasn't so out of the way...", 
    "review_date": "2011-12-27"
  }, 
  "GuMkSUhINdQlOvZy0MmSTw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen N.", 
    "review_text": "rosewood has a nice decor.  it's got a loungey feel which makes it stick out on broadway street.  upon first entering, it looks like a tiny little lounge but there's a whole back section that has a patio area (its reminiscent of b412 in Palo Alto).  good place to chill for drinks and move on. wouldn't make rosewood my whole night.", 
    "review_date": "2010-09-15"
  }, 
  "R7atWnGlDkXTzS78iwH7Xg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elizabeth G.", 
    "review_text": "Rosewood is a secret classy bar in North Beach on Broadway.  Ok, maybe it's not secret, but it's not your usual Broadway establishment (you know what I mean...).    Good drinks, not too pricey if I remember correctly...I don't think I do because I was in rare form the last time I was here but when I checked my credit card statement it wasn't as bad as I thought it would be.  It's not too packed so you have room to make any piece of the floor you and your friend's own little dance floor.  The staff is friendly and you don't have to push and shove or wait long for a drink at the bar.    Me likey.", 
    "review_date": "2008-11-16"
  }, 
  "gjhzKWsqCIrpEd9pevbKZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miriam W.", 
    "review_text": "Just about the only bar in North Beach I'd go to willingly.  If you can will yourself to ignore the sometimes deplorable crowd, you'll enjoy this sleek place. It's beautiful inside and comfortable too if you can procure a spot to sit.  Far better on weeknights than on weekend nights.", 
    "review_date": "2005-12-06"
  }, 
  "6BPWg3w-B0IphHnePrYt-w": {
    "user_rating": 4.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Tak K.", 
    "review_text": "I had an opportunity to attend a Yelp event yesterday at Rosewood.  The interior is dark but the bar portion was lighted with orangish lights.  That gave a sophisticated outlook.  At the back of the club is a dance space where all the walls are made of hard woods so you could feel the low base vibration from all of them.  The drink I had was pretty strong, so I, not a heavy drinker, just needed one drink.  Bartenders werecool enough to give ma a cup of Coke and club soda for free, so I left them a tip respectively.  Now regarding the event...  I got to receive greetings from JT and Omar, while I was able to take to Gracy, Jessica, and a couple others that I've met at other Yelp gatherings.  People there were very relaxed, and I did not have that out-of-place feeling.  DJ's were also playing a slightly older songs so people over there probably felt like they were high school students again (just as I did).  I haven't danced for a while, and probably haven't exercised enough so couldn't dance as much as I wanted.  Oh well, maybe next time.", 
    "review_date": "2008-02-29"
  }, 
  "YJTQ5eqVasyhY28jdtC6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Radha S.", 
    "review_text": "Came here last night with my hubby and a couple of friends, we got there kinda late (11:45), but what's great about the place is that there's no cover!   They have a fully stocked bar and the bartenders were very quick. The place wasn't super packed but it's always better when you can move around.   There's also ample seating room and a small dance room in the back.   I'm definitely old now, too much loud music gets to me after a while, but I'll be back when I need a night out and I'm not in the mood to deal with youngsters!", 
    "review_date": "2009-04-26"
  }, 
  "oul-lnrhw-c4SMargr_72w": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Vi N.", 
    "review_text": "Celebrated my friend's birthday here.    It's a good sized place, cozy but not cramped.  We were in the back room, which was an outside area and had tables and benches for us to sit and chat.  The drinks were good, but our bartender was slow.  I allowed someone who was about to leave cut in front of me so that she could order the birthday girl a drink, and ended up wishing I hadn't because I ended up waiting at least 10-15 minutes while our bartender mixed everything up.  Other friends echoed this criticism about how slow it was.  Other than that, everything was good.  I liked the ambiance of the place, and there was a coat rack with hangers so that I didn't have to hang on to my jacket all night.", 
    "review_date": "2011-03-06"
  }, 
  "y_COVWJOTUWAnm7E92iHIw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shaochen W.", 
    "review_text": "I love this place! I hadn't been back for a while and decided to bring some friends for my birthday. It was small enough to not lose people but big enough for mingling and not feeling claustrophobic.   The highlight of my night (other than all the awesome friends) was seeing that they'd named a drink special after me! Thanks to Toni, who was great to work with - all I did was email her and she had a table reserved for me when I got there and I didn't even request it!   This bar is definitely one of my favorites in the city, definitely recommend for groups and parties!", 
    "review_date": "2012-12-01"
  }, 
  "VjUuaL2A0QwrRZ8hDdFf7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josie M.", 
    "review_text": "the only place you'll find me drinking hoegaarden on the weekend after the sun goes down.  i'm docking them one star for distracting me from their famous lychee martini with pear flavored absolut shots.  and giving them four stars for helping me verify the whole \"beer before liquor never sicker\" theory.  it's gospel, baby!", 
    "review_date": "2007-04-05"
  }, 
  "QPpPIMxWWDAWP376voLWtw": {
    "user_rating": 1.0, 
    "user_location": "New York, NY", 
    "user_name": "Kim K.", 
    "review_text": "Trouble on the horizon? Arrived 7:30pm Wednesday night to find the entrance blocked by an illustrious SF homeless bundle. There were no signs indicating why the bar was closed, no paper covering the windows- perhaps the owners didn't want to wake the sleeping doorway dweller?", 
    "review_date": "2011-05-11"
  }, 
  "qIDy9zJfCuqxy6A3exPe_w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne C.", 
    "review_text": "Low-key place with a nice dimly lit ambiance. Randomly placed in Chinatown. Never gets crowded.", 
    "review_date": "2010-12-12"
  }, 
  "_tYdp-NhWaKnwYveFE2JnA": {
    "user_rating": 5.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Clara N.", 
    "review_text": "The bf and I came here one night to meet a few friends. There were two parties (one in the front and one in the back), and the manager Toni was SO nice and accommodating. She checked with the front party to make sure it was ok for us to be there (we just wanted to get a few of their great scratch cocktails and dance a little, nothing sloppy), and she even showed us the back patio and explained pricing for private parties. I have to say that the pricing that she gave out was completely reasonable, and the outdoor space is so awesome, we're trying to come up with a reason to have a party there! To top it off, we got 5 drinks on our tab and the total came to less than $35 including tip, and the drinks a mixture of beers, cocktails and whiskey! Great service and price in a cool space definitely deserves 5 stars.", 
    "review_date": "2013-06-04"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "I've been a fan of Rosewood since day one (I'm OG like that)   Like must North Beach bars it gets crowded on the weekends but during the week it's the perfect spot to grab a drink or three.  Plus the backyard patio is a hidden gem.  PD says check it out.", 
    "review_date": "2006-08-17"
  }, 
  "BdRMVROS1MXOHxr-bdZv0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice Z.", 
    "review_text": "This venue is a total treasure for special events. Toni is fun and exuberant and super open to ideas.  We had a brunch party there for 80 people and worked closely with Toni on specialty drinks and punch bowls and a \"champagne bar\".  Her team put in so much work and we got such a great price for everything.  Would do another event here in a heartbeat! The outdoor patio space is really fantastic.", 
    "review_date": "2014-06-15"
  }, 
  "CDZWiihsmtiP-cgBRSSljA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joe B.", 
    "review_text": "The high point of the evening was posing as Spider-Man in the outdoor patio in a little alcove right under somebody's window.  Not that there weren't a lot of high points, but you must agree, that's a pretty high point.  Angelo's 30th was awesome - we got here a little before the major crowd showed up, in the hopes of leaving the city early, before the club kid crowd clogs up the freeway entrances.  The plan worked perfectly.  The space in the back is quite accommodating, even if you have to go through a room that looks like a slaughterhouse before you get there. :*(  The space in the front is quite swanky, even more so given the part of Broadway it sits on, right before the tunnel.  We came across the bay, got a parking garage, got our instructions on how to drop off the key after hours, and headed on over to Rosewood . . .   a few hours later, after hanging out at one of the most well-publicized 30th birthdays in Yelp history, we met various interesting people, had a good Manhattan, Moscow Mule, or two, and just generally hung out.  Sure, the drinks were a little expensive for the locale and for the drinks themselves, but the company was well worth it.  DJ was great, both indoors and out.  Somebody who always dances on a table ended up dancing on a table, and I called it.  Everyone looked great, and the trip across the bay was well worth it, even on a work night.  Thanks Angelo!  And the stop at the Lusty Lady on the way back fo the parking garage didn't hurt matters any. ;-)", 
    "review_date": "2008-10-23"
  }, 
  "WnzRueYdRWNSbkXB0_0i4Q": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chuck N.", 
    "review_text": "I really enjoy this bar. I've been here twice and although it's tucked between Broadway's Chinatown 400 Chinese restaurants (seriously, it's like a mirage in the desert), it is beautifully designed and always a good time. There is a back patio and bar that's nicely decorated with bamboo trees and redwood furniture that makes it look like a nestled hideout in the forest. The staff and drinks are great too. I'm a fan. Parking is also better than certain parts of downtown too.", 
    "review_date": "2012-02-02"
  }, 
  "Og1g9HC0J4X97Wszgiav7Q": {
    "user_rating": 5.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "M. P C.", 
    "review_text": "Very friendly staff and great cocktails... Kit did an amazing job introducing us to new drinks and making us feel like we were regulars.", 
    "review_date": "2013-06-26"
  }, 
  "Ud6j2HN40qEhycq2PuwcBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yan M.", 
    "review_text": "Great vibe and crowd at this bar, thanks to Julio and Cassio for organizing the Summer Tuesdays Happy Hour. Met lots of Yelpers that I've not seen in awhile....great conversation and laughter, awesomely good time. Will be back....", 
    "review_date": "2006-08-15"
  }, 
  "YxRRrYeupc0a_JJaPKcd0A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Harman N.", 
    "review_text": "My friends and I threw ourselves a joint, private birthday bash at Rosewood, and it was a great experience! Toni, the host, made planning everything a smooth and seamless.  Rosewood is divided into two areas: a front, which encompasses the main bar and the dance floor, and the back, which has a separate bar and an outdoor patio. The two areas are available for separate private party reservations. Our group had the front of the place.   In addition to the friendliness of the staff in general and Toni in particular, a few things really stood out about the experience: * We got to choose custom drinks with custom names on them. Since it was a joint birthday party, we chose as drink names the names of the birfday peeps. This is a small little touch that goes a long way in making the party feel personal! * We got to control the music on the dance floor! \\ * When we walked in, the place was beautifully decorated with balloons and candles. We were not expecting this and it was a pleasant surprise.   All in all, highly recommended if you are planning a party!", 
    "review_date": "2014-05-01"
  }, 
  "_pIG1_s6Bzymn1zeyLjBHQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace K.", 
    "review_text": "Want to party it up to great music, have terrific drinks, pick up hot women, spot out studly men, and have the time of your life?  Don't go here then.  And that's all I've got to say about that.", 
    "review_date": "2007-10-02"
  }, 
  "Rn9nlb3sFJ_a6W6DE7PZmA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rashmi N.", 
    "review_text": "Rosewood is set in the middle of an dark and empty (night-time) block.  You might even pass it by completely if you didn't know it was there... but don't!  The minute we stepped inside the warmth was tangible.  The front room is wood paneled (fake, by the looks of it) but somehow maintains a classy rather than 80's basement look (you know what I'm talkin' about East-coasters).  We arrived early to set-up for a special birthday celebration and so the place was empty and candles were still being lit.  The private area is spacious - two rooms, a bar and patio access (the patio is candlelight and bamboo gorgeousness even if there is a shower ventilation window right above).  We decorated with some lights and pretty paper on the wall to liven up the private areas.  All the staff - from the bartenders to the bouncer were friendly and helpful - even moving furniture to set the ambiance. Yummy drinks  - ask Benito to mix up something special for you!  There was also an Ipod set-up for the birthday girl's playlist.  Rosewood is nice for a drop-in situation and awesome for private parties!", 
    "review_date": "2007-10-02"
  }, 
  "dTdltcr2EC5oMZ1rs795PA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason J.", 
    "review_text": "ive been here a lot.  it does help that i live in the area.  would have given this a 4, but i've got a few gripes.  the bouncer (same guy always) makes you wait in line, when there's people inside, or strangely enough, when there's not a lot of people inside.  the bartenders arent very fast.  the bathroom line extends to the dance floor.  despite the seemingly negatives above, i do like the place, and find myself here a lot.  it's a cool little bar in northbeach that gets you away from the lower broadway strip.", 
    "review_date": "2008-09-09"
  }, 
  "0FbtB0ajpk8VZSVpC6KjGw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Roopa D.", 
    "review_text": "Rosewood is a little hidden but its worth finding.  This small North Beach bar has a great atmosphere and its a great place to shake your booty. A little small but if you've really got the urge to dance you'll find a way right? Great hip hop, the DJ is right behind the bar so you can sit and have a drink while you watch him spin. Good times!", 
    "review_date": "2005-03-14"
  }, 
  "gjZp61JZaqcLrKjEDVSPIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T-Bone L.", 
    "review_text": "This place has a real New York vibe.  Good martini.", 
    "review_date": "2005-05-02"
  }, 
  "8oFZEpX00zZS1Dku2aKfcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jung-Ah Y.", 
    "review_text": "randomly in the middle of chinatown, when walking down the empty streets in the middle of the night, you would never notice that this place is a bar. WHen you walk in though, it's pretty nice and you definitely feel like you've walked out of chinatown and walked into SOMA or Union Square.  Cute little bar, pretty classy. Given, only time I've been here was for a private party and the back room is perfect for that. It's a cute back area with a patio (given there is no lighting outside so rather dark but nice nook if you want to get away from the crowds). There is not a separate DJ in the back though, you have to provide your own music. However, there is a separate bar in the back; given they don't stock it fully so there was some issues of having to go back and forth between the front and back bars because they had to keep transferring goods for us.   Definitely had a good time; however, it is kind of out there and again in the middle of Chinatown with nothing around. So unless you want to hold a private party that's going to last, I'd suggest going elsewhere. I haven't gone here just to go to the bar, so not sure how it is on other nights, because let's be honest. The private party in the back made up about 40% of the everyone in the building.", 
    "review_date": "2009-11-28"
  }, 
  "OFPNE_TTnl9TAEQxrTK23w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph L.", 
    "review_text": "Cool off the beaten path North Beach bar with a big dance room in the back and a great DJ! The bar was small and very intimate with a great bar keep. Had a great time here and good vibes. Just off the beaten path and wish there were more to do around here. Can't really see myself going here unless it was rented out or some private event. Good times, so check it out without fear if you have a reason to be here.  Cheers!", 
    "review_date": "2014-11-23"
  }, 
  "ZnoRV0CJYbKqHlWWm_6MIA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine O.", 
    "review_text": "So i've had 2 completely different experiences here. One thing I've learned, keep your eye open if it's your first time: the door is hard to fine. Find the large unmarked modern looking rosewood door, with the word \"rosewood\" in metal cutouts above, squished between the normal scrubby looking Chinatown structures.  It is strangely located in Chinatown, because when you walk in, it feels as though you are in a completely different area.   Environment: Modern looking, very neatly designed. Front area has the bar, little areas to lounge around in. Then a dance floor, proceeding to the back are more areas to hang out. A patio too! The dance floor with the usual \"club\" music mixes...along with mini tables dimly lit with candles.  People: WAY busy on a weekend night. Too many partiers here. Seems like a more snobby-I like to party all the time crowd. Bar- ran out of cups?? So we had to wait.   Visit 1: It was for a private party. We were located in the back, so I had a leisurely time.   Visit  2: Way chaotic in there. Bf couldn't stand the crowd-he was just scootchin by and an ignorant male bystander decided to ask him why he was trying to touch his butt. There's 1 inch of space to move around in, what do you expect? Waited way too long for the bathroom. Got pushed by by a VERY drunk girl in rags stumbling all over the floor, which she proceeded to the bathroom to throw up. Then as she walked out she was dragging her body all over the floor. Then threw up right in front of my bf. good call.   Experience could've been better. I think that night was way too crowded, and I believe on a more slow night, a casual relaxing time would make the place more pleasant. So overall, average, but nothing to really be thrilled about.", 
    "review_date": "2008-03-03"
  }, 
  "AlpltTc9Y8k8A4x5239JUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy A.", 
    "review_text": "The staff at Rosewood goes above and beyond to ensure that their customers are treated with the utmost hospitality and have a great time while at their establishment.   My cousin organized a birthday party here and, Toni, the manager left no detail unnoticed to make sure her event was seamless. She reserved the front part of the bar (which is huge, complete with an almost private dance floor) for us - signs, candles and custom drink menus (that she was able to choose the names for in advance) were framed throughout the bar. They let us know in advance that we'd be able to be completely responsible for music, if we chose to do so, so we were able to make playlists on our iPhones in preparation for her event at Rosewood.  The bar itself looks quaint from the street and can almost be overlooked, but once you get inside it's completely renovated and classy. There's a beautiful outdoor area and private section in the back that seems perfect for a private party or event.  Thank you, Rosewood, for a great night!", 
    "review_date": "2013-11-27"
  }, 
  "L3GWuD2vJbsMGlzrtZtDJw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kinjal S.", 
    "review_text": "You had me at outdoor patio and helluva good drinks!  Have been to rosewood multiple times and I am happy to say that every single time I've had a great time. Not just mingling with friends but appreciating the sheer talent and generousness (if I may say so) of the gifted bartenders.  The outdoor patio is big enough and looks all cutesy with the lights.  The music - every single time it's been great, toonies I can dance to or just enjoy while conversing w/ friends, very smooth transition as well.", 
    "review_date": "2013-09-19"
  }, 
  "LdWIjNvjdaAoAfpQhT6F9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tinna H.", 
    "review_text": "If you're coming here, don't forget to write the address down, or you might end up wandering up and down the block like we did. Broadway between Powell and Stockton - that's all I could remember.    Luckily, now that I've got my new LASIK vision, the inconspicuous entrance of Rosewood could not escape from my sight. It was there, middle of the street. We were tempted to just run across the street. We were just so happy to have finally found it. Wouldn't it have been embarrassing to get there, park the car, wander up and down that same block, only to give up and go home?! And then - the next day, read about everyone's great time?    I truly believe that one's experience anywhere is altered by the company. And I've found that any time I'm around a large group of crazy Yelpers, there is much fun to be had.    We got there super early because I didn't want to stay too long. Of course, that threw itself out the back patio when the people started pouring in, and the drinks were pouring themselves! TOO MUCH FUN.  Seriously though - attentive bartenders, comfy leather seats, itty bitty dance floor, back patio, cheap Chinese food within walking distance. And if the party gets a little crazy in THAT sorta way, there are places to go just a few blocks away - NOT.", 
    "review_date": "2007-07-13"
  }, 
  "QBXAIu1Vm-nKXUwBqZ5H7Q": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Jessica P.", 
    "review_text": "Having a 30th birthday party is a good idea. Great back room, nice private area, patio to mingle in on a warm SF night and your own bouncer? Sweet!  It was a night of watching the bf turn into a webbed superhero, champagne cocktails, dancing in the bathroom line to Groove is in the Heart, getting lost IN the bathroom (it was late) and table dancing.  The staff was accomodating, the DJ played what everybody (drunk and sober alike) could dance to and it's an area of North Beach not immediately known as the Bermuda Douche Triangle.  Bravo, Angelo, Bravo, for getting a bunch of crazy folk together for your epic event.", 
    "review_date": "2008-10-24"
  }, 
  "2fN8mN7uUjOw-QqtcgYqXQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David L.", 
    "review_text": "Food: 3 Decor: 3 Service: 3  Came here for a company event, which was open bar.  Pros: -outdoor patio  Cons: -small venue -long waits for ordering drinks -so-so drinks", 
    "review_date": "2012-11-12"
  }, 
  "fSvOdnryI9FPJ2ylcsE2ig": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "WHAT HAPPENED? Did they change ownership or something here? So, I went last night and immediately noticed that the furniture had been moved so that all of the couches are now against the wall. Ok, it makes more space for the bar area, but it really didn't matter because it was so empty last night at around 10pm.  Not really noticing any difference, I ordered my usual, a french martini.  #1, they didn't have pineapple, which is a key ingredient... #2 they used pomegrante liquor instead of chambord and #3 they changed out their martini glasses for this curvy and MUCH smaller pseudo martini looking glass that more closely resembled a curvy margarita glass. My friend was so angry at me for bringing him to this strange place that we both didn't finish our drinks and left. His drink, a cranberry vodka with a splash of pineapple (but no pineapple) tasted like a freaking postage stamp.  So, what happened? After this dismal experience I probably won't be back, unless I absolutely have to go, plus it's off the beaten track. Oh and the music was just weird weird weird...", 
    "review_date": "2008-10-12"
  }
}