{
  "G95GgoECn_AhODMUkKRfTA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Sara K.", 
    "review_text": "Needed an arrangement first thing in the morning for a visiting client and was very impressed by the tasteful selection and friendly service- new to this neighborhood for work and am putting Rosebowl in my top five best things about the area!", 
    "review_date": "2011-10-09"
  }, 
  "s5NkP2hf0TfpiQ0rY-Vlug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob F.", 
    "review_text": "If Armistead Maupin penned another installment of Tales of the City, it would undoubtedly include this little gem that truly represents what makes San Francisco such a great city.    First, the business: floral design and fine wine.    Flowers.  After 30 years in the business, Diedre knows flowers.  Outstanding selection, highest quality, superb design. Why would you purchase flowers anywhere else?  Shipping out of state?  No one has better contacts.    Wine.  Come see for yourself the fantastic selection of zinfandels, cabernets, pinot noirs, blends, as well as a spate of white wines to boot.  These wines represent small, family-owned wineries in the Bay Area; come support multiple small businesses with a single purchase.  You will not be disappointed.    Need gift ideas?  Rose Bowl carries interesting and unique collectibles and other \"great finds\" that, well, you won't find anywhere else.  Truffles?  Wine Case?  Chutney?  Peacock lamp?  Diedre has it all.  And, finally, the atmosphere.  Come in on any given night during the week and there will be an assembly of characters exchanging stories at the wine bar located in the back of the store.  You could easily envision this crowd in a speakeasy during Prohibition.  There really isn't any other place like it in the City.    The number of places that truly feel \"San Francisco\" seems to be dwindling in all corners of our 7X7 plot.  Everywhere, that is, except Rose Bowl.", 
    "review_date": "2009-08-17"
  }, 
  "GhlufDB6nb9h_vmhMzpjtA": {
    "user_rating": 5.0, 
    "user_location": "STORRS MANSFIELD, CT", 
    "user_name": "Sarah W.", 
    "review_text": "I needed a couple  flower arrangements for a friend's city hall wedding.  The service at Rosebowl was terrific.  The boutonniere and bouquet were vibrant, cute, and ready on time. This is a dependable and high quality florist.", 
    "review_date": "2010-06-15"
  }, 
  "y3tGA1r-987rOe4_AFRtiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "john k.", 
    "review_text": "What a hidden gem! The Rosebowl is tucked away in Opera Plaza, neither wanting nor trying to be an \"attraction.\" Just an incredibly friendly, cozy, value-oriented spot to chat with new-found friends over glasses of surprisingly good (but unknown to me) California wine. Diedre reminds me why I love living in SF, and makes you feel welcomed from jump street. I'm torn about promoting the place -- because I'd love to keep it my personal secret -- but they're just too sweet not to share.", 
    "review_date": "2011-07-22"
  }, 
  "HoVOBhvoNnTC6wi1tvsV2A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M G.", 
    "review_text": "If you managed to find this place, you probably deserve to sit down and have a glass of wine (go on, do it...everyone else is doing it). I love everything about this place: the flowers are beautiful, the clientele cheery, the management funny and no nonsense, and the wine...the wine will blow your damn mind.  So go on, don't be shy, cozy up to the regulars at the bar and throw a couple back. They might even let you in on their snacks.", 
    "review_date": "2014-12-24"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "What a cool random place - a great combination of wine shop, knick knack shop, and flower shop. Very hard to explain. Old-fashioned - brings you back to the 80's. Love.", 
    "review_date": "2010-08-04"
  }, 
  "fl7LcvH14CpmWJtvAAOSyQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geezy L.", 
    "review_text": "I'm back, for some reason my previous post was flagged. but i felt my opinions must be heard. :)  So I'm going to edit my previous post.  i want to let everyone know that the $100 custom flower arrangement delivered to my girlfriend was cheap and close to crap.  i was at Costco around Valentines day buying groceries and saw their flowers for 7.99, which looked nice. I thought to myself. \"tomorrow my girlfriend be so happy when she sees her flowers. She's just going to love them.\" because I'm paying over a hundred and it's definitely going to look better than Costco flowers.  BUT!!!! the flowers that my girlfriend received on valentine's looked a lot worst. They were horrible i still cant believe that it was over a hundred dollars. The delivery called me like 3 times just to confirm the address. Which was not necessary at all but fine lets just be cautious, ill give them that. Over all it was a horrible experience  and i felt it completely hindered a special day for a special lady.    I'm going to upload the picture of the arrangement so everyone can judge for themselves what to expect when spending over 100 dollars at this flower shop.", 
    "review_date": "2012-09-23"
  }, 
  "sGYrxVCEJGGBArWI1LUgxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer O.", 
    "review_text": "The most beautiful and fragrant roses I've ever received came from Rosebowl Florist. A+!", 
    "review_date": "2010-03-31"
  }, 
  "brNtWc-w8AG5z48ean8M1g": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kimmy J.", 
    "review_text": "I needed a flower arrangement sent to an employee for a loss in his family. This employee has been with the company for a very long time so it was very important to me that these flowers showed our heartfelt condolences. I was referred to Rosebowl from a phenomenal florist in San Diego so I thought that I was in the right hands.  While placing my order, I let Deidra know how crucial it was that these flowers exuded class! (I spent $150). She seemed to be a little irritated. I felt uncomfortable with our conversation but decided that she came well recommended and she would deliver the goods.  The next day, after she sent me a picture, I was in shock!  I couldn't believe that this was a $150 arrangement. I called Deidra to let her know that I was disappointed but she did not seem to care and seemed stunned that I had expected more. She didn't even offer an apology, let alone a replacement bouquet..    You never get a second chance to make a first impression. Our employee probably thought that I was cheap and that his loss meant little to us.  I do NOT recommend this small flower shop.", 
    "review_date": "2011-11-10"
  }, 
  "cRt2mR3RZen-OkUYzAbfXA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nancy s.", 
    "review_text": "Gotta visit this amazing Civic Center gem, tucked behind a book store and Peets!    The wine bar is a great place to catch after-the-office an affordable glass, or half-glass, of the best vino with some interesting conversation.  Intimate, comfortable, surrounded by beautiful plants and flowers!    Need a gift for a friend or lover?  Something to make that someone special feel appreciated?  This darling shop has gifts and flowers that say \"I'm thinking of you (wink, wink).  You're special to me.\"  The cards are the best selection in the city--most are witty, some are touching in a not-sappy way.    This wine bar/gift/flowers boutique is what makes living in the city so much fun!", 
    "review_date": "2012-08-16"
  }, 
  "zElA4vbH2RzEdaQNhQHI6Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sheila T.", 
    "review_text": "What a cool little place! My husband and I went in here for a glass of wine after a movie and we think it's a really special place. She only sells unique wines from around California so it was really cool to be able to try a couple wines that I would never find in Bev and Mo or a local grocery store. She sells flowers too! And her arrangements were beautiful. I can't wait to visit again.", 
    "review_date": "2011-12-29"
  }, 
  "a2E50HoU89NLZvh1YP8fgA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marianne W.", 
    "review_text": "Small little flower and wine shop located inside the Opera Plaza. I'm not sure if a lot of people know of this place, but it's definitely convenient. They've got a bunch of assortments and the staff is super friendly.", 
    "review_date": "2010-08-05"
  }, 
  "Zcr90BeQ8QWV32XIqpH82A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake W.", 
    "review_text": "Well, my my. Sometimes there is a business for EXACTLY what you are looking for. My wife's birthday came around, and I was looking to make her birthday spent at a crazy  day of work special, if only for a brief moment. I thought about bringing her flowers or something like that, but she was so busy I might not have been able to catch her. I went to Yelp and on a whim I searched for \"Flowers and Wine.\"  The first result was Rosebowl--and my god it could not have been a better hit. This is a florist and a boutique wine bar/wine merchant. Are you kidding me?  I called and talked to Deidra the owner, who could not have been more fun to chat with. She listened to my description of the type of flowers and types of wine my wife likes, and boom, she came up with a package for her on the spot--orchids with a bottle of zin and a bottle of tempranillo. That's like a magical potion for pulling my wife to a happy place from the darkness of a stressful day. The package was delivered within 4 hours (probably less), and the wife is over the moon.  What a service.   Guys and girls, take heed--flowers are a home run every time, but flowers AND wine are like a home run with a stop at second base to pound a beer....ie, better. Now I just need to head to the wine bar to check this place out.", 
    "review_date": "2012-05-09"
  }, 
  "A_vqcbyCblt1NxRRHlkkyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "Love love love this place. Owner is the biggest sweetheart and makes the greatest floral arrangements ever. Love you, Deidra!", 
    "review_date": "2009-08-01"
  }, 
  "CgL_eFA6Y1ldf4ojpQrw4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terry C.", 
    "review_text": "Flowers + Wine = Something uniquely San Francisco!   If you are looking for a flower shop, you should look no further.  Diedre, the owner and a very lovely lady, knows her flowers.  Great selection, high quality, tasteful arrangements... you just can't go wrong.  Plus, there are tons of little gift ideas dotting the flower shop for those last minute gifts!  In the back, you will find an excellent selection of wines - zins, cabs, pinot, blends, and so on.  Most all of them are from smaller vineyards in California with limited distribution.  To top it off, Diedre has a wine bar in the back as well so you can taste these delicious wines!  I just found this little gem recently and I have visited the every enjoyable Diedre a few times already.  Almost always there is an eclectic gaggle of San Franciscans. Everyone is inviting, full of intelligent curiosity and conversation. Plus, there is hardly ever an empty glass.   I recommend a glass of the \"Educated Guess\", crack open some crackers and chutney (so yummie), and let the night take shape.  I have always left with a smile.   I know I have found my favorite Wednesday night spot! :-)", 
    "review_date": "2009-08-20"
  }, 
  "cMts4uQI_MvF6Smk2erBLA": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Virginia C.", 
    "review_text": "This review should have been posted a year ago.  Great service, beautiful flowers, and reasonable prices.  Keep up the good work!", 
    "review_date": "2014-10-02"
  }, 
  "GLEyB-t8moHQbRgEAeWnww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah K.", 
    "review_text": "Wonderful venue! We found this place using Yelp... and we so pleased with the service, wine, truffles, fresh flowers everywhere@! Usually the place closes at 8pm, we walked in (party of 7) at 9:15 and were served fabulous wine! I highly recommend this cozy, pretty place with fabulous wine that wouldn't be caught dead in the grocery store!", 
    "review_date": "2010-03-04"
  }, 
  "Eq5KlwxSrb9xn4gTiIkXPw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Charlotte H.", 
    "review_text": "If you want a relaxing and fun evening, go to the Rosebowl for a glass of wine, surrounded by interesting and unusual items for either sale or just enjoying.  It is an oasis in the Opera Plaza, behind Books, Inc.  I haven't purchased flowers here, but they look lovely, and I can attest that the owner is a sharp-witted, engaging woman.  This is a local's hangout, but frequently, you will walk in and it's virtually empty - depending on time of day.   I personally like it that way, but I don't want to be selfish - I think it's a place all will enjoy!", 
    "review_date": "2013-11-03"
  }, 
  "1nBy4fQsnbRuw7QSa_IdXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenya l.", 
    "review_text": "This is a special place. The authentic San Francisco kind, like the gone but never forgotten Tillman Place Bookshop. And the owner Diedre O'Merde's got the Herb Caen articles to prove it.  Part flower shop, part wine bar--they offer beautiful, long-lasting flowers and an impressive selection of small production wines (no bar codes) by the glass, or bottle.  Call to order flowers and they'll know exactly what you mean when you mumble, \"Dunno, she's Swedish. Likes yellow.\"  How that translates to amazing cornflowers, peonies and sun-kissed wildflowers is a mystery. They have a knack for making it seem like you really did know their favorites, then went to the ends of the earth to find 'em.   Even better, it's A-OK to say how much you want to spend, so being sweet doesn't turn into being broke. Ignore the photos on the website. Simple, pretty, hip, dwell magazine -- they got it, just without the nonsense.  The first tenant in the Opera Plaza 27 years ago (perfect for a glass of pre-movie wine), the owner 100% rocks. In fact, she's been doing just that since she hit town in the 60's to make music and get it all started.  ... And if you can't buy your flowers from an original SF rock chick, who'll give Stanlee Gatti a run for his money, share a glass of wine and stories sure to make you laugh, blow your mind or both--really, where can you buy your flowers? There aren't that many special occasions aftand paying her a visit is like a trip to Sam Adado's -- although it smells better ... and there's wine!!!", 
    "review_date": "2009-07-23"
  }, 
  "SKC5O-Hs2V2oCxT2z5gTxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "don h.", 
    "review_text": "This is a great place with wounder full people. Not just the people who work here but also the people who shop here as well. They have a great selection of flowers at a great price and can put together a selection that is perfect every time.   They also have a great selection of small production wineries that you can not find very often. They have a small tasting area and every bottle of wine they have they are willing to open for tasting by the glass (for a small fee)   I would day over all this is a great place to bring a friend when you want to chill after work or get a great selection of flowers.", 
    "review_date": "2009-08-21"
  }, 
  "zBc9PS0G00vGpYuQwLueiw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas B.", 
    "review_text": "Flowers and wine - who can possibly think of a better combination?  I'd always thought of this scenario ... you've pissed off your significant other in some way or whatnot, and it's time to go for the gusto, get that gorgeous arrangement of colorful and fragrant flowers that can only say, \"I'm so sorry, sweetie.  Please forgive me.  Can we at least snuggle?\"  So you're there whilst the owner - one Deidra O'Merde - gathers her floral elixir, and - what's that? - you see a wine bar!  Yep, there's a wine bar in this flower shop, and a good one at that.  Specializing in small-run California wineries (\"without bar codes!\"), they pour glasses by the taste, the half or the whole - and you can purchase bottles to take with that little bundle of natural beauty.  Whilst zinfandels are my fave, there're also syrahs, petite sirahs, cabs, chardonnays, Rieslings, desert wines, and champagnes.  I can't recommend this place enough.  The selection of flowers is so good, it's scary, they can always place a custom order, and they can deliver anywhere in the continental United States for a small fee.  Ask about \"Pornaflora\", if you want something a little ornery to send to your loved one or secret crush.  The gifts are great, too.  Now that the holidays are coming up, why not drop by?  Every Xmas there are always a smorgasbord of gorgeous ornaments available, there are gourmet chocolates and biscuits, smoked cheeses and sausages, and some pretty damn cool purses as well (I should know.  My mom's still going ape shit about the one I got her last February for her birthday.).  Check it out!", 
    "review_date": "2006-11-03"
  }, 
  "MmeLVyMQegDHmlCxyd-skA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry C.", 
    "review_text": "Rosebowl Florist and Wine Bar has the freshest flowers you will ever find in SF. I know for a fact that they are gathered from the Flower Mart every morning M-F. In addition, they are willing to deliver your well wishes, apologies, Anniversary or Birthday acknowledgements anywhere in the City. Now for those of you who have been especially \"Bad\" or need to be especially \"Good\", the local wine selection is fantastic and will certainly help get you out of the dog house along with some flowers or either a wonderful specialty gifts which are abundant in the establishment. Vist after 5pm for a glass of wine, yes, you can just buy a glass and have conversation with some very interesting folk.", 
    "review_date": "2012-09-14"
  }, 
  "nXsMrhO9c9dO--Jbi5CHYg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer T.", 
    "review_text": "Deidra O'Merde   I mean, how can you not love that she made her own last name? I'm not going to tell the story. You'll have to go there yourself and find out.   Made my flower buying an ease and gave me a story to share. How could I not love it? I'm definitely coming back to Rosebowl not only for flowers but to chat with the lovely Deidra.", 
    "review_date": "2009-06-20"
  }, 
  "wwgXWXzSmcTh_mk8QHsGXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dom G.", 
    "review_text": "I came here with the need to get a good beautiful bouquet within 5 mins .  I know that's a lot to ask but the lady who worked here, did it. it was quick, and beautiful ... the parking around the area is tough but I was glad that i stopped by here.", 
    "review_date": "2011-10-25"
  }, 
  "a4OLV02KhHM2KGL-Fw9hUA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jennifer N.", 
    "review_text": "going here is so convenient. this place has so much potential if there were more people that knew about this spot. its a decent size bar, what do you expect from san fran right? it does have a pool table and plent of seats. not much room for dancing but whatever you can go to a club for that. this is a great place to relax and have a few drinks without driving to far.", 
    "review_date": "2010-06-08"
  }, 
  "ahH6LNYBtRmvQl7YrJTtcA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rhiannon D.", 
    "review_text": "Dad bought mom flowers for their anniversary. When she brought them home THE DAY OF, they looked a week old. Two petals had already fallen off the main flower and onto our dining room table.   My mom said the roses were frozen when she got them.   The person that delivered them was neither rude nor friendly.  This place was recommended by a friend, but the experience my mom had was awful. She placed them next to the $5 safeway flowers that I had bought 2 + weeks prior and they looked in the same exact condition. I wish I had taken a pic.   I feel bad for my mom receiving these beat up plants, and for my dad, who I'm sure paid a lot for them.  1 star because the bowl stayed in tact. Which wasn't hard for it to do. Even tho it looks like a fish bowl bought at petsmart as a last resort.   1 star because I don't know the entire process since I wasn't there. Benefit of the doubt. You're welcome.", 
    "review_date": "2012-04-22"
  }, 
  "qSdYgBZy_je29J3lFLdNkw": {
    "user_rating": 3.0, 
    "user_location": "Inner Sunset, San Francisco, CA", 
    "user_name": "Lynn C.", 
    "review_text": "Came in here because we were just walking around. my bf loves plants and we went in and i saw wine bottles at the end of the store and a bar and i thought wow, this lady is pretty cool! she was on her lunch break sipping on a glass she was super funny and friendly. if i had a house and wanted some things to warm up the place id come here. there some cute knacks.", 
    "review_date": "2013-01-08"
  }, 
  "v4Fe5dM8h_bX-zmTYJMEpw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "m g.", 
    "review_text": "This is a very relaxing place to enjoy some great California wine tastings! The owner is very nice and knowledgeable about all the wines offered for sale and tasting. The tasting and bottle prices are very reasonable.  Will definitely be going back in the future!", 
    "review_date": "2010-12-12"
  }, 
  "a2X4NuXpwlaDSoRwJJaOiA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelli G.", 
    "review_text": "I can't believe it took me 15 years to find this neighborhood gem tucked away in the Opera Plaza.  Probably one of the few remaining spots with an authentically unique San Francisco vibe.  And the owner is on site to make suggestions and pour from the eclectic wine list.", 
    "review_date": "2011-07-22"
  }, 
  "Cgj-iIx0hLt9wJUWTKBU4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mister T.", 
    "review_text": "Deidra is simply the best- -in a town full of iconoclasts there are very few iconoclast florists- most are just rocking the same tired \"gas station\" and granny bouquets you could see in Bakersfield.  But THIS shop is different... small yet EXTREMELY WELL THOUGHT OUT selection of flowers that are EXPERTLY assembled. Deidra has a great eye for both the traditional and the unorthodox, without being weird. THIS is the shop I have been recommending to all my gay and lesbian friends now that gay marriage has been reinstated and NO ONE has been disappointed.   Plus, her flowers LAST...not wilted two days later!  On the flowers alone it's #1 in my book but then she also has a SHITLOAD of amazing wines she sells, with a small wine bar in the back of the store where you can sample the most imaginative local wines and cheeses.  They sell a bewildering array of gifts, everything from biodegradable umbrellas to cheese serving plates to feminist teas with racy cartoons on the packaging.  Can you tell I like this place?  Now...I KNOW WHAT YOU ARE THINKING.   Yet ANOTHER five star review?    Granted...giving five stars to everything ruins the legitimacy of reviews.  BUT the sad truth is that MOST reviews on Yelp seem to be haters.  The proof?  They shit on a place they don't like, but almost NEVER recommend where someone SHOULD go instead.     Sad, because a gentleman never complains without proposing a REMEDY.    So here is my REMEDY for all those boring flower shops out there: Rosebowl.  And I put my money where my mouth is every week here. I am flat out giving this five stars because I have tried every major florist in the city and this is honestly the best honest flower shop with benefits I have ever experienced. Totally worth checking out.  See you at the back bar, Trent", 
    "review_date": "2008-08-05"
  }
}