{
  "oMjMxpYR12LEXYu5m_rqmg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jeziell B.", 
    "review_text": "Been here twice, both after a night of drinking and dancing in the city. Don't talk to me, I am eating my burger. Small spot, sits about probably 20 people. Burger is so juicy and tasty, and I never usually crave burger, but Sam's is so good. Service is quick, and don't worry about the \"No Credit\" sign, they do take card. A small hole in the wall for sure, but definitely something not to miss.", 
    "review_date": "2012-06-08"
  }, 
  "sxIR0cNbNqWt4ZdNojGI_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul J.", 
    "review_text": "Best late night burgers and pizza in North Beach.  Crazy small. Asked the man behind the counter years ago what his name was and he said he was the owner and his name was Mike.  His son is there also. Nice, nice people.  The French fries are awesome.  Place is not for the faint of heart as it can get a little weird in there.  Everyone is served here so you may be sitting next to someone you might not ever choose to sit next to..... like a homeless guy but that is part of what makes this place awesome. I always make time to eat here when I am in town.  Bring friends and eat with a purpose. Space is limited.", 
    "review_date": "2011-09-02"
  }, 
  "fiTmv1osH12OEc2lCSzZKw": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Judy J.", 
    "review_text": "\"A Step back in time, late night burger heaven\" ~ OMG ... Who knew?  Thank you Anthony Bourdain !     We have walked past this place on Broadway for years and never gave it a second glance or thought.  Arrived after 2:00 am on a Friday night and were lucky enough to score a table along the wall.  The place was packed.  Quickly glanced at the menu and \"specials\" on the walls and was welcomed by the waiter behind the counter.   That guy was so on it !!  OMG !  Love Him !    What would you like mademoiselle?   We ordered one hamburger, one cheese burger, fries and a slice of pepperoni pizza.     Considering the place was packed and there were also phone orders coming in and walk-in's with to go orders... our order arrived very quickly and everything was piping hot and delicious.    Mike is truly a gifted cook and knows how to create the best burger ever!  We so enjoyed our visit and meal, we checked out Sam's again the very next night around 1:30 am.  Welcome back mademoiselle!  Love it ! This visit we sat at the counter and added a hot dog to our regular selections (one hamburger, one cheese burger, fries and a slice of pepperoni pizza).    It was so fun sitting at the counter.   WOW, taking it all in, so much to check out in such a tiny spot.  Let alone trying to people watch.  Ha!     Love the souvenir t-shirt they have for sale commemorating Anthony's visit to Sam's and the episode footage from Layover they have playing behind the counter.  You felt like Anthony was still there.      Our second visit, the cook Mike did not disappoint, once again everything was excellent.  Even the addition of the hot dog to our order lineup was yummy !   Next time I want to try the fried chicken and fish and chips.    Can't wait until our next visit to the city.  We are going to become regulars... I can just feel it.  Thank you for again for the best burgers ever and for making us feel at home from the moment we stepped in.", 
    "review_date": "2012-05-02"
  }, 
  "wVv8-yw8wlzDyYJMDEXFVw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elise G.", 
    "review_text": "Great spot for late night burgers and fries! Service was fast and friendly! The double burger w/ extra cheese and everything on it was so juicy. The fries were crispy, just the way I like them. My boyfriend, friend, and I ate every last crumb.", 
    "review_date": "2014-04-17"
  }, 
  "vTEquIJjSYUNVXGRmu7QwQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "S. O.", 
    "review_text": "2:30 Life saver. Best Burger and fries in North Beach.   This is not a yuppy $12 overpriced burger. This is a $3.50 handmade perfect creation. Mike is the man!Open till 3 this place always helps the cause.", 
    "review_date": "2010-03-28"
  }, 
  "aqRAXF6I58aQZ6SclHUwsg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wes Z.", 
    "review_text": "I used to love their burgers when my boy T work in there, I haven't been there for a while, but they used to have all kinda stuff, even steak dinner. So good. I would have to say over the years this place kinda gone down hill... Mike is getting old, he always gets my order wrong, but Mike's Mike, he's a great guy. Anyways, this is just a place for a quick bite, nothing special.", 
    "review_date": "2008-11-17"
  }, 
  "dFDR53m2ZxgoUniTHCvXEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mia C.", 
    "review_text": "Old school burger joint run by old school family. Decent prices for the neighborhood and there are always interesting characters around for some late night entertainment- Great after hours pit stop, the burgers are awesome and the cook is hilarious! Good food, good service= 5 stars from me!", 
    "review_date": "2014-06-09"
  }, 
  "zh0uKPOWk10rZJA79Y6MJg": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Jonathan C.", 
    "review_text": "Updated preface/background: I used to eat more than average in terms of quantity (I've eaten 2 Chipotle Burritos in one sitting) but now I am more focused on quality but am always looking for a great deal (read: value).  And my ratings don't really take service into account, although if it is a terrible experience, I'll make that known.  OK, I hardly ever give places 5s, but based on my one time experience here and the cheeseburger, I have to give this place a 5.  Came in here based on the fact that Anthony Bourdain visited this place, and also the recommendations on yelp.  Just so you know, I had just eaten a slice of Lagos pizza prior to getting the burger, so I wasn't starving at this point.    Rolled in around 9:30pm-10pm, and greeted the son of the owner (I'm assuming Sam) and ordered a cheeseburger.  They had Pursuit of Happyness playing at the bar TV (an old school 18\" tube mini-TV, talk about throwback).  I didn't have anything to drink at all that night since I had just gotten off of a plane, and I was just shocked at the taste of the burger.  It was juicy, cooked just right (not too well done, not too rare), and fresh off the grill.  It was a simple little burger, the patty wasn't too thick, and he asked me if I wanted everything on it?  I said \"ok.\"  I'm not quite sure exactly what \"everything\" was, but I figured I might as well try.  I *think* there was lettuce, and a tomato in it, as well as some ketchup and mayo.  Initially, I was thinking that this would just be one of those spots that was highly rated because of the sheer amount of drunk, post-bar-eaters who reviewed this place, but no, this place was really good to a non-buzzed, non-drunk guy.  The cook/cashier/one-man-show did mention that I came at a perfect time because he had just finished making the patties, but I'm not sure if that was true or if he says that to everyone, but I sure believe it based on the taste of the burger.  Overall, I'd come here again, and maybe earlier during the day next time.", 
    "review_date": "2011-12-29"
  }, 
  "XjgRM6a-GXYq7Mm8CwiLmw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alex Y.", 
    "review_text": "The setting reminds me of a Wong Kar-Wai movie. Everything was very antiquated and reminiscent of the 50s. I felt so badass in here because honestly, these aren't the type of places I would normally go to. I got fish and chips, which turned out okay, but it's not something you'd like to carry on with you on a crowded bus.", 
    "review_date": "2008-11-13"
  }, 
  "aHbxZxh8Vb8y_KzBaz4vUQ": {
    "user_rating": 5.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Mo O.", 
    "review_text": "Great burger joint! I do not recommend the fries, I had the double cheeseburger and it was real good! good bun, meat, with everything.", 
    "review_date": "2014-07-31"
  }, 
  "16p3QHTNAk8dDKVsv8eWdw": {
    "user_rating": 5.0, 
    "user_location": "Greentown, PA", 
    "user_name": "lee m.", 
    "review_text": "This was in the top 3 best burgers I have ever had the pleasure of eating,.. After having some drinks at Vesuvius (a nearby bar which also was a good time) we were told by some lovely locals that we had to try Sam's.. So we did,.  By the appearance some may think this place is just a hole in the wall grease pit.. It is a magnificent grease pit!! It feels like a NY pizzaria/burger joint in the 80's.. At night this place gets mobbed by locals and some curious tourists.. So seating at night is hard to find.. They had pizza and some other items on the menu..  I opted for the double cheeseburger meal with a bag of fries.. They just throw it in a brown lunch bag and the oil leaking through just adds to the whole experience.. I toted my bag of joy to the nearest curb and the only words I said while eating were \"Oh My!!\"  This will be my first stop next time I'm in SF..", 
    "review_date": "2012-05-31"
  }, 
  "IsHmmJ0N1dvGLVXpE8e7ZQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "J N.", 
    "review_text": "The burgers at Sam's are outstanding. Eat 'em sober, eat 'em drunk; whatever. I never really thought to go here, it just looks like some random greasy spoon. One time, while drinking at Vesuvio across the street, I suddenly had a serious burger craving and decided to give Sam's a try.   More than satisfying, the burgers here are among the best I've had, I kid you not. I actually like the decor and ambiance inside, it's just got that old school feel to it. Skip the pizza and go straight for the burgers. They're juicy and tasty. You can get whatever added to it: cheese, bacon, avocado, fried egg; or just stick to the basics. It's excellent however you like it.  The prices can definitely add up, I feel like it got more expensive after Bourdain gave them props, but it's really not bad. I've had much worse and definitely paid more. The joint is very small so it can be hit or miss. I've always found it to be a good idea to get my order to go, then head across the street to Vesuvio where I can knock down a couple beers while I'm at it.  If you're in North Beach, definitely check it out. If you're like me, you'll be returning for more and dragging your friends along with you.", 
    "review_date": "2012-05-10"
  }, 
  "hLZhIcq9qupYTeW5FHInEA": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Ryan M.", 
    "review_text": "Ant Man and co. dragged me out here after my encounter with Mr. Azul. Being slightly buzzed the drunken munchies are the next best thing to eating high class food at the price of \"free.99.\" Unfortunately it wasn't free and it costs me a good $13.00. The burgers...phenomenal (again call it bias if you will), but after handing my $20.00 bill and purchasing a meal for both myself and my old friend from long ago.  Sure the Cheeseburgers and fries were steep in price for $6.50 a combo, but man I couldn't get over the fact that this place reminded me of an old burger joint I used to enjoy way back when in my old high school days. So kudos to you for making me a satisfied drunk with a hearty appetite. Another surprising thought is that, when I saw the owner I could have sworn he was gonna serve me some Halal and curry, but the logical side got me to throw out that stereotype, once the food settled into my stomach. I just wish there was more seating because I felt it was cramping my style and elbow room.", 
    "review_date": "2008-12-27"
  }, 
  "4hVHTZhy70Sw4gmQfk1pJg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Gerald R.", 
    "review_text": "I went to this place about one week after the original airing of the Anthony Bourdain's \"The Layover\" in San Francisco. Ironically sitting next to me was the cop Sam from the R&amp;G Lounge in the San Francisco episode of \"No Reservations\". I ordered the double cheeseburger. When I was eating the hamburger behind me is an autograph of Anthony Bourdain. He wrote that the hamburger he had at Sam's was the top three in the world. Normally I don't write reviews on Yelp but his statement had me thinking about it. I'm not a burger aficionado. However about three months later I eaten several hamburgers after Sam's and I can tell the difference. First they individually make their own patties. The lettuce and tomatoes were crisp and fresh. And the bun was light and not stale at all. After eating the hamburger you don't feel sick at all with all that grease like most hamburgers. If I was really hungry I would have ordered another double cheeseburger. Prior to Sam's the best hamburger I ever had was in San Francisco Brewery Company, which ironically is now Comstock Saloon. I took for granted what a great burger taste like. In Sam's they take the three components (bun, patty, and lettuce and tomatoes) and turn it into a symphony of what a great hamburger should taste. In most places it's either one or two of the components that are done right but not all three, which is why I feel Sam's is special because they got all three components right. In addition their hamburger is not pretentious but straightforward like their place. I don't know if the hamburger at Sam's is one of the top three in the world as Anthony Bourdain wrote but I can say it is the best in San Francisco.", 
    "review_date": "2012-04-29"
  }, 
  "X9i6K1Cgg8Pp-nS_gW_c0A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa S.", 
    "review_text": "I usually only like to write positive reviews to help boost businesses I think deserve it, but I am so disappointed in the service here I just have to warn others.  I have worked in food service, customer service etc. so I can sympathize with someone who is working by themselves having to serve the late night drunk north beach crowd on a saturday night but when my friend i got there it was maybe1230 tops, not that busy and we had only had a couple of beers.  In my opinion, the guy behind the counter was on some bizarre power trip only helping his friends and making people wait outside when there were open tables.  We were \"lucky\" and had seats at the bar, but he proceeded to serve all his friends first purposely ignoring us for no good reason.  The only thing that kept me from walking out was that the burger was ok and the other customers on either side of us who knew him were friendly to us, even though he wasn't.  But in all honesty, not worth it at all.  I love Anthony Bourdain, but I'm going to have to disagree with him on this one.", 
    "review_date": "2013-10-21"
  }, 
  "0fKUzB5SPqtNEb7NQLdAtw": {
    "user_rating": 5.0, 
    "user_location": "Wichita, KS", 
    "user_name": "Dustin W.", 
    "review_text": "Anthony Bourdain was right! This was an amazing burger. Coupled with the fact that Sam was such a nice guy made for a really cool experience. I would say this is a must for anyone in the area!", 
    "review_date": "2014-07-21"
  }, 
  "YBGfvXanJqoF2zA2C7kTWA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Irene P.", 
    "review_text": "I went here having an open mind and didn't know what to expect. All I know is when I walked in it smelt sooo good. I seriously thought it was a sit down place, but really it's more a place for to go unless you are by yourself and wanting to eat with a few tweakers at 1am. LOL BUT the food was fab...absolutely fab! I would defiantly come here again, the double burger was delish! What also made me laugh was the red plastic cups that was served as my drinking cup...felt like I was at some house party for a second. ha The cooker was cute as well...so over all it was one AWESOME experience.", 
    "review_date": "2011-01-18"
  }, 
  "WI9UJah3bVB258wzEIh34A": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kate K.", 
    "review_text": "Here is the complete truth about Sam's: - I do not remember being here this past Saturday evening... uh, er... Sunday morning... do not remember it.  Not a bit.  Apparently I fed a a. fries and fish... apparently there was a near altercation with some North Beach douchebags on the street... a lot happened while I was apparently at Sam's this past Saturday evening... which is blurry at best.  BUT - I do remember being here w/my Evil Ex and adored little brother almost a year ago.  It was greasy, drunk food bliss... mmmm... fries and ranch... mmmm... onion rings (they have onion rings, right?  Sure they do.)  Cheap, close to home, open until the wee-wee-WEE hours... divine.", 
    "review_date": "2007-05-01"
  }, 
  "LeK_K8yS6p2zOhl_8AzCxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny C.", 
    "review_text": "I've been here multiple times and always enjoyed the food. I usually prefer some My Canh or Sun HK after a night of clubbing because I love the soupy stuff, whether it's pho, porridge, or bun rieu.  I've ate Sam's sober as well so I know it's pretty good, in fact I am craving for some right now but I will try to watch my diet when I am sober ;) Sam's is open late, so you can grab a bite after the clubs here. The owner is very nice and friendly. They only accept CASH people so remember that. I usually get the cheese burger with everything and extra onions.  <a href=\"http://www.yelp.com/biz_photos/U768gBDU8XM3_cr-yJxwvg?select=E_OZ54s8URGz0d3xLG6ISA\">yelp.com/biz_photos/U768…</a> I mean, it's not gourmet, but it is definitely a pretty good burger. Please remember this is a fast food joint at a very low price. They don't have pickles, which is a plus for me cus I don't like pickels. =P I had their cheese fries for the first time on Saturday nite, OMG it's so delicious! Some hot fries with melted American slices uhhhhh so good! I want some right now!! <a href=\"http://www.yelp.com/biz_photos/U768gBDU8XM3_cr-yJxwvg?select=6iUCmyWY2UfppWZBo0fKKA\">yelp.com/biz_photos/U768…</a> Bf had the grilled chicken sandwich and smothered it in ranch. I didn't try it. <a href=\"http://www.yelp.com/biz_photos/U768gBDU8XM3_cr-yJxwvg?select=1PSObJ9SaUgCVFVf5DMegA\">yelp.com/biz_photos/U768…</a> I've been coming here and I definitely will be back. I just wish I could eat whatever I wanted without worrying about fitting into skimpy dresses, cus then I will visit more often for sure!", 
    "review_date": "2011-06-13"
  }, 
  "iflEFcU3QJMEB9YFAsv72Q": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Mike U.", 
    "review_text": "drunk as i'm writing this...sam's has great, greasy burgers, hot fluffly fries and a hot link sandwich that goes great to settle the liquor in my belly.  ok, so the burgers were from memory, but the hot links and siracha sauce were touching my lips not twelve and a half minutes ago.  and apparently, it's the place to buy liquor after two, cuz while we were there, a bunch a people came in to buy six packs and bottles of wine.  aw man, i am so gonna be regretting this in the morning, but f*** it, it was fun and i liked it.  Morning Update: Yup, feels like a delicious rock is sitting in my stomach, but no hangover so I feel like I'm breaking even.", 
    "review_date": "2007-12-08"
  }, 
  "J70DIRc_JYWfkEX6FT8rTw": {
    "user_rating": 5.0, 
    "user_location": "Presidio Heights, San Francisco, CA", 
    "user_name": "Marisssa K.", 
    "review_text": "I only ever get the house special (hamburger, fries &amp; a coke) when I'm here, so I can't speak for anything else on the menu, but every time I come here, it's always a great burger. Always.   Totally awesome old school joint. Still has the same cash register and phone from when it opened. Tiny, but way cool.   Cash only, though!", 
    "review_date": "2014-09-15"
  }, 
  "9cDUn6mdkddC4Vudj7j9Ag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brady T.", 
    "review_text": "Cheeseburger with the works. I don't know what they put in there, probably something toxic, but damn! That is one good burger. Seriously, bread looks normal, mustard, ketchup all looks right. Cheese, onions seem to be free of addicting chemicals, but there has got to be some secret ingredient that I cannot find that make you completely hooked. It's a mystery and I obviously need to go back to do some more investigating.  The place is a dive, a few dodgy looking characters, but hell that's just keeps it all exciting!", 
    "review_date": "2008-04-07"
  }, 
  "IsUGBAY-CebPGHVYLe-_Hw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Christine N.", 
    "review_text": "Open til 3AM. Great burgers and pizzas. You definitely want to get your own burger because your drunk friend is gonna be like \"ohh im not hungry and i have to watch my weight\" and then you order a burger for yourself and 5 min later they asks if they can have a bit and they end up eating the entire thing.   you gotta eat standing sometimes because the place can get crowded and there's limited space for seating.", 
    "review_date": "2007-09-30"
  }, 
  "EuuyiAuEa_s3VSS9i8okmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah F.", 
    "review_text": "Stop it!  If you've never heard of/ been to Sam's, you are truly missing out.  It is a perfect place to go late night.  Super small place, stools to sit at the counter, and a few 2 top tables to park it.  Greasy diner food.  I usually go here after going to Rosewood, which is down the street.  Anyhow, get the cheeseburger.  It's hot, heavy, cheesy, and greasy.  Perfect to soak up all the alcohol in your system.  I have also had the chicken nuggets and fries, but the nuggets were very very dry.  The pizza is not the best, but again, it's late night drunk food.  The guy who cooks and his son are hilarious.  If you are germ-a-phobic, this is not the place for you.  Also, they only take cash.", 
    "review_date": "2008-01-29"
  }, 
  "eeI4DVW43NLBlo6nFkcANw": {
    "user_rating": 3.0, 
    "user_location": "Novato, CA", 
    "user_name": "Eric L.", 
    "review_text": "Sam's is indeed a great place to get an inexpensive bite after boozing heavily.  I stopped by for a quick bite after wandering in and out of Chinese restaurants and bakeries along Broadway.  My stint at Rosewood had me hungry for something with melted cheese (grilled cheese, nachos, pizza, and carne asada fries all would fit the bill)  The first thing I noticed when I walked in was that Sam's is dive as hell, but that's OK because they had a little bar where you could sit at which gave it a mom and pop diner feel.  Sam's had some inexpensive pizza by the slice that I decided to give a try.  I got a couple slices of cheese, it was alright but underwhelming considering my level of drunkenness.    After reading through some of the reviews on Yelp, I think I may have made the wrong choice.  Their burgers sound delicious, greasy and amazing.. Greasy burgers in a belly full of booze sounds pretty soothing too, so I'll have to try it next time I'm at Sam's.", 
    "review_date": "2008-08-24"
  }, 
  "75OBxtyITK3O0JofLsAYVg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry H.", 
    "review_text": "Mike no longer works here. The older man with the mustache. The food is still good. We are talking about burgers and pizza all served on a paper plate in a restaurant. I love it.", 
    "review_date": "2013-09-24"
  }, 
  "dHwXiCnCCMzIn0mqgiptfg": {
    "user_rating": 4.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Blissful U.", 
    "review_text": "Ok so I heard about this place from Anthony Bourdain's Layover. I loved the episode where he visited SF, and his stops offered me some new options for eating and watering holes.  I love learning about late night places to eat, especially burgers!  There seem to be a lot of places that serve late night pizza, so a place that makes fresh, fast burgers is a welcome treat.  The burger was great! It tasted charbroiled and they use sesame seed buns that I prefer on my burgers. It was hot, made to order, and they got my order correct (no onions, no mayo.)  I took away a star because of one reason:  When he asked if I wanted a drink, he grabbed a cup and put ice in it, but I needed a non-soda option, so he had to dump the ice back out and was quite irritated. They don't offer anything non-soda on tap (lemonade, tea, etc.) so I took a Snapple. Don't be mad at me because I don't drink soda. Ew. I know it can get busy, but thats the nature of the beast.   Other then that, I was very pleased with my experience, people (customers) were in good moods, it smelled wonderful inside, and my burger was juicy, charbroiled, and slammin. I'll be back Sams.", 
    "review_date": "2012-02-26"
  }, 
  "I1dKh4olStlU7i-hEi4_TQ": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Irene L.", 
    "review_text": "Stopped in a for a quick bite. This little hole in the wall burgery joint is kind of very easy to miss. However, their (steak cut?) fries are good and it's got this \"everyone knows your name kind of feel to it.\" However, didn't really appreciate the restaurant affiliated people smoking RIGHT OUTSIDE the entrance so everything was just blowing back in, which made just smoking outside a futile effort in trying to be \"law abiding.\" Eh, whatever. But overall, a plate of fries and fried chicken is about $6.50 a nice little snack on a SF excursion. =)", 
    "review_date": "2008-10-05"
  }, 
  "S4Vvvl-aCVkBv7jSaHYzrQ": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "nader d.", 
    "review_text": "Best way to end a night on broadway. Good service and good food.", 
    "review_date": "2011-10-28"
  }, 
  "ssh5lssdkhoWhfOCnX2SXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maciel C.", 
    "review_text": "I'm actually quite impressed by their pizza. While its neither a thin crust nor a deep dish, it's got loads of cheese and really good sauce.   But its the burgers that make everybody go back I guess. That and its right next to all the strip clubs and it closes pretty late. Meat in buns is quite a good business after you just spent $100 on lap dances...", 
    "review_date": "2013-07-09"
  }, 
  "TSjH8J442lOuB-usd6g54w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel S.", 
    "review_text": "This place is a total hole in the wall but it is a great place for an inexpensive (in San Francisco terms) delicious burger. Sam's son was at the grill - he's a master at juggling burger making and chatting the clientele. Grill smoke get to you? Take your burger to-go and head over to Washington Square Park.", 
    "review_date": "2012-07-16"
  }, 
  "v7g_pNqID1R288cu0xFjsw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "yusai g.", 
    "review_text": "My review may be some what inaccurate since i have never been here, other than after hours.   This is probably why my rating is at 3 stars (i really want to give this place a 2)... I say this with sincere honesty because everything taste GOLDEN when you are over your drinking limit.   Sam's been around for as long as I can remember.  This used to be typical tiny whole in the wall, until it was made famous by Anthony Bourdain, claiming it as one of the best burgers spots in the city.  You would know Bourdain was drunk when he said that... watch any of his shows and you'll know what i'm talking about.     Anyways back to Sam's... decent burger, yes, amongst the best burger spots in SF, probably not.  They also serve very unattractive looking Pizza slices (order them at your own risk) but anything goes when you're drunk and looking for something to eat on Broadway.  I'd probably recommend it if you're looking to get quick bite to eat, after a night of drinking.  However this is probably not worthy of a visit if you're looking to come just for the burger alone.  There are many other alternative locations in the city for that.  Side note: Let's all thank Bourdain for driving up the menu price up a little.", 
    "review_date": "2014-01-25"
  }, 
  "FI0dcCAuFmW0lutdKO2UwA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle K.", 
    "review_text": "I've eaten here at least a 50 times over the years and finally I'm going to give my 2 cents on this dump.   Actually if you EAT IN the burgers and fries are often pretty good so my one star doesn't completely reflect on the food.  Just know that taking a burger home just turns to a sloppy mess.     They have been shamelessly milking a late night drunken visit by Anthony Bourdain who allegedly liked the burger, for many years now.  I've heard AB say this same thing about 200 burgers he's eaten drunk.  But here is the real problem with this place: They aren't honest.  I'd say at least 80% of my visits result in overcharges between at least 1-4 dollars.  That's right.  The young guy especially there always just makes up random totals.  It will ALWAYS be more than you really owe.  He will attempt to make you feel cheap if you question his math.   He will tell you the posted prices are, 'old'.  If you are drunk, he will definitely try to steal more from you.  Just watch yourself here, the biggest crooks in this shady area of north beach aren't on the streets - they're behind the counter at Sam's.", 
    "review_date": "2013-10-02"
  }, 
  "A4YadTqFx7o3rtgCYM8eZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle U.", 
    "review_text": "Great place for a quick, uber casual bit......the cheese burger and fries a must.   Do not come in thinking it is going to be this hip, swanky and fashionable place.  What you see is what you get.  But you will not be disappointed.", 
    "review_date": "2009-11-09"
  }, 
  "Uz0vP02mHj_6_j0PwhtvZw": {
    "user_rating": 1.0, 
    "user_location": "Danville, CA", 
    "user_name": "danielle p.", 
    "review_text": "I wouldnt even give this place one star..the food sucked and the service was even worse. I will never come back. Yuck!!!!", 
    "review_date": "2014-09-06"
  }, 
  "siolCj8nH7Vr6L4rkd28LA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Irina L.", 
    "review_text": "The burger was delicious. However, the anti Semitic a hole that made my burger said I would be served last because I was a Jew.", 
    "review_date": "2013-10-18"
  }, 
  "HYQoxBC1y1DGPq6pGP09Tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "Sam, the chef and proprietor, has been operating this little burger place and serving the North Beach party-crowd for over 40 years. This place is only open for dinner. Before many neighboring restaurants opened and closing late, Sam's diner was one of the original \"hole in the wall\" business in North Beach to open to the early morning. His picture of his grand opening in 1968 is proven evidence too.   I infrequently come to the North Beach/Chinatown area in the evening. And just like everybody who reviewed this small place when he/she is drunk, I have joined the crowd when I came here after a \"get together\" at a bar nearby.   When I walked in, I saw a banner of his special for $6.99+tax. I get a cheeseburger, fries and a fountain soda. All the burgers are cooked in a flamed grill. The burger is greasy and cooked just perfect. He is very talkative and enjoy telling stories of North Beach of the yester-years. Stories of the past are priceless and I love listening stories of old San Francisco.   My meal: <a href=\"http://www.yelp.com/biz_photos/U768gBDU8XM3_cr-yJxwvg?select=g3ovjRPSnEe7lGrkgH2P2A\">yelp.com/biz_photos/U768…</a>  This is a old-school diner with Sam is still operating an old-fashion cash-register (meals are cash only).   And this diner is one of only a few places that Sam still answer phone calls with a rotary-phone. \"Do many of you know what a rotary-phone look like?\"", 
    "review_date": "2010-03-04"
  }, 
  "IsKKbhNW_IG3n8FxNV2qLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cin W.", 
    "review_text": "Still coming here and still loving this joint!!  BEST CHICKEN SANDWICH ever!!  For all you peeps that party on Broadway....grab a bite to eat here after the party---you will not regret it!  Burgers, polish dogs, everything is great here.", 
    "review_date": "2011-11-18"
  }, 
  "6-AqJH4LlZBidRJbgUFeWw": {
    "user_rating": 3.0, 
    "user_location": "North Highlands, CA", 
    "user_name": "Tom F.", 
    "review_text": "This place was decent before the bourdain visit, but since then it has totally gone downhill. If you come in here after a night of drinking make sure you check the price on the menu matches whatever they charge you , the younger guy that works there tends to charge randomly high  prices . last couple times I was there burger was soggy , &amp; awful , didnt even finish threw it out. fries tasted freezer burned &amp; oil hadn't been changed in a long time.  Used to come here a lot but those days are over, its recent popularity did it in  side note: i have seen a person get pizza here one time, &amp; it looked quite horrible, especially considering theres like 5  pizzerias within a few blocks of here", 
    "review_date": "2012-02-25"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "literally a hole in the wall....yes..literally....when needing a solo or duo grease fix...sam's is there for the late night patrons in northbeach....have a seat on the stool....order yourself a burger or fried chicken.....it's greasy juicy messy good....mostly solo diners at this dive joint......locals....mostly friendly....some crazy....some drunks.......depends on what time of the night you go....  *pass on the pizza....it's called \"sam's pizza and hamburger\"...but it should really be called sam's fried chicken and hamburger.....warning..this is dive as you can get.....", 
    "review_date": "2006-11-12"
  }, 
  "GABWrw5Et9jubriKwMUDbw": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Sara P.", 
    "review_text": "Great place if you're in the mood for burgers/pizza/beer. Even though its in the middle of North Beach, it feels like you are in a small town! VHS tapes to play on the mini TV, beer posters and quick service.", 
    "review_date": "2009-09-28"
  }, 
  "aMsvmTojLi7g1Se-MEmG4w": {
    "user_rating": 5.0, 
    "user_location": "Nashua, NH", 
    "user_name": "Patrick S.", 
    "review_text": "This place was a staple for delicious late night burgers while I was staying in the nearby hostel. It's cheap and extremely delicious. Just thinking about it makes me angry that I have no similar option close to me.", 
    "review_date": "2009-11-14"
  }, 
  "2gP8s5dOJmwVKVm0GNMU0w": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Sunni B.", 
    "review_text": "drunkenly stumbled in here.. i dont know if it was the alcohol that fell in love with their burger and cheese fries but i have a feeling i would like it just as much sober. cheese fries arent on their menu but i ordered some thinking they had them, and the guy actually made them for me. might i say that were SO good too.. he even put seasoning and everything. this place could turn into a bad habit cash only !", 
    "review_date": "2012-03-24"
  }, 
  "QOiZu9pn65H7zR49_DdVdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony R.", 
    "review_text": "Sam's Late night. Poppin. Bagged Sesame Seed Bun. Crispy Fries. Notable Char Flavor. 2 Cheeseburgers. 2 Beers. 2 Fries. $30 w/tip. Food always tastes better when you're sitting on stools.", 
    "review_date": "2012-05-06"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "My thoughts just now:  Sam's?  I've been there?  Why did I bookmark this place to review it?  Then I looked at the picture and it all came back to me....  So, that should kind of speak for itself.  In case it doesn't, keep reading...  Like most of the other reviewers, I came here after I'd been drinking a bit.  We went over to Tosca's and asked for a recommendation.  He suggested this place.  I have no idea why though, it can't possibly be because it's really awesome food... because it's not.  Anyway, I had hopes that maybe this was one of those rare hole-in-the-walls with really great food... but again, it's not.  It's just warmed up frozen food.  You can wait ten minutes and make it yourself at home.", 
    "review_date": "2012-03-10"
  }, 
  "DVqDPgqoELHBuISm_IGuSA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jules P.", 
    "review_text": "If you like a good old, greasy, tasty burger when you're drunk, this is the spot. I honestly couldn't tell you if they sell other types of food there.", 
    "review_date": "2014-10-26"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "the 5 stars are for Will, who spotted me $20 last night so that i didn't have to go to an ATM, Will doesn't even work there but is a regular customer.  Thanks Will, i'll get you back next time!", 
    "review_date": "2009-01-10"
  }, 
  "V5ThLDH14nvH5O_mIkWd_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Alex G.", 
    "review_text": "Everyone has a plan, and then they get punched in the mouth by a Sam's burger.  Damn it was good.  10 minutes of pure bliss.", 
    "review_date": "2012-08-08"
  }, 
  "ug6cvFFsAB2gNlUkacD-BA": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Firas A.", 
    "review_text": "Under rated if you think it's a 4 star.  5 star all the way baby.  Best damn hamburger in the city.  Fast and good.  If you find a better burger, please let me know.  Sams drunk or not, still the best.", 
    "review_date": "2014-12-21"
  }, 
  "KSDFSFW7z4L9dsv_8LwQnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Randy N.", 
    "review_text": "Definitely a really tasty burger!  Add avocado of course.  I really enjoyed the quaint diner feeling that you get inside of Sam's.  The fries while nothing special on their own, really compliment the burger well.", 
    "review_date": "2012-11-17"
  }, 
  "60iCXLkb9xqhe5cvEun0kg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher K.", 
    "review_text": "It's like a little slice of midtown Cleveland was deposited into our fair coastal town.  Sam's was probably opened somewhere around 1954. The only change I've noticed is that they finally updated the little blurry TV to a modern LCD version. That's perfect for sharing a conversation about how the Browns still can't play football with the crazy locals sitting next to you.  The only food you should order here is the burger. The grill, also never updated, is now seasoned to perfection and produces some of the finest quick eats you'll find.  Worried that this place is a little too close to the sketchy part of town? Fear not. The employees here are some of the fiercest city proprietors in town. Show up too drunk and rowdy, they might bounce you outta there too.", 
    "review_date": "2010-06-25"
  }, 
  "0Cvgx6MKrSOTUxGoUpdaTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison T.", 
    "review_text": "Sam or Mike...I know you guys were messing with me the other day.  Now this is was I call service with a smile.  Past 2am this must be the only place where the people aren't grumpy and wish you didn't walk in for food.  I usually order the pepperoni pizza....ok so I'm just there for the pepperoni.  Not too bad even though half the time I am pretty wasted.  Come by if you happen to be drinking on Broadway.", 
    "review_date": "2008-07-29"
  }, 
  "71FtWG7LpdDFL1r-0rSCJg": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Robert L.", 
    "review_text": "Good Hamburger and Fries.  A small whole in the wall place that has been there for decades. Quaint or do you say old? I didn't see any other burger places in the area and was happy I picked them. Nothing super special but tasted good to me. I would go there again for a burger.", 
    "review_date": "2013-04-12"
  }, 
  "eqE-ciL8wP2ONkdLySoBlg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "SHOU LIN C.", 
    "review_text": "Came here kind of tipsy on a Wednesday night and even though I ate at two other places that night I was still hungry.  I wanted something substantial. I wanted burgers.   Real food.  And I happened to be a block and a half from Sam's so we decided to check it out.  Surprisingly empty but they have a ton of to go orders.  I ordered a cheeseburger and said no to ordering fries.  It seemed the to go orders had first priority but it wasn't a long wait at all.   Anyways my cheeseburger came and the nice guy who made the burgers also just gave us fries on the side!!  Awesome!!  =]   I bit into the burger...delicious, juicy, and perfect for a late night drunken food binge.   It hit the spot.", 
    "review_date": "2012-02-02"
  }, 
  "RhjMTy88G_S8HWZc3vJJ5g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alan C.", 
    "review_text": "Damn fine late night burger.  Cheeseburger, fries, and a soda runs about $9, which is a reasonable post-happy hour price for dinner.  I'd recommend that anyone looking for a basic, delicious hole-in-the-wall burger stop by here for some simple goodness.", 
    "review_date": "2013-11-27"
  }, 
  "GVeOyQJ1uTKvxNF-9d6eFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mike m.", 
    "review_text": "Love this place. Drunken debauchery amongst the bridge an tunnel wannabe gangsta's of broadway. Super cheap greasy burgers cooked to order. Get a beer for $3 while you wait. It doesn't get much better than this.", 
    "review_date": "2008-07-31"
  }, 
  "feJ8uK3K7YNV0-88eYZX-Q": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Roman S.", 
    "review_text": "Ok prepare yourself... this is no frills, hole in the wall short order stuff... but goddamn, after a night or drinking Sam will serve up a GREAT cheeseburger,and they have orange Fanta on fountain!  Entertainment courtesy of drunken arrogant Brits (which the cat behind the counter dispatches with aplomb).  It's a dive, but damn it has charm at 0200 when I'm loaded and hungry.", 
    "review_date": "2005-07-07"
  }, 
  "5Si-3Rt03p8r7fGYd-1EVw": {
    "user_rating": 5.0, 
    "user_location": "Wallingford, PA", 
    "user_name": "John L.", 
    "review_text": "Yes I went here becomes of Anthony Bourdain, and yes its very un-yelper like of me to do so. But wow is this place the best place in the world!  The burgers are awesome, and you can actually still taste the meat unlike most places. The price is extraordinary, and coming from Philly the mere fact I can have a good old beer in a place like this without feeling like a bar is just awesome! Drunken Sam's style is back baby!", 
    "review_date": "2012-09-25"
  }, 
  "3IBoCe--upk24sxjM-xcxA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John R.", 
    "review_text": "Sam's Pizza and Burgers...I have finally found my favorite old school no frills SF grease burger diner in the city.  It rocks!  Had a few drinks (responsibly) in the North Beach area, and had ended up missing dinner, so at the end of the night, going off some recos and word of mouth, decided to swing by Sam's for a late night burger and fries meal.  Now just as I mentioned earlier, this is a no frills old school super small diner.  But it is great.  They have all they need there.  They know who they are, they know what they do, and they do it really well.    Had a cheeseburger and fries ($9).  And now 24 hours later, I'm still thinking about that burger.  It was delicious.  Now I normally opt for the big fat and juicy gourmet burger, but come on, everyone needs a skinny grease burger once in a while.  I only got the single, but I'm going to go back and checkout the double cheeseburger for sure. I'm sure it will just be twice as good obviously.   So I'm keeping it simple for this review. Just head in there for a late night meal. Sit at the counter, maybe have a beer if you want, do a little people watching, chat with the cook and enjoy an amazing burger and fries.  I trust you won't be disappointed!", 
    "review_date": "2012-09-07"
  }, 
  "oJCYp56IEIXxYWad3ZlWWw": {
    "user_rating": 5.0, 
    "user_location": "SAN PEDRO, CA", 
    "user_name": "Maria L.", 
    "review_text": "Hole in the wall that has outstanding burgers ! He makes them right there in front of you! They were sooo good we will definitely be back here. In Chinatown it's hard to find hamburgers n this is at the end of it. Sooo happy we went here", 
    "review_date": "2013-05-30"
  }, 
  "LlzQJJbS_JxKVVBgnoncHg": {
    "user_rating": 4.0, 
    "user_location": "Hong Kong", 
    "user_name": "Helen Y.", 
    "review_text": "Stopped by for a quick bite to eat and ordered the hamburger with cheese to go. We watched as Sam took out the beef patty, pressed it to shape and then started grilling it. The smoky smell instantly infused the room, it looked so mouth-watering and delicious it almost made the five minute wait excruciatingly long.  I couldn't wait to get my hands on the burger. He put mayo, mustard, tomatoes, lettuce and raw onions in our burger, and skilfully wrapped it in silver foil..   The burger was almost as big as my hands. It was juicy and original, and biting a freshly made burger on a cold, chilly SF night is simply the best, hands down. Sam, you have got yourself yet another loyal customer!", 
    "review_date": "2010-12-01"
  }, 
  "k-9shdCguXxefBeMcj4CRA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeffrey J.", 
    "review_text": "I'll admit, I ended up here with friends solely on Anthony Bourdain's experience on the San Francisco episode of The Layover.  It's a small old time diner that serves burgers and pizza. Didn't get the pizza but opted for \"The Bourdain Special\": Cheeseburger, Fries, and a Beer. (I got an Anchor Steam).  All you need to know is it's open very late, serves a no nonsense hot and greasy cheeseburger when you need it most (i.e. after you've stumbled in and out of a Chinatown/North Beach bars). I'm a mayo with fries kind of guy too, and they certainly obliged with giving me all the mayo I needed. The fries weren't the best, but they were freshly fried and piping hot, so no complaints from me.  Certainly a place I'd go to again and again under the right circumstances.", 
    "review_date": "2013-12-10"
  }, 
  "LfBtWyBPUL-CQBigmb7bqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris M.", 
    "review_text": "Best burgers in town.  I love them.  Never had anything other than a double cheeseburger, side of fries and a coke.  Go after a hearty round of drinkin'.", 
    "review_date": "2007-08-14"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "My friends and I went here on 3-19-14  1am'sh.  I ordered the hamburger with fries and a coke.  Better than decent burger and fries just melt in my mouth. One of my friends, his former student lived just around the area and mentioned this joint, since it was close to scores bar.", 
    "review_date": "2014-03-19"
  }, 
  "Zk0RGkhWxcSlbsRzpu3DmA": {
    "user_rating": 1.0, 
    "user_location": "Seattle, WA", 
    "user_name": "dan d.", 
    "review_text": "I ordered a cheeseburger and then watched the cook chop little holes in the patty with the tip of the spatula.  I'm not sure what that supposed to accomplish - besides allowing all of the juice to run out.  The fries were awful.  The only reason they're still in business is because drunk people need to eat too.", 
    "review_date": "2010-02-28"
  }, 
  "-Kx16nke0CB7NqImR5IQ5Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sa V.", 
    "review_text": "I have lived in San Francisco my whole life and Sam's burger is the place to go when I have no where else to go and even if I did have somewhere else to go, I WOULD STILL GO TO SAMS.  Since a child the prices have barely changed.  The burgers and fries are fresh and the pizza is good too.  I literally live 2 blocks from this place and the food there does everything it should.  Fill you up, taste amazing, and make you want to come back.", 
    "review_date": "2011-09-23"
  }, 
  "wRflYcdeaiXE222-hFspdA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt J.", 
    "review_text": "I've had some pretty tasty burgers in San Francisco, but this is one of my favorites. It's a fine slab of cow with the right amount of greasiness that any burger connoisseur can appreciate. Also, It's a good price for a great burger.", 
    "review_date": "2012-03-22"
  }, 
  "o5STsEtfvD1Ig0J7Z-1uxA": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Alex L.", 
    "review_text": "Look up greasy spoon and you'll find a picture of Sam's. Or at least, you should. But that's not a bad thing. Oh no. Sam's is the diner equivalent of the best kind of dive bar. You keep coming back because it's cheap and satisfying and memorable.   Sam (or whoever the friendly chap is behind the counter personally cooking each order) has no reason to advertise or brag about his product. It sells itself. It's a big, juicy, perfectly-seared piece of meat with all the appropriate fixings. A steaming hot and oily plate full of onion rings is the perfect complimentary side order. Something about eating this burger while sitting at the narrow, greasy counter and watching the game or scoping the yellowing memorabilia on the walls makes me incredibly optimistic about the human race.   It's good to have a friend in San Francisco. I thank my nighttime adventure partner Jon for introducing me to one of the tastiest no-frills burgers I've had in a city already filled with an exceptional selection of burgers.   P.S. I find it ironic, by the way, that a previous reviewer decided to post one of the few negative reviews while also saying he has eaten here more than 50 times.", 
    "review_date": "2014-06-12"
  }, 
  "ITeyIo7NymYZTWBxKqZ0AQ": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Rosanna B.", 
    "review_text": "Who doesn't love a late night open spot to tend to those who've had too much to drink? Lol.. The burgers were simple, yet delicious! Around 11p, the place was empty so it was perfect for our 10+ party. We immediately took all the bar stools and were served beers straightaway. I didn't know this place was visited by Anthony Bordain till after the fact, but he sure picked a good burger spot. Will come again!!", 
    "review_date": "2014-12-13"
  }, 
  "opSbHEfHYfCZvfff7vKvYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Camille B.", 
    "review_text": "Any late night food spot in the city is a plus in my book. Was it one of the top three burgers i've had in THE WORLD? Probably not, but it was pretty good after a night out bar hopping in North Beach. My friends and I actually tried to end the night early so we wouldn't have to fight for a spot at the bar or wait super long for our food, but when we came in, there were about 2-3 people eating in there and we were asked to 'come back in 20 minutes.' No questions asked, we left and had a drink up at Sip Lounge a block away. After about 30 minutes, we came back and the line was out the door lol. It's cool though, we didn't mind just hanging out for a little longer. There were no more seats or tables to sit at inside so we took the burgers to go and ate in the car.  I would recommend Sam's to those looking for a late night eat if you're out in the North Beach, Broadway, Financial District, or Polk St. areas. It's also pretty cool that their burgers were blessed by none other than Anthony Bourdain.", 
    "review_date": "2014-11-30"
  }, 
  "5jUlCtMCI9Z7poi1vHq6cQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albert L.", 
    "review_text": "SAM'S THE MAN.  If Sam is working, you'll have a awesome time. However, if it's his son, well.. it can be a hit or a miss.   That doesn't diminish the fact that this is one helluva hole-in-the-wall! Old fashion everything! Even the cash register is decades old. This place truly hits the spot when it comes to drunken nights or just not craving Chinese food. It's a small little hallway but the food is cheap! About $6 gets you a cheeseburger, fries, and a coke! Least you can get a decent meal after you've thrown away all those singles, if you know what I mean.", 
    "review_date": "2011-05-27"
  }, 
  "z7KsQ_nfTZq6mm6ZPAk_Mg": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Darius A.", 
    "review_text": "One damn good burger. Nothing fancy about Sam's just a good old fashioned burger joint. Delicious cheeseburger, fries and a soda for 10 bucks is a deal these days. Definitely hit Sam's up.", 
    "review_date": "2012-04-09"
  }, 
  "PE7dvRNZGvbOQyVXCukQYw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elise P.", 
    "review_text": "Great little burger place with old diner stools and a counter that has seen many years. The place was started by Sam in 1966 and the tradition carries on now with his son Fred running the place. A secret burger spot that is regularly frequented by locals, movie industry celebs, famous athletes and  hungry after hours bar patrons looking for a bite. They are open till 4, so that alone gives it 4 stars. I will add another star for Freds great smile. 5 STARS!!", 
    "review_date": "2008-09-19"
  }, 
  "uJqx8ZYk4hI_XkVDqB7BoQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly B.", 
    "review_text": "Sam's! This place is great if you just want a solid, no frills burger. I also love that they serve your food on paper plates, haha!   Apparently the meat tastes really good because the owner buys the meat (and always has) from a specific farmer since they liked the taste of it.   This place is open late and is great for post-drinking in North Beach, or even sober during the day time.  My boyfriend is obsessed with this place not only for the burger, but because his man crush (Anthony Bourdain) gave it his seal of approval.", 
    "review_date": "2014-07-01"
  }, 
  "thnNVCYcH7sIzsyZO0aAGw": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "shai-lyng C.", 
    "review_text": "i love their cheese burger and fries!! Sooo good for not that much!!! and it's pretty good for a good burger place open late... The only bummer part is I think it's cash only =[ and it's kinda a small restuarant so not much seating but you can always order out.", 
    "review_date": "2010-07-20"
  }, 
  "D6xz7H1HsWd5k-Ci3zY93g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brandon O.", 
    "review_text": "One of my favorite spots to eat on Broadway! Staff is always friendly, the business is family owned and operated. The burger is delicious and you can not go wrong any way you want to dress it up. There is corn dogs, hot links, nuggets, and pizza available but the burger is where it's at! I highly recommend Sam's!", 
    "review_date": "2013-08-15"
  }, 
  "ZjTzwlXBbg6-I4vtXTLHHQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Julie L.", 
    "review_text": "A friend basically almost planned my SF trip for me by watching Anthony Bourdain's Layover  (I still have yet to watch the whole episode =P) and writing down all the local hotspots. The double  cheeseburger at Sam's is in Bourdain's top 3 burgers in the world list. So we were in the area. Let's go!   Verdict? Tasty! I actually liked it. Not too oily and it wasn't heavy in the cheese. The sizable meat patties were cooked just right too. While it was good, is it the best burger I've ever had? Nope. At $7 for just the burger this thing was pricey! But the size was relatively large. The Bourdain combo (double cheeseburger, fries and a drink) is about $10-11. I'm glad I tried it, and while the burger was good, the price doesn't justify a return. To many other places to try in the city.   I'd suggest getting your food to go. Sam's is super tiny. Maybe fitting 10 people max. The cooking space is on the side and really small too. I couldn't imagine how long it would take if it gets crowded. It didn't look too clean or comfortable to sit in there either.   Place opens till 4am. Popular with the late night crowd getting out of the bars and strip clubs down the street. =P", 
    "review_date": "2012-04-15"
  }, 
  "zCGGWSR7-klRlPPeZ9BT1A": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Bob W.", 
    "review_text": "usually hit I-n-O Pinole for a late niter..but just for a change &amp; just having watched Travel Channels Burger Land me &amp; RR took  a trip &amp; went for SF hipster cool...#1 disappointment no grilled onions..my Animal style cheeseburger at I-n-O is made stellar with the whole slab of grilled onion...without that caramelized sweet roasted onion marriage with beef I'm a sad puppy....besides that the meat at Sam's just didn't taste as fresh or beefy although it was at least twice as big as the puny but oh so good patties at I-n-O..good divey atmosphere though and lots of booze including Veuve Cliquot as well as Bud...very cool..too cool..way cool", 
    "review_date": "2013-04-23"
  }, 
  "HDb4fBWIAQ-foS8qLJty9w": {
    "user_rating": 5.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "Michael S.", 
    "review_text": "My review is based only on the Burger and eating said burger at 2pm as the only people in the place, AWESOME....the burger was full of flavor, juicy and just what I was looking for, I could see this place being a problem for me if I lived close and was out drinking late night.", 
    "review_date": "2013-09-11"
  }, 
  "n-eYeIpSTiKhoDeubO1mmA": {
    "user_rating": 3.0, 
    "user_location": "Paris, France", 
    "user_name": "Omid T.", 
    "review_text": "Mnemonic devices are very useful.   For example, as a musician you'd use Every Good Boy Deserves Favour to remember that EGBDF are the lines of the treble clef.   If you're a biologist, you may find Kings Play Chess On Finely Grained Sand helpful for remembering the taxonomical order of Kingdom, Phylum, Class, Order, Family, Genus, Species.   If you're drunk as hell and have the munchies on a weekend night in North Beach, then you need to remember this one that I've created: BPBPBP.   These six letters are your guide to a pleasurable drunk dining experience at Sam's. Let's break it down.   Be Polite: The frycook is easily annoyed by loud, drunk, obnoxious people. The frycook stands between you and the sustenance you so desperately need. Therefore, the frycook's desire for peace and quiet shall be respected. A cook's kitchen is his sacred space, and this poor bastard has the rotten luck that puts his kitchen in the front window of a late-night dive full of drunken a-holes.   Be Persistent: The man at the counter doesn't take your money until your food is served. This means that they don't have much incentive to get your order right, or have it come up in a timely manner. You may have to repeat your order - or part of it - several times if you ever want to get it. This is largely because of chaos, as the place is full of drunken a-holes.   Be Patient: Many, many orders are being made, and probably half of them are being changed at some point. Don't worry - eventually you'll be rewarded with your food - and most likely before all the truly drunken a-holes.   By using BPBPBP, this drunken a-hole had a fully enjoyable experience at Sam's. Sure, I had to watch my friends get admonished for speaking too loud. Sure, I had to order my fish &amp; chips twice and my double cheeseburger three times. Sure, I was the last among my group to be served and the last to eat.   But when you're plowed and hungry after a night of countless vodka sodas, Irish car bombs and beers, a cheap-ass cheeseburger from Sam's really, REALLY, REALLY hits the spot. Even if the food is pretty awful.", 
    "review_date": "2008-07-02"
  }, 
  "5A9K0ji17Grhu9cNpGz0Ng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruby C.", 
    "review_text": "Hole in the wall burger joint. I like it! Another one of those no frills places where the owner is also the chef and is really nice. You know the people that are eating with you are mots likely regulars that are loyal to the spot. Juicy burgers with the goods on top. Shared one burger and I was stuffed. Good place - would like to try their fries next time..", 
    "review_date": "2014-09-18"
  }, 
  "mZz5nZHG9hzzQVh3BXKGPA": {
    "user_rating": 3.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Ivan P.", 
    "review_text": "Refreshing to find a legit charbroiled burger joint.  Whats great is this place is open late.  Steak fries and Cheeseburger.   Reason why I'm giving only 3 stars is because I've been spoiled with SoCal charbroiled joints that are a bit better.", 
    "review_date": "2015-01-05"
  }, 
  "JU3WepMpjyi61zK5-zwM0Q": {
    "user_rating": 5.0, 
    "user_location": "Perris, CA", 
    "user_name": "Erick C.", 
    "review_text": "Solid burger joint. The double cheeseburger was filling and juicy. Chill laid-back environment.", 
    "review_date": "2014-04-13"
  }, 
  "EBk8DPm4KC1pY-dMSnr_RA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ian L.", 
    "review_text": "Came here with Will C. in search of some late night eats in SF so we ended up here on the advice of Yelp and one Anthony Bourdain. This place is conveniently located near establishments where you can support the tuition payments of struggle college students. It's a hole in the wall joint with friendly service but don't expect anything fancy here.  Since the burgers have become too mainstream I got the wings and fries. No actually I just wanted wings. Those were tasty and exactly what I wanted. Will's burger looked even better. Seriously I have never seen Will eat so quickly, usually it takes the guy longer to finish eating than an Andrew Bogut IR stint. They do a damn good job of what they are good at and not trying harder than necessary.  While we were waiting I also noticed that there were a lot of repeat neighborhood customers stopping to pick up take out orders, so obviously they are doing something right.", 
    "review_date": "2013-01-07"
  }, 
  "G53FRAyVpjrKH_4tGZECTg": {
    "user_rating": 1.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Alma E.", 
    "review_text": "Worst place!! I got food poisoning from here!! And terrible service! They are very rude", 
    "review_date": "2014-08-04"
  }, 
  "nVbgogtCidVMLHOIMfKRUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Max A.", 
    "review_text": "The food is great and cheap.  The best tasting pizza in North Beach.  The only negative is the big eared cook, looks like a sex offender.", 
    "review_date": "2007-12-14"
  }, 
  "OHWzVtFRFYlJK1tWAslq7g": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Peaches C.", 
    "review_text": "OMG tell me why their pizzas are so freakin delicious?! And this is coming from a person who could care less about pizza. YUMMERS! My friends and I were next door at APT 24 when my BF and I decided to venture out and find ourselves something to eat. Of course, being fatties that we are.   This place was definitely a hole in the wall, which is the best! My BF and I had a slice then and later that night we ordered togo for our ride on the party bus. I would definitely make a trip up to San Francisco just to eat their pizza! Mmmm mushroom and cheeeeseeee.", 
    "review_date": "2011-08-01"
  }, 
  "mk8BoFW1zg1C7Gjyycz-3g": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Behnam P.", 
    "review_text": "The most delicious burger I've ever had in my whole life! Wow!", 
    "review_date": "2012-11-17"
  }, 
  "afRnGvg12wMBlkV54EoKaw": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Evie L.", 
    "review_text": "Came in on a Friday afternoon and it was open, despite its hours of operations on here starting at 5pm.   It's a hole-in-the-wall burger joint. Three of us ordered the burger, which they said was good. I got the pizza, which wasn't all that great. We also shared fries, which was good. Everything is served on paper plates, which adds to the burger joint feel.  The only \"big\" table is all the way in the back that seats four, five if you add a stool to the head, where there are almost no lights and super dark. The table had some oil or grease stains on it, so when we asked for a wet rag to clean it, the owner or manager or someone came over to clean it, but seemed annoyed or offended that we said it was dirty, and claimed that it wasn't because he washed it that morning. He wasn't rude or anything, but at the same time, you could tell that he was offended.   Overall, definitely seems like a good place to grab a bite late at night after some drinking. If I ever go back, I would like the try the burger. Everyone seems to love it.", 
    "review_date": "2014-07-21"
  }, 
  "tSvidzXaDosyOnnaNNsE3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew B.", 
    "review_text": "Not much more to say that hasn't already been mentioned. I inhaled the burger and the late night crowd that comes in can be entertaining.", 
    "review_date": "2013-05-18"
  }, 
  "OKMTwjBm4Dxbjsz9QcVhig": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Behdad P.", 
    "review_text": "Best burger in SF bay are! Open late night. Its that good which made me drive from San Jose just for a burger!", 
    "review_date": "2014-12-16"
  }, 
  "PvBmRN4suldo06Kcz2-vcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin L.", 
    "review_text": "Sam's is amazing.  This is the only place I go when I'm wasted at 2am.  They have the best fried chicken and cheeseburger around the city.  The fried chicken is so sick!!!  Don't mess with that quiet guy Ted with the white hair and glasses.  He'll go crazy on you!", 
    "review_date": "2006-09-08"
  }, 
  "FaYXjGgLtetpCCiKmEsq9g": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Fraulein C.", 
    "review_text": "I don't buy it. Not one bit. I know Anthony Bourdain was here, but I wasn't satisfied with the late night burger munchies after a few rounds of drinks.  The guy behind the counter was really nice and grilled the burgers quick like a machine! Small diner and very little room to breathe, I'm flabbergasted with the price! Close to $10 for a measly amount of fries and a burger?  Okay, I gave it a shot and got the Anthony Bourdain's special. Was I impressed? No. I think a couple of reviewers must've been drunk out of their minds, because I didn't find my burger tasteful. I don't know, maybe I came here on an off day? The meat seemed under-seasoned with very little amount of meat and the fries were sitting stale. I couldn't fathom chewing on their pizza that looked like it was sitting there for days! Personally, I like that it's open late, not too far of a walk if you're drinking around Chinatown and North Beach, and the guy working the grill is really nice. Mr. Bourdain was right about one thing, SF is dubbed \"the two-fisted drinking town, a carnivorous meat-eating town, it's dirty and nasty and wonderful.\" Heck, he said this while he was in his drunken state filming The Layover. Will I come back? No.", 
    "review_date": "2012-11-05"
  }, 
  "zfOPAforyvoEyO_KwTjFhw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kay l.", 
    "review_text": "granted i was a bit inebriated when i stumbled in here, but not so totally tossed to forget that the pizza sauce on my pepp slice tasted like it came from a huge can of generic crap you'd get from smart &amp; final -- totally reminiscent of my elementary public school lunches. blechh.  my friends got the fries and they said they could have been cooked a little more.  the guy working there was really nice though (and solo on a saturday night -- bless his heart) and i'd go back in another drunken pinch.", 
    "review_date": "2008-10-07"
  }, 
  "nNlRYWO00FvLVQx9Hp6_dw": {
    "user_rating": 3.0, 
    "user_location": "Death Valley, CA", 
    "user_name": "Jeremy H.", 
    "review_text": "I lived in North Beach for a long time, and burgers are probably my favorite earthly food, yet in all that time I never went to Sam's. That's chiefly because they don't open until 5 pm. During the day in North Beach, all you have to worry about is rude / clueless European tourists clogging up the sidewalks. 5 pm is about the time the real dedicated retards show up and particularly roam this intersection due to the confluence of strip clubs, bars and junk food, so I didn't like to be out much after that.  Also, at the time I don't think Anthony Bourdain was jerking the place off yet with his \"best 3 in the world\" thing. Don't get me wrong, I've watched a few No Reservations and enjoyed them, I think he's about as genuine as someone who sells their personality for a living can be (which still isn't near 100%, just the nature of the business.) I don't hate on the guy. But this place seems like exactly what someone who is stage-managing a rich guy who is supposed to have \"urban working-class roots\" would pick to give them \"street cred\" and make them seem \"real\" or whatever.   Look man, it's a dive where they cook up junk food quick. As dives go it's a pretty good one, the owner/counter man /cook Mike seems a good guy, the food is pretty good. But this ain't no top 3 in the world, let alone in San Francisco. It's a good, basic sloppy diner burger served up quick. The fries are pretty good and you get a nice-sized plate of them. That's about it. Anything more than that, you've written in for yourself. Or you were just sloppy drunk and it was 1 am.  3* because that's exactly what the food is. Pretty good, but not great, at an average price considering North Beach inflation (10 bucks for a cheeseburger, fries and a soda.) Worth supporting just for being a local business with character in the face of encroaching chains and yuppie bullshit, but don't expect to be eating the moon and the stars here.", 
    "review_date": "2013-08-16"
  }, 
  "jwwYo7niYHbvG6P9qslv0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily G.", 
    "review_text": "This hole in the wall is the perfect place for late-nighting after bars.  The burger is amazing.  It isn't gourmet, but its delicious greasiness hits the spot every time.  The perfect blend of meat, cheese, and condiments.  Don't even consider the pizza- just stick with a burger + fries and you'll be happy.", 
    "review_date": "2012-11-01"
  }, 
  "8ZqV7d09OdodTbFPPzWy_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marvin C.", 
    "review_text": "Very old school 'hole in the wall' spot. The staff is always friendly and cool to talk to. I have eaten everything here and overall the food is all good. The BURGERS ARE THE BEST. stays open LATE NIGHT 3am perfect for those late night broadway nights. Reasonable prices and you will always leave full and SATISFIED.... If your in the neighborhood and want a good burger this place is always the spot to go to.", 
    "review_date": "2012-07-25"
  }, 
  "bA-nbi3A15By4oQd3S_jtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Norm U.", 
    "review_text": "Like many others out there, I first stumbled upon Sam's sometime after 2:00 AM on a weekend night.  And I literally mean stumbled.  Balance and sobriety went out the window hours before.  Not knowing what to expect at this greasy spoon, I was pleasantly surprised to be treated to a ridonk cheeseburger and fries.    Just to make sure that I wasn't just tastelessly drunk eating, I made sure to eat a sober meal there as well.  Still a great burger.  I've now been eating here for years, to the point that when I walk in, I don't even have to order - they know what I want and have it ready for me in minutes.  Here's my two cents:  get the special with cheese.  Do you go to Harris' Steakhouse and get the chicken?  That's what I thought.", 
    "review_date": "2008-04-22"
  }, 
  "GxGNAXumenO5lpzjYe3aLQ": {
    "user_rating": 3.0, 
    "user_location": "Santa Maria, CA", 
    "user_name": "Rich S.", 
    "review_text": "Tasty burger and fries.  PROS: burgers made to order, on a small grill at the entrance. Sesame seed bun warmed in a contraption that must have been manufactured 5 decades ago, but it works. The works include onion slices, tomato, mayo, ketchup and mustard. Fries were frozen, but still tasty.  CONS: none, really . . .   Tasty burger and fries: not the best I've had, but certainly good. If I was in NBeach and wanted a late-nite bite, I'd definitely stop here.", 
    "review_date": "2014-02-15"
  }, 
  "8prGm3gf3EAD_jvwyXGH8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "I have always been a fan of small hole in the wall places. This is the epitome of such a joint. Tucked away in a small spot off Chinatown and North Beach, this is a classic spot to pick up a burger. I had the Double Cheeseburger and it was fantastic. While I was sitting at the counter waiting and my burger was cooking in front of me, I saw one of the pizzas come out of the oven. A trickle of drool escaped from my mouth as I watched that marvelous looking pie sliced in front of me. Next time I go, that Pizza will be mine, and it will not last very long!!", 
    "review_date": "2009-07-14"
  }, 
  "7mEz7WnF6UfBo99VdyzebA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ray C.", 
    "review_text": "Eat burger. Eat fries.   That will be the only thing going through your mind during this establishment's most popular hours. The seriously smoked dining area, combined with everything served with disposable paper plates and cups gives you a humbling slap to the face and says...hey, you're wasted. shove gourmet up your bunghole.", 
    "review_date": "2012-04-23"
  }, 
  "nGozHYFspeWe2DliD9GqcA": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "liz c.", 
    "review_text": "Woah. I did NOT know Anthony Michael \"Tony Bourdain came here. Drunk or not.  I wish I had, I would have tried the burger and not the pizza.  But then again, I had no cash on me that day so pizza slice it was!  Like many other patrons, I came here randomly and very late at night. I also came on the 4th of July (or very early on the 5th, rather). If you're in North Beach, after you've had just the right amount to drink and you're tipsy yet sober enough to do a Yelp app search that goes like this: Food - Filter - Open Now, you'll probably find yourself at Sam's.   Unless you COMPLETELY pass it, which is very easy to do. Then you'll probably find yourself at the white table cloth pizza joint down the street. Which will be closed if it's 2 AM.  But it's not hard to find this place. Just push past the tipsy-ness, look hard and you'll find Sam's. I was a bit skeptical about the food prep, considering this place looks suspect and from the 1980's, but I feel badly about misjudging Sam's.   The service was great, the food was delicious and OH MAN the price was right. SF needs to get over itself and have more reasonably priced food available. Take a page out of Sam's book.  Definitely, definitely going back for their burger. And not because Anthony Bourdain had it when he was piss drunk.", 
    "review_date": "2012-07-20"
  }, 
  "RBX-8eW-xLZC34azsAcNQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Logan P.", 
    "review_text": "On a good night you can sit at a bar stool at sam's, far from the protesters, spandex laden  bikers, emo hipsters, vegans, and have a conversation that's not centered around how Bush effects the environment.  Having an awesome greasy cheese burger with a side of that atmosphere keeps the rest of us sane in a city like San Francisco.", 
    "review_date": "2007-11-04"
  }, 
  "GP29TlaznYJjgIjbvtth4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trick C.", 
    "review_text": "Greasy spoon with burgers and fries that taste awesome.  Cold beer in bottles.  Awesome service.  Neighborhood joint.   Very cool.", 
    "review_date": "2009-08-07"
  }, 
  "hs49qaQtTkiiUk1GWvNDkw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevra P.", 
    "review_text": "I Love Big Mike.  Firstly, this is a burger place.  I come here all the time for burgers, the whole-neighborhood does.  It's like $5.50 for the works; burger, fries and a pop.  It's a \"quick call your friend and see if he'll pick a few up on his way!\" kind of place.  This is not a pizza place.  People talk a lot about the pizza.  It's alright for the cheap doughy cafeteria variety you used to get in high school. ( I have to admit I do crave it once and awhile)   This place is a greasy, deep-fried,  beer-battered, extra-cheese kind of place. It's a chicken strips, fish-n-chips, onion rings and every kind of dog kind of place.  This is a down-to-earth after-hours swan-dive kind of place, where if you are truly loved, you end up some-place on the wall kind of place.    It's also a  nostalgic kinda place.   I love this place.", 
    "review_date": "2008-08-17"
  }, 
  "HnnDiOQETwAEMfGZfLJ9gg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Armando Z.", 
    "review_text": "I love dives , I love great hamburgers. This is very good hamburger. it's the quality of the meat and the way they char broil it, Old school. The fries and other things are just normal. Is this top 3 in the country as Anthony Bourdaine says? Hell no. He must have been drunk that day. I am used to Tommy Burgers in LA, Fatburger, and even Five Guys from DC. This is very good, better than Bistro Burger or other high priced SF burgers.", 
    "review_date": "2014-09-12"
  }, 
  "c14mdc_XMbDF-70UJIh7uA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela M.", 
    "review_text": "I've been told about this place several times by my friends but hadn't gotten around to going until a week ago when I was craving a burger in North Beach...which means limited options. I am happy I did.   The place itself is smaller then most apartments, but is charming in a special way. The menu is fairly simple...burgers, fries, hot dogs, etc. I went with a cheeseburger and fries. Sam made it all fresh in front of me and was super sweet.   The meal itself was great...well done, just like I like it (but not dry) and there were more fries than I could finish...I had friends help and we still couldn't kill them all.   I will definitely be back. Great for late-night, after bar/pre-going home fare.", 
    "review_date": "2010-06-26"
  }, 
  "ZzbC5zeyVlWVikX5-AlLhw": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Will K.", 
    "review_text": "Great burger, nice vibe and good price.", 
    "review_date": "2012-07-10"
  }, 
  "HAu5OgbkLGsmLhKBJ2RR1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joyce C.", 
    "review_text": "I was at Rosewood just up the street last night.  When the bar closed at around 2am, and the drunk munchies are kicking in.  It was between Sam's and this Vietnamese place next door.  Both, hole in the wall type places.  I don't know about you, but for me, drunk munchies = greasy food you would never (well, almost never) imagine eating while you're sober.  The smell of the sizzling oil and the burgers grilling attracted me over to Sam's immediately.    Sam's is cash only - or maybe it's because it's late?  Anyway, I had limited cash on me so I was only able to get 2 burgers and fries - sans soda.  I handed over $15 and received no change or receipt... ummm pretty sure, that didn't come out to $15 exactly... (minus 2 stars for trying to take advantage of my drunk kids)  Anyway, the burger was juicy and the cheese was perfectly melted.  I added mustard.  Together with the onions and pickles, I had a burger that satisfied.  Fries were fresh.  Also, saw a lot of people eating pizza so that must be good too.  Next time, I\"m going to demand my change.", 
    "review_date": "2012-02-25"
  }, 
  "onVxYeUw4eRcX7amvVFgaw": {
    "user_rating": 2.0, 
    "user_location": "Aix-en-Provence, France", 
    "user_name": "Exalt V.", 
    "review_text": "Are you kidding me? (4stars on yelp) o_O Ok, the burger tasted fresh and nice but I mean come on $11 a double cheeseburger &amp; fries (out of the freezer).  What's more, the place looks old, tacky, and not very clean (doesn't mean it's dirty, but that's just the impression it gives you). I gave it a lower score because I don't think it deserves to be that highly rated.", 
    "review_date": "2013-03-22"
  }, 
  "XtpLxoRvolypIuUgTDKZMg": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Tareq M.", 
    "review_text": "I looooooooove looooooove love this place.... The double burger is out of the world...", 
    "review_date": "2014-03-08"
  }, 
  "udjIUpEIygQXgypWmnIeHg": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Diana V.", 
    "review_text": "The devil made me do it!  Red Devil Lounge that is.  Grrrr...16 ounce Tecate beer!  (<a href=\"http://www.yelp.com/biz/red-devil-lounge-san-francisco#hrid:Ykxkx5KG9boCTCimdGCCTA\">yelp.com/biz/red-devil-l…</a>)  Where can you find a well-rated burger at 3 a.m.? According to the Yelp mobile app, it's Sam's.  We rolled in just as they were closing up. They informed us that they only had one cheeseburger and fries left.   I could see it already wrapped up and in the bag, almost as if it was going to be a to-go order.  Like many of the other reviewers, this is where the transaction got shady.  $6 for just the burger -- because now, a minute later, they said that there were no more fries!   What!? Calling Nancy Drew in The Case of the Missing Fries!  I do have to tell you though, that cheeseburger was pretty darn tasty : )   I'm pretty sure that had to do with the fact that I was starving, it was late, and I was a bit soused.  Cheesy, juicy, and big, since it was already wrapped up on foil, it might have been meant for someone else. Perhaps I got lucky, judging from the hit or miss reviews.  Not sure that I would come here again, but it hit the spot at that moment.", 
    "review_date": "2012-12-07"
  }, 
  "QRyXsigFa4R3p4iXab0AKg": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Tyler C.", 
    "review_text": "Walked in and got served right away. Mike was running the place and hearing his stories about working there since he was a kid was really awesome. Food was good and very affordable. Would go back again.", 
    "review_date": "2014-01-04"
  }, 
  "hApF1dFVsCOU67tK1dYmMA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Terence N.", 
    "review_text": "The tiny little burger place on the edge of Chinatown and the Red Light District, that's what I call it when suggesting places to eat around there to my friends.  I've only been there twice and let's just say I had two completely different experiences.  This small night-time joint has a \"traditional\" selection of choices ranging from simple burgers, slices of pizza all the way to steak. The walls are full of pictures that date back to the early days of the business with some of the city's finest and such.  The burgers I've had there are relatively good, not the best but are good. It wasn't greasy nor was it small. In fact, you can pretty much say it was the right size for a fair price.   Now here comes the conflict. My first time around, the guy at the counter was a pretty cool guy who made my ordering experience very comfortable because he was very polite and funny. My second time around as I had stated, wasn't so great. I'm not sure whether or not it was the same guy but the cashier/server looked very bothered and even slapped my plate down on the counter. I didn't feel very welcomed this time and I'm pretty sure I won't be around there anytime in the near future.  Overall, the food hasn't changed in quality but the service had.", 
    "review_date": "2008-10-27"
  }, 
  "uFhqjfx0KUZ8n51D-Tvc8Q": {
    "user_rating": 5.0, 
    "user_location": "Temecula, CA", 
    "user_name": "Troy S.", 
    "review_text": "When you are hungry late at night in San Francisco, Sam's is the place to go, Mike, Sam's son is now running the place and it has been part of the community since somewhere back around 1967. We have a software development office about 6 blocks away and find ourselves going up for late night food. The burgers are the best we have had in the city, one of our guys eats two double cheeseburgers he likes them so much.   Mike will make them any way you like, with whatever you want on it, all you have to do is ask. They appear to have hand made Pizza but we haven't tried any since the burgers, fries and onion rings are top notch.  its small, fits about 15 or so folks, usually has 2-4 people in there, tight fit but worth it... Enjoy... bring cash.... the register is from circa 1970 so if you need a receipt for company reimbursement ask for a hand written one!  PS, I buy hamburgers from Costco, while good, Sam's are way better and flame broiled right in front of you. Additionally the food tastes great when you are totally void of any substance usage. (it may taste better then too, your mileage my vary)", 
    "review_date": "2009-02-11"
  }, 
  "8O8ajzpvaMWh5amLBcmVdA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen L.", 
    "review_text": "When you crave a burger with no frills here's the place to get it. It's a hole in the wall but they make their burgers fresh and tasty.", 
    "review_date": "2013-05-12"
  }, 
  "hJKhS_bb0Fa3_illDEUYeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin H.", 
    "review_text": "SAMs is THE best place to eat in North Beach.  Skip everywhere else.  Drunk, sober, whatever.  Order the double with the works, fries and a beer.  F'ing HEAVEN.  I would live here if they'd let me.", 
    "review_date": "2014-02-12"
  }, 
  "9v5UHxbjkkaoYPTXGXynCg": {
    "user_rating": 1.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kelly G.", 
    "review_text": "Not the third best burger in the world even by a drunkards rating. Tony Bourdain, you've lost your marbles!", 
    "review_date": "2014-03-19"
  }, 
  "mtMNI1dogLCDtr4g6uUqXA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chimichanga C.", 
    "review_text": "Good burger but for the cost I'd rather go eat a cheese steak at Busters.    I think the best thing about this place is that it's open late.", 
    "review_date": "2012-11-05"
  }, 
  "3JJnFGGUwDCgPw_eykqHBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean M.", 
    "review_text": "Good burgers and fries.  Especially after coming off some stiff drinks on a night out.  I'd recommend it to anyone who likes good food, folk and jokes.  I had a great time here and will come back for sure.", 
    "review_date": "2010-01-27"
  }, 
  "8wUHaOyVddyK-0rCAr9xEw": {
    "user_rating": 1.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Kimberly K.", 
    "review_text": "Yeesh.  Anthony Bourdain doesn't normally lead me astray, but I don't know what he was thinking here.  This is definitely not a \"top 3 in the world\" burger.  I imagine it's a fairly solid drunk-food burger (and everything tastes better when you're drunk), but it was your standard cheeseburger on a standard bun, plus some extra spices.  The reason for the one star, though, is because the 94/100 health score rating here is a total joke.  Here's the order of events leading up to us getting our food:  1. Arrive.  Employee is outside smoking a cigarette and messing around on his cell phone.    2. He goes back inside and begins refilling napkin dispensers.  No handwashing after phone/cigarette.  Oh, jeez.  Now he's refilling the condiment containers.  3. Eek!  He just took the lid off that grimy trash can with his hands!  (No hyperbole here - the trash can was caked with grime, both inside and out.)  4.  He takes out the trash, tosses it into the garbage truck in the middle of the street, and then helps the garbage man pick up a bunch of trash that fell out on the road.  5. Comes back in, starts making our food.    Seriously?!  Okay, shame on me for eating the burger after watching all that happen (I had to know if it really was as good as Bourdain says), but there is no handwashing sink in sight, no gloves are being used, and the guy who made our burgers was literally picking up garbage on the street before he started cooking.    He handled money before slapping some burgers on the grill, and I really don't want to know how my lettuce and onion made it on the burger (please oh please, let there have been tongs.)  I've been known to hit up some sketchy places for food in the past (see also: every pho restaurant, ever), but I *still* see them using gloves and washing their hands in the back.    If not knowing where the food prep person's hands have been in the past 1 to 96 hours makes you squeamish, I'd pass this place up.  (Also, if you're ever in the Seattle area, try Dick's burgers, as well as Red Mill.  They're amazing, regardless of whether you're drunk or not.)", 
    "review_date": "2013-09-02"
  }, 
  "Lf7MRy1_uFxgKUYn6ov5yw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Da Wei S.", 
    "review_text": "I've had it with this place. I like the burgers, but the service is worse than suck. On top of that, the owners kids rip you off. Don't eat here, but if you do, count your change.", 
    "review_date": "2014-08-22"
  }, 
  "nxUocCceCH9sIJjN0M9jnw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave G.", 
    "review_text": "I see alot of people describing places as \"no frills, serious blah blah\", and it made me wonder what the hell a frill was. I looked it up and the best definition I got was: \"informal. Something that is desirable but not a necessity; a luxury.\" In Sam's, there is not a single frill; not a one. I searched for a frill, but couldn't find any. I asked Sam if he had any frills and he said \"What!? My name's not f**king Sam\". Regardless, frill or not, this place makes some mean junk food. The fries are fresh and the burgers are strangely amazing. Pretty much anything you get here will make your stomach happy and your doctor richer.", 
    "review_date": "2006-09-18"
  }, 
  "Y_msd_0mOixY5D9fPYcKBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Babaganoush I.", 
    "review_text": "It's greasy, it's fatty, it's messy, it's f@#! good! Love Sam's burger on a late night out. Good prices and old school taste.", 
    "review_date": "2014-06-30"
  }, 
  "ps2JtMJFaNPZzL8CZ7Otag": {
    "user_rating": 3.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Donna R.", 
    "review_text": "As far as burgers go, the burgers at Sam's are okay.  They're cheap and are made quick and juicy, however, they are just not one of the \"top 3 burgers in the world\" like AB says (he's a NY'er for cryin' out loud..has he forgotten Corner Bistro in GV?).  I guess you need to be drunk to get that kind of experience.   Decor is what I expected..reminded me of the greasy diners in Detroit/NY (which isn't a bad thing).  I got the 1/4 lb. cheeseburger and a Sprite and my tab came to $7...very nice price in SF.  If you're looking for a cheap, juicy cheeseburger without having to stand in a \"hipster\" line that wraps around the corner, Sam's is your man!", 
    "review_date": "2013-09-05"
  }, 
  "9XyZAQ0zNpa95Cn60tdVLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric H.", 
    "review_text": "I reluctantly went into this divey looking place because of a strong recommendation from a trusted friend.  He said order the cheese burger, nothing else is worth ordering.  So we ordered cheese burgers and beer, and this is one of the best burgers i have had in a long time. I am not sure how they got it so good, i  noticed they were using fresh high quality meat. But this burger just tasted awesome.", 
    "review_date": "2010-06-17"
  }, 
  "xoNpQ_DnzNuTbkFPPO0Lgw": {
    "user_rating": 2.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Kitty K.", 
    "review_text": "Tiny whole in the wall where you can watch the cook make your meal from the street since it's at the front. Only stool seating. Made famous by Anthony Bourdain as being among the best burgers. My friends love coming here late at night but I'm not so much of a fan. It's just a simple burger on a grill. Nothing fancy with it. Pizza dough no flavor and fairly greasy. Don't expect any niceness from them either.  Cash Only", 
    "review_date": "2014-01-10"
  }, 
  "6d4Zu6drpu658tyx5ubbCQ": {
    "user_rating": 1.0, 
    "user_location": "Silver Spring, MD", 
    "user_name": "Reza G.", 
    "review_text": "Awful and insulting behavior! I care about how I'm treated as a human being, more than quality of food", 
    "review_date": "2015-01-15"
  }, 
  "BXvHuKaER8UUE7EoXsSHFw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sarika S.", 
    "review_text": "I went to Sam's a few nights ago, after an evening of some drinks with friends. My friend saw this place on yelp and had to try it.  I don't eat red meat, and the menu had a few options on it. When I tried to order- guess what, they didn't have any of them! I am wondering if they did but didn't want to do more than hamburgers, cheeseburgers or pizza at 2am.  I got cheese pizza and yuck. The \"chef\" grabbed a cold slice (with his bare hands) and stuck it in the microwave or whatever it was.  The fries were piping hot and yummy. My friends loved their burgers.  I must also add that weather they take credit cards or not is very confusing. Some signs said yes, some said no.  The place is very small and gets super crowded. It's hard to get in and out. Service is fast though.  Would I go here again, highly unlikely.", 
    "review_date": "2012-11-14"
  }, 
  "r-8eQ28RhnQPJdZXHcTXrw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika C.", 
    "review_text": "The bf loves Sam's.  This is evident from the fact that he has revisited this place while sober.  I've had it sober too.  It' not bad at all...but if you eat Sam's while you're drunk, it'll taste AMAZING.", 
    "review_date": "2012-04-29"
  }, 
  "N7WRZHjUAG1YaQZ8yETj-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Toby H.", 
    "review_text": "This place is awesome!  My roommate has been going here for a while now and i finally made it with him the other day. The burgers are unreal. Probably one of my favorite burgers in San Francisco do far!   The staff is very friendly and usually if your nice he might give your a free plate of fries.   Definitely gonna make this place a regular stop!", 
    "review_date": "2011-02-08"
  }, 
  "KofmcukQnRz9mjKOS0u66g": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Rose H.", 
    "review_text": "So delicious!!!  We ordered 2 double cheeseburgers and fries, and not only did it come quickly, but it was amazing !  Cheese burger was juicy and huge. Fries were crispy  and the beer was cold. No complaints at all about Sams. An absolute must if you are day drinking in North Beach.", 
    "review_date": "2013-12-21"
  }, 
  "LeRfH65Dp9k_IRgQBVqxSQ": {
    "user_rating": 4.0, 
    "user_location": "Vacaville, CA", 
    "user_name": "Ron P.", 
    "review_text": "Went in on Saturday a few weeks back.  As I recall the place opens at 4pm which I thought was strange... The space is small and already the counter was full of inebriated hipsters at it was only 6pm - nice! At least no one was passed out(yet). Everyone in there was drunk except me. Sadly I felt out of place.    The cook/cashier behind the counter was extremely patient with them. And he made sure I got my order in right away which I very much appreciated. Also behind the counter they were playing a tape of Bourdain's episode featuring Sams burgers on a very tiny TV. What was entertaining was listening to one the drunk guys explaining to all of his buddys who this Bourdain guy is.   I ordered a single cheeseburger and an anchor steam, no fries.  I did not have to wait long and the burger was very good - just as good as any $10+ burger in SF. I will go there again - and next time I plan on being drunk.", 
    "review_date": "2012-03-28"
  }, 
  "zocuwB359woyJaUnV6Ydjw": {
    "user_rating": 1.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Justin E.", 
    "review_text": "This guy. Not Sam, I'm assuming not him, but the other dude. I'm not sure if he's racist or something but really... What a jerk. He wouldn't serve us at first despite trying to get his attention (group of Blacks and Asians). When he finally took our order after much disdain, he was a total d*ck about it. Apparently to him, we ordered wrong. (We were deciding on what to get but it's self service. We took too long ordering from him and he had to early over. An apparent no-no.) He wouldn't serve us any drinks, saying, \"we can't.\" He proceeded to serve someone else (someone not of color).  I've wanted to come here for so long after the Anthony Bourdain show, but what a huge disappointment.  Never again. The food wasn't even that good, even fit drunk food. The service made it unbearable. Really, what a c*nt.  No thank you.", 
    "review_date": "2014-12-21"
  }, 
  "R1Be4mB4AexoUYtglHtUng": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Kathleene E.", 
    "review_text": "My boyfriend's brother would not stop bringing up this place for weeks, and HAD to have his fix. So we finally went, and now I know why. There isn't really anything special about the location- it's kind of sketch, but like another yelper mentioned; it's the basics done right. My boyfriend and I split a double cheeseburger with bacon and a canned cola, paid about $11 and it was amaaaazing.   It's literally a hole in the wall, so not so great for bigger parties. I'm definitely coming back!!", 
    "review_date": "2014-02-07"
  }, 
  "eDcxeZwKEE7l3HW5BqCQ4Q": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sara M.", 
    "review_text": "Yelp comes through again!! This place is open late, total community feel, great burgers, love this place!!", 
    "review_date": "2014-05-25"
  }, 
  "RdtD_EaJolktp6qgHjx24g": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ronjini M.", 
    "review_text": "I think people like this place because they are drunk when they go there.  Its in great proximity of local bars, but I would never eat here if I was sober.  The men behind the counter  were rude and the pizza wasn't even that great.  The fries have a funny 'taste' to them, like they were cooked in super old oil and they only take cash, despite the 'Charge only for $5 and over' sign in the store.  I mean it was closer than a good pizza place and we were looking for speed at the time, but they only have pepperoni and cheese to offer, just not that great.  Good thing was that there was a Wells Fargo ATM across the street and it was also a good place to catch a taxi.  Not coming back here unless i'm REALLY drunk.", 
    "review_date": "2008-02-10"
  }, 
  "NcoHqfTjSC5Jx39020Cnjw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danny S.", 
    "review_text": "mY BUDDY adam, of yelp fame, told me this place was quite excellent. He recommended the wings, which he said were best in town. San Francisco being a foodies' paradise, that means best in world, in some circles. I tried these wings out have to say, ADAM DON\"T LIE! these wings were unbelievale. No exageration, I will become a frequenter of this spot. Living in NB I have a lot to choose from, but I'm stoked this place is just around the corners, thanks @ajweemis", 
    "review_date": "2011-10-02"
  }, 
  "qZERkb6XQna3dZS33aG29A": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Douglas T.", 
    "review_text": "Simply put... DELICIOUS!!!!  I eat a LOT of burgers and this place is in my top 10, ever!!!  Showed up here with 10 friends at 4pm after a trip to Chinatown.  The service was AWESOME, FAST, and YUMMY.  The owners son was they guy behind the counter, he quickly explained the simple menu and whipped up 11 burgers each exactly how we wanted it and got fries out al at the same time.  For about $11 each we ate a delicious burger as he told us stories of some of his more famous customers and the random hijinks that occur in his shop.  It was really great.  To finish it all off he pointed out a little secret area of the town we should check out while we were there and sent us on out way.    I HIGHLY RECOMMEND this place if you're near Chinatown craving a burger.", 
    "review_date": "2012-09-12"
  }, 
  "rXops73qsJgW91oImt7UJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Broke-Ass Stuart S.", 
    "review_text": "To be quite honest, North Beach can be a pretty shitty place sometimes.  On the weekends you get a lot of people who just wanna spend tons of money, look flashy, pick fights and in general, be assholes.  That's their thing, whatever.  But according some of my older friends (as well as books and movies) North Beach actually use to be a really cool place where neat and artistic things took place (like when my friend had Charles Bukowski come and read at her house in the late 70's).  Like Vesuvio and Spec's, Sam's is a glimpse into what North Beach must have been like before...well, before now.  Don't get me wrong, there is absolutely nothing neat or artistic about Sam's, it's  just a greasy spoon diner for fuck's sake, but it's a real diner for real people who don't want to spend $10 on a beer just to be around other people willing to spend $10 on a beer.  Sam's is only open from 5pm-2am, but I bet you'll meet more interesting people in one drunk food excursion here than you will in 2 months of partying at places like Impala or Dolce.", 
    "review_date": "2007-04-17"
  }, 
  "SGk3Be9Mt8833ScFOJ-HRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Randal P.", 
    "review_text": "As a senior citizen, no make that a super senior, what I was doing on Broadway after 10pm is beyond my comprehension?  Okay, I had a few too many drinks.  I stopped off at Sam's to try a burger.     Their hamburgers are decent.   I'd venture to say that they get their patties from Costco.     And the consensus is that this place is more palatable when under the influence.    I concur.", 
    "review_date": "2009-01-29"
  }, 
  "SbQ9QMLX8MAwQw_4R_nyvw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy S.", 
    "review_text": "This place makes a delicious burger. Nothing fancy about it, just the basics done well.  Make sure you have cash on you because they don't accept credit cards.  The place itself is unpretentious, something that is becoming a rarity in San Francisco. I will definitely be back next time I'm in the area and jonesing for a burger.", 
    "review_date": "2013-12-22"
  }, 
  "q5fK4JndTw_ip-qbjxxHkQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jeremy K.", 
    "review_text": "I went there the other night for the first time, and it will definitely not be my last time there.  Actually, I was on my way to another San Francisco burger restaurant that I will not name; however I will give you a hint, they closed today forever.  I was going to this establishment; because I heard the burgers were good, but after seeing the extremely outrageous prices, I was like hell no.  After seeing the reviews for Sam's on here, I was got off BART and hopped on the next train back towards Downtown San Francisco.  I got off of BART at Powell, walked down Market and over to Grant Street and eventually through Chinatown.  When I finally arrived there, I was like, what do I have to eat inside this place.  I ordered the Anthony Bourdain Special, and it was a great buy and I was glad I went there.", 
    "review_date": "2014-03-16"
  }, 
  "HT_WbR5qzTBnMTpQmWlGJw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "will h.", 
    "review_text": "This place is what it is.  Not fancy, not too hip, and the food isn't spectacular.  In fact, the next morning, I mean afternoon, you'd think to yourself, I ate that?  There?  Don't order fish and chips, because it'll take 30 minutes before you'll get your food.  Don't order fish and chips after you've order pizza because moderation is key at a joint like this.  Their pizza is weird, and I kinda have a craving for it right now!  Odd.", 
    "review_date": "2007-05-05"
  }, 
  "sXLAy83l7EwdZjsYFbaq0A": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kara B.", 
    "review_text": "Surprisingly, the burgers here are pretty damn tasty!  And, NO I wasn't drunk . . . like everyone else that seems to eat here late at night.  The pizza is just okay.  I'm sure it probably tastes even better to the super duper pot-head that came in and reeked up the joint - he was entertaining, though. . ., and kept walking in and out of the place to talk to some hooker-looking chick, then the cook, then back to the hooker.  I was only afraid that his residual cloud of herbal refreshment was gonna interfere with my burger-noshing, and make my hair smell like I'd been puffin'.  Hmmm? Nope, I think the burger is just as delicious to sober, high, and drunk tastes buds alike.  The guy cooking up our grub was very nice to all - including half-baked boy, and loitering hooker chick at the window .  We bull-shitted with cook, watched Romancing the Stone, and enjoyed our late-night dinner.  In addition to burgers and pizza, they seem to serve other things that I probably wouldn't want to try . . . . of the seafood variety . . . why ruin my like for this place by trying something that just seems wrong for this kind of place?  I'll wait for Mikey, or half-baked boy to try it first.  I'm sticking with the burger, while I cop a squat and watch a cheesy 80's movie.", 
    "review_date": "2009-01-15"
  }, 
  "H3PFTHE-SL1gg2exnNy1jg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily S.", 
    "review_text": "After wandering around North Beach feeling hungry and overwhelmed with all the choices, we stumbled upon Anthony Bourdain's review of Sam's and knew we had to stop by. It was still early, about 9ish, so the late night bar crowd wasn't clamoring for the meager 15 seats in the place. We walked right in and were greeted by the owner's son (also the cook). He has an old fashioned cash register (yes, cash only in this joint) which he rings up your order and you pay as you order. He then throws your burger on the grill right in front of you and puts down the order of fries. This means nothing is left waiting and it's all hot and delicious!  It may not be the most amazingly crafted burger in the world, but it's a pretty damn good classic burger. Simple, not pretentious. This place isn't pretending to be anything it's not. We got two burgers, one single, one double with avocado, an order of fries (which was an entire paper plate full), and two beers for less than $25 bucks.   The guy behind the counter said that his dad opened Sam's 50 years ago and keeps it open just for memory sake. While we were sitting there an elderly man stopped in to tell the son that he used to play poker every weekend at the back table. Yes, this is a place with a lot of history and it looks pretty much like it did 50 years ago, but it's cool in it's own way. Definitely check it out!", 
    "review_date": "2012-05-15"
  }, 
  "eO4IGqrqByvaUxBuTl7Hpw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wayne W.", 
    "review_text": "I am astonished by the pizza here. Every time I've had it, the crust has been burned black at the bottom, but still neck-tighteningly doughy at the point where it meets the sauce and cheese (which taste like neither sauce nor cheese). I do not know how this is accomplished. They must have some secret recipe.  The burgers and fries are fantastic, in that way which can only come out of a place like this. They are greasy. They are so, so greasy. And the grease is delicious. And the cheese -- I think for the cheese, they drain the grease off the grill and add some sort of yellow colorant, then let it cool down into a hard square, than slap it back on the burger. The cheese is delicious.  I usually get the pizza, and a beer. It is a shame that they don't have warm Pabst, because that would be the perfect beer for this pizza. But MGD works.  You have to be in a really indulgent mood to come here, understand. And a little twisted. Sam's is like the Power Exchange of food -- you have to be in that mindset that finds real carnal pleasure in banging the ugliest stranger possible. Making fists into mounds of toneless flesh; sucking down foul breath; drinking in viscous unknown sweats through every pore. Sam's is that in your mouth. Sam's is awesome.", 
    "review_date": "2007-05-18"
  }, 
  "balhXuT7Pa2Sqb3cuTkDRA": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Kristine N.", 
    "review_text": "It might have been the alcohol but this burger was really really good. It was big, juicy, flavorful, and full of grease (what I needed at that time of the night). They hand make everything to order and you can tell. The fries are crispy and delicious.", 
    "review_date": "2014-10-15"
  }, 
  "6iShvMPfeDS3dq6grbmmbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason S.", 
    "review_text": "Quick stop right before Rosewood bar to put something in our stomachs.  The order - Pepperoni pizza and fries. The verdict - simple and delicious.  Nothing complicated here - well done hole-in-the-wall pizza with crispy seasoned fries. The owner was very nice and offered extra onions. Sriracha is also provided at this diner. PLUS!", 
    "review_date": "2011-06-21"
  }, 
  "x3JcGJ0FdEEnFqM2GeU9mQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica D.", 
    "review_text": "I had a great burger here at 3am...which means it could have been total crap because it was WAY after hours. I also recall the guys looked pretty shady in this tiny grease hole. Then again it was 3 am on Broadway. I may try it again- this time in daylight to confirm or deny the 3 star rating.", 
    "review_date": "2006-12-28"
  }, 
  "0-1Mut3NrwRQy7SPcbEJHQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Justin L.", 
    "review_text": "Since the first time I went there, the guys that work at Sam's have recognized me and treated me like I dragged them out of a foxhole and then married their sister and did right by her and then killed the guy that drunkenly plowed into their wife and disposed of the body, no questions asked. Seriously, one burger and you're in with these guys like a fucking Coppola film.  Don't limit yourself to the burger here though. While it is truly amazing, try and expand your palette a little from time to time. My favorite meal is an order of the Chicken Nuggets with fries. Add in a soda and it's 7 bucks. You get 10 nuggets, fresh out of the fryer and they keep ranch in the fridge for those that like to mix up the dipping options.  The decor and experience as a whole is amazing. It's so unpretentious, unlike most hole's that know they're cool and milk it for every drop of hipster manna. Drinks come in red solo cups, the food is on paper plates, and the walls look like your best friend's attic threw up on your cool uncle's garage workshop. Mirrors with beer company logos on them sit next to framed art of birds casually flying above a Michigan lake. Behind the bar is a bevy of to go containers, an old cash register, a tip cup and a big metal thing with a sticker on it that says I HEART MILK. I don't know what the metal thing is, but it loves milk and I do too.  Best of all, last night I went in there after the show at the Punchline, and Sex and the City was on. Just when you think you know a hole in the wall, they fucking watch some Carrie Bradshaw.", 
    "review_date": "2007-09-24"
  }, 
  "KavFgapR_cJZaA_Kvfqsvw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zu W.", 
    "review_text": "So the cheese burger is good, the people working there are awesome and the prices are cheap.   I was drunk when I stumbled in here,  couldn't eat much, but the few bites of the burger and fries that I manage to put down, was so tasty.  Really made me regret drinking too much and not being able to fully enjoy a nice juicy burger and some crunchy, crispy, fatty (thick, not super greasy) french fries.    The staff was awesome, they were really busy when I got there but through all his awesome service providing, he manage to talk with us, made me laugh and overall made this a really fun place to be in.    The prices were definitely affordable.  If you're on a budget, save like $7 for this place at the end of your night.  (That's like buying one less drink at the bar).  And you can get a delicious juicy cheese burger, some fries and a coke.", 
    "review_date": "2009-10-10"
  }, 
  "ySnJRrXNpbHuGYsm5mEAVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie J.", 
    "review_text": "OOMMMGGGG! Can we talk about heaven? Cause in my drunk state about a week ago, all I could keep repeating while scarfing down my burger and fries was, \"This is HEEAAVVEEEN!\" BBQ sauce dripping all over my chin, fries crammed into my burger like a hap-hazard manwich gone bad, I couldn't get enough. I think I might have to head down there right now and get another.", 
    "review_date": "2009-12-29"
  }, 
  "RdH15d0SoQaoH8HJL9gXCg": {
    "user_rating": 5.0, 
    "user_location": "Colma, CA", 
    "user_name": "R H.", 
    "review_text": "This place rocks!  Fantastic food and friendly staff.  Anthony Bourdain picked a good one.  Best damn burger I've had in years.  I am hooked.", 
    "review_date": "2012-04-29"
  }, 
  "8c2n50ngClm2o_YhQjkbPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phuong V.", 
    "review_text": "I am waking up early to write a review for this place since I had such a wonderful experience.   It was 2AM, and my friend and I came from our partying nights to grub on a some delicious burgers. Parking was easy peasy since it's in the the middle of the night. There was a bit of a line since from yelp reviews, Sam's is quite popular. This is a hole in the wall joint owned by the sweetest men. There are little seats that can only fit 2 people, and a large table in the back for the big parties. Mind you that this is a CASH ONLY venue. There are funny signs that says they only accept cash and don't you dare ask for credit. We ordered 2 cheeseburgers and fries, BUT we were short 3 bucks. The person that was taking our order was super chill with it and gave us our meals anyway.   The burgers were delicious, on point. Moist with a good patty and moist veggies. Fries were crunchy and a smooth center. They have siracha! So you spicy eaters can enjoy. Water was free and the man that was running the orders was so sweet. He made sure that we were enjoying ourselves and our water cups were filled. The place definitely should be recognized for the people that are making the food and the food that comes a long. I will definitely come back (this time with more cash). Wonderful experience, wonderful customer service, and GREAT burgers. YUM.  Yay Sam's! (There was a sign that says it was ran by Big Mike. If Big Mike was the one that was getting the orders, You are awesome! Thank you!)", 
    "review_date": "2013-03-23"
  }, 
  "2Et5T1cebDc9rzqDUrgqPg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim V.", 
    "review_text": "Ai'ght i know, i'm going against the grain but WTF is up with Sam's, we all loves the drunk food, but four stars average- a'ight, time to stay strong to my new years yelp resolutions and hold the line on places that ain't four stars.  The best way to describe sams as it would be the place in \"Aqua teen hunger force- the movie, part 14 (direct to blu-rock 4d senso crystal)\" where the down and out frylock, Master Shake and meatwad work, becuase their damn house burned down for like the 50,000 time. That sad look on meatwad's face? yeh, that's because he's throwing kirkland select meat patties (aka his brothers) on a grill. And Frylock- wtf happened bro? No laser eyes used on the shady mcshaderson homeless dudes asking me for food while im still eating INSIDE the restaurant. and master shake no longer has the flow- if you know what i mean.  Sams has food late night, the rest- well, not worth the price of admission. Sam's, sorry, you ain't no Sam-wo's....and no, you can't have a bit of my burger.", 
    "review_date": "2008-01-21"
  }, 
  "HPa7MNIwUyV5QBHVMMXujg": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Michael E.", 
    "review_text": "Great burgers and an akwardly cramped eating area.   For the bridge and tunnel crowd, this place is the size of your walk-in closet. For those of you that live in the city, its the size of your living room.  With squre footage aside, its got a dirty 1970's street design going that fits well. Good food, open late, and serves up quick. Works for me.", 
    "review_date": "2011-06-22"
  }, 
  "2H6gAvXrIwMTsXhixfKMrw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "A L.", 
    "review_text": "You see all kinds of shady people in here.  But the food is great, who doesn't love a greasy hamburger at 3 in the morning.", 
    "review_date": "2008-11-06"
  }, 
  "xiO5o2gK6_wWUF3oX3DwTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bec S.", 
    "review_text": "when you're in the mood for a greasy, cheap and wonderful midnight cheeseburger...this is the perfect place to go.  they have the most ghetto TV ever behind the counter but their fries are perfectly crisp and sprinkled lightly with pepper.and it's where all the dancers come after a long night of earning the rent. a bit forlorn decor-wise but the chef smiles as he flips your burger.", 
    "review_date": "2007-02-05"
  }, 
  "hRt0yvtG_mMvNgi7jYia-A": {
    "user_rating": 2.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Rachel B.", 
    "review_text": "Dinner in North Beach for under $5.00? Yes, it can be done, but it takes compromises.", 
    "review_date": "2006-12-30"
  }, 
  "mtCw1U7Ks8V5ePwkJ9FqhA": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Angus S.", 
    "review_text": "Sam's Burger's located in North Beach, San Francisco's Little Italy. We were at Coit Tower and it was time for some food so we played our usual Yelp game and filtered the best restaurants within a mile. From an eclectic list, burgers jumped out at me, and boy am I glad. They weren't open and wouldn't be for hours but the owner  (Mike) didn't mind opening just for us and throwing some patties on for my double cheeseburger anyway. We sat at the bar in this since 1966 establishment that Mike has owned since 1970. He recounted to us the days of past. Nixon was president and he served Marines hamburgers before they left for Vietnam. He remembered one Marine in particular who cried as he ate his burger and explained he knew he might not come home and that he might be eating his last hamburger ever. Minimum wage was 1.25/hr and he showed us a faded business card advertising hamburgers for 38 cents, a good night cleared $100 profit. If this wasn't enough...the burger was AMAZING! Seriously the best I've ever had the honor to sink my teeth into  and let the juicy meaty goodness conquer my mouth. If you ever find yourself in North Beach, you owe it to yourself to stop in and say hello to Mike.", 
    "review_date": "2012-05-22"
  }, 
  "ib0-KqDo5vVhRJy7aVGwjQ": {
    "user_rating": 5.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Francesco F.", 
    "review_text": "Sure the decor and the location are not great, but it is the BEST burger i have ever eaten... at least according to MY taste buds... drunk or sober great place for a quick burger!!!!", 
    "review_date": "2014-03-12"
  }, 
  "1xcDcXdu8bK3-tt2wBoGXw": {
    "user_rating": 1.0, 
    "user_location": "Boston, MA", 
    "user_name": "Chris D.", 
    "review_text": "Wandered in around midnight on a Sunday. 2 guys sitting at the counter eating and nobody else in the place, but the guy behind the counter tells me \"20 minutes, you gotta come back.\" The vibe was basically that he didn't feel like dealing with a \"tourist\" and didn't expect me back. So I wandered to the pizza place around the corner and enjoyed some solid slices and friendly service instead. I had been meaning to try this place the last few times I was in town, and will gladly up the stars if I decide to give it another chance and successfully eat there on a future visit.", 
    "review_date": "2014-09-01"
  }, 
  "2StoaiZOxEWZWxeH6penGQ": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Bethany K.", 
    "review_text": "Inexpensive. Quick. Delicious. The burgers are perfect! So much better than you'd expect from a hole in the wall. SO good!", 
    "review_date": "2015-01-27"
  }, 
  "8k3aO-mPeyhbR5HUucA5aA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Victor G.", 
    "review_text": "Sam's or it's predecessors have been here for decades.  definitely came here for pizza and maybe burgers in the 1970's  too druck to remember the tastes, wasn't a foodie then, just a druck so the food must have been ok.  too many choices avallable now to return.", 
    "review_date": "2013-03-24"
  }, 
  "_5fFDlrS900UGNF58OkTLQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lauren P.", 
    "review_text": "Friends and I went here for a late night bite on a Thursday. We all got a slice of pepperoni pizza and it was good. The guy serving us was very nice and gave us a hamburger for free since we were talking about the sign that said something like \"best hamburger\". Again it was good.   In a nutshell, the food is good for late night when you're drunk and hungry. However, if it was day time and I was sober, I probably wouldn't drop by Sam's.", 
    "review_date": "2014-09-29"
  }, 
  "WCiGrGn89yBrVbqXRkejwg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ryan D.", 
    "review_text": "I've been here a couple times and Sam's has great cheeseburgers and fries, the service was friendly, it's a hole in the wall burger joint but the burgers and fries are really good quality considering how dirt cheap the food is here so you get more than what you pay for. I'll be back here again eventually whenever I want to eat a burger while I'm in the city and while I'm in North Beach.", 
    "review_date": "2009-07-08"
  }, 
  "TLzwLBhPoO33w85VOXz97g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobu K.", 
    "review_text": "I saw that there is a green paper on the wall says 90. It's health cord from SF health Dept score in 2011 90! What a great surprise! I thought ..... less, much less than that. But a place like this, I don't care because I can see everything what's going on inside of the counter. But not at BK. I don't think i'd go BK any more. Or Mac.  This is the best Mo%$%^Fxxxin' burger as Tony Bourdain said. Even though he was so drunk when he was here. I wasn't.  It's grilled burger. A guy who cook burger, after he put a hamburger patty on the grill, that was it, he didn't touch the patty at all. Leave it for few minutes, and a little while after, came back and flip over, that was it. I didn't see the cook push the hamburger patty with spatula on the grill at all.  Very simple process. But, you'll get a most great dripping juicy tasty burger here at Sam's.  I got a double cheese burger. $6.50!!! 6.50 for double cheese burger is hard to find, and it's good, so good. Indeed the best burger in SF.  OK, there are good burger joint in SF that sit down a nice table, ask waiter to get it, and paying 17 dollars for a burger that grass fed black angus beef or Fxxxin' Kobe beef Mozafxxxer, shit, no, no, no, Hell no!  Kobe beef is great for steak, it isn't really good for a hamburger anyway.  I know that they have do burger great but it's not my kind.  This is my kind. It's a $6.50 simple burger that hamburger suppose to look like. Fries was good and hot.  Well, my top Five under 10 dollar burger in SF would be:  1. Sam's 2. Hall of Flame 3. Joe's Ice Cream 4. Hamburger Heaven  5. Bill's place", 
    "review_date": "2012-01-16"
  }, 
  "EGBVfQeXjkoY9aMBXp-S8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin H.", 
    "review_text": "I love Sams!!!! dont get me wrong i havent had anything but the double cheeseburgers, but once youve picked a winner you stick with it. Feels just like home eating here.", 
    "review_date": "2009-08-17"
  }, 
  "MuuH9Bdb7rI9fAD19tyV2Q": {
    "user_rating": 5.0, 
    "user_location": "Bayview/Hunters Point, San Francisco, CA", 
    "user_name": "John X.", 
    "review_text": "I love these burgers. I wake up craving them for days. A cup of coffee and a burger after drinks is a flawless combination.", 
    "review_date": "2012-11-16"
  }, 
  "kLh6DJKLi9c46NqIokmPaA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Erin M.", 
    "review_text": "A great place to stop in and refuel. It's quick, it's good and it's filling. The pizza in the window looked like it had seen better days, so I opted for a cheeseburger. In a venue that could use a thorough scrubbing, it was reassuring to watch him grill up the burger and add all the fixins.   Although it's certainly not a reason to try and park in North Beach, Sam's will cure those rumbling noises in your tummy when you need it. Get a burger for roughly $5 and enjoy.", 
    "review_date": "2008-05-12"
  }, 
  "56NWgfYChWGSPpxcSW19jA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Q W.", 
    "review_text": "This is the best place for a late night snack after a night of drinking. they close at 3, so its an awesome place to go after bar hoping on Broadway. Double cheeseburger with half onion rings and fries and a drink, cant go wrong with that!", 
    "review_date": "2008-12-09"
  }, 
  "uQfKo-FDcAfUmHPDhl99aw": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Milbrey J.", 
    "review_text": "For 50 years I have had the privilege to lunch at Sam's Grill. It has been a joy to deal, over the years, with Mr. Walter Seput, John, Walter, Aldo, Giovani, Franco, Christina, Phil, and Gary. This is not a place for the uneducated tourist, you must have a  love of the history of the City and understand the who and the why people have past through that front door. If you want the best meal in the Bay Area, go to the French Laundry, if you want to understand the City by the Bay, go to Sam's Grill. But be warned, do your homework first.  It's an unbelievable experience.", 
    "review_date": "2014-10-13"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "I once ate here at 2:30am one night - a greasy cheeseburger, fries and a coke - met two shady guys (that happened to live in the Mission like I did at the time) at the counter - and for some reason we decided to all walk from North Beach back home. Interestingly, I'd still go back, the burgers are pretty good.", 
    "review_date": "2005-04-28"
  }, 
  "z4nxf4E0Oj6yTxJB5GePNQ": {
    "user_rating": 4.0, 
    "user_location": "Springfield Township, NJ", 
    "user_name": "Steven F.", 
    "review_text": "My son and I had a great burger. Refills on the house and a must go as the food is great. Don't judge this place by how it looks. A must go if you like the quarter pounder.", 
    "review_date": "2012-08-28"
  }, 
  "sH_t9HCv3hIxVagul3J3gQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William B.", 
    "review_text": "I don't believe the hype... there are way better late night spots in the area to get your grub on.  The burgers here are definitely 'meh', and the other options are just straight outta frozen bags.  Thankfully they were out of the chicken wings when we ordered them, but it would have been nicer not to have to wait 10 minutes to get this insider info from them.    If you are purely just looking for something gluttonous to stuff in your face and clog your arteries late night, do it.  Otherwise look elsewhere.", 
    "review_date": "2011-12-22"
  }, 
  "wWUajrw9SxlbYU_afos-wQ": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Calvin J.", 
    "review_text": "$7 for a burger, and when I asked for it to be well-done, he says \" this beef doesn't cook well done\". That says a lot about the quality of the meat if u ask me. It's poor. And the burger was just average. I wasn't impressed. I've had way better. The pizza is dry and flavorless. The cashier has an attitude. There's lots of great places to eat late night in the north beach area. Don't waste ur time here. I don't care what Anthony Bourdain says.", 
    "review_date": "2014-05-08"
  }, 
  "OCcHlcwqFtHcKFo5t4UBYA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "Double burger with cheese and fries were delicious. And it was open to fulfill my hunger at 2:30 in the morning. They also have fried chicken, fish n chips and pizza.   Busters turned off their grills, so Sam's is where I went. And it was good.", 
    "review_date": "2010-03-23"
  }, 
  "MzL2FOFRYC7-TliJbTlIig": {
    "user_rating": 1.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Valerie P.", 
    "review_text": "Fuck this place. Racist ass..we were there and he skipped us over when we had our hands up and he was taking orders from other people that came after us. Shit looks mediocre anyway. Only tastes good cause you're all drunk.", 
    "review_date": "2014-12-14"
  }, 
  "xOKvT7QDNSgdOI46Kr1p_Q": {
    "user_rating": 5.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "Trina R.", 
    "review_text": "I so don't even know where to start, with the food, or the people.  It was all awesome!  I spotted the place earlier that afternoon while walking around San Fran, peeked inside, and just knew I had to try it.  While checking out the end of the SF vs. Dodgers game on a Monday night we decided to finish watching it at Sams while getting a burger.  Come to find out that the game went into overtime and Sams served beer.  We ended up drinking Coronas and chatting with the coolest people, which included customers, the owner, and the coolest, funniest dude who was working the counter (what up Nabil!).  We didn't realize that Anthony Bourdain was a fan of the place and I loved the t-shirts they were selling with his quote on it.  I wanted to buy one, but they were out so Nabil gave me the shirt off of his back!  What a great guy!  We ate burgers; got onion rings and fries, and were never more satisfied.  .  The burger was a simple sesame bun with American cheese, lettuce, onion, tomato, and dressing.  The fries and onion rings were crispy and everything was hot!  They never ran out of the Corona I was drinking, which actually happens to me in bars all the time.  It's open late and is very reasonably priced!  This place is a must whenever you're in SF!  Enjoy people!", 
    "review_date": "2014-10-01"
  }, 
  "pxbuE2pijzFVSND88CtqkA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan P.", 
    "review_text": "For a hole in the wall its got some A+ cheeseburgers. If you sit down there they give you a whole white paper plate of fries and they use that \"snow type\" ice in the soda. Its open late and extremly close to the gentlemen establisments on columbus and broadway and other local boozerys", 
    "review_date": "2008-01-27"
  }, 
  "zPhDGOunNrVjnBd8zQ93bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "The best burger in San Francisco. The owner and his crew are wonderful people who actually have an interest in the locals who eat here. People know you by name and by order here. No a soul gets judged here ( extra star for that alone). This is the kind place out of a movie where if you're having a bad day the guy behind the counter might give you some advice or some free Fry's to cheer you up. The interior is old and funky and fits San Francisco like a glove. This place is an establishment I hold close to my heart and my stomach.", 
    "review_date": "2011-06-27"
  }, 
  "JsdOgJgT0OeatcxImh5fCg": {
    "user_rating": 2.0, 
    "user_location": "Savannah, GA", 
    "user_name": "Jonah H.", 
    "review_text": "As I prefer to do, I start with the positives:  1. Open late and open during holidays, the mark of a true city eatery  2. burger is okay, may'be a 3.5 but at least a 3 compared to real burgers (not Burger King, McDonalds or Jack n the Box crap) places like Clarkes in Mountain View, CA.  3. Great location in between Little Italy and Chinatown and the North Beach strip clubs   Negatives  1. rarely any parking  2. only takes cash and if don't have any cash on you and you've overdrawn your Wells Fargo account or use Citibank, BofA or Chase, you got a long walk to go  3. French fries are awful, really really bad  4. Pizza not always available  Also, there's often a long wait, don't expect a In and Out fast food turn around  Burger, fries &amp; coke will run about $9 + with tax", 
    "review_date": "2014-12-25"
  }, 
  "7CWRoP0f4TLwRkYR5syiqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew M.", 
    "review_text": "Hamburger was great, French fries were crispy and large but nothing special taste wise. Service is very good. Love the atmosphere.  My only beef with this place is that I feel like every time I come here they are out of things. \"I'll have some onion rings\" .... \"we're out.\" \"I'd like to try your pizza\".... \"we're out.\"", 
    "review_date": "2013-08-10"
  }, 
  "h6pFO2_s-BVbJwL_V_qT6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Avram K.", 
    "review_text": "This is an awesome place to blend into the wood work, chill out, watch some wheel of fortune and trip out off of a cheese burger. I would buy a cheese burger with no fries or drink for like 5$. They sometimes will hook up some fries. It's a pretty tough place. I'm pretty sure the owner's name isn't Sam. It's a chill spot for laying low. Wild urban fearless red necks will sometimes come in and steal the show acting super weird, asking all kinds of trivia questions about burgers and what not.", 
    "review_date": "2014-09-24"
  }, 
  "JdEajwzz65ekE6if4pKO2w": {
    "user_rating": 2.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Jack B.", 
    "review_text": "I had the cheeseburger and fries and my friend had the chicken wings. The cheeseburger was not really that great. The chicken wings were not anything special. Anthony Bourdain must have been drunk!", 
    "review_date": "2012-04-03"
  }, 
  "WaQ7KcZd3wVozXiDFWIDVA": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Niniane W.", 
    "review_text": "The cheeseburger is amazing.  It is also prepared quickly, and is cheap.  I will be returning.", 
    "review_date": "2011-06-30"
  }, 
  "RqBqawG_W3tmCnTkSTpbaQ": {
    "user_rating": 5.0, 
    "user_location": "Murrieta, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "My boyfriend and I decided to head over to Chinatown. Being that we just moved up from So Cal, we didn't really know how to get there so we relied on my GPS which landed us at this parking garage close to Sam's. So we're just walking down the street and passing all these Chinese Restaurants and we stop in front of Sam's. My boyfriend isn't the adventurous type so trying any of the Chinese food joints was not an option. So he goes in, and gets the house special except he aske for half a pound. I get the three piece fish and chips. We watch him cook the food and both take our first bite. It was amazing! I took a bite of my boyfriend burger and it was tender and juicy. I would definitely order one next time but with everything on it. My fish and chips tasted amazing as well, crispy and delicious! I would definitely recommend this place, and if I lived closer I would definitely be a regular.", 
    "review_date": "2009-09-05"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Only eat here if you are drunk.  If you eat here sober you are an idiot.  Its pretty much a double whopper.  Its only $6 so add another star.  woot!  The owner kicked us out cuz we were eating too slow during a friday night.  Biatch.", 
    "review_date": "2010-04-01"
  }, 
  "uvoWDiH8ryFeeSNu6UPoZA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ai T.", 
    "review_text": "ordered the double cheeseburger, The beef is cooked just right with the perfect amount of juiciness, and the service was great, what else is there to ask for? definitely coming back for more", 
    "review_date": "2012-07-23"
  }, 
  "PKUW9VOkdAs-FOFt0KlibA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexia A.", 
    "review_text": "I came here hungry, with hardly any cash, late at night, and it was just the spot to be at.  Sam's is open late. The burgers are a good size and you get fries on the side. For what you get, damn, I was full and hadn't even finished my fries!  Love that old-style cash register. Yum!", 
    "review_date": "2012-01-20"
  }, 
  "orZl8qRLHU8oKmmLZbLDFA": {
    "user_rating": 5.0, 
    "user_location": "Whittier, CA", 
    "user_name": "Johnny K.", 
    "review_text": "This late night burger spot was pretty amazing. The customer service is great and the burger and fries though done very simple manage to pack a serious punch. I highly recommend this spot.", 
    "review_date": "2012-04-20"
  }, 
  "OqgYxqEHc9K7oq-8VHJgxw": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Francis K.", 
    "review_text": "An interesting clientele to say the least...prostitutes, pimps, crackheads, strippers, and regular joe blows...the creme de la creme of late night north beach gourmands...Killer greasy burgers and sub par pizza slices....the cheeseburger/fries/coke combo is the best deal for post 2 am eating in all of the beach...", 
    "review_date": "2007-07-31"
  }, 
  "WzFikK1Es6Qc_xKljYcBAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie C.", 
    "review_text": "There's a Burger Joint in Chinatown?!  A San Francisco native who has made many many trips to Chinatown and just recently discovered Sam's, I feel a little asahamed.  Anywho, you know you gotta eat after a night of dancing and getting down with the get down and Sam's burgers def hit the spot. Cheeseburger was on point, fries were deelish, service and quick, folks were friendly. What more can you ask for?    We were in, we were out, twas' a good night.", 
    "review_date": "2011-11-15"
  }, 
  "T-wHqY3D3h5vBfiPyQqzDw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Roxana K.", 
    "review_text": "I don't know what else to say but \"BOMB\".  Thanks to our good friend with excellent taste buds and Anthony Bourdain, we stumbled into this joint on our way back from an evening of fun and drinks in Chinatown.  Our hearts stopped when we saw the \"open\" sign but it was locked. After peeping in and concluding based on said evidence that someone was either in the back 'handling business' or what not, we decided to stick around and stare into the shop until someone came out.  I glanced down the sidewalk and noticed someone strutting towards us in shorts, a t-shirt, and socks with sandals (WTF?) holding a sack of something.  Once he reached the door he says,\"I needed to get change.\"  If that's not the coolest way to greet a customer, then I don't know WHAT is!!!!  Alright, you got my quick 'storytelling' intro of Mike so down to the food.  EFFING BITCHIN.  I had the cheeseburger and onion rings. The food is cooked so simply yet tastes so good.  I can't explain it; you have to try it for yourself.  To wrap up the ending, Mike's bro stepped in to relieve him and Mike went from our chef to our tour guide.  Needless to say, he's a super cool kat and will definitely hit up the spot to peep in and say hello and if I end up stuffing my face with a cheeseburger and onion rings, SO BE IT DAMN IT!!!!", 
    "review_date": "2013-04-16"
  }, 
  "7HXNXXgmnSrPgnpvKfZoAg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "lori s.", 
    "review_text": "the thing about sams, is it's a food adventure.  i feel like if you put a burger from big mouth right next to a burger from sams, i'd eat the big mouth burger.  but the thing is when you go to sams, it's the old fashioned decor.  it really teleports you back in time.  and the soda fountain.  and the window to the street where you can watch the crazy people.  i have to say, i do love those spicy fries too.  and when i was there sam was showing the video tape of when anthony bourdain came in to do his show.    on top of all of that, sam is a great guy.  and that makes his burgers taste even better.  sams is fun, inexpensive and the food is good.  it's not overly greasy and it won't make you sick.  i think you'll like it.", 
    "review_date": "2012-03-12"
  }, 
  "EByvYTFfDbeSyj6mmScivQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Duvell D.", 
    "review_text": "4 stars.... actually 3 stars, but since it was on t.v. and Anothny Bourdain recommended it...lol..there you have it. Not the top 10 best burgers in the \"world\" but it is a cool place with \"history\" so when you are in San Fran, stop by for a late late night burger and get the I was there T shirt.", 
    "review_date": "2013-10-08"
  }, 
  "B7lSERdDbXkYQbD3Xu8YyQ": {
    "user_rating": 4.0, 
    "user_location": "Nob Hill, San Francisco, CA", 
    "user_name": "Paula U.", 
    "review_text": "This is definitely a hole in the wall type of place.   Sometimes my husband and I would go here and there's no one inside, even the staff. The guys usually take a break somewhere to smoke. I seriously doubt that they wash their hands before serving,  but Germs are healthy, being too clean is deadly! Lol!  Anyway, the burger is good and really cheap but it's not \"top three in the world\" as Anthony Bourdain said.   I would still go here if ever I get a craving for a good old fashioned cheeseburger.", 
    "review_date": "2013-10-25"
  }, 
  "4Majsw4pzLx5LmV6WasSOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa R.", 
    "review_text": "The fries are deliciously flavored with garlic and pepper, and the burger tastes likes something out of a home backyard bbq. It is SO good. Being the small girl that I am, I usually cannot finish an entire plate of fries and a whole burger. But every time I go to Sam's, there's not a drop left on my plate.", 
    "review_date": "2010-01-25"
  }, 
  "8AjmaGfsVOcRkJ7qyXRZAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abel L.", 
    "review_text": "Hey you want to replicate that July BBQ where someone breaks out the grill and just makes burgers? YUMMY IN MY TUMMY.   Plus their ghetto TV has the STRANGEST channels on. It's a locals/cops/richer hobos joint, so you'll feel you're on the in, unlike middle school.   Plus, they have this Algerian guy besides Sam who's pretty awesome possum as an individual. It's one of those places where you'd go for the people.   Takeaways: - Cash only.  - It's a diner set up with six seats, expect breathing room appropriately.  - There are a lot of nudie bars nearby, so if you're bringing kids...ear muffs and sunglasses.  - TIP: If you talk with the guy manning the grill, he'll throw extras on the burger for you if you get the $8 meal.   If you're a local, you know what's up. If I wasn't on P90X, you'd see me here weekly. WEEKLY, I DARESAY.", 
    "review_date": "2010-10-13"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "This is an oasis of late night eating in the middle of douchebagville.   I have been to this place many, many times. They serve all sorts of greasy food, but in my humble opinion there is only one menu option worth exploring and that is the burger.   I say this as a drunk person seeking drunk food. If you want to know what is good when you are sober you will have to ask someone else.", 
    "review_date": "2007-04-30"
  }, 
  "g8OX-uJIOJyVe60Zxp-uKg": {
    "user_rating": 4.0, 
    "user_location": "Charleston, SC", 
    "user_name": "Dariel S.", 
    "review_text": "I definitely went to Sam's for the experience. I watched Anthony Bourdain sit in that stool and munch down on a cheeseburger so I thought I would give it a try. I would say it was okay. Pretty much what I expected, your typical drunk, Street food", 
    "review_date": "2014-11-01"
  }, 
  "GBc0JzFKfLNvZdqMwxojsA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony N.", 
    "review_text": "Now this is a MAN'S PLACE!!  dirty, funky, and drunk guys eating nothing but burgers and fries.   Prices are damn cheap and the food is damn good.  Their fried chicken is *sweet* and the people working there are honest and hard working.  Also very cool to talk to.  T, the cool, slack cook, will make cracks at you.  My friend once ordered milk there and T ripped him a new one.  It was awesome.  A must if you like grungy.  ..........dont' get the pizza though.  It's not that good.", 
    "review_date": "2007-10-24"
  }, 
  "MxluzI5vFj4f8nB1bPJk_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty W.", 
    "review_text": "Sam's is a no frills and no fuss (but just a little bit of muss), tiny little burger dive in North Beach, right near all the action on Broadway. The joint consists of just a basic counter with a few sticky stools. Sodas (or water) are poured into red solo cups, freshly grilled hamburgers on a perfectly dressed and toasted sesame bun are served up on paper plates (alongside piping-hot, fresh fries -- if you please), and you and your former burger craving will leave, totally satiated for the time being . . . all without breaking the bank.   The folks who work here are also all incredibly nice. And, I really like that despite its appearance on national television (with a high approval from Tony Bourdain) and their high ratings on Yelp, it still maintains the flair of a neighborhood spot.   While they have random items (like chicken nuggets and pizza) advertised, even their owners will claim that those who know what's up at Sam's go for one thing: the super basic but super delicious burger. I've had their burger both after a few drinks and in the harsh, sober light of day and can attest to the fact that, regardless, it's legitimately tasty.   If you're in the area and have a hankering for a simple but delicious burger, this is it.", 
    "review_date": "2014-08-13"
  }, 
  "Xqvz7wAAapUI8YAIydfaSQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rhea K.", 
    "review_text": "5-stars for the burger, but 1-star for the younger waitstaff.  I'll start with the burger.  We got a double cheeseburger with fries.  I personally would skip the fries, but the burger was pretty good.  There was just the right amount of char and the cheese was nice and melty.  The burger was large, but could still fit in your mouth.  The older guy making the burgers (Sam?) was really nice.    The younger waitstaff was extremely rude.  He was cold to us when dealing with us, and also overcharged us.  Apparently, that's a common thing from reading these other yelp reviews.  We got two double burgers with cheese, and two fries.  The double burger was $7.50, cheese was $0.50, and the fries were $2.75.  Even if he had charged us $0.50 for each slice of cheese, that would bring the largest potential total to $22.50, and we were charged $24.50.    Additionally, he made kind-of-rude comments to us.  I couldn't tell if he was joking, so I brushed it off, but he wasn't laughing, and implied that we took too long to finish our meal.  We were only there for 20 mins.    Overall, nice burger, maybe take it to go though.  Also, watch your final bill very closely.", 
    "review_date": "2013-12-07"
  }, 
  "0QQ3xEk9puuIkFoGz7PntA": {
    "user_rating": 4.0, 
    "user_location": "Riverside, CA", 
    "user_name": "Webb P.", 
    "review_text": "I love Sam's!!   Many of the best places in San Francisco are Cash only hole-in-the-wall places.  Sams doesn't open until 4 p.m. and I've always staggered in between midnight and 2 a.m. after many a night out.  I always manage to get a hotel room close by so I can patronize Sam's.  I will typically get a double cheese burger and a Sierra Nevada beer. The burger is tossed on the grill, cheese is on top, patty is stacked and the bun is toasted.  I don't get tomato or pickle but lettuce is ok.  Nothing better in my mind when it's late and I'm cravin' a burger.  It is a tasty burger.  I noticed a number of folks buying steak sandwiches too so that's an option as well.  The french fries were cooked up on the spot but I didn't want to get a heaping order of carbs to sleep on.  I think the menu had just enough items for basic grub and it's all cooked up in front of you.  The place is small and tight so it's convenient to get your grub to go if there's no place to sit or if you're claustrophobic.  It was amusing to see bleary eyed people stagger in only to see them brighten up and stroll out after having some tasty food.  The food hits the spot it's economical and it's open til 4 a.m.  Come by and get your burger on.", 
    "review_date": "2012-02-25"
  }, 
  "TZp9tzgSBV8C_plU4CvHAg": {
    "user_rating": 5.0, 
    "user_location": "Grapevine, TX", 
    "user_name": "Jeff J.", 
    "review_text": "Bourdain was right. Damn good burger... Especially for late night. I'm picky about burgers, but this one I liked. Double Cheeseburger, Fries, and a Drink: $12. Well worth it.", 
    "review_date": "2013-02-03"
  }, 
  "gIsRWXd92cG1WZR50w75tw": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Kay W.", 
    "review_text": "the second best late nite dining spot out there.  (yuet lee's is #1) do get the cheeseburger \"special.\"  but you HAVE to get there early if you want the fried scrimp special.  (before 1:30am) and when i say scrimp, i mean SCRIMP", 
    "review_date": "2007-06-19"
  }, 
  "wY2yVUIInWBlohhqvdZ1WA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Joey S.", 
    "review_text": "On your way home from the bars at 2 in the morning? Got the drunchies like no other? This is the place to be. Great burgers and greasy food to help soak up alcohol for a slightly less severe hangover the next morning.", 
    "review_date": "2014-02-23"
  }, 
  "Q9st0y6CJGT5gtgq-nCbSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shadi K.", 
    "review_text": "Great late night bite.  Burger is great, fast service, respectful team.  Will swing by whenever in the area.", 
    "review_date": "2011-11-13"
  }, 
  "yC52kZFfgjHJc9gUNsxSUA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robin J.", 
    "review_text": "The review's made me think it would be better than it was. That being said, it was pretty good. The burger is big and you get a lot of fries, which is great. The buns are toasted. It's a little pricy for a normal burger.", 
    "review_date": "2012-12-19"
  }, 
  "AnIXqhPe0cGko0Ws_jsepQ": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jessica F.", 
    "review_text": "When you're approaching 10 pm, you don't much of a selection of places to eat anymore. I came here, walked to that Chinese restaurant, walked back here and thought I might as well try this. It had good reviews after all.  The owner was just sitting outside, kind of minding his own business. I walked in with my boyfriend and was greeted by a pretty friendly guy! He told us about Anthony Bourdain's visit and pointed out the frame at the wall.   I decided to get the single hamburger combo and my boyfriend got the double combo.   First of all, the burgers were neat--even my boyfriend's which had everything in it. I like a neat burger that doesn't fall apart when I squeeze a bit.  Secondly, it closes SOO LATE. I like places that close late, especially ones with neat burgers.   However, the burger itself was what I'd call an average burger. It's definitely better than the typical fast food joint, but it's not something I can't make at home.", 
    "review_date": "2012-05-29"
  }, 
  "h2L5yg0GYcSXppnFbCt80w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynn P.", 
    "review_text": "On a late friday night after a friend's bday party, we can here for a late night snack since my bf was starving. So we managed to get 8 people to come with us including the drunk bday boy and had no problem getting seats (i think it was around 230am). i'm not gonna lie. i was buzzed and i had the most delicious slice of pepperoni pizza ever! it was a big fluffy slice and you get the melty yummy cheese pull. my bf got the burger special which included fries and drink. everything came up to be 10 bucks. i think that's a great deal. the guy serving us was awesome and i think we will be coming here again after the next party", 
    "review_date": "2009-10-18"
  }, 
  "Hj_GF8MnikDy4BQzf0B8Dg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith K.", 
    "review_text": "There's nothing like being drunk after the bars &amp; curing your hunger with a bite @ Sam's!  I've been there on a few occasions and it has not failed me yet.  My friend likes to order the \"schrimp\" with fries and some nights it actually sells out.  But my norm is the cheeseburger w/ fries and a side of hot sauce.", 
    "review_date": "2007-02-27"
  }, 
  "2DThu3F2302BnXKjY6qGhg": {
    "user_rating": 5.0, 
    "user_location": "Morgan Hill, CA", 
    "user_name": "Jason R.", 
    "review_text": "Yes, yes, yes. Go there, have a burger. Best late night burger in the area.", 
    "review_date": "2014-07-30"
  }, 
  "jCbB2UKfrvSGgWq-6ep7Gw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert P.", 
    "review_text": "I'm not sure who Sam is and I haven't really been here in a while, but I do know that there is (or was) a guy who worked there who gave me a life lesson. Let's get this out of the way, burgers here are excellent and come with a lot of fries and cheap soda. Go here after lots of drinks...  There's a guy that works here whom my friends and I started a conversation with. While he flipped our burgers, fried our french fries, we all, separately made our opinions about who he was. He looked pretty, umm, like a below average fellow. Probably flipped burgers for years, not doing much with his life, it was all written down in our minds before we knew the guy. That is until we spoke about politics, history, medicine and it became clear this guy, working at this whole in the wall place called Sam's, was a bit smarter than your average Joe. In then end, he told us he was going to get his PhD in biology or some shit like that... GOD! We walked out of the place feeling like complete shit. I turned to one of my friends and said, \"Wow, I feel awful about myself.\"  A life lesson was made here at Sam's... For that, I lend my measly five stars and am humbled by someone better than me. I'm an asshole.", 
    "review_date": "2008-01-10"
  }, 
  "3CQOj4EeDR7HRnLVPsQhBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yishian Y.", 
    "review_text": "Small late night spot nestled right on the border between North Beach and Chinatown. There's nothing quite so satisfying as sinking into a good burger at the end of a great night out. I'm just so happy its (reasonably) close to my place and open decently late. We need more late night options in this town!", 
    "review_date": "2014-05-13"
  }, 
  "5-QWl7QDXQVPDbbRDHdgTA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "this has NEVER  done me wrong.  i was once shusshed by the grill meister, but it doesn't matter.  yum.   yum.  yum.   ranch dressing on damand for those who love a little ranch with fries...  oh.... when late night...there is no better cure...  this place makes my stomach sing with delight....", 
    "review_date": "2007-03-16"
  }, 
  "wzjcOnDlqjZ8QTDGF0g9aA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amir M.", 
    "review_text": "Sam's Burger is good, but the best Burger in town? I beg to differ.  However, if you're a burger joint, you don't have to be the best to win my heart, you just have to have really tasty burgers, be open really late, and I have to be craving you (the burger, not the joint). Sam's burgers qualify for that. The burgers taste really good, the fries are fresh, and it's open till 3 am on most days I am in North Beach.", 
    "review_date": "2008-02-08"
  }, 
  "NQWEL3b_VwHNCfu4OB6nqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Henry F.", 
    "review_text": "I was this past weekend on Saturday and Sunday nights. I had the double patty burger, fries, and a beer ... $14 total. Where else can you get that in the City?  The burger was juicy and tasty, the fixin's on the burger was good too! Fries were served hot and with a light crunch, golden brown. And the beer straight out of the fridge was great to wash it down.  On Saturday night, it was a bit packed at around 11 p.m., I had to stand at the end of the bar, but the food was served right away. On Sunday night, only a few folks were there at around 9:30 pm, but the food and service was equally as good.   I stayed over at the Palace Hotel on New Montgomery Street and walked over in about 10 mins or so. This is a great place to grab a burger at any time of the day. Do yourself a favor and grab a burger there.", 
    "review_date": "2012-01-23"
  }, 
  "dnGIi-OjEui4OSsmLQ2lPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sunny S.", 
    "review_text": "After a long day punctuated with an acrimonious albeit brief drinking session, which is the worst kind of drinking session in the world, I decided that indulgence was in order. My soul needed healing.   And heal it did. A day after the fact, and I can't place my finger on what is so wonderful about Sam's, but I'll try to explain.   Sam's is located in North Beach, wedged inauspiciously between multiple Asian and Italian restaurants. You probably wouldn't go to North Beach for a burger, but you should probably go for this one.   The restaurant itself is tiny, dumpy and old. It's perfect.   The man taking your order is also the man cooking your burger, and he is as charming as the day is long. \"Do you want everything on that?\" he asks, rattling off ingredients. \"Everything,\" I say, \"except onions.\" He grins, \"One cheeseburger, extra onions?\" This pleases me.   The burger itself also pleases me. Juicy, delicious, flavorful. It's perfect. Let me be clear though. If someone had merely bought me this burger, and I hadn't visited Sam's myself, I probably wouldn't like it as much as I do. The experience of going to Sam's is as important, if not more so, than the quality of the burger.   The man gave me a side of ranch and a side of sriracha. I just wanted to hug him.   I was long gone into the night when I realized I had forgotten my red and black polka-dotted, ruffled umbrella. The man held it for me up front. When I rushed back in, he said \"We don't have anything of yours,\" and winked.   You want to go to here.", 
    "review_date": "2014-02-27"
  }, 
  "VeljTRtwv8RJfKxWS5duMw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael L.", 
    "review_text": "As the other yelpers mentioned, the owner of this fine establishment is named \"Mike\". For having one of the best names in the universe, thats plus one star.  I kid.  I have been here more than once and completely sober. Sam's Pizza opens at 5pm which is a good time for being on the Broadway. The place may look dingy and out of date but it makes up for it in the food. The quality of the burgers are superb, juicy, hot, and ({--- example of a oxford comma) awesomely tasty. I have had the polish sausage there and I can't settle for anything else anymore. The fries are really good and the onion rings are...well...REAL ONIONS!  The only thing this place needs is a new television and it'd be the perfect spot to relax and eat-in.", 
    "review_date": "2008-05-09"
  }, 
  "kg8tWKYrB9I6VThlxTaD-A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victoria B.", 
    "review_text": "I'll go 2.5 stars  I'm perusing the San Francisco food scene via the internet and saw that Anthony Bourdain was in town and tried out Sam's. Intriguied, I knew I had to try it immediately. If a hole in the wall place, amongst all the seedy and dirty strip clubs in North Beach got Bourdain's attention, then it had to be good!   We went here after the gym around 7pm on a Friday night. Of course, there was no parking. I cruised along North Beach while my boyfriend went inside to order for us for takeout. He took a picture of a letter that Bourdain wrote that said \"THAT was a good motherfuckin' burger! Top 3 in the world!\" Well shit, this must be the best burger ever then!  Apparently there are very few things on the menu--so we got one cheeseburger, one hamburger, and one chicken sandwich. We also ordered a side of fries. When we got back home, my mouth was salivating. I opened up the bag, and it looked like a home made burger. I took a bite anddddd \"it was just ok.\" And letme tell you, don't order that chicken sandwich. It's not good. At all. Bland is the word that comes to mind.  Am I the only one that finds In N Out so much better? This place was fine, really cheap, but not worth for me to go back.", 
    "review_date": "2011-09-08"
  }, 
  "Ca9Dawbb2sJXHb57L_wjQg": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Lisa C.", 
    "review_text": "The perfect dive burger joint. Emphasis on dive, and perfect.", 
    "review_date": "2013-05-04"
  }, 
  "dUy6_kVJaM6XiGCgbkjClQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Nathaniel L.", 
    "review_text": "Burgers are divided into two categories: The kind that are horrible, dry, overpriced nightmares with crumbly buns, and the kind that are delicious. Sam's is the second kind. It's like eating a Frank Sinatra song, or Frank Sinatra himself, if he were an all-beef patty. The fries are nothing to write home about, but you don't care because you're too busy feeling like you just found the treasure at the end of Goonies while everyone else is getting hamburglarized in the Mission for half their wallet.  Do not order the pizza here, unless your name is Chuck E. Cheese, in which case, you will love the pizza.", 
    "review_date": "2009-12-21"
  }, 
  "EdXA9CZ_FinAY0tNW3u4ew": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin S.", 
    "review_text": "Holy smokes, talk about success going to your head! Tried placing an order for pickup, knew exactly what I wanted: \"yeah, whatever, call back in 10.\" Okay, I'll call back in ten. Thought it might be easier if I call ahead. Called back in ten: \"Hey, you know what? Either come in or don't call back, okay?\" Okay, think I'll choose the latter.", 
    "review_date": "2014-04-27"
  }, 
  "UVABPi8IjhHozWsUb1Svbg": {
    "user_rating": 3.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Rashad J.", 
    "review_text": "Great customer service and kindness. The place is kind of a hole in the wall. We almost missed it walking on foot. The good was good but needed more flavor/seasoning. We got our food fast. Kind of on the expensive side.", 
    "review_date": "2015-01-02"
  }, 
  "MU_bppwgP03jfpTo6vtZ5w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lisa H.", 
    "review_text": "Thought I'd already written a review here. But tonight as the BF, Maddie the mini dog, and I sat at his counter sharing a double chz burger with bacon and avocado, an entire plate of fries, and a glass of cab for $14.00 I had to check..  Tonight we were lucky enough to have Sam be our waiter/chef. That slash being ever so important.here where it includes bidder, cashier, dishwasher, and host...  The only negative at Sam's obviously isn't the free ranch, the personal treatment, the dog on my lap, the owner cooking your food.  But the downfall is finding out Sam isn't Sam he passed in the 60's but the new owner Mike who kept it all the same may not be Sam, but who cares we love  him. There was never a Mel at Mel's or a Joe at Original Joe's.. Mike is an awesome \"Sam\"..  5 stars.. :)", 
    "review_date": "2013-03-21"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Sam's what can I say you survive through the good and bad times. See it's like this people Sam's is located on Broadway between stockton&amp;grant. I bet he will still be around another 10+years as all the businesses on broadway some closed up for good you see teahouses,pet stores,restaurants...etc closing up. Not here man you will get your burger just the way you want it. Small cozy no bs type of joint better know what you want within 2 minutes of entering Sam's. I got my burger and fries settle in trying to eat then a call came in saying a suspicious package was nearby and the police was in progress of closing down stockton/vallejo st. I jump up and said I need it to go my car is park nearby that location. Got to my car and couple of central station SFPD officers already lockdown the street. Good thing I knew a couple of them let me in vehicle and drove off to washington park across from st. peters and paul sat in car ate my burger and fries. It was good the fries just got a little soggy from 20 minutes earlier but I can't blame Sam's as it was hot and crunchy when it came out. Afterwards I drove by the area and police had no one on the streets so I said boy I'm lucky I moved my car out of there. With situations like that you never know how long it will take for them to determine if it's safe or not and the burger delicious season just right.", 
    "review_date": "2013-01-28"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "And the SHADIEST Business Award goes to...  Ok Sam's, SO Anthony Bourdain put you on the hot map claiming that you have \"one of the top three burgers in the world\". Props to you BUT there is absolutely NO excuse to RIP OFF your customers!   After partying at Bubble Lounge on Friday, we needed something to soak up all the copious amounts of alcohol we consumed. While my friends wanted Asian food, I convinced them to go to Sam's with the magic words of \"Anthony Bourdain\".  Sam's is a small, divey greasy spoon between the popular late night drunken eats on Broadway: New Sun Hong Kong and Vietnam Restaurant. They close at/around 3 am depending on the flow of traffic.   I placed our order with a younger guy who calls himself Fatty (Sam was also there): 3 Double Cheeseburgers and 2 Slices of Cheese Pizza. \"It's going to be $42.\" *scratches head* The total seemed high but I was buzzed and I didn't think anything of it because we've paid more for four people before. I handed him $42 (cash only) but never received a receipt. When you're buzzed, the ONLY thing on your mind is getting your grub on (ok, maybe that's one of two things) so the last thing on my mind was a scrap of paper.   When I woke up the next morning, I remember my friend (who's a Sam's regular because he DJs nearby) telling me that the cheeseburger with fries is about $6. I immediately checked Yelp to confirm. I referred to my Yelp friend, Nobu K.'s review on 1.16.12 which confirmed the Double Cheeseburger w/ Fries was $6.50. For the 3 burgers alone, our total should have been about $20. Assuming each slice of cheese pizza is at the market rate of $3, our total should have been around $26. Fatty OVERCHARGED us $16!!!  HELLA SCANDALOUS.   (Looking at Tom F., Ray F. and Joyce C.'s reviews, it seems this is a reoccurring problem.)  SHAME ON YOU for taking advantage of your vulnerable customers! Considering this, I don't even want to imagine what goes on behind closed doors.   P.S. - As far as Sam's being \"one of the top 3 burgers in the world\", I love you Bourdain but PLEASE lay off the moonshine!", 
    "review_date": "2012-03-06"
  }, 
  "QcJs-9XO8kq9he0bCesoYg": {
    "user_rating": 5.0, 
    "user_location": "Souderton, PA", 
    "user_name": "Gerald P.", 
    "review_text": "Instant five star. An understated uncomplicated cozy must visit hamburger slice of heaven. Carved into a small nostalgic nook with a simple but well executed menu. It scared me when I walked up to it and by the time my wife and I were done we didn't want to leave. High quality beef and great prices too.", 
    "review_date": "2014-08-16"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "So you would think after watching the San Francisco episode of Anthony Bourdain's \"The Layover\" that I would be running to Swan's Oyster Depot, La Folie or even Mission Chinese Food based on his enthusiastic culinary reactions at those places. But it was during his lengthy drunken binge on that show that I found myself drawn toward the idea of having a fat greasy burger at the tiny greasy spoon where he was ordering everyone around. Sam's is the place. You need not look any further for this kind of unhealthy eating.  I can only imagine how wildly satisfying one of Sam's burgers must be in the throes of a dipso-maniacal meltdown when you believe you are simultaneously the funniest person on earth and the saddest person on earth. I am ashamed to say I have had several of those moments in my life but not when Jamie W. and I came here. No, we came cold sober for a fat greasy burger. The space was exactly what I thought it would be - a big, worn grill working overtime in the window; a long, sticky formica counter; beaten-down stools; packaged food and supplies piled precariously everywhere; and oh yeah, Sam (see photos).  It was about 6:30 in the evening, and we were able to grab the last two stools at the end. I didn't even have to look at the dimly lit yellow menu on the wall. I ordered the $8 Double Cheeseburger with a $2.75 plate of fries right away (see photos). I don't think Sam asked me how I wanted it cooked. I guess it really didn't matter since it was beefy, greasy goodness with a ton of fixings - two slices of melted American cheese, a thick tomato slice, strands of red onion, and shredded lettuce - all slathered together with lots of mustard. Jamie just went with the $5.50 Cheeseburger, just the single patty, which I think didn't allow him the full-tilt gorging that Sam expects you to experience with his food.  Jamie also had the fries, and he didn't seem to mind that they were a bit dryer and crispier than I preferred since he likes squirting major splooges of ketchup on his. I'm not as much of a ketchup person, so I was choking a bit on the spuds wherever they may have come from. Along with our plastic red cups of Diet Coke, Sam decided to charge us just ten bucks each for our meals - which means I made it out like a bandit and Jamie, well...he was just sorry he didn't ask for another patty on his bun. So after all is said and done, do I think Sam makes the world's greatest cheeseburger? Nah... but with his positive attitude, Sam does a first-rate job with his little hole-in-the-wall spot on Broadway.  FOOD - 4 stars...no designer Niman Ranch, Kobe beef burger here...just a couple of satisfying patties full of greasy, guilty pleasure AMBIANCE - 3.5 stars...it's a dive, plain and simple SERVICE - 4 stars...Sam does it all TOTAL - 4 stars...Anthony needs to come back after his stint at Betty Ford", 
    "review_date": "2012-02-09"
  }, 
  "84dZn-XHZiNw_ivfuc8EaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea R.", 
    "review_text": "small place but with delicious burgers and fries, so friendly atmosphere, and a fast service! one of the cousins remember each of your orders, you feel so comfortable there! open until 3AM, very good to go after parties.", 
    "review_date": "2013-12-14"
  }, 
  "ubdwZHbjnUrd47QRO8yfwg": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Kolby B.", 
    "review_text": "We are from LA but have made it a tradition to eat here on every trip up to San Fran. We have been doing this since 2004. Mike (the owner) has served us and also his son. Each time, the food was great and service was prompt with a smile. It's a small place with a good old time feel to it. This is a hidden gem in SF.", 
    "review_date": "2013-05-31"
  }, 
  "Hsi6oUKSG7H2xi47x0IHbA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JessePanda C.", 
    "review_text": "remember coming here right after clubbing with home gurl... i order me a slice of combo pizza and hot dogg... you can't go wrong in the middle of the night, your typical american classic restaurant... this place is tiny but its koo... would i come back here, sure... but too bad im never that much of a american food fan... :P", 
    "review_date": "2010-02-08"
  }, 
  "8VHDydi53hJcelSen3hP4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich S.", 
    "review_text": "Best old school, basic burger in SF, super inexpensive and awesome.  Go here!", 
    "review_date": "2011-11-11"
  }, 
  "2OUtitBrWlpzMip1EYaIrg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "DOM d.", 
    "review_text": "This place is great after a party nite. I always get the pizza, either cheese or pepperoni. They dont get 5 stars because they dont smile when they take my order, but i do understand because they probably deal with all those drunk jerks. ANd they dont wash there hands when making the food and collecting the money. sometimes some bums come in and order so the money looks kinda dirty.  But thats probably y the pizza taste good, taste like great america pizza with a touch of money taste. All and all its definetely a SF classic", 
    "review_date": "2008-07-07"
  }, 
  "y3HFVx8nbNmomSc-PWOy-g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy N.", 
    "review_text": "When I actually saw some positive reviews, I had to check a couple times to see if we were talking about the same place.  I then saw the other reviews and yep, this is Sam's alright.  A fantastic place at 2:30 in the morning when you're drunk out of your f'ing mind.  Other than that, you've got to be kidding me.    If you have any doubts, take a walk by the window in the daytime and take a glance at the pizza they have in the window.  Yup, clear as a tenderloin crack junkie prostitute in the daylight, this is the true reality and caliber of food that they serve.  It would be almost hilarious, if it wasn't for the fact that this is what they're actually serving.  Winner of the all-time Most Decrepit Pizza in the Window award...Sam's on Broadway!    LOUD APPLAUSE  Have you guys ever seen that episode of Seinfeld called The Soup Nazi?  Well, one night, after a night of good drinking, I ended up at the counter there.  The cook (owner?) was especially nasty and unfriendly to everyone that came in to eat.  Heck, he was downright mean.  I came alone and was sitting at the counter with a bunch of strangers.    Everyone was extremely respectful and polite so we couldn't understand why the guy was being such a jerk.  Suddenly, I said out loud, \"Hey, any of you guys seen that episode of Seinfeld?\" and \"Yeah, the Soup Nazi!!!!\"  Next thing you know, everyone at the counter (I'm not kidding) started chanting out loud, \"NO SOUP FOR YOU!, NO SOUP FOR YOU!!!, NO SOUP FOR YOU!!!!!!!\"  Right at him!  Jeezus, I thought the guy was going to flip out and either kick everyone out of the restaurant or kill us.  Truly a memorable moment and it really happened.  I'll never forget it for as long as I live.  Hilarious!!!  I admit it, I used to love nightlife (that's all I ever did before) and have ended up drunk and hungry here in the past on more than one occasion.  Now that I'm a little older, I look back on this place and get really grossed out.  There are plenty of good places to get late night food in the area, no reason to eat substandard fare here.  You couldn't pay me to eat here nowadays...I know better.  There are a few restaurants in SF where I am actually scared to eat what they cook...this is one of them.", 
    "review_date": "2008-07-11"
  }, 
  "n-8_OGBfviQogkDjq0Bwfg": {
    "user_rating": 1.0, 
    "user_location": "Davis, CA", 
    "user_name": "Sean R.", 
    "review_text": "Only good thing about this place is they are open late. The guy that was serving me and my friends was a total jerk. Never have I met such a rude person taking orders in a restaurant. He asked for my order and I gave him a simple order of 1 burger, 1 cheese burger, and one double cheese burger. He got mad at me and said I gotta order right. Not sure where I went wrong.  The place was crowded and he seemed to only want to serve people who were not Asian first. I would not recommended this place to anyone. Food is not that great and the service is terrible.", 
    "review_date": "2015-01-14"
  }, 
  "mSi4U3ZVuX8_y85yw2b5Ig": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Chris B.", 
    "review_text": "Depending on how much you have had to drink the burger at this place could knock this rating up to five stars.  For me the burger was decent but proved that Tony Bourdain is full of crap if he thinks it is one of the top three best burgers in the world.  Then again I am pretty sure he was drunk when he visited...", 
    "review_date": "2012-06-01"
  }, 
  "7p5nTW9Tpw_3VDC4vuLSBQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Ana, CA", 
    "user_name": "Betancourt E.", 
    "review_text": "Went in there about two weeks ago and the guy serving us was great. Very nice kid, the food was good, the beer was cold what else you want!!! Would highly recommend this joint to all. The decor in there was totally me, old, classy burger joint with a lunch counter. Thank you man.", 
    "review_date": "2012-06-06"
  }, 
  "rDTr5r0xEMpQpkPphe66KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick A.", 
    "review_text": "On behalf of the American Heart Association, stay away from Sam and his food.", 
    "review_date": "2008-02-21"
  }, 
  "3SAAn35I_-kj6a7nqqBAmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "laura f.", 
    "review_text": "a-mazing. bf and i came here on fri night. i was still quite full from a pizza lunch at work but once the cheeseburger, fries, and cherry coke (on tap!) was put in front of me i demolished it all. bf had the double hamburger, fries, and a beer and our total came to 17.50 for dinner for both of us. outstanding!  i'll definitely be back. mmmm...", 
    "review_date": "2009-11-09"
  }, 
  "zzCByn8kKQV_VJABT_nedw": {
    "user_rating": 4.0, 
    "user_location": "Portola, San Francisco, CA", 
    "user_name": "Charlie W.", 
    "review_text": "This place has been open since I was a little kid growing up in Chinatown. It is a small place with big taste. I always order the burgers, it's cheap and really good. The fries are to kill for!!!! It's not your average scenery though, it's on broadway so you'll get a diverse crowd. Overall, I give this place a four. Food on a budget that is really good, opens til 4am.. So come late eat often..", 
    "review_date": "2014-02-04"
  }, 
  "X_9DrBW2oI_FR21nf7yx8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane P.", 
    "review_text": "sam's is awesome. the cheeseburger is easily the second-best $5 meal in the city, after - of course - my beloved yamo. delicious greasy grilled bun, thin juicy patties and the works. i took a picture of mine before i ate it so i could show all my friends the hottest food-porn they will ever see. good lord. i don't think it's humanly possible to oversell these burgers. as soon as i finish this sentence i'm putting a coat on and walking over there. seriously.", 
    "review_date": "2010-01-13"
  }, 
  "1W44M8E0kS_5TY8MOIIbZA": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Ryan K.", 
    "review_text": "Based on what I saw on the show, Bourdain might have had a few too many drinks before coming here....well, so did we.  And what's the best thing to end a night of drinking and shenanigans?? A good homemade burger, plate of fries and a cold beer - that's right.    So in all seriousness, we were wandering the streets of SF and happened to stumble upon this burger joint.  Being from LA, I seem to have a sixth sense on picking out the good mom and pop spots.  So yes, I would have still eaten here regardless if it was on the layover or not.  This place makes a good honest burger and serves beer, what else do you want?", 
    "review_date": "2012-03-07"
  }, 
  "I3R2sTg5H9SUt1TIH5S2Pg": {
    "user_rating": 5.0, 
    "user_location": "Bellevue, WA", 
    "user_name": "Sunny Joy B.", 
    "review_text": "I sware Mike is my guardian angel or something. Maybe he passed the job onto his son...dunno. Please eat the ambiance here.", 
    "review_date": "2009-07-05"
  }, 
  "EBZptxt2Oj3-1MT7GYTkEQ": {
    "user_rating": 3.0, 
    "user_location": "El Paso, TX", 
    "user_name": "Traveler E.", 
    "review_text": "This Cheese Burger was not what Anthony Bordain said it was. It was ok to say the least, fries a little over done. Chicken was small and overcooked. The place does have history and things to look at. This is not in the top burgers list.", 
    "review_date": "2012-06-18"
  }, 
  "CP_DpOOR0Ky0ppxyMNS9NQ": {
    "user_rating": 3.0, 
    "user_location": "Azusa, CA", 
    "user_name": "Edwin M.", 
    "review_text": "While Anthony Bourdain may have ordain this place a top 3 burger its not by any means. With that said its still in the category of good burgers just not the greatest. I could see how this place could be a top burger though. Here is why, because it's the sort of place you go when you've been drinking profusely throughout the night and are hungry and need one last beer to edge out your drunkard status. That is where this burger joint fits.  Nothing out of the ordinary just a simple good solid burger.", 
    "review_date": "2013-05-27"
  }, 
  "TgaSWikmnCcGZTmmlPp_Tw": {
    "user_rating": 3.0, 
    "user_location": "La Jolla, CA", 
    "user_name": "Jenny W.", 
    "review_text": "Pricing: Good. We did not order much so we came out to less than $10 a peep. Quality: Good. Very standard burger and pizza food. Turnaround: Good. Pizza given almost immediately. Burger was made to order so took a while. Service: Excellent. Nothing to complain about.  The burger is nothing too terribly special that I cannot replicate on my own and hence I did not feel it was worth the $5 I paid. My friend got a regular cheese pizza for $3, which was a large slice, but $3 for plain ol' cheese did not feel right. The pizza was simply warmed up and given to my friend while I waited for my burger to be made, which meant the burger was fresh so that was nice. The owner asked if I wanted everything on the burger and I said yes. Besides that, we never interacted again until we said farewell when we left.", 
    "review_date": "2013-05-29"
  }, 
  "ee2ALG_x2ZC20uwF4D6n4Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike T.", 
    "review_text": "What more can I say than, I asked for a slice of the cardboard pizza, and I received a slice of the cardboard pizza. I knew what to expect, and I got what I wanted.", 
    "review_date": "2007-08-03"
  }, 
  "FHfpDLfQrFOzB5K8UYBHgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "meme s.", 
    "review_text": "This is the best late night burger joint in North Beach!  I would have given them five stars but you have to watch out for the massive cockroaches and drunks barfing on the counter!", 
    "review_date": "2009-01-19"
  }, 
  "3FAb-ch2K3K9uQz7N49ITA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Light Bulb J.", 
    "review_text": "Holy Jesus.    Cheap and plentiful burger with seasoned fries.  Just perfect. Got to watch Jeopardy while I ate.  Perfection.", 
    "review_date": "2010-07-20"
  }, 
  "OhAfZehd1Z8YWUAQr2k6Sw": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Omar S.", 
    "review_text": "First class service by Nabil. A++ food quality. This place is not only a burger joint but also it is a place where can freely debate and talk about social issues, politics, community and sports. Everyone joins the conversation. Everyone is equal in this place, no matter what's your background.  1 2 3 vivre l' Algerie", 
    "review_date": "2014-08-03"
  }, 
  "_HDGZ7uk1erGz5LFZVBJGg": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Jeremy C.", 
    "review_text": "Late night fried chicken is delicious. Most people know this place from Anthony Bourdain's drunken visit on The Layover when he houses a double cheeseburger and declares it as the best burger ever. Do not be fooled--order the fried chicken! Half a chicken and a bag of fries for like $8.", 
    "review_date": "2012-04-05"
  }, 
  "hkmxEMgdwjxVVjehTK7OxQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Cesar R.", 
    "review_text": "Most likely the best burger I have ever had. Even the fries were good. Friendly staff.", 
    "review_date": "2011-04-07"
  }, 
  "8R2UPyjwWC1QA9VxkdOIxg": {
    "user_rating": 5.0, 
    "user_location": "Bellingham, WA", 
    "user_name": "Douglas L.", 
    "review_text": "Ok, well I signed up for Yelp just to review this place.  I haven't eaten there since 1994, but a couple years ago I had a picture taken under the sign because it was closed.  I recently saw Sam's on the Layover and it brought back memories.  I was stationed on Treasure Island for some Navy Training back in 1994.  I don't remember exactly who, but someone in one of the upper training classes introduced us to this place.  We would go to Sam's every single weekend, usually starting and ending our nights there.  We would sit in there and drink beer, and eat those delicious burgers.  I also remember a philly type sandwich that was also very good.  The fries were also excellent.  Some of the group was not old enough to drink so this place was fun for us all to hang out.  The owner was always working when we hung out there.  Really nice guy with an accent but I don't recall the name.  He always treated us very well and even thanked us for defending his right to do what he does.    I'm glad that this place is still around and hope to stop back in the next time I'm in SF.", 
    "review_date": "2012-01-19"
  }, 
  "gDrOl-L-zVUIixAAuIyJug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicholas B.", 
    "review_text": "Amazing burger. Taste it, crave it.", 
    "review_date": "2011-11-27"
  }, 
  "xaDT3qc8GzX_98wu28IK3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mo G.", 
    "review_text": "First off, Sam's is an SF institution. Sam's is owned by Mike. Mike took over the business from his father, have you checked out the picture wall when you walk in?   This is one of the last  \"real\" burgers in town. The meat is ground fresh daily and NEVER frozen. Pizza's are made from fresh dough too.  Obviously the location serves up constant action from Midnight to 4am on the weekends.  sit at the counter and make sure to  put grated cheese on the O rings.  If I had to pick a last meal, this may be it.", 
    "review_date": "2008-04-22"
  }, 
  "cQjFUZ3wHW5MEajjiOw8zw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanne Y.", 
    "review_text": "Top burger in the world? No, definitely not. It's your good ol' nostalgic burger in a no-frills dine-in bar, equipped with an ancient cash register and sports TV.  You can order and sit at the counter and food will be served up in no time. It's a nice local touch to the overly touristy Little Italy and they serve up a traditional American burger that satisfies a burger craving. About $10 for burger + fries + soda. Open late for the drunchies!", 
    "review_date": "2014-06-30"
  }, 
  "S43IJjN0UGmg3LZBMgnjRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Niklas A.", 
    "review_text": "This is a nice and personal hamburger bar with really great food. I usually go here while I'm on my way home from the bars in North Beach. There's usually a funny and open-minded crowd here too, always up for a small chat or sharing some crazy life story. Highly recommended! Double cheeseburger with everything is my favorite.", 
    "review_date": "2012-05-13"
  }, 
  "LTI86BSXBclY6UsZXqKYXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen C.", 
    "review_text": "Classic Burger Joint!  Located in the heart of North Beach between the intersection of Columbus and Broadway, the restaurant is great for post bar food or a quick bite to eat if you're in the area.  The restaurant serves traditional burgers and the fries are made fresh!   It does become quite crowded though after 2AM when everyone is out from the bars. The service is really casual and friendly. Careful thought that the place is cash only so remember to carry around 10 dollars.  Overall: I'd come back again on my next North Beach night adventure.", 
    "review_date": "2013-12-10"
  }, 
  "-OZPBHH7RzyPIai4AlPWKA": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Leo I.", 
    "review_text": "Famous burger joint. While I wouldn't say the best burger, the place has got a lot of personality. Stop in and say hi and who knows who you might run in to....", 
    "review_date": "2012-10-17"
  }, 
  "-7fswIo7nXS82iHfcEsAVw": {
    "user_rating": 5.0, 
    "user_location": "Northridge, CA", 
    "user_name": "Raymond L.", 
    "review_text": "Super awesome place to get Pizza in the middle of Chinatown!  We were staying in Chinatown across the street at the SW Hotel for LGBT Pride 2013.  Being super hungry, we really didn't want Chinese food.  Luckily we found this place via yelp.  Mike was super nice ever though we were a little drunk.  We got a large Peperoni Pizza which was about 6 big slices, filled us all up.  Everything together was only about $14.  When we ate here, the inside was empty.  Mike was chilling outside.  It's a pretty laid back place, nothing like this in the San Fernando Valley.  It was about the same temperature inside as outside so it was comfortable, and there is a TV in there with music.  Can't wait to visit again someday.", 
    "review_date": "2013-07-05"
  }, 
  "PKcf9LIWXgDV0zJ-9MDr2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anny W.", 
    "review_text": "Came here around 11 pm due to a friend's recommendation. They were drinking around Broadway area and wanted something to grub on. I was sober while my friends were slightly buzzing. When you arrive, you can see a sign in front of the store that says \"top 3 burgers in the world\" - Anthony Bourdain. In my head, I was thinking- man.. this must be good so I had high expectations.  My boyfriend got the double patty cheeseburger while I got the Polish sausage. While I can't speak for his cheeseburger (which looked pretty greasy and can you say heart attack is coming?!), my polish sausage was a bit spicy. I had all the garnish in there. But the onions were overpowering! I had onion breath still even when I brushed my teeth and flossed........  The health score is 94/100? That is interesting. Because I saw with my own eyes the worker was taking a smoke break in the front then proceeded to make other people's burger without washing his hands. I wanted to throw up because I don't know if he did the same thing with my food.", 
    "review_date": "2013-09-03"
  }, 
  "x6jPDMOemYgC92ZTU613ZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake E.", 
    "review_text": "Probably five stars if I were drunk. Classic no frills burger, side of onion rings. Like 10 bucks. Definitely worth it.", 
    "review_date": "2013-04-29"
  }, 
  "-g3MZ5auviJ89FbU6pD0Fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melvin T.", 
    "review_text": "You can get a reasonably priced burger. It's a greasy looking place with greasy food. Don't expect a salad kid because this is an old fashioned burger joint.... F- the flash this place has zazz. Definitely a perfect place to get a burger at.... I dunno 2:30 am coming from a fantastic bar with a fantastic $7 special with your roommates.  Here's the topper, despite the loud, douche baggy types that show up from time to time the folks are friendly. I've actually had conversations with them when they aren't so busy.... Good people, Good food", 
    "review_date": "2009-07-30"
  }, 
  "oarKDJg3V7mLpgdDVPYmSg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Michael L.", 
    "review_text": "Great burger joint that's opened until 330 am. The first time I went there I arrived at about 320 am.  I said to the guy cooking, who looked a little bit tired (it was 320 am) if I could order. He asked me what I wanted. I said a cheeseburger and fries. He said, \"how about just this cheeseburger\" holding up a bag. I said, OK and paid.  I ate it in my car and I almost swallowed it whole because it was so good.   The next time I went earlier (at 230). I sat at the counter. Another guy waited on me who was super nice. The regulars were super nice.  The burger was super good again.  This place is the bomb.  I love it.", 
    "review_date": "2013-02-14"
  }, 
  "rOdOvC82V3jFvihQtYfcng": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Jose C.", 
    "review_text": "wow i'm surprised i never been here . i have seen it many times past it many times over the years finally decided to come in and get a bite . i was coming out of the club and decided to stop in . the place was sort of packed a very small tight squeeze . had a Cheeseburger Fries and a drink the Burger was good cooked well done fries where good also and you get a lot of them . the guy that attaended me was cool he looked Italian and seemed like a lot of regulars knew him . cool spot would not mind coming back in the future .", 
    "review_date": "2011-10-16"
  }, 
  "DjXEUA6ltpOCgzy3Q8D_xg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Troy R.", 
    "review_text": "I never knew sketchy could taste so good. I just moved to North Beach, heck I just moved to California. I lived in Oakland for 2 months before moving over to San Francisco and there were a number of sketchy places in Oakland, that had some great food. This is one of them, I only had a burger and fries but what a burger and fries!   Going in there, I was just like do I really want to eat some food from here and it turned out to be a cool spot, I can see why it's a cool late night spot.", 
    "review_date": "2008-06-25"
  }, 
  "1lFGER8Pz7Lm8PcDizq61w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bruce L.", 
    "review_text": "If I'm home and hungry at 11pm or after.... u bet I'm going to Sam's. Good friendly service. Opened late for a quick burger+fries+drink!", 
    "review_date": "2011-05-02"
  }, 
  "9jZAXnAaulEC40wtEZK6Fw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stanley K.", 
    "review_text": "Do's and Don'ts of Sam's:  Don't expect too much. ( it's a run-down diner)  Do order fast and order quick. ( service and delivery of food is slow)  Don't stare at other people while eating. (everyone is drunk or homeless)  Do eat fast. ( homeless people are looking for a small bite, they might want to finish your pizza)  Don't order fish sticks (it takes too long)  Do sit at the bar / stool area ( sitting in those tables gets no service)  Do bring beers inside ( you could if you wanted to)  Do act crazy when people look at you ( you really don't want to start anything crazy)  Do bring friends ( NEVER COME HERE ALONE)  FYI, Girls \" I repeat DO NOT COME HERE LOOKING SEXY, you will get a FULL Staredown by the cook.\"   Cook: imitating Borat \" How much?\"", 
    "review_date": "2007-05-03"
  }, 
  "AhcrLBCfZYBXjHJrZLizSQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keegan Y.", 
    "review_text": "This is my first review ever and I couldn't do it for a better place. The burgers are amazing, Mike is that man, and they're open till 3am - enough said!!!! Careful, once you've had sam's you'll find yourself drunkenly taking taxi's from all over the city to fill your fix.", 
    "review_date": "2010-07-29"
  }, 
  "hPp4Wdd9ijsi81I5-DqVRg": {
    "user_rating": 1.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Josh D.", 
    "review_text": "I found my self in North Beach this Sunday night and was craving a burger. Driving down Broadway I look to my left and see a sign that says \"Sam's Hamburgers\" so I immediately pull an illegal u-turn and bam there is SF PD in a black n white. Well this must be my lucky day cuz he points at me but keeps driving.   I stroll into Sam's and pull up a stool at the bar. I meet this interesting character in a fedora and a Niner shirt. I order a 1/4 lb cheeseburger w everything add bacon and a side of fries.   As I'm waiting for my burger I look up at an autographed photo of my favorite Seahawk player \"Marshawn Lynch\". Now if I was in Seattle I wouldn't have thought twice but I'm deep in San Francisco and clearly looking at a die hard Niner fan.   Turns out this Niner fan is \"Sam's\" son and he has known Marshawn since he was 15. Now He has my attention and I press him for more. As he hands me a plate of steaming hot fries he begins to tell me a story how Marshawn sat on my very same stool the day the Seahawks were at the White House. At this point I don't even care if the food is good or not, I love this place!   Then my burger comes... It's massive and looks incredible. I take a bite and this is hands down the tastiest burger I have ever had. No lie if you ever find yourself in North Beach and your craving a burger make sure you take the time to find Sam's Hamburgers since 1966. If you're lucky you'll sit in the same seat Marshawn Lynch chose instead of meeting the President of the United States. That should tell you how good the burgers are.", 
    "review_date": "2014-11-16"
  }, 
  "gjQ00L18PvAV450ZOfqYng": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Braden K.", 
    "review_text": "whether indulging in your strip or nightclub vices along broadway st. everyone wants to enjoy a tasty meal after a heavy night of drinking.  thats where sams comes in.  situated a short walk up broadway, this burger/pizza joint serves up some tasty grub well into the early morning hours. though a little pricey, $5 for a cheeseburger? the portions are solid, the ingredients are fresh, and the wait is shorter than danny devito.   4/5 sounds good to me!", 
    "review_date": "2011-10-09"
  }, 
  "midin0lv16V34tXsJxE9HA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean Q.", 
    "review_text": "I have gotten food poisoning here twice and I have admittedly only been three times. I give it two because sickness and food are hard to pinpoint on one person or place. The food tastes pretty good going down, but to be as ill as I was the next day on two different occassions I'd have to say it  could only be one culprit.", 
    "review_date": "2007-06-07"
  }, 
  "uE_m-PKvQRzwGbCHe_Iswg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James D.", 
    "review_text": "Went here a couple times and the basic burger isn't bad. The service is quick and the whole place has a nice feel to it. Blah blah Anthony Bourdain too.  The problem is that the portions are tiny, the pizza is sub par and the prices are a little high. Nothing really wowed me about the food and though I somewhat enjoyed my first experience, it wasn't enough to make me a fan.  Hygiene was also a major problem too. The place itself doesn't look that clean but what put it over the top was the fact that our server came in from smoking a cigarette, didn't wash his hands, handled our money and also handled our food. I don't wanna even imagine what else he was doing before we saw him but washing your hands should be a must when working with food.  Take away the fact that its open late and Anthony Bourdain sung it's praises and you're left with a very disappointing burger and place that has health code issues.", 
    "review_date": "2012-11-16"
  }, 
  "aLhK880cHWLBZRmc5Ze3ag": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Gardner H.", 
    "review_text": "Sam's is a burger joint out of a different era. Delicious, small, hole in the wall. don't blink, you will miss it...and don't miss it...you will be sad that you did. Burgers served on paper plates...soda served in the red cups used for beer pong...but folks keep coming back, and it's no wonder why. They make a legit burger.", 
    "review_date": "2014-12-23"
  }, 
  "J2W5pb0_300Gmy-W7gZz6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitzi A.", 
    "review_text": "Good greasy spoon type establishment....complete with old fashioned counter.  They have a nice staff and even serve decent wines with your burger (if you so choose).  The only thing they lack is a good old fashioned milkshake maker.  Anthony Bourdain featured this on his late night haunts on one of his travel shows...and claimed they had the best burger...but that was at 3am and after a night of drinking...which, I'm sure, is what most of their customers say if they follow suit.  I do know they have a good old fashioned style burger...and it's good even if you are sober (although it probably has orgasmic status if you are drunk at 3am).  If you go, you can even have what Bourdain had (beer, double burger and fries).", 
    "review_date": "2014-08-04"
  }, 
  "ICM-ZogVtiDt2vKS2NyyaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jorm K.", 
    "review_text": "A late night joint located on Broadway and grant that's essentially in china town thats serves greasy anti drunkness burgers and fries to tame ur late night hungers. Cash only prices avg but it hits the spot", 
    "review_date": "2011-08-12"
  }, 
  "B4cJvWuf59j7XlTdexnVZw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marc S.", 
    "review_text": "Cheeseburger, Fries, Coke = $8 total.  I enjoyed it.  The place itself deserves a star just for existing where it is.  A real relic and amazing how it has not been turned into a Thai, Chinese, or Vietnamese place yet (prob because it's so small).  Lot's of cool old signs and good selection of grease foods.  Sells wines and beer and this guy came in while I was there looking for some lithium battery for a flashlight and the place had it.  I thought at first this was some sort of drug sale, it was so odd, but it was legit.  Low turnover on a weeknight so I would be wary of the pizza that seemed to have been sitting for hours.  But he did make a fresh batch of fries for me.  Cool counter seating and mini stool tables along the wall.", 
    "review_date": "2008-03-12"
  }, 
  "0Q9y_SusaOkFgaTWMVMFFQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "AnonymousPatron P.", 
    "review_text": "this place is nasty!!! you can't handle dirty money and prepare food without washing your hands! since there are two employees behind the counter, one should prepare the food and the other should handle the $ transactions. and i agree with kimberly from seattle. i've seen the older guy (Maik?) walk in and go behind the counter without giving a thought to washing his hands! the health dept. should revisit this place!   i give sams a zero rating!!! 0 stars for u. . . honestly", 
    "review_date": "2013-09-25"
  }, 
  "AdmLRFpilAktru8JEWUjvw": {
    "user_rating": 4.0, 
    "user_location": "Barrigada, Guam", 
    "user_name": "Irene L.", 
    "review_text": "I grew up around Chinatown and always walked by Sam's. Never came in because i thought it was kinda shady looking -- Hole in the wall, dim lighting, old leather stools, few people are actually in there, etc. My friends and I decided to try it out last night with Q W's recommendation... and this place hits the spot when you're tryna feed after a night of partying. The folks that operate Sam's are really nice too. Open late, cheap, and their burgers are on point.", 
    "review_date": "2011-10-30"
  }, 
  "6_IL6_nr769i_LBynuQDYg": {
    "user_rating": 5.0, 
    "user_location": "Escondido, CA", 
    "user_name": "Brian J.", 
    "review_text": "The burger I had here was amazing. I don't think I'd quite consider it top 3 in the world, like Anthony Bourdain apparently does, but it was definitely the best burger I've had in months.", 
    "review_date": "2012-04-22"
  }, 
  "1vOzqpVjNp5NPV_QS5sIBQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric T.", 
    "review_text": "Its a hole in the wall for sure but best burger in the city, hands down.", 
    "review_date": "2011-05-23"
  }, 
  "t4Oq7tm1FqGImYbW22Ujkg": {
    "user_rating": 5.0, 
    "user_location": "Kansas City, MO", 
    "user_name": "Lindsey P.", 
    "review_text": "We stopped in after bars for some burgers. The two guys working rocked a busy and drunk crowd. They get 5 stars just for the fun experience and decent burgers.   But when I realized I left phone/wallet there we got back in a cab to see if was still there. The guys had found it, kept it safe and even refused a tip for my gratitude. Good people. Good food. Good times at SAMs", 
    "review_date": "2014-08-16"
  }, 
  "nbOYS_LPTy_d1UtC_B9fAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan C.", 
    "review_text": "Sam's is a landmark.  This is not news to the citizens of North Beach. Where are you going to find a cheeseburger at 2:00 in the morning when you're slobbering drunk?  The Clown Burger down the street?  Take my advice. NEVER get a burger from a clown.  Get it from Sam's. Ask for \"T\". Ask him what he thinks of the global political situation.", 
    "review_date": "2007-03-27"
  }, 
  "0FUp_4coC1MxoyujWhDdIA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will C.", 
    "review_text": "#192 I wanted to know if Bourdain was either drunk or full of shit when he said Sam's makes a good motherfuckin burger that's top 3 in the world.   I'm happy to report that Bourdain was right. This place makes an awesome burger.   I ordered the \"bourdain special\", which is a double cheeseburger, fries and drink. I asked my new friend to hold the onions and tomato. The burger and fries took about 15 minutes to prepare. But, the wait was worth it. Upon arrival, I was on the edge of drooling; the two slices of cheese are perfectly melted between the two beef patties, the thousand island dressing isn't saturated throughout the burger, and the shredded lettuce is placed on the bottom of the beef patties-not the top.  Upon first bite, the beef is so tender it literally crumbles in your mouth. The beef is perfectly seasoned with just the right amount of salt. The meat is juicy; you won't be reaching for your water. Because the cheese is perfectly melted between the patties; its gooey texture and subtle flavor will leave your mouth watering for more even before you've had a chance to swallow. You don't feel weighed down until you finish and realize that you just wolfed down a double cheeseburger in less than 5 minutes.  Put simply, making good hamburgers should not be difficult. But so many restaurants manage to screw it up by overcooking the meat, not tenderizing the meat, not adding seasoning to the meat, or using snob beef like steak cuts to purposely cut down on the juiciness of the meat.  And then they disguise that mediocre burger by adding fancy sauces or fancy toppings to overwhelm the banal flavor of the meat and cheese.   Sam's burger is not fancy. It never proclaimed itself to be. Looking inside from their lone window. Ask yourself: Do you think this divey eatery serves organic beef? how about veggie patties? Of course not. Pearl's Deluxe Burgers will feed you damn good kobe beef burgers or veggie sliders if you're into that. Sam's just makes an awesome burger with simple ingredients. To me, that's quite an achievement in itself and in this day and age, shouldn't that be enough?   Seating for 8 at the counter. A few proper tables for groups and a small bathroom in the back. Cash only. $13.5r Bourdain special with beer.", 
    "review_date": "2012-12-30"
  }, 
  "U7NLhaVfOJrHb9XLsZbJnQ": {
    "user_rating": 5.0, 
    "user_location": "Haddonfield, NJ", 
    "user_name": "Paul V.", 
    "review_text": "Sam's is a great American burger place.  All you need to know: -Excellent burgers -Delicious fries -Open late -Friendly server -Order the double cheeseburger -Beer and wine available -It's divey, but that adds to its appeal  (haven't tried their pizza, so i can't comment on that)", 
    "review_date": "2013-12-18"
  }, 
  "re6fN6eb3NTL7hKK-5CYUQ": {
    "user_rating": 1.0, 
    "user_location": "Boston, MA", 
    "user_name": "Shirleyanne A.", 
    "review_text": "If you're a princess or prince of snootiness I suggest that you skip this place because it's a hole in the wall.  The burgers are really good and pretty huge. The flavors is standard/simple which I really liked. The burger holds together well and it had the perfect meat to lettuce to bread ratio.  I actually was enjoying my burger until I saw the cashier/server (who was extremely nice and friendly) touch money, then make hamburger patties, then touch money again. I was praying to God that he wasn't doing that when he was making my burger. I feel bad for the patrons whose hamburger patties will be seasoned by trace amounts of cocaine, bum sweat, stripper crotch juice and whatever else is on those dollar bills.  I didn't get sick so I guess mine wasn't seasoned with those special ingredients.  My suggestion to the owner is to train their employees well on food safe handling because I really wanted to give them another shot. Now I wonder whether Anthony Bourdain's burger was seasoned with those special spices.....", 
    "review_date": "2012-06-30"
  }, 
  "Xk8z-5q-FnGfLrofwq5jWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin T.", 
    "review_text": "You want a burger?  Go to Sam's.  It's a divey, no frills, shop that serves amazing burgers.  They hand grind their meats daily.  There's really only one thing to order here:  their burgers.  You have a few options.  SIngle patty, or double.  Cheese or no cheese.  Bacon and avocado are an extra 1.50.  My suggestion?  Get a single with everything.  Double and you might be rolling down Broadway.    Sam's started to open their shop for lunches or Thursdays and Fridays only.  Other than that you can find them open at night and serving the drunken clientele of north beach.    Cash only.", 
    "review_date": "2012-03-25"
  }, 
  "NSCy54eWehBJyZdG2iE84w": {
    "user_rating": 4.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Karlee D.", 
    "review_text": "The chicken nuggets are reminiscent of the ones from the grade school cafeteria....  mmmm... with ketchup.  a fourth star for being open late night.", 
    "review_date": "2008-11-07"
  }, 
  "OjJPqQCQF8jRfKMMQPhGYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom Y.", 
    "review_text": "I must have walked by Sam's a million times before I finally went in.  Why?  The external appearance isn't all that inviting -- a little shabby, no updates since they got the 13\" portable TV back in '76, and what not.  But, I was really craving a burger one day on the walk home and said, so I bit the bullet and headed in.    Service was affable and efficient enough, placed my order for a cheeseburger, fries, and coke.  The burger ($4.75 + 0.50 for cheese) was made from fresh meat, not overcooked, and served with cheap yellow cheese just like mom used to make.  The fries were big, no shoestrings here, plentiful and crispy. In fact, I'm getting hungry writing about it.  See you at Sam's...", 
    "review_date": "2009-08-07"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "Maybe it's that I raised my own brain on movies that I am obsessive about creative immersive experiences for myself, and for the everyone else. I realized when i was 11 I'm not Tom Cruise, or when I was 17 I'm not Ben Affleck, and I won't be living in pointed, cultivated environments as an actor for a living. Thus, when I dine out, or exist anywhere really, I'm looking for experiences that transport me. I don't have to be lifted off earth to Walden. No, that's not what I'm talking about. I'm talking about one individual -- the ol' auteur theory -- having a pointed vision and making it happen, and never flagging. Most of the time, it's different chef names -- rightfully so -- that gets the street cred for this. Whomever Sam is... he's seated at the same table.  Sam's will never flag. Sam's has an idea, and you're either into it, or you're not. I don't rate my stars on table cloths, food sources, or appetizers. I rate my experiences on three things and always three things: if I walk into a place, and I could never leave (read: I'm both paranoid about dying, and interested in crafting immersive environments), would I be okay with the atmosphere (mainly the smell), the food and the people?   The fact that I've grabbed my own beer out of the back cooler and at the same time, yelled my order across the room to the front to the cook I realize these are two things that I'd want to see if I ran a place: self-serve and everyone gets to yell their orders.  Every single time I've bitten into a charbroiled darker and richer than hell burger at Sam's I think about it being my last meal. I think about taking that paper plate, creating a funnel, and letting the grease hit the back of my throat. That's real life cinematic magic.", 
    "review_date": "2013-03-31"
  }, 
  "kh1tUMr-Yy1U9Fit7wHZsQ": {
    "user_rating": 4.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Mr S.", 
    "review_text": "Shoutout to Anthony Bourdain for putting me on this one.  The double cheeseburger is grilled goodness.", 
    "review_date": "2013-03-03"
  }, 
  "OvteZk2gWKfIRAryq7T9KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda B.", 
    "review_text": "Definitely a fan! Great hole in the wall food service off of Broadway. After bar crawling in the Northbeach area great spot for Burgers and Fries! Great food and service.....", 
    "review_date": "2012-12-05"
  }, 
  "MEdsbK5KTW16uFZ3g8Y38w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Karen D.", 
    "review_text": "Very simple. Really well-cooked, MOIST hamburger patty. Big portion. Fun, laid-back environment.  I had to try mine with the veggies on the side because the BF wanted a patty, cheese, and bun only burger. I can't help but wonder how much better the burger would have been if it was assembled the way it should have been.", 
    "review_date": "2013-02-18"
  }, 
  "NRrNQ5xHn_7Fu4ctlpKLbQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin S.", 
    "review_text": "I went here on a Sunday afternoon and I was the only customer. A few tourists walked in but when the cook told them, as he told me, that they had no pizza they quickly went on their way. This is what I should have done when I walked in but I assumed with all these great reviews it must be O.K. but sadly I was wrong.   I ordered the cheeseburger and fries. I'd like to mention that receiving my fries three minutes before my hamburger was awesome. I'm considering requesting this next time I go out. Unfortunately these fries had absolutely not flavor what so ever so I didn't finish them. The cheeseburger was at best a flavorless disaster that reminds me of a school lunch. You couldn't pay me to eat here again.   Can somebody please tell me why there are five star reviews?", 
    "review_date": "2009-12-13"
  }, 
  "MAR-rfOdRBxyQJm1WhUkbw": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "JERRY B.", 
    "review_text": "Having gone to Sams, its definatly a late night place for all party animals.     Its not the best food, nor the worst.   Its there.  I can't give it more then 1 star due to unhealthy and sanitary reasons. I saw employees cooking food, and handling cash, without properly washing hands.  Sorry, but they need to learn proper hygine.", 
    "review_date": "2010-07-18"
  }, 
  "VpISIKo_7cpdq4j2Nwft2Q": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "shirley h.", 
    "review_text": "Okay burger, great fries!  Great place for a midnight snack.", 
    "review_date": "2012-01-24"
  }, 
  "_pKGeR_0HCVj4SGBEMY2Lw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Andy H.", 
    "review_text": "Real deal joint.", 
    "review_date": "2014-02-28"
  }, 
  "pQxJz72e9B5L_e29l0NAMQ": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Kevin M.", 
    "review_text": "Another late night spot that is worth reviewing! Near chinatown and SF's red light district so to speak, this place is cranking out juicy and delicious burgers made to order. I don't know what it is about this burger that makes it stand out since it is in theory and actuality a normal burger with all the fix ins, but somehow each bite warrants another...   until it's all gone and you're left wondering why you don't have another one...", 
    "review_date": "2014-06-04"
  }, 
  "PB3h4xIjhB-9eyAn_id_qg": {
    "user_rating": 4.0, 
    "user_location": "Hagåtña, Guam", 
    "user_name": "Carlo C.", 
    "review_text": "burgers are really, really good!  if you're from guam, the burger tastes just like the old \"cool spot,\" but better (if that makes sense).  the buns were toasted to perfection and it was just a damn good burger.  while we were eating, i took a picture of the restaurant sign inside and noticed a note on the wall.  it was a note from anthony bourdain saying the place has to be a top 3 burger in the world.  high praise indeed.  if it's good enough for him, it's good enough for me. didn't try anything else.", 
    "review_date": "2011-12-01"
  }, 
  "JS0QbDaVBp_QCtH3AOdt6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "BOSS E.", 
    "review_text": "As a burger joint it is avg.  but as a drunken, fast food, open late burger joint...it simply THE BEST!!!! Any restaurant that has been on Broadway for 30 years gets a big thumbs up! Sams even outlasted Enrico's.  In addition, Mike the owner has been making juicy burgers for that long.  How many chefs do you know thats been cooking burgers, pizzas, and chicken nuggets for 30 years??? Mike at Sams knows what he's cooking!", 
    "review_date": "2008-09-16"
  }, 
  "3UR_g4t0UdGt3WEJeLMobw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy H.", 
    "review_text": "best place to get a big, cheap, juicy burger... however the prices are going up its still worth it.  the cook is also your server so you get ur burger right off the grill.... Sams is amaaazing late night food, open till 3 i think.  lots of characters in there dont ask to change the channel on the tv... strictly ABC. i have enjoyed wheel o fourtune, jeopardy, wipe out... and jimmy kimmel re-runs", 
    "review_date": "2011-12-03"
  }, 
  "nQirmhRiYXj010sSnHqXUw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Ricardo S.", 
    "review_text": "I stopped by for lunch with my dad today and I will be coming back, in fact it will be on my list of restaurants to return to when I am back in San Francisco.  It is a great little place that can be easily missed, but DON'T, because the food is to die for!!  Although its essentially a hole in the wall, it is pretty much empty with seating up front.  I presume the owner is the only guy who runs the place, but he is very friendly, courteous and takes the effort to use fresh ingredients.  Both my dad and I ordered cheeseburgers and as soon as we ordered, he fired up the grill and took two fresh patties!  From that point on, I was sold because nothing beats FRESH food!  Not to mention, he is also busy preparing the condiments such as lettuce, tomato, etc.  He also has a good, but small selection of bottled beer available, which is excellent.  I cant say enough, but do not miss this burger joint if you are in the Bay Area.", 
    "review_date": "2014-05-28"
  }, 
  "1wI3WRmx5IMOmxVx8k1Wrg": {
    "user_rating": 5.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Sam W.", 
    "review_text": "This place is a San Francisco institution. Open very late and serving awesome burgers in a super casual hole in the wall, teeny tiny place in North Beach. I've been coming here for 15 years + and will totally agree with Anthony  Bourdain - top 3 best burger in the world. A bold assessment, I know, but once you bite into it you'll understand why.   Forget everything else they serve and go straight for burger/fries. Cooked to order, hot and fresh, omg I'm salivating. A lot of people have complained about the service and price differences and the employees being rude and blah blah blah, but when  you're loaded at 2 in the morning, nothing can beat this place. Don't expect 5 star service from a hole in the wall in the middle of Broadway, but don't let that deter you either. The food is consistently good and that's all that really matters to me in a place like this.   I would suggest not acting like an asshole and ordering a burger with no mayo, or no tomato or however else you like to customize it. It is a bit soup nazi - ish but the food more than makes up for it. Just come in, order and pay and have one of the best burgers of your life.", 
    "review_date": "2014-07-23"
  }, 
  "YnHf1BPFjfj3kK_i1AC4rQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Duke X.", 
    "review_text": "First time I came here I was 15 years old. I love this place sober and drunk! I love the fact that this place is old school San Francisco!!! Its dingy dark and old just love it!!! I also love the character's running this joint~ Mike he is a great guy along with his sons and Mike forgive me for always calling you Sam.", 
    "review_date": "2012-12-14"
  }, 
  "wAPd6TE3L_ihJEXCEdK9DQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nico B.", 
    "review_text": "Burgers are greasy and tasty. Fries are just ok.  Worth a visit if you're not a wuss about cleanliness or atmosphere! It's a bit funky but one of the better burgers in the neighborhood.", 
    "review_date": "2011-05-24"
  }, 
  "m5tpFDgOvx-Tnv200oHRIw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S. H.", 
    "review_text": "It was a good burger, but it wasn't superb. I actually prefer in-n-out. I'm a big fan of veggies (ie crispy lettuce and onions slices) in my burger. The burgers here had shredded lettuce and chopped onions, which was a huge downer for me. Without good veggies to go with the patty, it isn't an awesome burger in my book.", 
    "review_date": "2009-03-13"
  }, 
  "DVl7v-7aNaDsMMFcEyxbrA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Sam C.", 
    "review_text": "This place originally attracted me because of its ridiculously awesome and sexy name.  After a few visits simply to stare at the sign out front, I decided to actually eat here, and I am glad I did.   I walked in and realized I only had 6 bucks cash on me.  I asked the guy workin if I could get a burger and a drink for that much, and he responded \"ya, why not?\".  He threw in some fries too.  So that was cool.  Then it turned out the burger was pretty darn good.  He cooks right in front of you which is usually a good sign, and the patty was reasonable big and juicy, and the fries were solid as well.   Never tried the pizza but Ive been back a couple times for the burgers and they are always good. The place is open until super late, and has lots of character.  Not trying to, just does, it can't help it.  And that name...", 
    "review_date": "2010-07-29"
  }, 
  "8WE7H_NvgM7V6IA7Ro3Prg": {
    "user_rating": 5.0, 
    "user_location": "Avondale, AZ", 
    "user_name": "Matthew S.", 
    "review_text": "I gotta admit the only reason i went to Sam's was because of Anthony Jourdain. He said it was his top 3 burgers. I'm gonna be honest i wouldn't fly to San Fran to get this burger, however this burger was super good. i added bacon and man! it was so delicious, the fries i loved and the owner is super friendly. yes the surroundings are a little shady but dint be afraid to go in there you will enjoy it.   sadly i didn't try the pizza but one day il go back and I'll have that for late night.", 
    "review_date": "2013-07-31"
  }, 
  "MjlNTynslY_aLDTfGODuIg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LL C.", 
    "review_text": "dont understand exactly why bourdain said this was one of the top three burgers in the world, though it wasnt bad.  the guy working it (the owner?) had a very italian attitude, straight forward in your face yet friendly (friendly enough..)  open late nights for those with early morning cravings", 
    "review_date": "2013-01-16"
  }, 
  "HI8kIWfFFn74mdJNBEwJ9w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mike F.", 
    "review_text": "I used to live in Southern California, where you'll find a wide variety of non-chain (or small private chain) hamburger places all over that you can look at from outside and know the food is going to be good.  Places like \"Paul's Place\", \"Volcano Burger\", \"Duke's\", \"Athenian Burger\", and more.   These places aren't all exactly identical, but you kind of get the feeling that they're owned by a bunch of cousins in some big extended family, and you can tell before walking into one that the food is going to be excellent.    Unfortunately, you just don't seem to find many similar places here in the SF Bay Area.  There are some good burger joints, but nothing like those ones down south.  So when a friend introduced me to Sam's a few years back, it was a revelation.  It looks nothing like any of those favorite SoCal joints, but the food is right up there alongside them.  The decor isn't for everyone -- it's small and the 6 or 7 seats at the counter represent most of what's available.  It's most definitely NOT dirty, despite some of the reviews here.  Appparently some people cannot tell the difference between a place that is genuinely dirty and a place that's just a bit cluttered and perhaps in need of a paint job.  Frankly it looks like that place in the old Saturday Night Live skit where John Belushi is going \"Cheeseburga, Cheeseburga, Pepsi, Pepsi, Pepsi\".  It's a hole in the wall and anybody expecting the shine and sheen of a McDonald's will be disappointed.  However, anybody expecting a fresh, hot, juicy burger will get exactly what they're looking for.", 
    "review_date": "2008-03-23"
  }
}