{
  "dWRhg308dndiGKUdGIqdWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex H.", 
    "review_text": "Great sports bar - gets too busy sometimes to even find a place to stand but if you can get a seat you should have a great view of at least a few TVs", 
    "review_date": "2014-12-22"
  }, 
  "f2ht-NVUgFNCgRJu_4p1VA": {
    "user_rating": 2.0, 
    "user_location": "Lower Pacific Heights, San Francisco, CA", 
    "user_name": "Paul C.", 
    "review_text": "Food was good.  Nachos good.  Atmosphere fun. It definitely has the bar feel versus the old tortilla heights feel which was both a family and a bar feel.  We will go again but I hope the operators realize that an important market segment for them is the families in the neighborhood who provided lots of revenue to tortilla heights by bringing their young families in for dinner during the 4-6pm hour.  This place seems more geared to be a sports bar....which can be found down the street.  Which is cool. But i think they are missing out on an important market segment in this area that can make them a successfully business in the long term", 
    "review_date": "2014-06-17"
  }, 
  "JJFfwlg26lsQ6n8QiJ-b1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L R.", 
    "review_text": "Hit or miss... Food is tasty, as long as servers can get it to you while it's hot (best Chicago dog I've had in SF!). Servers and bartenders are generally helpful, but communication is strained during busy times. It's usually too crowded to enjoy a game. And the crowd tends to be brassy.", 
    "review_date": "2014-11-26"
  }, 
  "jv-ZgG15yAFeCB7aAXll-A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer A.", 
    "review_text": "Enjoyment of this place may depend on when you go.  We were there for lunch on a Saturday when there were no local sporting events or big major games going on.  I found it odd, though, that whoever decides what to put on the TVs had re-runs of hockey games, ESPN News (with no sound or closed captioning) and NASCAR instead of showing some live baseball from around the country.  There was at least one game underway on the east coast.  If you're going to be a sports bar, you need to be more on top of what live sports are actually available. On the other hand, if you don't get the Tennis channel, this is a good place to watch Tennis games you might not otherwise see.  As for the food, SFAC hit one of my pet peeves - being told that food is not spicy hot when in fact it is.  Don't believe the server if they say the chili isn't hot.  It is very spicy.  On the other hand, this problem was quickly and politely solved with a substitute order.  The house salad is very good, as was my friend's hot dog.  Prices:  A little high, esp. when you consider they have a surcharge of 4% for health coverage for their staff.   Would we go back?  Only if they were showing a game that we couldn't get at home or somewhere else.", 
    "review_date": "2014-07-27"
  }, 
  "S2aLqy_qUspI2vN5HPXEZg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew M.", 
    "review_text": "One of the few bars with a good late night menu.   Moderately Priced Drinks and Great Service.   I don't frequent this area often but when i do i will make a stop at this bar.", 
    "review_date": "2015-01-28"
  }, 
  "lZ1-0lDWY4j423iTVKt4fw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marlon R.", 
    "review_text": "This is a brand new bar just opened 20 minutes before World Cup 2014. The place is awesome, clean. The food is really good and tasty. No place is perfect but they come close!", 
    "review_date": "2014-06-20"
  }, 
  "GQv1Q0vrCpJZ3plb867grg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bartholomew H.", 
    "review_text": "Great staff &amp; vibe. Great tvs for games. Decent Bar food to go with a game and a drink. Great addition for SF'S sports bar enclave.", 
    "review_date": "2014-07-23"
  }, 
  "9TU7N1iM3mTY9OcZJhpv0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie L.", 
    "review_text": "The sports bar has multiple tvs on each wall and there is a shuffle board. They have a full bar too. I think it is a step up from tortilla heights. I have a feeling this will be the next after work spot.", 
    "review_date": "2014-06-12"
  }, 
  "9eCLgpfttcVUlQ3GM0kQig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coco K.", 
    "review_text": "Such a fun place to watch any sporting event. Food is great and the people are amazing. Next time i come to watch a game I should reserve a booth because it gets really packed for big games! There are sooooo many tvs to watch so its perfect for everyone to watch whatever they want!", 
    "review_date": "2014-12-08"
  }, 
  "A1Y1Xv-uJUbjW75va4x1yA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris A.", 
    "review_text": "This is my favorite sports bar in San Francisco for a few reasons: 1. TV's everywhere so you can see literally every game that's on TV.  Amazing for football season when there are multiple games on all day 2. The fries and chicken wings were delicious.  3. Great beer selection and there is wine on tap", 
    "review_date": "2014-09-24"
  }, 
  "zVxhqFZ0oltkd5sWLoTEfg": {
    "user_rating": 1.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Brad L.", 
    "review_text": "Be careful, they will blatantly overcharge you. Bartender gave me a tab that clearly was not mine - when I brought it to her attention, she updated my bill to the correct amount.  Just checked my online banking, and they charged me BOTH amounts.   Ridiculous, will never come here again and will advise everyone I know to do the same.", 
    "review_date": "2014-11-12"
  }, 
  "zq3CaV-K8oCAJpaqLdwhpQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keith S.", 
    "review_text": "I ordered a Caesar salad with grilled chicken, and 10 min. after eating only a couple of bites of it, I was feeling ill and something not good happened next. The chicken was severely over cooked, the lettuce was old as evidenced by the obvious signs of decay, and the dressing tasted bitter. I have joined Yelp and written this review to help other people avoid getting ill from eating at this poor excuse for a food serving establishment! The icing on the cake happened when I responded to the sever asking me, \"how is your salad\". I promptly and professionally explained the problem with the salad, NEVERMIND the entire salad was sitting in front of me, and she literally looked at me and walked away.", 
    "review_date": "2015-01-15"
  }, 
  "P7V1gC2K41B7I2CJc3bkfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pablo R.", 
    "review_text": "Saw a crowd for their soft opening so I  decided to give this new place a try the following day.  Walked in on a World Cup match starting and the place was full.  A wooden pub ambiance with lots of nice new TVs and a modern sound system gave the place a buzz.  The crowd got bigger and the staff got busy.  Being their second day, there's still some wrinkles to iron out but it was all good.  The staff was attentive and the burger was delicious.  A grill toasted but with a nice patty, bacon and cheese.  Lots of drink options including a \"tub of beers\".  Somebody please post a pic of it.  Definitely fun and worthy of a return. Parking can be tough on nearby streets.", 
    "review_date": "2014-06-13"
  }, 
  "cupCm8t-Oda3gYCWpxhzqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tessa B.", 
    "review_text": "Fun for games, bath tub of beer is awesome, wings are fabulous and bartenders are always really nice to me (maybe because I have boobs?).", 
    "review_date": "2014-09-09"
  }, 
  "K1NLdTfT1IizE-6smhsSug": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayrn H.", 
    "review_text": "Walked in on a Friday night after being so excited that a new sports bar is coming into the neighborhood. Well...horrible music was blasting and all the TVs had the Giants on.  I am not a Giants fan, but at least have the sound on for the game and not the crap that was playing through the sound system. Too many \"sport bars\" in sf already do this and it's so frustrating!!!! My husband and I ordered a beer each and a shot for him. After going to the restroom (which smelled so strongly of paint), we walked out after not even drinking half of our beers.  It was that bad.  I hope they improve but I'll stick with Blackthorn and Brickyard for sports right now.", 
    "review_date": "2014-06-13"
  }, 
  "QfRE7xS2RvQZrMa_J-DIsg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stari N.", 
    "review_text": "I really wanted to like this place. It looks new and spiffy and their fries are really good but they don't have happy hour. Who doesn't have happy hour? At 3:30 in the afternoon I shouldn't have to pay $6 for a draft beer. Would like to go back but not until they organize a happy hour. They have specials during games but only for Bud light.", 
    "review_date": "2014-09-19"
  }, 
  "rocDFDgw5uO594m9J_Ztpg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren O.", 
    "review_text": "Went here after work on Friday and it was the perfect spot to start my night. My friends got the bathtub of beers which was perfect for a large group and I started with an old fashioned and nachos. The nachos were BOMB. The wings were tasty but could be a little crispier. Definitely going back tonight.", 
    "review_date": "2014-06-28"
  }, 
  "2upKabdFGrDviO1z7JRj5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse C.", 
    "review_text": "Great spot, all the tvs you could want. Had the pretzel and it was delicious. Love the idea of the beer tub, I will be coming here for all the football.", 
    "review_date": "2014-06-14"
  }, 
  "lc7pyAj7ED-vuVSg_L5FUw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Paul F.", 
    "review_text": "pretentious douchery", 
    "review_date": "2014-10-25"
  }, 
  "qC50T_ldJ96wPBNDD6vtEA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Stephanie V.", 
    "review_text": "San Francisco Athletic Club is the new bar taking over the space on Divisdero that used to be Tortilla Heights.  The owners of The Corner Store just started this place, so you can expect great food and an energetic environment.  I recently moved to San Diego, so I only got to hangout here a couple times, but the place is pretty awesome.  If you remember the layout of TH, you'll be happy to know they have extended the bar so it raps around the corner and created more space for high tables near the bar.  The bathrooms have also been greatly improved and renovated.  It really doesn't matter where you sit at SF Athletic Club, because you will have a great view of whatever game happens to be on.  The TVs are no more that a couple feet apart, posted high on the bleacher bench wood walls.  There is shuffleboard and pool for those who want to play.  My only issue is with ordering food.  The menu is extensive and there is definitely something for everyone, but both times I was there I had to ask the wait staff to order food.  The first time, the bartender took my friend's order and then walked off without taking mine.  The second time I was given a menu when we ordered drinks, and when our waitress returned with our drinks she took the menu and walked off.  I had to flag her down and ask her if I could get some food.  I would think they would want me to order food, and it happening both times I was there it was more comical than annoying.  I was starting to think there was something about me that said, \"she doesn't eat food.\"", 
    "review_date": "2014-07-13"
  }, 
  "5qgJTus1l35A6bqW2fFk0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raina D.", 
    "review_text": "New favorite sports bar in the city.    1) Get there early-if you are serious about sports and ACTUALLY GO TO WATCH THEM-then this shouldn't be an issue.  If it is, go to the marina and \"watch\" there.  2) Get there early-to grab a table/communal spot/bleacher area as a home base for you and your group-see above on rationale.  3) They have every game on. every. game. YES.  4) EAGLES bartender, enough said.  5) Good food (breakfast and lunch)-yes, I have stayed through both meals. Judge me.  6) Spicy bloody mary's and Guinness on tap  7) EAGLES bartender.   See you every Sunday, bye.", 
    "review_date": "2014-09-24"
  }, 
  "so_tnz67YgVs6SxUcGCr4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jake S.", 
    "review_text": "SFAC FTW!   The chicken club is amazing! Good people, plenty of space - new and shiny! I'm not sure about some of the reviews below, but as a person that lives in the neighborhood, this place serves me well! I'm looking forward to seeing the Broncos games on the Big Screen here!", 
    "review_date": "2014-07-18"
  }, 
  "G_PXw8MjRg4L-J-FGN7__Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rob M.", 
    "review_text": "BOOOOOOO ! Wow, what a complete bummer this was. First of all this place, the people, etc. does not serve the neighborhood. Who are these people ? It's a real shame that Tortilla Heights closed. The owners understood the neighborhood and catered to it. It had a great balance of family friendly and adult fun scene, plus really good food.   Now it's just a bloated, loud and unwelcoming place. Even though the SF-AC is three blocks from my home, I will walk the extra blocks to Harry's to watch a game and spend my money. I really hope that this is not the future of our great neighborhood. The owners clearly wanted to cater to one demographic.   They clearly  didn't consider the diversity of the neighborhood and certainly didn't have families in mind when the took over Tortilla Heighs. The owners should have taken a look at Tortilla Heights successful formula. Hopefully, SF- AC will not be long for this world and someone will open a  friendly neighborhood establishment. A real missed opportunity.", 
    "review_date": "2014-07-01"
  }, 
  "1dQiuUvvK8427TBmqj_4Vg": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Amy P.", 
    "review_text": "Saturday afternoon my husband and I drove out to the City for my friend Emily's birthday party at SFAC. Casey used to live nearby, but neither of us had been here before.  The place was a lot of fun! Lots of TVs all around (great for sports - we watched part of the Warrior's winning game). The bar had a lot of seats around it which was where our group was primarily focused, but there is a lot of room away from the bar as well, including a spot in the back where they'll even lower bleacher-style seating for parties.   I was starving when we arrived so I ordered a menu before getting a drink. The girl next to me was eating nachos and I ordered the same thing ($11, you can add chicken for $4 but it's a lot of food without that). My husband and I really enjoyed the crispy bean and cheese covered chips. I loved all the jalapenos throughout the cheesy goodness, but a spicy slice occasionally hid in the guacamole or under sour cream, so my husband had to inspect his chips more closely. Lots of olives too - and I was treated to a homemade hot sauce/salsa on the side. Super hot! Super delicious.  I had a Bloody Mary and I was pleased that my \"sort of spicy\" request was spot on. Erin made the perfect sort-of-spicy drink and even resalted my rim without me asking after seeing most of the salt had kind of rinsed off onto the side of the glass. Seriously wonderful bartender. And she kept coming over to check on us, making sure we had enough glasses of water - and of course, quite a few Fireball shots. Hours later we left the bar with a $70 tab that I thought was really fair.  One thing that I've probably never mentioned in a yelp review but is worth mentioning here: the napkins! The soft, absorbent napkins were the best! No, I'm not kidding, they really stood out in my memory. They were perfect for keeping ourselves clean while eating our finger food.", 
    "review_date": "2015-01-19"
  }, 
  "yCFPgS91Ej1AZo_KRpOdrw": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "E.J. R.", 
    "review_text": "Reading some of the negative reviews here just further cements my opinion that many people in San Francisco are simply petty internet warriors with bloated senses of self import. SFAC is a sports bar, and a pretty sweet one at that. Decent beer selection, nice space, plenty of TV's, NFL Sunday Ticket for all fans, great wings and huge bar.   How dare they!", 
    "review_date": "2014-10-19"
  }, 
  "817ErNQeMjw-jfgVLZH6MQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel C.", 
    "review_text": "This place is the tits! Hot babes ehreewhere, telees in all directions playing your favorite game and the wings are on poiiiint. I can fox wid it. So should you.", 
    "review_date": "2014-06-21"
  }, 
  "egV08tEAm4YikrevXB_5dQ": {
    "user_rating": 5.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Jamie L.", 
    "review_text": "This is what I imagined the ultimate San Francisco sports bar would look like. High-tech tv's at every angle, local and craft beers on tap (my fav being Trumer), Greta bar food crafted from the guys at the Corner store, and a comfortable living room vibe.   I came in here to watch the World Cup, and as expected every seat was full, somehow we got a table and ordered good. Here are the highlights: sirracha chicken wings had a good spice, the burger was simply tasty, crispy garlic herb fries, and the pretzel, you gotta order the classic pretzel!   In my party of 3, everyone could see the action from the 20 or so big screens. We had a few beers and the donkey spit mezcal cocktail...I recommend this one if you enjoy smokey flavor of mezcal.   I look forward to making this my go-to sports bar and I've heard they're going to have bathtub beer coolers, sounds like fun for a big game or birthday party.   One of the biggest surprises was that even tho the place was packed shoulder to shoulder the crowd was still friendly and fun.", 
    "review_date": "2014-06-15"
  }, 
  "dchf_aWTFQdRCrFZuQSclA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meg G.", 
    "review_text": "I like the atmosphere - since I am a sports fan-, however they are unhelpful when it comes to planning an event. My company was thinking of having an event here, and the woman who \"helped us\" informed us that they cannot give good discounts unless you buy certain beers in bulk (mostly Bud/Bud light). Nothing says company splurge like Bud Light!   Also, no happy hour. Really? If I'm paying six bucks for a beer at 4pm, there is something wrong.", 
    "review_date": "2014-10-05"
  }, 
  "16NGkckAeMM-OWlt9x3vAw": {
    "user_rating": 4.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Sean D.", 
    "review_text": "I've heard about this place on Thirllist and decided to check it out with my buddy last Saturday for a few World Cup Games. This place has everything you want in a modern sports bar: large TV's everywhere, cold reasonably priced beers, solid food, they have old school wooden bleachers in the back which I thought was awesome,  the staff was helpful and cheerful considering we were trying to drink at 9:00 am on a Saturday. The bar had padding around the bar which is nice and comfortable and there is plenty of seating and spaced out nicely. I really can't say a bad thing about this place aesthetically or the staff. It's funny because they are still working the kinks out because it's a brand new place and everyone was still helpful and extremely accommodating. I was a bit hungover and was served an ice cold beer and a cup of coffee immediately.   The food there looks and smells great but I can say the only thing we tried were the chili fries which weren't terrible they just weren't great - I could make them easy. It's the only reason I gave it four stars but I have a feeling this rating will change after I eat some of their other food.   Look, if you just want to kick it, watch a game, have a few bevs and eat good food look no further.", 
    "review_date": "2014-06-27"
  }, 
  "BXvHuKaER8UUE7EoXsSHFw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sarika S.", 
    "review_text": "I'm kinda surprised to see many not so great reviews about this place, enough that it made me question going. We got there at about 5 for MNF and found seats. Some of tables were reserved (good to know that's an option). Our waitress was SUPER friendly and helpful.  I ordered the chicken club, it wasn't bad, it wasn't amazing, it was typical bar food. It came with a ton of piping hot fries! Yes it's $13 but you get a decent amount of food and it's SF. They had a promo for $9 you get a shot of whiskey and a beer, waitress even let us share.  Tons of TVs to watch the game. Parking can be found around the neighborhood. It does get crowded so come early to get a seat.", 
    "review_date": "2014-10-14"
  }, 
  "JA0cuMA3T2ePcii5XBIq6g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joustin C.", 
    "review_text": "I was really excited to check this place out, but it was a complete disappointment. The atmosphere is amazing and they have a ton of tv's, which will be clutch during the football season. So the reason I'm giving it 2-stars is for the following:  1.  Food. There isn't a big selection and it's on the pricey side. Luckily there are other great places to eat along divis, so you can just go there to drink. I ordered a coke, burger, and fries and it came out to $25. I don't have an issue paying $12 for a gourmet burger, but this was a standard bar burger...  2.  Service. It was HORRIBLE!  Out frumpy waitress saw us waiting by the door and made eye contact with us a few times before I finally approached her. She told us we could sit anywhere but was very dismissive. The place was pretty dead by the time we got there and she was more interested with chatting it up with the other bartenders, than she was checking on us.   At the end, we decided to leave and go to Harry's on Fillmore.", 
    "review_date": "2014-08-25"
  }, 
  "Q1nNWQJ-gBb912JxnAytDA": {
    "user_rating": 5.0, 
    "user_location": "Greenwood Village, CO", 
    "user_name": "Sarah S.", 
    "review_text": "great selection of beer and wine on tap. lots of TVs in prime spots to watch games. food was way above average for a sports bar - delicious salad, sriracha wings, and hot dogs. fun vibe. will definitely be back!", 
    "review_date": "2014-07-04"
  }, 
  "5n_dkk0dEHFSNIJN5AMmvw": {
    "user_rating": 3.0, 
    "user_location": "Bronxville, NY", 
    "user_name": "John Y.", 
    "review_text": "May have just been the particular crowd that Friday night, but it was a bunch of douchebags bro-ing out. Almost got into a bar fight over something silly...ain't no one got time for that.  Beers on tap, on the other hand, were solid.", 
    "review_date": "2014-08-09"
  }, 
  "mxsAnGKKh7cE2ZyDAyOjGg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Baron C.", 
    "review_text": "As a pure sports bar, this place works well. They do a good job of keeping as many channels/sports running as possible, with the biggest event running on the biggest screens. The selection of beer looks good from a glance as well. On those merits alone, I'm glad this place is here.  I'm still holding out more hope for the food. It's price point is as high as you would expect for a San Francisco eatery but the quality is a little hit or miss. I recommend the chicken club as that seems to be the most consistently good thing on the menu. I would avoid the nacho appetizers, as they tend to come out a little undercooked, with un-melted shredded cheese. The wings are solid but won't blow you away.", 
    "review_date": "2014-11-20"
  }, 
  "R7tgJ_HJFoixGIR3gzK8Ig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erik L.", 
    "review_text": "This place has a great selection of beer, their food is good (portions are large), and there isnt a bad spot in the place to watch a game.  The only gripe I have with the place is the pool table is out-of-place and unnecessary.  You can't play pool if the place is packed because you're surrounded by tables with people, and it just doesn't fit well with the rest of the bar.  I think they would be much better off removing it to make room for more seats.", 
    "review_date": "2014-07-14"
  }, 
  "nM1Ldn0n4zdv8kl0K8sXDQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin B.", 
    "review_text": "We have visited SFAC on 3 different occasions. The first time was a very quiet Saturday afternoon before football season started-- that day, the service was attentive and the food was tasty (however, somewhat overpriced).   The second time was for college football a few weeks ago and the place was definitely busier, but not too crowded. That time, the service was abysmal and the food quality lower than the first time. We had to ask 3 different people to get a TV channel changed to the game we wanted to watch. The first person replied, \"I think we can do that,\" but didn't. The second person said \"I think they will.\" But they didn't. Finally we were able to find the owner, who changed it for us easily. They really need to talk to their staff about this-- watching a specific game is the reason you come to a bar like this and there was no reason why it couldn't have been done the first time we asked (she could have just asked the owner to do it if she didn't know how).  Nonetheless, we decided to give the place another shot and reserved a booth for this past Sunday to watch the 49er game and Giants game, which happened to be on at the same time. When we showed up for our reservation, we were told that some people were finishing the Redskins game on the main TVs but after that we could switch the channel. We were fine with that until we realized that also meant that we weren't allowed to sit in our reserved booth until that game was over, either. We waited 25 minutes over our reservation time for the game to finish, missing the first quarter of the 9er game crammed into a corner and unable to order anything. It was soo PACKED!  When the Redskins game finally finished, I had to ask the owner if he planned on telling those in the booth that they had to move. He was going to make us do it! I'm sorry, but making us wait like that was bad enough without making us act as bouncer for their customers, too. The owner helped us ask people to move but only after I asked him. Once we sat down, our server did her best to serve us but our food took over an hour to come. Just crazy. [Props to the server for trying super hard in what must have been horrible working conditions. I'm pretty sure the place must have been packed over their fire code capacity and they weren't being very attentive about it!]  Also I should note that the vibe here on game days is super Marina douchey. I saw some guys almost get into a fist fight over seating... A drunk guy jumped onto the pool table and stood up there... A rude girl stuck her hand in my friend's plate of food and took his fries when he teased her about using our table as her personal bartop... A wasted guy was passed out outside after the game and his friends had apparently just left him there bleeding. Yeah, that was the vibe.   Finally, I really have to note the absurdity of their prices given the atmosphere and (declining) food quality and service. Their house burger is $15, and a pitcher of basic beer (Stella, for example) was $22 for what seemed to be only a few pints. Very not worth it. Will not be returning.", 
    "review_date": "2014-09-22"
  }, 
  "nJ0hGm8V-vbIcCc9-NgzEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "omid a.", 
    "review_text": "as most of the other reviews on this new place, there's only a few things that can be said so far.    - great for watching the world cup with so many tv's - lots of great spirits to choose from - and packed house  the last one is the only problem i had with this place...and i can't really knock the venue for my opinions, but boy does this place draw in the marina/polk street, douchey non sport fans. its really disappointing that SF can't figure out how to have a legitimate sports bar that the crowd can just shut up and focus on the games on the 20 tv's.   with 2 gentleman standing behind me as i'm seated at the bar, i overheard the following on this particular saturday afternoon in which i came by to catch the quarterfinal world cup matches :  \"no no, you can't soak your kale for too long, it'll lose all its nutrients!\"  please stfu and take your pretentious conversations out of this quality sports bar!", 
    "review_date": "2014-07-22"
  }, 
  "Z0u6nxfaHYeqdUnH_FnDiQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barry B.", 
    "review_text": "Great setup but it gets way too crowded. Nearly impossible to move around, get a drink, go to the bathroom, etc. High level of chatter makes it tough to hear the game audio when you're there to watch the big game. Owners should consider letting less people in to improve the experience.", 
    "review_date": "2015-01-18"
  }, 
  "TLMD9ENh_QVLTOVgzN5UPg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janet Z.", 
    "review_text": "Big fan of this place. Our group came here for several games during the World Cup and the vibe was great. There are plenty of TV's everywhere, comfortable seating including booths, and even a set of working bleachers in the back!   The food and drinks: + breakfast burrito and breakfast sandwiches are really tasty. the chips are also surprisingly good. + the bloody mary is spicy and I like it + the servers were nice and attentive - the food was a little slow to come out of the kitchen, so order ahead of time  Bonus: working free wifi", 
    "review_date": "2014-07-01"
  }, 
  "K8Q94SH8asFViH8ScVLvzg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy N.", 
    "review_text": "AMAZING PLACE TO WATCH THE GAME  I think I came here for Game 4 of the World Series and I LOVED IT!  TVs everywhere, like the electronic section of Best Buy.  Everywhere I looked, I had a great angle.  And the staff is amazing.  For being such a ridiculously crowded and rowdy night, they handled themselves very well.  I was really impressed.  Really fast and prompt service.  5 stars for sure!", 
    "review_date": "2014-11-30"
  }, 
  "Rh5683oi7ROsMULqFLiiAA": {
    "user_rating": 3.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Brian H.", 
    "review_text": "Visited this place on a dead Monday night. Watched a little football and had dinner. The place was pretty empty so the service was fine. I got the salmon sandwich and thought it was pretty good for a sports bar. The TV situation is amazing compared to most other SF bars. Adequate in general. My normal sports bar is Greens in Russian hill. They have 3 dollar shock tops and bud lights all weekend. I understand this place is new with bells and whistles but the prices are pretty steep for drunk like me. Beers @ 6 each add up.", 
    "review_date": "2014-10-21"
  }, 
  "ZFfVA5AbfB6gnrYI5u-SRg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rome T.", 
    "review_text": "So wait a minute, these guys call themselves the \"San Francisco Athletic Club\" but they don't have the Pac-12 network?  Once they fix this I'll change this review.", 
    "review_date": "2014-10-04"
  }, 
  "LUzp4k_CtFMn31XXRPyntg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zard A.", 
    "review_text": "You need to order the tub of beers for you and your friends XD", 
    "review_date": "2014-08-27"
  }, 
  "915COZq6cAqbXIlQMh9rXg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea S.", 
    "review_text": "Pretty fun if you can get in. I've been turned away 3 out of 4 times because they were at capacity... So don't make plans here unless you can arrive super early. You'll be out of luck otherwise.", 
    "review_date": "2014-09-21"
  }, 
  "Mlx7ZLwbhzjU7RmRVs4ngg": {
    "user_rating": 4.0, 
    "user_location": "Pinole, CA", 
    "user_name": "Sean H.", 
    "review_text": "Dang are people really bashing this place because they don't have a specific channel? Wow boo hoo lemme get you a bandaid, so sorry the world doesn't cater to exactly you and your wants. My night here was pretty fantastic if I may say so myself.  So many TV's. Like, almost too many. You can't really look anywhere in this bar without having a TV somewhere in your peripherals. Which means, there's really no bad seat in the house. Love the bleacher seats they got in the back of the bar. Just a little dirt and grass away from the real deal baseball field.  Prices are a little bit steep here though. Don't really mind paying it all that much, but still, a hit to the pocket isn't much appreciated. Atmosphere here isn't all that bad. Really haven't encountered any of the \"douchey\" type that everyone else is complaining about, and the service here was super friendly, and they made sure to check up on us every so often, even on a busy Giants playoff game night.  Gonna make this one of my sports haunts!", 
    "review_date": "2014-10-08"
  }, 
  "kjiY1LAzqRPTxGUIEeRYWw": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Kayla R.", 
    "review_text": "Loved how many TVs were in this place. They serve great game food and our service was great. Their mixed drinks were a little on the pricey side so I'll probably stick to beer next time.", 
    "review_date": "2014-09-22"
  }, 
  "IznoRPP3px5cGwRubOSNJQ": {
    "user_rating": 5.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Jessica D.", 
    "review_text": "Awesome sports bar in lower PAC heights. Friendly, fun, good standard bar fare. Pool table, lots of TVs, booth space, foozeball. Thank God this place opened. My new neighborhood staple.", 
    "review_date": "2014-08-02"
  }, 
  "Cfg3uoYmVPh41O3hVkS0gA": {
    "user_rating": 2.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Brendan B.", 
    "review_text": "Before this place opened, I was super excited to have a sports bar so close to my house. Since then, however, I have been 3 times and left disappointed each time. Yes, they have a lot of TVs so you have a great angle from everywhere you sit or stand. They also have shuffle board. Those are the only positive things I can say about this place.       I once called AND went in person to see what time they opened because I'm interested in watching Premier League soccer. Both employees assured me \"they were open any time there's a game.\" Highly doubtful. There is ALWAYS a game happening somewhere in the world. Sure enough when I went bright and early, they were closed.       I went with some friends once to get some food. Ordered a cheeseburger. Simple enough. It was awful. Cooked all the way through the frozen patty. Tasted just like the burgers at a stadium - not something to be proud of. And it had the price to match, $12.       Went another time just to grab a beer. Sat at the bar for about 15 minutes and nobody even came remotely close to my end of the bar so I stood up and left.       Last thing to add - unfortunately the Marina douchebag crowd comes over the hill to this place for their frat-tastic fist-pumping reunions. Overall this place was a huge disappointment.", 
    "review_date": "2014-10-05"
  }, 
  "34qzExYjvWdkEpvDoifNYw": {
    "user_rating": 2.0, 
    "user_location": "Folsom, CA", 
    "user_name": "Mark S.", 
    "review_text": "Stopped in for a quick lunch. It was very slow, ( as in empty) so I was greeted instantly. I had the chicken sandwich. It was decent. Not bad, but nothing special... just typical bar food. The chicken breast was obviously mass packaged frozen processed chicken and of low quality. The chibata bread was what you expect, the bacon was the instant microwave variety, but the produce was at least fresh.  Again, it was ok, but not great.   The server was polite, pleasant, and efficient. Not much else to say about the service... It was quick and to the point. My main gripe was the price. 13 for the sandwich, 3 for a soda. After tax, I was out 18.10 for a sandwich and coke that was worth about $7 at any fast food joint, plus a tip just so she could bring it to me. It was a joke, and not a funny one.   The bar is cool, and has lots of TVs. (as in... LOTS). Good sports bar. I'd come here to drink beer and watch a game. I would NEVER EAT here again though.", 
    "review_date": "2014-08-19"
  }, 
  "QUiEPHClIuOylnxq114P3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ted R.", 
    "review_text": "Excellent place to watch a Niners game! Great place for football in general. So many screens. It's panoramic HD bliss. On any given Sunday, you can watch every game! And isn't that what the football gods want for you to do...worship the pigskin on the holy day?.  Lots of great beers on tap. Bartenders are on point. Wait service is pretty good. There's even space to find yourself a place to sit. Now this is a club you should join!", 
    "review_date": "2014-11-14"
  }, 
  "_p23u8buJhC9CO5tQtA-UQ": {
    "user_rating": 4.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Natasha M.", 
    "review_text": "Best sports atmosphere in SF, only been open a couple of months and at full capacity so it's definitely the spot! Only con is the bartender helping us was drunk. Didn't even know if they had cider or gluten free alternatives. Even if gluten free items aren't by popular demand here, a little unprofessional if you aren't aware of your selection. We will be back for a second impression.", 
    "review_date": "2014-07-13"
  }, 
  "rBRuie_HNzxCkMDF-ooRog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Myra M.", 
    "review_text": "It's about time a modern cool sports bar pops up...somewhere that is not located in the Marina or in SOMA! The first time I was here with my girlfriends and my boyfriend at the time; watching the NBA Finals: Heat vs Spurs. That game is a prime example that age can prove to still be fabulous; similar to a phenomenal bottle of red wine. And now King James has opted out... how crazy would the the Bay Area be if he joined the Warriors?! John &amp; I ordered the pretzel &amp; green beans before the girls arrived. Yeah he looked at me funny when I ordered it, but he was surprised how much he loved it. Service was excellent; super friendly &amp; attentive.  Last Sunday my girlfriend &amp; I showed up 3hrs before the FIFA World Cup:  USA vs Portugal game; and to our surprise the place was already packed. No open tables; standing only! But we stayed. So happy we did. It was so much fun watching the game there; huge HD flat screen TVs everywhere! Our friends couldn't get in. We made new friends in the bar:) Although some people weren't too happy when I whistled for #7 Cristiano Rinaldo. Yes of course I wanted USA to win, but he is the hottest Fifa player, how could I not?! Service again was amazing despite how crazy busy it was in there. Definitely my new go-to sports bar! Can't wait for American Football season!", 
    "review_date": "2014-06-25"
  }, 
  "Ayq4ZgLdZ6N2KrikTT0pHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan H.", 
    "review_text": "Went here for the first time last night (their 2nd night open). This is a true modern sports bar.   Tons of TVs, great bar games, and great selection of beers. Can't wait for football season here.", 
    "review_date": "2014-06-14"
  }, 
  "vaonYRp2bCbMh4zdIDPOtw": {
    "user_rating": 5.0, 
    "user_location": "Newtown, PA", 
    "user_name": "Mike M.", 
    "review_text": "Let me set the scene for you real quick. Tortillia Heights used to be my medicine for the grind. I digress; it shut down. Rumor has it they kept the best part of town, Erin the bartender is God's gift to this place. Request her when you get here and she will hook it up.", 
    "review_date": "2014-06-18"
  }, 
  "3OlPIhqXspHUyKejVSlLPw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew W.", 
    "review_text": "Other than what has already been said about the douchey crowd this place attracts, it's just overpriced (which is likely why they attract the d-bags).  $6 beers and $14 generic burgers (which don't even include a side) means this is an \"avoid\" spot in my neighborhood.  There aren't many of those, but SFAC has just joined this infamous list.  Sadly, nothing will change there as the place is always packed.  FML.", 
    "review_date": "2014-10-01"
  }, 
  "O13YdpM9qFqnp1NbjTBNsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy K.", 
    "review_text": "THE WATER IS SO GOOD HERE!  Also this place is awesome. All of the food is great. The service is outstanding. Come if you want to watch any game.", 
    "review_date": "2015-01-03"
  }, 
  "H0Wjx9QD1X91RgLdhCfe8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carrie T.", 
    "review_text": "SFAC became the new official bar for the Bay Area Redskin's Fan club and we love watching all our games there!!!  Huge shout out to the staff (Johanna, Kayla and Neil!!!)  They always work with us to make sure we have enough space for the group, sound and of course, they keep the drinks flowing!!! Keep it up guys!  Redskins fan? Join us at SFAC! <a href=\"/redir?url=https%3A%2F%2Fwww.facebook.com%2Fgroups%2Fbayarearedskins%2F&amp;s=1b3acdbda0eb4081656cdc96aee5ce6b423f40f5af0ece9881f036b8de61fa43\" rel=\"nofollow\" target=\"_blank\">facebook.com/groups/baya…</a>", 
    "review_date": "2014-11-21"
  }, 
  "K8xxw-Cw5fB8On4N8TRGOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex S.", 
    "review_text": "What can I say about this place it is simply amazing. The food is remarkable it doesn't even feel like a bar but more of a Good dinner. The nachos are to die for. Huge selection of beer in tap and they will Make any drink you want. It has a great theme and thy support boys and girls club. 28 TV's roll out bleachers for big parties you just can not go wrong with this place. Get your butts over here", 
    "review_date": "2014-06-17"
  }, 
  "JdkCKPqEAmswkiJOAykSHA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marten A.", 
    "review_text": "Fun place to watch the world cup. Food is pretty good but not enough servers so food and drink delivery is painfully slow.   Get here early if you want a sit during the game.", 
    "review_date": "2014-06-21"
  }, 
  "Qoi5TKfZBmSWHtCD0OizFA": {
    "user_rating": 2.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Bobby L.", 
    "review_text": "I chalk up my lackluster food and drink experience to opening week jitters.  Came here with two friends on a Saturday evening towards the end of a World Cup match.  I ordered a beer and Chicago hot dog and my other friends ordered the same dog, the Sriracha chicken wings, a two cocktails, and a vegetarian burger.  First to come out were the hot dogs.  Burnt to a crisp on the outer layer, yet stone cold inside.  My friend's dog had the same problem but also had a burnt bun.  Also, not even close to Chicago style-ish.  We were told the burnt dog was how the kitchen normally cooks hot dogs, and that the cold temperature was because they left an outside kitchen door open.  They offered to replace it with something else.  I got a SFAC burger instead and my friend went with a second try of the Chicago dog.    The second time was alright.  There really wasn't anything special about the SFAC burger.  I had to ask for more of the Thousand Island sauce to get some flavor out of it.  Definitely not worth $12. My friend's dog was alright and so was my other friend's vegetarian burger.  The drinks left a lot to be desired.  The Shocktop on draft was lukewarm, not cold.  The cocktails were pretty standard.  My friend reported that the SFAC version of a margarita was sub-par.  The crowd here is exactly what you would expect for a sports bar.  Marina bros thru and thru.  Just not as obnoxious as they are over the hill.  Overall, this place was a disappointment.  One of my friends openly wondered if this location is cursed, given the fact that Tortilla Heights (the previous restaurant in this space) was pretty terrible as well.  I expected much more, coming from partners and chefs who ran the Corner Store and Kezar Pub.  I'll come back, but in a few months, to see if there are any improvements.", 
    "review_date": "2014-06-15"
  }
}