{
  "S4g0qoWlYWdS-ldOUp0aDw": {
    "user_rating": 3.0, 
    "user_location": "Knoxville, TN", 
    "user_name": "Mark S.", 
    "review_text": "I debated on 2 or 3 stars, and decided on 3 because I HOPE that Score! makes it as a business.  It's so hard along this section of Broadway, as demonstrated by the closure of the venerable Enrico's and Little Joe's several years back.  The + and - of our experience is below:  (Note that it was a Sunday night so, that might explain some of this.) + The staff was VERY friendly.   + The drinks are very reasonably priced. + I'm a big North Beach fan so, the location is a plus for me. + Several TVs tunable to different games, and the staff put the Cowboys-Eagles game on the big screen for us. - The kitchen was closed, without any real explanation. - They're a bit disorganized (ie: The front door had to remain open because it automatically locked if closed.  OK in summer but, we actually wore our coats at the bar to stay warm.) - The ambiance is a mix of sports bar &amp; dive bar; any atmosphere is supplied by the clients, not the decor  We selected this bar to watch the game because of all the great recent reviews.  I expect they were a result of World Series mania, and the fact that SF won.  My sincere hope is that the owners manage that World Series 'good will' well, and survive in a very competitive bar and restaurant environment.", 
    "review_date": "2014-12-18"
  }, 
  "C233dctrboV9_x9m_Nf5LQ": {
    "user_rating": 5.0, 
    "user_location": "Brisbane, CA", 
    "user_name": "Brad S.", 
    "review_text": "Even though the Ravens lost, I still enjoyed myself! Checked in with the help app and got a free plate of parmesan fries to go with our round of beers. Great food and well-priced drinks.", 
    "review_date": "2015-01-12"
  }, 
  "cg49tBeVsE_JMAxQ-5_mOg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Tyrone A.", 
    "review_text": "Best Place Too Be on any given night in North beach. Very friendly bartenders, free pool, happy hour drinks what more to ask for.", 
    "review_date": "2014-09-11"
  }, 
  "KDSVi12k7GgaEe6_T5GZsQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jose A.", 
    "review_text": "Danisa was very courteous and friendly!  Great atmosphere and many TV's!  Great drinks, great burgers and garlic fries!", 
    "review_date": "2014-09-23"
  }, 
  "qDZON_eIlgEG6XZUrk9-lw": {
    "user_rating": 4.0, 
    "user_location": "Auckland, New Zealand", 
    "user_name": "Lauren T.", 
    "review_text": "Friendly bar with a good atmosphere and a lovely bartender. The drinks are well priced too! Good for a game of pool or watching sports. Predominantly male crowd. Easy going and welcoming place. Good for an after work drink before dinner.", 
    "review_date": "2014-11-19"
  }, 
  "JWa7VMsZwEc9NBWE3irTjQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mark B.", 
    "review_text": "Fun little sports bar. Went this past saturday. Six different games on, to include the Giants game! Beer was decently priced and the bar food was good bar food. It is not fancy, just a nice little neighborhood sports bar, nice place for a beer some wings and the game.", 
    "review_date": "2014-09-15"
  }, 
  "EBFqBMf4vxbdl9qRS4Upew": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Jeff G.", 
    "review_text": "We came here to watch game 5 of the World Series. Great sports bar with super friendly staff. Much larger than it looks from outside. Lots of TVs and seating.   I had the crispy fried oysters which were fabulous. Maybe a dozen of them with fries and buffalo &amp; cocktail sauce for only $8. My wife ordered the chicken strips and fries for $7. Everything is hand battered, fresh and came out quickly. Super yummy and goes great with Jameson and New Castle.   Did I mention that the staff is great?  They are really friendly and seem to be having a good time.   We'll be back.", 
    "review_date": "2014-10-26"
  }, 
  "k8DF_HahtAPBgRjY6_L5KA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maura G.", 
    "review_text": "Came here to watch a Giants with friends after an urban hike up to Coit Tower. Five big TVs with great picture and sounds from the game. Several college games were also playing and they had about five different games going at once.    Great beer drink specials during football ($12 pitchers of Modelo) and the food was phenomenal. One person in our group got the wings - so good you didn't even need the sauce and very meaty. I shared some Chicken Tenders - made fresh from scratch, well seasoned, and perfect for dipping in their many sauce selections. Buffalo and Pomegranate BBQ were definitely the best! After our meal, the chef came out to check on us and see if we had any feedback for the food.  Great experience for a sports bar. Clean, good food and drink and plenty of games. Highly recommend and will be back for more games and chicken!", 
    "review_date": "2014-10-04"
  }, 
  "3Kh9GKnsuhD3jE1H2tG3ew": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Jer W.", 
    "review_text": "Went here with my hairstylist on 3-11-14 10pm'sh.  Before I entered the bar, I recognized few of my friends hanging outside for a smoke, hella small world!  As I entered the bar, it's very presentable, has a pool table with ample room for people to shoot the balls .  Great sound system by Jess the kj (he does have a fair amount of tunes).  Coung (owner) was cool, treated me and my friend to a shot of Jamison. When I entered the bathroom, surprisingly decorative/clean.  I ordered the gummy bear mixed drink(yes it does tastes good, it's $7), ordered a guiness and Newcastle on tap, $5 each.  This is another good karaoke option in sf.", 
    "review_date": "2014-03-12"
  }, 
  "4Fy5Z7wqyiu6TfYol28N0g": {
    "user_rating": 5.0, 
    "user_location": "Alexandria, VA", 
    "user_name": "Russ M.", 
    "review_text": "Watched a Thursday night game here and the service was excellent.   Highly recommend this place.  The manager and bartender were the best.  Made us feel at home.  6 Very large TVs.  A true sports bar and others not watching the game seemed to really enjoy this place as well.", 
    "review_date": "2014-09-25"
  }, 
  "xqPWCty2JmvgORKYDgsYAw": {
    "user_rating": 5.0, 
    "user_location": "Everett, WA", 
    "user_name": "Dean L.", 
    "review_text": "We were visiting Seahawks, decked out in our 12 gear, and they took care of us here like we were visiting dignitaries.The staff and the native patrons were all exceedingly friendly. The beer was cold, the food was edible, and the 6 screens had the NFL on. Finally, because the Hawks got up by 14, the owner bought a round for my wife and me. You'll have a fun experience here.", 
    "review_date": "2014-11-02"
  }, 
  "gJTknzE8KYeqGwYLif42CQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenitha Y.", 
    "review_text": "Cheap drinks?  Hell yeah!  You can't beat $6 Jameson shots.  Seriously.   I just wanted to say that they have a brand new chef so that means a new, improved, and revamped menu!  It's not your typical bar food... It's that gourmet type of ish.  I'm very impressed.  Nothing is frozen and everything is made in house.    Come for the drinks and grab a couple bites while you're at it.  You won't regret it.", 
    "review_date": "2014-05-11"
  }, 
  "CB7Vr-X4JJ-lTvU3BebTqQ": {
    "user_rating": 5.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Kayla T.", 
    "review_text": "Great place to come and watch the game and stay for the beer Olympics. Can't beat great drink specials!", 
    "review_date": "2014-07-04"
  }, 
  "DpNmkcpUWVbeaWdulwM0zA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanne N.", 
    "review_text": "Definitely my favorite bar in SF! The staff is very friendly and mixed drinks are extremely strong, tasty and cheap. This place is very clean and gives off a very relaxed vibe.   The most exciting times to go is when there is a big game, but it's also a fun bar to just chill with friends on a random night.", 
    "review_date": "2014-05-02"
  }, 
  "iV-lG1iVEAJ0mZe9lcXVaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "Score is a great place to watch a game. It's a chill, laid back sports bar with plenty of TVs. You can play pool and grab some food as well. The food is decent bar food and comes out quickly. Drinks are reasonably priced. Staff is friendly. Best sports bar in the area.", 
    "review_date": "2014-03-24"
  }, 
  "G9cDjMcWju4ucc6haHdH1Q": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Roger S.", 
    "review_text": "Sports bar implies that they are showing more than 1 football game.  The 3rd star is only because of the friendly staff.", 
    "review_date": "2013-12-01"
  }, 
  "XtpLxoRvolypIuUgTDKZMg": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Hill, CA", 
    "user_name": "Tareq M.", 
    "review_text": "I love love love this place the bar tender \" greg\" is such an awesome guy.... Very patient and nice guy... I drive him crazy every time I'm there but yet he is super nice.... I play pool here too and the atmosphere is amaaaazing....", 
    "review_date": "2014-12-18"
  }, 
  "PrjuCug29fQRrUnu_cv8ig": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Ashley S.", 
    "review_text": "Came in to watch the Dallas Philadelphia game when we stumbled on a lucky parking spot right outside. Great drink prices, super friendly and attentive bartender. Even offered me a phone charger to use when she noticed me looking longingly at my dead phone! Will definitely be back next time I'm in town and looking for somewhere to watch a game!", 
    "review_date": "2014-12-14"
  }, 
  "BPwhrf_etdG2tzTFkTQVow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Papi R.", 
    "review_text": "This bar is awesome!!! Prices are legit!! They have combo deals on food and alcoholic drinks. You should check it out if u want something New.", 
    "review_date": "2013-11-03"
  }, 
  "k-Ou9NvHnWVkFyvVtEzz2A": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Jeffrey G.", 
    "review_text": "Best. That's a word that can be easily overused or simply thrown around. Any business that is described by this must earn it in some way. Without a doubt or a wasted second, this bar (hands down) gets a \"best\" in the bay vote. The owner and his lovely assistant went beyond their ways to make sure our group was well accommodated.   A great SF 9ers win against the Seahawks and an even better belated birthday event for a good friend. Thanks Kong and staff!", 
    "review_date": "2013-12-08"
  }, 
  "7-n8imiEmYNrgpUzckiKmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlyn C.", 
    "review_text": "3 TVs playing football, gumbo, jambalaya, and some pale ale.  The gumbo was good.  Price was right.  5 stars for a sports bar!", 
    "review_date": "2013-10-13"
  }, 
  "GSypxq4q6fAW84xcGlRBWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa Z.", 
    "review_text": "Super chill place with awesome bartenders. Pool table and beer pong! Come here to watch the game and grab some drinks", 
    "review_date": "2014-07-04"
  }, 
  "zuUcmenF26dkMTKV7dbqhg": {
    "user_rating": 2.0, 
    "user_location": "Ithaca, NY", 
    "user_name": "Diogo T.", 
    "review_text": "Just as a disclosure on my review: It was on a Monday, so this was not the ideal day for a visit.  Anyway, it was really difficult to have a conversation there. There were nice music going on, but next to us there was also a TV with high volume, making the sound environment very weird and difficult to have a tallk. I think the beers could be cheaper as well ($15 for a Nevada pitcher, $5 for long neck Heineken). We have arrived very hungry at 9:55pm, but the kitchen was already shut down. Well, no snacks.  It is not a bad bar, but the experience itself was not the best for its price.", 
    "review_date": "2014-08-05"
  }, 
  "lWH8xPPRJfuB_iBvWNPnwg": {
    "user_rating": 5.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Thuy P.", 
    "review_text": "Watched the Seattle Niners game here with about twenty friends. The staff here are great hosts, attentive, quick. There are for large screen tvs. Great place to watch the Niner game. Prices are cheap, food is decent.", 
    "review_date": "2013-12-08"
  }, 
  "6wQNz4Cb8ROPkzM3AfHWug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Norris T.", 
    "review_text": "excellent choice to watch sports games with hd feeds. The manager Cuong makes sure that everyone's happy and having a good time. downside is parking sucks but if you're here you should be cabbing or lyfting it home since nobody wanted to be DD anyway remember? Fun crowds with a great happy hour vibe. The food I tried was good enough that I would consider this place for a light dinner while you drink.", 
    "review_date": "2014-09-13"
  }, 
  "kNOkTScpPpIOwWGIjcGmtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "Wonderful staff, big comfortable space, tasty drinks and good bar food to boot. Super chill place to hang out and grab drinks. Love it, and its much cleaner than other bars too! Check this place out.", 
    "review_date": "2014-12-19"
  }, 
  "fK7BUTJCM3Qpv3k1hCCaUw": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Gabe L.", 
    "review_text": "Decided to watch the Hawks/Packers NFC Championship game here and arrived around 11am. The game was set to kick off at noon.  CONs:  This place was not open til a few minutes before noon. I get noon is its regular open time but the Conference Championship games happen on one day out of the entire year. Score! should definitely know this and open a couple hours early if it wants to pass itself off as a sports bar. Having TVs and knowing which channel is ESPN does not a sports bar make. Because there were no other sports bars around, I ate at Little Szechuan across the street that was (1) open and (2) had the game on its TVs. Good job, Chinese restaurant.  Hopped over to Score! after it opened. Staff was setting up tables, chairs and cleaning up through the 2nd quarter. My friend complained the place reeked of bleach because clorox was being used to clean surfaces.   PROs:  Did have audio of the game on. That is very important to me. There are a lot of TVs so you'd get a good view of a, if not multiple, TVs anywhere. The staff works hard and tries to get your order to you AQAP.  Conclusion:  If the game was at 3pm, I wouldnt have any complaints. Definitely open to coming back if circumstances so dictate. Not a go-to and won't go outta my way to come here. Business needs to be more savvy if it decides it wants to be a sports-viewing destination in a city with hundreds of them.", 
    "review_date": "2015-01-21"
  }, 
  "Rpx8zAkilqecWHXcoY12Zg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Gideon S.", 
    "review_text": "Really nice spot in SF; whether if it's to watch the game, to get hammered for cheap, or to lounge around and play pool/beer pong with friends. The place is very clean and spacious and the managers are very nice and social. Would definitely consider this to be a spot to be a regular at. The bartenders, Danisa and Joanne, are cute and friendly.", 
    "review_date": "2014-07-07"
  }, 
  "NmXgHiF_dyUObnBA5cbgRQ": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "S. M.", 
    "review_text": "Watched the Giants' playoff game there last night. Fleet week, fun crowd, great service, plenty of big-screens. Just what we were looking for.", 
    "review_date": "2014-10-12"
  }, 
  "IAIfSxxIZ4WK2OZQPiNDhw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine H.", 
    "review_text": "Anyone who is in the north beach area should come by and check this place out. The food is good. The drinks are cheap, they have great drink specials and an awesome happy hour! They have a lot of big screen HD TVs with multiple games on, a pool table, and the staff and management are very friendly and helpful.", 
    "review_date": "2014-08-30"
  }, 
  "I868gyPylEcBDQgjTBOxmg": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "JV Y.", 
    "review_text": "Hot bartenders Awesome snack food Good place to pregame before the club! And great spot to watch the Game, FOOTBALL, baseball and basketball + Ufc Great atmosphere and vibe!", 
    "review_date": "2014-12-02"
  }, 
  "bJ3BrMopNrN_3C9p-sF_qw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peyton H.", 
    "review_text": "\"sports bar\" is a stretch. I came here on a Sunday to watch football,  but they didn't have a NFL package. Which is the lamest thing in world for a sports bar to do. My advice is to avoid this place If your looking to watch football that isn't local", 
    "review_date": "2014-09-14"
  }, 
  "t9MtHB_hwKfwkW0Ie1yEoQ": {
    "user_rating": 3.0, 
    "user_location": "Murrieta, CA", 
    "user_name": "Christel L.", 
    "review_text": "The main reason I came to this bar was because of weekly(?) the Beer Olympics I read about while visiting SF, which is essentially what I'm reviewing.  Just a note to the event marketers: please be more specific about the address on the flyers/online ads. It took us a few loops up and down the street to locate the host bar.  From what I remember, once you get past the property bouncer, the beer games are in a separate space behind the bar you see when you walk in. (The whole place is pretty dark.) There's another bouncer at a podium, who is there to take your money as a participation fee. Then you're on your own, or so it felt like. We were completely confused as to how the whole thing worked. There was no explanation, just a number given to us at some point that corresponded to a table where we would team up with others. It got even more confusing to read and explain the rules of each game from a tiny sheet of paper. Given that a large percentage of the crowd was international and were that the majority of the people just wanted to drink, by the second or third round no one paid attention to completing actual games, let alone play by the rules and keep score. At the beginning, you're encouraged by the bartenders to a bunch of Pabst beers. It's cheap, but we still felt coerced into spending too much on unfinished alcohol--we ended up leaving after it was obvious the games were going nowhere.  It was a cool/fun place to meet a bunch of different people, but from an event standpoint, it was poorly organized. Upon walking out we caught a glimpse of the food and drink menu in the main bar. It looked okay, but who knows when we'll be back in town to give this place another shot.", 
    "review_date": "2015-01-16"
  }, 
  "X26kgDvuvb-9N5D5tXmY0Q": {
    "user_rating": 5.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Patrick W.", 
    "review_text": "Great place to hang out and watch sports! Great food and great drink specials and prices. Bartenders and staff are very friendly as well.. Greg (manager) was very accomodating and an amazing host. He made sure our group had a great time with beer pong and pool. Come.by anytime you are around north beach.", 
    "review_date": "2014-08-28"
  }, 
  "mxhKMWgzlW0uLVUxKRRIRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg H.", 
    "review_text": "Great place with affordable drinks! $5 draft beers! $6 Jameson, Jack Daniels, Fireball and more! $7 Goose, Ciroc, Hennessy and more!  Come by and have a drink with the amazing staff!  The food here is awesome and fresh so come by and try it!  Drink specials everyday, pool, and HD big screen TVs for your viewing pleasure!", 
    "review_date": "2014-08-11"
  }, 
  "j3l4yeeY3sisLUOc1_2-3g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessie A.", 
    "review_text": "SCORE! Is an Awesome place to watch a game, there are lots of flat screens, great surround sound, Affordable  stiff drinks, Free pool and great food!   Everyone here is really friendly and helpful, Not a tourist trap at all, lots of locals hang here. Great daily happy hour specials. The free-range chicken fingers and wings are worth a visit.", 
    "review_date": "2014-07-23"
  }, 
  "zIQLLbTJrq0kDpsulNzVRA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah S.", 
    "review_text": "This place is an awesome destination to catch a big game or just to chill. It offers a great Happy Hour, reasonable specials for food, specials during sports games, and that staff here is awesome!!! I would highly recommend.", 
    "review_date": "2014-10-01"
  }, 
  "orGSgkvh83m1Xne99lB5Pg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Nicolette C.", 
    "review_text": "Stopped by score one night out in sf to start the night. Chill, relaxed atmosphere was awesome. Drinks were not that expensive and they def do not skimp on the amount of alcohol in the shots! Kenitha was super attentive and made sure we were all taken care of. Love this place and def going back!", 
    "review_date": "2014-03-15"
  }, 
  "ADO7P-j6BBBF-d4QZE0CFw": {
    "user_rating": 5.0, 
    "user_location": "Merced, CA", 
    "user_name": "ngociie t.", 
    "review_text": "Very chill place to go to the people there are nice and seems down to earth.   I usually go to bars to eat since  I'm everyone DD and I have to say that the food is AMAZING! everyone is made from scratch and the chicken tender is to DIE FOR!", 
    "review_date": "2014-07-19"
  }, 
  "B8r1bBHRPn-1GECg_YbxhA": {
    "user_rating": 2.0, 
    "user_location": "Worcester, MA", 
    "user_name": "Breno R.", 
    "review_text": "The credit Card Was off, the tv also Was off and the fries for free were not that good... The amount of beers offered at the happy hour for a cheaper price was also limited... I was expecting much mor after the reviews...", 
    "review_date": "2015-01-05"
  }, 
  "s50LPX-Kcb1UBRue5gWdVg": {
    "user_rating": 5.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Nick R.", 
    "review_text": "Cheap beer, friendly service and GREAT bar food.  The wings and chicken tenders were the best I've had in a long time.  There are 4 different sauces to choose from but they do such a good job flavoring the wings you don't even need them.  Heard the ribs were good too, I'll be back for those!  Good TV's and great variety, they had 5 different games on.  I've only been here once but so far it deserves 5 stars.", 
    "review_date": "2014-10-04"
  }, 
  "qmN6cM8uGksWDkCfFAq4Og": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyler G.", 
    "review_text": "I went to ther Gin Mill with a group of friends to grab a few drinks and got such a suprise. Not only were the drinks really affordable, and plentiful, but there were so many different baseball and basketball games on , everyone in our group got to see what we wanted. The other customers in the bar were great, all drinking, talking and just having a great time. The music was a mix of newer stuff with some 80's classics and the staff was unbelivable, not only in getting all of us all drunk (the shots flowed like water), but they were frindly and good looking. If you want a fun place to hang out with friends, drink, catch some games, drink some more and look at attractive patrons and staff then you need to visit Score! Bar and Lounge!!", 
    "review_date": "2014-09-02"
  }, 
  "OCzz9koVdNvQEfVMF8aA3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily Y.", 
    "review_text": "Great place just to chill and watch the games. Good service and free entry when it was New Years Eve. Yahhhhhhhh", 
    "review_date": "2015-01-14"
  }, 
  "-xgNM_frQrvskQIbp93tvw": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Danisa O.", 
    "review_text": "Really awesome place to come hang out, play pool and beer pong!  Big screen HD TVs as well as a kitchen that has amazing food!  The chicken tenders and wings are so good!  The drink prices here are very reasonable and the staff and management are very accommodating and friendly! Come check this place out anytime you're in the city looking for a good chill place to hang out!", 
    "review_date": "2014-09-26"
  }, 
  "MNSEAVrRq-7KrleJfeLQ7w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kat W.", 
    "review_text": "Awful food. My $8 chicken nachos came about an hour after I ordered them and looked more like chips, a spoon of sour cream and beef grease. Unfortunately I was starving and would have ate cardboard. Waitress comped them nachos after i tracked her down.   Won't be back", 
    "review_date": "2014-10-25"
  }, 
  "WKqrzV1NFKoGKebSWNKROA": {
    "user_rating": 5.0, 
    "user_location": "Melbourne, FL", 
    "user_name": "Lauren C.", 
    "review_text": "This was my first time at score and it was low key starting out but it was around 8pm on a Friday but people still kept coming and watched the rest of the basketball game. The main event here though is the Beer Olympics. It's located in another part of the bar but everyone is having a ball. There also is billiards and big screen TV's. I hear they play the big games every weekend. Def a good place to come meet nice people and come out with friends for a casual but fun night out near all the strip clubs on Broadway! Stephanie served us tonight and she is great! Come see her! I will recommend this place and come back with a bigger group,  they have the place.  Last thing!  They have a good play list!", 
    "review_date": "2014-12-12"
  }, 
  "lkE-wjhDh7FQ2f8Dmo2f0g": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Puya R.", 
    "review_text": "Loved my experience here! The drinks were great, and great atmosphere. The bartenders were awesome! Especially Kenitha, who was full of energy and entertained my friend and I the whole night. Shows that management truly knows how to train their employees, to provide the best customer service in the Bay Area! Definitely going back.", 
    "review_date": "2014-03-12"
  }
}