{
  "7KnLMwVAi1DMrqHaod9jmg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allen T.", 
    "review_text": "Hanging out at Sweetie's is like hanging out at  your friend's living room. It's nothing fancy, but it's very comfy.  I live just around the corner for Sweetie's and it's always comfy and mellow. Great place for a beer or three.", 
    "review_date": "2014-07-25"
  }, 
  "QbEZ_zeRGtGY4OZpexw4wg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Isaac A.", 
    "review_text": "Good divey place with friendly bar staff and patrons.  Cool art on the walls, and a very interesting poem and picture in the women's restroom :)", 
    "review_date": "2014-04-28"
  }, 
  "2obAyPuH-G3Dn3EUdQnQlA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dean E.", 
    "review_text": "quaint bar in the middle of a residential area. you may miss it if you're not looking for it. good beer selection. decent food. local neighborhood hang-out. good place to go if you're looking to chill in north beach without the crowd. and the pool table was free the last time i was there...", 
    "review_date": "2005-04-14"
  }, 
  "A9RKvWz-as6hzSKS_xwVrw": {
    "user_rating": 4.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Anh V.", 
    "review_text": "i was armed with massively low expectations about this place...  but i was pleasantly surprised over the course of the evening. don't get me wrong it's still a neighborhood dive bar.  but the quirky customers, friendly bartender and free pool table charmed me.  one regular fed me abalone that he caught that day prepared as a ceviche as well as fried.  he treated me like i was one of the gang.  when one commented \"whoa, that is one big phone you got there.\"  i replied, \"well, that's because i'm compensating.\"  he burst out laughing.   just like that i was part of the crew.  so come on down and have a drink with us and maybe you can taste vinny's catch of the day.", 
    "review_date": "2008-05-24"
  }, 
  "a3sSPkmxve_lB2G7ph233A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin Q.", 
    "review_text": "If Amy B isn't the reason that you go to Sweeties, it should be. Not only is she a sweetie, Amy also makes a killer (for me that mean's tasty AND spicy) bloody mary. Let's just say that it would go great with prime rib. Yum!  They have an art gallery in the back. The pool is free. They have pizza... sometimes. They have these great roasted cashews. Did I mention that Amy B bartends at this bar? The location isn't obvious so a lot of people that live nearby don't even know about it. This also keeps the rowdy crowdy out. Parking can be tricky... well, only if suck at finding parking in SF. Fortunately, I don't suck at finding parking in the city.", 
    "review_date": "2009-01-05"
  }, 
  "UszTrHi-o5TENb6nD1Bzug": {
    "user_rating": 5.0, 
    "user_location": "Anchorage, AK", 
    "user_name": "Katherine C.", 
    "review_text": "A+ for this local spot. The crowd is mostly regulars, the drinks are cheap, the pool is free and the bartenders are all friendly and personable. Yet somehow it is rarely crowded. Try one of George's excellent bloody marys or just stop in for some happy hour pints and throw a few dollars in their jukebox. You won't regret it.", 
    "review_date": "2006-09-26"
  }, 
  "NN5jldDW0Puf8E3ZZjKqsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "megan w.", 
    "review_text": "The only North Beach bar to be in.", 
    "review_date": "2005-09-09"
  }, 
  "vVpl4zjimGC0z46mAiIYgQ": {
    "user_rating": 1.0, 
    "user_location": "Benicia, CA", 
    "user_name": "Michael A.", 
    "review_text": "Locals Only :(  Stumbled across this hole in the wall after deciding Cafe Prague was too noisy. It strives to be an ordinary British type of pub with no food and a very limited selection of draft beers. Crowded (not hard to do as it's so small) and it was good they only had one TV, with sound down; brassy (do they think that's how Brits are?) \"barmaid\" but not at all welcoming to outsiders. And just to reinforce that point, not long after we'd tipped $2 for two beers (since the barman said he was going off duty, which he didn't for an hour!) our change (another $2) was scooped up by the same barman! Won't be going back or recommending it to MeetUp", 
    "review_date": "2012-05-12"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "Local joint. Free pool. Jukebox has good rock n roll.  And Dylan's Blood On The Tracks. I know they have odd hours and they close early, but it's nearby and is another place that friends call me to meet them at. Tourists may not find it too easily, but whatever. It's a 'down to earth' bar.", 
    "review_date": "2009-07-27"
  }, 
  "vrV9pxKrhH8vDo9lgbcysQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurene R.", 
    "review_text": "Not a friendly staff and no desire to go back. We had an awful experience at this bar.", 
    "review_date": "2012-12-06"
  }, 
  "Yj1a3IApDb8hhl_5TSmUdg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "R. G.", 
    "review_text": "So sad that Sweeties, my favorite neighborhood bar is so far away from my neighborhood.  What's wrong with this picture?", 
    "review_date": "2012-02-12"
  }, 
  "kitAOxUSgFGhR3JLPrDCvg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lester L.", 
    "review_text": "This is such a dive/neighborhood bar...  They have a pool table and serve pizza. It's great to munch off after a few drinks.   I like sitting in the front with the big cushy chairs when they have the windows open. It's nice during the summer especially after a hard day's work! Too bad Guinness isn't apart of their Happy Hour specials...", 
    "review_date": "2008-05-26"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "One of the more unique bars in North Beach. The drinks are typical (several decent drafts, Lagunitas, anchor etc), but the food here is surprisingly great. We ordered 4 pizzas and the shepard's pie. The pizzas are small and crispy with a sprinkling of requested toppings, the perfect bar food. The shepard's pie was my first ever and it was a lot better than my preconceived notions of the typical shepard's pie. They also have one pool table and happened to have some live acoustic music played by one of the regulars (who was another surprise). After he finished it was back to the calming jazz and assorted old-time music...", 
    "review_date": "2006-10-23"
  }, 
  "3hlHjFbKHSgz5scvczBpEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valeria K.", 
    "review_text": "Super cute and adorable, and they serve pizza too!", 
    "review_date": "2009-07-24"
  }, 
  "ZPzM9F8cNRccvuGiEaXmwg": {
    "user_rating": 5.0, 
    "user_location": "Lisle, IL", 
    "user_name": "Anna M.", 
    "review_text": "The best Margaritas I have ever had, with fresh lemons!!!!! Seriously delicious. Went there with my sis in law, we were in town for my sisters graduation and since she lives 2 steps from this place we decided to go have a drink. I think we were served by the lady that owns the place, she makes awesome margaritas. We are not locals and were treated fine, this is just a small cute little bar. It was nice out and we sat outside and enjoyed our drinks. Will come back here in the future for sure.", 
    "review_date": "2013-02-11"
  }, 
  "dpdM0CIUKSq7YL1f9YjZnw": {
    "user_rating": 4.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Lindsey W.", 
    "review_text": "Great spot!  It's a nice local place to grab a couple of beers.  The drinks are cheap, the patrons are mostly local and very friendly!  This place does \"soft close\" at 10:30 on the weeknights to be respectful of their residential neighbors.  If you're in the bar they'll let you stay til 11.  Nice place, I'd go back for sure!", 
    "review_date": "2011-01-14"
  }, 
  "002slNgnEtAvsNYFLw7rGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony L.", 
    "review_text": "It's pretty clear that if you're a drunk woo-girl from the east bay you aren't welcome here. Which is why I give it 5 stars.", 
    "review_date": "2011-08-11"
  }, 
  "hFJgRL0m1i1XFXVu7YxGTw": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Jeremy T.", 
    "review_text": "This might just be the best dive bar in the city.  How did I get so lucky for this bar to be one block from my hotel?  I came here on my second night in town and ordered a long island and a margarita since other yelpers said they were good.  Bill came to $15.  Both were delicious and strong.  They have free pool and several areas to sit.  Dark interior with red walls and furniture.  Lighting is great in this place.  Wish they had a place like this back home!", 
    "review_date": "2013-11-20"
  }, 
  "XsmCflJwEbBKShKXNCaiwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Parminder Nayyar C.", 
    "review_text": "Went here for an office happy hour - drinks were nice. Only thing missing was an option for bar finger foods", 
    "review_date": "2013-09-21"
  }, 
  "yVeTbJoOCyIPm0gb_sYQ0Q": {
    "user_rating": 4.0, 
    "user_location": "O‘ahu, HI", 
    "user_name": "Nicole M.", 
    "review_text": "A true dive. I luvs it!   Great bartenders, a pool table and pizza! yay!!   Want to avoid popped collars and loud, drunk Marina girls - pop by Sweeties and revel in the chill vibe.", 
    "review_date": "2008-07-21"
  }, 
  "G6XcL9wmLQ0jT1m-Vc4CPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren S.", 
    "review_text": "This is a fun little dive.  They have a great juke box, a pool table and really really nice bartenders.  It was freezing in there the night I was in, though, so I subracted a star for lack of coziness, which is crucial to your bar camping experience.", 
    "review_date": "2007-03-30"
  }, 
  "oMXq9zZqL8GKbWd3BKjrag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zachary L.", 
    "review_text": "Best gimlet I've ever had. And this is one of the few places in North Beach that's full of real people.", 
    "review_date": "2012-01-26"
  }, 
  "3xsmXxDysn5yqflq3AzWKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim N.", 
    "review_text": "We don't live in the North Beach, but we still felt like neighbors when we visited Sweeties on Valentine's Day 2009.  My fiancee and I dropped by after dinner for a couple cocktails and immediately loved the place.  The space has a dark, cozy sort of feeling, with dim lighting and walls/ceilings accented with exposed wood and brick.  The bartender was super nice, taking the time for some friendly banter with each of the parties at the bar.  I enjoyed a couple of Jack and Cokes; the cocktails were very reasonably priced and quite generous as well.   Definitely a great place for a relaxed date.  We will definitely visit the next time we're in the North Beach area.", 
    "review_date": "2009-02-28"
  }, 
  "AWnyRyhCx8upY8uJ5IH_DA": {
    "user_rating": 3.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Andrew J.", 
    "review_text": "Walked in at a great time apparently. Happy hour $3 draft and wells. FREE pool which is awesome. Super cool red sunroom type deal that's got real cool funk", 
    "review_date": "2014-03-05"
  }, 
  "24yhVSA9aZ8vgEzIE_dDOw": {
    "user_rating": 4.0, 
    "user_location": "American Canyon, CA", 
    "user_name": "Eric M.", 
    "review_text": "Nice meeting place. Biker friendly. Barkeep very friendly comfortable place.", 
    "review_date": "2009-10-14"
  }, 
  "HDfsCoEA5GMR8VCwR3gEZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff G.", 
    "review_text": "This is an awesome little bar in north beach.  It's a good place to come after our volleyball games for a guiness or so.  They also bake their own pizzas to order right in front of you.  A little overpriced, but it's a very small and chill bar, perfect for a low key type night.  Service is always good, plus their location is pretty great.", 
    "review_date": "2008-09-11"
  }, 
  "SSmuQ1rJEnc2sB9tPdC_9A": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Dan S.", 
    "review_text": "*great dive bar, pool tables, a little 'tude and great graffiti on the bathroom walls *stiff drinks and lots of tats", 
    "review_date": "2012-11-19"
  }, 
  "tZdjS05E7a9zIhWYoHut9g": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Bonita L.", 
    "review_text": "I came with a group of 8 people or so. Clearly we weren't welcome although we were willing to buy rounds of drinks. We weren't even being belligerent, just being a happy lively bunch. We were asked to keep it down. Please, is this a library or a bar? Being the respectful people we are, we obliged. We probably should have just moved on to another bar then, but we decided to stay a bit longer.  It was my friend's birthday, and she understandably had a few more drinks than everyone else in our party. She was just sitting down and resting her eyes at one of the tables (this is not the same as her being asleep with her head on the table or anything). The bartender said that wasn't acceptable, so we just up and left. I'm not sure how she even saw my friend as the table was in the corner. I guess we bothered her enough for her to pay extra attention to us. I really just found her requests/statements to be rude and unwarranted. Our bad I guess, won't be coming back to bother the bartender and the establishment again.", 
    "review_date": "2011-03-27"
  }, 
  "KnUIlAcXRvbpNh4-yNVqUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael G.", 
    "review_text": "There's something both disturbing and redeeming about watching a sixty year old guy  with a long white beard (in shorts) spinning and scratching on a turntable - but this is Sweetie's, the current incarnation of North Beach art bar-ness.  Happy hour is good, always a healthy mix of different kinds of people. Also good before (or after) a grueling Trader Joe's experience.  The painting of the naked guy in the women's room is a little freaky but they have a great pool table so everything kinda balances out.  Tip: don't piss off the bartender, she doesn't take kindly to shenanigans.  Just find a spot with a friend (or a book) and let it wash over you - this is what being a grown up is all about.", 
    "review_date": "2006-08-01"
  }, 
  "s-dAA4BZp0RQ6jYDtBatvQ": {
    "user_rating": 4.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Jen C.", 
    "review_text": "I was very impressed by this \"sweet\" little bar!  A unique sense of style, great drinks, and friendly atmosphere!  Amy was working with us when we arrived.. we went for a birthday party and she was very accomodating.. let us store our food there, put up some decorations, totally hooked us up with bday shots.. Amy rocks the bar, amazing service!!   I would say this is a great place for a small or large group of people looking for a way cool, laid back atmosphere!!", 
    "review_date": "2009-05-12"
  }, 
  "MurRkRS5aYaa1IfaRY20_Q": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Denis S.", 
    "review_text": "Sweeties is the very definition of a local bar.  Far enough away from the boardwalk that tourists will never accidentally wander in.  Strange enough name and outside facade that no one will actually suspect it's a dive bar.  Bartenders whoa re used to having things done their way and don't put on fake smiles or fake pretenses just to please the customer.  Simple drinks meant to be poured with a heavy hand.  And, for some reason, dogs that are running around all over the place.  Whose dogs are they?  No one seems to own them, yet everyone is petting them.   If I lived nearby, this would be my neighborhood bar.  The place where I would go whenever I wanted a drink or a quick game of pool.  But if it's not your local neighborhood bar, everyone knows it and you definitely feel like an outsider.", 
    "review_date": "2013-01-14"
  }, 
  "tMym5FBTh76TzlQCsY6VWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "wendella a.", 
    "review_text": "Sweeties is special. Tucked away and hard to find, stumbling upon it for the first time is a bit like Alice falling down the rabbit hole. It is a day bar - opening and closing early - known for its prolonged happy hour, free pool table, interesting art work and eclectic, chill atmosphere. You can get some snacky food there if you like, mingle with other wonderland characters and sip your libation in a plush oversized chair while you play chess or checkers with the Queen of Hearts.", 
    "review_date": "2007-08-13"
  }, 
  "dkkMQorZE0EF-F5wOiqA7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle V.", 
    "review_text": "I had no idea this place existed until I asked a friend if we could meet for HH. Since we had been some fancy dining recently I wanted to go to a more casual place. I can honestly say I was thinking somewhere in the FiDi, Daves, House of Shields... but when this place was suggested I was on board for a new place. (I love people who show me new places)  It was so low key, everyone was nice, and we got the two comfiest chairs in the house. I would go back in a second, and next time, I am def. signing up for pool.  (I was told on this date, that you know somewhere is a real dive bar if the pool is free.... go there and find out!!)", 
    "review_date": "2007-07-15"
  }, 
  "XHuNSjrPA3Vyi7n4iVhZaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maria D.", 
    "review_text": "A great place to drink in North Beach without all those annoying 'woo' people.", 
    "review_date": "2005-06-18"
  }, 
  "0vBXZOENIUZCVpMpnRfbFw": {
    "user_rating": 4.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Joe P.", 
    "review_text": "Funky little neighborhood dive, nice happy hour specials, free pool table, some streetside tables, flamenco music on the evening we went there.  Nice spot, we will be back.", 
    "review_date": "2014-06-13"
  }, 
  "goZ-kSTFH5Ujpf54GwbaRw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kris O.", 
    "review_text": "This is the spot after my volleyball games. There's a cute little (ok big) Buddha man standing in the middle of the bar, random artifacts dangling from the ceiling, clocks, thingamajigs, but my favorite thing is the trivial pursuit set hidden under the table counter at the bar...  Oh ya, and they have pizza.", 
    "review_date": "2008-01-30"
  }, 
  "ugk0g6vyv2XavpoTaJSy6A": {
    "user_rating": 1.0, 
    "user_location": "Melbourne, Australia", 
    "user_name": "Lydia W.", 
    "review_text": "The one star is to be able to review this place.  I always thought businesses existed to, well, do business. Since when is the customer ever wrong? Since when is fun not allowed to be had? Especially at a bar?  I left this place highly disgusted by the treatment that we received by the one bartender on shift. Maybe she is the owner, manager, I don't know. Regardless, I have never felt so wrongly mistreated by an establishment and I am embarrassed for Sweetie's for incurring our wrath.  It was a Saturday night and there were a handful of patrons scattered around the front. We strolled to the back to wait for the rest of our party to join us, as they were looking for parking. While we were waiting, the bartender asked one of our party if we were going to order drinks or just hang around and take pictures. She guilted him into ordering a beer. It's not like we are all going to meet at a bar and not drink. I'm sorry if you are feeling impatient, but I don't see a line outside the door waiting to be served. We were planning on staying here for several hours before heading to our next venue, so clearly buying drinks was on our agenda. Is it a crime to want to wait for our friends to share the fun?  Once the rest of our party arrived, we ordered a round of drinks. During this time, the bartender insulted one of my friends by accusing her of being different than the rest of the group. Maybe she was joking, maybe she was trying to banter, but it was rude and not appreciated.   When our drinks came, we were bluntly told the price. So before we could even drink, we all had to scramble to find our cash and pay. Way to kill the vibe. Maybe she thought we were going to drink and dash, because our joyous laughter makes us seem like criminals.   As we were celebrating a birthday, there was a lot of happiness and laughter. The bartender came over and asked us to tone it down. At this point I became quite irate. We are not in school, you are not our teacher, other guests did not come to complain to us. We are trying to enjoy ourselves on a Saturday night and we get shushed. I'm sorry, is this a no-fun zone? If so you should really put a sign in the front that says \"NO FUN ALLOWED. NO LAUGHING ALLOWED.\"  The birthday girl had had a bit to drink and was feeling a bit soporific. She was resting her head against the wall for a few minutes to let her buzz subside. She was in a completely innocuous position and was simply taking a breather. The bartender noticed this after several minutes and came over and lectured us that our friend \"did not look okay\" and that we \"should probably escort her out\". I don't know how serious she was being. Maybe our fun was just too much to handle. Maybe she just wanted to roll her pizza dough in silence. Maybe she was mad that we didn't order one of the precious pizzas. Regardless, we basically got kicked out on the accusation that our friend was going to pass out in a bar. Is this a club? Are we in Vegas? Are you a bouncer?  Not that Sweeties would want us to come back, but we will never come back. We will never recommend this place to anybody and I suggest you, dear reader, to take heed and avoid Sweeties at all costs. Unless you like to drink in silence on a Saturday night and be scolded by the bartender. Oh what fun!   I am appalled that such an institution exists and has such high ratings on Yelp.", 
    "review_date": "2011-03-31"
  }, 
  "RjmUmuup0T-fr655U-bNsA": {
    "user_rating": 4.0, 
    "user_location": "Chico, CA", 
    "user_name": "Brooke S.", 
    "review_text": "We stayed just around the corner in the awesome San Remo hotel, so we had plenty of cash to spend on drinks  :)   We absolutely loved the girl that worked Tuesdays, she was sweet, friendly, talkative, and introduced us to the locals.  We love the vibe in this place!  We met some pretty great people.  Free pool was awesome.. big cushy chairs in the corner were great for the next night when there was a different bartender who was like nails on a chalkboard.  Loud, crass, rude, self-absorbed.  She eventually made an effort to ask for our drink order, and somehow managed to not once look us in the eye.   We would have LOVED if Sweeties stayed open later!  They close so early.  We wanted a night-cap here a couple of nights after eating in other districts. But overall, this was totally the kind of place we love, the back-alley, half-empty, friendly,  local \"dive\".  We'll definitely be back!", 
    "review_date": "2012-07-09"
  }, 
  "0vPlkWMHZY4waOw97Hci_A": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Declan M.", 
    "review_text": "This place rocks. It's got the feel of a boutique wine bar without being a boutique wine bar. It's a very hard to categorize place.  In town visiting and I was hanging out at a really cool neighborhood bar called The International (or something like that) after a few beers and some good conversation with some folks I asked the bartender Sonya what was her 'local' place and she told me Sweeties right down the road.   Literally 2 blocks away I walk in and there is a pool table on the left playing for free, a tiny little bar, a small jukebox on the wall which was packed with great mix of blues, soul, and rock. A  back private area and funky art (apparently all local) on the walls.        The bartender, Amy, was one of the best i had encountered anywhere and the kicker is she also makes these AMAZING individual pizza's. At first glance you think the food is incidental so you could avoid hazards with neighborhood and the ABC but no the pizza is off the chart. Right there she hand rolls out a thin crust, homemade pizza sauce and chops the fresh toppings aka mushrooms etc. In it goes 10 minutes later delicious. I was blown away with the concept.  This would be a local of mine if i lived in North Beach. The crowd was also local and eclectic. This is a NEIGHBORHOOD bar with a focus on just enjoying yourself and not being part of any particular scene.", 
    "review_date": "2007-05-22"
  }, 
  "byUZpVzun-vVMMCFMXvdXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriel R.", 
    "review_text": "A great neighborhood bar with some of the nicest bartenders around. It has a great neighborhood feel and a free pool table! I sometimes wish there was a bit of a bigger crowd but it may just ruin the vibe that makes this place so cool.", 
    "review_date": "2013-06-15"
  }, 
  "lBaoq2G8xXrSX_esMQXM-A": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Dianne M.", 
    "review_text": "Although we only stopped in for one during our Sunday bar crawl Sweeties is a definate return spot for us.  It is a couple of streets back from the water yet a world away from all those tourists and for us walking distance from North Beach.  I like a local pub not a tourist attraction and this spot is perfect.  Red walls, gold mirror, gold chandeliers, a clean bathroom (which is always important), a friendly bartender which suggested our next stop for food, red stools and a red armchair in the corner by the pool table.  Eclectic decor but not a fancy joint, just a great local hangout.", 
    "review_date": "2013-03-27"
  }, 
  "BYdyiyKK-qnvq5jImxYXmA": {
    "user_rating": 4.0, 
    "user_location": "Gilroy, CA", 
    "user_name": "Vanessa X.", 
    "review_text": "I love Sweeties...and after reading a few reviews I know why now. It's not your typical run of the mill 'loud &amp; roud' kind of places. It's also not meant to be like a library either.   This place is super chill &amp; laid back &amp; def for those who want to relax &amp; talk amongst themselves and the regulars. The vibe here is calm &amp; low key..on the darker side in terms of lighting, beautiful artwork &amp; decor. The ladies restroom has a vanity with a chair, much to my surprise and liking. There is a large Buddha statue as you walk in &amp; that's the kind of ambiance that this place emits.   If you want to be loud, overly drunk &amp; annoying..perhaps a bar on the wharf would serve you best.   With that, in this bars it's: WHEN IN ROME.", 
    "review_date": "2011-09-06"
  }, 
  "OQImub6evGiBTwpQmoVUjA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jess S.", 
    "review_text": "Fun funky spot to hang out, meet up with friends before going out, or chill for however long you need to.  If you time it right, you can check out the art gallery in the back, which sometimes had good and sometimes has disturbing selections.  Bonus point for getting Magner's in stock after only three polite reminders that Wyder's Pear tastes like ass.", 
    "review_date": "2006-09-12"
  }, 
  "0rdtzeopvGVsWvRZaTXiNg": {
    "user_rating": 1.0, 
    "user_location": "Brentwood, CA", 
    "user_name": "Rick J.", 
    "review_text": "Blah.  got there at 9:30, was about 15 people there. But....they closed at 10 pm on a Saturday night. ????  Rude bartender to top it off. Maybe she was tired and wanted to go home but she was not pleasant.   wont go back, too many other choices in the city", 
    "review_date": "2009-06-12"
  }, 
  "3gxZfCVPp7HNMutb-eLchQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen B.", 
    "review_text": "By far the best hole in the wall I have found yet! Yelp treated me well, as usual, by providing me the information to this little treasure. A watering hole where the locals come and welcome new locals to their hidden scene. We talked running races, good spots to eat in North Beach and even exchanged the communal, MEN and they replied WOMEN, when briefly discussing the bartenders current crush. Awesome. Happy hour on a Sat? Yes. $3 cocktails? Yes. $3 stiff cocktails? Yes. And of course a friendly bartender! Splurging for the $3 roasted cashews is the way to go.", 
    "review_date": "2009-04-21"
  }, 
  "Z6afV30P3i5FBq7u0GNNNw": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Cris M.", 
    "review_text": "I totally love this place :) It's a cozy little spot and, if you've been there once or a hundred times, the bartenders definitely remember you or know your name. I know I feel VIP there and I can always catch my favorite sports games whenever I go.   I absolutely love bartender Amy. She's a complete gem and makes the best Bloody Marys with her special ingredient. They definitely pour generously and it's so easy to generously tip back 'cause they're so awesome! Try their fresh made mouth watering pizza too, if you're in the mood for something to cushion the booze. Cheers!", 
    "review_date": "2008-10-10"
  }, 
  "XdIRXocPo92O_CqxjSeKBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark J.", 
    "review_text": "Good local bar with friendly staff, good selection of beers and generally fun vibe.  Not really a \"type\" bar (i.e. sports bar, vodka lounge, etc....) but works for the crowd that comes.  Nice place to down a few.", 
    "review_date": "2009-12-19"
  }, 
  "vJU7VP831iKtwdwdD49MWw": {
    "user_rating": 5.0, 
    "user_location": "Aurora, CO", 
    "user_name": "Jason J.", 
    "review_text": "We were in San Francisco on Saturday and desperate to escape the insanity of Pier 39. Too late for lunch and too early for dinner, yet definitely the perfect time for a drink. Thank you, yelp, for coming to my rescue.  Standing on a random corner without knowing what was around us we pulled up the app on the iphone and looked for the closest bar. Sweeties popped up with enough stars and was only a block up so we decided to give it a shot.  It literally was a hole in the wall. I doubt we would have stopped in if not for yelp, but I'm glad we did. The service was excellent and the booze was cheap, and we left an hour or so lo later only a little bit lighter in the wallet.  I'd definitely recommend!", 
    "review_date": "2010-07-26"
  }, 
  "EQ-fPVMNGhwZOdB8PJ25ug": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bobby B.", 
    "review_text": "not a cool little hole in the wall.. wouldnt go back.   do u hate when u walk into a bar and everyone stares at you in an unwanted way? that's sweeties. and the reviews were seemingly so good.   and btw who saves seats at the bar when there is no one even there? hmmm?", 
    "review_date": "2010-03-07"
  }, 
  "PgrCdD3iPgYzXxO8QsMnew": {
    "user_rating": 5.0, 
    "user_location": "Aurora, CO", 
    "user_name": "Jessica J.", 
    "review_text": "So after a day of being a tourist and wandering the streets of San Francisco, I turned to the hubby and said, lets get a drink! And after a quick Yelp! search via our iPhone apps it came up with Sweeties - which happened to be 2 blocks away. Perfect!   Friendly bartender, lots of ladies chatting at the bar and a couple with the baby in the corner - basically a nice neighborhood joint. Kinda dark, kinda small, but drinks were cheap ($16 bucks+ tip got us 2 Guinnesses and a couple vodka tonics) and the atmosphere was laid back.   It short it worked perfectly for our needs! Yelp to the rescue :)", 
    "review_date": "2010-07-26"
  }, 
  "kXdq_tyzV1RbgsjRLyy_yA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kaity J.", 
    "review_text": "2012 Drunkcathlon: San Fran Edition. Review #4  Drink requirement: Order 2 margaritas on the rocks  If someone were to ask me where to find a bar full of men in San Francisco, they might be surprised to find out that my answer is: at this place called Sweeties. And I'm dead serious.  Good bar tender who was super friendly. Yummy margaritas. Off the beaten path, so not really crowded at all.   Solid, Sweeties. Solid.", 
    "review_date": "2012-05-23"
  }, 
  "5j0QmE-ktdY2wfEYX2YStA": {
    "user_rating": 4.0, 
    "user_location": "Otford, United Kingdom", 
    "user_name": "Amy W.", 
    "review_text": "free pool , chilled atmosphere .. if you get to see the studio above the pool table you are in for a treat - its awesome! I love this bar. It doesnt get the visits from the tourists, its just friendly , chirpy locals enjoying a beer ... and the guiness is yummy!", 
    "review_date": "2006-09-05"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "I went back to Sweeties this past Monday night and definitely thought it was better the second time around... The bartender was the same (not overly-friendly male) but we did not try to order pizza this time around. Instead, we asked for bar cashews which were spicy, delicious, and free! We were with a group post-volleyball. We were able to stake out the whole back area of the bar and sit up on the high stools to chat and hang out.  The best part again was definitely my full water glasses of wine! For $5 (pinot grigio) or $5.50 (sauvingon blanc), I think I was served about 1/2 a bottle of wine in a water glass. Sure, the glass is not that classy but that is a VERY generous pour! :) This is a fun, very chill bar...   P.S. I think the music comes from the bartenders ipod... interesting...", 
    "review_date": "2008-09-18"
  }, 
  "mcZMD9N1MSUqPh2emfROKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason G.", 
    "review_text": "Excellent, hidden neighborhood bar. Staff is friendly. Pool is free. Prices decent. Love the decor, the space and the creative feel of the place. Rub the buddha for luck! Wish I lived closer. Used to come here almost every Sunday. The local crowd is great and it's generally gudger-free, unless some gym-going marina-type wanders in on accident.", 
    "review_date": "2010-09-01"
  }, 
  "D6-3R3TgJ5HJDln5CMeL2w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fay S.", 
    "review_text": "loved it.  definitely going back. my bf &amp; i are weird randoms and we enjoy the company of other randoms :) great place. small. closes early.", 
    "review_date": "2012-10-02"
  }, 
  "nVK5ZZ9IDjUX1WFJzzbYKg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan P.", 
    "review_text": "The intrigue and whimsy of this great town can get lost after living here as long as I have-- 15 years now.  So my jaw nearly hit the pavement when I found Sweeties hiding in plain sight just a block away from my friendly neighborhood Trader Joe's.    Sweeties has everything a good dive bar should have.  Salty bartenders.  Cheap drinks.  Blue collar clientele.  Full sized pool table.  Eclectic music mix.   Cheap pizzas available right out of the oven after 5pm.  Super high quotient of \"why haven't I been here before.\"  As a total bonus, the owner really has a keen eye for visual art.  The period paintings and tchokes evoke Old San Francisco in a way that Specs does not.  We've got to do what we can to keep places like this of the endangered species list .", 
    "review_date": "2012-08-22"
  }, 
  "x1Ac25DmXXrQHOyNuspLiA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael H.", 
    "review_text": "It was the unique awning of Sweeties that first caught my eye. I love vintage awning, and it's hard to find ones in the SF that are still in good shape. So after passing by this spot for over a month, on my way to Bay Street 24-fitness, I finally decided to stop in with a friend about two weeks ago. I stopped by this bar on a Tuesday night, with a friend (girl), who had just gotten off of work. I usually restrain from from going out on a school night, but earlier that day I had received an offer letter from a company I had been interviewing with, so I wanted to celebrate. Before we could find a place to sit, the bartender yelled at us from across the room, \"Just so you know, we aren't staying open all night.\" The bartender said this in a rude tone and I was immediately turned off. I have worked in the service industry for over ten years and I would never pull a move like this. If I had wanted to be insulted by a bartender, I would have gone to Zeitgeist and tried to order a mojito! I told my friend, let's leave now, but she insisted that we stay because she knew I had been looking forward to going there for awhile. The bar had 12 people inside, and everyone had drinks, yet it took almost ten minutes for the bartender to pour us two beers.  Apparently it was more important to cater to the crusty regulars before tending to new patrons.   The spot is deceptive, in that based on the outside appearance, you're given the impression that there is a swanky lounge inside, like the Razz Room, or the Red Room (R.I.P.). Instead, you find a sub-par dive bar, with a peeling paint, a dilapidated pool table, and a bathroom straight out of Trainspotting.   Despite my protests, we stayed for a second round of beers, and left after being there for 30 minutes. In that time, non of the other patrons made a move for the door, so I still don't understand why we needed to be \"warned\" of the closing time prior to ordering drinks. As we left, I asked my friend, \"did we look like we were going to cause trouble?\" Granted, we were both dressed pretty nice (me - slacks &amp; buttoned down shirt; her -sundress) for a dive bar, but that shouldn't warrant poor service. My guess is that the bitter bartender (who was sports jeans and a hoodie...with the hoodie on the entire time, like Eminem from 8 mile) was mad that she was given the wack Tuesday night shift. My advice to is you, is try being a little more friendly and maybe Tuesday nights wont be so wack!", 
    "review_date": "2010-04-26"
  }, 
  "TNo1aPj4p9mXkHBR0uHfEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nilu r.", 
    "review_text": "I have only been there once and loved the fact that my dog Emily was welcome inside and everyone was nice.", 
    "review_date": "2007-04-27"
  }, 
  "aJbXWA8OuA4mx0B67dXwNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna b.", 
    "review_text": "Fun pool, funky decor, and on a residential block which makes it kind o f dive-bar-esque. I know for a fact my neighbors go here, and that makes me go here too. Problem? It was a break-up bar. Twice over. And before that, it was a date-stand-up bar. Yes, I was stood up and broken up with twice here. Why? Besides my personality flaws, I'll say it's something odd with this location and/or ambiance. My neighbors didn't break up with each other there, so maybe it's just me. It's like a renovated warehouse/storage shed, with an aamzing pool table, good beer on tap, and friendly folk.", 
    "review_date": "2006-06-08"
  }, 
  "_8RdsTenycwauWFXIxpEaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica B.", 
    "review_text": "A true neighborhood bar!  The bartenders here are always super nice and the drinks are solid.  It's usually pretty quiet, so it's a great place to have a conversation without screaming.    I just wish it was open later, but I understand since it's on a quiet neighborhood street (relatively - it is North Beach after all).", 
    "review_date": "2008-05-19"
  }, 
  "3ewd5qDxkRViM-2-mhUvIw": {
    "user_rating": 3.0, 
    "user_location": "Livermore, CA", 
    "user_name": "LibraToro T.", 
    "review_text": "This was a great little spot, nice interior very original stuff to look at everywhere in there. It was a good little escape for us when we went to the city. Tucked in and out of the very busy wharf area. They had a few good beers on tap with cool 'happy hour', hours. Everyone knew everyone pretty much. Nice people who worked there as well. I actually went to the city to escape the heat last year and stumbled on to this place, It was cool and Ill be back. Yes, its pretty much a little dive of a place, but its unique in its own way.", 
    "review_date": "2008-05-15"
  }, 
  "Vnja4xoPVQ7BLXIsVy_cFw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy J.", 
    "review_text": "Perfect place for a get together if you need a back room to yourselves. Pizza was delish. I'm glad we went. Cozy and charming and edgy all at the same time.", 
    "review_date": "2009-03-15"
  }, 
  "lFyLouIqT1QBrhZXnsCkOQ": {
    "user_rating": 4.0, 
    "user_location": "Yardley, PA", 
    "user_name": "Michael L.", 
    "review_text": "Great spot for after work. Pool table. Cheerful atmosphere. I loves me some Sweeties.", 
    "review_date": "2006-12-06"
  }, 
  "Afo2N4GUlYsmYM9KcbW7IQ": {
    "user_rating": 3.0, 
    "user_location": "Del Mar, CA", 
    "user_name": "Marc P.", 
    "review_text": "4 Stars to Hang out in a cool / unique neighborhood dive bar  2 Stars because the pool table which used to be free is now $20 per hour ....... that seems a bit pricey for a neighborhood bar.  I'll average it out to 3 stars.", 
    "review_date": "2007-06-29"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "$2.50 pints and big cooshy chairs by the window, where two may trade obscurities like intellectuals.   This must be the feeling of kingly lords. Kingly lords with Anchor Steam.", 
    "review_date": "2006-09-17"
  }, 
  "i1IUqcMBd9DyEgkRoySCkQ": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Michael H.", 
    "review_text": "Erin works there.  Five stars for Erin.", 
    "review_date": "2007-11-18"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "You would probably NEVER know there was a bar here, unless you were in the neighborhood all the time.  I thought I knew where almost every bar was in North Beach, but this one is kind of hidden and off the beaten path, so I was scratching my head in confusion when I received notice that our half-marathon training team would be having our team bar night here.  GREAT bar.  It's small, and can feel a bit stuffy if they've cranked the heat too high, but they have a decent sized bar, plenty of places to sit, a pool table, and a couple of outdoor tables.  The bartenders are super awesome and friendly.  The only drawback is that is closes early.  Which means, this is where you START your North Beach bar crawl or party evening.  Woohoo!", 
    "review_date": "2009-03-01"
  }, 
  "ZtmeHAQyNFku338dJMIfTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "Why am I not a regular here?  It's like 3 blocks from my apartment!    This place has all the ingredients to make a delicious dive: random red color scheme, white Christmas lights draped over a doorway, weird art, personal pizzas, a jukebox and a pool table. What more could you ask for?  Happy hour specials are good and you can't help but feel comfortable in this place.  If you find yourself in this neck of North Beach, stop by.  They're not open exceptionally late but it's a great place to chill.", 
    "review_date": "2007-04-09"
  }, 
  "17dx_x9W_7QBT-3oiQQEQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabrielle J.", 
    "review_text": "Officially. My favorite bar.  Chill vibe, great local crowd, no scene here.  Good pours, quality *free*  pool table..  Come here on a rainy afternoon to shoot pool, chat up some serious locals (like the kind who are FROM SF, not the kind who happen to live next door), I have had some CRAAZAY convos here:)", 
    "review_date": "2009-12-21"
  }, 
  "w3mE7sc3Vu8QoSVwNjtGeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robyn H.", 
    "review_text": "I must confess that the old man works here, so I may be a bit biased.  This is one of the best bars in the city, certainly the best bar between North Beach and the Wharf.  Free pool.  Great happy hour deals.  Delicious pizzas.  Fantastic jukebox.  Fun regulars.  It's the real deal.", 
    "review_date": "2006-12-18"
  }, 
  "VeuwCtfmB4VyXWuUYbZp8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mabelle A.", 
    "review_text": "shhhhh, stop telling people this is a great bar - we don't want everyone hanging out here.  j/k  it's a great place for pre and post volleyball games during the week.  Amy is the bomb and makes the best margaritas.  There are 2 secret art galleries hidden here.  Also gotta love the art in the ladies bathroom - I sometimes forget it's there.", 
    "review_date": "2007-04-12"
  }, 
  "TW0IU8xJJ1_CjfqrxvRjcw": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Iam X.", 
    "review_text": "Miss it already. They treated this DC tourist like an old local. I still have the bruises.. I highly recommend this joint if you're looking to get off the SF path.", 
    "review_date": "2014-06-14"
  }, 
  "954zIJg2E8v2g6S5BxCStw": {
    "user_rating": 5.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "Where man ends.. this bar begins. Neighborhood bars have never been so.. Cheersy!!  Just perfect for drunk days..Amy B please marry me", 
    "review_date": "2013-09-01"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Really good bar tucked away in the middle of everything.  Good place to relax and have a drink while you're in North Beach or Fisherman's Wharf, but don't really want to be in either one of those places.", 
    "review_date": "2009-06-22"
  }, 
  "fGkpW1GpmRUQ4E3vEJTn8w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara H.", 
    "review_text": "I can't believe I forgot about Sweeties!  I used to go there occassionally when I lived in NB, but I hadn't been in a few years until yesterday, when a friend asked me to join her and her co-workers for happy hour.  That's when it all came back to me...this is a great bar!  The bartenders are friendly, and the bar area is cozy - we scored the seats by the window.  They have a great happy hour ($3 pints) and while I haven't actually tried their pizza, it looks and smells great.", 
    "review_date": "2007-08-25"
  }, 
  "JBALeMOJ3vUzRc4XDaIhww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel G.", 
    "review_text": "This is an amazing bar. Full of locals ranging from plumbers to chefs to unemployed. All of them the most friendly bunch you'll ever meet.  Amy, the bar tender is a total rock star! Be generous with your tips. She is the best bar tender I've ever encountered in SF.  If you're into the who's who, the who is hanging out with who, or the who is wearing what scene, you'll hate this place. If you like real people who are down to earth, incapable of bullshit, and honestly interested in who you are and what you're about, stop in. Leave your ego at the door.  See ya there.", 
    "review_date": "2007-05-17"
  }, 
  "7FUOVgrGVE4G0h4OYBD_fw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tovah L.", 
    "review_text": "Met some friends here last night and it was the perfect laid back, unpretentious neighborhood bar....if only I lived in the neighborhood!", 
    "review_date": "2007-08-03"
  }, 
  "5movf4njIHTuBOl9zNX7Iw": {
    "user_rating": 5.0, 
    "user_location": "Newton, MA", 
    "user_name": "Jonathan W.", 
    "review_text": "Love this place... Best hidden gem find in my neighborhood.  All the other reviews capture the quirky features, but to add one: there always seem to be old people who bring assortments of fancy cheeses and share with anyone at the bar.  Awesome.", 
    "review_date": "2014-04-19"
  }, 
  "K2hRhu2g-LR4qpxDsaAtzQ": {
    "user_rating": 1.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Debra T.", 
    "review_text": "DON'T WASTE YOUR TIME HERE! SWEETIES IS FAR FROM \"SWEET!\"  If I could, I'd give this place NEGATIVE STARS. Never have I had such a rude experience in a bar! My girlfriends and I decided to come here for a friend's birthday after seeing Yelp had given it 4 stars. The place is pretty decorative and has a nice ambiance. HOWEVER, maybe these people on Yelp give Sweeties 4 stars because they had a different bartender. My experience was terrible because the bartender we had was a straight up bitch. We went on a Saturday night and I was surprised to see it rather empty, but we still tried to make the most of it. Obviously my group of girls and I were laughing and talking loudly because 1) IT'S A DIVE BAR, YOU'RE NOT SUPPOSED TO BE QUIET LIKE YOU'RE IN A LIBRARY 2) WE'RE HERE TO CELEBRATE A BIRTHDAY!  The bartender (wearing an ugly knitted grandma beanie with tacky flowers on it) hushed us and told us to quiet down and then proceeded TO TELL US TO LEAVE! We were nowhere near disrespectful or rude... And after the drinks and tips we bought and left for her... What horrible customer service, I am never coming here again!", 
    "review_date": "2011-03-29"
  }, 
  "VwTzyj0FtAJMLB52vt_OGA": {
    "user_rating": 4.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Clifton L.", 
    "review_text": "Love this place!  Not a local, but also not a tourist.  Come to San Francisco quite a bit, and this time my hotel was down in the touristy Wharf area, which isn't exactly where I usually like to frequent.  Found this place, and was immediately transported out of the whole typical touristy area into a true neighborhood hangout.  Thoroughly enjoyed playing a round of billiards, even though I am terrible at it.  Bartender was great, kept conversation lively.  Hope to return on another trip some day.", 
    "review_date": "2012-05-22"
  }, 
  "fES_Ws1CDBUw7vcTJzr8CA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "I can't tell you much about Sweeties except that we stopped by for about 15 minutes during Happy Hour last night.  The bar is quite nice, pool tables, there was a small crowd.  Bartender was friendly and I enjoyed a $3 Anchor Steam! Can't ask for much more than that!  If in the area, I will surely return.", 
    "review_date": "2011-10-27"
  }, 
  "SJFhF4LVZxqj-dunGgosGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ali N.", 
    "review_text": "My favourite bar in the city! It's tucked away just north of the North Beach drag and looks like it belongs in a far slower paced part of the city. It's got the best jukebox in San Francisco, great handmade pizza to order and a free (though old) pool table.  You get to meet a surprising mix of people; regulars from the neighbourhood, league teams from the Tel-Hi and the school a block away, and the occasional adventurous tourist. I held a birthday party in the back room a couple of years ago and it was a great way to start an evening of hitting the bars on Broadway.  Oh and I haven't even mentioned the fantastic art, the art studio next door, or the fact that it's family owned.  UPDATE - They now charge $5/hour for the pool since they just replaced the table and the nominal fee is to prevent this one getting abused too quickly. The price is reasonable and the number of apologies the staff give you for charging anything at all is very charming too ...", 
    "review_date": "2007-01-31"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Cheers of North Beach - \"...where everybody knows your name and they're always glad you came...\"  This place is truly a neighborhood bar - it's tucked in the residential area, not a place you can find unless you know where it is or you happened to drive by and noticed the A frame sign or the awning.  After shopping at the nearby Trader Joe, we drove by and saw the place.  While debating if we should check it out, a space magically appeared - that's fate.  Happy Hour 3-7pm - $3 draft, even better.  We walked in, the place is dark and not very big.  A few regulars at the bar, someone playing pool, a big buddha welcomes you.  We found 2 seats at the bar although I was eyeing the comfortable looking wing chairs near the front window.  The bartendar was friendly and got us our drinks - hubby got the IPA and I got the Anchor Steam $6.   Mr. decided to check out the jukebox and the bartender said there's a credit and feel free to play whatever we wanted.    The bartender also make the pizza - talented :)  Bunch of folks walked in -bartender greeted them by names, they said hello to the regulars - we thought of Cheers.  More regulars walk through and the exchange of hello and handshakes ensued.  The regulars there are really friendly and we were treated like part of them - talking about nothing, about the game and whatever.  Ian, the bartender, is super friendly and does a generous pour.  If you want wine, you'll get the best deal here since they pour in small water glass - it's a very generous pour.  One of the older gentlemen, a regular, told us Sweetie was once a restaurant where the bar was upstairs.  The space has since been reduced to the current size as a bar - they just celebrated their 6th anniversary in September.  Hubby really enjoyed himself and I know this will become a regular hangout for us.", 
    "review_date": "2008-10-07"
  }, 
  "-z8Z93iq1b5WJpRcibdI0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris N.", 
    "review_text": "This a local's hideaway. Its common to see patrons come one at a time. I like the place because its cozy and the bartenders are very cool.  I always get a warm welcome when I arrive.  Don't go here to watch a game... just to conversate.", 
    "review_date": "2009-01-16"
  }, 
  "9SubvBkK2xAu-vv5lyMWvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Russ C.", 
    "review_text": "Sweeties is quickly becoming one of my favorite dive bars. It has a relaxed environment, is rarely crowded, free pool, good music and cheap drinks.   This isn't a tourist bar and it doesn't get overrun by the bridge and tunnel crowd (or the marina crowd for that matter), but it does have locals enjoying themselves. This might be the closest thing to Cheers that SF has.  A great place to meet up with friends but the crowd is usually about 80% guys so this isn't a \"lets go out and get laid\" bar. Unless you're looking for guys, in that case this is your place.  Haven't tried the pizza yet, but it's high on my list.", 
    "review_date": "2012-10-18"
  }, 
  "wb2I6PxYjRStE7OGLL4S7A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristy M.", 
    "review_text": "This bar is a sweet little treat.   One of my favorite things about this North Beach treasure is the fact that most of my friends who live in the area have no idea this place even exists. It's off the beaten path and loved by true locals and bikers alike.  I came here with a crew of about 15 after sailing on the Adventure Cat for a surprise party. Amy (who, if you haven't gotten the point yet, is so totally awesome) reserved the back space for me after I called in a couple weeks prior to let her know we'd be coming in. I dropped off some food from Trader Joe's (also Amy's idea) earlier that day so we could have something to munch on after our booze cruise. She had our first round of patron shots (served with freshly cut lime wedges and a bowl of salt to pass around) ready in no time and our homemade pizza's were out an hour after that (well worth the wait).   There's a great vibe that lingers here throughout the night. It's great for large groups or for simply grabbing a beer and a game of pool with a friend without being distracted by tourists or douche bags on the prowl. There's a pretty sweet art collection in the back room that's worth checking out (though the past two times I've been the room hasn't been open. bummer).  I wish I lived closer...this would surely be one of my favorite dive spots.", 
    "review_date": "2009-05-19"
  }, 
  "y3HFVx8nbNmomSc-PWOy-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy N.", 
    "review_text": "A real hidden gem of an outer North Beach, borderline Fisherman's Wharf neighborhood bar.  Been coming here for years and have always loved it as a charming, low key, neighborhood bar.  Coming back from my mechanic's home in Petaluma, I actually found myself with the rarest of things, a free afternoon!  Headed to North Beach and peeked into my usual haunts, but for some reason, unlike the other day, they were unusually dead so I waved at a couple friends and ended up here.  The bartender, Amy B, was super cool as always and great with all the patrons at the bar.  Everyone was extremely welcoming and the place had the most wonderful neighborhood vibe as everyone talked to everyone on a variety of topics including the earthquake, the end of the world (Rapture), new restaurants, Michael Bauer, and everything else.  Saw an intriguing little sign hanging on the wall inside that states:  NOSMO  KING  After staring at a bit and baffled by it's intent, I asked Amy about it.  I thought that perhaps NOSMO was related to NISMO which is a Nissan racing thing.  She told me to say it a few times...okay...I got it...LOL  Truly a great bar!  The free pool table was there, but I didn't even get on it (which is saying a lot) since I was having such a great time hanging out and talking with newfound friends.  Locals with a great Cheers-like vibe.  This is truly what a great neighborhood bar is all about.  It's a little off the beaten path and not the easiest to find unless you are specifically going with that destination in mind, perhaps that's what gives the place it's innocence and keeps it special.  May it never change and may it last a hundred years.", 
    "review_date": "2011-10-21"
  }, 
  "jX52sZoojxyYV2viWNyO7A": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "David O.", 
    "review_text": "Sweeties, I miss you so...  Back in the day, this bar was located conveniently downstairs from my apartment.   I could take about 30 steps and order a beer at Sweeties.  This made it all the more convenient when I had to take the 30 stumbling steps home after a long night of drinking.  It's kind of a dive bar, but I enjoyed it!   They had a great jukebox selection, actually, and a pool table.  The bartender was really cool too.", 
    "review_date": "2006-10-19"
  }, 
  "P4kDkzyJwv6YR320pCEsvQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben K.", 
    "review_text": "My new watering hole!  I found this place recently, as I just moved to North Beach, and it is the perfect place to come with a few friends, chat, have been during happy hour, and maybe play a game of pool.  This place intentionally doesn't attract the type of marina striped shirt crowd that gets too rowdy.  They close during the week at 11 and during the weekend at 10.  So get their early, saddle up to the bar with a beer, and enjoy the best...bar...ever.", 
    "review_date": "2008-02-21"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "This bar is like a panther...it lies hidden in the grasses (residential housing) and waits to pounce at anyone walking by (me).    I have come after work and had a few beers and it was pretty chill and suprisingly lively for a bar in the middle of nowhere.   The best though is coming with a big group of people. It's like your own special little bar and if you get bartender Amy you'll get some kick ass service.    I dig it.  Side Note: Girls..the ONLY reason any guy will ask you to play pool with him is so that they can a) look down your shirt as you shoot or b) look at your ass as you bend over the table.", 
    "review_date": "2009-05-06"
  }, 
  "t_CfV21zTPkTSFV90NewCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay N.", 
    "review_text": "I used to hang out here when my office was in across from Bimbo's. Really nice, laid-back folks that make good cocktails that aren't too pricey. Nice, cozy vibe with an interesting mix of folks to chat up. Multiple premium bourbons and even odd stuff like Pimm's. Almost  always able to get a seat. What else do you need to say?  I guess don't come here if you're looking to get laid, but it's not out of the question. Do come if you want to hang with some friends for a few cocktails before either going home or hitting the town hard.", 
    "review_date": "2007-05-21"
  }, 
  "7Lj88Y_78VbCBWSe1Yxctg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Rachel L.", 
    "review_text": "Sweeties is my first love. I used to work around the corner and day dreamed about frothy beers and oily basil cashews after hours.  Sweeties is large, just dark enough, has a great jukebox, wonderful bartenders. Everything you could want in a dive... and so much more!  Word on the street is that Sweeties is owned by an artist (who also owns Pier 23--also a cool spot). Adjoined to an actual art gallery, Sweeties is brimming with funky pieces of art; handycrafts and surprise sculptures (ladies, check the bathroom). I just love the colors and vibe here.  On Tuesdays, Cormick is the evening bartender. He is the sweetest, friendliest, and handsomest bartender around. While the other bartenders are AWESOME, Cormick has a special appeal and Tuesdays are definitely worth getting drunk over if he's manning the bar.  Did I mention that Sweeties makes mini pizzas? No? Well, THEY DO! What a genius idea right? One too many drinks? Shouldn't have had that last shot? Well, I'll have a fresh min-pizza and I'll be back to normal in no time! True story, my friends.  I miss coming here on a weekly basis, but I will definitely make a special trip now and then to visit the bars stool next to the fat Buddha. It's the kind of bar I can do to alone and not feel like an alcky. And THAT, is worth its weight in gold. See you soon, Sweeties, my beloved.", 
    "review_date": "2010-03-07"
  }, 
  "qU3E7ENm8VsMc_IZCpTCZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "The Sock S.", 
    "review_text": "You basically have to trip over it or know someone who's been here, because it's tucked away from the crowd. It's a great place to hang out, though sometimes gets really crowded when they're hosting an event. The decor is pretty nice, and there is a new pool table. The architecture is actually really cool, high ceilings and all. The bar itself is kind of small and there are a few tables in front with the window usually open. There's also another room in the back.   Drink prices are pretty reasonable. The pizzas looked good, though haven't trie done yet. The bartender is always friendly and pours decently. Again, nice place to catch up with friends or drown your sorrows, though they close too early for one to really drown.", 
    "review_date": "2007-10-11"
  }, 
  "LjjqjneBuvp94-v4l0wnNQ": {
    "user_rating": 1.0, 
    "user_location": "Union City, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "The one star is for the decor and the decor only.  If you're looking for a bar that DOESN'T want you to have fun, come here.", 
    "review_date": "2011-06-05"
  }, 
  "YmTS2FFbScIKrGNywXgkag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Today Y.", 
    "review_text": "Chill bar with a local crowd, pool table, food, and a room in back with rotating, always odd, art exhibit.  There's a buddah statue with a nice round bald head, and the floor is red (i always thought it was a worn red carpet, but maybe that's just how it felt after a drink or two).  Friendly place.  I like the window that lets in a little light in during the daylight hours, for those summer nights when you can feel a little vampirish hiding out until night falls.", 
    "review_date": "2006-07-09"
  }, 
  "m82v8QQlg2iOjZwNUFZmQw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "I live nearby, and do my laundry at nearby Wash It!. Whenever my whites go into the dryer, I walk over to Sweeties, grab a glass of wine, and get caught up on my reading while I wait.  Sweeties is the epitome of local haunt. There's no way to pigeonhole it, and most people who live hear haven't heard of it. As I mentioned, I like to come by when it's slow to read, and we love to bring friends here on low-key weekdays to catch up.   Many reviewers have mentioned Amy - she is lovely. Efficient and charming, she's great to chat with and funny as hell.  Sweeties won't blow your mind, but it will give you a comfy local place to enjoy a drink and good company.", 
    "review_date": "2010-01-08"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "If you blink you will miss this place.   That is a blessing in disguise in the hustle and bustle of the North Beach/Wharf area. This has to be one of the most chill places I have been to. It is what I would imagine my rec room to look like, should I ever have one  (though mine would be a bit less worn and maybe a little cleaner). Darkish with some cozy seating, a bar, a free pool table and a rotating display of some strange and cool artwork in the back room.   If you are a late drinker you will also miss this place, as it closes at 11.", 
    "review_date": "2007-04-23"
  }, 
  "F4li3HnfS4gY5IeMSPkGcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John M.", 
    "review_text": "I've lived in SF for 2 years now and I was pleasantly surprised to go to Sweeties.  My gf took me there for my b-day after an excellent sunset sail in the bay and the place was charming, quaint and very relaxed.  The bartender, Amy, was super cool.  She kept the Patron shots flowing and made some delicious pizza fresh just for us.  I was told there is an art gallery in the back, but it was closed...so I'll have to come back another time.    What I liked most about Sweeties was the vibe.  It was very local, which near the wharf, is hard to come by.  The place had art from local artists on the walls and the patrons were all very nice and relaxed.    I'm definitely a fan.", 
    "review_date": "2009-05-23"
  }, 
  "8DNiwBb0__aB3WehK4JYCg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stefanie L.", 
    "review_text": "Sweetie's is one hell of a paradoxical bar. It's located on a quiet street in North Beach. It's got a nice pool table that's not overcrowded. It's got a friendly crowd of non-tourists. All of these things are major pluses, which means I'm definitely coming back here pre-and post-Cobbs, or maybe pre- and post-Trader Joe's. (Though probably not for game-watching; the TV just isn't big enough.) It's hard not to love a place that serves $3 beers, maintains a local clientele in a tourist neighborhood, and contains both a spiral contraption with toy bats on it and a painting of a naked man in the women's bathroom.", 
    "review_date": "2012-01-31"
  }, 
  "xT15DPvgtyU799LLXpKzIQ": {
    "user_rating": 4.0, 
    "user_location": "Stuart, FL", 
    "user_name": "William R.", 
    "review_text": "This is a fun little place with great service. It feels like a neighborhood bar which is a nice find in a place surrounded by North Beach and Fisherman's Wharf. They even have a pool table that doesn't take quarters. Good prices and a fine happy hour. Drinking tourists, seek this place out.", 
    "review_date": "2009-08-03"
  }, 
  "l7SeqORHcUqaO1zBwF2RxQ": {
    "user_rating": 5.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "D R.", 
    "review_text": "I'm really not into sharing my favorite places in the city so what I REALLY should do is give this place one star....however, this place does deserve some attention because it's amazing. Free pool, chill crowds with no d-bags, fun times on First Fridays, heavy pours and the most amazing crew of bartenders you could ever hope to meet.   If you're in the neighborhood, it would be worth it to visit this quaint little watering hole.  Czech it out!", 
    "review_date": "2014-05-14"
  }, 
  "0GCm12Ey7s5XybDikwoEAQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris S.", 
    "review_text": "Ian made me a lovely pizza and extended happy hour until 7p.  Very nice.  Great crowd.", 
    "review_date": "2008-11-25"
  }, 
  "s76uE612OAou7SFYWPJ8iA": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Mark C.", 
    "review_text": "Greatest happy hour, till 7 in sf", 
    "review_date": "2011-07-12"
  }, 
  "yi9eAPNgnqBGaRQ_Eyz2Aw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaylena P.", 
    "review_text": "After two days of sail lessons, my team instructor invited us to the sailing communities local. This is a nice pub for the sailor crowd. There is a pool table, a few tele's, and a calm 'catching up with the crew' atmosphere. Guinness on tap @ $6.00 is also a plus! It is walking distance to Fisherman's Wharf and North Beach. Hidden away just enough so the hipsters and tourist are not able to find it.  Definitely a well kept secret.", 
    "review_date": "2013-11-06"
  }, 
  "IIbh3vCmisLDqG6vb7jp7Q": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kristen G.", 
    "review_text": "This is truly a great neighborhood bar and excellent service. These restaurants are friendly, helpful, and good customer. This is a nice pub for the sailor crowd.  The bar is perfect and drinks were nice. It is stiff drinks and many tats. Eclectic music mix and Cheap drinks. Good bar tender who was super friendly.", 
    "review_date": "2014-02-18"
  }, 
  "sAqu1ueoTR-eK8rQiFkO0w": {
    "user_rating": 2.0, 
    "user_location": "Martinez, CA", 
    "user_name": "Carrie T.", 
    "review_text": "Meh, venue was a little old.  Not a great vibe for me.  The crowd looks to be for ages 40+, not that that is a bad thing. Just FYI for people looking for a younger vibe. Drinks were reasonably priced and friendly staff.", 
    "review_date": "2013-03-04"
  }, 
  "E1zjApNBa6xIdxRs5_UIWg": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Dave K.", 
    "review_text": "Went to a birthday party at Sweeties that got blown way out of proportion last night.  The poor bartender (notice the singular) had to deal with maybe 60+ people crammed into the bar sucking down booze like it was 1999.  She hung in there for a while.  I had never been before (although this was my wife's post-up) and from her description of the place I was not expecting the ubercool art on the walls.  There is some really great art - art in a dive - you should just check it out for that.    Auf.", 
    "review_date": "2009-05-31"
  }, 
  "m9C234YeuS0CQdKjkg4AFQ": {
    "user_rating": 4.0, 
    "user_location": "Oklahoma City, OK", 
    "user_name": "Michelle M.", 
    "review_text": "local bar, great place to come with coworkers to unwind after work.  i will def. be back.", 
    "review_date": "2008-08-19"
  }, 
  "RMzVhsnc5Ri4VTbS7lczLg": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mark H.", 
    "review_text": "I came here looking for a quiet pint and some down time on a Tuesday night. That's exactly what I got (well two pints and a whiskey), and have no complaints.  Some of the reviews have amused me - along the lines of \"we came here to get smashed, be rowdy and not give a crap about the local sensibilities, and I can't believe we were asked to leave\". Hmm...   If there are ten of you intending to act like assholes after getting drunk enough to do so, this probably isn't the place for you. If you're here to enjoy the local life or simply relax, give it a go.  The music was great too, not too intrusive but audible enough to enjoy if you wanted to.", 
    "review_date": "2011-06-19"
  }, 
  "4DivRgqTWH4bjOsmF09ifw": {
    "user_rating": 5.0, 
    "user_location": "Salt Lake, UT", 
    "user_name": "Daralyn C.", 
    "review_text": "Best afternoon with this group of delightful people. Thank you, Amy, for making us feel at home.", 
    "review_date": "2014-06-07"
  }, 
  "QqepHIJCJE_YuRnNk08HPw": {
    "user_rating": 5.0, 
    "user_location": "Clinton, MA", 
    "user_name": "Love T.", 
    "review_text": "awesome ambiance, if you are into divey bars like me- not crowded at all, and one guy strolled in with his dog- love it!", 
    "review_date": "2012-08-10"
  }, 
  "LNkxJgykMMMMnSlSb8bqlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betsy W.", 
    "review_text": "This bar was fun the people in here were just kicking it, the drinks were good and the bartender was nice. It wasn't crowed and everyone was friendly.", 
    "review_date": "2011-07-27"
  }, 
  "FcjioveW2WDKx8QwTXg9KA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen K.", 
    "review_text": "Like others say, its a local bar.  Don't come here looking for the next hotspot.  This is an unpretentious place to go after work, get a drink and unwind with friends or co-workers.  Beer seems to be priced pretty reasonably.  Cool, unique interior.  Great bartenders (funny too!).  Since I work in the area, I  will be sure to be back.", 
    "review_date": "2008-06-21"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "This place is a relic of a bygone era. You won't find super expensive craft beers or girls with tank tops behind the bar. What you'll get is a stiff drink and some pretty standard beers on tap. Their guest beer is Anchor California lager, so you're not exactly talking super craft.  Beers are super cheap during happy hour, the bartender doesn't wear gloves, and you get stale chips. It's divey, and there's a kitschy Buddha statue next to the pool table. Not complaining though. Sometimes, you just need a place like this to clear your head. Oh, and it's pretty much always empty because of its location. It has a small tv, and there's a $10 limit on cards. Local watering hole to the max.", 
    "review_date": "2014-11-12"
  }, 
  "Hnu5s_myOZZIS2eny7liVA": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Emily J.", 
    "review_text": "It is a good thing that this bar is approximately one hour away from me on public transportation or else I would be a regular and would not be nearly as productive in life.  I was spending a fabulous Saturday afternoon in the city with my good friend, Jen B, and we had some time to kill before meeting my fiance, Jac C, and her brother, Jason B, for dinner at Melt.  We checked yelp to find a bar near Melt and Sweeties came up as one of the highest rated.    Sweeties was the perfect pre-dinner spot to sit and chat and have a cocktail.    This bar is laid back, cozy and entertaining.  The bartender (Amy, I believe) was super nice, attentive and mixed us up some delicious drinks.  The other patrons were nice and very welcoming of us newbies.   The roasted cashews are delicious and well worth the $3.  Amy apologized for having to charge us but we completely understood. Nuts are expensive!  I love that they buy cashews and then season and roast them there.  The women's bathroom is spacious and clean.  I cannot report back on the men's bathroom since I did not go in there.   I am not sporty but they have a pool table for those of you that are.", 
    "review_date": "2009-04-21"
  }, 
  "fM8qkbgA_7_j-XS6tR6N6g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JASON L.", 
    "review_text": "cool little hole in the wall with pool table and homemade pizza. nice interior and friendly staff!", 
    "review_date": "2008-04-15"
  }, 
  "kM-VfHEMeHs5CkAua6-N6A": {
    "user_rating": 5.0, 
    "user_location": "Champaign, IL", 
    "user_name": "Vanessa R.", 
    "review_text": "This is the type of place for certain types of people. If you like wandering off the beaten path (often in the opposite direction of tourists) and want to cozy up at a bar with a good book or your laptop amongst locals, then this is more your speed.   I was in SF for a work trip and needed some after hours downtown among good company and that's just want I got. It's a low-key place with a local clientele. Drinks are your typical dive bar drinks though I did get a dirty martini and was pleasantly surprised. Not the best I've had, but good well made and decently priced.  I ended up spending the evening chatting to locals about the neighborhood and their personal journeys to San Francisco. It'll definitely be a place that I'll return each chance I get, they made me feel welcomed and at home, and have encouraged me to visit when I return. I even got a good-bye hug from a regular (a lovely older gentleman) who's a wealth of information and history.", 
    "review_date": "2011-07-13"
  }, 
  "tTZc45XDz-Jo9Jjh2c_d2w": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Nik N.", 
    "review_text": "my fiancee and i stumbled upon sweeties before a show at bimbos.   wowza - what a lovely neighborhood joint.   great vibe, great space, friendly folks, and a great bartender offerin' an ample selection of libations to boot.   what else to you need?  what a refreshing step away from the hustle and bustle of the \"scene\" just around the corner...", 
    "review_date": "2012-08-13"
  }
}