{
  "Tj9kArNJYhYeORH6zG9PfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bridget G.", 
    "review_text": "Perfect date spot, or to get a few glasses with girlfriends! The rosé is amazing, and we got a cheese plate. Delicious... The service was friendly and attentive, and the overall ambiance was cool and comfortable. I'll definitely be back!", 
    "review_date": "2014-12-07"
  }, 
  "ptnuGr6XnEjXGKTSUrom8A": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Stephen S.", 
    "review_text": "Nice place to visit just outside of Downtown for something different.  Nice staff, good selection of wine and cozy upstairs lounge which is good for a private party of 40 folks or so.", 
    "review_date": "2014-11-28"
  }, 
  "wcGxF2ykCmlwfCob6oPfNw": {
    "user_rating": 5.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "Ashley M.", 
    "review_text": "We came here on New Year's Eve and absolutely loved it. Excellent wine selection, delicious appetizers, great atmosphere and the service was wonderful. We'll definitely be back.", 
    "review_date": "2015-01-03"
  }, 
  "1vT-1gtksBsx14uKi7UsbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan B.", 
    "review_text": "What a gem! While waiting for our table at Huxley, Tender's neighbor, we enjoyed a few glasses of wine at Tender. Like its neighbor, the space is small and cozy, but on a Thursday night, the bar was just-full enough to be lively, but not  crowded.  The service was great-- while waiting, one bartender grabbed the Huxley menu next door for us, allowing us to preview our dining selections. The other bartender, who took care of our (mostly heavy) pours. She was friendly, a bit sassy (which I love) and accommodating.   They have an upstairs loft area, which was empty for most of the time, but would make a great space for a larger group. Tender definitely merits another visit!", 
    "review_date": "2015-01-30"
  }, 
  "MPr0eEMQ27kqJMYxLnpwmw": {
    "user_rating": 5.0, 
    "user_location": "Aspen, CO", 
    "user_name": "Lisa P.", 
    "review_text": "Fabulous spot in the Loin! Tastefully designed and great cozy space for casual wine and bites and nice party space upstairs perfect for a group of 20+.", 
    "review_date": "2014-11-28"
  }, 
  "KmqivnDXe3mVjBtp9ZxkOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley H.", 
    "review_text": "Love it! small cozy. great wines on tap. def a great addition to the neighborhood. they have a decent selection of red and white wines all on tap which makes it super fast to get a drink.  I love the new bar smell. they also have cheese and charcuterie selections. really happy this place opened!", 
    "review_date": "2014-11-12"
  }, 
  "FLL6Yk1Jny44X0RxyDvWkQ": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Robert G.", 
    "review_text": "Fun place! Good wine. Good food. And really cool staff! They have a great room upstairs for private parties too. I look forward to going back there and hanging out.", 
    "review_date": "2014-11-24"
  }, 
  "CjeygLjaQYQ7J6LIu95jiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "London M.", 
    "review_text": "Super cute! Love their wine selection! Plus it's all on tap! Def will be coming here on the regular!", 
    "review_date": "2014-12-26"
  }, 
  "NmSVuPqru2lcPuEBql6syw": {
    "user_rating": 5.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Faith P.", 
    "review_text": "What a treat we had last night.   One always hopes when you head to the city that the long drive will be worth it and it really was!  We were greeted by a very friendly (and not hard to look at) bar tender upon entering and our every need was anticipated all evening.  There is so much to try that we can't wait to go back.    The cheese board was phenomenal and buckets of bread coupled with alternating beers and glasses of wine... what a great time!  Tender is cozy with a great atmosphere, the art and lighting makers for a perfect intimate evening with friends. And when the check came, thankfully we were not shocked as we often are when dining in the city.    Thank you Tender for a wonderful kick off to my holiday season! 5 STARS!!!", 
    "review_date": "2014-11-15"
  }, 
  "BKdMoAaI_H2dA9O9kP5C-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fred X.", 
    "review_text": "Great place with a marquee list of wines.    Loved the Blackbird Rose!", 
    "review_date": "2014-10-31"
  }, 
  "Z6TEk_NnXB-Zr_lrboimZA": {
    "user_rating": 5.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Nanci H.", 
    "review_text": "I was very impressed with the new wine bar tender.  I am somewhat of a wine snob and they really know their wines there. The selection is great. Miriam was very welcoming, and Mickey is so knowledgable. Be sure to check out the upstairs. This is my new favorite wine bar.", 
    "review_date": "2014-11-14"
  }, 
  "jMvJPfk3Wy33RxcJplAdTQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "craig L.", 
    "review_text": "Tender opened today and the place looks great. What a great addition to the neighborhood!  Well done.", 
    "review_date": "2014-10-30"
  }, 
  "TuH96GDKMC8iAgHcEeuX8A": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Yolanda S.", 
    "review_text": "Such a nice place .. Great wine, good food and a beautiful place. Upstairs is so nice you sit, sip a great wine and just look at one of the most amazing cities in the world. Will come back, again and again ...", 
    "review_date": "2014-12-13"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "Met a friend upstairs after work. Seriously the coziest space in the TL for a drink. Love love love the upstairs. Happy hour flight is wonderful. People who work here are so gracious and sweet. My new favorite wine bar in the city!", 
    "review_date": "2014-12-18"
  }, 
  "LnZUtFx6qTWs8NV6lAARxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "Our party of 3 stopped by here a couple of weeks ago after having dinner at a nearby Vietnamese joint. The space is cool, hip and very inviting. Plus, the entire staff was awfully sweet and attentive. The wine options are selective and we found something for each person's taste. We also got to go upstairs for a peek at the space and it was gorgeous! The whole place really reminds me of something you would find in the LES of Manhattan. I'm looking forward to checking this place again in the near future.", 
    "review_date": "2014-11-18"
  }, 
  "0AZHFsD_dJrA6pgVX-HTyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittini S.", 
    "review_text": "I loved this place! I went for NYE and we went upstairs because we had a big group and the service was excellent! They were so freindly and the food and wines were great! So happy this opened up in my neighborhood.", 
    "review_date": "2015-01-02"
  }, 
  "11YI9w3Y1YpXSeAzf0tOnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mantas V.", 
    "review_text": "A cool wine bar, I'll be heading back.", 
    "review_date": "2015-01-31"
  }, 
  "-anWJKa_Ds5frW1-Et8ZKg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tobias W.", 
    "review_text": "My new favorite local wine bar. The people working there are very nice, they have great wine and the place is cozy and not crowded. Highly recommended.", 
    "review_date": "2015-01-13"
  }, 
  "ic1MVhn7WvdObO8ki7wxKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeffrey B.", 
    "review_text": "I live for good wine. The wine is good here. Welcome to the neighborhood. I really do like this place, but the service is a little off. As others noted here, not particularly warm or welcoming (but not horrible), and the knowledge of the wine is a little lacking. I think these are things that will improve.   BTW, to the staff, that was in fact a Sav Blanc that you served my wife, not a Chardonnay. Trust me, I know the difference; 20+ years of experience and several hard-earned sommelier certifications to prove it. Your taps were clearly switched (it's really not that uncommon). While I appreciate that you changed the glass out for an actual Chardonnay, the (two) unnecessary and somewhat condescending comments after the fact were just annoying. Please don't be condescending to your polite, appreciative, and likely-to-be-regular customers.  And just one more gripe: Do you really need to have a locking bathroom that requires a code?", 
    "review_date": "2014-11-21"
  }, 
  "0V4Ra6jCmSAgFtCiORr4QA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Megan C.", 
    "review_text": "Neighborhood Wine Bar Cozy + Nice Selection  Reasonably priced, nice atmosphere. Famous artists' work on the wall was also a nice touch. The owner and her partner collect art and love wine. Can't wait to see how this location improves with time.   Have heard things were going well. Will be coming back again and re-review next time I am in town. Good luck with Tender Miriam, all the best to you and your family.  The Scene: Casual  Destination Rating: 6 Date Rating: 4 Hob Nob Potential: 4  Note: Come, enjoy, relax. Check out the upstairs lounge.", 
    "review_date": "2014-11-17"
  }
}