{
  "stZGLOrUzGz8H03T92Wutw": {
    "user_rating": 5.0, 
    "user_location": "Pleasant Grove, UT", 
    "user_name": "Paul H.", 
    "review_text": "I am Japanese and have found a few places that have blown me away with their tasty sushi. Not only is this a super fun way to eat sushi, it is so delicious! I love the chefs who work in the middle. They are very social. They check on how we like the nigiri and if you ask for something in particular, they are more than happy to make it. Be sure to try out their chef special hamachi. It's to die for! Best sushi in the Japantown mall!", 
    "review_date": "2013-10-06"
  }, 
  "mE-hdFF4RgCxspZU72GAsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "I love this newest addition to the SF kaiten (conveyer belt) sushi scene. In fact as all the other places are sushi boats, this is actually the first authentic kaiten in San Francisco. The quality is fresh, choices abundant, and they even cover the offerings with a clear plastic lid so the guy across the way the annoying cough won't adulter your future choice of food. The have great sake selection at a perfect price. And the crowds haven't quite discovered this place which is good- guess I'm sorta shooting myself in the foot here, but c'est la vie, I'd rather this place by busy than go out of biz.", 
    "review_date": "2013-09-18"
  }, 
  "G-1uSi0c5ZdvZBZJBZVCiA": {
    "user_rating": 4.0, 
    "user_location": "Indianapolis, IN", 
    "user_name": "Patrick T.", 
    "review_text": "This is a fun little place in Japan town that serves small sushi plates on a metal conveyor belt. The plates are color coded by price and covered with a plastic lid. It's pretty tricky to pick them up one handed so I would use two just to be safe!  Overall the sushi was pretty good. I spent a lot of money because I have expensive taste and wanted things like uni nigiri. They had a deal where they put out a whole tray of uni for $10 which is pretty legit. Having lived 4 years somewhere where uni is hard to find, it was a must have.   The tea came out super hot and I burnt my tongue so don't be a fool like me.   I think the rice to fish ratio was overall good except for the scallop nigiri which had way too much rice!   People were eating up the oysters left and right but I didn't get a chance to try it. Next time, tenroku!!", 
    "review_date": "2013-12-20"
  }, 
  "xfO5UNKaPQiakpcYOrrQgQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lillian C.", 
    "review_text": "I've been here a few times for sushi. They serve sushi via a conveyor belt and you simply grab the sushi you want and pay based on how many dishes you eat (each dish is priced according to its color). Overall, if you're looking for quick, decent sushi at a fair price, this is a great place.  My favorite ones are: - Fatty tuna sashimi - Salmon sashimi - Eel nigiri   There are loads more selection (a good strategy is to grab whatever looks tasty). I definitely recommend this place!", 
    "review_date": "2015-01-01"
  }, 
  "2-ZpF_iIHgc_5njdiJfM3A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stan V.", 
    "review_text": "I've come here a few times.  The sushi was fine, not very high quality.  However the last visit may be my last because I didn't get any service.  I asked how long was the wait for one person.  The sever repeated my question and just walked away.  WTF?  So I stood there for about 5 min and walked away.", 
    "review_date": "2014-12-13"
  }, 
  "eUTmrj76GhIQYj2Fc_ZSCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B N.", 
    "review_text": "Went to this place after hearing positive word of mouth. Was perfectly happy to sit at the counter and watch the sushi prep. Everything was very tasty. The quality of the fish was above average to excellent. Would come back again in a heartbeat.", 
    "review_date": "2014-05-25"
  }, 
  "T1rP9rqslOh_72KI0IW7rQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cynthia W.", 
    "review_text": "I've been here three times now and I love this place! It's so much fun because it's like eating + shopping at the same time -- two of my favorite activities. I came here with low expectations (1. it's in touristy Japantown, and 2. it's conveyor belt sushi) but was pleasantly surprised by the quality and the variety.   The salmon is heavenly -- super fresh. I was surprised at the generous cuts, and that the sashimi is the same price as the nigiri. Hamachi, albacore, and scallop were all great. I tried two unique things that were really yummy: 1) the saba topped with ankimo and 2) herring with capelin roe. Loved the ankimo (if you love liver, you will love this), and loved the layer of crunchy eggs with the herring. They even had oysters, and they were good too. The $6 toro isn't the heavenly amazing toro you'd get elsewhere, but it's pretty good. The walu was good the first time, but stringy the second. The uni wasn't the best quality, I would skip it. Skip the tempura, the flour is too thick and chewy. Even though it's on the menu, they didn't have trout either time I came here.  If you plan on making a reservation here, don't count on them honoring it. Once I made a reservation for 4 at 7 PM on the phone, arrived at the restaurant, and the waitress laughed, said I was late, and told me she gave my spot away. I looked down at my phone, and it was exactly 7:00. Another time I actually made a reservation in person, told them I would come back at 6:30, and they still didn't have a spot open for me when I came back. Luckily, this shouldn't be too big an issue since it's almost like fast food and there's lots of seat turnover, but just FYI if you're trying to catch a movie or something.   The plates are color-coded for price, and you can easily order anything you don't see on the conveyer belt. The seating can be a little tight, but you usually don't have to wait!", 
    "review_date": "2014-11-15"
  }, 
  "vaTsgMALL-yczQph_YSxAg": {
    "user_rating": 5.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "A S.", 
    "review_text": "This place represented everything people have come to love and expect from an authentic Japanese Kaiten sushi place.   It's easy enough to understand, fascinating enough to draw in tourists. The plates are placed on a conveyor belt revolving around a \"bar\" with each colored plate a different price. I had been searching for fresh Uni since the beginning of my trip in SF and pleased to see they had box of Uni Sashimi for $10. (About 8 pieces or so) Any sushi lover will know that's a real bargain.  The other fish sushi plates were extremely fresh and chefs were in constant motion trying to meet the demand of a very crowded restaurant. Constant smiles and laughter were a good indication of great quality food and service.  Staff were extremely polite, sincerely apologizing if they had a delay on any requests. Windows, table top and floor were clean. (You'd be shocked at the amount of sushi restaurants that's out there filthier than a frat house restroom...)  All in all, I was full from fresh fish and high quality rice coming out to $30 (after 20% tip).   Very happy, would come back when I visit again in the future.", 
    "review_date": "2014-11-16"
  }, 
  "qVKPE3u1AKFsAg40I9HXZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J C.", 
    "review_text": "Came here once and I actually thought that they were not bad. The staff was very friendly. We were chatting about something I'm not sure what it was but they were very friendly. They looked like they just opened. They have floating sushi, conveyer belt sushi. I had uni and it was good, the same as any other ones that I've had. What's going good for this place is that they have a very nice clean and bright atmosphere inside.", 
    "review_date": "2014-06-09"
  }, 
  "RoSO1yEbzVh4p3N5_uWf5A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dang L.", 
    "review_text": "As far as sushi boat goes this place is pretty good, has a variety you can order, and decent price for being in jtown. I personally like it more than the other sushi boat in the building though it is a bit smaller, it doesn't seem to get too crazy packed", 
    "review_date": "2014-04-19"
  }, 
  "bI_daDIARDhsdSloV3R_Gw": {
    "user_rating": 5.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Reza G.", 
    "review_text": "Best sushi in japantown, i used to go to isobune but after i try this, isobune cant even be compared with this. My suggestion is to ask the chef for a seared salmon belly and hamachi special. They are both my favorites", 
    "review_date": "2014-10-22"
  }, 
  "NlVkM3u3CM0uDHND5_4DDg": {
    "user_rating": 5.0, 
    "user_location": "Venice, CA", 
    "user_name": "Jeremy S.", 
    "review_text": "Service was perfectly attentive. Food was good and fresh. Sit in the middle as opposed to the ends. Good is put on conveyor belt in the middle so you will get your pick of the litter. Went to pay bill and forgot money at hotel. spoke to the owner and left to get wallet. She was very sweet and understanding. you can't always trust everyone, but she did trust me. I'll definitely go back.", 
    "review_date": "2014-04-16"
  }, 
  "---fhiwiwBYrvqhpXgcWDQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jed H.", 
    "review_text": "This review is only for udon and spicy tuna roll.  I came here at 12 noon on Friday. There were only a few people here. The staff is very nice. I ordered a chicken udon and spicy tuna roll.  Spicy tuna roll: 6 pieces for $5. Tastes pretty standard. 3 stars  Chicken udon $7: The soup came shortly after. It comprised of lightly salted boiled dark chicken, mushrooms, carrots, some greens, and of course, the udon. Nothing special again. 3 stars.  The service is really good. There were more workers than customers. They came and filled my tea three times, and one time it was still full. I would give the service 5 stars.  Overall, I would give this restaurant 3.25 stars. They are great on service and presentation, but they lack the quality.", 
    "review_date": "2014-08-05"
  }, 
  "YVWVVh1pZoadVD_oea-8dA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Christine L.", 
    "review_text": "Wow I am impressed for a new restaurant.  Compared to the other popular conveyor/boat sushi place in Japantown (Isobune) this is a huge upgrade.  I could rack up a bill from their Kobe beef nigiri alone.  Kobe.  Beef.  Nigiri.  Really thin slices of raw Kobe beef on rice.  Raw beef sounds gross but there you are eating raw fish so don't give me that look.  Yes it is that good without soy sauce or wasabi.  Yes that would be the only thing I ate here if given the option.  There is a nice variety of cooked and raw sushi served so everyone has something they can enjoy.  The specialty sushi on the menu are no joke, either.  Just remember the menu sushi are maki (rolls) so you get a lot.  Pro tip:  Be willing to wait.  Like many sushi boat/conveyor belt places it gets busy during peak meal times.", 
    "review_date": "2013-07-30"
  }, 
  "dYDNr3ZOfzcpvmsGGhs0Sw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James L.", 
    "review_text": "After watching Jiro Dreams of Sushi and reading some sushi articles, I decided to eat sushi the traditional way (none of those deep-fried fish combinations drenched in unnatural sauce).  The chef behind the counter was attentive and friendly. I stuck with the healthy basics: seafood and rice. My favorites were the fatty tuna Toro and Ama-ebi sweet shrimp. The blue fin tuna, salmon, and hamachi sashimi slices were thick and delicious. Oh yeah, can't forget the underrated Saba (mackerel) and Herring Roe. Chased it all down with hot sake and ended with tomago.", 
    "review_date": "2014-01-30"
  }, 
  "qlZcofANmU1t97xJKgCZUw": {
    "user_rating": 5.0, 
    "user_location": "Simi Valley, CA", 
    "user_name": "Melissa R.", 
    "review_text": "This place is phenomenal!! Great sushi, really fresh and tasty. And just an overall fun way to eat some sushi! Definitely will be coming back. Very attentive service as well.", 
    "review_date": "2014-04-07"
  }, 
  "9L5RsVYJoLN2G0ZpWQiB9A": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "James S.", 
    "review_text": "Decent place but nothing to write home about. Conveyer belt sushi is the Japanese equivalent of McDonald's fast food. You can get seated fast. And your food is there waiting for you. The fish is reasonable fresh, decent cuts, and moderately priced. Great choice if you are looking for some quick decent sushi.  I would suggest going during peek times, otherwise your fish has done the conveyer belt grand prix for a while.", 
    "review_date": "2014-10-19"
  }, 
  "8IJIrWnGYJkKkWCuWX_nZQ": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Clémentine C.", 
    "review_text": "Great sushi bar in Japantown. Lots of dishes on the bar and also made to order. Reasonable prices. No matcha at your seats though, you need to ask for the tea. The place is nice but atmosphere could be better.", 
    "review_date": "2014-04-26"
  }, 
  "AuMi3T1rkHZ5i9rOAx-ZZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie F.", 
    "review_text": "Visited with the boy last night, and was quite pleasantly surprised!  Conveyor sushi gets a bad rap, but this place was awesome.  The hosts/waitresses were very friendly and service was prompt - the sushi chefs were chatting and joking with the customers, and it was easy to get their attention if you wanted something but didn't see it out.  Also, the Toro special for $6 was a nice highlight - obviously not the most amazing toro I've ever had, but fantastic for the price.  Some item prices that I remember are below, overall I thought it was reasonably priced.  Ama ebi - $6 Sake - $4.5 Hamachi - $4.5 Toro - $6 (special, it's usually $12) Uni Tray - $10  Kappa Maki - $3  Definitely coming back!", 
    "review_date": "2013-09-05"
  }, 
  "cdqGDAFGHROSlCOVrzxORA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Maria G.", 
    "review_text": "I would venture to say that this might be the best sushi place I've ever been to. Normally, while I like the fun aspect of sushi boat / conveyor belt like experiences, I never expect the actual sushi to be of high quality. So, I was more than happy to be wrong in my expectations of this place.   Not only was this a fun experience, being able to sit at the bar and seeing all the rolls and fish being prepared, but the sushi was delicious! We kept asking one of the sushi chefs to just hand us what was being prepared so we wouldn't have to fight the other patrons for the dishes or wait for them to come around! We had everything from blue shrimp, to mackarel (any self respecting Russian's sushi-go-to, except this had the caviar, which made it extra good), delicious tuna, salmon, yellow tail with cod liver, scallops which melted in my mouth... did I mention the mackarel? Also, the sashimi pieces were absolutely thicker than I'd ever seen (and again, delicious).  I don't think I can rave enough about this place! It was absolutely wonderful and I can't wait to come back!", 
    "review_date": "2014-03-02"
  }, 
  "nwKsR5_epCypSzGPsMn0HA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liza T.", 
    "review_text": "It was 8:30pm on Saturday and obviously packed everywhere.  We went to three restaurants and the wait was crazy and we ended up here.  Since this is a newly sushi boat restaurant, we just give it a try.    The restaurant was full but luckily we only waited for 5 minutes to get two seats.  Everyone was very friendly and welcome.   The quality of the fish was not too bad and the price range was reasonable.  However the selection of the dishes was not enough.    Overall, not too bad if you want something quick and easy.", 
    "review_date": "2013-10-07"
  }, 
  "Vf3DJncooLUHWYele0Cxrw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "So, the strife in Japantown is a lack of amazing sushi.  It's something you're gonna have to deal with.  Tenroku is actually some of the better sushi to be found.  It's the conveyor belt sort of thing, so spend the time to look at the belt and what's coming out fresh.  The sushi was quite nice and the service was fast as expected.  But ya, unless its a sushi emergency, go elsewhere in the city...if you're in Jtown looking for a quick bite, this place serves well.", 
    "review_date": "2014-08-10"
  }, 
  "Hm9YsNDE22lvsHnjZyS7IA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "uncle m.", 
    "review_text": "I have been going to Isobune for years and I have seen their quality dropped but their customer service is still good. So I gave this place a try, I like the waiting time  because only 10 mins and we got our seat for 4 and Isobune will take more then 30 minutes. Let's talk about the things I don't like, 1. The sushi rice is hard, fish quality is not good (can't have high expectations sine the highest cost is $6 per plate).  2. Chinese Sushi chef with eye glasses talks perverted and insulting jokes regarding woman's private with his chinese customers (friends). 3. Customer service F-, only one waitress have a smile and it's not the one with the uniform. They don't seem to understand that their job is to served their customers,  to get things for them. 4. To top it off, they suggested 18% 20% and 25% tips, I mean omfg. You have to EARN IT.  It was my first time there and definity will be my last.  We had udon afterwards at mifune.  anyway,  I still wish you guys success but you guys need a lot of work. From the top down.", 
    "review_date": "2014-05-24"
  }, 
  "Up3qUrEXSoh8YUQ5QqXdWA": {
    "user_rating": 5.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Marlon T.", 
    "review_text": "Amazingly fresh and quality is superb.  Prices are fair.  Will definitely come back soon.", 
    "review_date": "2014-01-18"
  }, 
  "18u-QBE1EMGMCmFDFGIdCQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Eddy L.", 
    "review_text": "Was our second choice after we all rushed to Sushi Zone to get in line and saw a posted paper towel in Sushi Zone window that said, 'Sorry Closed Today\"!!!  I went with two Japanese food aficianados who have lived in Japan and are sushi snobs! Me, if it doesn't smell, I don't get sick from it, tastes fresh, salmon sashimi is salmon sashimi is unagi etc.  It's in Japantown, a fairly small place. It's bar seating with chefs in the middle and everything is in cafeteria bowls which threw me for cheap. The food was good, no complaints. Everything was fresh and it's the day after and I didn't get sick ;-) The prices were above average. I paid a bit more than I expected but no problem because of great staff  The fourth star is for service. The hostess and waitress passed by repeatedly offering tea and water. Both were also friendly, smiled, one even joked with me! The chef offered suggestions, made what we asked and lots of smiles. From reading my reviews, you can tell it means a lot. Listen, I make great food, have friends who bake and cook great food and on occasion will pay A LOT of money for great food and always great service even if food was just good will bring me back and have me raving to others.  I highly recommend, it's a great place!", 
    "review_date": "2013-09-06"
  }, 
  "IL7Me1a3EGyJ7hbuCxQIhg": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Steve T.", 
    "review_text": "This place is incredible.  The service is so friendly and the food is great for the price.  I have to say if I am ever in San Francisco again I will be traveling here even if it's out of the way.  So worth it.", 
    "review_date": "2013-12-04"
  }, 
  "WNIPX_y4JtIaEEWf8aR2DQ": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Denny C.", 
    "review_text": "Tenroku Sushi is a new addition to the Japantown Center Mall in San Francisco. As you can see from the pictures, it's a conveyor style sushi joint. Some my be put off by this style of sushi restaurant but I decided it was worth a try and here are the main points I came away with:  1. Value was solid, the sushi quality was average to above average for a non-fancy sushi restaurant. 2. The staff was very attentive and nice. The restaurant itself was well lit and clean. 3. Service was quick, as expected with this type of sushi restaurant.  One thing I didn't like was the temperature of some of the sushi. You definitely don't want warm sushi (unless it's something cooked) but a few pieces of sushi served were too cold, almost as if it was pulled straight from a fridge that was set on max.  Last note: One the night I went, Tenroku was running a special on Blue Fin Toro sushi for $6.00 for two pieces. The quality of the Toro was surprisingly good for the price and well worth a try.", 
    "review_date": "2013-08-27"
  }, 
  "mJwQn-GirsfrAQlxvYWqyg": {
    "user_rating": 2.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "A K.", 
    "review_text": "Service was better than the actual sushi.", 
    "review_date": "2013-11-18"
  }, 
  "BeVehxvlhW1x4g-Qk2I7Lw": {
    "user_rating": 3.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Vidya K.", 
    "review_text": "This is the first conveyor belt sushi place I had ever been to. I was in total awe when I first sat down and I just wanted to grab everything that was conveying in front of me!  I grabbed a plate of the pickled cucumbers before my boyfriend could add his two cents and started eating them immediately. I thought they were delicious but my bf told me that most of the food on the belt was probably old and not fresh. Since we're dealing with raw fish, I decided to order off the menu to ensure total freshness.   We had the Alaska roll, the spicy tuna roll, and the dragon roll cuz fb wanted shrimp tempura. All three were pretty good. Id say the Dragon was the best one, then Alaska and spicy tuna. Tenroku also serves free hot tea.   I'm giving this place a 3 star rather than 4 because the food on the belt did not look the freshest. The edamame looked very dry and the raw fish in the conveyor rolls were not kept cold at all. The oysters weren't on ice. I'd be scared to eat any of it.   Food wasn't bad but I probably wouldn't come here again.", 
    "review_date": "2014-02-21"
  }, 
  "Xmx_ngtubPHUXt3Oy71jGA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott B.", 
    "review_text": "Went there today with my wife and had a horrible experience.     Food: F  most of the food on the rotating conveyor is old and hasn't been changed out for a while.  A few plates came off after about 15 minutes, but we're talking 4 - 5 plates.  So you're just stuck sitting there watching the same food.  To make matters worse, the waitress snuck up on me and took my menu without asking, so I had to ask for it back so that I could actually order something I wanted.  Service: D-  They only get a D because the sushi chef Migel is a really nice guy.  The rest of the staff are completely untrained in customer service.  The \"waitresses\" continuously circle the area behind you, over and over and over like pesky flies.  I mean thanks for taking the plastic off my plate, but I think letting it sit there for more than 30 seconds is OK.  The owner was also very gruff and rude to us as well (you'll see the other post left by my wife).  You can see that her stiff and unaccommodating attitude really trickles down to her staff.  It's pretty pathetic.  Experience:  F  With so many other great options in Japantown, why would anyone come here?  It's like playing Russian roulette with old fish.  Who will be the sucker that is so hungry from waiting for a decent dish that he picks up the old stinky fish aging under the lights.    It's undeniable... stick your head in the door.  It SMELLS!  Fresh fish doesn't smell, OK?  So there's clearly something wrong.  Tight quarters (barely space to squeeze behind customers), creepy service, crummy food and terrible management.    JUST DO YOURSELF A FAVOR AND LISTEN TO YOUR NOSE.  THIS PLACE DOESN'T PASS THE SMELL TEST!", 
    "review_date": "2014-05-26"
  }, 
  "sXKmP90GCdF0oM0AzYRhaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rika P.", 
    "review_text": "Sure, I've learned that this place is run by Chinese, but so what? This is San Francisco, after all, not Japan. The few bad reviews don't serve justice, so I'm here to give them an honest, good review.   As a starter, I like it.  IMO, Tenroku is pleasant, clean and really offers a lot compared to their older rival, Isobune. Perhaps they are still new, but their service is great and staff is super friendly. The active sushi guys pay attention to you and make sure you have what you need. They have a good deal of o-toro nigiri for $6. Tastes succulent.   Sure, people complain that their prices are a little high, but which restaurant in Japan Town aren't? If you need cheap food, go to Nijiya for a slab of fresh fish and make your own sushi at home. That will save some bucks.", 
    "review_date": "2013-08-14"
  }, 
  "cqf8dqO5_QUxjfo6WiM7yg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adena B.", 
    "review_text": "We were in the area, so we figured sushi in Japantown would be a great idea. I don't know why I thought this; the ramen I'd had downstairs a few weeks ago was vile. What made me think the sushi nearby would be better?  I don't know. It was the contact high I got coming out of Kinokuniya. That bookstore always makes me so damned happy, and I'm gonna blame it.  Tenroku has minimal table seating and predominately caters to sushi-boat lovers. We sat down and ordered an Asahi for two and received some hot green tea to boot. I think I sat there and watched the belt loop around two or three times before slumping in my chair with the questionable \"rainbow\"-looking roll. With three pieces (priced at $4), I ate the California roll draped with a meager piece of salmon. I could've done without the mayo explosion (in the California roll), so I asked the sushi chef for a simple sake nigiri (salmon on rice). That was just fine. None of the silky creaminess that salmon usually has.  Look, I know I'm being incredibly nit-picky here, but once you get used to excellent sushi (which San Francisco totally has), everything else is just... sigh, not as great. Service was just fine, but because of the lack of food quality, I don't see myself revisiting Tenroku anytime soon.", 
    "review_date": "2014-11-25"
  }, 
  "lX-K8xGy_NhmFAyuxVbtlw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Renee S.", 
    "review_text": "Such a great place to have pick your own sushi. Chefs are soo friendly and sushi is really good quality.   Great experience!", 
    "review_date": "2013-08-31"
  }, 
  "-fVK7Otn6ctuR6mrQGHmvw": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Sandra R.", 
    "review_text": "I love the sushi boat concept. Random small plates that you just grab as it comes by. Make sure you grab it when you see it because it may not come around again...   This is one of at least two sushi boats in the Japantown mall. I hadn't been to this one before and since this weekend was all about new experiences, it was a must.  All the plates have a clear dome covering it. I like that. We came in when it was still busy. Earlier it was more busy so we came back at a good time. Still people were in and out as long as we were there, so everything was very fresh. The uni was there the entire time... not everyone's fav apparently :)  The prices aren't bad. $1.00 - $10.00 plates. Average seemed to be ~$5 give or take. Depends on what you want and like. There were nice big chunks of sashimi and the rolls were usually 3 pieces. I don't like asking for specific rolls and this place certainly didn't disappoint by having a good variety. Depending on where you sit, you can watch the chefs make the rolls and then request some of that because it looks so good. They pass it to you with a smile.  Sushi and large beers makes us happy and full.  I'll definitely come back here.", 
    "review_date": "2015-02-02"
  }, 
  "e_h4BWb73vJS6j2Ontdi9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yumi K.", 
    "review_text": "Really friendly chef :) and decent price for sushi boat. (But chicken karage was so tiny... prob worse than pop corn chicken )", 
    "review_date": "2014-02-14"
  }, 
  "OsqgcEy5IFZPNBByK-gB_w": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Deb L.", 
    "review_text": "This is a Chinese operated Japanese sushi boat resto.   The fishes were that fresh and not that exciting at all.  Ordered a chicken karage, but taste more like popcorn chicken from Quiekly!", 
    "review_date": "2014-01-06"
  }, 
  "b2Xhc8t3rZPOucE2egJ-Vg": {
    "user_rating": 4.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Aubrie D.", 
    "review_text": "Friendliest staff ever! And so attentive.   Good prices. Good sushi. BEAUTIFUL plating and presentation.   They could do with a few more types of sushi on the boat but I know they just opened so maybe they haven't quite gotten into the groove of keeping up with demand yet?   I would definitely eat here again.", 
    "review_date": "2013-08-06"
  }, 
  "aqxlPQblnJlvXAOC-VdY5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy S.", 
    "review_text": "I am very impressed with this restaurant! The experience was very pleasant and all the food we ordered was delicious and exceptionally prepared. I have eaten at many of the restaurants in Japan Town and this new restaurant pleasantly surprised me.", 
    "review_date": "2013-07-30"
  }, 
  "NgX6wFfGP8i8QZZwIZhZbw": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Angela M.", 
    "review_text": "Attempted the ramen festival on Sunday only to find myself laughing derisively as I stared at hundreds of people standing in line for an $8 bowl of ramen and realized I wasn't going to walk away with a single noodle. Since I was in Japantown, I asked my guy if we should just attempt to get some ramen from one of the restaurants in the Kintetsu Mall, to which he whole-heartedly agreed.  Our usual place is Katsu, but since it's closed for remodeling we decided to stop by Tenroku as we passed by, intrigued by the sushi conveyor. As we plucked our sushi from the belt when we saw things that looked appetizing, we perused the menu and decided on the ramen we wanted; however, apparently they were out of ramen (and something tells me it probably wasn't coincidental...), so we got udon noodles in our soups instead, which was still very good. Oddly, though we both ordered tonkotsu ramen we got chicken katsu instead, but the chicken was very good and the broth was very rich and flavorful. The portions were very generous as well, so much so that we couldn't finish our ramen after having the sushi as well.  All of the various rolls we enjoyed were fresh and extremely tasty, and it was cool sitting and watching the sushi chefs make the sushi in front of you and then plate it up to put on the conveyor. This is a fun place to come with friends or that special someone because of the atmosphere sitting at the sushi bar and having fun deciding which sushi you want and not always knowing what's in front of you.   Great restaurant in Japantown, and very friendly staff as well. Prices are pretty reasonable here, too.", 
    "review_date": "2014-07-22"
  }, 
  "JUvtlLAPfsaPOT3RshIZIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keromi K.", 
    "review_text": "This place is way better than Isobune. The fish is fresh, the lighting is bright and the service is great. They also have some fun rolls that I have never heard of before. Will definitely come back.", 
    "review_date": "2013-10-28"
  }, 
  "DS0Idr2XDhz5e7ZfSy0dYA": {
    "user_rating": 3.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Ken K.", 
    "review_text": "Kaitenzushi 回転寿司!  For some reason, Charlie Chaplin's classic \"Modern Times\" scene comes to mind  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DDfGs2Y5WJ14%26feature%3Dkp&amp;s=385e6e432ca3149f1623f9047829ecb88edf254783ac12d906da7788fe426785\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=DfGs…</a>  and let's not forget \"eating machine\"  <a href=\"/redir?url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dn_1apYo6-Ow&amp;s=4e82b79012ac07942ead3b8481e7bd749bd4f964000e0704cc6f3c83f33cbb99\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=n_1a…</a>  It is a pretty big deal when a food icon from Japantown disappeared...and that would be the fixture known as \"Maki\" which won the hearts of everyone except the FOBenese types. High end \"bento\" jewel box like square shaped arrangements...little portions for a pretty high price...and this was before the high tech hipsters with option$ rolled in. Maki wasn't that great to be honest...but compared to what we have now, some of us probably wished it never went away. I'm sure it is like Hong Kongers wishing the British would re-colonize Hong Kong again, and feel like a real ass democracy for once, instead of a makeshift puppet put in by Beijing. So much for high tea, cricket, rugby, milk tea, Britpop, soccer under a sea of redness.  The owner of Sushi Raw saw an obvious opportunity here for the space, and rightfully so...converted whatever small restaurant space into a conveyor belt operation. And business is brisk to say the least.  I would have to agree, Tenroku is a lot better than Isobune. And compared to other Peninsula options for sushi boat/moat/conveyor belts, far superior.  Tenroku easily appeals to the Cantonese speaking expat Chinese community. Good portions, a large wide variety, and even a few classics are well represented here. But you also have The Weird, The Whack, and The Freaks on display.  Salmon - when all else fails, hard to go wrong with this. Hong Konger run of the mill types see this as the definitive fish for sushi, and somehow, salmon sashimi = Japanese cuisine in their eyes. So if you are running a serious sushi belt or boat business and you do not have salmon, may the Chinese lords have mercy on you.  Anago - Can I just pay homage to Sir Mixx A Lot, \"I Like Big Cuts and I Cannot Lie\". For a sushi boat moat belt shop, the anago here is very decent. Of course please do not compare it with the greats in town who go through the painstaking process of preparing it and also pairing it with a molasses like consistency brush sauce/nikiri.  Saba - Nice big cuts. Not bad. At least safer than some of the dubious options  Crab - dry and not flavorful. Skip  Tempura jive ass roll - when you are hungry and other options are looking a little freaky and weird. Too bad it's room temp/cold  Lobster salad - unfortunately this was not good, surprisingly. Too mushy in texture. Please skip this and you will thank me later.  Now the weird  I've seen a few entire trays of sea urchin on these black rectangular plates doing the rounds. The one during my visit looked pretty sad....maybe 1/3 of it looked a tad too oxidized.... nobody touched it. I first thought these were the $2 plates, but those are black and round. So who knows how much they cost. I guess even the HK FOB types know what's going on...   There is some sort of crab or shrimp or lobster salad stuffed cucumber roll. But damn, it looks like some Cantonese prep of loofah/silky melon stuffed with shrimp paste and steamed....  Kimchi cucumber mini slices? Really?!  And many many other jive asssssss rolls.  If you navigate carefully in here, you will probably avoid the sha boo boo. :-o", 
    "review_date": "2014-07-12"
  }, 
  "vXVNTEK9SK4_fAheyEUDIw": {
    "user_rating": 2.0, 
    "user_location": "Boston, MA", 
    "user_name": "Anna F.", 
    "review_text": "Meh. pretty mediocre. Quick and friendly service but the best sushi or the best price. Rolls weren't particularly inventive. Also, very cramped- though clean and bright.  Isobune in the same building is a better bet.", 
    "review_date": "2013-11-30"
  }, 
  "qg7Zb1rg_sDdPS6_1lDhaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dr r.", 
    "review_text": "This place is terrific and definitely the best \"sushi boat\" experience I've had outside of Tokyo!   Here are something things to keep in mind:  1) Quality The quality here is good. It is not the level of quality you'll get paying $50 for a 10-piece omakase but I'd be hard pressed for pay the prices Tenroku charges and get better quality elsewhere. When there are lots of people the chefs are always putting fresh sushi on the conveyor belt so things are less likely to sit at busy times.   2) Cost We had mostly plates that ran $3-$4 each (for 2 pieces) except for the amazing scallon nigiri which was $5.50. For two people a dinner with a nice hot sake and enough sushi to really fill you up will probably run $60-70 for two... For the quality the prices are fair or even below market!   3) Environment This place is much nicer (more airy and more clean) than the other sushi boat place in the Japan center (Isobune). Importantly you don't feel like you're sitting low reaching up to the sushi boats. At Tenroku the sushi passes right at hand level - to keep this hygienic they use clear plastic lids on the plates. Would be more \"Hirojuku style\" without them but I'm glad for the cleanliness.  4) Service -- the waitresses and chefs are all super friendly and nice.   5) Reservations -- not sure if you can but try to get them or come at slightly off hours because the secret is out about this place.  All in all awesome place and I look forward to going back soon!", 
    "review_date": "2014-01-27"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "When I first heard that a kaiten zushi joint had (finally) opened up in SF, I knew I had to come here to check things out.  Although I'd like to say I'm not sure why, I actually know exactly why - I can be a sucker for gimmicks.  So, despite already knowing what to expect of the food (mediocre, at best), I still had to experience Tenroku for myself!  If you're not familiar with kaiten zushi joints, they're essentially the same as sushi boat restaurants, but with a conveyor belt instead of boats.  Thus, if you've been to a sushi boat restaurant, you've essentially been here as well (did I mention I can be a sucker for gimmicks?).  However, compared against Isobune (Japantown's sushi boat joint), Tenroku ranks a little better.  Prices between the two are pretty comparable and while the variety at both is decent enough (if you want something that's not already circulating, you can order from one of the \"chefs\"), I really like how the dishes at Tenroku are covered as they circle around.  Though I'm not nearly as neurotic as Monica on Friends about cleanliness, I certainly appreciate how it lessens the chances of potential for flies landing on the food or people breathing/coughing/sneezing on it.  As far as quality goes, it's fine as long as you don't have high expectations.  Rolls are no better or worse than your average, Chinese owned sushi joint, but sashimi can be hit or miss.  The sake/salmon sashimi I grabbed was decent, but the hamachi nigiri had an odd color and not a lot of flavor.  Either way, it might be best to order sashimi from the \"chef\" instead so it's a little fresher (who knows how long they circle sometimes).  Although service here is pretty good, places like this simply can't compete with more traditional restaurants if you're looking for some legitimate sushi/sashimi.  However, if you're looking to try a kaiten zushi/sushi boat joint, Tenroku isn't a bad bet and better (for the most part) than nearby Isobune.", 
    "review_date": "2014-09-28"
  }, 
  "5TY_Nb_e5criDA0yfhW6TQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William M.", 
    "review_text": "A new place in the J Town mall, on the west end, second floor, across from the book store. Friendly welcome, not crowded and pretty small. Sushi plates on metal conveyor belt, great variety, all very fresh. Oysters perfect, Cali roll yummy, and such clever rolls on offer. Add a nice beer or sake and dig in. Very helpful staff, friendly chefs. Yay!  Enjoy!", 
    "review_date": "2013-08-26"
  }, 
  "-i_3GRYNwGBilQyG15jrhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grizabella L.", 
    "review_text": "The place rocks overall. One time I got a really weird uni but after that are all good", 
    "review_date": "2014-11-01"
  }, 
  "3uPAF2-YwiTUN5NvVH6pIQ": {
    "user_rating": 3.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Kay T.", 
    "review_text": "I say this place is ok to me. The sushi was not bad and it's moderately priced for where it is located. There's also another place in the building that has conveyor belt sushi. However, my friends say this place is better.  I had this roll which I do not know the name. It had eel sauce, mayonaise, fish eggs, avocado, the whole shabang! It was delicious. :) I took a picture of it.  Fish was fresh too!", 
    "review_date": "2014-08-17"
  }, 
  "-Kyl0Wy6Fpp37K-qDSbbNw": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Amy Y.", 
    "review_text": "The price is fair, and the food quality is surprisingly good. They have a wide variety of sushi to choose, and a lot of new style sushi. Not as bored as the normal rolls all the time in typical Japanese restaurant in California. Their service is better than I expected.", 
    "review_date": "2013-08-10"
  }, 
  "hl7Ye5-rlZCjvCB38aXb2g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess A.", 
    "review_text": "I'm going to start off by saying: Folks, manage your expectations.  If you're expecting mind-blowing Japanese food, I'd say pay for it and head over to Morimoto's in Napa or some other fancy joint.  But if you're looking for a solid lunch meal, stop by and give it a try.  The food was solid. I wasn't feeling very adventurous today so I had the chicken udon and an avocado roll; my folks did the revolving sushi bar and kept raving about the uni and ika that Miguel prepared for them.  I thought the chicken was well-done and the broth was delicious in my udon.   The servers were attentive and I always had a full mug of green tea.  The pricing was not bad for SF and the most expensive sushi bar option was a $6 plate NOT $10 as some reviewers have stated.  They also keep a separate menu for more complex rolls and other items like udon and bento boxes.  Overall, this place was clean, the sushi varied, and the staff friendly.  It's a small place, so be ready to brush shoulders if it's a full house.  Goodbye Isobune, hello Tenroku!   Tip: Arrive as soon as they open: the chefs make the sushi fresh in front of you and don't stop until the entire conveyor belt is full (regardless of whether the restaurant is full or not).  Also the chefs are much more obliged to make exactly what you want when the restaurant isn't too full.", 
    "review_date": "2015-01-04"
  }, 
  "T5KBc5QbwZ-Oj9ApE4vZJA": {
    "user_rating": 4.0, 
    "user_location": "Kansas City, KS", 
    "user_name": "Lisa R.", 
    "review_text": "Nice new place in Japan Center on 2nd floor of restaurant row/East mall.  Very friendly servers and chefs - hot tea complimentary and tea and water were constantly refilled.  I could not believe I ran into someone I knew who ended up sitting next to me at the bar - both of us in town from Nevada.  We saw Tenroku on the way to Sophie's Crepes, and it was a \"second dinner\" after Sushiritto.  I loved the blue fin tuna sashimi, which seemed like chu-toro fatty deliciousness and had 2 of those - but we also got o-toro nigiri for $6.  Eric R. liked the salmon.  We also got saba, whole scallop, and hamachi.  Average plate cost $3.50 - no uni because of the weather in SB.  The turnover is quick because it is an in and out joint and fresh sushi was put on the conveyor belt based on customer interest.  When I ordered something from the chef in front of me, he would make 3 additional plates of it and add it to the belt.  I do not quite understand the tables outside of the place in the mall because there is no kaiten experience there.  I would return!!!", 
    "review_date": "2013-10-06"
  }, 
  "eGR-wiuZ8D8Qlgs68vJDQw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ashley C.", 
    "review_text": "Great place for high-quality, great sushi, and wonderful service all at an affordable price! The sushi conveyor belt includes toro(fatty tuna) usually very expensive, but only 6.50 here! It's the best place to have sushi for a quick lunch. Also they half salmon belly, yellowtail belly, and all these great tasting things! It's like going to a fancy japan restaurant eating sushi :)", 
    "review_date": "2013-11-30"
  }, 
  "mFNPp84tN0RIIEJ9uwGWiw": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Ai L.", 
    "review_text": "yey for kaiten sushi! loved it! nice big cuts of sashimi, decent variety. didn't get sick after :) the ingredients taste fresh and fast turnarounds. limited seats around the sushibar which is just the way it should be.  i would definitely come back again when i'm in the area craving sushi. quick and easy.", 
    "review_date": "2014-12-04"
  }, 
  "phoMcYUbBJeAKUD0GE76GA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jade V.", 
    "review_text": "It is what it is. If it's rotating sushi, I don't expect it to be the tippity toppest quality. However, I do expect the be able to grab and eat from a decently varied selection as soon as I sit down. In that regard, Tenroku serves. I've gone in a few times during lunch, and there is always a decent variety of nigiri and crazy Americanized fusion rolls going around.  The quality is surprisingly for \"fast food\" sushi. The rice has a delicious, not too overpowering mirin (rice vinegar) flavor. I LOVE THE $10 for an uni boat deal. What a steal for a restaurant! The fish has always been acceptably fresh, although not anything to write home about. I usually go for simple nigiri rather than rolls, and here, they're quite good, especially considering you can get them on order here (service has been extremely fast for me), with a better-than-average price-to-quality ratio.  I do love the fact that this is one of the few (maybe only?) actual rotating sushi restaurants with a CONVEYOR BELT in the Bay Area. That is, not a boat. That's pretty legit, as far as Japanese sushi goes. While I'm reserving my judgment for Blue C Sushi to open, at the moment, Tenroku is the best rotating sushi restaurant I've been to in San Francisco.", 
    "review_date": "2014-05-20"
  }, 
  "fSzJO3tSVQ6DNx6jNf_fzA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Calvin W.", 
    "review_text": "If you're looking for conveyor belt sushi, Tenroku will do the job. Overall, it's nothing spectacular, but the salmon sashimi and sweet shrimp nigiri are very very tasty!", 
    "review_date": "2013-12-09"
  }, 
  "rFaA-V0DvvbyO2lMxSIiIg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan G.", 
    "review_text": "Sushi is decent for the price, which is reasonable, but the place is poorly run. I was just sitting down on one of their tall stools and as I am sitting one of the chefs calls to me and hands in my direction what appeared to be a long dish for soy sauce with gari. I lean forward to grab it from him, the stool tilts forward to the point that I start to lose my balance, and what looked like one dish was actually two and one of them got dropped during the handoff.  Meanwhile my natural reaction is to try to catch the dish, and my stool almost tips completely over in the process. Maybe wait until your customers are seated before precariously shoving things at them over an absurdly wide counter, or better yet, have the waitress or hostess place the sauce dishes down from the other side. And speaking of those waitresses, they frequently sneak up behind you and without saying anything (so that you know they are there) they reach right in front of your face while you are eating or talking to your companion, forcing you to dodge the dish covers that they are removing mere inches from your nose. Seriously - I realize that this is a quick service restaurant, and I've eaten in plenty of similar establishments in Tokyo, but the management of this place has really dropped the ball on training their staff.", 
    "review_date": "2014-10-03"
  }, 
  "vVYx4RXoQY8GXgIWGvTaqw": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Vicky Z.", 
    "review_text": "Went in around 5. The restaurant is very small and only two people were sitted in there. The staff is nice but the menu is very limited. Nothing special. I would not go again.", 
    "review_date": "2013-10-06"
  }, 
  "GsgC7B0U7blPoEAkjX4jzQ": {
    "user_rating": 2.0, 
    "user_location": "New York, NY", 
    "user_name": "Helen L.", 
    "review_text": "I'm paying the check right now and I had to give a bad rating because of the absolutely horrible service. The waitress completely ignored simple things like bringing us water and when she had no choice but to give us attention she gave us so much attitude it was amazing. This is the second time it's happened to us here at this restaurant. Unacceptable.", 
    "review_date": "2015-01-24"
  }, 
  "5wIrh0JHiHqeBwgm7K1FCQ": {
    "user_rating": 4.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Maria H.", 
    "review_text": "Solid conveyor belt sushi. I was surprised by the quality of the fishes that are offered here. The fried chicken (appetizer), scallop, toro, salmon, yellowtail and uni were all good. The only down side is that some of them were too cold when they're first put out on the conveyor belt... We had to wait for them to thaw a little  Prices ranged anywhere from $.99 to $10. Good hidden little gem in Japantown!", 
    "review_date": "2015-01-04"
  }, 
  "hCyGy0XVGF--OsoTP522ZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mi M.", 
    "review_text": "Mumsy and I came here in search of sushi on a Sunday lunch-hour. I know, I know, not the best time to go. Yelp to the rescue, so we chose this place as it has four stars. We both faltered when we saw the sushi boats (eek! sushi snobs do not like the boat thing) but thought screw it, we'll try it.  We were nicely surprised. We had a stack of plates - edamame, hamachi, which was fresh and buttery, the salmon, which was also fresh and butter, tender octopus, mackerel, and they made oshinko-maki roll just for Mumsy. The only thing she passed on was the ama-ebi which she eyed suspiciously.   Service was excellent and friendly, and the price was good - I would definitely come back if I needed a sushi fix on a Sunday. I'll give it a 3 and a half stars for the first time. :)", 
    "review_date": "2014-05-05"
  }, 
  "oyjcRNprmlNknl1VpyHBOA": {
    "user_rating": 2.0, 
    "user_location": "Buffalo Grove, IL", 
    "user_name": "Diana L.", 
    "review_text": "I didn't like the seafood udon and it gets one star for at least coming out hot. They really botched the soup and it was watery with a layer of oil on top. There was also a huge amount of vegetables compared to the actual seafood in there. The small piece of octopus had a poor, overcooked texture of a piece of rubber. It was hard to chew into and reminded me of a hardened wad of gum. The broccoli was insanely bitter and hard. I literally couldn't eat it because it tasted so foul. The same applied for the carrots floating around - they were sweet, but mostly bitter after sitting in the broth. As for the udon noodles, they were fine, but there wasn't that much in the bowl, so after a few slurps, there was mostly terrible broth left. I felt ripped off paying $10 for it. I might as well have gotten a vegetarian udon or use that money to get sushi.  That being said, I'll review the sushi since that's what Tenroku is all about: conveyor belt sushi. For conveyor belt sushi, it was alright, but I think it's a hit or miss. The prices are quite expensive and I could've bought full rolls for the more pricey plates between $5-7 which only offer 2-3 pieces of sushi. The cheaper plates will start at $3, but they contain the mediocre California roll pieces and inari sushi (rice wrapped in tofu skin). There wasn't any seaweed salad, gyoza, or other sushi pieces besides the old sashimi cuts and the same four rolls (salmon with lemon, eel, spicy crab, and crunchy shrimp). The point of conveyor belt sushi is to offer a variety and showcase sample plates at a cheap price, so Tenroku fails at that. The fish didn't seem too fresh for what I was paying either. They made too much of the same stuff and no one was taking the plates, which meant some of the fish that passed by, especially the sashimi, was heavily oxidized.  I came in and the place was empty besides a couple in the back corner. The waitress seemed to be a nice girl, but she was playing on her phone when I walked up to her, which screams, \"I don't want to be professional nor do I care.\" She also loved hanging out at the front desk area because after seating me and my partner in the back corner, I'd have to walk repeatedly to the front to ask her for a water refill. (Hey, I find it rude to yell across the room considering the center is a kitchen.) Miguel is a really nice chef though and if you ask, he'll make whatever you want. I suggest doing this because you're guaranteed a fresh roll rather than a stagnant roll which has seen better times. Overall, the meal cost $50 for two people, which was painful considering the food wasn't too good nor was anything about Tenroku impressive. I think Tenroku is meant to be a normal sit-down restaurant, but the conveyor belt is a tourist gimmick to help it stand out.", 
    "review_date": "2014-07-22"
  }, 
  "fOQvMmLa9LwjRaV1xuUGPA": {
    "user_rating": 3.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Margaret S.", 
    "review_text": "When you come at peak hours, the fish is really fresh. The cuts are really nice for the most part. Don't waste your money on the uni though. It's definitely not the kind of uni you're looking for. Uni should be sweet and taste like the sea and not..bitter.   Well, it's cheap. Hahah.   This place is not terrible and I really like that.", 
    "review_date": "2014-06-28"
  }, 
  "FOcbge2O5E3b_ARXQJwrmg": {
    "user_rating": 4.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Harvey T.", 
    "review_text": "This is a great go-to sushi restaurant, especially for those who don't want to spend lots of time waiting for the food. It is half self-served as you can either have your sushi from the belt or ask for a more specialized ones from the attentive sushi chefs. Ask for the seared salmon belly or hamachi special. Overall, it offers fine sushi considering the price.", 
    "review_date": "2014-11-13"
  }, 
  "BqAMAM9wkjUyOJzqYOHg5g": {
    "user_rating": 2.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Daphne L.", 
    "review_text": "Tenroku is okay for a quick bite, but there are so many options in J-town for a much better meal. Decided to try this conveyor belt sushi place since I was shopping in the area. Their sign saying $6 for O-toro is what drew me in.  I tried: - Gomae the flavour of the sauce was a bit watered down - O-toro the cut is too thick and I've had way better / fresher (at twice the price tho) - Grilled cod you can't go wrong with cod. This was lightly seasoned so the flavour of the fish stood out. - Amaebi it's not sweet amaebi that I'm used to.  Both the O-toro and amaebi were too big - I prefer the fish sliced thinner.  It seems the aim here is bigger portions for okay-ish quality. This is more for a beginner sushi diner looking for the novelty of conveyor belt sushi. Staff was very attentive and quick... they deserve a few stars for that.  2.5 stars", 
    "review_date": "2013-10-15"
  }, 
  "2tpijc4XAkYo2an0UnQrNA": {
    "user_rating": 5.0, 
    "user_location": "Novato, CA", 
    "user_name": "Orleana P.", 
    "review_text": "For my son's 16th Birthday we wandered thru JTown. We stopped for a quick snack for the first time. It was TOTALLY worth it. The staff is very enviting. The prices are VERY reasonable and the sushi is fantastic. There is limited seating, but it is fast food at a high quality and great value!", 
    "review_date": "2014-04-15"
  }, 
  "WyqYyLV9UxX6dM_y_rX_Kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elaine Y.", 
    "review_text": "Nice new little cozy restaurant, kinda modern, bright and clean with consistent cute little colored plates which are covered  I personally prefer my Japanese food prepared by Japanese chefs, nothing against those who trained to be Japanese Chefs.  Its just my preference. This place is prepared by Chinese people.  The food is good, cheaper than isobune and its nice to try some variations of sushi.   I liked the fish tartar, it had some caviar on top which made them very appealing. Must add soy, otherwise bland. The Toro and hamachi sashimi was very good and fresh.  Pieces were kinda big.  perfer thinner slices, more delicate and more coverage of wasabi n soy sauce when dipped. Definiitely good value for money. Really like the little box of uni, since rice really fills me up.  Should have ordered a spoon, to scoop up all the goodness without breaking it. Handrolls were freshly prepared upon request and are delivered in a little stand. The staff were good, very alert.  tea and water were automatically refilled.  Service with a smile and when we left, they said goodbyes.  Will return for a good value quick bite.", 
    "review_date": "2013-11-10"
  }, 
  "p4-tNsuQB6O11lp77KZKJg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "H K.", 
    "review_text": "To me, this is the wrong place to have conveyor-place sushi place with Isobune (the sushi boat place) located just down the hallway.  The prices here seem higher for comparable items with less selection and the sushi isn't any better.  However, I'll give them three stars just for the good service, especially with one of the young lady server who was there when I visited (which was Tuesday evening last week) being very sweet and cute.", 
    "review_date": "2013-08-14"
  }, 
  "Te18TxvzfLomGE56N7s3Dw": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Dean W.", 
    "review_text": "Probably one of the better sushi places in Japantown. We were hesitant to eat here because the prices were a bit too good to be true in some ways. A board of uni for $10? It was fresh and delicious. Toro for $6? Maybe not as fat as isobune, the other sushi boat place but it is pretty darn good. What I like about this place are there seared fish. There are seared walu with uni, seared hamachi with ankimo, and other fishes. All in all, I like this place and we plan on coming back.", 
    "review_date": "2013-11-10"
  }, 
  "42cV7o8hC6k62SB6ew7I4w": {
    "user_rating": 1.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Rinslet W.", 
    "review_text": "Came and was seated right away. The tea was extremely watered down. My friend and I looked at the sushi boats and we decided to give it a try based off of the reviews we read on Yelp. Nope nope nope. The one Ikura sushi had a texture that screamed not fresh. We decided to give them one chance and ordered the beef tataki. Approximately 15 minutes later we were sorely disappointed. For $20 we did not expect 8 measly thinly sliced beef slices that weren't even prepared properly. Real beef tataki is cold in the middle and quickly seared on both sides. Their beef tataki was just beef that had been sliced way too thin and basically a chewy raw, doused with ponzu sauce.   Sushi: NOT FRESH Price: OVERPRICED Verdict: Not coming back ever again. Save your money and go to Isobune!", 
    "review_date": "2013-11-13"
  }, 
  "MKYIbtzf2_gsnx21cYBfbw": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Mark D.", 
    "review_text": "This is kaiten sushi meaning you pick out what sushi you want from a conveyor belt.  Perfect for fast eaters. You can be in and out in under 15 min.  Sushi quality is so so.  Salmon - not fresh Scallop - decent Mackerel - decent Rolls - good", 
    "review_date": "2014-07-20"
  }, 
  "Kf8h4J70iR9usBq6AbnElw": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Edward T.", 
    "review_text": "Surprisingly the ramen caught my eye here. My friend ordered the beef ramen and when it came it was pretty big so we shared a bit. It was really freakin' good considering that it was a conveyor belt sushi restaurant. The broth was flavorful but light and did not over power the other ingredients which was how I think ramen should be. Try it you will be surprised. The interior was clean, elegant and simple giving a nice relaxing atmosphere to eat and chat. The food is pretty fresh for the price and all made very carefully giving a very nice presentation of the food. The staff was friendly, very helpful, and clean and the chefs were very nice, easy to talk to, and respectful. They were not pushy or gave any attitude to us even though we came in around an hour and a half before closing. Try it for yourself.", 
    "review_date": "2013-11-08"
  }, 
  "MvZIGHTkIjGFddXXTJONJA": {
    "user_rating": 1.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Joseph K.", 
    "review_text": "I feel bad for the owners of this restaurant but the concept was flawed from the start.  To do kaiten sushi right, you need volume and quick turnover. If you have the same crap going round and round getting stale this doesn't work.   The current model at Tenroku to do high priced, low volume sushi is the opposite of what kaiten was designed for. It's like trying to do Costco out of a 10x10 foot strip mall with high prices.  Predictably, the sushi tasted bad. No offense, but the owners need to rethink this model.  I'm sorry but all of the 4-5 star reviews of this place are sketchy. Also, the fact that some of the reviews come from elite yelpers makes me think the quality of Yelp reviews is getting pretty poor and really just about volume.  Very sad that I couldn't trust Yelp to steer me to a decent sushi place.", 
    "review_date": "2014-02-25"
  }, 
  "8k3aO-mPeyhbR5HUucA5aA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Victor G.", 
    "review_text": "Tenroku Sushi is conveyor belt delievered sushi. ambivalent about rating this tenroku.  small island of conveyer belt surrounded by a few tables.  eats: plates start at $2 -hamachi(4) fresh -sabe(3.5) fresh, kind of fishy tasting/smelling -albaocre(3.5) supposedly got the belly section, fresh, very smooth. sushi pretty good, rice kept falling apart. good fish portions.  temaki: -seating sucks, too tiny a space at turnaround- 2 stars -good value but ambience is terrible, tight seating. -nice peopled, all chinese though. -wouldn't come again, just come for the value, not the ambience.", 
    "review_date": "2013-10-10"
  }, 
  "TLzwLBhPoO33w85VOXz97g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobu K.", 
    "review_text": "My 1st review has been removed. Cherylynn N. San Francisco, CA Send me a Message says, \"No wonder it sucks! It's owned by Sushi Raw people!\" So, that means, 100% Chinese.  Yes, this is US, anything goes. Who cares? No one does. You don't have to know the real sushi to open sushi restaurant. America is second China. Who cares? But just in case, if you have an experience having a real sushi, I am very sure you won't come here.  I am not impressed for this new Kai-ten Sushi restaurant.  Compared to the other popular conveyor/boat sushi place in Japantown (Isobune) this is not that much upgrade.  It means both bad. Kobe Beef Nigiri? There is NO Real Kobe beef in US for your info. The specialty sushi on the menu are just a joke, yes, they are. I am very sure that they don't have well trained real sushi chef. Just remember the sushi menu is all jiveassroll only so, .....  Pro tip:  Not worth to wait.  Like many sushi boat/conveyor belt places it gets busy during peak meal times for people who doesn't really know what the real Sushi is. Oh God help us. I knew it, Disappointed very much.", 
    "review_date": "2013-08-12"
  }, 
  "X6Ft4Gh7fQIFyO1MTdrUwg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jeff O.", 
    "review_text": "Decent sushi place that run by chinese but in Japan town. This is SF and you need to expect that. Even the fishermen wharf crab vendors are all owned by Asians. It's setup as sushi boat inside. They have a couple of tables outside. It's not the place where you will take a large group.", 
    "review_date": "2014-12-04"
  }, 
  "fu7D4vwFko-pyMVI1W-Ycw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty W.", 
    "review_text": "This is the best conveyor belt sushi in SF! It is delicious -- super fresh, the staff is friendly, and the prices are great. Get the kobe beef -- it will melt in your mouth!", 
    "review_date": "2014-01-28"
  }, 
  "lDl5JBIxIZZWahib8zCIBg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geordie E.", 
    "review_text": "Ok I guess. But not coming back.  There are plenty of sources for sushi in SF that are much better.  The waitress' level made me take one star.", 
    "review_date": "2014-06-10"
  }, 
  "dusl6MaLSfYbE83_iVO2KQ": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Dawn H.", 
    "review_text": "I have never really been a fan of \"carousel\" sushi - can be a bit like playing Russian Roulette in my opinion, but the service was way better, the fish was much fresher, and the price was more affordable than ever expected. Tenroku Sushi is a fantastic place to stop in anytime to get a good, fast meal when in Japantown.   Conveniently located in one of the two indoor shopping buildings, the uber casual atmosphere of TS comes with some really nice unexpected touches. After choosing my seat at the bar, I was quickly greeted by a staff member and provided an oshibori (warm, damp cloth to wash with prior to eating, as is custom in Japan) and a steaming hot cup of soothing, complimentary Green Tea. Great first impression!  Then, decision making time. All of the sushi and various offerings pass by on small, different colored plates covered with a clear dome. The color of the plate represents how much that particular plate costs. You can also order directly from the sushi chef if you wish, but I found no need.   Tried basic Cali Roll, Fried Shrimp Heads, Marinated Cucumber with Fish Sauce, Shrimp Tempura, Tuna, a Combo of Asst Fish that included Salmon. All very good.    Overall: Tenroku Sushi is a wonderful place to take a short break from all of the Japantown fun and get a good, fast, light meal at an adorable price! Under $30 for two in San Francisco, and the hubby had a beer...wow! Recommend. Domo arigato!", 
    "review_date": "2015-01-23"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "I kinda really liked it - a conveyor belt sushi place. Wow. Toro was a steal at $6 (usually this would go for ~$15). Many of the rolls were tasty. Service was solid. I'd go back anytime.", 
    "review_date": "2014-06-06"
  }, 
  "1GOtJ3dMhM9Oh2schwwjFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivien S.", 
    "review_text": "Love this place. Extremely friendly chef and staff. I went in the evening after rush hour so the chef paid special attention to my needs. Highly recommend the kobe beef nigiri.", 
    "review_date": "2013-10-02"
  }, 
  "Rt-R_3ydkGEfjrmoOdWDcA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meiko S.", 
    "review_text": "THIS PLACE ONLY DESERVES \"MINUS\" STAR, NOT EVEN \"0\"!  IF YOU COME HERE WITH A BABY OR KIDS, BY ALL MEANS AVOID THIS PLACE!    WE GOT KICKED OUT IN THE MIDDLE OF A MEAL, JUST BECAUSE WE HAD A BABY AND A STROLLER BY THIS OLD, UGLY, RUDE WOMAN WHO MAYBE A MANAGER!  DO NOT COME HERE AT ALL!  SHE WON'T TREAT YOU WELL, AND WILLING TO KICK YOU OUT, AND QUESTION WHY YOU WANT TO TAKE THE LEFTOVER HOME AFTER YOU DECIDE TO LEAVE!   My husband and I arrived with our baby in the stroller, and got seated in the back by the usher/waitress.  I had been here before WITH THE BABY AND THE STROLLER and decided to come back with my husband.  In the middle of our meal, and we have ordered a lot, I needed to take our baby to change.  So I went out with the stroller with the baby in it.  Other customers did not mind at all as I walked out with the stroller, where they had to make space so I could get through.  Then when I went back, this OLD UGLY RUDE woman out of nowhere stopped me and told me that I have to leave the stroller outside because I would disrupt her customers, and she was being rude about it.  HELLO OLD DEPRESSED UGLY lady, WE ARE YOUR CUSTOMER TOO, AND IN THE MIDDLE OF EATING!  I told her where we were seating, and pointed where my husband was.  Then, I saw a table outside, so I told her we should move there and switch place, but then she said people are seating there.  I saw this couple, they just arrived and were about to be seated, they were not seating down!   What a bullshit!   Basically she kicked us out!  When we told her we were seated where we were seating, she told us the waitress was new.  BUT, this OLD UGLY RUDE woman only said \"sorry\" and didn't do anything else!  When we said we were leaving, she gladly and quickly gave us a check.  No comp, no effort to make us stay!  WHAT A BAD PERSON!  Then, when I told her to pack the leftover uni, she had the nerve to say \"you want this, only 2 left\".  WHAT A BIG B!  Of course we wanted to take all of the leftovers!    After we walked out, I went back in and really complained again, and told her how upsetting the whole situation was!  Again, only empty sorry, and no other things done!    I really wish SHE GOT TRAINED how to be a manager of a restaurant.  It is a hospitality industry, but she is way beyond hospitable!  SHE NEEDS TO BE SCHOOLED!    If your waitress made a mistake, then as a manager you should be able to rectify the situation, not make it worse!   It is a simple sitting arrangement for God's sake!   If this OLD UGLY RUDE PERSON IS ANTI BABIES, KIDS, STROLLERS, PLEASE ANNOUNCE THAT IN FRONT OF YOUR RESTAURANT!  SAVE US TIME, ENERGY, AND AGGRAVATION!  We did leave a tip tho we didn't have to, for the sushi chef (Miguel) and the waitresses.   I hope they will get the tip not this rude person.  You know, what goes around comes around!  YOU WILL GET YOUR KARMA!", 
    "review_date": "2014-05-26"
  }, 
  "LKcFo8BfF0EyrhP6wb5Uow": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Demanding T.", 
    "review_text": "Other place is much better.  Kinda pricey for what u get.   And please just greet people in English.. the pseudo Japanese is annoying.  The sushi chef is a nice guy.", 
    "review_date": "2013-08-13"
  }, 
  "C8MvZxXaVDBaYN6_hPRzDg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Steve L.", 
    "review_text": "Absolutely delicious food and they offer a wide variety of nigiri and sashimis. I would recommend this to anyone who loves sushi!", 
    "review_date": "2014-03-23"
  }, 
  "eGOVLDvQ_1Cc7oRqBhFZLA": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Esmeralda N.", 
    "review_text": "I have been in many sushi restaurants and had finally found the best sushi and service. Very good, nice decorated, tasty, amazing. LOVE SUSHI!!!!! BEST FOOD EVER!", 
    "review_date": "2013-10-18"
  }, 
  "Wez_YoTdzSxsBWPvx-leaA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie K.", 
    "review_text": "Tenroku is a spanking new conveyor belt sushi joint in Japan town. More specifically, it is inside the Japan Center building close to the bridge, next to Festa Karaoke and Bar.  The place is pretty tiny. There is a bar where the  main conveyor part is and a few tables (3~4) that seat bigger groups. The prices are moderately fair, ranging from $3 to $6. Just to give you an idea, Ikura sushi, Salmon sushi, and Tuna sushi were all on the $4.50 plate, which is really not bad. For a small person like me, it only took 4 plates to fill up which came out to be around $20. I'm sure a bigger man could spend at least $30.  The freshness of the fish was pretty good. Out of the things I had, I thought the salmon was pretty good. The rolls I tried were just soso, although I thought a roll wrapped with cucumber was pretty good.   I especially like conveyor belt sushi because you get to eat right away and you get to pick and choose what you want. All in all, I think this is a good addition to the plaza.  One thing - I think the rice in their sushi is packed too tight, making it kind of hard to eat. I don't want a mouthful of hard to break down rice, needing a glass of water to help it down.", 
    "review_date": "2013-07-27"
  }, 
  "mun8HtTyHk8RKpic5cbB8Q": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Ellie B.", 
    "review_text": "wowie wow! we got there on a monday and literally the first people there...it was DELICIOUS. the chef was generous and gave me a free sample for my birthday. he also warned us a party of about 6 that just walked in were going to be LOUD...that was really nice of him. fab place. the fish slices are VERY generous and top notch quality.", 
    "review_date": "2014-03-18"
  }, 
  "reX_wTZb4I6uWsUcmyj0QQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krish P.", 
    "review_text": "Not a huge fan of conveyor belt sushi places. It didn't seem like they had a way to tell when the sushi was put into the belt, which means a piece of sushi could have been there for a couple of hours.   With that said I ordered two rolls off the menu. It wasn't bad at all, and we got to see them make it right in front of us, though they were pulling out tupperware with fish in it, again not sure how fresh this is.", 
    "review_date": "2014-02-23"
  }, 
  "DKmUukETiMVidu548TE-zw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candice B.", 
    "review_text": "This is not the kind of sushi joint that you come after seeing Jiro Dreams of Sushi.  You don't sit timidly in front of the sushi chef hand select grains of rice one at a time, waiting for his mastery to unfold.  Tenroku has a sushi converyor belt: that should be the focus of your dining experience.   It's the perfect place to take your never-seen-sushi-run-in-a-circle child.  Besides the obvious draw of the moving feast, the food selection suits the little one as well.  He is not here to test the freshness of uni, elasticity of tuna.  I gave him a plate of octopus with tentacles sticking out and he is as happy as can be.    For the parent, the choices are good too.  My hotate nigiri and salmon nigiri were both good.  And a plate of edamame for $2 kept me busy while watching my son \"savor\" the Ramune soda, sip by sip.   Prices are really reasonable, so it's not like you are shelling out $200 for a meal where your son tells you the best part was the marble that can't come out of the soda bottle.  It was a little over $40 for us, which I am totally happy with.   The place fills up around 12:30, but that's also when sushi choices become a little more varied and exciting.  So your optimal arriving time is within a window of about 10 minutes.", 
    "review_date": "2014-12-31"
  }, 
  "bNnq3Z6sJzejPUMVs9fZ_A": {
    "user_rating": 2.0, 
    "user_location": "Inner Richmond, San Francisco, CA", 
    "user_name": "Saki N.", 
    "review_text": "If you want good sushi, don't come here. Plain and simple. The only reason why I gave this place two stars is because the chef was nice. And I was their only customer.", 
    "review_date": "2013-09-02"
  }, 
  "Zia61WCddJBqIc_Z5-7coA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather L.", 
    "review_text": "My friend and I came here only because the japanese pancake restaurant was still closed and we had to eat early to go to a movie screening. Boy, was it a mistake. The sushi rice was not sweet at all. I knew that it was not an authetic Japanese restaurant since the servers were speaking Chinese to each other. They have a moving sushi stand so you can grab what you want to eat. But it they put covers over the plates which makes it awkward when you are grabbing your sushi. There wasn't much of a variety so we ordered tempura. When it came out it was in a togo box. We did not order it to go. The server figured out that it was not for us but someone else dining in the restaurant. We later got our tempura which was okay. But the tempura sauce did not taste right. How can you get tempura sauce wrong? Doesn't it come in a bottle from the grocery store? I also did not like that they only have high seating chairs. Won't be bad. Disappointed.", 
    "review_date": "2013-10-25"
  }, 
  "yh97S1YBDIMZDEFN_xmwPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gianne S.", 
    "review_text": "This place is brand new and AMAZING! The sushi was very fresh and delicious, and the head sushi chef even made us a couple of personal dishes of his creation. The service was fantastic, and everyone was extremely friendly. All the food and drink was well-balanced and tasty. Truly.", 
    "review_date": "2013-07-24"
  }, 
  "TgtP6vCUDx-ChkLRXhb2rw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marco M.", 
    "review_text": "Very good place for a quick sushi fix. The Sushi is delivered via conveyor belt and is very fresh. Each plate is color coded and corresponds to their respective prices. There are about a couple dozen varieties of sushi that you can choose from; which were all very good. Service is very attentive and friendly.", 
    "review_date": "2014-01-12"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "I came in with no expectations. Kaiten zushi in San Francisco!? Usually a miss. Tenroku is definitely Cantonese pseu-shi. It is owned and run by the folks who do Sushi Raw.   For the sushi purists who read my reviews, this is not the place for you.   This is a good spot for those in betweeners or those nights where you want a mix.  Yes, there are jive a$$ rolls on the menu. Yes, they serve jive a$$ sushi. For example my favorite was this little plate with 3 pieces on it. It was half of a roll that was basically a California roll with seared albacore and jalapeno on top.  Definitely a step up from Isobune (which isn't saying much but hey..)  Still, the fish is fresh, cuts are nice, and the price is right.", 
    "review_date": "2013-10-07"
  }, 
  "c4F5TG9HvaWureSwMY81yQ": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Sam H.", 
    "review_text": "Delicious! Much better quality than Isobune. Great pieces and prices. Very good variety of maki and nigiri.", 
    "review_date": "2014-10-22"
  }, 
  "JfKm3X5QpZJlNb9Q2Cgh0w": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Be K.", 
    "review_text": "ahaha...I have to be careful with these sushi places!  They all look so good and the prices are pretty reasonable.  It was hard to get refills on drinks and there could be more variety to the sushi, but overall I really liked what I had, sushi was fresh, and thought the prices were good.", 
    "review_date": "2014-11-16"
  }, 
  "tH0vDLJKFovj1eT83MZuBQ": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ruby E.", 
    "review_text": "I've walked by this place so many times and can't believe this is the type of sushi place I've been looking for! I don't know why it's so difficult to find a sushi place with sushi boats!   The prices are very reasonable!! I had 2 plates of the spider roll (total of 8 pieces all together), I shared a place of edamame with my best friend, (I forgot what she had) but the total was less than $15! Not bad!   As for parking, I paid $4 for an hr and 6 mins! (Thanks a lot SFMTA) or you can park in the parking garage for $2/hr.", 
    "review_date": "2014-04-12"
  }, 
  "OtUzjE0tCWq4JmC4x4SHiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace T.", 
    "review_text": "Love the variety of sushi plus they have a full menu. Really fresh and high quality seafood.  Excellent and attentive service. Plus the conveyor belt kept my girls busy the whole time!", 
    "review_date": "2013-11-10"
  }, 
  "REGjppkq2IkDLRQVmRj_Bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin J.", 
    "review_text": "This place is new and it looked pretty packed so we thought we'd check it out.  I can't speak for the sushi but the staff was attentive and the soups are amazing! Maybe it was a cold day and maybe it was my stomach telling me it was time to eat but I would definitely come back.  Judging by the crowd I would say the feeling's mutual.", 
    "review_date": "2013-07-31"
  }, 
  "gbfYV-fY1OxpsoUxeX3l-g": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Davis C.", 
    "review_text": "Place was a little hard to find due to signage and numbers of suites not in numerical order. Decor was nice. Seating only around conveyor belt with rotating plates of sushi and other treats. Not ideal for groups of 4 or more as conversation would be tough.   Sushi was very fresh. We also split a huge bowl of chicken ramen which was delicious. Broth was great and noodles fresh.    Plates on conveyor belt range in price from $2-$6. Most come with 2-3 pieces of sushi.   Staff was very helpful and friendly. Sushi chefs were also nice, answered all our questions on what the different dishes were.   Plates quickly stack up so be careful!  Would def return", 
    "review_date": "2014-12-24"
  }, 
  "ZO2YyY3daJ8WkXYIizMJlA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Bobo N.", 
    "review_text": "Sashimi are fresh !!! Compare to their prices , they have pretty good choices of sushi/sashimi ! 4 stars to the quality of their foods . Customer service average I would say 4 stars as well . Will come back next time but better not on weekends !", 
    "review_date": "2015-01-30"
  }, 
  "tZQf2zpFALGjrPIEsnmGtQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison C.", 
    "review_text": "We come here fairly regularly. The sushi is fresh. The sushi chefs are friendly and accommodating, and the wait staff is good. It is also kid friendly. We bring our four year old here all the time and she loves it.", 
    "review_date": "2014-06-01"
  }, 
  "U12DgW9f49OmQ3zEc5iAhQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy L.", 
    "review_text": "I'm a huge fan of the quickness and selection of sushi here. I appreciate that it's pretty a authentic to a Japanese sushi bar (there are no absurd boats) but there are little lids, which I super appreciate. Best when there are a lot of people so nothing gets stale, but seriously, you can get a few really great pieces. Nothing exotic.  Only thing I wish is that I wish it were easier to flag down one of the sushi chefs to get a custom piece or two. Oh well.", 
    "review_date": "2014-04-26"
  }, 
  "VCNrMgiOjkb2C_5UyTBuxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa D.", 
    "review_text": "This is a conveyor belt sushi restaurant, but don't let that turn you off. The fish here is really fresh and the rolls are tasty. The prices are really reasonable too and the service is excellent. I've been here a couple of times and will be back for moe", 
    "review_date": "2015-01-06"
  }, 
  "LGbQMoYJSO0CW_-wR9J3tA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "K. D.", 
    "review_text": "one of the best places in town for sushi!", 
    "review_date": "2013-10-18"
  }, 
  "UVs_7nPjqK_W_ap96IClpA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam F.", 
    "review_text": "Eh it's okay... nothing special.  Kaiten sushi in Japantown is unfortunately just so-so, so you just take what you get. Tenroku is pretty tiny but we didn't have to wait for a seat which was great =) After we sat down the servers brought us warm towels for our hands and hot tea which was legit. Didn't even have to ask! After that we dove in and grabbed a few of our favorites: tuna, salmon, crunchy roll... The sushi going around wasn't too bad, but keep an eye out because some of them looked like they had been going around for quite a long time.  We also ordered the soft shelled crab which was a great choice. It was a big serving and it tasted delicious! My boyfriend and I definitely enjoyed that in addition to our sushi. In the end our bill was about $40 for mediocre sushi which seemed like a lot, so beware of how many plates you are taking!", 
    "review_date": "2014-06-30"
  }, 
  "rNkJe7G6xkh9dYCuTIuqXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hiroshi K.", 
    "review_text": "This kaitenzushi place is good. It uses a conveyer belt to distribute sushi to customers. The plates of sushi were coved with a transparent lid. The place seemed clean. There was wide selection of sushi. You can order anything from the menu, if you cannot find anything you want.   I ordered several items. The ankimo (monkfish liver) was good. The Hamachi was excellent. I really like the Santa Barbara uni. The blue mantis shrimp was good. I did not find anything I did not like. The place is a little expensive. It can get crowded.", 
    "review_date": "2014-10-13"
  }, 
  "TgaSWikmnCcGZTmmlPp_Tw": {
    "user_rating": 3.0, 
    "user_location": "La Jolla, CA", 
    "user_name": "Jenny W.", 
    "review_text": "Pricing: Good-Expensive. We split $20/person, which is about right for sushi. Quality: Good. We really should not have come in during a dead hour... Turnaround: Good-Excellent. Given that we were practically the only customers. Service: Good-Excellent. Since we were the only customers.  Like any Japanese sushi restaurant, the pricing is kind of expensive, but expected. Not to mention I get to play around with a sushi boat conveyor belt so the little kid inside of me is happy. Unfortunately, we came during an off hour around 2pm and we were the only customers minus a couple who came in just as we were finishing up. This meant that a lot of the sushi has been rolling around for quite a few rounds and we could see the discoloration, especially in the tuna. However, the salmon looked fresher and tasted fine. Not to mention that since we were the only customers, I was allowed to keep asking the chefs to make rolls just for us too so we did not have to eat the non-fresh ones on the belt. They were chopping up things like green onions, but happily obliged to make me unagi nigiri when asked. The woman who came to refill our tea often even personally brought out fresh unagi from the kitchen for us too.", 
    "review_date": "2015-01-02"
  }, 
  "Z2jU-Co5qVz4AOsSdZZhFQ": {
    "user_rating": 5.0, 
    "user_location": "Half Moon Bay, CA", 
    "user_name": "Amy A.", 
    "review_text": "Loved this place.  I had the best mini date with my husband here.  We were enjoying Japantown with my two big kids, newborn and my parents and we asked my parents if we could run off for 15 minutes.  We sat down, got some amazing stuff, paid and left.  I can't wait to go back when we have more time to eat everything there!", 
    "review_date": "2014-05-13"
  }, 
  "08mOpJRCpZe3D8UHszP4FA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Ann L.", 
    "review_text": "Tried out the pretty new Tenroku in SF J-Town.  It's a conveyor belt sushi bar kinda place with chairs all around the bar &amp; 1 table inside, some tables outside.  Got seated right away &amp; just picked the dishes we wanted &amp; we are eating!  There's face towels before you start.  Hot tea given.  Wasabi &amp; ginger given to you almost as soon as you are seated.  All Chinese workers - chefs &amp; wait staff.  Dishes we got.  No names given, so what I think they are:  ikura nigiri  Some fancy looking roll White tuna looking thing Uni nigiri Chopped up tuna looking thing Unagi hamachi w/ monkfish liver scallop nigiri fatty tuna looking nigiri another of the fancy looking roll  lids put aside and wait person will pick up.  Prices are by plates which you stack up: Blue $6 Yellow $3.5 Green $4 Purple $4.5 Red $5.5 Other plates from $3-$12  Our total before tip $48.40 for 2 ppl.  Charge it.", 
    "review_date": "2013-09-15"
  }, 
  "kBy2MAMpx9S4g-WV3gPsKg": {
    "user_rating": 5.0, 
    "user_location": "Lorain, OH", 
    "user_name": "Cori N.", 
    "review_text": "This is the best conveyor belt sushi I've ever had. Granted, I've only been to one of those kinds of places three times but this one was so much better than the other two, I really feel it merits five stars.   The belt was filled with different types of sushi and they all looked fresh and well made. The staff is also ultra friendly and attentive. My tea never got cold or ever dropped below half full. Also, the seats are farther apart from each other then the other places I've been. I didn't feel crammed in like a sardine while I was there. Though I think if you were an especially tall or wide person you might still have some issues during the ultra-busy times.   I had several orders of a shrimp tempura style role, a salmon roll with lemon and unagi (eel) here. All were amazing. The tempura one was fried but light, the salmon one tasted ultra fresh and almost had a palate cleansing effect, and the eel was perfect with no flabby or slimy parts to it.   If I had had more time in SF I would have gone here many more times. It was really great, and MUCH cheaper then the other converyer belt sushi places I've been to.", 
    "review_date": "2014-01-20"
  }, 
  "J6PEFayC3_DVPBAlQGIXeQ": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Paul K.", 
    "review_text": "Solidly mediocre. Servers were nice. Tamago was middle of the road, likely bought from elsewhere.   Fish didn't look so good, likely below average. Not terrible, but not worth eating. Especially since prices are comparable to Kabuto (my heaven). Yeah.   I wanted to like this place since the other kaitenzushi in Japantown is always packed. Now I know why.   Sorry, I have to speak honestly. They are trying but the standards are too low. I recommend they hire a sushi consultant. Kaiten doesn't have to equate with mediocre, and they need some expert guidance to make some changes. I think they can get there, if they have the desire.", 
    "review_date": "2013-11-16"
  }, 
  "uxaEvgGGLSdxBjCiHzgndg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas C.", 
    "review_text": "Really liked this place for the sushi. Comes on a belt COVERED. Reminded me of some of the places in hong kong. Chef was Mexican offered me fresh toro - its was like butter. So good.   I think this place is better than the geary st sushi on belt but not as good as isobune. Given the price, this place is in the middle. I will definitely come back. I hope they will open till 10pm in the future and not 9.30.", 
    "review_date": "2014-02-22"
  }, 
  "eJ4RRrwVKj7Kd2-1mJ_pBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott L.", 
    "review_text": "Love this place !  Much batter then regular Suchi boat restaurant i go. Nice unique rolls Fresh fish and CHEAP TORO ! Only 6$ for 2pc . This is lowest price I ever paid for toro  4 season and Mexican tools my favorite  Good service .. Good chef", 
    "review_date": "2013-10-18"
  }, 
  "REOF7DQ3hUW70WIqZDRXjQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "secilia c.", 
    "review_text": "This place is consistent. Yummy sushi at reasonable price. Sushi chefs behind the bar give great customer services, always polite!", 
    "review_date": "2014-08-23"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "The Eclipse roll is interesting and not bad, as was the Mexican Desert roll. However, every plate of sushi that sailed by (pardon the pun) looked unappetizing, which is why we went to the menu. Average tempura. Good service.", 
    "review_date": "2013-11-06"
  }, 
  "Hs2hx5ka4BIDMTnILg1bMg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "P T.", 
    "review_text": "I have to laugh reading other reviews. If you have tried enough Sushi restaurants, you will have a better sense of giving \"stars\".  I'm writing this review sitting inside the restaurant now.  I'm with my husband and my 10yr old daughter.  And it's 4:30pm on a Sunday afternoon.   Food &amp; Price: - Quality of food match their price. There's no free lunch or cheap lunch. You pay for what you get. Most plates are within the $3-$5 range.  You just can't compare to a place serves $5/piece of sushi.   - Freshness OK to GOOD, at least each plate has a cover to avoid drying and fish doesn't smell - Portions GOOD, they don't give you a huge rice ball with tiny fish slice. Both are reasonable size  - varieties GOOD,   Service: Nothing bad and just average.  The setting is not a sit down restaurant but sushi bar. They come around and serve tea, towel, clean up, appropriate service for this type of place. Sushi chefs are friendly and waitresses are ok too.  Overall, it's a good place with ok food and ok price.  Will come back next time we are in SF if we want a quick nite.", 
    "review_date": "2014-07-06"
  }, 
  "oZKlhSdrG91Fz0AopIBeVQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine L.", 
    "review_text": "First time came to this sushi boat restaurant! Prices are reasonable. Surprised there were not that many people today! We've been seated right away! Food is on average. Great environment! Minus two stars for service because my friend asked 3 times for hot water! My brother and my tea cup was empty for a long while, waitress did not pay any attention until we asked twice! There were not that many customers, therefore, I couldn't find her an excuse for it!!", 
    "review_date": "2015-01-31"
  }, 
  "4nyZEI1vAVWJ8QphaQukRA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Faust T.", 
    "review_text": "Haven't have conveyor belt sushi for a long time in SF since Tomo was close (Isobune sucks), saw this new place last week decided to give it a try this weekend and was not disappointed.  Service is excellent and the sushi chef is super friendly, price is a bit high but hey as we all know Japantown is a tourist trap so it is acceptable :D . We had 9 different plates and a tempura our bill came close to $50, fish is pretty fresh, but some of the sushi stay on the belt for a long time, like the Scallop sushi had been circling the belt the entire time we're there, so pay attention on what you pick, and lack of many of my favor like Kane (crab leg), Toro (fatty tuna) and Hokkigai (giant clam) which are often available in other sushi place.   No parking validation is a draw back, garage parking in Japantown is getting expensive lately :( but we did have a good time there, will likely to come back and hope they have more to offer in the future.", 
    "review_date": "2013-07-28"
  }, 
  "YKtgjkgmC6eaXyoscdakow": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Regina W.", 
    "review_text": "I always get weary about sushi boat type places as I've been to a couple of bad ones. I always see the same plates go by uneaten and with the occasional fly lingering around.  BF took me here just to look. I wanted to eat here right away since the fresh looking nigiri on the conveyor looked so yummy. Plus I love nigiri.  I got really excited and picked up two dishes right when we sat down. The fish on top of the rice was a good size. They took all of my requests from the menu because I didn't see them on the conveyor.   Service was prompt. They were so swift that I never noticed who came by each time and took the plastic lids. Also, in my opinion, the plastic lids kept the food clean.  I ate a lot. At times I had three plates in front of me. It's so easy to eat like a pig here. What I got...all nigiri.  *True Toro - That's what they called it. Soft and buttery and the marbling was nice. I ate three orders of this.  *Hotate - Pretty good. The scallops were a bit too cold though. I ate two orders of this.  *Albacore - Had some garlic on top and texture melted.  *Amaebi - Just okay. It was too cold and the kinda too bouncy in texture.  *Butterfish - Tried it and it's a pass for me. It was a bit rough.  *O-Toro - Not bad, although I liked the real tuna better.   Other things my bf got:  *California roll - Good...not much to say about a California roll.  *Tamago - Apparently super good since bf had like 5 plates of them.  *Salmon - Didn't try this.  I don't remember all of the things he ate since I was busy stuffing face. I shall come back. Too bad it's so far out of the way for me.", 
    "review_date": "2013-09-30"
  }, 
  "0nFJxhZ0cZ9K-GCsRQcYXg": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "j j.", 
    "review_text": "By far our fav low key regular sushi. Consistent, delicious, friendly. Plus the $10 uni tray deal. Cheap fast fun dinner. Always come out happy. Don't change anything", 
    "review_date": "2015-01-04"
  }, 
  "U4Mos3ZeuUkb9ekQO7fbnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick C.", 
    "review_text": "Your first question - I know it's coming so let's just get it over with - is how this place compares to Isobune, which I've visited 200+ times over the past 15 years. I asked myself that approximately every 15 seconds while having dinner at Tenroku last night.   I gave them both four stars, and I think they're very similar food quality-wise. You might even say they're kaitenical, and yes I do require an up vote if you got that.   I do like the atmosphere (the plating, the boat style, and just the general environment more) at Isobune. but this place didn't disappoint in the least.", 
    "review_date": "2014-04-12"
  }, 
  "xsIrsH98Vpf5v0ydv7gHkg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace L.", 
    "review_text": "I wouldn't come back to this place. 2 stars instead of 1 because the servers were nice. Three other friends and I came in here for a birthday lunch and we weren't impressed.  Seating is only around the conveyor belt. Everything was expensive- our bill came out to $90 and we weren't even full. I would say each of us had an average of 5 plates but every plate you reach for adds up quickly and unexpectedly in price. Each plate starts at $2.00 (for example, edamame) up to $10 (for example, a plate of uni). I wouldn't mind pricey sushi if the fish were fresh and delicious but they weren't. Overall, nothing spectacular here and I would never crave this place. Definitely experienced better.", 
    "review_date": "2014-01-11"
  }, 
  "rP1JhMcc7sZTzW3KzLpL9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jade T.", 
    "review_text": "This is a great spot for a quick sushi bite!  I personally don't have a gripe about japanese restaurants run by Chinese peeps, there are so many that it's hard to keep count. Heck, even the Japanese Tea Garden is filled with Chinese waitresses! That said, let's move onto the rest: - Good selection of fun american rolls as well as nigiri - Fish I've had has always been fresh  - Consistent service and food any day of the week - Friendly staff, tea constantly refilled without asking  It stacks pretty well against Isobune, which is only located on the other side of the bridge. The presentation is better, staff is nicer, seats aren't as crammed, and I prefer eating in a well-lit, clean environment with nice and clean floors. Prices aren't all that higher, so my preference has been to come to Tenroku instead. They have updated their price sheet to include a $2.5 black plate for tamago and edamame, as well as directions on what to do with all those lids.. please put them aside instead of back onto the conveyor belt (I think this comes after having too many pile-up accidents).  If you're trying to find it, it's across from the bookstore, right by the bridge, hard to miss!", 
    "review_date": "2013-09-28"
  }, 
  "TCim7E_XTZN6aahAsckbqg": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Enah N.", 
    "review_text": "tried this place for lunch..they are newly opened the service was not bad.they always check up on you and makes sure that you have everything you need. I wasnt so happy about the selection of the sushi well maybe because Im not a fan of sashimi's but it was ok.The price is reasonable unlike the other sushi boat in japantown lol", 
    "review_date": "2014-01-15"
  }, 
  "BdRMVROS1MXOHxr-bdZv0g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice Z.", 
    "review_text": "Definitely better than Isobune, the rotating boat place downstairs.  Price is good and place is clean(er).  Sushi isn't the freshest, but best for the price.  Come here if you are seeking value!  We only ordered 3 dishes from the conveyor:  1. Salmon avocado maki: good, decent 2. some sweet escargot/snail sushi. My caucasian boyfriend was curious. and described it as \"chewy\". I had to eat the rest of it -_- 3. Uni. I love uni. the coloring seemed a bit off but tasted great and a 2 huge pieces for $6  We ordered: - lobster tartare ($6. it wasn't entirely lobster - had roe and horseradish in it, but worth it) - sea bass steak ($12) - huge filet of seabass. also worth the money but had bones in it - chicken karaage ($6) - a bowl of fried chicken. delicious! - otoro, hamachi, and waru sashimi.  The waru was especially worthy it given the $3.5 price tag.  The otoro was decent, especially for $6.  Our total bill came out to $55 for 2.  Not bad for sushi and not bad for a total paleo meal!", 
    "review_date": "2014-09-13"
  }, 
  "D5uMny1pAVWhNGDvFDPp8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "DeathandFood b.", 
    "review_text": "I know conveyor/sushi boat is consisted quite gauche in some sushi loving circles but the 10 year old in me and the French Spouse loves the idea of endless options served immediately. Sadly what usually happens is you have low quality food or really basic rolls that are bland in taste.   Tenroku's sushi and maki are a step up in quality and taste than most kaiten places including Isobune just down the hall. Normally I would never get amiebi or uni at place like this but both were freshly made and of a good quality.  The space is smaller than most US kaiten places and they cover the plates which I like but some people might find annoying. Since it is a small place there probably wasn't as many dishes out but we never lacked in choices and the server was quick to take our order for anything that was out. The space is very clean and modern, there is one booth but the counter is bar height and not wheelchair accessible.  The prices range from 2-6 for most dishes which is actually lower than other places especially for the quality of the fish.  This is a place to taking the visiting mid-west relatives or get a quick bit before a movie at the Sundance theater.", 
    "review_date": "2014-04-10"
  }, 
  "h3yYR4rSvvNbrrTMCzSVrg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "R C.", 
    "review_text": "First time here. Tried this place because one of my friend don't eat raw fish but everyone else wanted sushi boat. Chinese owned. Everyone was speaking Cantonese. I liked the newly remodeled place. bright and clean (but maybe a little too bright). Little plastic covers over your sushi was a plus. We've been to places where we put sushi covers back on the conveyor belt. So my friend had placed her first cover back on the conveyor belt and happily continued on with our conversation. But then, we got cut off by the sushi man immediately. He removed it from the belt and asked her to leave it on her table next time; causing everyone to look at us like we're stupid. I understand each restaurant runs differently and we respect that. However, I wish they would have placed a sign or at least have the waitress instruct us on what to do with the plastic covers; instead of giving us the dirty look.   The fish there is okay. Some tasted fresh and some didn't. The uni and unagi is very good.  There was this one nigiri with seared white fish and ankimo on top; it tasted so bad i couldn't finish the rest. It did not taste like fish! Maybe because it was seared, it had a plastic taste to it. The fish tartar looked nice topped with caviar but the fish did not taste fresh. The green onions in it tasted as if it was chopped on an unwashed cut board, giving it an extra bit of unwanted flavor of ginger, garlic, and onions. The Tamago nigiri was a joke! Lots of fancy new sushi ideas. I usually like new ideas but some of these just did not tasted good. Just give me some \"real\" sushi please.  Overall, everything was ok. Most likely not returning. Sorry, but I rather go to Isobune...", 
    "review_date": "2013-12-14"
  }, 
  "qPJ5dUGFkdDrl2Kd0fvrlw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Osugradinca S.", 
    "review_text": "After a little shopping...decided to hit Japantown. All sushi and dishes ordered were great! Favorites were the ramen noodles and the deep fried squid legs. Angela was a very attentive and pleasant server! I look forward to returning!", 
    "review_date": "2013-11-30"
  }, 
  "IFJt9wsu9oKRSuVIhVMh2g": {
    "user_rating": 5.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Andrew D.", 
    "review_text": "Great sushi, great entrees, and great service! Mandy, Carmen,and the entire staff are very friendly and accommodating!", 
    "review_date": "2013-08-12"
  }, 
  "Bf87HcPERF9yiSjb2tQBqw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin S.", 
    "review_text": "Gah!   I saw all the four star reviews and thought, GREAT, fresh, well-made sushi.  Perfect quick nosh on a movie night with my Mr.  What I got was slightly clammy, untasty fish.  They seem to want to sell you fancy, over-amplified superrolls with cute names.  The table full of 20-somethings next to us had things on fire, things that smoked, and things with so many different kinds of stuff draped over them that they looked like some kind of science experiment gone bad.  Me, I just wanted some *real* sushi.  Some yellowtail, maybe a barbecued eel roll, some tekka maki, a kappa maki, sake nigiri.  All of the above were available (except the BBQ eel roll) but every one of them was overpriced and mediocre.  Clammy, not so fresh fish.  Tough nori on the rolls.  Doesn't anybody toast nori anymore?  The service was abrupt and dismissive and unfriendly.    IE.", 
    "review_date": "2013-11-09"
  }, 
  "BVKJF0OYYy9uqOEmEL37bw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt V.", 
    "review_text": "food was tasty.  service was acceptable but what I really disliked was a bento box is around $10, and basically comes with a protein, rice, salad and a miso soup.  Nothing else.  Oh but if you want to, you can add things for $3 or $5 each!   WTF?  no thanks...I feel like this is the spirit airlines of restaurants.    The food didn't warrant the price.  I had the salmon bento with chicken Karaage, for $13.  Tiny portions and I left still hungry.", 
    "review_date": "2014-07-13"
  }, 
  "soFo2vPCPZey3F6XP4WATA": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Christina L.", 
    "review_text": "I'm not too fond of conveyer belt sushi, but this one was pretty decent. It's located in Japantown and never seem to have too much of a wait. Because it's conveyer belt sushi, food is served immediately! So it's a great option if you are dying of hunger at the moment.   Service:  The service here was nice and friendly. Not really attentive, but they are easy to flag down.   Food:  The food here is actually pretty good. Although, I wish they had more of a variety of sushi. Most of the options were pretty much one type of underlying sushi with a different topping or sauce on it. There were a couple of dishes that I particularly had a liking to - the one with the orange sauce on top. I don't know what it was, but would definitely recommend it.   But I have to admit this place is very reasonable priced and the quality is great.   Overall:  I would definitely recommend this place.", 
    "review_date": "2014-10-26"
  }, 
  "vIBqT6wJ-gNWKY-2vgBcmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William W.", 
    "review_text": "I'm a sashimi person and this is one of my go-to places for expensive cuts like Otoro. Most other places I had in downtown area before has great quality fish. But at over $10 fog two piece of Otoro is just little too much of a rip-off. Tenroku, though it is not super high-end quality Otoro every time, still beats the other places in terms of prices ($6!!!) and phatttt ass cut. On top of that, they still do a good job with the average stuff like anago sushi and spider-roll. And most if the time, their hamachi sashimi are fresh, thick, and cheap.   That's why I'm here all the time, and the 大将in the front middle is my amigo now lol. Dude is bro.", 
    "review_date": "2014-11-08"
  }, 
  "Z4R8BA-iGNwEtGsnfi7AEg": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Stacy C.", 
    "review_text": "I totally don't understand why they have those plastic lids, but the servings are big and fresh.", 
    "review_date": "2013-12-14"
  }, 
  "bXc7_hewD5ledvVkaS4erg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taffany H.", 
    "review_text": "A few words of advice: Manage your expectation.   If you're here for quantity consumed with disregards for the quality of the fish you are provided then you are golden. Paying $4.5/a pair of nigiri will get you full but that's different from getting you the satisfaction that you've enjoyed a good quality fish or sushi rice that is properly prepared. It's not great but it can get you full. Nothing more.   The postscript of my experience here is taking a peek at Isobune and realizing that the sushi on their boat is actually better looking.", 
    "review_date": "2014-05-15"
  }
}