{
  "DJaQV3r153ZsBQArxAPl8g": {
    "user_rating": 1.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Soni K.", 
    "review_text": "I LOVE DRINKO!! I kept wanting to play just to get more jello shots! Unfortunately I landed on the grape vodka shot - which was NASTY - so I asked for chaser.   First of all the owner is all glaring at me because I kept wanting to play drinko instead of ordering a \"real drink\" I suppose. if that's your problem then why do you have the game up anyway?!   Second of all, they would not give me chaser. No chaser, barely gave me any water and that too was given very hesitantly. I just wanted a jello shot! They wouldn't even let me switch it out! I had to use a water bottle I luckily had in my purse.   This was on Super Bowl 2013 game day. They have a bunch of snacks laid out. My friends and I drink really slowly and we had the whole day so we were ordering slowly too. Owner gets pissed at us and tells us to get away from the food if we aren't going to order. DOOD!!! We've been playing drinko for the past 10 minutes! My friends ordered 2 beers too. Still glaring at us for eating. At this point we just got so sick of the attitude we just left. I love my 49ers and I'm not about to ruin game day because of some rude bar owners who don't know how to treat customers with some respect. If they had asked politely in the beginning, we totally would have ordered a lot more.", 
    "review_date": "2013-02-06"
  }, 
  "rVWebsft_jx629iCO6vQ5w": {
    "user_rating": 2.0, 
    "user_location": "Washington, DC", 
    "user_name": "Mo A.", 
    "review_text": "Though I have had many fun nights at this place, they have all been the result of the people I brought with me, and not the actual bar or service. I am sure that they have great reason to be rude, but that doesn't mean that I want any dose of their attitude. The only thing that keeps this place alive is that they are in a bit of a dead zone on market with very little competition.", 
    "review_date": "2011-11-21"
  }, 
  "XVcZ7EU2Cv-woOD-l4SG6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ray K.", 
    "review_text": "This is a great place to hang out after work.  Michelle is one of the friendliest bartenders in The City.", 
    "review_date": "2011-11-28"
  }, 
  "11XoIrUVyolyZFoni-KdLg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tia B.", 
    "review_text": "Completely acceptable dive bar.  Cheap.  Awesomely friendly staff.  Not worth going out of the way for, but if you are in the neighborhood this is the best bar around.  And heck, they have Drinko - you, too, could win a jello shot!", 
    "review_date": "2012-09-11"
  }, 
  "1By0VrUKDVKHgsRhYclL3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alycia M.", 
    "review_text": "Great little dive bar. Bartender is cool, decent priced drinks and Matt (The owner) is a great guy. :) Karaoke night is on Thursdays, and it's definitely worth checking out!", 
    "review_date": "2011-04-15"
  }, 
  "94B1VyI0Yv5E5o-v7DWkrA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marcus R.", 
    "review_text": "Great little dive with Karaoke Thurs Eve.  Very extensive song list, though sometimes it takes a little while to find.  Just ask the DJ and she will find whatever you are looking for. Certainly a much better alternative to some of the busy Karaoke bars that can take over an hour to get a song.  We sang about 5 songs on our first time there.  Friendly bartender and good drinks. She even makes requests for someone in the bar to sing her favorite songs.", 
    "review_date": "2011-07-13"
  }, 
  "qL1q92ZosGiGC6sYVR1dxw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve S.", 
    "review_text": "The Hot Spot was just recently remodeled. It looks and feels the same. It's the best bar around for me and my coworkers to grab cheap drinks.  $6 dollar specials and chill bartenders What's not to like?", 
    "review_date": "2014-12-30"
  }, 
  "yUYxgwx6fB-pHiGxEWkTcA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ian b.", 
    "review_text": "I ****ing LOVE this bar. It has the best deal in the city. I bartend and like going places where I don't have to fight to get a drink, or scream over the unnecessarily loud music on my nights off.   My only complaint is coming in here on a friday night off and they had some lingerie party. The girls kind of hastle you to buy tickets. They're pretty annoying, but the bar is so awesome that it cancels them out.", 
    "review_date": "2012-02-08"
  }, 
  "prTQohnz4S5r7x5h4YlP6w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alley B.", 
    "review_text": "Cool dive bar that was playing 2 Short when I walked in from the eerily deserted wasteland that is Market St. after eight p.m. Cheap drinks, dim lighting and cozy seating arrangements make The Hot Spot a dope place to kick it. The end.", 
    "review_date": "2011-01-06"
  }, 
  "zl5bx3QOIU9dLgVoqbkLKw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lailani P.", 
    "review_text": "I give this place 5 stars as a dive bar. A few of us were walking around last weekend and popped into this place for a quick drink. I hesitantly asked the bartender if he could make a fancy, fruity drink and he was happy to do so. Sometimes, bartenders get a little prickly in dive bars if you ask for anything that looks like it needs an umbrella. Not this guy. Then, we all had another round. Then, we heard some tales from the bartender's younger days in the city. Then, we discovered Drinko. Best game ever.  We'll be back again for sure!", 
    "review_date": "2013-02-17"
  }, 
  "MhbKOwnWGcFPLrtzpP--fw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron Y.", 
    "review_text": "In my opinion, you can't judge a dive bar until you are so drunk you have difficulty standing up. Until you get to that point, you're not appreciating it in the proper context. It took four of the $5 recession specials to get me to the point where I liked The Hot Spot, but it's hard to say no to a PBR, lottery ticket, and a huge shot of the well liquor of your choice... more accurately, it was really easy for me to say no when I was standing outside of the place with my friend, but after having two it was really hard to say no to two more.   I got drunk, I had a good time, and I won $10. What's not to like?", 
    "review_date": "2013-09-14"
  }, 
  "exWG_HWLmfy2E6phcH9zmg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Leah E.", 
    "review_text": "Did Hot Spot close?", 
    "review_date": "2014-01-22"
  }, 
  "RQ2ZkfsL4C-5G449Qrv_Ww": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Raquel C.", 
    "review_text": "Where else can you enjoy a drink while watching middle aged punkers karaoke to Gorillaz and dance along side homeless people and their pet chickens? At The Hot Spot! duh.  After hearing stories of blind karaoke singers serenading hookers into the bathroom, I figured it was time to check this place out. Two co-workers took me to what they refer to as \"the homeless bar\" or \"bar with no name\" (as it was once nameless, indeed) and I wondered if I'd be lucky enough to witness the ridiculousness I've so often heard about.  Not only did I see Morgan Freeman, dance with a homeless couples' pet chicken, and hear the most amazingly awkward renditions of almost the entire \"Demon Days\" album, but I got plenty drunk and worked the crowed with some Heart, The Smiths, and even a little U2 (though I detest them).   A great dive bar for great times. That's hot.", 
    "review_date": "2010-01-15"
  }, 
  "SwzQbaCkctV3Q2Ru0a6CSw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mike P.", 
    "review_text": "Total dive. The only time to visit this place is before/during the events and parades in Civic Center Plaza. (Had a great time on St. Patrick's Day)  $3 Heinekens $3 Jäger Shots $2 Tecates  Bar tender was fast and pleasant. The crowd was rough and missing many teeth.", 
    "review_date": "2010-03-16"
  }, 
  "De8tuYPKZwpT-syR1sylOQ": {
    "user_rating": 5.0, 
    "user_location": "Dover, DE", 
    "user_name": "Johan V.", 
    "review_text": "This is the closest place to my apartment, and where I'm most likely to run into my neighbors.  The neighborhood is pretty crappy.  Not dangerous, just lots of bums and  bum piss around outside, (though Matt keeps his doorway nice and clear!)    Inside you'll be surprised to find a nice bar with nice seating in the rear, a great HDTV in the back and two smaller ones at the bar.  Hector and the rest of the bartenders are always courteous and you never know who you'll meet inside.  City workers on their way home, afore mentioned neighbors, or who knows!  This small place is kind of a diamond in the rough.", 
    "review_date": "2009-08-30"
  }, 
  "CMoQubElwE9xRQYhdTY-ug": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Rum J.", 
    "review_text": "Submitted for reopen. Current showing World Series with a friendly crowd. Man I missed this place (I am the the one who yelp closed it!).  No real food yet and Drinko noticeably missing but scheduled to return. But... The $6 beer + shot + lotto deal asks why are you not using this as a start or end spot?  Get over here and say Rum Junkie sent you!", 
    "review_date": "2014-10-24"
  }, 
  "6bfcLLL35DpsxAxxk5ZNAQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Tracy A.", 
    "review_text": "Friendly, intimate place to see our friend's band play. It is a short walk from the Civic BART station. You can bring food in although there is not much good stuff in the neighborhood unless the local taco truck is up and running. Eat before you go is the best advice.", 
    "review_date": "2011-06-10"
  }, 
  "Rrj11KKFTDPpjhFlxU7Z6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony Y.", 
    "review_text": "I really like this place.  I think that it is a great dive bar.  It has everything that you want in a dive bar.  Crazy homeless people stumbling in and yelling weird things at random times.  Fall down stumble out drunks at 2 PM.  Interesting regulars and great bartenders.  It's the only bar that I have been to in the city as of yet that also sells lottery tickets as well, which brings an added level of derelictness to the atmosphere.  I myself being a derelict of sorts find this to be amusing.    It's also a good spot to open up the old laptop and enjoy WiFi with purchase.  What does WiFi stand for anyway?  If anybody can tell me that I would be grateful.", 
    "review_date": "2010-12-14"
  }, 
  "8GhWdKxy_o0D0fEmiu5tyg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kent L.", 
    "review_text": "I had a great time on Thurs. night singing karaoke here.  The dj running karaoke was very nice and super friendly / helpful!  Sorry that I left in a hurry without getting her name or thanking / tipping her.  Next time!", 
    "review_date": "2010-10-01"
  }, 
  "j6VXX4PRh35YzT5MRxIuvw": {
    "user_rating": 3.0, 
    "user_location": "Denver, CO", 
    "user_name": "Jeff S.", 
    "review_text": "I really don't have a whole lot to say about this one, one of our stops on our San Francisco downtown pub crawl that my friend had heard about.  It's a simple little neighborhood spot, I wouldn't call it a dive, but \"watering hole\" might be appropriate.  It's small, but there's a pool table and lounge upstairs.  The drinks are cheap, but they do have a minimum.  Great tunes and an 80's post-punk decor.   There was a sign on the door that expressly forbid the use of cell phones in the bar.  I honestly thought it was a joke, but as we were getting ready to split someone came on the mic and reiterated this.  Is this normal for downtown San Fran, or is there some specific reason?  Anyway, it was a fun little spot, the bartender was great, and it wasn't very crowded when we were there.  My feeling is that it picks up late at night.", 
    "review_date": "2011-12-01"
  }, 
  "2Bcq1i1ndSyvYDS8Zn2Oew": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Adrianna V.", 
    "review_text": "I ended up here during Pride weekend on a Saturday afternoon and ordered a margarita. Felt a little sketchy when the bartender made the drink under the counter so I could not see what ingredients he was pouring but whatever it was worked! It was sour and salty with a punch but in a good way! My high maintenance friend tried ordering a fancy cocktail and asked \"What can you make?\" and all he pointed at my drink, lol! We used the bathroom before we left and noticed boxes of beers stacked in the hallway and in the woman's restroom...but then I remembered I was at a dive bar in SF.  FYI: My drink was $7.00 and they have a $15.00 minimum to use credit card.", 
    "review_date": "2013-07-02"
  }, 
  "zH2SvkifEIWT9it4ZR_g6w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lidia Z.", 
    "review_text": "We were on our way home one night and to our surprise we heard Karaoke! We went inside and we had such a great time that we lost track of time!  Will definitely be back!", 
    "review_date": "2011-06-27"
  }, 
  "YbZg36FoMgkKcTEPae5siA": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Amy J.", 
    "review_text": "This is what a neighborhood bar is all about. Good music, decent places to sit and a pool table upstairs. I stopped in with a pal for some Radiohead remix night which started off as more of a mix of things. Best of all, there was no cover so we could enjoy a drink...non-alcoholic this time and just sit for a little bit and enjoy the music and conversation. The staff is pretty helpful and so were some of the people there. We dodged many pool sticks but overall, we had a good time. If there's another event like this again, I will most likely go back. The hot spot is HOT.", 
    "review_date": "2011-01-09"
  }, 
  "YAG90mceVFQLdvl4wndvQg": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Margaret R.", 
    "review_text": "Eh, I wasn't impressed by the bar here. They only have happy hour specials for beers.", 
    "review_date": "2012-06-19"
  }, 
  "oef7r1CuFq9FsGWF4FL3Ew": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alley H.", 
    "review_text": "Great Dive Bar. (It's always clean, never sticky floors or bar). Everyone is always really friendly, including the bar tenders. They have NFL Sunday Ticket and an interesting mix of people.", 
    "review_date": "2010-12-14"
  }, 
  "ksxB7-agBcpO62RlxIVqcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve S.", 
    "review_text": "Great little dive bar the drinks our well serve, they had a DJ the music was real good, and we will be back to sing karaoke. The bartender was friendly and the people were nice", 
    "review_date": "2011-07-27"
  }, 
  "z0fb4zvvzOUHqUjgCLLSNg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JR Kaz K.", 
    "review_text": "Definitely a dive bar.  We came here for happy hour and $5 shot (of anything) + beer + scratcher = not too shabby.    Area obviously isn't the greatest and a couple of weirdos tend to walk in and head straight to the bathroom.  Surprisingly though the (women's) restroom was pretty clean.  (Always nice to not worry about the pee on the seat or floor or lack of TP).     Btwn my fiance and I, we had 3 shots and 8 beers and left with a $10 tab!  Not going to argue with that!  =)", 
    "review_date": "2010-07-30"
  }, 
  "SXfvHWScLghzoTSBqb_e6w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Angela L.", 
    "review_text": "Uh, I think this place just became my new favorite bar.   It's a dive. Do not come here expecting some mixologist foo-foo crap.   Do come here and take delight in the fact you get a beer, a shot, and a scratcher for $5. Do come here and hop on the really old karaoke machine. Do come here and hang out with Michelle, the sweetest and awesomest bartender. Do come here and play drinko.   There's also a pool table upstairs with chairs and benches, which is good if you have a large group. It's also conveniently close to the BART station so you don't have to worry about driving!   If the owners are checking these, Michelle is absolutely fantastic! She was so helpful to our group of 12 and handled everything so well.", 
    "review_date": "2013-09-13"
  }, 
  "GrktSJ7Bv9t37gwDLIlAwg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "This is a total dive bar. We happened upon this watering hole on our way home and decided to pop in. Prices are pretty standard, but they have a credit card limit, so remember your cash kids! Unfortunately, I never have cash so they had to hold onto my friend's card while I ran to the bank across the street. Luckily, my bank was even across the street! If yours is not, then have fun with the ATM machine right at the door.  The bartender was alright. He was fast and easy to talk to. The atmosphere is not really anything. I guess you can say there was a lack of an atmosphere. The music wasn't anything good, but I did just come out of a concert. The upstairs balcony area is where it's at. I don't know why, but it was completely empty so we took over the free pool table. We didn't need to put down anything for it and the balls were all there already. Plus, there's a couple of arcade machines up there too. The tap selection was not bad, but it was a little sad to see Bud, Bud Light, and Tecate all next to each other.", 
    "review_date": "2010-04-17"
  }, 
  "6XCZoufB_S-sY6vsxMGd8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jason g.", 
    "review_text": "Hot Spot is the new Spot!!!  I like it when the owner of the bar buys a round of drinks and that they seem to care for your business.  Also, my friend Amanda N. is now working here.  1 shot, 1 beer, and a 1 dollar scratcher for 5 dollars.  I think that's all I need to say.", 
    "review_date": "2011-07-27"
  }, 
  "lrh3FqY6EzyJ27luwT5BxQ": {
    "user_rating": 4.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "rachelle t.", 
    "review_text": "My girlfriend and I went there and we had so much fun signing karaoke and drinking some strong drinks. The lady bartender can make some very strong  drinks We needed these drinks to get up our courage to sing and we did after hearing some other people.Come on down and have fun.", 
    "review_date": "2011-08-23"
  }, 
  "Ic6-gs1_FjrWGx6JIr95Mw": {
    "user_rating": 3.0, 
    "user_location": "Pittsburgh, PA", 
    "user_name": "Amanda J.", 
    "review_text": "I lived directly next to this bar all summer so I came here quite a few times.  Some bar tenders were really cool, some not.  Some random thoughts:  -The $5 PBR, tequila shot, scratch card special was a cool idea.  It made it a whole lot easier to get drunk really cheap.  -They rarely card here.  In Manhattan, they take carding so seriously.  So it seemed weird that I never got carded here.  I look like I'm a teenager without make up on.  And there were plenty of blatantly under 21ers in the bar one night.  Like...talking about how they were under 21.  Odd.  - The DJ was good, but it was nice without as well.  Depends on your mood.  -For being a small bar, it's a good set up.  There is one bigger table in the back, a few benches along a wall, and the bar.  Plus some tables up front.  - DRINKO! is awesome.  - Not all bartenders charge the same amount.  I paid $7 for a shot one night and $5 another.  Ouch.  - They're very tolerant of large groups.  Appreciated.  -They sell Chef Boyardee.  I found this really amusing when I was drunk.  Hot Spot is a good local bar.  It's fine if you live near here, but don't go out of your way to come here.", 
    "review_date": "2013-09-06"
  }, 
  "ChEMGCnbKa2BwSSYGsJdrQ": {
    "user_rating": 1.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Jeff G.", 
    "review_text": "Very depressing place. A dirty little bar that doesn't seem to get why people like dive bars. I never have a good time when we go there (it is close to a friend's place). On this visit the place was filled with middle aged men and women that look like they've been crying for days straight. One gentleman was trying to figure out how to drink his martini without the brim of his 49ers hat getting in the way, and for some reason the solution involved not picking up the glass at all.  Conversation was difficult over the stereo blasting \"Sinatra's most depressing dirges,\" or some similarly tearful album. I hear the karaoke is alright, but way too depressing most of the time.", 
    "review_date": "2012-06-04"
  }, 
  "uRKRDIjWBBrMJyuhGC1VLw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mag N.", 
    "review_text": "WTF? DJ over the juke box? Sorry man, the customers have taste also. Stop thinking so much and serve the community.", 
    "review_date": "2015-01-25"
  }, 
  "cyiBWz8Fy4S0KdJmuIy9IQ": {
    "user_rating": 5.0, 
    "user_location": "Clear Lake, IA", 
    "user_name": "kristin j.", 
    "review_text": "This place is the perfect dive bar.  And I use the term \"dive bar\" in the good sense of small, fun, good-for-hanging-out-with-friends style drinking establishment.    First of all, it's CLEAN and it smells nice.  I've found that to be rare for many neighborhood bars.  Plus there's TONS of seating.  A strangely novel concept, but much appreciated.  Bartender - super nice.  I'm a Tour Manager for a company that specializes in 18-35 year-olds and I'm in San Francisco every couple of weeks.  For an entire year, I've been looking for a place to take my clients on a Sunday night.  I experimented with various bars in various neighborhoods.  Each time, the clients would stay for one drink and then bolt for the door.  Finally, I just picked a random bar close to the hotel, so everyone could just walk home if they wanted to leave early.  That random bar happened to be the Hot Spot.  The clients LOVED it.  They could play their favorite songs on the jukebox, play pool in the upstairs loft and casually mingle amongst themselves.  Most of them stayed until closing.  I've recommended it to all my fellow Tour Managers.", 
    "review_date": "2010-01-28"
  }, 
  "f2_ORdto2MUlxp6-LlmKgg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Trav M.", 
    "review_text": "Five stars across the board. PBR, random whiskey, $1 scratcher all for  $5? SOLID. Nice dive bar vibe. Oh, and the Drinko game? LEGIT. Michelle, the bartender taught my friend Travis and I a new way to do Jello Shots (we won them at the Drinko game) and then I proceeded to feed her a Jello shot...all on a Sunday afternoon.  Oh, and it's a two block walk/stumble/crawl to MUNI Metro and BART...so yeah, that gets it points also.", 
    "review_date": "2013-08-06"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "Quality dive bar. $5 for a can beer, shot, and $1 scratcher. Drinko (aka Plinko for jello shots, or better if you're lucky).  Hot Spot is your local quality dive, in all the best ways.", 
    "review_date": "2013-10-06"
  }, 
  "sxdfddO23yhpPlH21wfKUA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Annie G.", 
    "review_text": "I actually have my first Hot Spot visit on camera.  Kind of.  I somehow managed to turn my video recorder on one Friday night and recorder three hours of footage from my purse.    I once again had an atrocious time at Rickshaw Stop and ended up on Market around 1am.  Oh hello Hot Spot.  You're still serving alcohol?  Perfection.    A crazy guy told me that my name was exotic.  Another guy told me that my skin tone was perfect and that he would lose interest in me if I got any darker.  I told him I would forever stay out of the sun like a fucking vampire.    My friend met a guy named Allen/Alan/Allan.  He and I are going to Africa together to visit my friend.    Such a darling joint.", 
    "review_date": "2009-09-24"
  }, 
  "IDhcaHM7KG4EDmWf9b3c0A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "This is a dive bar.  There is no question, I am sure hipsters find it on a weekend, but come here for happy hour, and you will only find middle aged people who are really really happy.  The drinks are cheap and strong.  There is a pool table upstairs as well as a couple of pac man games.", 
    "review_date": "2012-10-01"
  }, 
  "oKrct4Hc8hZNMYXecitLCw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "InfodivaMLIS B.", 
    "review_text": "Hot Spot is an okay spot! Full Bar! Excellent Beer on tap selection.  There is a second level with pool tables.  The clientele was a mixed working class crowd. I was here for the Thursday night karaoke.  Parking was okay. The neighborhood is not quite the Tenderloin nor is it upscale.  I will go back for certain.", 
    "review_date": "2009-11-03"
  }, 
  "NRrNQ5xHn_7Fu4ctlpKLbQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin S.", 
    "review_text": "OK I guess.   The cute friendly bartender helps, the pool table upstairs is great and the location is, well, in the middle of nowhere.   When I pulled up my stool at the bar the first thing that caught my eye was there were prices on the majority of the bottles, WTF? That's just tacky. I assume this is for the bartender so they don't forget because if the prices were for the customer, well if you have to ask how much a shot of Johnnie Walker Black is; its too much for you, go get an Old E", 
    "review_date": "2010-08-11"
  }, 
  "2Qfa3o72sq04_MCUxy3Shg": {
    "user_rating": 4.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Emily D.", 
    "review_text": "\"Dad's are the original hipsters.\"  Apparently, this quote is true. My hipster roommate has oft wanted to come here, but it was my set of \"psyudeo hipster dad\" work collegues who finally brought me here. Yes. 4 fully grown men, with babies, took me to a hipster spot.   And then they rocked out to 90's rap. It was awesome. Cheap beers, pool table, get the lookout deck if you can. So so much fun.", 
    "review_date": "2012-07-27"
  }, 
  "VNRW7STLvplnmo1Akpy2xA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Elliot Y.", 
    "review_text": "DRINKO!  A dive bar in the van ness / market street corridor.  Plus stars for the selection of music in the jukebox.  There's an upstairs to this place that has a pool table for $1 games and pac-man (om nom nom)!  Beers are cheap here.  Mix drinks vary from $4- 7.  At the end of the night, the prices add up.  They also accept credit cards!  And they have scratchers/ lotto machine.", 
    "review_date": "2013-02-06"
  }, 
  "Jyv55legkC7eSxxAfGsnGw": {
    "user_rating": 5.0, 
    "user_location": "Seal Beach, CA", 
    "user_name": "Monique O.", 
    "review_text": "I really liked this little dive. The bartender was friendly, drinks were strong, and the prices were right. I'll definitely stop in again the next time I'm in SF.", 
    "review_date": "2011-06-07"
  }, 
  "unoNiA9V3p1GXdwWExWWdw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin A.", 
    "review_text": "~smack dab in the center of town ~full bar ~TVs  ~occasional Live Music ~pool table ~internet juke box ~great bar tenders ~Salt of the earth clientele  This is a no bullshit bar...fun for the whole family!", 
    "review_date": "2010-03-16"
  }, 
  "dGy6LmfgfJyftpcHVkPtEw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "After lounge time started dying down it was still within drinking hours so we shambled down the block to the Hot Spot. Honestly Doug was getting a little whiny and I wanted to get him to drunk.  The Spot isn't a dive bar as much as just a smaller bar. Decent service, good drinks, and the pool table was all ours! For once the bar bathroom wasn't that bad which can be rare on a Saturday night.   No complaints for this spot. It wasn't overly crowded but not dead either. I shall assume it was mostly regulars who seemed to be a nice bunch. The bartender was really friendly too. We will surely come back when in the neighborhood and needing to quench our thirst.", 
    "review_date": "2012-01-15"
  }, 
  "51SjZEz911Af5t-EpNgk4g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anastasia B.", 
    "review_text": "Strong drink.........$8  A game of \"DRINKO\".........the cost of a Jell-O shot  Kraft Macaroni &amp; Cheese, Spaghetti O's and Chef Boyardee Beefaroni on the menu.........priceless", 
    "review_date": "2012-04-24"
  }, 
  "YbnM2KAqVUH31l3dpNyOFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kristin t.", 
    "review_text": "We love the hotspot!!!  Amanda and Matt too!! Awesome! Awesome!! Awesome!", 
    "review_date": "2011-11-22"
  }, 
  "A9N_ROUJr4kqFtPWwUBOOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lucas M.", 
    "review_text": "Great dive bar with strong, cheap drinks, a solid selection of vodkas, great music (the night we were there, courtesy of DJ Abell rockin' some indie pop jams), a super friendly bartender, and just the right amount of neighborhood crazy to keep you on your toes.    And in addition to the drinks and music, did I mention that you can: 1) buy lottery tickets 2) crank tunes on the jukebox 3) play pool 4) buy a Twinkie.  Yes, you can chase your favorite adult beverage with Hostess goodness.  We will definitely be back.", 
    "review_date": "2011-07-10"
  }, 
  "Hh_ryEVhbxjYqdJ0Aqrn4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kurt W.", 
    "review_text": "Bartenders are always nice. The atmosphere is good. They have light foodservice (ultralite, IE hot dogs and popcorn). This isn't the hottest area of SF for a bar, but the prices are right, given that. When you are looking for a drink in this part of town, you can't go wrong by going to this place. A truly good place to drink.", 
    "review_date": "2012-10-26"
  }, 
  "YmhuLLgutiFZeBCt4C0TEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ken d.", 
    "review_text": "Hot Spot is an East Coast bar plopped down right in the heart of S.F. Full of Runyonesque characters, but not a silly S.F. type bar. Every corner in N.Y.C., Philly and Chicago has a bar like this..full of REAL folks. Matt, Danny and Hector keep the place safe and clean, and they sponsor special event type evenings. Pool table upstairs...no food...byo...just all around good chat, drinks, sports...an unpretentious East Coast type place...if you're REAL, you'll enjoy.", 
    "review_date": "2009-11-22"
  }, 
  "qGi0xjK3HM3Lfr6kSwKZdw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kim D.", 
    "review_text": "A place with good vibes. Everyone has a hot spot (well, hopefully).  Stumbled here, because it was next to Bill Graham and we needed a watering hole before going to meet the Lady (GaGa).  Drinks were off kilter, but luckily it wasn't expensive. Something about them, made me realize why gay bartenders are the best ones (usually... drinks are much stronger). Seediness all around (including the Chinese market smell in the bathroom), but if you are going to frequent an establishment such as this (downtown area, not too upscale, a bit downscale) ... then you expect those certain \"extra amenities.\"", 
    "review_date": "2009-12-14"
  }, 
  "Be6BJoHJOfIlnNnXLTTkCw": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Eddy B.", 
    "review_text": "Definitely an acquired taste.  My first night in California, I met a dude on the bus and we went bar hopping, you know, 'cause people are friendly as hell in SF. Anyway, I had to abandon ship because apparently it was karaoke night and I value my ears and sanity.", 
    "review_date": "2013-01-29"
  }
}