{
  "y8lz_6KWGOQ9jcTyIdwTLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick B.", 
    "review_text": "Quite a bit nicer than the average sports bar. Even the ladies like it.", 
    "review_date": "2006-09-08"
  }, 
  "cafwMe1yHtWi-2PE0C9KWA": {
    "user_rating": 5.0, 
    "user_location": "Russian Hill, San Francisco, CA", 
    "user_name": "Lissa Z.", 
    "review_text": "Trivia nights are fabulous and the staff is awesome. Fun chill nights are spent here. We live close and make it here at one or two times a week and it's always pleasant.", 
    "review_date": "2014-04-15"
  }, 
  "emIVSls-1hbkPIf4QeEDkg": {
    "user_rating": 5.0, 
    "user_location": "Orange, CA", 
    "user_name": "Carly J.", 
    "review_text": "I love this bar. It has that certain je ne sais quoi you look for in a local bar. There's a great trivia night on Tuesdays. It's perfect spot to watch a game. The bar staff is fun and entertaining. I have been there many times when the bartender makes a round of shots for the whole bar. The burgers are awesome, but don't always expect the kitchen to be open.", 
    "review_date": "2007-08-20"
  }, 
  "tgUvk_rJXFr24q-X7I1U2A": {
    "user_rating": 4.0, 
    "user_location": "Mesa, AZ", 
    "user_name": "Stacey D.", 
    "review_text": "This is an Arizona State University football viewing bar - and I love it is packed with my fellow Devil fans.  The bar was packed, and the bartenders are very limited on time and resources.  The bartenders were a lil' snappy because they are so busy...so maybe they should have more there...just a thought?  I didn't eat anything there, but the food sounded great and the people around me said it was good.  Though the service was a little bit of a turn-off, I will go there again for the benefit of the doubt.", 
    "review_date": "2011-11-21"
  }, 
  "iuysnFLpWUzfZtrphPOqCQ": {
    "user_rating": 5.0, 
    "user_location": "Reno, NV", 
    "user_name": "Karen H.", 
    "review_text": "My new company recently celebrated its launch party at The Boardroom, and we recommend it wholeheartedly.  My first experience with The Boardroom was a random Friday night for happy hour a few months ago.  The place has a cool, surfer theme, which was appropriate for watching \"Point Break\" on the bar's TVs. That was not Casey's choice of movie (the manager who was tending bar that night) but he was joking along with us, chatting with everyone.   He even recommended a great new gin to freshen up my tonic.  When we finally contacted him about the possibility of having our launch party there, he was nothing but accommodating.  It's hard to find a place for 30-40 people for a weekday happy hour without a crazy price tag or an attitude.  Casey was as happy to have us there as we were to find such great place.  And in all our planning, Casey was quick to call back, professional with a sense of humor.  Perfect.  The event went amazingly well.  Ben was the fantastic bartender taking care of us that night.  He was so nice, and made great drinks.  He and Casey even made a signature cocktail for us for the party.  We also were able to plug our iPod into the sound system and enjoy a personal playlist.  What really sealed it for me is that the next morning, Casey gave a quick call to see how the event went.  That was unnecessary and completely appreciated.  So if you are looking for an event space for 20 - 60 people, definitely give Casey a call.  Even the regulars at the bar are super-friendly and nice.  The food here is really good, as well - can't beat bacon-wrapped tater tots.  It's a very clean place with a warm vibe.  (And no, there is no broken sink, like in the photos - it's a perfectly nice bathroom!)   When you find yourself in North Beach, thirsty or hungry and in need of a friendly face, head to The Boardroom.", 
    "review_date": "2010-06-01"
  }, 
  "wJgtf18VKKZq9A6ZQUybQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candace R.", 
    "review_text": "My alumni group scheduled a game viewing here which is probably the only reason I would have stumbled upon this place. It's not a huge bar, but I didn't feel claustrophobic when it started getting pretty packed after the game started. I scored some seats up front by the window and when it wasn't too busy, the service was great. I had an order of the crispy pork buns (good+) and the bacon wrapped tater tots (over-hyped and only okay), as well as my fair share of drinks. My main complaint is that well into the evening, there was a TON of people in the bar and only one bartender, so it took forever to get a drink after he noticed you at the huge bar. This wouldn't stop me from returning, but I hope they plan for better coverage when they have events like that.", 
    "review_date": "2014-12-11"
  }, 
  "rMsckQ35fAdzgYZQr7VPmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim Y.", 
    "review_text": "I've been here twice and it's great. I've been looking for a good local bar that doesn't seem like a run-down frat house for awhile now. I was drinking there all day one Saturday and of course, that got out of hand quickly, but it's a great place to sit at the bar, meet a few people, and have some really great apps.   On Trivia night it was pretty serious, and very packed. I swear the team behind me was cheating and took my team's answers... but then again I would too if I heard a team shout out every answer we picked for everyone to hear. Thanks Brett and Tom. We could've taken the place by STORM!", 
    "review_date": "2007-12-01"
  }, 
  "kyG14FyCWmVW3Uefs_GE_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theron L.", 
    "review_text": "The bartenders are wonderful. The drinks well made. The trivia night matredee is the best in town. The $2 tacos and the fish tacos are tasty. The $2 tiger beers are nice on those lean evenings. Pub quiz is great, even if the movie/music round makes me feel stupid every time.  If you're not going here on tuesday night you are either ill informed or hate america.  Or yourself.  Maybe both.", 
    "review_date": "2008-07-17"
  }, 
  "5e15KDvcXw6J6b5E4a3eQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carina A.", 
    "review_text": "FINALLY!!! MY ASU BAR!!  Somewhere in the city you'll find it. You might stumble upon it, it might take you years, but you will, and mark my words, you WILL find your sports team's bar.  For me, I've been searching since June, not too bad but it felt like eternity.  And truth be told, another ASU alum told me about this infamous ASU bar, and the ONLY one in the city.  I'm a little cautious to believe this so I still have my eyes open for another one.  The bar reminds me of ASU a lot.  Crowded, filled with beautiful people, VERY drunk beautiful people, in a dirty location.  I was so pleased to be around all the Sparky loving hotties I could care less about the dingy bar.   I don't know about the other days, but I'll be there on Saturdays, cheering on my failing team with hope in my heart and a Bud light in my hand.", 
    "review_date": "2008-09-30"
  }, 
  "tDWr9QfVH1-phUEjCGYglA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kalifornia S.", 
    "review_text": "The boardroom was okay for a birthday party. It was a fairly small venue. We luckily got a booth but the speakers were way to loud and a bit dark changing the mood of a well wanted upbeat crowd. Trivia night was a ton of fun though. The place was a no frills bar but the food for Taco Tuesdays was really good. I would go again if I wasn't right by the speakers and maybe had a seat at the bar.", 
    "review_date": "2011-02-22"
  }, 
  "Dhic2o4tLR-pEDZyPiHB1A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C M.", 
    "review_text": "Love these Guys! Definitely a great place to go for a beer and watch a game with some great bar food.", 
    "review_date": "2012-10-18"
  }, 
  "bpgbVPJcG-wQ4cNBcPPIxw": {
    "user_rating": 3.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Monica O.", 
    "review_text": "Looking for a dive bar in the city that locals frequent and the tourist don't wander into? Then The Boardroom is your place to go!  This place is a dive, but you can get bacon wrapped tater tots, WHAT?  BACON on potato action, hell yea! They were good, not mind blowing but good, its bacon how can you go wrong.  Couple of TVs on the wall to catch some games, nice seating area, looks like it could get packed, was there on a Sunday afternoon and it was 50% full.  Blue Moon on tap and that's what I drank.  Restrooms are a hot mess, do go, HOLD IT!  Took some pics, shared a laugh or two, so good times happened in this place.", 
    "review_date": "2014-08-07"
  }, 
  "4IjzfbO7XKFNWWVufHNhww": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalie N.", 
    "review_text": "I love the feeling that I get when I walk into my local, favorite bar. I haven't gotten this feeling since my hayday in Chico until I met up with some new and old friends at The Boardroom.  In search of a bar playing the OSU game on a Thursday night, my friend called the bar in the afternoon. He was lucky enough to get the owner, Keith, who assured him he would play his game that evening. Sure enough, a man of his word, Keith had it on the big screen and we bellied up to a tall table surrounded by bar stools.   We were greeted like we had been coming to The Boardroom for years. The guest bartenders, which on Thursday nights take cash tips for different charities, were really friendly and fast. And, by the end of the night we had met the usual staff, and we were chatting it up.  I now know about the trivia night and the fish tacos, so you may see me swaying about on my barstool on Tuesday's (taco in one hand, beer in the other). Thanks for the hospitality! We all walked away saying what a great new place to make our favorite neighborhood bar.", 
    "review_date": "2008-10-03"
  }, 
  "aON_SCN0U9G9OiHPye6pCw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "andrew m.", 
    "review_text": "Went there for the Niner's game on a Sunday. Decent crowd, it was thanksgiving weekend so the crowd was probably lighter than usual but the $4 bud lights and the service turned me off.  As there were only like 20 people in the bar I didn't expect to have to stand behind the bar for a couple minutes and wait for a round of beers. They do have beer + shot specials so that is a plus however overall the bar was nothing special. Good spot to watch the games and get your Sunday buzz on.", 
    "review_date": "2009-11-29"
  }, 
  "_PYbCltP0Re0s5DDxfOZ-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James C.", 
    "review_text": "Definitely a hidden find in North Beach.  Tucked away on the corner of Powell and Beach Blanket Babylon St.  A good place to grab a quick pint while chatting with some friendly locals!", 
    "review_date": "2008-01-04"
  }, 
  "Zcs4PX2495FeHNAyidlX4g": {
    "user_rating": 4.0, 
    "user_location": "Augusta, ME", 
    "user_name": "Adrian C.", 
    "review_text": "Sweet Jesus what a night. My buddy and I had just got into San Francisco, it was Halloween Saturday and we'd finished off a 12-pack in our hostel whilst trying half-heartedly to decide what to do. We'd just come off five nights in Vegas so we were a little worse for wear, and weren't sure if we had it in us to go out. I consulted Yelp anyway, memorised the directions to the Boardroom and away we went.  Since we're idiot Australians, we didn't have costumes for Saturday night as we were going to buy them the next day for a party we were going to. So we were essentially the only two people in the place not dressed up. But it didn't matter; bartenders Bruce (Magnum PI) and Ben (Zach Galifianakis) gave us some sage advice on Halloween culture and then plied us with booze. All fucking night.  At some point, one of the guys decided the bar needed to hear the soundtrack from The Hangover, which I just so happened to have on my iPhone. Minutes later, my iPhone was responsible for music for the next hour and a half, even after the soundtrack ran its course. There I found myself, rapping in the back of the bar with a random local girl and thinking \"wow, they're playing some kick-ass songs in here!\" Duh.   I'd also like to use this review to apologise to the off-duty bartender who I kept buying Jameson shots and PBR for, even though he was wasted. I'm sorry man. I know you didn't need them, God knows I didn't either, and one of us had to drink them.", 
    "review_date": "2010-11-20"
  }, 
  "2xMannyRA_gPFOMF1JKA8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Becky R.", 
    "review_text": "The Boardroom recently hosted the launch party for my small business. Now, since we're just starting out, we don't have money to just throw around. No matter, The Boardroom let us have it there...for free! No problem. Buy food from us, or bring in your own - no problem. Decorate the place with balloons and tablecloths and napkins (we're girls, obviously) - no problem. Play your own music (for all they know it could've been a Taylor Swift nightmare. It wasn't) - no problem. Buy back the champagne we over-ordered - no problem. Just the nicest, most accommodating bunch of guys. Truly.", 
    "review_date": "2010-05-31"
  }, 
  "0sSWKnF5mc2YK5_jfy98rw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SF D.", 
    "review_text": "We held our fantasy football draft here.  We had a great time.  Martin, the manager, was awesome.  He took care of us and made us feel like we were regulars.   There seem to be plenty of drink specials that make this place a very good value as well.  The Boardroom is a place that any of us would definitely go back to for a game or drinks.  There's a pay parking lot right next door and the place is a block off Columbus, which is perfect for those that appreciate a low key feel.  The place had 4 flatscreens (sports), music, decent food (nachos were good), and wifi (although we couldn't get the Macs to work with it).", 
    "review_date": "2009-09-07"
  }, 
  "pbtoL7wBtv-aER27zewozQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kristeen O.", 
    "review_text": "We ended up at this busy little dive on a Sunday morning for Brunch. They were playing college football and a mix of random music genres, &amp; the crowd was super friendly and unpretentious.  The food? Surprisingly good. I had a bellini cocktail,  he had coffee, &amp; we were both satisfied. Awesome bacon, yummy breakfast burritto, fresh quality fruit. This isn't a place we'd drive out of the way for, but we had reasonably priced, fill-you-up food with no wait.", 
    "review_date": "2013-11-10"
  }, 
  "mFsgzbMr11tQvm58yfuE4w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek n.", 
    "review_text": "So I went here with my room mates for a burger and a beer and was really disappointed.  The burger was small and poorly prepared.  My fries were amazingly both burnt and cold.  For $10 I expect more than I got, even in North Beach.  Even though the place was not busy it still took an excessive amount of time to get our food.  The one upside is the bar tenders were cool.    2 stars - food 1 star - price 3 stars - service 3 stars - atmosphere  Bottom line, if you want to wait a long time for an overpriced poorly made burger, this is the spot.  Otherwise go elsewhere.", 
    "review_date": "2010-10-01"
  }, 
  "S_GMOPwx_QzO6MQVh_UQWw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abigail R.", 
    "review_text": "Boardroom is a great laidback bar that provides the perfect middle-of-the-week entertainment. It is pretty much guaranteed that you will find me here on a Tuesday night for tacos and trivia. The trivia is great...a smattering of current events, some movies, random music, and photos. Not too hard or too easy. But the real surprise for me was the tacos. Boardroom has great fish tacos. Seriously. And $2 on Tuesday? Yes, please.", 
    "review_date": "2008-10-19"
  }, 
  "3V2hlA4qQJpn6CWF-6SUqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan K.", 
    "review_text": "Small and quaint but perfectly efficient...the Steve Nash of sports bars.", 
    "review_date": "2011-03-14"
  }, 
  "Ln0Q0eO_GQ8A8-zu8d_7Pw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cristina C.", 
    "review_text": "So, after years and years of being a complete ignorant schmuck, the boardroom has made me progressively smarter in the last two weeks. Well maybe just a little smarter. They host tequila taco trivia tuesdays (great use of alliteration, huh?), which is, you guesed it - tequila, tacos and trivia on a tuesday night. The prizes for the winning team is a $30 tab and the best team name gets a bottle of champagne. There's nothing like the lure of free booze to bring out the competitiveness in all of us. Hint: the most vulgar team names consisting of four letter terms for female genitalia coupled with some kind of political euphemism usually win. So most nights will start with you arguing with that one really trashed teamate you just met at the bar who claims that JFK was the youngest president ever in American History. Then the other teamates are like \"no you numbnut, it's Teddy Roosevelt\". Somehow that one drunken friend always manages to convince everyone else he's right. After feeling raped of their dignity at the end of the night the sore losers go home empty handed and with a little indigestion from the awesomely incredible, yet greasy tacos, only to brush up on a little CNN and start the cycle all over again for the following tuesday.", 
    "review_date": "2009-01-14"
  }, 
  "0YSBWd176lBnRUHDmwgQcg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kenny d.", 
    "review_text": "if you are in the hood and looking for nice bartenders and inexpensive drinks this is a good choice. $2 tecate! im in!", 
    "review_date": "2011-10-20"
  }, 
  "pDfL8xt8F8ls0-kQIG_ADg": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Earl G.", 
    "review_text": "\"Were famous for our Bacon Tater Tots!\" read their window. Good enough to reel me and my friends in as we drove by.   Boardroom was a solid stop for a mini pub crawl. Small and intimate enough to get a drink, touristy enough to not be a dive, enough locals for street cred in the touristy North Beach area, and recession buster happy hour prices to make a solid neighborhood joint. You could probably overrun this joint if you had a big enough group.   Came on a Monday night where the .50 cent chicken wings was the eat of choice and $4 dollar taps were the drink of choice.   A local enough tap to get a taste of SF beers. My White Lightning was brewed in the Bayview dist. It was then replaced by a Watermelon wheat brewed by 21st Amendment out in the SOMA. Both washed down the pub grub nicely.   * BAC-O-TOTS -12 for $8. Perfectly crispy. They were probably Ore-Ida tots but damm these were good. Made great fat snacks.  (<a href=\"http://www.yelp.com/biz_photos/mi8ADETT7WJfssSTld7OmA?select=ilTj8Y_SWoQT8bbzPCdnVg\">yelp.com/biz_photos/mi8A…</a>)  - Their unique brunch meny maybe worth trying if you get tired of waiting at Mama's up the block.      - Their Tuesday Trivia night w/ tacos and Tecates for $2 would be welcome  in my neighborhood.", 
    "review_date": "2011-08-22"
  }, 
  "VCdP3RY871UmrlVZVI4dEA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie W.", 
    "review_text": "Great bar type food and bartenders in a locals spot. Everything on the weekend brunch menu is good (in general, not just for a bar) and don't forget the Bloody Mary and bac-o-tots for dessert! My favorite trivia spot, sports bar and hangout bar.", 
    "review_date": "2013-08-27"
  }, 
  "KRXDCACSspW1lmSKyrw9vQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy B.", 
    "review_text": "Love this place--great corner bar to go to any day of the week 1.  Strong drinks -- great prices -- $2 Olympias at times too 2. Nice bartenders 3. Good food -- Really cheap too! 4. Low key most of the time (on occasion -especially on trivia night it gets a little packed and it is a little rowdy in there-- its usually not too bad though) Overall, never a bad choice when looking for somewhere to go!", 
    "review_date": "2009-02-27"
  }, 
  "H5zNEMUfGMRE6O51hHoirw": {
    "user_rating": 5.0, 
    "user_location": "Durham, NC", 
    "user_name": "Andy G.", 
    "review_text": "A few weeks ago, a couple of my college friends from Ohio were in town, and the weekend of their stay just happened to coincide with the OSU-Texas game.  I got the tip that Zeke's is where most Buckeye fans go, but we got there late and there was a line.  We took a cab to North Beach to look around for a place to watch the game, and by some miracle we stumbled upon Woody Zips.   They didn't have much of a food menu yet, but sweet potato fries were all we needed to see.  They were awesome.   Overall, the place seems to have a great atmosphere, and is a very cool addition to the neighborhood.", 
    "review_date": "2006-09-26"
  }, 
  "SpXN9tm9oYJ1OkUszIVTlA": {
    "user_rating": 3.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Michael K.", 
    "review_text": "Yelp 100 and bacon tater tots...had slighly higher expectations of this small, non-descript bar. Definitely divey, and a neighborhood bar for sure. Prices are ok, food selection is limited, not sure on cleanliness...when the guy from the kitchen brought out our nachos, his towel was definitely sitting in it. Small nachos for $7 is definitely a small plate of nachos...prices not great, but not terrible. Bartender was playing music off of his ipod/iphone in-between football games and friendly enough. Nothing great, but not a bad place if you just to have a beer with friends and watch a game.", 
    "review_date": "2012-10-20"
  }, 
  "woW3EEoyj5M42Z7yXLhNLg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna K.", 
    "review_text": "My dear friend \"Pants Free\" Patton wrote me a little ditty a while back- allow me to share:  (sung to that really annoying Sound of Music tune, only awesomer)  Raindrops on roses and beerpong with blokes, Boys who ride motorbikes, and like to Superpoke Gchats, and Yelping, and kickball outings These are a few of Anna's favorite things!  Patton was totally bang-on, but she did neglect to mention one of my most revered activities: trivia! Turns out there's a lot of useless knowledge in this head of mine, amidst all the air.  A group of my girls and I went to the Boardroom to try our luck at the pub quiz, and indulge in two dollar tacos. Since I'm fiscally irresponsible, I eschewed the deal and went for the significantly pricier calamari and quesadilla, and consequently had to undo my top button of my pants when I was done stuffing my face. Thanks for covering that up, sweater!  My friends and I turned out a solid performance, and even though we didn't win the whole thing, we were victorious in the challenge for best team name- no one came close to \"That Prickmadam's Titular Area Is A Real Cockchafer, But I'd Pay $50 To Do A Dickey Grind In Her Cooter.\" (The Prickmadams, for short.) Yup, the classiest broads in the place got a free bottle of dumpy champagne, which we subsequently chugged...out of the bottle.  Minus 1 star since I went to preschool with one of the bartenders there, and he pushed me down the stairs when we were two. Additional star will be added when he buys me a shot to make up for it. :)", 
    "review_date": "2009-01-08"
  }, 
  "c4bNOJ5XnKKoHJoQE4zrcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber M.", 
    "review_text": "Love love love this place! Trivia is fun but get there early for a seat! Drinks are great and well priced. Don't expect fancy drinks + martini's, this is my favorite local dive!", 
    "review_date": "2013-03-13"
  }, 
  "Zk5eRWLobrqJQFGY64y5sg": {
    "user_rating": 4.0, 
    "user_location": "San Luis Obispo, CA", 
    "user_name": "Laurin M.", 
    "review_text": "I stayed across the street from the Boardroom where the people I stayed with were regulars. They took me (at 9am) and had fun! When I came back to SF, I didn't stay with those friends but I made damn sure to go back to the Boardroom. It was a rainy monday night and there was hardly anyone there but the bartender loved us, chatted us up, and took pictures for us. He even thought of fun pictures for us to take. haha! I will, without a doubt, go back.", 
    "review_date": "2009-10-06"
  }, 
  "ts7thBPcvNi2dLwSgF-nUQ": {
    "user_rating": 5.0, 
    "user_location": "Frazier Park, CA", 
    "user_name": "Paul H.", 
    "review_text": "Home of the bacon wrapped tater- tots. How can you go wrong? You can't if you order them with a pint of beer. Great place and easy atmosphere.", 
    "review_date": "2012-01-07"
  }, 
  "70WzR6h6CrGVx5Oc6jpsfw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Susan F.", 
    "review_text": "Semi dive-like bar with enough room to fit about 50 people. Yes, small!  There were a lot of late 20-somethings here in a Thursday as there wasn't much else around here. There were some tater tots floating around that look amazing, but we did not get any food.  Beer was cheap enough but we were only here for one, so that's about all I can say.", 
    "review_date": "2012-03-14"
  }, 
  "AG3qumWJW32yJtizz7-saQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nic S.", 
    "review_text": "This bar is a great neighborhood spot.  I always have a good time - whether it is for weekly Tuesday Trivia, Thursday night football, college football Saturdays...or just to pop in for a few drinks.  The beer+shot specials are always a solid choice!  Tuesday Tacos are delicious - not greasy, more gourmet.  Only complaint - sometimes when they are hosting a college team's fan base, it feels as though the bar is over capacity and impossible to even get a drink or move (I'm used to crowded rowdy bars, so this isn't just a dumb girl complaining about being squished and sweaty)...Usually find a hideout in the back dart room when this happens so it's all good!", 
    "review_date": "2014-03-07"
  }, 
  "Cj5weEcAZKlBb4-4le2Xng": {
    "user_rating": 3.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Danielle L.", 
    "review_text": "Decent for a neighborhood dive. They accept credit cards which is also a plus.", 
    "review_date": "2014-05-20"
  }, 
  "ZObHXI05ILUFpDo_m7DjzQ": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Andrew D.", 
    "review_text": "Back on the Drink hunt trail!   A quick dash up the hill to the next bar, The boardroom. We quickly found the clue above the bar. Nice  spot too. I'm really glad we went along on this drink hunt. Great way to discover new haunts.    A round of drinks and a couple of baskets of tatertots later, (delicious by the way), we bolted down the hill to the finish line.......", 
    "review_date": "2012-01-04"
  }, 
  "QgPGXQqSwxhEAY5zUq3aCg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve S.", 
    "review_text": "hmm....  3 flat screen tvs? amazing, spicy, bloody marys? one of the best, spiced, burgers in town? hot girls? not too expensive?  i guess i'll be watch a lot more sporting events here", 
    "review_date": "2007-01-14"
  }, 
  "_xejmoOW24MdCKFCIGqFpw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher R.", 
    "review_text": "Monday Nights at Boardroom The Boardroom in North Beach (<a href=\"/redir?url=http%3A%2F%2Fwww.boardroomsf.com%2F&amp;s=0708e43cbbfb0f15c7cafc9ae82add09e40f8f4a3a0c7b0d704ab7cf3f0792e0\" rel=\"nofollow\" target=\"_blank\">boardroomsf.com</a>) has a very Chicago-style weekly special on wings. This is the kind of place I miss when I'm looking for the wing specials. Solid wings and a good beer, out the door minus a $20. The wings are good flavor, a bit saucy, and well cooked. Take a friend a split an order of 20. Its plenty to get all over the place and leave your fingers stanky danky in a good way. Hit it up. Definitely worth it. Finding a good seat might be tough, but its okay when all the people there are dingers just like yourself.  <a href=\"/redir?url=http%3A%2F%2Fitsawingding.blogspot.com%2F&amp;s=6e82f8ce02ce75578c4b705bc7f96ef485c62180e999f6724fed025105a0b9dd\" rel=\"nofollow\" target=\"_blank\">itsawingding.blogspot.com</a>", 
    "review_date": "2012-01-26"
  }, 
  "6ATfXxQLQuRAQ30-nLI6Yg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph F.", 
    "review_text": "Sorry to smack this place down... specially since I'm a local but I just don't seem to have a good time.    Really small place, and a little too much trouble from the doorman (when I was there anyway)  for what it is.  The guy seriuosly accused my REAL id of being fake.  He threatened to call the cops, and I egged him on.  I guess my confidence came through cause he let me in.  I won't go as far as giving it 1 star, because I can't say antyhgin HORRIBLE happened here.  Come on a tuesday night and if trivia is your thing you'll have fun...  i'm a local and I NEVER want to go here.  When I do, i leave within 5 minutes... what else can I say?", 
    "review_date": "2009-06-10"
  }, 
  "cY2O_YfM_e45jkiYl4U3Sg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jordan S.", 
    "review_text": "We came in last night for trivia and had a blast.  Service is great, considering how busy they were. $5 margaritas all night. ***I accidentally gave a lousy tip, I mean I did have 5 margs (but I felt really bad about this morning). So if you're reading this i promise to give you more the next time we are there (most likely next tuesday).  The food was delish too, grilled cheese and tomato soup and I split the bacon mac n cheese (only $6 for a big dish) it was amazing. I definitely want to try their brunch sometime.  The bar is pretty small so you wanna get there early if you are doing trivia to get a spot!  We will be back next week!!", 
    "review_date": "2014-08-20"
  }, 
  "MbrBwPdH1Qydr1urjW9ARg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben N.", 
    "review_text": "I mean, when you're looking for a good bar, you want:  1) Cheap drinks? Check 2) Small crowd? Check 3) Anything that's wrapped in bacon? CHECK!! 4) Cool bartenders? Double check.  Great place to blackout on Sundays during COLTS GAMES!!  Go Horse!", 
    "review_date": "2010-08-06"
  }, 
  "_0rGBUP6QVsldXbiGbJH3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert W.", 
    "review_text": "Great place to have a drink and definitely have a bite to eat.  The food here is much better than in most pub / bar establishments.  The personality changes depending on the day and time.  It can be a lively music filled place, a play bingo and trivia place, a great bar to enjoy drinking with friends, and definitely  a place to enjoy some football or baseball.", 
    "review_date": "2008-02-19"
  }, 
  "dE9YaRaUtkDm-xJrW3BSPg": {
    "user_rating": 3.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Shane R.", 
    "review_text": "came here after dinner w some friends at firenze by night down the street.  its just another small sf dive.  at least there were no hipsters there.  bartender was friendly.", 
    "review_date": "2013-05-22"
  }, 
  "AoIqYDqqIk2pL5eS_abpCg": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Emily R.", 
    "review_text": "Boardroom is the perfect, sticky, delicious-bar-food-fried, fast beer and shots football bar I've been to in SF. It's a serious Arizona State University football bar too! A-S-UUUUUUUUUU!!!!", 
    "review_date": "2013-12-05"
  }, 
  "jfQFLfyFtSDsvlf5r-EiFw": {
    "user_rating": 2.0, 
    "user_location": "Pismo Beach, CA", 
    "user_name": "Whitney C.", 
    "review_text": "I went here for Trivia Night and I wasn't that impressed. It might be because I love my old trivia joint and this just didn't cut it or it could be because the girl who runs it sucks at it. She needs an assistant or someone to help her host the thing. It takes too long for her to tally the questions and she comes up with the questions on her own so they are pretty narrow in range. It was also extremely crowded and not well suited for trivia. They had one round that was visual on the TV and the people in the back had to make their way to the other side of the bar to see it. It just wasn't as fun and carefree as the one I'm used to. Get there WAY early if you want to get enough space for a team of more than just you.  The bar itself is cool. A bit divey but has great personality and could be a cool hang out when it's not slammed with people. I'd probably go back to just socialize and drink on any other night...", 
    "review_date": "2011-04-10"
  }, 
  "K0zrsXqu55JPwT4dnvNUDg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vincent K.", 
    "review_text": "I always feel silly reviewing bars and lounges, because often times it isn't the place itself that makes the experience, its the people you're with.    But in this case, they did serve food and I was around good company so this can't go wrong.    While waiting for our table at Tony's, our group decided to venture out for a drink.  I've been wanting to try the po boys and drink specials, so I decided to scope this place out.  it's not a huge spot, but the moment I walked in, I could already see me parking myself here every friday like my favorite local bar (if I lived around here of course).  The drink special they had was a $7 Fernet (or Jager) shot and PBR.  wow.  Just wow.  2 of those please for my friend (who has never had Fernet before) and I to get us loaded up to be unable to taste any goodness from Tony's Pizza.    We also decided out of starvation to munch on some Bacon Wrapped Tater Tots, Onion Rings, and Fries, your typical bar fares.  Delicious.  Nothing comes outside of expectations, unless you had walked in thinking you were in a gourmet restaurant where servers tend to your needs.  No.  This place gets you that greasy bar snack goodness and nothing disappointed.    We walked out merrily relaxed, and having satisfied a small episode of the munchies.  I'll have to return to this joint in the future for more.", 
    "review_date": "2012-03-08"
  }, 
  "7OfrRi-xGESQsBpJFrlfLA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "jozilla w.", 
    "review_text": "this place holds a special spot in my heart--it's my local tuesday trivia spot.  I've been going every tuesday for over a month, and it never disappoints.  The vibe is nice and laid back, they serve seriously delicious $2 fish tacos, and the quiz itself is just right.  not too hard, not too easy, and always enjoyable.  my ONLY only only beef is that for some reason there is ALWAYS a line for the bathroom when I want to go, but i suppose this is out of management's control short of just adding more bathrooms. ;)  props also to the bartender who joined our trivia team last week!", 
    "review_date": "2008-09-22"
  }, 
  "gurcmVDESVQ8X20xpw4btw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Stephanie M.", 
    "review_text": "Great sports bar. This place is no frills and a fantastic place to check out and watch a game.", 
    "review_date": "2013-12-11"
  }, 
  "yVZGQfKeBBYFElt-nsfxBQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Kristin M.", 
    "review_text": "Who likes Trivia? I do I do! Tuesday night at the Boardroom are a must. Trivia night starts at 8:30. Drinks are cheap until 7 during happy hour and the 2$ chicken tacos were unbelizable (2 guys at the bar at the shirt on from Belize no joke!)  Con the bartender is awesome. Super friendly and his buddy bartender (can't remember name right now) hooked us up with a free round after refusing to help us with a trivia question. Definitely a good mid-week break in North Beach.  Oh yea, the Trivia host Laura is a gem as well.", 
    "review_date": "2008-08-28"
  }, 
  "KQZZHT9t1jwbItb-iQLIgQ": {
    "user_rating": 5.0, 
    "user_location": "Charlotte, NC", 
    "user_name": "Trent W.", 
    "review_text": "Was visiting from out of town and needed a great, friendly sports bar.  I came across the Boardroom via several reviews/posts from several site -Yelp included.  I showed up for some Thursday night NCAA football (GO Tigers!) and was pleasantly surprised with the vibe, service and food.    Kieth  was behind the bar and made sure the drinks were refilled quickly, food arrived promptly and he is happy to weigh-in with recommendations on the menu.  All-in-all a great venue and experience.  When I am back in SF I will be sure to return.", 
    "review_date": "2013-10-02"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "Golf pub crawl hole #5 ouf 9 (Saturday)  The word of the day is MUFFIN TOP.  Have you ever seen a person who tried to squeeze into a piece of clothing that was just too tight and over flows out of that garment?  Well trying to fit 40 people on a golf pub crawl in Woody Zips small frame when there are 20 drinkers already there is just like that.  I had a good time, but the quarters were muffin top.    The bartenders were friendly and the decor was nice.  I'd like to go when I have more room.", 
    "review_date": "2007-12-14"
  }, 
  "PbmtoKdQ_Td9Ez_WwlEZig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam S.", 
    "review_text": "Everyone has their favorite bar.  This is my favorite in SF.  Why, you ask?  Reasonably priced drinks - particularly at Happy Hour. ($4 pints - some good stuff on tap)  They introduced me to Frenet.  Excellent service.  The bartenders are super cool and take the time to get to know their customers.  The patrons are always interesting - Definitely the 25-40 (mostly male), affluent/professional but not flashy set.  There are plenty of the fratty types, but I have yet to see the obnoxious variety (I'm looking at you, Wreck Room ;) )  I've had a lot of good conversations with folks while grabbing a few pints and watching games.  Generally, there are some gals there too.  It's a good sports scene.  I go for MNF and hockey games.  One of the bartenders is a Leafs fan.  Overall, it's a relaxing place to unwind and grab a few drinks with buddies, and a good place to pop in by yourself.  And, the food.  I love tater-tots!  They've got'em.  The sandwiches are all good - I'm a big fan of their burger ($10 if you get it with Cheddar and Bacon, with a side of tots).  I've tried the Pulled Pork, and that was also terrific.  They do Bacon-Wrapped Tater-Tots, which was actually how I found out about the joint.  Yes, they're great!  Also, for Happy Hour they do $4 tots and nachos (and, I believe they make their own chips - they're good.)    I won't hold the fact that it's an ASU bar against them  ;)", 
    "review_date": "2013-11-17"
  }, 
  "L9AJkS7jMhf8cYo3AE6rjQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenny G.", 
    "review_text": "So what's not to like about this place.  It's becoming a favorite spot.  Jenn is great, she makes you laugh, and great drinks!", 
    "review_date": "2012-09-07"
  }, 
  "kIFja02Dxs7KdUHj_rY0nQ": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Alysha K.", 
    "review_text": "Small, hole in the wall, neighborhoody, pub in the outskirts of North Beach. Good service, tasty bar bites, and bumpin' jams.   The bacon wrapped tatter tots are crispy and unique, and the nachos are humungous topped with everything you can think of!", 
    "review_date": "2011-11-09"
  }, 
  "GDnuRcvlkMRHJW1jqYIqpA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Renee N.", 
    "review_text": "Couldn't give a shit about sports, but sweet potatoes with a huge dollop of sour cream?  Yes please!  Weekly food specials made us wish it were Sunday so we could have $5 chicken and waffles, but the $7 pulled pork was delicious enough that we didn't resent Thursday too much.  Corona buzz and tunes from my freshman year of high school FTW.  Will be back.", 
    "review_date": "2010-06-11"
  }, 
  "NA33m2bpLoNAaJWzV_2gsg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ali C.", 
    "review_text": "Great place to watch football. The bloody Mary's are amazing as well. This place has bacon wrapped tater tots... Enough said.", 
    "review_date": "2013-09-22"
  }, 
  "M1fW9PZfi07Mk5vXFkF6QA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lisa E.", 
    "review_text": "I watched my beloved football team play, heard Alice in Chains over the sound system, and had greasy food handed to me by a complete smartass.  The Boardroom is what I hope for in a marriage.", 
    "review_date": "2012-10-13"
  }, 
  "Zk0RGkhWxcSlbsRzpu3DmA": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "dan d.", 
    "review_text": "I really want to make the Boardroom my new Moe's (See: Moe's Crosstown Tavern, Charleston, SC) but I just can't.   I love the homemade corndogs and the bacon wrapped tater tots are awesome, but the burger just doesn't do it for me.  Cheap drinks are a plus.  Check out the beer and shot specials including the dirty hipster - $6 for PBR and Jameson.", 
    "review_date": "2009-12-13"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Decent bar right around the corner from my place, so definitely convenient. I think they are having an identity crisis at the moment, trying to be all things to all people. However, I'm sure that will all settle and it'll just be another good bar. Until then you've got your Saturday/Sunday football games, foosball tournaments, Salsa Night, DJ Night, etc...\n  Update: This also happens to be an OSU fan's safe haven. Since I grew in Columbus and lived there for more than half of my life, this is an added bonus...Go Bucks...", 
    "review_date": "2006-09-18"
  }, 
  "srhp1Zcf_rbhF4dIiPRYAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah W.", 
    "review_text": "Any bar that can hang with college and sunday football is worth 5 stars to me!  This bar is awesome.  I've now been there at least a 1/2 dozen times and I am constantly more and more impressed.  The bar staff can keep up with any crowd and is always with a positive attitude.   I will always applaud a bar that sells PBRs in bottles and plays the game.  I recommend going and and spend all your money because they are worth it!", 
    "review_date": "2011-09-25"
  }, 
  "AWnyRyhCx8upY8uJ5IH_DA": {
    "user_rating": 2.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Andrew J.", 
    "review_text": "The bacon wrapped tots are the shiz but the BELT was dry and flavorless, lacking avocado and any perpetual longing for a future visit. The onion rings were decent and the one dude I met was friendly but Overall  this bar is good for the tots but lacks much else", 
    "review_date": "2014-03-05"
  }, 
  "WjvIGdLc7ZZpiux3P6xSEg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina G.", 
    "review_text": "Decent sports bar. I came here for the first time last night for trivia. Bacon wrapped tater tots are good but kinda a rip off at $8 for like 10 of them....  I would come back though.", 
    "review_date": "2013-01-09"
  }, 
  "Tf7yUTBsqwEndz6XGYC74g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacey L.", 
    "review_text": "Trivia night is a lot of fun. I think the music and Movie questions were a little too hard but everything else was fun. We have never won the game but we did win a free bottle of Champagne for the most original name! It was George Carlin's 7 words!! You know the ones! :)", 
    "review_date": "2008-06-25"
  }, 
  "Q9ZzBvrzeVz1SMaj5kx7qA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg D.", 
    "review_text": "I had not heard of Woody Zip's until I went to a party there last December and it was great. I have returned a few times since then and every time it has been one of the most pleasant and all around \"happy\" bars I've ever been in. Not only do they have great drinks, they also have really great food. Although the lowly corn dog may not be your thig, they make a homemade corn dog that is amazing. Great place to watch a game.", 
    "review_date": "2007-01-27"
  }, 
  "Vh3E8METhJzLBLTntO_jgg": {
    "user_rating": 3.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Yvette O.", 
    "review_text": "My friend and I hit up the Boardroom on our Taco Tuesday Tour a couple weeks ago.  Very friendly service.  The bar was nice and clean for this type of venue, kind of \"sports bar meets dive\" bar.  Good spot overall.  Definitely has that \"everybody knows your name\" vibe going for it.  We also hit up Mojito (<a href=\"http://www.yelp.com/biz/mojito-san-francisco#hrid:dvymTm6MwwMq3Ph02rp7oQ\">yelp.com/biz/mojito-san-…</a>).  Happy hour and food prices were better at Mojito, by far, but the tacos tasted better at the Boardroom.  Their tacos rival Nick's any day, but their shrimp tacos can't be beat.", 
    "review_date": "2009-12-29"
  }, 
  "g-g0D2GIW8q2zV4sxKhfWA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Thor M.", 
    "review_text": "After our prior incidents, I decided to give the Boardroom another chance.  After our wedding we decided to have a pub crawl throughout North Beach.  I contacted the owner about stopping by his bar for an hour or so.  He got back to me quickly and offered some decent drink specials including $3 bud light, a $6 hornitos Margarita, a $5 Three Olives Grape Vodka and soda, and a $3 shot specials.  This time the bartender was great - nice, attentive and quite the hard worker.  We brought in 35+ people and as the only bartender on staff she hustled to get us all drinks.  People waited a while, but it wasn't for her lack of effort.  Overall, it was a good experience and I would return.", 
    "review_date": "2009-07-01"
  }, 
  "QXAkmRjGJvLg3fX65A9oNQ": {
    "user_rating": 4.0, 
    "user_location": "Washington Park, Denver, CO", 
    "user_name": "Lisa A.", 
    "review_text": "Woody Zips is a really cool neighborhood bar. I have been a few times now and I always have a good time. Bartenders are really friendly and pour some strong drinks. Not really sure I would call this place a sports bar, but if you are looking for a laid back place to have some drinks, I would recommend this place!!", 
    "review_date": "2007-06-18"
  }, 
  "lLfcbYGTeVxQN5Ig0ompJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elena N.", 
    "review_text": "So I came here for a Grouper.  If you're wondering what that is, just look it up.  LOL!  The vibe was actually great for the Grouper.  We got a table in the back and ordered drinks and some snacks.  The servers/bartenders were awesome and it was a great place to have a conversation.  It wasn't too loud and i never felt like I had to shout to be heard.  My only regret is I never tried the bacon wrapped tots!  Next time?", 
    "review_date": "2012-07-23"
  }, 
  "Lt1t_ukRbcI2tdx7-1RgeA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mimi X.", 
    "review_text": "so - so  jukebox didnt work - (or wasn't on), tacos were aight (i think they made me and my buddy sick that night but who knows), bartender was cool, didn't stay for trivia. even at its most packed, it didnt seem annoying so this would be a good place for a chill, relaxed night.", 
    "review_date": "2009-01-14"
  }, 
  "5pBi1CSpm9467jh7PSBDkA": {
    "user_rating": 4.0, 
    "user_location": "Laguna Niguel, CA", 
    "user_name": "Mary R.", 
    "review_text": "As you can tell from most of my reviews, rarely do I venture into the North Beach area.  In fact, this might be my only review from there?  Hmmm, interesting.  I came here with my friend Misha K. (who drives, which is probably the only way I'd end up in North Beach in the first place) He'd recommended taco tuesdays.  (Little did I know it was Tequila, Taco, Trivia, Tuesdays)  We were sort of early enjoying our DELICIOUS cheap beef tacos. (I'm usually a chicken person, but the beef was way better!)  Then the trivia night started up and it started to get crowded.  But in a good way, it wasn't packed, but maybe just...cozy.  So pleasant surprise, we were in the lead the first round of trivia, so we decided to order another round of beer and tacos and stay for the next group of questions.  Mmmmm.  Such a fantastic surprising night for a Tuesday!  I'm totally going back.", 
    "review_date": "2007-08-21"
  }, 
  "JFTt8rdVR9IY6Gilp-xEGA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Kelsey S.", 
    "review_text": "You almost wouldn't notice Woody Zips just walking by, and I even had a hard time finding it when I was actually looking for it. That just makes it all the more fun, because the people there meant to come, and have probably been there many times before. It's tiny, but the jukebox is always cranking and the bartenders are partying right along with you. A round of shots for the whole bar is a regular occurrence. Definitely a lot more character than your normal 'dive' bar, and always a wild time.", 
    "review_date": "2007-10-15"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 9:07pm/59°F clear  Purpose: Needed to find a nearby bar to catch the last half of the warriors/cavaliers game without being notice alot. Didn't feel like walking around saying hi to everyone like a town mayor as I know most of the businesses nearby, just didn't feel like talking much.  Ambiance: Small neighborhood joint were the owners knows everyone by their names. Even if you don't know much about the place you will when you leave. Not much going on here it's all about locals stopping by for a drink or so. Since it's small place when there's Giant's or 49er's you will have to use a megaphone to reach someone across the room. 4-5 flatscreen spread through the place nice wooden bar counter with smooth contour groove sit about 12+ at bar if you counter the ends too. A dartboard lot's of pennants and posters articles of local teams some trophys but couldn't get close enough to read the plaque.   Staff: Guy at counter was nice greeted me how you doing? I sat down he said I've seen you around before and I answer I bet you have. We started talking about the upcoming 2014 season for the Giant's.  Cleanliness: It's a bar/restaurant type so I can't say it was clean or not as some areas maybe opposite of what a business should be, let's say I will eat here again.  Eats/Drinks: Order wings $9 and thinking about the bacon wrap tots. Not a fan of fried food but once in a while, yes. Not really sure as I was watching only second half of the game. So bartender walks off and brought me 5pcs on the house. Thank you! Quite delicious. Wash it down with speakeasy $6 including tips.  Products: Mostly finger foods that are easily made in matter of minutes, deep frying. Wings,tots,bacon wrap tots,nachos,sweet pototo fries,hummus, chips/dips,onion rings etc.  Punch Lines: Neighborhood bar,chinatown,little Italy,SFPD Central Station,parking garages,funeral home,Washington square park,fisherman wharf,cafes,italian restaurants,muni buses,post office,banks,delis,trinket shops,coit tower (closed for remodeling),Russian hill,Fairmont hotel,Mark Hopkins hotel.  Tradeoffs: A nearby friendly environment for the locals to meet up or socialized.  Final Thoughts: Don't get me wrong it's a cool place it's just the menu options and noise level is unbearable. I understand it's a sports bar too. Guy yaps on his phone probably to no one because he was to drunk to recognized there's no one on the other side. Those ghost calls can really mess you up pair with drinking. The kind that you think it's vibrating picks up phone no call inbound so you yap about your day to no one. I will come back again with my Giant's/49er's jerseys depending on sports season.", 
    "review_date": "2014-03-15"
  }, 
  "krhueH9uihxVjhhDNcqi5g": {
    "user_rating": 5.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Rebecca S.", 
    "review_text": "The hopes of a breakfast at Mama's were squashed when it was after 11:00 AM so obviously the line was even more absurd than expected, so we yelped this spot.  My boyfriend thought I was crazy as we were wandering through North beach and show up at a seemingly divey bar.  I pleaded my case, \"they get great reviews!!!\" :D so we walked in and were greeted by the bartender who gave us great suggestions for breakfast and made fresh pureed fruit bellinis. (melon, kiwi, champagne = perfection)  I ordered the breakfast sandwich with tots of course and boyfriend got the eggs, sausage and tots.The meals took some time to prepare, which during that time we got to taste their home made bloody mary mix, irish cream and pickled green beans ~ the bartender (I am blanking on your name!) was so friendly and everyone in the bar was having a great time.  Followed up our breakfasts with some Strongbow and was a perfect start to our day.  P.S. Found out this is one of the few 49ers bars in the city so it's packed on game days!", 
    "review_date": "2013-05-10"
  }, 
  "obd2ZozY9RJL8t_hSyJDKg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana Elena B.", 
    "review_text": "So i totally love playing games and the fact that their is a bar that provides a fun trivia night is totally SWEET. . . the trivia was entertaining and somewhat informative. Sometimes it was hard to hear cuz everyone was talking and i did see people cheating which takes a litle bit of the fun out of it. but the $2 tacos looked really good. . .  however. . . they do NOt pour their drinks very strong. My first drink was strong but for some reason he thought i wouldn't notice that the second one was not. . . not sure why bartenders do this. It's not gonna make me less drunk i;m just not gonna order drinks from here.Just pour me the same drink EVERYTIME. If you don't i'm gonna be a grummpy drunk NOT a HAPPY drunk. I have to say though if your into cheap beer this is the place to go.  The establishment itself is not very big so get their early if your going for trivia. And they are guilty of my biggest pet peive... not having the coat hooks under the counters to put your purse or jacket. BIG FAIL THERE. It was really stuffy and hot. as far as the crowd it's North beach...need i say more", 
    "review_date": "2008-11-26"
  }, 
  "V7VAbouEnCt39fsA1MM6RA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kelly T.", 
    "review_text": "Best Kick-Ass Bloody Mary Ever - That's all that needs to be said - Thank You.", 
    "review_date": "2010-10-24"
  }, 
  "y1GXDMOmu4lnsCI7TSi0sg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chris L.", 
    "review_text": "been here many times and love this place. always have drink specials and good place to watch 49er football. went for GB vs SF and this place was standing room only and it was loud and crazy. people spraying beer all over the bar , groups of people hammered as fuck at 1230pm .   Try a shot of fireball, it will blow your mind!!!!!  The morning bruch area lookeed sketchy....not only the food but placment of the setup, like someone could get raped back there!!", 
    "review_date": "2012-12-23"
  }, 
  "Ae1atVuqSF8r5QkchacXVg": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Samir K.", 
    "review_text": "I rarely give 5 stars, but this place fuckin rocks. Last night was the first time we went there for trivia night, having heard very good things about it, and boy it did not disappoint. The tacos were solid, and for 2 dollars each you could eat to your heart's content- I prefer the steak. The trivia girl was hilarious and pretty wasted, while the bartender knew what he was doing and didn't hate on us despite wearing A's gear in a giants bar.  Another star for the multi-media (pictures and music) trivia night. ANOTHER plus was that we won a bottle of champagne for best name (mustache rides are free).  the one caveat to this was the fact that parking is always awful in north beach, and it took us about 20 minutes to find parking. Outside of that, the boardroom rules and we likely will come back next Tuesday!", 
    "review_date": "2010-11-03"
  }, 
  "Hi2u6Rz_i6fOOe5SoYO6GQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan B.", 
    "review_text": "A whoop whoop is what I give the Boardroom. This is one of my favorite bars in SF. Of course I have a slight bias because I live across the street but it truly is a great atmosphere and always has fun people...   Oh and definitely check out Taco's Tuesdays! The tacos are to die for... :)", 
    "review_date": "2009-04-10"
  }, 
  "R2p221627ZK5IhFBVI0OzQ": {
    "user_rating": 3.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Constance C.", 
    "review_text": "Bored. Room.", 
    "review_date": "2009-05-25"
  }, 
  "UuxiH2oLycDhMv7TKQ5EVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy A.", 
    "review_text": "The Boardroom is a bar I really wanted to dislike, and I know that sounds mean but I'll tell you why.   The bar that is The Boardroom was once the bar that was Woody Zip's. Sure the name might not have been as clever but Woody Zip's had, and I @#$% you not, the best Buffalo Wings I have ever had. Ever. I don't know what happened or why the name went, but those oh so epic wings went with it.  And alas, all was lost.   So I when I returned to this bar with quite the humbug attitude, just looking for a reason to rail on it, I found that it's still a super fun North Beach spot.   Despite it being a small space, the place can get super busy on the Friday / Saturday nights. Loud music and large groups are a staple. The bartenders are really nice and super fun, the folks in here are typically friendly and having a great time. The place is essentially just like the bar I remember it to be, minus those golden god-like wings.  The food here is still pretty damn good bar food and they have some good happy hour specials too.   So, as much as I don't want to admit the new girl is just as much fun as the old flame I had, I'll give The Boardroom a thumbs up.    Dear Woody Zips, we'll always have our wings   xoxox  ~Andy", 
    "review_date": "2009-02-10"
  }, 
  "fU6DKMw5aPmIEkSi_6iLZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leslie J.", 
    "review_text": "I really love this bar! Great service, cool local vibe, yummy food, specialty drinks, and a hip atmosphere. I'll definitely go back--probably many many times.", 
    "review_date": "2008-01-22"
  }, 
  "6zjoJQiv9m5ww99PhKTqFw": {
    "user_rating": 4.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "Jun W.", 
    "review_text": "Simple happy hour menu. $6 for a can of Tecate and a shot of Jager...order a few and you'll be feeling very happy. Add some tater tots for $3 and you're good to go. Well drinks are $4. They have about 5-6 beers on draft.   I don't recommend the original po' boy. It's a sandwich with fries, small bits of pulled pork and gravy all smothered in the middle. I imagined it to be meatier. But it basically turned out to be gravy and fries between two slices of bread.   The bartender was very friendly. He continued to give us happy hour prices even though it was past 7pm. You won't get your tourist crowd here for sure. It's definitely a locals joint.", 
    "review_date": "2011-02-23"
  }, 
  "UxJoHsSFqc3TcM6UkIPmeA": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Patrick G.", 
    "review_text": "This is a really good spot on any North Beach pub crawl. I've been here a few times and it's never too crowded. The staff is generally pretty cool and pretty efficient. This is the most neighborhoody bar in the area though....which is great. It helps keep a lot of the douchers away.  Every time I go in to that place though, I can't think of anything but the great times I had there when it was \"Shannon's\" and Katrina was the smokin' hot blond behind the bar.", 
    "review_date": "2011-11-15"
  }, 
  "GO0GU6sTOdgtUpAwzj1Tbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Manny R.", 
    "review_text": "Cool little bar with a lot of locals,  din't try the food so can't say but went on Trivia night and it was full and it seem fun.", 
    "review_date": "2012-07-18"
  }, 
  "VK-ds3dGSSBoavkFde3e2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Denise B.", 
    "review_text": "I don't know why I didn't find this bar earlier!    It's the perfect size for a neighborhood hangout: (the size of a large room!), the staff is nice, they serve some light food and snacks (tater tots, corn dogs, hummus, fish tacos, fish and chips), the drinks are not expensive and it's not a super young or old crowd (ie. late 20s to young 30s to young 40s).    Now I have somewhere else to go to in North Beach! Yay!", 
    "review_date": "2009-08-07"
  }, 
  "tmxIsLKcNd9qG6nbL6ONbg": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Stephen S.", 
    "review_text": "Was in here on a chill Wednesday night. Scanning the beers, I was unsure what to order. I noticed one tap I didn't recognize and the bartender noted it was a Firestone Pale Ale that he highly recommended. I figured I'd see if he was worth his word and was pleased that he was. They'll give it to you straight here and give you something good.", 
    "review_date": "2011-06-09"
  }, 
  "Bx1iLCgUyu4HPepkYut4Uw": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Alison B.", 
    "review_text": "I love this place. Bartenders are great, drinks are cheap and strong, tots are delicious. This place will treat you like a regular even if it's your first time there.  I feel like I have been looking for a bar like this for years... so glad I finally found it!", 
    "review_date": "2012-01-24"
  }, 
  "Ppm_nqivtMfP4eFIvOm19A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sus... B.", 
    "review_text": "A little loud, but the unpretentious atmosphere, interesting drink options and really good food made up for it, especially the surprisingly good tacos (no, seriously, they're magically delicious, sober or not).  Drinks are cheap too, vodka sodas are $5, or $3 during happy hour (5p-7p and 10p-11p).  Trivia night is reeeaaaallllyyy hard - our little team of 3 (Hi Emily!) actually held our own, all things considered, but we still got our asses handed to us, particularly in the movie round.  We've resolved to come back with a vengeance, hopefully with more people.    It's not Kennedy's, but it too is worth the trek out from my usual haunts.", 
    "review_date": "2008-06-11"
  }, 
  "sqCZoVjchcwCsv5i8xPRWQ": {
    "user_rating": 5.0, 
    "user_location": "Jupiter, FL", 
    "user_name": "Samantha P.", 
    "review_text": "Delicious food, fabulous mimosas, amazing Bloody Caesars, and a hysterical bartender.   Thanks Martin for helping us on our Sunday Funday brunch", 
    "review_date": "2013-09-01"
  }, 
  "mQJWWzmsYXwZ56P76UZ6dA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kirsten F.", 
    "review_text": "First time here and I already love this place.  Not particularly close to my neighborhood but so worth the extra distance.  First of all, the people who work there were awesome and friendly.  Second, we were there for the Ohio vs. Michigan game and my husband (and son) were thrilled to see so many Buckeye fans.  Third, we only made it through the appetizer menu but it was a good indicator of how good the rest of the menu is (look forward to trying more).  And fourth, our friend who came with swears by the Hornitos margaritas.  So, good job you guys.  Keep up the good work!", 
    "review_date": "2006-11-18"
  }, 
  "WhXRtsr8_hGb-gRGS-BzsA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "CE R.", 
    "review_text": "The Boardroom was a great place to watch a few of the Bowl games today. Tots!? Excellent.", 
    "review_date": "2012-01-02"
  }, 
  "KKdBQXnUlVUZ0ZNTfMQoEA": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Tolga E.", 
    "review_text": "Why do I constantly want to call this place Zippy Woods instead Woody Zips? It's irrelevant I suppose...but still. I went to this place for the first time last night, which happened to be an infamous Taco Trivia Tuesday. You have to give it to them - the tacos were AMAZING. Both the beef and chicken ones were phenomenal. It was completely unexpected and highly appreciated.   I actually really loved this place. The bar was low-key but alive, the people were not tourists or the over-the-top locals that crawl North Beach at night. They were local people, at a local bar, for a local night of trivia and whatever. The customers were great and were willing to talk to strangers and meet new people.  The bar itself is pretty decent and has a good, small selection of beers including Boont Amber, Guinness, Blue Moon, Red Stripe. They even saluted the neighborhood and had Moretti La Rossa in bottles. The bartender, an interesting fellow named Blake, was pleasant and all about customer service. He wasn't particularly talented, but I truly appreciated the effort and care he put into his job.   There are a few widescreen plasmas and it's probably a decent place to watch a game. The music was also worth mentioning - what other bar you know plays mid-90's Filter and STP and then switches over to 40's pop? And how could I not give at least 4 stars to a place with a neon Sharks jersey beer sign in the window?", 
    "review_date": "2007-08-22"
  }, 
  "I6WPzpvgWD87Kx-KGJcGCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amie W.", 
    "review_text": "I *HEART* Taco Tuesdays.  Mmmmmm..... More than that, they have at least one Deschuttes Brew on tap at any point in time (at least the bartender said so, so it better not change!).  I think the word is getting out though, so we have got to get another guy in the kitchen to get those tacos whipped up!  And maybe another to pour beers :) Definitely a cool happy hour spot.", 
    "review_date": "2007-04-03"
  }, 
  "XSFEo51pwEoNRGri4z2LjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Olivia T.", 
    "review_text": "As one of my new year's resolutions, I've decided to start writing reviews regularly rather than being a Yelp leech.  So I'm starting with the Boardroom, where I watched the BCS Championship game.  With no specific loyalties, it was fun to watch at what was clearly an Oregon bar.    Best thing about the place is their food.  Being a vegetarian, food at bars usually sucks, but their wild mushroom melt was delicious.  Probably one of the best sandwiches I've ever gotten.  Good drink specials during the game too with $2 Coors Light tall cans and some weird $2 Hef deal that lasted about a minute.  Minus one star for pretty filthy bathrooms.", 
    "review_date": "2011-01-12"
  }, 
  "2_cvh63d0CM33n1cP-3YZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "This place is so fantastic. The bartenders are the nicest around and the food is great. I originally discovered this place because they tended to be a Saints/LSU bar. Now the sports team of choice changes more frequently, but I still love coming.   Went over the weekend and had the corndogs (delish), and hung out with the bartender. He was super friendly, and even gave us suggestions of what bar to go to next since we had a friend from out of town we were showing around. Definitely a must do if you're in the North Beach area.", 
    "review_date": "2013-04-02"
  }, 
  "8wNfJCqBYC_8xMDZjnMyuw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sarah a.", 
    "review_text": "I'll make it brief:  Good jukebox, fun neighborhood peeps, and super friendly bartenders. Good bar food, too! I still need to try their brunch...", 
    "review_date": "2010-10-06"
  }, 
  "Z9boj3QdTXyw4glpJ84Cog": {
    "user_rating": 3.0, 
    "user_location": "Minneapolis, MN", 
    "user_name": "Glen S.", 
    "review_text": "It's a dive bar in a neighborhood with dive bars.  We didn't have any food, but ya know, saw a lot of people eating food that we didn't really want to try.  The service was nice and all, but we wanted to check out.  Questions to ask before you enter: - Do you like dive bars? - Do you want to drink for cheap? - Do you want to have a good time?  If you answered yes to one or any of these, enter The Boardroom at your own risk.", 
    "review_date": "2012-10-18"
  }, 
  "EhAXMJuRwnhQKzXbPqPN6g": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Briana J.", 
    "review_text": "I found this place last Tuesday on Yelp randomly and went for Trivia Night on a fluke. I got there ridiculously early coming straight from work, but Mr. Bartender Keith made me feel welcome while I waited for my teammate (even though I was alone and looked like a loser- couldn't even call my voicemail and pretend to be on the phone because this place is where the T-Mobile signal goes to die).  There were only 2 of us so I am proud to say we didn't suck terribly, but the trivia definitely makes you use your brain. We even won a bottle of champagne for our team name (but I think Keith was just being extra nice!) 2 dollar tacos and tecate, I'm sold. I'll be back tonight with a bigger and better team!  **Update** 9/4/08  Went back this past Tuesday and won! yay for team trig &amp; track!", 
    "review_date": "2008-08-26"
  }, 
  "Rd_k48XNACxaSBN0D8uk3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristan B.", 
    "review_text": "Great place to catch a game (what ever sport you want to see). There are at least 5 tvs inside. Its a casual local bar that can get packed depending on the day.   Goods good, had the tachos - tater tot nachos. they came out piping hot with lots of steak. A great price for the amount of food.   The bloody marry was good, some spiciness to it with olives, peppers and green bean vs a celery stalk. YUM", 
    "review_date": "2014-11-06"
  }, 
  "3F4jxfkqZN76wZuSF2OAaw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "Winning the trivia match the first night we ever set foot in The Boardroom had us hooked.  Tuesday night $2 Tiger Beers also got me hooked.  A wandering dog in a bar is a good sign.  Keith is freaking awesome.", 
    "review_date": "2008-09-02"
  }, 
  "9lKCs1d4AE5eOmtIpuviAA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chuck R.", 
    "review_text": "An \"ASU bar\" but don't have the PAC-12 network. ? nuff said.  This makes me sad.  #GoDevils #getthepac12networksoon", 
    "review_date": "2013-11-30"
  }, 
  "IxKjgqLAG6teY_pqGnh9ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Celeste M.", 
    "review_text": "I am really happy that The Boardroom is just around the corner from my apartment.  I am not so happy that I've only been there once, but my first experience was awesome!  After a quick dinner at Mo's, Luis and I met up with some cool yelpers at The Boardroom last Tuesday for $2 beer special/tacos and Trivia Night.  I agree with Mr. Luis, we should have just had dinner at The Boardroom, too -- the menu looked good and how could I have turned down tater tots and fish tacos?!?!  Will definitely try food next time...  We arrived a little before eight, bar wasn't as crowded as we expected.  A few Yelpers already stationed along side the bar.  Drinks were ordered.  $6 for a can of Olympia beer and a shot of Jager... tempting, but no thank you.  I had Mirror Pond Ale all night long.  More people arrive, our Yelp team got bigger so we had to split in two different teams before trivia started.    Trivia.  7 Categories.  Current Events.  Naming the Person's name by looking at a printed picture. Pop Culture. Music clips. Commonalities (things words have in common). Movie clips. Random category.  70 Questions total.  Rule number 1 is do not yell out the answer.  Rule number 2 is no cheating (aka: using iPhones to get answers).  Rule number 3 is DO NOT YELL OUT the answer.  Simple enough.  The host is great, she had to remind a few people about the rules and had a bit of trouble with the microphone.    Trivia lasted for a while, maybe about an hour and a half.  In the end, my team lost by a couple of points.  But hey, we still won a $25 bar tab for the best team name... \"A Colin in the Barack is worth two in the Bush.\"  Can't complain.  Good food and drink specials, great service, nice casual bar and an interesting crowd.  I'm so disappointed that I'm not here more often.  One of my 2009 New Year Resolution will be to go to The Boardroom more often -- that'll be an easy resolution that I can keep all year, I think.", 
    "review_date": "2008-12-29"
  }, 
  "0E7L58EyWJV5mOC4qxvjXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "North Beach Burger.... Heyyyyyylllll-YEAH!! Cured pancetta, fried egg on organic Black Angus? With sweet potato fries? I licked that plate clean.   Free WIFI so I can finish this review...   Great photography on the wall, large prints depicting extreme sports. Being a photographer I can totally appreciate the quality wide angle work on the basketball scene, the cool skateboard shadow shot and snow sports action sequences. I can't believe I left this out of my first review, since it's a big reason I kept coming back in the first place.", 
    "review_date": "2010-08-22"
  }, 
  "zB_LS3R978pzNw2wosFYBQ": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Maggie W.", 
    "review_text": "Best bar food I've had in a long time, and especially in NB. Justin get's it done, and it's always delish...  And the bartenders are great, too, especially Casey, Sal and Ben. It's a real \"neighborhood-y\" bar, they get to know you and treat you like regulars all the time. Makes you wanna come back just to say hello, but then you end up staying all night! :)  Keith, the owner, is a great guy and also takes the time to get to know his customers.  Easily, my favorite bar in NB.", 
    "review_date": "2012-02-29"
  }, 
  "gIAsnmMNxffdh6BQt1rtXg": {
    "user_rating": 3.0, 
    "user_location": "East Bay, CA", 
    "user_name": "L F.", 
    "review_text": "Nice spot with cheap drinks, happy hour and trivia night.", 
    "review_date": "2013-06-20"
  }, 
  "NUyMCIlRHqZ6BvgtVPXqZQ": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Marc M.", 
    "review_text": "Its a low key place to watch some games.  I went during NCAA tournament and everyone was very into the games which was appreciated.  Good beer, but their mixed drinks were pretty poorly made.  We had the hummus appetizer which was good.  Guy to girl ratio was as expected for a sports bar ....in san francisco :-\\.", 
    "review_date": "2007-03-17"
  }, 
  "O2qAlgUHKft3Lm-hPqO7rA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jessica C.", 
    "review_text": "On the way home after an evening in North Beach, we decided to stop in and have a drink at Northstar. I always used to walk by Woody Zips on the way but never went in. As we passed once again, we spontaneously decided to try something different and headed inside.  I've heard that Woody Zips is somewhat of a dive, but it was decorated really well with flat screens, great lighting, cool artwork and colorful painted walls. The beer selection was decent and so cheap- $3 for a draft pint! I got to talking with the bartender Luke and discovered that he is one of the owner's of Woody Zips. He and the other owner live above the bar and named the place after their fathers. After talking some more, he showed us their upstairs private room that can be rented out, which reminds me of Butter's private room- it looks like more like an apartment than a bar.  The clientele was very relaxed and not many people were there, which was exactly what I was seeking in a Wednesday evening. Swapping stories with the bartender (Luke told me about Spec, the old man who owns Specs and can still be seen there) and relaxing with my friend made for a great night. I really feel that this place could become my \"neighborhood bar\" and can't wait to return.", 
    "review_date": "2007-09-14"
  }, 
  "-h9oaqGRjqH5nzTUD9hgOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel L.", 
    "review_text": "I have only experienced Woody Zips on a Tuesday evening (for Two-Dollar Taco Trivia Tuesdays) - but based on Tuesdays alone, the place is a lot of fun. It's pretty small and cozy, and after only going to trivia for a few weeks, you'll get to know everyone that's working there. The tacos are definitely yummy and the trivia is a lot of fun (the trivia starts at 8:30 and normally goes from anywhere around 10 to almost 11 - seven rounds including 10 minute music and movie rounds take time). Also, the drinks are reasonably priced and after trivia ends get even cheaper!", 
    "review_date": "2007-11-28"
  }, 
  "ZkDuFhYbYnZw3EiPSlKjdw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J R.", 
    "review_text": "This place is a wanna-be North Beach bar....No locals, a bunch of lame ass games to try to draw in the under age crowd, a TERRIBLE juke box,  the bar tenders are not friendly and they let their friends steal wallets off the bar.  This place needs to find a new home in the marina right under the Golden Gate.", 
    "review_date": "2008-09-23"
  }, 
  "XRmnHVEWW79N_odOei8PGg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard L.", 
    "review_text": "This Bar just gets it. Everything is what it should be. The drinks are cheap and good. The bar tender with long hair from Canada offers great suggestions and gives relevant info to what you came for.   The burger is hands down the best I've had in the 2 years in SF. Pssst they're ground fresh, in-house WITH BACON INSIDE!  I'm all for dive bars, but I'd still like to have a sanitary bathroom to use when nature calls and the Boardrooms is fully stocked, clean and in working order. Ah feels good to have a clean place to wash up.  Trivia nights on Tuesdays are fun, music can be controlled via your cell phone app.   The list goes on and on about how everything is done right. Non-pretensious bar sure to provide a good time every time.   Next time I'm in the mood for another burger I'll be at Boardroom baby :-)   -Cheers", 
    "review_date": "2013-06-30"
  }, 
  "JUX2gRlYLsztq36c4qpbWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "cab k.", 
    "review_text": "very good food, great bar selections, friendly service!  I wouldnt really call it a sports bar except for the fact that yes, you can see sports on the TV...4 plasmas i might add..just doesnt have a sports bar vibe, much nicer that way if you ask me...lets see, burger was great, fried macorni and cheese balls were a first, also delicious...and the steak and blue cheese salad was perfect....good dressing, sauteed onions, hard to beat!  highly reccommenenededded", 
    "review_date": "2006-10-13"
  }, 
  "BPyUJD12lmsE8IaxzJCeXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim M.", 
    "review_text": "beer shot beer shot beer shot beer beer beer...perked!", 
    "review_date": "2013-04-30"
  }, 
  "RvVNfrVXso5NClIPbWl95w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Brian S.", 
    "review_text": "Open till 2am!!!!!  You can actually order cooked bacon as an appetizer or get the bacon wrapped tator tots.  12 for $8", 
    "review_date": "2012-11-28"
  }, 
  "mtl9Z6oZg9mUuyl96J8xBg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Martin E.", 
    "review_text": "Great place, nice atmosphere.  Not your normal beer soaked sports bar.  I reccomend sampling all the great tequilas they have behind the bar and if you're an Ohio State fan the place is OFF THE HOOK on gamedays.  They also have Trumer Pilsner which is brewed in Berkeley, a super local brew that I cant find anywhere else.  The food is good too, a nice and surprising twist on normal bar food, burgers, wings...try the Black &amp; Blue skirt steak, it's a killer!", 
    "review_date": "2006-09-14"
  }, 
  "F1bpfqIj0XWF73YUWrZ4Rg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenzie P.", 
    "review_text": "I'm not going to lie, one of my favorite things about this place is that many times there is an adorable dog wandering around wanting to be pet. The bar itself is great too, the bartenders are friendly and they will always put on whatever sports game you want to watch-- this seems to be kind of our go-to place for Sharks games. The bartenders will engage with you, cheer and talk about the game, which is nice. Its also one of the few places in North Beach that has legitimately tasty bar food. Their chicken tenders are drenched in sauce, their hummus is super flavorful and their cheesy tater tots (that's right I said CHEESY) are freaking delicious!  But seriously, the dogs are SO cute.", 
    "review_date": "2010-11-07"
  }, 
  "zPhDGOunNrVjnBd8zQ93bg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Great place for Tuesday Trivia Night! The girl who runs it is really nice and does a great Job. They have super cheap Tecate and PBR! The tacos here are also outstanding.", 
    "review_date": "2011-05-04"
  }, 
  "m6p5knAyIS79s6WNbeIdGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathleen E.", 
    "review_text": "Basic north beach bar. Nothing fancy, but gets the job done. The food menu was a little on the pricey side...$8 for seven mozzarella sticks?!?!", 
    "review_date": "2010-02-08"
  }, 
  "mN1WgreTn_1Ltk0kHKUqdg": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Mark K.", 
    "review_text": "The night I helped my buddy move in to North Beach, we decided to head out for a cold one or two (or twelve), and we started checking out the local options. I wasn't too impressed with most of the places, the sort of overcrowded overpriced bars that seem to be everywhere these days. Thankfully we found The Boardroom that night and it's become one of my favorites ever since.  It's the sort of place that makes you feel like a regular even on your first time in. You don't need to fight through the crowds of reprobates to get up to the bar, and the prices are right where they should be. People aren't there misbehaving and acting like it's the first time they've been to a bar, even if they are more than a little lit up.  We were on a liquid diet that night, but have been back dozens of times since, and the food is darn tasty. I'm convinced that the bacon wrapped tater tots may have saved my life on Superbowl Sunday. A good find.", 
    "review_date": "2010-04-27"
  }, 
  "KofmcukQnRz9mjKOS0u66g": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Rose H.", 
    "review_text": "Boardroom is amazing.  There are a ton of reasons to go,but let me list the top 4:  1- the food is AMAZING.  Try the beef brisket sandwich with tots- its phenomenal  2- Martin the bar tender is awesome 3- prices really decent for North Beach 4- the make a killer Moscow Mule... You can't find a decent one in NB anywhere.  Go, get the brisket sandwich, you'll thank me later.", 
    "review_date": "2012-06-20"
  }, 
  "J0G7SAItOT4opuLSK2-tmw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody L.", 
    "review_text": "Came here to eat dinner...not to drink, caus I kind of love bar food. I got the grilled cheese and tomato sandwich, with some tater tots. It was pretty delicious, but on par for bar food. Also kind of expensive. I tried some of my friend's bacon wrapped tator tots and they were also pretty good, but I'm not sure it's worth the price for a small platter. I know that most people here come to drink and watch sports on TV, not to eat, so I don't think it's too fair to judge them by the speediness of their food preparation (which was on the slower side) - BUT, they were really accommodating about letting us change the channels on the TVs to watch what (sports game) we wanted to, which I thought was cool.", 
    "review_date": "2012-02-20"
  }, 
  "u7e2HMYEeAHaBhDIIK2HSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "Yummy beers on tap! And tater tots!!! The bartenders are ALWAYS really nice, I love it here. It's also stumbling distance from Rogue. Yay! If you want to drink somewhere in North Beach and feel like a local I say come here. They also have brunch now? Great! Play that silly dice game and enjoy a fairly priced alcoholic beverage. It's super clean, unpretentious, relaxing. Conclusion: perfect for weekdays, great hole in the wall.", 
    "review_date": "2012-04-24"
  }, 
  "IRsI8mkBLpJTMuYL2uz6vw": {
    "user_rating": 3.0, 
    "user_location": "Livermore, CA", 
    "user_name": "Rachel F.", 
    "review_text": "Okay, so the owner/manager reached out to me in response to my 1-star review with a sincere apology for my experience and urged me to come back and try The Boardroom again. Since he took the time to reach out and address me as a dissatisfied customer, and because it looks like this place does well the majority of the time, I'll be sure to try them again if I am in the area. Thank you for taking the time to address my concerns.", 
    "review_date": "2012-05-17"
  }, 
  "56ZnoSnnI8Bdf7_dBmSOtw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cam M.", 
    "review_text": "This place is basically a one stop shop for hangover treatment. Delicious, greasy food. Cheap drinks. Good bartenders. Great jukebox. The type of place that makes it easy to turn breakfast into an all-day bar hangout.", 
    "review_date": "2013-09-09"
  }, 
  "m_dpeYKcVRdCoQIVJ6DoOA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie C.", 
    "review_text": "Great neighborhood bar! Love the crowd that has been coming here for years. Good snacks too!", 
    "review_date": "2013-01-02"
  }, 
  "mdNgxuT9Geph2ZL5lDam0g": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Christine M.", 
    "review_text": "So I really wasnt goin to go out on St Patty's Day but it was a long week at work I think I deserve one nite of being shit faced.  Just finished having dinner and a bunch of soju before heading over here to meet up with some friends.  It is very true the place is not very big so it just makes it even that better getting cozy up to ur neighbor. From the door guy to the bartenders were a good group of guys...especial Ben who for some reason seemed to like to give me a hard time out of my group.  But then again my group was kinda hard to handle taking up that whole corner near the window singing and taking pics. The crowd for being st. patty's was actually very laid back and merry...no drunk fools acting up and causing fights (aka Molly Magee's). I am truly sorry Ben for my friends and how loud we were but then again thanks for that cup of water u over flowed onto the bar...lol...were u tryin to get me wet? But thanks for the hug. It was a good nite...i got the bruises to prove it!", 
    "review_date": "2012-03-20"
  }, 
  "z-kyHYF6oUad7inUVG0Mzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason E.", 
    "review_text": "Well, I live across the street from this place and I constantly use their TV's as my personal cable.  The bartenders, Casey and Martin, are great guys and their service is always on point.  The owner Keith, has done a great job at making a great bar. There are so many great things to say about this place, let me try: -They make their own Bloody Mary mix -The food is really damn good -Their drink specials are great -Taco Tuesdays -$2 Tecate -$3 PBR  I suggest this as a spot to grab a bite and watch sports, or have a pub crawl and get shithoused.    Go, enjoy yo' self, be merry!!!", 
    "review_date": "2010-04-06"
  }, 
  "MFZAJCjeogRcavL7pvU6yQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth W.", 
    "review_text": "Attentive but relaxed bar staff who garnishes their conversation with a lavish amount of sarcasm. I approve!!!  The burger was definitely bacon infused and my friends order of buffalo chicken tenders was an exceptionally large portion.  I live in the neighborhood and will return to grab a beer and/or sample their *apparently* amazing Sunday Brunch.   The bartender was kind enough to let me sample his Bloody Mary mix, and it wasn't half bad...next time, I'll try it \"all the way\".", 
    "review_date": "2012-11-21"
  }, 
  "CTCDuqyqU2NsGnjIzEQNng": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Jackie B.", 
    "review_text": "Very friendly bartenders, good sports on TV, surprisingly delicious food (no offense to the establishment, but it is a bar) and nice people. Small enough to make a new bud each time you step out for a smoke break. Have a great time everytime we go.", 
    "review_date": "2007-01-19"
  }, 
  "o0oxyu1qnQrutZo1GCGwMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen K.", 
    "review_text": "Pretty cool place to meet some friends on a Tuesday night to do some trivia. They keep the questions moving which is nice so the game doesn't last till 1am like some trivia nights and he has some interesting twists to the game which will keep your attention. It's very small so you need to get there about an hour before hand to get one of few tables (on a Tuesday). They have some food as well and i have heard it's decent i have just never found myself hungry there. The nachos looked awesome though i have to admit.  They have some nice TVs as well and they have the Sunday ticket so you can enjoy watching your team here.", 
    "review_date": "2008-04-08"
  }, 
  "EwRbT2_nkVkpxouNGjJkjw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mario G.", 
    "review_text": "Hands down.  Keith, the owner, has tailored made a bar that blends a bit of North Beach, a non-cliche sports spot and a local feel that makes you feel at home right away. Every time I have taken friends here, we walk away with that special feeling that only a Tiger beer and Russett &amp; Sweet Potato fries can provide. Be there for Taco Tequila Tuesday Trivia and embrace a hound of locals playing plus enjoying great drink specials. Since it is a smaller spot, I recommend taking a large group with you so and your friends can be the party... as it should be every time you go out.", 
    "review_date": "2009-06-22"
  }, 
  "EhkhoHspemIjxO445XXAjw": {
    "user_rating": 3.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Tommy N.", 
    "review_text": "I'm in San Francisco for two days so I decided to search Yelp for a good bar to watch the playoffs. All the reviews here said this was the place to be. The bartender seemed to favor the people sitting at the bar who appear to be locals, and was a tad rude. Breakfast Po' Boy wad very tasty and the Bloody Mary I ordered was perfect. I got my hopes up a bit for The Boardroom so we're leaving at half time to find another place. 3 stars", 
    "review_date": "2011-01-31"
  }, 
  "aBlXIipUwzl3wCIFIrFY-g": {
    "user_rating": 3.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Cesie A.", 
    "review_text": "Went here just for the bacon wrapped tots...they were so good! The price of them..not so good. Guess we just missed the happy hour prices when we went. $8 for about 10 tots...kinda not worth it. We got 2 orders so $19 for meh maybe 20? Nope, not worth it in my opinion.  Liked the large amount of seating though and the other food looked yummy too.", 
    "review_date": "2012-12-12"
  }, 
  "Tl-GyMHOViQBtqQ1ODehfg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sharon H.", 
    "review_text": "Kitty corner from North Star, this place gets a lot of the spill over from the hopping corner bar. I, however, think The Boardroom is much better.  I consider this my go-to neighborhood bar. Keith (the owner) is awesome, and he really takes care of the locals. I like going here for Oregon Duck games if I don't want to fight the R-Bar crowd. I had my last birthday party here, and I would probably have every next one here. Keith let me do drink specials, which were named after me.  If you email Keith, he's very responsive. He loves to have special events, so he's great about working with different folks on what they want.  They also have:  --Bloody Mary bar and bottomless mimosas on the weekend --Delicious tacos --A hummus plate, for a nice healthy option", 
    "review_date": "2009-08-03"
  }, 
  "NZwGgyT2BVjfWm6h-orOrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve B.", 
    "review_text": "A solid, local neighborhood bar with a great atmosphere. My go-to for 49ers football. The bar food is damn good too. I've had a burger, veggie burger, breakfast chroizo tacos, and the famous bacon-wrapped tots--all are really, really good. Solid bloody mary's as well, albeit a little pricey at $8.  Order a PBR and guess the playing card number/suit that's underneath the cap and they'll pay for your beer. I actually won the last time I was there.", 
    "review_date": "2014-11-20"
  }, 
  "dim5Svrt-B1jvvQsOIX22A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Z.", 
    "review_text": "Before my friend moved to Chicago, he used to frequent this place.  I wish that I had joined him more often.  This place is so good and dangerously close to home.  Attended a party here on a weeknight when I'm sure that it was much busier than usual, but I was extremely impressed with the quality of the service.  Bartender is extremely friendly and kept everyone's glass at least half full throughout the night.  Best surprise was the bar food.  In my opinion, its some of the best bar food in the city.  Tater tots in North Beach?  A fierce looking meatloaf sandwich.....the cuisine features all the comforts of your Midwest native roots, which are of course  best in moderation.  Can't wait to return for the chicken and waffles!", 
    "review_date": "2009-06-14"
  }, 
  "ePLlR7P2eYOXlZgN-MEHhw": {
    "user_rating": 4.0, 
    "user_location": "Fort Worth, TX", 
    "user_name": "Dave M.", 
    "review_text": "This is an excellent neighborhood bar/dive. Its small and pretty bare bones with old booths and beer buckets that hold utensils and condiments. We walked here for a quick drink and bite to eat before flying out on Sunday. All of our plates were under $10 and the Bloody Mary was awesome.", 
    "review_date": "2014-04-08"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "I have mixed emotions about The Boardroom. On the one hand, it's in North Beach, a place I love, the staff is incredibly kind, they play great music, and have lots of big TVs for ample sports viewing.   On the other hand, it smells like my college boyfriend's shared dorm apartment, ie, dirty towels and bong water, trivia night was a huge bust as the hostess was absolutley schwaaasted (like blurting out answers to trivia questions and heckling some guys in the crowd), the place is very tiny and dark, and last but not least (and at no fault of the establishment) we were infultrated by the *biggest douchebags* I have encountered in a while - seriously, they ate the better part our nachos and bacon mac n' cheese and got really angry when we told them to stop and moved our food away.  Me and the girlies started off the day yesterday in high spirits, looking forward to Dr Teeth's Tuesday Trivia / Two-for-One Maragarita deal / Two Dolla Taco fest, only to have our dreams squashed roadside after we learned that *Dr Teeth NO LONGER DOES TRIVIA* (fyi, y'all). So we had to resort to other options. Boardroom is somewhere between all of our offices, so we landed there.   Rita I and I got there waaaay before the trivia rush and planted ourselves at one of the two long tables and filled ourselves with a Margarita and a Corona ($5 each) and waited for our homegirls to grace us with their presence. I had the Fernet and Tecate deal for $6 which was pretty sweet.  Now kiddies, I welcome you to flashforward a few hours to almost trivia time. We were joined by some random menfolk from Canada who made a good impression - at first. Then they proceeded to take and eat our food and tried to justify it. Um, I hate you. Thankfully the staff saw what was happening and took the charge off our bill and put it onto theirs. The chef in the kitchen does major work - cooking and bringing everything out to the many people who order, good work!  We shared Nachos with Carne Asada ($9) which was pretty bomb, plus an order of Mac N' Cheese with Bacon ($8) which was no bueno. It was basically large elbow pasta with a watery cheese sauce and topped with nearly burned bacon bits. Sad face central. Stephanie S got the Bacon Wrapped Tater Tots aka Bac-o-Tots ($8 for five) which she said were yummy, but not a lot came in an order. Rita I had the Buffalo Wings in Island Flavor ($9), which were not particularly meaty, but had good flavor. During trivia we got all fat kid and ordered Tot-chos ($8) and they were OK, a combo of soggy and then dried out, I could probably live without them.  Anywho, I'd like to go back and try brunch. I think last night was also slightly tainted because there was a Wild Card A's v. Royals game on that went to the 12th inning, and there were way too many A's fans clogging up the joint. So that's that: I hope to be back, I hope no more awful men approach me and my friends, and I hope the staff continues to rock on.", 
    "review_date": "2014-10-01"
  }, 
  "vnV0eJVf0hb7MKu4tHCBJw": {
    "user_rating": 4.0, 
    "user_location": "Brisbane, CA", 
    "user_name": "Meghan B.", 
    "review_text": "Wandered into the Boardroom by myself to catch some of the NCAA tournament. I'm from out of town so the bartender was very friendly since I was all by myself. I think his name was Lou... The place had a good atmosphere and a good group of people trying to get their Friday drink on.   The food was delicious! At the suggestion of the bartender I ordered the BLT with avocado and sweet potato fries. Delicious!! Everything tasted fresh. I wish I lived closer so I could visit this spot regularly.", 
    "review_date": "2014-03-24"
  }, 
  "u238Qh2YnnfL6qlvrmL7Tg": {
    "user_rating": 4.0, 
    "user_location": "Portland, ME", 
    "user_name": "Christine L.", 
    "review_text": "I couldn't agree with Jane A. more, you MUST try their bacon wrapped tots (given that your heart can take it).  On the drive home after a night of drinking &amp; hunting with fellow yelpers, I couldn't help but think that they were the most:  HEAVY GREASY ARTERY-CLOGGING DEATH-INVITE that I can't help but want to eat.   And I can't help but want more. :]", 
    "review_date": "2011-12-18"
  }, 
  "5k0AYioQAwUT3K-v7UQZxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie D.", 
    "review_text": "A place that serves pulled pork sandwiches and bacon wrapped tater tots is as good as it gets! I cannot stop talking about the tots. So amazing!   The service was also great. It's a good locals spot or place to stop by if in the neighborhood.", 
    "review_date": "2011-06-28"
  }, 
  "m0AFrRqCNBpCK26_vbxjVg": {
    "user_rating": 3.0, 
    "user_location": "Houston, TX", 
    "user_name": "Farid R.", 
    "review_text": "Visiting from Houston... first establishment ventured to after arriving in SF for new year celebrations with buds... and lucky us, it turned out to be Tuesday Trivia Night. After walking all the way from Powell St. BART station up to there, I was ready to get on with some relaxin'.   - Cool and chill ambiance (and apparently dog friendly as well - random creatures running around your feet while standing around)  - Ridiculously cheap and amazing tacos (due to the special salsa?, or grease?, or maybe made more amazing after the tiring walk / day of flight? who knows, but afterwards I was craving them all week long)  - Fun and diverse crowd.   Only complaints:  - the bartenders kind of struck me as douchey, but they kept people entertained and seemed to be on top of 'it'  - everything outside the tacos seemed to be relatively overpriced  - witness oregon beating oklahoma state (i hate the pac10) before the 'trivia night' part started   All in all, seemed to be a nice neighborhood bar and if I lived in the area, I could see myself hanging out there every now and then.", 
    "review_date": "2009-01-10"
  }, 
  "PrqhlhGVjq5FuaM9pW6Enw": {
    "user_rating": 3.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Rae'esah N.", 
    "review_text": "Soon as we opened the door we were greeted by Carrie - the bartender's dog!  After the sniffing and petting stopped we grabbed a couple stools and ordered our drinks!  The drinks were good, the bartender was very cool, the music was VERY loud and the clientele were friendly.  Actually over friendly and too drunk would be used to describe the wasted couple that stumbled in and sat down I mean, fell down next to us.  the guy spilled his drink down my side which totally pissed me off and I let him know by jamming my elbow into his side and told him to \"scoot the fuck over.\"  They continued to serve drinks to them and they continued to get sloppier.    When I heard my husband say \"i'm going to knock him out\" after the guy stumbled into me AGAIN, I knew it was time to go.  Last thing I need on a Saturday night is a bar fight in SF, right?  Regardless of the two a*holes we had a really good time.  I'd go back!", 
    "review_date": "2009-04-06"
  }, 
  "kJburVO8dCgZtFRULVkfeA": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Kevin G.", 
    "review_text": "Went to the boardroom with some friends last Sunday morning, because I heard they had a decent brunch and a bloody Mary that could \"knock my socks off\".  Both had exceeded my expectations. I had the loco moco with house made gravy, which put me directly in heaven, and the side of bacon smothered in maple syrup.  Can I just say, I will return for the bacon alone! if there is a heaven, I sincerely hope it is made of this bacon! Moving on...      The service.  This place was packed,  wall to wall, and the bartender (can't remember her name, but girl with brown hair) was on point. I didn't have to wait more than a minute for my drink,  which considering she was the only bartender,  I was impressed. The bloody Mary won me over. Now,  I usually hate bloody Maries,  but I was peer pressured into it, and I am very happy I was! I've tried others since, but meh... Not the same.       In conclusion, I'm now a fan of the boardroom. They said they have trivia on Tuesdays, so I'll have to come back for that! Believe that I will review that night too!", 
    "review_date": "2014-03-20"
  }, 
  "4dclJLG4cO_ACx2zkCbjag": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Esther K.", 
    "review_text": "The Tuesday Taco Trivia nights are awesome. The chicken and steak tacos are both really good, more like street tacos than anything I've had in a long time. The fish tacos are the best though -- they're $3 instead of $2 but soo good. They ran out of $2 beers this past Tuesday but I guess it doesn't hurt to not drink Tecate or Tiger for one Tuesday. Get something classy, like Budweiser. The pub quiz is really fun too except that I never know anything except for the questions about pop culture and children's books. The quiz will start late if there are good sports on (like the NBA finals). Expect to stand if you don't get here early enough because the place is really small -- I'm always jealous of the people who get the plush couches in the corner. Plus Keith, the bartender, is super nice. They're lenient on the $20 minimum for credit cards too which is nice for people like me who never make it to the ATM before these things.", 
    "review_date": "2008-08-13"
  }, 
  "4H6fXlz4rOHRa1vPOFqRdQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "P E.", 
    "review_text": "Great place to have some drinks while the wife is out shopping. Came here with a buddy had a good time drinking while we watched the Raiders lose another game :(", 
    "review_date": "2012-10-01"
  }, 
  "RVKadMPQnfWj7CxyX_gaGQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela N.", 
    "review_text": "very few places in SF a local can go to on a Friday not and not get annoyed.  Boardroom is one of them.  GREAT bartenders. local crowd.  looks like it might be a great place to catch the games.  two thumbs up.", 
    "review_date": "2010-04-10"
  }, 
  "-Db9qbIoQ3X2-dqYu01oSg": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jon W.", 
    "review_text": "the boardroom very quickly became my favorite sports bar in sf. the drinks are cheap, the food is above average, and, most importantly, the staff is amazingly friendly.  in my book, only kezar pub bests the boardroom in the sf wings department, so give those a try, but not before you devour a plate of bacon-wrapped tater tots...what a genius idea.", 
    "review_date": "2010-06-24"
  }, 
  "s3XmVL8UT5duKjPaQp43cg": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Aaron J.", 
    "review_text": "Woody Zips is a cool little neighborhood bar; definitely a nice spot to relax with some of your buddies, a beer, and watch the game. The two guys who recently set this place up are nice, and didn't hesitate to give my friend and I some free shots on a slow night. In the several times that I have been there, its small space has been pretty packed... A good sign that business is doing well. It may seem to attract a large number of marina-types, but this can be easily tolerable when in a good mood.  Overall a comfortable, small neighborhood bar that certainly warrants stopping in for a drink while journeying through North Beach.", 
    "review_date": "2007-11-19"
  }, 
  "ghost_id_1": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "ghost_user", 
    "review_text": "I just got home from trivia at the Boardroom. Not the best trivia night I've ever been to, but the f-ing $2 tacos were incredible, and the cheap Olympias and Pabsts were not too shabby, neither.", 
    "review_date": "2008-11-20"
  }, 
  "xpRAjmgL-pIcIY_9iOpcQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay W.", 
    "review_text": "My new favorite bar in North Beach.  I used to come in wayyy back in the day when it was Shannon's to watch 'gator football.  Think I might have tried it's \"Woody Zips\" incarnation once, but just never became a fan...it was just so clean compared to the utter sh*hole that Shannon's had been that I couldn't adapt. Plus they moved the bar from the lefthand wall to the righthand side which tripped me out.  But then I stumbled in a few Fridays back (okay I walked in...but there might have been a slight stumble upon departure), and it was packed, and I mean packed with...wait for it...,no, not hot women...I know what you guys were thinking...but dogs. Gorgeous, playful puppies.    I'm so jealous because they are all just lying there on the couch and I *know* I can't bring my baby here because even at almost four and literally the best trained dog I've encountered in SF he's a little energetic.  Just a little bit.  Seriously, remember back when drugs were cool and people had money and did blow?  Sonny's like that ALL THE TIME.  (That's a lie, he's a Labrador so he sleeps 18 hours a day, but the 6 that he's up he's MOVING).  So this Saturday rolls around and its a beautiful day and I feel a need to get outside.  Sonny and I stroll over to meet a lady friend of mine at Washington Square Park.  We're there like 10 minutes or so when she says \"You know there's NCAA basketball on right now?\"  My heart melted a little.  Seriously...that's like hearing a woman say \"My hot bisexual roommate wanted to know if she could join us?\"  So knowing that the Boardroom is dog friendly and has at least 5 flatscreens, I decide to see if Sonny can play nice with mellow dogs.  We walk in and there's another lab, Maya, (whom I'd met before) there and the two of them get along famously, even though she's one hot bitch and Sonny still has his balls.   It was a minor pain in the ass because Sonny's favorite room in the bar is naturally the kitchen, so I have to keep one eye on him, which leaves the remaining eye split between the game, the girl who wanted to go watch the game, and our order of tater tots.  That's right...tater tots.  The 5th food group.  With two dipping sauces, one of which was cheese.  For like $2.  Also, while I didn't partake I did notice that on weekends they offer bottomless mimosas with their brunch menu.  $12...not a bad deal.  To recap:  1. sitting in a bar with my dog 2. getting buzzed on a Saturday afternoon 3. watching Elite Eight basketball 4. with a hot girl who's idea it was to watch the basketball  5. eating tater tots  Whoever called Disneyland the happiest place on earth never tried the Boardroom with that quint-fecta goin' on.", 
    "review_date": "2009-03-30"
  }, 
  "JuxQgUdH6DO4moCEhwbFbA": {
    "user_rating": 5.0, 
    "user_location": "Galveston, TX", 
    "user_name": "Reynard H.", 
    "review_text": "Great place! What up Sal and jen!", 
    "review_date": "2013-09-04"
  }, 
  "Aln7oGojGguFtYLmGtkSrQ": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "O. I.", 
    "review_text": "Went to the Boardroom for the 2nd time this past Tuesday.... great bartender / forgot his name / great $2 tacos, $2 Tecates, fun rounds of trivia (we sucked), and a bunch of really friendly patrons - exactly what I want in a (slightly divey) neighborhood bar.", 
    "review_date": "2011-08-25"
  }, 
  "TwhTe_WBiWaArKELqjumEg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Christine Y.", 
    "review_text": "Made a quick visit this weekend for the first time to catch a bit of the UNC-Nova game.  Cool sports bar vibe going on... they've got multiple flatscreens so you've got a clear view no matter where you're sitting.  Grabbed a guiness, bartender was really quick!  Was pretty full in there, but wasn't too hard to grab a seat.  Apparently they recently started serving fried chicken and waffles.  I didn't try it, but my friend's buddy ordered it, and yeah - it looked awesome. Fried chicken and waffles and a beer? Nice.", 
    "review_date": "2009-04-05"
  }, 
  "_V6qMBCSzhwx96FLB3CJRw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Pam S.", 
    "review_text": "It amazes me how I keep meaning to go to places that I hear about for some sort of yelper-posted event for another, end up flaking at that time, and then end up at said place totally randomly.  The Boardroom was the second stop on the \"date\" (and it was getting less so by this point, although seemed more so due to the switch to porter), and I'm glad I finally checked it out.  We headed over here to watch some NCAA basketball (my choice, I'm a bossy bitch) and there were plenty of t.v.s on which to watch the games...even though it seemed the channels kept switching.    Although we didn't order any food, we managed to score some free fries which were much needed at that point.  They seem to have an excellent liquor selection, although I stuck with beer which ended up being really cheap.  Yet another bar where a cute pup wanders around, which makes it almost 5 stars for me.    I really must come back for trivia night, and hopefully this time I'll answer some questions correctly...the other night I didn't.  Meh, I've experienced better (the date, not the bar).", 
    "review_date": "2009-03-29"
  }, 
  "8ExCZVowOo3LK2QG6G8Xmg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Siv L.", 
    "review_text": "Have been here a few times, as my friends used to live close to the bar. There are a few smaller TVs scattered around the bar, so it's good for watching sports (but there is limited standing room so not so good if you are in an odd corner which requires you to crank your neck to see the screen).  The owners and bartenders seem to have a good relationship with the regulars so I must admit that if you aren't one, you may feel like an outsider (and the find the staff a bit annoying/pretentious). On one occasion, I sat down at the bar, which was practically empty since it was around 5PM and the female bartender took a while to acknowledge me, and when she finally did, I asked her what was on tap, and she expected me to know... On another occasion, I was here for trivia night, and the MC can be quite rude/obnoxious, but I guess others think she's funny ?  Have tried a few of the menu options, including the nachos, wings, and tater tots, including the bacon wrapped tots. Everything is pretty standard but I must admit, their plain tater tots are the best I've ever had -- for that reason alone, I would come back!", 
    "review_date": "2013-02-17"
  }, 
  "EaH156ksdjyTnuyXo67bRg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott N.", 
    "review_text": "Great local neighborhood sports bar. Great attitude from all the \"help\". Love watching Thursday night NFL games there - never over-crowded and the food is actually pretty good for bar grub. Totally recommend this place over most of the other \"sports bars\" in the City.", 
    "review_date": "2007-12-14"
  }, 
  "aVaa64zb_-d6VTY3XcXyIQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane A.", 
    "review_text": "THE BURGER (3 stars)  So, I've been to The Boardroom and had their tator tots there and they were delicious. I was happy to see them participate at the Ft. Mason Burger Brawl but was kind of disappointed in the food. The tator tots were not what I recall. Their burger looked pretty plain but something about the patty was pretty tasty, what killed it though... the bread - it was dry as hell.   Will I be back? I'd skip them next time at the Burger Brawl and would rather to go their bar to eat.", 
    "review_date": "2013-06-10"
  }, 
  "ws6VBKkh6RhZH1afgAtFqA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Wayne C.", 
    "review_text": "holy crap, the bacon wrapped tots were simply amazing!  worth it to come here just for them!", 
    "review_date": "2015-01-15"
  }, 
  "3ZrjvKpBvez2uHzvDNxa_g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oliver N.", 
    "review_text": "Through a combination of setting, food, music, patrons and bartenders, Boardroom earns every star of this review.  The bar itself is nicely appointed, feels clean, and while North Beach isn't my usual stomping grounds I like that it's close to lots of other stuff - at one point I walked around the block to pick up some cannoli.  The menu is solid and served till a decent hour - I had a couple of the fried chicken sliders and I was fucking glad of it.  The music last night was great, there was good company and my bartender handled shit properly - had my first absinthe drink and loved it, strangely enough.  Now for the blah-blah-yelp-reviews-are-full-of-pointless-­personal-stories section:  I came here last night for the anti-valentines day party put on by the lovely Berna T., and I gotta say...it was a classy group of people.  I had a good, relaxing time, even if the event made me terribly sad and being in groups of people just reminds me that every man is an island unto himself.    Melodrama aside, I see why people love this place.", 
    "review_date": "2009-02-15"
  }, 
  "2wJEU5pwBFeDFLd-5y3X2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie V.", 
    "review_text": "This place was definitely cooler than I expected. Cruised in here Friday night because a friend said he knew the bartender. We proceeded to sit at the bar and booze it up. The drinks were perfectly made. The crowd happy, friendly, and a little wacky. Except for the way too drunk popped collar chode who was upset that Paris had to go back to jail. That was too much for me to resist. I HAD to bite. We ended up having a loud roaring debate on whether Paris Hilton was a victim of her celebrity. Almost sends me into a rage just writing it... Obviously the crowd was on my side and we only made the PH lover cry a little bit. :-)", 
    "review_date": "2007-06-10"
  }, 
  "XaMwHlRaUfsSjBewVAbiQw": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Casey S.", 
    "review_text": "Dem tots. Dem crispy, bacon-wrapped tots.   When you see a sign that says \"bacon-wrapped tater tots,\" you're bound to come in to see what the fuss is all about. The Boardroom certainly gets some points for having this unique item on the menu, but what really sold it for me was the neighborhood vibe. THIS is what you'd call a corner bar!   The bartender seemed to know a lot of the regulars around there. He's even a bit of a gambling man, stating that my PBR would be on the house if I guessed the number and suit on my bottlecap. I may not have been so lucky (it was the seven of diamonds), but it just gives me all the more reason to come back and try my luck again.", 
    "review_date": "2012-07-15"
  }, 
  "FnVgTYt6f1ZqLPS0QanFHg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Emily A.", 
    "review_text": "This place is such a great find.  We didn't want to wait a year for breakfast and thought our options would be slim but then we found this place!  Between the service, the awesome rescue dog that wanders around getting love, and the excellent breakfast I will definitely be back!  I had the breakfast BLT which was sooo good.  Bartender gave us a sample of the Bloody Mary mix which was also amazing.", 
    "review_date": "2013-08-25"
  }, 
  "7rjAgnw-DsHThvzf6TDBLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ross G.", 
    "review_text": "I live across the street, and in the two weeks since moving here (SF) I find myself coming to Woody Zips with increasing regularity. The beers are cheap, its not obnoxiously packed (as in, screw it I don't want to force my way through a crowd to get to the bar packed) and its definitely more upscale then you usual sports bar (the artwork is a nice touch, a bit of class but without overdoing it by using real artwork, I think a Monet print would be a touch gauche here).  On a side note: I came to SF for the first time for Fourth of July this year and stayed with a friend down the street. One of his former roommates is friends with Luke, the owner, so we watched the fireworks from the roof of Woody Zips, which was pretty damn awesome. Had some beers and food at Lukes apt as well (though I would totally not expect him to recognize me, he was basically letting us use his apartment with its roof top access, he was out of the apartment and at the bar 90% of the time, and there were lots of people there). So yeah, good peoples and cold beverages", 
    "review_date": "2007-09-19"
  }, 
  "Em_P1RN5imjbgHDBXMuF3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina B.", 
    "review_text": "We came in to try out Yat's PoBoys, but sadly it is no longer available. So we decided to at least try out the Bacon Wrapped Tater Tots and have a drink. They were really really yummy. The Sunday was a nice gentlemen and really east to talk to. I will definitely be back when I'm in the hood.", 
    "review_date": "2011-07-11"
  }, 
  "EHwNw8KOy8PbkCz46mdhhA": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Owen S.", 
    "review_text": "I have only been for Taco Tequila Trivia Tuesday -  a great trivia night.  Great beer prices (for SF North Beach) and cheap tacos (2$) on Tuesday nights while playing trivia.  Small place, can get a bit cramped, and the food is nothing special- typical bar food, but the bartenders are great- friendly and quick.  I don't know about the other 6 nights a week.", 
    "review_date": "2010-02-01"
  }, 
  "OCcHlcwqFtHcKFo5t4UBYA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "I love this bar! And here is why:  - the atmosphere, because it's neighborhood friendly and everyone talks to each other. It's still in North Beach but you're less likely to get into fights with hoodrats stumbling drunk out of the clubs. - trivia nights because the whomever has the best team name wins champagne. And also the questions aren't too hard... love it when they have the questions about movies and clips of it they show on the screen. Almost too easy for me! - food deals up the wazzooo... cheap and delicious! 50 cent wings on Mondays, and their tacos on Tuesdays are quite delicious.  - almost always having Mirror Pond on tap - their decor is quite lovely. They don't call it The Boardroom for nothing. - great place to watch games. Everyone gets into it! - they have great bartenders. Especially Ben, whom is very witty and charming and is always up for some conversation.  Long story short, it's an all around cool bar to be at. You all should go!", 
    "review_date": "2010-06-06"
  }, 
  "XvKdp9PB4rKJKwI798mJgg": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Alexandra I.", 
    "review_text": "We were able to get a table and it was comfortable and big. I got a beer and tried a couple of a friend's fries and they were yummy! I've heard this place has better than average food.  Lots of TVs too...", 
    "review_date": "2014-04-18"
  }, 
  "wVpwTZ0ynSgHWn_tgzx2vg": {
    "user_rating": 4.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Kerry P.", 
    "review_text": "I am now a regular at the Boardroom's taco Tuesday Trivia night, and currently a member of this week's reigning champion team, \"I Went to Vegas to Steal My Shit Back and All I got was this Lousy Conviction.\"  WoooHooo!  The Boardroom's trivia is definitely not a walk in the park.  5 rounds encompass current events, images, music, movies, and then one specialty round (in the past this has included Russian History, spelling, etc.).  The fish tacos are delectable.    Drinks are cheap until 7 and trivia begins at 8:30.    Also a bottle of champagne is awarded to the team with the most clever / funny name.  \"No Means Yes Means Anal\" has won two weeks in a row with probably the most tasteless name ever.  Watch out.  Pull that again and we're going to name ourselves \"No Means Yes Means Fisting,\" if that's what the judges will consider FUNNY.", 
    "review_date": "2008-10-08"
  }, 
  "JoBmWW62xDOkXr2anyxfag": {
    "user_rating": 4.0, 
    "user_location": "Houston, TX", 
    "user_name": "Rachel E.", 
    "review_text": "Stop #4 on the crawl... The Boardroom is pretty small and not great for big groups, but the weak had dropped out so the 10 or so of us remaining grabbed a booth in the corner and the stools lining the entry way. They have a pretty full bar and a few beers on tap. The bartender wasn't mean, although he could have been friendlier, but I guess he made my drink and it was fine so who am I to complain? They have lots of TVs which is nice, and the crowd was pretty low key. It's slightly off the tourist path so everyone there seemed to be local. I even ran into some old friends.  Just a note that their credit card minimum is $15 so bring cash.", 
    "review_date": "2011-11-13"
  }, 
  "DZ1wz524vtPNMgYrOaFygw": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Ronald C.", 
    "review_text": "Friendly crowd. Awesome bartenders. What more can you ask for??? Oh yes I know. Taco trivia Tuesdays !! I think I have a sick obsession for trivia. You get 2 dollar tacos that injects your brain with magical powers to answer these asinine trivia questions. It's so much fun when you get play with a full house. Sometimes I wonder if these people just sit there and read stupid current events all day. OVERALL...I LOVE IT!! Alcohol + tacos + trivia = PURE HAPPYNESS", 
    "review_date": "2010-10-27"
  }, 
  "UvRUygcyvpJuHh1BiZrrbQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess B.", 
    "review_text": "ASU bar!! GO devils. Its pretty small but a good local joint.", 
    "review_date": "2012-10-15"
  }, 
  "j45PuQ1uZeljOh4vCmwi3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tyler W.", 
    "review_text": "This place is like cheers, the guy always remembers your name.  Edit: Let me clarify. I'm not freaking kidding about this OK!?!?!  If you go to this bar and tell the owner your name over your first beer, he will remember when you come in 1 month later, and he'll remember your favorite drink, and your great aunt sally's birthday. It would be a great way to look like a player if the place weren't such a dive, as it stands it's a great way to look like an alcoholic.  Favorite bar in my neighborhood.", 
    "review_date": "2008-10-03"
  }, 
  "9g-O4F_pJMPv5RkByEZNUw": {
    "user_rating": 5.0, 
    "user_location": "Beaverton, OR", 
    "user_name": "Jeff W.", 
    "review_text": "My wife and I were in town during college football season and were looking for a place that both served food and had our Oregon Ducks on.  We searched around Yelp and found this place by chance. It doesnt look like much from the outside, but glad we decided to go in.   The owner is an Oregon alumn and showed up just after kickoff. He was really friendly and sat down with us and rooted the team on.   The lunch was very good, good size portions and good quality ingredients. The tots were amazing. The breakfast food looked equally as good when it was coming out just before kickoff.   The Boardroom gets 5 stars for the friendly people (fans and employees alike) and being a good value for such a small hole in the wall bar.", 
    "review_date": "2013-12-27"
  }, 
  "MQL7RSeMrcmPdqf7ilF3zw": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Jeanie H.", 
    "review_text": "Great food and drinks!! Bar tender is fun and very generous!  You might even get a firebomb on the house if you're cool!  Best place to watch the Redskins game! Order their Moscow Mule and their Loco Moco.  Yummm!!!", 
    "review_date": "2013-10-05"
  }, 
  "TMWgq3KNRDaESXs8ZCrRtA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "I came here for a breast cancer fundraiser for my friend who was guest bartending.  All the drinks are reasonably priced and they have really good bar food.    The owner was there and super friendly.  He was helpful about what drinks to order/food to order (AMAZING TACOS).  There are darts in the back.  The bathroom is pretty clean.    I'm sure I'll be there again!", 
    "review_date": "2008-05-20"
  }, 
  "z-SilTRtybLa0nYZoNbgMg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex R.", 
    "review_text": "Have you ever had one of those drunken evenings when you got into a deep debate regarding what the definition of a Cougar is?  Well I have, and it just so happened at Woody Zips.  Now there wasn't a Cougar to be found, but it was a great place to poll the bar.  Low and behold we found a pretty even tie on what a Cougar was, it was great having so many people willing to jump at their chance to put their word on as to what a Cougar was.    Now on to the Bar, beer a little spendy at $5 a beer, but that is not what stood out at this bar.   HOT WINGS!!!!!  Wow I don't know what to say, the best damn wings I have had, only rivaled by a few, their wings were perfectly cooked, with amazing sauce.  So overall, good atmosphere, good people, awesome wings, and a good all around neighborhood bar.  Cheers!", 
    "review_date": "2007-04-10"
  }, 
  "e1FuiYSV1v29q2OTR9ojBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Berna T.", 
    "review_text": "I find myself having to update my Boardroom review yet again, because Keith and his crew have been dishing up new ways to keep people coming back.    So, maybe it is partially due to the fun (albeit overly crowded) Tuesday Night Trivia &amp; $2 Tacos, or the $1 well drinks on Sunday nights, or the $5 Chicken &amp; Waffles Special, the cheesy tater tots, or the fired up crowds that come in for major sporting events (flatscreens, what what!).  Or maybe it's all the awesome bartenders: Con  (who puts up with a lot of shit from a certain ball-busting ex-Yelper), Jen (hottie girl bartender), Casey (dances behind the bar), Brandy (love the tats!) or Martin (most intimidating looking teddy bear) and my favorite door dude, Danny...they will remember you and treat you well if you aren't a complete asshole.  Or maybe it's because it has an extremely low douchebag quotient considering the locale.  Oh wait, I know why I love this place.  NOW SERVING...........................................­.......KARAOKE!!!!  And no worries, I will *absolutely* let you have the mic!   . . . . . . . . When you tear it from my cold, dead hands.   (Or Danny's.)", 
    "review_date": "2009-01-19"
  }, 
  "iY41hl-J7Nw32spi0BalUg": {
    "user_rating": 5.0, 
    "user_location": "PORTER RANCH, CA", 
    "user_name": "Linette P.", 
    "review_text": "Was visiting San Fran for the weekend and ended up following a few guys there after Columbus Cafe ( another cools spot). They suggested we check this place out and a friend and I followed. :)  The people there were awesome and everybody looked like they just wanted to have a good time. Glad I joined! :) Oh yea and the tater tots went awesome with my beer.. Cheers!", 
    "review_date": "2013-06-10"
  }, 
  "BmadK3z9p31Ua3MYsZQyyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom L.", 
    "review_text": "Went here because someone that I share a workspace with said they have good wings and other bar food.  Luckily went on the wings special night and had several tasting items from the bar menu.  Really liked the onion rings, nachos and wings while the bacon wrapped tater tots didn't quite live up to billing.  The bartender Sal was really fantastic - nice guy mellow great serving.  This place is everything you want from a local bar hang-out (not fancy)- I've already been back with my wife and she loved it as well.", 
    "review_date": "2014-01-09"
  }, 
  "ksRdqPxR-of7gpnAD8JrZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace g.", 
    "review_text": "I just started working down the street and love all the bars in north beach but there's something extra special visiting a local bar with awesome food!! -- Every Mon, killer happy hour with something like 25cents each wing and they aren't some lame hooter wings there absolutely gourmet! I like my stuff spicy but he'll make them any way you'd like!!! LOVE the owner Keith, if anything stop by and say hi!! Everyone that works there is great!", 
    "review_date": "2011-08-11"
  }, 
  "oVgFYN37V-hr1BEas-Rd8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenni L.", 
    "review_text": "This place gets 5 stars just for its Tuesday trivia night. I'm not even that into trivia, but I always enjoy it here. The atmosphere is chill--no frills, but it's a clean, cozy place. Food always entices me, and their tacos are surprisingly out of this world for a sports bar! $2 for chicken, but I recommend the $3 fish--it's covered in a savory sauce that beats Mijita's fish tacos in the Ferry Building. The only problem is it's not that big, so it gets crowded on trivia night.", 
    "review_date": "2008-11-12"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Great local bar.  The tots wrapped in bacon are overrated.  The mac and cheese is awesome.  I need ot try the burger next time.  I'll b back", 
    "review_date": "2013-03-20"
  }, 
  "RhOMDvLhQG62l6hhcgtiPg": {
    "user_rating": 2.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Allie F.", 
    "review_text": "My time I spent here was pretty mediocre, but it wasn't the bar's fault. It is a locals bar, and that's nice since I live in the area, and have had my fill of tourists at day's end. The problem being that North Beach locals and I don't have similar tastes at all. See, I am a person that will actually gravitate more toward the divey bar than the posh one.  So, naturally I was excited by people's reviews saying it was a dive bar. When I arrived, I was reminded of why I don't fit in in North Beach. This place is NOT a dive bar, it's a cross between a neighborhood bar in a strip mall in Orange County (if those exist there) and a sports bar. People also claim it's laid back, so I wore a nice t shirt and jeans, and felt shabby in comparison. This was a Thursday night, and it seemed to be on fire when we arrived, about midway through, the crowd was just one group and split. I thought Thursday was the new Friday?  So, most of the minus points are just because it wasn't my type of atmosphere, and because of the 90s corny lite rock/pop playlist. And a huge minus for the guy that turned the music off completely, then yelled for everyone to \"be quiet and listen for a cellphone.\" Buzzkilling douche! Plus points were having Afflingem on tap (with correct glassware), 2 dogs chasing each other across the place, and a nice bartender without 'tender 'tude.", 
    "review_date": "2008-09-27"
  }, 
  "yfG8hiLv0mA0ltTNXERuYQ": {
    "user_rating": 5.0, 
    "user_location": "McKinleyville, CA", 
    "user_name": "Roxanne S.", 
    "review_text": "I don't live in San Francisco but every time I go this place is a must. Walking here for a good drink after having dinner, or even ordering food there (really good) while watching every game that's on and having nice chats with a bartender is what you can expect.", 
    "review_date": "2013-01-26"
  }, 
  "e1IsFbb9rlL6XWshsPIlvw": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Iroquois S.", 
    "review_text": "Went here for my friend's b'day and had a great time. Good vibes, nice seats, and a great selection of drinks. This is a really good bar.", 
    "review_date": "2012-05-13"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "The Boardroom is my FAVORITE bar in San Francisco. And that is saying A LOT because San Francisco has so many amazing bars! Here are a few of the many reasons why:  - $2 Tecates and $6 for a Tecate and a shot = a great, easy deal - Amazing special cocktails (if you know what to ask for...!) - Great food: love the breakfast tacos and sweet potato fries especially!  AND... - This is the bar where everyone knows my name! Yes, CHEERS! :)", 
    "review_date": "2010-06-16"
  }, 
  "4UL3DMIbD75c9xLXYB-Saw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina C.", 
    "review_text": "I was across the street at North Star and my friends wanted to get food at this place. They ordered the tator tots and I eneded up eating last one of them. They have bacon wrapped tots that are good. Of course I met Keith and Casey, what a duo. They are super friendly, way friendlier than North Star bartenders. Service was slow though, Casey was talking with some people at the other end of the bar forever and Mama needs a drink. :)  Good times, trivia night was last night, but I met up with other friends as Kozy Kar so I missed it. It was pretty packed.", 
    "review_date": "2011-06-01"
  }, 
  "DLu1gmytH0WSt3LdniwaBQ": {
    "user_rating": 4.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Gene G.", 
    "review_text": "Fun fun fun !!! Just ignore the drunk guy who walks around asking everyone if they want to fight and he will eventually leave you alone. Cool crowd and cheap drinks. Great place to watch a game.", 
    "review_date": "2009-10-19"
  }, 
  "CqVM1P-jjY7wy52K6gEqow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roxanne D.", 
    "review_text": "To the guy below that call the place \"Racist\". I was there and I'm african-american. You were kicked out for taking your beer outside. No place allows that if they can't serve liquor outside. The Bartender ( Sal ) was super polite, reasonable and gave you NUMEROUS WARNINGS. You and your friends were out of line and rude. You can't break the rules and be sh*tty!!!! Sorry... you gotta Pick One! That is why you got the Deuces, bruh!  This place is amazing. Great Food and Great Staff. The perfect local sports bar!!!!! From the drinks specials to the neighborhood, it doesn't get much better than this. It's kind of place you can walk in alone and leave with new friends. Love y'all!!!", 
    "review_date": "2014-09-04"
  }, 
  "0qvijl9gnUNKZ4YilSlsqA": {
    "user_rating": 4.0, 
    "user_location": "Boulder, CO", 
    "user_name": "Merrilee T.", 
    "review_text": "If nothing else, I love this place for the tater tots. There is nothing like a bloody mary and an order of tater tots and waffles to cure a hangover on New Year's Day. The bartender was awesome. We thought we would have to order from the bar, but he came out and took care of us. He was rowdy, as am I, and he makes the bloody mary's spicy. It is a great brunch/day-drinking spot, but I'm not sure if I would go there to drink at night. It started to fill up with football fans in the early afternoon, and took on a more Marina vibe. I got hit on by a guy that was 6 years younger than me and it made me feel like a cougar, but I am just a puma.", 
    "review_date": "2010-01-10"
  }, 
  "h0FPJR1jCDpwq0C4t8ArLA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline M.", 
    "review_text": "On weekend mornings when you can't stand the thought of dragging yourself into a pair of heels and curling your hair for brunch, there is The Boardroom.  A divey, welcoming establishment where the weekend brunch-time bartender takes pride in entertaining his patrons. It's like having brunch at a friend's house - aside from getting a check at the end.  The bloody mary is divine and garnished with a house-pickled green been (yum), $14 pitchers of mimosas are just what some weekends call for, and the irish coffee is so, so lovely.  The breakfast BLT is crispy and buttery and pretty much everything your poor pounding head needs. Also tasty is the breakfast burrito (with sausage) and bacon wrapped tots are a classic.  I'm not a fan of sweet food for breakfast, but the biscoff french toast looks amaze as well.", 
    "review_date": "2013-07-29"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "After reading all of the great reviews about this place I decided, with a little prompting from my roommate, to see what it was all about. Up to this point I was a little hesitant. I remember when this place was Shannons and I wasnt sure someone could turn that dump into something desireable,   The new owners have done a good job of giving this place a facelift. Completely gutted the place and started over and it is now a somewhat upscale looking sports bar, complete with 4 TVs and local artists work hanging on the walls.  Everyone was friendly. We went on a Monday night and had their fried chicken special ($12 for chicken, some really good mac and cheese and a side of veggies). They were even willing to give us 1.5 orders of it since the three of us each wanted to split an order with one another.  The beer prices seemed a lttle high ($5 a beer) for being off the beaten path a bit. For a bar that is working on being a neighborhood bar rather than a tourist haven they should really think about dropping the prices just a bit.  Overall a pretty cool neighborhood place. I am curious to see how it evolves.  3/9/07 - Update - after spending another evening at Northstar I realized this place deserves an extra star...I forgot how god awful some of the places in good ol' NB can be.  3/17/10 - Update - this bar is no longer Woody Zips (clearly) and I have been back several times since it has changed hands again and become the Boardroom. Some of the food items have changed, but they are all still good, possibly even better, and they have added bottomless mimosas on the weekends so I see there are even further improvements!!", 
    "review_date": "2007-02-13"
  }, 
  "zpb17M4OG4Agjn3dK32CEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelo F.", 
    "review_text": "Nothing boring about the Boardroom on a Tuesday Night!   Almost a 2.5 week long binge on partying and socializing has left me running on empty (both via the bank account and my energy levels) but I wanted to check out this North Beach spot due to all the hype.   I'm so glad I managed to get here. There are so many reasons to trek all the way up from the TL.   1. Its off of Broadway so I'm fairly confident that it won't get packed on a Friday or Sat.  2. Accepts credit cards ($20 min.)  3. Real cool/fast/attentive bartenders who are easy going and know the regulars well.  4. Totally reminds me of my regular watering hole (Whiskey Thieves).  5. Happy Hour: $2 tacos, $2 beers, $3 Chicken Sliders, $6 Jager/Olompia special. They also have tater tots and fries. Overall, a great bar food selection.  6. THE BEST TRIVIA NIGHT I HAVE BEEN TO. I have been to trivia night at 3 previous bars and this trivia had the most diverse set of questions which allows everyone to participate. Now if they only had a round of flip cup, that would be just peachy. We won second place for the best team name. Woot.   Can't wait to come back for those tots.   ps. To the cute girl I met that night: See I didn't throw up on you, hit me up some time....", 
    "review_date": "2008-12-24"
  }, 
  "ARZEF-3LkCLJVSrW9BtHOw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie M.", 
    "review_text": "This place is fairly new and isn't the most glamorous place on the block, but I like it for one main reason: The people. I have met a few or maybe all of the owners/bartenders and they are all great. Plus the crowd is actually really cool as well. I learned about this place on a pub crawl in North Beach a few months ago and I really enjoy going back. Another place I found on the crawl, was the Northstar which happens to be right across the street from woody zips. Both of the Bars are a lot of fun and have a really good crowd.", 
    "review_date": "2006-11-30"
  }, 
  "m5ssxEA0FTwYpGKi646Rjg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lara O.", 
    "review_text": "I was drawn to this place with the promise of bacon wrapped tater tots and brunch.  I understood this is a dive bar, so I didn't expect too much. The food is cheap bar fare. There are lots of tvs showing sports and lots of frat alumni for those that enjoy those things.  The fact their cocktails lacked essential ingredients, however, is the reason I'm giving this bar a low rating.  I ordered an irish coffee that didn't have any whipped cream on top and a pisco sour that didn't have any egg whites in it. I can excuse a poorly made cocktail in a dive bar, but an incorrectly made one is where I have to draw the line.   BONUS TIP: For good cocktails nearby, check out Tony Nic's Cafe or 15 Romolo.", 
    "review_date": "2014-03-02"
  }, 
  "M4x7LkzUqKoRNlV42uFo7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty F.", 
    "review_text": "not a bad little spot in north beach. kitchen was already closed by the time we had got there so we weren't able to ordered the fabled bacon tater tots", 
    "review_date": "2012-09-28"
  }, 
  "Zgvf7jcSRZfoNZP-1KHj9g": {
    "user_rating": 5.0, 
    "user_location": "Hermosa Beach, CA", 
    "user_name": "Nate F.", 
    "review_text": "Solid place with a great staff.  Try the Shrimp Po Boy. Great place for a meal or a game.", 
    "review_date": "2010-10-20"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Just another run of the mill AWESOME bar.  Excellent bartender, clean, good prices, lots of televisions and great bar food.  This place just makes you feel comfortable.", 
    "review_date": "2011-05-31"
  }, 
  "J5MJGJr939qH0XfBqEC81A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny S.", 
    "review_text": "I like this place, but I'm not in love. I usually end up here because Northstar is too crowded.   I will say that the bartenders are friendly. Their pours are generous and even more generous during Happy Hour. Luke is my favorite.The bar food is awesome. The chips and salsa (chips are deep fried), the burger (is huge) and the sweet potato fries are insane! My favorite thing about this place is that they serve corn dogs. Yes I've tried them and no I prob won't eat them again. However, they serve corn dogs and they serve a variety! They have your traditional dog, a lamb dog and a turkey dog. Use your imagination.  So they serve corn dogs and they have my poison of choice: Absolut Ruby Red. Honestly, what more could you want?", 
    "review_date": "2007-02-21"
  }, 
  "Ktusi9_epT45A30y0GhHhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B H.", 
    "review_text": "Please go and get the corn dogs - they are delish. Also, possibly one of the top 5 for wings in the city.   We were in there on a sunday and it was empty and relaxing but I can definitely see going back for a game.  Thanks Keith!", 
    "review_date": "2006-11-06"
  }, 
  "nCYcZqc1S2q-8_NvL2Lrww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle R.", 
    "review_text": "Great spot!  Truth be told, I've generally been frequenting the bars with freshly squeezed juice kind of cocktails.  Must say though, they rock the cocktails here despite not squeezing the pineapples and cranberries onsite.  Welcoming vibe, good drinks, great prices.  Fun bartender who clearly loves what he is doing.  I will be back!  Didn't see any sign of food menus, however, so not sure about any of that, but again.... I will be back!", 
    "review_date": "2009-08-16"
  }, 
  "ww0UBHkI-XJ9_1oIdv6Uyw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle S.", 
    "review_text": "Friendly service. Great food (bacon wrapped tators,! Deep fried pork buns with awesome sweet and spicy sauce!). Great drinks! Non pretentious patrons that will sing along to Whitney Houston and do push ups for shoes! What more can you ask for?", 
    "review_date": "2014-02-07"
  }, 
  "VvQM7ULlGGm8c3W2oCNZdA": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Kevin W.", 
    "review_text": "Cheap drinks, friendly staff, fun atmosphere, clean bathroom, patrons choose the music. I'm adding this to my list of dive bars to revisit on the weekends!", 
    "review_date": "2013-10-27"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "I had forgotten that the 750 Restaurant no longer serves brunch so a quick look at my Yelp bookmarks in the area saved the day.  The Boardroom no longer offers bottomless mimosas but you should order the Bloody Mary anyway.  Martin quickly became one of my favorite bartenders after bragging about his mix, rightfully so too!  It complemented my bangin' Brisket Breakfast (poached eggs, brisket and potatoes swimming in au jus) quite nicely.", 
    "review_date": "2013-11-20"
  }, 
  "d2Xa7nTMzPoGWDRyr2QinA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Chris L.", 
    "review_text": "Settled, home-y vibe. The drinks are decently priced and they carry at least one off-beat beer, which is refreshing. The furniture was kind of awkwardly arranged.   Seems like there's usually a bouncer outside, though they're not that serious about IDs.", 
    "review_date": "2008-08-12"
  }, 
  "2XKA9NwN499NjkePsWS8BA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian S.", 
    "review_text": "They've got a great trivia night on Tuesdays and some of the friendliest bartenders I've met.", 
    "review_date": "2010-01-19"
  }, 
  "lfm5HbzSgj6Y8o28Fd89UQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vinny P.", 
    "review_text": "great food, excellent bloody marys and they have been really accommodating to our CLEMSON TIGERS on gamedays. martin is the man.", 
    "review_date": "2012-10-14"
  }, 
  "7-3hVAMj42uAyc3oiVIlQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly Q.", 
    "review_text": "A great neighborhood find.  They have really, really good wings (vinegary like I like 'em) and tacos.  Pretty crowded Friday night 9pm-ish but not like I wanted to tear my hair out of my scalp.   They don't know how to make a snakebite (cider + lager; they used cider + Guinness, which is a black velvet).  The 'tender was a bit arrogant and gave us attitude about it, but kinda goes with the joint.", 
    "review_date": "2009-08-23"
  }, 
  "ujTAcGkASwNNgku8BWPOzQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jaclyn L.", 
    "review_text": "Came here while the $6 fernet + tecate or fireball + tecate deals were advertised.  Decided I had to finally try fernet, as I am a San Francisco native and it would only be appropriate to say I have drank it.    Suffice to say that those deals have changed my drinking choices forever.    Fernet &amp; Fireball 4 Evr.  Also, they have a dart board in the back, and that is good fun with a small group of friends.  Chill place, friendly bartenders, friendly crowd.  A+ would drink again.", 
    "review_date": "2013-05-30"
  }, 
  "QPhKwoNEGYzIeidIOh-5gQ": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Jackie G.", 
    "review_text": "After a very bad experience at Elephant and Castle's trivia night about a year ago, I've been searching for another Trivia place for awhile. The Boardroom is PERFECT!  We showed up on Tuesday at 6 and they put the debate on their three big flat screen tvs. We all ordered tacos ($2) and Olympia ($2) and were very pleased with the beef, chicken, and fish tacos. They even made a vegetarian taco for my veggie friend!  After the debate ended the bar started to get really crowded. Everyone was showing up for Trivia Night. My team, The Answer is Five, was tied for first place up until the spelling round where we got destroyed...sad :(  I will definitely be coming back and I'm already recruiting spellers for next week. The trivia was great. They did a music round with clips of songs and a movie round with video played on the tvs. They had a name that person, picture round and then a few round of random information ranging from Current Events to Sports to Pop Culture.   The bar isn't that big but it's very nice inside. They have chairs along the wall, a couple tables in the corner and a couch and some comfy chairs near the back. They also have a second bathroom in the \"storage closet\" in case you really need to go.  I'm really glad I checked this place out. Their sign is black and red and not inviting but now that I know what it's like inside, I'm planning to spend a lot of time there.   They also do Bingo night on Wednesdays!", 
    "review_date": "2008-10-09"
  }, 
  "3uLnxiRIhSBFhefhywauuQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea F.", 
    "review_text": "I ordered a vodka soda and was served vodka with flat soda and a lime. There are really only two liquid ingredients to this drink! Moreover, it is so standard that any bar that is practicing the business of making drinks needs to get it right. It was like drinking vodka mixed with water.  My boyfriend, who claims to love Boadroom in a four-star-kind-of-way, ordered a beer. When I finished forcing down the gross vodka soda I asked him to order me the same beer that he had. He said, \"Uh, I do not think you want this beer.\" It was a beer, what could be wrong with it? Warm and flat. I learned that the hard way.  I was completely underwhelmed in a neighborhood with so many bars. We had some snacks which were fine--typical deep fried bar food. The crowd was eclectically entertaining. That is why Boardroom does not get one star. There are surfing photos and snowboard bindings mounted to the walls as decor.", 
    "review_date": "2009-03-16"
  }, 
  "m-_pnRtoqOxw-zOtDADckQ": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Cara J.", 
    "review_text": "Went there last night for Taco Tequila Tuesday Trivia.  Loved the trivia, best MC I've experienced in SF.  My friend had a chicken taco and loved it.  I had the veggie burger and tator tots with BBQ sauce, exactly what I wanted, total soul food for me.    Had to skip the tequila, but when I asked for heavy on the vodka wells drinks, I got them, not as strong as Bellingham, WA wells drinks, but hey they were selling $2 Oly. Seriously, I haven't seen Olympia anywhere since I left WA.  Oly is kind of as bad as Rainier (Rain-ier beer comes from here . . . - you're definetely from the Seattle area if you have any idea what I'm talking about.).   The manager/owner (?) was great (minus eating big nasty steak with his hands in front of me, but props for noticing I thought it was gross and moving on) and his (?) dog was adorable.  Other bartender was nice too, but didn't make as strong a drink, he clearly needs to visit Bellingham or Olympia.", 
    "review_date": "2009-04-29"
  }, 
  "Hc_VXq8EG3W_WxHRhvZMUg": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Rina M.", 
    "review_text": "Decent kinda-sportsy bar. This is good place to go on a Sunday to catch the game with a fun crowd and there's a dartroom or some fraternity-closet-looking room in the back.   + 4 or 5 midsized TVs playing all the football games + cheap, borderline free drinks (cocktails, beers on tap, PBRs if you're feeling ironic) + decent selection of food  - TVs are small - seating can be scarce, mainly because of bros on bros on bros.  - quality of food is hit or miss (the tater tots tasted unusual)  Worth checking out if you're in the area, don't make a trip out of it though.", 
    "review_date": "2012-11-25"
  }, 
  "4FXbovgSEFZ5_9S5wddFIg": {
    "user_rating": 3.0, 
    "user_location": "Glasgow, United Kingdom", 
    "user_name": "Lisa E.", 
    "review_text": "Try the bacon wrapped tater tots!  I am not sure they are '$9 good' but it is bacon and tater tots, you really can't go wrong.  The Boardroom was a typical dive, order at the bar and disgusting bathrooms, but it was fabulous to get away from all the tourists!!  We each had a cold beer, wolfed down some bacon wrapped tots, then decided it was time to move onto the next watering hole.", 
    "review_date": "2014-08-05"
  }, 
  "TV1o8G-Pvk0NYt5taaeuiw": {
    "user_rating": 1.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Tre M.", 
    "review_text": "After eating several entrees of food and enjoying a couple drinks, my friends and I were outside chatting with some other guests and my girlfriend brought me a beer while I was outside. She claimed that the bartender was cool with this. While we were outside talking, a man who claimed to be the owner happened to be walking into the bar at the same time. He stated that we could not have our drinks outside, to which we gladly obliged and brought our beverages inside. At this point the owner seemed very upset with the bartender for letting this happen. Once inside, my girlfriend went back outside to have a smoke and did not have any drinks with her. She had been outside for about 20 min and since the area is a little dark and shady, I decided to peek my head out the front door to check on her. Let me clarify, I did not set foot outside of the door I only looked outside to make sure my girlfriend was OK. At this point, the bartender very rudely asked me to give him my drink. I believe he was trying to make up for his prior mistake of letting us take the drinks outside and to look good in front of the owner. Once again, I did not put up a fight and gave him my drink and the bartender never mentioned that I was cut off or could not have another drink. About 5 minutes later, my buddy had an extra drink, which he gave to me. When the bartender saw me with another drink he proceeded to officially kick me and my whole group of friends out of the bar. My other friends asked why they were being kicked out as well and the owner claimed \"Because you are with him and I have to backup my bartender\". My friends were from outside of the area and I felt we were being treated unjustly and unfairly because we were seen as outsiders. Message to the bartender: own up to your mistakes and don't try and make up for it by being overly strict to customers, that is not a fair way to treat your business.  tl;dr: I had a terrible experience at this bar. Even though our entire group was being respectful, and under control we were told to leave. Mind you, the bartender had already received his payment for our $80 tab, which included food and drinks, when he decided to kick us out. Which I'm sure had something to do with the ease in which he kicked us out.", 
    "review_date": "2014-08-31"
  }, 
  "Z2AuC5sWT4mjPgt2ga7S0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karim R.", 
    "review_text": "Nice. Kind of off the Beaten North Beach path is the Board Room.  The only time I find myself in North Beach is late at night grabbing a late bite to eat if I'm feeling something Italian.  The Board Room is a pretty cool spot  that made me feel comfortable to be the only black male in the spot  I was a little self conscious at first but after my first martini that was really  good I was cool.  I even got some props for rockin my Naruto beanie.  The Board Room is a clean little spot even though I made a mess with my tasty chicken sliders.  The spicy  sauce and jalepenos made it one for the ages!  I kind of wish I would have stuck around for a bit a had the chicken nachos but I had places to be.   I'm kind of glad I went for the Anti-Valentine's Day party  that Berna La Glam hosted. I didn't meet her but I'm sure I met a few other yelpers that were having a good time but I didn't anounce myself as a yelper.  I don't want to feel like I'm apart of some kind of cult lol.   I did kind of fancy the girl in the red top and red heels she was like 6 drink a head of me. The one thing that made me reflect about anti valentines day is how much I miss my party girl and best friend. I really wish it could have worked out in my favor...  No more  sob stories", 
    "review_date": "2009-02-16"
  }, 
  "tcRhKVs9Tr6-7ohP3TIeaA": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Jacob W.", 
    "review_text": "Taco Tuesday is off the hook. Try the carnitas tacos. And you can never go wrong with bacon wrapped tots", 
    "review_date": "2014-10-14"
  }, 
  "0dDl29T0H_AGMIXGlB_wXg": {
    "user_rating": 5.0, 
    "user_location": "Haverhill, MA", 
    "user_name": "Tom N.", 
    "review_text": "This place is as good as it gets when it comes to bars. We were heading from Fisherman's Wharf back to our hotel in Union Square around 5:30 and noticed a dog inside. My wife and her friend stopped to pet the dog and we wound up having a few rounds of drinks, enjoying talking to the patrons and bartender. Everyone was extremely nice, they had an above average selection of beers on tap, and they had good happy hour deals. They also have a jukebox smartphone App that my wife was obsessed with (you can download the app and pick songs to be played for the entire bar). I had written off the entire city of San Francisco as a tourist trap until we found this place. I was really happy to search for it on Yelp and find that it is well received. The Boardroom is definitely a place I would go to all the time if I lived in SF.", 
    "review_date": "2011-07-12"
  }, 
  "aXuxyyTDs5RGoFrhajPLYg": {
    "user_rating": 4.0, 
    "user_location": "Rowland Heights, CA", 
    "user_name": "Alexander Y.", 
    "review_text": "Needed a place for food and mimosas since we were super hungry after a successful night out.  So...bacon-wrapped tater tots?  SIGN ME UP THEN PLZ.  Surprisingly very good for a weekend brunch, especially given the dive bar nature of the place.    Surprisingly though, a very good brunch.  I would've never thought that a beef brisket with poached eggs to be so good at a place like this.  But they said the beef just came in that day, and it was fresh as hell.  Gave it a shot...man I was not disappointed.  That brisket was flavored very well, and the broth was quite tasty.  Must also mention how friendly our bartender was, made our stay that much more enjoyable!  Definitely worth coming back here for sure.", 
    "review_date": "2012-09-16"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Decided to give this place a try after our visit to Northstar across the street.  It was still early on Friday around 4-5pm and it seems they are still cleaning and getting ready.    It's a bit dark with a lot of surfing items as decor.  The owner was behind the bar and he was surprised I spotted him as the owner.  Anyway, we decided to try the wings ($5 Happy Hour price).  It took quite a while but it was pretty tasty - there were 5 wings to the order.  Seem like people really like this place for their Tuesday trivia night and $2 taco, not really as their neighborhood water hole.", 
    "review_date": "2008-11-28"
  }, 
  "XkLK2iBsgqF6mWwDfRgqqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seong P.", 
    "review_text": "I really liked this bar, not just because we won on trivia night.  Go team, So Ronrey!  The trivia was really fun.  I always prefer playing when the questions are made up by the quizmaster, rather than the canned ones that I know some people cheat at.  The questions were asked at a good pace, and they didn't take forever to score the answers.  While we played, we had 4 or 5 pitchers of Blue Moon, the steak nachos, tater tots, sweet potato fries, tacos, grilled cheese and onion rings.  Everything was decent but the nachos, tacos and sweet potato fries were the favorites.  Our total at the end of the night was really reasonable, and the bartenders were smartasses, just like I like them.  We'll be back.", 
    "review_date": "2011-12-25"
  }, 
  "2GnEiGnw968a-h-v52mSSg": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Aaron W.", 
    "review_text": "A couple reasons why this place is great:   1) I took a girl here once and she HATED it. That's now I knew it was good. So I kicked that bitch to the curb.   2) The bartender is a cool ass dude. This is weird that I have to even say this because I feel like one of the prerequisites of being a bartender should be \"don't be a dick\", but we all know how that usually goes.   3) I like mimosas.   4) The brunch was awesome as hell. I haven't had anything bad from the brunch menu. You also got to have respect for a place where the guy cooking your food, brings it to you. So you know he wouldn't dare bring you something shitty because he has to look you in the eye.   5) I got to piss off everyone with my musical selections on the \"juke box\"", 
    "review_date": "2014-06-17"
  }, 
  "qrxpcs4HOhMAID2LufTT9Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney B.", 
    "review_text": "Blue Balls on Black Friday need Pink Taco!  Best team name = Free Bottle of Champage!   Apparently we are flawed (gasp!).  I had come to think our trivia team was unconquerable...but this past week we didn't walk away with the $30 bar tab we've come to expect week after winning week. Good thing we still have something going for us...creativity :)  As reigning champions for the last 4 weeks at Tuesday Trivia, our streak came to an end.  We fell short by only 3 points, but came through with the best team name of the week! Holla playas! Free bottle of champagne works!  FOOD- Yes I go to the Boardroom on Tuesdays for more than just trivia, free bar tabs, and champagne...Tacos!  $2 for Chicken/Steak and $3 for Fish. Yum. All of them yum. Not quite Nick's, but close. Chicken Sliders- $3. Super tasty and not remotely good for your health. Pretty good calamari, and the steak nachos and quesadilla are delish, esp the nachos. Sweet potato fries seem to be a hit/miss. Rest assured the tacos are always the bomb.  Keith and Con are fantastic. Treat them well and they'll hook you up.  See ya Tuesday when we'll once again regain our status as reigning champs and take all you mo fo's down...again.", 
    "review_date": "2008-12-05"
  }, 
  "tvzvnNkafpTNI5yCaGW46g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justine K.", 
    "review_text": "Good eats, good company, a little out of the way so you don't get so much of the marina overflow.", 
    "review_date": "2010-06-09"
  }, 
  "J1aurUGR360LS7GRnuW5PA": {
    "user_rating": 3.0, 
    "user_location": "Westchester, Los Angeles, CA", 
    "user_name": "Limzer L.", 
    "review_text": "Cool bar.  The bartender is great here.  They also sell food here.  Check their chalk board for specials that they have during the week.  This bar is really close to me but I prefer the bar across the way only because I go to a bar for drinking and entertainment, not for the food.    Don't get me wrong, this bar is cool, but I do like free billiards and more TVs to watch certain games.  Thas all....", 
    "review_date": "2009-12-09"
  }, 
  "YitXopfcsZUS7rbOWotvdA": {
    "user_rating": 4.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Brent M.", 
    "review_text": "How can you not love Boardroom? The drinks are great and always on a special... the food is fantastic. If you have never experienced their sliders, you are missing out! I was introduced to this place well over a year ago and will continue to frequent whenever I am around. Make sure you try their bloody mary! Nothing but the best things to say!", 
    "review_date": "2010-06-22"
  }, 
  "aqWXHhcR_CdmKmxggFOlEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy L.", 
    "review_text": "I was pleasantly surprised by the Boardroom:  good drinks, nice bartenders, cozy place with a decent amount of space (and seats). I got introduced to the Boardroom when I went on a pub crawl that stopped there.  From the name, i thought it was going to be a stuffy place (as in the business version of a board room), but when i got there i found that it was named was pleasantly surprised to learn that it's the surfboard kind of boardroom.  I've only ever been for drinks, but it's a chill, laid-back place to have drinks with friends.", 
    "review_date": "2009-02-25"
  }, 
  "OaRk-RwFEzfOtc45ff0fGA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "$6 for Tecate and a shot of fernet isn't a bad deal, but the bacon-wrapped tots is somewhat pricey for what (little) you get.  You'd be much better off ordering the chicken tenders - they'd be more filling at least, for about the same price.  They are very salty though, so be prepared to order more beer to wash it down with.  It's a vicious cycle!  The bartenders are great though.  I second what Alison B. said that they treat you like a regular even when it's your first time there (or your second time within the same day).", 
    "review_date": "2012-02-13"
  }, 
  "EOMN4mnbGO8j4Mze7HIcFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jill H.", 
    "review_text": "I'm all about Taco Tequila Trivia Tuesday. The host is a fantastic lady, and they seem to put a lot of effort and thought into it. Decent beer selection, and fun times for all!", 
    "review_date": "2009-07-16"
  }, 
  "gytFjzBw-z5LZD-6JSMChg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy R.", 
    "review_text": "Pretty good spot ... North Beach is not my fave ... and the crowd at most places out there can be so so but this place was not too bad.   My drinks were poured a little on the weak side (I like to order tall drinks cuz I drink so fast) the bartender/I think owner actually MEASURED my shot of whiskey! :(  .. it seemed like he measured even less than a three count. Anyway, the trivia night was pretty fun and the food looked good.  I'll probly be back if I'm lookin for somethin to do on a Tuesday...  Next time I'll go hungry :) and order beer PBR's :)", 
    "review_date": "2008-11-26"
  }, 
  "yv2UlWzXy6buGLwyoyNkNw": {
    "user_rating": 4.0, 
    "user_location": "Roseville, CA", 
    "user_name": "Erica A.", 
    "review_text": "Went into Woody Zips twice this weekend. Well once if you want to be technical...First time started with great beer, decent crowd, and friendly bouncers/bartenders.   Cut to mid way through the day, come back with a bigger crowd. It's St. Patties day I know the place is packed we must wait in line, no biggie. The ass at the door lets half of my group in, it's obvious btw that we're all together in a group. Then puts his hand out to stop me, \"How  many in your group?'  I reply, \"Um we're with them.\" My friend comes back and  wants to know why only half the group got in. I make what I thought was a humorous crack and say \"Apparently our kind are not welcome in there.\"..Comment not taken well. He flips out and then proceeds to tell me how I am not welcome in his establishment, my kind won't be tolerated and that I am  rude. WOW!!!!!!! Here is the funny thing, I was pretty sober at this point and I'm only five feet tall, not some brooding drunk giant. Do I appear to be the bar brawling type? How do you 86 someone that can bearly see over the bar??!!?? lol  I'm saddened I feel like this bar had serious potential. I will never set foot in there again \"as my kind are not tolerated.\"  ***UPDATE: So I have yet to go back to this bar, but I'm going to update my review anyhow. After reading my not-so-nice review, I was contacted by both owners. AWESOME! Yelp justice at it's finest. They both apologized and I believe I have a beer with my name on it  next time I visit. It's nice to know that the owners care about their bar and the patrons. Thanks guys! ;)", 
    "review_date": "2007-03-19"
  }, 
  "D01KrKs9izEdoT0Eh4i4rQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dipesh G.", 
    "review_text": "I've been to the Boardroom a few times now and I've enjoyed it every single time.  The food is pretty decent, reasonably priced, and you get a lot of it.    On Sunday's they have Bottomless Mimosa's for $12 and I think they have $2 Tecate's all the time.  They also have NFL games on Sunday's during the season.  Since it's an Oregon Ducks and ASU Sun Devil's bar, they have games from those schools on too.  The bartender's are nice and the service is great, even when there are lots of people there.  For a neighborhood bar, this place is difficult to beat.", 
    "review_date": "2009-12-07"
  }, 
  "y3HFVx8nbNmomSc-PWOy-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy N.", 
    "review_text": "Popped in here recently and like I said last time, Sal totally rocks!!!  Great little bar...across from the North Star and away from all the general craziness.", 
    "review_date": "2012-07-14"
  }, 
  "R2Cm3UWOv_DWAbxP6Ov0Ug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karin K.", 
    "review_text": "Excellent brunch!!", 
    "review_date": "2014-07-20"
  }, 
  "Rnfozp5HL7OTR6rbaDg64Q": {
    "user_rating": 2.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Alvin Y.", 
    "review_text": "As charming and friendly the bartender was, as much as I tried to like this place, The Boardroom is not recommended for breakfast.   The breakfast foods are average at best. Major complaints at my table were the dry biscuits and too many salty beans in the breakfast burritos.  However we did really like the $14 pitchers of mimosas.", 
    "review_date": "2013-10-23"
  }, 
  "wsDiT-IGGM8tvlaMwf1zwQ": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Emily F.", 
    "review_text": "This place is for turds. I'm sorry - it had to be said.   The Boardroom is dirty and not in a rustic dive bar way. More like a \"I just walked into someone's living room and they haven't picked up their shit off the floor in months\" way. It is also like a living room in that all the bros (and woman bros) at this bar seem to know each other and they all have to grunt loudly at each other and yell across the room before taking a sip of their drink.  Drinks are normal and not cheap. The food was practically inedible. Being here made me want to die. I'm not an asshole, I promise.  One star for being close to my house?", 
    "review_date": "2009-09-21"
  }, 
  "oBgYDUYPl2yI_fD-cB_nIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon B.", 
    "review_text": "Mission: Taco Tuesday Venue 3  We were the first in the bar at 6pm... great for us because we didn't have to wait to order beers or Tacos. $2 chicken and steak tacos were pretty delicious... especially liked the soft shell that was slightly fried. We discovered that they do $2 tacos all the time, leading us to ponder perhaps a Taco Thursday? But I digress...  Started with Blue Moon on tap, then had a Tiger Beer (yay Asia!), then devolved to bottles of PBR. Seems like the drink of choice for most others that night was the $2 Olys though.  Spent between 6 and 8:30pm getting a good buzz on and chatting up the bartender (Shout Out Keith!).  Trivia started around 9 and, well, we sucked. But it was a blast and we were thoroughly happy when we left at 11:15. Next time our team name will be: Drinking our way to last place. (Oh, and it wasn't overly crowded... maybe we picked an off night.)  Only Con: Between two smaller ladies, each having 2 tacos and then a shared round of $5 happy-hour-special nachos, we still managed to rack up a tab of more than $50. Eeks. Oh well.", 
    "review_date": "2009-03-11"
  }, 
  "9hQvIXgZU1eq7B-0jWfkkw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrei Z.", 
    "review_text": "Pretty good and unassuming spot in my neighborhood. Mostly local crowd and decent selection of drinks, including some interesting tequilas and one of my favorite gins - Miller's. Still haven't been to Tuesday $2 tacos + trivia night, so might have to check that out. The only thing I can reasonably complain about are the bar stools - they are pretty damn heavy and unwieldy to sit in.", 
    "review_date": "2008-08-12"
  }, 
  "e7RkJGYr5Yg0iZoGdUhyMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ian M.", 
    "review_text": "Caroling pub crawl was well received.  Bartender was great and crowd was awesome.  Order the pitchers of mimosa.  Highly recommend.", 
    "review_date": "2011-12-21"
  }, 
  "eiTboCTfpX0t8mWXLwcwYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "Great bar, awesome bartenders, cheap chicken wings and bacon wrapped tator tots...plenty of tv's to watch sports.  Bar is full of 49er faithfuls...", 
    "review_date": "2014-02-09"
  }, 
  "1d-sMlYqOkrfPPh_6VePrg": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "J D.", 
    "review_text": "You know those great local bars in your neighborhood or your friend's neighborhood that you always have fun at and would come back at the drop of the hat? The boardroom is that kind of spot. I have same I'm somewhat biased because this is the unofficial ASU bar and as a proud alum here in San Fran its not always easy to find.   Tuesday night is really fun too, cheap tacos and $2 beer. One of my favorite places to come and watch a basketball or football game and relax. Food and drinks are both great and def not expensive compared to the other places in the neighborhood. There's even a parking garage literally next door that makes it really easy if you're travelling by car. Highly recommended!", 
    "review_date": "2009-02-05"
  }, 
  "u6ms8jCUMd3qhlB6hufV-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly C.", 
    "review_text": "Ladies and Gentlemen, the great Tuesday debate has been solved! No longer do we have to debate Taco Tuesday v. Trivia Night, because Boardroom gives you both!  They've got cheap, greasy tacos, which is all good because their grease tastes gooooood. The nachos are also spectacular, and you can get an Olympia (or four) for $2 a pop.   Trivia is entertaining and with a wide range of topics. Stick around after your dinner, and get ready for some drinking and thinking!", 
    "review_date": "2009-01-07"
  }, 
  "B2jNEZXPcieDWgWhYtg0kA": {
    "user_rating": 5.0, 
    "user_location": "Astoria, Queens, NY", 
    "user_name": "Chrysantha C.", 
    "review_text": "Oh the days I used to stay in SF and WoodyZips was a stonesthrow away... I really miss this place and the deconstructed CORN DOGS! anyone who can serve up 3 amazing corndogs for $8 is automatically amazing...  and I guess I should also mention the awesome bartenders and the friendly people who love to kick it at this establishment too!", 
    "review_date": "2008-10-18"
  }, 
  "0aEsYrwrBHE4LRgvv-A2yg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina M.", 
    "review_text": "I have, from Woody Zips to Boardroom, always been impressed with this divey little locals haven.  TVs, games, blaring iPod music (that you CAN ask to have turned down if it's really bothering you), swell staff, and pretty awesome burgers (and food in general).    I've only visited on afternoons, so can't really say anything for the crazy (or lack thereof) nights.  But all in all, I would say it's a great alternative to other similar joints in the neighborhood.", 
    "review_date": "2008-03-26"
  }, 
  "mpFLXU5Hc8pDlxZpbfjFNQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy F.", 
    "review_text": "The boardroom instantly became one of my favorite North Beach bars, but how could I resist~ the good food, the cheap beer, the nicest bartenders ever, the well played music selection, the trivia. I really didn't think it could possibly get better, but magically it did- they added Wednesday night BINGO!! I have to say I was a little skeptical at first, but the free drink prizes along with post dance parties I haven't missed a single week.  BINGO Wednesdays can't be missed!", 
    "review_date": "2008-08-29"
  }, 
  "qDZON_eIlgEG6XZUrk9-lw": {
    "user_rating": 4.0, 
    "user_location": "Auckland, New Zealand", 
    "user_name": "Lauren T.", 
    "review_text": "Wine was pricier than I anticipated ($8 for a house red). But it's a cute bar with friendly staff and a relaxed atmosphere. Good for people looking for a comfortable spot to have a drink and a snack.", 
    "review_date": "2014-11-21"
  }, 
  "0t-O5--DOfS55A620fO_GA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea H.", 
    "review_text": "Yay! I'm a fan.  Here are 5 reasons why I give two thumbs up to The Boardroom:  1.  The Boardroom is an Arizona State University bar! Fork 'em, Devils! The NorCal ASU alums congregate here for games 2.  Bacon-wrapped tater tots are amazing 3.  This little dive bar is cozy and has a great neighborhood feel!  4.  You can get poutine here!  5.  The regulars are friendly and the management is too!  There is good company here", 
    "review_date": "2014-09-11"
  }, 
  "aohGpwDqs7Rsy6qlZ5h4YA": {
    "user_rating": 5.0, 
    "user_location": "Louisville, KY", 
    "user_name": "kevin g.", 
    "review_text": "Maybe I am just in a giving mood today as my reviews seem to be glowing but this one really deserves it. WE were looking for a place that my friend could watch the game and we finally landed mainly due to Yelpers on this place. The fact they had bacon wrapped tater tots was simply deep fried icing on the cake. When we go there we were surprised at how small it was but they indeed had several screens on and one of them was the game my friend wanted to watch. We of course wanted to dine so the extremely cool and helpful bartender (Martin) got us fixed up with menus.  The selections were not your typical bar food, my friend had a veggie burger with sweet potato fires, I can vouch for the fries as I stole a few (for review purposes of course). I ordered the signature bacon wrapped tots, and a breakfast burrito that took up the entire plate. It was very tasty and really not too overwhelming for its shear mass, but had what I have to assume was house made guac, and other goodies. I also had their secret sweet tea vodka concoction which I have to admit would be dangerous if consumed too fast or if you had to be somewhere serious but in the context of brunch it was just right. So I had 2.   I guess the biggest plus for this place was it was clearly a neighborhood pub, and we were clearly not from the area but I felt they treated us as if we were there every night, I think anybody can sling drinks but Martin made us feel like he was opening his home and making sure we got whatever we needed. And he had great taste in music which never hurts.  If you are looking for a great brunch and what I assume is a great place when the sun goes down to enjoys some drinks head on over to The Boardroom.", 
    "review_date": "2011-11-24"
  }, 
  "M0mONsg1ZJIKA30ad1qE1w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina A.", 
    "review_text": "bacon wrapped tator tots.  in theory, it sounds awesome, they were actually overcooked, dry and quite salty.  i do appreciate they give you a mix of buffalo hot sauce and ranch to dip it in, but for $8, it's a little steep considering there were about 12 tots on the plate", 
    "review_date": "2014-02-04"
  }, 
  "4BXqlLKW8oP0RBCW1FvaIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina S.", 
    "review_text": "Tasty bar fare (sweet potato fries), cheap drinks, couch, extremely friendly owner, nice bartenders and a kick ass Tuesday trivia night.", 
    "review_date": "2009-07-06"
  }, 
  "duymKKwUruH8GwbvcaFd0w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene X.", 
    "review_text": "Nothing distinctly special or wrong about this spot, but I think I'll have to go back on a Tuesday to check out their special for the fish tacos.  The good thing is that it's not tourist filled and more a locals joint.  Of course I was there on a Monday and the only one there for a bit.  Luckily the bartender was nice and attentive so she definitely is solid.", 
    "review_date": "2008-08-12"
  }, 
  "4OrFB2TDRsbokoYMhUf1EA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Clarence A.", 
    "review_text": "5 stars for some of them bacon wrapped tater tots also known as the BAC-O-TOTS of course also for our bartender  driving in the north beach area with some friends, on the window we happened to see Bacon wrapped tater tots, of course we found parking and had to venture in hahaha.  the spot itself is not that big, they do have alot to offer on tap, hard liquor and their choices for food are on point, there are several happy hour specials so you won't break your wallet coming here.  sampled one of there pilsners off tap, it was lil in-between the hoppiness and bitterness were muted since it was ice cold, refreshing and perfect for the palate of some of there bar food. hahaha  we sampled their Bac-o-tot simply genius haha tater tot i believe fried with a slice of bacon wrapped around it. enough for 3 folks to have if another choice of appetizer is offered in our case buffalo wings. The buffalo wings were standard glazed with some tabasco not to much just rite amount with ranch on the side with few celery sticks and carrot sticks  about 4 tv's that I could see 3 playing the WS Championship Giants playing and one playing motorcross, definitely a place you should venture into when in the area  food ***** for the BAC-O-TOTS hell yes price $ happy hour M-F service ***** ambiance ***** small, lil divey, friendly staff, bartender is a trip haha!!   also music in the background was mellow, sounds of Benny and the Jets playing, Lowrider and other nostalgic music.", 
    "review_date": "2011-08-09"
  }, 
  "3xXCE8znoAN2MulweWgwtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan G.", 
    "review_text": "Great local spot.  They have something going on every day of the week and always have a decent game on 1 of the 4 flat panel tv's.  Taco/Trivia Tuesday is a must do, the steak taco's are BOMB.  They have a foosball table most of the time so it s a great place to get your foos on if it's not too crowded.    Overall its one of my favorite North Beach hangouts.", 
    "review_date": "2007-11-29"
  }, 
  "_NSNcam96fXaA3aZohaKkQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tiffaney L.", 
    "review_text": "Came here for the Supaaabowl with the boyfriend.   1) Parking a bitch 2) There is no number 2.  Had a drink, a laugh, and got to watch the Puppy Bowl for a few minutes before the actual football game started. Let's be honest, watching dogs is much more entertaining than watching the Giants win.   The bartender was really cool to tell my boyfriend and I that the small nachos were more than enough for the both us. Usually I'll let my stomach do the talking, but after a shot or 2 and a beer, I'll go with what he said. UGH SO GOOD. Thank you, barkeep for the suggestion. I don't think we even finished it.", 
    "review_date": "2012-03-11"
  }, 
  "7kmlaGMjjCHN8rL8oncz_A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tim y.", 
    "review_text": "i had a blast, a friendly neighborhood bar, can and does get popular, so be ready, and taco trivia tuesday is super! gonna take my girl here!", 
    "review_date": "2007-06-22"
  }, 
  "fx_oas0OGcUWsAF_jOCx0Q": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Paul A.", 
    "review_text": "Good Selection of beers, good bar food and cool bartenders. Good place to catch a game.", 
    "review_date": "2013-10-28"
  }, 
  "zGOXKICJ-X6tcoIHaGaITg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kia B.", 
    "review_text": "Loooooove Martin! He's a great guy, super funny, and always has a great story. We stopped in after brunch at Don Pisto's on a sunday and  had a few rounds. Super chill place, great menu, happy hour M-F. They show all games and if you're lucky Maya the doggie will be around. . .", 
    "review_date": "2011-05-31"
  }, 
  "RlCJggBXxFpt2xuOWkKDvg": {
    "user_rating": 5.0, 
    "user_location": "Riverside, CA", 
    "user_name": "Keniki G.", 
    "review_text": "A Sunday morning my friend and I were standing in a 2-plus hour line for a well-known restaurant with high reviews and eventually we tired of waiting and I decided to use my yelp app to look for less-crowded places near by. Luckily for us, The Boardroom was what we picked. I was a bit apprehensive of eating in a bar at 11am when I wanted some really great breakfast food, but most on yelp said it was to be trusted so we went for it. I am sooo glad I did. What first got me in there was the bacon-wrapped tater tots-they did not disappoint (except for the fact that I wanted more after we finished the basket. Don't share-get your own!). I have never had anything like them and I will be drooling at the thought of them for quite a while-at least until I get my hands on a deep fryer and perfect the recipe. After our appetizer we ordered the cookie dough stuffed French toast and the Croque madame-both were delicious. Then, as if we hadn't splurged enough, we decided to go for the pitcher of mimosa. During the time it took us to get our buzz on I played around with the really cool app that lets you pick the music in the bar from your smartphone.  The food gets an A+ and so does the service. Marvin made us feel super comfortable and welcome from the moment we walked in and gave us excellent advice on menu items, city tips and picker-uppers to help with a food coma. I also thought it was pretty cool that they served Pisco and Fernet-things I had been missing ever since my visit to Chile that have been pretty hard for me to come by in the US. Plus, they make their own alcohol infused whipped cream-delish! Every time I make my way up to Nor Cal I will definitely make sure this is one of my stops.", 
    "review_date": "2013-09-04"
  }, 
  "btHv7yBw1Q77e25Bub_vPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nike B.", 
    "review_text": "Nice place! Very nice staff and super comfortable and chill feeling for an easy Sunday lunch. Must try their bacon tots while rooting for your team on tv. Their drink selection is nice too so take a snap at it.", 
    "review_date": "2014-05-18"
  }, 
  "BLmRIoETvx6ZiegiIWh0tw": {
    "user_rating": 4.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Stephanie W.", 
    "review_text": "Taco Tequila Trivia Tuesday  When I heard of this aptly titled trivia night at The Boardroom, I knew I would have to check it out for the aliteration alone.  I arrived at 7:30 on Tuesday night with three co-workers for trivia and bonding time with new employees. Upon entering, our new art director ordered a round of Jager bombs, a variety of salty deep fried foods a round of beers to follow. Yeah, it was that kind of Tuesday night.  We got a great table in the corner an the crowd slowly but surely began to gather as it neared 8:30. We had our exceptional Jager bombs and though they don't have a large selection of beers on tap, they a great selection behind the bar. Our food soon arrived and we devoured deliciously flavorful shrimp tacos, corn dogs with a fabulous cornmeal batter and something as sinister, and fabulous as bacon wrapped tater tots. We were all fat kids last night.  The night progressed with more jager and tequila shots to go around. We didn't win trivia night and came to the conclusion that we need a geography wiz and someone well versed in bad movies.   As a whole, the bathroom is pretty clean, the bartenders are friendly and the space is small but cozy. It's just the right size crowd for this type of event and it turned out to be a fantastic evening out. I will surely go again once we brush up on our bad movies.", 
    "review_date": "2010-01-27"
  }, 
  "rL1rSdS08VW1SURkgzD_ig": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Aaron N.", 
    "review_text": "Any place that serves bacon wrapped tater tots gets at least 3 stars. The Boardroom is a place that everyone was raving about, so when I visited San Fran, I had to check it out. I wasn't disappointed. Along with the slamming tots, the wings they served were also freaking slamming. I wasn't a huge fan of the quesadillas, but I think it was because they were filled with black beans and other veggies that I don't like. Whatever. The other food made up for it.   The bartender was freaking awesome and knew his stuff about beer and good music. So that's always a plus. I wanna check this place out during a football weekend, because i heard it's crazy fun to watch sports at this bar. I guess it's just another excuse for coming back to San Francisco. Good work Boardroom. Boom!", 
    "review_date": "2011-11-20"
  }, 
  "tYtzhCCqQdmIxspXRsNXOQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc H.", 
    "review_text": "5 Stars alone for being an ASU bar.  GO DEVILS!  Great burgers and solid Sunday brunch as well.", 
    "review_date": "2011-09-09"
  }, 
  "bLbSNkLggFnqwNNzzq-Ijw": {
    "user_rating": 3.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Stefany V.", 
    "review_text": "Came here with the BF and his sister when I got a hankering for some burgers- this place came up and was nearby, so off we went. Was told upfront that it was a bar that serves food rather than a burger place, specifically. Good thing too, because when we arrived there was only bar seating and we hesitated at first, thinking maybe we would not be able to eat here.  Luckily, we stayed- probably because the game was on and we didn't want to waste time finding a new spot, but the fact that wings were on special really helped, too.  Fifty cent wings on Mondays, 5pm-10pm.  We ordered a round of beers (had the hawaiian one on draft- can't remember the name, but it was light and sweet, refreshing) and a ton of food: a burger and the brisket dip to share, with sides of bac-o-tots and onion rings, plus (what amounted to) 25 wings in spicy bbq, hot, and spicy island. More on those in a minute.  Burger was just okay, dip sandwich was dry and tough and we did not finish it- very unusual for us. Bac o tots were awesome, but seemed overrated based on other reviews we read here. Onion rings were okay.  The WINGS are where it's at though- specifically the SPICY ISLAND. I could bathe myself in that sauce. It was phenomenal- I was expecting something with pineapple that's overly sweet and not usually my thing, but this one.. dude, I can't even figure out what was in it! A fresh green herb/spice was present, possibly basil? Or maybe thai basil? Overall the taste to me was more thai than island, but whatever the hell you want to call it, we ordered extras of it, and even then I was dipping my pieces in the extra sauce puddled at the bottom of our basket.  Service was good- bartender/server clearly enjoys his job and was making conversation with most at the bar. Made good food/drink recommendations. Space itself is divey, and that's okay- all the TVs were working and the food was good, so that's all that matters.  Definitely want to add that the unisex bathroom was surprisingly VERY clean, which I almost didn't expect based on the looks of this place- but the appearance is deceiving. Most dive bars have mediocre foods and questionable cleanliness- and you'll find the exact opposite here: phenomenal island wings and tidy space, from the bathroom to the bartop.", 
    "review_date": "2013-10-15"
  }, 
  "-g3MZ5auviJ89FbU6pD0Fg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melvin T.", 
    "review_text": "Can you say Hipster special..... PBR and a shot of Jamie for $7 any night of the week.... I say yes please. The regulars are good people, but you do get the occasional douche bag coming in already from another bar. The bartenders are great....", 
    "review_date": "2009-08-21"
  }, 
  "Hnu5s_myOZZIS2eny7liVA": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Emily J.", 
    "review_text": "Post-Awesome 80s 5K (<a href=\"http://www.yelp.com/biz/awesome-80s-run-san-francisco#hrid:1utkwLbIxRyRkSfJKYsK6A\">yelp.com/biz/awesome-80s…</a>), we arrived in North Beach a bit early for our brunch reservation at Trattoria Contadina (<a href=\"http://www.yelp.com/biz/trattoria-contadina-san-francisco\">yelp.com/biz/trattoria-c…</a>).   After parking, I quickly searched \"bloody marys\" on my yelp app and this place popped up. There just so happened to be four stools available at the bar and the bartender whipped up some delicious, perfect-amount-of-spice, bloody marys.   We almost canceled our brunch reservation elsewhere when we spotted some of the delicious food offerings being served around us. I'm glad we didn't because our brunch at Trattoria Contadina was incredible. However, I am bookmarking this place for another visit so we can try the food. Mostly because...tater tots!", 
    "review_date": "2013-11-21"
  }, 
  "6M9vEozgZy-uTXVKr-zXvw": {
    "user_rating": 5.0, 
    "user_location": "Fairfax, CA", 
    "user_name": "Jason G.", 
    "review_text": "Bacon wrapped tator tots !!! Surf movies and a great atmosphere  I love the boardroom", 
    "review_date": "2014-09-17"
  }, 
  "gZV7Ps9eVunuUY1E9qjj4w": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Kristi I.", 
    "review_text": "A great neighborhood bar whose bartenders are always nice. Surprisingly the food is good too, a much needed item when I find that my Happy Hour has run longer into the night than planned! And who can really complain about a bar that has Fernet specials!!!", 
    "review_date": "2009-12-07"
  }, 
  "rV8jGAyZI2k9tzs4dPSk2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "melissa g.", 
    "review_text": "$3 Fish Tacos on Tuesday.  That alone should make you come.  The shells are a perfect mix between soft and hard, and the other ingrediants as fresh as they come.  The sweet potato fries were decent too--a little soggy, but they had that great earthy and sweet taste.  The bartenders are wonderful, just like Theron says.  If you're into a fruit punch, refreshing, slightly alcoholic girly drink, ask for the Kerry Berry.  It's named after one of the 'tenders puppy dogs, and it was a great compliment to the sweet potato fries.  Guys, it's pink, so you might want to get your gal pal to order it for you.  If you're going on Tuesday--get there before 7 or you won't get a seat for trivia fun.  This is a small, friendly neighborhood place.  We'd never been there before but they treated us as if we were regulars.  With food and service like that, we just might become just that!", 
    "review_date": "2008-07-19"
  }, 
  "-ty5eC5N6uWkEAt-j-E6SQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty M.", 
    "review_text": "It's hard for me to give a North Beach \"dive\" bar higher than 3 stars since you automatically pay a premium to drink in the neighborhood. I think the bar should at least give you something \"extra\" for that premium. This bar doesn't do anything special as far as I could tell. Really it seemed like it was just full of drunk 25-35 yr old dudes trying to relive their early 20's or college days.  The two good things 1. Trumer on tap...2. I've been there for private parties/guest bartender nights when friends of mine were bartending. Bars that support local events are cool. I'd rather go to the happy hour at Columbus Cafe.  Stay Tru Boardroom.", 
    "review_date": "2009-04-14"
  }, 
  "AsJ5TxY87oSFcGxu5tuc9g": {
    "user_rating": 4.0, 
    "user_location": "Canyon Country, CA", 
    "user_name": "Sam D.", 
    "review_text": "Cool bartender and a chill vibe in this neighborhood bar. Don't pass up the bacon wrapped tater tots. Truly an appetizer born from binge drinking.", 
    "review_date": "2014-07-09"
  }, 
  "JzDPb9rFVNHsMWqaCGWjHQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Danny P.", 
    "review_text": "Bacon wrapped tater-tots.  I could go on and on about the incredibly friendly service, the relaxed environment, the fair-to-good beer selection and the preponderance of televised sporting events.  I could tell you about the fairly good food, and the likelihood that when you randomly stumble into this bar while looking for somewhere after a midday Giants game to catch a beer, that no fewer than three regulars will direct you to the best place to have dinner nearby.  And it's likely that when you come back to San Francisco a year later on business, that three people from your office will demand you take them here because you haven't shut up about this place for the previous two weeks after you found out you were coming to SF.  But let's be honest, you stopped reading at bacon wrapped tater-tots and I bet you're on your way there already.", 
    "review_date": "2011-05-16"
  }, 
  "60iCXLkb9xqhe5cvEun0kg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher K.", 
    "review_text": "Woody Zips is a glorious establishment filled with a delightful assortment of fine spirits and beers.  The bartenders are friendly and knowledgable.  Woody Zips serves one of the finest arrays of pub fare you'll find anywhere.  Woody Zips is an upscale sports bar that sits like a magnet to lure in the kind of folks you'd see roaming the financial district on any given weekday.  Woody Zips is not a \"marina\" bar.  Although well-groomed and well-dressed, the crowd here always seems to be much friendlier and less pretentious than stereotypical patrons from the neighboring neighborhood.  Woody Zips stocks Miller's Gin.  If you drink Gin, you know why this deserves its own paragraph.  Woody Zips is a bar that I really want to give a five star review.  ...I really, really, really do.  They're so very close.  Four and a half stars.  What's holding me back from the full five stars?  The hot wings.  They usually have the best hot wings in the entire world (seriously).  But only when the right chef is in the kitchen.  Otherwise they're just \"really freaking good\".  The hot sauce is consistently phenomenal.  So what's the difference?  Good question.  Glad you asked.  The answer is how long they're cooked.  My friends and I all agree: when they're cooked almost to the point of being crispy, they're the best!  The last couple of times we were there... undercooked.  So sad.", 
    "review_date": "2007-05-14"
  }, 
  "0gEDwhSUIWIBz23MbLYMig": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Luis M.", 
    "review_text": "I have yet to be thrown out of this bar, or kicked in the nuts whenever I show up.  That is saying a lot considering the abuse that is sure to follow me here and be unleashed on the bartenders.  I don't even know how to describe it.  You would have to see and experience it for yourself.  Rather than hate me and my friends, I actually think that maybe they like us.  That or they are poisoning our drinks and need us to come back to administer each new dose.  Really though, they have great happy hour specials.  They have combined taco tuesday and trivia tuesday.  They have a really good bar menu, with tots.  The clientele are for the most part cool, which can be hard to maintain when you are so close to North Beach.  They have cool surf photos on the wall and frequently play cool surf videos on the flat screen TVs.  Conn deserves the medal of honor.", 
    "review_date": "2009-01-08"
  }, 
  "iqOaVJRprVKcT50t9k5jnA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L C.", 
    "review_text": "Do they still do the trivia night and the delicious tacos? If so, get on that.", 
    "review_date": "2009-07-10"
  }, 
  "vTbQZNz8FH4jcrni7Vkl1Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oleg H.", 
    "review_text": "The board room has that mystery ingredient which makes a normal bar awesome. Pretty sure its not the $2 Tecates, nor is it the new jukebox, it could be the food specials of which i tried the thursday pulled pork sandwich ($7), which comes with delicious sweet potato fries and sour cream but i dont think its it.  The awesomeness of this place comes from the folks running this place - when the bartender pulled out a sample of Imperial I switched my order, to Imperial, he informed me that it was a sample, so I got the Tecate. Later after attempting to get some vegan food at the loving hut and finding it closed we returned, got a sandwich and the bartender offered his lone imperial - which was just one demonstration of the awesome service we got at the board room, (definitely gets the venue stars).", 
    "review_date": "2010-06-17"
  }, 
  "J2W5pb0_300Gmy-W7gZz6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mitzi A.", 
    "review_text": "Great neighborhood bar....staggering distance from home (!).  Have to try the bacon wrapped tater tots...but also good are the burgers, chicken tenders, and Sunday Brunch (w/mimosa pitchers for $14,  Cake Batter French toast, Hawaiian Loco Moco, and Croque Madame sandwiches).", 
    "review_date": "2013-09-08"
  }, 
  "ORxSz94hR0bSl1zS1LuuOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "ALL AROUND AMAZING!!!!!!!! I could go on a on about how great this bar is but instead, I am just going to insist that you go to the Boardroom because you are guaranteed a good time.   One of the main reason I go to Boardroom instead of the bar across the street is the friendliness/attentiveness of staff.   They also have a full bar, food is great (especially breakfast burrito, nachos, chicken tenders with buffallo sauce YUM, and sweet potatoe fries), great place to watch games.   I've never been for Trivia Night but seems to be pretty crowded.   I recommend their sister bar, Tope as well.   Cheers!", 
    "review_date": "2011-09-14"
  }, 
  "vvGHIcfCr2toX6Bts5W7ew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephenie S.", 
    "review_text": "I'll give the bar itself 4 stars, but if I was rating the clientele, they'd get a big FAT 1 star. Talk about a Sausage Fest. And not the good kind of Sausage Fest, ladies! All the worst kind of douchey sausages that you could never want to meet. I truly hope that we had an off experience last night when we went to trivia because I feel sorry for the Boardroom staff if that is what their normal patrons are like. I'll probably only go back if I feel like it's a good night to get constantly harassed.  BUT the bar. The most important part of the review. The people working there are great. Nice people. But there were no waiters, so be prepared to go to the bar to order. The food, for the most part, was good bar food. Bacon wrapped tater tots: Delicious (though few in quantity. Not shareable, in my humble, bacon-loving opinion). Tacos: Yum Yum. Nachos: Great. Mac 'n Cheese: Not great. Just avoid it. They lured me with the promise of cheese and bacon and I felt duped! It was more watery than cheesy and even the bacon couldn't save the dish!  $5 margaritas were okay, but not strong at all. I had four and felt fine. I should have been buzzin' hard though; I am quite the lightweight. But they have $2 Tecates on Tuesday, which is a sweet deal, so you should definitely go for that.  The reason we went to The Boardroom, however, was to participate in Trivia Tuesday, which was disappointing, in my opinion. It started about a half hour late, which, in fairness, was due to the A's vs. Royals game going into extra innings, but it just got going too late for a work night, if you ask me. I couldn't hear the woman reading the questions. When she spoke at a good volume, she was kinda mumbling (drink much, lady?). And there were HUGE time gaps between rounds. I heard that it is usually better organized than that, but it was frustrating for me and my gal pals.  My general experience there probably warrants less than 4 stars, but I truly believe it was an off night based on what I've heard from others, the yumminess of the greasy food, and the quality of the service. Worth a shot, just beware of male patrons: they just may be nacho-stealing tards.", 
    "review_date": "2014-10-01"
  }, 
  "rsnnflVx_efoUU6U2u070g": {
    "user_rating": 5.0, 
    "user_location": "Koreatown, Los Angeles, CA", 
    "user_name": "Manon M.", 
    "review_text": "It was our last day in San Fran, and we were all pretty bummed, we needed food in our bellies before the trip back to LA! My roomie found the Boardroom because we were craving bacon  walked in  totally welcomed by the Bartender (owner?) who was super awesome The Giants were playing the beer and food arrived and we had a great time! will def be returning next time i'm in SF!!! MORE BACON TATER TOTS!!! (on a side note: the eggs were a bit watery and had no taste but its ok because the tots made up for it!) Turned my frown upside down :)", 
    "review_date": "2013-08-19"
  }, 
  "Wdc_L1VlVDfqxtRArJHjfQ": {
    "user_rating": 5.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "Tiziana Z.", 
    "review_text": "Love love LOVE this place! Best bloody Mary's and breakfast! Great place to watch a game, super nice people", 
    "review_date": "2014-04-24"
  }, 
  "7kPR3NAhl72EGbUU1h9FOw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg F.", 
    "review_text": "What a pleasant football Sunday we had because of the boardroom!  The TVs aren't the biggest, but there are enough of them all around this cozy bar to make every seat front row.   The bartender was very attentive, and never left us with a dry glass. The food was plentiful, basic and tasty. I strongly suggest the biscuits and gravy, but would not frown on the moco loco either. Their buffalo chicken tenders hit the spot for our second round, but the most impressive we're the nachos and the BACON WRAPPED TATER TOTS!  The crowd was excellent, a mix of all ages appropriate for a bar. There were pats, Vikings, skins, Seahawks, and of course 9'ers fans. Everyone had actress time cheering for their respective teams in this highly inclusive environment.   My only gripe is in regards to the pitcher of mimosas. The bottom line is that idea needs to be reworked in a way that is tastier. (Most likely a bit more OJ is in order)", 
    "review_date": "2013-09-23"
  }, 
  "Fk_AmsYGrjJAIbBnqYqLRg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "n b.", 
    "review_text": "The owner is friendly, the tacos are amazing and I hear they have bottomless mimosas on Sundays. This is a place you often see people taking shots. Pink stuff, Jager, etc. Good times here!", 
    "review_date": "2008-10-28"
  }, 
  "RFuMyqihKYlTKx8SNAjrVw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamar D.", 
    "review_text": "Hit this place up after the Super Bowl and it was thankfully quiet for at least a half an hour or so.  I enjoyed two Seagrams Sweet Tea Vodka on the rocks, watched one of my friends continue to get playfully intoxicated, and took a few choice looks at a super cute bartender.    Then...  About 15-20 bubbly 21-23 year olds busted into the joint, flashing their debit cards to buy a round of the $3.00 16oz Coors Lights for their parties of four and we, of the enlightened elite, simply had to bounce shortly thereafter.  Ah, to be young again...", 
    "review_date": "2011-02-07"
  }, 
  "HO_W1FyE32ZQray2ntZ7cw": {
    "user_rating": 5.0, 
    "user_location": "Charlottesville, VA", 
    "user_name": "Ryan M.", 
    "review_text": "Went for drinks and late night. Awesome late night menu until 1. Corn dogs are delicious. Bacon tots may sound good, no bueno. Great bartender/awesome service. And best of all, amazing music. Lots of hits!", 
    "review_date": "2013-11-03"
  }, 
  "HH4JSXA8OB4kHPv37fnfdA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick C.", 
    "review_text": "The Boardroom is one of the more solid North Beach bars, with a terrific selection of beer and food.  I would have definitely given it a higher rating if it  weren't for a few things that I've noticed over the past two years.  The Good: 1) Solid Tuesday trivia night - a little long for my taste, but the questions are always pretty solid, and the $2 Tacos are amazing. 2) Terrific laid back atmosphere with the owners and bartenders dogs roaming the floor for scraps, and some good seating areas. 3) It's selection of both high end and cheap beer is amazing.  Anytime a bar serves Olympia and PBR you know you have a solid establishment. 4) By far the best bloody mary in all of North Beach 5) The bartenders and owners are super nice.  The Bad 1) The food has gone somewhat downhill.  They used to have amazing burgers and pretty good wings (I'm from Buffalo so I probably have higher wing standards than most), but since changing over to the Boardroom from Woody Zips, it hasn't been quite as good (they do serve a solid meatloaf sandwich though).  Still the last time I ordered a burger I was less than impressed.  It also seems as though the fries aren't as good as I once remembered.  In their defense I know that they've gone through a bunch of chefs over the past few months which would explain the downgrade.   2) When it's crowded the service can be a little on the slow side, and due to the layout of the bar it can be really difficult to get the bartenders attention (I realize this isn't the only place).  3) $20 credit card minimum can be annoying.", 
    "review_date": "2008-11-18"
  }, 
  "_S5tB9stFX3YKLBPVoEjqA": {
    "user_rating": 4.0, 
    "user_location": "Rome, Italy", 
    "user_name": "Andrew T.", 
    "review_text": "my new favorite trivia night spot. $2 tacos($3 for the delectable fish taco) and $2 olympias all night on tuesday's. great way to get your grub on, get fucked up, and have a fun night of trivia for cheap. trivia lasts for about 2 hours with several rounds. 1 round was a picture of mugshots(i cant believe i didnt get shia lebouf, wynona judd, and james brolin...), 1 round was a weird \"clue\" like game that involved big and small cum-stains(dont ask...), 1 round was 1 minute movie clips to see if you could gess the title, other rounds were simply questions with different themes.  the trivia host was super cool and cute and knew her shit. she had to yell out the questions all night because the mic was broken, but never a complaint. the bartenders were cool, even throwing out an old dude that kept yelling out answers. this place is right on the edge of north beach and a definite great spot. looks like we may be doing a few UYE's here so check the events page for tuesdays.", 
    "review_date": "2008-12-20"
  }, 
  "v0ANF5-KxIWBtQQB0PfI4w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Enrique C.", 
    "review_text": "Martin makes a mean cocktail and he gives great recommendations on their delicious menu.  We tried the brisket and poached eggs and the breakfast burrito.  Both were hearty.  The brisket was tender and the au jus mixed nicely with the poached eggs.  The breakfast burrito had black beans and each bight was a perfect balance of huevo and tortilla.  We washed it all down with some Sweet Tea and a bloody mary.", 
    "review_date": "2013-03-01"
  }, 
  "OFNFtTc48LmXNk_NeZe9dw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amelia M.", 
    "review_text": "Lots of locals... when I have been it has been really cramped... but it is a good time to pass the time with friends... met some interesting people there too... I prefer locals hangouts and sometimes they aren't as easy to find in NB anymore... too many B&amp;T people coming over...  On a personal note... this place was the beginning to an end... It just shows how I don't hold grudges... I could have easily have given them 1 star for the bad memories.. but it is not their fault I had too many libations and the rest is history.. LOL", 
    "review_date": "2007-12-30"
  }, 
  "582iTyqKkoHeBFPMJuQEJw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris D.", 
    "review_text": "For all you Arizona State alumni that live in San Francisco The Boardroom offers up a really nice little bar for all the ASU football games.  Service: Excellent with one bartender and basic w/ another so that averages out to above average...like a B.    Booze: decent to shelf liquors at decent prices...small selection of drafts with nothing to write home about.  Grub: Don't know.  It's in North Beach which basically has about 14 restaurants per square foot (no exaggeration)...so I usually eat elsewhere.  However, I have witnessed their Tater Tots covered with melted cheese.  How can you fuck this up?  Therefore, the food must be about average if you feel like eating there and regretting later what you eat (read basically just like any average bar food).  Nuts and Bolts: They actually have really....really clean floors.  Recently, an earring may have been lost on the ground and our party searched the floor for it's whereabouts (to no avail) but I did remark to myself \"Wow, these floors are like...pristine...even for a non-bar they'd be impressive.\"  The bathroom is spacious and as clean as you can expect.  The bar area is large and there is an abundant amount of stools to accommodate most of the patrons.   Intangibles: This is an ASU bar.  On a Saturday you can find that 90% of the TVs are tuned into the ASU game or games that will effect ASU.  So c'mon down if you're an alum!  If not, c'mon on down anyway because it is a decent bar!  Well don't come if you're from University of Arizona...  ...well that may be moot since chances are if you're an alum from U of A you probably are delivering pizzas on any given night so you're probably busy.", 
    "review_date": "2009-10-20"
  }, 
  "re6fN6eb3NTL7hKK-5CYUQ": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Shirleyanne A.", 
    "review_text": "I was so glad my friend Kassidy suggested this spot for a group night out because trivia night was hella fun. The bar is kind of small but it had a friendly and cozy vibe. It looked cleaner than most of the bars in North Beach.  I liked how some of the trivia questions had accompanying images that showed up on the tv screen. With those type of questions, you foil the cheating bastards who try to look up answers on Google through their dumbphones (unless they got Google Goggles to work...).  Plus sometimes, when you're quite buzzed, you need a visual to comprehend what the hell they are asking.  I also like how they had beer specials.  Thanks to genetics, I inherited  from my dad a liver that enables me to guzzle a sh!t ton of alcohol. It gets quite expensive on my pocket and on my bf's pocket. Another plus?  They carry my favorite beer: Blue Moon!  I definitely want to go back and try their cardiac arrest inducing treats!", 
    "review_date": "2012-01-06"
  }, 
  "gisZy0HKXvX4YMspboRmZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben T.", 
    "review_text": "bacon wrapped tater tots. 6$ fernet and tecate special. i love fernet. i love tots. so far, a win in my book.  i happened to come on a tuesday, and they were having trivia night. place was exceedingly packed. get here at or around 730 if you want a seat.  i love tots. did i say that already?", 
    "review_date": "2011-09-14"
  }, 
  "63SQPROZ48xwGUb2LloFQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason R.", 
    "review_text": "I just got home from trivia at the Boardroom. Not the best trivia night I've ever been to, but the f-ing $2 tacos were incredible, and the cheap Olympias and Pabsts were not too shabby, neither.", 
    "review_date": "2008-11-12"
  }, 
  "U_I0xgmnp6b7Ce8iJRxLtQ": {
    "user_rating": 3.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Lauren B.", 
    "review_text": "The Boardroom serves as the commemorative site of the launch of my new signature drink. Mandarin Vodka (Grey Goose l'orange preferrably) and soda. So I went to the nerd braggade that is known as Trivia Night and drank so many of said new orangie cocktails that I actually loved the fish taco's. I'm told that it is just fish sticks cut up but ah well, they sure made my tummy happy, and my body just a tad bit more sober.   Minus one star for being an ugly dive bar. Another off because their trivia consisted of New York Times articles and whatever the hell is happening in China. If that is trivia then tell me the name of the place I have to go to to use my expert knowledge of anything that is aired on E! Bravo MTV and Vh1. No this isn't a rant, I liked the place and had tons o fun. Thanks Anna K.!", 
    "review_date": "2009-01-17"
  }, 
  "tULQIaP91_L1-MNZkqWnOw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana C.", 
    "review_text": "The Boardroom is an inviting, locals' hangout. Fun and friendly people on both sides of the bar, good beers and cocktails and well-priced, delicious food. A must-visit in North Beach!", 
    "review_date": "2008-04-02"
  }, 
  "_DNjOYnC3Jlk1JcMQHEOkA": {
    "user_rating": 5.0, 
    "user_location": "South Lake Tahoe, CA", 
    "user_name": "Mark B.", 
    "review_text": "Pretty simple.....great food, prices, vibe, bartender......and the only place to watch a 49er game!!!!! Home of the bacon wrapped tators :-)", 
    "review_date": "2013-02-03"
  }, 
  "UqOSpuFXffTisC1ahPbaWg": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Megan H.", 
    "review_text": "They definitely have bottomless mimosa's!  I didn't eat, but it looked like they had some breakfast burrtio's and such.  They also had brugers and tacos - so you will find something no matter what your tastes.  The mimosa's are $12 each - enjoy!", 
    "review_date": "2009-01-13"
  }, 
  "OQImub6evGiBTwpQmoVUjA": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Jess S.", 
    "review_text": "Tuesday is Two-Dollar Taco Trivia Tuesday (the most alliterative night in town, apparently).  I go for the tacos.  And the trivia.  Delish.  And smart.  A few tips: Trivia starts at 8:30ish, but all the seats are gone by 8.  They stop serving tacos early and they run out even earlier, so order a table full as soon as you get there.  DON'T heckle the trivia master - he makes up all his own trivia questions and does all the hard work so that you can sit there with your friends feeling smart (or dumb) so don't HASSLE him.", 
    "review_date": "2007-05-10"
  }, 
  "S-eb2s_2Ec_1rcmvec-H2A": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Alanna R.", 
    "review_text": "Cool bar, BUT there are a few douchey guys that  run rampant 'round this place. I guess that could be just about any bar in SF, so I'm not hating, just saying.. I will definitely be back but I will bring friends and ignore all weirdos lol", 
    "review_date": "2014-11-17"
  }, 
  "XPoZMOe_37r4Dl4YH274rg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Double D.", 
    "review_text": "Looking for an upscale sports bar in North Beach that the girlfriends will like just as much as the guys?  This is it.  I was in there again last night and it was packed - with just as many women as guys.  I think this place actually 'has it all.'\n  The owners gutted the old nasty Shannon's sports bar &amp; completely remodeled it as a chic sports bar - it's definitely on my favorites list now - especially since my drink is waiting on me by the time I get to the end of the bar!  Got cool owners, a sweet bar and good beer on tap.  There are 4 monster flat screens around the place to provide your sports fix.  The menu isn't exactly expansive, but everything on it is tasty!\n  And thank god there's finally something hanging on the walls.  I don't have an extra $14K laying around for the one painting I want so I'm actually contemplating becoming an art thief...", 
    "review_date": "2006-09-03"
  }, 
  "V47RQMHsdnJpCeIR0eBW1g": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "kainoa r.", 
    "review_text": "I'm going to go ahead and call/spell it Con. A pronoun. A gentleman's name. As used in the common phrase \"Con is the best bartender I know in North Beach,\" and \"I look forward to many nights at the bar being served by Con.\"  I never knew the previous incarnation of this bar but I don't care. On my FIRST visit, I was treated like and old friend or (beloved) family member. I am not sure I have ever had such a good time, my FIRST time... at a bar. I don't make it to North Beach as often as I wish, but next time? I'll be there. Look for me. I'll buy you a shot.", 
    "review_date": "2008-08-28"
  }, 
  "fSvOdnryI9FPJ2ylcsE2ig": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "Good music and pretty good vibe. They have lots of alcohol and can even make a french martini!", 
    "review_date": "2008-12-10"
  }, 
  "WnzRueYdRWNSbkXB0_0i4Q": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chuck N.", 
    "review_text": "A true North Beach gem. A must goto bar / food spot.  Service = excellent. The bartender I've seen twice, forgot his name (has a beard) is awesome. Big fan.  Drinks = $5 for Jameson and Ginger Ale. Cheapish shot and beer specials. Beers on tap are great (love the various IPA's).  Food = The world's best (as claimed) bacon wrapped tater tots. Pretty good. Not the thickest cut of quality bacon, but wrapped in tots with a nice mayo/ketchup mix sauce is great.! ~$9 for a small plate, bit pricey but tasty.  The burgers are big and tasty, friends shared.  I got a taco salad for $9 in a cool pho bowl and the salad and beef (you can get chicken too) were great. The taco wrap on the outside was obviously from a wrapper, but hey, can't expect a bar to fry it like a Mexican restaurant.  Big fan. I'll be back for food and drink.", 
    "review_date": "2014-07-22"
  }, 
  "Xq7KR3Rbzz35bs01BGKj9w": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Justin M.", 
    "review_text": "Cool bar, not exactly a dive but not too trendy either. Decent selection of beer and a pretty good vibe. Came here on a Saturday night and it wasn't too crowded, plenty of stool space. If you're doing a North Beach crawl, well worthy of a stopping point.", 
    "review_date": "2012-11-20"
  }, 
  "rX9yVuBgqDF-j8nxWIzonQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curtis L.", 
    "review_text": "This is one of the best bars in SF for good, blue collar, eating and drinking. The bartender (Dom I think?) is a great dude and pours you a beer quickly. They have several TVs and they even put on the Sacramento Kings for me (which no one else cared about). If you haven't been, swing by on a Monday for 50 cent wings. They have about 20 flavors and the guy cooking them takes real pride in his wings. Bars like this are becoming rare in SF so support them when you can.", 
    "review_date": "2014-12-04"
  }, 
  "Zn8tgekH0oCfyk4SUtygoA": {
    "user_rating": 4.0, 
    "user_location": "Safety Harbor, FL", 
    "user_name": "Dave W.", 
    "review_text": "Every place I visit frequently, I need to find \"the spot\" where I can be the not-so-regular, regular. This is my place, starting back when it was Woody Zips.  The food is always tasty although the menu has changed a bit over the years. The bar tenders really do a great job catering to both the true regulars, the not-so-regular regulars.    Enjoy, catch a game, and \"Be yourself; everyone else is already taken.\" (Oscar Wilde)", 
    "review_date": "2011-12-18"
  }, 
  "wkklbFK50TTkd1GJXXAntA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "C L.", 
    "review_text": "Meh chicken wings, meh bacon wrapped tator tots.  Food was average.", 
    "review_date": "2013-06-10"
  }, 
  "wYv2sUTQ1KTA07qBe7HpUA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin H.", 
    "review_text": "I am revising this poor review (1) to a (3) reflecting management care and reaching out to me to correct the problem. I would've given a (4) if it weren't for an employee's extreme rudeness at the location. White male with long blond hair and tattoos. He was very disrespectful to our group the first time we ever went. After discussing with other employees this seems to be a common occurrence for this dude.", 
    "review_date": "2013-12-14"
  }, 
  "k8BqTw1CV7W7iamfKjCLww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MacKenzie P.", 
    "review_text": "Kickass! Martin (the bartender) remembered my boyfriend and after we hadn't been there since basketball season. He even remembered that we had just started dating then. Impressive!", 
    "review_date": "2011-02-09"
  }, 
  "dTdltcr2EC5oMZ1rs795PA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason J.", 
    "review_text": "The fried food is pretty damn good.  as in the tots are really good.  The BLTA is also really good.  the dip is decent.  The sweet potato fries are pretty good too.  good spot to check out for lunch during non-sports hours, since nobody is really there.  The beer and drinks are standard here.  if you're not going for a meal, check out the bacon wrapped tater tots, also worth checking out - though every time i've had them, i was drunk.", 
    "review_date": "2013-01-10"
  }, 
  "iBetxak4rYFEY9VW26pQsQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah H.", 
    "review_text": "So I normally do not hang out in North Beach--too close in proximity to the Marina.  But it's playoff season and my roommate's dad is in town from NY and we all wanted to go watch the games somewhere.  Last weekend my roommate and I went to Mad Dog and that didn't work out so well--too many soccer fans.  Like any Yelper, I searched for a good, mellow sports bar to get a burger.  Woody Zips showed up and I thought I'd give it a try.  It was great.  The staff is beyond friendly and in a very genuine way.  The TV quality and placement is key and the food is basic and good.  The burger was particularly spicy, but good spicy.  And, like my roommate's dad said, \"The fries got just the right amount of too much salt.\"  I had a good time, just wish the game had turned out differently.", 
    "review_date": "2007-01-14"
  }, 
  "JZwZxnYdCxb8Z-DWT6H3dA": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "daniel w.", 
    "review_text": "This place is awesome!  Salvador was the bartender and he was incredibly friendly the food is delicious.   Take my advice,  ask the cook to \"get crazy\" with their Boardroom burger.   You won't be sorry.   Also,  have to heard of bacon wrapped tater tots? Because you should have.", 
    "review_date": "2014-05-02"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "I have fond memories of the Boardroom. It was where I had my last round of drinks pre-sobriety (darn you medicine!). It was one of many places I went post-sobriety. It was where I was thoroughly entertained by witnessing a cute (girl) bartender hitting on my cute (male) colleague...while my other colleague and I pointed out all her moves. In another language, of course. We have some decency...well, not really. Bartender probably knew...but colleague didn't until we pointed it out!  Found myself stumbling back here the other day...and they have bacon-wrapped tater tots. That's right. Bacon makes everything better, and they have made the tater tot into something amazing. AMAZING. We were also tempted by the hot wings...which had the scent, but didn't taste as good as we'd like. It has a good crisp and flavor, but...it was JUST this side of dry. Boo.  Current bartenders here are very friendly and attentive. Is a very comfortable place to hang out!", 
    "review_date": "2013-11-15"
  }, 
  "XnbGrJNw0wglmqXekW138Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn B.", 
    "review_text": "my friend had a guest-bartending event at the boardroom last week - i thought it was a pretty cool bar that i would go to otherwise.  definitely one star for keith, the owner, who let us have the event there and trained us on how to bartend (a skill that did NOT come easily to me whatsoever and will not develop into a new career...).  apparently they have guest-bartending on thursdays pretty often.   they also serve food there - standard bar food, the mozzarella sticks and tater-tots were good though!  the boardroom definitely has a cool atmosphere, nothing special, just a fun local bar vibe.  if you are a sports fan, they have a bunch of tv's to watch sporting events too.", 
    "review_date": "2008-08-24"
  }, 
  "zpmViTr7g_1Ig8jPO0VNSQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynsey C.", 
    "review_text": "Had to update with an extra star for chill ambiance, Sunday late night happy hour and delicious sweet potato fries.  Is that better Keith? Where's the hot tub??????", 
    "review_date": "2009-01-05"
  }, 
  "ZtfYa68Qbr4rkhNMsmYhqw": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Lee N.", 
    "review_text": "Great North Beach neighborhood bar, with a surprising variety of good food, friendly bartenders, and a good selection of well made drinks.", 
    "review_date": "2012-05-17"
  }, 
  "l0PYkotRgNgz4ZqAjGFzPg": {
    "user_rating": 3.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Rachelle T.", 
    "review_text": "Compared to some of the other bars on that side of Columbus, The Boardroom isn't that bad. It's clean, has a couple of TVs, and decently priced drinks. The bathroom isn't the size of a closet, but the bar itself isn't that big. It seems to cater to the locals, where everyone knew each other but us.   No comment on the food, since I try hard to stay away from food served at a typical bar where the kitchen seems to be invisible.", 
    "review_date": "2012-04-12"
  }, 
  "ZnoRV0CJYbKqHlWWm_6MIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine O.", 
    "review_text": "Boardroom, I think I have a crush on you. Below is a list of reasons why:  1. This cozy local bar is conveniently down the street from my apartment. 2. Tuesday Trivia night!     -Oh yeah teams, it's on!  3. Bingo Wednesdays?!  4. Taco Tuesdays     -$2 tacos. The fish tacos rule! 5. 1 shot of Jager &amp; an Olympia=$6.     -Right on specials!  6. Drinks &amp; a handful of eats (served until 10-11ish)! 7. Friendly staff 8. Small, clean, and not too loud 9. TV 10. Cash &amp; Credit  (with $20 minimum)  Ooooh dear Boardroom, I will definitely never get \"board\" of you! ;)", 
    "review_date": "2008-10-09"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "Bacon. Wrapped. Tots.   It looks like a total hole from the outside, but when you walk in, it's the exact opposite. Clean, sorta dive-y, snacks, beers, tv...I'm into it. Bacotots were a lot spendier than I thought they'd be. For a dollar more than the boat of regular tots, you got like 9 bacon wrapped tots. Don't get me wrong, those bacotots were perfectly crisp and tasty, but I'm still trying to grasp why there's such a difference in quantity. Labor intensive? Meh.", 
    "review_date": "2012-04-08"
  }, 
  "dgm6oxrldL81fJ0jlMJ3Qg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex S.", 
    "review_text": "Was having a pretty good time here with a group of friends until I was getting ready to leave. I was waiting on my boyfriend when suddenly I felt something hit my chest. The bartender had thrown a plastic cup at me from behind the bar. When I asked him why, he stated \"You looked like you weren't having fun.\" Yes, because hitting me with a projectile object is going to help me have an awesome time. Screw you. Who behaves like that and works in customer service?", 
    "review_date": "2014-03-16"
  }, 
  "98kge3NovzBHx61kPyIMSg": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Mar A.", 
    "review_text": "Happened to stumble upon the Boardroom one day while we were scouting drink specials in North Beach before a friend's band played at Grant &amp; Green.   BEST. STUMBLE. EVER.  Walked in enticed by the tecate + jagermeister special. You can't go wrong with that combo for $6. It was a pretty quiet night, so we chatted up the bartender about the confusion of which football team the bar roots for, and their beers on tap. I must have looked hungry because the next thing I know, he plops a menu down right in front of me.   Perused it a bit, hoping for something small to tide us over before dinner time. And saw the most enticing words I have ever seen on a bar menu \"Bacon wrapped tots.\" Bacon wrapped tots?!?!?! I was intrigued. So we ordered them up assuming the worst, but hoping for something at least worth digesting.  A few minutes later, we were presented with a plate filled with tiny brown treasures that smelled like an angel's fart (kinda salty and fills the room.... but in a good way). The bartender knew we were about to lose our bacon-wrapped-tot-virginity, so he gave us the run down. The ranch is infused with bacon au jus (!!!!!) and mixed with a bit of the house hot sauce is the perfect little bite.   Oh dear God. My mouth was dancing. That bite was euphoric. The tot was perfectly cooked- tender and fluffy in the center with a nice tot-ty texture. The bacon, which I completely expected to be a chewy mess that would destroy the tot, was quite the opposite. The bacon was crispy and light and perfectly salty without being toooo salty. The ranch complemented the tot so beautifully as if they were created only to accompany each other in life. And the house hot sauce..... just enough heat to wake up your tastebuds so that they can experience this tot magic exactly as the heavens imagined.   Aside from this experience, everything else about this place is fantastic. The locals are really friendly and the bartenders are freakin hysterical. There are always sports on the two TVs and the rest of the food is pretty good too. They have a great brunch menu, if you're into that kind of thing too. I hear the bloody mary is yummy.  Thanks Boardroom, for ruining tots everywhere else.", 
    "review_date": "2012-06-12"
  }, 
  "4eGaEAnGqrxO-lmRFgtU3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie F.", 
    "review_text": "Fun, fun, fun.  The folks at Woody Zips are super-cool and so are the patrons.  The guys are laid back and allow people to \"guest bartend\" on Wednesdays.  I did it along with a friend to raise money for a charity -- it was a huge success financially (can't say as much for my friend's livers).  This is a great place to go, especially if Northstar gets too dirty or crowded, just crawl across the intersection and belly up to the bar.  Also major bonus points for their bathroom: the bathroom is cleaner and infinitely roomier than many of the bathrooms in North Beach.  They also have tons of beers on draft and good drink specials.  Oh, almost forgot, they also have a kitchen, so they can fill your belly with good grub too.", 
    "review_date": "2007-09-06"
  }, 
  "Tf9rV21VCEikyjB14qM5VA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johanna W.", 
    "review_text": "Really nice and helpful bartender. Menu looks good. I like this place.", 
    "review_date": "2011-03-21"
  }, 
  "iwRBlpUvLYTrAG-a2v5iTg": {
    "user_rating": 1.0, 
    "user_location": "Woodland Hills, CA", 
    "user_name": "steve b.", 
    "review_text": "The bartender here begs for tips when you order drinks.  Pathetic service. Patrons throwing up outside on the front steps, poor service.  Sad excuse for a bar.   Steer clear of this place.", 
    "review_date": "2011-10-09"
  }
}