{
  "RZI7PQBIKitf_NCrDvQcAw": {
    "user_rating": 1.0, 
    "user_location": "Hercules, CA", 
    "user_name": "Christina W.", 
    "review_text": "I recently purchased tickets to see Chrisette Michele at this venue. The show was scheduled for this past Sunday and Friday morning I received an email saying it had been canceled and that I could either receive refund or I could go to a show that night or the following day. Totally last minute!! Given that these tickets were a Christmas gift that I purchased for a friend I chose to go to the 8:00 show on Saturday. Not only did the box office not open until 2:00pm when I called Lisa ( the customer service rep) did not apologize or offer any explanation but replaced my tickets.   The next day I arrived to the venue 10 minutes before the show started only to be standing in line while the person at the desk socialized with someone else who probably should have been working also. This woman explained to me that Lisa made a mistake and comped my tickets and I needed to pay again because the money had been refunded to my account. I asked her when the refund was issued and she told me \" I don't no I'm not a banker\" So I stood to the side to check my account and of course nothing had been refunded nor did I have any record of this transaction. So she went from asking me to play for both tickets to saying well can you pay for one ticket... then she \" said you don't even have $30  She then blamed it on \" TicketFly\" for issuing a refund with out talking to them first and told me that she was not going to argue with me. So I took the tickets only to be sitting in horrible seats.   I did not appreciate the lack of good customer service. Furthermore had the environment been different I would have had some choice words to share with her. I've been to several events at the former Yoshi's and had a great time however it is not likely that I will return to The Addition. I will be filing a formal complaint.", 
    "review_date": "2015-01-12"
  }, 
  "nF-UM092NAxzdGqERXGZLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T.J. H.", 
    "review_text": "We came and saw the Christian McBride Trio the other night. The music was fantastic, the venue is great, and the staff was very nice and accommodating, but I'm being a little generous with 4 stars because they just changed owners and I want to support them. We had a couple major complaints that will hopefully be addressed:  - They water down the beer!! We got a couple anchor steams, which I've had hundreds of in my life, and it's never tasted so watery. I thought maybe it was just the keg, so I ordered a Guinness - same problem. If this isn't fixed, I'll just refuse to order to drinks here in the future, and they'll be missing out on additional revenue.  - The set was really short. It was supposed to start at 8, but didn't start until 8:30, but then they ended promptly at 9:30 because they had a 10 o'clock set.", 
    "review_date": "2014-12-30"
  }, 
  "XZfZaA7EVCWt01rP8S7HRw": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Scott N.", 
    "review_text": "This is a fantastic, small venue for music! It didn't hurt that our table was butted up against the stage!  I won't go into who we saw... okay, yes I will. We were lucky enough to see Jane Siberry's Holiday Hoes &amp; Hosers show. I guess I have to give The Addition props for booking her. The show was phenomenal.  Service was great. I love being able to order food and drinks and actually have someone bring them to me instead of standing in line at a bar. The staff was very attentive and helped us take care of the bill very discreetly during the show.  Parking in the lot across the street is extremely convenient.   Before the show I had a cup of lobster bisque. It was tiny, but very good.   I keep watching the list of upcoming shows. I haven't seen anyone else that would entice us to drive into the city, but I'll keep looking and we will definitely come back for the right artists.", 
    "review_date": "2014-12-24"
  }, 
  "RqEfoAIRmg_l7B7Fnnmucw": {
    "user_rating": 2.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Darcy B.", 
    "review_text": "I went to see Eric Benet for New Years Eve not a good experience. We did not get our Champagne to toast for the New Year absolutely nothing to toast with. The menu sucks big time. Will be heading to Nations afterwards. Oh yea Erica Benet was good.", 
    "review_date": "2015-01-01"
  }, 
  "Mlx7ZLwbhzjU7RmRVs4ngg": {
    "user_rating": 4.0, 
    "user_location": "Pinole, CA", 
    "user_name": "Sean H.", 
    "review_text": "Okay, so Yoshi's SF is gone. Replaced by The Addition. No real changes to the venue itself, other than the nice and new \"The Addition\" sign adorning the outside of the venue.   Gone is the Japanese food, which is kinda a bummer but they still have got some pretty decent eats here. Our table shared a bunch of fries, and my friends got a salad and a burger. I kinda felt the Japanese food at Yoshi's made it more unique, and also was a nice little shout out to the nearby Japantown, but oh wells, Yoshi's no more.  The venue itself is still totally the same. It's small enough so that you've got yourself a great view of the performance from wherever you sit. The servers come by often enough without being a bother to your music enjoying experience.   In all I had a pretty good time here at The Addition. I realize that the re-branding might strike the wrong chord with some people, but hey it's still great music in an intimate venue. Not much can beat that.", 
    "review_date": "2014-11-08"
  }, 
  "q04IZPSQfQI4yWugA7Xabw": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Ariana M.", 
    "review_text": "I'm not basing this on food as I didn't order from the menu, but I was not impressed with the new style. Yoshis was perfect from the vibe to the menu selections and it was great to go between Oakland and SF so you could mix it up a bit. The lounge/restaurant area just seemed so desolate, definitely not what I remember from before. The menu just seemed basic, nothing to jump up and down about. Hopefully they can get it together soon....", 
    "review_date": "2015-01-10"
  }, 
  "yJWnLM4wBAZ50sOFPbbl6A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lynn C.", 
    "review_text": "From what I am reading, its no surprise that this place is now shut down.  Other than the initial announcement that the place was out of business and all future shows were cancelled,  there has been no information offered in regards to refunds.  I have emailed twice and no one has replied.  They should have left it as Yoshis. smh!!", 
    "review_date": "2015-01-28"
  }, 
  "MWmYsDdRyDLLqpKcprw6cQ": {
    "user_rating": 1.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "John C.", 
    "review_text": "According to an article posted on the KQED website, The Addition closed for business on Jan.14, 2015. All shows have been cancelled. Here is the website link to the story: <a href=\"/redir?url=http%3A%2F%2Fww2.kqed.org%2Farts%2F2015%2F01%2F12%2Fthe-addition-formerly-yoshis-in-san-francisco-to-abruptly-close%2F&amp;s=00eda79d979d0072553da15a1c7b13432de47b91674a0ed15c799387dda4c3c8\" rel=\"nofollow\" target=\"_blank\">ww2.kqed.org/arts/2015/0…</a>", 
    "review_date": "2015-01-23"
  }, 
  "GFUA6QtkOAleazw0TBoGUw": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle R.", 
    "review_text": "Had a girlfriend's night out for a friend's birthday. Came to see Chrisette Michele in concert. Got there an hour early to dine in the lounge. Big mistake. This place is nothing like the old Yoshi's. No atmosphere, no decor, and the menu was limited. The wait staff was very pushy about closing our tab as we were having a good time. The b'day girl almost cussed the waiter out about his pushy attempt to get the bill paid as we were eating and toasting. I see why they closed down this week...hopefully the next venue will raise the bar!", 
    "review_date": "2015-01-16"
  }, 
  "5pSH6M5rLgpwSAqR1ShtHA": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Lucky T.", 
    "review_text": "Went to the Eric Bennet Concert Dec. 30th, Sound System was terrible. Eric Bennet was great but the sound kept oscillating in and out. It was uncomfortable and difficult to enjoy the show. I hope they get it together.", 
    "review_date": "2015-01-07"
  }, 
  "GV_LpFADaYO3RPOe561H7A": {
    "user_rating": 3.0, 
    "user_location": "Union City, CA", 
    "user_name": "C.C. S.", 
    "review_text": "Came here tonight to see Chrisette Michele. Oooh so awesome show. Youtube her yall. Ok... The place is the old yoshis. It is beautiful inside. The sound system is amazing. Take note oakland. Customer service meh - what about a smile from your server? Not here. Not tonight anyway. Drinks meh tasted watery.  Too many mix ups with the check and not just mine. Many customers. I would come back for a show but eat and drink elsewhere before i come in.", 
    "review_date": "2015-01-10"
  }, 
  "vB8aE9jGnZr9QT2teQXM6Q": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Tika L.", 
    "review_text": "The menu is disappointing. Our food was cold. The seats are too close together. You're practically sitting in strangers laps. I HATE being forced to share tables with other people. If my date &amp; I wanted to double date we would've invited friends. Not a fan of this venue at all.", 
    "review_date": "2015-01-15"
  }, 
  "HKY3CDVL8GzYC4xP7Ft81w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fran C.", 
    "review_text": "Please help!  I tried to buy tickets at 50% off for their Black Friday Sale. ( Dan Hicks )  I used the promo code thru Ticketfly and it never gave me the discount. I tried to call the box office all afternoon, impossible to talk to a real person and I left several messages. We then tried to go to the box office and the whole place was closed.   A sign in the lobby said the box office was open 2-8pm during the holidays,  Message machine said the box office opens at noon and didn't mention the cancelled show.  I loved Yoshi's- best venue in town. I would love to give the Addition  a great review but we are off to a bad start.  Ticketfly didn't fly.", 
    "review_date": "2014-11-29"
  }, 
  "BENBj_EQBQImwoZst7HdqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Josh L.", 
    "review_text": "Yoshi's San Francisco has been replaced by \"The Addition.\" The layout and ambiance of the venue has not changed, but new signage and logos are up. Staff seems to be the same.  I came this weekend to watch Poncho Sanchez and his Latin Jazz Band... 5 stars!  Minus stars: - Wished the performance was longer. - Wished there was an opportunity to meet Poncho or at least buy some of his CDs. - Waitress could have done a better job checking in on our table. - Staff needs to do a better job regulating/removing patrons who use flash photography. During the show, a lady in the front was taking selfies and multiple pictures on her phone with a blinding LED which was very disrespectful to the performers and to the rest of the patrons trying to enjoy the show. I didn't see anyone reprimand her - I would have kicked her out the second time she did it.", 
    "review_date": "2014-11-03"
  }, 
  "3A5QWLG-W34Pa72m3tew7Q": {
    "user_rating": 1.0, 
    "user_location": "Dublin, CA", 
    "user_name": "Susie B.", 
    "review_text": "What in the heck happen to the Yoshi's restaurant. The menu sucks, the service is awful and the place is empty !!! Did someone have a funeral here and I missed it !!! Atmosphere is not the same : (", 
    "review_date": "2014-12-05"
  }, 
  "k17zEBR3Hcn2js91Boo2ZA": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jessine S.", 
    "review_text": "What has happened here?!?  The staff, management and menu,smh.  Firstly, there are tiny tables in the lounge area- how about offering food appropriate for a lounge?  Like bite sized food?  There are no longer decent appetizer options on the menu.  I don't want to pay $5 for a bowl of dang olives!  Secondly, during the show, while the performer was onstage, I was subjected to an argument between management and dissatisfied customers who didn't like their table.  It was the managers who were yelling- simply ghetto... Lastly, if you can't get around to getting checks on the table and collected before the performance is over, then don't make announcements telling people to clear out!!  I hope that many people walked out without paying because your disorganization caused it!  One more thing, hire waitresses that can carry a tray of drinks without dumping these on patrons backs!  Ok-last thing- the online ticketing system probably affects your ticket sales.  It has a lot of glitches and limitations that are annoying.  Thank you for allowing me to vent about my ruined evening; Chrisette Michelle was awesome though!", 
    "review_date": "2015-01-11"
  }, 
  "1qcq_VTO9fYIslCUwudlOA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz D.", 
    "review_text": "Great venue. I sat at the bar before a show began.  It was intimate and had a lounge feel.  I had the winter cosmopolitan, very was tasty I ordered a second one. :) I had the \"homemade\" BBQ chips; delish. So good.", 
    "review_date": "2014-11-26"
  }, 
  "WCMGtqUA5IMCg-BgYSFSMA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "k.d. w.", 
    "review_text": "Pre-Experience Rating:  I purchased my tickets, picking the first row. Today I received an email that the show was cancelled and gave us an option for a refund or attend another show(same artist/different day). I reply to the email stating how inconvenient because I had great seats and my schedule didn't really allow adjustments.  I called in to select my seats for tonight's show at 10pm... to be seated 6 rows back. I would have rather they reorganize by when you purchased your tickets or offer some type of incentive regardless of the flop you may have.  The customers that are calling in will not be happy, although she helped me by securing my seats, she didn't apologize for the inconvenience, and she forgot my name and when I told her again, she said oh yeah. Maybe go through a customer service class and practice empathy.  I expect some type of incentive for the inconvenience...but I'm sure this business is more focus on filling the seats for this weekends show. They are money focused, not client (customer service) focused...but in order to fill seats you have to keep your customers happy. After tonight's show I will not return to this venue, I refuse to invest in a business who does not care about their customers.  Post Experience:  Service: Wasn't great Initially until we tracked someone down to serve us. I assumed the  person who was waiting the couple at our table would serve us as well, she didn't even look at us even on our attempt to flag her down.   Show: Was Amazing &amp; Free, I was given a refund.  Overall: Satisfied!!!", 
    "review_date": "2015-01-09"
  }, 
  "G96eAh4n0ksknavhExYr6A": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Liz G.", 
    "review_text": "This is not my first time at this location but it was formally know as Yoshi 's San Francisco .  The Addition is cool I love that we can be seated right away the show was great. Food was ok I loved Yoshi's Sushi .  The only reason I can't give them five stars is because are waiter never came to pick up are check and they where rushing to clean to get the next show ready at 10 and I had to give my bill to another waiter. I will return to see someone else.", 
    "review_date": "2014-12-27"
  }, 
  "sGVLUAnJ1MX7naWPDJs6wQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Terry M.", 
    "review_text": "I went to see the Christian McBride trio tonight.  They were an incredibly skilled band.  The sound system was just right here at the Addition.  It was perfect when they played quietly and not too loud when they got loud.    The seating allows for a lot of room and comfort.  Every seat is good.  You can hear and see well from anywhere.    The food was surprisingly good.  The gumbo was delicious as were the homemade BBQ chips.  A lot of venues like this tend to be way overpriced.  Here it is what you would expect at a normal bar or restaurant.    The staff was nice.  The atmosphere in the restaurant area is beautiful, contemporary and Japanese.  The inside of the music performance area is sparse, clean and simple.", 
    "review_date": "2014-12-27"
  }
}