{
  "6v9j21ZvUBXI4RQckz-amQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luco M.", 
    "review_text": "The right to do something does not mean that doing it is right.  ~William Safire  It is the same owner of s.n.o.b.(bad name for a wine bar He change to the pour house (very bad name for a beer and wine bar). Wine 3/5 beer 1/5 server 2/5 ambiance 1/5 ownership", 
    "review_date": "2010-08-13"
  }, 
  "9OyPEDQ0N6i0rWv9S-XjgQ": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Talia G.", 
    "review_text": "When you're in a chill mood and Polk Street is packed and overrun with preppy guys and sluttastic girls, come to The Pour House. It's a cute, intimate, wine-and-beer-only place with super nice bartenders. My only complaint - it closes at midnight, so if you want to keep the night going you're forced back out into the madness.", 
    "review_date": "2012-04-24"
  }, 
  "g1UZ0XzJbnu5DT_rcWwCpQ": {
    "user_rating": 3.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Alana S.", 
    "review_text": "Wine good. Service not so much. The guy did not seem to know much about the wines on his menu. My friend asked if a Sauvignon Blanc was sweet or dry and he seemed confused as to what that meant. He barely checked on our party even though there was no one else in the place. He was more concerned with his online shopping he was doing on his computer than with his customers. Hopefully he bought the necklace he was searching for so that some good came of the day.   On the other hand, the wine was great, I had the custom flight and really enjoyed it and the ambience was nice. Service really makes a difference though, a lot of places have great wine.", 
    "review_date": "2014-05-25"
  }, 
  "BhPLoRa8os4p7YCEwh6OKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Social B.", 
    "review_text": "Shortly after writing my review I was contacted by the management of The Pour House.    They informed me that the employee I encountered had been \"relieved\" of her duties.  Certainly it wasn't due to my experience alone.  Their prompt response and follow-through says to me this is an establishment that cares about its customers and their customer experience.   That is very impressive to me in any organization.  I'm going back to the Pour House!", 
    "review_date": "2011-03-19"
  }, 
  "mRGUNobUQ9wqrant0X1aTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hil W.", 
    "review_text": "The Pour House is a Polk Street gem. This place has combined a pretty darn good wine menu with a good beer selection mixed with a cool ambiance. I was there this weekend with a large group of people in the back of the bar. Everyone really enjoyed themselves, and remarked on how chill and economical this place was. What a good find!  Would have given the Pour House 5 stars had it not been playing loud club music. This is decidedly NOT a club, but a totally enjoyable wine and beer bar.  Pour House: Own it!  Don't play club or trance music hoping a spontaneous dance party will erupt! (Maybe one will, but I've never seen it!).", 
    "review_date": "2012-07-22"
  }, 
  "qEXd-DK4cOCpDhhDEIRZOg": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Angel F.", 
    "review_text": "I am taking the time to write this review only because there is nothing more horrible to me then people who are rude for no reason!  Last night my friend and I went out to Powell street for the first time. Unaware of how crowed the bars would be I grabbed a slice of pizza to go and we made our way in search for a less crowded bar.    We walked into The pour house at about 5 til midnight, found a spot at the bar and started to settle in. The bar tender explained we just missed their last call and they were closing in 5 mins.   We started putting out jackets back on and I whipped out my slice of pizza to steal a couple bites before we carried on with our journey. The bar tender comes up to me again and asks if we had already been drinkin there, I told him no. Then he said \"well can't you see this is not a restaurant, you cant eat your food here.\" I said \"not a problem we are on out way out the door anyway.\" Then with a cynical tone he gestured toward the down and \"well then goodbye\". I was shocked, I said to him \" there is no reason to be rude about it.\" He replied \" I'm trying not to be, now leave.\"  There is just simply no reason to be rude to someone who has in no way wronged you. I was disappointed, bartender.", 
    "review_date": "2013-11-10"
  }, 
  "kRW6GXDxkjoGTR3XvropeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keeks K.", 
    "review_text": "To this day, I still remember Pour House describes on the bottom of their beer list: \"PBR: light bodied and refreshing!\"    Love that.  Thanks for not being pretentious.  (Even if you do charge too much for aforementioned beer.)", 
    "review_date": "2012-12-02"
  }, 
  "vW9hNnkaJSl1ZPIMQyxAgQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacquie S.", 
    "review_text": "This USED to be one of my favorite wine bars on Polk street and I have to say the service was not up to par last time I visited. I came here with some girlfriends on a Sunday night and our server was not very attentive.   The bar was not overly crowded and he seemed more concerned with inventory than serving his patrons. We had to ask for our hummus plate 3 times after our first order and we were literally clapping and hollering to try to get his attention. He also gave us his unsolicited advice/ words of wisdom on relationships as we were consoling a friend who is going through a breakup. It was weird and rude since he never participated in our conversation to begin with.  The $13 flights have kept me coming back but I will consider another venue before I return.", 
    "review_date": "2012-02-13"
  }, 
  "hFYZv8vIVBmFmleanwwYCQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raul G.", 
    "review_text": "One of the worst places in SF if you are looking to go to a place where you will fall to sleep while getting an awful service, please go to Pour House.", 
    "review_date": "2011-10-07"
  }, 
  "wSaQ3TM0bSwod0LfRTNsHg": {
    "user_rating": 1.0, 
    "user_location": "Oxnard, CA", 
    "user_name": "Mondi L.", 
    "review_text": "Worst bartender ever for nye. I heard it was her first day, but she kept serving the same guy for half an hour and ignored the rest of the bar. Do not recommend this place for a fun day, only on a slow day.", 
    "review_date": "2014-01-01"
  }, 
  "3TV-6JzSuGds2GYjAQvVtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B T.", 
    "review_text": "Bartenders are nice &amp; attentive. They serve u water first - very classy move! And dogfish head/90 min on tap! More wine than beer but good hangout place for both!", 
    "review_date": "2011-04-26"
  }, 
  "1l5cBji3QzORQKHbWbI5UA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Valerie K.", 
    "review_text": "The BEST wine bar ever! Calm, great atmosphere. Great wines starting at just $6: glass. And the best olives in the universe for $1!!! Love this place! Everyone - come check it out!!!:)))", 
    "review_date": "2015-01-31"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "The Pour House is such a cozy and unassuming neighborhood watering hole. I've passed it many times without really looking in but I'm glad I finally stopped by for happy hour.   Firstly, they have LaChouffe! Oh I've missed the golden sweet aroma from this Belgian dwarf. It was so awesome to taste it again and so few places in the city stock it. Needless to say, The Pour House has an amazing beer selection and we had quite a few other rare brews here.   Service is really friendly although the bartender can get a little swamped when it's crowded. Still he was really appreciative for our business and I can't wait to be back. The Pour House is totally on my list for happy hour in the neighborhood.", 
    "review_date": "2011-10-17"
  }, 
  "MnNQ83wUXbQ92RoudkQKBQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cameron G.", 
    "review_text": "This place has something for everyone. Maybe a little too much. Cowboys meet disco meets club meets sophistication meets the daily news. I left feeling so confused about what the place was about, and quite disappointed with the wine selection! Both of my glasses were \"meh\", and the guys next to me said the same. It didn't help that when it came time to pay, it took 15 min of trying to flag down our bartender (even though there were only 6 people in the place at the time), and me finally getting up to get his attention. I prefer the Press Club or the Hidden Vine. But if your feet can't carry you too far away from this place, I recommend Amelie.  I hate giving poor reviews :-( Hopefully I'll be able to update this review in the future.", 
    "review_date": "2012-07-31"
  }, 
  "IsQlqITX8FyIym836as2-A": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "Why I am in love with this place: anywhere from low-level to high-level wine which is perfect for penny pinchers looking to have a good time and enjoy wine and/or beer, great ambiance, and friendly staff.  My girlfriend and I love to go here to share a bottle of wine and just sit and talk. The music is great which just adds to the enjoyment of the bar and the location is in walking distance of pizza (which goes great with a night of wine), late night Thai (probably the best thing in the world), and even donuts if you are feeling frisky.   Each time I have been here, counting three times now, the staff has been very friendly and approachable. They are very willing to talk about their favorite wines/beers and never give the impression of wanting to rush patrons to cycle new people in.  GREAT place to just hang out and enjoy some good company.", 
    "review_date": "2011-04-19"
  }, 
  "7XvUlAuIRF9IhWAvlr5U7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rocco B.", 
    "review_text": "They have Dogfish head 90 minute IPA on tap here.  And they don't screw around either--a lot of places where I've seen the 90 min give you a crappy 10oz pour for six bucks.  Here you get the whole pint.  I thought the ambiance red interior was nice, but my girlfriend wasn't buying it.  They serve food from the Thai restaurant next door if your hungry.  Oh did I mention they have Dogfish head 90 minute IPA on tap here?", 
    "review_date": "2012-04-08"
  }, 
  "m-5xKFMINLJ5Zqu3eDx8nQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy H.", 
    "review_text": "Love this place! Such a hidden gem and very no-frills. It's got a nice intimate feel to it - very cozy and wine bar esque... and enough space to have a gathering of friends, but also enough room to wander. We had great service consistently through the evening from Ryan (too bad he only works Tuesdays!) and he tailored suggestions to our specific needs. As a wine enthusiast, I am very particular about regions, and varietals, and he was spot on. Also, the wine flights are very affordable and the pours were substantial! And the cheese boards? Delicious and generous on the nuts and cheese cuts. Will definitely come back soon!  Also, for the sports aficionados - they have several great plasmas that were showing the games of the evening - Giants and Sharks I believe. Furthermore - you can bring in food from the neighboring pizzerias if you want a heartier meal. Good music choices too - love Band of Horses and Miike Snow!  Bottom line: caters to all crowds, laidback environment, good service, generous pours, TVs, well-priced, and good but rotating selection of wines!", 
    "review_date": "2011-05-12"
  }, 
  "ZTEP2bsIV4nscSKbMzrITg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krithika H.", 
    "review_text": "This place is a solid 2.   We walked in here last night because it looked cute and quiet enough to have a conversation on a Friday night in anotherwise busy and loud Polk St scene.   They have a decent selection of wine,  I tired a few, wasn't overly impressed by any of them.  The bartender was unhelpful and had one of the stingiest pours I have ever seen. Definitely not worth the 7 - 12$ per glass price range they have.   The ambiance is the only savior for this less than inspiring wine bar. I definitely won't be coming back.", 
    "review_date": "2014-03-15"
  }, 
  "WHx4mqEewh2SDNyD0Ii6cw": {
    "user_rating": 5.0, 
    "user_location": "Granite Hills, San Diego, CA", 
    "user_name": "R H.", 
    "review_text": "This place is awesome! Great date spot. The wine good and a the bartender was very nice. I would definitely come here again.", 
    "review_date": "2015-01-04"
  }, 
  "DAikVU-yTq7nIRZmeR7gwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M S.", 
    "review_text": "Love this place. They have beer as well as an assortment of wines. They also offer flights and sometimes have groupon deals. Cheaper than other wine bars in the city.", 
    "review_date": "2011-06-03"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "The last time I went here was when it was S.N.O.B.  (Sonoma, Napa, or Beyond) which I thought was a cute name.  Now that it's The Pour House, the atmosphere is a lot more fun, and less serious.  I like the new name... (full disclosure, I've always gotten a kick out of hair salons with names like \"A Cut Above\" etc.)  Big props for having hooks under the bar.  Honestly, if it's 2010, soon to be 2011, and a bar doesn't have hooks, that's a 2 star reduction in my book.  So, yay for hooks!  I loved the wine list as well as the beer list.  (If you've read my other reviews, you know I really appreciate a descriptive beer list.)  Last night I had a fantastic petite syrah.  Nice glassware too.  I arrived after happy hour had ended, but it's good to know for the future.  Bartenders were friendly and attentive.", 
    "review_date": "2010-12-14"
  }, 
  "NVlhHhQa0IghWMkQHvAOoQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "Went to grab a casual glass of Pinot on a Tuesday and the found the pour house...glad I did.  Wine is priced great and the setting/space is cozy, yet roomy and inviting. The bartender (think his name was Alex) was nice and helpful and very knowledgeable about wine. Made it nice to have a conversation with about the varieties of wine that they offered. I'll be back for sure.   They did get rid of their board games though. BRING THEM BACK! It was such a great option. The owner needs to bring them back ASAP", 
    "review_date": "2012-08-21"
  }, 
  "mO6NSmE-blqepWgUPX37KQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophie C.", 
    "review_text": "A nice escape. Ambient lighting, great music playing (server said it was just Pandora!), and an easy-going style. Decorations and seating aren't typical, somewhat of a Western touch.  Great selection with very very generous pours. Usually get the flights, and customize it!! Generous flights for $16 is really the biggest push to go here. I usually get 2 reds and a white, or all 3 reds. The Malbec is a charm. Quiet, not near any rowdiness found on Polk St. Great snacks here as well.  They have wine and beer, and the basics for those who aren't too fond of too much. It works out. Enjoy an hour or two here, and there's plenty of food around to help.  Have yet to go in when there's live music, have been meaning to! Sell retail as well.   A nice spot for a few drinks, if you want to get away from crowds of people. Success to bring wine lovers from out of town too, like when my partner and I brought his wine loving parents, and another occasion, some of his friends from LA.  Enjoy the wine and the chats. Cheers!", 
    "review_date": "2012-05-21"
  }, 
  "-g3XIcCb2b-BD0QBCcq2Sw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa I.", 
    "review_text": "Great spot for girls night out, I was so disappointed that I was sick!  I loved how much space we had when we were sitting at the tables towards the front, and it also makes for some great people watching when you're sitting by the windows!  The only part about Pour House that I had a hard time with is that if you don't drink (or are sick in my case, but still wanting to be social), your only option is warm tap water.  I'm sure that begs the question of whether you should be in an alcohol environment or not, but again, all I wanted was another option.  Definitely will come back when my health returns to me!", 
    "review_date": "2013-10-06"
  }, 
  "7YI8M_18t-mmPzsw5kt9qw": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Rona Y.", 
    "review_text": "Great wine bar....   Nice bartenders, good cheese, and great wine!   Good place to go for a mellow night, good conversation, and to just chill with friends. We got a flight of wine.... but I'm pretty sure our bartenders poured us way more than they should have in each glass :).   I thought it was pretty inexpensive, at least compared to Press Club, which is the other wine bar I'v been to recently.   Overall, I give it four stars... I really enjoyed my time there, but it is not a place I would seek out, unless I was already in the area.", 
    "review_date": "2011-02-27"
  }, 
  "3UDwikkepZxzW3r8j0F4aQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Madison M.", 
    "review_text": "This bar is very classy AND has the atmosphere of a friendly neighborhood joint.  I really like the selection of beer, not to mention the prices are very affordable!  I definitely recommend this place if you want to go out and have fun with your friends or significant other !", 
    "review_date": "2011-02-10"
  }, 
  "OgF9ywQMfJRBIjIQynOsxQ": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Noreen J.", 
    "review_text": "Almost didn't post this after seeing all the great reviews but... Very disappointed. I work in the area and have passed this place more than a dozen times. 2 stars because the location is cool, the name is clever and I don't have it in my heart to give 1 star. My experience at POUR HOUSE was like buying infomercial anything; not as good as advertised.   Now I understand you're on Polk street and this is an easy sell to weekday warriors who are ignorant to good wines but really? The name is \"POUR HOUSE\" with a wine glass on the signage. So, show me the money [wines]! Half of the wines on the wine list were unavailable and 3 of the 4 wines we requested, the bartender asked us, \"What kind of wine is that?\"   After our bartender broke the cork of our 2004 Rutherford merlot, my colleagues meticulously removed the remaining slivers as best as they could but a few shards still dropped in. No cheese cloth to filter the cork. And no decanter. (No decanters at a wine bar?!? #dafuq???) Yea, I might sound wine snobbish but it's a friggin wine bar!  We dumped the first pour really hard to get the cork remnants out and enjoyed the 2004 vintage, which was surprisingly wonderful for 2004 not being a \"good year\" in Napa. We asked our bartender for a pint glass to filter out the cork in that first glass that we set aside. The bar tender looked at us with confusion and wonder at the request for a \"pint glass\" to which we responded, \"That glass that you pour a beer in.\" *lightbulb*   All in all it was a sad face experience. The look and feel of the place is awesome and if you don't give a crap about El Vino, and the depths of it's majesty, and just want some cool atmosphere that serves the juice, this is a good spot to hang.   I've left the bartender's name and description anonymous because he/she was very nice and did his/her best, but I am embarrassed for the owner that that person is a representative of a wine bar. My suggestion to said owner is to have weekly wine tastings for employees so that they can become educated on what they are pouring at POUR HOUSE, to have an current list of what is available, and to have a GREAT semi-secret stash for people who come in actually knowing about wine. There are a lot of service industry folk who roam around polk street who would enthusiastically back a place like this, if it were worthy. If this place actually held expertise in the niche it fronts to claim, POUR HOUSE could be one of those places that young, trendy winos with networks of great people would have a culty kind of love for. It could be a place where both a 2 buck chuck wine lover and a 5 year veteran server from a top steakhouse can both call home, and be excited to bring their friends. It's kinda whomp whomp to see an establishment claim their lane but not rock it out. Many reviews say it isn't busy here most of the time. If that's the way the owners like it, then great. For now, I'm rudely disappointed. But I look forward to coming back and hopefully updating my review with something better to say.", 
    "review_date": "2014-11-21"
  }, 
  "WjCz9whSc4mP8e5MNI8CVA": {
    "user_rating": 3.0, 
    "user_location": "Boca Raton, FL", 
    "user_name": "Joe M.", 
    "review_text": "Really cool vibe. No frills and no pretention. Just a nice neighborhood spot to relax, listen to music and have a glass of wine or a beer. We tried several types of wine by the glass. Taking it down a star because we only got credit for one Groupon instead of two. Didn't realize it until we were gone. Oh well, I'll chalk it up to an honest mistake by our server..", 
    "review_date": "2011-07-09"
  }, 
  "C3IxLa8hlHaxEM6qc2AhmQ": {
    "user_rating": 5.0, 
    "user_location": "Mesa, AZ", 
    "user_name": "Karrie K.", 
    "review_text": "Perfect lil' wine spot! My sister &amp; I yelped this place before our trip to SF. It was close to our hotel, the bartendar was very nice, helpful &amp; knowledgeable about the wines. We purchased one flight of red &amp; a flight of white for a whopping $24!!! And I must tell you the pours were GENEROUS!! My only tiny gripe is that there were no cheese plates available, we got there around 10:30pm.. He was only able to offer us some bar nuts, but sister is allergic, so that was a bust!  We closed the place down at midnight, then headed over Tommy's Joynt for some late-late nite grub... I will definitely be back, would love to bring my hubby...", 
    "review_date": "2011-05-10"
  }, 
  "L-_YbdsT_-0nSHT5KbKF3A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J B.", 
    "review_text": "This is a good wine bar for this section of Polk street. The wine and atmosphere are good and the service is friendly. I do not like the t.v. on all the time...but that is a trend in SF I don't understand.", 
    "review_date": "2012-09-07"
  }, 
  "SqwtemOds67Mx5kqmeCKJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Womo I.", 
    "review_text": "Great!", 
    "review_date": "2010-12-07"
  }, 
  "JibN6XRd2LCQeTg-JgkjGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vinitha R.", 
    "review_text": "This place is good if you are hosting a small event- good wine and beer and the bartenders are really nice. They let you call and reserve the area in the back which is also kind of nice. Only three stars because there is nothing that special or unique about the place and It's pretty crowded so if you aren't with a reserved event, its a little difficult. It's also really really filled with women which I guess may have something to do with it being a wine bar, but that's not generally my ideal...", 
    "review_date": "2011-12-19"
  }, 
  "sZ3mumX9WjJqp6qrjPPUBQ": {
    "user_rating": 3.0, 
    "user_location": "Stockholm, Sweden", 
    "user_name": "Mathias H.", 
    "review_text": "Nice little wine bar on Polk Street but nothing to travel to go to. We stayed close by and dropped in as we felt like some more wine after the initial days spent visiting wineries in Napa Valley. The place looks OK, sort of a cheap feel to the interior but there is nothing wrong with it.  To be a wine bar the selection of wine was surprisingly small but they seem to be more of a cheaper wine bar. Tried a chardonnay and a pinot noir, both were good but nothing worth remembering.   The bartender was pleasant enough but did not seem that interested in wines (have never seen someone struggling so much when opening a bottle of sparkling for another group so almost seemed he was new at the job)   It was easy to get a seat here and the ambiance was relaxed so it was great as a place to be able to sit down and talk at.", 
    "review_date": "2013-01-18"
  }, 
  "j5yf-kxSwuyrcQ4sYPBT3Q": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "P P.", 
    "review_text": "Excellent low key place to grab a glass of wine after work or before dinner.  Service is friendly and attentive, no complaints. The  people watching is a plus and at 5.00 happy hour is icing on the cake.", 
    "review_date": "2014-07-29"
  }, 
  "f1-Ds0X2Gb-acICN_oXVgw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Dennis S.", 
    "review_text": "It took a little searching, but we found the Pour House tucked into the scaffolding. The place looked deserted but, we ducked in anyway to find Nelson tidying up the bar/ lounge. As I took my stool, I looked around to see The Matrix was playing on one of the flat screens with a pretty good variety of music playing in the background. The Pour house is a cozy, warm, welcoming spot. Its dark with red re-purposed laundry bin lights setting an intimate kind of mood.      Nelson took good care of us, offering us Ghiradeli chocolates with our wine choices. He was very knowledgeable and suggested things off the menu.  I'm not the biggest wine drinker but a  flight of red or white wine for $12 bucks sold me on my first visit. When we left the place was packed, I mean who can pass up drink specials on a weekend?    My second visit I sat we sat on one of the big couches in one of two  lounge areas (The other has re-purposed wine barrel tables and chairs/ booths. I opted for a \"beer flight\" complete with 21st Amendment brews \"Back in Black\" from the tap and an Anchor Steam Humming Ale. The next time I go, I'm gonna order from the Thai place next door in addition to taking advantage of the happy hour choices.  If you are looking for mixed drinks, The Pour House is not for you. Wine, beer and small appetizer plates (Thai Food, if you want to BYOF) awaits those looking for a local wine and beer lounge.", 
    "review_date": "2011-10-19"
  }, 
  "lYh8ABPm1bOONHq7zyPcAg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roberta B.", 
    "review_text": "Small selection of wines over-priced for the vintage, understaffed (only 1 poor fella for the whole place), 3 cheeses listed on the menu and they were out of 1, hummus tasted pre-packaged not home made. The atmosphere was nice so it's too bad the quality was disappointing.", 
    "review_date": "2011-12-21"
  }, 
  "HB0OEby4sXYE8hUqYY5Blw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emmy P.", 
    "review_text": "Atmosphere is romantic, on a very busy section of Polk. The waitress was very nice. We had some beer, don't remember the name. Next time will try wine.", 
    "review_date": "2014-03-23"
  }, 
  "c6db-Z5F6aeDrTm29vE5UQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "julie k.", 
    "review_text": "The pour house is AMAZING! They have fantastic wine and champagne. The best part though is the staff! They are so friendly and amazing. I recently took a bachelorette party there and we had a night to remember. The owner and bartenders were 110% behind us having the best night ever.", 
    "review_date": "2014-07-20"
  }, 
  "EOiAmoVQ15FMAKYxWeb4dQ": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Unkl- T.", 
    "review_text": "Wine is ok. Not my kind of wine bar. Large TV's aren't my thing.  The best aspect of this wine bar is their name.", 
    "review_date": "2011-12-04"
  }, 
  "VDa2H37Wbgkf3IaQisVVDQ": {
    "user_rating": 5.0, 
    "user_location": "North Las Vegas, NV", 
    "user_name": "Laura S.", 
    "review_text": "Absolutely love this place, every time I  visit  the music is really  upbeat l, the lighting is amazing. And I can't say enough about the staff - tell Sarah hello!! :-)  When you first walk in and sit-down they let you sample the wines , before you order  a glass which is I thought was  very  nice.  If you're looking for a clean well-run place you found it.  I've been in several times and always get the  wine flights. Oh , and their wines they change them up all the time and you're always surprised by the selections .   They also can recommend cheese pairings to go with the wine.  Actually heading there Thursday for a birthday party  !!!!", 
    "review_date": "2015-01-20"
  }, 
  "-h7alv4sj0P436P1YICV_Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin M.", 
    "review_text": "Local wine lounge with a cozy atmosphere and a pretty decent wine selection.", 
    "review_date": "2014-02-18"
  }, 
  "vPvspiTjiYingA7dV2Uv3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystle C.", 
    "review_text": "Great little wine bar.  Nice dark intimate sitting areas for romance or just some good convo with friends, cute fire burn near the corner window, dogs are welcome (not sure about all the time, but a sign outside said on Tuesdays), small cheese selection, friendly/knowledgeable bartenders, good wine selection, beers on tap, no pretentiousness, and the music isn't too noisy so you can hear the person next to you. I'll be back with more friends Pour House, Oh I'll be back!", 
    "review_date": "2012-12-17"
  }, 
  "BSkHtdpmsRnb3yh_FgB4Ow": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Christy H.", 
    "review_text": "AWESOME atmosphere, wine was great, had a wonderful time just sitting enjoying my vino and relaxing.", 
    "review_date": "2012-04-29"
  }, 
  "mkyTyMsYi3HqcwJNAFCKjw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa K.", 
    "review_text": "Stopped in this place during Happy Hour and it was empty.  I had a glass of the Pinot Noir and it was ok nothing special.  Happy hour choices are pretty limited, they only offer one white and one red choice.  Food is not good and I don't recommend ordering it.  We tried the spinach and artichoke with crackers and it was basically a supermarket quality cold dip with wheat Keebler like crackers.    They do seem to have a generous dog policy so I may return because my dog can come.  But otherwise it was a bit of a disappointment.", 
    "review_date": "2013-11-19"
  }, 
  "OS1k602HG69arj7mp2UE-A": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jack H.", 
    "review_text": "It's rare that a bartender is able to pull off being pretentious and rude while also managing to be uneducated and slow, but the staff here nails it. The owners must have done an exhaustive search for two minutes on Craigslist to find someone who's incompetence is bested only by their bad attitude.   On the other hand, I was impressed with the food pairings. I know it isn't easy to find a Costco near SF so they must have really gone out of their way to track down that bland artichoke dip to pair with the uninspired beer and wine selection.  Plenty of better options in the neighborhood.", 
    "review_date": "2014-02-17"
  }, 
  "b-pML2HGvpxMFOZ8l3lYEg": {
    "user_rating": 1.0, 
    "user_location": "Rescue, CA", 
    "user_name": "Nichole J.", 
    "review_text": "The owner is a thief!  I've never had this happen before and I'm still in shock!  I just got off the phone with Liam Bigelow, one of the owners of what is now Pour House; formerly S.N.O.B. Wine Bar located at 1327 Polk St (between Bush St &amp; Austin St).  He told me that he would not honor a gift certificate from S.N.O.B at his new bar!  He said 'S.N.O.B. shut down in June or July [of this year]...' and even though he is partial owner of the new bar he will not honor the gift certificate.  This gift certificate I won at a fundraiser at my cousin's art show in the city back in 2007.  Granted, the gift certificate is from 3 years ago but is this even relevant; there is not an expiration date?  He was very rude to me on the phone and laughed out loud many times when we talked about the gift certificate being from 2007.    Liam kept reminding me that S.N.O.B. is no longer in business.  I explained to him, I travel for work and I don't live in the City right now; 'How am I to know the business had closed?  I wasn't notified and neither did my cousin..'.  And then he gave an analogy that is quite telling; he actually said \"this would be like if you walked into a Mac Donald's that was once a Kentucky Fried Chicken and try to order KFC...\" he asked me, \"what do you think they would say?\".  I was blown away.  I responded \"I'm not talking with a franchise owner of Mac Donald's; I'm talking with the owner of a wine bar in San Francisco.\"    Since the conversation was going very poorly I asked if he could simply asses the monetary value of the gift certificate and reimburse me; and he said 'no'.  The gift certificate is for an '8 person private wine tasting'.  I told him I want to come in with only two of my girlfriends and use the gift certificate.  To this; he said, all he could do is offer me three glasses of wine.  Clearly, I am not interested in sitting in this mans wine bar after he has cheated me and my cousin out of money and been excessively rude.   Before we finished the call Liam took my phone number and said he would call me back after he talked this over with his new business partner; it's been over a week and he hasn't called.  Like I said I'm still in shock.  I've lived in California all my life and I love it here.  I've never had an experience that even comes close to this with a business owner, especially a small business owner.  He seems like a bad person who I would not support.", 
    "review_date": "2011-02-11"
  }, 
  "oSYMmkI-NGSfayegnBQcMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Francis L.", 
    "review_text": "comfortable wine bar.  Great atmosphere and a fair wine selection.  They give you generous pours, especially on their flights.  Very friendly staff.  Would come back here again.", 
    "review_date": "2011-08-02"
  }, 
  "CRQxUA153gfihCM7eR8psA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Mike T.", 
    "review_text": "Such a fantastic place for a one or two drink date or to gather with groups of friends. Never seems to be too crowded so you can usually get one of the big areas in front or back if you have a bigger group.  I love Amelie, but sometimes you don't want the scene or the noise and just an escape or something laidback. Can be romantic and laidback at the sametime.", 
    "review_date": "2012-09-27"
  }, 
  "jRrKXsQ6EsKe9Ru6xxGBwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Swati K.", 
    "review_text": "Love it, love it, love it. I initially went there because I bought a groupon online but I've been back a few times afterwards too. I like the rustic look of the place, I love the bartenders/wine servers and I love the selection of wine and beer.   The futon is the best place to sit. It's cozy and it's right by the window so you can people watch.   The best part about the place is that they let you order food from a nearby Thai restaurant. They deliver :) This place is definitely one of my favs.", 
    "review_date": "2011-07-14"
  }, 
  "BwTPj8XS_iqdSTLPBVMs1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie Anne N.", 
    "review_text": "I love this wine bar. It is low key, dimly lit and a great place to grab an after work drink. It is even casual enough to go alone. They offer hefty flights and have a wide variety of wines by the glass/bottle. They don't serve a lot of food options but with wine and it being a bar its hard to have choices that don't require kitchen staff. Highly recommend stopping by.", 
    "review_date": "2011-10-12"
  }, 
  "5jz-BicrPZGCp-Mi-oBRUw": {
    "user_rating": 4.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Roxy H.", 
    "review_text": "Pour is a cute and relatively inexpensive wine bar located on Polk St. in Russian Hill. We went on a Saturday night and didn't have any problems finding a seat and the bartender was quick to come over welcome us and help us pick out a bottle of wine for our group. Out of all the bottles I surprised that he recommended one of the cheaper Bottles on the menu. We ordered the Pinotage Ernst Gouws &amp; Co 2010 from South Africa. It's a red and has a really bold kinda fruity and smokey flavor to it! The bottle ran us 26.00 and they charged us 1.00 for a bowl mixed nuts. At the end of the night they told us that they sell all of their bottles of wine for 40% off of the listed price on the menu!  Only downside is that as soon as we walked in (9:00) the jazz band was packing up to leave. I love live music and would make this part of my rotation if they had music late on weekends! But over all we had a great time and for 5 people and our bill only being 35.00, I am sold.", 
    "review_date": "2013-09-01"
  }, 
  "bk3LC4qjyk3VEVtpP4P68w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kierstan G.", 
    "review_text": "It was friday night...my friend and i were already partially tipsy...but we had an hour to kill before our movie at the kubuki...and a friend was visiting SF and wanted to meet up for a quick drink during that time...so...our decision game plan unfolded this way...  First geography...we were in alamo going to japan town...she was in the marina headed nowhere...Polk Street it is!  Second Beverage...we had been drinking wine...the friend wanted wine...wine it is!  Third Bar...We told the taxi driver...drop us off somewhere on polk among the open bars and restaurants.  He dropped us off at Polk and Bush....We looked around...we saw the pour house...we looked inside...cool, swanky and pretty much empty...The Pour House it is!  The ambiance is kind of cool, dark, red, the menu isn't amazing but it has wine...prices are decent...quiet enough to have a conversation...and the bartender cute....so, for what we wanted it satisfied.", 
    "review_date": "2012-10-29"
  }, 
  "r_bKgZFD761MvvZcN6qkKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fabian F.", 
    "review_text": "Awesome place! Great, friendly service. Kinda quiet on that Sunday. Nice, dark, intimate. Great date place. Good wine selection.", 
    "review_date": "2011-04-25"
  }, 
  "5ZXT4BQB-C1XjUpKmh7kaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anne Marie B.", 
    "review_text": "I'm just a little obsessed with the pour house.  It's my new favorite bar on polk street.  They only serve beer and wine, but their prices are very reasonable and their selection is nice.  I typically go for the Chimay or the Duvel, but I tried the Maroudsous triple the other night and I found my new favorite beer on the menu.    The bar tenders are always nice and friendly.  They make great recommendations about what they serve, and play excellent music.    I love the vibe of this place.  You won't come here for bumping and grinding.  It's quiet enough that you can have conversations without yelling, but dark and loud enough that you feel like you're not just sitting at home for the night.   And I'm a huge fan of the couches and futon, because who doesn't love reclining while imbibing a delectable brew?", 
    "review_date": "2011-07-19"
  }, 
  "cz76cbJvk-ZLVTofNff0XA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shira O.", 
    "review_text": "What a fun place. Wine, beer and bubbly only--but you won't miss the spirits. Why you say?! Because this place has charisma, yes I said it, charisma. Initimate setting, fun lively bartenders, great selection of wine and beer and a cozy, \"makes me want to come back ASAP\" vibe. Great addition to Polk and to the SF beer and wine scene.", 
    "review_date": "2012-04-24"
  }, 
  "wqo5uQeR_FV2y9PzLntk2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate D.", 
    "review_text": "This is a fantastic wine bar with great beer. Yes, they even have good beer here too. Friendly bartenders and the owner is great as well. Whatever the occasion is they will make sure you have a wonderful time.  If you're ever in the neighborhood , check this place out.", 
    "review_date": "2014-08-13"
  }, 
  "Ldy03uMFaEEEnh3KIsPP_w": {
    "user_rating": 4.0, 
    "user_location": "Lebanon, NJ", 
    "user_name": "Muriel D.", 
    "review_text": "Used to be called S.N.O.B.  Really liked the bartenders who were friendly and joked around with my friend and I,and the dark lighting and simple decor.", 
    "review_date": "2010-10-27"
  }, 
  "tAIJnhr4BUHvrq1Z2Mtc0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tapedeck B.", 
    "review_text": "This is a nice place with a low-key atmosphere that has a great list of wine and beer.  The prices are good and the service is friendly and helpful.  Try it out!", 
    "review_date": "2011-08-04"
  }, 
  "nYMCmotSPVdfWzw6h1FA8Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Iggy R.", 
    "review_text": "Decent wines for a decent price.  Not great.  Decent.  I have gone to the Pour House a few times, so I think this is an honest and fair review.  It is too god damn cold there.  Yes, that's right.  It is too god damn cold.  Do they think they are in San Diego?  The door is always open.  Always.  Even on nights when it is 40 degrees.  The velvet curtains around the door does very little to keep the wind out.  There is small electric heater (think of something you would find underneath an office desk) in the front near the couches.  It does nothing to keep the place warm.  The bar is half empty and is not going to warm up by body temperature.    Here is an idea, when it gets really cold outside, why don't they act like reasonable  SF'ers and shut the door.    The place isn't located in the greatest neighborhood.  Polk street after a certain hour, becomes sketchy with sketchy characters.  Every time I have been at The Pour House, one of these characters always wanders in and accosts me.  Fortunately, the bartenders are very aware of this problem and each and every time escort them out.    Is it The Pour House's fault that these derelicts wander into their establishment?  No, but perhaps if they shut the door on cold nights it wouldn't be an open invitation.   To summarize.  Shut the door on cold nights.", 
    "review_date": "2011-02-07"
  }, 
  "gr-HOiQcQG8jTH4iVpSqzw": {
    "user_rating": 5.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Darya P.", 
    "review_text": "Great, quiet night at the cozy Pour House. Had the Spanish wine special ($7) and generous pour by Matt the 'tender. Tip: if your appetite needs more than cheese/dips you can call-in Thai food from  next door. We dialed Chaya-yo from the landline (they know the digits) and they brought all the linens/cutlery/food straight from the kitchen. Delicious wine, spicy Thai, and a cute bartender to boot. We'll def be back!", 
    "review_date": "2012-12-30"
  }, 
  "of-Kuw-FAB59_b5YlUtGSQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arica V.", 
    "review_text": "I am not that cool when it comes to wine but I know enough to know that this place is a gem!!  We headed over here after dinner for a glass of wine and I love the atmosphere - it's so cozy and relaxing.  The bartender was amazing - recommending great wines and giving us tastes to make sure we got exactly what we were looking for.  Even on a Monday night, the people there were cool and it was a great place to be.  To top the night off, the bartender gave our friend her wine for free because it was her birthday - great guy!!!  We will be back.", 
    "review_date": "2011-03-22"
  }, 
  "Qp82B2pd70qpQTj3KrlHHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron H.", 
    "review_text": "Great place to meet up with some good people and drink Brady Cab. Solid datemosphere!", 
    "review_date": "2014-05-12"
  }, 
  "pXeGiGgexdzYoVz-uhObAw": {
    "user_rating": 4.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Kim S.", 
    "review_text": "Cozy place with dim lit ambiance - great for a date.  Plus not too noisy so you can hear each other without screaming.  Knowledgeable bartender.", 
    "review_date": "2011-10-25"
  }, 
  "jipgimnSNp3qdK2dKUQvBg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat C.", 
    "review_text": "More of a meet up place as opposed to a date night place for sure.  We went to Amelie beforehand, but it was so packed so we ended up here.  They don't have too much selection for wines by the glass.  There was only one \"sweeter\" wine option (Riesling) as opposed to going really sweet with a Moscato.  Casual nibbles to purchase to accompany your wine.  Service was fine from our waitress.    Prices were decent, but there is a $15 minimum for credit card charges.  It's probably my least favorite wine bar I've been to but a good alternative to the typical bars, lounges and clubs on Polk...because if you're like me, you're so over your raging days.  3 by default.", 
    "review_date": "2014-07-18"
  }, 
  "6in4OJrKAbAU9_VO3p_syQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sutton A.", 
    "review_text": "I can't review the wine (since we didn't have any) but the service was amazing.  The bartender was fun, willing to engage in conversation and helpful.  We were trying their selection of Belgian beers and he knew about each one, had recommendations for each pallet and his favorites.  Also they had overcharged us due to a St. Patty's day deal they had going on and they refunded us the difference.  Nice to see the honesty.  I want to come back to try their wine selection.  Just happened to stop in on a beer kind of day.", 
    "review_date": "2013-03-24"
  }, 
  "n1AYydmhQHe1PVQBKa8qoQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie L.", 
    "review_text": "I haven't written a yelp review in a while, so I figured this would be a good way to get started.  Pour House is a great local bar with plenty of good drinks, friendly bartenders, and most importantly-- SPACE.  Finally, a place that isn't so packed (ahem Mayes) that you can actually hear one another (ahem McTeague's).", 
    "review_date": "2011-07-20"
  }, 
  "MjCIBCRp7p4B_ITMWDpKzQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley J.", 
    "review_text": "This bar is perfect for an intimate gathering. I come here quite a bit for some one on one conversation, and it's always a fun time. The bartenders are usually pretty friendly and talkative, and helpful when it comes to choosing a wine to drink. I've never seen this place completely packed, which is nice, as I don't think I'd enjoy it quite as much if it was loud and you could hardly move through the bar. They offer small plates of food (such as cheese and crackers) which may be helpful to know.", 
    "review_date": "2011-10-10"
  }, 
  "FiHXzEXrQpePOtgz_h71pA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather W.", 
    "review_text": "Great place to come alone or with friends. Try the red flight for $12. They pour you 4 healthy tastes. Simple selection and a great Malbec. Groupon brought me in but Rafael keeps me coming back. Great service.", 
    "review_date": "2011-04-08"
  }, 
  "5g92mLU6iRmMlVBBwsTVKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna M.", 
    "review_text": "Great place to meet with friends  and talk for hours.  This place has live music at the evening. Great atmosphere there as well.  They have a place in the back for a big party if you want to celebrate a Bday or any event. Good place on the crowed Polk street.", 
    "review_date": "2014-04-28"
  }, 
  "wnwoN9Z8wDTo0ra38U8GQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurelle H.", 
    "review_text": "This is my go-to bar on Polk. Pretty much every other bar is packed to fire-hazard levels, and getting the bartender's attention is purely impossible. If my boyfriend and I aren't feeling like going across the city, we'll walk over to the Pour House. What I mostly love about this place is that it's not crazy crowded and the bartenders are pretty great. They both know our usual and have great taste in music. The wine selection is pretty extensive, and they have a cheese plate that's great for snacking. While they don't have anything else to eat, you can order from the Thai restaurant Chai-Yo and they'll bring it right to where you're sitting in the bar. It's fantastic! We've definitely spent many a Friday night watching the Giant's game and drinking champagne.", 
    "review_date": "2011-08-22"
  }, 
  "hVY5dJtw_B3zdAYN4V7I0A": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Brian H.", 
    "review_text": "Same crap wines, same horrible owners, still never going back.  I hope they don't flyer all the cars in the neighborhood AGAIN with the new name.", 
    "review_date": "2010-12-07"
  }, 
  "vgwdQ0fpDZdoTidJuwYq7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen B.", 
    "review_text": "I like the vibe of the Pour House. It's comfy and you can hole up in one of the back tables with a friend or two and just enjoy good wines (great beer too) and some cheese &amp; crackers. My idea of a good time. I haven't been yet, but I hear they have art shows on Thursdays and bands on Tuesdays and Sundays. Looking forward to emptying more glasses with the Pour House crew.", 
    "review_date": "2012-04-02"
  }, 
  "LKdu9QbdgBgMrrCqn4fs5Q": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Dawn C.", 
    "review_text": "10-15-11....Hmmm, no men here (except for my hubbie and the bartender). Great wines and good beer. I had the malbec and he had the Dogfish Head - both great choices.", 
    "review_date": "2011-11-18"
  }, 
  "imivnF0CzhXf0Eco1mQbTw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew L.", 
    "review_text": "I've been going to The Pour House for over a year and have really wanted to like it and brought friends here many times. However, though the atmosphere and value is great, the service is pretty lacking to the point of being rude sometimes. I don't know if I'd come back after another bad experience tonight.", 
    "review_date": "2012-07-01"
  }, 
  "k2xdkJHb44nXpvbZVDEzrA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maggie F.", 
    "review_text": "Came here on a first date and it was perfect for the casual drink in a relatively intimate environment. The night I came it was raining so it deterred a lot of people from going out, so the place wasn't too crowded (Which was a huge plus for me).", 
    "review_date": "2013-01-23"
  }, 
  "mXt7Jthveyt4R2hnIY-mPg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clara S.", 
    "review_text": "I had my birthday party here a few days ago and this really turned out to be the perfect spot. We mostly worked with Liam (owner) and Chance (bartender), and both were gracious, friendly, and accommodating. Chance is very knowledgeable about wines - we loved all of his recommendations and friendly service!", 
    "review_date": "2011-01-16"
  }, 
  "wMujviQ3I4aoyEoa92BYEQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Shad B.", 
    "review_text": "Awesome place.. Awesome vibe.  The Pour House is a cool please to chill with friends.  It has an intimate vibe and feel.  A glass of Chimay is only $6, which is pretty good.", 
    "review_date": "2011-05-29"
  }, 
  "YG5EroFMYByZODecz3U_kQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany W.", 
    "review_text": "Cute little wine bar, but not really anything special in my opinion. Ordered a cheese platter to accompany our wine; I think the person who usually puts together the food wasn't there or something? We got a haphazardly assembled plate of cheese and crackers, and had to pay 10 bucks for it.  Still not opposed to going back because it's in my neighborhood and the bartender was kind of nice. Wine selection was decent, too.", 
    "review_date": "2013-08-30"
  }, 
  "b7RiHl0IhQBjOsWmET1tXA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan D.", 
    "review_text": "Fun bar! It's great for a date or go in on the weekends to party. Bartenders are all super nice and the wine and beer list is great.", 
    "review_date": "2015-01-17"
  }, 
  "SaV6uEvDeq97KGLkxRpzvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh M.", 
    "review_text": "I came here Super Bowl Sunday, kind of on a whim. I walked by, and it wasn't packed and thought, hey I'll check out the second half. Glad I did.   They had $5 pitchers (!?!) which included Blue Moon, my favorite beer of all time. I didn't need much more convincing. But I had a great time. Natalie, the bartender, was was really sweet and made sure I had everything I needed; she even introduced me to some other patrons, as I was sitting alone (sad face) and offered to order me food from the Thai place next door. I plan on making another trip to the 'hood when she is working ;)", 
    "review_date": "2011-02-10"
  }, 
  "dH1YHuBdJZaUkZcTiNDZYQ": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Stephen S.", 
    "review_text": "Great bar tender! I came here on a Sunday with some friends. It was a really chill place to get some wine and beer along with some bar snacks. They have menus for the Thai place next door and they will serve the food to you at the bar... awesome!", 
    "review_date": "2013-01-05"
  }, 
  "YI5FBePlv7E6TmzILFfhXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley L.", 
    "review_text": "Great spot is you like beer and iwne, which I do! Excellent service, great ambiance and you can get food from the surrounding area and bring it in.  Great selection of wine, although I had the sparkling wine which was great and then I switched to an awesome beer...trying to recall what is was (similar to a Hefeweizen). Again great service, no overally crowded!  I will come back and bring my pals!", 
    "review_date": "2011-07-01"
  }, 
  "0Q0hDsrQe09A6tFqz40hpQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jayde G.", 
    "review_text": "I absolutely love this place. The wine selection is extensive and the bartenders are  personable. The guy working on Sunday, Fred I think his name was, made sure my friend and I never had a dry glass and held the place down while some weirdos sauntered in throughout the night (my party was there for quite some time). We will definitely be back.", 
    "review_date": "2014-04-29"
  }, 
  "_6p-f3UH0psT5XJyPC6PTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zarpana K.", 
    "review_text": "I love this place. Unpretentious wine bar with great music, couches and the bar tenders are super helpful, nice...I'll definitely come back here.", 
    "review_date": "2010-09-13"
  }, 
  "quvqQ-aGDXZa7lucLJZwAA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David C.", 
    "review_text": "Classy and cool.  Wine and beer list has been revamped and now much improved.  Service is excellent.  Back area can be reserved for private parties.  I recently hosted a bday party for my girlfriend in the back area.  Everyone had a blast.", 
    "review_date": "2011-01-17"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "wednesday stop little past six...happy hour ends at six...near empty and seating plenty...at the bar and wine pours the main focus...regular pricing roughly $ten plus/minus total and glass of wine...taste given of choice...bit too murky dull...bartender recommending something different...much better!..nice quiet bar for glass of wine and tasting...", 
    "review_date": "2013-12-23"
  }, 
  "hqGJS952rgj_mTwukZN01w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "noelle m.", 
    "review_text": "Great owner &amp; very accommodating staff. Went there with friends for a bachelorette night, the owner treated us to drinks &amp; let us stay beyond closing time for a friend's special night. Drinks were tasty &amp; the people there were great. A very memorable night for me in sf:)", 
    "review_date": "2014-08-16"
  }, 
  "fJCcVdyHewwX9W-fhxqxCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alisa A.", 
    "review_text": "We just hosted our engagement party at The Pour House and it was a total success.  We found this wine bar one night over a year ago after we had seen a movie on Van Ness.  The thing we really like about this place is it's not uptight like some wine bars.  The atmosphere is laid back and inviting and the bartenders are friendly and helpful.  You don't feel like you have to know a lot about wine (like some wine bars).  They're happy to help with suggestions.  The prices are great and they also have a great beer selection if wine isn't your thing.  Back to our event - Chase and Nelson were the bartenders and they were awesome. We had between 50 and 60 people show up between 630 and 9 and I never heard anyone complain that they had to wait for their drinks.  Everyone had a great time.  When we walked in at first they were playing pretty loud rock, maybe even heavy metal.  I was surprised that heavy metal type rock would be playing at a wine bar ever... kind of a turn off. Chase was accomodating and took our requests for the music we liked for the night, which is awesome, but I can say that if I was just coming in for a drink that kind of music wouldn't make me want to stay.    They didn't charge us to host our party in their bar which was awesome but we were a little disappointed that there were no deals whatsoever or something complimentary, like maybe something as simple as a bottle of champagne for us.  It would have been a nice gesture as we did give them a LOT of business on a Thursday night.  Also there was a calendar online that said wine was $1 off between 6-8 on Thursdays (event was April 5) and I'm pretty sure that discount wasn't passed on to our guests. <a href=\"/redir?url=http%3A%2F%2Fwww.sfpourhouse.com%2Fcalendar&amp;s=15032e092702f5edcf8fef24343ab7c0de9d9ad5f525647ba9198eeac1f90c8c\" rel=\"nofollow\" target=\"_blank\">sfpourhouse.com/calendar</a>  The guy in charge of events wasn't very responsive so it was hard to plan our event.  At one point I asked for a list of food options and he never responded.  We decided to make our own arrangements and bring food in.  I got an email from him 4 days later asking about a head count.  When I told him we'd be bringing food of our own in he then told me we would have to purchase 4-5 platters in addition to the food we brought in.  We most likely would have bought platters from them but the lack of response made me feel like he didn't care so I didn't want to spend more money on food through them.  I almost felt like I was trying so hard to make the event work out, instead of the other way around.   I believe in constructive criticism so hopefully they'll heed these comments and change the way they handle communication for future events.", 
    "review_date": "2012-04-07"
  }, 
  "t2jHhwu7XQVNUz2c6jo1HQ": {
    "user_rating": 3.0, 
    "user_location": "Sonora, CA", 
    "user_name": "Clint C.", 
    "review_text": "The snacks (Cheese with nuts and crackers, and nuts and olives) were good and filling, and the pours were very generous. My wife especially liked the olives. It's quiet and laid back. There's only one thing that I disliked; the atmosphere. All of the lights were red. Even the lights over the bar were upside down tin water tubs (like you would find on a farm) with red lights screwed into them. Behind the bar was their 'office' and 6 pack beer storage. When relaxing with a nice glass of Old Vine Zin, I really would rather not have to look at a computer and beer storage. A simple curtain would correct this. They did have couch sitting areas on either end of the bar, which was nice.", 
    "review_date": "2011-08-30"
  }, 
  "-Y2e32dquRc5JahOCTusBA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica B.", 
    "review_text": "Went in for a first date- and Pour Bar turned out to be the perfect place. The music wasn't too loud (like so many bars in the city) and we were able to enjoy a nice conversation. The beer and wine selection was good- maybe not as good as other wine and beer bars in  the city (not enough beer on tap) but it was decent.  What I really took note of was how friendly and personable the bartender was. It is so nice to get such great service with a smile.", 
    "review_date": "2010-08-11"
  }, 
  "dNF7HdMRgeODXzX6b4ehig": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peaceful S.", 
    "review_text": "a guy who waited our table was super friendly and nice.  the atmosphere is definitely \"neighborhood\" feel; nothing fancy.  if i happen to be in this neighborhood and looking for a quick stop for few beers/wine with my friends, we'd stop by.", 
    "review_date": "2014-04-11"
  }, 
  "QF9vzRcKOUn32wgnTcTG9Q": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Eric P.", 
    "review_text": "In no way do I qualify myself as a wine connoisseur, so I will not even think to review the wine selection.  We've always walked past this small bar when it was S.N.O.B..  Thinking it was wine and only wine, we never went.  After the re-opening, one night we decided to give it a shot.  It was well worth it.  You can easily find a comfortable place to sit and have a conversation without other people breathing on you or climbing over you to order a drink.  The beer list is pretty extensive and non-happy hour prices are a bargain ($5 for a 10% ABV bottle of Maredsous is like drinking two for one!).  And it's far enough away from the ruckus of the cluster of Polk Street bars.  A one-star demerit for an early closing time (Last call is midnight, closing's around 1.), but we make sure we get our drink on well before then.  We'll be back, for sure.", 
    "review_date": "2010-08-21"
  }, 
  "570kiZ_3AyLYNKpihpA05A": {
    "user_rating": 5.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "Amy C.", 
    "review_text": "We spontaneously walked into Pour House on a Thursday date night... thought we could grab a few drinks before dinner and were pleasantly surprised by how much we liked our random choice!  Service - Just one lady working that night but crowd was small enough where we all were well taken care of. Also, she poured a huge glass of wine (hello double thumbs up)   Drink  - Great big selection of wine. BF loved the beer even though that was obviously a smaller selection. You can try both beer and wine before taking full glass.   Food - didn't try it! But from what we saw, they partner with a nearby restaurant (thai??) that will bring food right to your seat.   Atmosphere - really chill... part lounge, part new age. I dig it.", 
    "review_date": "2015-02-01"
  }, 
  "js4wjUqfNu4xJBu27KZKhg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul T.", 
    "review_text": "I've been coming here, off and on, for a few years now, maybe once or twice a year, since it opened, a couple of versions of itself ago.  It's never quite hit the spot.   Initially, it was a wine bar.  You know the drill, a long list of wines, and there are several opportunities to find what you like.  This version was my favorite, but one of the big drawbacks was that the by-the-glass price was the same if you bought a bottle, no discount for doing so, thus no incentive to buy a bottle.  Nowadays, it's a sort-of wine bar.  The menu listed two cabernet sauvignons, and a Syrah I can get elsewhere, if I have to, as it's not a favorite.  What's the point?  The space is not that impressive (and never was) and the crowd is indifferent.  It's close by, but I'd rather walk a bit farther down the street.  I'm not sure what's going on here, but the Pour House just can't seem to figure out what it is, but it's not a very good wine bar.", 
    "review_date": "2012-02-02"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "Got a great beer (Dogfish Head) and a great wine (Santa Barbara Crossing) with great service.  I just love the dark vibe of this place.  I'll be back soon.", 
    "review_date": "2011-01-27"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "An a-ok place to pass the time. Crowd seems to be older so you can avoid the Polk St. / Real World douche storm.", 
    "review_date": "2014-01-09"
  }, 
  "QHIOjlUcFlb_n26s_UGFnQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen A.", 
    "review_text": "I remember when this bar was S.N.O.B. Same low-key place, but thankfully new name. The old name alone is what kept me from going back. Anyway, I ended up coming back because of The Pour House's weekly Local Art Thursdays. Great idea, but I don't think it happens anymore. Anyway, the place is great for meeting friends for a non-clubby hangout. We had a bit of fun on the side playing on their lopsided shuffleboard which the bar was getting rid of that week. Not an extensive on-tap selection, but plenty for the friends who were drinking beer and of course a good wine selection. There was one sole bartender, but there weren't many people to deal with, so bar service was very personal. I had some prosecco, my favorite beverage, so everything was ok with the world for me. It is well situated for taking a late night snack at neighboring restaurants in the Polk Gulch area.", 
    "review_date": "2012-09-14"
  }, 
  "OMC_7PVEmVzptr781bGfAw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandra B.", 
    "review_text": "I had my bachelorette party here, and it was one of the best experiences of my life.  The owner, Liam, is the nicest and friendliest guy, great wine/champagne selection and overall perfect night!  Would definitely recommend!", 
    "review_date": "2014-07-21"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 2.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "The flights were reasonably priced but we got what we paid for.  Out of eight pours we really only enjoyed two.  We also ordered the nuts and olives for $1, along with a few other parties at the bar.  The food menu was pretty deceiving though.  Everyone was surprised when charged $1 for the nuts and $1 for the olives.  It's principle.    This is a bar trying to pull off being a higher end establishment but if you look closely it's fraying.  Boxes are piled on wire, dorm style shelves. The shared bathroom was straight up nasty.  To top things off a drunk dude started hitting on me while on a date.  The bartender apologized to everyone, except me, for the guy that couldn't handle his drinks.  Perhaps he should have considered cutting that regular off a couple of hours sooner.", 
    "review_date": "2013-02-06"
  }, 
  "7IyZBsbOzUqkdulWTvieAg": {
    "user_rating": 4.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Ruobin W.", 
    "review_text": "Went here during Santa Con. Had a bunch of seats and some pretty good wines. Honestly can't remember much about the night, unfortunately. However, this does seem like a great place to just chill and hang out.", 
    "review_date": "2013-12-21"
  }, 
  "K1DFyfpakjU1AhcPMaejdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marian G.", 
    "review_text": "This place is great now that it is redone! They had a lot of great options and the ambiance was cool and comfortable. The music was a little loud for my taste because I could barely hear what my date was saying, but at least it was cool music! I liked the lounge couches in the front where you could lay and cuddle! I'll definitely cone back here.", 
    "review_date": "2011-06-23"
  }, 
  "Ydm8DNtaZv1oG073SR8c5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina S.", 
    "review_text": "Years have passed and I'm still coming back here!  Walked in to Amelie the other day - ordered sparkling - and when I asked for a fresh poor as there weren't any bubbles in it I was told that sometimes sparkling doesn't have bubbles?!?!  WTF?!?!  So I keep coming here.  It isn't as fancy as some places you could go.  But at least they open a new bottle when the bubbles are flat!  Live music and delivery from Chai Yo next door are an extra plus, plus.  LOVE IT!", 
    "review_date": "2014-04-29"
  }, 
  "GfOEmTx_iL9y50NqOm2PDw": {
    "user_rating": 4.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Kelly B.", 
    "review_text": "What a great little spot! We popped in here with a decent sized group for an after lunch continuation of a birthday celebration. We tried several of the selections, which are a bit limited, but I believe will grow with time.  As a new player in town, I think they are doing a great job. It's an intimate little place, with some nice outdoor seating, and a little space for a live band.  I don't recall there being any problems with service or space, and I know we were there for a good two hours.  I am looking forward to coming back and trying some new wines.", 
    "review_date": "2012-01-23"
  }, 
  "4ctgt3bUUkxu6u8vkyfpVw": {
    "user_rating": 5.0, 
    "user_location": "SoMa, San Francisco, CA", 
    "user_name": "Ian R.", 
    "review_text": "Great classy wine bar in the city. Would definitely recommend it. The owner is an absolute gentleman also.", 
    "review_date": "2013-10-19"
  }, 
  "kZZt88M9Hrr_57mXlmYq4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice S.", 
    "review_text": "The Pour House on Polk Street is a great place for a glass of wine or microbrew after work. It conveniently opens at 4pm, the time I think happy hour should start. The Pour House used to be SNOB (Sonoma, Napa or Beyond) but the subsequently changed the name and the vibe. SNOB was a bit pretentious and the service was about as rude as a NYC cab driver at 2am. I went twice before the name change and both times I felt as if I was inconveniencing the bartender by gracing her with my presence. But this has all changed, thankfully.   The Pour House has turned into a fabulous low-key semi-hipster place. The new atmosphere is relaxed, there is plenty of seating with a long wood bar (with purse hooks), 3 overstuffed couches up front and a splattering of tables in the dark, romantic back of the bar. Unless you know the majority of the people sitting on the couches, it can be a bit awkward to sit there. My friend and I started out on the couches but later moved after a group of 5 sat down. I really felt I was invading someone's living room couch. So if you have space issues or don't like people listening to your conversation then pick a seat at the bar or one of the tables in the back.  The bar offers 40 different premium wines and 25 microbrews (10 on tap). The bartender on duty was a very nice young man who unfortunately went to UCONN (I didn't hold it against him, we still tipped). My only complaint is that the cheese plate is horrible. First off you have two cheese choices, Jarlsberg and an unidentified crumbled goat cheese. The two cheeses come with massive wheat crackers that do nothing to compliment the cheese. The best part was the dish of salty olives. If I wasn't so starved, I would have told him he could keep it after my first glance. Another food option is to order from one of the restaurants on Polk Street and have them deliver right to you at the bar.", 
    "review_date": "2011-04-05"
  }, 
  "LX_daBOCIBHwqFCARqhRfg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Misty M.", 
    "review_text": "I came here on a Wednesday night around  8:30 pm and it was pretty full. The ambiance is very cozy, unpretentious, and the bar tender was really friendly. The flight of red wine was a steal at $12 and they were very generous with their servings. I had to have my friend drink some of mine! Overall it's a really great place to hang out and talk, casual but still nice, good music, and overall a great time. The service was wonderful and it showed that he really cared about the customers.", 
    "review_date": "2011-06-09"
  }, 
  "i307EzE-38XZy6lkND65RQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven W.", 
    "review_text": "When I think wine bar, I think a relaxed atmosphere and tasteful music. That is not what you'll get at the Pour House. For the Polk Street crowd interested in ducking in for a glass of wine, this is your spot. Loud, terrible music; loud people; mediocre wines. if you really want a great spot, it's worth the cab to SoMa for Terroir,", 
    "review_date": "2013-02-15"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "It's no secret that I love wine and, duh!, wine bars. Plus after a long hiatus, I'm starting fall back in love with beer. Ideally, the Pour House should be the meeting of two fabulous worlds, but it was just OK.  Some friends picked me up along the way so I didn't have to worry about relying on mass transit in the city. That immediately put me in a good mood. Plus it was Friday night - TGIF!  As we walked in, there was late '90's pop music blaring. At a wine bar? Really? We giggled and grabbed a booth. The boys ordered beers and my gal pal and I each had a glass of vino. The beers were awesome! The wine? Meh, not so much. It was a generous pour, though, especially for a $6 glass. So cheers to quantity over quality. My friends also ordered a cheese plate, which came out with mixed nuts, olives and two different kinds of cheese. They ate most of it, so I can't speak for that part of our experience.   Since the music overhead kept getting louder and worse, we decided to leave. It wasn't offensive or anything, just not the kind of vibe we were going for. With many other awesome wine bars in SF and beyond, I just wasn't that impressed. But if I was in the 'hood and wanted a cheap glass of wine, this would be a good place to start.", 
    "review_date": "2012-01-08"
  }, 
  "PShzc66S1ThGgeqjL4BXhQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chae K.", 
    "review_text": "The pour house is one of my fav spots to grab a nice glass of wine after work! They have a pinot noir for only $5 during happy hour! It's a great spot for first dates or just a night out with the girls! Also the Thai place delivers so you can enjoy delicious food to compliment your glass of wine. My favorite is the Brady Cabernet! Also the pours are decent sized and prices are reasonable!", 
    "review_date": "2015-01-17"
  }, 
  "ccfVsl7SZeK-2Ixc2-anuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianna S.", 
    "review_text": "I've stopped in many times for HH...I really can't get over $3 glasses of wine, huge pours mind you.  There are usually plenty of open table/bar seats and I love the open window seating. Makes for excellent people watching on good ol' Polk St.   Minus one star because there has always been discrepancies between a) what the website says b) what their outdoor signage says and c) what the bartenders say regarding happy hour pricing and times.  Simple fix: streamline your info! That said, they always accommodate when I mention the website content.", 
    "review_date": "2014-07-31"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 5.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "My birthday was officially on Monday and after a weekend of debauchery, I decided I wanted something mellow. Friends and I had some cheap (but delicious) pizza and then headed virtually next door to The Pour House for a glass of wine. When I'm on Polk I always go to Amelie so it was nice to discover a new spot!   The zin I ordered was fantastic. If I knew how to describe wines well I'd go off on all the random things it tasted like but since I don't, I'll just stick with, YUM. One of my girlfriends mentioned it was my birthday and the adorable server comped our my glass. How sweet is that?! Can't wait to come back and try others.", 
    "review_date": "2011-03-22"
  }, 
  "o2qn6hMTUJfTI-W2GazX0w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam M.", 
    "review_text": "I have been to this place twice, and while I would not return, I do have to say that the bartender really tries.   The good: The first time I was offered the happy hour deal past happy hour, which was nice of the bartender. The second time the bartender offered a free sample glass before purchasing a bottle.  The bad: One man was running the whole show. It took about 30 minutes to get served. The bar food is pretty bad, and the selection worse.  Bottom Line: Good for a quick drink, if you have a long time to wait around and do not wish to eat a bar snack. Priced well. Worth checking out, just do count on quite a wait before being served.", 
    "review_date": "2014-03-03"
  }, 
  "QmocQFhZmdiAqQuX2hREnw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Tami M.", 
    "review_text": "I was in San Fran for the weekend, and found this place through Groupon.  We were staying about 10 blocks away, so I figured it was a good deal... I was pleasantly surprised to find out how cool it was!  Dimly lit, good music playing, and the best bartender ever!  He was nice, informative and very generous with the pours!  I wish I had a place like this in Seattle!  I highly recommend this place, and you can also have food delivered right to the bar!  We had Thai that was delicious and fast!", 
    "review_date": "2011-03-26"
  }, 
  "JVHlFff199O9R0JjKaE0ew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anastasia P.", 
    "review_text": "I've been here 3-4 times and each experience was awesome! I love the decor-with the wine barrels and romantic lighting, you really get the full experience of being in a wine bar. Last time I went in Megan the bartender gave us great service and was really fun to talk to. This is a great place for date night or girls night out.", 
    "review_date": "2015-01-20"
  }, 
  "VEkaOFgMZPdpSbqoACjAOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nisha M.", 
    "review_text": "A great little wine bar at the corner of the street for us unpriveleged folk. If you are looking for fancy-schmancy digs or sommelier-types, this is not for you. Come here to enjoy a nice glass of wine, sink into an initimate setting, great seating (used to love the couch by the window facing the street, but then they removed it to make way for a stage) and really happy bar tenders. The pours are generous, the wine is decent (not snooty Napa variety) and its easy on the wallet. I love coming here on a weekday night, you can watch the game or just have a regular conversation without screaming at the top of your voice. Great place to people watch (Polk st. characters) and parking is easily available on the street. I have never tried the bar-food here, but then again who goes to a wine bar to eat :)", 
    "review_date": "2013-04-30"
  }, 
  "yvfNK12wETzKYlnV5sCQiQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ted S.", 
    "review_text": "The ambiance is nice, I dig the decor.  The music was spot on.  The bartender was awesome: very polite, engaging in conversation, quick with recommendations, and I never had an empty glass.  The Pour House bills themselves as a wine and craft beer bar.  Yet, 40% of their taps are macro brews (PBR and Blue Moon).  I understand that you need to have macros on tap to please the crowds, however, either get more taps or reduce the number of macros on tap.  One of their craft beer kegs, Sierra Nevada Torpedo, was very old.  There was no hop aroma left in that beer, very little hop flavor.  Time is not friendly to IPAs, so they should be planning a bit better and consider buying sixtels vs half barrels.  Their beer lists are also outdated.  The first two beers that I requested (Dogfish Head 90 minute and 21A Bitter American) were not available.    I hate to give it 3 stars centered around the beer itself, but it is claiming to be a wine and craft beer bar.  It is not living up to that name at all.  I'll definitely be back, but I hope they remedy these easily solved issues.", 
    "review_date": "2011-07-09"
  }, 
  "M271Ac7UKVaQ9U5AOvc_9A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicky L.", 
    "review_text": "Ways to make a single gal severely disgruntled:  1) Dress in ill-fitted clothing on a date. 2) Be a really bad conversationalist. 3) If you're the bartender, be really snotty. 4) And also make sure you ignore us/me, especially when I'm trying to flag you down for the bill so I can peace the eff out.  I wish my first impression of The Pour House wasn't so poor (hah!), but fear not, I haven't been scarred for life.  While it's a bit further up Polk St. than I usually wander, the cozy atmosphere and good selection of wine will definitely beckon me back sometime when I'm with better company.", 
    "review_date": "2011-07-13"
  }, 
  "YCDHX3nLqdF8OgIHmTJ0xQ": {
    "user_rating": 1.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Ashley S.", 
    "review_text": "We came here one Saturday with a group of 5, and the bar was just starting to get busy, however, they only had one bartender working.   We waited patiently for 15 min, then he finally came to get our order, and was extremely rude with his words and  body language.  I think he was frustrated at the fact that his colleague had not shown up yet, however, no reason to take it out on the customers.  In addition, I went to pay with my Am Ex, and he threw my card at me, and said they didn't take it.  We will never be back here!   He didnt deserve a tip, however, I didnt want to stoop to his level. Worst experience ever, especially when there are so many great bars to hit in San Fran!  I'd pick a bar closeby like Fly where the staff is nice!    Get a new bartender!   Wine is average here too...And I'm in the industry.", 
    "review_date": "2014-08-07"
  }, 
  "coIacPwpaookf9ApUG23mA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Summit S.", 
    "review_text": "An unassuming place right off of Polk. In an area inundated with bars, this place is a good break from the norm of rowdy atmosphere elsewhere.   This review will be short since others have pretty much covered all the points I would've mentioned in my review. The place is not for you if you like to talk loud and curse during normal conversation. For goodness sake, this is a Wine bar, not a tavern down somewhere in a small town. Be careful not to offend regulars and others nearby. They WILL ask you and your party to leave. So keep that in mind.  The bar area is pleasant with more tables around the back and towards the front. They do have high tables towards the left wall as you enter. The back area is for larger groups or quiet meetings. I got two flights of several wines. Both were filled rather generously. So I was happy about that. Other wine bars tend to skimp on quantity and believe me; when it comes to my wine, I'd rather have a couple of more sips!   Since it was dim, didn't take more pics. But if I'm in this part of the city again, I'll definitely go here again.", 
    "review_date": "2014-07-31"
  }, 
  "1A-geB-PQr1uveSFOS7Feg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachael S.", 
    "review_text": "My husband and I are huge fans of Amelie; when we stopped in on a Saturday night, we sadly realized that a large group was celebrating a 30th birthday, so there wasn't an open seat in the place.  As such, we ventured down Polk Street to the Pour House.  Compared to Amelie and other similar wine bars we've been to, this place doesn't stand out.  The ambiance, wine/food selecitons are nowhere near that of Amelie in particular.   That being said, it's still a good \"back-up\" option in Nob Hill if Amelie is super crowded (which has been the case on a number of occassions).  My husband and I both did flights (it's cheaper if you do the \"couple\" wine flight).  I can't remember which wines came in our flights, other than the fact that they had a sparkling and two reds.  Regardless, none of the wines were spectacular - I particularly didn't care for one of mine at all (my husband helped me with that one).  I wouldn't call myself a \"wine snob\" - but I done see the point in wasting time on bad wine.  If we come back, I'll be more selective in my wine choices, and skip the \"pre-chosen\" wine flights they have to offer.", 
    "review_date": "2014-02-10"
  }, 
  "tTJHsr0FQrajq1BgsID_GA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J H.", 
    "review_text": "Usually this is a great, low-key, and easy going wine bar. One star for the ambiance, and one star for the quality of the wine. However, this time we went there on a Thursday evening, and it seemed great to begin, as there were only 5 other people there, so we felt like we practically had the entire place to ourselves. There was a female bartender, whom was heavily flirting with two guys at the bar, just 4 bar stools away from us. Usually I am cool with such things, so we waited patiently for them, hoping she might find a way to politely excuse herself to take our order. I waited until she served them, and after waiting another 5 minutes, I politely raised my hand, and gestured with a friendly smile that we were ready, she looked me in the eye, and turned away to continue her conversation, as if we were lepers. After several more minutes, I tried to politely catch her attention in the same manner, again, not even an acknowledgement of our existence,  although she looked me directly in the eye. By now about 15 minutes have gone by, and a couple walks in, and sits at a table against the wall across from the bar, and they sit patiently waiting as well, and the bartender continues her flirtatious conversation. The couple gets up, and walks up, and has to interrupt the conversation to get the bartender's attentions, and in retrospect I probably should have done the same, but I try to take the polite, and gentle approach, especially when the bar is so slow. The bartender reacts to the couple with a whole lot of attitude, and a very rude look, but at least they seem to have managed to get the bartender to start doing her job, and they receive their wine. Silly us, we thought that she might realize at that point that there were other people, like us, still sitting there at the bar, very close to her, whom were still waiting to order, and we even tried to flag her down, as she served the couple, but no, she jumped right back to flirting with the guys. After 20 minutes, I was waiving my hands in the air, and leaning over, so I was behind the guys, and there would be no way that she could continue to ignore us, and pay attention to the guys, without being distracted by me. After she let out a hipster huff of frustration, she finally came over to us, and instead of making any effort to reconcile the obvious error on her part, the first thing she said to us, is in a snotty tone is, \"there are a lot of other people I have to serve here, who ordered before you, want do you want?\" Wow! So, even though the other 5 people already had their drinks, and were not asking her for anything, and the couple that came later and asked her for two glasses of wine, were a lot of people to be occupied by? I can understand when a bar is busy, as I grew up working in family hotels, and restaurants, so I have a great deal of empathy for anyone in this industry, but the fact that she blatantly ignored us, and gave us, and others, so much negative attitude, and clearly ignored her job in favor of trying to hook up with someone, is simply inexcusable. It was slow enough, that she could have very quickly taken our orders, and gone back to hitting on the guys, and we would have been cool with it. We would have been able to relax with our wine and dive into our own conversation. Instead, we received horrible service, a BS excuse with a lot of entitled negative attitude, and very small pours in retaliation for politely asking to order, and I know this, because we have been served wine there many times before.", 
    "review_date": "2015-01-17"
  }, 
  "8_APo4b5Y2lDlP681zvROA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rylan C.", 
    "review_text": "Probably, my favorite wine bar in all of San Francisco. I know this place is relatively new but I like the vibe. I like that they feature certain wines and make you expand your horizons when it comes to choosing new wines. The bartender was really nice and a great conversationalist. He was more than willing to discuss each wine and gave great recommendations.  I consider myself pretty educated when it comes to wines but even I left this place being able to learn a thing or two on wines I've never really tasted before.  I would come back here because I love being able to drink wine while watching the Giant's game.  I recommend this place!", 
    "review_date": "2011-07-16"
  }, 
  "qzC9lkSTjNcPfIi69pHDxQ": {
    "user_rating": 5.0, 
    "user_location": "Nob Hill, San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "Thomas is the best bartender in town. Suggesting great wines, live music, this place is a gem. Each night they have live music (piano) and it's dog friendly.", 
    "review_date": "2013-09-10"
  }, 
  "4RUXeyp_Af2C5t9JFyJlBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina Y.", 
    "review_text": "Great bartender.  I didn't love anything that was on their list of white wines and the bartender recommended a moscato. I'm a sweet wine kind of girl and this was delicious!   Wines on tap, beers and all sorts of wines on Polk Street. So much classier than some of the places just down the street.", 
    "review_date": "2013-11-12"
  }, 
  "CX9Ho8E8GAPgjVSxfGLUHQ": {
    "user_rating": 5.0, 
    "user_location": "Ingleside, San Francisco, CA", 
    "user_name": "Karen J.", 
    "review_text": "Great staff! This one lady was very nice and assisted us with the menu. I know I might be deceiving by my young looks but it was funny how she asked if me and my friend were 21 yet. :P great interior with awesome furniture, those barrel tables and beautiful candles gets me!", 
    "review_date": "2014-11-25"
  }, 
  "kk2oFTBSU9C2XshIVU7tXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassandra J.", 
    "review_text": "A friend and I came here while bar hopping through the city. A glass of wine each and beer for him after, we were nicely warmed up before heading on elsewhere.   The bartenders were attentive and on the ball, taking our order quickly and also providing some feedback when asked questions about the wine list. There's a good selection of wine and beer, plus good quality munchies and snack foods.  While we were there early, it filled up pretty quick. It's a narrow room so it's a bit difficult to get around the crowd of people. I gave up trying to get to the bathroom when the people that were standing in front of the doorway didn't bother moving despite me trying to get through.   The music was a bit loud at times too, and a bit difficult to hear conversation around. A wine bar would seem to imply something a bit more fancy and high end, but it's kind of a *bit* like a dive bar, albeit a bit fancier.  Not a bad place to stop for drinks.", 
    "review_date": "2012-04-02"
  }, 
  "4uqj7PqVlcGdZDjUlyLRwg": {
    "user_rating": 5.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Molly W.", 
    "review_text": "Went here yesterday afternoon and ordered a bottle of bubbles for 3 of us. They didn't have the sparkling rose so we ordered the French brut. The bartender then found some rose that was open and gave us a free glass. My husband was also happy as they had a great selection of beer and huge beer glasses. I also left a bag of british food (marmite, teabags, etc from the british shop down the road) there and the bartender was very friendly when I called and has put it aside for me to collect.", 
    "review_date": "2013-03-31"
  }, 
  "fofXRdOeujljGqmna4JTrg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Daniel M.", 
    "review_text": "A buddy invited me to get drinks here at the Pour House yesterday. If you know me, you'd know how much I hate driving to the city. Very few things are worth it for me. The first is going to Giants games. The second is driving by the stadium and wishing the Giants were playing during the off-season. And now, there's the Pour House.  They have a good drink menu here. Because I don't know my way around good wines quite yet, I was actually looking at the menu in confusion. The bartender probably saw the dopey look on my face, so he recommended the Red Wine Flight. 4 generous pours of their best red wines. Needless to say, they were all very good.  They've also got beer here, which is an instant plus for me. Unfortunately, they were sold out of the Dogfish Head when we visited. My friend and I were extremely sad. But the Duvel was a decent substitute.  One other thing, if you ever get hungry, you can actually order food from the Thai restaurant up the street (Chai-Yo, I think it was called). And they actually BRING IT TO YOU while you're at the bar! Again, win-win for both businesses.   The bartender for the night (Nelson) was a very awesome dude. Giving good recommendations and always willing to help out his customers. A winning attitude for any business, in my opinion.  Overall, I WILL come back again (once I find some friends who know how to appreciate wine). Great service, good drinks, even better buzz. They even allow DOGS in there! Always awesome.", 
    "review_date": "2011-07-10"
  }, 
  "TknGTatZq_ABSuiNjuR0Gg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess K.", 
    "review_text": "My favorite thing about this place is your ability to sit and enjoy a wine flight while the thai place (chai-yo) next door brings you food on nice plates.   The bartenders I have had here have been pretty good. The wine flights are great and not too pricey, and its a cool intimate setting. They sometimes have someone playing the piano or some music in the back, which is a nice addition.   If planning a night here, you may want to call ahead and check as they sometimes have events... I have happened upon two speed dating events. This kind of takes up the space, so in the future I will call ahead to make sure its not one of those nights.", 
    "review_date": "2013-12-17"
  }, 
  "JWrONUccWS-RexScWSPWxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark N.", 
    "review_text": "Excellent service, with out the attitude of a Mission bar. Great place to meet someone for a first date. Not too loud and seating options include relaxed seating in the back if the bar itself isn't your thing.", 
    "review_date": "2014-04-09"
  }, 
  "g-wssBxG2znpJVKZE2N-lA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Natalie M.", 
    "review_text": "The pour house has some great wines; it's casual and a great place for a group get together. I had a couple glasses of the pinot noir, it was delicious. The bartender was very nice and easy going. I think this is a great and low key place to go for some great wine if you're not quite in the mood to sit at a table and deal with snooty waiters.", 
    "review_date": "2012-03-27"
  }, 
  "v-kh_W7iWpKOIux2Gx2q1g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah T.", 
    "review_text": "It's a mellow and approachable spot with generous pours.  Couches are comfy. I'd go back. We would have stayed longer, but they were out of cheese!", 
    "review_date": "2011-03-06"
  }, 
  "FVbtQgcCmWmQ-D6IR5BfZg": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Jessica L.", 
    "review_text": "Yep - very very similar to SNOB bar (what it used to be) but a little more hipster rather than nice wine bar.    The flights are great and a deal at $12 for 4 pours. I do wish the bartender knew his wine better.... It felt weird to ask him questions and he be so un-imformed.... dude, you are working at a WINE BAR -know SOMETHING about wine....\"the grape starts with a T I know that...\" wow.  I got over it - its a good vibe in here. Drink wine and be happy. The wines are NOT super upscale awesome - just plain good. And that is perfectly fine with me.", 
    "review_date": "2011-03-27"
  }, 
  "9kb3j5CuU1zTOHcZ9WlKNg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cher E.", 
    "review_text": "I just discovered my new favorite wine bar in the city. It's so refreshing to find a place on Polk where you can listen to great music while still hearing yourself talk, all while enjoying great wines for a reasonable price.   They are very generous with their pours and let you try anything before ordering a glass. The owner, Liam, was funny, engaging and so appreciative of his clients and the bartenders were attentive and very friendly. There was no pretentiousness like you find at so many other wine bars and we felt like we were really taken care of there.  They do close around midnight, so it's not a great late night place, but it's the perfect spot for a mellow evening with friends or a date. This is definitely a gem in Russian Hill and I will be coming back often.", 
    "review_date": "2011-05-08"
  }, 
  "--5MV_3EqmQinXwJPNI2fg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike Z.", 
    "review_text": "Have been here twice. We really like the cozy vibe and welcome feeling we get when there. It's a wine bar and have only had the wine and a cheese plate. I had a Cabernet Sauvignon first time and a red wine flight on the second visit. Service is generally friendly, sometimes a bit slow but always friendly.  They have a small area in the back where performers play on occasion.  High point: good prices and good wine and cheese Low point: sometimes slow service. Chances we will go back ? Yes and already have. I can see this becoming a regular place for us.", 
    "review_date": "2014-08-06"
  }, 
  "1q0A8PTLysxWdnbJF5GThw": {
    "user_rating": 5.0, 
    "user_location": "Garden Grove, CA", 
    "user_name": "Sheila S.", 
    "review_text": "We had the owner help us with wine selections! He was great and funny. Made our experience here at The Pour House worth it!! We will be back. Thank you Liam!!", 
    "review_date": "2014-03-26"
  }, 
  "ZW31ZqLp_y_LbV7wSwNhag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie T.", 
    "review_text": "The Pour House is a lovely place to have a date and/or a hangout. My friends and I frequented this place on Memorial Day, in of which, it was one of the few wine bars on Polk street that were open and until midnight.   The girl working provided excellent service. She was attentive and quick and allowed my friends and I a couple tastes before buying a bottle to share. The wine selection could have been more extensive; however, we were satisfied with what we had. We also had an additional glass of their sparkling wine and Rose, which were both crisp and refreshing. Additionally, the atmosphere was great but maybe because it was a Monday night. They did have live music for a little while, which added to the relaxed atmosphere.   Overall, my friends and I had an enjoyable experience and appreciated the good service. I would definitely come back here again!", 
    "review_date": "2014-05-28"
  }, 
  "hSj4YSD8GyYQ_sMmiNGJng": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Noah A.", 
    "review_text": "Mellow atmosphere, decent selection of wine and small eats. Bartender working tonight has tried all the wines and offered her take on the wines. Every wine tried was excellent. Happily gave me tastes if I was unsure. Prices seems about right for the location and selection.  I will definitely return.", 
    "review_date": "2014-10-06"
  }, 
  "2FBhsogD9wrTk_7g6rf-6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J R.", 
    "review_text": "Short but tasty selection of wines (both red and white varieties). Large pours.     On-hand delivery menus compensating for limited cheese and cracker offering; next level wine-bar maneuver.    Comfortable atmosphere of soft easy listening music from Tom Petty to the Postal Service that allows easy conversation.   Very friendly bartender on my first visit who allowed a friend's dog to soak in the ambiance.  Not sure if this is standard.", 
    "review_date": "2011-02-21"
  }, 
  "FaaZlPb9Yk70uU-ElILDQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruba K.", 
    "review_text": "This place has become the official/unofficial meeting for my Sex-and-the-City-esque group of single SF city girlfriends (I think I'm the Charlotte of the group).  We always order the flights and sometimes we customize them to our liking.  They have a great selection of wines and great atmosphere and I recently discovered you can order Thai food and have it delivered from across the street.  It comes over quickly and it's pretty yummy.  We've had cheese plates at Pour House and those are good too.  Also, it's a great escape from the post-college crowd on Polk, a godsend when you are in this neighborhood and happen to be in the 30-and-Up Club.", 
    "review_date": "2011-12-28"
  }, 
  "qD7BCSxI74WxmLmEHnwNPw": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "chefboyardee b.", 
    "review_text": "Place is way more chill than anywhere else on Polk.  Syrah was tasty.  Accidentally left my laptop there and they took care of it overnight.  Pretty awesome right?  Highly recommend...", 
    "review_date": "2011-08-29"
  }, 
  "RSLRo5XvR3uN3_Uqfc9geQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "The wine is list is extremly unimpressive. I had a hard time selecting domething interesting. The flights seem thrown together based on what yhey r trying to get rid of. The bartender was not knowledgeable at all and didn't know anything about the wine he was pouring. There are cases of wine stacked on the bookcase shelves screaming, \"buy me, the owners got me at bulk discount and arnt afraid to show it\". The space itself is cute and intimate so its really too bad. The olives were old or something. I will not be back", 
    "review_date": "2013-03-23"
  }, 
  "YrbtycnG1D12-O3rWyk8qA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mao K.", 
    "review_text": "This is a great neighborhood wine bar.  It isn't pretentious and over-run by a bunch of wannabe wine snobs.  They have a nice selection, the bartenders are great and if you get hungry you can order Thai food from next door!  Go here if you want low key, ambiance, yummy wine and Thai food! :-)", 
    "review_date": "2011-10-12"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "For a wine bar, there isn't much of a wine selection. Maybe I've just been going to really extensive wine bars, but I was not that impressed with what they had to offer.   A friend and I wandered in on a Saturday night after reading a couple Yelp reviews and, not going to lie, the White Town blasting sort of drew us in. It wasn't very packed and we sat at the bar. 20 minutes or so later this wave of people came in. Mixed bag of folks. I didn't care for the bartender's attitude. He wasn't the friendliest.   Yeah, this place just didn't do it for me. Sorry guys.", 
    "review_date": "2012-01-09"
  }, 
  "en7bEkzUtMBcZBGrADW3Xg": {
    "user_rating": 5.0, 
    "user_location": "Palm Springs, CA", 
    "user_name": "Amanda S.", 
    "review_text": "Love love love the pour house! A great addition to my neighborhood.  I've been here plenty of times and what I love most about this is that the crowd can always very from trendy hipsters, art students, business folk, and the casual passerby. And everyone is treated with the same exact attention.  I came here for a birthday the first time I came and we sat in the big table in the back. Won't lie- a few of us were intrigued by the big ladder by the bar and tried our best not to climb up!   Service is always great, with very generous pours. The interiors have a very warm, comforting feel, without the fancy window dressings.   If you don't think you can afford Amelie, a few blocks up post, this place is a great substitute and I can pronounce half the list (never was too good at french).   Try it out! It's never been too crowded. Loves it", 
    "review_date": "2011-05-24"
  }, 
  "PJhX_wdn6CTWuPS5jhqsTQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Adrienne B.", 
    "review_text": "This just became my new favorite wine bar!  Their selections of wines are incredible and it is fabulous that they are willing to let you try a wine before you order it.  Ryan, the bartender, was the only one working last night but I never felt neglected.  He was always right there when my glass was empty to offer me another glass.  This is a great place to go with friends and especially friends who are not necessarily wine people but prefer beer as they have a bunch of beers on tap and in a bottle.  The other great thing is you can bring food into the bar from local restaurants, I highly recommend the shawarma from Frisco's Pizza and Shawarma.   Pour house does have some cheese plates available to order but I got the kalamata olives, which were absolutely delicious!  Ended up spending over 4 hours there and never felt rushed.  Total bill with four people, more than a dozen glasses of wine and more than 10 beers came to $91, pretty dang impressive!  Will most certainly be returning!", 
    "review_date": "2011-06-15"
  }
}