{
  "RQ1Qa2t0cCNYaf2onxxjnw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "neil c.", 
    "review_text": "The best place to watch the Washington Redskins this, and any season. We aim to be the largest and best 'Skins bar in SF by the end of the year. Please come out and see for yourself. We took this bar by storm last year and the owners could not have been any more pleased. They are by far the friendliest and most welcoming bar owners I have met in SF.  Go Skins! See you on Sunday for the Hall of Fame game against Indy. Kickoff is at 5PM PST.", 
    "review_date": "2008-08-01"
  }, 
  "2kIaaPrwYC6TGG620ZDgFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alan P.", 
    "review_text": "Awesomely chill, local neighborhood bar-- also helps that its just around the block from me.  It does have 3 LCDs if you are trying to catch the game, updated jukebox if you are trying to listening to the latest Katy Perry song,  darts and small outdoor space in the back.  Bartenders are great.  Nicole is awesome.  There is NO kitchen, bags of chips may be available.", 
    "review_date": "2010-08-12"
  }, 
  "wIToYOaSGbG0-c7VCsdJTw": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Sarah P.", 
    "review_text": "Are you a Redskins fan? Well you should be. This bar has the greatest group of Skins fans I've ever met in California.  Cheap drinks, free hotdogs, a section dedicated to the Redskins? I'm in heaven!  I'll be coming back again and again, but next time, I promise I'll remember to wear my jersey.", 
    "review_date": "2008-09-29"
  }, 
  "LZt80LbsfQ9kOz96H7c1bA": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Jessica N.", 
    "review_text": "Came here with a large group of coworkers after an event on a weekday and they welcomed us with open arms. We pumped the jukebox with music, and when we wanted to turn the music up they accommodated us multiple times! A lot of places would've brushed us off, so it was great that they hustled to serve drinks quickly and let us have a good time!", 
    "review_date": "2014-08-07"
  }, 
  "gFB-b7IeNR3leLq8q-qeGQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Kenny L.", 
    "review_text": "R eally chill place on a Sunday night E ven had free hot dogs! D arwin Coon, ex-Alcatraz inmate, bought us 2 pitchers     for being upstanding (and quiet) \"young people\"  J ust a relaxed neighborhood joint A vailable parking on the street C an play darts if that's your thing (though just 1 dart board) K indly leave your blazers and popped collars in the Marina...    kick back and chill!", 
    "review_date": "2009-01-18"
  }, 
  "p_hZ_KQS9Y0Gq637A3YbNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen F.", 
    "review_text": "Last Friday I got a call from from my friend Krista, who says \"Ghetto, get your ass down here!\"  I hail a cab and am happily on my way.  I was a little concerned, 'cause my friend sounded totally wasted and while I hate being \"behind\" in my drinking, I *love* having to catch up!    This is a lovely little bar. Krista called out my full name as I entered, which made me feel very \"Norm\" from Cheers (except not hella fat, or male, or white).  I didn't pay too much attention to the decorations, but I remember it was dark and wood-y and they have a little back area with picnic tables,  and Buddha and Homer Simpson figures.  You can smoke back there.  Ghetto like-y.    I will be back :D", 
    "review_date": "2007-05-29"
  }, 
  "XMPw095g3wiBaabzilp_Fw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brittney E.", 
    "review_text": "Mixed feelings for this bar makes me give it 3 stars. It's right around the corner from my place so its a good go to bar when I have a lot of friends over and we want to hit up a place that's not going to be super packed on a weekend.  However, the main bartender dude is very weird with drivers licenses. The first time I went my friend had just gotten his CA license and still had his old one - but it had a hole in it and he didn't bring his paperwork - ok understandable - its his fault for not bringing the temporary CA paperwork, so he was not let in.  The 2nd time I went in here - this happened AGAIN with another friend - but he had actually brought his CA papers - you know the ones the DMV tells you that you can carry around temporarily until your actual license came in as well as his old license. The bartender still would not let this guy order drinks - how ridiculous!  I'd still go back because its a fun bar - but too stressful for those kind of unnecessary confrontations.", 
    "review_date": "2008-12-03"
  }, 
  "FkiDKAYGGNIPQVdMe4JEXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica G.", 
    "review_text": "The other day I went on one my long pointless walks that go everywhere but nowhere in particular. After perusing tourist central (Pier 39), I wandered back passed the bus depot, looked left on Bay and saw Red Jack and mentioned that I had never set foot in there. Well, my traveling partner was inspired to do some extra exploring and in the mood for some liquid refreshment  (because it WAS 2 in the afternoon after all). So we put on our brave faces and got ready to set foot inside.  Ok, first off, \"People Love Us On Yelp\" sticker=good sign. Ashtray, out front; another good sign. Meet a former Alcatraz inmate and buy his book? Well now we're talking! The flat screen that features random Youtube clips AND Yelp reviews, darts and Red Sox paraphanilia all about, a chalkboard promoting (even more) affordable drinks--all good.    But when I see an establishment that has (a) an Old School standup Pac Man game, (b) the '94 World Cup pinball game (featuring the goalie, the dog and 75 cents gets you 5 balls!), (c) a covered outdoor smoking patio with about 300 ashtrays strewn and (d) sparkling, snappy commentary/ conversation with locals and the bartender, well then you get a place as comfy as my Yelp elite sweatshirt! Cheers!", 
    "review_date": "2008-05-02"
  }, 
  "T6SuLkeGko0shJacHYWq6g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate V.", 
    "review_text": "Hit this bar after work with some friends.  Nice place and good drink specials.  Sam Adams are only three bucks when there's a red sox game on.  A good bar for a rainy day or whenever there's a game on...", 
    "review_date": "2007-06-14"
  }, 
  "H-VYDTGKrGiK0NDJ-XhZzA": {
    "user_rating": 4.0, 
    "user_location": "Belo Horizonte, Brazil", 
    "user_name": "Lucas M.", 
    "review_text": "This is an awesome sport bar in the best American style. There are 4 (or 5) TVs there, and all bartenders are great! I was very pleased to meet Lori, the owner, who was a very kind person! I truly recommend this bar for hang out with friends on any day in the week. I'm marking this as a 4-star because I really think would be awesome to have some live music there, but even they have a really REALLY good jukebox there! I really appreciated all time I spent there! Recommended!", 
    "review_date": "2014-04-13"
  }, 
  "pdilmEaeXuntV4eTnc9KcQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kev M.", 
    "review_text": "Oh man.  I'm embarrassed to have gone here so many times that they know my drink and know to include the lime.  A fun dive when your friends don't have to drive to get home.  Free dart board to challenge the dude at the board who thinks those fancy winged darts he bought are going to help.  I brought Dan, sucker. But am I the only one who feels the weird vibe in this place?  Maybe when I go in without the necessary blinding intoxication, it feels different. They have the digital jukebox that downloads the songs, so the selection in that thing is great, but its 2 credits per song and 2 credits cost a buck, so I played the new Wilco just a few days after it's released, but I paid a buck a song.  Which, well, after spending who knows what on drinks, why am I complaining about the convenience of the tunage? Oh, Red Jack.", 
    "review_date": "2006-01-16"
  }, 
  "rbPJO1Mc5ddzgucXelSQ0g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony L.", 
    "review_text": "I am noticing a sad pattern here. First the Buena Vista gets a 5er and now the Red Jack Saloon gets a 5er. Both bars...Coincidence? I don't think so!  I LOVE YOU, MARK! And I really love you, Laurie, vivacious bride of said Mark. Both are from the New England area, I believe. Or maybe they just like the Red Sox. But if you like the Red Sox and live in San Francisco, then you must be from New England. Yeah, that makes sense. These two are the coolest vegetarian bar owners I know of. Well, the only vegetarians that I know of that own a bar.  I knew this place existed. Hell, I pass by here every so often. Just never went in for a drink. Until one night after work, a bunch of co-workers dragged me with them on their drinking adventures. I was game, thinking what can go wrong? I live in the North Beach area so I can stumble home no prob if I got sloshed. Funny thing is I was freaking buzzed that night. I remembered everything that happened. I know I went home to sleep for an hour because I had another shift in said hour. And I know I woke up late for work. The funny part is I actually clocked in on time...Anyone wanna try to explain that to me?  Anyways, the bar has a great atmosphere along with great bartenders. Nick and Nick are awesome. I know there are others but I always somehow end up with either Nick or Mark. The jukebox is internet ready so they have fresh music along with some moldy oldies that go great with too much drinking. And North Beach pizza knows where this place is in case you wanna go and order a pizza instead of walking a couple of blocks to Safeway to buy something cheaper. Oh, and if you ever have a need for a taxi, they have them memorized for you and will call them as well. Courtesy service at its best.  So Red Jack, you ROCK! Even though I am in the Sunset now, I will be back to conquer your bar in due time...Like after major surgery...Alcohol and surgery don't really mix well...", 
    "review_date": "2008-04-25"
  }, 
  "s8d3UuwSb0zEebS8hZHdNg": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Jamie F.", 
    "review_text": "If you find yourself in the Fisherman's Wharf area of San Francisco and in need of a cold adult beverage, there is no need to pay tourist-trap prices. Just hit the Red Jack and you'll be pleasantly surprised (and well taken care of).  We made the mistake of going to a bar on Pier 39 for a beer on Saturday night, just because there weren't many other options we were aware of. After paying over $10 for two Coronas (!!!), I got on my iPhone and looked on Yelp for other options. Turns out The Red Jack was only about three blocks north of the pier and thankfully outside the touristy area.   The Red Jack has great \"curb appeal,\" as it's located on the ground floor of an old apartment building. Inside, it has lots and lots of charm. We sat right at the bar and were very happy to learn that the beer special of the day was Widmer Hefewiesen draft for $3 a glass!  Being from Portland, where Widmer is brewed, (and which also happens to be one of our favorites) this was indeed a nice surprise.   The bartender was a very nice young woman who took good care of us. She was friendly and engaged us in conversation throughout the night. The bar has a dartboard, pinball machine, a great Internet enabled jukebox (so you can request just about any song), and a bunch of board games you can take up to the bar (which we did).  Another nice surprise was the OTHER drink special of the night, which was the house Bloody Mary for $4.25. I'm not a big bloody mary drinker, but this one was really good and quite spicy. I may be hooked.  The bathrooms were small but clean. They have a nice outside patio with a wall painted to look like Fenway Park's \"Green Monster.\" It was a bit too chilly to sit out there, but it was an appealing space.  Unfortunately, we found out last night that the Red Jack is in danger of closure due to complaints from neighbors about noise. What kind of jerk moves to a neighborhood with a long-established bar like this one then is surprised that there's \"noise.\" Idiots. Anyway, hopefully the RJ's loyal local clientele can save the place. It's a gem.", 
    "review_date": "2010-06-06"
  }, 
  "FI0dcCAuFmW0lutdKO2UwA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle K.", 
    "review_text": "Was back in this bar the other night and realized after leaving that my 2 star review contained one too many stars.    This place sucks.  And the owner has the biggest mouth I've ever heard on a human being.  Dude, we can hear you and your retarded Chowda accent!!  Now STFU please.  Orig Post:  So so dive bar that's falling apart &amp; filled with people from Massachusetts who get belligerent during all pro boston games.  It' not completely without it's charms though:  as there's a darker skinned inattentive &amp; seemingly stoned female bartender here that outgrew her jeans about 3 years ago.", 
    "review_date": "2012-03-06"
  }, 
  "bT0zEuQIxTqt5kQiDmcZGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maec W.", 
    "review_text": "Great place. Good selection of beers on tap. You can't expect every bar to have every micro you want but they do a good job of having an excellent selection.   Seems to be a locals place as everyone there seemed to know everyone else, but they were all very friendly.   Mixed drinks are stiff. That's a plus and the bartenders and owners are very nice people. Another plus. I can't stress that enough. The staff here are really very friendly and helpful.   On Superbowl Sunday they had a lot of fun stuff going on and everyone was having a good old time. They had a BBQ to raise money for  cause and everyone was enjoying themselves.   This is a place that I would go to if I was meeting up with some friends later in the night and I wanted to get a drink, kick back, watch some sports and lounge until it was time to meet up.   I would call it a neighborhood bar rather than a dive bar.   Recommended.", 
    "review_date": "2009-02-08"
  }, 
  "R4zWWQVBqsLxgmqSQvbBQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miguel V.", 
    "review_text": "I am a big fan of The Red Jack Saloon. Its been a while since I have been in to hang out, but its a great place to Throw back a couple with a few friends. If you are a Patriots or Redsox fan even better.  There are plenty of TV's to catch whatever game is on. Dart Boards, Juke Box, and a patio in the back for all you smokers out there... The owners are awesome and can't wait to have you stop in for a drink, or two, or three...haha", 
    "review_date": "2010-02-23"
  }, 
  "aYK7-dZGfaEymuZlF6ukTQ": {
    "user_rating": 5.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Shawn S.", 
    "review_text": "Such a great bar.  Wish I lived closer to this place.  perfect place to watch the Red Sox play.  Owners are awesome and the drink specials are even better.  Just wish I lived closer.", 
    "review_date": "2009-08-25"
  }, 
  "aM3T4jeHY_fswn6xQ41rtw": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Nick D.", 
    "review_text": "A true dive bar.   I happened upon this place as I was wondering around. I stopped in for a few beers. The bartenders were very nice and friendly. The bar itself was kind of cool too.   The \"Dive\" part is the clientele. Not a group I'd want to hang with. I was there in the late afternoon on a Friday, so probably just as happy hour crowds started to assemble. Maybe it got a little better later in the night. Probably a good spot to watch a game on a Saturday or Sunday afternoon though.", 
    "review_date": "2013-07-17"
  }, 
  "s28u2TLwXpUaZbRoMAMmFQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Charlie Y.", 
    "review_text": "A neighborhood place to get hammered, that much is certain. I was staying close by in North Beach so it was great to find this place for nightcaps and various mid day beers as well. They've got specials every day and the people are friendly. Guinness on tap and some decent micros, mixed drinks poured with a heavy hand as well. It's a really cozy place with the patio designed to look like the green monster, so I suppose it's a Boston joint too. Pinball, board games, and HDTVs are available for funz.  This is an awesome place to go if you're in the area and need a beverage break.", 
    "review_date": "2009-01-03"
  }, 
  "z-oO1tVXUwLt8G1NDZwWDQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren F.", 
    "review_text": "In the spirit of true dive bars, this place has no \"busy\" night. One Tuesday it'll be slammed, the next it'll be empty.  Strong drinks, great Jukebox, full of regulars.", 
    "review_date": "2010-08-26"
  }, 
  "L2X-a5KWRPhCp62rqBroSQ": {
    "user_rating": 5.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Pascal C.", 
    "review_text": "Best bartenders. Good drinks. Bar games. The bar of bars.", 
    "review_date": "2006-12-06"
  }, 
  "S8E1QGF0Gt070yNesDvJzw": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Allison P.", 
    "review_text": "Total dive bar on Bay in North Beach.  Definitely a neighborhood watering hole kind of feel.  The drinks are pretty cheap.  The staff is always really friendly and they bought me a drink last time just because I told them my birthday had just past.  That's what I'm talking about.", 
    "review_date": "2009-07-16"
  }, 
  "C62BYQbGa3pqV-I0IZMrVg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Barbara S.", 
    "review_text": "I stop here every time I'm in the city. As a Red Sox fan I feel at home when I walk in here. Love the green monster on the back porch.  I love neighborhood bars (not a club person) and this place is warm and friendly, even to those obnoxious Yankee fans that occasionally stumble in.", 
    "review_date": "2009-04-19"
  }, 
  "Rn5Cmlho4E8CsaRcelWpSQ": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Nicholas C.", 
    "review_text": "Great little dive. Could use a shuffle board but STIFF drinks. Pretty low key and chill. Totally comfortable for a Friday Night.", 
    "review_date": "2009-01-17"
  }, 
  "K-G86eGOmg4Yec0VPFtzVA": {
    "user_rating": 5.0, 
    "user_location": "West Los Angeles, Los Angeles, CA", 
    "user_name": "Manda C.", 
    "review_text": "Great place, great people and a great afternoon spent playing darts and bullying the jukebox.  I stumbled across this place with my boyfriend after a chilly trip to Alcatraz. We stopped in for one drink to warm us up and ended up staying all afternoon and into early evening. The owner and bartender were incredibly friendly and the regulars were also really welcoming.  Try the hot buttered rum!  I will absolutely be going back here next time I'm in the area.", 
    "review_date": "2012-12-17"
  }, 
  "D7NZNM8GzFJhuQiisFFdWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn O.", 
    "review_text": "I love this place, it's perfect for the casual friends last minute hang out. We started Katie's good-bye drinking party here...what a night!", 
    "review_date": "2006-02-10"
  }, 
  "pWj1ET9H9L8g-m2Gp9_sFQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen S.", 
    "review_text": "Not anything too special, although the bartenders were really nice.  I dont know if it was just because it was St. Patrick's day but the other patrons in the bar were really creepy, to the point that one couple of guys had to get kicked out because they wouldn't stop bothering us.  After that happened the girl that kicked them out told us that we shouldn't have enticed them with our sexuality, whatever the eff that means.  I had fun because it was my best friends birthday, but not a place a would hurry back to return to.", 
    "review_date": "2009-03-19"
  }, 
  "hrWnftKtSg5kOlMkMUW0cQ": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Christine L.", 
    "review_text": "A homey little neighborhood bar.  I used to live near this place, have walked past it a million times, but never went until I came back to SF to visit.  Came here with six friends for drinks.  They have a great (modern) jukebox in the back (where you can blow a ton of money spending 50 cents to $1 per song).  They also have a great dart board.  Bartender was very friendly and the people there are an older crowd that I'm guessing live in the neighborhood.  I was too drunk by the time I got here so I didn't get anything with alcohol... but a diet coke will you run you $2.   Two bathrooms in the back and some TVs around.  It's a little too grungy in here for me, but it was conveniently close to my friend's place.", 
    "review_date": "2013-09-17"
  }, 
  "NAVcjWhzqyaLtPbuBIP5Tg": {
    "user_rating": 5.0, 
    "user_location": "Mar Vista, CA", 
    "user_name": "Angelica C.", 
    "review_text": "They treat you like family here! Such a great vibe, and the happy hour specials are awesome!  Such a great neighborhood bar.", 
    "review_date": "2014-10-09"
  }, 
  "WfPV_EQUZOzoSHLLJkiY0g": {
    "user_rating": 4.0, 
    "user_location": "Kenton, Portland, OR", 
    "user_name": "Christopher W.", 
    "review_text": "My brother-in-law says, \"greatest place ever, wonderful toshiba televisions, and it's wonderful that the Reds beat the Cardinals today!\" After slamming 4 beers he advises 5 stars but my mother-in-law says that the diet coke tastes like regular so consequently only 4 stars.  Decent selection of beers, good atmosphere, and friendly locals.", 
    "review_date": "2013-09-02"
  }, 
  "mt-QlOpBbwy684mWuV03Sg": {
    "user_rating": 5.0, 
    "user_location": "Mesa, AZ", 
    "user_name": "Meredith R.", 
    "review_text": "My husband and I were looking for a good local bar while we were in SF for the half marathon this past weekend. We looked up what bars serve Black Butte Porter and Red Jack Saloon came up and had great reviews so we checked it out. It was the best bar and we were sad that we found it on our last night. The owner was so nice and welcoming to us.  We felt like regulars. The service was awesome and the beer selection was great. I would recommend this to anyone looking for a fun and friendly bar .", 
    "review_date": "2014-04-09"
  }, 
  "27_1pIbcOt8LS7gYbruMMQ": {
    "user_rating": 5.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Hannah M.", 
    "review_text": "We had the best time here!! We're from LA and had finished a scenic tour to Alcatraz when we realized a bunch of great games were on. We walked over to Peir 39 for Clam Chowder and were HORRIFIED by the tourists!!! I immediately got on Yelp mobile to see what other places were walking distance. Thank you Yelp!! Red Jack's is only 2 blocks away... and pretty much AWESOME!!  Laurie was bartending and after 45 minutes I could tell she had some sort of ownership in the place. You just don't come across friendly service like that often. I was talking to my husband and mentioned that my phone was going to die. She asked if it was an iphone and let me use her charger!! (I don't think this is available as a regular service) How nice is that!?!?!?!?  We played all sorts of games; darts, jenga, Simpsons pin ball, connect 4, some funny board game. They have a digital juke box and a sweet vibe. My husband said his drink was quite strong. (Which makes him happy!)  I can't wait to go back to SF and hang out with my new buddies while swigging a Guinness! :)", 
    "review_date": "2010-12-03"
  }, 
  "q49KYrts_SI8nekGHB6Ydw": {
    "user_rating": 4.0, 
    "user_location": "Albany, NY", 
    "user_name": "Jessica M.", 
    "review_text": "Stoner Trivia!  A real dart board!  A mysterious backroom!  XMas decor the day after Thanksgiving!  This place is on it, man.    I think someone said something before about a strange odor.  I am aromatically sensitive and I didn't detect anything out of place from any other dive pub.    I couldn't help but wonder how many couples have gotten it on in the ladies' room- mirrors everywhere.  Strong and inexpensive drinks, a lot of board games.  This place was a comfortable departure from hipster nay-shun.   Heart it.", 
    "review_date": "2006-11-28"
  }, 
  "pZAktka6VfcXmUf4lWlBJQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn G.", 
    "review_text": "I used to work in a building in the Wharf and know that there are very few places that cater to the non-tourist crowd. Red Jack Saloon is one of the exceptions. The place is laid back with decent prices and isn't terribly crowded. It does the trick for the after work needs.", 
    "review_date": "2007-02-03"
  }, 
  "EUDuSd11Fhxm6ioLgvxFEQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert R.", 
    "review_text": "Are you stuck dragging some out of town friends around town, and now they have you out at Fisherman's Wharf?  Head to the Red Jack on Bay Street and grab a cocktail or five at this unpretentious bar.  The bar is no frills, but the drinks are tasty.  Extra points for the killer jukebox selection.", 
    "review_date": "2005-08-26"
  }, 
  "rURKzQIN5FJqjdQsO0wghw": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Aaron F.", 
    "review_text": "Way better than anything on the wharf,save yourself from the tourist trap and take the 5 minute walk over here. Bloody Mary specials on the weekend too!", 
    "review_date": "2014-11-01"
  }, 
  "dGy6LmfgfJyftpcHVkPtEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "Coooooooool place.  This was stop 3 or maybe 4 on Tom's adventure and explore night. I was a few beers in with a few shots on top but I remembered enough of this spot to make a little Yelp review.   I like the feel, it was cool and had a nice 'corner bar' feel. The music was the jukebox which was a nice change of pace.   They had drink specials and good beer available so all the boys were happy. I think I was drinking beer here. I recollect decent service plus they had darts! Wheeee!", 
    "review_date": "2012-03-03"
  }, 
  "4Hygl6-p6xW90wND_3c87A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Florence l.", 
    "review_text": "love laurie, mark nd shauna.  Fantastic people and great bar!  GO PATS!", 
    "review_date": "2012-09-30"
  }, 
  "37_7NdoFrLCf21ZQmzehTw": {
    "user_rating": 5.0, 
    "user_location": "Palmdale, CA", 
    "user_name": "Harlow H.", 
    "review_text": "Awesome bar!!! Owned by Mass. natives and now live in San Fran for 15+ years, very pub feel.  Great drinks, the owner is amazing and even recommended 21st amendment by the giants stadium for a next bar on our trip. Very cool.   We were lost trying to find it since it's a bit of hole in the wall and someone across the street told us where to go. Thank you stranger! We had a lot of nice strangers all over the city help us LA people get around.  Thank you San Fran and thank you Red Jack Saloon owners!", 
    "review_date": "2014-05-12"
  }, 
  "1m4Hmm7IbgGjVupM7CQSMw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki M.", 
    "review_text": "This is my new favorite after work bar. It has lots of things I like. A nice bartender, a jukebox with booty-shakin music, darts, connect four, a patio, longboard lager, uno with dogs on the cards, and a former convict from Alcatraz. hearts red jack.", 
    "review_date": "2007-03-18"
  }, 
  "FPpqG9eN1KHQPS3EjDvLVw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "If I could only take stars away from reviews I would knock them down from a 4 to a -3,   Went out with my coworkers after we had all gotten off. We work in the area so we started off at Kennedy's for happy hour then moved here for stronger drinks. This is the dive bar that dive bars workers go to on their night off. The bartender was rude, aggressive and extremely gruff, the place is small and empty but with an odd issues of not having enough tables and chairs for the amount of people they get.  Their \"credit card machine was down\" all night, but lucky for us, there was an ATM tucked in the back with a lovely $3.50 charge. There's no music playing unless you pay for it at the juke box in the back, but even then there's nothing but the speakers it came with.  Suddenly $10 cocktails at a place that takes cards, plays musics, has enough room for me and my party and has staff that's polite isn't so bad since I ended paying around the same amount anyway.", 
    "review_date": "2012-06-21"
  }, 
  "dP8SvAdF4QfNpKcHWHk--g": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "douglas B.", 
    "review_text": "How does this place not have five stars across the board!!! I would say some yankee fans reviewed it but we know they cant read and write. So i am not sure what the deal is.  I lived in Boston for 5 years and when I lived in NYC there were a handful of Boston sports bars that kept me from missing Boston too much.  I cant wait to watch the Red Sox, Celtics, Bruins, Revolution, cannons, wicked pats ... all the time. Look forward to going back again and again. For those of you that are not fans of wicked awesome Boston teams. They have nudie-touch you can play at the bar    ( megatouch).", 
    "review_date": "2011-05-13"
  }, 
  "W-EAivPyoazq_uj8kEqqkA": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Kris K.", 
    "review_text": "Gotta love it!  Great bartenders...  Great Drinks...  and games!  All it needs it a shuffle board table.  It is handy also since my guy lives upstairs!  Cheers...", 
    "review_date": "2009-04-15"
  }, 
  "w8IvgZkVIXh81LcjvaXDgA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Felipe L.", 
    "review_text": "They didnt let us in the bar because we didnt have our passports. First time I see this kind of restriction, I showed my drivers license but didnt help. Such an idiot restriction.", 
    "review_date": "2012-03-06"
  }, 
  "EUUYL8lNzEfQ0_ifYLlyNg": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Tom T.", 
    "review_text": "Very accommodating bartender, great drinks, and nice folks at this place.  Came here on a whim (thanks Yelp) and couldn't be happier!", 
    "review_date": "2012-03-04"
  }, 
  "WsFPESrI4uoUfhHEA0T55A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rashid n.", 
    "review_text": "Cool neighborhood bar just a few blocks from the Pier.  The type of place after just one or two visits the bartender knows your name and drink.  They also always have great daily specials.  The Red Jack Saloon defiantly has the right characteristics to truly earn all five stars.", 
    "review_date": "2010-06-30"
  }, 
  "JeIz1Nx0pdSwQhAv1HaK_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark B.", 
    "review_text": "Great place, great people!  Great if you're a Redskins fan!  Tip:  They open at 9:30am on Sundays.  And while they don't have a kitchen, they always bring in some sort of food to share.  It's a really great place with great owners and no ego.  Enjoy!", 
    "review_date": "2012-09-28"
  }, 
  "_wwscRn6y0SWq6niINQt4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lily z.", 
    "review_text": "i first moved to this neighborhood 2 years ago, saw the red jack and thought \"pfff...sports bar\".    On a friend's recommendation and physical dragging into, i've learned that this is a true san francisco find.  How wonderful to have a neighborhood bar where you can find that your neighbor (that you've mistaken for a sweet old man) is really a lascivious lush who will hit on your husband in the least subtle way possible, where you can play some erotic photo hunt only to have an incredibly friendly transvestite jump over your shoulder with her fake nails to catch the extra bra strap you couldn't find on the screen before your time runs out...  the bartenders are friendly and fun and i find a new friend every time i end up here.  i remove one star for the hangover i will inevitably have the day after...but i'll put it back to give it five as i can always crawl right home...", 
    "review_date": "2006-09-17"
  }, 
  "vbTAcO2YnUicYYALaRlBEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monica L.", 
    "review_text": "Great atmosphere. Loved the christmas decorations and the bartender was super nice!", 
    "review_date": "2014-12-01"
  }, 
  "L42LuHbJzMk4Q_jvbxGcaw": {
    "user_rating": 4.0, 
    "user_location": "El Dorado Hills, CA", 
    "user_name": "Patrick S.", 
    "review_text": "Visiting a friend who lived literally upstairs from the bar, every Sunday you can't not hear the fun going on at Red Jack.  I don't know who Jack is or why he was so red that they had to name a bar after him, but that's beside the point.  Finally last Sunday evening, my friend and I decided it was time to see what all of the noise was about.  Upon entering the saloon, Mark (the former owner) greeted us with a very fun, outgoing personality.  He bought us our first drink and maybe more because we drank at least 10 beers between us and the tab came out to $23.  Now THAT, my friends, is what I call economic stimulus!  They also included us in a round of shots, even though we were the only two in the place who didn't know anyone else.  That, my friends, is what I call Bostonian hospitality.  Everyone there was very outgoing and friendly with lots of great saloon personality.  All this and the fact that Darwin Coon, former Alcatraz inmate, frequents this place makes it a must for any passers by or locals.  The regulars are big time darts athletes.  I would have joined their league if I didn't live two hours away.  I would have given it 5 stars if there were more hot chics in there on Sunday night.", 
    "review_date": "2008-12-05"
  }, 
  "wz1_t7H_s7mOVeoIb7_qfA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Christian H.", 
    "review_text": "You know how sometimes you just crave a drink?  I was in the neighborhood on what was probably the only warm day we have had in the last, oh, YEAR or so &amp; thought it would be good to grab a margarita since it was Cinco De Mayo.  Except, oops, the door was locked when I got there.  Damn, I just became THAT guy who is first in line at the bar - it was 10 minutes before opening (1pm).    Having poured more than a few drinks behind a bar in my day, I know how annoying the early bird patrons can be.  Shawna wasn't annoyed one bit, though, and opened up the place early.  For ME.  I felt so special.    The Red Jack Saloon isn't a pretentious bar like many of them can be in San Francisco (not that I mind that scene sometimes also).  But if you are in the mood to go to a cozy place in a good neighborhood - this place is the spot.  There's a back patio with some tables beyond the bar...they say they don't allow smoking there, though, I'm pretty sure one of the bartenders was smoking when I was there.  Yeah, another one of those \"non-smoking\" patios - I happen to know a lot of those.  I will have to cruise back this way and see how good they can make a Martini - after 1pm, though, of...course!", 
    "review_date": "2011-05-29"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "In style.  Not so much: Ugly Christmas Sweaters. Quintessential party theme.  Definitely: Only $8 for a cocktail and draft beer.  Unpretentious and relaxed. Wear whatever sweater makes you happy. Let the cheap drinks take care of the rest.", 
    "review_date": "2012-12-15"
  }, 
  "YZpeOTE__yjjxk99OeSv_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "January P.", 
    "review_text": "Sweet eight pound, six ounce newborn baby Jesus, this place is the best neighborhood bar EVER (and it's not even in my neighborhood!).  It's not a glam bar, so if there's anyone reviewing this place that gets all snooty about \"ambiance\" they can kiss it.   Everyone is very nice, the atmosphere is really cozy, relaxed, and fun. Plus, they have games, a dartboard and a jukebox -- so you don't have to worry about a crappy DJ!  Plus plus, the bathrooms are impeccable! No one pees on the seats and there's always enough TP -- even when it's busy.  I've spent my fair share of days and nights (some of which I don't remember very clearly), and have always had a good time. And the bartenders always make sure I get home ok :)  They even have heart - one of their bartenders fell ill, and they regularly hold fund raisers for the charity they've set up for him!   Come for the Sox (or the Giants), come for the Irish Car Bombs, come for the fun!", 
    "review_date": "2008-02-13"
  }, 
  "Tohm6m3FHtTm9jUFMDjDTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen P.", 
    "review_text": "I love red jacks!!!!! Especially Shawna Marie and her margaritas :)!!!!", 
    "review_date": "2010-09-30"
  }, 
  "yfq4INlwaC8dyX6tpwSqrw": {
    "user_rating": 4.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Dee H.", 
    "review_text": "Definitely a dive bar.  Happy hour available (yay!), friendly bartenders and owners, and decently priced drinks.  Good after work spot with sports always on the boob tube, a jukebox (i think?), a diverse selection of liquor, and again - awesome bartenders.  Only thing is it does get crowded and it reeeeeeeeeeks of yack in the back by the bathrooms.  Man, someone must have yacked a while ago on the carpet.  Could you guys clean that by chance?  Other than that, all thumbs up.  Kudos to you!!", 
    "review_date": "2012-01-27"
  }, 
  "4wWMvnnJbklv6kRViNRmHw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Esther G.", 
    "review_text": "So the Experience of visiting this bar was under weird circumstances SO I give it to the hosts and security  when a fought broke out  and they still made everyone fell safe.", 
    "review_date": "2013-01-06"
  }, 
  "G8RpowvR9LodKj4_BCPMaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul B.", 
    "review_text": "Yelp seems to be making some serious inroads in San Francisco. I've been recently asked by a bartender if it was me who wrote a very particular review about him. I've been asked if the Scavenger Hunt after-party was a Yelp-only event by some folks who wandered in off the street. And I've seen Yelp maps and ratings on a infotainment TV channel piped in at the The Red Jack Saloon.  So of course, that had to go into my Yelp review.  The Red Jack Saloon is a good neighborhood bar. I don't feel like I can recommend it as someplace you go out of your way for, so the extra star goes for being North Beach and keeping a local-friendly vibe. Also, I got carded. Wait, what? I'm in my 30s... thanks, Mr. Bartender! Unfortunately, I didn't get to meet Mark and Laurie, who I hear are \"flippin cool\".  Also, they serve my newly-discovered second-favorite porter, Deschutes Black Butte. Heh, I said \"Butte\".", 
    "review_date": "2008-04-28"
  }, 
  "97BHRNfBqubPqisKmj46Ww": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clark G.", 
    "review_text": "Had a choice of either this place or buena vista as the neighborhood go to when i  lived in the area.  Love irish coffees but didn't want to exactly chat up folks from cleveland or england after work.  Miss the homage to the green monster they had on the wall in the back patio.  With that said, had a funny laugh when one of the locals told me of a story between Bob Kraft and Laurie.    Kraft and his cronies cruising up/down bay looking for danko when the patsies were in town to play da raiders.  He sees his team flag along w/BoSox fly outside the bar so comes to say hello.  Starts pointing at the flag saying 'hey im the owner'  Laurie fires back 'f you i'm the ownah'  Kraft then replies 'no no I own the NE Patriots' and apparently left a few tickets behind.    Good neighborhood bar if your in the area or nice getaway from 39 for cheaper drinks and the sounds of remdog and orsillo on NESN if your into it", 
    "review_date": "2013-01-11"
  }, 
  "ZDYUxVKv2dd3CpOlc1ahRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Geir R.", 
    "review_text": "RJs is the friendliest bar you can imagine. Laurie, Mark and Nicole(and the other bartenders, I'm sure) make you feel so at home, and your first visit here will certainly not be your last!  Plus, they have complimentary hot dogs/meatballs for Sunday football :o)", 
    "review_date": "2011-01-17"
  }, 
  "edmsoluD3nVptsVwK0ZVig": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike M.", 
    "review_text": "Typical neighborhood bar, nothing special. Long tables are great for groups and parking is fairly painless on Bay Street.   The place always smells like wet astroturf, not sure if that is an endorsement or a warning- but it definitely has its own odor.", 
    "review_date": "2006-06-28"
  }, 
  "0rdtzeopvGVsWvRZaTXiNg": {
    "user_rating": 4.0, 
    "user_location": "Brentwood, CA", 
    "user_name": "Rick J.", 
    "review_text": "Cheap drinks Lots of TV Lots of Boston Red Sox memorabilia Jenga and Connect Four Darts Juke Box Shot specails Chill crowd  will be back next time in SF", 
    "review_date": "2009-06-12"
  }, 
  "M1wl9tWFaDbpfSxh5KmjaQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Ting S.", 
    "review_text": "Who the eff takes a Yankees fan (sporting a Yankees cap) to a Red Sox bar?! (that would be me, guilty)  In my defense, it was a random afternoon, we needed a break from wandering the city all day, AND it was a Giants game on; neither the Red Sox or the Yankees were playing. The bartender welcomed us warmly, and there was no hate on the Yankees fan that I dragged in.   Great prices on drinks, laid back patrons, and a nice dartboard in the corner.", 
    "review_date": "2012-01-17"
  }, 
  "sXJwXEHR64393fWO4Qdq6A": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Kim P.", 
    "review_text": "Dive bar!!  But in the realm of dive bars, it gets 4 stars because the drinks are super cheap (6 dollar mixed liquor drinks) and the crowd is friendly. There's a cool dart board and some TVs.", 
    "review_date": "2011-10-27"
  }, 
  "K4g2p31gIE392nZYtu0tAg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa A.", 
    "review_text": "Great dive for hanging out with my coworkers. Everybody seems to know one another, and even if you aren't local, everyone is super friendly. They have a different drink special every night... They have tons of board games to choose from, and someone is always playing the jukebox.. Darts, an old pinball machine, plenty of seating by the wall; what more could you ask for besides your beer?", 
    "review_date": "2011-03-20"
  }, 
  "OJYH5e8f4_UP3y4SLXW30w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer E.", 
    "review_text": "OK.  Here's the deal.  I really love Red Jacks... but I also think that no normal person frequents the same bar as much as I go to Red Jacks.  I am a woman who loves variety, but when you do theatre and get out of a show at 10:30 pm every Fri/Sat and 4:30 pm on Sunday...sometimes the first thing you want is just a drink.  Red Jacks is great at providing you with strong, cheap drinks and a bag of chips...especially near Pier 39 where everything else is stupid expensive and served in measured pours.  I also love that Red Jacks has the Fun Finder game where you have to find the difference between pictures of 2 naked woman...man, I get stuck in that game quite frequently.  They also have plenty of board games (which I love) and you can order out for pizza whenever.  Why not give it a 5 star rating if I love everything about it, you ask?  Because I am just so damn bored of coming here every Fri/Sat that I am driving myself crazy.    So...if you wanna know where to find me...go to Red Jacks every Fri/Sat at 11pm...and I'll be there...again and again...and still getting carded by the same bartender every week too....sigh.", 
    "review_date": "2008-05-07"
  }, 
  "cIj3gL4Wl7799gD9hreVTg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy H.", 
    "review_text": "I come here everyday after work and I love it. Lori and Mark are amazing, and so is all of their bar staff (Shawna, Nicole, Nick, Chad). She'll even throw on the Padres game for me when seasons in!!  Seriously, what's not to love about the Red Jacks!!", 
    "review_date": "2013-01-18"
  }, 
  "JvNMi2Oh6o6SfcIsq73KNA": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Roger H.", 
    "review_text": "4 stars for being the only Redskins bar in town. The 5th star is for the service. The bartenders are not only very sweet but are very consoling when your team is getting pummeled. The icing on the cake is the inexpensive prices for drinks.", 
    "review_date": "2010-09-21"
  }, 
  "ajNM87Z8Zavuqezpd08c8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raul R.", 
    "review_text": "First and for most this is a Boston Bar, with that being said the bartenders are cool, they pour a good drink, and margarita Monday is the day to hang out. The tv's  usually have some type of game on and sometimes they offer hot dogs. Is this the best bar in the city no, but if I am in the area i will stop by.", 
    "review_date": "2012-07-19"
  }, 
  "nt5LE5pyoJt9EL-o-jU6Jw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie T.", 
    "review_text": "If you're looking for a place to watch Football, Red Jack is a great choice.  I've lived literally around the corner from this place for about 5 months and never walked in, but I'll definitely be back.  The owners and employees are friendly and they serve up some great drinks.  Our first round was on the owner and later he bought a round of shots for the bar.  Can't ask for much more than that!", 
    "review_date": "2008-12-02"
  }, 
  "v2boY8Ujs9VmVe6v2mtFhw": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Maranda S.", 
    "review_text": "Good place to come after work for happy hour, although it is a bit divey. Very good customer service.  Just make sure you are prepared for the $10 minimum credit card purchase and the no-so pleasant smell.", 
    "review_date": "2012-02-19"
  }, 
  "IZKX8BHHjS8YwHIVi9KJ2g": {
    "user_rating": 4.0, 
    "user_location": "Tucson, AZ", 
    "user_name": "Alissa A.", 
    "review_text": "Darts, board games, cheap strong drinks, good jukebox, and pinball! What else could you want? Although be forewarned: if you come with competitive friends and are competitive (like me), you will end up playing endless games of Connect 4 to assert your dominance. You will then proceed to drink more, making it even harder to win. It's a vicious, drunken cycle.", 
    "review_date": "2010-11-24"
  }, 
  "srC6EDHsMXWERPBopvgC6A": {
    "user_rating": 4.0, 
    "user_location": "Edinburgh, United Kingdom", 
    "user_name": "Ethan U.", 
    "review_text": "Good bar, was here on holiday and got sick of the glut of touristy type bars both pricewise and the lack of local culture.  Pretty loud although there were some big sporting events on while I was in.   Owner and staff really friendly and polite, also with a good sense of humour.   Good range of drinks and well worth a visit.", 
    "review_date": "2009-05-31"
  }, 
  "7zQEQkiukL0_Mhkl9X8emw": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Kelly L.", 
    "review_text": "Want a cheap, fun bar near the wharf? This is the place! relaxing, funky and one block  from the water. Worth the trek to get away for a drink that won't break the bank. Cool bartenders, too", 
    "review_date": "2014-05-29"
  }, 
  "HvQ45V3LxGbY6-YZ97cvqQ": {
    "user_rating": 3.0, 
    "user_location": "Rockville, MD", 
    "user_name": "Karena J.", 
    "review_text": "3 stars for beer list:  They had standard American Beers on tap along with some craft beers - I was happy they had Lagunitas IPA on tap.   5 Stars HTTR!  Redskins bar away from home!  The only one we could find in San Fran.  On a Sunday night game, despite a disappointing Skins season, I was impressed to find so many skins fans at the bar in Burgundy and Gold attire.    2 stars Ambience:  The ambience is nothing too exciting - your standard American pub with an \"L\" shaped wooden bar parallel to some tables along the length.  We sat at the short side of the bar and there was a bit of a strange but tolerable odor in my corner.     0 stars and 4 stars (hit or miss) Service:  Our first bartender seemed annoyed we were there, asked what we wanted and walked away (barely anyone at the bar) when we took a 10 second pause to peruse the beer list.  When I asked if there was a food menu, he remarked that they don't have a kitchen and then plopped a big binder of delivery menus in front of us.  We ordered food from a nearby takeout place.  10 minutes later, another bar patron right next to us asked the same question and got a different answer, \"There will be a free hot dog station behind you, but you can order delivery, too.\"    I would have never ordered delivery if I knew that.  SERIOUSLY ANNOYED.  Our second bartender was much better, friendly, and welcomed our presence.", 
    "review_date": "2013-12-05"
  }, 
  "fcnaLf9n35xD9mQjJ773ug": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ani C.", 
    "review_text": "Idiots. NEVER in my life, in any city, in any bar (dive or not), in America or all over the world, have I encountered such an idiot.   Group of 14 people walk in to this dive- yes, 14 people. Tourists from Europe and beyond, ready and willing to drink and spend lots of money. Moron female bartender cards us all.  Ok, I get it , following protocol. No big deal. We are all well into our 30s and on.  One of my friends from Greece hands her ID- written CLEARLY in ENGLISH and Greek with her picture on it.  Female bartender \"Oh. I can't accept that. I need a passport. I can't accept that ID. You all need to leave\"   My response  \"Are you fu***ng kidding me\"?  I've been to bars all over the world.. This has NEVER happened.   She's 33. It's on her ID- WITH her picture! You can see it if you can actually read English and have some semblance of a brain. And just a note to management or the owner, who is obliviously also an idiot-   YOU DON\"T TOUR AROUND WITH YOUR PASSPORT- Especially not while bar hopping.  It's the first thing you put in a safe as a tourist so it doesn't get lost or stolen. So that you can actually return home. Never, ever heard of this policy before. Anywhere.   But, dive bar bartender probably has never been outside of CA, so she doesn't know that.   So, we left. And went to Cigar Bar and spent lots of money and had a great time until 2am. Oh, they carded us too.   Your loss, Red Jack Saloon. No wonder it was empty inside.   Hope the owner reads this. But it gave us all a good laugh. You guys suck. BOO ON YOU Red Jack Saloon", 
    "review_date": "2013-08-23"
  }, 
  "LnZUtFx6qTWs8NV6lAARxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa N.", 
    "review_text": "I love this place! Super friendly staff, decent alcohol selection and chill crowd -- what more could you ask for in a neighborhood bar?  :)", 
    "review_date": "2006-10-23"
  }, 
  "McLgMXD6vEWod1Yk8zS1ag": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Kai L.", 
    "review_text": "This place is racist as fuck. Bar full of white ppl, and 3 Asian walk in, and he can't serve us just because my friend's ID was just a little bented. It's 1am in the morning. Who give a shit. It's 2000 fucking 14, get wit it.", 
    "review_date": "2014-07-19"
  }, 
  "sXLAy83l7EwdZjsYFbaq0A": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kara B.", 
    "review_text": "Probably the most un-hipster bar I've been to in SF (not including the Marina district). Biker boys galore. And, I'm not talking fixie boys... I'm talking \"behind bars\" real biker boys.. uh-hem, men. Wha? This is a Boston Red Sox bar? Really? Well, okay I guess. There are lots of pennants and B sox stickers adorning the place, but there are also some SF Giants love and a nice nod to US military service, here.  And, I have to give much love to the bartendress! She understood that I wasn't drinking and was in desperate need of a sugar free energy drink. I'd go back just to chat with her. Plus, the laid back atmosphere didn't hurt either... bunch of Red Sox peeps watching and rooting for the SF Giants - what's not to like?", 
    "review_date": "2012-09-06"
  }, 
  "5AgMe_UtUSugOQ4_GxpUFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karina L.", 
    "review_text": "Nice neighborhood bar.", 
    "review_date": "2012-09-09"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "After a brief stay at a party at the aquarium that we-thought-was-open-bar-but-disappointedly-wasn't, we needed a drink and fast! My bf remembered stumbling by a bar on Bay Street a while ago and led the way to where he thought the bar was. Luckily, he was pretty accurate and we arrived at the Red Jack Saloon!  The bar was filled with festive, fun Halloween decorations and lots of Red Sox and Patriots paraphernalia (a Boston fan we were with and I were excited!). The drink special of the night was $3 Red Stripe beers. So for 4 pints of beer, one vodka-pineapple, and one cosmo, the total was only $21. I love cheap drinks!!! They also have great drink specials every night- margarita Monday's, rum cocktail Tuesdays, and so on...  We found a table and so many fun games. Immediately, we started in on our own Connect Four tournament then Jenga then darts. Fun!   The bar was not too packed but definitely had its fans. Also, the girls' bathroom was kind of interesting in a fun way (but you'll have to see for yourself what I mean...). I was so energized after a fun night at the Red Jack Saloon that I raced the mile home, uphill, in heels since we couldn't find a cab... I'll be back!", 
    "review_date": "2008-10-18"
  }, 
  "DYhdsxqPPUhpZfwILtlo1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert S.", 
    "review_text": "For my wife's birthday I called Red Jack and told them I'd be stopping by with 20 friends to start off the night before we went on a party bus.  The owner (can't remember her name) was so nice.  She put out balloons and had appetizers out for us when we got there.  I'm sure it wasn't all just for us, but she did accommodate our party nicely.  Red Jack is awesome!  I forgot to mention, they do a trivia game and we won t-shirts!", 
    "review_date": "2011-04-06"
  }, 
  "_lbgVbWTvxV9VTVWU0YnwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noneya B.", 
    "review_text": "This is a good spot for cheap beer.  I have happy hour there occasionally and sometimes stop in for that last over the top drink that puts me under.  It is very very close to where I live. Nick (the bartender)is awesome and and the crowd is fun.", 
    "review_date": "2007-10-19"
  }, 
  "DgR8xzXQGkRehQ9qQ9w2_Q": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Manny V.", 
    "review_text": "Nestled in along Bay street near the corner of Stockton, this great little neighborhood hangout is certainly a gem. Great locals and super friendly staff make for a perfect after work spot to grab a couple of drinks. If you are a Bostonian transplant and need a place to catch up on the Sox or the Pats, this is your spot. They always have the games on and even have a \"Green Monster\" painted on the wall of the patio out back. Of course they are also fans of the local sports scene, and will certainly try to accomodate other fans if there is a game you really want to see. Different drink specials every day during happy hour and they sometimes even have something cooking to take care of the munchies. Say Howdy to Laurie the owner when you stop by...she is a sweetie.", 
    "review_date": "2005-04-28"
  }, 
  "qj6sqH7tvELjO-dmKoiTpg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie G.", 
    "review_text": "This is a nice little local bar. The bartender was very friendly and the place had a comfortable atmosphere. I'll definitely be going back to drink a Guinness or three.  Growing up in NY I can't really appreciate the Boston'ness of the place but I can put all the Red Sox/Patriots stuff aside and enjoy myself.", 
    "review_date": "2011-05-15"
  }, 
  "011145MPIsSoYleZh6z0ug": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Yoon R.", 
    "review_text": "Hands down my favorite bar in North Beach SF!   I felt like I never had a true lime margarita or bloody mary til I had one here. The margarita mix they use definitely taste homemade, not that sugary-fructose sweetness you often taste. They are very generous on the alcohol in their drinks, was feeling it already after one margarita! And the female bartender really lays it down good on those Jameson pours! But its the margaritas &amp; bloody marys that really keep me coming back; I get cravings for them. Also the drinks here won't go hard on your wallet (Daily Specials, see images for the weekly calendar).   Its a chill yet lively place with alot of conversation going on; dont come here to get your grind on. It's more of a place to take drinks to the face without having to yell over the music to talk to your friends. Bartenders are awesome and friendly; I only came in once and they remembered my face and name for the next times I came in so they didn't even card me.", 
    "review_date": "2011-07-27"
  }, 
  "oJ6bb4wnKCNT8v4U53FzFA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katelin H.", 
    "review_text": "Be you old, be you young, be you a long-haired chihuahua named \"Schnitzel\", this is the saloon for you. Drinks are reasonable and there's a killer internet jukebox with almost any song your little puppy dog heart desires. If you just want to keep up those tired, old feet and don't mind the man farting on the stool next to you, you're good to go.", 
    "review_date": "2005-08-26"
  }, 
  "DsulN6pfULqGcJwKRPRt-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Muhammad R.", 
    "review_text": "I miss this place so much! They are bicycle friendly which is important for me when I need to park my horse before I got my liquid induced lobotomy. Paul and his wife Simone made the place feel like home and the owner reminded me that it was good old San Franstinky every time her rolled through on one with a smile and the eye of the tiger. Good times tucked away on the out skirts of Touristville. If six stars were possible this place would have one for keeping it real. Very rarely do I wake up on someones couch staring at he ceiling wondering where I am at and how I got there which is a testament to the quality of the drinks there. Order the \"Strong Island,\" tighten up your helmet chin strap and wait for the rotation of the Earth to slow down so you don't fall over and you will have officially been Red Jackedup...", 
    "review_date": "2010-06-11"
  }, 
  "i_t5Zd6Xp4za1xl1oDxgzg": {
    "user_rating": 5.0, 
    "user_location": "Moreno Valley, CA", 
    "user_name": "Miller S.", 
    "review_text": "Drove in to sf this morning from riverside and went right to work. Got off and have had bad service after bad service! Drinks are strong and delish! She improved the trip considerably! Will be back next time I'm in sf!", 
    "review_date": "2014-06-14"
  }, 
  "i_kJwGE9b3sAw9G2PCkH2w": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "Greg M.", 
    "review_text": "Not a bad little place.  Generous drinks; good prices.  Not the sweetest-smelling place I've ever been, but friendly service and congenial crowd.", 
    "review_date": "2010-07-18"
  }, 
  "Zb5k2PG22-78C8LBgQJ20w": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Lisa S.", 
    "review_text": "I absolutely love Red Jacks, but I was a little hesitant to write a glowing review... because I don't want my special spot to get overcrowded! Red Jacks is a comfortable, uncrowded, unpretentious, inexpensive, fun dive bar.   The drinks are cheap, and if you go on Monday-Friday, there are drink specials. My personal favorite is Margarita Monday, which has margaritas for $5.50. They have a ton of beer on tap and in bottles, and I never have to lean over the bar and/or wait 20 minutes to get one. The bartenders are friendly, on a first name basis with many of their patrons, and they serve drinks fast.   I love to hole up in a corner and play connect-4 (they have a big basket of games for people to play in the back), or kick my boyfriend's ass at darts. The only downside is that there's no music unless you want to pay for the jukebox, and sometimes you get stuck listening to someone's awful drunken music taste for an hour.   Cheap, fun, and relaxed. Perfect for a casual night out. :)", 
    "review_date": "2012-01-19"
  }, 
  "48ogTsKGjFz17t7s5sD1Ng": {
    "user_rating": 5.0, 
    "user_location": "Ilford, London, United Kingdom", 
    "user_name": "Tom S.", 
    "review_text": "Good cheap bar, plenty of drinks options, jukebox, darts and plenty of screen showing various sports channels. Off the main fishermans wharf area, but worth the trip.", 
    "review_date": "2014-08-24"
  }, 
  "QUw6VXBnl3h7WaTPfMfXLg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jessie h.", 
    "review_text": "i thought this place would be a lot more fun.  but i guess it was friday right after work, and we weren't in the financial district and not really by anything actually.    their beer special for happy hour was alright, but it was only red hook. they advertised as a good special effen black cherry and soda for $6.75.  which is not a good deal.  they did have lots of games, which was fun.  bc i love games.  and it's pretty cool they have a back patio, but it was small.  the bartenders were really nice.  if it wasn't so far away from my house i'd think about going more often, but definitely not worth the trip out there.", 
    "review_date": "2009-06-15"
  }, 
  "n5y-I6GoaaZvpzd6BJD94g": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Vicky V.", 
    "review_text": "If you're looking for a lively bar with a rowdy crowd to watch the playoffs with, this is not the place! A very sorry excuse for a Red Sox bar that will leave you surely disappointed. Worst sports bar I have EVER been to and not just because the bartenders are thick and and unattractive.", 
    "review_date": "2009-05-26"
  }, 
  "0zSZdJMTFZnp2YQM5M5s-A": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Anastasia E.", 
    "review_text": "Best place EVER to watch the Boston Celtics play!  I am a huge fan of the C's, and I can't believe I just discovered this place today!  It's nice to be surrounded with fellow Boston fans.  (Drinks were cheap too!)", 
    "review_date": "2010-05-13"
  }, 
  "7nXtoMQc01njRZCKABtxsg": {
    "user_rating": 4.0, 
    "user_location": "San Marcos, CA", 
    "user_name": "Letitia S.", 
    "review_text": "Awesome dive. We drank with the bartenders' husband, and she (the bartender, wish I had gotten her name) bought us our second round of drinks. Everyone was really friendly, no one treated me like a tourist (I'm from San Diego). The only downside was that there wasn't enough seating. Great place overall!", 
    "review_date": "2014-04-20"
  }, 
  "kaqlSjOjI8YW7PcLdanK-w": {
    "user_rating": 3.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Kimmy T.", 
    "review_text": "Seemed like a pretty cool bar.  Too bad we couldn't enjoy it.  They wouldn't accept my friend's temporary DMV issued license, even though he had the expired pictured ID to go with the temporary paperwork.  It's their policy so I guess I can't fault the bar too much.", 
    "review_date": "2012-10-15"
  }, 
  "-x4rHBJtwFZw6KmPY7NOHA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Mark H.", 
    "review_text": "Stopped by here because I needed to rinse my mouth out from the Dewar's tasting at Fort Mason Center. My friends and I enjoyed Johnnie Walker Black on the rocks. MUCH better than any of the Dewar's products.  Actually, whenever I am in the area, I stop at The Red Jack Saloon. The place is always fun with lively characters coming through.   I have gone to the Red Jack for the last two years. Each year taking special care to make their annual Xmas fundraiser.   This place is a great community gem that goes above and beyond what is required for good business in SF. It is a pleasure to support such a great establishment with great employees and great owners.  I'd highly recommend that you stop by and show your support, if you are in the area.", 
    "review_date": "2012-01-17"
  }, 
  "VWIHYHt_S97fi1IJ91kl8g": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Bridgette A.", 
    "review_text": "I've been to Red Jack a handful of times, and I have always had great experiences. I go to school across from Pier 39, so this is the closest bar to us... and who doesn't need the occasional drink after (or in between) classes? The place is cute, the bathrooms are clean, and the drinks are cheap, even on Friday nights!   The most recent time I went was Friday night, and the bar wasn't very crowded. My friends and I had one whole part of the bar to ourselves. The bartender was nice and attentive, and my fiance and I ordered a beer, an Irish Carbomb, and a Scooby Snack for $20, including tip! I also discovered the matching game with naked men/women, which is just an awesome touch. This is definitely my favorite bar in the city!", 
    "review_date": "2008-08-18"
  }, 
  "ZAaKzaauffR_GbOeQBMqIQ": {
    "user_rating": 3.0, 
    "user_location": "Odenton, MD", 
    "user_name": "Nancy A.", 
    "review_text": "Dive bar to the extreme. Local SF bar for Redskins fan, which was really nice! The owner is a bit gruff but it was no biggie for us when we were there to watch the Monday night game. There were 2 mice (very tiny) when we were there. They didn't bother anyone, but it should be noted. The front door and the back door were open and it was cold outside, so perhaps that was where they came from.", 
    "review_date": "2013-12-01"
  }, 
  "CFL1vDhDfriHesGPJX09tg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anne Marie M.", 
    "review_text": "If you're looking for a Boston bar with a Redskins problem, Red Jack is the perfect place. With TVs all around and a sizable crowd of DC fans, I'm eternally grateful for a crowd to sing Hail to the Redskins with on those Sundays I sneak into the city. While some seasons aren't as amazing as this one-- all hail RGIII--I can always count on Red Jack to make me feel like I'm back in ol' DC for a few hours.   Unlike Dan Snyder, Red Jack doesn't seem to abuse fan's pocketbooks. Drinks are cheap and there's a drink special every day of the week. I don't think I've ever landed here except for Sunday. Something about the Bloody Mary's at this place... they're quite good. Maybe even better than Starboard and that's a toughie. Thick, hearty and just enough to be the perfect hair of the dog.   Make sure to check out the back patio. It's a nice nod to Fenway.", 
    "review_date": "2012-12-12"
  }, 
  "wqXnbNPvecC0F0JVvxC_1A": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Mike T.", 
    "review_text": "We had a nice time here after doing the tourist thing and deciding to escape Fisherman's Wharf.  The bartender was very accommodating, changing TVs as requested and lending us a phone charger.  It's a regular, no frills bar, but I wouldn't go as far as calling it a dive.", 
    "review_date": "2012-09-26"
  }, 
  "ZtmeHAQyNFku338dJMIfTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek B.", 
    "review_text": "It is all true. A hidden gem dive bar in San Francisco. Local, cheap and friendly. And in the unlikeliest of locations (1.5 blocks from my house) and far from anywhere that anyone not living in North Beach would ever travel to.  Once, I took a friend here for some 21st birthday pre-drinking. Within twenty minutes of her actually turning 21 (yes, 12:20 AM) the entire bar was buying her shots and by 1:00 AM she was out on the sidewalk throwing up. (Yes, it was supposed to be a pre-drinking destination but we never made it any farther).   To this day I don't think she forgives me.   (It probably doesn't help that sometimes when I'm walking by, I take a picture of the sidewalk where she was hurling with my camera phone and send her reminder pictures.)  Gotta love the Red Jack!", 
    "review_date": "2008-02-21"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "awesome neighborhood bar.  I b back", 
    "review_date": "2013-02-22"
  }, 
  "9wnTGjK0IuQgx-1QXIQQmQ": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Chris B.", 
    "review_text": "Good drink prices... Its a boston bar.", 
    "review_date": "2011-01-26"
  }, 
  "3dfrEG62rfUFniCTdKieMA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yahra V.", 
    "review_text": "If you are a Boston fan then this is the place for you!  We came here last Sunday (4/22/12) on a friend's recommendation (new friends, yay!) after spending a nice sunny afternoon walking the Wharf.  The place bleeds Green (Celtics) and red (Sox) and gold &amp; black (Bruins).  The drinks are cheap and strong and the bartender was nice and attentive... granted it was a quiet Sunday afternoon. The bar was fully stocked and had drink specials.  There are plenty of tv's, games like darts you can play and the crowd looks like a mix of locals, workers from the area, and tourists. Overall it seems homey and a fun place to watch a game (I happen to bleed Green :)  The restrooms did NOT smell like yak (as stated by previous reviewers) but the carpet in the front area DEFINITELY did! Or something in there did. You know that musty, wet bar floor, 1,000 year old carpet smell? Well its there. And its not nice. But if you can get past that everything is else is cool about this place.  I'll be back definitely... especially with playoffs around the corner!", 
    "review_date": "2012-04-26"
  }, 
  "1sfzyspodUUH80z3X15XYw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Collin C.", 
    "review_text": "A Redskins bar in San Francisco!  I was sold as soon as I walked in here. The atmosphere was great for a DC fan when they were playing the 49ers, but even the 9er fans here were super respectful and fun. The have many tvs all over the bar, their price points are solid, and they had free hot dogs and meatballs going.   There is an outdoor patio, a jukebox, a Ms. Pacman machine going, and a dart board among other things. The energy was perfect for a football sunday, energetic, yet no sense of animosity between people. It was a very welcoming crowd.", 
    "review_date": "2014-11-27"
  }, 
  "EkOehb1Nai1pMkehMZPQhQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James H.", 
    "review_text": "I live a block and a half away from Red Jack and used to like this place.  When they ran into zoning issues, I was part of the neighborhood group that supported them.    My brother and I just found out about some serious health issues around our father and stopped in to get a drink (or a lot of them).  Immediately, one patron gave us trouble about sitting in his seat.  We apologized.  After a confrontation, where this guy knocked over his stool and tried to start a fight with us, we moved to a separate section of the bar.  The owner then came by and called us douchebags, assuming we were responsible and faulting my brother for having his foot on a wooden ledge.  All we did was try to avoid a confrontation from a bunch of regulars that did not want us there.  It was a tough night and everyone at Red Jack, from the owner to the patrons, made it worse.  I will never set foot in this bar again.  I used to like it, but now, f--- these guys.", 
    "review_date": "2012-01-20"
  }, 
  "Qi-I7AAuvheBnKn0Md4UlA": {
    "user_rating": 4.0, 
    "user_location": "Downey, CA", 
    "user_name": "Kat M.", 
    "review_text": "Nothing like a Boston bar in Frisco. Red Jack is super laid back and provides stiff, cheap drinks. Nice to find a casual bar within walking distance of our hotel on Fisherman's Wharf.   They have daily specials, so make sure to check out the board by the bar.", 
    "review_date": "2012-07-18"
  }, 
  "QeZ6gj7XYWEE5NCk_BKF9A": {
    "user_rating": 5.0, 
    "user_location": "Kansas City, MO", 
    "user_name": "Katie P.", 
    "review_text": "I love this little bar. It is cozy, affordable, and quite comfortable. My fiancé and I fell in love with this place last year when we visited SF, and now I  am compelled to write a review because it is that awesome. The drinks are more reasonable than most KS bars, and the staff can't be beat. Nicole is a sweetheart and cured fiancé of his hiccups... For awhile. If I am ever lucky enough to live in SF, this bar will be at least a weekly occurrence.", 
    "review_date": "2011-03-04"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "Attention bostonians, red sox fans or whoever.... red sox-dive bar alert right here in SF!   If you ever wondered where all those really cool and relatively unknown dive bars are hiding.... Well I just discovered one the other night. The selfish part of me was reluctant to write this review for fear of letting the secret out..... but since I love you yelpers so much I decided to share.   because sharing is caring. and i care.    Ok I lied... a little. I didn't exactly find the Red Jack Saloon myself.... a friend is in town right now visiting from boston and he actually found it. after pre-drinks at michelle's we headed out to fishermans wharf to watch the Sox game. The first thing I said when I walked inside was, \"huh? No f'ing WAY is a bar this perfect in fishermans wharf!\"    Its certainly not my usual cup of tea..... but i knew i had stumbled upon something really good. Its very low key and you can almost feel the history pouring out of the walls.   The best feature to me was nice local vibe. Everyone we met knew each other already.... And when we walked in, we instantly became a part of their family. We were there on Wednesday which they call \"Whatever Wednesday\".... Meaning whatever drink the bartender chooses that night (he gave us 3 options) is $3.50   yes $3.50-- all night long. way CHEAP! I picked the rum. naturally.  They also have darts.... Or as my boston friend called it \"daahts\".    Then, there's a jukebox-- YAY! And just when you thought it couldn't get any better.... They have a great little outdoor patio are in back for smokers. The entire back wall is painted like the Green Monster so you feel like you're sitting in Fenway Park.  And speaking of cool...... one of the regulars here is a former inmate of Alcatraz. Yes, its true. His name is Darwin Coon and he was an inmate there from 1959 to 1963. yes i asked, he was in for bank robbery. We were trying to get him to tell us some good prison stories but the Sox game was on and we had our priorites...... anyway, he was a nice old guy and when he left I actually gave him a big hug. See what a little rum will do? Here's a great story about him: <a href=\"/redir?url=http%3A%2F%2Fwww.sfgate.com%2Fcgi-bin%2Farticle.cgi%3Ff%3D%2Fchronicle%2Farchive%2F2000%2F08%2F14%2FMN88235.DTL&amp;s=f518baf9e8c2b2a7d51085c06ec2149779cfa6b96a0985c33da04a4cbde775bc\" rel=\"nofollow\" target=\"_blank\">sfgate.com/cgi-bin/artic…</a>  Really, how much more do you need? Red Jack Saloon has \"daahts\", a jukebox, red sox fans, a smoking patio with the green monster, cheap drinks, Alcatraz inmates and a lot of history..... i for one  will be back. in fact, its been awhile since i've done this but....yes i think a little Yelp outing here might be in order. stay tuned", 
    "review_date": "2007-04-13"
  }, 
  "8VHDydi53hJcelSen3hP4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich S.", 
    "review_text": "Best Pat's bar in the city. Mark and Laurie- the owners are the best. Free donuts and hot dogs on Sundays. Mike the bartender is the man. If you are from Boston, you should be embarrassed if you don't go here on Sundays. Cheap drinks, $4 Bloodies on Sundays, decent selection of craft beers and blue collar beers alike. It is like watching the game at your buddies basement, only better.  Only weird thing is that Redskins fans also congregate here, doesn't bother me though they keep to themselves and God love em' for still showing up every Sunday.  Not enough good things to say about this place.  Go there!", 
    "review_date": "2009-11-01"
  }, 
  "7WqQQzwqjsv7-Jcpzwalqg": {
    "user_rating": 5.0, 
    "user_location": "Lynnwood, WA", 
    "user_name": "Steve H.", 
    "review_text": "Is there a place to rate bartenders? Laurie deserves 10 stars.", 
    "review_date": "2012-03-14"
  }, 
  "aEKUC4oQg2CokbwyW_CXSg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah R.", 
    "review_text": "This is a great bar for whiling away an afternoon. They have darts, video games, pinball, board games - plenty to keep yourself entertained. There's also a back patio to catch the SF sun if it decides to make an appearance. Check it out!", 
    "review_date": "2007-07-13"
  }, 
  "xT15DPvgtyU799LLXpKzIQ": {
    "user_rating": 5.0, 
    "user_location": "Stuart, FL", 
    "user_name": "William R.", 
    "review_text": "I imagine if I docked in SF that I could walk 3 blocks away from the tourist herd and find this place full of real characters, after work crowds, and a super nice staff, I would count that as a good trip. Luckily, I work 2 blocks from this place and Red Jacks has turned into the after work spot for a lot of offices in the area. Mark is the fantastic loud owner hailing from Boston and he makes you feel at home. There is even a small outside area in back for drinking, smoking or BBQing. The locals here are a great and friendly bar stock and the owners and staff are so nice. PBRs and Budweisers in the bottle and some of the fancy stuff on tap. Cheap hard stuff, plenty of places to sit, board games and darts. Winner!", 
    "review_date": "2009-07-14"
  }, 
  "SwczYdPhx5w2uhXSeIALLQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donna J.", 
    "review_text": "My friends told me about this bar so I met them, the bartender had people laughing and it seam that the customer were having fun. The drinks were great and the big screen were great. We had a real good time I will be back soon.", 
    "review_date": "2011-07-01"
  }, 
  "rUHZ8BCAeNNO2FEYlS0kew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina O.", 
    "review_text": "best bar in town!  'nough said", 
    "review_date": "2012-01-07"
  }, 
  "3qGo-CYyFIUHVh3Teo-G_g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonia M.", 
    "review_text": "The Red Jack Saloon is exactly what one might expect it to be: dive-y, loud, and completely free of pretentiousness. Oh, and yes, it's definitely a sports bar. I came here with a group of four on a Friday night around 9:30, and we were able to find seating at a table; most people seemed to prefer standing at or around the bar. The crowd was loud (think drunken thirty-something men), the bar tenders were friendly (they gave everyone cake because it was one of the bar tender's birthday), and the beer was cheap.   The special drink of the day  runs around $3, but other drinks are priced pretty normally (about $7 for a mixed drink). There is one dart board, three or four big screen TVs, and that about sums it up.  I know other people are yelping that this is a \"hidden gem,\" but, honestly, I don't see the hoopla. There's nothing wrong with the place, but it's not really memorable, either.", 
    "review_date": "2011-01-30"
  }, 
  "b0fp-eS8_MKTg4tcZsCNqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "christine c.", 
    "review_text": "The best place in town to watch a Boston game! Atmosphere was great and Mark, the bartender, was too sweet. We were there before, during and after a Bruins playoff game, so at the end of his shift he gave us each a token for a free drink! Much appreciated.  Plus, they have super cheap drink specials every day of the week and good draft beers were under $6 for a pint.  Will definitely be back here whenever I'm homesick. Boston, you're my home, and Red Jack Saloon... well, you're the best I can do in SF.", 
    "review_date": "2011-06-09"
  }, 
  "CLsH7RuscV41T2qpROI9QA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karina S.", 
    "review_text": "Terrible experience! My husband and I went to Red Jack Saloon on Sunday afternoon to watch a football game. This place has a policy that it only accepts US ID or passport only. I recently moved from Canada (and don't carry a passport on me at all times, but I look much older than 21). The bouncer explained the policy as we pleaded with him to just allow an exception using my Canadian DL. He wasn't too rude.   Standing next to me was a man eavesdropping. All of a sudden he gets very close to my face and says he's the owner and it's his policy and he doesn't care if I come in or not. He started behaving like a crazy person.  When I advised him that his attitude was appalling for the owner of the business, he said he didn't care what I thought. After he continued to to tell me he didn't want my Canadian business, I said I would review his behavior and business he said, \"oh what on Yelp? Oh I'm scared! I don't give a sh@t if you review me\".  While I understand the policy, the owner's behavior was truly terrible.  I hope this post will make him reconsider this disregard for sites such as this.", 
    "review_date": "2013-01-07"
  }, 
  "i6Py9pdpo9MsfIY_W_Z_lA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex L.", 
    "review_text": "If dive bars are your thing, you'll be very happy with Red Jack Saloon.  We attended on a Friday night. We'd just finished dinner at Pier 39 with some friends who were visiting for the weekend. The tourist thing is fine for dinner and shopping, but I wasn't about to drink there. A quick Google Maps search for \"Dive Bar\" leads me 3 blocks to Red Jack Saloon, and what a bulls-eye that was.  The bartender was friendly, welcomed us, and took our drink orders as soon as we were ready. We all started with delightfully stiff vodka sodas for $4 a piece, a pretty unbeatable price in the city. I eventually switched to my favorite Belgian beer (Palm) that I was so surprised and pleased to find stocked here, also for $4 a piece.  The place is small, quiet, cozy, good dive-y atmosphere. We grabbed a table by the front window to visit and were really comfortable the whole night. There's really not a lot more to tell - friendly bartender, friendly atmosphere, stiff drinks, good prices. A+ if you're looking for a dive bar.", 
    "review_date": "2012-08-28"
  }, 
  "MV7ItoAJaiDpBvdLl8dMNQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M R.", 
    "review_text": "Good after-work dive bar to get some drinks, watch a game, and throw darts.  Nothin fancy, gets busy/very loud when there's a big game on.", 
    "review_date": "2012-05-06"
  }, 
  "f2c0zHEZf64GPxAcjP6pzw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natasha P.", 
    "review_text": "I heart Red Jacks. I've been coming here on and off for the past three years and I love how intimate it is. I can partake in conversation with my friends without it being a noise competition, there are a couple benches in the back for smokers, and the bartenders are AWESOME. I just get a simple Cape Cod, and after three, I'm the happiest girl at the jukebox singing Sublime songs. A huge plus for me is that they have CLEAN bathrooms. YAY!", 
    "review_date": "2008-12-08"
  }, 
  "VYcUVLO8LIokViI7GnZ1JQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary R.", 
    "review_text": "I love this bar.  Its pure mellow, laid back, unpretentious bliss.  The bartenders there are so nice and cool, they know what they are doing, and actually seem to really like their job. The bartenders come in on there nights off.  Everyone there is there to drink and chill and talk.  There are a million board games, wi fi, great music selection on the juke box.  There is a  nice patio in the back too as well. I didnt think i would ever give the five star, but I cant think of a single problem with this bar.", 
    "review_date": "2006-06-20"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Bookmarked this place for years from walking by one day while out with a group of friends.  Something about a bar in the middle of nowhere just has charm in my opinion.    The place is not as small as I thought but it's charming nonetheless.  Besides the seats at the bar, there are some tables around or you can be like me, hog the damn Ms. Pac Man game table!  There is a very big jukebox, a dart board and an ATM as well as the two unisex restrooms up a few steps.  There are daily specials.  Yesterday (Thursday), it was $3.75 well drinks - all day, can't beat that!  Another plus - they have chips at $1 bag!  Lots of selection too - pretzels, Lays, corn chips, Funyuns, pork rinds - every bar should sell salty munchies like this to go with the drinks!  Obviously being in SF, they have the Niners and Giants around but they are true fans Patriots.  If you are a Patriot fan, I would definitely recommend coming here for the game and root among other fans.", 
    "review_date": "2012-02-03"
  }, 
  "l4HAXHA5he8xt37Gw-zDAw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Katie M.", 
    "review_text": "Red Jack Saloon is truly daytime drinking at it's finest.  And yes, a fine establishment for someone who loves the Red Sox (my friend) or someone who loves to hate the Red Sox (me).  I recommend going on Sunday to watch a game and staying into the evening with many rounds of beers and trivial pursuit, darts, pinball, or even the beer garden outback.  Seriously, this is ADD drinking heaven.  Of course it ain't much to look at, but, the people are friendly and if you hit it at the right time you may have the whole place to yourself.    I wouldn't really go here to meet anyone unless you want to meet some diehard, beer drinkin', 70 year old, red sox fans.... 'Not that there's anything wrong with that'....", 
    "review_date": "2007-07-30"
  }, 
  "gQLo-bZBWPLeitWL903UNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maya V.", 
    "review_text": "Great place! They treat customers like family, attracts friendly customers and had free hot dogs!!! Such a fun experience.... We went in for one drink, loved it, stayed for 4 hours!", 
    "review_date": "2014-10-12"
  }, 
  "g6lj-rWPYgyUKobZCjCwjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen L.", 
    "review_text": "After passing by this place many times, we finally ventured inside last week, what a great find!  Red Jack is a great dive/sports bar.  The drinks are cheap, and they have specials every night of the week.  The atmosphere is down-to-earth and unpretentious (unlike many SF bars).  The staff and regulars are all friendly and fun.  They have darts, a juke box, and lots of TV's.  I will definitely be coming back in the future.", 
    "review_date": "2009-06-30"
  }, 
  "7Zi2n3KTW2ZijFALAM03Mw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barrett F.", 
    "review_text": "So I have been walking past this place for years and yesterday I decided to check it out.  Talk about some friendly people!  Not only were the \"regulars\" cool, but the bartender literally bought the entire bar a round on the house....and the place was packed!  I have only seen that happen in movies!  Anyway, they have a cool little outdoor patio and a Ms. PacMan/Galaga video game in the corner so I was pretty much in heaven....", 
    "review_date": "2007-02-05"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 11:14pm  Purpose: A friend of mines who is a member of a local dart team said come along.   Ambiance: A local neighborhood dive bar that knows everyones name comes through the doors. Homey feel as I can say that you can even make it your home. At night the brightest spot on the block. I notice that they've no 49ers of anything I thought I was in DC. Come to think of it the 49ers next game is against the redskins.   Staff: Big guy at counter knows my friend and they talk about the up coming game my friend is from DC. I was sitting there without a drink because I didnt want one as it was getting late plus I have to work. Finally he gave me some water I said thanks and told him he I was with his buddy. He said why didn't you say so I thought you was an tourist.   Cleanliness: It's a dive bar didn't expect much but it's pretty clean. I was surprise that this place was more clean than a restaurant lounge.  Eats: N/A  Punch Line: Local bar,Redskin diehards,dart board,jukebox,finger food (mostly apps),easy street parking after 6pm.  Final Thoughts: Good thing I came here with my friend after all these times droving by here never thought about stepping in. So I met bartender and learn it's an Redskin hangout so this coming up game I probably will not be here with my bright red Gore jersey on. Lastly it's a fine place here no one cares how you are or do as long as you spend so money on drinks.", 
    "review_date": "2013-11-20"
  }, 
  "6EWIu6Ea04qcFAL3XSalvQ": {
    "user_rating": 5.0, 
    "user_location": "Glasgow, United Kingdom", 
    "user_name": "Briony C.", 
    "review_text": "Some fun facts about this bar:   - They have $4 basic spirits (aka well drinks) on a Thursday - The bar lady was super friendly and welcoming - They do soft drink refills for free - There was a jukebox - They have Ms Pacman - It's close to the departure point for Alcatraz but is very much a local bar and not touristy at all  This is one of the coolest bars we visited in San Fran. I liked the vibe, enjoyed having somewhere to relax and the patrons were friendly. Thank Yelp for this place, otherwise I'm sure we'd ended up at some awful tourist trap nearby.", 
    "review_date": "2014-03-20"
  }, 
  "3WZ0NpXl3iS6WwrdT6qAGg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "John S.", 
    "review_text": "Great neighborhood dive bar.  As mentioned, it has Frogger, darts, tons of board games and a crazy Internet juke box.  Usually full of locals with a few random tourists happening by.  If you don't like this bar, then the jerk store is probably running out of you.", 
    "review_date": "2006-12-28"
  }, 
  "HqpPiA40v9pxTfzhq3UQUQ": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Jay S.", 
    "review_text": "Nice small sized bar with good drink specials, friendly staff, and a nice atmosphere!", 
    "review_date": "2010-10-24"
  }, 
  "zFBXPiAV_mTeROu-eYp_2A": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "J B.", 
    "review_text": "We heard really good things about this place, so we went out of our way to check it out.  I have two words: DIVE BAR.  Great for a casual weeknight drink, but don't expect much.  The bartender was sort of rude, finishing her conversation with bar customers for about 5 minutes before even greeting us.  My Stella was skunky, and that is a dealbreaker for a beer lovin' girl like me.", 
    "review_date": "2009-12-04"
  }, 
  "73afVe2aDhU-n7p6c2a9kA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dottie G.", 
    "review_text": "My search is over.  A Redskins bar in San Francisco.    I went for the first time for the first game of the season.  I was warmly greeted by fellow fans when I walked through the door and was happy. The owners were really welcoming and the BBQ was awesome.  I look forward to my football Sundays!", 
    "review_date": "2010-09-25"
  }, 
  "OSmiMStq__7aWncuJLFb-Q": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Coury M.", 
    "review_text": "It's my first time in San Francisco and my newly wedded-wife and I found this place near our hotel. I love a good dive bar and this place certainly fits that bill. However, I wasn't ready for it to be a Boston bar!  As a native New Yorker, it's a hard piece to swallow, but I survived. Drinks a reasonably priced, with nightly specials.  Our bar tender, Nicole was awesome!  She knows how to make tourists feel welcome and provided us with some great tips on other places in the city to visit. The girl even knows how to pour a proper Guinness.  Give  this place a visit. You won't be disappointed.", 
    "review_date": "2014-11-12"
  }, 
  "l8LvY4EgcPmZyUO3KvYRhg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anna G.", 
    "review_text": "This is a cool little dive bar within a neighborhood haha. Kind of a weird location if you ask me. Anyways, they have a menu called ''cheap bastards'' with shots for only $2! They're not the strongest shots but it works. They have different specials every day of the week which is pretty cool.   They also have a back patio which would have been cool to hang out at but it was cold that night so maybe next time. The bartender was pretty cool too. He hooked it up with pineapple juice.   Also, wild things happen here. As I was waiting for the ladies room, a guy walks out, smirking and closes the door behind him. I thought to myself, what if he went number two...I'll just wait a little bit...THEN, a chick walks out after him!! Figure it out.", 
    "review_date": "2009-05-26"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "I used to live across the street from this place, so I started going for convenience alone. I grew attached.  Mark and Laurie, the owners, are so flippin cool. They have a knack for making you laugh....every 5 seconds....no matter how bad your day might have been. They tend to employ equally cool tenders for the days and nights they need some time off.  Its great to find a bar so close to tourist hell that has not yet been discovered by the tourists. You get one or two wandering in from time to time, but not often. This is definetely a neighborhood bar...with a good jukebox, good people (young and old), board games, darts, a back patio and an occasional bar-b-q.   I still stop in even though it is no longer a convenient location for me, just cause I like the vibe.", 
    "review_date": "2006-12-23"
  }, 
  "MjTZ8vN2dx3yY4pXmsojsA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam H.", 
    "review_text": "I kinda hate to do this, but I gotta.  Sorry to make a point of you, Red Jack Saloon, but there's something you did that has gotten really old.  I went out with a group the other night and you denied one of our members service.  Why?  Because her drivers license has a crease in it from being in her pocket.  Now, I understand that underage drinking is against the law.  (I don't agree with it, but following the law is a good idea if you want your bar to stay open).  That is not an excuse, however, for paranoia.  We are not talking about someone who is anywhere near 21, by the way.  Not only that, you then proceeded to very visibly and embarrassingly kick her out of the bar, which of course motivated most of us to leave as well.  It was silly, it was handled poorly, and it was bad business.  Honestly, your bar was OK.  But definitely not so good that I won't miss it.", 
    "review_date": "2009-03-16"
  }, 
  "3zWYE-sXRgbT6pHzGo8LNw": {
    "user_rating": 4.0, 
    "user_location": "Stafford, VA", 
    "user_name": "Hammer Time H.", 
    "review_text": "i love dive bars so it gets at least a 4.  our bartender was drunk but friendly.  i wasn't there long enough to really give fellow yelpers a true review, but i'll go back so wait for an update...", 
    "review_date": "2011-02-12"
  }, 
  "WgmyojQ8ynowHN8Ot0mtiA": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Jody G.", 
    "review_text": "What a great place.  Once again Nicole tossed me out at closing without taking my credit card.  I do this on purpose just to \"tick off\" Allan.  Not to worry.  I was going to come back this weekend to pay my bar tab but i already sent money to Allan.  Make sure the cheap bast**d gives Nicole a very good tip.  Oh by the way, if you had been smart enough to give me a call, I would have paid my tab over the phone and set up the bar.  Get it together team.  Remember \"remote shots on Jody\"  Sorry I did not get to see you Laurie.  Nick you rule as usual. and Mike what can I say.  Will see you folks again soon.  Thank you I had a blast as usual.", 
    "review_date": "2010-06-30"
  }, 
  "prTQohnz4S5r7x5h4YlP6w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Alley B.", 
    "review_text": "Coming into Red Jack Saloon after riding my bike along Embarcadero, I noticed two things. First, the big game, SA vs. Phoenix, was on. Second, and more importantly, there was a little table with sausages and hot dog fixins for anyone that wanted one. I didn't mind if I did. They also have a bunch of board games and dice, if you are so inclined. I love the back smoking patio. With lattice walls and picnic tables and benches, it's a great place to kick it and smoke and drink and shoot some craps. I also am dying to steal the giant Deschutes bottle cap and bottle opener that are mounted on the wall. If anyone's willing to do it in exchange for a night of debaucherous drinking, hit me up. They have a fairly good beer selection at Red Jack, better than most of the other bars I've been to in SF, with actually like five or six beers on tap, as opposed to three AND they have Inversion IPA from Deschutes which impressed me. If you haven't guessed by now, Deschutes is one of my favorite breweries. I paid like four-fiddy for a pint, reasonable, I guess.  The location's cool, too and Red Jack has a real cozy, kind of down-home vibe to it that makes time really fly when you're there.", 
    "review_date": "2010-05-04"
  }, 
  "iXk4m8yIepm0zJldsahxww": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Kavan Y.", 
    "review_text": "Small bar but relaxed atmosphere. I saw woman with her retriever in the bar. It was freaking awesome. The dog was well behaved and super friendly. I guess that is how they roll in San Francisco.", 
    "review_date": "2012-10-19"
  }, 
  "TMt47-ghHgy7hVSgvGXhQA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "blue r.", 
    "review_text": "Been going here once a week since I moved into the near neighborhood 4 years ago. Still have not received friendly service, with the exception of the curly haired lady ;). Crazy I would rather spend money at Hillstone where they all know my name and know where I'm from.", 
    "review_date": "2014-12-08"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "102 - 89  No big thing, that's just the final score in game 1 of the NBA Finals featuring the Lakers and those crummy Celtics that I just had the pleasure of watching at Red Jack Saloon.  Sooooo, when some co-workers of mine broached the subject of watching Kobe Bryant whoop dat ass in North Beach this evening, the idea of checking out the action at Red Jack was born. Little did I know, though, that this spot was a well-known Boston bar! Arrrrrrgh! Had I known that, I'd have opted to listen to the game with a strung out trucker named Gil over a CB Radio along the dusty roads of Barstow. But hey... I was already there with some good company (meaning the people I came with), so I really had no other option but to stick it out.  The bar itself wasn't all that bad, but if you're not a fan of Boston sports, you might be pretty annoyed. I guess you have to give credit to those jerks for having relatively good sports teams and being passionate about their city... so I can't knock 'em too hard... but seriously, do you have to be sooooo obnoxious? I mean, they were cursing at The Joker fer Christ sake! There's no reason to bad mouth Jack Nickelson just because he's sitting court side at the Staples Center, right? What about Chris Rock and David Spade?!?! Anyhoo, I digress....  The bar has some pretty decent drink specials, which made up for the rowdy, potty mouthed fans. Though not reinventing the wheel by any means, tonight was \"Thirsty Thursday,\" which meant we were privy to $3.50 well cocktails for the entire evening. They have a chalk board with the rest of the week's bargains, but I was too busy being sprayed with saliva by a rotund gentleman with a thick accent and a faux-vintage green Celtics shirt from Urban Outfitters to soak it all in. But even though I wasn't able to take notes, I'm willing to bet the incentives would leave me with no option but to return at a later date.   They threw in some free hot dogs for the entire bar, so that was a pretty nice treat (if you like manufactured meat byproducts, that is) so even if you're a sports fan in the minority, you have to respect the generosity. If you despise Boston sports, however, you may want to wait until all of their teams have the day off. Just sayin'.", 
    "review_date": "2010-06-03"
  }, 
  "XG-JynrbKiiNaqT4ffdI_w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ossama A.", 
    "review_text": "A good laid back bar in north beach. Doesn't get crowded and it has darts and a bunch of other games floating around (like trivial pursuit and connect 4)", 
    "review_date": "2005-05-23"
  }, 
  "dP2vQRFB0xK5bD-aCGZM1w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda N.", 
    "review_text": "stop number 2 on a random sunday bar crawl. nice bar, lots of seating, lots of tvs to watch whatever games are on, bartenders were nice. they had an \"all you can eat\" bbq going if you donated $5. it looked like they had an outdoor patio seating area in the back but i didn't venture out there because i didn't want to get sucked in to getting some food. it smelled great though. i would come back if i was in the area.", 
    "review_date": "2011-06-01"
  }, 
  "77v-IIrCEjwWYXYq9pI20Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anja H.", 
    "review_text": "Tourists need not bother. No service with foreign I.D.", 
    "review_date": "2012-06-18"
  }, 
  "kyG14FyCWmVW3Uefs_GE_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theron L.", 
    "review_text": "Great bar.  The drinks are stiff and the patrons and bar tenders are nice.  There is a dart board, and a pretty good juke box.   Bonus star for being a half block from my apartment. :)", 
    "review_date": "2008-06-30"
  }, 
  "II3SZQD1NE0zcN4fQqohug": {
    "user_rating": 4.0, 
    "user_location": "Northridge, CA", 
    "user_name": "Danny D.", 
    "review_text": "My watering whole in North Beach!  I loved just kicking back and enjoying my Jamesons and playing darts with my bro's.   Truth S. says it right, for a bunch of Chowder Heads, Mark and co make us Yankee fans feel welcome. When I lived there, Mark and his wife were the best and really made you feel at home. I still have my Red Hook Stein!", 
    "review_date": "2008-09-08"
  }, 
  "cwnT8BJHEo1_0mh-t8h1MA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cassie P.", 
    "review_text": "I am a recent addition to SF. My first week at my new job a few people from work invited me to this quaint dive bar.  It  was on that first night that it immediately reminded me of that kind of home-y, \"Cheers-esque\" pub where the bartender always remembers your name and your drink and serves it with the same warmth and welcoming smile as they did on the very first visit.  While Nicole is usually the one that keeps the Stellas coming, Nick and Mike are equally as friendly with all the patrons, whether they're working or just enjoying a brew like the rest of us.  These people, their friendliness and off-the-cuff humor made my boyfriend and I instantly fall in love with this place.  My only qualm would be that this is a Red Sox bar, being a native New Yorker...well you can understand. : ) However...These are West Coast Sox fans, no offense Red Jacks, that just means we can forgive each other for our baseball teams and drink together in harmony.    This is so far the best place for an uncomplicated after work adult beverage where you can relax play Jenga, sing along to Journey on the Juke Box and meet the kind of down to earth people you feel like you've known your whole life.  Thanks Nicole, Mike and Nick for helping us strangers find our own little nook of SF to call our own.", 
    "review_date": "2009-09-10"
  }, 
  "NvOjbDnMX12YIY8zSPOxsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madison F.", 
    "review_text": "Best pats bar in the city!!!!  Cheap beer, great TVs, great beer on tap, awesome drink specials.  They even have free food when the pats play.  My boyfriend and I love coming here and don't see ourselves watching the game anywhere else anytime soon.", 
    "review_date": "2013-10-13"
  }, 
  "_I-jEFK9dWfE3u_gZz_BfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "angelo b.", 
    "review_text": "best place to drink by the pier, because f the hard rock and their $12 vodkas  Not many tourists, although i like seeing tourists. Some come in at times,... leaving them very open to be hit on! HEY NOW!!  Good stiff drinks, for a very reasonable (Cheap for SF) price.   Last weekend they had The Oscars on one TV, and NBA Basketball on the other... all good!  try it!", 
    "review_date": "2008-02-28"
  }, 
  "jEyb7v42sgIZZhwxnynFfg": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Chuck F.", 
    "review_text": "BEST dive bar nearest to the Wharf BY far. Once I met some drunken crazy Irish guy here who's accent was so thick I thought he was speaking Celtic at times (maybe he was?). He was going on &amp; on in a stupor it was hysterical.  Drunken tourist watching is great here! In &amp; Out Burger is close by which give the extra star.", 
    "review_date": "2009-11-27"
  }, 
  "TLJZzsqtDW-loSGsuvTcwg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adele A.", 
    "review_text": "Amazing $6 Bloody Mary on Sunday! Variety of games, small outdoor patio. They had a \"skinny colada\" which was great. Piña colada vodka, soda water and a splash of pineapple juice.   The bartender Shauna was super nice.", 
    "review_date": "2013-04-24"
  }, 
  "YT__5KZS30Wn0kR6MEdM5A": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Brock B.", 
    "review_text": "I spent a couple weeks in town for work, and they put me up in a Fisherman's Wharf hotel.  I spent the two weeks cursing tourists and trying to find a bar they hadn't taken over.  A few days before I left, I found this place, and I'm tempted to move out there just for this bar.  As every other reviewer has said, this place is incredibly laid-back and unpretentious.  I spent a few nights hanging out with the regulars and had a blast.  Everyone there was really friendly, the drinks were cheap, and OAR's live version of Crazy Game of Poker came on the jukebox every hour or two (it's like 11 minutes long - best value for your jukebox dollar, according the the guy that kept playing it).  They don't do food there, but they have a bunch of delivery menus at the bar so you can have food delivered there.  I even got to meet Darwin Coon, one of the last guys off Alcatraz when it closed, and bought a signed copy of his book right there.  Honestly, I feel a little guilty giving this place a good rating, because I don't want tourists to find out about it - I'll be back in SF again sooner or later, and I'll damn sure be going back to Red Jack.", 
    "review_date": "2007-08-06"
  }, 
  "7kPR3NAhl72EGbUU1h9FOw": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg F.", 
    "review_text": "Well I checked in too early we got rejected for a just expired CDL. Oh well they don't have food anyway...", 
    "review_date": "2013-09-22"
  }, 
  "h--UcE1zaeZwmqQ3M0HMiQ": {
    "user_rating": 1.0, 
    "user_location": "Brookings, SD", 
    "user_name": "Amanda Q.", 
    "review_text": "This bar seemed sad inside on a Saturday night and the drinks were dismal. They had outdoor seating and smoking listed on their yelp info and the party I was with was told they couldn't smoke, because it was a residential area where other apartments were near?! My friend found it annoying that they listed Themselves as smoking allowed but didn't have it.", 
    "review_date": "2013-12-01"
  }, 
  "KbJp5kb-AMB7ixBPref8WA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simon L.", 
    "review_text": "As far as dive bars go, this is a pretty good place. I think they have three (?) plasmas in the place and it makes for easy viewing, esp on Saturdays when I'm in the mood to watch UCLA football. :) The crowds get pretty loud at night though, which is a pain for me cause I live in the next building over... Meh, but it's a bar, I'd expect there to be noise.", 
    "review_date": "2009-12-09"
  }, 
  "4UwdzGAN7CnYha1olmKbrA": {
    "user_rating": 5.0, 
    "user_location": "Gainesville, FL", 
    "user_name": "Sir Paul L.", 
    "review_text": "It's a wicked pissah of a bar", 
    "review_date": "2010-02-04"
  }, 
  "re6fN6eb3NTL7hKK-5CYUQ": {
    "user_rating": 5.0, 
    "user_location": "Boston, MA", 
    "user_name": "Shirleyanne A.", 
    "review_text": "Nicole is the friendliest bartender we know. She welcomed us to the neighborhood and made my drinks just the way I liked it. The drink prices can't be beat and the whole bar is clean. I like the fact that there's a dart board in the back and you can watch sports while hanging at the bar. This is my new favorite bar in North Beach.", 
    "review_date": "2010-12-21"
  }, 
  "TFI8STov0eFGe9fWVFBb2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angel A.", 
    "review_text": "This place is a great little bar.  The drinks are cheap, the people are great, and best of all:  its the only Redskins bar in SF!  Hail!", 
    "review_date": "2009-01-24"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 3.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "Neighborhood bar? Tourist bar? Boston bar? No one is quite sure, even when we could stand there during the 7 minute wait for three High Lifes the answer just wasn't there. These days being a \"Boston bar\" is nearly as common as being a SF bar. I'd likely love this bar if I lived within two blocks of it, but beyond that I wouldn't seek it out. Harsh tones, yes. However, they do complete the age old trinity of being a bar: 1. There's a bar. 2. There's a guy with booze that stands behind it. 3. There's space where you can stand in front of it with the booze you obtain from said guy. Ta da! After that, nothing else really matters. When you're wandering around after realizing that Beer 39 is a souvenir store and not the dingy dive hidden gem amidst Pier 39 that you wished, drink the memories of that albatross away at The Red Jack Saloon.", 
    "review_date": "2013-12-09"
  }, 
  "odq8SUSIT8narMOKlZrg6Q": {
    "user_rating": 4.0, 
    "user_location": "Biddeford, ME", 
    "user_name": "Don W.", 
    "review_text": "I stopped in here with a friend who used to work nearby.  It's one of those \"where everybody knows you name\" kind of bars and my friend had memories of fun times insider.  I can see an afterwork crown gathering here but we arrived a bit earlier and there were some locals that seemed very much at home.  No one knew who we were and it took a while to get anyone's attention, but the beer was cold and that's all I needed.  We hung out for a while and then left because we had dinner reservations down the street.  I doubt if I'll ever set foot inside the place again.  There was nothing wrong with it, but I'm a tourist when I'm in SF and I like to explore new places.", 
    "review_date": "2010-09-24"
  }, 
  "bqQi0VsUBaSZtQiw0PlpNQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Jenessa P.", 
    "review_text": "Love this bar!!!!", 
    "review_date": "2012-09-20"
  }, 
  "EmPr6_Ln9ciSAX2NM6Murg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew W.", 
    "review_text": "If you ever find yourself down at the Wharf--against your will or otherwise--you owe it to yourself to drop into this little gem, a quintessential neighborhood bar under the red awning on Bay Street just east of Stockton.  The bartenders are friendly, real people, as are the rest of the people you'll run into in the joint.  Daily drink specials--including Bloody Mary's on the weekends, when you need them most--are a highlight, as is the stellar jukebox and the open-air space out back.  Tell Mark and Laurie that Drew sent you --and that I said \"hey\"--and I bet they may even hook you up with a free drink.", 
    "review_date": "2006-10-18"
  }, 
  "lky6Ccb8Z1VIb3ii5Cm3oQ": {
    "user_rating": 5.0, 
    "user_location": "Ashburn, VA", 
    "user_name": "Steve P.", 
    "review_text": "Before traveling out to my first trip to CA, I browsed the internet for any bars that may cater to Redskin fans.  Low and behold, The Red Jack Saloon appears.  After a few days in SF, I ventured out and finally found The Red Jack and loved the place.  Loved Nicole, the bartender that night.  Other patrons I met that night were very friendly...we talked sports, music, etc...I felt like I was a regular there....I've never felt like that here in the Northern Virginia area....would love to go back and stay longer.  Lastly, their jukebox contained some great rock music, Alice In Chains in particular!", 
    "review_date": "2010-12-04"
  }, 
  "2cZxkCOtl4CcuTqPRBzc7Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber O.", 
    "review_text": "Redskins bar that opens early for Sunday 10am games. Doesn't serve food but you can get food from other locations and bring in to eat and watch the game.", 
    "review_date": "2014-11-30"
  }, 
  "RyWKKwLzLSWi_8bZd1QWYQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh M.", 
    "review_text": "So after my horrible experience at Butterfly, we decided to trek towards N.beach for some hopefully better bloody mary experiences.  On our way down Bay, we noticed this bar in a unusual area of town - not much else around at all.   We were there pretty early and there was only a couple older locals in the place.  Seemed like a nice local/sports bar.  I noticed ingredients to make a bloody mary on the bar, so I 'thought' I was in luck  ******Bloody Mary Review***** After I order a BM, the bartender grabs a quick pour filled with pre-mixed BM.  First sign things were not going well, since I knew he could have obviously made me one fresh.  He  sipped a small amount himself to make sure it tasted good.  Well I realized that after tasting mine, this guy didn't know what  a good bloody mary tasted like at all, since what I got was HORRIBLE!!!!  It not only didn't taste good, it actually tasted bad.    So I will likely not go back. Any bartender should at least know what tastes awful and refuse to serve me something that tasted that horrible.    It might be a good bar at night, it did seem like it had potential, but I most likely wouldn't recommend the need to travel to this area of town just to go.  Read some of my other Bloody Mary reviews at: <a href=\"http://www.yelp.com/list_details?list_id=YHu-iA23Xj2c1bVa7JROhA\">yelp.com/list_details?li…</a>", 
    "review_date": "2007-01-20"
  }, 
  "Qrj3h5-x7h_oamVvfx8bwg": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Kendall S.", 
    "review_text": "This place was for sure a local type bar! It was fun and everyone was so nice! We had a great time and plan on visiting every time we are in town! Great drinks!!", 
    "review_date": "2014-07-30"
  }, 
  "m8tIaIqVTVwZutcZRt5XRQ": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Beth H.", 
    "review_text": "The ladies who work here are awesome! Free Fenway franks during the World Series!  Good sox crowd all around! Thanks ladies!", 
    "review_date": "2013-10-26"
  }, 
  "b5xky1NsvoaUK4ScJT695g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erica G.", 
    "review_text": "Cool little neighborhood bar that has FROGGER!  Yes, FROGGER!  Usually an interesting mix of people in there, and the service is friendly.", 
    "review_date": "2005-11-14"
  }, 
  "Oq_vsLji0dkDcq_PT0CRjw": {
    "user_rating": 5.0, 
    "user_location": "Woodbridge, VA", 
    "user_name": "Mike Q.", 
    "review_text": "Awesome. Skins fan hangout.", 
    "review_date": "2013-03-03"
  }, 
  "BxxW0IAPxNL_dSAv2U9H5w": {
    "user_rating": 5.0, 
    "user_location": "Manteca, CA", 
    "user_name": "Christopher W.", 
    "review_text": "Best horrible(not) service ever! :) treats you like family; dances with you to random songs. Chad is an amazing bartender. Very friendly very nice and not Irish lol. Bring yourself here, and have an awesome time!", 
    "review_date": "2014-04-11"
  }, 
  "5517Yj-6hxE2IZl0xbRYYA": {
    "user_rating": 4.0, 
    "user_location": "Whittier, CA", 
    "user_name": "Justin H.", 
    "review_text": "My friend and I were feeling spontaneous and left from out southern california town to san francisco and had no clue what we were getting ourselves into once we got to san francisco at 9pm we parked and walked to the closest bar here and this happend to be it the place is decked out in boston stuff I dont mind though the atmosphere in this place makes up for it the people seemed friendly and welcoming", 
    "review_date": "2013-12-17"
  }, 
  "r1AVLdGIUI4pMjnTZgi1aQ": {
    "user_rating": 5.0, 
    "user_location": "Boca Raton, FL", 
    "user_name": "Alex V.", 
    "review_text": "This is a fun bar. We recently moved down the block from this place and we stumbled upon it on a walk from Safeway. We came in it was half way full and the Bartender welcomed us and we had a seat. We ordered some cocktails and we stated conversation with some of the locals that frequent the place.   Everyone is friendly, Northeast fun attitude. Mark the bartender has a funny remark every couple words that will cracked you up. Some of the patrons are young and talk alot of smack that makes you laugh. I swear I thought I was at a place like cheers. Everyone knows each other and if you are new everyone introduces themselves. We met the Laurie, Mark's better half. She was very nice and accommodating.   Thanks for the hospitality. One of our new places to hang out on a Fri after 5pm...   Keep serving great spirits...", 
    "review_date": "2009-04-20"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "not a red sox fan,not a bruins fan, still like this place. it's the consummate sports bar (boisterous patrons, fun bartenders, good quick drinks). they are cool with bringing in a pizza (ask first though) and the door guys are really awesome.", 
    "review_date": "2014-07-21"
  }, 
  "YlsRG3lhGpJFlQPa4bwB1A": {
    "user_rating": 5.0, 
    "user_location": "Greenwood Village, CO", 
    "user_name": "Tanya D.", 
    "review_text": "I really don't want to tell people how great this bar is because then it won't be hidden gem anymore! When I say I love this bar, I mean I LOVE THIS F****** BAR! Awesome staff and clientele! Total local hang out! Love you girls!", 
    "review_date": "2014-11-30"
  }, 
  "EZlYr0ox8w8FbxyH5EhBEg": {
    "user_rating": 1.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Cheeks L.", 
    "review_text": "Passport required for non US ID holders. That's horse shit. We were promptly asked to leave because our friend didn't have a passport to show. I thought we were at a bar in SF, not a border crossing.   I wasn't going to write a negative review about it, I get it, your bartenders are too retarded to decipher someone's age. But, what really sealed the deal on what ASSHOLES these guys are is this:  We were standing outside Red Door trying to figure out our next move when a family riding bikes comes along. A boy about 6 years old is in DESPERATE need of the restroom. His father takes him inside Red Jack to see if he can escort is son to the bathroom (only sign of life on this block) as its an emergency and was told NO!   What kind of dirtbag bartender does that? Fuck these guys.", 
    "review_date": "2013-09-05"
  }, 
  "br6sFuJ5BOAP6NBh4g6HEw": {
    "user_rating": 4.0, 
    "user_location": "Borås, Sweden", 
    "user_name": "F O.", 
    "review_text": "Nice little local bar in what seems to be a quiet area, although the Embarcadero is just two streets down. The bartender was a lot of fun and the atmosphere over all was very relaxed.", 
    "review_date": "2014-08-24"
  }
}