{
  "r0n_EP15m0Eof0Q3Oo-nRA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sweet P.", 
    "review_text": "If you like men in white suits and gold chains, this is the place to be! It was seriously a weird mix of awesome people and some pimps and hoes. I do not usually judge so it was fun until they changed the music from awesome dance music to just downright ghetto ones. Not cool. Everyone was having fun dancing to tall sasha and the dj's after him until they just had to switch the dj to their resident dj. I just had to leave. I believe this skanky lady had to request this type of music so she can dance like a stripper against the dj booth... trust me.. it looked more like she was scratching her back against it...Certain music attracts a certain type of crowd and I definitely do not want to be a part of a crowd that dances like they need to get a room. Never coming back on a Saturday night.", 
    "review_date": "2014-09-07"
  }, 
  "_RpnAO4fH8Ay8WXZdU-1bQ": {
    "user_rating": 4.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Daphne P.", 
    "review_text": "If you're going to Union Square in the evening, stop by the Starlight Room. The décor is interesting and they have a big disco ball in the a dancing area. There was no music when I went most recently. The service was very  courteous and we got a window table. There was actually a plug on the wall so we were able to sneak in a phone charge while we were there, too!  They have a great selection of cocktails that are reasonably priced given the incredible view and location.   I just love stopping in here! Taking in that view and having a cocktail just validates why San Francisco is one of the greatest cities in the world!", 
    "review_date": "2013-12-16"
  }, 
  "TzBKYw3Qqi8SOqV_jX3p3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ramla J.", 
    "review_text": "So, considering I came here on halloween  which may be a bit bias considering the place was more packed for an event than usual. I went there that night for a friends combo Halloween/ 30th bday party and the party was too fun. The space is pretty small for the amount of people they packed into the event. The promoters also give discounts for admission to some people but not others even if you are in the same party, so that was lame! For a party of 15, my friend got a table which gave us ladies some breathing space from the small dance floor and sweaty people.   I didn't see any views. All I saw were the surrounding buildings of union square, but maybe I was at the wrong part of the lounge. Overall, music didn't start getting great til half way through when they played classic hip hop tunes that got the people moving.   The costumes were great to see on everyone. It was fun seeing how creative people are. The hostess of our table was gracious and dressed very nicely. She was great at her job.   I'm not sure if I would come here again, without a specific reason like a friends birthday but you got to try everything once, right?", 
    "review_date": "2014-11-04"
  }, 
  "86PRyfTGtEI4Ne7yxdtw7Q": {
    "user_rating": 2.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Oli A.", 
    "review_text": "I came here with colleagues. We were in town for the night for business and Harry Denton's was recommended by the concierge at our hotel.   When we came in the host did not give us a friendly welcome whatsoever. I was trying to ask him if an area near the bar we were interested in sitting was open for self-seating, but he basically cut me off and said he would seat us in another area. So, I had to ask him again and he finally told us that we couldn't sit there. All the while, no smile and very unwelcoming as if we were annoying him with our presence.   We asked him if food was still being served and he said yes.   We were seated and given one menu for three people.   The waitress, however, was a breath of fresh air--friendly and welcoming.   She took our drink orders while we were looked over the menu. It took us a couple minutes to figure out what we wanted because nothing especially popped out.   Finally, we made a decision and got the waitress's attention and let her know we wanted to order food. She told us the kitchen was closed!! Of course, we were quite surprised because we had been told otherwise by the grumpy host. We asked if there was anything we could be served--bread and butter so we wouldn't be drinking on an empty stomach??? After all, the kitchen would had to have just closed in the 10 minutes or so from when we came in to when we tried to order.   She said she would go an check and let us know.   A while later she happened to come by our table and we had to remind her that she was supposed to be checking with the kitchen for us and she confirmed that there was nothing they could serve us and said that she would bring us the check and hurried off.   My colleagues and I looked at each other a bit confused, because we never indicated that we wanted the check, but we were like, whatever--we're not having another round anyway.   When guests are seated right before the kitchen closes, any good server would ask them if they wanted to put in an order before the kitchen closes. I don't know why she didn't bother asking us.   Meanwhile, the waitress was back and forth and never brought us the check. Finally, we asked her about it and she brought it to us. I was thinking perhaps she realized the she had prematurely offered the check to us and changed her mind about bringing it--then again, she could have just forgotten about it.   I must admit, she was overextended--she seemed to be taking care of the entire lounge until another waitress came on not long before we left. So, she had about 7 tables.   The drink was good, so no complaints there.   The decor was hideous. The upholstery desperately needs to be redone. It is worn and tattered.   The crowd was a random mix.   The DJ was great! Hip hop and top 40s.   The view is really nice.   Only because of the view, I would say that it isn't terrible if you just want a drink and a great view and you know what you're getting yourself into.", 
    "review_date": "2010-05-23"
  }, 
  "i6KYRuZIFAKv56GmuRhxaQ": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Andrea C.", 
    "review_text": "I went for Sunday's A Drag and it was FABULOUS!   The performers were all excellent - Cassandra Cass was TO DIE FOR in her Jessica Rabbit dress. The MC was very good and overall the ladies were all extremely entertaining and funny.   The buffet was also quite good - there was a good variety of food including an omelette bar and a carving station. The drink specials of the day were also very good - definitely old-timey and fit the vibe of the Starlight Room perfectly.  The views were beautiful even though the sun shades were down. It was really nice to be able to see the city from so high up.   I thoroughly enjoyed myself as did the party I went with. We will definitely be returning as this was one of the most enjoyable and entertaining afternoons we have had!", 
    "review_date": "2014-03-30"
  }, 
  "F5M02eIaxcjD_OyFQxmM6w": {
    "user_rating": 4.0, 
    "user_location": "Felton, CA", 
    "user_name": "Artemis E.", 
    "review_text": "We went to the Starlight Room for their drag brunch. It was fun!  The food was good; lots of variety and good quality. Make sure you show up a little early; we got there right before the show, and barely had time to fill our plates before the entertainment started.  I think I saw my first drag show in the early 80's. I've been to a lot of them. The performers for this show were excellent. The hostess had an elegant Olympia Dukakis thing going and sang her own numbers. I really enjoyed her. The performers were gorgeous and really interacted a lot with the crowd.   It was a tourist's drag show, though; pretty clean and not particularly campy. I'm rather fond of amateur, chubby older drag queens with a little chest hair peeking out and a great sense of humor. This was definitely not that kind of drag show. These gals were just gorgeous.  Our server was a lovely little thing; she was very welcoming and attentive.   We had a really nice time. We just about fell over when we got the bill; this is not an inexpensive brunch! We had such a good time, though, we didn't mind the expense.  If you have friends in town, particularly straight friends who want to do something that's a little outrageous and fun, this brunch is a good place to take them.", 
    "review_date": "2012-03-21"
  }, 
  "xoNPKyNUflSBrk86HBthvw": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Keith E.", 
    "review_text": "Two drink minimum per guest per table. Our blonde snooty waitress was kind enough to remind us repeatedly. She wouldn't even bring glasses of water unless we ordered drinks.  She then got an attitude when we closed the bill without buying all 18 drinks. We had a party of 9 people. Two of them couldn't or didn't want to drink for one reason or another (designated driver, pregnant). Other than the blonde waitress's nasty demeanor. The music was great. The drinks were made well. All the other staff there were very helpful. From the man that checked id's, to the coat check lady, to the maitre d, to the bartenders.  I've been here several times and never encountered such a rude waitress.   So the low star rating is purely based on her service.   I'll be back but won't be getting a table...", 
    "review_date": "2013-08-18"
  }, 
  "NZN0XXLiMJPSm_A2Wav_bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana D.", 
    "review_text": "Experienced Sundays a drag today! Fabulous...and my daughter Madellyn enjoyed it well. Food was good but the performers are what made it great! Lots of energy and great performing! I'm now a fan!", 
    "review_date": "2013-09-08"
  }, 
  "OG1NrYwCdlARzD4Qgssz7Q": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Keenan K.", 
    "review_text": "A late cold rainy night. . . so we duck into the Sir Francis Drake in all it grandeur.  We were not dressed in blazer and gown but the door man was really cool and let us in. Live Jazz and a very eclectic mix of people. The Drinks were a bit pricey but very well made.   But not our scene. Cool if you are older or want to hang with older folks. Oh yeah it was a Tuesday evening.....We heard they have a pretty good DRAG show . . . maybe we will check that out next time.", 
    "review_date": "2010-11-24"
  }, 
  "bpgbVPJcG-wQ4cNBcPPIxw": {
    "user_rating": 5.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Monica O.", 
    "review_text": "Sundays a Drag Baby!! Well not at the Starlight! It's a Sunday's Brunch &amp; a Drag show! Holla!  Was in the Bay Area and wanted to do something fun for my birthday,  so went to Sundays a Drag down at the Starlight Room, made reservations for the 2:30pm show, seating for the brunch started at 1:30 and they do serve brunch up to 30 mins into the show.  I was pretty excited to combine 3 of my favorite things, my birthday, brunch and drag show all in one day, knew this had to spectacular.  Let's dish!   1st up the food:  I felt fancy so I had to get the Waldorf salad darling because everyone is having it, and it was great, in fact I forgot how much I loved it. Also tried the Eggs Benedict, they tasted good, egg was cooked perfectly but they were sparely on the hollandaise sauce, man I love that golden yellow sauce, don't hold back!  I also tried the chicken and waffle, a veggie omelet, a truffled deviled egg, some roasted red potatoes, a scone with sweet butter &amp; jelly, maybe a lil chocolate &amp; dark chocolate cake and some chocolate covered strawberries DON'T JUDGE! It was my birthday damnit and I was starving haha.   To drink, had water, coffee and a Bellini, the Bellini was perfect, went well with brunch.   The show was great, I enjoyed it, there were 4 acts all together, and everyone did a great job. I loved the outfits; saw a few that I should flaunt haha. Just a great show for a Sunday afternoon. I would come back to Sundays A Drag in a heartbeat!   After the show they opened up the curtain and allowed us to just enjoy the view, just so beautiful checking out the city views.", 
    "review_date": "2014-08-12"
  }, 
  "tfg1Nhwx94Y4GdQHLVawbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed L.", 
    "review_text": "This is pretty old school place. Definitely not my scene but can see why it has been a Wednesday night staple. This is a hotel lounge that sits on top of the Sir Francis Drake hotel so the view of the city is quite fly. There are a bunch of lounge tables throughout the room with a main bar as you walk in. There are other makeshift bars and a small dance floor towards the back. Crowd is interesting and seems more like tourists. Can be a romantic experience if you're a little bit older in age.", 
    "review_date": "2011-09-29"
  }, 
  "46ohdPOyBDDxw7UOhItc8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha P.", 
    "review_text": "I think \"The Starlight Room\" deserves 5 Stars,  Great view of the city! Good drinks &amp; a nice selection of appetizers. And how could i forget, Good Music! With a live DJ / Band certain nights.", 
    "review_date": "2014-04-20"
  }, 
  "gxL0vm3nJCWcW1WgY4HA8Q": {
    "user_rating": 3.0, 
    "user_location": "Ontario, CA", 
    "user_name": "John G.", 
    "review_text": "This place was just alright .. I mean it's on the top of the building of the Sir Francis Drake hotel and looking over the city, but if ur a bit older then me this lounge is perfect.. It's like a midlife crisis exploded up there.. Music was really good but just a very older crowd", 
    "review_date": "2014-07-20"
  }, 
  "QMSlNf7r2AYVOZRDfV8Gzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz H.", 
    "review_text": "This place gets 4 stars for ambiance and decor. Atop the Sir Francis Drake Hotel, the hotel is gorgeous, and once inside Starlight, the views from the venue were . My only concern is accessibility. Leave the venue before the rush or you'll be waiting for a while.   There were a lot of out-of-towners the day that I went. Music was good. Overall pretty good night out.", 
    "review_date": "2014-09-20"
  }, 
  "DvcAC_nlKaTDsHcA8Slagw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon L.", 
    "review_text": "I believe I tweeted, \"Brunch, cocktails, and drag queens performing 'I touch myself' Happy Sunday to me!\" following Sunday's a Drag brunch at Harry Denton's Starlight Room.   It's a decent brunch selection with a made-to-order omelet station. (<a href=\"http://www.yelp.com/biz_photos/LzE02ibQ8hQR7cm2us3rfg?select=vERjfE8hEAqDta1BuCnlqg\">yelp.com/biz_photos/LzE0…</a>) The buffet included eggs Benedict, salads, breakfast sausage &amp; bacon, smoked salmon, deviled eggs, roast beef, pastries, fruit and more. (<a href=\"http://www.yelp.com/biz_photos/LzE02ibQ8hQR7cm2us3rfg?select=HPSnD-4yp9TAHR2xPgHlcg\">yelp.com/biz_photos/LzE0…</a>) Coffee, tea, and juices are also included but you should probably grab a cocktail before the show.   It is a really fun experience and a nice way to spend a weekend. The jokes can be slightly naughty but tame by regular drag show standards so first-timers need not worry. Just bring your sense of humor and an open mind and let the girls entertain you. (<a href=\"http://www.yelp.com/biz_photos/LzE02ibQ8hQR7cm2us3rfg?select=pOWaMHboevBXLdTPa8V4Wg\">yelp.com/biz_photos/LzE0…</a>)  All in all, Sunday's a Drag is good clean fun that is also just oh so San Francisco. I mean come on... brunch, cocktails, and drag queens performing \"I touch myself.\" Happy Sunday to me!", 
    "review_date": "2011-10-22"
  }, 
  "kOadQdLhZJaX5qY6RWMUPQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Li Y.", 
    "review_text": "Watch out for the bartenders here. They're shady as hell. I ordered $36 worth of drinks and they \"preemptively\" charged me for $50 as if I was some dumbass tourist. Who does that?! ONE STAR FOR YOU.", 
    "review_date": "2011-09-08"
  }, 
  "851VDFg0EozK3pqzkyUOOQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Sir M.", 
    "review_text": "This review is for New Year's Eve.  Harry, you devil.", 
    "review_date": "2011-01-03"
  }, 
  "y_jl-bErj1mnb4KF04F74Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicki L.", 
    "review_text": "Great live and dj music - a fine night out w/ a group or a date - just dance! Fun drag show Sunday brunch, too.", 
    "review_date": "2012-09-03"
  }, 
  "BfKWT0TdVJPc39og4qRvJw": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "MG B.", 
    "review_text": "Love the view and classy:) love my cocktail too! We went there last friday night for our friends birthday lilibeth shout out for her !!we had different kinds of cocktail serve best mixes taste ever,really just good for the night. lots of giants fan and KC came too!Thanks to Kendra she's very nice and excellent service we all had a great night!everybody is friendly:)", 
    "review_date": "2014-10-26"
  }, 
  "tObANvYP7V66eA5fAyGqbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine L.", 
    "review_text": "SF spot that you have to go to at least once in your lifetime! I love what they've done to the place, it's much nicer than the old Starlight room. The food is....hmmm... to be expected for a hotel on Powell St. - it's OK! Not saying it's bad but I just wasn't \"Wowed\" that's for sure. But honestly, let's get to the real reason I go here... That AMAZING view of my beautiful city!! It really is breathtaking and having a cosmo with my girls, listening to top 40s feel good music, atop a downtown somewhat swanky (work with me here) hotel, staring out into the BEST CITY in the world (clearly I'm a native) - you just can't beat that w/ a bat! :)   I'll likely come back again if I have to take out fam or friends from out of town... like I said, you just have to see it at least once in your lifetime!", 
    "review_date": "2015-01-13"
  }, 
  "wr1Y8-yLVCoaDKR4ihiTGg": {
    "user_rating": 4.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Jason C.", 
    "review_text": "There comes a time in everyone's life when signs of old age are unwittingly bequeathed upon us. We notice this when our joints begin to creek, muscles hurt for no particular reason, and a game such as bowling or softball leaves us sore for days. When this time arrives, most of us tend to sigh and admit defeat while others feverishly deny it by saying \"I used to be able to (Insert amazing feat of superhuman abilities here).\"   Your crows feet do not lie. Being able to do something in the past admits you can't perform the same thing now. You're old.   And you go to the Starlight Room.   The music varies from 70s-80s to hip hop, trip hop, rock, and lounge music. Everything can be played except any music above 80 bpm which would undoubtedly explode any hearing devices some patrons wear and cause hip replacement surgery cases  to sky rocket.   Proof this place is old? During Wednesday night Indulgence, the fire department is there partaking in the festivities wearing full uniform. You can't fool me. Underneath that jacket hides a defribillator. I see the hump. And those lovely lady lumps from the Go-Go dancers. <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DLgLCqhkraxI&amp;s=e70095afef1afd76cb0a7347cbd2613a7656305d63ff9bd59e007bcf212f02fe\" rel=\"nofollow\" target=\"_blank\">youtube.com/watch?v=LgLC…</a> I even took a video because one day I'll be too old to remember what I had for lunch.  A varied crowd from the freshly graduated \"I want to grow up but can't really afford the $10 vodka/cranberry\" to the \"I need a cane to get to the dance floor\" comes mixed in a unique combination of random chaos theory. The great thing is that it works. Everybody's got a place in the Starlight Room. The 3 room areas are spacious, the view from the top of the Sir Francis Drake is breathtaking, and during the holiday season, Macy's lightshow is visible and adds to the ambiance by reflecting cool Christmas light patterns off the disco ball.  That is, if can remember it...", 
    "review_date": "2008-12-05"
  }, 
  "59XuKFMlnZkS6uqHeclouw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sherylle W.", 
    "review_text": "The Red Lobster of nightclubs.  This is the only \"club\" that Matt will consider going to and I don't go clubbing without hubby, so I'm between a rock and hard place.  More cheese than a large pizza.  Whateva -- I have Wii Dance Revolution if I want to party!! LOL!!", 
    "review_date": "2012-02-25"
  }, 
  "x3NsAlkSGb2hvd8XcvzFQw": {
    "user_rating": 1.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Melissa J.", 
    "review_text": "Rarely do I write a one star review, but when I do, the one star is surely warranted.   Long story short, we came here as an \"after party\" to a wedding. The bride had pre-paid for all of us to gain entrance, and we were all given wrist bands. Apparently the people who sold the wrist bands had not communicated with the incompetent \"bouncer\" manning the entry on September 20, 2014.   As guests of the wedding poured out of the elevators, all wearing wristbands, this \"bouncer\" proceeded to swear at us, using incredibly rude and foul language, and humiliate us. There is never a reason to swear at a customer.  Hey dude, did you ever think to speak nicely to guests or ask management what was going on? Guess not.   About 30 minutes later we were finally let in, turns out the wristbands were pre-paid! Oops! They made a mistake, no apology was offered.   We proceed to go in and sit down and unmarked tables, ready to order drinks. We saw other tables marked reserved, so obviously didn't sit at those. Another incredibly rude staff member stomps over, treats us like 10 year old children, yelling at us to get up and move. The flippen BRIDE on her WEDDING NIGHT was sitting there, but still yelled at and made to move, no reason given. (?)  After that, I chose to leave. No place that treats me like that is going to get any of my $. I just feel bad for my friend, the bride, who had a gorgeous and amazing wedding prior to the Starlight Room. She shouldn't have to put up with that kind of crap on her wedding night, especially when she had previously pre-paid for her wedding guests to gain entry.   I would rather have my eyeballs gouged out with a hot metal spoon than return here.", 
    "review_date": "2014-09-25"
  }, 
  "cJCYCEfDL4n5TgU9y8RTWg": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Allister D.", 
    "review_text": "You know, as weird as this may seem, I actually find this place a bit catchy. Yes I'm a fan of this club. First off, you take this nice walk up the Sir Francis Drake steps to the lobby. Here you encounter a mini lounge bar just to start things off I guess? Then you take the elevator 21 stories up to the very top. Wala! You're here at Starlight.   Punch in your ID and you're in. The first thing I noticed was the nicely old fashioned yet glamorous bar. It looked like it flew out of an opera scene. Then I walked around with tabled here and there, rich white folks socializing, company parties late at night, and then I see the dance floor. The view is amazing from here! The best view of Powell and some parts of Union Square.   The crowd wasn't my type though. It seemed like a cult gathering full of rich folks. The DJ was ok. He played some good music. The lighting is dark and it sets the mood for lounging here. I'm actually thinking about gathering some people of mine and chillin up here for a bit. I kinda like this atmosphere?! LOL", 
    "review_date": "2012-11-16"
  }, 
  "yddl4fiufL2q311OPlwJbQ": {
    "user_rating": 3.0, 
    "user_location": "Elk Grove, CA", 
    "user_name": "Janet M.", 
    "review_text": "This would be 5 stars if they got rid of the karaoke wanna be's lounge act they had on Friday nights back in November when we were there! Robert and Michael are angels! They made our night memorable! Please do your establishment a favor and keep your DJ gainfully employed! Other than that our party of 8 had a total blast!  Definitely worth checking out if you are 30 plus.", 
    "review_date": "2012-04-24"
  }, 
  "h9unlpk_s18jhml22Jt6aQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chum L.", 
    "review_text": "I've been here to dance in the evenings and brunch with the drags in the afternoon. Can't really tell you which crowd I like better. Both are awesome in their own way.   Did you know they'll kick you out if you are sleeping? Yep, we got kicked out (deservedly so) because my drunk blond couldn't stay up. Prior to that, we had some strong drinks and a spin around the dance floor. Fun, fun, fun.", 
    "review_date": "2011-12-06"
  }, 
  "KJ_0tYPk3VeoNun0s4RkBA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura D.", 
    "review_text": "Oh, you know. Just another normal Saturday night for me and a few of my girlfriends. What to do...? What to do...?  What else? Go to Harry Denton's Starlight Room!?!?  Well, we thought it was funny and more than anything, random. Walking through the Sir Frances Drake, I felt like a tourist. Upon walking into da lounge, we were promptly seated. Music was booming- think, fun dance wedding music. I did appreciate the band's coverage of Earth, Wind &amp; Fire and Michael Jackson songs. Rock on! It's very dark inside and I must say, the furniture is nothing luxurious (booths and chairs were ripped, old and worn), but the view....ahhh the View!  The view of San Francisco is beautiful. You gotta go to Harry's at least once, just to see the view.  The drinks were decent- I recommend the Napa Crush. The service was okay, however, I did not appreciate how the waitress charged our friend's credit card on file for the entire table's drinks prior to showing us an itemized receipt (seriously, WTF).  It's touristy. But it's worth a visit, at least once. On a clear night.", 
    "review_date": "2010-01-05"
  }, 
  "1o8osR2eL3HlrWbKO3lUUw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "WaitingIs F.", 
    "review_text": "Know first that this *is* going to be a pricey venture.   I'm guessing that if you can't  afford it, that's by design - just stepping off the elevator of the 22nd floor, you know this is a classy joint.   Your first hint might be the beautiful creatures in elegant black evening gowns who greet you.   Perhaps it's the dramatic, smooth style of decor that in this place, on this floor, sinks you into a Casablanca mood, but in any other setting would look tacky and garish.     If nothing else tips you off, the menu will.   But you're not coming here to drink or to get drunk, or at least you shouldn't be.  If you are, you're missing the point.   Come here to dance, come here to see the view, come here for the caramel gelato... but mostly, come here to be a part of the atmosphere.", 
    "review_date": "2012-03-02"
  }, 
  "tac_Kc8jf6Vp68DVjPMhxg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elle T.", 
    "review_text": "Great views, great drinks and great people. Michael has to be the best manager of any lounge/nightclub I have been to. He and his staff know how to go above and beyond to service their guests. They took a bleak looking night and turned it into a night to remember. Thanks all at Starlight!", 
    "review_date": "2013-11-02"
  }, 
  "6S-NbThL4mgbBN2BFwNAew": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Brian S.", 
    "review_text": "I recommend the \"Cable Car\" cocktail, a special cocktail design and invented by the world famous Bar Chef Tony Abou-Ganim. In the San Francisco, Harry Denton and his clubs are an institution This place has is no different, it has wonderful city views, great atmosphere and ambiance.  The service is incredible, the Bar Chef's are professionals and make outstanding cocktails. The staff is gracious and accommodating.", 
    "review_date": "2012-07-29"
  }, 
  "gmAIKkmru-gBAEMkSQky2Q": {
    "user_rating": 4.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Lisa G.", 
    "review_text": "I was here on a Saturday night, 2 weeks ago with my girlfriends and we had an amazing time. Yes, I agree with everyone that the drinks  &amp; food were expensive but hey, it was my BFF's birthday, so it didn't matter.  We enjoyed the live band, can't remember the name of the band but they sang mostly hits from the 70s, 80s, and 90s.  Great view of Union Square at night and the hotel it's located in is very beautiful.  I think this is a great place to go have a drink with friends, listen to music, and go dancing. It does cater to a more mature crowd from what I saw that night but there were people of all ages there.  I am really looking forward to going back!", 
    "review_date": "2011-05-14"
  }, 
  "jTXtSuXT-1CMPzEk-Mvtzg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ness V.", 
    "review_text": "A night out on the town lead us to the Starlight Room.  Easy parking across the street; always nice when a gal is dressed up and wearing her heels! It was easy to find and the building has an old school San Francisco quaint charm with plenty of style.  We had a reservation and got a nice booth. The host was so charming and sweet! What a doll! The table service was not bad for a nightclub that was pretty busy, we got there at about 9:30.  The drinks were good and strong and the apps. were also tasty. We had the deviled eggs(creamy and crunchy with the bacon on top), prawn cocktail(classic large prawns with yummy spicy cocktail sauce), and the crab cakes(crunchy and well seasoned). My favorite was the ambiance and the mix of people. The cocktail gals were all dressed in their classic sexy all black dresses and were beautiful. The view was great and the DJ was playing a nice variety of music. There is also a coat check if your so inclined.", 
    "review_date": "2014-07-26"
  }, 
  "w0OivdKTZdNrYO0mUGAjQQ": {
    "user_rating": 3.0, 
    "user_location": "South Boston, MA", 
    "user_name": "Chris M.", 
    "review_text": "Ducked in here for a drink to see the view on a weekday night.   Didn't pay a cover, did buy a glass of wine.  It was good.  There was a disco ball and a big view of union square park.  Both cool things.    This place has a very cool old hollywood vibe.  it's fancy, and a place you go to be fancy.  I wouldn't spend all night here drinking, but I would tell someone to go here and grab a drink if they are in the city.", 
    "review_date": "2014-02-15"
  }, 
  "ELhUmXHXSYxTH6lgbfMHCw": {
    "user_rating": 1.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Brian G.", 
    "review_text": "The DJ was terrible.", 
    "review_date": "2014-08-24"
  }, 
  "K-yij8EBuF2wzk22BDVAIw": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Suzanne B.", 
    "review_text": "Cocktails are overpriced, but the view is fantastic. The music is really cheesy but fun for dance parties with all girls.", 
    "review_date": "2013-08-08"
  }, 
  "rqIoGREECusC54Dsblvb4w": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Rebecca D.", 
    "review_text": "Perfect for dancing!  My mom's friend was visiting from Canada and wanted to go dancing, so I looked up placed on yelp and settled on this. I'm so glad I did. We arrived on a Friday night around 9pm and they didn't charge us a cover.  We parked for free on Bush and Powell, right by the Stockton garage (which was only $8 for the night).  Almost all the tables were reserved but somehow we managed to get a great booth near the dance floor and band. It's a really cool atmosphere with comfortable seating and really great music. My mom is 60, her friend is 50, and I'm 35 (all women), and the variety of ages in the club was perfect for us. Ages ranged from 21 to 70, with most people in their 30s and 40s, I'm guessing.  The ethnic makeup was a nice variety of white, asian, black and hispanic. The crowd was okay looking, not bad, though if I was single I might have been disappointed.  The music was really impressive - the live band played a lot of great 70s music, nice variety (of 70s plus other decades, including the recent \"Crazy\") with lots of energy for dancing.  The singer was awesome - he sounded like Stevie Wonder,  great range, style and tone. He was also great with the audience, moving around occasionally, made lots of eye contact, plus he's hot.  The guitarist and tenor saxophone player both played lots of incredible solos (effective melodic builds and structure, great music references, tons of energy), and both were also great supporting players. The keyboardist and drummer really kept the music moving well, and the keyboardist has a nice voice for backups and lead vocals.  The DJ spun great tunes for dancing (the live band and DJ traded off).   The dance floor is a great size, at times filled and sometimes empty, but never made me feel crowded or self-conscious (a few people sitting can see the dance floor, but if you don't want to be watched, no problem finding a spot). Some men asked all of us to dance at various points in the evening (we stayed past midnight), but none of them became persistent, so that added to the experience.  I wouldn't go here to meet someone as a single person, but it's perfect for couple and those who just want to have a great time out, drinking and dancing (and if someone in your party doesn't want to dance, there's no pressure with the way it's set up - my mom sat in the booth for much of the night).  The host, Robert, and our waitress were both very attentive, friendly and efficient. We had drinks when we wanted them, and were not pressured to buy more when we were finished. We also felt safe to leave our belongings at the booth unattended, but I also brought my purse to the dance floor because their is a shelf on the edge where you can place drinks and belongings - perfect. The view is incredible, most of the night I felt like I was dancing with San Francisco.  The bathrooms are also nice and I never had to wait. The live music was piped in, too, which I appreciated.  The drinks were tasty. I ordered a Devilish (very light and refreshing, nice girly drink) and a Napa Crush (tasted more like alcohol, still sweet and delicious). My mom ordered a martini (thumbs up) and a Brambo (I think that was the name, it was really good with sweet and sour flavors). Her friend ordered two Cherry Bombs, which she obviously liked (less sweet than my drinks, good for both men and women).  All drinks were $10 each, except the martini ($10.50).", 
    "review_date": "2010-07-24"
  }, 
  "bW2LMBS-D-qAgXfpeof3UQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina S.", 
    "review_text": "First time I've been here so I have nothing to compare with to how it was before.  But the view is AMAZING! You can see the entire downtown SF area. Gorgeous red and gold walls with velvet booths and chandelliers galore.  Very classy.  Cant give this a good review because one...they use pisco for their drinks and its a bit on the sweet side for me. I did enjoy the Glenfidditch tasting tho. I could've given a review for the food, but honestly I didn't have any!!!  All I had was a little cube of watermelon with a hot pepper on it.  Thats it!  They needed more tray passers. They had more waiters coming out to collect glasses than to serve food.  If this reflects the service at this place....I think I'll pass for now.", 
    "review_date": "2011-10-12"
  }, 
  "2844knqT5JznVAJqiDVyBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Judi B.", 
    "review_text": "I really was digging this place. The ambiance was romance and maturity and sexiness all at once. Came here for a cocktail with the beau after a nice dinner. The drink was fabulous. More on the expensive side. There was a dance floor with a few brave souls (it was on the earlier side). My only complaint was the DJ. Definitely room for improvement in that area. I'd go back again.", 
    "review_date": "2014-02-02"
  }, 
  "XxiDDY74IneLe0nDgVtMhQ": {
    "user_rating": 5.0, 
    "user_location": "Lincoln, NE", 
    "user_name": "Mike K.", 
    "review_text": "Top shelf bar work.", 
    "review_date": "2013-08-17"
  }, 
  "OIjzXPIALLmOyXNk1CahDg": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Santa C.", 
    "review_text": "Santa here!  I visited the lounge Friday and Saturday night to check out what all my elves were raving about.  Wow!  The place is classy, like the old style lounges of 50 years ago. I was impressed by Derick the manager and all of the beautiful staff.   Most of the guest come dress to the nines, which of course, added it's charm all the more.  Two birthday parties, 100 photos and a few drinks, plus dance, dance and more dancing - Santa was happy.   Go there and enjoy life.  Merry Christmas!  Santa .", 
    "review_date": "2013-12-22"
  }, 
  "uzdUXO3OPI2Czt14aUrDvg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren T.", 
    "review_text": "Despite what you might hear, Harry's actually has a young crowd.  That is, if you go on the right night.  On Wednesday nights, 20 to 30 somethings take over the Starlight Room lending a youthful vibe an old San Francisco staple.  From waiters in tuxes to dolled up divas, you can put on your best dress and not feel the least bit over done, even in the middle of the week. Harry's takes you back to a glamorous era, before designer jeans and $100 sneakers existed. If you're the type of person who loves to dress up, but never has the right place to wear over-the-top attire, this is it!   Dance the night away atop Union Square and see what makes the Starlight Room a true icon!", 
    "review_date": "2010-01-02"
  }, 
  "plY-YHJtnPPdZhfQnw49mA": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Carol H.", 
    "review_text": "The dj is great there, the view were great but the crowd was just not exactly what I m used to. I feel like a little too tourist there and a bit older than I thought it would be. The place was great but not quite for me and my friends. I always see the light from union square and always wonder how it is up there. I wouldn't mind coming again if I have the right people with me.", 
    "review_date": "2013-11-08"
  }, 
  "uXybf-Hg0cpCHj8i7C2lIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shell J.", 
    "review_text": "The night view on top of St Francis Drake Hotel was brilliant. The club ambiance is classy. Love the cocktails and food, and price is not too crazy as expected in a hotel like Drake.   Would love to come back!", 
    "review_date": "2012-10-25"
  }, 
  "3xsmXxDysn5yqflq3AzWKQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim N.", 
    "review_text": "I had been to the Starlight Room once on a visit to San Francisco, but hadn't been back since moving here.  I came here for some after-work drinks and appetizers on a Friday night, rolling in around 6:30 before the place started getting really busy.  The host gave us a great table looking out to the western parts of the city; at 20 or 30 floors above the city streets, there really aren't any bad seats in this place, but this one was particularly nice.  We ordered some speciality cocktails.  My wife got the \"Old Havana,\" the Starlight Room's take on a Mojito.  I enjoyed a Partida Margarita with plenty of salt.  We also ordered the \"Mezze\" plate, which included a very tasty hummus along with pita bread, olives, radishes, and tomatoes.    The staff was particularly courteous and we were not disappointed with our drinks and food.  Overall, 4 stars for this downtown establishment!", 
    "review_date": "2010-07-26"
  }, 
  "A_BT4EcxzNj-vNXlefXOPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lianne M.", 
    "review_text": "Interesting place. Went there on a Wednesday night, it was crowded because of an event that was happening nearby. Mature crowd, didn't see many college-like kids.   Excellent view, especially at night ( hence starlight room!)  It's located at the top floor of a hotel. The dance floor is small, but had great surround view of the city.  Plenty of seats and tables for those who want to chat with friends, rest, have a small bite. It's not a typical clubby place, i like having the option of being able to find a seat easily, and not being disturbed there as a female.  Bar staff was nice, cocktails were great, typical drink prices at place like this. Overall nice experience. Go for the view at least once! I think it'll be a nice place for holding a birthday celebration.", 
    "review_date": "2014-10-10"
  }, 
  "S-pogcHooYAxJl51ZC5l6w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shvonne A.", 
    "review_text": "If you live in the area, you've probably been thinking about going to the drag brunch forever and just never seem to get around to it. I finally I did, because it was for Easter brunch and I finally had the day off.  I've been to alot of drag dining and I'd say its pretty safe to say you come more for the show than the food. But the food was great. Brunch buffet, everything was super tasty and good assortment. Food for the whole fam. But again, the food is just there to absorb the mimosas while you are being entertained by these lovely ladies.  Donna Sachet and her crew put on an amazing show. At some points I was cry-laughing and some points just being in awe at how gorgeous these girls are. Loved every bit of it.  GO.... take some out of towners and a sense of humor and an appetite for champagne and chocolate dipped strawberries.", 
    "review_date": "2013-03-31"
  }, 
  "GLo8rwIC0lhVSsG0s8p4tA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Tina P.", 
    "review_text": "I've only been here once on vacation on a Tuesday night and it was the PERFECT place to catch a drink with a great view of the city. The staff was incredible and very attentive. Drinks were tasty. The atmosphere is very old money feeling with comfy booths and thick window drapery which was a nice change of pace from all the ultra modern lounges that seem to be popular today.  I only regret not coming here on a Wednesday or Sunday. Maybe next time!", 
    "review_date": "2010-07-24"
  }, 
  "NdAHXPry1Sj0mrzuCywcDQ": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jason S.", 
    "review_text": "Only thing that bumped this up from a 2 star to 3 star is the location. What a view! The insides look posh and there are usually hot girls(paid working girls) here (and a few real hotties), but over all it's more of a ghetto fabulous wannabees. Really the music is really last decade news and most djs don't transition that well. Burlesque dancers in the lounge area are hot! The vibe's more a poser and wannabee crowd. Drinks are expensive and really you feel like you get stuck in a small space. And you don't want to leave because the cover was so expensive, plus to get to another venue takes effort going down stairs and walking around to the nearest club. If you've got a tourist in town who's never been here or seen the city take them here. If you want to have a good time without feeling like you're just watching your wallet drain away come here.  Really though. What an awesome view!", 
    "review_date": "2014-05-04"
  }, 
  "c8jo-_rquR2In4jubJC7Dw": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Stephanie L.", 
    "review_text": "I just had an awesome time at the \"Sunday's a drag\" brunch and drag performance   The food was pretty good and included a prime rib carving station and omelets  to order. Salads and eggs Benedict were yummy. There was also a lot of fruit and even chocolate covered strawberries.   Now to the performers: Miss Tia was my favorite.  Her eye makeup was fantastic.  I wish I could do something that glamorous.   Our mc Donna Sashay was so hilarious ! And she sings so well. Part of her act is to talk about the conference for forensic toxicologists. It's supposed to be random but I actually get emails about that conference!!", 
    "review_date": "2013-04-28"
  }, 
  "tXKTfiUh_3R1En0xYonXdw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben P.", 
    "review_text": "If I ever need someone rubbed out by a guy named Ivan, I now know where to come.  It's only when you actually see them together that you realize that Russians and Persians are destined by Almighty God to party together.  Never before have I seen so much chest hair, 4-carat gold-plated neck gear, or bootleg Armani/DG. gear.  I did, however, appreciate the opportunity to pay $15 for a martini.  You don't get that option every night.  Lots of deep pile red carpet, too.  I anticipate that's so that they don't have to do much cleaning after Ivan the Iceman gets shanked at his table.", 
    "review_date": "2010-02-16"
  }, 
  "eAof6W9IJw0KM9Na6hx5qg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie L.", 
    "review_text": "THIS PLACE IS REALLY FUN,  the only downt thing is that the drinks at the bar are pretty expencive, but is really fun.the view is amazing. THIS IS THE TYPE OF PACE THAT A COUPLE SHOULD GO. IT WOUNT B FUN GOING SOLO.", 
    "review_date": "2012-03-31"
  }, 
  "77Qa_ftGGDtTY7Ui3BFpiA": {
    "user_rating": 4.0, 
    "user_location": "Jacksonville, FL", 
    "user_name": "Virginia M.", 
    "review_text": "Fun band and pretty view. I would love to order one of their punch bowls but I don't have that many friends to drink it with!", 
    "review_date": "2012-09-07"
  }, 
  "t-PmN1OFRTLE0B3xa20HXQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Cassandra C.", 
    "review_text": "Came here on a Saturday night around 10pm and the line wasn't very long so I thought the place wasn't that busy, WRONG. Once we made it up the elevator to the 21st floor we saw how many people there actually were.  We waited in another small line where our ID was checked and luckily didn't have to pay the cash cover since we were on a guest list. Thanks Sebastian! This place is gorgeous! I definitely felt fancy as we were walked over to the table where he had bottle service. Everyone that worked here were all dressed very classy and had great customer service skills, checking back often to see if we needed anything.   The starlight room has a great view of downtown. It looked beautiful as all the buildings outside were lit up against the dark foggy sky. I'm sure it's equally as beautiful around dinner time here. There are plenty of tables and seating that are reserved for bottle service. The dance floor is a little small so I'd definitely recommend getting a table with a group of friends. Otherwise you'll be stuck on the dance floor the whole night where it started to get really hot and cramped. Around 11 it was so hot the windows were fogging up and you could no longer see outside.   I've read that there's generally an older crowd here but on this night there was a good mix of younger and older.  It was a lively crowd and the music was good. The DJ played top 40 and that's what I like!", 
    "review_date": "2013-07-29"
  }, 
  "PfpRvMAESbC2bC8FUIMdNg": {
    "user_rating": 3.0, 
    "user_location": "Scottsdale, AZ", 
    "user_name": "Danielle B.", 
    "review_text": "This place is definitely a tourist destination with great views. The ambiance is interesting. I felt like I was walking into a swanky bar from the 60s. The drinks are good, but a little pricey. They have a $5 cover after a certain time in the evening. The music they played the night I was there was mainstream. It was fun watching the 40-50yr olds dance to it, they were pretty good lol.", 
    "review_date": "2012-05-11"
  }, 
  "RAVo9jp8D6dFiuBzy_ywXA": {
    "user_rating": 2.0, 
    "user_location": "Panorama City, CA", 
    "user_name": "Crystal H.", 
    "review_text": "The bouncer at the door was really nice. He says that it mainly depends on who's near the bar. If there's young people, most likely a lot of the younger crowds go in, but if there's an older crowd, then older crowd go in. Also, cover is based on how packed the room was. We went there at 9 ish and it was pretty dead ($5 for cover). People were still having dinner. I was starving so we went out for food hoping that it gets happening at 12 ish.   On the way back we saw three girls walk by ready for the fun night out but to realize that they were just leaving...and my friend and I was like if they're leaving, upstairs must really suck. And yes, it did! but we made the best of it.  I mean at some points it was good towards 1 o'clock. The crowd was very mixed. There was even a wedding and there was bunch of cliques (meaning more than 4 people) and not couples. Probably partying it up after work (since it was a Friday).   The music was mostly 90s. Not a lot of current top hits and I swear the DJ couldn't mix since he played the whole song from beginning to end. The view is nice though, you can see Union Sq from the top, but that's about it.", 
    "review_date": "2014-03-13"
  }, 
  "9J1xGTCIzczJmDzrHTk0fw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "scott l.", 
    "review_text": "First things first, everything in Downtown SF is EXPENSIVE, especially for a grad student looking for some fun. But if you know me you know that empty pockets wont stop me from gettin giggy with it, yeah, I just said that. So, I went to Starlight with a couple of hotties on a Wed night. The DJ was sick and the crowd was pretty mixed. Everything from your low-end douches to your Suit's were getting down and dirty on the dance floor. The women... well let just say that my eyes were wide open all night, hard thing to do for an Asian.   Getting right to it... The music was good, but it was a Wed night not sure what they play on other nights. The girls were plentiful and the crowd was all about having fun. The down side is as is everyplace DT San Francisco is the high admission charge and cost of drinks.   All in all it was a good time. But I'm a firm believer that its the people you're with and not the venue that makes a good time.", 
    "review_date": "2010-09-26"
  }, 
  "UqkrP5O2ToeXRcYbp7okIA": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Cassandra E.", 
    "review_text": "I've been here a couple times now. There is a lot to love about Harry Denton's starlight room-- It's almost like a historical landmark of San Francisco.. with an awesome view of the city and Union Square. The lounge is draped with red curtains, that appear to be straight outta the 70s and there are typically plenty of places to sit, as well as tons of space on the dance floor to move around. Either there has been a dj playing music or a live band playing music every time-- this last dj on Wednesday night was okay. I don't know if I would ever plan a whole entire evening at this lounge, but it always a fun place to stop on a night around town. ;-)", 
    "review_date": "2012-03-03"
  }, 
  "_GDtwyFtI8EYlddRo3qq4A": {
    "user_rating": 5.0, 
    "user_location": "Atascadero, CA", 
    "user_name": "Roxie P.", 
    "review_text": "Went to the Sunday's a Drag brunch this past weekend. The brunch was amazing and the show fantastic!  Anything you would want in a brunch they had.  Everyone is able to see the stage. a great value for the price. Performers interact with audience.", 
    "review_date": "2013-09-21"
  }, 
  "BOU25_BWQnLdFJBKUe2XdQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M C.", 
    "review_text": "Came here with a group last night and I was bored before I paid $15 cover. Starlight is a lounge area on the top floor of the Sir Francis Drake, a design which really needs to be remodeled.   The place is a mixture of Peppermill that once was in Daly City and The Cafe which is a gay club in the Castro. Once one walks in there is a large bar on ones left and coat check and restrooms on the right. Walking in further is tables filled with people eating. So if your here for food, your going to have a bunch of people walking around you trying to squeeze into a tiny dance floor. And if you are hear to dance, your dancing to 80's music on a tiny little dance floor.   Just the combination of a restaurant and dance floor in a dilapidated decor isn't that bad when your talking about a small room to begin with. But to charge people a $15 cover just to do so is outrageous.", 
    "review_date": "2009-06-14"
  }, 
  "SF0d8N7Tob6my62wbIHSxQ": {
    "user_rating": 2.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Cari T.", 
    "review_text": "Amazing view!!! Awful drinks. If a bartender can't even make a good vodka tonic, there are issues. If you go, order wine and enjoy the great views!", 
    "review_date": "2014-08-12"
  }, 
  "-K2Tcgh2EKX6e6HqqIrBIQ": {
    "user_rating": 2.0, 
    "user_location": "CA, CA", 
    "user_name": ".Hon H.", 
    "review_text": "I came to the Sunday's a Drag brunch recently with some friends to celebrate a special occasion. The show was a lot of fun and the food was pretty good, but we didn't appreciate the waitresses trying over and over to get us to buy their overpriced drinks. I had wanted an iced tea and they told me they didn't have any. Oh, come on! This is a hotel with several restaurants.   Well, an iced tea was miraculously procured abut 3- minutes later, bu they never refilled our water glasses, despite several requests.   Add the lousy service to the fact that a mandatory 20% tip is built in (no mention of that is made on the website or when you make a reservation), two stars is just about what the place warrants.  Oh, and we were a party of four - a small group that didn't warrant a mandatory charge in my book.", 
    "review_date": "2011-08-15"
  }, 
  "7rAjfK9cJ0sOsvu1Pg_0yA": {
    "user_rating": 3.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Brook M.", 
    "review_text": "Sunday Drag Brunch...Food is average, service was decent and the show was tired! Sorry guys but you are lucky to be getting the three stars. Great concept and amazing venue however the show's lady of the evening phoned it in! Be fresh, be relevant and give the appearance that you enjoy what you do!", 
    "review_date": "2014-09-11"
  }, 
  "6HfGx_gVu1IHFnPL66kAOQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jaime L.", 
    "review_text": "I've been hearing about the Starlight Room since I was two and a half feet tall. That didn't set me up with any unrealistic expectations, surprisingly.  My only expectations were of the view. I mean that's all I ever heard about it, coupled with silly stories told behind grandiosity. Funny how the stories didn't stick, but rumors of the view did. The view came through. I took a million and one pictures that I will keep under my pillow.   Moving my eyes from the beautiful outside to the beautiful inside, I spotted divine household accoutrements that would fair well within my humble abode - mostly sofas and chairs. I didn't take any home with me, but there's always next time.   As superficial as I tend to be with regard to aesthetic design, the mishmash deejaying and interesting array of people didn't phase me. Although, an interesting array of folk is something I do quite enjoy, mishmash musical adventures are not. I heard music from every genre that night. Maybe we can attribute this to it being a weeknight.  Mr. Denton, I plan to return to your room sometime in the near future.", 
    "review_date": "2011-12-10"
  }, 
  "2R8Fh3tdzfIx8jRQuRF6kw": {
    "user_rating": 4.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Kelly H.", 
    "review_text": "Really love this place. We parked around the corner at 450 Sutter which is a 24 hr parking facility. Its tough to park around the hotel on the street, and Union Sqare garage is hit or miss, so try the Sutter garage.   We arrived to the Starlight Room about 8pm this past Saturday and stayed until 12:30. We got in before 8:30, so there was no cover charge. We were lucky enough to get a window table. I love the lounge itself with the sexy old school vibe, lots of  deep red texture carpets, high back 50's club style table settings, the shimmering gold bead curtain details, and romance in the air with the stunning views of the city through the walls of glass windows.   The music was very relaxing, slow grooves and classics perfect for the mood and atmosphere of the dining and cocktail experience. Our first server was Kendra. She is very elegant, and beautiful, and really took care of us for the first couple of hours. Every member of the staff the first shift of the evening were spectacular. We got to watch the sunset, and enjoy small plates by candle light. We tried the deep fried mac and cheese, the crab cakes, the chicken nuggets and the shrimp cocktail. I ordered mojitos and the husband ordered chocolate martinis. The food runner and the busboy were both wonderful, although I didnt get their names. Each of the small bites were delicious and great cocktail bites.   We were there to celebrate post nuptials with friends of ours. They arrived about 930, so we closed out our dinner tab to the tune of about $150 including tip. Kendra and staff of the first shift made that worth every penny.  We secured keeping our same table for the dancing part of the evening by handing over our credit card for the tab and were passed along to the second shift, which I will call the dj shift.   Alessandra was our server for the second shift.  Although the uniform is the same, the service level did come down a notch. There were no smiles, and the elegant service converted to a cocktail service. We did not feel the same treatment, but more the standard 'are we ok here?' Type of attitude. We were with a bride and groom and it would have been nice to have some sort of acknowledgment of that, with a smile and a personalized feel, but I digress. For the prices we are paying, we just expect more. I can go to a bar and be served anywhere, but the. Starlight is classy and patrons want that...   There were two Dj's I think. The vibe changed from romance to party time. The crowd was an interesting mix of 30 somethings to 50 somethings. The music was 90s to top 40, and Im not a big dancer by any means, but they got me out on the floor a LOT! We ordered two cocktails each, average of 12 bucks or so each. Our bride and groom sat at an adjacent table with a couple of their friends. I am not sure what they ordered.   As mentioned, The second shift server was not at all nearly as attentive. My husband even had to go to the bar to get a drink for the bride and groom as we waited quite some time for her to serve us... After a lot of fun dancing had by all we were ready to head out. Around midnight or so we asked to close our tab. Alessandra asked if we wanted to combine our tab with our friends table. Um, no, we have separate tabs as secured by our card. No smiles, no thank you, just heres your tab and see ya type of attitude. A TOTAL turn off considering we dropped 200 dollars here tonight! What a disappointment!   The brides shawl, which had been in the back of her chair the entire evening went missing. While the wonderful manager and door staff sought to find it for her, Alessandra seemingly hounded the bride and groom, by going back over to their table grabbing the tab and putting it in the grooms hands to get them to settle it. Um, how rude! They arent going anywhere darling, they are working to try and find her cover up since she IS in a wedding dress and it would be nice to take home the accompanying cover up for her dress on her wedding night. Just sayin!  All in all the experience, minus Alessandra, was wonderful. She loses a star for you. We will definitely be back, we just will request not to be seated in her section.", 
    "review_date": "2014-06-16"
  }, 
  "GT4TT5MOuvCC_9Dde1qGkA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Eddie G.", 
    "review_text": "On top of the world at the Francis Drake Hotel in SF. This place has a great view of San Francisco. Great Atmosphere, good good, what more can you ask for?", 
    "review_date": "2014-03-11"
  }, 
  "j-1qkha4h87wMfNfwPvfqQ": {
    "user_rating": 3.0, 
    "user_location": "Claremont, CA", 
    "user_name": "Paul B.", 
    "review_text": "This Lounge is located on the top of this historical hotel (Sir Francis Drake), it's very classic with some modern touches. Sometimes you feel like your lounging in the 1920's and 1930's and maybe you would run into a Don Draper lookalike. lol  I'm use to go going to the bars and lounges in Las Vegas so I'm use to chic and trendy. This would be nothing but a yawn to me but the 180 view of the city was breathtaking.  They have 3 different areas in the lounge:  1. Bar area: It's a bit small and it gets packed during the weekends because of the live bands and DJ. Bartenders are friendly but they have a limited selection, I tried to order an AMF but they were short on 2 liquors. Boo!! So I ended up order a Jack and Coke and sorry to say that was watered down! I can taste more coke then Jack, I ordered 2 more Jack and coke and sprite and I still felt no buzz. I was pissed but I didn't want to complain, so I just stuck with beer. I asked the bartender what kind of beer they have and he said, Coors Light, Budlight and Heinkein.   Really? Just three different kinds of beers.   Psssh!!  **WARNING** DON'T PAY WITH YOUR CREDIT CARD OR YOU'LL BE CHARGED $50, EVEN IF YOU BOUGHT ONE OR TWO DRINKS AND PAID LESS THEN $20. YOU'LL STILL BE CHARGED $50!! TOTAL BS!!  PAY CASH OR PREGAME BECAUSE THE DRINKS ARE WATERED DOWN!!   2. Dance Floor: The size of the floor was meh and the DJ was lame playing music from 70's, 80's, 90's and some top hits. I was hoping he'd play some house or trance music but you can always get everything. Lots of tourist and Francisco locals here at the Denton Lounge.   3. Table Area: One side of the lounge has an area to sit down and just relax with friends, spouse, bf, gf and etc...   Great to have a conversation while having some fine wine or beer and admiring the Downtown Skyline, Union Square, Bay Bridge and from a distance you can see SFO.  I wouldn't mind coming back for the lounge and looking at the city view. The cover can be expensive at $10 for what you get here but hotels guests get in free if you show your room key.", 
    "review_date": "2013-02-02"
  }, 
  "SyqlLW1fw33Wa2MZsInZqg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan H.", 
    "review_text": "The Sunday's a Drag Brunch is great fun!!!  Be sure to have reservations and bring your wallet because drinks are not free.  The brunch is good enough but the show is what makes it.  Great place to take your mom (I did) as it is during the day and a welcoming show.  We were a group of twelve, but be forewarned - they do not do separate checks so have everyone in your party bring cash if you are splitting checks.", 
    "review_date": "2013-12-29"
  }, 
  "lQlBREgObRMuu-ghO0u4NA": {
    "user_rating": 1.0, 
    "user_location": "Horsham, PA", 
    "user_name": "Sarai J.", 
    "review_text": "Too formal to have such rude staff!  They made us feel so unwelcome that we just ordered a small plate and left immediately.", 
    "review_date": "2014-07-23"
  }, 
  "50KDUCtdS31stl9EvVWc6g": {
    "user_rating": 4.0, 
    "user_location": "Highland, CA", 
    "user_name": "Anisha N.", 
    "review_text": "I love this place. Breathtaking view, nice music on Wednesday nights, friendly staff. We were on the guestlist, so it was free for me and $5 for the guy. The front door people were really friendly, we got there really early so the place was still pretty empty. The bartenders were extremely friendly and fast.  Really love the Wednesday night music, nice hip-hop, r&amp;b, top 40. I danced like there was no tomorrow:-)  I think that this along with the Cellar on Sutter will remain my two fav spots in the city.", 
    "review_date": "2011-04-28"
  }, 
  "ojQ-3kJYJkwNbV56r1DDQA": {
    "user_rating": 3.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Ahmad B.", 
    "review_text": "A really cool place. It's classy, and a great place for drinks. They make an apple martini that uses real apple juice, a must try.  Good service and one of the best views of the City from up there. It's on the roof of the Sir Frances Drake hotel.  If in the are you should go up for a drink. View of the city (5) and drinks a 4.  Cver all a 3.5.", 
    "review_date": "2012-08-18"
  }, 
  "lnDP_h7cGYS3yzjkoCbtwA": {
    "user_rating": 3.0, 
    "user_location": "Midtown, Sacramento, CA", 
    "user_name": "Chris W.", 
    "review_text": "I think their overall 3-star rating is very spot-on. It's nice...but leaves a bit to be desired. I think it's just a little too 80s glam looking right now and needs a little face lift. The views though...amazing! So pretty! Service was swell, drinks were great, great venue for a reception but didn't blow me away.", 
    "review_date": "2012-08-20"
  }, 
  "EO47ao8qAykoK1PGstY4JQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Angelica M.", 
    "review_text": "Visited because if your from SF you have to go at least once. Glad I did but can't see myself going back until I am at least 40 since it's for the more mature crowd. I still enjoyed myself and the view was just as lovely as the pictures portray. I suggest going back for NYE based on the reviews it seemed like the place to be to ring in the new year.", 
    "review_date": "2014-01-30"
  }, 
  "nGozHYFspeWe2DliD9GqcA": {
    "user_rating": 2.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "liz c.", 
    "review_text": "I'll have you know: I AM ONLY A FAN OF THE VIEW.  THE END.  $10 cover. Should be paying ME to come here, shoot. Drinks were expensive. Overcrowded through and through (I was basically dancing with the window). Intensely small dance floor. Bartenders were J-Shore (read: doucheholes). DJ was good but mean (Nate Dogg passed the day before; I requested a song by him and he gruffly replied, \"I ALREADY played one by him\"... WELL SORRRRRY! Sheesh). Lots of creepsters (aka old men). Too many dancing hoes. (See above for why I felt bad for them)  But PRETTY VIEW!", 
    "review_date": "2011-05-17"
  }, 
  "l26TgP9ox03XRLDuG-9wvA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annalise F.", 
    "review_text": "Came here months ago to celebrate my friend's 27th birthday with the \"Sunday's a Drag.\"   You should know, right off the bat, you're paying for the experience- not the food! The buffett, while extensive, isn't anything that makes you crave more. There's a nice spread- but it's a buffet after all. (I did think the custom-order omelette bar was pretty cool though!)  That being said, the show was absolutely entertaining. Those gals can certainly entertain! I wasn't entirely sure what to expect, but the lip-syncing costume wearing men in drag certainly kept us laughing and singing along.   I had a good time, and we all enjoyed ourselves. It's a true SF experience.", 
    "review_date": "2013-07-25"
  }, 
  "FxcmX5skqHyqmxkubdn9gg": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Avi W.", 
    "review_text": "The starlight room: offering SF's saddest bottle service.   These guys try too hard to be something they're not. As with many other union square places, locals can safely pass.", 
    "review_date": "2010-06-29"
  }, 
  "jvPKzJ5bqA6QzB3p9PPzPQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianna C.", 
    "review_text": "I've never eaten here, I can only speak for everything else. Coat check is always really polite. A long wait for drinks sometimes but it comes with the territory and the drinks are fine. We mostly come here for the dancing and the view- both are amazing!! Makes for a very romantic date night spot for couples who don't get out a whole lot. You get to people watch and dance and see some liveliness without having to stomach a nightclub. And did I mention the view is amazing?? Nothing bad to say about this spot.", 
    "review_date": "2014-02-10"
  }, 
  "iK4QagEgn0q30ys4bhBb1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Doreen D.", 
    "review_text": "Attention:  Only rating the Sunday's a Drag show.    Really good show.  Went for mother's day Drag Brunch show because mom is on the East Coast and what the hell.  It was a great show.  Wish the show was longer which means it was good.  We lucked out an had a table next to the stage.  Get there early and see what you can do.  Good to be close.  The Sister of Perpetual Indulgence were in the front row so it was like two shows in one.    Food was not the focus.  Don't expect much more than average brunch.  Your paying for the show.", 
    "review_date": "2010-05-10"
  }, 
  "3mNz5nQFTIBQm0oU5mBR0w": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Michelangelo S.", 
    "review_text": "Awesome Parties with Coworkers &amp; Friends in a Truly Eclectic Space!  SITREP  I usually don't find myself partying in Union Square to be honest.  That usually happens in SOMA or the HAIGHT.  However, when work events (Conventions: GAG) or even holiday soirees in downtown San Francisco end early, it's often fun to be able to just traipse through the Union Square Hood and head to the Starlight Room (even better if there was an early evening of Ice Skating mixed into an early night, and now it's refreshment time!)  SETUP  The Starlight Room is located on the 21st Floor of the Sir Francis Drake Hotel, and it is a TOTAL TRIP back in time to a more swanky, quasi-speakeasy feel.  I love it.  The music is usually cranking a wonderful mix of oldies, disco and some retro, along with the mainstay of pop and R&amp;B.  [Note:  if you are looking for a rave, house or really young clientele, this is NOT your place.]  WORK CREW  There is something here that a very diverse group of coworkers will enjoy here:  music, plush surroundings, comfortable seats, private alcoves, sparkly dance floor, astounding drinks, pleasant eye candy of all ages, genders, and denominations. ;)  HOURS  Unless you are part of a private event, you are pretty much out of luck getting in on a Monday Night.  [sometimes I wish I could since I would like to start here in the early evening, and then I just end up at DNA Lounge for Death Guild which goes late.]  But this is why it's important to check the calendar ahead of time so you won't be disappointed.    SPECIAL EVENTS  They have a very cool Drag Brunch on Sundays, and most nights you can enjoy the mixing stylings of DJ Dave Gillis.  So it's hard to go wrong if you are looking for something that everyone will find a piece of that they really like at different times of the week.    THE LOWDOWN  I really do love the Starlight Room, brought to you by Harry Denton.  :D", 
    "review_date": "2013-03-04"
  }, 
  "VcTfxNgtcbSVrBO_A0EhBA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sayaha A.", 
    "review_text": "I was just there this Sat (Aug 1st) and it was definitely not a place I would like to return in the future.  I went to the Starlight Room, because of a friend's b-day party. I love the friend's crowd and the view. (The view is amazing... for the view only I would give five starts, but...) However, everything else was just not for me.  First, the dance floor is very small.  Second, the average age of the dance floor was 50+.... I am a dancer and it is nearly impossible for me not to dance, but this night, I didn't even move my feet...   Third, I hated the crowd... for me there was no class and was not for young people. I have no problem going to older crowd, but this crowd really gave me uncomfortable atmosphere. I saw few couples making out when some people were still dining.  It was just NO NO NO for me.  The view was great, but it was pretty much it.  (I checked yelp before going to this place, and low ratings I saw pretty much said the right things.)", 
    "review_date": "2009-08-04"
  }, 
  "f2kprM12LzRr9KcP_X-87Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex B.", 
    "review_text": "Okay, so, context: a friend and I were *purposely* looking for an absurd experience and were tipped off that there's a decent house show called \"dresscode\" here some thursday nights. Why not, eh?  I pass this place twice a day walking to and from work and have always assumed it to filled with Barry Manilow lookalikes and purple leisure suits, but it was quite hip the other night. Chartreuse and PBR combo for five bucks, plus several great house sets. It was a pleasure to finally experience the Denton.", 
    "review_date": "2009-11-20"
  }, 
  "51f-gzLdOCAeSNyhdXJX6Q": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Stephanie T.", 
    "review_text": "Stopped by here on a Tuesday night with some coworkers. The place was practically empty, which is apparently not usually the case. Our waitress was very friendly and made some drink recommendations to my coworkers based on the type of liquor they wanted, (rum and whiskey). I ordered a glass of wine.   I tried both of their drinks, a Cable Car, and a ginger whiskey drink, I didn't catch the name of that one. The Cable Car was fantastic. The rim of the glass was coated in cinnamon and sugar.   For a snack I ordered the Mac and Cheese crisps. Which were fried Mac and cheese squares with bacon. They were pretty good, I just wish they had been a little hotter.   The view at this place is absolutely amazing. I definitely plan on calming back to check it out on a weekend night.", 
    "review_date": "2012-02-22"
  }, 
  "Tdsd6ojiId3tgJsBBQz4NA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Danielle B.", 
    "review_text": "What a scene!  Every time I turned my head, I had a new, weird site to see.  There was the wannabe Milli Vanilli/Rick James dude rocking the keyboard for the live band.  Then there's the too old to be going out on a Saturday night couple grinding and sucking face on the dance floor.  Sitting down, we have the middle-aged Russian men with the peroxide blonde hookers trying to earn a quick buck.  Aside from all the interesting \"scenery,\" I have had fun dancing here, as they have a pretty good mix of music.  And the drinks are pretty tasty as well.  The set-up is what I would imagine and old school Brat pack type lounge would be like.  So, come to this place ready for some entertainment.  It's the perfect mix of cheesy and classy.", 
    "review_date": "2009-05-25"
  }, 
  "tIRh_AmxJhUgzoHUBMPnlA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jubi l.", 
    "review_text": "So after Cityscape, we checked out the Starlight Room (Sir Francis Drake Hotel). The view is  ok (26th floor) compared to Cityscape (46th floor).  There's a cover charge of $15 (by the I'm not a fond of) but whatever, it's my first time. Saturday night was packed, that included a bridal party. For the first time, we felt we were the youngest patrons in the crowd.  There was a live music but unless you are drunk then you won't care. In short it wasn't that great but they did a good job in hyping up the patrons.  We decided to just hang out at the bar. Cocktail prices were pricey, beer and Chambord sour for $20 something. The bartenders were friendly but my Chambord sour tasted like cough syrup, yuck. They do not have hypnotiq or the mix for my hurricane, boo!  Oh well, regardless we made the most of our cover charge. Hhmmm, I might check this place out on Wed night, I heard it's poppin. (dj = hiphop)", 
    "review_date": "2008-08-03"
  }, 
  "Gv_BjUXgTVUzoP2SDcDyQQ": {
    "user_rating": 4.0, 
    "user_location": "Carlsbad, CA", 
    "user_name": "Erik S.", 
    "review_text": "The Harry Dean Stanton Starlight Room has always been a good-ol time for drinking, dancing, and humanity-watching.    The view from the front, back, and even restroom windows is incredible, and not just your ability to peer into rooms on many floors of the adjacent Marriott, but your vista of much of SF.    The diversity of ethnicities present, as well as age groups, makes the place all that more interesting. Seems to be about 50:50 tourists:locals, with \"locals\" being anyone who drove or took BART there for the night, as opposed to flying in from somewhere.    Dance floor features everyone from 21 to 80 having a good time.  Stiff drinks, friendly staff... yeah, it all clinches the deal.", 
    "review_date": "2013-12-27"
  }, 
  "UU1snpEq_rpTOlbuSHA5yg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dolce S.", 
    "review_text": "A strange sort of bar. It's a crowded mix of semi-trendy people on internet dates and country rubes who are visiting SF and staying at the hotel. The views are good, but actually not that great given high up it is. The mediocre band (I don't mean that as insult; they weren't bad, they just weren't great) was really loud. There were some interesting old-fashioned drinks on the menu that I hadn't heard of before, unfortunately it turns out they aren't popular anymore because they aren't very tasty. The bartenders were working hard and giving good service given the menu they have to work with.", 
    "review_date": "2011-11-16"
  }, 
  "9L-NG0xL4Y5W5y4dnclyRw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laurie F.", 
    "review_text": "Great venue for society cabaret shows. We saw the 1pm \"evening with Molly Ringwald\" show and it was the perfect intimate setting for classic jazz. Comfortable tables, great service and cocktails. A bit pricey menu, but expected for such a posh setting. The French 75 was a good choice to celebrate Bastille day. Molly and her jazz trio were great. She stayed and signed CDs after show and the pianist &amp; drummer also chatted and signed my CD. The society cabaret founder was a gracious host and did a nice intro to Molly, his childhood friend.", 
    "review_date": "2013-07-13"
  }, 
  "Debq13UAOuxVmPiau3E1yQ": {
    "user_rating": 4.0, 
    "user_location": "Atherton, CA", 
    "user_name": "Lyndsay D.", 
    "review_text": "Went here during an event and it was super fun. It was packed and everyone looked like they were having a great time. The dance floor rocks and the music was great. The hotel itself is so amazing and has beautiful architecture and a great design. The best part by far is the view. The view is amazing! You can see everywhere and from multiple places. I was mesmerized. I will make a point of stopping by here again to check out the views", 
    "review_date": "2013-11-21"
  }, 
  "wjYtZFVzs2sIfwbUYb9EIA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shaun W.", 
    "review_text": "My friend and I went for the first time the other day.  We mainly wanted to see the view and have drinks - so this review doesn't include food.  On first impression, the place looks fancy, but after you settle in and begin to look around, you actually see that the place is old and needs refreshing.  There's a delicate balance of elegance and tacky-drag queen-cheapness about the decor.  The place is more or less clean, but I did notice dust on the vents on the ceiling.  We ordered drinks from the bar and the staff were courteous and professional.  I bought a glass of champagne and paid with my credit card and noticed they do a $50 authorization every time the card is swiped.  Keep that in mind because if you order 3 drinks, your account will temporarily have a debit of $150 until the actual fee of say... $30.. posts to your account on the following business day.  That's a big deal if you have checks coming through or are on a budget.  Anyhow, it feels like the place is more of a tourist trap than anything.  The venue doesn't really command the price of the drinks.  It's nice to go there for the view and have a drink or two, but that's about all it's worth.", 
    "review_date": "2013-06-09"
  }, 
  "JQGGHtzTA10plLAPIXM5jQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bobby B.", 
    "review_text": "The Starlight Room is a San Francisco classic! Do not miss sunset, or Sunday's a Drag- brunch and show. Kenny makes the best martini in SF.", 
    "review_date": "2011-08-03"
  }, 
  "BhkkJQbSy_womFDYIYTgQg": {
    "user_rating": 2.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Sandy K.", 
    "review_text": "Beautiful venue, unfortunately the bouncers are complete dicks.   Come here if you reallllly want a breath-taking view of the city. But if you want some customer service, do NOT go here. Also, the drinks are expensive and really watered-down.   AND - the crowd is really old.   It's really a shame since the venue is soo nice.", 
    "review_date": "2010-06-30"
  }, 
  "_GZ1-FQTWCfH7WQFo9rxwg": {
    "user_rating": 5.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Rob Y.", 
    "review_text": "I have a confession to make. This was my first \"Drag Brunch\". No, it does not involve cars (which I thought that was a possibility, but then I realized it was in SF). So, this place is at the top of the Sir Francis Drake Hotel with some pretty good views (assuming that it isn't foggy/rainy in which it was with this case). First off the food was pretty good. Nice spread, omelet station with the obligatory prime rib. Fresh squeezed OJ, and mimosas!   As for the show, I have never had soo much fun at a brunch! No really, I thought it was pretty entertaining. It was pretty much G-rated so nothing really nasty. My phone sucked at taking pictures, so once my friend emails me the pics I will post them. So yes, I would say its worth the $45/person. Now when I go to Las Vegas, I just might consider something else than Cirque Du Soleil.   It is recommended that you make reservations but don't be late because they might make fun of you.", 
    "review_date": "2010-04-13"
  }, 
  "Valva2MGzBW8ux3641YINA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "I was excited to come back to the Starlight room after years of not being there. I remember good ol college days we used to hit up the starlight to dance our booties off with the tranny hookers, it was hillarious watching the lame guys falling for them. The place is newly remodeled and it looked nice, best part is of course the view! I was kinda bummed tonight, I was hoping on trying something there but all we got our hands on was alcohol. The pisco drink that tasted like apple pie was yummy and the pineapple tasting one was good too. I was nice and tipsy leaving. It was kind of disapointing they didn't plan very well with the food. The crowd wasn't that huge compared to other yelp parties and they just didn't serve enough. People were literally hovering and running toward the kitchen grabbing food as soon as it left the kitchen. I saw some balls that I overheard someone say was chicken nuggets and I saw something served on spoons. Bummer! I was hoping on at least snatching a ball before walking out but no luck. 3 stars for the amazing view and my friends enjoyed the whiskey tasting.", 
    "review_date": "2011-10-12"
  }, 
  "UVO0vrdc8Jfm00p7ixuf7A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nolan V.", 
    "review_text": "Halloween 2014 party was wayyyyyyyy too packed and hot and steamy and the windows were fogged up.  o noooooooo.  wait half hour to get in line to get on elevator to get up. o mannnnnnn  The place truly does look nice. Red. Velvet. ETC. I'd be down to come back in daytime to eat or check out view.  Needs a 2nd chance.", 
    "review_date": "2014-11-04"
  }, 
  "DTEa4cIRdr6T4jaIw1xubg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dung N.", 
    "review_text": "WOW!!!  I've been at this beautiful hotel before but I've never knew about this lovely little place on the 22nd floor even existed! My friends and I came on a Wednesday night, I didn't really think people partied on a Wednesday but apparently they do! I don't know if there was cover or how much it is because our group did bottle service but these bouncers/security men are all dressed as if they're Secret Service or something with their suits and ear pieces.   Anyways, as we were led to our booth, I was just in complete ''awe\". The view was soo pretty! The dance floor wasn't big nor was it too small. It was so cool to be dancing the night away while the huge windows let you stare over the city. The crowd, however, has to be the most random and weirdest set I've ever seen--all in one place. But, hey...we are in San Francisco.   So, if you're ever in the area on a Wednesday, definitely check this place out!", 
    "review_date": "2011-04-21"
  }, 
  "5_WAT6jyEBKi1RQvKhRu_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kalpita S.", 
    "review_text": "One of my favorite places to go in the city, mid-week. Harry Denton allows Sebastian Entertainment to take over the venue on Wednesday nights to spin hip-hop tracks and old skool favs. The crowd is always such a great mix, it's hard to categorize it. A lot of European folks tend to hear about this place and check it out.  There's usually a line to get into the elevator to go upstairs to the lounge and cover is around $10 if you aren't on the guest list. Drinks are expensive but generously made. I've always had a great time here, dancing the night away. The deal maker is the amazing view you get of Union Square and the city. It's simply breathtaking!", 
    "review_date": "2008-12-30"
  }, 
  "FJUTbKkY10tNcn5_10Ethw": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ben G.", 
    "review_text": "On the 21st floor of the Sir Francis Drake Hotel, it is hard for this place not to be cool and swanky.  The interior is very pretty and has huge windows that give you an amazing view of the city. This is definitely not your \"ultra lounge\" or club with thumping bass and lasers, but there is a nice dance floor.  On the night I was there, they alternated between a DJ playing pop/hip-hop and a live band doing mostly cover songs.    While my girlfriend and I did not take advantage of them, there is a large area of tables and private seating areas that would be great for a small group and give it more of that VIP feeling.    One of the craziest aspects of this place is the huge age range of the people there, all the way from 21, up to 50s and 60s.  This is not necessarily a bad thing and makes for a more interesting and diverse crowd.   While this is probably not a place I would want to go every week, I definitely feel like this is a great place for special occasions.  The Starlight Room is perfect for those nights where you want to go out, but you want it to be a little extra classy.", 
    "review_date": "2011-03-03"
  }, 
  "puS8HuNdeXhhl5F4bb0EEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pam S.", 
    "review_text": "This is definitely a must go place in San Francisco.  It's on the 21st floor of the elegant Sir Francis Drake hotel.    The cover charge the night we went was only $10.  That was Saturday.  I had a cosmo and it was really good.  I like a lot!  The dance floor was packed and crowded, goes very well with my taste.  And they played music that can really get anybody to shake their booties :).  Very nice party place indeed.  And who wouldn't love the view.  I love the city of San Francisco at night.  And to see it from a lovely place, really sets the mood.  I heard they offer brunch and dinner here.  I am excited to come back and dine here.", 
    "review_date": "2010-08-09"
  }, 
  "mQUoN1QcGI3AEpu5su1PHg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rabbit B.", 
    "review_text": "This review is for the Sunday's a Drag Brunch only. First of all, I want to say that we like this room. It is old school and very San Francisco. The Sir Francis Drake is a charming old hotel and as far as we've ever known, it has had a good reputation. That is why we thought we would have a good experience at the brunch. As it turned out, we had such a bad experience that we couldn't believe it.  It was clear from the beginning the staff didn't have their act together. It started out with bad service and then the afternoon only went from bad to worse. It took forever and a day for the wait staff to take our drink order and then forever to get our drinks. BTW, a pitcher of Mimosas (a carafe, mind you) is priced at $60. Yes, you heard me...sixty dollars.  Cocktails are priced at $13. \\Only New York has worse cocktail prices but that's the Big Apple for you. Anyway, the tables are small and barely big enough to eat on. Halfway into the brunch, there was little food left on the buffet tables. We could not believe it. While I will spare you the other gory details, I will tell you I would not recommend this brunch. That it is ridiculously over-priced at $60 a pop (not including cocktails and tip) has got to mean they cater to the tourists. That others have raved about it is surprising considering the unfortunate experience we had. Needless to say, we were extremely disappointed with what we thought would be a fun afternoon. What a shame. We actually were looking forward to this experience but it certainly didn't work out the way we thought it would.", 
    "review_date": "2014-12-16"
  }, 
  "MiQr7921e6ewplyyGkMPnA": {
    "user_rating": 1.0, 
    "user_location": "Howell, MI", 
    "user_name": "Blythe P.", 
    "review_text": "Went up on a Sat night expecting someplace to have a cocktail, look at the view and listen to the band or dance.  It was worse than any bar I have ever been in.  Packed in the entire room, 5 deep at the bar and lots of cruising older men.  This could have been a good thing for me (not) but they were interested in my daughters - twenty years their junior.  We had a laugh, got to dance and then got the heck out of there.  I could not see the decor, there were no elegant creatures to wait on us.  All in all, a waste of a great view.", 
    "review_date": "2012-06-04"
  }, 
  "X3F4vGH3xcwX3bBO1qnmUQ": {
    "user_rating": 2.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Dwan M.", 
    "review_text": "This place is definitely not for the young adults looking to experience anything hip. If you like to chum with 40 + year old people when you are in your 20s, looking to hang out at a cool trendy place with people about your age and NOT wanting to get down to KC and the Sunshine band, not a good place for you to go. If it weren't for being with my silly and fun sister, I would have been bored shitless because it was too old for me. I had to drink quite a bit to have a good time. After about 7 cocktails, I got my ass on the dance floor and hustled my heart out to the Bee Gees, but I won't be going back until I am closer to 40. By then, they'll be playing \"Old school Justin Timberlake\" tunes.   Basically, if you do decide that you must go just to see the panoramic view of San Francisco or if you are staying at the hotel, then expect the place to be shoulder to shoulder packed and lacking service due to all the hustle and bustle. The poor servers have to wear black formal gown in heals all night because that's there uniform, so that sets the tone. The MC is very retro and plays much R&amp;B and Smooth Jazz for your listening pleasure..... The drinks are made very well. Yeah, that's about it. There are many other places to go to in San Francisco. Go here if you must.", 
    "review_date": "2010-06-09"
  }, 
  "W1t71ODI0GF256RA0Ba5ww": {
    "user_rating": 2.0, 
    "user_location": "Far West/Northwest Hills, Austin, TX", 
    "user_name": "Emily H.", 
    "review_text": "Only reason I am giving this a 2 is because it had a nice view. The waitstaff was horrible. Didn't ask us hardly how we were doing. Took too long to take orders and give us our drinks. BUMMER", 
    "review_date": "2014-02-21"
  }, 
  "MjCIBCRp7p4B_ITMWDpKzQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley J.", 
    "review_text": "I feel somewhat bad about giving this place 2 stars, as I always have an enjoyable time while I'm here. But here's why it only deserves 2 stars...  $10 cover charge to get in ($5 if you have a hotel key... yes, I borrowed some dude's hotel key to make my cover charge less). Somehow I've managed to get around the cover charge almost every time, or at least make it less than $10. I'd never pay $10 to get into this place. There are better bars and dance clubs in the area that are free to get into.  The decor in this place is DRAB. Completely old fashioned. The Starlight Room is grandparents house meets night club.  Pretty much everyone in this place is a tourist, but you get a few of those regular douchebags who \"know the owner\" so they're there every night. There are a lot of older people in this place. I don't really want to be intentionally  rubbed up against by a 50 year old creeper on the way-too-small dance floor. No thanks.  The music is okay. You get your standard top 40 here, the norm.  Bartenders are friendly. That's a plus.  The view is incredible. Pretty sure about 90% of the people that live in SF that actually come to this spot is ONLY for the view, and nothing more. However, there are way too many other local places with a view to ever have an excuse to come here.  So why have I been here on multiple occasions? Because I'm with a group of friends, I'm not completely sober, and someone comes up with the brilliant idea that we should all go to the Starlight Room.  When I sober up, I realize I don't like it-- each, and every.single.time. However, come with a group of friends, and you're going to have fun anyways.", 
    "review_date": "2011-05-24"
  }, 
  "7igYjtQ2kI166vtqCBRnhA": {
    "user_rating": 2.0, 
    "user_location": "State College, PA", 
    "user_name": "Marissa H.", 
    "review_text": "$15 cover charge on a Saturday night. Only 1 bar w/ a few bartenders. Small dance floor where 1/3 is taken up w/ the sound booth. Overpriced drinks but my gin/soda was made well. Live band which played fun, old-timey dancing music, but when they went on break hip-hop &amp; R&amp;B was piped in. \"Older\" crowd (no offense, just stating the facts of the evening - we'll all be there one day!) so mingling was kept to a minimum that evening for us. Glad I went post-renovation to see the \"new\" Starlight room but that curiosity is satisfied &amp; I don't expect to return.", 
    "review_date": "2011-10-09"
  }, 
  "TSdV_lsddT4F3TJvmdmXag": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie K.", 
    "review_text": "A little piece of old-school San Francisco, smack dab on top of the Sir Francis Drake hotel.  Everything is red, red, red, from the curtains to plush booths to the hibiscus martini.   I hadn't been to the Starlight Room before they redid their cocktail menu: now it's organized by era, and there are at least 50 concoctions to try.  At $10-12 per drink, it's not cheap, but there are a few gems there.    The bartenders are talented and friendly, and the view is spectacular.  It's not quite on par with Alembic, Local Edition, Rickhouse, and Smuggler's Cove for fancy cocktails, but if you're a San Franciscan, you have to come here at least once to soak up the ambiance.  Go early to avoid a cover charge!", 
    "review_date": "2012-11-05"
  }, 
  "a7_jTn-XrObX8pDq6mzBnw": {
    "user_rating": 4.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Vivian L.", 
    "review_text": "Loved it....Have gone to 2 events at this place; the service is amazing, our waitress was the best", 
    "review_date": "2014-09-08"
  }, 
  "OpEsYCdTioMDUFib7d-YuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Heather H.", 
    "review_text": "When I read people griping on Yelp about how this place is packed with old folks, I knew it would be right up my alley-- The elderly, more often than not, have got it right!   I came here for the first time two years ago on my birthday for weekend night dance-party table service and we very much enjoyed the views-- both of the ice rink below and city beyond, as well as the indoor views of older, gold-chain-wearing, off-duty-limo-driver-looking dudes trying to get their swerve on with their \"working-girl\" dates.  We returned for my birthday this year on a Monday, so no cover and the bar was nearly empty.  The views were just as stellar, the space just as charming, the bartender was entertaining and open to experimentation (I was with a couple of cocktail snobs)...  We had just come from a completely unsavory experience at Top of the Mark. Never again will I cheat on Harry when I want my old-school SF special-occasion fix.", 
    "review_date": "2010-12-21"
  }, 
  "TmhFYYTHodJnrubq9IeFNA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vol T.", 
    "review_text": "Great view of Union Square. No cover if you make it before 9pm like we did. Our drinks were strong and pricey ($12). But we just wanted to check out the view so just had 1 cocktail each. It was empty when we got there so was able to walk around and see nice view, esp by dance floor. It gets 3 stars because there were a lot of old people and the music was for old people, played by an old woman. Nothing against any of that .. just so you know. Good for a quick stop.", 
    "review_date": "2013-09-30"
  }, 
  "NWh_jjR3MTsYeKzSvVrKZw": {
    "user_rating": 2.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Kim D.", 
    "review_text": "This was at the top of our hotel, I was hoping it'd be a nice place to hang out. The cover charge was ridiculous considering we were already in the hotel for the weekend. It would have been nice to have no cover charge if we could prove our room reservation.  We walked over to the bar and my 4 friends and I ordered drinks, I ordered water due to already drinking before coming and the bar tender seemed insulted. We watched as the bartender measured every single part of the drinks and didn't even fill the jigger with alcohol or juice when measuring then were over charged for said drinks (feels like over charged due to no alcohol content and the glasses filled MAYBE 1/2 way as well. )  We tried to sit down, and there were only dirty tables everywhere, underneath/on the floor of ours was someone's jacket in which we thought someone had left behind. After 20 minutes of sitting/chatting/drinking someone came over and claimed it was their table and kicked us out (despite the jacket there was no indication someone was there or occupying, the drinks were empty and dirty plates) as we tried to walk elsewhere a host finally seated us at \"reserved\" booths and the music was so loud you had to YELL over everything to basically talk to someone sitting next to you.  After maybe 30-40 minutes in total we walked out.", 
    "review_date": "2011-10-15"
  }, 
  "sXhGLvb7dIYBrzDh4s5UnA": {
    "user_rating": 4.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Tina A.", 
    "review_text": "We came here to celebrate a friend's birthday during their \"Sunday's a Drag\" brunch. The brunch ain't all-that and their drinks are crappy (and not included with the price of admission), but the show is something you must experience once. The host, Donna Sachet, is darn funny!", 
    "review_date": "2012-09-26"
  }, 
  "e2YinjKYN_hR2Ol74ksnYg": {
    "user_rating": 1.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Wendy W.", 
    "review_text": "Worst business practices and horrible event planners!!!   The staff stole my personal property!!!", 
    "review_date": "2012-01-28"
  }, 
  "tvZKPah2u9G9dFBg5GT0eg": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Emily S.", 
    "review_text": "A bunch of us crazy girls celebrated a birthday at the Sunday's a Drag this morning.  I can call my friends crazy.... they're all crazy for being friends with such a train wreck.... ME.  Upon entering the Sir Francis drake, my breathe was taken away.  Not just from the stairs, not from the hike in high heels from the parking garage... it is a beautiful hotel.    The whole point of going to the show is not just the food, but the service and mostly the entertainment.  I was amused throughout the entire show.  Those queens are fucking gorgeous.  I fucking heart them.  Here is a list of what I consumed this morning in the Starlight Room: bacon (fuck it was good) bacon (I couldn't get enough of that shit) eggs benedict (I almost broke a tooth on the muffin) macaroon (fucking delicious) bacon (yeah, again) spinach salad (needed a bit of balance) 2 cups of hot tea (the vanilla bean with 1/2 a packet of sweetener) 1 slice french toast (it didn't need syrup... it was too sweet)  The performances were fun.... I laughed so much, I think I may have peed a bit.... TMI?  Too bad, the show was worth it!", 
    "review_date": "2008-07-20"
  }, 
  "Tu8KzhQPTORweWWaH8PQGg": {
    "user_rating": 3.0, 
    "user_location": "WOODLAND HLS, CA", 
    "user_name": "Enisha B.", 
    "review_text": "Weird experience but overall a good one. Met up with some friends here while visiting San Francisco on a Saturday night. The crowd was ollder but the music was young. Me and my friends danced and had fun, also got great views of Union Square from the dancefloor. However, it took forever to get a waitress or a drink and like the other posts I had to check my card because initially they overcharged me about $25. I checked a couple days later and it was corrected. Also, was not pleased they said the door charge was $5 and when we got upstairs they raised it to $10, they were only giving free admission before 9 and to hotel guests.", 
    "review_date": "2013-02-01"
  }, 
  "CpH7oGBpmUU4LUK0OOotMA": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "John F.", 
    "review_text": "Oh yea here is an update.   Me gets screwed. Eff the details!!!", 
    "review_date": "2010-02-17"
  }, 
  "NIhcRW6DWvk1JQhDhXwgOQ": {
    "user_rating": 3.0, 
    "user_location": "Arlington, VA", 
    "user_name": "Lia M.", 
    "review_text": "Harry Denton's Starlight Room is at the top of the Sir Francis Drake hotel.  While not completely panoramic views, it does have a great view, a fun DJ, and a disco ball.  The space is lounge-y, with a dance floor next to the windows.  After 10, a younger crowd came in for dancing.  I just went for drinks, and I loved my Savoy Bounce, while expectedly pricey, was strong.  Service was great - the man who escorts you to the table is hilarious.", 
    "review_date": "2012-02-10"
  }, 
  "KG5YQRCDZHRhBq-Jfkq87w": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Madelene Z.", 
    "review_text": "Located at the top of Sir Francis Drake hotel.  We wanted to have a different experience and yes, we got one.  The host was very personable.  He sat us within a few minutes (I got the seating karma this night) and event got a window seat.  Wow.  Dancing with the view of SF is really cool.  We can even see the lighted Christmas Tree on Union Square.  Music was upbeat.  Really really enjoyable place.  Its a must try if you are in SF bay.", 
    "review_date": "2013-12-01"
  }, 
  "OI4_xMb9JqcIWP46nucqLA": {
    "user_rating": 2.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Debbie C.", 
    "review_text": "This is in the 21st floor of the Sir Frances Drake Hotel.   It's ok.  Go there for the view, not the menu, and not the sky-high priced drinks.  This menu is awful--it had waffles, and it had even chicken nuggets.  Weird and out of context with a table cloth and candle lit environment--and waitresses with long Oscar night gowns.  Mixed bag.  Food awful, no choices for someone wantng food or appetizers.  Drinks were outrageous.  We enjoyed the sunset and city lights, not the ambience of the restaurant, and NOT any of the food.  There is so much this place can do to make itself better.  I just don't get it.  I would go for the view again, WITH fine company, but never go again for any other reason.  This hotel blows it with this restaurant.  I'm surprised people ever come back.. The service was very good.  Also, unlike the bathroom shortage in the rest of this hotel, this floor for the tiny restaurant-bar had a big bathroom with mutliple stalls!  that was a rarity believe me.  This whole place is central, but it doesn't have much going for it otherwise, for the money.", 
    "review_date": "2013-02-28"
  }, 
  "_V6qMBCSzhwx96FLB3CJRw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Pam S.", 
    "review_text": "I have seen \"The Birdcage\" approximately 8,000,000 times.  Granted, my favorite part of that movie is any scene that Hank Azaria is in, but I also love to see the interaction between Robin Williams and Nathan Lane, as well as Gene Hackman dressed up as a woman.  My mother also loves that movie, for many of the same reasons.  So it was fitting that for her birthday, we come here for brunch.  My mother is somewhat of a fruit fly/fag hag.  The apple doesn't fall from the tree.  For the most part, it was good.  Nothing stellar in terms of the eats, but definitely tasty and worth it.  Drinks are a little pricey, but that's to be expected.   I got the deal through a Groupon (or something like that), so it took a bite out of the cost.    Not the best drag show I've seen, but it's certainly fun.  The headliner was some redhead who did Reba, and s/he was spectacular.  i could have lived without seeing a Lady Gaga impersonation, because I'm still not convinced that the \"lady\" isn't tucking.  It's a worthwhile thing for guests in town, although I did feel sorry for the dude who got dragged in by his girlfriend.  Not the best place for a hot, straight, unmarried man.    But what place is, really?", 
    "review_date": "2010-11-21"
  }, 
  "wOS4w1V72x3NV6a-0Sz3iQ": {
    "user_rating": 3.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "Marquis L.", 
    "review_text": "The venue was really nice and the drinks were good. The bartenders and waiters are also really nice and welcoming, but I don't recommend it for people who are about 20-30, because even though the music itself was okay, a lot of the people that were there were kinda old. Definitely not for the younger crowd. And they didn't start playing the good music until after my friends and I left. In the beginning the music was old school like 90s and 80s and some early 2000s. Then they started playing hip hop and house music. But really there were hardly any people around my age and I'm 21.", 
    "review_date": "2013-12-31"
  }, 
  "CIT2QNZ_i4DGjTVz_SUieg": {
    "user_rating": 2.0, 
    "user_location": "West Chester, OH", 
    "user_name": "Gary R.", 
    "review_text": "This place felt so cheesy. We went up to check it out and can't believe there is even a cover. Small dance floor, impressive view, a couple cool twosome tables by the windows, crappy music, go go dancers off to the side.  Been there, done that... Wouldn't go back.", 
    "review_date": "2012-04-10"
  }, 
  "EjAZFc4IeRGAxpTp_9WnBg": {
    "user_rating": 5.0, 
    "user_location": "St. Petersburg, FL", 
    "user_name": "Wayne S.", 
    "review_text": "Madly in love with this wildly romantic, misty dreamy cloud-top paradise. I ascended into its heaven one twinkling evening on a tip from a local for a quick bucket of scotch. I don't know that Raymond Chandler ever wrote about the place, but he easily might have. The place impressed me as indelibly as my first kiss. Bedazzling. It still gives me goosebumps.", 
    "review_date": "2015-01-08"
  }, 
  "ZW--96fxunFhCkAL1AD83g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kameelah R.", 
    "review_text": "This place was fantastical! We took my cousin out for her birthday and had a wonderful time. Even though we were an hour late for our reservation, the host was still able to find us a table and seat us. The night we went there was a live band playing oldies and a DJ playing the radio hits. There was plenty of fun to be had by all!! ha ha so much fun in fact we helped ourselves to a few of the roses in the Starlight Room and security came over and told us the Flowers were for Decoration NOT Dancing! Hilarious!! Had we not watched a geriatric crew get arrested for fighting with security AND the police, we probably would have tested him for those Roses. Ha ha!  The View here is amazing, and it really made me miss my City! The night we were there it wasn't foggy so you could see all of Union Square. I gotta get back to SF and out of Miami!", 
    "review_date": "2010-04-25"
  }, 
  "-JQWn7dNVHLwrbrk8f-mzA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David W.", 
    "review_text": "I went here Sunday night (4th of July) for their holiday party.  My friend had a comped bottle of vodka for her birthday so we sat down and were immediately waited on and before I knew it I had an ice-cold Vodka Soda in my hand.  Despite the fog, the views were great.  The decor was very subtle and relaxing with comfy booths and couches.  Small sized dance floor and the place was not packed (which was great).  I heard it gets really packed for their mid-week parties on Wednesdays; but I work during the week, so I won't be heading there on a Wednesday anyways.  The servers were all dressed in elegant dresses and the bouncers had tuxedo's on.  They definitely fit the vibe of the place.  Overall it was a fun night.  The DJ was good too - I'd definitely recommend this spot to a friend looking for a more relaxing lounge with good music.  P.S.  I gave only 4 outta 5 stars b/c the bouncers let some guy in wearing 2 polo shirts with double popped collars (white and blue).  Patriotic yes, but we aren't in Jersey \"bro\" -- The Situation called, he wants his style back!!", 
    "review_date": "2010-07-06"
  }, 
  "dbOrbdJyIsJEsyDYFYKNQQ": {
    "user_rating": 3.0, 
    "user_location": "Orlando, FL", 
    "user_name": "Amber H.", 
    "review_text": "Came here twice during my stay and the first night was rocking with a great fundraising party and a great DJ. Unfortunately you could not see out of the windows since they were all sweaty.   The second night was great for happy hour and sunset with a more relaxed experience with a great view and a great chocolate mousse dessert.", 
    "review_date": "2014-05-11"
  }, 
  "MYZAS_KXruoSs-3ejg-MdA": {
    "user_rating": 2.0, 
    "user_location": "Glen Ellen, CA", 
    "user_name": "Q B.", 
    "review_text": "Poor service.", 
    "review_date": "2013-01-04"
  }, 
  "GzEWQRtzgNBpjQ1E830vRA": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Andrew B.", 
    "review_text": "Very nice place, good food and drinks. The music was great as well. But one of the security guards, a tall black guy with a goatee named Jared, was a real jerk. He was incredibly rude twice while we were leaving. It seemed like once the lights came on all he was interested in was being rude and shoving us out the door.", 
    "review_date": "2011-12-31"
  }, 
  "YwU0DqVz0L0gJ-Etg5l0Jg": {
    "user_rating": 4.0, 
    "user_location": "University Park, Los Angeles, CA", 
    "user_name": "Nathalie Y.", 
    "review_text": "I went there with my girl friends. It was one of girls' birthday. The waitresses there are dressed up in really elegant and beautiful long gowns. The service was extraordinary. The receptionist helped us manage two reserved tables. I really thank his kindness. The view in the dancing room is brautiful. Haha we went there at about 9. And the danving room slowly got crowded at about 10. They mixed up old and mainstream music. It is good place to hang out with friends. If you were tired, you could go to the dininv area to take a rest. Recommend!l", 
    "review_date": "2014-07-20"
  }, 
  "tBMdBlIFUoxWgpJ2NvdeBw": {
    "user_rating": 4.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "Amalia G.", 
    "review_text": "Came here for a night out with the ladies on Saturday and we loved it. The music was great, they played a mixture of 80's, 90's and today hits. The appetizer menu was not so great and serving sizes were very small, but besides that the music, view, and the whole atmosphere was fantastic. We will definitely be coming back!", 
    "review_date": "2013-04-23"
  }, 
  "KxRf-umHzdz5noKH5Cg6Mg": {
    "user_rating": 4.0, 
    "user_location": "Bay Area", 
    "user_name": "Carnita M.", 
    "review_text": "Great place for drinks and small bites with a view of the city. Of course, it all comes at a higher price but with the scenic view and fun music it's a great once in awhile splurge and great spot to hang with friends.   The food there is actually quite good. I tasted their fried Mac n cheese and their chocolate dessert and liked both. Portions are small so don't come with an appetite! As for the drinks I wasn't quite sure what to get so our waitress made a pretty good recommendation for me based on my likes. I forgot what it was but I enjoyed it :) FYI the menu on their website isn't always up to date and one time they did not have the ice cream on their menu that I wanted to try so you could be in for a bit of a disappointment.  The crowd is definitely older but the parties thrown by outside promoters bring in younger people so you'll get a good mixed crowd on those nights. It could get really packed and when it does good luck flagging down your waitress! We were ready to pay our bill and head out but she never came by. In the end we went to go find someone ourselves to take care of it for us.   The times I went both with and without a reservation, weekday and weekend, I lucked out and got a table by the window. I would recommend making a reservation just to be sure you get a table and one by the window for a nice view.   I haven't tried the brunch but it sounds like a fun thing to check out. Definitely in the evening Starlight is a nice spot to hang with friends and could be a romantic spot for couples as well!", 
    "review_date": "2013-08-18"
  }, 
  "im50cpAGJg_FMZUJofRYGw": {
    "user_rating": 3.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Justin B.", 
    "review_text": "Summary:  Eye candy  I have had a better time at the lobby bar of the Sir Francis Drake Hotel upon which this bar sits.  The evening we went, the cover was $15 which  I suppose pays for the view.  The decor and city view are this bars strongest points.  Our waitress (hostess or whatever the PC thing to call her) was very beautiful and elegant.  Drinks are of good quality but on the expensive side.  The overall feel of the staff, though, borders on pretension.  I may be more used to the amiability of smaller (i.e. less fancy) lounges.  The DJ played a good selection of music but his beat mixing needs a bit of work.  The security personnel are quite professional.", 
    "review_date": "2009-06-05"
  }, 
  "wmGUNwtFlQLxGrl3swVQ3g": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Janet M.", 
    "review_text": "I celebrated my 40th birthday party here and had a great time dancing. Very upscale place. Great ambiance and the service is wonderful. The only thing this place needs is a no poop policy on the \"ladies\" restroom door. It's a club not a gas station females really! I had to go 21 floors down to a non toxic bathroom.  Not the clubs fault in any way. But just thought I'd put it out there! Music was great and it was packed. It was St Patty's Day weekend. Robert is again, the hostess with the mostest. Even remembered us from last year's visit. Overall this place is highly recommended by me and my friends.  If you can get a VIP table..totally worth it. Thank you for hosting a fabulous evening stress free!", 
    "review_date": "2014-03-17"
  }, 
  "FuUQ7ph_trLKZLjuXWAFiA": {
    "user_rating": 1.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jim S.", 
    "review_text": "My wife was grabbed on the behind a few times. I was standing right next to one of these sick bastards when he did it. When I grabbed him around his neck and politely told him that his actions were uncalled for he told on me to the staff. The crowd had all ages with a majority of old guys by themselves standing around watching young woman dance as if they were praying on them. I told all the women with our group to keep there drinks in hand and do not sit them down unattended. I Also told them not to take drinks from people as a gift because this place seemed like a place full of sick people praying on women trying to have fun by slipping something in their drinks. Hated it. Would never return. If you are into getting fondled and having sexual things happen to you without any care as to who is doing it, you may enjoy the place. I didn't enjoy how much I had to patrol the safety of the women that accompanied me here. I did it because I care for my friends but not the way to have a good time. Discussting and horrible place.", 
    "review_date": "2014-04-27"
  }, 
  "qRBTAUOEWrBY9N1JszH1ow": {
    "user_rating": 5.0, 
    "user_location": "Duluth, GA", 
    "user_name": "Swetha G.", 
    "review_text": "Go, go, and go!  How fun!  Went to their 12:00 brunch/drag show with performers Donna, Alexis, Cassandra and Lady Tia.  They were terrific!  The host (and performer), I think it was Donna, was witty, engaging and had great vocals.  The songs were eclectic, the costumes glittery and exciting, and the acts just superb!  Another awesome thing.  It's on the 21st floor of the Sir Francis Drake Hotel.  Beautiful view!  The food -  The brunch is buffet style and in the rear of the floor with a sweet site of the city.  Don't miss out on the french toast!  My friend asked and someone told her that creme brule was mixed into the batter.  (I thought it was crack!).  Anyways, it was DEE-licious!  So was the devil's egg, the chocolate covered strawberry and pretty much every other pastry layed out on the table.    Yes the 40 bucks is a little pricey for brunch (esp. when compared to places like St. Francis where you can fill your belly for less than $15), BUT you can eat AS MUCH as you want, the food IS delectable and the experience is just pure entertainment!", 
    "review_date": "2007-09-16"
  }, 
  "5tA6XMewAx5PWZHGSgwWbA": {
    "user_rating": 5.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Marshall W.", 
    "review_text": "Review of \"Sunday's a Drag\":   I would give 4 stars, but added another star for just what it was, and how hard they try to please their clientele.  The cast is small, just 4 people, but since there are a lot of costume changes it seems like 20.  The MC and performer, Donna Sashay, was hilarious.  She quickly engaged the audience and had us laughing from the git go.  We were a bus load of folks from Petaluma, some 50 in all, and she made great sport of that pretending to have never heard of our town.  The show lasts about an hour, but was a lot of fun.  They are trying to establish the show as a San Francisco experience, and they depend a lot on word of mouth recommendations to advertise the show.  Review of the brunch.   The buffet, preceding the show, was first rate.  It was a full on brunch, including a omelet station featuring custom made to order omelets.  Plus prime rib cut to order. There was salads, desserts, and coffee.  Included was a cocktail of our choice, and my Bloody Mary was too strong but that was my fault for not choosing the mimosa or other choices.    Overall, the fixed price of $45 for everything.  It was a good value, including food, show, tax, tip, and alcohol.  The entertainers sat at the door after the show to chat with the crowd and pose for pictures.  Nice touch!", 
    "review_date": "2013-06-24"
  }, 
  "VUetlEs-Lcp3TYeCNzlfzQ": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Lori M.", 
    "review_text": "I've been to Sunday's a Drag at the Starlight Room several times now.  The food is great, the view is beautiful and the show is so much fun!  So many of us live in or near San Francisco and never do the \"tourist thing.\"  I absolutely recommend this being one of those things you actually try.  The show is different each time.  Everyone raves about the bacon...and hey, it is good bacon, but ALL of the food is delicious!  Come, sample everything and enjoy being entertained for an hour!  (Call ahead, though, since the shows often sell out!)", 
    "review_date": "2014-09-22"
  }, 
  "v5GuMw3GumrWhL4_WlgNHQ": {
    "user_rating": 2.0, 
    "user_location": "Worcester, MA", 
    "user_name": "Catie H.", 
    "review_text": "No maraschino cherries, no blue cheese stuffed olives. Can't make a Brooklyn cocktail...are you even a cocktail bar bro?", 
    "review_date": "2014-11-14"
  }, 
  "JuV8sk-evG7c1sQUK52agQ": {
    "user_rating": 1.0, 
    "user_location": "Springfield, VA", 
    "user_name": "D C.", 
    "review_text": "Snobby staff!!!  great views, if you can look past the DIRTY DIRTY windows that have probably not been cleaned for years!  Staff is rude, and crowd is weird!  Skip this place and save your wallet a cover and expensive (weak) drinks!", 
    "review_date": "2014-08-26"
  }, 
  "D5aDhmN7Qthz16xczo40kg": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Rosie B.", 
    "review_text": "As it turns out, the 50 dollar charge which I thought was the credit card limit is actually a pending charge that is reduced to the cost of the drinks you ordered after a few days. I do wish the staff informed customers of this instead of assuming we are aware of this \"industry standard\". However, I still recommend The Starlight Room for its atmosphere.", 
    "review_date": "2014-07-24"
  }, 
  "NnOJAzj8HnYWEqu9cV6_4w": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Kenneth F.", 
    "review_text": "Ok you gotta like 70s and cliche rollout stuff... but hey it was fun, tiny small dance floor but great great 8 piece band... all the old 70s stuff, Earth Wind Fire, Kool and Gang, TOP... it was great to go dance and have people there to just have fun, not cause trouble or be rude... we will go back particularly since we now like the Drake to stay for a weekend.. We're locals but playing in the City is kewl... Views were awesome!", 
    "review_date": "2010-07-11"
  }, 
  "vVEowpPzrXehovi0WUw64Q": {
    "user_rating": 1.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Ashley R.", 
    "review_text": "Walked into this place with three other friends at around 12:00 a.m. on Saturday, March 8.  We went because I've been here before twice and it has always been hilarious (good people watching, fun music, etc). Bouncer asked for our IDs. As we were getting them out, we asked if there was a cover.  He looked over at the girl behind the desk, and asked \"is there a cover?\"  She looked at us, looked down at her book or whatever, then said yes, $20.  No smile from anyone, no nothing.  Wow - so this bouncer didn't know there was a cover, and the cover appears to be subjective.  I've been here before, twice, and the cover was $10.  Bottom line: shady business, and it's not that great to begin with to warrant $20.", 
    "review_date": "2014-03-10"
  }, 
  "d1sLYlfSzHo6WCpfe-j7zg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kim D.", 
    "review_text": "My friends and I came here a couple times.  I like that it has this amazing view of the city and always a live band playing.  It gets super crowded on the dance floor and everywhere for that matter...even if you get a table I always feel you need to fend for it and make sure no one takes it since everyone is eyeing for a seat.  Crowd here is pretty mix.  It makes it pretty entertaining to people watch with cougars on the hunt and playing the \"is he/she in drag?\" game.    I haven't gotten many drinks here we usually just get a big punch/sangria bowl to share which I think is pretty reasonably price most the time.  Service however can get hard with tons of people around.  you have to flag down your server sometimes to get a drink and get the bill.", 
    "review_date": "2012-11-28"
  }, 
  "gSDkhYBIAJIE5sKB_AVZyw": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "David D.", 
    "review_text": "Great atmosphere and views of union square and the city. Good drinks and friendly staff. Very old fashioned feel to it which was cool. I would definitely come back.", 
    "review_date": "2012-02-02"
  }, 
  "4H4dQqBFkXh4AcsEdWYOIA": {
    "user_rating": 3.0, 
    "user_location": "Irvine, CA", 
    "user_name": "Adriana S.", 
    "review_text": "This place is located at the 21st floor of the hotel. It is $5 to get in. Drinks are good. Music is a little old school. The previous reviews were right about the people in the bar as being a little on the older side. Right around 10:30 there were go-go dancers that came and were dancing on top of the tables.", 
    "review_date": "2011-01-07"
  }, 
  "oqCWpZ4LpZS43ignuAj2EQ": {
    "user_rating": 5.0, 
    "user_location": "San Luis Obispo, CA", 
    "user_name": "Teresa A.", 
    "review_text": "We stopped by a rainy Sunday before Christmas.  Very classic old time bar. Bonus was meeting the stars of the Drag review!  Harry was at the bar and gave my newly-college-graduated son some great \"real world\" advice that I hope he takes to heart.  Great guy.  The Bloody Mary is probably one of the best I have ever had.  Classic, simple, great ingredients.  As Harry told me, it is all in the horseradish.  He is so right.  We can't wait to go back next year!", 
    "review_date": "2012-12-28"
  }, 
  "yv-P5qZrJx-EyfCfpkZORA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Petka C.", 
    "review_text": "I'd give it 4 stars if the busser did not put our dirty flatware straight in front of us, on a clean white tablecloth, when taking our plates away. I don't mind reusing my dirty flatware but it should be put on a bread plate or a napkin. Not on a white clean tablecloth. It was disgusting. People in my party (party of 8) were raising brows when they saw this happen.  The show was fun overall. The \"lady\" performing the Tina Turner was amazing.", 
    "review_date": "2012-11-19"
  }, 
  "Z1dOk3GAdt1Wfn1I1KWMEw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Winson S.", 
    "review_text": "Let's break this down:  -1 star for $15 cover charge in the weekend -1 star for super watered down drinks with warm glasses -1 star for security rudely yelling at us to leave when it's not even 2am  -1 star for the stuffy furniture and a limited bar  Basically, the remaining star is for the view. Would not willingly come again.", 
    "review_date": "2011-10-16"
  }, 
  "DMutsdi8ejYEyFAF8ZRDEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick B.", 
    "review_text": "Crowded late in the evening, but fun for dancing and curling up at a table. Some great drinks and an enjoyable place to be. Little bit of an older crowd and sometime hard to find a table, but an interesting place.", 
    "review_date": "2011-12-15"
  }, 
  "Xw0TuvGJTCsHK-4WHpN9jg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane L.", 
    "review_text": "Brunch is a Drag on Sundays is a HOOT! Really great show, delicious food and well mixed cocktails. Best show in town.", 
    "review_date": "2014-01-19"
  }, 
  "K5UHLEadijlcXeT1NQ0V4g": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Evonne L.", 
    "review_text": "Had an awesome bachelorette brunch here at the \"Sundays are a Drag\" brunch. We got a table right near the center of the room, and had a great time watching and interacting with the fabulous drag performers. It is a VERY interactive show :o) Host Donna Sashay is funny and charming, and the other performers were equally hilarious and engaging. My favorite was probably Cassandra Cass because she's pretty much Real Life Jessica Rabbit. Plus, her costumes were gorg.  The brunch part was super yummy too. Eggs benedict, prime rib carving station, chocolate covered strawberries, a variety of pastries, salads, and other breakfast items (bacon, canadian bacon, sausage, eggs, etc.). We also made sure to order plenty of mimosas as well. That really adds to the experience ;)  Got to take pics with the performers afterwards as well. LOVED IT!", 
    "review_date": "2013-05-20"
  }, 
  "RR6chkvedisFnKmo8eu65g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa Z.", 
    "review_text": "This is such a classy place with a great view of all of downtown. So beautiful and elegant. Even our cocktail servers wear long black flowy dresses. How nice...I went there on a weekend and had bottle service in one of the booths...I had so much fun and I had such a great time. Their view of the city is just magnificent and they also have a dance floor too. There is an admissions fee but I think it's all worth it.", 
    "review_date": "2012-12-23"
  }, 
  "niR5DH1r6JVQaEBnuyQHZw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen G.", 
    "review_text": "Went for a 30th birthday party. It was a great idea in theory, but in reality it was like being trapped at a bad wedding. Except instead of an open bar, you have to pay a million dollars per drink and you aren't partying with your drunk relatives, just old strangers. I've heard brunch can be nice though.", 
    "review_date": "2013-04-01"
  }, 
  "fLtqKGUhbOKr_sP23w4Txg": {
    "user_rating": 4.0, 
    "user_location": "Arlington, TX", 
    "user_name": "Tonia R.", 
    "review_text": "While visiting a friend in the Bay Area for her birthday, Her husband made reservations for us to have a little night life fun at the Starlight Room in San Francisco. We had reservations for a table by a window which over looks all of the city.  Once we arrived, we were taken to a table immediately.  However, it was located directly by the kitchen.  Which was very busy.  It was Very uncomfortable and had the feel of as if we were apart of the staff. With that being said we turned the table down and asked to be seated at something more inviting.  They ended up moving us to a table on the left side of the restaurant 3 table from the kitchen.  Without complaining we decided to take that table and enjoy the view.  Within minutes our awesome waitress Monica, asked for our drink order and gave some great suggestions.  The birthday girl had a rum punch, her husband Belvi on ice with lime, I had a tipsy rabbit and our other friend had an easy sippin!!!  All I can say is yummy!!!.  With lots of people celebrating Christmas parties, the section to the right of us was being reserved for a wedding.  As the staff had been trying to keep others from wondering over to the area we thought we would help out and suggested that they bring a velvet rope there to show its was a VIP reserved area which they did finally. Chris, the security on site took over the area and from time to time had to walk away.  So again we suggested to Chis that WE would help monitor the area, Since we were sitting right there, so he could handle other area's of the lounge. He was AWSOME!!! Now the mood changes when we get this so called host named Robert.  He comes over to the velvet rope and says to us, \"We're gonna move you all. This is the worst table in the house.\"  When actually he wanted to give our table to another customer and place us back by the kitchen again!!!.  So of course we refused and as he looked down upon us as if we didn't belong in this establishment, we asked Monica to send over the manager. When the manager came to our table not only was he personable but he was so friendly!!! It was if we knew him for years.  His name is Derick Opela!!!! He, Monica and Chris 5 Diamond for this spot.  However that Robert, this place could really do without. Derick took exceptional care of us and sent us all a round of birthday drinks and treated us as if we were royalty.  With the 3 of them on staff we said we would defiantly return to this place.  It ROCKS big time.....even with that ol' evil Robert.", 
    "review_date": "2014-12-17"
  }, 
  "6F0uGYwpJUGxhlMO6C3r_g": {
    "user_rating": 4.0, 
    "user_location": "Peoria, AZ", 
    "user_name": "Bad L.", 
    "review_text": "I know it's old and small, and the drinks are spendy, but THIS IS the Starlight room and gives you some great views of the city.   It brings you back to the days of old.   I enjoyed it.  I thought it was cool and it will be on my list of FAVs in San Fran.", 
    "review_date": "2014-04-19"
  }, 
  "3qGo-CYyFIUHVh3Teo-G_g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonia M.", 
    "review_text": "I came here for drinks and appetizers. The place is beautiful- you can't beat the view, looking down Union Square or up to the sky on a clear night. And the service was prompt. The food and drinks were nothing memorable- just fine.   The crowd was also significantly older... Not that there's anything wrong with that. I just didn't find this to be aimed at the under 30 crowd (at least not on the Friday night I went- and it wasn't being used as a club). I wouldn't go out of my way to come back here.", 
    "review_date": "2011-02-07"
  }, 
  "m5ssxEA0FTwYpGKi646Rjg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lara O.", 
    "review_text": "I got dragged here for a friend's birthday adventure on a Friday night.  I wasn't too impressed with the Starlight Room, but thanks to the trip I do know where to pick up prostitutes in San Francisco.  Seriously, this place should be renamed Harry Denton's Hooker Convention.  They even had a pimp there (or maybe he was just part of Run DMC) making sure his ladies were working their magic on everyone from the older gentlemen with their wedding rings still on to the eurotrash in tracksuits using prepaid mobile phones.  As a 28 year old lady, this place made me remarkably uncomfortable.  It wasn't the ladies of ill repute selling their wares that made feel dirty (I had lots of fun playing hooker or housewife). It was the mass amount of men twice my age who hit on me, a bad cover band, broken glass on the dance floor, watered down cocktails, and a weird musty smell that made me walk out shortly after arriving.", 
    "review_date": "2012-01-14"
  }, 
  "p6VpnzidZzpOPa03TrcK0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thankie S.", 
    "review_text": "worth it. just worth it. excellent ambiance I wasn't dissapointed at all. I'm taking my parents here for sure.", 
    "review_date": "2014-12-29"
  }, 
  "ObitDzUawFrc6xdvdhJ_hA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea V.", 
    "review_text": "I really loved the view and the ambiance of the place.  It was $5 for cover when I came around 8:45 pm.  $12 for a Vodka Red Bull, but it tasted slightly sweet and great to me.  ( Our waitress asked me if I preferred a particular vodka flavor and I said no.) The waitresses wore classy but sexy long black dresses.  A few male waiters wore tuxedos.  There was seating and tables.  The live band that night was not my favorite, but they did have a DJ later on.  They do have a piano too, but they did not play on it that night. The dance floor had a mirrored ceiling, which reflected the little white lights on the dance floor.  (The ceiling looked like stars).  We loved the gorgeous views of all of Union Square and even the freeway lights.   It is a twenty one floor elevator ride up to the top, and it is in the Sir Francis Drake Hotel.  There were people there of all ages and styles, but most were in their thirties or older.  My friends and I loved the glamour of the place and will come back in the future.", 
    "review_date": "2013-05-26"
  }, 
  "4LBQJOg86EZAcoiYEjPL0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "julie q.", 
    "review_text": "Ok I love this place and have reviewed it before, I have been here over the past 3 years for different occasions. Once for a birthday which was very fun, my husband's company Christmas party which was a blast and great food! Today  September 29th 2013 I went to the noon drag brunch with a friend and we had a blast! This is the perfect blend of brunch, entertainment and just a bit of the cheesy sparkle that the place offers! It was a good mix of people, good food and beautiful entertaining queens! Make sure to arrive early to enjoy brunch.", 
    "review_date": "2013-09-29"
  }, 
  "VpREWOjt5Pna6OIgXI9Jcg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tara H.", 
    "review_text": "Cool. Great view. Expensive drinks. They apparently have food, which is probably overpriced. Yadda yadda. I'm not *dying* to come back, but I'd probably recommend it to visitors.  I have a friend in high places (do expatriate techno DJs count as high-place people?) who was performing here one night. I credit him for getting us out on the \"balcony\" (a fire escape with a nice view where the employees take breaks), so that was pretty cool. The crowd that night was meh (techno ain't really my thing), but the atmosphere of fans + older tourists still didn't bug me.  I give it props for being nice and old-worldy inside, with tons of pictures of Harry Denton and all the famous people who hit up his bar back in the day. Cocktail (just the one at $12 a pop) was good; Cointreau and rum concoction was tasty, but nothing exceedingly special.  it seems like Top of the Mark is their biggest fancy-drink-old-world-bar competition, so I'd still head there first if I'm in the area and looking for an old bar with a view.", 
    "review_date": "2009-10-07"
  }, 
  "IZcByTHZhWnWdfWoL10pVA": {
    "user_rating": 2.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "John T.", 
    "review_text": "Maybe the place has a great atmosphere and a stunning view of the city, but even combined those certainly doesn't compensate the terrible service that can only be described as pretentious and unorganized. The \"manager\" that was huffing and puffing around seemed more like he was monitoring a hot dance club roof bar, but someone needs to remind him that its a lounge and that he needs to calm down. After sitting down for awhile and enjoying our drinks, we saw the manager speaking to security about us. Nobody likes being talked about from across a room.  Moments later, the same security guy that checked our ID's came back to say that the manager wanted to check one of our ID's once more. At this point we decided that our presence wasn't welcomed and we left. The only redeeming qualities were the ambience and the live band, but besides that we didn't feel we were wanted there.", 
    "review_date": "2012-12-30"
  }, 
  "l36ud3agBxzBJ88zIeNVfA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline J.", 
    "review_text": "Starlight room is a great spot to celebrate a special evening out. Situated on the 21st floor of the Sir Francis Drake Hotel, the classy club offers beautiful views of San Francisco's city sky scape. Here, the rich, extravagant interior and luxurious lounge chairs are fit for a king. Perfect place to sit back, relax, and sip champagne or a signature \"Cable Car\" cocktail.  Bar bites include seafood snacks, gourmet pizzas, and fillet mignon sliders. For a sweet treat, enjoy a plate of fresh strawberries, rich chocolate sauce, and sweet cream frache. Nothing screams \"special occasion\" more!   Continue your night on the dance floor. Live music playing all ages hits in a \"wedding party\" way. The intimate dance space is surrounded by large, open windows offering romantic 360* views of beautiful city below.   Service is spectacular. The bouncers, bartenders, and helpful hostesses all go the extra mile to make the night one to remember.   Be prepared to pay  the price for the room's royal treatment. Cover is 15 a person and cocktails are costly. But an evening at the Starlight Room is worth every precious penny. Guaranteed to make you're next celebration sweet - the Starlight Room is a delicious San Francisco treat!", 
    "review_date": "2009-07-05"
  }, 
  "uZdFsE_aHbFBChgN6Xa8tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris L.", 
    "review_text": "This place has great ambiance and the views were amazing.  The service was pretty awesome, especially the guy at the front.  He was really gracious and accommodating.  The waitresses are in long, black prom-like dresses and the door guy was dressed in a tux!  As the Yelp reviews already mention, I saw some cougars and older white men with their younger Asian female counterparts.  But not too many.  Most were tourists or groups having a drink.  They played hip-hop music and have a dance floor.  This place has a lot of fabric (i.e. is dusty) and I kept on sneezing after awhile.    Good place to grab a drink with a friend around Union Square!", 
    "review_date": "2012-04-09"
  }, 
  "8qhMB7cHwrEYI69LVz2Yvg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron H.", 
    "review_text": "I went to a drag brunch here when a friend was in town and the food was really good and the drinks were really good but based on the price I was expecting more. 3 stars deal with it! Jk.. You should go at night and get a punch bowl of something. Especially if you're a tourist in the area.", 
    "review_date": "2012-12-27"
  }, 
  "pBNqvV5IkldL24s418ZzRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shadi N.", 
    "review_text": "+1 star - atmosphere  - -  just getting up to the lounge itself adds a load of 'color' to the experience. +1 star - view +1 star - live music +1 star- friendly bar staff +1 star for the bouncer  for letting me in free and giving my friend a discount on the cover charge.  -1 star - for a weird crowd - ghetto/ mixed with cougars/ mixed with sleezy old men / the whole feeling of the place is a little too 'pick-upy' for me. -1 star for charging a cover  i'll go back, but they are not top on my list. Its a nice spot to check out if you are in union square and want to grab a drink.", 
    "review_date": "2009-12-12"
  }, 
  "IpReaQYuXO_nB07xnkHuNw": {
    "user_rating": 5.0, 
    "user_location": "Dallas, TX", 
    "user_name": "Mary S.", 
    "review_text": "Located on the top of the unique and legendary hotel Sir Francis Drake.   I need to quit drinking so much because I don't remember the evening...wait the door girl was a total knock out!  Tall blonde with gorgeous red Dior lip stick......the servers were eye candy!  I remember some Red Wine a cheese plate and old fashioned cocktail....oh yes it's all coming back before I blacked out.  I was dancing by myself and gyrating like a drunken fool...I think the DJ uploaded a video on Vine and hashtagged it #stupidwhitegirl   Great people watching!  Impressive View of the City.  This place is nostalgic only the Real Deals \"Get it\"", 
    "review_date": "2013-09-04"
  }, 
  "PVpeB-fTAd5qi1vxDTSehw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S. M.", 
    "review_text": "Came here on a Wednesday night (Cinco de Drinko to be exact) And it was crowded, music was bumping, drinks were reasonable, but the best thing about this place is the view! It's amazing, if you just go to take a gander at beautiful SF then you are in for a treat. Definitely plan on going again - Wednesday nights I hear its the hot spot, and it was proven correct.", 
    "review_date": "2010-05-06"
  }, 
  "lpNHyguJOj4mO5PWeuVJEg": {
    "user_rating": 5.0, 
    "user_location": "Oceanside, CA", 
    "user_name": "G B.", 
    "review_text": "This place was inside the Sir Francis Drake Hotel. Very cool inside. Great music, great drinks, and the coolest view of San Francisco! I loved the fried Mac and cheese squares they had for an appetizer. If you are in the city visiting I recommend you come here even if it's just for the view &amp; a drink!", 
    "review_date": "2014-09-12"
  }, 
  "SJV7XYKkWHKe7EPr5_QhAg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Dee Was Here Z.", 
    "review_text": "I visited the Starlight Room last night (12/13/2014) on a whim and first time visit. Being the holiday season, there were lots of families waiting to get in with me at 6:00 p.m. Due to the fact that I have kids and don't care to be in \"kid friendly places\" (mine are grown), it was a pleasant surprise. The staff was super friendly and attentive. I was with a date and we both enjoyed the view, decor and ambiance. This place reminds me of an old skool place where mobsters, gangsters and back room politicians would plan and connive during the Roaring 20s. Red velvet curtains, high ceiling windows, crystal hanging from the ceiling, recessed lighting, skyline views and piano! I felt like lighting a cigar and sipping some $800.00 cognac. But I don't smoke cigars and drink my money.     Our drinks were basic: Amaretto de Saranno and Stella beer. We also had raw Tuna Dip with chips. The chips were bland and reminded me of the Holy Wafers provided at communion. They were flavorless and the Tuna Dip could have used some added flavor. But it was OK and edible.   The bathrooms were super clean and the lint free paper towels were good enough to wash/dry my car with. I would come back for drinks with a stunning view and super friendly staff.", 
    "review_date": "2014-12-14"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Star light, star bright,  The first star I see tonight;  I wish I may, I wish I might,  Have the wish I wish tonight.  *Opens Eyes**  WTH, I didn't wish for a room full of Sugar Daddies!!!  I was going to give Starlight Room 2-3 stars after my nightlife experience on 11/10; however, this wouldn't be fair since most clubs can't control the type of crowd they attract/bring in. I also had to take into account the company holiday party I organized here 3 years ago, hence the 4 Stars.  ***N I G H T L I F E*** Since we had Veterans Day off, my friends and I wanted to party the night before. I remember hearing about Wed (Indulgence) Hip Hop Nights hosted by Sebastien Entertainment, so we decided to give it a shot.  LINE: We got there at 10:30 PM and the wait was less than 2 mins.  COVER:  Free before 11 PM, if you're on the GL; otherwise it's $10.  DRESS CODE: Although no dress code was stated on the FB invite, SR is not a place to come rocking your newest kicks. It's a very classy venue, so dress to impress!  CROWD: SUGAR DADDY AND COUGAR CENTRAL! The average age was about 50--I kid you NOT! There was probably a 3:1 ratio of men to women and the majority were tourists. It wasn't our scene, so we left to Infusion. I think the crowd is a result of the event being under promoted.   MUSIC: Top 40s, Hip Hop and Pop. Guest DJ Primetyme was awesome; good mixes and smooth transitions. The music was so good; we even contemplated coming back here after leaving to Infusion.   BAR: There's a main bar upon entering SR and a make-shift one near the dance floor. They have an extensive array of liquor including many rare and expensive ones.   DRINKS: $11 for top shelf liquor which is reasonable considering it's an upscale venue in a historic downtown hotel. Generous shots were served in cups.   Bottle service was available for $150/ bottle for Absolut and $200/bottle for Goose which probably needs to be booked ahead of time from the promoters to lock in this price.   AMBIANCE/DÉCOR: SR is very classy and reminiscent of the 1930s with deep red velvet booths and draping, diamond chandeliers and staff decked out in a white tux and black bow tie. There are about 6-8 booths reserved for bottle service. The dance floor is pretty tiny and probably the size of 4 cubicles. There's PLENTY of dancing room as most of the crowd wasn't the dancing type.   The main attraction is the GORGEOUS 360-degree view of San Francisco. It's truly breathtaking to see a bird eye's view of SF's landmarks and the city lights on a crisp night. SR is definitely a great place to bring out-of-towners or a date for drinks.  PARKING: Street parking is difficult but not impossible at night. I got parking 1.5 blocks away after circling just once. Otherwise, there's valet parking.   ***P R I V A T E  E V E N T*** Since I organized a company holiday party 3 years ago, my review is very dated and lacks precise detail. However, the customer service was excellent and I didn't have a panic attack, so it's very noteworthy. (Do note that SR is open to the public at 9:30 PM.)   Jaime, the Events Manager at the time was very easy to work with. She was very friendly, professional and responsive. She always responded to my calls and/or e-mails within 24 hours.   I told Jaime our company budget and she gave us several options on how we can maximize our budget. She helped us work out a plan so that we can offer unlimited red and white wine. And, as a surprise she even had the bartender make a specialty cocktail with our company color which we handed out drink tickets for.   We ordered 2 stations: North Beach Station (antipasti and various pastas) and Chinatown Station (dim sum dishes). Although the stations were suppose to be more like hors d'oeuvres, the food portions were very generous so everyone was well fed. I did have some doubts about the lack of authenticity of the Chinatown Station, but was told that they have Chefs that specialize in each region of cuisine. And, from what I remember, the har gow, sui mai, and char siu bao tasted similar to what you get in Chinatown, Sunset, or Richmond.  DJ Dave Gillis is SR's in-house DJ, so we didn't have to bother looking for one. DJ Gillis was very easy to work with as well. He sent me playlists to look through beforehand and played songs that suited our employees. Most of our workforce was engineers, so needless to say, there was no Flo Rida's \"Get Low\" or Kelis' \"Milkshake\".   As far as the event went, it went off without a hitch. My former colleagues aren't party animals, but everyone enjoyed the food and getting to mingle with each other outside of work. I got commendation for days about how well the event went, but I have to thank the staff at SR for helping to organize a successful event that was virtually stress-free.   All in all, although the nightlife crowd was not my cup of tea, I would come back to SR for the music and venue not without good company of course...", 
    "review_date": "2010-11-15"
  }, 
  "7e3aUxxnArwmOp7EzyBOuw": {
    "user_rating": 1.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Melanie M.", 
    "review_text": "Overall we were disappointed with our experience. Our waitress was rude at first and forgot to place our food order. After about 20 mins, we got our punch bowl drink, which was fun! Then about 45 mins after we sat down and our order of Mac and cheese and chicken nuggets still were not here, we requested our check. Needless to say, I would not recommend this place besides the view and punch bowl bur defiantly don't order food.", 
    "review_date": "2012-07-22"
  }, 
  "6xSbtQsu_X4erlm3l0PxZA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "snowwhite w.", 
    "review_text": "I was there last Saturday. The door guy there pretty rude. I am arrived a little bit passed 10:30pm and I tried to bargain with them because their website said Guestlist close at 11 not 10:30. He just simply showed me the exit. I actually call them twice before this event and want them confirm with me this schedule. but nobody call me back. If I did not have a group of friends wait for me inside already, I will argue with them.", 
    "review_date": "2013-07-29"
  }, 
  "g-izCxO8zgvkIGaGOqdk-w": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Katrina N.", 
    "review_text": "Wonderful night! Bit of a fuss to get in as they had a private party first, so they opened late. Had to wait in the lobby downstairs in the bar. Music was great. Motown and current music was wonderful. Danced for hours! tables were reserved at a fee so we stood or danced. Mixed crowd, 20-50s mostly couples dancing.  Great drinks on the pricey side. Superb view of the city", 
    "review_date": "2012-02-29"
  }, 
  "Lp4ofPjCh1VRklL_j2Eqlw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shai W.", 
    "review_text": "hmmmmm this place was kinda fun and exclusive....  I like the fact that it was at the top floor of the hote, and overlooked the city. I was at a press realease shoot for designs by Danielle Pette (She's awesome!) And my secreto crush came with me (He's awesome) unexpetedly had a hellova time. I'd definitely go back. This place is a great spot to go chill with close friends, and just have a close knit kick back, knock back a few drinks, and dance the night away (haha cheesy line). LOVE it, will definitely go back. It also held that my friend is the bouncer there! =)", 
    "review_date": "2010-03-17"
  }, 
  "7bAnU8PIEmAV_tUeaIdCaw": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ennie L.", 
    "review_text": "This place has damn sketchy wait staff, my husband charged $250 on his AE and when he checked his bank statement, the staff added extra tip on his bill! Seriously, wtf. Can't imagine how often they've gotten away with that. My husband has reported them to AE to dispute the charge. Manager needs to figure out what's going here.", 
    "review_date": "2014-01-28"
  }, 
  "l-ECea3knk6W_euS6-dSag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason I.", 
    "review_text": "Sunday's a Drag - HOLIDAY EDITION  (that is the name of the Sunday Brunch at the Starlight Room).  This is something that has been going on for a few years, so a group of us decided to go.  You get two things when you go - a buffet brunch and drag show.    Brunch - Um, 2 stars.  Not the best.  You had an omelet bar which was probably the best part.  They have a meat carving station - not sure what the meat was but it was pretty bland and you had to ask for more than one piece if you wanted more (and you will because they give you a pretty skinny piece).  Bacon was good.  Other stuff was okay - nothing fancy or very tasty.  Holiday Drag show was fantastic.  Hosted by Donna Sachet - she does a great job.  All of the performers were fantastic as well.  They definitely have the performance down!  The holiday show was great, because at the end you get snow.  Oh, and don't be surprised if you go and get pulled up on stage!", 
    "review_date": "2010-12-23"
  }, 
  "9d45b2HFZUTffGP3MwzNyQ": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Caren L.", 
    "review_text": "Five stars for the view, four stars for the kitschy, bordello-like decor complete with red velvet seats, heavy drapery and doorman in a tux (their schtick I guess), and 3 stars for the drinks (too pricey and was not bowled over, did not even finish it).  Love, Love, Love it though when the DJ played \"I left my heart in San Francisco\" as the last song of the night.  Just the right note to end a wonderful evening with friends, complete with the blinking lights of Union Square.  A place to visit if you are ever lucky enough to visit the Bay.", 
    "review_date": "2011-06-01"
  }, 
  "-_VJmFYr8yIZL4rF9GI9TA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lily l.", 
    "review_text": "Saw the drag show as a groupon customer. It was great that they allowed one groupon per person at the tables. The place was overly made up, a left over from another age and just plain cheesy.  Perfect for a drag brunch!  They were entertaining for an an audience that was composed mostly of tourists, and folks like us, drag aficionados.  The \"gals\" were talented. The brunch itself was fair,. And the service was passable. Overall, it was worth the groupon price we each", 
    "review_date": "2010-08-03"
  }, 
  "fgfDltv6iJMImzG8D39nMw": {
    "user_rating": 2.0, 
    "user_location": "Danville, CA", 
    "user_name": "Alina S.", 
    "review_text": "What the hell?! When did this place turn into a hyphy club with a $15 entrance fee?! It was really busy and I know the views are amazing but it's way too stuffy &amp; crowded. So hard to get to the bar. There were older people dressed up as if they're going to a gala mixed in with young people who were wearing nothing but what seemed like a long t-shirt.  We ended up going downstairs to the lobby and then elsewhere for a drink.", 
    "review_date": "2014-12-23"
  }, 
  "m3f1x02-81PfN-3LnIzOlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yuchi C.", 
    "review_text": "Went on a Friday night, and the coverage was only $5? I thought it was $10 last time I went.  View: I didn't think it was that spectacular, maybe because it was foggy that night. The building isn't high enough, or isn't situated high enough so you get blocked by other buildings around.   Music: went in at around 10, the music was for the older crowd. I didn't know the music, but i knew they were not normal club music for the young. Tried to dance, but it was awkward, maybe I am awkward. Most people dancing around that time are old. However, as it gets later in the night, the music changed to the normal club music, which makes the room HOT!  Drink: reasonably priced. Folks, this is one of the best spot in SF, so no $5 cocktail OK? go to a college bar or something if you are looking for cheap drinks. The cocktails were well made, my Cable Car was very very tasty. I licked the cinnamon on the rim...YUM!  Restroom: amazingly clean!! Unlike many other club/bar when it gets late and drunk people start puking.  Host: the host who led us to the seat was a sweetheart! He watched my purse when I left it on the seat and hit the dance floor. By the time I came back, he gave me a little sweet talk, warning me that there are people here just waiting for purses like that to be left on the seat.  Overall, it's a great experience. As busy as it is around union square, I didn't have much trouble finding street parking around at night both time I went there.", 
    "review_date": "2008-08-11"
  }, 
  "lppwCBZaoOZrCStDXO6lnQ": {
    "user_rating": 1.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Laura F.", 
    "review_text": "The bouncer staff with ego is so rude and condescending that I do not recommend this place. The bouncers are vulgar.", 
    "review_date": "2014-12-07"
  }, 
  "_3TzyX5mRpA8Afubqp6g9Q": {
    "user_rating": 1.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Kyle I.", 
    "review_text": "Aside from the nice view of the city, this is the sort of place I could see myself in when I was in college trying to impress a girl or seam classier than I actually was.  It's very much a vodka tonic or heineken beer place.  I feel like it's also a decent place for NYE, again, if you're trying to impress someone.  I really did not like how when I first stepped into the lounge the bouncer grabs me in the chest region, as if I were storming the beaches, and says something to the effect of \"ID and WHERE DO YOU THINK YOU'RE GOING!\".  I mean, c'mon dude you're 2 feet taller and have about 200lbs on me.  We needed to walk through a curtain in order to enter the lounge, and proceed to the checkin.  Did the bouncers need to flex his authority at that point?  Was I going to checkin and make a run for the bar to choke down as much alcohol before he got to confirm my ID?  Maybe once I figure out how to move faster than the speed of light that abruptly stopping someone when they first walk in might necessary as a pre-caution.  Tsk tsk", 
    "review_date": "2014-12-01"
  }, 
  "eCPeMIEAjOpzq5ArgS_tBg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Janine D.", 
    "review_text": "Very cool place... love the atmosphere and ambiance", 
    "review_date": "2012-07-06"
  }, 
  "M-OyDg7UU0RKJh70GkDuHQ": {
    "user_rating": 2.0, 
    "user_location": "Bay Area", 
    "user_name": "Tracy Y.", 
    "review_text": "I think the only thing that I liked about this place was the view and the well mixed drinks.  Maybe my experience here wasn't that great because I was clearly the youngest person there that night and they weren't really playing the kind of music I was used to. This lounge is pretty small with booths and tables on both sides and a very small dancefloor by the window. Overall I just wasn't feeling this place and left after just two drinks.", 
    "review_date": "2010-09-22"
  }, 
  "VoyMYXTMDDqXfAbyZsM5pQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annette D.", 
    "review_text": "Went there for the first time this last weekend. They had an awesome band, good drinks, nice atmosphere and friendly people. It was pretty hopping too. Maybe a little older crowd, but it's more of a mature atmosphere, if you want to get wasted and hit on chicks I suggest go to a cheap bar. I was there on a date with my boyfriend and it was great :) I'm definitely going to go back!", 
    "review_date": "2012-04-10"
  }, 
  "WzgTJg1cWYsFMCZKLHd8-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa L.", 
    "review_text": "Sunday Drag Brunch = $45 Drinks at brunch ~$10 each The look on your face when you realize the woman in front of you was a man = priceless  Front row seats, a plate full of food and lots of singing, big hair, and boobs.  If you're an Asia SF fan, I would recommend this show for brunch with out of town guests.    The food was meh.  And the show is definitely entertaining for men - I feel like women aren't as interesting to the ladies on stage... but come for the experience.   Afterwards, you'll feel motivated to go hit the gym because everyone on stage is in freakin' great shape.", 
    "review_date": "2012-07-04"
  }, 
  "5qZb6nLd7gRnTQK6OKwAPg": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Heather W.", 
    "review_text": "if you are staying at the drake already, and want a lively place to grab a drink, a bite, and listen to live music...its definitely a default choice. i dont agree with a \"discounted' cover to hotel guests, but it is what it is.  we came up to this top level lounge on the first nite of our stay around 11pm friday night. the place was happening and seating was very limited..dance floor was full. quite tough getting a window table to enjoy the spectacular view. there was a very lively cover band playing a wide assortment of top 40s music from different eras. it was loooooud, but fun.  shared the baked mac n cheese - totally different that i expected. they are 3 fried breaded macaroni balls rather than regular baked version. delicious, no doubt, but a little small in the portion.  Quite the extensive specialty cocktail menu...you really cant be disappointed by any choice. they are the typical high prices ($12-$14) but high end ingredients and thoughtfully made. however my final tanqueray 10 and tonic was just as delicious to me and a much larger portion.", 
    "review_date": "2012-08-14"
  }, 
  "0-b7saOcK9M6GT9SNrRDlg": {
    "user_rating": 2.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Steven H.", 
    "review_text": "We went to the Starlight room on March 8th. There was a special put on by Frenchy le Freak.  The music was awful. All House music, loud and obnoxious.  I have been to Harrys many times and there is often the same problem.  Many people eager and willing to dance.  No good dance music.  Try and ask the DJ or the management to play danceable music and they blow you off. In the meantime, patrons stand around waiting for a decent song. After 30 minutes most people leave in disgust after paying their $20 cover charge.  This place puts on like they care about their patrons, but they simply don't.  They have their own agenda.", 
    "review_date": "2014-03-11"
  }, 
  "M4x7LkzUqKoRNlV42uFo7A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marty F.", 
    "review_text": "came here with my buddy a few days back. First off, the girls look like second hand dolls, which to me is a complete turnoff. We go to order our drinks (expensive) and she laughs at me. Five minutes later , some panzy ass in a black bow tie inspects my id for like 2 minutes and then tells me that he will not accept it.  NEVER GO HERE . nothing is worse then a shitty place with a shittier staff", 
    "review_date": "2012-04-13"
  }, 
  "VHdY6oG2JPVNjihWhOooAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica T.", 
    "review_text": "This place is such a trip.  It reminds me of hotel bars in Qatar - with the random assortment of people who all seem to look so out of place, but yet so in place here. I am always amazed how such a kooky group of people, all make their way out to the Starlight Room- to drunkenly and awkwardly attempt to dance on a dance floor  - overlooking all of San Francisco.  It's genius. That's what it is.  Seeing some unshaven hipster couple bust out moves beside a graying couple - her squeezed into a way too tight sequin dress - while he dons an awkward fitting Dockers blazer and tapered khaki pants,  makes me smile.  I love it.  I appreciate that the dance floor is just as entertaining as the phenomenal view - through the big glass windows lining the dance floor. And when I say phenomenal - I mean it - a breathtaking view of downtown San Francisco and Union Square.  But view and amazingly strange crowd aside, there is something off about the Starlight Room. While it's fun to visit on one off occasions - it's not the kind of place I'd necessarily roll into regularly.  There's a bizarre cheesy factor to the place - which can be exciting at times - because you never know who you're going to be standing next to, or talking to; but at the same time - it's just that: a surreal world - where you just don't really know who you're talking to.   The Starlight Room seems strangely familiar - but at the same time - cold and unbalanced. It's not the kind of place that I would want to step into alone. There's just wayyyyyyyy to many strange characters walking around here.  My advice on how to best enjoy this space: dress up and go on a fun date here. Cuddle into one of their dimly lit booths. Or go with a group of friends who can appreciate quality people watching. Because this place delivers. And then some.  Trust.", 
    "review_date": "2009-11-01"
  }, 
  "5l4td5Hyf_aGfE8ZYJBaYw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan A.", 
    "review_text": "A great place for a drink and a chat. The cocktails were amazing. Old Havana for me please, while my wife enjoyed a Bella (peach puree with lemon, pineapple &amp; cranberry juices). Although drinks were great, I would only give the appetizers 3* and would pass next time.  Now, the 260-degree, top floor city views, on the other hand, only added to the already romantic and elegant ambiance. A place really set in time. The view, drinks and excellent service will make you return again and again.", 
    "review_date": "2011-03-29"
  }, 
  "_KBhBafbDBagR4wtNUijNA": {
    "user_rating": 1.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ashley M.", 
    "review_text": "Just visited the Starlight Room, at 10p on a Saturday night, as an out of town visitor looking forward to celebrating my birthday at a classy establishment. Here are my findings:  $10 cover/person. Right off the bat, they charged me.   Ordered two drinks from the bar, vodka tonic and rum and coke (well drinks at that). $19. Ouch. After the $10 cover?? I'm from Los Angeles and I still found that outrageous...  Music, straight out of the nineties, if not earlier. Only one song was played from this decade and that was Macklemore's \"Thrift Shop\". If you're looking for a hot spot to dance in, this is not it. Dance floor was filled with older folks who are probably staying at the hotel. Want to see 50 year olds jitterbug to Prince? This is your place! Plus the DJ clearly did not know what he was doing, as he would play one upbeat song, and then immediately play three songs that all you could do was step to.   After all that dancing, I figured it would be nice to sit. NOPE. All the tables were reserved, which really takes away from the ambiance, when you can't sit in their pretty red booths (part of what drew me there in the first place).  All in all, a DISAPPOINTING experience. If you've never been there, I wouldn't go expecting much. I'm sure the drag brunch is great, but seeing as I already spent $40+ to be disappointed, I'll not spend the extra $90 to see if their drag queens are as good as ours.", 
    "review_date": "2013-05-04"
  }, 
  "ISqKwmeNqMB1EdHBk9Tktg": {
    "user_rating": 2.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Geoff B.", 
    "review_text": "Good views. Okay cocktails. Terrible service. Don't go here unless you don't mind being late to whatever you're doing afterwards.", 
    "review_date": "2014-03-20"
  }, 
  "ZpE3x2SerjBqYGcKr0HJWw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael C.", 
    "review_text": "This used to be the place to party on a Wednesday night. It's gotten really old, however. Not old as in \"Peter Pan Syndrome\" 20-and-30-somethings. Old as in...Fifty-somethings.  Everyone has a right to party, but I'm gonna have to find a different Wednesday night scene.", 
    "review_date": "2011-07-18"
  }, 
  "yaQo-D2iRS8boc2kE3wxHw": {
    "user_rating": 4.0, 
    "user_location": "Pensacola, FL", 
    "user_name": "Jay W.", 
    "review_text": "This place has a spectacular view of San Francisco and a great selection of wine, scotch, and beer. I would highly recommend heading here for a drink one night just for the view if not for any other reason.", 
    "review_date": "2013-01-23"
  }, 
  "xE3gLCGvWYleB-WJPUWC5w": {
    "user_rating": 3.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Marshall M.", 
    "review_text": "Beautiful views of Union Square and some good looking people to watch. The live bands are always great!  Nice central location, too.", 
    "review_date": "2010-07-05"
  }, 
  "TZelLnaGbHgaG7LBI6rfgg": {
    "user_rating": 3.0, 
    "user_location": "Calgary, Canada", 
    "user_name": "Jonathan W.", 
    "review_text": "The people watching is hilarious. The view of the city is nice but you will see some strange. Creepy out of towners and old people making out like teenagers sends out the weird vibes. This place is for your old uncle after popping some Viagra. Drinks were so-so.", 
    "review_date": "2013-03-05"
  }, 
  "Sz0B_4T9K8FLrx5Bqob-Lw": {
    "user_rating": 5.0, 
    "user_location": "Rancho Cucamonga, CA", 
    "user_name": "Anthony E.", 
    "review_text": "Easter 420 Sunday is a Drag brunch buffet. Food was delicious and the show was very very entertaining. I can definitely see why the show has been going on every Sunday for 8 years. Thank you to Michael (producer) for putting on such a great show at a terrific venue", 
    "review_date": "2014-04-20"
  }, 
  "AHI4Ew--zYhs0m8npEd65g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aki N.", 
    "review_text": "Eclectic crowd makes for some interesting people watching. Broad generalization would be tourists and 'bridge and tunnel', people having a good time, but the venue feels kitschy and not quite worth the $15 cover.   I went during holiday party season, so quite a few cocktail dresses, in addition to typical SF jeans and t-shirt look.   Nice view of Union Square from the dance floor, though it was so steamy in there that it looked blurry even after rubbing the windows. Semi crowded dance floor, and dancing itself was barely ok... music was eclectic to the point that the DJ must not have been watching the crowd (or didn't care) that when he drastically changed genres he lost half of his dance floor.  Might be ok with a table, but long wait at bar (though stiff drinks)", 
    "review_date": "2014-01-05"
  }, 
  "Mj5f9C-rVEuMDgmMW3Zm3w": {
    "user_rating": 5.0, 
    "user_location": "Lodi, CA", 
    "user_name": "Laurie R.", 
    "review_text": "Oh how I do love the starlight room!!!!  This was my 5th or 6th time here. A definite must for me when I go to union square. This is one of the best views in SF.  We arrived around 1pm on Sunday after some shopping. What a great choice! It was drag queen Sunday, like all Sunday's! We were seated at the bar &amp; offered prime seats for the show for free! Nice!!!!!!  The bartender was great. He asked where we were from. Me, being a resident of the east bay was not nearly as interesting as my friend from Idaho. Why!?!? Because the owner is from Idaho. He came over about 5 minutes later, told us some stories &amp; bought us a round. How very awesome is that?   Such a great time at the starlight room, as always! A must go place in union square.", 
    "review_date": "2012-07-30"
  }, 
  "xB7WBew_ZM196sPBCoO3Bg": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Cat M.", 
    "review_text": "Old school lounge with killer view. Love the 70's style dresses worn by the waitresses.  Takes me back to the old days. Drinks are VERY strong.  Almost too much. Matre'd was very nice. Dance floor very small.", 
    "review_date": "2014-08-01"
  }, 
  "IKTyFlE_VsoFyapciSP2Rg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casey S.", 
    "review_text": "My friend and I happened to be walking by one evening and decided to pop into the Starlight Room. I know it's a novelty bar and has great views, if you can get a seat by the window, but the drinks just weren't that great, especially for $15 a piece and the company wasn't super fun. Maybe next time I stop in I will make a point of coming with a larger group of friends and ordering beer instead of the super sweet sugary mixed drinks behind the bar.", 
    "review_date": "2014-03-04"
  }, 
  "dvC9oGW_30ofJsGMBlNdhA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "LJ G.", 
    "review_text": "This review is for Sundays a Drag brunch. It's a fun environment but a very small room. Brunch food was just ok. The performers varied. The emcee was the only one who actually sang. Everyone else lip synced and danced around.  The \"Single Ladies\" performance was very good.,,she had the moves down. And Cassandra was amazing as she was stunning with a great body, but her talent seemed to be just how great she looks as a woman. I also don't think she's technically a drag queen as it seems she may actually be transgender. But I'm splitting hairs. It's a fun way to spend a Sunday afternoon, but probably not something I'd do twice.", 
    "review_date": "2014-08-18"
  }, 
  "ZIR96Kh35GvW2eLyQHJh1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David G.", 
    "review_text": "Miss seeing Harry Denton at this venue as he really made the place one of the fun \"go to\" places in the city for drinks. Here's to you Harry!", 
    "review_date": "2014-02-18"
  }, 
  "PeIL3tQikUInID2tWEBEJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bryan M.", 
    "review_text": "I am writing this review especially for the  'Sunday's Are A Drag' Brunch.  First of all..... The Starlight Room looks great in the day light.  They lightly block the windows, and create a Stage in the center of the main room.  For the brunch ...... a buffet of quite good food.  Everything from Chicken and Waffles,  French Toast, an Omelette Station, Prime Rib Carving Station, all kinds of yummy things....  Good desserts, and a selection of juices..... They encourage you to go back multiple times.  Extra points for the guy who busses the empty plates!  He does not let dirty dishes linger!  Then.... it is Showtime.  I've seen Donna Sachet around for years.... but.... I had no idea how talented she really is.  She is the Star of the show, and the MC.  She sings in her own voice..... and is completely hysterical when she is talking with the audience.  She goes by every table, and makes everyone feel so welcome..... like she is doing the show just for them.  She looks every person in the eye as she makes her rounds.  The other performers are fantastic...... Each one with a different style.  My Republican parents LOVED it!  I did not tell them it was a drag show till we got there!", 
    "review_date": "2013-05-30"
  }, 
  "TpZN51jtAZTu7BjYxTfpjA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Kari T.", 
    "review_text": "Absolutely beautiful. I went here for Valentine's Day weekend. It was so much fun to get to go to the top floor of the Sir Francis Drake Hotel. The view was incredible. Windows wrap all the way around the restaurant. There were beautiful chandeliers and the booths had 1930's style stripes. I can't wait to come back for a meal in the daytime and just look at the view. The dance floor is small but there are windows on 3 sides of it. The night I was there they alternated between a live band and a DJ. Both of which were fun to dance to. The crowd is pretty varied. It is 21 and up but I would say its geared more towards over 30 but it really varies. The Starlight Room is perfect for a night of getting dressed up and celebrating in a beautiful location.", 
    "review_date": "2011-03-12"
  }, 
  "7eR3QevWrQAFyrtVpFksdA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan D.", 
    "review_text": "Pretty fun place for a drink, but not sure it beats the alternatives in the area.   We came by on a weeknight and ordered two pretty tasty gin and tonics- a little pricey but not outlandishly so.   The place is big and feels very plush- must be all the red velvet. It definitely looks like a \"Starlight Room\", I think I heard \"fun-bougie\" being thrown around.   The view is nice, although it can't quite compete with The View (the bar) down the street.  There were a good number of people there but its spread out enough not to feel cramped. Patrons seemed to be in the 30-40ish range.   We finished our drinks and were ready to head out when the waitress stopped by with two more cocktails on the house. I'm not sure what we did to deserve them (or who chose the drinks), but we were pretty jazzed (the Starlight Room demands words like \"jazzed\").   Mine was an appropriately cool old fashioned, my friend got something in a sugared martini glass that tasted like a snickerdoodle. We really enjoyed both- not sure how much of that was the free talking.  If I get comped drinks every time I come here this is a six star place, for now I'm leaving it at a solid three. It sounds like you have to see the Sunday performance to really experience the S-Room, so maybe I'll be back soon.", 
    "review_date": "2012-12-02"
  }, 
  "D9K_YU9k-sesZCEIDykBYw": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Mindy J.", 
    "review_text": "Despite the \"mature\" crowd and stodgy decor (including but not limited to the male employees in tuxes and women dressed like Vanna White a la Wheel of Fortune), my girlfriends and I had fun dancing the night away here. No lines and it helped that we were hotel guests... as guests we only paid $5 cover as opposed to $10. I think $10 is a little ridiculous for this \"club\" to charge. The dance floor is teeny tiny and despite them playing Top 40, it's not very hip -- their live band ran us off the dance floor a few times -- but I suppose the view is worth it.  Bonus? We all hit the sack at different times so it was really convenient to just take the elevator down to our rooms. Bottom line: If you're not staying here and you're under the age of 35, I wouldn't make this a destination, esp. if you're looking to get your groove on.   Minus stars for: -Price for what you get: drinks are rather expensive and watered down... 1 gimlet + 1 Ketel One Vodka Cranberry ran me $22!  -Older crowd (like 50+!) -Decor/live band", 
    "review_date": "2011-06-29"
  }, 
  "VZpzm3HG_YXPHvY97m05qg": {
    "user_rating": 5.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Denni P.", 
    "review_text": "What can I say except I never laugh out loud or LOL and I did this Sunday morning! What a fantastic performance, I had the time of my life.  We even met Harry and he is larger than life!   The food was very good, the service outstanding, but we didn't go for the food or service, that was an added bonus, we went for the performance and we will go back when we visit San Francisco again.  The performers were engaging, entertaining, talented and beautiful.  The majority of the patron's were women, stagette's, birthday's or celebrating something a special occasion.  Don't wait for a special occasion, take your lover, your best friend or your parents, it's a hoot!  Can't wait to go back!", 
    "review_date": "2012-11-22"
  }, 
  "qkreXL6AorI19QA3f2wvlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vira P.", 
    "review_text": "My roommate had her birthday brunch here (for the Sunday's a Drag show) and I thought it was a great way to celebrate!  The buffet brunch had a good selection.  There was bacon, salads, eggs benedict, potatoes, an omelet station, and mini pastries.  The drinks, unfortunately, were not a part of the deal.  The average price of a cocktail was $11.  And I thought the ladies rocked the show!  I wish it was longer.  As the hostess said, they've been doing the show for 8 years so they're doing something right.  I should mention that there were 13 of us, so we were charged with a 23% service fee.  I thought the standard was 18% for parties over 6... we didn't question it.  I do recommend this place, but be sure you have about 4 in your party.", 
    "review_date": "2014-07-07"
  }, 
  "94IbXzn6zlF7AIVntUlTkQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marianna P.", 
    "review_text": "This place scams their customers. I used my card to buy two drinks and even left a generous tip for the bartender, but when I looked at my bank statement, the charge was also 50 instead of 25.  Aside from that the crowd is not so interesting most of the time and there are a lot of tourists. It is very hot inside, though all this would be ok probably as long as they did not steal my money.", 
    "review_date": "2012-12-07"
  }, 
  "ivEzGpzPowGWSMjIn041vw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ross S.", 
    "review_text": "The Starlight Room reminds me of 38 year-old Texan women with bleached blond hair, bad make-up, a strong scent of cigarettes and cheap perfume, and a head full of memories from her glory days as a Senior when she led the cheer leading squad during the championship year.  Sure, she once succeeded and had her time in the sun-- who doesn't like a hot Texas cheerleader strutting her stuff on a winning team; the sex appeal is overwhelming-- but those times are past and so is the shiny veneer that came with it.   Enter Harry Denton's Starlight Room at the picturesque apex of the Sir Francis Drake Hotel (note: you could copy and paste this review and it would work perfectly for the SFD Hotel).  Adorned with photos of Harry himself, arm-in-arm which C-list celebrities who once frequented his nightclub and were so desperate for attention they braved the fabulously unhip locale of Union Square and the tourists that come with it, The Starlight Room is that cheerleader: head fully of glory, facade that was oh-so-pretty 20 years ago, and a flood of tourists coming to relive her past every night of every day since then.", 
    "review_date": "2010-01-06"
  }, 
  "Jl7wukjs3Y0WSQOQQ1vkgw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nei N.", 
    "review_text": "I came here to see Hubert Keller so I can't really say what it's like on a regular night. The venue itself is kind of small, but you do get spectacular views of the city, and the interior has a cool Art Deco style design. It was really nice to grab a table and enjoy the view and music. There weren't too many people so we were able to move around on the small dance floor also.  I really wasn't expecting Hubert Keller to be such an energetic DJ. He seemed so composed on Top Chef Masters, but the man behind Fleur de Lys knows how to party! He was fist pumping, clapping, dancing, and was just really getting into it. There also was a live saxophonist that played along with Keller's EDM set, which added a cool acoustic effect. His energy was infectious, and it looked like everyone had a good time. I know I did. Now I feel more inclined to try his restaurants.   I also want to apologize to the pretty, blonde waitress for questioning her about whether I got the correct drink. I feel like such a dick. Sorry.", 
    "review_date": "2013-03-08"
  }, 
  "Xb-HKe1tQHf3NloRZ61c8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theresa H.", 
    "review_text": "During the winter holidays, a group of us meet up at the Starlight Room to kick off our  Xmas season revelry. We sip champagne, down oysters, and dance the night away. And yes, the city views are amazing. The space is dark and the seating is cushy. It's a very sexy setting.   I've been to the SLR enough to say there is no one type of crowd that goes here. Oh wait, I take that back. I believe that the majority of the crowd have enough bank to afford the evening.", 
    "review_date": "2010-01-02"
  }, 
  "7kPR3NAhl72EGbUU1h9FOw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg F.", 
    "review_text": "I don't really care about the food or drink - the view is awesome, and it is a great place to go dancing.", 
    "review_date": "2014-03-21"
  }, 
  "KRD6DnENASTunFRbxPpS5w": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Blondie R.", 
    "review_text": "Loved this place!  Who doesn't love the Starlight Room?  I spent NYE here and had the best New Year's ever!  My friend Robert and I stayed in the hotel(Sir Francis Drake).  I got divorced and Robert is a really hot, funny guy who I met at a single's dance.  I love funny men and he makes me laugh!  He also has the best swagger!  I love to watch him walk!  My Fellow Good Yelp Ladies, you know what I'm talking about right?  A guy who can swagger has the shoulder and butt action going on!  Watch a a quarterback walk. That's a swagger.  Oh, so anyway, back to the Starlight Room!   Dinner was fabulous, and included a bottle of champagne.  Dessert was wonderful and our server gave us extra chocolate things!  The band was Club 90, and played great dance music. The view of the city was spectacular from the 21st floor of the hotel.  Happy New Year to All My Fellow Good Yelpers!", 
    "review_date": "2014-01-07"
  }, 
  "bPox6BywQJpLaTqQcvOV3g": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Steve M.", 
    "review_text": "This place was a life saver! I was in Frisco for 3 days during the week and had a hard time finding a club scene on a Wednesday night. This was probably the only place that was bumpin that day! Indulgence was what saved us. The place was a full blown dance club on a Wednesday night!  Other than the event, the place was really fancy! We only paid $10 cover and felt like we should have paid $30 or more. The dance floor was surrounded by a 180 degree view of the city, NICE! Coat check was free, but a tip was appreciated.  I had to give it 4 stars because the place did get very very crowed! The dance floor was impenetrable and still, more people were piling in.  If you don't mind a very crowded club, then this place is great, even on a Wednesday night!", 
    "review_date": "2011-03-27"
  }, 
  "ghaEnX_Wzc8Vfc1kVm_NAQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie B.", 
    "review_text": "Disclaimer: This is for the \"Sunday's a Drag\" brunch and not the evening festivities.  My first foray into drag shows, and I was definitely entertained!  Like many of the other recent reviewers, I was drawn in by the Groupon bargain.  Rather than being treated like second class patrons, the host courteously gave us a couple of options on seating for the brunch/show.  They manage to cram in more guests than you'd expect, but everyone seemed to have a decent view.  I'd recommend getting the earliest reservation available for your show, so you can leisurely enjoy your brunch prior to all the excitement.  Favorites among the cuisine included the omelet bar, carving station, vegetarian frittatas, and chocolate dipped strawberries.  Their drip coffee was also decent (always a plus).  The show was hilarious, and we especially enjoyed the drunken appearance of Judy Garland!  Minor drawbacks:  It happened to be a warm day and their air conditioning (or lack thereof) could not keep up.  The omelet chefs had a hard time keeping up-- they just needed another person, but they were all very friendly.", 
    "review_date": "2010-08-24"
  }, 
  "HMpS1FtXonXGp-bBjpeySQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lauren D.", 
    "review_text": "Dear Harry Denton,  I love you. There, I said it. I'm not so much *in* love with you, but I do love you.... Before you say anything, wouldn't you like to know why?!  Oh Harry, nobody throws a party like you! Your recent addition of \"Sunday's A Drag Brunch\" to the Starlight Room has made my partying life nearly complete. Now, If I could get my boobs to resemble those of Cassandra Cass from the show, well, I'd be set!  After a weekend of excessive partying in Fog City to celebrate one of my last nights out as a \"Single Lady\", my girlfriends and I settled in for a delicious brunch, and one of the BEST drag shows I've ever seen. I'm not sure what it is about Drag Queens, but I love them. Maybe it's all the work the girls put in to looking SO beautiful, the sheer showmanship of it all, or the fact that they just seem to LOVE to celebrate. And well, let's be honest, I WAS celebrating my last fling before that ring goes on for good!  The peach Bellinis flowed almost as well as the gowns, and the food was decadent. Fresh made omelets, juicy prime-rib, some of the best lox I've ever tasted, and brioche French toast to top it all off.   But you should know, I was sad to have missed you at this performance. I know you enjoy a visit on most Sunday's. I hope you don't mind, though, when a woman sitting near me asked if her mate would recognize you had you been there, I chimed in with, \"Oh, Mr. Denton is hard to miss. A fairly short and some-what stocky man with a great laugh, you'd know if he had been here...\" And I ended with a heavy sigh, because I did miss you.  I hope to see you soon, Harry!  With love and admiration,  Lady Lauren", 
    "review_date": "2012-09-17"
  }, 
  "h7Qb2VZwNstP84ntwfJJZQ": {
    "user_rating": 4.0, 
    "user_location": "Charlotte, NC", 
    "user_name": "Lucinda L.", 
    "review_text": "What a great time we had last Sunday at the Sunday's A Drag show in the Starlight Room at the Sir Francis Drake Hotel. The brunch buffet was well stocked and good quality and the drinks were well prepared. The fun drag  show was hosted by the very entertaining and very talented Donna Sachet. Ms. Sachet sings all her own songs (no lip syncing for her!) This is a perfect destination for locals and for visitors who what to have a bit of the San Francisco Drag Queen experience.", 
    "review_date": "2011-11-03"
  }, 
  "yydyomdMdpq0KlkjvVO6Ww": {
    "user_rating": 2.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Shannon K.", 
    "review_text": "While this place has a wonderful view, I don't think it is worth the cover charge, or the pretentious attitude from the guy at the door or the mystery man at the podium who decides if you get a table or not, to sit down. If you like snobby, pretentious, cheesy, and not sitting down when you are drinking and dancing, than this is your place. Personally, I used to like Harry Denton's when it was down by the Embarcadero. When it was there, it was more fun and more down to earth.", 
    "review_date": "2013-11-24"
  }, 
  "M7gGHFf369yjYFBGv9bgsg": {
    "user_rating": 1.0, 
    "user_location": "CA, CA", 
    "user_name": "C. K.", 
    "review_text": "I guess that the Starlight Room is doing very well financially because they don't seem to need any extra business.  I left a message for them to call me back because I was interested in planning a birthday party there.  I never got a call back.  When I decided to call again I talked to the manager and he finally got the guy who handles the private events on the phone for me.  The whole attitude turned me off.  Yes he answered my questions but I thought that he was going to fall asleep because he was so bored talking to me.  Needless to say I won't be going here.", 
    "review_date": "2012-01-06"
  }, 
  "NT8fCV65ipHfa00SlxtHEg": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Musenge L.", 
    "review_text": "I asked where the smoking section was and the pretentious door man that checked my ID said on the first floor on the side walk!  He could have said he don't have a smoking section instead of being such a smart a**.  The crowd consisted of sleazy guys that did not know when to stop staring and prostitutes...not like I have a problem with working girls..I just don't want to hanging out on their corner them.  It was fishy was poorly lit! This is what hell must be like! One plus was the view!!", 
    "review_date": "2011-04-30"
  }, 
  "_W5k3gq6VN-lKho9JNsVpw": {
    "user_rating": 3.0, 
    "user_location": "Rego Park, NY", 
    "user_name": "Yalla B.", 
    "review_text": "Bunch of old people behaving like teens grinding on each other. I was in shock. Only nice part is the views and the strong drinks. I think the staff should have controlled some of these people, especially the older lady who flashed everyone her genitals. I felt like I was at a comedy club the whole night watching old people get down to Rick Ross the boss. Not coming here again.", 
    "review_date": "2014-06-21"
  }, 
  "zqttuCEWI4-l4ZBCbfGk6A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon E.", 
    "review_text": "I can definitely see how someone would think that this place is a touch on the cheesy side, but there's something about it that I like. The views are amazing -- clearly the selling point here -- and the drinks and service are good. I really (really!) like how they lay out their menu, decade by decade, with drinks to match. It's a fun concept and the drinks that I've tried are definitely well executed. The overall vibe is kind of old school San Francisco with a little tourism factor, but there is live music in the evenings (at least on the weekends) which I find pretty fun! In terms of VIEWS,  I would take the Top of the Mark over Harry Denton's, but I think both provide pretty views for people visiting the city.", 
    "review_date": "2012-04-12"
  }, 
  "Yl51zC35TypS5n3k4vJVBg": {
    "user_rating": 1.0, 
    "user_location": "San Diego, CA", 
    "user_name": "C C.", 
    "review_text": "Wow. So rude and inconsiderate! I'm shocked. The owner/manager was defending his belligerently rude server. Can never come here again sadly.", 
    "review_date": "2014-02-13"
  }, 
  "cY_Yf-uMGW5meHtIyl5neA": {
    "user_rating": 3.0, 
    "user_location": "Bay Area", 
    "user_name": "Samantha C.", 
    "review_text": "Came here with my sissy for Sunday's a Drag ($44.95 per person, not including gratuity).  Made reservations for the 12PM show and brunch was served at 11AM.  Reservations are probably recommended since the place is somewhat small and most tables were filled up when we were there.    The starlight room itself was pretty and gaudy; old school like.  Tables were a bit close and space was cramped.  I was also a bit disappointed that I didn't really get to see the view since all the curtains were down.    Food itself was presented nicely, but it was just okay.  The buffet area was small and I wish they had a bigger selection.  They had an ommelette station, a carving station, and platters of french toast, eggs benedicts, chicken and waffles, pastries, fruits, sausages, bacon, and salads.  I know, listing it out sounds a lot, but it really wasn't     The show itself was quite entertaining and they really try to make you laugh.  Not sure if I'll come back though, trying it out once is kind of good enough for me.    20% gratuity will be included on your bill, regardless of party size.", 
    "review_date": "2013-07-30"
  }, 
  "abcHXT-6HatHmKmBdwkgyg": {
    "user_rating": 4.0, 
    "user_location": "Hayward, CA", 
    "user_name": "JOE M.", 
    "review_text": "What a fun place to have gone for a drink - beautiful open view - didn't see the sunset but I'll try it again during the summer time ..seats could be a bit more comfortable but the drinks and small apps were great.  The service was prompt and on point ....they do shows here but I was too hungry to hang out for that.", 
    "review_date": "2014-11-25"
  }, 
  "EYgUvu8gfXMguAxc8hNwjw": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Elise G.", 
    "review_text": "5 star view of Union Square and the City!  Worth the price of the cocktail alone!", 
    "review_date": "2013-11-11"
  }, 
  "CPl5ARtHgAeDJ0MHO4-zTw": {
    "user_rating": 4.0, 
    "user_location": "Smyrna, GA", 
    "user_name": "Steven W.", 
    "review_text": "My Wife and I came here on Friday maybe Thursday I cant really remember for a night topper. We entered and where greeted by a nice young man (Derek) who we later found out was the manager.  Anyway he sat us by a window near the dance floor. He asked if we had ever been to The Starlight Room. we told him no and that we where here from GA. He told us he was also from there and moved out here with his girl friend and they loved it here. He suggested the cougar trap for my wife (Maybe a prelude? lol) and a  Cable car for myself as well as telling us his favorite dish here being the Chicken &amp; waffles and the Mac &amp; Cheese. He was right on the money!!. We wondered about the room and it is a beauty!.  It has this old rat pack kinda style to it. lots of reds and the cocktails dresses wow!! Classy! our cocktail was wonderful! Then the DJ came on and it turned into a really cool funky nightclub.   The only reason I'm giving it 4 instead of 5 stars is cause the Mac and cheese came out not so hot. But here came Derek again to save the day!!. He apologized and assured us that it was unusual and that he would remedy it right away! He took it away somewhere and not 5 mins later was back with hot mac &amp; cheese.and cooked us a fresh batch himself (or so he said) now that is customer service!!", 
    "review_date": "2014-01-21"
  }, 
  "m4lfiT_qnxt9AsPigIriDA": {
    "user_rating": 5.0, 
    "user_location": "Victorville, CA", 
    "user_name": "Brianna D.", 
    "review_text": "I love this place the drinks were delicious.. I ordered the cats meow which was excellent it wasn't to strong and wasn't all watered down my boyfriend ordered the ghost machine which was pretty good as well.. The customer service was great.. There was a tall black gentleman at the door who I just fell in move with I can't think if his name at the moment but all in all I will return when I visit from Southern California again", 
    "review_date": "2014-07-11"
  }, 
  "M1tH_l8zFgTlmAmtKcJccQ": {
    "user_rating": 4.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Heather D.", 
    "review_text": "Came here with my BFF for some drinks with a view. The view is to die! So romantical! Definitely a great place for a date night (HINT, HINT) ;) We were seated at a table with the best view. It was so pretty!! They have drinks from way back in the 1800's. I am obsessed with the Old Hollywood era &amp; the history of this place fascinates me. The old Sinatra music they played was the icing on the cake.   We ordered our drinks &amp; because I can't stand the taste of alcohol I couldn't drink my drink so I ordered a glass of champagne. To our surprise a nice gentleman behind us with his wife bought our drinks. See,  this is why I love San Francisco so much... People are so nice!!!  Around 9:30 or 10 a DJ started to play some new &amp; old R&amp;B music &amp; we wanted to dance sooo bad. But we were not about to give up our seats lol It was packed for a Wednesday night I was surprised. The crowd was perfect not to many old people not to many young. It was a good mix. We both said we would come back again.", 
    "review_date": "2011-12-14"
  }, 
  "jpJcZxxHZamhGz1OWs3HPQ": {
    "user_rating": 4.0, 
    "user_location": "Westminster, CA", 
    "user_name": "Vivian L.", 
    "review_text": "Came here on Valentine's Day with my boyfriend.  We got here around 6:30pm, I want to say.  We didn't have a reservation or anything, so we just sat at the bar.    All the staff people were very nice!  The guy near the entrance was very kind and our bartender was just as kind.  I ordered the Chartreuse Swizzle and my boyfriend got the Highland Buck.  The bartender was crackin' jokes with us and was really nice when I was asking him questions about what alcohol he was pouring in our drinks.    He made us our drinks in a few minutes and I was excited to try my Chartreuse Swizzle cause I had no idea what it was haha.  And boy was I mildly disgusted.  My drink had Velvet Falernum ...which apparently is made up of a bunch of herbs and things.  You can definitely taste all the herbs.  It was kind of gross, but this was my fault for choosing something with Falernum alcohol.  I'd avoid it unless you like your drink tasting like grass &amp; herbs haha.  I drank it regardless, but I'd probably never get it again!   My boyfriend's drink was good.  There was nothing crazy in there and he liked it so it was a win.    We also ordered their chicken nuggets with honey mustard sauce.  They were delicious! Problem is they only give you 5 small ball-shaped nuggets (for $9 ._.)  I was a bit inebriated at this point from my herby drink and probably could have consumed more nuggets than I'd like to admit..but I stopped myself from ordering more haha.  After our nuggets, we moseyed on towards the dance floor where the view was.  It was a nice view.  I'd imagine sunset would be very nice here.  We didn't dance but we  watched people getting their groove on on the dance floor.    As we left, we saw that the guy near the entrance was charging a cover for entrance.  Not sure how much it was, but I guess if you get there early enough there's no cover!  I personally wouldn't want to come if there was a cover, but I had a really nice time, despite my poor choice in alcoholic beverage.", 
    "review_date": "2014-03-01"
  }, 
  "R0kmKT9hbEuzGRRRpHUGaA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alfonso L.", 
    "review_text": "WACK !!!!! I was there last night and pay for my drinks with a $100 bill and got $40 back on fake bills !!!!!! Wtf ??? Never going there again . It was dark for me to check my change . Thank you for nothing !!!!!!", 
    "review_date": "2013-12-29"
  }, 
  "GMY44WcTkOSIRR77SFsDCw": {
    "user_rating": 3.0, 
    "user_location": "Austin, TX", 
    "user_name": "paul s.", 
    "review_text": "great view from up there.  soundsystem had great sound and DJ played disco beats old and new.  the crowd here is a real mix of old and older and odd and odder, with a few hotel guests coming up for a nightcap.  we had two vocka and tonic, bartender suggested chopin potato vodka (they don't serve Tito's), $25 before tip....  but we knew we were paying for the view.", 
    "review_date": "2013-07-15"
  }, 
  "pZ_IdDsiXDx9jhaHhWfeYA": {
    "user_rating": 4.0, 
    "user_location": "Monterey, CA", 
    "user_name": "Matt A.", 
    "review_text": "Went here with some friends for a birthday trip in San Francisco. The view is great but it was hard to take any pictures from up there due to the loud speakers so you'll have to take my word for it. Drinks were expensive but the live band and DJ made the overall experience worth it. Better than any place in Monterey, that's for sure.   I'd love to visit in the day next time I'm in the city. Not a place to go to meet women. Starlight room is more of a date location. We had an expectation of dress code here, but people walked in in sandals and hooded sweatshirts... must be a California thing... I was slightly disappointed.  P.S. Don't expect a table unless you agree to a $300.00 bar tab!", 
    "review_date": "2011-03-17"
  }, 
  "AGraTma9eEgsiJFDIy6tbg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maile N.", 
    "review_text": "Finally!  After living in San Francisco for 5 years, I finally got to experience the bar/club of the (in)famous Harry Denton!  I can actually see the Starlight Room lights flashing from my place and have always been curious what it was like inside.  Last Saturday, we came here for a friend's birthday.  I looked at the drink menu online prior to arrival so I knew I wanted the drink called Devilish - a sweet combination of apple juice, vodka and ginger beer!  I quite liked it (although my bf thought the price of $10 was a little over-priced).  The entry cover was $10 too - we're not big club-goers, so oh well, we can stand to pay a bit of a cover every so often.    It was a hot day that day and with all the body heat and drinking, it was quite steamy in the Starlight Room.  We were tired and were getting slightly dehydrated so we headed out a little early.  Good times though and at least I finally got to experience this landmark bar &amp; club.  Happy Birthday, Susan!!  Saturday night cover = $10 Devilish drink = $10", 
    "review_date": "2009-09-28"
  }, 
  "_HmVfjZizikfli0zzBd2vg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "D B.", 
    "review_text": "Starlight just had a million dollar renovation and it is more lavish then ever.  Now the room matches the million dollar view.  The drinks are haute couture of the whole mixology trend and the decor is reminiscent of times past in the most opulent design. Sunset cocktails with tasty bar bites make for a very romantic date.   San Franciscans it is time to revisit Harry Denton's Starlight Room.", 
    "review_date": "2011-09-22"
  }, 
  "rXvsM4vsvrhmLKXu10HRbQ": {
    "user_rating": 3.0, 
    "user_location": "Munich, Germany", 
    "user_name": "Sam S.", 
    "review_text": "I went here with a friend for a drink and to check out the place and whilst I was impressed with the view I was disappointed with the fact that the place was full of blokes and not enough women. I was not out looking and besides I had my gorgeous friend with me who was attracting a lot of attention lol  The ambience here is nice and they charge a $5 cover charge and the drinks are super expensive like $12 for a gin and tonic. The dance floor has a beautiful view and mirrored ceiling and a disco ball which is cool. The DJ was ok but nothing exciting.   The place is a tad too dark for my liking  and once you start dancing you can feel the heat and I was sweating like crazy. They have a terrace but it was off limits and that made me feel claustrophobic.   I would probably come back here but given the choice I would go try other places first.", 
    "review_date": "2013-09-27"
  }, 
  "VGxBZA-2zJyaggTpHcQbkA": {
    "user_rating": 3.0, 
    "user_location": "Fairfield, CA", 
    "user_name": "CeeCee M.", 
    "review_text": "Eh...came here with a friend last Friday night. Got in for free because bouncer or hostess think I was hot. Anyways, when I got into the lounge, the first thing I got was a drink. Drinks are expensive but good. The music sucked!!! Wedding music??? Lol for instance Electric slide and 70s disco? I could see my filipino folks dancin into those music hahaha I was hoping that they play some Hiphop music to pop my booty on the dance floor :) also they played older music that reminded me from high school such as 50 cent \"in da club\" and seeing older people dancing into it. In addition, I believe that this lounge is more an older crowds since I have seen a lot of those mingling around. Therefore, not really my scene. Although, props for getting in for free and a table from that hostess or bouncer ;)", 
    "review_date": "2014-09-29"
  }, 
  "fSvOdnryI9FPJ2ylcsE2ig": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "FYI, they only allow one credit card per table. And there was a cockroach at our table. Wtf!", 
    "review_date": "2014-02-21"
  }, 
  "lTXvT7McgKpopTok7ogFzA": {
    "user_rating": 3.0, 
    "user_location": "Wanaque, NJ", 
    "user_name": "Wendy P.", 
    "review_text": "Great music. Very expensive drinks.", 
    "review_date": "2011-04-27"
  }
}